{
  "fuentes": [
    {
      "url": "https://goldcoasttouristparks.com.au/parks/ocean-beach",
      "email": "ocean@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/parks/burleigh-beach",
      "email": "burly@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/parks/main-beach",
      "email": "main@gctp.com.au"
    },
    {
      "url": "https://obeachibiza.com/blog/five-mins-with-co-founder-tony-truman/",
      "email": "reservations@obeachibiza.com"
    },
    {
      "url": "https://www.beachchalet.com/about-us",
      "email": "events@chaletrestaurants.com"
    },
    {
      "url": "https://www.beachchalet.com/about-us",
      "email": "info@beachchalet.com"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "burly@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "bwater@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "currigee@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "jacobs@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "kirra@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "main@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "ocean@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "tally@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "email": "tipplers@gctp.com.au"
    },
    {
      "url": "https://oceanpark.com.au/about-us/",
      "email": "info@oceanpark.com.au"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "aberdeenbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "chehalisbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "longbeachbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "oceanparkbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "raymondbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "burly@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "bwater@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "currigee@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "jacobs@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "kirra@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "main@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "ocean@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "tally@gctp.com.au"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "email": "tipplers@gctp.com.au"
    },
    {
      "url": "https://obeachibiza.com/blog/five-mins-duane-lineker/",
      "email": "reservations@obeachibiza.com"
    },
    {
      "url": "https://www.oceanbeach.co.uk/contact-us/",
      "email": "admin@oceanbeach.co.uk"
    },
    {
      "url": "https://www.parkvolusia.org/contact-us",
      "email": "citations@parkvolusia.org"
    },
    {
      "url": "https://www.parkvolusia.org/contact-us",
      "email": "hearings@parkvolusia.org"
    },
    {
      "url": "https://www.parkvolusia.org/contact-us",
      "email": "info@parkvolusia.org"
    },
    {
      "url": "https://www.parkvolusia.org/contact-us",
      "email": "permits@parkvolusia.org"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/parks/tallebudgera-creek",
      "email": "sunny-days-@-talle-creek-tourist-park.webp"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/parks/tallebudgera-creek",
      "email": "tally@gctp.com.au"
    },
    {
      "url": "https://ashoreresortoceancity.com/about-us/contact-us/",
      "email": "logo-new-dark@2x.png"
    }
  ],
  "mails": [
    "aberdeenbranchbookings@greatnwfcu.com",
    "admin@oceanbeach.co.uk",
    "burly@gctp.com.au",
    "bwater@gctp.com.au",
    "chehalisbranchbookings@greatnwfcu.com",
    "citations@parkvolusia.org",
    "currigee@gctp.com.au",
    "events@chaletrestaurants.com",
    "hearings@parkvolusia.org",
    "info@beachchalet.com",
    "info@oceanpark.com.au",
    "info@parkvolusia.org",
    "jacobs@gctp.com.au",
    "kirra@gctp.com.au",
    "logo-new-dark@2x.png",
    "longbeachbookings@greatnwfcu.com",
    "main@gctp.com.au",
    "ocean@gctp.com.au",
    "oceanparkbookings@greatnwfcu.com",
    "permits@parkvolusia.org",
    "raymondbranchbookings@greatnwfcu.com",
    "reservations@obeachibiza.com",
    "sunny-days-@-talle-creek-tourist-park.webp",
    "tally@gctp.com.au",
    "tipplers@gctp.com.au"
  ],
  "nombre_sitio": "goldcoasttouristparks.com.au",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://goldcoasttouristparks.com.au/parks/ocean-beach",
      "text": "Ocean Beach | Gold Coast Tourist Parks &ev=PageView&noscript=1\" /> Skip to Content This website uses modern construction techniques, which may not render correctly in your old browser. We recommend updating your browser for the best online experience. Visit browsehappy.com to help you select an upgrade. Don't miss out this September! Stay from just 2 nights* during the school holidays. > Book now Dismiss Toggle menu Book Now Park Finder Park Finder Browse all Gold Coast Tourist Parks and nearby attractions Pet Friendly Accommodation Find a home for you and your furry friend at a Gold Coast Tourist Park Jacobs Well Situated on the waterways of southern Moreton Bay, Jacobs Well is a tranquil retreat perfect for nature lovers and their pets. The park offers direct access to the water, making it an ideal spot for boating, fishing, and exploring nearby islands. Tipplers Campground Immerse yourself in the natural beauty of South Stradbroke Island at Tipplers Campground. Featuring beachfront campsites, comfortable shacks, and a licensed cafe, Tipplers offers the ultimate nature-based camping experience. North Currigee Campground North Currigee Campground is a peaceful, secluded retreat located on the Broadwater side of South Stradbroke Island. Featuring beachfront campsites, hot showers and picnic areas, North Currigee is the ideal destination to relax and unwind in nature. South Currigee Campground Experience the beauty of South Stradbroke Island from South Currigee. Whether you're looking to hit the surf, fish along the Broadwater, or just relax in nature, South Currigee has all the amenities needed for an one-of-a-kind, nature-based holiday. Broadwater Overlooking the Broadwater, Broadwater Tourist Park offers a relaxing atmosphere close to the excitement of the Gold Coast. Packed with facilities and family-friendly activities, the park offers a memorable holiday experience for everyone. Main Beach Located in the heart of Main Beach, this hidden gem is steps from beaches, cafes, and public transportation. Whether you're exploring the Gold Coast or unwinding at the beach, Main Beach offers the perfect balance for an unforgettable getaway. Ocean Beach Ocean Beach Tourist Park is a tranquil retreat in the heart of Miami. With beaches, cafés, shops, and restaurants just steps from the park, you can enjoy the best of both worlds—a quiet, coastal haven with the excitement of the Gold Coast nearby. Burleigh Beach Located in the heart of Burleigh Heads, Burleigh Beach Tourist Park offers a perfect blend of beachside relaxation and vibrant local culture. With its famous surf breaks, scenic walking tracks, it’s the ideal spot for an authentic Gold Coast holiday. Tallebudgera Creek Situated on the iconic Tallebudgera Creek, this family-friendly paradise offers adventure and relaxation for the whole family. With waterfront cabins, two swimming pools and tennis courts, this park offers an one-of-a-kind holiday experience. Kirra Beach Kirra Beach is pet friendly and located just steps from the iconic beaches of Kirra and Coolangatta. It's laid-back, coastal vibe and pet-friendly facilities make it ideal for families and pet owners. What's On Hot Deals Attractions Blog Contact Your browser does not support video. Visit browsehappy.com to help you select an upgrade. Welcome to Ocean Beach Tourist Park Park overview Accommodation Guest information Contact All Accommodation Book now 1 2 3 4 5 6 7 8 9 Previous Next Book Now 3 Bedroom Cabin Sleeps 9 No Dogs Bathroom Kitchen & Barbeque laundry-machine-2 Private Laundry ac-cool Air Conditioning Spacious and well equipped, all you need to bring is yourselves. more 1 2 3 4 5 6 7 8 9 10 Previous Next Book Now 2 Bedroom Ocean View Cabin Sleeps 5 No Dogs Ocean View Bathroom Kitchen & Barbeque ac-cool Air Conditioning Easy Access Cabin Available Sit on your own private balcony in the evening and watch the sun set over beautiful Miami beach. more 1 2 3 4 5 6 7 8 Previous Next Book Now Powered Site No Dogs Camp Kitchen Accessible Bathroom Sites with a concrete slab or synthetic turf. Suitable for vans, camper trailers, camper vans and tents more Book now Peaceful, secluded and convenient Ocean Beach Tourist Park is a tranquil retreat in the heart of Miami. With beaches, cafés, shops, and restaurants just steps from the park, you can enjoy the best of both worlds—a quiet, coastal haven with the excitement of the Gold Coast nearby. Beachside Accessible Features Ocean View Camp Kitchen View image gallery Accommodation at Ocean Beach Sites Cabins View all What's new The Great Thong Migration: Spring at Ocean Beach Blog Post The Great Thong Migration: Spring at Ocean Beach From frosty temps to flip flop fun! View The Great Thong Migration: Spring at Ocean Beach post Winter Waves & Cosy Stays at Ocean Beach Blog Post Winter Waves & Cosy Stays at Ocean Beach Why the Beach Is Better in Winter.... View Winter Waves & Cosy Stays at Ocean Beach post Santa Claus is coming to....Ocean Beach! Blog Post Santa Claus is coming to....Ocean Beach! May this Christmas and New Year bring us less stress, more fun, and good vibes. Here's to a calm and relaxing holidays. View Santa Claus is coming to....Ocean Beach! post Spring Holidays 2024 at Ocean Beach Blog Post Spring Holidays 2024 at Ocean Beach Get ready for an unforgettable September school holiday at Ocean Beach Tourist Park! View Spring Holidays 2024 at Ocean Beach post Winter 2024 at Ocean Beach Blog Post Winter 2024 at Ocean Beach Our winter faves return to the warmth once again View Winter 2024 at Ocean Beach post Have a Hoppy Easter at Ocean Beach Blog Post Have a Hoppy Easter at Ocean Beach An easy, breezy Easter here at Ocean Beach View Have a Hoppy Easter at Ocean Beach post What our guests are saying We had a group of us stay, 5 sites in total at Easter long weekend.\nStaff were amazing and very very easy to accommodate anything we needed, amenities were... Scruff Mcscruff The unit a very clean and you are right opposite to the beach. The staff are very friendly and walking distance to shops. expedia user Book now View park map Park Overview Light rail construction near Ocean Beach Construction works for the Gold Coast Light Rail Stage 3 are currently underway near Ocean Beach Tourist Park. During this time, guests may experience road closures and construction noise , including night and weekend works as crews progress through Miami and Burleigh Heads. For construction details and timelines, please visit the official project site . If you have any questions about your upcoming stay, please don’t hesitate to reach out to the our team. We're here to help! Contact us Our Location Ocean Beach Tourist Park is a hidden gem located right on the stunning beachfront of Miami. Surrounded by lush bushland and sheltered by the headland, the park offers a peaceful, intimate setting with everything you need for a laid-back holiday. Despite its tranquil vibe, you’re never far from the action—cafés, restaurants, public transport, and family-friendly spots are all close by. Whether you're here to unwind by the ocean or explore the coast, Ocean Beach gives you the best of both worlds! Stunning Beaches The beach is literally at your doorstep! Just a few steps from your site or cabin, you’ll find yourself on the pristine, patrolled shores of Miami Beach—perfect for families, morning swims, or sunset strolls. For breathtaking views, climb the iconic rainbow stairs to North Burleigh Lookout and take in the sweeping vistas of Burleigh Headland and the Surfers Paradise skyline. Want to explore more? The Oceanway coastal path runs right past the park, connecting you to 36 kilometres of stunning beaches, parks, cafés, and picnic spots. Walk or ride at your own pace and soak up the Gold Coast lifestyle. Local Experiences Ocean Beach is conveniently surrounded by fantastic local cafés and restaurants. Start your day with a beachside coffee, enjoy fresh local seafood for lunch, and wind down with a drink at one of the nearby bars. Just a short bike ride away is the vibrant Nobby Beach precinct, full of boutique shops, buzzing eateries, and laid-back hangouts. Guest favourites include the Miami Beach Surf Life Saving Club and the lively Miami Marketta —perfect for a night of food, music, and fun. Guest Information Activities Organised activities are offered in select periods. Information on upcoming activities is available from reception, via notice boards, guest notices and social media. Amenities Please refer to the site map for the location of amenity buildings. Hot water is available for showers, washing machines and basins. Please consider others, limit showers and help conserve water. The amenity blocks are cleaned at least twice a day and may be closed at these times. Please refer to the signs at each facility for cleaning hours, with other times as required. Children under 12 years old must be supervised by an adult. Bathrooms Accessible bathroom There is an accessible bathroom located on the reception side of the main amenity block. Access is with a pin code from reception. Parents’ bathroom A parents’ bathroom is located on the reception side of the main amenity block. Access is with a pin code from reception. Bikes, ride-on equipment and motorised toys For the safety and enjoyment of all guests, only standard bikes and scooters are allowed to be ridden in the park during daylight hours. Road rules must be observed and a safety helmet worn at all times, as required by Queensland law. See reception staff for approval of all other ride-on equipment and motorised toys, or for suggested locations to safely use these items. Boom gates Boom gates are for your security. Please follow directions and do not give your security pin to others. Cabin Care Please report all damage, breakages and losses promptly to our park reception. We ask you to please leave the accommodation in a clean and tidy state. Rubbish should be placed neatly in bins provided (in the accommodation and throughout the park). All washing up to be done and put away clean. Additional cleaning charges and full replacement costs may apply where furniture and equipment is not left as originally found or the accommodation condition on departure is unacceptable. Guests are responsible for the safekeeping and replacement of lost keys. Camp kitchen and barbeques The park map indicates location of the camp kitchen and barbeques. Please respect others, clean up after use and remove only your food from the fridge. Do not place water bottles or ice in the freezer or cooler bags in the fridge. Alcohol and medications are not allowed in the camp fridges and the camp kitchens are smoke-free environments. Check-in time Sites – 11am Cabins – 2pm Check-out time 10am Occupancy after this time will be charged as an additional day. Late check outs – depend on availability. See reception for fees and availability. Site fees are calculated until 10am on the day of departure. If your travel arrangements are inconvenienced by these times, please contact reception to see if alternative arrangements can be made. Chemical dump point A chemical toilet dump is provided in the park (refer to park map). Dumping of toilet waste in any other area of the park is strictly prohibited. Children Supervising children is vital for their safety and helps make sure they do not disturb other guests. Children under 12 years old must be accompanied by an adult when visiting the amenities and all other park facilities. Conditions of entry As part of the conditions of entry to our park, guests are to abide by Park Rules. These are available from reception or on our website Park Rules page. Customer feedback We hope you enjoy your stay and welcome your feedback which helps us continue to improve our service and facilities. Please share your experience with others by leaving a review on Tripadvisor or Google . Evacuation procedures In an emergency, follow the directions of staff. If we need to evacuate the park make your way directly to our evacuation area – marked ‘Assembly area’ on the map. Fees Fees must be paid in advance. Your unique boom gate code is for one vehicle only. Access is controlled by an Anti-Passback system and is subject to fees paid in advance. Garbage/litter Please help us look after our environment by using the rubbish and recycling bins located throughout the park for your convenience. Wrap all garbage prior to disposal. Information For local information, where to eat, activities, events, how to get around and service providers ask our friendly staff in reception. Items for hire See reception for information on items available for hire; including surf boards. Enquire with staff about local hire companies for other items if required. Kiosk The kiosk stocks a variety of grocery items, toiletries, milk, bread, ice, lollies, cold drinks, ice creams, beach items, etc. Daily Coffee Van visits during Queensland school holidays and long weekends. Laundry Laundry hours are 6am to 8.30pm. There are coin-operated machines and dryers in the main amenity block. They take $1 coins – change and washing powder is available from reception. Irons and ironing boards are free. Collect clothes from washing lines when dry and remove washing from machines when cycle finishes. Washing dishes is not permitted in the laundry, sinks are available at the barbeque area. Lost and found Report lost or found items immediately to reception. Mail Mail will be placed in mail boxes. Mail can be posted at reception. Noise Quiet time is between 9pm to 8am. Consider your neighbours by keeping the volume down on radios, televisions and social gatherings. Excessive noise or abusive language will not be tolerated and can result in guests or visitors being asked to leave immediately. Personal information We are required to comply with the Information Privacy Act 2009. Any information you have supplied to us is only used for the purpose that it was collected for. We will not disclose your personal information (including confirming whether or not you are staying in the park) to any person. Should anyone wish to visit you while you are staying in the park, we recommend you contact them to advise where you are located in the park, as we will not pass on this information. Pets For the comfort and safety of guests, pets are not permitted. Placement of caravans We will help you place your caravan on your site. To comply with fire regulations, all vans MUST have the drawbar facing toward the road. Public phone Located outside the park next to the surf club. Reception Current open hours are published on our website Contact page. For emergency assistance outside office hours, please use the emergency intercom located near the reception entrance door or contact park managers on phone number 07 5667 2716 . Refunds Cancellation fees apply. See reception for refund policy or view on our website Terms & Conditions page. Security We’d like your holiday to be enjoyable. Holidaying is a great time to get to know your neighbours and keep an eye out for each other’s belongings. Your security is important to us. We recommend you keep your possessions, vehicles and accommodation safely secured at all times. If you have any concerns, please speak to one of our friendly staff. Site cleanliness and boundaries Please keep your site tidy and use the facilities provided to dry clothes, discharge sullage water and dispose of rubbish. Make sure your caravan, car and camping equipment stay within your site boundaries. Ropes or fastenings must not be tied to trees, fences or park structures. It is your responsibility to position your camping equipment so that your vehicle fits on your site. If it doesn’t fit, it must be parked outside the park. Vehicles – drive with care The safety of all guests is vital. Please adhere to the eight-kilometre speed limit (walking pace) within the park. Park roads are shared zones. Please follow all road signage and give way to pedestrians. Site fees include one vehicle only. Additional vehicles can be parked in the visitors’ car park. Speak to reception for approval and cost of an additional vehicle on site. Water conservation Please conserve water by keeping your showers short and reporting leaking taps to our reception staff. Park Accessibility Ocean Beach Accessibility Guide We are committed to ensuring every guest can have a relaxing and enjoyable stay. We aim to welcome guests with the highest level of customer service and hospitality, regardless of their individual needs. Download Ocean Beach Accessibility Guide Reception The reception area is easily accessible by all guests. A ramp (1300mm wide) equipped with a handrail leads from the driveway up to automatic opening doors (900mm wide). Alternatively there is a RHS handrail for the 3 steps that also lead up to the reception entrance. The office is airconditioned and stocks most of your holiday necessities. Alfresco seating provides a great place to linger. Although the park is not pet friendly, service dogs are permitted with full documentation. Camp kitchen and laundry facilities The camp kitchen is the perfect meeting place within the park. This sheltered facility is accessible via the internal park roadway. Fully equipped features include electric barbeques, hot plates, hot water, sink, microwave, electric jug and toaster. The bench height is 900mm with barbeque height 970mm. Two large picnic tables (height 750mm) with bench seating are available. The table under cover has a 1m seat recess for wheelchair access. This spot is ideally positioned for sharing a meal with family and friends, whilst soaking up the amazing park atmosphere. It’s location is convenient to amenities and the Reception kiosk. There is ramp access to the park’s spacious laundry facility. The entry doorway clear opening width is 800mm. The entry door is manual opening with a handle. Height of the centre bench, sinks and ironing boards is 900mm. Bench space between the washing machines measures 1000mm high. Getting around the Park Mobility is made easy throughout the park grounds via the internal network of roads and pathways. These are suitable for users of wheelchairs, prams and mobility scooters. 2 Bedroom Ocean View Cabin – Easy Access Beach facing and boasting sea views, the 2 Bedroom Ocean View Cabin features an open plan living area and private patio. This cabin does not meet current fully accessible standards, however it does have ease of access features. Cabin Entry and Patio Car parking: 3300mm wide Entry ramp: 1140mm wide Cabin entry: 2 sliding glass doors each with a clear opening of 780mm and a 10mm threshold lip. Outdoor BBQ height: 890mm Outdoor sink height: 840mm Living and Kitchen Area Open plan living area and kitchen Kitchen bench height: 900mm Vinyl laminate flooring Bedroom and Bathroom Bedroom door: 780mm Bed height: 600mm Bathroom door: 880mm Toilet height: 490mm Shower space: 1160 x 120mm Grab rails, extendable shower head, lever operated taps, and fold down bench Easy Access Bathroom Facility An accessible bathroom facility is situated on the reception side of the park’s main amenity block. The doorway clear opening width is 880mm and the floor space is 2m x 1.9m. Features include a tiled floor, hand rails, hand held flexible shower rose and a fold down bench seat. Basin height is 790mm. Access is with a pin code from reception. Beach access and other information Beach access is via the keypad gate at the back of the park (eastern side). Within the park an accessible pathway (1170mm wide) leads to the gate which has a clear opening width of 970mm. Beyond this, the pedestrian crossing leads to the patrolled beach. The Miami beachfront footpath stretches 1km and is mainly level. Pop in for a refreshment at the café beside the Surf Lifesaving Club and soak up the inspiring views. City of Gold Coast Mobility Maps The City’s mobility maps are designed to provide accessibility information to assist residents and visitors to plan their stay and move around the city safely. Map information includes the location of accessible toilets, change facilities, accessible car parking spaces, pathway gradients, location of kerb ramps and key buildings and services. Transport information for light rail stations, bus stops and bus routes is also featured. Printed and electronic mobility maps are now available for Broadbeach, Burleigh Heads, Surfers Paradise, Southport Central Business District (CBD) and Broadwater Parklands. Visit cityofgoldcoast.com.au/mobilitymaps for more information. Facilities Accessible bathroom Accessible options Amenities Barbeque facilities Cabins air conditioned Cabin Easy Access Cabins self-contained Camp Kitchen Dump point Kiosk / Store Laundry Ocean views Parents bathroom Patrolled beach nearby Surf beach opposite Gallery Book now Contact Ocean Beach Phone 1300 672 710 Email ocean@gctp.com.au Reception hours 8:00am to 6:00pm — Monday-Friday 9:00am to 5:00pm — weekends and public holidays, Christmas day closed Stay in touch Stay in that holiday mood all year round. \nSign up below for our latest holiday deals & offers to your inbox… My Name My Email My Postcode Find us here too Follow us on Facebook Follow us on Instagram Follow us on YouTube What our guests are saying Peta Lee Holterman Jacobs Well Lovely spot, nice and clean, very friendly staff. will definitely be coming again. Kate Murray Tallebudgera Creek Loved it. The location is spectacular and the staff are super friendly and helpful. The cabin was clean and had everything needed. We'll be back next year! Paula Bent Jacobs Well FANTASTIC  little CV park Sooo close to Gold C and Sunshine C. New amenities , great staff very helpful 10 out of 10 close to everything you need , pet... Our Parks Jacobs Well Tourist Park Tipplers Campground South Stradbroke Island North Currigee Campground South Stradbroke Island South Currigee Campground South Stradbroke Island Broadwater Tourist Park Main Beach Tourist Park Ocean Beach Tourist Park Burleigh Beach Tourist Park Tallebudgera Creek Tourist Park Kirra Beach Tourist Park Looking For Park Finder What's On Hot Deals Attractions Blog Contact Us About Us Careers Accessibility Guides Pet Friendly Guidelines Campfire Guidelines Park Rules Terms & Conditions FAQs Gold Coast Tourist Parks acknowledges the Traditional Custodians of the land and waterways on which our tourist parks operate. We pay our respects to Aboriginal and Torres Strait Islander Elders past, present and future. © 2021  - 2025 Gold Coast Tourist Parks.\nAll rights reserved. Sitemap Privacy Policy Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/parks/burleigh-beach",
      "text": "Burleigh Beach | Gold Coast Tourist Parks &ev=PageView&noscript=1\" /> Skip to Content This website uses modern construction techniques, which may not render correctly in your old browser. We recommend updating your browser for the best online experience. Visit browsehappy.com to help you select an upgrade. Don't miss out this September! Stay from just 2 nights* during the school holidays. > Book now Dismiss Toggle menu Book Now Park Finder Park Finder Browse all Gold Coast Tourist Parks and nearby attractions Pet Friendly Accommodation Find a home for you and your furry friend at a Gold Coast Tourist Park Jacobs Well Situated on the waterways of southern Moreton Bay, Jacobs Well is a tranquil retreat perfect for nature lovers and their pets. The park offers direct access to the water, making it an ideal spot for boating, fishing, and exploring nearby islands. Tipplers Campground Immerse yourself in the natural beauty of South Stradbroke Island at Tipplers Campground. Featuring beachfront campsites, comfortable shacks, and a licensed cafe, Tipplers offers the ultimate nature-based camping experience. North Currigee Campground North Currigee Campground is a peaceful, secluded retreat located on the Broadwater side of South Stradbroke Island. Featuring beachfront campsites, hot showers and picnic areas, North Currigee is the ideal destination to relax and unwind in nature. South Currigee Campground Experience the beauty of South Stradbroke Island from South Currigee. Whether you're looking to hit the surf, fish along the Broadwater, or just relax in nature, South Currigee has all the amenities needed for an one-of-a-kind, nature-based holiday. Broadwater Overlooking the Broadwater, Broadwater Tourist Park offers a relaxing atmosphere close to the excitement of the Gold Coast. Packed with facilities and family-friendly activities, the park offers a memorable holiday experience for everyone. Main Beach Located in the heart of Main Beach, this hidden gem is steps from beaches, cafes, and public transportation. Whether you're exploring the Gold Coast or unwinding at the beach, Main Beach offers the perfect balance for an unforgettable getaway. Ocean Beach Ocean Beach Tourist Park is a tranquil retreat in the heart of Miami. With beaches, cafés, shops, and restaurants just steps from the park, you can enjoy the best of both worlds—a quiet, coastal haven with the excitement of the Gold Coast nearby. Burleigh Beach Located in the heart of Burleigh Heads, Burleigh Beach Tourist Park offers a perfect blend of beachside relaxation and vibrant local culture. With its famous surf breaks, scenic walking tracks, it’s the ideal spot for an authentic Gold Coast holiday. Tallebudgera Creek Situated on the iconic Tallebudgera Creek, this family-friendly paradise offers adventure and relaxation for the whole family. With waterfront cabins, two swimming pools and tennis courts, this park offers an one-of-a-kind holiday experience. Kirra Beach Kirra Beach is pet friendly and located just steps from the iconic beaches of Kirra and Coolangatta. It's laid-back, coastal vibe and pet-friendly facilities make it ideal for families and pet owners. What's On Hot Deals Attractions Blog Contact Your browser does not support video. Visit browsehappy.com to help you select an upgrade. Welcome to Burleigh Beach Tourist Park Park overview Accommodation Guest information Contact All Accommodation Book now 1 2 3 4 5 6 7 8 9 Previous Next Book Now 2 Bedroom Deluxe Cabin Sleeps 8 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning Luxury and spacious living over two storeys with your own private laundry. more 1 2 3 4 5 6 7 8 Previous Next Book Now 2 Bedroom Superior Cabin Sleeps 5 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning And only a stroll across to the surf beach! more 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Previous Next Book Now 2 Bedroom Accessible Cabin Sleeps 4 No Dogs Fully Accessible Accessible Bathroom Kitchen & Barbeque ac-cool Air Conditioning This fully accessible cabin features a ramp leading to the front door. more 1 2 3 4 5 6 7 Previous Next Book Now 2 Bedroom Cabin Sleeps 4 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning Nestled into the side of the hill, these cabins offer privacy while still enjoying the buzz of the tourist park. more 1 2 3 4 5 Previous Next Book Now Powered Site No Dogs Camp Kitchen Park Barbeques Accessible Bathroom Varying sizes and configurations, suitable for vans, camper trailers, camper vans and tents. more Book now The very best of Burleigh Located in the heart of Burleigh Heads, Burleigh Beach Tourist Park offers a perfect blend of beachside relaxation and vibrant local culture. With its famous surf breaks, scenic walking tracks, it’s the ideal spot for an authentic Gold Coast holiday. Beachside Accessible Features Camp Kitchen Hiking Barbeques View image gallery Accommodation at Burleigh Beach Cabins Sites Accessible View all What's new 'Spring' back into the holidays at Burleigh Beach Tourist Park this September! Events 'Spring' back into the holidays at Burleigh Beach Tourist Park this September! Winter is over and the temperature is rising so lets see what the school holidays have in store View 'Spring' back into the holidays at Burleigh Beach Tourist Park this September! post Come and find the sun at Burleigh Beach Tourist Park this Winter! Events Come and find the sun at Burleigh Beach Tourist Park this Winter! Tired of the cold weather already? Don't worry, the sun is shining at Burleigh Beach! View Come and find the sun at Burleigh Beach Tourist Park this Winter! post Let's get ready for the Easter Bunny at Burleigh Beach Tourist Park 2025 Events Let's get ready for the Easter Bunny at Burleigh Beach Tourist Park 2025 Let's gett 'Egg'cited for the Easter School Holidays View Let's get ready for the Easter Bunny at Burleigh Beach Tourist Park 2025 post Find your next adventure in 2025 right here on the Gold Coast Travel Tips Find your next adventure in 2025 right here on the Gold Coast It's a New Year so lets get out there and enjoy all that the Gold Coast has to offer right on the door step at Burleigh Beach Tourist Park! View Find your next adventure in 2025 right here on the Gold Coast post Burleigh Beach Tourist Park Christmas & New Year Activity Planner Events Burleigh Beach Tourist Park Christmas & New Year Activity Planner Lets get ready for Christmas 2024 at Burleigh Beach Tourist Park! View Burleigh Beach Tourist Park Christmas & New Year Activity Planner post Have a Holly Jolly Christmas with us at Burleigh Beach Tourist Park Events Have a Holly Jolly Christmas with us at Burleigh Beach Tourist Park Let's get ready for some fun this Christmas holiday season at Burleigh Beach Tourist Park View Have a Holly Jolly Christmas with us at Burleigh Beach Tourist Park post What our guests are saying The only thing that we had a problem with was the Barbque did not work. Otherwise, everything was great! Leisa Staff and management are absolutely lovely Liam Chrom Book now View park map Park Overview Our Location Camping in Burleigh Heads has been a beloved tradition since the early 1900s, and it’s easy to see why. Located right in the heart of Burleigh, our park puts you just steps from stunning beaches, iconic surf breaks, and the lush trails of Burleigh Head National Park. With boutique bars, local clubs, markets, and a buzzing dining scene all within walking distance, you’ll feel the beachside village vibe from the moment you arrive. It’s the kind of place where you can park the car and forget about it - everything you need is right here! World-Class Surf Breaks Burleigh is part of the World Surfing Reserve, and it’s a dream destination for surfers of all levels. Experienced riders will love the northern point break, while the open beaches offer great conditions for beginners and intermediates. No gear? No worries. Third Ave Beach Hire has you covered, delivering surfboards and beach essentials to the park. Natural Areas Burleigh Hill offers panoramic views of the surf and skyline. It’s also a perfect picnic spot, with BBQs and a playground for the kids. Just 400m from the park entrance, explore the scenic coastal trails and rainforest paths of Burleigh Head National Park . In winter and spring, keep an eye out for whales cruising along the Humpback Highway. Follow the trail around the headland to Tallebudgera Creek - a calm, sparkling haven ideal for swimming and family fun. Local Experiences Just 500m away, the James Street precinct is a local favourite, offering European-style cafés, modern eateries, boutique shopping, and lively bars. For a relaxed meal with a local twist, visit the Burleigh Bowls Club or Surf Life Saving Club - both are full of character and community spirit. Want something unique? Explore nearby gems like Currumbin Wildlife Sanctuary or the Jellurgal Aboriginal Cultural Centre . There’s something nearby for every age and interest. Guest Information Activities Organised activities are offered in select periods. Information on upcoming activities is available from reception, via notice boards, guest notices and social media. Amenities Please refer to the site map for the location of amenity buildings. Hot water is available for showers, washing machines and basins. Please consider others, limit showers and help conserve water. The amenity blocks are cleaned at least twice a day and may be closed at these times. Please refer to the signs at each facility for cleaning hours, with other times as required. Children under 12 years old must be supervised by an adult. Bathrooms Accessible bathroom There is an accessible bathroom located at the amenities block. Access is with a pin code from reception. Parents’ bathroom A parents’ bathroom is located at the amenities block. Access is with a pin code from reception. Bikes, ride-on equipment and motorised toys For the safety and enjoyment of all guests, only standard bikes and scooters are allowed to be ridden in the park during daylight hours. Road rules must be observed and a safety helmet worn at all times, as required by Queensland law. See reception staff for approval of all other ride-on equipment and motorised toys, or for suggested locations to safely use these items. Boom gates Boom gates are for your security. Please follow directions and do not give your security pin to others. Cabin Care Please report all damage, breakages and losses promptly to our park reception. We ask you to please leave the accommodation in a clean and tidy state. Rubbish should be placed neatly in bins provided (in the accommodation and throughout the park). All washing up to be done and put away clean. Additional cleaning charges and full replacement costs may apply where furniture and equipment is not left as originally found or the accommodation condition on departure is unacceptable. Guests are responsible for the safekeeping and replacement of lost keys. Camp kitchen and barbeques The park map indicates location of the camp kitchen and barbeques. Please respect others, clean up after use and remove only your food from the fridge. Do not place water bottles or ice in the freezer or cooler bags in the fridge. Alcohol and medications are not allowed in the camp fridges and the camp kitchens are smoke-free environments. Car wash Guests are permitted to wash cars on site. Please check with reception for current water restrictions. The closest car wash is on Reedy Creek Road. Check-in time Sites – 11am Cabins – 2pm Check-out time 10am Occupancy after this time will be charged as an additional day. Late check outs – depend on availability. See reception for fees and availability. Site fees are calculated until 10am on the day of departure. If your travel arrangements are inconvenienced by these times, please contact reception to see if alternative arrangements can be made. Children Supervising children is vital for their safety and helps make sure they do not disturb other guests. Children under 12 years old must be accompanied by an adult when visiting the amenities and all other park facilities. Conditions of entry As part of the conditions of entry to our park, guests are to abide by Park Rules. These are available from reception or on our website Park Rules page. Customer feedback We hope you enjoy your stay and welcome your feedback which helps us continue to improve our service and facilities. Please share your experience with others by leaving a review on Tripadvisor or Google . Evacuation procedures In an emergency, follow the directions of staff. If we need to evacuate the park make your way directly to our evacuation area – marked ‘Assembly area’ on the map. Fees Fees must be paid in advance. Your unique boom gate code is for one vehicle only. Access is controlled by an Anti-Passback system and is subject to fees paid in advance. Garbage/litter Please help us look after our environment by using the rubbish and recycling bins located throughout the park for your convenience. Wrap all general waste prior to disposal. Please do not place plastic bags in the the recycling bins. Information For local information, where to eat, activities, events, how to get around and service providers ask our friendly staff in reception. Kiosk The kiosk stocks a small variety of grocery items, toiletries, milk, lollies, cold drinks and ice creams. Ice also available. Laundry The laundry is open from 7:30am to 8:30pm daily. There are coin-operated machines and dryers in the main amenity blocks. They take $1 coins – change and washing powder is available from reception. Irons and ironing boards are free. Collect clothes from washing lines when dry and remove washing from machines when cycle finishes. Washing dishes is not permitted in the laundry, sinks are available at the camp kitchen. Lost and found Report lost or found items immediately to reception. Mail Mail will be placed in mail boxes. Mail can be posted at reception. Noise Quiet time is between 9pm to 8am. Consider your neighbours by keeping the volume down on radios, televisions and social gatherings. Excessive noise or abusive language will not be tolerated and can result in guests or visitors being asked to leave immediately. Personal information We are required to comply with the Information Privacy Act 2009. Any information you have supplied to us is only used for the purpose that it was collected for. We will not disclose your personal information (including confirming whether or not you are staying in the park) to any person. Should anyone wish to visit you while you are staying in the park, we recommend you contact them to advise where you are located in the park, as we will not pass on this information. Pets For the comfort and safety of guests, pets are not permitted. Placement of caravans We will help you place your caravan on your site. To comply with fire regulations, all vans MUST have the drawbar facing toward the road. Reception Current open hours are published on our website Contact page. For emergency assistance outside office hours, please use the emergency intercom located near the reception entrance door or contact park managers on phone number 07 5667 2750 . Recreation room The recreation room is located next to reception and is open from 7:30am to 8:30pm daily. Facilities include TV with free to air channels and coin operated gaming machines. Children under 12 years old must be supervised by an adult. Refunds Cancellation fees apply. See reception for refund policy or view on our website Terms & Conditions page. Security We’d like your holiday to be enjoyable. Holidaying is a great time to get to know your neighbours and keep an eye out for each other’s belongings. Your security is important to us. We recommend you keep your possessions, vehicles and accommodation safely secured at all times. If you have any concerns, please speak to one of our friendly staff. Site cleanliness and boundaries Please keep your site tidy and use the facilities provided to dry clothes, discharge sullage water and dispose of rubbish. Make sure your caravan, car and camping equipment stay within your site boundaries. Ropes or fastenings must not be tied to trees, fences or park structures. It is your responsibility to position your camping equipment so that your vehicle fits on your site. If it doesn’t fit, it must be parked outside the park. Vehicles – drive with care The safety of all guests is vital. Please adhere to the eight-kilometre speed limit (walking pace) within the park. Park roads are shared zones. Please follow all road signage and give way to pedestrians. Site fees include one vehicle only. Additional vehicles can be parked in the visitors’ car park. Speak to reception for approval and cost of an additional vehicle on site. Water conservation Please conserve water by keeping your showers short and reporting leaking taps to our reception staff. Park Accessibility Burleigh Beach Accessibility Guide We are committed to ensuring every guest can have a relaxing and enjoyable stay. We aim to welcome guests with the highest level of customer service and hospitality, regardless of their individual needs. Download Burleigh Beach Accessibility Guide Parking We have two designated accessible parking spaces out the front of reception, for ease of check-in or visiting the reception or kiosk. These uncovered car spaces are marked with an “NP” and are conveniently located near the ramp access leading to the door. Reception A ramp located adjacent to the parking area provides easy access to reception via an automatic entry door. There is sufficient space for mobility both indoors and outside the office. Outdoor undercover seating is available. Reception hours are 8am to 6pm Monday-Friday and 9am to 5pm Saturday-Sunday, with a resident manager available for emergencies after hours. Recreational Areas For social gatherings and activities, guests may relax in the recreation room. Comfortable lounge seating, chairs, tables, pool table, arcade games and television are available at this indoor space. Accessible features include a clear accessible path, wide entrance-way, flat level surface and spacious layout. An outdoor barbeque facility is centrally located in the park grounds. Accessible pathways lead guests to a level area suitable for wheelchairs and prams. This is the perfect venue to share in a barbeque meal with family and friends, or soak up the atmosphere of the park whilst watching those at play on the grassed area. Getting around the Park Mobility is made easy throughout the park grounds via the internal road network and pathways leading to facilities. Park roadways are suitable for users of wheelchairs, prams and mobility scooters. At the boomgate entrance to the Park, a pathway with a smooth, level surface, provides safe access to the Park grounds. Sites Some camping sites have 100mm curved guttering but we also have sites with no guttering. Guests to please check with reception when making a booking. Accessible Bathroom Facility Accessible bathroom facilities are provided within the Park, for guests who are camping and their visitors. The doorway is 850mm wide (with keypad entry) and the floor area of the room is 3.6m x 3.5m. The room has a level surface with nonslip tiles, a shower with shower seat, handrails and a hand held flexible shower rose, bench seat, sink and toilet with handrails. 2 Bedroom Accessible Cabin Cabin 10 is our 2 Bedroom Accessible Cabin , inclusive of a ramp leading to the front door. The open plan design enables comfortable wheelchair mobility throughout. Cabin features include bedding for up to four people with two queen beds, bathroom with grab rails and wide door opening, air conditioning and open plan layout. Ramp: 1m wide Main glass sliding door: 900mm wide Main bedroom door: 900mm wide Bathroom door: 900mm wide Veranda Size: 1.9m wide x 6.5m long Access to Burleigh Beach An all-terrain beach wheel chair is available for guests to use, free of charge. Accessible beach matting is also provided by the Surf Club at Burleigh Beach surf directly opposite the park, making it accessible to everyone to enjoy full beach access. Currently available on Saturday mornings with free loan of a Mobi-Chair floating wheelchair or Hippocampe beach wheelchair, this can be organised through the Burleigh Heads Mowbray Park SLSC. Accessible bathroom facilities are also available within the SLSC. Click here to visit the SLSC website. Click here for information on other City of Gold Coast accessible beach locations. City of Gold Coast Mobility Maps The City’s mobility maps are designed to provide accessibility information to assist residents and visitors to plan their stay and move around the city safely. Map information includes the location of accessible toilets, change facilities, accessible car parking spaces, pathway gradients, location of kerb ramps and key buildings and services. Transport information for light rail stations, bus stops and bus routes is also featured. Printed and electronic mobility maps are now available for Broadbeach, Burleigh Heads, Surfers Paradise, Southport Central Business District (CBD) and Broadwater Parklands. Visit cityofgoldcoast.com.au/mobilitymaps for more information. Facilities Accessible accommodation Accessible bathroom Accessible options Barbeque facilities Cabin Accessible Cabins air conditioned Cabins self-contained Camp Kitchen Dump point Kiosk / Store Laundry Parents bathroom Patrolled beach nearby Recreation Room Surf beach opposite Gallery Upcoming events September 11th, 2025 8:30am - 1:30pm Urway Acai & coffee food truck View Urway Acai & coffee food truck September 13th, 2025 2:00pm - 2:30pm Gold Coast Seafood Markets - Mr Fishy Seafood Truck View Gold Coast Seafood Markets - Mr Fishy Seafood Truck September 20th, 2025 12:00am - 11:59pm Colouring In Comp View Colouring In Comp September 21st, 2025 12:00am - 11:59pm Find the Koala View Find the Koala September 22nd, 2025 10:00am - 11:00am Cup Cake Decorating View Cup Cake Decorating Book now Contact Burleigh Beach Phone 1300 672 750 Email burly@gctp.com.au Reception hours 8:00am to 6:00pm — Monday-Friday 9:00am to 5:00pm — weekends and public holidays, Christmas day closed Stay in touch Stay in that holiday mood all year round. \nSign up below for our latest holiday deals & offers to your inbox… My Name My Email My Postcode Find us here too Follow us on Facebook Follow us on Instagram Follow us on YouTube What our guests are saying Peta Lee Holterman Jacobs Well Lovely spot, nice and clean, very friendly staff. will definitely be coming again. Kate Murray Tallebudgera Creek Loved it. The location is spectacular and the staff are super friendly and helpful. The cabin was clean and had everything needed. We'll be back next year! Paula Bent Jacobs Well FANTASTIC  little CV park Sooo close to Gold C and Sunshine C. New amenities , great staff very helpful 10 out of 10 close to everything you need , pet... Our Parks Jacobs Well Tourist Park Tipplers Campground South Stradbroke Island North Currigee Campground South Stradbroke Island South Currigee Campground South Stradbroke Island Broadwater Tourist Park Main Beach Tourist Park Ocean Beach Tourist Park Burleigh Beach Tourist Park Tallebudgera Creek Tourist Park Kirra Beach Tourist Park Looking For Park Finder What's On Hot Deals Attractions Blog Contact Us About Us Careers Accessibility Guides Pet Friendly Guidelines Campfire Guidelines Park Rules Terms & Conditions FAQs Gold Coast Tourist Parks acknowledges the Traditional Custodians of the land and waterways on which our tourist parks operate. We pay our respects to Aboriginal and Torres Strait Islander Elders past, present and future. © 2021  - 2025 Gold Coast Tourist Parks.\nAll rights reserved. Sitemap Privacy Policy Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/parks/main-beach",
      "text": "Main Beach | Gold Coast Tourist Parks &ev=PageView&noscript=1\" /> Skip to Content This website uses modern construction techniques, which may not render correctly in your old browser. We recommend updating your browser for the best online experience. Visit browsehappy.com to help you select an upgrade. Don't miss out this September! Stay from just 2 nights* during the school holidays. > Book now Dismiss Toggle menu Book Now Park Finder Park Finder Browse all Gold Coast Tourist Parks and nearby attractions Pet Friendly Accommodation Find a home for you and your furry friend at a Gold Coast Tourist Park Jacobs Well Situated on the waterways of southern Moreton Bay, Jacobs Well is a tranquil retreat perfect for nature lovers and their pets. The park offers direct access to the water, making it an ideal spot for boating, fishing, and exploring nearby islands. Tipplers Campground Immerse yourself in the natural beauty of South Stradbroke Island at Tipplers Campground. Featuring beachfront campsites, comfortable shacks, and a licensed cafe, Tipplers offers the ultimate nature-based camping experience. North Currigee Campground North Currigee Campground is a peaceful, secluded retreat located on the Broadwater side of South Stradbroke Island. Featuring beachfront campsites, hot showers and picnic areas, North Currigee is the ideal destination to relax and unwind in nature. South Currigee Campground Experience the beauty of South Stradbroke Island from South Currigee. Whether you're looking to hit the surf, fish along the Broadwater, or just relax in nature, South Currigee has all the amenities needed for an one-of-a-kind, nature-based holiday. Broadwater Overlooking the Broadwater, Broadwater Tourist Park offers a relaxing atmosphere close to the excitement of the Gold Coast. Packed with facilities and family-friendly activities, the park offers a memorable holiday experience for everyone. Main Beach Located in the heart of Main Beach, this hidden gem is steps from beaches, cafes, and public transportation. Whether you're exploring the Gold Coast or unwinding at the beach, Main Beach offers the perfect balance for an unforgettable getaway. Ocean Beach Ocean Beach Tourist Park is a tranquil retreat in the heart of Miami. With beaches, cafés, shops, and restaurants just steps from the park, you can enjoy the best of both worlds—a quiet, coastal haven with the excitement of the Gold Coast nearby. Burleigh Beach Located in the heart of Burleigh Heads, Burleigh Beach Tourist Park offers a perfect blend of beachside relaxation and vibrant local culture. With its famous surf breaks, scenic walking tracks, it’s the ideal spot for an authentic Gold Coast holiday. Tallebudgera Creek Situated on the iconic Tallebudgera Creek, this family-friendly paradise offers adventure and relaxation for the whole family. With waterfront cabins, two swimming pools and tennis courts, this park offers an one-of-a-kind holiday experience. Kirra Beach Kirra Beach is pet friendly and located just steps from the iconic beaches of Kirra and Coolangatta. It's laid-back, coastal vibe and pet-friendly facilities make it ideal for families and pet owners. What's On Hot Deals Attractions Blog Contact Your browser does not support video. Visit browsehappy.com to help you select an upgrade. Welcome to Main Beach Tourist Park Park overview Accommodation Guest information Contact All Accommodation Book now 1 2 3 4 5 6 7 8 Previous Next Book Now 3 Bedroom Cabin Sleeps 9 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning Ideal for larger families, or those needing more room to bring friends or the grand-parents. more 1 2 3 4 5 6 7 8 Previous Next Book Now 2 Bedroom Superior Cabin 5-berth Sleeps 5 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning Enjoy the peaceful garden outlook with your own private barbecue on the balcony. more 1 2 3 4 5 6 7 8 Previous Next Book Now 2 Bedroom Superior Cabin 6-berth Sleeps 6 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning Spacious and modern, these superior cabins have everything you need for a relaxing get-away. more 1 2 3 4 5 6 7 8 9 10 11 12 13 14 Previous Next Book Now 2 Bedroom Cabin Sleeps 4 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning Comfort and privacy while still being able to take advantage of the exciting park life including a heated swimming pool and kids play area. more 1 2 3 4 Previous Next Book Now Studio Cabin Sleeps 3 No Dogs Ensuite Kitchenette ac-cool Air Conditioning More space and comfort than a tent or caravan with the convenience of an ensuite and self-contained facilities more 1 2 3 4 5 6 Previous Next Book Now Accessible Studio Cabin Sleeps 3 No Dogs Fully Accessible Ensuite Kitchenette ac-cool Air Conditioning The open plan design enables comfortable wheelchair mobility throughout. more 1 2 3 4 Previous Next Book Now Ensuite Powered Site No Dogs Private Bathroom Camp Kitchen Park Barbeques Private bathroom facility on site with shower, toilet & vanity more 1 2 3 Previous Next Book Now Powered Site No Dogs Camp Kitchen Park Barbeques Ideal for caravans, camper trailers, camper vans and tents. more Book now In the heart of it all Located in the heart of Main Beach, this hidden gem is steps from beaches, cafes, and public transportation. Whether you're exploring the Gold Coast or unwinding at the beach, Main Beach offers the perfect balance for an unforgettable getaway. Beachside Swimming Pool Playground Accessible Features Ocean View Camp Kitchen View image gallery Accommodation at Main Beach Sites Cabins Studios View all What's new It’s Spring… and We’re Still Being Renovated! Travel Tips Events It’s Spring… and We’re Still Being Renovated! Spring at Main Beach Tourist Park brings sunny days, gentle sea breezes, and blooming gardens. It’s the perfect time to relax, spot local wildlife, and enjoy beachside walks View It’s Spring… and We’re Still Being Renovated! post Celebrate Christmas at Main Beach Tourist Park: Festive Fun for all! Events Celebrate Christmas at Main Beach Tourist Park: Festive Fun for all! Celebrate Christmas at Main Beach Tourist Park with festive crafts, outdoor adventures, and a visit from Santa! Enjoy activities like snow globe making, fishing, and more. Create lasting memories this holiday season with us! View Celebrate Christmas at Main Beach Tourist Park: Festive Fun for all! post Season Recap at Main Beach Tourist Park Blog Post Season Recap at Main Beach Tourist Park This season at Main Beach Tourist Park has been filled with unforgettable moments. As we look forward to the September school holidays, more exciting memories await! View Season Recap at Main Beach Tourist Park post June Joys at Main Beach Tourist Park: Events, Adventure, and Whales Await! Travel Tips Events June Joys at Main Beach Tourist Park: Events, Adventure, and Whales Await! View June Joys at Main Beach Tourist Park: Events, Adventure, and Whales Await! post Blissful Easter Escape at Main Beach Events Blissful Easter Escape at Main Beach Celebrate Easter at Main Beach Tourist Park: Enjoy serene beaches, family fun, and unforgettable moments. Join us for a holiday to remember! 🐰 View Blissful Easter Escape at Main Beach post Experience Spring at Main Beach Tourist Park Travel Tips Events Experience Spring at Main Beach Tourist Park Bid fairwell to those chilly winter days and soak up the warmth of the spring sun. Perfect weather awaits View Experience Spring at Main Beach Tourist Park post What our guests are saying Great quiet location. Close to surf club and short walk to Tedder Avenue restaurants. melanie marsellos Great location, walk to beach, cafes, restaurants and shops.  Really good caravan park. Marilyn Foster Book now View park map Park Overview Our Location Main Beach Tourist Park is your perfect beachside retreat. Located directly across from one of the Gold Coast’s most loved patrolled beaches, it’s the ideal spot to relax, soak up the sun, and enjoy the laid-back coastal lifestyle. Whether you're strolling to the beach for a morning swim, catching a sunset, or exploring the nearby Tedder Avenue with its charming cafés and boutiques, everything you need is within easy reach. Plus, with public transport close by, you can effortlessly explore theme parks, shopping centres, and Surfers Paradise—all while coming home to the calm and comfort of the beach. Accommodation for Everyone No matter how you travel, we’ve got a spot for you. Caravanners & Campers: Choose from powered or ensuite sites with plenty of room to spread out. Families & Groups: Our spacious 2 and 3 Bedroom Cabins sleep up to 9 guests and come with everything you need—full kitchen, laundry, air-conditioning, and a BBQ on the patio. Solo Travellers & Budget Guests: Our cosy Studio Cabins are a great fit. We also offer an Accessible Studio Cabin with ramp access, open-plan layout, and a fully accessible bathroom. Local Experiences & Attractions From thrilling rides to vibrant dining scenes, everything’s within reach. Sea World is just 2km away—perfect for marine life encounters and whale watching tours. Theme parks like Movie World, Dreamworld, Wet’n’Wild, and Top Golf are only a 20-minute drive. Surfers Paradise is just 3km south, offering vibrant nightlife, shopping, dining, and entertainment. Travel by car, tram, bus, or bike—it’s all easy! Events & Activities Main Beach Tourist Park is a top pick for event-goers. Whether you're here for the Pacific Airshow , GC 500 , or the Gold Coast Marathon , our central location means you’re close to the action but can still unwind in a relaxed setting. With public transport nearby, you can skip the traffic and parking stress. Just remember—these events are popular, so book early to secure your spot! Guest Information Activities Organised activities are offered in select periods. Information on upcoming activities is available from reception, via notice boards, guest notices and social media. Amenities Please refer to the site map for the location of amenity buildings. Hot water is available for showers, washing machines and basins. Please consider others, limit showers and help conserve water. The amenity blocks are cleaned at least twice a day and may be closed at these times. Please refer to the signs at each facility for cleaning hours, with other times as required. Children under 12 years old must be supervised by an adult. Bathrooms Baby change room A baby change room is located at the northern side of the main amenity block. Access is with a key (deposit required) from reception. Accessible bathroom There is an accessible bathroom at the southern side of the main amenity block. Access is with a key (deposit required) from reception. Bikes, ride-on equipment and motorised toys For the safety and enjoyment of all guests, only standard bikes and scooters are allowed to be ridden in the park during daylight hours. Road rules must be observed and a safety helmet worn at all times, as required by Queensland law. See reception staff for approval of all other ride-on equipment and motorised toys, or for suggested locations to safely use these items. Boom gates Boom gates are for your security. Please follow directions and do not give your security pin to others. Cabin Care Please report all damage, breakages and losses promptly to our park reception. We ask you to please leave the accommodation in a clean and tidy state. Rubbish should be placed neatly in bins provided (in the accommodation and throughout the park). All washing up to be done and put away clean. Additional cleaning charges and full replacement costs may apply where furniture and equipment is not left as originally found or the accommodation condition on departure is unacceptable. Guests are responsible for the safekeeping and replacement of lost keys. Camp kitchen and barbeques The park map indicates location of camp kitchens and barbeques. Please respect others, clean up after use and remove your food only from the fridge. For security purposes, the fridges may be locked at 10pm and unlocked between 5am and 6am. Do not place water bottles or ice in the freezer or cooler bags in the fridge. Alcohol and medications are not allowed in the camp fridges and the camp kitchens are smoke-free environments. Check-in time Sites – 11am Ensuites – 12pm Cabins – 2pm Check-out time All sites 10am Occupancy after this time will be charged as an additional day. Late check outs – depend on availability. See reception for fees and availability. Site fees are calculated until 10am on the day of departure. If your travel arrangements are inconvenienced by these times, please contact reception to see if alternative arrangements can be made. Chemical dump point A chemical toilet dump is provided at the southern end of the park (refer to park map). Dumping of toilet waste in any other area of the park is strictly prohibited. Children Supervising children is vital for their safety and helps make sure they do not disturb other guests. Children under 12 years old must be accompanied by an adult when visiting the amenities and all other park facilities. Conditions of entry As part of the conditions of entry to our park, guests are to abide by Park Rules. These are available from reception or on our website Park Rules page. Customer feedback We hope you enjoy your stay and welcome your feedback which helps us continue to improve our service and facilities. Please share your experience with others by leaving a review on Tripadvisor or Google . Evacuation procedures In an emergency, follow the directions of staff. If we need to evacuate the park make your way directly to our evacuation area – marked ‘Assembly area’ on the map. Fees Fees must be paid in advance. Your unique boom gate code is for one vehicle only. Access is controlled by an Anti-Passback system and is subject to fees paid in advance. Garbage/litter Please help us look after our environment by using the rubbish and recycling bins located throughout the park for your convenience. Wrap all garbage prior to disposal. Gas bottle exchange A gas bottle exchange service is available at reception. Information For local information, where to eat, activities, events, how to get around and service providers ask our friendly staff in reception. Items for hire See reception for information on items available for hire; including go-karts and ping-pong racquets. Enquire with staff about local hire companies for other items if required. Kiosk The kiosk stocks a variety of grocery items, toiletries, milk, bread, ice, papers, lollies, cold drinks, ice creams, beach items, etc. Laundry There are coin-operated machines and dryers in the main amenity blocks. They take $1 coins – change and washing powder is available from reception. Irons and ironing boards are free. Collect clothes from washing lines when dry and remove washing from machines when cycle finishes. Washing dishes is not permitted in the laundry, sinks are available at the camp kitchens. Lost and found Report lost or found items immediately to reception. Mail Mail will be placed in mail boxes. Mail can be posted at reception. Noise Quiet time is between 9pm and 8am. Consider your neighbours by keeping the volume down on radios, televisions and social gatherings. Excessive noise or abusive language will not be tolerated and can result in guests or visitors being asked to leave immediately. Personal information We are required to comply with the Information Privacy Act 2009. Any information you have supplied to us is only used for the purpose that it was collected for. We will not disclose your personal information (including confirming whether or not you are staying in the park) to any person. Should anyone wish to visit you while you are staying in the park, we recommend you contact them to advise where you are located in the park, as we will not pass on this information. Pets For the comfort and safety of guests, pets are not permitted. Placement of caravans We will help you place your caravan on your site. To comply with fire regulations, all vans MUST have the drawbar facing toward the road. Playground The children’s playground is located near the pool. Smoking is not permitted within 10 metres of the equipment, as per Qld law. Children under 12 years old must be supervised by an adult. Reception Current open hours are published on our website Contact page. For emergency assistance outside office hours, please use the emergency intercom located near the reception entrance door or contact park managers on phone number 07 5667 2726 . Recreation room The recreation room is next to reception and is open from 7.30am to 10pm each day. Facilities include TV and coin operated gaming machines. Children under 12 years old must be supervised by an adult. Refunds Cancellation fees apply. See reception for refund policy or view on our website Terms & Conditions page. Security We’d like your holiday to be enjoyable. Holidaying is a great time to get to know your neighbours and keep an eye out for each other’s belongings. Your security is important to us. We recommend you keep your possessions, vehicles and accommodation safely secured at all times. If you have any concerns, please speak to one of our friendly staff. Site cleanliness and boundaries Please keep your site tidy and use the facilities provided to dry clothes, discharge sullage water and dispose of rubbish. Make sure your caravan, car and camping equipment stay within your site boundaries. Ropes or fastenings must not be tied to trees, fences or park structures. It is your responsibility to position your camping equipment so that your vehicle fits on your site. if it doesn’t fit, it must be parked outside the park. Swimming pool Pool hours are signed at each pool area. Management reserves the right to change and amend hours as necessary for the safety of park guests. The pool is seasonally heated. For your safety and the comfort of all please note: no glass, smoking or alcohol no diving or running children under 12 years old must be supervised by an adult Vehicles – drive with care The safety of all guests is vital. Please adhere to the eight-kilometre speed limit (walking pace) within the park. Park roads are shared zones. Please follow all road signage and give way to pedestrians. Site fees include one vehicle only. Additional vehicles can be parked in the visitors’ car park. Speak to reception for approval and cost of an additional vehicle on site. Water conservation Please conserve water by keeping your showers short and reporting leaking taps to our reception staff. Park Accessibility Main Beach Accessibility Guide We are committed to ensuring every guest can have a relaxing and enjoyable stay. We aim to welcome guests with the highest level of customer service and hospitality, regardless of their individual needs. Download Main Beach Accessibility Guide Reception The Park reception office has level entry access with no stairs. The double sliding door entrance is fully automated, providing ample access for wheelchair or pram mobility. Kiosk shelves are stacked from floor level to head height and assistance from reception staff is on offer upon request. A qualified First Aid Officer is always available. Emergency assistance is provided by the resident manager outside of office hours. An intercom is located near the reception entrance door. Service animals are welcome in the Park, with documentation. Onsite security patrols the Park grounds nightly. Getting around the Park Mobility is made easy throughout the park grounds via the internal road network and pathways leading to facilities. Park roadways are illuminated by night and are suitable for users of wheelchairs, prams and mobility scooters. Recreation / Games Room The Games Room is located adjacent to reception. Access is level with no stairs, suitable for wheelchairs and prams. This indoor space features a TV with Foxtel and coin operated gaming machines. There is ample space for mobility throughout the facility, which provides alternative entertainment to the beach and outdoors. Accessible bathroom An accessible bathroom and separate toilet facility are located at the Park amenities block. Both rooms are accessed via a ramp with 930mm wide doorways and a sink height of 820mm. The shower features a hand-held shower head, fold down seat and lever taps. The toilet height is 500mm. The entrance doorway to the laundry is 1045mm. The majority of washers and dryers provided are front loading and low level. Sink height is 845mm. Camp Kitchen The sheltered and fully equipped camp kitchen facility has ramp access. Sink and barbeque height are 900mm. Accessible Studio Cabin Our fully Accessible Studio Cabin accommodates up to 3 guests with the use of a sofa bed. This cabin is fully accessible by wheelchair, and the open-plan design enables comfortable mobility throughout. Cabin features include a ramp leading to the balcony and entry. The bathroom is equipped with grab rails, adjustable hand held shower head and fold down bench seat. Main glass sliding door: 1000mm wide Bathroom doorway: 880mm wide Kitchen bench height: 900mm Small table height: 700mm Fridge and microwave are at knee height 2 Bedroom Cabin - Easy Access Our 2 Bedroom Cabin does not meet current fully accessible standards, but it does have ease of access features that include a ramp leading to the front door for easy wheelchair access, and an equipped bathroom. Entry is via a glass sliding door (790mm wide) and a 40mm high lip. Interior flooring is timber-finish throughout for easy mobility. Interior doorways measure up to 800mm wide and the kitchen bench is 900mm high. Grab rails are conveniently placed to bathroom basin, shower and toilet use. Shower fittings include an extendable hand held shower head, lever operated taps and a fold down bench seat. Toilet has contrast colour seat. City of Gold Coast Mobility Maps The City’s mobility maps are designed to provide accessibility information to assist residents and visitors to plan their stay and move around the city safely. Map information includes the location of accessible toilets, change facilities, accessible car parking spaces, pathway gradients, location of kerb ramps and key buildings and services. Transport information for light rail stations, bus stops and bus routes is also featured. Printed and electronic mobility maps are now available for Broadbeach, Burleigh Heads, Surfers Paradise, Southport Central Business District (CBD) and Broadwater Parklands. Visit cityofgoldcoast.com.au/mobilitymaps for more information. Facilities Accessible accommodation Accessible options Amenities Baby change room Barbeque facilities Cabins air conditioned Cabin Easy Access Cabins self-contained Cabin Studio Accessible Camp Kitchen Campervan/Tent Sites Dump point Gas bottle exchange Kiosk / Store Laundry Patrolled beach nearby Playground Recreation Room Surf beach opposite Swimming Pool Gallery Book now Contact Main Beach Phone 1300 672 720 Email main@gctp.com.au Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Stay in touch Stay in that holiday mood all year round. \nSign up below for our latest holiday deals & offers to your inbox… My Name My Email My Postcode Find us here too Follow us on Facebook Follow us on Instagram Follow us on YouTube What our guests are saying Peta Lee Holterman Jacobs Well Lovely spot, nice and clean, very friendly staff. will definitely be coming again. Kate Murray Tallebudgera Creek Loved it. The location is spectacular and the staff are super friendly and helpful. The cabin was clean and had everything needed. We'll be back next year! Paula Bent Jacobs Well FANTASTIC  little CV park Sooo close to Gold C and Sunshine C. New amenities , great staff very helpful 10 out of 10 close to everything you need , pet... Our Parks Jacobs Well Tourist Park Tipplers Campground South Stradbroke Island North Currigee Campground South Stradbroke Island South Currigee Campground South Stradbroke Island Broadwater Tourist Park Main Beach Tourist Park Ocean Beach Tourist Park Burleigh Beach Tourist Park Tallebudgera Creek Tourist Park Kirra Beach Tourist Park Looking For Park Finder What's On Hot Deals Attractions Blog Contact Us About Us Careers Accessibility Guides Pet Friendly Guidelines Campfire Guidelines Park Rules Terms & Conditions FAQs Gold Coast Tourist Parks acknowledges the Traditional Custodians of the land and waterways on which our tourist parks operate. We pay our respects to Aboriginal and Torres Strait Islander Elders past, present and future. © 2021  - 2025 Gold Coast Tourist Parks.\nAll rights reserved. Sitemap Privacy Policy Park update Main Beach Tourist Park is temporarily closed from February 2025 for up to 12 months for planned upgrades. Bookings are currently closed for Main Beach. To learn more about the upgrades and when bookings will reopen, visit our FAQs page . Continue to website close window Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://obeachibiza.com/blog/five-mins-with-co-founder-tony-truman/",
      "text": "Five mins with Co-founder Tony Truman - O Beach Ibiza Five mins with Co-founder Tony Truman - O Beach Ibiza O Beach Ibiza Day Club Calendar Restaurant Hotel Dubai Music Membership Book a bed Menu Close Day Club Packages Celebration Packages Bed Menus Book Now Restaurant Hotel Dubai Music Membership Boutique Connect Instagram Facebook Twitter Youtube Soundcloud Pinterest Spotify About Us Events Calendar Partners Work With Us Account Login Contact us Discover our Blog 29 May 2018 / Veebs Sabharwal Five mins with Co-founder Tony Truman A day in the life of... Back to Blog Tony Truman, a well-respected businessman and entertainer, has put his heart and soul into O Beach Ibiza, as well as several other locations in and around San Antonio. We caught up with him to find out how he keeps the party going. You put a lot of time and effort into recruitment for O Beach Ibiza. How do you process the 4,000+ applications? Yes the recruitment process is a big job, and it’s not just the beach club that we recruit for but a host of businesses that we own so it becomes complex and lengthy when choosing which person best fits each business as well as each position. I’m very, very lucky to have my colleague Nicola Gaston helping me with the process – she has been an absolute star in the pivotal role she plays, as well as the girls who work alongside Nicola in their office – so a massive thank you goes to that team. What we look for is first of all is someone who looks genuinely happy at all times, with a nice smile as this is the first thing our customers see. We want them to be greeted at really happy faces at O Beach Ibiza – a smile goes a long way! We also look for natural beauty in our applicants, rather than a ‘made up’ look, and confidence is very important as well as our staff are dealing with a lot of people everyday so we need strong, confident characters in themselves. How would you describe your working relationship with your business partner Duane and why is it successful? I would actually describe it as a perfect balance between us in so many ways. We’re very different as people and personalities and it totally works for us. We’re very lucky indeed to have a relationship like we do as it’s quite rare nowadays as so many partners in business seem to fall out but we’re very tight together as a unit.He does an incredible job which I fully admire and respect him for, especially as I met first him as a young boy and over the years I’ve seen him grow into a very clever and mature businessman, all without really changing as a person – he’s very humble. We joke that he’s the “spreadsheet” and I’m the “dance floor” which is a unique and dynamic combination that you need in a business like ours: you need the crazy fun party element who keeps the troops entertained and then you need the serious businessman who keeps it all together, The funny thing is I couldn’t do what he does and he couldn’t what I do so this is why we compliment each other so well. I’m very proud of Duane as my business partner, he’s such a great person and above all one of the most genuine and honest people I’ve ever meet as well as being a proper family man. What do you hope the O Beach Ibiza brand will achieve within the next 5-10 years? I would like Ibiza to remain the flagship of our brand. For me it will always be and long may that continue… We’ve currently been working on expanding into foreign territories and I think that in the very near future this will be a real possibility as there are some great places out there that fit very well with our brand and we’re in a position to think about expanding. I can visualise at least three or 4 O Beach clubs around the world eventually, and the next one we open will hopefully be a venue that covers the winter months thus enabling us to be more of an evergreen brand. We want our clients to enjoy our brand all year round, not just in summer. This year marks the 35th anniversary of Tru’s Do’s – why have they been so successful up until now? Wow, it seems like a lifetime when you actually write the figure 35 years down on paper. Most of our clients at the beach club weren’t even born when I started hosting parties (showing my age now…) I’m actually very proud to have been doing parties that long as I’ve seen huge changes in the party scene over the years, but somehow managed to survive and roll with all the advancements in technology. It’s been tough along the way no doubt about it, but I think the main reason my parties have been going so long is thanks to the collective mix of people who attend my events. It’s great that when I host one a Tru’s Do I still see my original party mates from way back when, and they bring their kids who are all grown up – this makes it extra special for me as there’s nothing I like more than seeing my lifelong pals and I partying with our kids as they’re the next generation who will hopefully keep Tru’s Do’s going for at least another 15 years or so. You own so many businesses, how do you juggle them all? The answer to this one is simply: AMAZING partners, managers and staff. Without a doubt it would be impossible to do what I do without great people around me. I feel very fortunate that we’ve accumulated such great team members to keep everything on the straight and narrow. There’s far too many to mention as they’re all very dear to me in so many ways but I’d like to say how lucky I am to have Gemma Chartes and George McBlain in my life – not only are they both very good friends of mine personally, but to have the loyalty and trust of these two individuals is very comforting indeed and I’m blessed to be working with such reliable and honest people like them. Recent posts 7 April 2025 / Veebs Sabharwal Hotel Ibiza Wellbeing This new Ibiza hotel opens in 2025 and it's muy Bonito 15 August 2024 / Veebs Sabharwal Five Mins with: Alex Mills 19 July 2024 / Veebs Sabharwal Ibiza Music Presenting Ibiza Global Festival 2024 5 July 2024 / Veebs Sabharwal Behind the scenes Ibiza Music Party The Making of the 2024 CinOmatic Pool Party 20 June 2024 / Veebs Sabharwal Behind the scenes Ibiza Join the ON111 revolution Close Date Ticket Price Description Close Description Be Social Follow us This error message is only visible to WordPress admins There has been a problem with your Instagram Feed. Incredible Events There’s a reason why Ibiza is the party capital of the world Book Now Taste the Mediterranean fusion cuisine Our restaurant brings tantalising flavours to your plate Book Now Stay with us and Party with us Experience Bonito and our other stunning hotel options! Book Now We didn’t invent the pool party, we just perfected it. Book a bed Subscribe Subscribe Keep up-to-date with island happenings in just a few shorts clicks. From Ibiza inspiration to musical motivation, we promise to bring your inbox nothing but good times. Great! You're subscribed to our newsletter. Something went wrong. Please check your email address and try again. Our Location (come and visit!) 12-14 Carrer Des Moli San Antonio, 07820 Ibiza Illes Balears We are open: 1pm - 11pm ⃰ reservations@obeachibiza.com View Map Headline Info Events Calendar Partners Work With Us Account Login Contact us Supporting Info My Account FAQs Press Terms & Conditions Términos y Condiciones Privacy Policy Internal Information How to contact us/send fan mail 0034 971 80 32 60 reservations@obeachibiza.com EN ©\n\t\t\t\t\tO Beach Ibiza 2025 All rights reserved | WE ARE IN NO WAY CONNECTED TO OCEAN CLUB MARBELLA. Discover our blog Jump In Book"
    },
    {
      "url": "https://www.beachchalet.com/about-us",
      "text": "About Us — Beach Chalet San Francisco's Best Ocean View Restaurant and Brewery Home Menus Breakfast Brunch Lunch Dinner Drinks Dessert Prime Rib Mondays Happy Hour Wine and Liquor Order To-Go DoorDash UberEats Reservations Private Events Brewery More Featured Gift Cards About Us Careers Sister Venues visitor's center Donation Request Home Menus Breakfast Brunch Lunch Dinner Drinks Dessert Prime Rib Mondays Happy Hour Wine and Liquor Order To-Go DoorDash UberEats Reservations Private Events Brewery More Featured Gift Cards About Us Careers Sister Venues visitor's center Donation Request About Us History of the BEACH CHALET If you are standing with your toes in the sand on Ocean Beach , or driving on Highway 101 , look east towards Golden Gate Park and you will see the Beach Chalet . The Beach Chalet is a Spanish colonial revival style, historic landmark that has gone from gleaming eatery called the Golden Gate Park Chalet, built by Willis Polk in 1925, to Army headquarters to dangerous dive bar to now, a renovated upscale restaurant with unimpeded ocean views. Frescos depicting real people and scenes from San Francisco in the 1930s were painted by Lucien Adolphe Labaudt in 1936 and line the first-floor walls. The Beach Chalet sits above the frescos, up a carved banister, with octopus, sea maidens and fish, to a second story with windows that span the entire bar and dining room. The view of the Pacific, and its glimmering sunsets, is amazing. The Beach Chalet is City Landmark #179 & the PARK CHALET Built much later and just a few steps behind the Beach Chalet is our Park Chalet . Here, travelers, neighbors and city goers have the option of a little more relaxed vibe with indoor and outdoor seating. The Park Chalet menu features classic coastal eats including our delicious Clam Chowder and Riptide Ale Fish & Chips. We serve flavorful sandwiches and we grill fantastic juicy burgers. The menu offers an array of appetizers that provide something for everyone. Park Chalet's full bar offers award winning house brewed beers , a great wine list and colorful, tasty cocktails . The Park features lunch, dinner and weekend brunch . The Park interior is light and airy. Large glass doors open during beautiful weather to bring the outdoors in. Though we are located on the edge of the city, the Park is an unparalleled urban escape just steps from Golden Gate Park and the awesome Pacific coastline . A massive stone fireplace, glass ceiling (yes, it is all glass) and a chill, square bar merge with the atmosphere creating a cool place to relax and recharge. Whether you are a Big Kahuna or a grommet, a short or long boarder, a regular or goofy foot or simply a soul who appreciates our beautiful park and ocean… JOIN US WHERE THE SURF MEETS THE TURF! COME ON IN FOR FRESH SEAFOOD OR A DELICIOUS BURGER. Historical WPA Frescos During the Great Depression, the Federal Art Project, a division of the Work Progress Administrations (WPA), put many artists to work by commissioning murals across the city. Generally, these murals depict the everyday life of idealized workers and everyday people, however, the fresco murals on the first floor of the Beach Chalet on the west end of the park are unique in that they show specific, important San Francisco figures of the time, including Park Superintendent John McLaren . Painted in, the frescos were done in the traditional wet plaster technique by the artist Lucien Labuadt , assisted by Arnold Bray, Farrell Dwyer, and the plaster, James Wyatt. The murals are located below the Beach Chalet. Open daily to the public. Top BEACH CHALET WE ARE LOCATED AT 1000 Great Highway @ Ocean Beach San Francisco, CA 94121 View Map (Google Map) CONTACT US Tel: (415) 386-8439 (FUN-VIEW) Email: info@beachchalet.com Events events@chaletrestaurants.com call 510-653-8937 Click Here for a FAST EVENT proposal HOURS Monday - Friday 9am - 8pm Happy Hour M-F 4-6pm Breakfast Weekdays                9-11am Saturday 10am-8pm Sunday 10am-8pm Brunch Weekends 10am-2:30pm JOIN OUR NEWSLETTER Click HERE to join! Beach Chalet Brewery and Restaurant American Restaurantji Beach Chalet Brewery and Restaurant is a go-to spot on Restaurantji - your local guide to nearby restaurants."
    },
    {
      "url": "https://goldcoasttouristparks.com.au/about",
      "text": "About | Gold Coast Tourist Parks &ev=PageView&noscript=1\" /> Skip to Content This website uses modern construction techniques, which may not render correctly in your old browser. We recommend updating your browser for the best online experience. Visit browsehappy.com to help you select an upgrade. Don't miss out this September! Stay from just 2 nights* during the school holidays. > Book now Dismiss Toggle menu Book Now Park Finder Park Finder Browse all Gold Coast Tourist Parks and nearby attractions Pet Friendly Accommodation Find a home for you and your furry friend at a Gold Coast Tourist Park Jacobs Well Situated on the waterways of southern Moreton Bay, Jacobs Well is a tranquil retreat perfect for nature lovers and their pets. The park offers direct access to the water, making it an ideal spot for boating, fishing, and exploring nearby islands. Tipplers Campground Immerse yourself in the natural beauty of South Stradbroke Island at Tipplers Campground. Featuring beachfront campsites, comfortable shacks, and a licensed cafe, Tipplers offers the ultimate nature-based camping experience. North Currigee Campground North Currigee Campground is a peaceful, secluded retreat located on the Broadwater side of South Stradbroke Island. Featuring beachfront campsites, hot showers and picnic areas, North Currigee is the ideal destination to relax and unwind in nature. South Currigee Campground Experience the beauty of South Stradbroke Island from South Currigee. Whether you're looking to hit the surf, fish along the Broadwater, or just relax in nature, South Currigee has all the amenities needed for an one-of-a-kind, nature-based holiday. Broadwater Overlooking the Broadwater, Broadwater Tourist Park offers a relaxing atmosphere close to the excitement of the Gold Coast. Packed with facilities and family-friendly activities, the park offers a memorable holiday experience for everyone. Main Beach Located in the heart of Main Beach, this hidden gem is steps from beaches, cafes, and public transportation. Whether you're exploring the Gold Coast or unwinding at the beach, Main Beach offers the perfect balance for an unforgettable getaway. Ocean Beach Ocean Beach Tourist Park is a tranquil retreat in the heart of Miami. With beaches, cafés, shops, and restaurants just steps from the park, you can enjoy the best of both worlds—a quiet, coastal haven with the excitement of the Gold Coast nearby. Burleigh Beach Located in the heart of Burleigh Heads, Burleigh Beach Tourist Park offers a perfect blend of beachside relaxation and vibrant local culture. With its famous surf breaks, scenic walking tracks, it’s the ideal spot for an authentic Gold Coast holiday. Tallebudgera Creek Situated on the iconic Tallebudgera Creek, this family-friendly paradise offers adventure and relaxation for the whole family. With waterfront cabins, two swimming pools and tennis courts, this park offers an one-of-a-kind holiday experience. Kirra Beach Kirra Beach is pet friendly and located just steps from the iconic beaches of Kirra and Coolangatta. It's laid-back, coastal vibe and pet-friendly facilities make it ideal for families and pet owners. What's On Hot Deals Attractions Blog Contact About Home About OVERVIEW Australia's Gold Coast is a city coming of age. Strategically located on the edge of the Asia-Pacific rim, with access to two international airports, the Gold Coast is perfectly positioned as a destination for business, investment, study, sport, events, tourism and lifestyle. Situated in the south east corner of the state of Queensland, the Gold Coast stretches along 57 kilometres of coastline and is home to over half a million people. Beyond the city’s beautiful beaches are vast, sub-tropical rainforests with breathtaking scenery, the perfect holiday destination for those from near and far. Welcoming close to 12 million visitors each year, the Gold Coast is full of attractions and things to do. As Australia’s premier tourist destination, the city offers a vibrant mix of shopping, accommodation, theme parks, restaurants, entertainment, festivals, sporting and other events, along with an abundance of natural attractions. The Gold Coast has developed into a diverse, cosmopolitan, forward-thinking city with a future full of promise. The City of Gold Coast owns seven mainland tourist parks and three island campgrounds located across the Gold Coast. Camping and caravanning holidays have been part of the social and cultural fabric of the Gold Coast, spanning three centuries. Camping at Coolangatta and Kirra Beach has been happening since as far back as the 1800’s and photographic evidence records camping at Burleigh Heads and Main Beach in the early 1900’s. The Gold Coast Tourist Parks team are proud of the rich history of camping on the Gold Coast and work hard to ensure that we preserve this for generations to come. Our Gold Coast Tourist Parks contribute a total of 480,000 site nights to the Gold Coast’s accommodation sector with approximately 135,000 visitors each year. Thanks to our partnership with the State Government who provides the City with trusteeship over the land allocations for the majority of our parks, the city can continue to offer affordable camping and recreation holidays in prime locations. With the Gold Coast being Australia’s second largest Council and 6th largest city, we know that we are in a very special and enviable position to have so many caravan and camping options available in prime locations within our City. Whilst many other parks in prime locations are given over to competing land uses, the Gold Coast is one of the last major cities in Australia to maintain such parks, which in our case, there is no doubt to their iconic status. VISION In 2017 Gold Coast Tourist Parks set a bold new vision “to be the best caravan and camping destination in Australia”. To see that vision realised, we have two key objectives. 1) World Class Destinations We want to match our world-class locations with world-class facilities. Changes in guest expectations require us to take a fresh approach to our future planning for assets. As such, in 2019 we undertook a full review of all of our existing assets and developed a new plan for future investment. 2) World Class Guest Experience Our Tourist Park locations and our Gold Coast region are ‘world-class’ and we want to match that with a world-class guest experience. To us, building a culture of service that makes every visit completely care free for you and delivered with Gold Coast love and energy is what, we believe, is world-class. World-class isn’t intended to convey big facilities, lots of facilities or even expensive facilities. World-class to us is to be considered among the best in the world and with our superb Gold Coast locations, hospitality and lifestyle, we believe we are already among the best city caravan and camping parks in the world and will continue to work to ensure our facilities and services are deserving of your visit. GUEST EXPERIENCE STANDARD To deliver on our vision, the Gold Coast Tourist Parks team is committed to continual improvement. In 2019, we have created a set of standards to which we hold ourselves and our teams accountable. By doing this, we can provide you with assurance that we will continue to imbed these standards in everything we do so that you, our valued guest, can enjoy your well-deserved holiday. Download a copy of our Guest Experience Standard Here . Jacobs Well Tourist Park Email: jacobs@gctp.com.au Phone: 1300 672 760 07 5667 2760 Follow us on Facebook Follow us on Instagram Address: 1161 Pimpama-Jacobs Well Rd, Jacobs Well, QLD 4208 Reception hours 9:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Tipplers Campground South Stradbroke Island Email: tipplers@gctp.com.au Phone: (07) 5577 2849 Follow us on Facebook Follow us on Instagram Address: South Stradbroke Island, QLD 4216, Australia Reception hours 8:00am to 6:00pm — Daily Follow us on Facebook Follow us on Instagram North Currigee Campground South Stradbroke Island Email: currigee@gctp.com.au Phone: (07) 5577 3932 Follow us on Facebook Follow us on Instagram Address: Currigee Rd, South Stradbroke QLD Reception hours 7:30am to 7:30pm — Daily Follow us on Facebook Follow us on Instagram South Currigee Campground South Stradbroke Island Email: currigee@gctp.com.au Phone: (07) 5577 3932 Follow us on Facebook Follow us on Instagram Address: South Stradbroke Island, QLD 4216, Australia Reception hours 8:30am to 11:30am — Daily 2:00pm to 4:30pm — Public Holidays Follow us on Facebook Follow us on Instagram Broadwater Tourist Park Email: bwater@gctp.com.au Phone: 1300 672 730 Follow us on Facebook Follow us on Instagram Address: 169 Marine Parade, Southport, QLD 4215, Australia Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Main Beach Tourist Park Email: main@gctp.com.au Phone: 1300 672 720 Follow us on Facebook Follow us on Instagram Address: 3600 Main Beach Parade, Main Beach, QLD 4217, Australia Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Ocean Beach Tourist Park Email: ocean@gctp.com.au Phone: 1300 672 710 (07) 5667 2710 Follow us on Facebook Follow us on Instagram Address: 22 Hythe Street, Miami, QLD 4220, Australia Reception hours 8:00am to 6:00pm — Monday-Friday 9:00am to 5:00pm — weekends and public holidays, Christmas day closed Follow us on Facebook Follow us on Instagram Burleigh Beach Tourist Park Email: burly@gctp.com.au Phone: 1300 672 750 (07) 5667 2750 Follow us on Facebook Follow us on Instagram Address: 36 Goodwin Tce, Burleigh Heads, QLD 4220, Australia Reception hours 8:00am to 6:00pm — Monday-Friday 9:00am to 5:00pm — weekends and public holidays, Christmas day closed Follow us on Facebook Follow us on Instagram Tallebudgera Creek Tourist Park Email: tally@gctp.com.au Phone: 1300 672 700 (07) 5667 2700 Follow us on Facebook Follow us on Instagram Address: 1544 Gold Coast Hwy,Palm Beach, QLD 4221, Australia Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Kirra Beach Tourist Park Email: kirra@gctp.com.au Phone: 1300 672 740 (07) 5667 2740 Follow us on Facebook Follow us on Instagram Address: 10 Charlotte Street, Coolangatta, QLD 4225, Australia Reception hours 8:00am to 5:00pm — Daily, off-peak season 8:00am to 6:00pm — Daily, peak season (school holidays, long weekends, special events). Christmas Day closed. Follow us on Facebook Follow us on Instagram MANAGEMENT TEAM Contracts, administration, marketing, social media, asset planning and financial management of the Gold Coast Tourist Parks is overseen by a small team located in Bundall on the Gold Coast. Our team is made up of passionate Gold Coasters who love being part of our iconic Gold Coast Tourist Parks. Our team keeps busy working in the background to ensure that we are supporting the service that you receive from our wonderful park hosts. PROSPECTIVE SUPPLIERS The Gold Coast Tourist Parks team are continually on the look out for new, innovative and competitive suppliers to provide excellent services to our guests. At all times, we adhere to the strictest of probity guidelines to ensure that all companies who are capable of supplying relevant product and services have the opportunity to quote or tender for our business. All formal tenders are available for review at www.lgtenderbox.com.au. TENDERS AND PARK MANAGEMENT CONTRACTS New mainland park management contracts commenced in October-November 2019. Island management contracts are due to expire in June 2020. A formal, fair and transparent tender process will be conducted approximately six (6) months ahead of the expiration term of all contracts. Tenders are advertised in the Gold Coast Bulletin on Saturdays, on Council’s website www.goldcoast.qld.gov.au and www.lgtenderbox.com.au. LG tender box requires suppliers to register in order to receive automated alerts of published tenders. Please note the LG tender box website is not owned or operated by the City. In our experience, managers that will have the best experience working with us, will: be aligned with our Guest Experience Standard and our Values; have a heartfelt desire to serve our guests with excellence; have a love of the Gold Coast and all of our amazing locations; be leaders that build highly capable and engaged teams who are passionate about serving our guests; be solutions-focussed; be capable of building systems that ensure seamless operations; improve our facilities through excellent maintenance and asset management (preferably have trade and/or handyperson skills); imbed safety and Workplace Health and Safety in all facets of the business; and want a strong partnership with us. PARK DEVELOPMENT Integrated Site Designs have been awarded the contract to undertake a full assessment of our existing mainland parks. This is expected to be completed in April 2019 for future investment commencing 2021. Further information will be made available at this site as it becomes available for publication. In this section About Accessibility Guides Pet Friendly Guidelines Campfire Guidelines Sustainability Guidelines Park Rules FAQs Indigenous Connection Stay in touch Stay in that holiday mood all year round. \nSign up below for our latest holiday deals & offers to your inbox… My Name My Email My Postcode Find us here too Follow us on Facebook Follow us on Instagram Follow us on YouTube What our guests are saying Peta Lee Holterman Jacobs Well Lovely spot, nice and clean, very friendly staff. will definitely be coming again. Kate Murray Tallebudgera Creek Loved it. The location is spectacular and the staff are super friendly and helpful. The cabin was clean and had everything needed. We'll be back next year! Paula Bent Jacobs Well FANTASTIC  little CV park Sooo close to Gold C and Sunshine C. New amenities , great staff very helpful 10 out of 10 close to everything you need , pet... Our Parks Jacobs Well Tourist Park Tipplers Campground South Stradbroke Island North Currigee Campground South Stradbroke Island South Currigee Campground South Stradbroke Island Broadwater Tourist Park Main Beach Tourist Park Ocean Beach Tourist Park Burleigh Beach Tourist Park Tallebudgera Creek Tourist Park Kirra Beach Tourist Park Looking For Park Finder What's On Hot Deals Attractions Blog Contact Us About Us Careers Accessibility Guides Pet Friendly Guidelines Campfire Guidelines Park Rules Terms & Conditions FAQs Gold Coast Tourist Parks acknowledges the Traditional Custodians of the land and waterways on which our tourist parks operate. We pay our respects to Aboriginal and Torres Strait Islander Elders past, present and future. © 2021  - 2025 Gold Coast Tourist Parks.\nAll rights reserved. Sitemap Privacy Policy Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://oceanpark.com.au/about-us/",
      "text": "About Us - Ocean Park Skip to content Ocean Park 1 Ocean Park Road, Shark Bay info@oceanpark.com.au (08)9948 1765 Instagram Facebook Envelope Menu Home Aquarium Restaurant About Us Shark Bay How to get here Contact Us Book Now Book Now Gift Cards ABOUT US Welcome to ocean park Ocean Park Aquarium, located in Shark Bay, Western Australia, is an exciting ecotourism venture that gives visitors the opportunity to see and learn about the wonders of the marine environment. The Park is a popular tourism attraction as well as a recognised conservation and marine research facility. We welcome approximately 48,000 visitors each year to an aquarium experience like no other! Customers explore the wonders of the Shark Bay Marine Park with a marine scientist by their side, discovering endangered sea turtles, highly venomous sea snakes, stonefish and more! We show visitors the secret lives of clownfish, stingrays and experience the raw fury of shark feeding up close and personal, all within a one hour tour. Accreditation and Awards Our tourism facility is accredited through the Quality Tourism Framework recognised throughout Australia. We are proud to be a Quality Tourism Accredited Business and have also met the standard to be a Sustainable Tourism Accredited Business . In 2014 we achieved gold in the Western Australian Tourism Awards – Tourist Attractions category – and were a finalist in the 2014 Australian Tourism Awards – Tourist Attractions category. In 2015 we also became the first and only PADI Dive Centre in Shark Bay. WINNER OF THE WA TOURISM AWARD – BEST TOURIST ATTRACTION History Ocean Park has its roots in aquaculture. Owned and operated by marine scientists, the business was initially opened in July 2000 to aquaculture Shark Bay pink snapper with two full time staff, and tours of small display aquaria. Unfortunately pink snapper aquaculture cannot compete with wild capture fisheries due to the high cost of breeding and ranching such a slow growing species. Consequently, over the years the business has evolved to provide tours of marine display tanks and now employs a total of 25 staff members. Ocean Park fully caters to tourism, research, animal rehabilitation and customer education, with a licensed restaurant, café, scuba diving, marine safaris and 4WD tours within the Shark Bay World Heritage Area to compliment the aquarium tours. We still hold an aquaculture licence and in the future hope to farm fish for sale in the restaurant to bring a true local experience to the diners. meet the team At Ocean Park Aquarium, every customer joins a fully qualified marine scientist who takes you on an interactive, fun and educational tour of the entire aquarium, including the shark feeding. Enhance your knowledge and test ours! With every guide a qualified marine scientist, from a variety of specialties, we can enhance your aquarium experience by not only explaining where the creatures live, but why they do so. After over 15 years of collecting feedback on our tours, the #1 favourite part of the tour is the guides! So come and meet us! Ed FEnny Managing Director BSC Marine Science Stacey blane Manager Dive Instructor BSC Marine Science tiani Guelpa Manager 4x4 Tour Guide donnelle oakley Manager Luke porter 4x4 Tour Guide chelsea griffith Master 5 skipper 4x4 Tour Guide russel fraser Master 5 Skipper emily gosden Divemaster BSC Marine Science Aquarium curator reece cramond Aquarium Curator emilie ledwidge Coxswain Skipper\nDive Instructor Aquarium Tour Guide brandon mach Aquarium Tour Guide scarlett cross Aquarium Tour Guide jimmy leesteere Aquarium Tour Guide cora Lelong-douglas Divemaster Aquarium Tour Guide ethan gallie 4x4 Tour Guide Aquarium Tour Guide genevieve buckton 4x4 Tour Guide Aquarium Tour Guide georgia sarmiento Aquarium Tour Guide stacey cooper Pearl Shop (Denham) olivier mimeault Aquarium Tour Guide Jake mason Divemaster Photographer Aquarium Tour Guide Henny Tandriyani Chef mavis Chef Things to do in Shark Bay Aquarium Tour Oceans Restaurant Shark Bay Eco Tours Boat Tours 4X4 Tours Information About Us How to get here/location Privacy Policy FAQs Refunds, Returns & Delivery Facebook Instagram Youtube (08) 9948 1765 info@oceanpark.com.au Discover more things to do in Denham on © 2023 West Australian Ocean Park ABN 77 435 238 086 *Images for Illustration purposes only Scroll to Top"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "text": "Contact Us Free Community Shred Day to be held at our Aberdeen, Raymond and Long Beach branch locations - Saturday, September 20th from 9AM to Noon. Bring your sensitive documents and mail to be securely destroyed on-site. Donations of canned goods for local food banks will be accepted. Close Alert Go to main content Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Search: Online Banking Login Login Username Register Bank Borrow Manage Discover Spend Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Share Savings HSAs Youth Accounts Christmas Club Investment Accounts Money Market IRAs Certificates Business Accounts Retirement & Investment Services Savings Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Loans Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Access Online Banking Mobile Banking EasyPay Protection Insurance Estate Planning Loan Payment Options Business Services Card Services Courtesy Pay Order Checks Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More About Us About Great NorthWest FCU Become a Member Membership Benefits Buy Local Spend Local Promotions Refer a Friend Career Opportunities Get Help Contact Us Frequently Asked Questions Disclosures & Agreements Provide Feedback Rates Locations Locations & ATMs Financial Education Great NorthWest Insider Great NorthWest Scholarships Credit Score Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Contact Us We're here when you need us. Have a question or need a hand? We’re here to help. Reach out by phone, text, email, or visit us in person—our team is ready to support you, wherever life takes you. Contact Us Quick Question? Get a quick answer during business hours. Text 3605339990 and a Member Service Representative will reply! Need a notary? Want to open a Safe Deposit Box? Have questions about filing a cardholder dispute? Skip the line at your local branch and Schedule an Appointment ! * Required Fields First Name: Last Name: Email Address: Message: Are you a current member of Great NorthWest FCU? Yes No Branch Information Filter by City All Cities All Cities Aberdeen, WA Chehalis, WA Long Beach, WA Ocean Park, WA Raymond, WA Filter by Service All Services All Services Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Aberdeen Branch 301 W. Wishkah Street Aberdeen, WA 98520 Get Directions Phone: 360-533-9990 TTY: 1-800-533-8396 Email Us Schedule an Appointment 24-Hour Drive-Thru ATM located across the street at 320 W. Wishkah St. You can also visit our Great NorthWest Financial Center. Located at 331 W. Wishkah St., this office houses our Retirement & Investment Services along with Mortgage and Business Lending. Lobby Hours: Mon: 9am - 6pm Tue: 9am - 6pm Wed: 9am - 6pm Thu: 9am - 6pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 6pm Tue: 8am - 6pm Wed: 8am - 6pm Thu: 8am - 6pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru Safe Deposit Boxes Night Deposit Coin Counter Notary Services Chehalis Branch 1601 N.W. Louisiana Avenue Chehalis, WA 98532 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 8:30am - 5:30pm Tue: 8:30am - 5:30pm Wed: 8:30am - 5:30pm Thu: 8:30am - 5:30pm Fri: 8:30am - 6pm Sat: 9am - 1pm Sun: Closed On-site ATM Notary Services Long Beach Branch 705 Pacific Ave. S. Long Beach, WA 98631 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Ocean Park Branch 1409 251st Pl. Ocean Park, WA 98640 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive Thru Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Raymond Branch 327 Commercial Street Raymond, WA 98577 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Go to main navigation Make it Great! Send Us A Message This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Call Center (360) 533-9990 (call or text) (800) 533-8396 Call Center Hours (PST) Monday - Friday: 8am - 6pm Saturday: 9am - 1pm Sunday: Closed Mailing Address 301 W. Wishkah St. Aberdeen, WA 98520 Routing Number: 325180333 Accessibility Statement Privacy Policy Disclosures Site Map © 2025 Great NorthWest Federal Credit Union Website by CUSG Facebook Instagram This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Search: Bank Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Investment Accounts Business Accounts Retirement & Investment Services Savings Rates Borrow Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Manage Online Banking Insurance Loan Payment Options Business Services Courtesy Pay Card Services Order Checks Discover About Great NorthWest FCU Become a Member Membership Benefits Promotions Career Opportunities Locations & ATMs Contact Us FAQs Provide Feedback Great NorthWest Insider Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Google ReCaptcha Error"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/contact",
      "text": "Contact | Gold Coast Tourist Parks &ev=PageView&noscript=1\" /> Skip to Content This website uses modern construction techniques, which may not render correctly in your old browser. We recommend updating your browser for the best online experience. Visit browsehappy.com to help you select an upgrade. Don't miss out this September! Stay from just 2 nights* during the school holidays. > Book now Dismiss Toggle menu Book Now Park Finder Park Finder Browse all Gold Coast Tourist Parks and nearby attractions Pet Friendly Accommodation Find a home for you and your furry friend at a Gold Coast Tourist Park Jacobs Well Situated on the waterways of southern Moreton Bay, Jacobs Well is a tranquil retreat perfect for nature lovers and their pets. The park offers direct access to the water, making it an ideal spot for boating, fishing, and exploring nearby islands. Tipplers Campground Immerse yourself in the natural beauty of South Stradbroke Island at Tipplers Campground. Featuring beachfront campsites, comfortable shacks, and a licensed cafe, Tipplers offers the ultimate nature-based camping experience. North Currigee Campground North Currigee Campground is a peaceful, secluded retreat located on the Broadwater side of South Stradbroke Island. Featuring beachfront campsites, hot showers and picnic areas, North Currigee is the ideal destination to relax and unwind in nature. South Currigee Campground Experience the beauty of South Stradbroke Island from South Currigee. Whether you're looking to hit the surf, fish along the Broadwater, or just relax in nature, South Currigee has all the amenities needed for an one-of-a-kind, nature-based holiday. Broadwater Overlooking the Broadwater, Broadwater Tourist Park offers a relaxing atmosphere close to the excitement of the Gold Coast. Packed with facilities and family-friendly activities, the park offers a memorable holiday experience for everyone. Main Beach Located in the heart of Main Beach, this hidden gem is steps from beaches, cafes, and public transportation. Whether you're exploring the Gold Coast or unwinding at the beach, Main Beach offers the perfect balance for an unforgettable getaway. Ocean Beach Ocean Beach Tourist Park is a tranquil retreat in the heart of Miami. With beaches, cafés, shops, and restaurants just steps from the park, you can enjoy the best of both worlds—a quiet, coastal haven with the excitement of the Gold Coast nearby. Burleigh Beach Located in the heart of Burleigh Heads, Burleigh Beach Tourist Park offers a perfect blend of beachside relaxation and vibrant local culture. With its famous surf breaks, scenic walking tracks, it’s the ideal spot for an authentic Gold Coast holiday. Tallebudgera Creek Situated on the iconic Tallebudgera Creek, this family-friendly paradise offers adventure and relaxation for the whole family. With waterfront cabins, two swimming pools and tennis courts, this park offers an one-of-a-kind holiday experience. Kirra Beach Kirra Beach is pet friendly and located just steps from the iconic beaches of Kirra and Coolangatta. It's laid-back, coastal vibe and pet-friendly facilities make it ideal for families and pet owners. What's On Hot Deals Attractions Blog Contact Contact Home Contact Leave us a message Leave this field blank Name Email Phone Park of interest Select a park to send this enquiry to --Please Select-- Jacobs Well Tipplers Campground North Currigee Campground South Currigee Campground Broadwater Main Beach Ocean Beach Burleigh Beach Tallebudgera Creek Kirra Beach Your Enquiry Submit Contact Our parks Jacobs Well Tourist Park Email: jacobs@gctp.com.au Phone: 1300 672 760 07 5667 2760 Follow us on Facebook Follow us on Instagram Address: 1161 Pimpama-Jacobs Well Rd, Jacobs Well, QLD 4208 Reception hours 9:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Tipplers Campground South Stradbroke Island Email: tipplers@gctp.com.au Phone: (07) 5577 2849 Follow us on Facebook Follow us on Instagram Address: South Stradbroke Island, QLD 4216, Australia Reception hours 8:00am to 6:00pm — Daily Follow us on Facebook Follow us on Instagram North Currigee Campground South Stradbroke Island Email: currigee@gctp.com.au Phone: (07) 5577 3932 Follow us on Facebook Follow us on Instagram Address: Currigee Rd, South Stradbroke QLD Reception hours 7:30am to 7:30pm — Daily Follow us on Facebook Follow us on Instagram South Currigee Campground South Stradbroke Island Email: currigee@gctp.com.au Phone: (07) 5577 3932 Follow us on Facebook Follow us on Instagram Address: South Stradbroke Island, QLD 4216, Australia Reception hours 8:30am to 11:30am — Daily 2:00pm to 4:30pm — Public Holidays Follow us on Facebook Follow us on Instagram Broadwater Tourist Park Email: bwater@gctp.com.au Phone: 1300 672 730 Follow us on Facebook Follow us on Instagram Address: 169 Marine Parade, Southport, QLD 4215, Australia Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Main Beach Tourist Park Email: main@gctp.com.au Phone: 1300 672 720 Follow us on Facebook Follow us on Instagram Address: 3600 Main Beach Parade, Main Beach, QLD 4217, Australia Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Ocean Beach Tourist Park Email: ocean@gctp.com.au Phone: 1300 672 710 (07) 5667 2710 Follow us on Facebook Follow us on Instagram Address: 22 Hythe Street, Miami, QLD 4220, Australia Reception hours 8:00am to 6:00pm — Monday-Friday 9:00am to 5:00pm — weekends and public holidays, Christmas day closed Follow us on Facebook Follow us on Instagram Burleigh Beach Tourist Park Email: burly@gctp.com.au Phone: 1300 672 750 (07) 5667 2750 Follow us on Facebook Follow us on Instagram Address: 36 Goodwin Tce, Burleigh Heads, QLD 4220, Australia Reception hours 8:00am to 6:00pm — Monday-Friday 9:00am to 5:00pm — weekends and public holidays, Christmas day closed Follow us on Facebook Follow us on Instagram Tallebudgera Creek Tourist Park Email: tally@gctp.com.au Phone: 1300 672 700 (07) 5667 2700 Follow us on Facebook Follow us on Instagram Address: 1544 Gold Coast Hwy,Palm Beach, QLD 4221, Australia Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Follow us on Facebook Follow us on Instagram Kirra Beach Tourist Park Email: kirra@gctp.com.au Phone: 1300 672 740 (07) 5667 2740 Follow us on Facebook Follow us on Instagram Address: 10 Charlotte Street, Coolangatta, QLD 4225, Australia Reception hours 8:00am to 5:00pm — Daily, off-peak season 8:00am to 6:00pm — Daily, peak season (school holidays, long weekends, special events). Christmas Day closed. Follow us on Facebook Follow us on Instagram Stay in touch Stay in that holiday mood all year round. \nSign up below for our latest holiday deals & offers to your inbox… My Name My Email My Postcode Find us here too Follow us on Facebook Follow us on Instagram Follow us on YouTube What our guests are saying Peta Lee Holterman Jacobs Well Lovely spot, nice and clean, very friendly staff. will definitely be coming again. Kate Murray Tallebudgera Creek Loved it. The location is spectacular and the staff are super friendly and helpful. The cabin was clean and had everything needed. We'll be back next year! Paula Bent Jacobs Well FANTASTIC  little CV park Sooo close to Gold C and Sunshine C. New amenities , great staff very helpful 10 out of 10 close to everything you need , pet... Our Parks Jacobs Well Tourist Park Tipplers Campground South Stradbroke Island North Currigee Campground South Stradbroke Island South Currigee Campground South Stradbroke Island Broadwater Tourist Park Main Beach Tourist Park Ocean Beach Tourist Park Burleigh Beach Tourist Park Tallebudgera Creek Tourist Park Kirra Beach Tourist Park Looking For Park Finder What's On Hot Deals Attractions Blog Contact Us About Us Careers Accessibility Guides Pet Friendly Guidelines Campfire Guidelines Park Rules Terms & Conditions FAQs Gold Coast Tourist Parks acknowledges the Traditional Custodians of the land and waterways on which our tourist parks operate. We pay our respects to Aboriginal and Torres Strait Islander Elders past, present and future. © 2021  - 2025 Gold Coast Tourist Parks.\nAll rights reserved. Sitemap Privacy Policy Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://obeachibiza.com/blog/five-mins-duane-lineker/",
      "text": "Five mins with Co-Founder, Duane Lineker - O Beach Ibiza Five mins with Co-Founder, Duane Lineker - O Beach Ibiza O Beach Ibiza Day Club Calendar Restaurant Hotel Dubai Music Membership Book a bed Menu Close Day Club Packages Celebration Packages Bed Menus Book Now Restaurant Hotel Dubai Music Membership Boutique Connect Instagram Facebook Twitter Youtube Soundcloud Pinterest Spotify About Us Events Calendar Partners Work With Us Account Login Contact us Discover our Blog 30 April 2018 / Veebs Sabharwal Five mins with Co-Founder, Duane Lineker Back to Blog As we head into our best season yet, we caught up with Co-founder Duane Lineker to talk about the past, the present and the future of the O Beach Ibiza brand. 1. How did O Beach Ibiza go from car park to luxury beach club in five months Wow, with a lot of stress and hard work from a lot of people. By the time we actually laid the first brick I think it was mid February. We worked 16 hour days, 7 days a week. Myself, Tony Truman, my girlfriend Megan Cole and our founding partner Vicente Juan were co-ordinating the building, designing menus, booking DJs, creating food and drink menus and designing a beach club plus a million and one things more. It really was a crazy time and some of the most stressful of my life but looking back now of course it was all worth it and we owe massive thanks to all the people that helped the business in the early days 2. How do you market O Beach Ibiza and how have your marketing plans evolved over the years? I think marketing is an ever changing part of any successful business, what worked five years ago might be laughed at today but what we do today will be antique by next year so you really need to stay on the pulse with all elements of marketing. Today social media plays a huge part in our marketing. Our aspirational brand positioning is a big part of the success of our marketing campaigns, for example we earn a lot of social media as our clients continuously post and check-in on their accounts from within the venue. 3. Ibiza has been a house and dance music mecca for years. Why have you decided to introduce an in-house R&B, hip-hop and garage night this year? I think variety is key. Ibiza will always be connected to house and electronic music and is the best place in the world to hear it but at the same time, clients are looking for something new and fresh. The renaissance of Garage as well as a continued demand for R&B are why we feel now’s the time to start a new brand focused around these genres of music. We’re really excited about the ONE brand and its potential for growth in O Beach and hopefully internationally going forward. 4. How do you think regulation changes to the West End will impact the leisure, travel, tourism and entertainment scene in San Antonio, Ibiza? This is a very sensitive and delicate point in Ibiza currently, we all know the west end has needed a change for a few years now but this drastic and brutal cut in hours will be very difficult for the area. I don’t think anyone will really benefit from these changes. I don’t agree that this cut in hours was the right way to try to repair the west end. 5. You own other business in Ibiza, are there plans to add to your portfolio in Spain and/or beyond? We’re always looking for new opportunities and have something very exciting planned for summer 2020 in Ibiza, hopefully that will be revealed very soon. Then hopefully in the future we will find the right location to grow the Ocean brand. I’m sure I’ll be able to say more soon. 6. What advice would you give anyone looking to set up a business in Ibiza? Be prepared for a lot of paperwork and visits to a good gestoria (an agency that obtains official documents). It’s not easy but with the right location and team it can be a great place for business and an even better place to live. Recent posts 7 April 2025 / Veebs Sabharwal Hotel Ibiza Wellbeing This new Ibiza hotel opens in 2025 and it's muy Bonito 15 August 2024 / Veebs Sabharwal Five Mins with: Alex Mills 19 July 2024 / Veebs Sabharwal Ibiza Music Presenting Ibiza Global Festival 2024 5 July 2024 / Veebs Sabharwal Behind the scenes Ibiza Music Party The Making of the 2024 CinOmatic Pool Party 20 June 2024 / Veebs Sabharwal Behind the scenes Ibiza Join the ON111 revolution Close Date Ticket Price Description Close Description Be Social Follow us This error message is only visible to WordPress admins There has been a problem with your Instagram Feed. Incredible Events There’s a reason why Ibiza is the party capital of the world Book Now Taste the Mediterranean fusion cuisine Our restaurant brings tantalising flavours to your plate Book Now Stay with us and Party with us Experience Bonito and our other stunning hotel options! Book Now We didn’t invent the pool party, we just perfected it. Book a bed Subscribe Subscribe Keep up-to-date with island happenings in just a few shorts clicks. From Ibiza inspiration to musical motivation, we promise to bring your inbox nothing but good times. Great! You're subscribed to our newsletter. Something went wrong. Please check your email address and try again. Our Location (come and visit!) 12-14 Carrer Des Moli San Antonio, 07820 Ibiza Illes Balears We are open: 1pm - 11pm ⃰ reservations@obeachibiza.com View Map Headline Info Events Calendar Partners Work With Us Account Login Contact us Supporting Info My Account FAQs Press Terms & Conditions Términos y Condiciones Privacy Policy Internal Information How to contact us/send fan mail 0034 971 80 32 60 reservations@obeachibiza.com EN ©\n\t\t\t\t\tO Beach Ibiza 2025 All rights reserved | WE ARE IN NO WAY CONNECTED TO OCEAN CLUB MARBELLA. Discover our blog Jump In Book"
    },
    {
      "url": "https://www.oceanbeach.co.uk/contact-us/",
      "text": "Contact Us – Ocean Beach Pleasure Park OPENING TIMES BUY CREDITS RIDES & ATTRACTIONS QUASAR & ARCADES PARK GUIDE ACCESSIBILITY & CARER’S WRISTBANDS PARK MAP TAP & PLAY FUNCARDS SCHOOL & GROUP BOOKINGS FOOD & DRINK CONTACT US VACANCIES FREQUENTLY ASKED QUESTIONS / HELP USEFUL LINKS Menu OPENING TIMES BUY CREDITS RIDES & ATTRACTIONS QUASAR & ARCADES PARK GUIDE ACCESSIBILITY & CARER’S WRISTBANDS PARK MAP TAP & PLAY FUNCARDS SCHOOL & GROUP BOOKINGS FOOD & DRINK CONTACT US VACANCIES FREQUENTLY ASKED QUESTIONS / HELP USEFUL LINKS Home / Contact Us Ocean Beach Pleasure Park is situated on the coast in South Shields, approximately 13 miles from Newcastle Upon Tyne city centre and  5 miles south of the Tyne Tunnel. Ocean Beach Management Middle Arcade Sea Road, South Shields Tyne and Wear, NE33 2LA Tel: 0191 456 1617 Quasar Laser Tel: 0191 455 3885 Email Us – Click Here Frequently Asked Questions Do you have to pay to enter the park? No, Ocean Beach Pleasure Park is FREE entry. When are you open? Outdoor Ride and Arcade Opening Times can be seen here . Due to social distancing guidelines times may be subject to change. What are Tap & Play Fun Cards? These are the new way to enjoy the rides here at Ocean Beach, a contactless smartcard which is yours to purchase, add credit, top up and keep for future visits – you can read more about them here . How many credits are the rides? The number of tickets vary. Kids rides start from 2 credits per person. Large rides start from 2.5 credits per person. You can see a full list of each rides and credits in our Rides and Attractions sections. What if I have tickets and tokens from a previous visit? Paper ride tickets, issued before the introduction of our Fun Card, will expire at the end of April 2024. They will not be exchanged for bonus credits after this date. Where are your toilets? At the rear entrance of the park, along from the arcades and the ice cream kiosk, there are public toilets operated by South Tyneside Council open daily. Can we bring food and drink? Yes, of course, or you can purchase food and drink from the many kiosks and outlets we have here at Ocean Beach. There is no alcohol allowed within the park grounds. Can I bring my dog to the park? Yes, but we ask that you please keep all dogs on leads and clean up any mess immediately, thank you. Can I ride my bike or scooter in the park? No. For the safety and enjoyment of all other guests we prohibit cycling, skateboarding and scooter use within the park grounds. You may walk your bicycle/scooter through but please do not ride. Staff and security can ask you to leave the park should you ignore instructions not to ride. I'm accompanying someone as a carer am I able to ride with them? Yes, you can accompany them on any ride with the appropriate number of tickets for you both or if the person requires carer assistance during the ride itself we may issue you with a Carer’s Pass. Carer’s Passes are issued only when you present valid Carer ID, either a badge from a company you work as a carer or if you are a parent/guardian then a DLA letter is required. These passes are meant for carers to assist anyone requiring assistance, physical and emotional, on rides where visitors can sit side by side. This includes rides such as Pirate Ship , Twist , Waltzer where riders sit together in the same seat. With rides which are 1 (One) person per seat, such as Miami Surf , it is the Ride Operators discretion as to whether Carer’s Passes are accepted. Carer’s Passes are also issued under our fair usage policy at the discretion of and by Ocean Beach Management and you must meet the criteria to qualify, as explained in our Terms & Conditions . Failure to meet these terms may result in Carer’s Passes being withdrawn. Ocean Beach Pleasure Park is NOT a part of the MAX Card scheme and does not accept these as proof of carer status or to obtain discounts . I lost something when I visited have you found it? Any lost property found inside the park is handed in to the Middle Arcade you can contact them on 0191 456 1617. SUBSCRIBE FOR NEWS IMPORTANT INFORMATION VACANCIES CONTACT US - TERMS & CONDITIONS PRIVACY POLICY COOKIE POLICY (UK) Ocean Beach Management Ltd Middle Arcade, Ocean Beach Pleasure Park, Sea Road South Shields, Tyne & Wear NE33 2LD Company Number 10754046 © 2024. All rights reserved."
    },
    {
      "url": "https://www.parkvolusia.org/contact-us",
      "text": "Contact Us | Park Volusia - Beach Parking and Permit Assistance 0 Skip to Content Home Residents Visitors Beach Parking Citations Citation and Appeal Information Pay or Appeal a Citation How to Apply for a Permit FAQs Beach Driving Rules & Coastal Wildlife Contact Us Open Menu Close Menu Home Residents Visitors Beach Parking Citations Citation and Appeal Information Pay or Appeal a Citation How to Apply for a Permit FAQs Beach Driving Rules & Coastal Wildlife Contact Us Open Menu Close Menu Home Residents Visitors Beach Parking Folder: Citations Back Citation and Appeal Information Pay or Appeal a Citation How to Apply for a Permit FAQs Beach Driving Rules & Coastal Wildlife Contact Us If you didn't find the answers you're looking for on our Frequently Asked Questions page, please reach out to us on this contact form or call us at (386) 217-0078 We will be glad to assist you. Thank you! Daytona Beach Shores Office: 2422 S Atlantic Ave, Daytona Beach Shores FL 32118 New Smyrna Beach Office: 302 N Causeway, New Smyrna Beach FL 32169 Contact us Name * First Name Last Name Email * Phone (###) ### #### How can we help you? * I agree to the Volusia Parking’s Terms and Privacy Policy Thank you! We will get back to you shortly! Frequently Asked Questions What are the benefits of the new virtual permit program (license plate based)? Each ramp will be equipped with LPR cameras that will read your license plate and automatically open the parking gate allowing you to quickly drive through onto the beach. No more stickers affixed to the windshield! What is the non-resident on-beach parking fee for vehicles with no permit? NEW! As of October 1, 2024, the daily on-beach fee will increase to $30 per day (plus sales tax & any credit card fees) for any un-permitted vehicle. For quicker access to parking and to enjoy the beach, we strongly urge non-residents to apply online and purchase the new virtual parking permit. Volusia County residents should apply for their “no-cost” resident parking permit prior to parking. What is the parking fee for off-beach parking for vehicles with no permit? NEW! Effective January 1st, 2025, a parking fee of $20 per day (plus sales tax & any credit card fees) to park in any of the Park Volusia designated parking lots. Properly permitted vehicles will not have to pay the daily fee. County residents should apply for their annual “no-cost” parking permit prior to parking. Vehicles parked without a permit or daily fee payment will receive a parking violation on their windshield or in the mail. A $50.00 fine will be assessed for each violation. Can I still purchase a permit at Volusia beach entrance ramps? Daily passes can be purchased at the beach entrance ramps. Annual parking permits WILL NO LONGER be able to be purchased at the beach entrance ramps.  Permits may be purchased online, in the Volusia County Beaches app,  or by visiting a Park Volusia office during business hours. Volusia County residents should apply for their “no-cost” resident parking permit prior to parking. Will I have to renew my permit annually? Yes! Park Volusia resident and non-resident beach parking permits must be renewed annually. Online applications make the process quick and easy, provided you have the right documentation. Visitors Residents FAQs Location Park Volusia maintains two offices in Volusia County in an attempt to provide convenience for customers needing in person assistance with their parking needs. Make an appointment with us by calling one of the numbers below! Daytona Beach Shores Office : 2422 S Atlantic Ave, Daytona Beach Shores FL 32118 Phone : (386) 217-0078 | Hours : Mon-Sat 8:30am-6pm New Smyrna Beach Office: 302 N Causeway, New Smyrna Beach FL 32169 Phone : (386) 217-0216 | Hours : Mon-Fri 10am-6pm When emailing, please provide phone number and important contact info. General Questions: 📧 info@parkvolusia.org Citations (Questions or Concerns): 📧 citations@parkvolusia.org Permits (Inquiries): 📧 permits@parkvolusia.org Hearing Requests: 📧 hearings@parkvolusia.org © VOLUSIA COUNTY 2024 Designed and Developed by Flagler Media"
    },
    {
      "url": "https://goldcoasttouristparks.com.au/parks/tallebudgera-creek",
      "text": "Tallebudgera Creek | Gold Coast Tourist Parks &ev=PageView&noscript=1\" /> Skip to Content This website uses modern construction techniques, which may not render correctly in your old browser. We recommend updating your browser for the best online experience. Visit browsehappy.com to help you select an upgrade. Don't miss out this September! Stay from just 2 nights* during the school holidays. > Book now Dismiss Toggle menu Book Now Park Finder Park Finder Browse all Gold Coast Tourist Parks and nearby attractions Pet Friendly Accommodation Find a home for you and your furry friend at a Gold Coast Tourist Park Jacobs Well Situated on the waterways of southern Moreton Bay, Jacobs Well is a tranquil retreat perfect for nature lovers and their pets. The park offers direct access to the water, making it an ideal spot for boating, fishing, and exploring nearby islands. Tipplers Campground Immerse yourself in the natural beauty of South Stradbroke Island at Tipplers Campground. Featuring beachfront campsites, comfortable shacks, and a licensed cafe, Tipplers offers the ultimate nature-based camping experience. North Currigee Campground North Currigee Campground is a peaceful, secluded retreat located on the Broadwater side of South Stradbroke Island. Featuring beachfront campsites, hot showers and picnic areas, North Currigee is the ideal destination to relax and unwind in nature. South Currigee Campground Experience the beauty of South Stradbroke Island from South Currigee. Whether you're looking to hit the surf, fish along the Broadwater, or just relax in nature, South Currigee has all the amenities needed for an one-of-a-kind, nature-based holiday. Broadwater Overlooking the Broadwater, Broadwater Tourist Park offers a relaxing atmosphere close to the excitement of the Gold Coast. Packed with facilities and family-friendly activities, the park offers a memorable holiday experience for everyone. Main Beach Located in the heart of Main Beach, this hidden gem is steps from beaches, cafes, and public transportation. Whether you're exploring the Gold Coast or unwinding at the beach, Main Beach offers the perfect balance for an unforgettable getaway. Ocean Beach Ocean Beach Tourist Park is a tranquil retreat in the heart of Miami. With beaches, cafés, shops, and restaurants just steps from the park, you can enjoy the best of both worlds—a quiet, coastal haven with the excitement of the Gold Coast nearby. Burleigh Beach Located in the heart of Burleigh Heads, Burleigh Beach Tourist Park offers a perfect blend of beachside relaxation and vibrant local culture. With its famous surf breaks, scenic walking tracks, it’s the ideal spot for an authentic Gold Coast holiday. Tallebudgera Creek Situated on the iconic Tallebudgera Creek, this family-friendly paradise offers adventure and relaxation for the whole family. With waterfront cabins, two swimming pools and tennis courts, this park offers an one-of-a-kind holiday experience. Kirra Beach Kirra Beach is pet friendly and located just steps from the iconic beaches of Kirra and Coolangatta. It's laid-back, coastal vibe and pet-friendly facilities make it ideal for families and pet owners. What's On Hot Deals Attractions Blog Contact Your browser does not support video. Visit browsehappy.com to help you select an upgrade. Welcome to Tallebudgera Creek Tourist Park Park overview Accommodation Guest information Contact All Accommodation Book now 1 2 3 4 5 6 7 8 9 10 11 Previous Next Book Now 3 Bedroom Waterfront Cabin Sleeps 9 No Dogs Water View Bathroom Kitchen & Barbeque laundry-machine-2 Private Laundry ac-cool Air Conditioning Situated right on the water’s edge, this three-bedroom cabin is ideal for larger families or friends holidaying together. more 1 2 3 4 5 6 7 8 9 10 11 12 Previous Next Book Now 2 Bedroom Deluxe Cabin Sleeps 7 No Dogs Bathroom Kitchen & Barbeque laundry-machine-2 Private Laundry ac-cool Air Conditioning If you enjoy a little luxury while you are away then these deluxe cabins are the perfect escape for you. more 1 2 3 4 5 6 7 8 9 10 11 12 Previous Next Book Now 2 Bedroom Waterfront Superior Cabin Sleeps 5 No Dogs Water View Bathroom Kitchen & Barbeque ac-cool Air Conditioning Sit back and relax on your private balcony and enjoy the views. more 1 2 3 4 5 6 7 8 9 10 11 Previous Next Book Now 2 Bedroom Waterfront Cabin Sleeps 4 No Dogs Water View Bathroom Kitchen & Barbeque ac-cool Air Conditioning Easy Access Cabin Available Situated right on the waterfront of Tallebudgera Creek, these cabins are the perfect base for families who love the water. more 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 Previous Next Book Now 2 Bedroom Superior Cabin Sleeps 5 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning These two-bedroom cabins offer either a tranquil garden view or elevation providing great scenic views. more 1 2 3 4 5 6 7 8 Previous Next Book Now 2 Bedroom Cabin Sleeps 4 No Dogs Bathroom Kitchen & Barbeque ac-cool Air Conditioning Having the privacy of your own cabin while enjoying all the fun activities the Park has to offer is ideal. more 1 2 3 Previous Next Book Now Family Budget Room Sleeps 6 No Dogs Ceiling Fans Ideal for the budget conscious, this wing of family room accommodation features a shared bathroom, including a toilet, shower and vanity. more 1 2 3 Previous Next Book Now Lodging Room Sleeps 2 No Dogs ac-cool Air Conditioning Ideal for the budget conscious, this wing of single room accommodation features a shared bathroom, including a toilet, shower and vanity. more 1 2 3 4 5 Previous Next Book Now Ensuite Powered Site No Dogs Private Bathroom Camp Kitchen Park Barbeques Featuring a private bathroom and concrete slab. more 1 2 3 4 5 6 7 Previous Next Book Now Waterfront Powered Site No Dogs Water View Camp Kitchen Park Barbeques Accessible Bathroom Absolute waterfront with superb views! more 1 2 3 4 Previous Next Book Now Premium Powered Site No Dogs Camp Kitchen Park Barbeques Accessible Bathroom Premium location close to water or pool! more 1 2 3 4 5 Previous Next Book Now Powered Slab Site No Dogs Camp Kitchen Park Barbeques Accessible Bathroom Varying sizes and configurations, suitable for vans, camper trailers, campervans and tents. more 1 2 3 4 Previous Next Book Now Powered Site Sleeps 6 No Dogs Park Amenities Camp Kitchen Park Barbeques Accessible Bathroom Ideal for tents, campervans and camper trailers. more 1 2 3 4 5 Previous Next Book Now Unpowered Tent Site No Dogs Camp Kitchen Park Barbeques Tent sites without power. Located on the eastern side of the Park, close to the Gold Coast Highway more Book now Family friendly paradise Situated on the iconic Tallebudgera Creek, this family-friendly paradise offers adventure and relaxation for the whole family. With waterfront cabins, two swimming pools and tennis courts, this park offers an one-of-a-kind holiday experience. Water Front Swimming Pools Playground Accessible Features Camp Kitchen Tennis Court Boat ramp View image gallery Accommodation at Tallebudgera Creek Waterfront Accommodation Sites Cabins Lodging Rooms View all What's new Winter Wonders Await at Tallebudgera Creek Tourist Park Events Winter Wonders Await at Tallebudgera Creek Tourist Park Don't let the cooler months keep you indoors—winter is one of the best times to visit Tallebudgera Creek Tourist Park! View Winter Wonders Await at Tallebudgera Creek Tourist Park post Benny's Inspiring Fundraising Journey News Benny's Inspiring Fundraising Journey His dazzling Christmas lights aren't just for show—they're part of his incredible fundraising efforts for the Leukemia Foundation. Discover resident Benny's inspiring story. View Benny's Inspiring Fundraising Journey post No Bunny does Easter like Tallebudgera Creek Tourist Park! Events No Bunny does Easter like Tallebudgera Creek Tourist Park! View No Bunny does Easter like Tallebudgera Creek Tourist Park! post Celebrate the holidays with us at Tallebudgera Creek Tourist Park Blog Post Celebrate the holidays with us at Tallebudgera Creek Tourist Park We've all been waiting to see what the holiday period has install for our guests....check this out! View Celebrate the holidays with us at Tallebudgera Creek Tourist Park post Spring Bring Fresh Fun to Tally! Events Spring Bring Fresh Fun to Tally! Spring is here and with it new activities have been added these school holidays. View Spring Bring Fresh Fun to Tally! post Let the good times continue! Blog Post Let the good times continue! It doesn't have to be summer for you to enjoy a camping trip.  Check out what we have on offer these winter months. View Let the good times continue! post What our guests are saying Wonderful park.  Great amenities.  Three pools. One just for adults  😃. Lovely food from the onsite food van.  Ice creams and cappuccinos from the store. ... Chris Ashdown Beautiful park nicely located beside Tallebudgera Creek. Short pleasant walk to the beach and awesome headland walk in Burleigh National Park. Clean... Marilyn Kent Book now View park map Park Overview Our Location Nestled right on the banks of the beautiful Tallebudgera Creek, our park is a slice of paradise. With calm, clear waters just steps from your site, it’s the perfect spot for swimming, fishing, paddle boarding, or simply relaxing on the beach. We’re perfectly positioned between Burleigh Heads and Palm Beach, so you’re never far from great cafés, restaurants, and iconic surf breaks. Whether you’re here to unwind or explore, Tallebudgera Creek Tourist Park offers the best of both worlds. One-of-a-Kind Destination Tallebudgera Creek is one of the Gold Coast's most iconic destinations. Spend your days paddling through calm waters, enjoying a beachside picnic, or strolling the scenic boardwalk. The foreshore park has everything you need - playgrounds, BBQs, picnic shelters, and plenty of space to relax with loved ones. Just across the bridge, Burleigh Head National Park awaits with rainforest trails and coastal views. During winter and spring, keep an eye out for whales cruising along the Humpback Highway. Park Facilities Tallebudgera Creek has everything you need for a comfortable and relaxing stay. Two swimming pools: One for all-ages, featuring waterslides and a splash zone, plus a kid-free pool. Tennis court: Enjoy a friendly match or practice your serve in the fresh coastal air. Playground: A large playground with soft-fall located next to the food truck, kiosk and picnic area. Kiosk: Stocking camping essentials like groceries, toiletries, ice, beach items, alcohol and barista-made coffee. Camp kitchens: Fully equipped and ready for you to whip up a meal, whether it’s a quick breakfast or a hearty dinner. Boat ramp: Located just outside the park, perfect for launching directly into Tallebudgera Creek. Local Experiences & Attractions Get up close and personal and learn about Australia's unique wildlife at Currumbin Wildlife Sanctuary . Home to over 1,000 animals and set out across 27 hectares, spend the day connecting in nature. Explore the stories and traditions of the Yugambeh people with guided tours from Jellurgal Aboriginal Cultural Centre through Burleigh Head National Park. The Gold Coast hinterland isn't far. Just 45 minutes away, immerse yourself in ancient rainforests, waterfalls, and breathtaking views. Check out our must-do hikes to experience during your stay. In-Park Activities Families return to Tallebudgera Creek Tourist Park year after year - and it’s easy to see why! During holiday seasons, we host a full calendar of fun including: Movie nights Arts & crafts Live music Wildlife presentations Laser tag Stunt shows Check out our upcoming events and start planning your stay! Guest Information Activities Organised activities are offered in select periods. Information on upcoming activities is available from reception, via notice boards, guest notices and social media. Amenities Please refer to the site map for the location of amenity buildings. Hot water is available for showers, washing machines and basins. Please consider others, limit showers and help conserve water. The amenity blocks are cleaned at least twice a day and may be closed at these times. Please refer to the signs at each facility for cleaning hours, with other times as required. Children under 12 years old must be supervised by an adult. Bathrooms Accessible bathroom There are accessible bathrooms located on the southern side of the Sixth Ave block and at the Third Ave amenities. Access is with a pin code or key (deposit required) from reception. Parents’ bathroom A parents’ bathroom is located at the Third Ave amenity block. Access is with a pin code from reception. Bikes, ride-on equipment and motorised toys For the safety and enjoyment of all guests, only standard bikes and scooters are allowed to be ridden in the park during daylight hours. Road rules must be observed and a safety helmet worn at all times, as required by Queensland law. See reception staff regarding all other ride-on equipment and motorised toys, or for suggested locations to safely use these items. Boom gates Boom gates are for your security. Please follow directions and do not give your security pin to others. Cabin/Lodge/Bunkhouse Care Please report all damage, breakages and losses promptly to our park reception. We ask you to please leave the accommodation in a clean and tidy state. Rubbish should be placed neatly in bins provided (in the accommodation and throughout the park). All washing up to be done and put away clean. Additional cleaning charges and full replacement costs may apply where furniture and equipment is not left as originally found or the accommodation condition on departure is unacceptable. Guests are responsible for the safekeeping and replacement of lost keys. Camp kitchen and barbeques The park map indicates location of the camp kitchen and barbeques. Please respect others, clean up after use and remove only your food from the fridge. Do not place water bottles or ice in the freezer or cooler bags in the fridge. Alcohol and medications are not allowed in the camp fridges and the camp kitchens are smoke-free environments. Check-in time Sites – 11am Ensuites – 12pm Cabins & Lodges – 2pm Check-out time 10am Occupancy after this time will be charged as an additional day. Late check outs – depend on availability. See reception for fees and availability. Site fees are calculated until 10am on the day of departure. If your travel arrangements are inconvenienced by these times, please contact reception to make alternative arrangements. Chemical dump point There are two chemical dump points located in the park – one outside the Third Ave amenities and the other on Acacia Ave. Refer to the park map for exact locations. Dumping of toilet waste in any other area of the park is strictly prohibited. Children Supervising children is vital for their safety and helps make sure they do not disturb other guests. Children under 12 years old must be accompanied by an adult when visiting the amenities and all other park facilities. Conditions of entry As part of the conditions of entry to our park, guests are to abide by Park Rules. These are available from reception or on our website Park Rules page. Customer feedback We hope you enjoy your stay and welcome your feedback which helps us continue to improve our service and facilities. Please share your experience with others by leaving a review on Tripadvisor or Google . Evacuation procedures In an emergency, follow the directions of staff. If we need to evacuate the park make your way directly to our evacuation area – marked ‘Assembly area’ on the map. Fees Fees must be paid in advance. Your unique boom gate code is for one vehicle only. Access is controlled by an Anti-Passback system and is subject to fees paid in advance. Garbage/litter Please help us look after our environment by using the rubbish and recycling bins located throughout the park for your convenience. Wrap all garbage prior to disposal. Gas refills Swap and Go is available at the kiosk. Information For local information, where to eat, activities, events, how to get around and service providers ask our friendly staff in reception. Items for hire See reception for information on items available for hire, including tennis racquets and go-karts. Enquire with staff about local hire companies for other items if required. Kiosk Open daily 7am – 7pm. Closed Christmas day. The kiosk stocks a variety of items including toiletries, milk, bread, ice, alcohol, papers, lollies, cold drinks, ice creams, bait, beach items, etc. Fresh ground coffee – latte / flat white / cappuccino / hot chocolate, and a range of tea – with soy milk options Laundry There are coin-operated machines and dryers in the main amenity blocks. They take $1 coins – change and washing powder is available from reception. Irons and ironing boards are free. Collect clothes from washing lines when dry and remove washing from machines when cycle finishes. Washing dishes is not permitted in the laundry, sinks are available at the camp kitchen and barbeque area. Lost and found Report lost or found items immediately to reception. Mail Mail will be held in reception for current guests or by prior arrangement. Noise Quiet time is between 9pm to 8am. Consider your neighbours by keeping the volume down on radios, televisions and social gatherings. Excessive noise or abusive language will not be tolerated and can result in guests or visitors being asked to leave immediately. Personal information We are required to comply with the Information Privacy Act 2009. Any information you have supplied to us is only used for the purpose that it was collected for. We will not disclose your personal information (including confirming whether or not you are staying in the park) to any person. Should anyone wish to visit you while you are staying in the park, we recommend you contact them to advise where you are located in the park, as we will not pass on this information. Pets For the comfort and safety of guests, pets are not permitted. Placement of caravans We will help you place your caravan on your site. To comply with fire regulations, all vans MUST have the drawbar facing toward the road. Playground The children’s playground is located at the front of the park just north of reception. Smoking is not permitted within 10 metres of the equipment, as per Qld law. Children under 12 years old must be supervised by an adult. Reception Current open hours are published on our website Contact page. For emergency assistance outside office hours, please use the emergency intercom located near the reception entrance door or contact park managers on phone number 0499 611 208 . Refunds Cancellation fees apply. See reception for refund policy or view on our website Terms & Conditions page. Security We’d like your holiday to be enjoyable. Holidaying is a great time to get to know your neighbours and keep an eye out for each other’s belongings. Your security is important to us. We recommend you keep your possessions, vehicles and accommodation safely secured at all times. If you have any concerns speak to one of our friendly staff. Site cleanliness and boundaries Please keep your site tidy and use the facilities provided to dry clothes, discharge sullage water and dispose of rubbish. Make sure your caravan, car and camping equipment stay within your site boundaries. Ropes or fastenings must not be tied to trees, fences or park structures. It is your responsibility to position your camping equipment so that your vehicle fits on your site. If it doesn’t fit, it must be parked outside the park. Swimming pools Pool hours are signed at each pool area. Management reserves the right to change and amend hours as necessary for the safety of park guests. The pool is seasonally heated. For your safety and the comfort of all please note: no glass, smoking or alcohol no diving or running children under 12 years old must be supervised by an adult. Please note the lap pool is a “Kids Free” zone, except for supervised water activities. Tennis court The tennis court is located in the south-eastern corner of the park and is available for your enjoyment from 7.30am through daylight hours. Racquets are available for free hire, requiring a refundable deposit. Please visit reception to book a time on the weekly booking schedule. Children under 12 years old must be supervised by an adult. Vehicles – drive with care The safety of all guests is vital. Please adhere to the eight-kilometre speed limit (walking pace) within the park. Park roads are shared zones. Please follow all road signage and give way to pedestrians. Site fees include one vehicle only. Additional vehicles can be parked in the visitors’ car park. Speak to reception for approval and cost of an additional vehicle on site, pending availability. Water conservation Please conserve water by keeping your showers short and reporting leaking taps to our reception staff. Park Accessibility Tallebudgera Creek Accessibility Guide We are committed to ensuring every guest can have a relaxing and enjoyable stay. We aim to welcome guests with the highest level of customer service and hospitality, regardless of their individual needs. Download Tallebudgera Creek Accessibility Guide Reception and Kiosk The spacious, airconditioned reception area is accessed through a 1m wide automatic sliding door. Ample floor area within the office provides turning space for prams and wheelchairs. An alternate entry door (with handle) has a clear opening width of 770mm. The separate kiosk building and leisure area features ample sized access doors and outdoor space. Please note there is no ramp to the footpath at the front entry. An access point leading from the check-in vehicle bay is available subject to the bay being vacant. A staff member trained in First Aid is always available. Although the park is not pet friendly, service dogs are permitted with full documentation. Camp kitchen and laundry facilities Wide open pathways and a spacious camp kitchen layout make this facility accessible for guests using wheelchairs, walkers and prams. The camp kitchen is equipped with a toaster, microwave, fridge/freezer, bench height of 975mm, barbeque height of 940mm and picnic table height of 850mm with bench seats height of 500mm. An additional sheltered barbeque area located in the northern section of the Park features a fridge and picnic bench seating. Manoeuvrability is limited due to this area’s smaller space. Two large laundry blocks available within the Park are both equipped with washers, dryers, wash basins, irons and ironing boards. The entry door clear opening width is 805mm (Third Ave) and 850mm (Sixth Ave). Both have a 5mm threshold lip. Bench height is 870mm (Third Ave) and 850mm (Sixth Ave); ironing board height is 800mm (Third Ave) and 850mm (Sixth Ave). The laundry off Sixth Ave features large double doors (1800mm width, 5mm threshold lip) accessing the outdoor clothes drying area. Swimming Pools Of the Park’s two swimming pools, the larger resort pool features a fun-filled water play area for toddlers to splash around in. The descending incline into the main pool is designed to facilitate easy access for all guests. Maximum depth is 1.6m. Use of the smaller pool behind Reception is reserved for guests over 18 years of age. This smaller pool has stair access into the water with a hand rail for support. Pool depth is 900mm. Both swimming pools are heated seasonally and access is via wide open pathways. Gates for the resort pool have a clear opening width of 1.2m and gates for the Over 18’s pool 1m. 2 Bedroom Waterfront Cabin - Easy Access Boasting calm waterfront views, the 2 Bedroom Waterfront Cabin features a ramp leading to the front door and an open plan living and kitchen area. This cabin does not meet current fully accessible standards, however it does have ease of access features. Cabin Entry and Parking Parking space: 5900mm x 3600mm (tapering to 1800mm) Entry ramp: 1050mm wide Entrance door: 795mm wide Living Spaces Open plan kitchen and living area Kitchen bench and cooktop height: 900mm Balcony barbeque height: 960mm Balcony sink height: 910mm Bedroom and Bathroom Bedroom door: 670mm wide Queen bed: 650mm high Bathroom door: 800mm wide Toilet height: 440mm Hand-held showerhead, grab rails, and portable shower stool with handles Accessible Bathroom Facility One accessible bathroom is located on the southern side of the Sixth Ave block and the other at the Third Ave block. Doorway clear opening widths are 850mm and 805mm. The floor spaces measure 2.1m x 2.3m and 2.1m x 3.5m. Features include non slip vinyl flooring, hand rails, hand held flexible shower rose and a fold down bench seat. Basin height is 810mm and 740mm. Access is with a pin code or key (deposit required) from reception. Beach access and other information Beach access is via the footpath surrounding the waterfront boundary of the park overlooking Tallebudgera Creek. This level public footpath leads under the motorway to Neptune Beach. Two beach wheelchairs (WaterWheels) are available here and beach matting is rolled out every Saturday during patrol season. Refreshments are available from a café and kiosk. There are many views to soak up along this beautiful creek pathway! City of Gold Coast Mobility Maps The City’s mobility maps are designed to provide accessibility information to assist residents and visitors to plan their stay and move around the city safely. Map information includes the location of accessible toilets, change facilities, accessible car parking spaces, pathway gradients, location of kerb ramps and key buildings and services. Transport information for light rail stations, bus stops and bus routes is also featured. Printed and electronic mobility maps are now available for Broadbeach, Burleigh Heads, Surfers Paradise, Southport Central Business District (CBD) and Broadwater Parklands. Visit cityofgoldcoast.com.au/mobilitymaps for more information. Facilities Accessible bathroom Accessible options Amenities Barbeque facilities Boat ramp nearby Budget family rooms Budget lodges Cabins air conditioned Cabin Easy Access Cabins self-contained Camp Kitchen Drive-thru / Tent sites Dump point Food truck Gas refills / exchange Kiosk / Store Laundry Parents bathroom Playground Swimming Pools Tennis Court Waterfront location Gallery Upcoming events September 11th, 2025 5:00pm - 7:30pm Park't Food Truck View Park't Food Truck September 12th, 2025 12:00pm - 7:30pm Park't Food Truck View Park't Food Truck September 13th, 2025 4:00pm - 5:00pm Gold Coast Seafood Markets - Mr Fishy Truck View Gold Coast Seafood Markets - Mr Fishy Truck Book now Contact Tallebudgera Creek Phone 1300 672 700 Email tally@gctp.com.au Reception hours 8:00am to 6:00pm — Daily, Christmas day closed Stay in touch Stay in that holiday mood all year round. \nSign up below for our latest holiday deals & offers to your inbox… My Name My Email My Postcode Find us here too Follow us on Facebook Follow us on Instagram Follow us on YouTube What our guests are saying Peta Lee Holterman Jacobs Well Lovely spot, nice and clean, very friendly staff. will definitely be coming again. Kate Murray Tallebudgera Creek Loved it. The location is spectacular and the staff are super friendly and helpful. The cabin was clean and had everything needed. We'll be back next year! Paula Bent Jacobs Well FANTASTIC  little CV park Sooo close to Gold C and Sunshine C. New amenities , great staff very helpful 10 out of 10 close to everything you need , pet... Our Parks Jacobs Well Tourist Park Tipplers Campground South Stradbroke Island North Currigee Campground South Stradbroke Island South Currigee Campground South Stradbroke Island Broadwater Tourist Park Main Beach Tourist Park Ocean Beach Tourist Park Burleigh Beach Tourist Park Tallebudgera Creek Tourist Park Kirra Beach Tourist Park Looking For Park Finder What's On Hot Deals Attractions Blog Contact Us About Us Careers Accessibility Guides Pet Friendly Guidelines Campfire Guidelines Park Rules Terms & Conditions FAQs Gold Coast Tourist Parks acknowledges the Traditional Custodians of the land and waterways on which our tourist parks operate. We pay our respects to Aboriginal and Torres Strait Islander Elders past, present and future. © 2021  - 2025 Gold Coast Tourist Parks.\nAll rights reserved. Sitemap Privacy Policy Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://ashoreresortoceancity.com/about-us/contact-us/",
      "text": "Contact Us | Top Resorts near Ocean City, MD | Ashore Resort Skip to menu Skip to content Skip to footer ACCOMMODATIONS ROOMS & SUITES AMENITIES PACKAGES DINING TIDE ROOM THE TAPROOM WAHOO BEACH BAR SHORE DECK ASHORE THINGS WEDDINGS SERVICES WEDDING MENUS GALLERY REQUEST FOR PROPOSAL MEETINGS 2026 EVENT SPACE RENOVATION CONFERENCE CENTER MEETINGS SOCIAL EVENTS EVENT MENUS MEETING GALLERY FLOORPLANS & SERVICES REQUEST FOR PROPOSAL HAPPENINGS HAPPENINGS LIVE MUSIC ASHORE BEACH ABOUT US CONTACT US GALLERY BLOG EXPLORE LOCAL ATTRACTIONS GOLF COURSES BOOK NOW Main Navigation HOME ACCOMMODATIONS ROOMS & SUITES AMENITIES PACKAGES DINING DINING & NIGHTLIFE OVERVIEW SHORE DECK THE TAPROOM ASHORE THINGS TIDE ROOM WAHOO BEACH BAR WEDDINGS WEDDINGS OVERVIEW SERVICES WEDDING MENUS GALLERY REQUEST FOR PROPOSAL MEETINGS 2026 EVENT SPACE RENOVATION MEETINGS & EVENTS OVERVIEW CONFERENCE CENTER MEETINGS SOCIAL EVENTS EVENT MENUS MEETING GALLERY FLOORPLANS & SERVICES REQUEST FOR PROPOSAL EXPLORE EXPLORE OVERVIEW POOL EXPERIENCE LOCAL ATTRACTIONS LIVE MUSIC GOLF COURSES HAPPENINGS HAPPENINGS OVERVIEW HAPPENINGS LIVE MUSIC ABOUT US ABOUT US OVERVIEW CONTACT US GALLERY BLOG BOOK NOW BOOK NOW CONTACT US Get in Touch Questions about your reservation or upcoming trip to Ocean City, Maryland? Please get in touch via our contact form or other contact methods, listed below. Name (Required) First Last Phone (Required) Email (Required) Address (Required) Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Please briefly tell us how we can assist you below & someone from our team will be in touch soon! (Required) 10100 Coastal Highway Ocean City, MD 21842 410-524-3535 Facebook Instagram ACCOMMODATIONS DINING & NIGHTLIFE WEDDINGS MEETINGS & EVENTS EXPLORE ABOUT US VIEW OR CHANGE RESERVATION Stay In Touch Enter your email to get updates and the latest deals Email (Required) PRIVACY POLICY | ACCESSIBILITY ADVICE | SITEMAP This website uses cookies to improve your experience. By continuing to use this site, you agree to our use of cookies. View Privacy Policy Resort Website by O'Rourke 410-524-3535 Book Now X MAKE A RESERVATION Rooms 1 2 3 4 5 Adults 1 2 3 4 5 Children 1 2 3 4"
    }
  ]
}