{
  "fuentes": [
    {
      "url": "https://golfteamproducts.com/",
      "email": "customerservice@golfteamproducts.com"
    },
    {
      "url": "https://golfteamproducts.com/",
      "email": "customerservice@golfteamproducts.com"
    },
    {
      "url": "https://www.heritageharborgolf.com/hoa/",
      "email": "cdelpilar@greenacre.com"
    },
    {
      "url": "https://www.heritageharborgolf.com/hoa/",
      "email": "rleonard@greenacre.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/heritage-bay/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/heritage-bay/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "email": "heritageharbormaintenance@verizon.net"
    },
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "email": "hproshop@tampabay.rr.com"
    },
    {
      "url": "https://www.realtyofnaples.com/Naples/Heritage-Bay-Condos",
      "email": "info@realtyofnaples.com"
    }
  ],
  "mails": [
    "cdelpilar@greenacre.com",
    "customerservice@golfteamproducts.com",
    "heritageharbormaintenance@verizon.net",
    "hproshop@tampabay.rr.com",
    "info@naplesgolfguy.com",
    "info@realtyofnaples.com",
    "matt@naplesgolfguy.com",
    "rleonard@greenacre.com"
  ],
  "nombre_sitio": "golfheritagebay.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://golfteamproducts.com/",
      "text": "Golf Team Products Home Skip to content SHOP SHOP MEN'S MEN'S POLOS T-SHIRTS CREWS & HOODIES LAYERING OUTERWEAR SHORTS & PANTS FOOTWEAR WOMEN'S WOMEN'S POLOS T-SHIRTS & SWEATSHIRTS SLEEVELESS LAYERING OUTERWEAR SKORTS & SHORTS FOOTWEAR HEADWEAR HEADWEAR TEAM - STRUCTURED TEAM - UNSTRUCTURED TOUR VISORS WOMEN'S BEANIES BUCKET GEAR GEAR CUSTOM BALL MARKERS GLOVES TOWELS UMBRELLAS TRAINING AIDS BACKPACKS & BAGS ACCESSORIES TEAM SWAG GOLF BAGS GOLF BALLS GOLF BALLS DOZEN PACKS VARIETY DOZEN PACKS 3-PACK SLEEVES ALL SAVINGS QUICK ORDER CONTACT MY DESIGNS Log in SHOP MEN'S POLOS T-SHIRTS CREWS & HOODIES LAYERING OUTERWEAR SHORTS & PANTS FOOTWEAR WOMEN'S POLOS T-SHIRTS & SWEATSHIRTS SLEEVELESS LAYERING OUTERWEAR SKORTS & SHORTS FOOTWEAR HEADWEAR TEAM - STRUCTURED TEAM - UNSTRUCTURED TOUR VISORS WOMEN'S BEANIES BUCKET GEAR CUSTOM BALL MARKERS GLOVES TOWELS UMBRELLAS TRAINING AIDS BACKPACKS & BAGS ACCESSORIES TEAM SWAG GOLF BAGS GOLF BALLS DOZEN PACKS VARIETY DOZEN PACKS 3-PACK SLEEVES SAVINGS QUICK ORDER CONTACT MY DESIGNS Teamstores Search Login Create Account Cart Item added to your cart Check out Continue shopping Where Golf Coaches Go to Outfit Themselves and Their Teams Quickly and Affordably COACH LOG IN Email Password LOG IN Forgot your password? Refer & Earn Refer & Earn Earn 500 Member Reward Points for each new member you refer who completes their first order. Just log in to access your quick and easy referral link. Free Membership Golf Coaches and Athletic Directors (High School, Junior High, College) Apply Here Educators, Non-Golf Coaches, Club Directors and Organizations Elementary through College Profit and Non-profit Apply Here Questions? 888-254-8624 M-F 6am to 4pm Pacific TEAM STORE LOG IN State Choose your State City Choose your State School Choose your State and City Go to teamstores Can't find your store? Call us at 888-254-8624 Outfitting thousands of teams like yours since 2006 Selection • Speed • Price • Quality • Service GET YOUR TEAM COURSE READY! Our rapid embroidery & print services fulfill orders in about 3 - 10 business days , helping your team proudly represent its school colors as soon as possible. No customization needed? We'll fulfill your order the next day! Sign Up Custom Solutions, Delivered Quickly! In a dynamic market, speed and precision matter. Our Rapid Customization Services deliver high-quality esults in just 3-10 business days. We also offer same-day fulfillment on orders placed before 11 AM Pacific Time that don't require customization . Trust us to keep your team ahead of the game! Sign Up DEEP MEMBER DISCOUNTS Approved Golf Coaches & Athletic Directors get access to our entire selection of top tier performance brands. With no minimum quantity requirements, members always get the deepest discounts off of MSRP whether they're ordering for one golfer or an entire program. IMMEDIATE ACCESS TO OUR LARGE IN-STOCK INVENTORY  at DEEP MEMBER DISCOUNTS Approved Coaches, Athletic Directors, and Activity Directors can access our full range of top-tier performance brands. Enjoy the benefit of no minimum order requirements and receive the deepest discounts off MSRP, whether you're ordering for an individual or an entire program. Experience top-quality gear at unbeatable prices, tailored to your needs. Top Tier Support Golf Team Products prides itself on providing exceptional customer service with understanding & advice a caddie would envy. Our friendly team of customer service reps are eager to assist you with any questions or concerns you may have. CALL US AT 888.254.8624 Monday-Friday 6am-4pm PST Top Tier Support At GTPPlus, we pride ourselves on providing exceptional customer service with understanding & advice on every call we receive. Our friendly customer service team is located on-site and is eager to assist you with any questions or concerns you may have, ensuring a smooth and satisfying experience. CALL US AT 877.688.3262 Monday-Friday 6am-4pm PST FEATURED PRODUCTS M Trucker Hat Log in for Price Vendor: adidas M Trucker Hat Sale Micro Fiber Waffle Golf Towel - 25\" x 15\" Log in for Price Vendor: Golf Team Products Micro Fiber Waffle Golf Towel - 25\" x 15\" Sale Golf Scrubber Log in for Price Vendor: Terry Town Golf Scrubber Sale Windjammer Golf Umbrella with Rubber Grip 62\" Log in for Price Vendor: ShedRain Windjammer Golf Umbrella with Rubber Grip 62\" Sale 1 / of 4 FEATURED PRODUCTS M Trucker Hat Log in for Price Vendor: adidas M Trucker Hat Sale Micro Fiber Waffle Golf Towel - 25\" x 15\" Log in for Price Vendor: Golf Team Products Micro Fiber Waffle Golf Towel - 25\" x 15\" Sale Golf Scrubber Log in for Price Vendor: Terry Town Golf Scrubber Sale Windjammer Golf Umbrella with Rubber Grip 62\" Log in for Price Vendor: ShedRain Windjammer Golf Umbrella with Rubber Grip 62\" Sale 1 / of 4 CURRENT FULFILLMENT TIMES 1 BUSINESS DAY EMBROIDERY 6 BUSINESS DAYS TEES & SWEATS 9 BUSINESS DAYS GOLF BAGS 9 BUSINESS DAYS GOLF BALLS 5 BUSINESS DAYS GOLF TOWELS 7 BUSINESS DAYS Member Rewards Member Rewards Refer & Earn CUSTOMER SERVICE Contact Us FAQ Order Status Return Policy Return Form ABOUT GTP About Us Terms of Use Privacy Policy OUR MISSION We are committed to providing the fastest, most efficient, and highest quality customized golf apparel and uniforms for teams across the United States. Our priority is to ensure that every team is outfitted in a timely manner and not be held back by production delays. Phone: (888) 254-8624 Fax: (888) 687-9799 Email: customerservice@golfteamproducts.com PO Box: 259 Beaverton, OR 97075 Payment methods American Express Discover Mastercard PayPal Visa © 2025, Golf Team Products Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://www.heritageharborgolf.com/hoa/",
      "text": "Home Owner's Associations - Heritage Harbor Golf and Country Club Skip to primary navigation Skip to main content Heritage Harbor Golf and Country Club Lutz, FL Home Golf Course Info Scorecard Hole by Hole Tee Times Facilities Golf Facilities Practice Facilities Pro Shop Double Bogey’s Tavern & Grille Heritage Harbor Golf and Country Club Lutz, FL Lessons Events Outings & Events Tournament Info Request Outing Info SRK Camp HOA Community Development Community Event Calendar HOA Info Home Owner’s Associations Architectural Information HOA Member Area Neighbors Helping Neighbors HOA Documents HOA Meeting Minutes For Sale/For Rent Sign Guidelines Contact Contact Join the Harbor’s E-Club Directions to Heritage Harbor Staff Listing ADA Compliance & Accessibility Home Owner’s Associations ———————————————————————————————————– Heritage Harbor Golf & Country Club is a community of 669 single family homes. Our community is sub-divided into the “villages” of Bridgeport, Brightwater, Bluewater, Monterey Bay, Sea Cove, New Haven and Kings Gate. Our community and Homeowners’ Association is governed by a five-member Board of Directors who conduct monthly Board meetings and one annual meeting each year. Current officers President-Kumar Ganesan Vice President-Marcus Brugger Treasurer-Jeff Witt Secretary-Melissa Chevalier Director-Vibhara Srivastava Hours for HOA amenities Fitness Room: 5:00 AM – 10:00 PM Tennis Courts: 5:00 AM – 10:00 PM Pool: 7:00 AM – 9:00 PM Pool slide: 9:00 AM – 9:00 PM Heritage Harbor is professionally managed by Greenacre Properties Inc. Greenacre is an Accredited Association Management Company as awarded by Community Associations Institute , which is a national organization whose primary focus is education for homeowners, board members, managers, vendors and professionals who provide a service to their communities. Greenacre Properties is headquartered in Tampa. Heritage Harbor is managed by Ray Leonard. Homeowners may contact Ray regarding architectural control and deed restriction concerns or questions( rleonard@greenacre.com ). Ray is on-site weekly to review the property to ensure compliance of the deed restrictions and architectural control as set forth in the recorded Declaration of Covenants, Conditions and Restrictions and/or Guidelines set forth by the Board of Directors. Homeowners are required to submit for approval from the Design Review Board for any exterior modifications to their home or home site. This includes, but is not limited to: fencing, screen enclosures, pools, spas, landscaping, color changes, window/door changes, roofing, etc. ( See Home Improvement Application ) ( See architectural guidelines, standards and criteria ) The members in Heritage Harbor pay a monthly HOA assessment that is collected by Greenacre Properties. These fees are paid with a payment coupon that is sent along to the Association’s bank with the homeowner’s check. Any homeowner who does not have payment coupons should contact Carmen Del Pilar at Greenacre Properties immediately to request them; cdelpilar@greenacre.com or (813) 936-4162. Unless duly noted otherwise, the Board of Directors primarily holds meetings on the last Wednesday of every other month at the clubhouse library, starting at 6:30pm. Page Footer Contact Us Address : 19502 Heritage Harbor Pkwy Lutz, FL, 33558 Email : hhcluboffice@gmail.com Phone : 813-949-6841 Facebook Local Weather Copyright © 2025 Heritage Harbor Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/heritage-bay/",
      "text": "Heritage Bay - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Naples Golf Communities Heritage Bay Heritage Bay is a bundled golf community located in North Naples, Florida. The golf course features 27 holes and was designed by Gordon Lewis and Jed Azinger. Additionally, the fairways are wide open and the greens are quite large. Moreover, the club features a resort-style pool with a full-service outdoor restaurant. Also, the clubhouse has an updated Grille room overlooking the golf course. Members can enjoy a casual dining option for members to enjoy after a round of golf. Beyond golf, club amenities include 7 Har-Tru tennis courts, a fitness center, pickleball courts, bocce courts, and a full social calendar! Finally, the golf course is surrounded by 1,250 single-family homes and condos. Since this is a bundled golf community, your golf membership is included in the purchase of your home or condo. Therefore, your golf dues are included with your regular community fees. Bottom Line The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. Contact us today for more information. Location: Naples Florida Club Type: Private Country Club Membership Type: Bundled Golf Community Real Estate Single Family: $900,000 – $1,999,000 View Homes for Sale Condos: $349,000 – $820,000 View Condos for Sale The Naples Golf Guy Team has more than 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida golf communities. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Golf Memberships 1250 Golf Memberships Is a Golf Membership Required? Yes Non-Resident Memberships Available? No Membership Fees Golf Membership Initiation Fees: Bundled Annual Golf Dues: $9,642 Annual Social Membership Fee: Bundled Annual Social Dues: N/A In bundled golf communities, the Golf or Social membership is included with the purchase of your home. Additionally, there are annual recurring fees associated with the property, as well as one-time fees due at the time of purchase. Potential Fees Include: Master HOA Fee (Annual) Neighborhood HOA Fee (Annual) Food and Beverage Minimum (Annual) Assessments (Annual) Capital Contribution Fee (one-time) Transfer Fee (one-time) Application Fee (one-time) These fees vary by neighborhood within the community. Please feel free to contact us for additional information. Heritage Bay Golf Course Information Opened 2007 Architect Gordon Lewis and Jed Azinger Number of Courses 1.5 (27 Holes) Caddies Available No Practice Range Yes Own Your Own Cart Not on the Course, Yes in the Community Course Ratings / Scorecards Cypress/Pine Par: 72 Holes: 18 Yards Rating Slope Gold 6979 74.1 137 Blue 6314 71.2 130 Black 6137 70.5 127 White 5899 69.5 126 Green 5412 67.3 118 Ladies Tees: Middle 5243 71.0 123 Green 5412 71.8 123 Silver 5073 69.8 122 Red 4729 68.0 118 Oak/Pine Par: 72 Holes: 18 Yards Rating Slope Gold 7020 74.0 137 Blue 6395 71.2 131 Black 6242 70.5 129 White 6013 69.5 127 Green 5449 67.1 119 Ladies Tees: Green 5449 71.6 126 Silver 5081 69.6 121 Red 4788 68.1 117 Cypress/Oak Par: 72 Holes: 18 Yards Rating Slope Gold 7185 74.9 138 Blue 6435 71.4 130 Black 6237 70.8 126 White 6058 70.0 125 Green 5525 67.8 120 Ladies Tees: Green 5525 72.2 128 Silver 5084 69.8 120 Red 4845 68.5 117 Amenities Gated Community 1.5 Private Golf Courses Acqua Driving Range Clubhouse Fitness Center & Studio Spa Community Resort-Style Pool Tennis Courts Bocce Ball Courts Pickleball Courts Where is Heritage Bay Golf & Country Club Located Heritage Bay Golf & Country Club 10010 Heritage Bay Blvd. Naples, FL 34120 239.353.7056 Visit Club Website Back to Naples Golf Communities Note: We make every effort to make sure our information for this Golf Club: Heritage Bay is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "text": "Contact Us - Heritage Harbor Golf and Country Club Skip to primary navigation Skip to main content Heritage Harbor Golf and Country Club Lutz, FL Home Golf Course Info Scorecard Hole by Hole Tee Times Facilities Golf Facilities Practice Facilities Pro Shop Double Bogey’s Tavern & Grille Heritage Harbor Golf and Country Club Lutz, FL Lessons Events Outings & Events Tournament Info Request Outing Info SRK Camp HOA Community Development Community Event Calendar HOA Info Home Owner’s Associations Architectural Information HOA Member Area Neighbors Helping Neighbors HOA Documents HOA Meeting Minutes For Sale/For Rent Sign Guidelines Contact Contact Join the Harbor’s E-Club Directions to Heritage Harbor Staff Listing ADA Compliance & Accessibility Contact Us Heritage Harbor Golf & Country Club 19502 Heritage Harbor Parkway Lutz, Florida 33558 Double Bogeys Tavern & Grille phone (813)949-6841  Ext. 3 Pro Shop and Golf Course phone (813) 949-4886 fax (813) 909-4826 hhproshop@gmail.com Clubhouse Front Desk phone (813) 949-6841 fax (813) 909-4826 hhcluboffice@gmail.com Golf Course Superintendent (813) 909-4336 heritageharbormaintenance@verizon.net Page Footer Contact Us Address : 19502 Heritage Harbor Pkwy Lutz, FL, 33558 Email : hhcluboffice@gmail.com Phone : 813-949-6841 Facebook Local Weather Copyright © 2025 Heritage Harbor Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.realtyofnaples.com/Naples/Heritage-Bay-Condos",
      "text": "Heritage Bay Naples Real Estate: 16 Condos for Sale SIGN IN SAVED 0 Luxury Of Naples Group at Premiere Plus Realty Heritage Bay Naples Florida Condos for Sale Heritage Bay Naples Real Estate Homes For Sale 5 $299K - $1.4M Condos For Sale 16 $280K - $665K Sold ( Past 6 Months ) 38 $275K - $1.3M Last updated at 9:32pm 09/10/2025 COMMUNITIES MLS SEARCH MAP SEARCH NEW LISTINGS COMMERCIAL CONTACT US NAPLES BONITA SPRINGS MARCO ISLAND Heritage Bay Naples Real Estate : 16 Condos for Sale Main Naples Real Estate Heritage Bay Condos for Sale 1 - 24 of 45 Previous 1 2 Next HOMES CONDOS MAP Save this Search Compare Properties Listings Per Page 12 Listings Per Page 24 Listings Per Page 48 Listings Per Page Send Me Updates Subdivision All Subdivisions Terrace The Vistas Sort By Price - High to Low Price - Low to High Living Area - High to Low Living Area - Low to High On Site Since - High to Low On Site Since - Low to High $665,000 Decrease* $34K View Details Heritage Bay 10610 Smokehouse Bay Dr # 102 , Naples , FL 34120 Condos - 1,883 ft² / 2,515 ft² - 2 Car Garage 3 Bed / 2 Baths Built 2011 Heritage Bay Naples Condos for Sale: Welcome to this beautifully updated 3-bedroom, 2-bathroom coach home, perfectly situated in a premier golf community with FULL GOLF MEMBERSHIP. Enjoy serene, panoramic views of a large tranquil lake, where each evening you can unwind while taking in stunning sunsets. The spacious, open-concept floor plan is ideal for both relaxing and entertaining, with abundant natural light pouring through large windows and sliding doors that lead to a private screened lanai. The updated kitchen boasts modern cabinetry, sleek quartz countertops, newer appliances and farm sink making it a chef’s dream. The expansive master suite is a peaceful retreat, complete with an en-suite bathroom featuring dual vanities and a walk-in shower. Two additional generously sized bedrooms provide ample space for family or guests. Other updates include plantation shutters throughout, room darkening, motorized blinds in the living room and primary bedroom, extra attic storage and new epoxy floor in the 2-car garage. As a resident of Heritage Bay Golf and Country Club you will enjoy a 27hole championship course, a world-class clubhouse, all new 'Grille Room' restaurant & bar overlooking the 27th green, a resort-style pool with a Cabana Restaurant & Bar and a formal dining room for special events. Amenities include 7 HAR-TRU tennis courts, pickleball courts, bocce courts, four quiet satellite pools, fitness center, full-time activities director & more giving you full access to world-class facilities and lush fairways. Located just minutes from shopping, dining, and all the best amenities, this home offers an exceptional lifestyle in a highly sought-after location. Don’t miss your chance to own this rare gem! $599,000 View Details Heritage Bay 10020 Siesta Bay Dr # 9026 , Naples , FL 34120 Condos - 1,661 ft² / 1,993 ft² - 1 Car Garage 3 Bed / 2 Baths Built 2010 Heritage Bay Naples Condos for Sale: Extremely rare top-floor end unit with 3 full bedrooms and no side neighbor, featuring an incredible southern lake view! This unique residence comes fully turnkey and move-in ready for an effortless move, complete with a FULL golf membership to Heritage Bay’s 27-hole championship golf course. The \"Abbey\" model Veranda condo features a 1-car detached garage, front AND back screened lanai, and this one has the traditional den/office closed into a bedroom, transforming the layout into a true 3-bedroom condo. Flooded with natural light and offering peaceful southern lake views, this condo has hurricane impact glass and sliders, and was recently refreshed with a newer A/C (2020), freshly painted walls & cabinets with new hardware, and modern furniture and fixtures. Heritage Bay boasts a stunning 27-hole Lewis-Azinger designed golf course and aqua driving range. The grand clubhouse features diverse dining options, elegant event spaces, and a lively social scene. Dine at The Grille Room, a casual indoor/outdoor bar and restaurant with an incredible southern view of the 27th green. Members enjoy a resort-style pool area with heated spa, plus ‘The Cabana’ poolside bar & grille offering a full-service kitchen. The community also offers a top-notch tennis program with 7 har-tru clay courts, pickleball (4 more being added with no assessment) & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay delivers a vibrant, luxurious lifestyle—whether you’re a golf enthusiast or simply seeking serene golf & nature views and elevated living. These condos are super easy to rent in winter at $7500+ a month, which covers all of your costs! $599,000 View Details Heritage Bay 10068 Siesta Bay Dr # 9716 , Naples , FL 34120 Condos - 1,661 ft² / 1,993 ft² - 1 Car Garage 2+Den / 2 Baths Built 2012 Heritage Bay Naples Condos for Sale: Golf membership is INCLUDED with this gorgeous first floor, end unit \"Abbey\" model veranda condo, featuring a stunning southern golf and lake view. The Abbey model is wide & spacious with lots of extra windows for tons of natural light! This condo has been well-maintained and upgraded: freshly painted, added LVP flooring in the bedrooms, wood plank tile in the den, and modern fixtures throughout. The entire condo is hurricane impact glass and sliders for added peace of mind! Heritage Bay features a stunning 27-hole Lewis-Azinger designed golf course and aqua driving range. The grand clubhouse offers diverse dining options, elegant event spaces, and a lively social scene. Have a bite to eat in The Grille Room— a casual indoor/outdoor bar & dining area, with an incredible southern view of the 27th green. Members can also enjoy a resort-style pool area with heated spa & 'The Cabana' poolside bar & grille with a full service kitchen. The community also includes a top-notch tennis program with 7 har-tru clay courts, pickleball & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay ensures a vibrant and luxurious lifestyle for its members. Whether you're a golf enthusiast or simply looking for serene views and luxury living, Heritage Bay offers it all. 2019 special assessment for amenities renovations paid in FULL $599,000 Decrease* $21K View Details Heritage Bay 10020 Siesta Bay Dr # 9016 , Naples , FL 34120 Condos - 1,661 ft² / 1,661 ft² - 1 Car Garage 2+Den / 2 Baths Built 2010 Heritage Bay Naples Condos for Sale: Experience the ultimate in resort-style living in this beautifully updated, turnkey, Abbey end-unit Veranda, ideally located at the private and peaceful end of Boulder Lake. This light-filled 2-bedroom + den, 2-bathroom home is one of the most sought-after floor plans in Heritage Bay Golf and Country Club, with the added benefit of a window in the den that enhances the natural light and provides easy access to the guest bathroom—perfect for hosting family and friends. Step inside to discover an updated kitchen, featuring custom white painted cabinetry, added storage, elegant new granite countertops, a stylish tile backsplash, updated lighting and hardware, and counter-height bar seating ideal for casual dining or entertaining. A dry bar with matching granite surface adds a touch of sophistication to your living space. The primary bedroom features newer upgraded carpeting and the en suite bathroom has been fully renovated with granite countertops, a tub surround, a new shower, frameless glass shower door, and new flooring—all designed with both comfort and style in mind. White cabinetry flows throughout the home, tying each space together with a cohesive, clean look. Enjoy your morning coffee or evening wine from the rear tiled lanai, offering serene views and a quiet escape. With a newer HVAC system and a recently replaced flat-tile roof, this home offers both peace of mind and long-term energy efficiency—an ideal combination of comfort and value. Located just steps from one of five satellite pools, with plenty of guest parking nearby, you’ll find both convenience and tranquility here. The Heritage Bay Enhancement Project assessment has been paid in full, so you can enjoy the enhanced resort without additional cost. As a resident of the bundled community of Heritage Bay, your social calendar will be brimming with possibilities—from 27 holes of championship golf to tennis, pickleball, bocce, a staffed fitness center, and a full-time activities director who ensures there's always something happening. Unwind at the resort-style pool, where the outdoor Cabana offers full-service dining, or gather with friends in the newly expanded Grille Room—ideal for both elegant evenings and casual get-togethers. Whether your passion is golf, racquet sports, fitness, fine dining, or simply having fun, Heritage Bay has it all. Don’t miss the opportunity to own in one of Naples’ most vibrant and amenity-rich gated communities. $530,000 View Details Heritage Bay 10026 Siesta Bay Dr # 9113 , Naples , FL 34120 Condos - 1,414 ft² / 1,414 ft² - 1 Car Garage 2+Den / 2 Baths Built 2011 Heritage Bay Naples Condos for Sale: Live where every day feels like vacation - welcome to Heritage Bay Golf & Country Club! Step into vibrant, resort-style living with this updated and move-in ready 2-bedroom + den, 2-bath Veranda, perfectly located on the first floor with southern exposure and stunning Boulder Lake views. Designed for those who appreciate both relaxing and entertaining, you'll find bright, open living spaces with tile throughout, including both the front and back lanais - perfect for morning coffee or sunset happy hours with friends. The chef-inspired kitchen is ready for your next gathering, featuring new stainless appliances, custom-painted cabinets, granite countertops with breakfast bar seating, under-cabinet lighting, and designer fixtures. Host with confidence thanks to the hurricane-rated screen and outdoor TV cover on the back lanai screened with new no-see-um screens - enjoy the game or a movie night alfresco without worry. The flexible den is currently set up as a cozy media room, but easily doubles as guest space for visiting friends and family. Modern updates continue throughout, including new lighting, floating entertainment center, plantation shutters, upgraded bathrooms, and a laundry room with new washer/dryer and built-in storage. Located just steps from a satellite pool and your own detached garage, convenience is key - whether you're heading out for a round of golf or a night at the club. As a resident of Heritage Bay, your social calendar will be full with 27 holes of championship golf, tennis, pickleball, bocce, a staffed fitness center, and a full-time activities director keeping the events coming. Relax at the resort-style pool with an outdoor Cabana offering full-service dining, or dine and mingle in the newly expanded Grille Room, perfect for both upscale evenings and laid-back get-togethers. Whether you're into golf, racquet sports, fitness, food, or fun - Heritage Bay delivers! Don't miss your chance to own in one of Naples' most exciting gated communities. Schedule your private showing today and join the lifestyle you've been waiting for! $529,000 View Details Heritage Bay NEW 10250 Heritage Bay Blvd # 3622 , Naples , FL 34120 Condos - 1,414 ft² / 1,717 ft² - 1 Car Garage 2+Den / 2 Baths Built 2007 Heritage Bay Naples Condos for Sale: Enjoy gorgeous sunrise water and golf views from your back lanai in this top floor, FULLY RENOVATED \"Coastal Contemporary\" themed Veranda condo at Heritage Bay, Naples' premier bundled golf community. Golf membership is INCLUDED, and no detail has been spared, with upgrades including: NEW A/C 2024; kitchen & both bathrooms updated with white cabinets & \"Ocean Beige\" quartz countertops; matching Whirlpool kitchen appliances & Maytag washer and dryer; hurricane IMPACT glass and sliders throughout. Offered fully TURNKEY & move in ready, with high quality furnishings from Lazyboy, Matter Brothers, and Hammary. The \"Barrington\" model features 2 beds + den, 2 baths, a screened front + back lanai, and a one-car garage, and this one is located extremely close to the clubhouse (less than 1/3 mi!) and all of the resort-style amenities, restaurants, and sports! Heritage Bay features a stunning 27-hole Lewis-Azinger designed golf course and aqua driving range. The grand clubhouse offers diverse dining options, elegant event spaces, and a lively social scene. Have a bite to eat in The Grille Room— a casual indoor/outdoor bar & dining area, with an incredible southern view of the 27th green. Members can also enjoy a resort-style pool area with heated spa & 'The Cabana' poolside bar & grille with a full service kitchen. The community also includes a top-notch tennis program with 7 har-tru clay courts, pickleball & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay ensures a vibrant and luxurious lifestyle for its members. Whether you're a golf enthusiast or simply looking for serene views and luxury living, Heritage Bay offers it all! $519,000 View Details Heritage Bay 10316 Heritage Bay Blvd # 2712 , Naples , FL 34120 Condos - 1,414 ft² / 1,717 ft² - 1 Car Garage 2+Den / 2 Baths Built 2010 Heritage Bay Naples Condos for Sale: Welcome to 10316 Heritage Bay Blvd #2712, a stunning 2?bedroom + den, 2?bathroom Veranda condo with garage nestled within the prestigious gated Heritage Bay Golf & Country Club in North Naples, FL. This first-floor unit offers serene views overlooking a picturesque pond and the championship golf course—a perfect blend of comfort and elegance. UPDATED KITCHEN including extended counter height Quartz counter tops, white cabinets, new refrigerator and microwave range hood. Newer HVAC (2021) and water heater (2025) and all new wood laminated flooring in the bedrooms and den.Large tile on diagonal and crown molding add to the finishes of this beautifully maintained home. $498,000 View Details Heritage Bay NEW 10250 Heritage Bay Blvd # 3615 , Naples , FL 34120 Condos - 1,414 ft² / 1,717 ft² - 1 Car Garage 2+Den / 2 Baths Built 2007 Heritage Bay Naples Condos for Sale: Invest in your golf lifestyle with returns that go beyond the green. Own a Slice of Paradise with Built-In Income Potential! This isn't just a golf getaway - it's a high-performing income asset in a prime Naples location. This beautifully maintained first-floor condo offers the ultimate combination of resort-style living with proven rental income for many years. Located in the exclusive Heritage Bay Golf & Country Club, this turnkey furnished residence is ideal for personal enjoyment, a smart investment, or both. This home attracts renters even in the summer and fall months, and can form part of a sophisticated investment plan for the smart golfer. Leases already secured for season 2026. Stylish tile and wood flooring throughout pairs with sleek stainless steel appliances and impact-resistant windows and doors for added peace of mind. Enjoy peaceful golf course and lake views from your private screened lanai. Heritage Bay's resort-style amenities include 27 holes of championship golf, a stunning main pool and multiple satellite pools, tennis, pickleball, and bocce courts, a full fitness center and sauna, indoor and outdoor dining options, and an active year-round social calendar. Just minutes from Naples white-sand beaches, world-class shopping, dining, and entertainment making this the perfect blend of convenience, comfort, and astute opportunity. $435,000 Decrease* $10K View Details Heritage Bay 10295 Heritage Bay Blvd # 911 , Naples , FL 34120 Condos - 1,408 ft² / 1,544 ft² - 1 Carport 2+Den / 2 Baths Built 2006 Heritage Bay Naples Condos for Sale: This sensational 2+Den/ 2Bath Colonade end unit was just updated with a light and bright modern décor that is sure to please and is being sold turkey. It has a southern facing window in the living area and a western and southern view of the Cypress 16 lake, fairway, and the surrounding preserve. The unique characteristics of the Colonade are an oversized outdoor storage closet, a very private guest bedroom/bath, and a large eat in kitchen with lots of storage and counter space. Heritage Bay is not just a residential community; it is a union of the natural beauty of Southwest Florida, and an active luxury resort with amazing lakes, 27 holes of golf, a fun poolside cabana, luxury clubhouse grill room, active tennis, 6 pickleball, bocce programs, and a full service fitness and aerobics center. There are social events galore and the members are friendly and highly active. Every day is like a vacation with friends, and every property owner is a golf member. $415,000 Decrease* $40K View Details Heritage Bay 10353 Heritage Bay Blvd # 2218 , Naples , FL 34120 Condos - 1,408 ft² / 1,408 ft² - 1 Carport 2+Den / 2 Baths Built 2011 Heritage Bay Naples Condos for Sale: Welcome to this stunning 2-bedroom + den, 2-bathroom condo located in one of the most sought-after luxury golf communities. Offering breathtaking views of the serene lake, pristine golf course, and lush preserve, this home seamlessly blends elegance and comfort. Step inside and be greeted by an open floor plan that’s perfect for entertaining, with large end unit windows that allow natural light to flood the space. Plantation shutters throughout. The spacious living area leads to a private screened-in lanai, where you can unwind while enjoying the picturesque surroundings. The open kitchen is a chef’s dream, featuring stainless steel appliances, beautiful cabinetry, and a large island for casual dining. The master suite is a true retreat, with ample space, a luxurious en-suite bath, and its own stunning views of the lake and golf course. The second bedroom is equally spacious, while the den offers versatility for an office or additional guest space. Featuring wood floors in both bedrooms and hard surface flooring throughout. Situated in Heritage Bay with access to community amenities including a 27-hole championship course, a world-class clubhouse, Grille Room Restaurant & Bar, and formal dining room, 7 HAR-TRU tennis courts, pickleball courts, four quiet satellite pools, state-of-the-art fitness center, full-time activities director & clubhouse, bike and walking paths. Just minutes from fine dining, shopping, and entertainment. Experience the perfect blend of leisure and luxury in this exceptional condo, where every day feels like a vacation. Whether you're a golfer or a nature lover, this location offers something for everyone. Don’t miss the opportunity to make this exquisite condo your own private paradise. $414,500 Decrease* $10.5K View Details Terrace at Heritage Bay 10317 Heritage Bay Blvd # 1418 , Naples , FL 34120 Condos - 1,408 ft² / 1,544 ft² - 1 Carport 2+Den / 2 Baths Built 2008 Terrace Heritage Bay Naples Condos for Sale: Light-Filled First Floor End Unit in Heritage Bay with FULL GOLF MEMBERSHIP. Welcome to easy living in this beautifully updated 2 Bedroom + Den, 2 Bath Colonade floor plan located in the sought-after Heritage Bay Golf & Country Club. Turnkey Furnished with a western exposure with sweeping views of the golf course, lake, and preserve—perfect for enjoying stunning sunsets from your private lanai. Step inside to a light and bright interior featuring new modern lighting and ceiling fans, crown molding, and new flooring in the bedrooms and den. The kitchen boasts a new refrigerator (2024), and the home is equipped with a new washer and dryer (2024), electric shade on lanai doors, and TVs with Firesticks for move-in-ready comfort. Additional features include: Newer A/C (2020) with Eco thermostat, Newer water heater (2023) and covered parking. Turnkey furnished for effortless seasonal or year-round living. Conveniently located within walking distance to the satellite pool. The unit is also perfect for investors or future seasonal residents. Residents enjoy the Heritage Bay lifestyle with 27 holes of championship golf, tennis, pickleball, bocce, resort-style pool with cabana bar, fitness center, and a recently renovated clubhouse offering both fine and casual dining. Plus, a full-time activities director ensures there’s always something happening! Don't miss your chance to own in one of Naples' most vibrant bundled golf communities. $409,990 View Details Heritage Bay 10345 Heritage Bay Blvd # 2022 , Naples , FL 34120 Condos - 1,232 ft² / 1,361 ft² - 1 Carport 2 Bed / 2 Baths Built 2011 Heritage Bay Naples Condos for Sale: Stunning 2-Bedroom Condo in Heritage Bay Golf & Country Club Welcome to this beautifully updated 2-bedroom, 2-bathroom 2nd floor condo in the prestigious Heritage Bay Golf & Country Club! Offering breathtaking views of the water, golf course, and preserve, this move-in-ready home is perfect for those seeking resort-style living in Naples. This meticulously maintained and updated home, offered TURNKEY FURNISHED & DECORATED, is sure to impress even the most discriminating buyer. Many upgrades including new HVAC, Water Heater, Washer and new carpeting in the bedrooms. Prime covered parking in front of building.Freshly painted in the lastest color style. Screened front entry and tiled screened lanai overlooking the golf course. Spectacular TEE to GREEN VIEW of CYPRESS # 13. Heritage Bay has completed a $10 million dollar ammenity enhancement project making it the premier bundled country club community in SWFL. Make this your home TODAY ! $399,000 Decrease* $39K View Details Heritage Bay 10349 Heritage Bay Blvd # 2132 , Naples , FL 34120 Condos - 1,232 ft² / 1,232 ft² - 1 Carport 2 Bed / 2 Baths Built 2011 Heritage Bay Naples Condos for Sale: FANTASTIC VIEW! GOLF INCLUDED! Cozy turnkey 2/2 with screened balcony and open floor plan with amazing views from all main living areas. Community is conveniently located close to shopping, great dining and our spectacular beaches and features 7 HAR-TRU tennis courts, pickleball, bocce, 4 satellite pools, resort style pool with cabana restaurant and bar, 27 hole championship golf course, spectacular clubhouse with restaurant and bar, formal dining room for your special events, and a full time activities director. A beautifully maintained environment to enjoy that perfect Florida lifestyle. Come take a look. You'll know you want to be here! $369,000 View Details Terrace at Heritage Bay 10333 Heritage Bay Blvd # 1716 , Naples , FL 34120 Condos - 1,232 ft² / 1,361 ft² - 1 Carport 2 Bed / 2 Baths Built 2010 Terrace Heritage Bay Naples Condos for Sale: Just renovated! Absolutely gorgeous & fully TURNKEY \"Brookside\" model first floor terrace condo, with golf INCLUDED at Heritage Bay, the premier golf community in SW Florida! With NEW luxury vinyl flooring in both bedrooms, freshly painted walls & cabinets, NEW level 3 GRANITE countertops in both bathrooms, new sinks and light fixtures, and a tremendous water, golf & preserve view, this condo has it all. It's also fully turnkey, MOVE-IN READY! Just bring your golf clubs and swim trunks! Heritage Bay features a stunning 27-hole Lewis-Azinger designed golf course and aqua driving range. The grand clubhouse offers diverse dining options, elegant event spaces, and a lively social scene. Have a bite to eat in The Grille Room— a casual indoor/outdoor bar & dining area, with an incredible southern view of the 27th green. Members can also enjoy a resort-style pool area with heated spa & 'The Cabana' poolside bar & grille with a full service kitchen. The community also includes a top-notch tennis program with 7 har-tru clay courts, pickleball & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay ensures a vibrant and luxurious lifestyle for its members. Whether you're a golf enthusiast or simply looking for serene views and luxury living, Heritage Bay offers it all. $359,900 View Details Terrace at Heritage Bay NEW 10313 Heritage Bay Blvd # 1325 , Naples , FL 34120 Condos - 1,194 ft² / 1,194 ft² - 1 Carport 2 Bed / 2 Baths Built 2008 Terrace Heritage Bay Naples Condos for Sale: Step into this immaculate 2nd-floor “Ashbury” model in Heritage Bay and enjoy the long, scenic views of the lake, golf course, and natural preserve every night, along with a gorgeous sunset! This 2-bedroom, 2-bathroom residence comes fully turnkey, move in ready with high quality, solid wood furniture. Most importantly, this condo INCLUDES a golf membership, so you can enjoy 27 holes of championship golf, along with all of the resort-style amenities, dining options, and pickleball, tennis, & bocce, offering an unbeatable lifestyle from day one. Upgrades include impact-resistant glass and sliders, crown molding, rich solid-wood cabinetry, large diagonal tile flooring, and custom roll-down sunshades on the lanai. Heritage Bay features a stunning 27-hole Lewis-Azinger designed golf course and aqua driving range. The grand clubhouse offers diverse dining options, elegant event spaces, and a lively social scene. Have a bite to eat in The Grille Room— a casual indoor/outdoor bar & dining area, with an incredible southern view of the 27th green. Members can also enjoy a resort-style pool area with heated spa & 'The Cabana' poolside bar & grille with a full service kitchen. The community also includes a top-notch tennis program with 7 har-tru clay courts, pickleball & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay ensures a vibrant and luxurious lifestyle for its members. Whether you're a golf enthusiast or simply looking for serene views and luxury living, Heritage Bay offers it all. With Heritage Bay condos in such high demand, opportunities like this don’t last, schedule your private showing today! Condos in Heritage Bay are FLYING off the shelf, only two remain under 399k, and this one is priced to sell! $279,900 View Details The Vistas at Heritage Bay 9101 Gervais Cir # 1702 , Naples , FL 34120 Condos - 1,200 ft² / 1,200 ft² 3 Bed / 2 Baths / 1 Half Built 2012 The Vistas Heritage Bay Naples Condos for Sale: A Hidden Gem in the Heart of North Naples. This 3-bedroom, 2.5-bath end-unit townhome is nestled in a quiet corner of The Vistas at Heritage Bay, offering a rare combination of natural privacy, comfort, and convenience. Overlooking a peaceful preserve, the home provides a serene backdrop that feels both private and connected. Inside, a bright and open floor plan welcomes you with abundant natural light, a main-floor half bath, and three well-sized upstairs bedrooms—perfect for restful living, guests, or a home office. With no carpet throughout, it offers clean, low-maintenance living designed for modern life. As an end unit, enjoy added windows, soft preserve views, and a quiet ambiance that brings the outdoors in. Located in a gated community with assigned and guest parking, and set in a first response zone for emergency services, the home is minutes from top-rated schools, beaches, shopping, and dining. Comfortable, sunlit, and thoughtfully placed—this home feels like the one you’ve been waiting for. $350,000 View Details Terrace at Heritage Bay 10329 Heritage Bay Blvd # 1622 , Naples , FL 34120 Condos - 1,232 ft² / 1,232 ft² - 1 Carport 2 Bed / 2 Baths Built 2009 Terrace Heritage Bay Naples Condos Under Contract: Experience the ultimate in resort-style living in this fully-furnished, turnkey two-bedroom, two-bathroom Brookside condo at the Terraces in Heritage Bay. This home offers unparalleled amenities including golf, tennis, and pickleball - all included with your purchase in one of the area's premier golf and country clubs. Enjoy spectacular panoramic wide water views of the lake, golf course, and lush preserve from the comfort of your screened and tiled lanai. Watch the golfers putting on the 14th green and teeing off on Cypress 15 or observe the plentiful wildlife that makes it's home in the preserve and lakes. Inside, the condo features impact-resistant windows and doors, a screened entry, newer refrigerator, stainless appliances, granite countertops, and updated lighting and fans. Convenience is built in with easy-access to the stairs or elevator, a nearby storage unit, and assigned covered parking steps away. Just beyond is a satellite pool for your enjoyment. The building has been updated with fresh paint and a newer roof, ensuring worry-free ownership. Heritage Bay is a haven for active lifestyles. in addition to the 27 holes of golf, tennis, and pickleball, the community offers a state-of-the-art fitness center with professional staff, a full-time social activities director, a resort-style pool, 3 bocce courts, an outdoor Cabana featuring full dining options, and an expanded Grille Room. This is more than a home - it's a lifestyle upgrade! $525,900 View Details Heritage Bay 10296 Heritage Bay Blvd # 3124 , Naples , FL 34120 Condos - 1,414 ft² / 1,717 ft² - 1 Car Garage 2+Den / 2 Baths Built 2009 Heritage Bay Naples Condos Under Contract: Experience resort-style living in this stunning 2-bedroom + den Veranda condo located in the prestigious Heritage Bay Golf & Country Club.. This upper-level unit offers breathtaking views of three lush fairways, creating a serene backdrop right from your private lanai. Step inside to find a thoughtfully designed open floor plan with high-end finishes throughout the extensive updates. Enjoy a completely remodeled kitchen with stainless steel appliances, upgraded cabinetry, granite countertops, and a large breakfast bar perfect for entertaining. The spacious primary suite features golf course views, two walk-in closets, and a luxurious completely updated en-suite bath featuring a walk in shower with 2 shower heads...a must see to really appreciate. A versatile den provides the perfect space for a home office or additional guest room. All hard surface flooring and updated dry bar area. Low condo fees! This condo includes a FULL GOLF MEMBERSHIP giving you access to 27 holes of championship golf designed by Gordon Lewis, along with a world-class clubhouse, fitness center, tennis and pickleball courts, resort-style pools, fine and casual dining, and a packed social calendar. With a detached 1-car garage, impact windows, and a prime location just minutes from beaches, shopping, and dining, this is the ultimate Naples lifestyle. Don’t miss your chance to own a piece of paradise in one of Southwest Florida’s most sought-after bundled golf communities! $475,000 View Details Heritage Bay 10260 Heritage Bay Blvd # 3515 , Naples , FL 34120 Condos - 1,414 ft² / 1,717 ft² - 1 Car Garage 2+Den / 2 Baths Built 2007 Heritage Bay Naples Condos Under Contract: Now offered TURNKEY! Fully move-in ready with full golf membership INCLUDED! Recently renovated with NEW quartz countertops, newly painted white cabinets, & all new fixtures for a sleek, modern look. This \"Barrington\" features terrific eastern water sunrise & golf view, extremely close location to clubhouse, resort pool, & all amenities (4 NEW Pickleball courts scheduled to be built soon for 6 total!). Heritage Bay features a stunning 27-hole Lewis-Azinger designed golf course and aqua driving range. The grand clubhouse offers diverse dining options, elegant event spaces, and a lively social scene. Have a bite to eat in The Grille Room— a casual indoor/outdoor bar & dining area, with an incredible southern view of the 27th green. Members can also enjoy a resort-style pool area with heated spa & 'The Cabana' poolside bar & grille with a full service kitchen. The community also includes a top-notch tennis program with 7 har-tru clay courts, pickleball & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay ensures a vibrant and luxurious lifestyle for its members. Whether you're a golf enthusiast or simply looking for serene views and luxury living, Heritage Bay offers it all. 2019 special assessment for amenities renovations paid in FULL $420,000 View Details Heritage Bay 10349 Heritage Bay Blvd # 2121 , Naples , FL 34120 Condos - 1,408 ft² / 1,544 ft² - 1 Carport 2+Den / 2 Baths Built 2011 Heritage Bay Naples Condos Under Contract: Welcome to this beautifully maintained two-bedroom, two-bath Brookside floorplan condo in the sought-after Heritage Bay Golf & Country Club. This move-in-ready unit offers the perfect blend of resort-style living and modern comfort, complete with a full golf membership included in the purchase — a true golfer’s dream! Step inside to find clean, contemporary furnishings that create a fresh and inviting atmosphere. The open-concept living area flows seamlessly on to a spacious screened lanai, where you'll be captivated by unobstructed lake and golf course views — perfect for morning coffee or sunset cocktails. The kitchen features modern finishes, sleek cabinetry, and a breakfast bar ideal for casual dining. The primary suite offers serene views and an en-suite bath, while the guest bedroom provides comfort and privacy for visitors. Updates include a new ceiling fan, new primary shower head, new 75” TV in living room with surround sound, and 55” RV in Primary bedroom. You'll enjoy 27 holes of championship golf, a newly renovated clubhouse, resort-style pools, tennis, pickleball, fitness center, dining, and endless social activities — all just minutes from Naples’ world-class beaches, shopping, and dining. Whether you're seeking a vacation home, investment opportunity, or full-time residence, this Brookside condo delivers luxury, lifestyle, and value. Offered Turnkey Furnished — Just Bring Your Clubs! $365,000 View Details Heritage Bay 10345 Heritage Bay Blvd # 2037 , Naples , FL 34120 Condos - 1,232 ft² / 1,361 ft² - 1 Carport 2 Bed / 2 Baths Built 2011 Heritage Bay Naples Condos Under Contract: Welcome to this stunning 2-bedroom, 2-bathroom luxury condo located on the 3rd floor, offering breathtaking panoramic views of the lush fairways and greens of a prestigious golf course. Nestled within an exclusive, amenity-rich golf community, this condo is the perfect retreat for those seeking an elevated lifestyle. FULL GOLF MEMBERSHIP IS INCLUDED. Step inside to find an open concept living space that combines sophistication and comfort, with expansive windows that let in natural light while framing the spectacular views. The gourmet kitchen boasts stainless steel appliances, quartz countertops, and abundant cabinetry, perfect for both everyday living and entertaining. Newer Air Conditioner, refrigerator, dishwasher and dryer. The master suite features an ensuite bath with spacious shower. This condo includes all memberships to the community’s world-class amenities, including access to the 27-hole golf course, state-of-the-art fitness center, resort-style pool, tennis courts, bike and walking paths, pickleball, clubhouse, bocce ball and three dining options. Whether you’re enjoying a round of golf, relaxing by the pool, or taking advantage of the various social events and activities, this community has everything you need for a resort-style lifestyle. With elevator access, ample storage, and covered parking, convenience is at your doorstep. Don’t miss this rare opportunity to own a piece of luxury in one of the most sought-after golf communities. $720,000 Sold Price: $660,000 Sold Date: 08/15/2025 View Details Heritage Bay 10610 Smokehouse Bay Dr # 202 , Naples , FL 34120 Condos - 2,099 ft² / 2,350 ft² - 2 Car Garage 3 Bed / 2 Baths Built 2011 Heritage Bay Naples Condos: Welcome to this beautifully updated 3-bedroom, 2-bath Coach Home, located in beautiful Heritage Bay and offers the perfect combination of luxury and convenience. This home boasts fresh paint throughout and a newer air conditioner, ensuring comfort and style in every corner. Enjoy breathtaking views of an expansive lake from your private screened lanai — the perfect setting for your morning coffee or evening relaxation. Whether you're watching wildlife or simply taking in the serene sunsets, the lake views create a peaceful backdrop for your everyday life. As a resident of this prestigious community, you'll enjoy a full golf membership, providing access to 27-hole championship course, a world-class clubhouse, Grille Room Restaurant & Bar, and formal dining room, 7 HAR-TRU tennis courts, pickleball courts, four quiet satellite pools, state-of-the-art fitness center, full-time activities director & clubhouse, bike and walking paths. along with a wealth of other amenities, including resort-style pools, and dining options. The neighborhood’s inviting atmosphere is perfect for both relaxation and socializing. This home’s spacious open floor plan is designed to maximize natural light and enhance the flow of indoor and outdoor living. With generous-sized bedrooms, modern finishes, and plenty of storage, and two car garage with room for a golf cart you'll have everything you need for comfortable living in Southwest Florida. Located just minutes from shopping, dining, and entertainment options, this coach home offers the ideal blend of tranquility and convenience. Don’t miss your opportunity to make this dream home your reality $599,000 Sold Price: $570,000 Sold Date: 05/07/2025 View Details Heritage Bay 10240 Heritage Bay Blvd # 521 , Naples , FL 34120 Condos - 1,661 ft² / 1,993 ft² - 1 Car Garage 2+Den / 2 Baths Built 2006 Heritage Bay Naples Condos: Location, location, location! Enjoy the sunrise and a terrific golf & water view of the Par 5 Pine #1 green from this top floor, end-unit 'Abbey' condo. This Abbey is extremely unique as there is no building next to it, allowing for maximum light to enter! Bright & open with upgraded white cabinets, hurricane impact windows & sliders, granite countertops, modern fixtures, crown molding & more. Heritage Bay features a stunning 27-hole Lewis-Azinger designed golf course, complemented by a well-equipped pro shop and aqua driving range. The grand clubhouse offers diverse dining options, elegant event spaces, and a lively social scene. Members enjoy a resort-style pool area with heated spa & 'The Cabana' poolside bar & grille with a full service kitchen. The community also includes a top-notch tennis program with 7 har-tru clay courts, pickleball & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay ensures a vibrant and luxurious lifestyle for its members. Special assessment for the amenities renovations has been paid in FULL. $567,000 Sold Price: $510,000 Sold Date: 04/22/2025 View Details Heritage Bay 10026 Siesta Bay Dr # 9124 , Naples , FL 34120 Condos - 1,414 ft² / 1,717 ft² - 1 Car Garage 2+Den / 2 Baths Built 2011 Heritage Bay Naples Condos: Golf membership included with this nicely renovated, top floor Veranda condo, featuring a southern lake & golf view from the master bedroom & back lanai. Expanded kitchen with all new cabinets, extra counter space and added cabinets, custom California closets, tiled front and back lanai, new carpets and much more! Turnkey and move-in ready with high quality furniture and modern fixtures. Heritage Bay features a stunning 27-hole Lewis-Azinger designed golf course and aqua driving range. The grand clubhouse offers diverse dining options, elegant event spaces, and a lively social scene. Have a bite to eat in The Grille Room— a casual indoor/outdoor bar & dining area, with an incredible southern view of the 27th green. Members can also enjoy a resort-style pool area with heated spa & 'The Cabana' poolside bar & grille with a full service kitchen. The community also includes a top-notch tennis program with 7 har-tru clay courts, pickleball & bocce courts, and a state-of-the-art fitness center. With a calendar full of events and activities, Heritage Bay ensures a vibrant and luxurious lifestyle for its members. Whether you're a golf enthusiast or simply looking for serene views and luxury living, Heritage Bay offers it all. 2019 special assessment for amenities renovations paid in FULL 1 - 24 of 45 Previous 1 2 Next Need professional assistance selling your property at Heritage Bay Naples? Find out how an Area Specialist can help to generate more property exposure in order to get the most money for your investment in the least amount of time. Contact Us. *Just Listed: new properties that came on the market within the last 30 days. *Decrease/Increase: listing values that are being recorded within the last 30 days. *Foreclosures/Short Sale: Please note, all properties are subject to bank approval. Buyers must be pre-approved or show proof of funds before submitting an offer. The data relating to real estate for sale/lease on this web site come in part from a cooperative data exchange program of the multiple listing service (MLS) in which this real estate firm (Broker) participates. The properties displayed may not be all of the properties in the MLS's database, or all of the properties listed with Brokers participating in the cooperative data exchange program. Properties listed by Brokers other than this Broker are marked with either the listing Broker's logo or name or the MLS name or a logo provided by the MLS. Detailed information about such properties includes the name of the listing Brokers. Information provided is thought to be reliable but is not guaranteed to be accurate; you are advised to verify facts that are important to you. No warranties, expressed or implied, are provided for the data herein, or for their use or interpretation by the user. The Florida Association of Realtors and its cooperating MLSs do not create, control or review the property data displayed herein and take no responsibility for the content of such records. Federal law prohibits discrimination on the basis of race, color, religion, sex, handicap, familial status or national origin in the sale, rental or financing of housing. NEW LISTINGS PROPERTY SEARCH COMMERCIAL LISTING TODAY'S MOST VIEWED USEFUL RESOURCES CONTACT US ABOUT US Quail West 6285 Highcroft Dr, Naples, FL 34119 Homes - 5,400 ft² / 6,300 ft² - 4 Car 6 or More / 6 Baths / 1 Half / Pool / Spa $7,850,000 Isles Of Collier Preserve 6867 Saona Ct, Naples, FL 34113 Homes - 1,565 ft² / 2,218 ft² - 2 Car 2+Den / 2 Baths / Pool / Spa $779,000 Virtual Open House: 360° Tour Villagio 10101 Villagio Palms Way # 104, Estero, FL 33928 Condos - 1,018 ft² / 1,018 ft² - 1 Car 1+Den / 1 Baths / 1 Half $299,000 Virtual Open House: 360° Tour Quail West 4453 Brynwood Dr, Naples, FL 34119 Homes - 11,616 ft² / 18,882 ft² - 5 Car 5+Den / 6 Baths / 3 Half / Pool / Spa $8,795,000 Huntington Lakes 6900 Huntington Lakes Cir # 102, Naples, FL 34119 Condos - 1,107 ft² / 1,476 ft² - 1 Car 2 Bed / 2 Baths $324,000 Virtual Open House: 360° Tour Looking to Sell? List with Us! This spot is reserved for your home! Call for CMA and maximize your property's exposure to thousands of potential buyers! Copyright © 2009-2025 Luxury Of Naples Group at Premiere Plus Realty | Terms of Use & Privacy Policy | Sitemap 9015 Strada Stell Ct, Ste. 104 , Naples FL 34109 (239) 321-5012 | info@realtyofnaples.com"
    }
  ]
}