{
  "fuentes": [
    {
      "url": "https://arcadia-fl.gov/departments/golf-course/",
      "email": "jgibson@arcadia-fl.gov"
    },
    {
      "url": "https://arcadia-fl.gov/departments/golf-course/",
      "email": "jgibson@arcadiafl.gov"
    },
    {
      "url": "https://arcadia-fl.gov/departments/golf-course/",
      "email": "pdelaney@arcadia-fl.gov"
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/arcadia/arcadia-municipal-golf-course-159145/rates-tee-times",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520688835165884",
      "email": "golf@arcadia-fl.gov"
    },
    {
      "url": "https://golfarcadia.com/",
      "email": "golf@arcadia-fl.gov"
    },
    {
      "url": "https://golfarcadia.com/home",
      "email": "golf@arcadia-fl.gov"
    },
    {
      "url": "https://www.aspga.com/about-us/board-of-directors/",
      "email": "aloha411@pgahq.com"
    },
    {
      "url": "https://www.arcadiagc.com/",
      "email": "tgore@arcadiagc.com"
    }
  ],
  "mails": [
    "aloha411@pgahq.com",
    "customerservice@golflink.com",
    "golf@arcadia-fl.gov",
    "jgibson@arcadia-fl.gov",
    "jgibson@arcadiafl.gov",
    "pdelaney@arcadia-fl.gov",
    "tgore@arcadiagc.com"
  ],
  "nombre_sitio": "golfarcadia.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://arcadia-fl.gov/departments/golf-course/",
      "text": "Arcadia Municipal Golf Course – City of Arcadia City of Arcadia, Florida City Council Agendas & Minutes Council Meeting Dates News COVID-19 Departments Administration City Clerk Finance Human Resources Job Listings Community Development Code Enforcement Planning & Zoning Arcadia Airport Golf Course Public Works Streets Division Solid Waste Division Parks Division Mobile Home Park Division Cemetery Division Utilities Pay Your Utilities Bill Water Treatment Plant Division Waste Water Treatment Plant Division Water & Sewer System Division Utility Billing Division State Road and City Lighting Division Police Send an Anonymous Tip Biographies Apply for Employment Documents Residents & Visitors Pay Your Utilities Bill Directions Parks Division Events FAQ Code Enforcement Police Arcadia Municipal Golf Course Arcadia Airport – X06 COVID-19 Contact Contact Departments Contact City Council City Council Agendas & Minutes Council Meeting Dates Council Members News COVID-19 Departments Administration City Clerk General Finance Human Resources Job Listings Community Development General Code Enforcement Planning & Zoning Arcadia Airport Golf Course Public Works General Streets Division Solid Waste Division Parks Division Mobile Home Park Division Cemetery Division Utilities General Pay Your Utilities Bill Water Treatment Plant Division Waste Water Treatment Plant Division Water & Sewer System Division Utility Billing Division State Road and City Lighting Division Police General Send an Anonymous Tip Biographies Apply for Employment Documents Residents & Visitors Pay Your Utilities Bill Directions Parks Division Events FAQ Code Enforcement Police Golf Course Arcadia Airport – X06 COVID-19 Contact Contact Departments Contact City Council Home Departments Arcadia Municipal Golf Course Arcadia Municipal Golf Course The City of Arcadia Municipal Golf Course Staff welcomes you to our Pro Shop and Golf Course. Watch for updates to the website for more information on Staff and Management. We hope you enjoy your time with us and if we can assist you in any way, please ask. Check in at the Pro Shop before play. Course Details Rates Membership Tournaments Book Tee Times Arcadia Golf at its Finest The Arcadia Municipal Golf Course abides by the rules of golf published by the USGA.  League and Tournament play should be conducted in compliance with the USGA rules of play, including equipment compliance. Local rules are published on the score card. Please see Pro Shop for any clarifications. Bag storage is available on a first come basis. No bags will be stored on the floor in the bag room as it hinders floor cleaning and waxing. Any bags stored without a current storage agreement on file will be confiscated. Please have your name on your bag to assist staff in insuring your bag is in the proper bag space. Please do not keep any food items in your bag. Bag access when the Pro shop is closed will be based on staff availability. The Arcadia Municipal Golf Course is open 363 days a year from sunrise to sunset. We are closed Thanksgiving & Christmas Day. Directions ARCADIA MUNICIPAL GOLF COURSE REOPENING ARCADIA-MUNICIPAL-GOLF-COURSE-REOPENING.pdf 105.2 KB 1343 Downloads Details Author: Beth Carsten Category: City Council Date: April 30, 2020 The City of Arcadia website is undergoing modifications to provide enhanced access to documents for disabled individuals who are visually impaired and to comply with the requirements of the Americans with Disabilities Act (ADA) to make reasonable accommodations. If you would like to obtain a document not currently provided on the website, please contact our City Clerk, Penny Delaney, at 863-494-4114 Ext. 301 or pdelaney@arcadia-fl.gov . Thank you for your patience and understanding as we implement these changes. Florida has a very broad public records law. Most written communications, to or from local officials regarding city business, are public records available to the public and media upon request. Your email communications may be subject to public disclosure. Search This Site Contact the Golf Course Golf Course – (863) 494-4223 Director – Jeffery A. Gibson, PGA – jgibson@arcadia-fl.gov Read Jeff’s Bio Purchase Gift Card Pay Utilities Bill Online Pay Your Utilities Follow the Golf Course on Facebook Arcadia Municipal Golf Course Search for Loved Ones in the Cemetery Search For Loved Ones Follow us on Facebook The City of Arcadia, Florida Quick Links Contact Public Works Utilities City Council Parks Division Arcadia Municipal Airport – X06 Code Enforcement Police Department News Helpful Websites DART Chamber of Commerce DeSoto County Property Appraisers Municode Categories Job Listings Press Releases Upcoming Events Sep 16 6:00 pm - 8:00 pm Council Meeting Sep 24 5:01 pm - 6:00 pm 2025-26 Final Millage and Budget Public Hearing Oct 7 6:00 pm - 8:00 pm Council Meeting Oct 13 3:00 pm - 5:00 pm Historic Preservation Commission Oct 14 4:00 pm - 5:00 pm Planning & Zoning Board View Calendar Address 23 N. Polk Avenue Margaret Way Building Arcadia, Florida 34266 UNITED STATES Get in touch Follow Us on facebook Contact PHONE: 1 (863) 494-4114 Copyright © 2025 City of Arcadia, Florida Designed by CFRPC ."
    },
    {
      "url": "https://www.golflink.com/golf-courses/fl/arcadia/arcadia-municipal-golf-course-159145/rates-tee-times",
      "text": "Arcadia Municipal Golf Course Tee Times & Rates Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Home GO BACK Filter Tee Times by: Clear filters Date: Number of Golfers: Any 1 2 3 4 Number of Holes: Any 9 18 Price Range per Player: Minimum $ Maximum $ Start Time Range: 5:00 AM 12:00 AM 1:00 AM 2:00 AM 3:00 AM 4:00 AM 5:00 AM 6:00 AM 7:00 AM 8:00 AM 9:00 AM 10:00 AM 11:00 AM 12:00 PM 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM 11:00 PM 9:00 PM 12:00 AM 1:00 AM 2:00 AM 3:00 AM 4:00 AM 5:00 AM 6:00 AM 7:00 AM 8:00 AM 9:00 AM 10:00 AM 11:00 AM 12:00 PM 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM 11:00 PM Apply Filters Home Courses FL Arcadia Arcadia Municipal Golf Course Public N/A No Reviews Yet Arcadia Municipal Golf Course Tee Times & Rates Designed by Gerald Bond/Leonard deBoer and opened in 1927 Arcadia - Arcadia, Florida Showing Tee Times for: Show all filters Thu, Sep 11 Fore! We don't currently offer tee times that match your criteria. You can contact Arcadia Municipal Golf Course directly at (863) 494-4223 to inquire about the tee time you're looking for. In the meantime, here are the nearby tee times we found. Tee Time offers near Arcadia Sort by: Hot Deals First Hot Deals First Price Lowest to Highest Time 7:22 AM BOOK NOW Paradise Golf Course $ 18.79 / Player Thursday, September 11, 2025 Arcadia, FL, 34269 Hot Deals - Prepaid Time 12 Holes 1-4 Golfers 12:30 PM BOOK NOW Paradise Golf Course $ 22.02 / Player Thursday, September 11, 2025 Arcadia, FL, 34269 Hot Deals - Prepaid Time 12 Holes 1-4 Golfers FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520688835165884",
      "text": "Arcadia Municipal Golf Club - Arcadia Municipal | mScorecard Login Sign Up home Home flag Courses contact_support Contact menu Courses Contact Login Sign Up Login Sign Up Home Courses Show Course Arcadia Municipal Golf Club 1769 NE Livingston St 34266 Arcadia, FL USA phone (863) 494-4223 email golf@arcadia-fl.gov desktop_windows https://golfarcadia.com/ Course: Arcadia Municipal course type Golf measurement Yards Please login to view full course information Login Sign Up for Free Men Tees Ladies Hole Par SI Blue White Red Gold Par SI 1 4 -- 286 280 235 255 -- -- 2 5 -- 430 420 333 380 -- -- 3 4 -- 290 285 255 265 -- -- 4 3 -- 171 151 120 135 -- -- 5 5 -- 490 465 413 425 -- -- 6 5 -- 463 440 410 415 -- -- 7 3 -- 214 205 153 166 -- -- 8 4 -- 275 270 240 255 -- -- 9 3 -- 181 175 145 170 -- -- Out 36 2800 2691 2304 2466 36 10 4 -- 320 303 268 273 -- -- 11 3 -- 145 135 105 115 -- -- 12 4 -- 400 390 322 370 -- -- 13 5 -- 465 452 410 427 -- -- 14 4 -- 400 389 343 363 -- -- 15 5 -- 475 452 410 430 -- -- 16 4 -- 397 381 341 361 -- -- 17 3 -- 190 180 160 170 -- -- 18 4 -- 273 257 200 237 -- -- In 36 3065 2939 2559 2746 36 Total 72 5865 5630 4863 5212 72 Men CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- Women CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- Coordinates 90 points stored on 18 holes Your Stats Rounds Played: 0 Average Score: - Best Score: - Worst Score: - First Round: - Last Round: - This page shows golf course information for Arcadia Municipal Golf Club in Arcadia, USA. The golf course has 18 holes and its total par is 72 If the information is incorrect, please let us know using the contact form . © 2025 Velocor Ltd | Terms & Privacy Policy"
    },
    {
      "url": "https://golfarcadia.com/",
      "text": "HOME HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF More HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF 863-494-4223 Follow us on Facebook Tee time Center 2025 SUMMER rates Check it out! banquet room rentals CHECK IT OUT Welcome to the arcadia Municipal Golf course The City of Arcadia Municipal Golf Course Staff welcomes you to our Pro Shop and Golf Course for the 2025 Season. We hope you enjoy your time with us and if we can assist you in any way, please ask. Check in at the Pro Shop before play. Course Hours The Arcadia Municipal Golf Course is open 363 days a year. We are closed Thanksgiving & Christmas Day. Monday - Sunday 7:00 am to 7:00 pm Carts must be returned by 6:30 pm Join our E-Club to keep up with events at the Course Sign up to hear from us about specials, sales, and events. Email Sign up Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Better yet, see us in person! We love our customers, so feel free to visit during normal business hours. * Tee times cannot be booked though this contact us form  -- Please call the Pro Shop Arcadia Municipal Golf Course 1769 Northeast Livingston Street, Arcadia, Florida 34266, United States 863-494-4223 golf@arcadia-fl.gov Get directions Copyright © 2025 Arcadia Municipal Golf Course - All Rights Reserved. HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://golfarcadia.com/home",
      "text": "HOME HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF More HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF 863-494-4223 Follow us on Facebook Tee time Center 2025 SUMMER rates Check it out! banquet room rentals CHECK IT OUT Welcome to the arcadia Municipal Golf course The City of Arcadia Municipal Golf Course Staff welcomes you to our Pro Shop and Golf Course for the 2025 Season. We hope you enjoy your time with us and if we can assist you in any way, please ask. Check in at the Pro Shop before play. Course Hours The Arcadia Municipal Golf Course is open 363 days a year. We are closed Thanksgiving & Christmas Day. Monday - Sunday 7:00 am to 7:00 pm Carts must be returned by 6:30 pm Join our E-Club to keep up with events at the Course Sign up to hear from us about specials, sales, and events. Email Sign up Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Better yet, see us in person! We love our customers, so feel free to visit during normal business hours. * Tee times cannot be booked though this contact us form  -- Please call the Pro Shop Arcadia Municipal Golf Course 1769 Northeast Livingston Street, Arcadia, Florida 34266, United States 863-494-4223 golf@arcadia-fl.gov Get directions Copyright © 2025 Arcadia Municipal Golf Course - All Rights Reserved. HOME RATES CLINICS / LESSONS RANGE EVENTS STAFF BANQUET ROOM RENTAL JUNIOR GOLF Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.aspga.com/about-us/board-of-directors/",
      "text": "Board of Directors – Aloha Section Skip to Content About Us # Board of Directors Section Staff Hall of Fame Tournaments # 2025 Tournament Schedule Mid Pacific Open Rolex Player of the Year Drive Chip & Putt DCP Kauai 2025 DCP Maui 2025 DCP Hawaii 2025 DCP Oahu 2025 Industry Events # Hawaii Golf Conference Hawaii Economic Impact Report Ho’olaule’a PGA Member # Become a PGA Member Employment PGA Coach Playing Ability Test Education Seminars Special Awards Special Awards Nominations HAWAII GOLF ALLIANCE Foundation # Our Mission Tokyu Group Hawaii Golf Scholarship PGA Classic Scramble Partners # Allied Associations 1.808.593.2230 Member Login About Us # Board of Directors Section Staff Hall of Fame Tournaments # 2025 Tournament Schedule Mid Pacific Open Rolex Player of the Year Drive Chip & Putt DCP Kauai 2025 DCP Maui 2025 DCP Hawaii 2025 DCP Oahu 2025 Industry Events # Hawaii Golf Conference Hawaii Economic Impact Report Ho’olaule’a PGA Member # Become a PGA Member Employment PGA Coach Playing Ability Test Education Seminars Special Awards Special Awards Nominations HAWAII GOLF ALLIANCE Foundation # Our Mission Tokyu Group Hawaii Golf Scholarship PGA Classic Scramble Partners # Allied Associations Login Board of Directors Ben Hongo, PGA President  2022 - 2025 Director of Instruction Hongo Golf Edward Kageyama, PGA Vice-President General Manager Pearl Country Club Brendan Moynahan, PGA Secretary - Hawaii Director of Golf Four Season Hualalai Kevin Carll, PGA Honorary President - Oahu Scott Ashworth, PGA Incoming - District 11 Director Director of Golf Four Season Lana'i John Harman, PGA Director - Oahu General Manager Moanallua Golf Course Marcus Judge, PGA Director - Maui Director of Golf Wailea (Gold & Emerald) Larry Keil, PGA Director - Oahu Teaching Instructor Turtle Bay Golf Eddie Lee, PGA Director - Maui Director of Golf Maui Country Club Steve Murphy, PGA Director - Kauai Director of Golf North Shore Preserve Lance Taketa, PGA Director - Hawaii Teaching Instructor Hilo Municipal Golf Course Past Presidents District Directors Executive Directors Past Presidents Year Name 2022 David Havens, PGA 2019 – 2021 Kevin Carll, PGA 2017 – 2019 Eddie Lee, PGA 2015 – 2017 Lance Taketa, PGA 2013 – 2015 Steve Murphy, PGA 2011 -2013 John Harman, PGA 2009 -2011 Scott Ashworth, PGA 2006 -2009 Matthew Hall, PGA 2003 -2005 Ed Kageyama, PGA 2002 Howard Kihune, PGA 2000 -2001 Michael Castillo, PGA 1998 – 1999 Dennis Rose, PGA 1996 – 1997 Joe Root, PGA 1994 – 1995 Chuck Larson, PGA 1992 -1993 Ben Neeley, PGA 1990 – 1991 JD Ebersberger, PGA 1988 – 1989 Dennis Rose, PGA 1984 – 1987 Ben Neeley, PGA 1980 – 1983 Earl Howard, PGA 1975 – 1979 Ron Castillo Sr., PGA District Directors Year Name 2015-2018 Scott Ashworth, PGA 2007-2008 Matthew Hall, PGA 2006-2007 Dennis Rose, PGA 1997-2000 Chuck Larson, PGA 1988-1991 Ben Neeley Executive Directors Year Name 2012 – Present Wesley Wailehua 2010 – 2012 Anthony Valverde 2008 – 2010 Harold Okita Jr. 2007 – 2008 Jim Haugh 2007 Doug Logan 1997 – 2007 Paul Sugimoto 1975 – 1989 Jim Rieley About Us Board of Directors Section Staff Hall of Fame Aloha Section 615 Piikoi Street, Suite 1812 Honolulu, Hawaii 96814 Phone: 1.808.593.2230 Email: aloha411@pgahq.com Navigate Tournaments PGA Member Contact Us HAWAII GOLF ALLIANCE © 2025 Aloha Section PGA View PGA Directory PGA.org PGA.com © 2025 Aloha Section PGA"
    },
    {
      "url": "https://www.arcadiagc.com/",
      "text": "Arcadia Golf Course - Arcadia, CA Email Club Reservations: 626.443.9367 Book A Tee Time Course Rates Golf Course Details Rates Calendar Membership Instruction Tournaments Contact Contact Us Donations Career Opportunities Email Club Welcome to Arcadia Par 3 Golf Course The Hidden Treasure of Los Angeles Golf since 1962 Located at the base of the majestic San Gabriel Mountains just 20 minutes from downtown Los Angeles in Arcadia, California, is an 18-hole par 3 course measuring 1,947 yards, with Poa annua and bentgrass greens, and many challenging bunkers. The course and the practice facility are equipped with lights and remain open extended hours for late-night play. Course Rates Course Details Discover Arcadia Golf Course Golf Instruction Book a Tee Time Footgolf Fun Events Year Round Upcoming Events View Full Calendar Stay Tuned More Exciting Events to Come FOLLOW US @ARCADIAGOLFCOURSE Location 620 E. Live Oak Avenue Arcadia, CA 91006 Get Directions Call Us 626.443.9367 Email Us tgore@arcadiagc.com Follow _ Hours Of Operation Monday: 6:00am - 10:00pm Tuesday: 6:00am - 10:00pm Wednesday: 6:00am - 10:00pm Thursday: 6:00am - 10:00pm Friday: 6:00am - 10:00pm Saturday: 6:00am - 10:00pm Sunday: 6:00am - 10:00pm Proshop closes at 8:30pm daily Lights off at 10:00pm Exclusive Deals Join our mailing list and​ be the first to receive golf updates and tee time deals. Join Our Email Club © 2023 Arcadia Golf Course | Contact Us | Site Map Designed and Hosted by 1-2-1 Marketing Close Home Tee Times Programs Contact Golf Course Details Rates Calendar Membership Instruction Tournaments Contact Contact Us Donations Career Opportunities Email Club height=\"0\" width=\"0\" style=\"display:none;visibility:hidden\">"
    }
  ]
}