{
  "fuentes": [
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://blue-sky-villas.com/en/about-us/",
      "email": "rentals@blue-sky-villas.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "fbmgr@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "bryan.ewart@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "info@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "matt.vincent@golfosoyoos.com"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "email": "ryan.dunkley@golfosoyoos.com"
    },
    {
      "url": "https://golfbluesky.com/golf-course/golf-lessons",
      "email": "mattmo.mm@outlook.com"
    },
    {
      "url": "https://www.headwaters.golf/contactus/",
      "email": "hcc@unitelc.com"
    },
    {
      "url": "https://golfbluesky.com/contact",
      "email": "info@hampton.golf"
    },
    {
      "url": "https://www.blueskygolf-rental.com/contact-us",
      "email": "cadiz@blueskygolf-rental.com"
    },
    {
      "url": "https://www.blueskygolf-rental.com/contact-us",
      "email": "info@blueskygolf-rental.com"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "amelia-river-golf-club-1-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "amelia-river-golf-club-1-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "blue-cypress-golf-club-2-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "blue-cypress-golf-club-2-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "eagle-landing-golf-club-1-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "eagle-landing-golf-club-1-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "hidden-hills-country-club-2-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "hidden-hills-country-club-2-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "royal-st-augustine-golf-country-club-5-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "royal-st-augustine-golf-country-club-5-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "st-johns-golf-country-club-10-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "st-johns-golf-country-club-10-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "stillwater-golf-country-club-1-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "stillwater-golf-country-club-1-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "world-golf-village-king-bear-course-1-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "world-golf-village-king-bear-course-1-s@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "world-golf-village-slammer-squire-course-10-m@2x.jpg"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "email": "world-golf-village-slammer-squire-course-10-s@2x.jpg"
    },
    {
      "url": "https://www.blueskyse.com/about-us",
      "email": "kzayotti@blueskyse.com"
    },
    {
      "url": "https://bluesky-education.com/about-us/",
      "email": "enquiry@bluesky-education.com"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "admin@bhpgc.co.uk"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "carlpcross@aol.com"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "house@bhpgc.co.uk"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "sec@bhpgc.co.uk"
    },
    {
      "url": "https://golfbusinessnews.com/news/corporate/pga-of-america-appoints-reach-foundation-executive-director/",
      "email": "publisher@golfbusinessnews.com"
    }
  ],
  "mails": [
    "admin@bhpgc.co.uk",
    "amelia-river-golf-club-1-m@2x.jpg",
    "amelia-river-golf-club-1-s@2x.jpg",
    "blue-cypress-golf-club-2-m@2x.jpg",
    "blue-cypress-golf-club-2-s@2x.jpg",
    "bryan.ewart@golfosoyoos.com",
    "cadiz@blueskygolf-rental.com",
    "carlpcross@aol.com",
    "eagle-landing-golf-club-1-m@2x.jpg",
    "eagle-landing-golf-club-1-s@2x.jpg",
    "enquiry@bluesky-education.com",
    "fbmgr@golfosoyoos.com",
    "hcc@unitelc.com",
    "hidden-hills-country-club-2-m@2x.jpg",
    "hidden-hills-country-club-2-s@2x.jpg",
    "house@bhpgc.co.uk",
    "info@belfairsgolfclub.co.uk",
    "info@blueskygolf-rental.com",
    "info@golfosoyoos.com",
    "info@hampton.golf",
    "kzayotti@blueskyse.com",
    "matt.vincent@golfosoyoos.com",
    "mattmo.mm@outlook.com",
    "publisher@golfbusinessnews.com",
    "rentals@blue-sky-villas.com",
    "royal-st-augustine-golf-country-club-5-m@2x.jpg",
    "royal-st-augustine-golf-country-club-5-s@2x.jpg",
    "ryan.dunkley@golfosoyoos.com",
    "sec@bhpgc.co.uk",
    "st-johns-golf-country-club-10-m@2x.jpg",
    "st-johns-golf-country-club-10-s@2x.jpg",
    "stillwater-golf-country-club-1-m@2x.jpg",
    "stillwater-golf-country-club-1-s@2x.jpg",
    "world-golf-village-king-bear-course-1-m@2x.jpg",
    "world-golf-village-king-bear-course-1-s@2x.jpg",
    "world-golf-village-slammer-squire-course-10-m@2x.jpg",
    "world-golf-village-slammer-squire-course-10-s@2x.jpg"
  ],
  "nombre_sitio": "golfbluesky.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://blue-sky-villas.com/en/about-us/",
      "text": "About Us | Meet The Team | Blue Sky Villas Algarve JOIN US - Receive our sunny holiday promotions. Subscribe and get a free Premium Welcome Basket on your next holiday! SUBSCRIBE NOW Shortlist\r\n                        ( ) Home Holiday Villas Property Management Concierge Renovations The Algarve About us Contacts Office: +351 289 356 047 rentals@blue-sky-villas.com JOIN US Recieve our sunny holiday promotions. Subscribe and get a free Premium Welcome Basket on your next holiday! SUBSCRIBE NOW About us Home > About us NICOLE Director Founder and owner of Blue Sky Villas in Algarve, Nicole has over 23 years of experience in property management and holiday rentals . In 2007, she decided that it was time to start her own company and has not looked back since. Nicole is here to make sure the company runs smoothly and that the customers and guests are happy, including you. Sidney General Manager Sidney is the youngest of the squad and is half-English, German and Portuguese. He is passionate about outdoor activities such as sailing and long hikes with Gucci – one of the office dogs. As a General Manager at Blue Sky Villas, Sidney oversees the day-to-day operations of the company, and you'll always find him greeting you with a smile. Elisa Rental Agent Straight from the \"Land of the beloved sun\" in Venezuela, there is no doubt Elisa feels right at home in our sunny Algarve. With a background in logistics, design and client relations, she is the perfect fit for our rental department. Her roles vary between managing clients and finding the best options to suit their needs. Elisa will treat you as uniquely as you are :)! Easy-going and a valued team worker, Elisa is our sweet Venezuelan delight. Andreia Rental Director Head of rentals, Andreia is our little firecracker! She makes sure every luxury villa guest has the best moments and enjoys their sunny holidays. The kindest-hearted person, she strives for excellence and 5-star reviews. She keeps the team calm, and as we like to say: everyone deserves an Andreia in their life! Bruna Office Manager & Concierge Phone us, and you'll hear Bruna's wonderful voice. \"Blue Sky Villas, this is Bruna speaking. How can I help you?\". Multi-tasker Bruna makes sure all the office administrative tasks are functioning efficiently and facilitates all communication between our departments. Not only that, but she also coordinates concierge services , helping you book your preferred restaurants, adventurous outdoor activities or in-house massages. Pay us a visit, and Bruna will welcome you with a cheerful smile. PEBBLE Office Dog Our four-legged in-house security. She lets us know of anything that moves outside the office, and she’s also great at being cuddly. Vlad Renovations Supervisor Although he might look big and scary, Vlad has got a heart of gold. Having been a Property Manager for our Blue Sky Villas luxury vacation homes for over 5 years, it only made sense for his transition to Renovations Supervisor. He has the perfect blend of knowledge, skill and experience for this new department of our business. He is hard-working, determined, and gets things done. Passionate about cars, motorbikes, and of course, renovations, Vlad will always make you laugh. Sílvia Senior Property Manager Having worked in the Algarve area for more than 9 years, Silvia has the best knowledge and skills to be our Senior Property Manager at Blue Sky Villas. She won't accept anything other than perfect, and you'll find her extremely focused on her tasks, #exterminator :'). Bubbly and dynamic, her energy levels are always up high! Xavier Head of Maintenance Pronounced \"Sha-vee-air\", Xavier was born in Venezuela and moved to sunny Portugal very young. Now, he has been in our team for 8 years and is a real jack-of-all-trades. Xavier guarantees that any problem you may have at your holiday villa is dealt with quickly and efficiently. Of course, it's unlikely that you will meet him, as he does a great job keeping our properties in tip-top condition. Gucci Office Dog Gucci has an unbelievable amount of energy. She will be happy to meet and greet each and every person who has the pleasure of visiting our office. Selina Marketing Director & Interior Designer Born in Munich, Selina speaks 4 languages fluently and holds a bachelor’s in education and a master’s in interior design. She has an eye for detail and is inspired by of the Algarve’s beautiful surroundings. In charge of all communication strategies, overall branding and of course, everything that makes your property look as gorgeous as it can be, Selina is the creative one in our Blue Sky Villas team. BELLA Office Dog Fairly laid-back and not one to display much emotion, she enjoys long naps. However, when you return to the office, Bella’s voice is sure to let you know how much she’s missed you. At Blue Sky Villas, we navigate the waters, capture images of culinary delights, and  explore the charming streets and beautiful beaches. We are members of a boutique property management company for vacation rentals and luxury villas in Portugal, Algarve. Blue Sky Villas is made up of a team of local employees who have a deep connection to the Portugal area. We strive to create magical moments, unforgettable memories and impeccable service for our owners and guests alike. Dedicated to exceptional service Each member of our team will go above and beyond to ensure that you have access to the best that the Algarve has to offer. From personal recommendations for local attractions and dining spots to ensuring your comfort and satisfaction throughout your stay. With our Blue Sky Villas luxury vacation homes, you can create so many memorable experiences. Whether you’re seeking relaxation, adventure, or a taste of the local culture, our team is here to help make your time in the Algarve truly special. If you have any specific questions or preferences, feel free to let us know so we can tailor our services to meet your needs. Join us Get luxury holiday inspiration and special offers straight to your inbox. Receive special offers straight to your inbox and get super savings on your upcoming holiday. Subscribe and get a free premium welcome basket on your next holiday! Subscribe now Trusted Management Remarkable Rentals Information Holiday Villas Property Management Concierge Renovations The Algarve About us Contact Contact us +351 289 356 047 +351 968 621 603 rentals@blue-sky-villas.com © BLUE SKY VILLAS 2025. All rights reserved Privacy policy Complaints book"
    },
    {
      "url": "https://golfosoyoos.com/contact/",
      "text": "Contact - Osoyoos Golf Club Skip to main content Skip to footer Book A Tee Time Member Ballot Desert Gold Park Meadows Golf Rates Lessons Golf Events Stay & Play Membership Leagues League Results Member Portal Dine & Events Our Club Contact Dine & Events Our Club Contact Book A Tee Time Contact Us Let’s Talk Staff directory and contact information. Contact Information Location Osoyoos Golf Club 12300 Golf Course Drive Osoyoos, British Columbia Canada V0H 1V4 Phone (250) 495-7003 1-800-481-6665 Office Hours Monday – Friday: 8 AM – 4 PM Saturday, Sunday & Stat Holidays: Closed Staff Directory General Manager Bryan Ewart, NGCOA BC Chapter President General Manager T: 250-495-7003 Ext. 213 Golf Operations Matthew Vincent, PGA of Canada Member Head Golf Professional T: 250-495-7003  Ext. 212 Administration Susan Henry Finance Manager T: 250-495-7003 Ext. 215 Emilio Martinez Membership & Office Administration Coordinator T: 250-495-7003 Ext. 214 Course Maintenance Ryan Dunkley Course Superintendent T: 250-495-2323 Food & Beverage Alana Egli Food & Beverages Manager T: 250-495-7003 Ext. 221 Herman Subaru Executive Chef T: 250-495-7003 Ext. 216 Contact Us Complete our inquiry form and we’ll be in touch. Join Our Team We’re always looking for friendly, dedicated individuals who want to be part of a welcoming environment and help create unforgettable experiences for our members and guests. Please see the current job postings below: Finance & Human Resources Manager Apply Now Perched above Lake Osoyoos and sculpted into the desert bench, Osoyoos Golf Club offers a one-of-a-kind golf experience in an unforgettable setting. Every round is a postcard in the making. Subscribe to our Newsletter © 2025 Osoyoos Golf Club. All rights reserved. Privacy Policy. Website designed by Par Six Golf Media Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Apply Now Temporary Online Booking Outage Please note that our online booking system will be unavailable from July 9 to July 11, 2025 as we transition to a new booking and point of sale system. To book/request a tee time during this period, please call the Pro Shop directly at 250-495-7003 or 1-800-481-6665 extension #1. Our team will be available daily from dawn to dusk to assist with your reservation. Thank you for your patience and understanding! Home Golf Lessons Rates Golf Events Stay & Play Membership Leagues League Results Member Portal Dine & Events Our Club Contact Member Ballot Desert Gold Park Meadows Book a Tee Time"
    },
    {
      "url": "https://golfbluesky.com/golf-course/golf-lessons",
      "text": "Pro Golf Lessons & Instruction | Golf Lessons for Kids Jacksonville, FL Membership Become a Member Reciprocal Book a Tee Time Golf Course Course Information Tee Times Golf Lessons Rates TopTracer Toptracer Range Win An After Work Party! Blue Sky Bar & Grill Bar & Grill Private Events Group Golf Events Blog Contact Book Your Tee Time 904.446.2899 1700 Monument Road, Jacksonville, FL 32225 Golf Lessons The Secret to your best game? Golf lessons In Jacksonville, FL at Blue Sky! Is there any better feeling than hitting a shot and having everything go exactly the way you envision it? We’re talking in the world of golf, of course, and we want everyone who plays our Course to experience this magic feeling. Our trademark is that we’re all about making the great game of golf enjoyable for everyone who visits us here at Blue Sky. It’s our belief that golf should be a friendly, enjoyable game. To help you get the most out of your time on the Course, we offer golf lessons in Jacksonville, FL for players at all levels. Why take Golf lessons? It’s the best way to improve your game and have more fun on the Course. Yes, you may start seeing lower scores as a result.  That’s our mission here at Blue Sky, to ensure that everyone has a good time! Golf Lessons for Kids Some of the most important lessons kids can learn are all wrapped up in the game of golf. Here at Blue Sky Golf Club, we instill not just great technique and form in our junior students, but also the life lessons that can be found out on the Course. As Jack Nicklaus said, “Golf teaches you how to behave!” Learn from Golf Pro's Who Know Kids and Love the Game Our Professional Golf Coaches teach kids and teens the basics of form and technique while providing a safe, supportive atmosphere for testing new skills. They also understand that golf isn’t just a test of skills but rather an all-encompassing sport that involves mind, body, and spirit. To that end, junior golf lessons are about confidence. After all, everyone knows you play your best game when you’re calm and focused… that takes confidence, dedication, and a certain level of passion. Our trainers have a passion for the game that shines through in everything they do. From employing state-of-the-art equipment to giving individualized attention to each student, you know they’re putting everything they have into their mission… teaching kids and teens to love the game of golf! Request Additional Information Brian Kibler Phone: (904) 521-2421 Email: b_kibler@ymail.com *Please contact Brian Kibleri for pricing. ------------ Osborn Theam Phone: (904) 207-9289 Email: osborntheam94@gmail.com *Please contact Osborn Theam for pricing. ------------ Matt Moscinski Phone: (904) 866-3775 Email: mattmo.mm@outlook.com *Please contact Matt Moscinski for pricing. Ready to Reserve your Spot? Book Now Become a Blue Sky Golf Club Insider 1700 Monument Road, Jacksonville, FL 32225 | Phone: 904.446.2899 © 2022 Blue Sky Golf Club | Contact Us | Site Map PROFESSIONALLY MANAGED BY HAMPTON GOLF Close Home Tee Times Range Contact Membership Become a Member Reciprocal Book a Tee Time Golf Course Course Information Tee Times Golf Lessons Rates TopTracer Toptracer Range Win An After Work Party! Blue Sky Bar & Grill Bar & Grill Private Events Group Golf Events Blog Contact Book Your Tee Time 904.446.2899 1700 Monument Road, Jacksonville, FL 32225"
    },
    {
      "url": "https://www.headwaters.golf/contactus/",
      "text": "Contact Us - Headwaters Golf Club Skip to main content Skip to footer Headwaters Golf Club Park Rapids, MN Home Tee Times Tee Times Member Tee Times Rates Membership Club Info Lessons Scorecard Driving Range Pro Shop E-Club Sign Up Headwaters Code of Conduct Outdoor Patio Events Upcoming Events Mens League Women’s League Junior Golf Gallery Flyover Contact Us Apply Contact Us Headwaters Golf Club P.O. Box 9 20018 County Road 1 Park Rapids, MN 56470 Telephone: 218-732-4832 Toll free: 866-250-4224 Maintenance: 218-732-3153 Email: hcc@unitelc.com View Larger Map Contact Form Please enable JavaScript in your browser to complete this form. Name: Email: Subject: Message: Comment Submit Footer Copyright © 2025 Headwaters Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://golfbluesky.com/contact",
      "text": "Contact Blue Sky Golf Club Jacksonville FL  Email or Call (904)446-2899 Membership Become a Member Reciprocal Book a Tee Time Golf Course Course Information Tee Times Golf Lessons Rates TopTracer Toptracer Range Win An After Work Party! Blue Sky Bar & Grill Bar & Grill Private Events Group Golf Events Blog Contact Book Your Tee Time 904.446.2899 1700 Monument Road, Jacksonville, FL 32225 Contact Us Blue Sky Golf Club 1700 Monument Road Jacksonville, FL 32225 Phone: 904.446.2899 Email: This email address is being protected from spambots. You need JavaScript enabled to view it. Get Directions Hours of Operation Golf Course Monday 8:00 AM - Dark Tues - Sun 7:00 AM - Dark Driving Range Monday 7:00 AM - 9:00 PM Tuesday 11:00 AM - 9:00 PM Wed - Sun 7:00 AM - 9:00 PM Bar & Grill Mon - Sun 11:00 AM - 9:00 PM Happy Hour Mon - Fri 4:00 PM - 6:00 PM Nominations for Hampton Golf’s Exceptional Service Award, The Orender Service Award . Click Here to Nominate a Team Member. General Information Phone: (904) 446-2899 Ready to Reserve your Spot? Book Now Become a Blue Sky Golf Club Insider 1700 Monument Road, Jacksonville, FL 32225 | Phone: 904.446.2899 © 2022 Blue Sky Golf Club | Contact Us | Site Map PROFESSIONALLY MANAGED BY HAMPTON GOLF Close Home Tee Times Range Contact Membership Become a Member Reciprocal Book a Tee Time Golf Course Course Information Tee Times Golf Lessons Rates TopTracer Toptracer Range Win An After Work Party! Blue Sky Bar & Grill Bar & Grill Private Events Group Golf Events Blog Contact Book Your Tee Time 904.446.2899 1700 Monument Road, Jacksonville, FL 32225"
    },
    {
      "url": "https://www.blueskygolf-rental.com/contact-us",
      "text": "Contact Us Home Book Now Delivery Zones Contact Us Menu My Booking Testimonials Insurance Agent Login Affiliate Login Basket (Empty) Destination Please select the Country you are travelling to and the region. For Example Spain – Malaga Select your destination Algarve Lisbon Alicante Almeria Cadiz Huelva Malaga Murcia Seville Tenerife Belek Resort/Town Please select the resort you are staying at or the nearest town, at checkout you will be asked for your accommodation details. If you are unsure please select “Other please contact Office” or ask us on Live Chat. Select your destination first Delivery Please select the date and time you want us to meet you to deliver the clubs directly to you. Time 06:00 06:30 07:00 07:30 08:00 08:30 09:00 09:30 10:00 10:30 11:00 11:30 12:00 12:30 13:00 13:30 14:00 14:30 15:00 15:30 16:00 16:30 17:00 17:30 18:00 18:30 19:00 19:30 20:00 20:30 21:00 21:30 22:00 Collection Please select the date and time you want us to meet you to collect the clubs directly from you. Time 06:00 06:30 07:00 07:30 08:00 08:30 09:00 09:30 10:00 10:30 11:00 11:30 12:00 12:30 13:00 13:30 14:00 14:30 15:00 15:30 16:00 16:30 17:00 17:30 18:00 18:30 19:00 19:30 20:00 20:30 21:00 21:30 22:00 Contacts And Regional Offices ALMERIA, SPAIN T: 0034 633 896 025 E: This email address is being protected from spambots. You need JavaScript enabled to view it. CADIZ, SPAIN T: 0034 610 663 028 E: This email address is being protected from spambots. You need JavaScript enabled to view it. HUELVA, SPAIN T: 0034 693 810 027 E: This email address is being protected from spambots. You need JavaScript enabled to view it. MALAGA, SPAIN T: 0034 651 740 434 E: This email address is being protected from spambots. You need JavaScript enabled to view it. MAJORCA / MALLORCA, SPAIN T: 0034 666 145 601 E: This email address is being protected from spambots. You need JavaScript enabled to view it. MURCIA & ALICANTE, SPAIN T: 0034 633 896 025 E: This email address is being protected from spambots. You need JavaScript enabled to view it. TENERIFE, SPAIN T: 0034 618 438 826 E: This email address is being protected from spambots. You need JavaScript enabled to view it. ALGARVE, PORTUGAL T: 00351 914 564 525 Chamada para rede movél nacional E: This email address is being protected from spambots. You need JavaScript enabled to view it. LISBON, PORTUGAL T: 00351 916 115 919 Chamada para rede movél nacional E: This email address is being protected from spambots. You need JavaScript enabled to view it. BELEK, TURKEY T: 0090 541 735 7822 E: This email address is being protected from spambots. You need JavaScript enabled to view it. info@blueskygolf-rental.com Contact Us Terms and Conditions Cookies Policy Privacy Policy © Copyright 2020 Blue Sky Golf Rental Ltd | Standard terms and conditions | Cookies Policy | Privacy Policy Blue Sky Golf Rental Lda, Lote 3c - Area C , Zone Empresarial de Loule, 8100-272, Loule, Portugal | NIF: PT 513435905 Website created by Algarve Website Design Home Book Now Check Availability Delivery Zones FAQ's My Booking Testimonials Insurance Agent Login Affiliate Login Contact Us"
    },
    {
      "url": "https://golfscape.com/jacksonville-golf-courses/blue-sky-golf-club",
      "text": "Blue Sky Golf Club ⛳️ Book Golf Online • golfscape™ Explore Destinations Help Log In Sign Up Language Currency How can we help? How can I book a tee time? 1 Navigate to your preferred golf course. Select your date of play, tee time, rentals, and number of players – and then click Book. You will receive an instant email confirmation and your tee time will be guaranteed at the course. Can I modify or cancel a booking? 1 Absolutely! If you are within the cancellation policy of your tee time, navigate to the Manage Booking page to modify or cancel your booking. What is your cancellation policy? 1 You can typically cancel your booking for a full refund within 48 hours of your tee time, but this may vary slightly by course. Cancellation policies are defined by each golf course and are clearly marked during the entire booking process as well as in your email confirmation. Why should I book with golfscape? 1 We are the only service who’s technology operates at all our partner courses – that means tee times and rates on golfscape are sourced directly. So when you make a booking, your reservation is confirmed instantly at the golf course. How can I get more help? 1 You may communicate with us anytime using the button below or email us at [email protected] – we’re happy to help! Contact us Get Started Create Account or sign up with Log In Forgot Password? Log In or log in with Profile My Bookings Log Out Jacksonville Golf Courses Blue Sky Golf Club 8.0 Blue Sky Golf Club Jacksonville Golf Courses Next Previous Show all photos Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations An Arnold Palmer Signature Design, Blue Sky Golf Club just underwent a 1. 5 million dollar renovation. Whether you choose to come out and perfect your game on our lighted driving range, play 18 holes of championship golf or just play one of our unique 9-hole golf options, Blue Sky welcomes all to come out enjoy our new relaxed golfing atmosphere! W read more Blue Sky Golf Club Reviews 8.0 1 2 3 4 5 6 7 8 9 10 All Verified Reviews • 1 rating Published by golfers who booked and played this course back to Blue Sky Golf Club Golf Reviews Sort by Most recent reviews Oldest reviews Highest rated reviews Lowest rated reviews Filter by All reviews All Verified Reviews Published by golfers who booked and played this course Course Details 18 Holes Par 72 6784 yards Parkland Unique Grass Type Designed by Arnold Palmer Club Facilities 62.check Caddy / Golf Carts 62.check Lessons 62.check Dining 62.check Club / Shoe Rental 62.check Locker Room 62.check Golf Shop Weather Today's condition: - Temperature: / • Sunrise: / • Sunset: / ℃ ℉ back to Blue Sky Golf Club Map Location 1700 Monument Road Jacksonville, Florida United States View map We are getting you the best tee time rates at this course Book a Tee Time Select Date of Play Tee Times & Players Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Instant Booking Confirmation Trusted by 1M+ Golfers Free Changes & Cancellations Book a Tee Time More Golf Courses in Jacksonville View all Jacksonville Golf Courses 8.5 472 reviews World Golf Village (King & Bear Course) 8.5 472 reviews St Johns Golf & Country Club 8.5 472 reviews Stillwater Golf & Country Club 8.5 472 reviews Amelia River Golf Club 8.5 472 reviews World Golf Village (Slammer & Squire Course) 8.5 472 reviews Blue Cypress Golf Club 8.5 472 reviews Eagle Landing Golf Club 8.5 472 reviews Hidden Hills Country Club 8.5 472 reviews Royal St Augustine Golf & Country Club Manage Booking Blog: Futuri Visio Golf Course Operators Terms of Use Affiliate Partnerships Privacy Policy Contact Us © 2025 golfscape . All Rights Reserved. |"
    },
    {
      "url": "https://www.blueskyse.com/about-us",
      "text": "About Us — Blue Sky Sports & Entertainment 0 Skip to Content Our Talent Current Roster In Memoriam Talent We've Worked With Our Services Our Work About Blog Careers BOOK TALENT  ➺ Open Menu Close Menu Our Talent Current Roster In Memoriam Talent We've Worked With Our Services Our Work About Blog Careers BOOK TALENT  ➺ Open Menu Close Menu Folder: Our Talent Back Current Roster In Memoriam Talent We've Worked With Our Services Our Work About Blog Careers BOOK TALENT  ➺ ABOUT OUR AGENCY Who We Are At Blue Sky Sports and Entertainment, we are a dynamic team of passionate professionals dedicated to the world of sports and entertainment. With decades of experience, we specialize in creating memorable experiences from major sporting events to intimate entertainment gatherings. We are driven by a love for the industry and a commitment to excellence, ensuring that every project we undertake is a true reflection of our client's vision. What Makes Us Unique Our commitment to excellence means we meticulously match the right talent with your event and business needs. From securing renowned athletes and high-profile celebrities to engaging industry-leading speakers, we ensure that every booking enhances the success of your occasion. BOOK TALENT “In 2003 when I launched Blue Sky Sports & Entertainment, my objective was to create a company that was committed to providing my clients with the best possible service.  In order to accomplish this, I continually rely on my core beliefs of not just treating the services we provide as a business, but by giving each and every client my personal attention and always putting their best interest first.  I pride myself on handling every client and opportunity in a professional manner, with integrity and honesty.” Founder/CEO 781.421.3025 EXPLORE ALL TALENT MENU Home About Our Talent Our Services Our Work Careers Book Talent SERVICES Talent Representation Spokesperson/Endorsements Sponsorships NIL Licensing Event Management Influencer Activation Appearances/Performances/ Speaking Engagements CONTACT kzayotti@blueskyse.com 150 Washington Street Norwell, MA 02061 CONNECT SUBSCRIBE TO OUR NEWSLETTER TO RECEIVE NEWS AND UPDATES Email Address Sign Up Thank you! Blue Sky Sports & Entertainment is a comprehensive talent booking, sports marketing, and event management firm that connects sports and entertainment talent with organizations and individuals planning events. We handle all aspects of talent procurement, marketing endorsements, media representation, event management, NIL licensing, and sports marketing consulting. With our expertise in managing details and creating memorable experiences, we ensure your events and brands are truly unforgettable. Copyright 2025—Blue Sky Sports & Entertainment, LLC  | Privacy Policy | Terms & Conditions"
    },
    {
      "url": "https://bluesky-education.com/about-us/",
      "text": "About Us – BlueSky Education Skip to content Home About Us Destinations Menu Toggle Singapore Australia Malaysia Japan Vietnam China Thailand South Korea News & Media More Menu Toggle Blog Gallery Testimonials BROCHURE WHATSAPP ENQUIRE Main Menu Home About Us Home About Us Destinations Menu Toggle Singapore Australia Malaysia Japan Vietnam China Thailand South Korea News & Media More Menu Toggle Blog Gallery Testimonials Brochures Whatsapp Registration Our Story BlueSky Education is an international EduXperience pioneer and Asia-Pacific’s leading provider of Study Tours. We imbue students and young adults with real, global future-ready skills, along with access to international education and career opportunities. Driven by core educational values, our programmes offer valuable exposure and in-depth cultural orientation for learners of diverse abilities. Fusing differing nationalities and backgrounds, the opportunity for networking and educational leveraging is vast and infinite. Our students are constantly motivated to critique, re-invent and discover; honing functional communication, management and social skills. BlueSky Education nurtures the intellectual, cognitive and sensory faculties of students; preparing them for their foray into the 21st century and beyond. Send Data Send Data Send Data Send Data Send Data Send Data Send Data Send Data Operating in Australia, Singapore, Malaysia, Japan, Vietnam, and the Philippines, our programmes have attracted over 65,000 students globally . BlueSky EduXperience programmes are specifically crafted to provide life-enriching experiences, guiding students towards discovering how to Be Future Ready! Send Data Send Data Send Data Send Data Send Data Send Data Send Data Send Data Send Data Send Data Send Data Send Data Meet the Team Group Management Team Andy Group Chief Executive Officer Andy Group Chief Executive Officer Andy's expertise spans operational leadership, management consulting, and franchising. In education, he has navigated growth from early-stage to high-growth enterprises, serving diverse age groups from K-12 to adult executive education.\nHis prior roles include General Manager for the Asia-Pacific region at global English school Helen Doron, Managing Director (Asia-Pacific) at UK publisher Pearson Education, and Operations Director at Wall Street English overseeing over 100 Asia-Pacific branches.\nAndy's leadership philosophy is built on empowering individuals, fostering collaboration, and championing open communication and empathy. 17 years of experience in K-12 and executive education across Asia Beyond the boardroom, Andy prioritizes family time and personal growth, indulging in self-development, swimming, and golf. As Group CEO of BlueSky Education, He is dedicated to leveraging expertise and passion for transformative change, with an unwavering commitment to positively impact our industry and the lives of those we serve. Let's chart a course toward unparalleled success and meaningful impact together. Jessica Director Jessica Director Jessica is deeply passionate about international education, having experienced the full journey of cross-border learning herself. She has a profound appreciation for how exposure to diverse cultures and countries can profoundly expand one's perspective and unlock amazing global education and career opportunities. Her time as an international student at the University of Southern California in the United States, in particular, has shaped her globally-minded perspective. Additionally, Jessica holds a dual-bachelor's degree in Business Management and Finance from the National University of Singapore and the University of Southern California (USA). Currently based in Singapore, Jessica lives with her husband, two young sons, and their beloved golden retriever, Jake. When not dedicated to her work, she enjoys the tranquillity of yoga, the rejuvenation of swimming, and the enrichment of travelling the world. Mai General Manager Mai General Manager Mai is an experienced education and business development professional with over 15 years of work experience in the USA, Singapore and Australia. She's worked with top global educational institutions such as National University of Singapore (NUS) and INSEAD business school, in recruitment, business development, built and grown educational ventures. Mai holds an MBA degree from Macquarie Business School (Australia) and a Certificate in Global Management from INSEAD Business School (France/Singapore). Since the inception, Mai has been a member of the founding team at BlueSky Education. She currently lives in Sydney and manages the BlueSky Education Australia team to deliver best-in-class innovative & thematic study tours for high school and corporate clients from overseas. 17 Years Experience in Education and Business Development Professional In her free time, Mai enjoys yoga and cooking. The physical and mindful practice of yoga helps her stay fit and relax. She also takes pleasure in the creativity and sharing involved in cooking. Australia Team Linda Academic Manager Linda Academic Manager Linda has gained extensive experience over the course of 16 years in the education sector, focusing on teaching, coaching, mentoring and curriculum design. Her main area of expertise lies in enhancing teacher competencies in English language acquisition. In addition to her work in education, she has also made contributions to human resources, with a focus on improving employee engagement and development. Linda has proven adept at tailoring educational programs for diverse audiences, including primary, secondary and international students with varying linguistic backgrounds. Her broad experience has equipped her with the skills to monitor progress, drive continuous improvement and lead learning and development initiatives. 16 Years Experience In Education Sector 3 Years Experience In Human Resources Sector Linda is the proud mother of three wonderful children who consistently keep her and her husband on their toes. Their family is enthusiastic about travelling and immersing themselves in the diverse cultures of our incredible world. During her leisure time, Linda enjoys maintaining an active lifestyle by attending the gym and participating in outdoor activities. Monica Operations Manager Monica Operations Manager Monica is a highly skilled Study Tours Operations Manager with a wealth of expertise in tourism management. With a profound understanding of the intricacies of the industry, she excels in orchestrating seamless study tour experiences for participants. Monica's background in tourism, coupled with her passion for education and travel, positions her as a dedicated professional in shaping transformative study tour journeys. 4 Years Experience In Hospitality and Tourism Combined A dedicated woman driven by love for her family and passion for her work, seeking to make meaningful contributions to both spheres of her life. With a heart deeply rooted in familial bonds and a career she adores, she strives to create a harmonious balance between personal fulfilment and professional success. Embracing each day with gratitude, she cherishes the moments shared with loved ones and the opportunities to thrive in her chosen field. Laura LATAM Sales Manager Laura LATAM Sales Manager Laura Araujo brings over 14 years of experience in the education sector , having worked as both an English teacher and coordinator for a big language center franchise in Brazil. She holds a Bachelor's degree in Languages from UNISANTOS, Brazil, and has dedicated her career to helping students developing skills on learning English as a second language to help them grow and achieve their goals. Laura spent six years living in Australia, where she deepened her expertise by studying Business Management and teaching English to students from diverse cultural and professional backgrounds. In 2022, she joined BlueSky as Academic Manager and Business Developer, contributing to both academic excellence and business growth. Now back in Brazil, Laura leads as the LATAM Sales Manager, focused on expanding BlueSky’s presence and building strong relationships across the region. Outside of work, Laura’s passion for movement and creativity shines through — she graduated as a classical ballerina in 2007 and has never left the dance floor since. A former drummer in several bands, Laura’s artistic side reflects her creative and dynamic personality. Today, she finds balance by staying active through dance, yoga, swimming, and gym sessions, always aligning her physical well-being with mental health and family life. Ryo Japan Sales Manager Ryo Japan Sales Manager Ryo brings a strong background in education, customer service, and cross-cultural communication. After starting his career as a junior high school teacher, he developed a deep understanding of the challenges students face when learning English and considering study abroad opportunities. Now based in Australia, he is passionate about supporting students in their international education journeys. With over eight years of experience in hospitality and team leadership, Ryo excels at building relationships, solving problems, and delivering exceptional service. His ability to connect with students, teachers, and partners helps create positive, lasting experiences for all involved in our study tour programs. Ryo is dedicated to growing the Japanese market and ensuring every student’s experience in Australia is meaningful and memorable. 8 Years in Hospitality / High School Teaching Julian Customer Success Manager Julian Customer Success Manager With a background in customer service and VIP account management at eBay North America, T-Mobile, and Athletic Greens, Julian now serves as a Client Success and Sales Support Manager at BlueSky Education. Known for their commitment to personalized support and fostering strong client relationships, they excel in delivering exceptional service and driving organizational growth. At the heart of Julian's approach lies a deep dedication to empowering clients, promoting collaboration, and championing open communication and empathy. Beyond the professional realm, Julian prioritizes personal growth through self-development activities and cherished time with family. 4 Years Experience In Customer Service and Success Manager Singapore Team Miwa Senior Sales Manager Miwa Senior Sales Manager Miwa has cultivated a successful career in sales within the HR solution and educational tour industry since 2011. Her expertise lies in managing the Japan market for BlueSky, where she assumes a pivotal role. In addition to her responsibilities, she actively collaborates with team members and local partners to enhance the BlueSky Education programme. Miwa's commitment to client satisfaction is evident as she diligently incorporates their feedback into programme development and refinement. Her notable achievements include consistently achieving sales targets, fostering strong client relationships, and delivering exceptional service with strong commitment to client satisfaction. 13 years Experienced Sales Professional In HR Outsourcing & International Educational Sector Combined During her free time, Miwa enjoys time with her friends, hitting the gym, experimenting on new food recipes and food hunting around the nation. Grace Group Accountant Grace Group Accountant Grace is a member of Institute of Singapore Chartered Accountants (ISCA) and Association of Chartered Certified Accountants (ACCA) Certified Accountant with over 5 years experience in external audit field and over 10 years experience in the commercial accounting sector. Her experience in the preparation and analysis of financial information as well as budgeting and cash flow management. 15 Years Experience In Audit & Accounting Sector Combined Firdaus Senior Operations Manager Firdaus Senior Operations Manager Firdaus' professional experience includes 6 years as an Outdoor Adventure Educator at the Ministry of Education (MOE), where he conducted adventure camp activities and facilitated student reflection and learning. He planned and customized programs based on the students' needs, working closely with various stakeholders to enhance the quality of the programs. He has been recognized for his outstanding contributions, earning the MOE Excellent Service Award (Silver), the MOE Outstanding Contribution Award (Team), and a National Award for his efforts during the COVID-19 pandemic. 6 Years Experience In Education and Outdoor Adventure Specialist Actively passionate for the outdoors and often engages himself in sports during his free time. He is committed to ensuring the physical and emotional well-being of his loved ones, modeling a balanced approach to work and personal life Trysha Operations Manager Trysha Operations Manager Trysha Raquepo is an experienced Operations Manager with a strong background in the education and outdoor recreation industries. Over the past 3 years, she has demonstrated her expertise in operationally running facilities that cater to children and adults. Trysha Raquepo initially joined BlueSky Education as a freelance Camp Manager in 2022 after gaining 1.5 years of experience as a freelancer in the outdoor education industry. Prior to that, she honed her skills in digital and social media marketing while working at various marketing companies, where she excelled at social media management and video production. 5 Years Experience In Education and Marketing I'm all about cats, cameras, and hitting the road. Photography and videography are my passions, especially when I'm off exploring new places. You'll often find me at the gym, staying active and healthy. And when I'm not working out, I love chilling with friends, belting out tunes at karaoke nights. Jinming Academic Manager Jinming Academic Manager Jinming is a seasoned professional with a rich background in psychology, education, and entrepreneurship. With over 10 years of experience in curriculum design and 4 years in business development, he has honed his ability to create innovative educational programs that maximize learning outcomes. His expertise lies in blending creative solutions with evidence-based strategies to develop curricula tailored to the diverse needs of learners. In business development, Jinming has been instrumental in identifying new opportunities, building strategic partnerships, and driving sustainable growth. With a deep understanding of human behavior, Jinming’s approach to education and business development is both holistic and impactful, ensuring that educational initiatives not only foster intellectual development but also prioritize the well-being of individuals. His entrepreneurial mindset drives him to continuously seek new ways to make meaningful changes and explore ventures that combine his passions for education and business. Outside of his professional pursuits, Jinming is an avid reader and writer, always looking to expand his knowledge and share insights through writing. He is also dedicated to maintaining his physical health through regular gym sessions and enjoys the art of magic, which fuels his creativity and enhances his problem-solving abilities. Jeorgy Customer Success Manager Jeorgy Customer Success Manager As a Customer Success Manager, I focus on building strong client relationships and ensuring their satisfaction. With a background in customer service, I excel in understanding and addressing their needs promptly. I'm committed to proactive communication and using feedback to enhance our services continually. Whether it's guiding clients through onboarding or troubleshooting issues, I'm dedicated to being a reliable partner in their success journey. My goal is to provide exceptional support and maximize their experience with our product or service. With a blend of empathy and expertise, I strive to make every interaction positive and impactful. 5 Years Experience In Customer Service and Success Manager As a cat and dog owner who feeds stray animals wherever I go, I have a deep love for all creatures. Alongside my husband, I travel to experience the diverse cultures of the Philippines, enriching our lives with new traditions and experiences. Mie Operations and Customer Liaison Assistant Manager Mie Operations and Customer Liaison Assistant Manager Mie hails from a fascinating travel industry background in Japan. Her expertise is in sales and customer liaison. She has worked in the field of memberships and club benefits. Making the move to Singapore from Japan was an intuitive one for her because she has roots in this tropical island. Specialising in consultation sales to Japanese clients, she is a firm advocate of client success and satisfaction. Mie pursued global communications academically and enjoys exploring nuances in languages and cultures. For leisure, Mie relishes retail therapy and nature trails. She believes in a balanced lifestyle and recharges through memorable times with family and friends. Sally Marketing Manager Sally Marketing Manager Sally brings with her 8 years of extensive experience in marketing , spanning the travel and healthcare industries. Her expertise includes SEO, SEM, social media, email marketing, content creation, advertising, events, and partnership management. As a passionate brand professional, she constantly seeks creative avenues which exemplifies the best of any entity she works for. Sally is a keen collaborator and believes in the seamless execution of tasks from beginning to end. Her competency skill-sets include leadership, teamwork, problem-solving, crisis-response and task management. In her free time, Sally enjoys fitness and culinary pursuits. A believer in professional development, she immerses in courses that enhances her marketing and branding expertise. Mingsy Group Graphic Designer Mingsy Group Graphic Designer She is a passionate and creative designer with 8 years of experience in the design industry . Specializing in branding and corporate identity, she has worked with clients from various industries. In her free time, she values fitness and enjoys going to the gym, which helps inspire her work. She is always eager to collaborate on new projects, bringing fresh perspectives and innovative ideas to drive brand success and growth. Vietnam Team Alice Partnership Director Alice Partnership Director Chuong Student Recruitment Manager Chuong Student Recruitment Manager With over 10 years of experience in the education field, Pham Thai Chuong is dedicated to sharing his expertise and supporting clients in designing and coordinating impactful educational programs. As the Vietnam Recruitment Manager at BlueSky Education, Chuong leverages his strong background in teaching and curriculum development to help students boost their learning paths and empower clients to meet their educational objectives. 10 Years Experience In Education Sector China Team Matthew Chief Representative of China Matthew Chief Representative of China As the Chief Representative and founding team member of Blue Sky Education in China, I bring nearly two decades of expertise in the education sector, specializing in brand strategy, product innovation, market expansion, and cultivating relationships with high-net-worth clients. My role centers on spearheading the growth and localization of Blue Sky’s bespoke educational programs in China, ensuring they align with the needs of students seeking transformative global learning experiences. Driven by an unwavering passion for education and a deep sense of social responsibility, I am committed to designing and delivering programs that empower students to broaden their international horizons, pursue their passions with courage, and take ownership of their futures. Education, to me, is not just a career—it is a lifelong mission to inspire individuals to unlock their potential and thrive in an interconnected world. Beyond my professional endeavors, I cherish moments spent with my family, finding joy in simple, meaningful connections. An avid traveler and cultural explorer, I immerse myself in diverse communities worldwide, savoring local cuisines and studying innovative educational practices. These experiences fuel my vision of integrating global excellence into Blue Sky’s offerings, ensuring every student gains access to the finest educational opportunities. I believe education is the cornerstone of personal and societal progress. Through Blue Sky Education, I strive to bridge cultures, ignite curiosity, and equip students with the tools to navigate and shape a dynamic world—one life-changing journey at a time. Why Choose Us Our Programmes Our flagship Public Speaking & Leadership programme focuses predominantly on verbal\ncommunication in English. In addition, we also have bespoke programmes in each country, \n ranging from Green Technology and Robotics in Singapore to Sustainable Future and STEM\nin Australia. There is something for everyone at BlueSky Education! Teachers All teachers at BlueSky Education are qualified and experienced in their subject, ensuring that students get the most out of their classes. We also provide access to top university faculty members and students upon request. Accommodation We can offer university and boarding school full-board accommodation, giving students an immersive study-abroad experience. Homestay options are also available in Australia to fully immerse students in local everyday life. Skills At the end of the programme, students come away with not only educational and cultural\nexperience but also return home with life skills that they can take forward throughout their lives. Some of the skills students learn to include resilience skills, leadership and teamwork, time management, confidence in communication, resourcefulness, responsibility, and how to be independent. We even teach them basic first aid skills! Culture Being open and embracing new cultures is an important part of life, especially as more and more people consider themselves citizens of the world. Students learn about local cultures, foods, religions, and practices via varied excursions. Students also participate in cultural workshops and exchange programmes with local students (subject to availability). Empower your students to reach their educational goals while exploring a foreign destination! Send Data Send Data Send Data Send Data Send Data Send Data TA03793 Official Partner Our Locations Singapore 9 Temasek Blvd, #07-01 Suntec Tower 2, Singapore 038989 Send Data Send Data Send Data Send Data Japan Level 9, Ariake Frontier Building Tower B, 3-7-26 Ariake Koto-ku, Tokyo, 135-0063 China 8/F, TianAn Life Centre, No.285 Linhe East Road, Tianhe District, Guangzhou, China Brazil Av. Ana Costa, 433 – 4º andar – Gonzaga, Santos – SP, 11060-003 Australia WeWork, Level 3, 383 George Street, Sydney NSW 2000, Australia Vietnam 51 Phan Boi Chau, Hoan Kiem Dist., Hanoi Email Us enquiry@bluesky-education.com Send Data Send Data Send Data Send Data Stay Informed Sign up to our Newsletter. Send Data Send Data Send Data Send Data Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * Email * Subscribe Legal Privacy Policy Sitemap Copyright © 2025 BlueSky Education | All Rights Reserved. Facebook-f Icon-instagram1 Youtube Translate » Scroll to Top"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "text": "Contact Us | Buxton and High Peak Golf Club Members Login Buxton and High Peak Golf Club Menu Home Course Tour of the Course Scorecard Course Record Holders Local Rules Rules of Golf - Etiquette Greens Our Greens, Fairways and Staff.... How To Repair A Pitch Mark How To Rake A Bunker Tips On Avoiding Slow Play How To Read Greens Better Sponsorship Opportunities Sponsorship Packages Our Current Sponsors Club History The Club History A message from a Centenary golf ball. The Spirit Of Christmas Early Days Jack Simpson - The First Professional The Debenture Records Golf Club Archaeology Old Map of BHPGC The Clubhouse - A Tale of Two Clocks Centenary News A who's who of Club Competitions & Cups The Buxton and High Peak Golf Club Ball In The Bag POEM Buxton & High Peak Golf Club A Who's Who of Competitions (Ladies Section) The 9th Hole 'Standside' Golf Ilustrated Sid Green Golf Clubs Reflections on the Club Motto 'By Hook Or By Crook' Standside 2 Metamorphosis Golf History Bogey to Blow-Up Why 18 Holes? Emergency Procedures/Club Contacts and telephone Numbers Course Conditions LEAVE YOUR REVIEW OF OUR CLUB HERE Opens Open Competitions Overview Open Online Bookings Visitors Visitors Welcome Visitors Information Buggy Guidance Visitor Online Tee Bookings WINTER GREEN FEES 2025/2026 SUMMER GREEN FEES 2025 Stay & Play Deals 9 Green Lane Membership Rates 1st June 2025 - 31st May 2026 Application Form Trial Membership Trial Membership 2025 Application Form for Trial Membership Visitors and  Societies Programme Notes For Visitors Including Dress Regulations On The Course and Clubhouse eNewsletter Subscription Twitter Activity Facebook Activity Professional Members General Club Noticeboard Members Online Tee Bookings Mens A message from Mr Captain 2024 Mens Competition Overview Untitled Resource Ladies Ladies Welcome Ladies Competition Overview Ladies Match Overview Untitled Resource Message from the Lady Captain 2023 Seniors Seniors Welcome Seniors Competition Overview Seniors Dinner Photos Seniors Contacts Seniors Results Juniors Juniors Welcome Juniors Competition Overview Junior Contacts Junior Presentation 2019 Members Only Area Competition Results Council 2024 Our Dignitaries Captains Honour Board Ladies Captains Honour Board Presidents Honour Board Ladies Presidents Honour Board Junior Captains Honour Board Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Mixed Honours Board Juniors Honours Board Reciprocal Golf Safe Golf Club Welfare Officer England Golf Disciplinary Regulations Equality, Diversity & Inclusion Policy Clubhouse Welcome to our Club House... Clubhouse Staff Clubhouse Noticeboard Social Programme Meeting  & Training Room for Hire Captain's Charity Diary Find Us Contact Us Members' Login Contact Us Buxton & High Peak Golf Club 27 Town End, Fairfield, Buxton, Derbyshire, SK17 7EN Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. For map and directions, please click here . Office Administrator - Mrs Tracey Hannah Tel: 01298 26263 (opt1) Email: admin@bhpgc.co.uk Club Secretary, Mr Garry Bagguley Tel: 01298 26263 (opt1) Email: sec@bhpgc.co.uk Professional, Mr Carl Cross Tel:01298 26263 (opt2) Email: carlpcross@aol.com Reach Catering Services (Bar & Catering) - Mr Stuart Dale Tel: 01298 26263 (opt3) Email: house@bhpgc.co.uk Course conditions: Tel: 01298 26263 (opt2) You may complete this form to contact Buxton and High Peak Golf Club. Alternatively, you can send an email to: carlpcross@aol.com. Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Pro Shop Visitor Review Club/Course Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Recent Site Updates Course Conditions 10-Sep-2025 08:21 Seniors Stamford Match Report 03-Sep-2025 14:21 Seniors Reddish Vale Match Report 03-Sep-2025 14:15 Contact phone: 0129 826263 email: admin@bhpgc.co.uk Links RSS Feed Cookie and Privacy Contact Us Find Us Follow Us Members Login Copyright © Buxton and High Peak Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS Switch to Desktop View Switch to Mobile View Scroll"
    },
    {
      "url": "https://golfbusinessnews.com/news/corporate/pga-of-america-appoints-reach-foundation-executive-director/",
      "text": ""
    }
  ]
}