{
  "fuentes": [
    {
      "url": "https://www.golfersdesk.com/orlando-golf-courses/disney's-lake-buena-vista-golf-course",
      "email": "info@teetimesusa.com"
    }
  ],
  "mails": [
    "info@teetimesusa.com"
  ],
  "nombre_sitio": "golfwdw.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golfersdesk.com/orlando-golf-courses/disney's-lake-buena-vista-golf-course",
      "text": "Disney's Lake Buena Vista Golf Course | Disney Golf Orlando × About Golfpac Travel With over 50 years’ experience, Golfpac Travel provides custom golf packages , vacations, and discount travel specials\r\n                        to over 40 golf destinations .  Here at www.golfpactravel.com you can research information and ratings on courses , hotels and resorts , find the best deals, and even quote and book your vacation all online. Whether you’re\r\n                        looking for a weekend getaway or a full-blown golf adventure, you can rely on the travel experts at Golfpac Travel. Over 50 years of experience Over 675,000 satisfied travelers Over 2,200,000 rounds booked Over 600 courses, hotels & resorts Tee times confirmed in advance Outstanding rates & service Call 888-848-8941 to speak to a real, live person. Together, we have a combined 30 years experience in the golf travel industry. Close 888-848-8941 Sign In Account & Packages Join a Trip {{total | currency}} {{result.Name}} Toggle navigation Info & Rates Golf Courses Build a Package You Design Your Package We Design Your Package Book Tee Times We Design Your Package Choose your Hotel ------------------------------------------------------------------- {{listItem.Name}} Disney's Lake Buena Vista Golf Course Resort Course Orlando, FL (398) reviews About Package Deals Stats/Overview Map Added Value Reviews Restrictions & Fees Special Promotions The following promotional discounts apply: {{promo.Name}} Must book between {{promo.BookBetweenStart}} and {{promo.BookBetweenEnd}}. Must stay between {{promo.StayBetweenStart}} and {{promo.StayBetweenEnd}}. {{promo.WebsiteVerbiage}} Disney's Lake Buena Vista Golf Course Golf Packages 4 NIGHT / 3 ROUND Private Orlando Home & best golf! Global Vacation Rentals Orlando Disney's Lake Buena Vista Golf Course ChampionsGate Country Club Southern Dunes Golf & Country Club Enjoy Disney Lake Buena Vista's tropical Florida scenery, classic country club layout. Championsgate Country Club features a 18-hole masterpiece is a combination of beauty and playability - wide undulating fairways, large and strategic bunkers and first rate greens Large 6-bedroom home at an incredible price! from $299 More Info 3 NIGHT / 3 ROUND This trip is made for settling bets! Global Vacation Rentals Orlando ChampionsGate Country Club Shingle Creek Golf Club Disney's Lake Buena Vista Golf Course Large 6-bedroom home with plenty of room to have your best buddy golf trip yet! Orlando's best golf --- Shingle Creek, Disney LBV and access to ChampionsGate Country Club Don't miss out on this incredible Orlando golf trip from $388 More Info 3 NIGHT / 3 ROUND Margaritaville Magic Margaritaville Resort Hotel - Orlando Eagle Creek Golf Club Mission Resort- El Campeón Course Disney's Lake Buena Vista Golf Course Orlando's Best Golf Play Mission Inn which provides a landscape you don't normally find in Florida! One of the newest resorts in Florida! from $518 More Info 3 NIGHT / 3 ROUND Disney Getaway! Wyndham Garden Lake Buena Vista Disney Springs Resort Area Hawk's Landing Golf Club Disney's  Magnolia Golf Course Disney's Lake Buena Vista Golf Course Play two Disney courses Enjoy the new island green 18th hole at Hawk's Landing Walking distance to Disney Springs from $550 More Info Course Facts Year Built: 1972 Course Designer: Joe Lee Club Type: Resort Course Club Facilities Banquet Facilities: Yes Bar: Yes Club Rentals: Yes *TaylorMade Sim2 Max $59+tax + tax. Clubhouse: Yes Dress Code: Collared Shirts Required Driving Range: Yes Food: Yes GPS: Yes Homes: No Homes along course On-Site Restaurant: Yes Pro Shop: Yes Shower: Yes *4 showers Water: Water comes into play on lots of holes COURSE STATS Tees Yardage Rating Slope Blue 6749 72.30 133 White 6264 70.10 130 Gold - Men's 5919 68.50 125 Gold - Women's 5919 74.00 134 Red 5194 69.70 119 About Disney's Lake Buena Vista Golf Course Offering a classic country club layout, Disney's Lake Buena Vista Golf Course embodies the natural character of the land while winding its way through pastel villas, pine forests, palmettos, sparkling lakes and other wonders of nature. Lush fairways and well-protected greens make this course as challenging as it is beautiful for either a casual round or a large group outing. The course most notably features elevated bunkered greens that put a premium on accurate approach shots, yielding an overall moderate degree of difficulty to the course. Disney’s LBV has hosted the PGA Tour, the LPGA Tour and USGA events. Test your skills and fortitude at the demanding 7th hole with its challenging island green. Bundle with Disney’s Palm and Disney’s Magnolia (on site together less than 7 miles away by car) for three rounds of Disney magic and fun! Added Value Complimentary pre-round range balls included. They must be requested upon arrival at the pro shop. — Valid 1/1/2017 - 12/31/2026 Play any combination of 3 rounds of Disney Golf on 3 different days during the same trip and receive a $30 golf merchandise credit. The merchandise credit available only at pro-shop and cannot be exchanged for cash. The merchandise credit will be issued upon check-in on the 3rd day of golf at the pro-shop. — Valid 9/27/2024 - 9/25/2025 Play any combination of 3 rounds of Disney Golf on 3 different days during the same trip and receive a $30 golf merchandise credit. The merchandise credit available only at pro-shop and cannot be exchanged for cash. The merchandise credit will be issued upon check-in on the 3rd day of golf at the pro-shop. — Valid 9/26/2025 - 9/30/2026 Reviews Add a Comment {{starRating = review.Rating; \"\"}} Reviewed {{formatDate(review.Date)}} Reviewed {{formatDate(review.Date)}} {{formatDate(review.Date)}} {{review.Comment}} {{totalPages = findNumberOfPages(pager.totalItems/pager.selectedPageSize); \"\"}} « {{n}} » Disney's Lake Buena Vista Golf Course Restrictions & Fees Weather Policy: This golf course has a strict weather policy in place. Reservations are expected to be honored unless the course has been officially closed for the duration of the day due to inclement weather. No refunds will be given for weather that the customer deems too cold, too hot, or too windy. Anyone who begins play while it is raining will not be eligible for a refund. — 9/27/2021 - 12/31/2026 Frost Delays: In the event of a frost delay the golf course allows up to One hour of delay, in which no refunds will be given. Any delay that extends over One hour the golf course will offer an opportunity for a refund or rain check. — 9/27/2021 - 12/31/2026 Please note: This course utilizes dynamic pricing, meaning they are not exact or final until the time of booking and could either increase or decrease. Please contact our agents for details. — 10/18/2021 - 12/31/2029 Please note, for groups of 20 or more golfers, this course may require additional tournament fees that will be added to your reservation upon booking. — 9/1/2023 - 12/31/2029 × Sorry, your browser doesn't support embedded videos. Previous Next Plus {{GalleryImages.length}} more photos {{listing.Id = 23; \"\"}}\r\n                    {{listing.Name = 'Disneys Lake Buena Vista Golf Course'; \"\"}}\r\n                    {{listing.Address = '2200 Golf Drive, Orlando, FL 32830'; \"\"}}\r\n                    {{listing.StarRating = 4.50; \"\"}}\r\n                    {{listing.MainImage = '/images/gallery/1023/i1023.jpg'; \"\"}}\r\n                    {{listing.Latitude = '28.379747000'; \"\"}}\r\n                    {{listing.Longitude = '-81.522500000'; \"\"}}\r\n                    {{listing.Region = 'orlando'; \"\"}} {{::item.Id = listing.Id; \"\"}}\r\n    {{::item.Name = listing.Name; \"\"}}\r\n    {{::item.Address = listing.Address; \"\"}}\r\n    {{::item.StarRating = listing.StarRating; \"\"}}\r\n    {{::item.MainImage = listing.MainImage; \"\"}}\r\n    {{::item.Latitude = listing.Latitude; \"\"}}\r\n    {{::item.Longitude = listing.Longitude; \"\"}}\r\n    {{::item.Region = listing.Region; \"\"}}\r\n    {{::item.Type = \"golfcourses\"; \"\"}} Build Your Own Package with {{item.Name}} Golf Only Rates Shared Cart Included {{::rate.Time}} {{item.Region.indexOf('Vegas') != -1 ? rate.GolfOnlyRate : rate.DisplayGolfOnlyRate | currency}} No Rates Found 1 player 2 players 3 players 4 players 5 players 6 players 7 players 8 players 9 players 10 players 11 players 12 players 13 players 14 players 15 players 16 players 17 players 18 players 19 players 20 players 21 players 22 players 23 players 24 players 25 players 26 players 27 players 28 players 29 players 30 players 31 players 32 players 33 players 34 players 35 players 36 players 37 players 38 players 39 players 40 players 41 players 42 players 43 players 44 players 45 players 46 players 47 players 48 players 49 players 50 players 51 players 52 players 53 players 54 players 55 players 56 players 57 players 58 players 59 players 60 players 61 players 62 players 63 players 64 players 65 players 66 players 67 players 68 players 69 players 70 players 71 players 72 players 73 players 74 players 75 players 76 players 77 players 78 players 79 players 80 players 81 players 82 players 83 players 84 players 85 players 86 players 87 players 88 players 89 players 90 players 91 players 92 players 93 players 94 players 95 players 96 players 97 players 98 players 99 players Add to cart Please Call for Rates Highlights ** DYNAMIC PRICING - RATE NOT GUARANTEED UNTIL TEE TIME IS CONFIRMED ** Special: $30 merchandise credit when playing 3 days at Disney on the same trip America's Top 75 Resorts, Golf Digest Tropical Florida scenery, classic country club layout Great rates on 36-hole days combining your choice of Disney courses Course Scorecard × Review Disney&#39;s Lake Buena Vista Golf Course Add Your Comments If you have stayed or played at Disney&#39;s Lake Buena Vista Golf Course, we would like to hear from you. Date Visited * Review / Comments * Name (optional) Your Location (optional) Email Address (optional) Close Submit Review About GolfPac Travel Frequently Asked Questions Terms and Conditions / Rainouts & Cancellations Privacy Policy Contact Us With over 50 years’ experience, Golfpac Travel provides custom golf packages, vacations, and discount travel specials to over 40 golf destinations. Read More. Copyright© 2025 Golfpac Travel®. All rights reserved."
    }
  ]
}