{
  "fuentes": [
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/hells-kitchen/faqs",
      "email": "donations@grna.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/hells-kitchen/faqs",
      "email": "jobs@grna.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/behind-the-pass/our-team/",
      "email": "events@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/behind-the-pass/our-team/",
      "email": "guestrelations@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/behind-the-pass/our-team/",
      "email": "royalhospitalroad@gordonramsay.com"
    },
    {
      "url": "https://hellskitcheninc.com/stories-from-hell",
      "email": "events@hellskitcheninc.com"
    },
    {
      "url": "https://hellskitcheninc.com/stories-from-hell",
      "email": "retail@hellskitcheninc.com"
    },
    {
      "url": "https://hellskitcheninc.com/stories-from-hell",
      "email": "talktous@hellskitcheninc.com"
    },
    {
      "url": "https://hellskitcheninc.com/stories-from-hell",
      "email": "events@hellskitcheninc.com"
    },
    {
      "url": "https://hellskitcheninc.com/stories-from-hell",
      "email": "talktous@hellskitcheninc.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/hells-kitchen/locations/foxwoods",
      "email": "bpuma@foxwoods.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/hells-kitchen/locations/foxwoods",
      "email": "bpuma@foxwoods.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/hells-kitchen/locations/foxwoods",
      "email": "u003ebpuma@foxwoods.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/faqs",
      "email": "donations@grna.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/faqs",
      "email": "jobs@grna.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/",
      "email": "events@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/",
      "email": "guestrelations@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/",
      "email": "royalhospitalroad@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "20savoygrill@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "rgrhigh@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "battersea@breadstreetkitchen.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "edinburgh@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "events@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "experiences@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "gordonenquiries@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "groupsandevents@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "guestrelations@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "heddonstreetkitchen@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "limehouse@breadstreetkitchen.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "liverpool@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "luckycat@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "luckycatbishopsgate@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "luckycatmanchester@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "petrus@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "press@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "restaurant1890@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "riverrestaurant@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "royalhospitalroad@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "savoygrill@gordonramsay.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "shoreditch@pizzaeast.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "southwark@breadstreetkitchen.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "stpauls@breadstreetkitchen.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "stratford@breadstreetkitchen.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "stratford@pizzaeast.com"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "email": "thecity@breadstreetkitchen.com"
    }
  ],
  "mails": [
    "20savoygrill@gordonramsay.com",
    "battersea@breadstreetkitchen.com",
    "bpuma@foxwoods.com",
    "donations@grna.com",
    "edinburgh@gordonramsay.com",
    "events@gordonramsay.com",
    "events@hellskitcheninc.com",
    "experiences@gordonramsay.com",
    "gordonenquiries@gordonramsay.com",
    "groupsandevents@gordonramsay.com",
    "guestrelations@gordonramsay.com",
    "heddonstreetkitchen@gordonramsay.com",
    "jobs@grna.com",
    "limehouse@breadstreetkitchen.com",
    "liverpool@gordonramsay.com",
    "luckycat@gordonramsay.com",
    "luckycatbishopsgate@gordonramsay.com",
    "luckycatmanchester@gordonramsay.com",
    "petrus@gordonramsay.com",
    "press@gordonramsay.com",
    "restaurant1890@gordonramsay.com",
    "retail@hellskitcheninc.com",
    "rgrhigh@gordonramsay.com",
    "riverrestaurant@gordonramsay.com",
    "royalhospitalroad@gordonramsay.com",
    "savoygrill@gordonramsay.com",
    "shoreditch@pizzaeast.com",
    "southwark@breadstreetkitchen.com",
    "stpauls@breadstreetkitchen.com",
    "stratford@breadstreetkitchen.com",
    "stratford@pizzaeast.com",
    "talktous@hellskitcheninc.com",
    "thecity@breadstreetkitchen.com",
    "u003ebpuma@foxwoods.com"
  ],
  "nombre_sitio": "gordonramsayrestaurants.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/hells-kitchen/faqs",
      "text": "FAQs | Gordon Ramsay Hell's Kitchen | Gordon Ramsay Restaurants Gordon Ramsay Restaurants Open Menu Hell's Kitchen Book Venues Menus Private Dining Gift Cards Experiences FAQs RESERVATIONS Can I make a reservation at Hell's Kitchen? You can find available reservations here by simply selecting the location you wish to visit, clicking the \"Book A Table\" button then entering your desired date, time, and party size for your reservation. We can't wait for you to dine with us! GIFT CARDS Can I purchase a gift card for Hell's Kitchen? Yes! E-Gift Cards are available for purchase here ! View a list of U.S. locations currently accepting E-Gift Cards, here . Can I redeem my Caesars Rewards and/or gift cards at any Hell’s Kitchen location? Rewards and gift cards issued by Caesars can only be redeemed at participating locations, you can view those locations HERE . CAREERS/JOBS How can I look for job postings or apply for a job at a Hell's Kitchen? Interested in working for a Gordon Ramsay restaurant? CLICK HERE to submit your resume and inquire about open positions. I'm interested in working at the Restaurant Support Center. How can I apply? Interested in a career at the Gordon Ramsay North America restaurant support center? CLICK HERE to submit your resume and inquire about open positions. FUNDRAISERS AND DONATIONS Do Gordon Ramsay restaurants participate in fundraising events or make charitable donations? If you’d like to request a donation or fundraising participation in one of our restaurants, CLICK HERE to email our team. While we cannot fulfill all requests, we will review and reply to your request as quickly as possible. Would Gordon like to support our charitable cause by offering a donation or prize? Gordon and Tana have their own foundation in partnership with Great Ormond Street Hospital. The Gordon and Tana Ramsay Foundation has a calendar of events each year, which raise vital funds to support the children’s hospital. All of Gordon and Tana’s charitable efforts are channeled through the foundation, so Gordon is therefore unable to support other charities at this time. For more information about The Gordon and Tana Ramsay Foundation, please CLICK HERE . GORDON RAMSAY Can Gordon help me with a project or offer me some advice? Gordon receives a high volume of requests for personal projects and advice. Unfortunately he’s unable to respond to all of these. Gordon wishes his supporters the best of luck with their endeavors and challenges. Can we get an autograph or signed photo? Due to the high volume of requests and Gordon’s busy schedule we are currently unable to accommodate requests for signed photos or autographs, however Gordon very much appreciates your support. Is Gordon able to send us a message or video for a special person or occasion? Gordon is flattered by the number of requests from those who would like a message recorded for a special occasion or for a friend or family member. Gordon would love to record messages for everyone, but unfortunately this is not possible. Can Gordon attend or speak at our event? Gordon’s schedule is very busy and often booked very far in advance. As much as he would like to, he is unable to attend all the events that he is invited to. Where can I find Gordon's recipes? Some of Gordon’s favorite recipes can be found HERE . We are visiting one of the restaurants, is Gordon available to say hello? We are thrilled that you are dining with us and look forward to welcoming you in a Gordon Ramsay restaurant. Gordon’s busy schedule means he could be anywhere in the world, filming or visiting one of the Gordon Ramsay restaurants. However, you may be lucky and catch him at a time he is visiting the restaurant you are dining in. We wish you a wonderful dining experience either way. I know a restaurant or hotel that needs Gordon's help, could he visit? Gordon has a team of experts that seek out restaurants and hotels in need of his help for his television programs, but he appreciates you keeping your eye out! facebook instagram Sign up Careers FAQs About Contact Accessibility Privacy Policy Terms & Conditions Gordon Ramsay Restaurants ©Copyright 2025 Gordonramsayrestaurants.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/behind-the-pass/our-team/",
      "text": "The Team | Restaurant Gordon Ramsay | Gordon Ramsay Restaurants JAVASCRIPT TURNED OFF Your browser appears to have Javascript disabled. You may find this causes parts of the site to function unexpectedly. Please enable JavaScript Please upgrade your browser It appears you are using an older browser. This site will function better if you upgrade to the latest version Our Team 68 Royal Hospital Road, London, SW3 4HP 0207 352 4441 Book a Table Menus Inspiration Table Restaurant Gordon Ramsay High Exclusive Hire Behind the Pass The Best Seats in London: The Inspiration Table at Restaurant Gordon Ramsay Behind the Pass at Restaurant Gordon Ramsay Sourcing the very best at Restaurant Gordon Ramsay Our Team Gallery Take A Tour The Book Careers Gifting Menu Our Team Book a Table Menus Inspiration Table Restaurant Gordon Ramsay High Exclusive Hire Behind the Pass The Best Seats in London: The Inspiration Table at Restaurant Gordon Ramsay Behind the Pass at Restaurant Gordon Ramsay Sourcing the very best at Restaurant Gordon Ramsay Our Team Gallery Take A Tour The Book Careers Gifting Menu Book a Table Tap to call 0207 352 4441 68 Royal Hospital Road, London, SW3 4HP Find us Our Team Chef de Cuisine Kim Ratcharoen Kim’s passion for cooking sparked at a young age, as she spent her childhood in the kitchen with her grandma in her hometown Surat Thani, Thailand. Inspired by this passion, at the age of 17, Kim moved to the UK to study Economics and Hospitality, before joining Restaurant Gordon Ramsay in 2015 as an apprentice. Kim has dedicated years of hard work and crafting to the restaurant and now holds the prestigious position of Chef de Cuisine . In 2021, Kim starred in series 16 of The Great British Menu, showcasing her vast culinary expertise whilst competing against top chefs across the UK, bringing her creativity and innovation to the big screen. General Manager Enrico Baronetto Originally from Piedmont, Enrico has extensive experience in Michelin-starred restaurants throughout Italy and London, where his career began at Restaurant Gordon Ramsay in 2000. After three years of developing his skills there, he moved back to Italy to work with world renowned Michelin chefs Carlo Cracco and Enrico Crippa. Following this, he returned to London and spent time at The Ledbury as Assistant Restaurant Manager, where he gained valuable skills used in his next role back in Restaurant Gordon Ramsay, where he spent four years as restaurant manager. In 2017, Enrico was approached to work as Restaurant Director for Alain Ducasse at the Dorchester, before returning to his favourite spot, RGR, in December 2022 as General Manager. Enrico takes pride in his attention to detail and enjoys entertaining his guests to make their experience memorable. Back to Top Contact us 68 Royal Hospital Road, Chelsea London SW3 4HP 0207 352 4441 restaurant reservations 0207 592 1373 events @gordonramsay.com groups, events and experiences reservations royalhospitalroad @ gordonramsay.com View Map Opening Hours Tuesday - Saturday Lunch 12pm-1:30pm Dinner 6pm-9:15pm View All Menus Restaurant Information We would like all of our guests to feel free to express their own individual style however, we do ask guests to avoid shorts, tracksuits, hoodies and hats. Smart trainers are fine. We know lots of our guests like to dress smartly which we appreciate. Ultimately we want every guest to feel at home. We kindly ask that payment is by credit or debit card only. Reservations *Party size 1 2 3 4 5 6 Book now Contact us 68 Royal Hospital Road, Chelsea London SW3 4HP 0207 352 4441 restaurant reservations 0207 592 1373 events @gordonramsay.com groups, events and experiences reservations royalhospitalroad @ gordonramsay.com View Map Opening Hours Tuesday - Saturday Lunch 12pm-1:30pm Dinner 6pm-9:15pm View All Menus Restaurant Information We would like all of our guests to feel free to express their own individual style however, we do ask guests to avoid shorts, tracksuits, hoodies and hats. Smart trainers are fine. We know lots of our guests like to dress smartly which we appreciate. Ultimately we want every guest to feel at home. We kindly ask that payment is by credit or debit card only. Reservations *Party size 1 2 3 4 5 6 Book now Newsletter sign up Sign up to our newsletter There was a problem Sorry, we couldn't sign you up. Please try again Personal details: *Title Mr Mrs Miss Ms Please contact me about: Yes I would like to receive latest marketing information by email from Restaurant Gordon Ramsay Yes I would like to receive the latest marketing information by email from Gordon Ramsay Restaurants, about all of our restaurants For more information please see our privacy policy . We will of course keep your data safe and secure and if you change your mind you can unsubscribe at any time on any marketing email we send or email us at guestrelations@gordonramsay.com Sign up Thank you You've subscribed to our newsletter Gordon Ramsay Group ©Copyright 2025 Gordonramsayrestaurants.com Disclaimer Privacy Policy Cookie Policy Terms & Conditions Interested in Gordon Ramsay? Click here 3 You are being redirected to the GORDON RAMSAY SHOP Go to shop Cancel"
    },
    {
      "url": "https://hellskitcheninc.com/stories-from-hell",
      "text": "Hell's Kitchen Minneapolis — True Stories from Hell Reservations Hours+Location Menu Pickup+Delivery Private Events+Large Groups Offsite Catering Shop online Bloody Mary & Mimosa Bar Live Entertainment About Us: Employee Owned Work with Us Behind The Scenes Welcome House Rules Sign In My Account Hell's Kitchen Minneapolis Reservations Hours+Location Menu Pickup+Delivery Private Events+Large Groups Offsite Catering Shop online Bloody Mary & Mimosa Bar Live Entertainment About Us: Employee Owned Work with Us Behind The Scenes Welcome House Rules Sign In My Account May  6, 2023 Hell's Kitchen Fiercely-Independent May  6, 2023 Hell's Kitchen For 20 years, we've always identified ourselves as fiercely independent, but what exactly does that mean?﻿ The easiest explanation is that we're not, and have never been, beholden to financial partners simply because we've never had any. Back in 2002, when Mitch and Cyn started Hell's Kitchen along with Steve, the amount of money needed to start a restaurant --while certainly daunting-- wasn't anywhere near the amount that would be needed in today's times. The bootstrapping owners were able to pull it off by renovating the interior by themselves and scrounging used kitchen equipment, supplies, furniture, fixtures and other things for pennies on the dollar from resellers. Still, those expenses had to be paid from somewhere, so Mitch and Cyn sold their house and managed to squeak by without having to find investors. The founders were quick to admit that selling their assets wasn't necessarily the smart thing to do ...bringing investors on board would have taken a percentage of their ownership, but also would have saved a ton of financial anxiety. In hindsight, though, the freedom that came without having partners allowed the rogue founders to chart their own territory. As Mitch once said, \"We were naive enough --stupid enough if I'm honest-- to want to be the big fish in our tiny pond and make all the decisions for ourselves without worrying about losing someone else's hard-earned money.\" And if you've followed our precarious journey, you know they lost a boatload of money on so many different occasions that they probably should have lowered their personal risk by bringing on financial partners. But they didn't, and at the end of the day, it turned out to be a blessing. Being fiercely independent allowed them to take risks in so many ways: Offering up a free wedding when marriage for gay couples finally became legal... defending our servers publicly when a heartless bigot went on a rant... packing up a truckload of cooking gear and heading up to Embarrass to throw a fundraiser... deciding to co-exist peacefully instead of suing Gordon Ramsey's Hell's Kitchen even though we've owned the trademark even before he started (wanna see his cheeky anniversary greeting? Click here to watch his 2012 apology)... moving the restaurant lock, stock, and barrel when we still had a lease... turning down a $2 million dollar offer in 2013 for 50% of our company from a well known Twin Cities icon when our gut told us it could tear apart our culture... then spending $109k of our savings on legal and other fees in order to turn the restaurant over to our employees via the ESOP 6 years later... opening Hell's Cafeteria during the pandemic... and even writing these \"behind the scenes stories\" that make many other restaurant owners cringe. All of these might have raised eyebrows from investors, but by absorbing all of the financial risk, we were able to make on-the-spot decisions, right or wrong. Would we do it all over again? You betcha. But nowadays, opening a restaurant takes millions, so opening a new downtown restaurant today, sans financial partners, would be out of the question. We feel luck that the only people we now answer to are our Employee Owners and YOU, our valued guests. Both are equally important to us, and once again, we're humbly grateful for the support. Today marks our 21st Anniversary (!!!), so this is our last \"20th Anniversary\" story from Hell. But stay tuned...so many of you have written to us, intrigued by our long-winded ramblings, we plan on continuing to share snippets of our journey with you every so often. Thanks for reading; thanks for believing in us.﻿ May  6, 2023 Hell's Kitchen April 28, 2023 Hell's Kitchen Fun-Filled April 28, 2023 Hell's Kitchen Heads up: if you live in a small Minnesota community more than 3 hours from the Twin Cities, consider reading this post all the way to the end for a surprise announcement. After last week's \"highlight reel\" of hellish things we've faced over the years, we thought we'd circle back to one of the most fun times we've EVER experienced: our road trip to Embarrass, Minnesota. It all started back in the winter of 2014 when we heard that Embarrass, Minnesota, a town of 450 up near our Canadian border, was experiencing brutal temps of MINUS 64 degrees. \"That's literally colder than the surface of MARS, exclaimed Mitch. \"Let's invite 'em all to come to Minneapolis and warm up in Hell.\" Knowing that her chef/husband wasn't kidding, Cyn wrote a cheeky Facebook post inviting their residents to a complimentary brunch in Hell. Sadly, even the offer of a free brunch with one of our heralded Bloody Mary's wasn't enough to entice them. Most had to decline our offer due to the (duh) weather. \"We're too busy shoveling and thawing out\" ... \"the roads are really bad and icy\" ... \"great idea, but our animals need us.\" But Jeannine Bjornrud , the pastor's wife (yes, church folks \"get\" us) , turned things upside down with her reply to our invitation. \"We would love to visit --thanks for the offer-- but if you'd like to come and serve your brunch at my house, the whole town could come. Here in Embarrass, we are all snuggles in for the great adventure. So, Hell's Kitchen, I extend the offer to you. Will even put you up for the night, because it would be too cold to drive home.\" Mitch's mood instantly morphed from dejection to elation: Challenge accepted! He then raised the bar: instead of crowding into Jeannine and Marlin's house, he turned it into a fundraiser for the Embarrass Region Fire Dept. Here's where the magic happened: the entire community jumped in...the Embarrass Vermillion Federal Credit Union offered to print the tickets, Zups donated bacon, Northern Comfort B&B offered us accommodations, and an army of volunteers signed up to set up tables and chairs and help flip flapjacks at Timber Hall. Thus started our first and only road trip from hell. After weeks of planning, a caravan of cars and a big 'ol rental truck fought through an unexpected hellish winter blizzard to get to Embarrass, oftentimes having to pull off the road through whiteout conditions. But thanks to the community's excitement, coupled with fantastic support from the town's surrounding communities, the event was a smashing success. Fire Captain Mike donned Mitch (a self-proclaimed pyromaniac) with firefighting gear, helped us all climb on top of his rig, and paraded us around the block as a final (and freezing) sendoff. But before we headed back home, Captain Mike confided in Mitch that when he first heard of our crazy idea, his first thought was, \"Yeah, right. When Hell freezes over. I'll believe it when I see it.\" But he was smiling like hell when we we waved goodbye and our caravan rolled back out of town. Surprise! A decade later, the employee owners of Hell's Kitchen hope to honor Mitch's legacy and recreate our Embarrass Fire & Brimstone experience in a different Minnesota community. If you live in a small town that might be interested in hosting our team for a similar excursion in the fall of 2024, rally your friends and neighbors and throw your hat in the ring for our second-ever fundraiser by clicking HERE to let Cyn know!﻿ Pssst: Want all the other True Stories from Hell as soon as they’re published? Click here to sign up for our Behind The Scenes newsletters. April 28, 2023 Hell's Kitchen April 24, 2023 Hell's Kitchen Frightening April 24, 2023 Hell's Kitchen A highlight reel of the most frightening things we’ve faced over the past 21 years: 2002 Mitch, Cyn and Steve started Hell's Kitchen on a wing and a prayer. Within 2 weeks of opening, Mitch’s knee was crushed in a vehicle accident, so Steve, Mitch’s co-pilot, had to run the entire kitchen almost single-handedly. The pressure was indescribable; Steve lost 20% of his body weight in 3 months, but saved Hell’s Kitchen from imploding. 2003 Cyn (aka bookkeeper, CEO, marketing, jack of all trades except cooking) couldn’t figure out why we were always so cash strapped. Going over every line item on the Profit and Loss statement, she cut out superfluous spends such as a fresh ORCHID on every plate. ($3k/year). Mitch howled; Cyn prevailed, so Mitch sold his beloved Jeep to get our bank account back on track. 2007 \"Hell yeah! Here we come, Duluth!” Experienced restauratuers know the best practice is to take over a space that already has restaurant-specific infrastructure in place (hoods, venting, etc). Instead, we took over the old Antique Mall on Canal Park Drive…gas lines and water lines had to be trenched into cement; hoods had to go up through 4 floors, and a host of unexpected spends we should have discovered during our due diligence before signing a 3-year lease decimated our $530,000 budget. We peed our pants and took on a massive loan of almost a million dollars. 2008 Cyn, Steve and Mitch were exhausted, working double duty at both locations, and hanging on by a thread. So imagine their terror when the landlords from our Minneapolis location sent a Certified letter asking them to leave the 10th St location because they wanted to redevelop the entire city block even though we had 2 more years on our lease . The iron-clad lease was good for another 2 years, but seeing the writing on the wall, we threw in the towel and moved to our current 9th St location when the landlords agreed to pay for the move. 2009 \"What the fk were we thinking?\" Although our downtown Minneapolis restaurant was profitable, our high buildout costs in Duluth continued to drain our funds. When our CPA suggested we rebrand the concept into a more casual restaurant with better margins, HellBurgers was born. Did we think it was smart to spend $72,000 for the rebrand? Yep. Did it work? Ahh, nope. After a bloodbath of further losses, we closed in 2010, still owing the bank over $800,000. 2011, 2012, 2013, 2014, 2015, 2016 Even though our Mpls restaurant would have been protected (separate corporations), we refused to declare bankruptcy for the Duluth operation, and spent 6 years paying off the Duluth debt with profits from downtown Minneapolis as fast as we could (which is why Vision Bank still loves us to this day). Mitch repeatedly asked \"If downtown's doing so well, how come we never seem to have money?\" Cyn repeatedly showed him the loan statements, and he'd walk away with slumped shoulders. 2017 With Minneapolis' cash reserves at an all time low, we were so busy running the biz that we completely missed the fact that our downtown margins slipped from a healthy profit to a dwindling, almost-negative number. In September, we had a \"hair on fire\" meeting with our staff, who quickly came up with a remarkable list of ways to cut costs without hurting our food quality. KJ Granberg, our current company President, turned the ship around in 4 short months (!!!) and brought the downtown restaurant back to profitability. Mind you, we still weren't laughing all the way to the bank, but she and her team managed to squirrel away some savings each month, which ended up being a godsend that got us through the first year of our covid closure. 2019 Mitch, as you might already know, fell ill and suddenly passed away in 2015, leaving Cyn and Steve, now in their 60’s, to explore exit plans so they could retire. Rather than sell to private investors, which would yield the highest price, the founders bucked everyone’s sage advice and instead turned Hell’s Kitchen over to its employees via an Employee Stock Ownership Plan (ESOP) on Jan 1, 2020 so everyone, from dishwashers to managers, servers, hosts, cooks, expos, and bartenders, could own the company. The best part? They didn’t have to pay a penny out of their pockets because payments to the founders would come from future profits. Since the restaurant was solidly profitable, they thought “What could possibly go wrong?” Well, ummm, COVID. Closed restaurant, no profits, no ESOP payments ...the founders watched their future retirement funds vanish into thin air. 2021 Having already spent a big portion of our savings to add the Hell’s Cafeteria concept on the street level, our management team decided to forge ahead, even though we were still reeling from Covid. What the hell were we thinking? Easy answer: “Covid’s almost over, and when downtown offices bounce back to life, folks will love our easy, lightning-fast “old school” cafeteria concept.\" But with offices coming back at a snail’s pace, it's still a bit of a dance to get traction, so we're thrilled that downtown visitors from conventions and events are keeping the concept alive. These are just a few examples of why we’ve often said it’s a miracle we've survived 20 years. Welcome to restaurant life in the fast lanes! Pssst: Want all the other True Stories from Hell as soon as they’re published? Click here to sign up for our Behind The Scenes newsletters. April 24, 2023 Hell's Kitchen April 12, 2023 Hell's Kitchen Joyful April 12, 2023 Hell's Kitchen Hey hey hey, guess what? After last week's \"Maddening\" story, we feel obligated to point out that we're not always whiny LOL. In fact, there have been countless joyful times over the years. Most recently, our entire staff was overjoyed to welcome a sold-out, full house for Easter weekend. We've of course had several times where our underground lair was wall-to-wall full, but for some reason, last weekend, in an epiphany of sorts, it finally struck us that Hell's Kitchen is back in full force. In between taking care of guests, in the moments we had to catch our breath, several of us just stood there, taking it all in. The lively music on stage. Customers grinning and yakking with each other as they went through our epic Bloody Mary Bar. People saddled up the bars enjoying brunch. Families sitting in \"their\" booths (our Minnesota Room, with each and every city/township in our state listed, seems to have become a personal favorite for folks who come from various points in Minnesota). And to the 5 people who piled into our PhotoBooth and were laughing their asses off as the camera clicked away, your joyful noise simply made our hearts melt. Are you tired of us saying \"thank you\" so frequently? Trust us, those aren't just superflous, empty words. Whenever we say \"thank you,\" we genuinely mean it. Pre-covid, we were grateful for your patronage and awards. Post-covid, we're also in awe that you believed in us enough to venture back through the Gates of Hell. The employee-owners at Hell's Kitchen are deeply grateful for your patronage, now more than ever. And that, perhaps, is the biggest reason we are so incredibly joyful. Pssst: Want all the other True Stories from Hell as soon as they’re published? Click here to sign up for our Behind The Scenes newsletters. April 12, 2023 Hell's Kitchen April 10, 2023 Hell's Kitchen Maddening April 10, 2023 Hell's Kitchen In several of our previous “20th Anniversary” posts, we’ve mentioned how grateful we are to still be around 21 years after Mitch, Steve and Cyn opened the gates of Hell. But because we also promised to be transparent, we do have to be honest about our frustrations along the journey. Case in point: literally weeks before Covid closed down the world, we were putting the final touches on a completely revamped catering arm of our business, Hell on Wheels. Many of you loved our box lunches that we delivered to offices and hotels in the downtown area, but almost all of you asked for a streamlined way to order online without having to waste time. So we spent 7 months (along with a boatload of money) to update everything from our food offerings to delivery logistics and especially that easy-breezy way to order everything online. Then, well, Covid. 18 months later, when we finally reopened, almost everything we had meticulously planned flew right out the window. It was maddening: our POS system had to be overhauled, all of the online ordering had to be reconfigured, menu offerings changed, photos needed to be reshot, pricing had to be re-analyzed, and believe it or not, even our previous catering manager changed careers. 7 months down the tube, 7 months of rebuild, and now….well, soon (!)…a new and improved Hell on Wheels will be launched to take care of your needs both large and small. We have redesigned Hell on Wheels to cater to your needs post-pandemic, hoping to make your return to the office a little bit easier. With a new menu featuring Hell’s Kitchen favorites and boxed lunches from the Cafeteria, easy online ordering, and disposable warming packages and utensils, we are your one-stop-shop for office lunches and events. We deliver to all of downtown and even have a dedicated sales manager to answer any and all questions and discuss any special accommodations that might be needed. Boy oh boy, we’re tired, but we’re also fired up because our excitement about the new Hell on Wheels overshadows everything. Thinking about delivery, pickup, or set up for a small office party or a large soiree? Stay tuned! Pssst: Want all the other True Stories from Hell as soon as they’re published? Click here to sign up for our Behind The Scenes newsletters. April 10, 2023 Hell's Kitchen January 19, 2023 Hell's Kitchen Unrelenting January 19, 2023 Hell's Kitchen It’s a fact of life that most restaurants don’t survive 5 years and are replaced by shiny new stars with dreams of success. The disturbing trend, though, is how many long-time legends are closing their doors. Jaws dropped when Copenhagen’s Noma, rated the world’s best restaurant, recently announced its closure after two decades. Chicago’s Spiaggia shuttered after 37 years. South Carolina’s beloved Harry’s Local is closing after 20 years. French Quarter’s landmark K-Paul’s called it quits after 41 years, and Cafe Texan ended its 83 year run. But the closure of New York’s Paris Cafe, open since 1873 could be the biggest stunner after 150 years in business . Here in Minnesota, David Fong’s (60 years), Stella’s (17), William’s Uptown Pub (51), Keefer Court (40), Khyber Pass (37), Rock Bottom Brewery (30), Erté (21 ), Asia Chow Mein (50), Camdi (35 years) and other iconic eateries also threw in the towel. Why in the world would restaurants that crawled on their knees to survive the brutal years of covid now decide to close? We’re obviously not privy to each establishment’s circumstances, but from our own experience, we’re fairly certain it’s because of the unrelenting increase in costs, from eggs to labor to delivery surcharges and supplies. Adding insult to injury, some items are in such shortage that we have to use up precious dollars and bulk up on them when we finally can get our paws on necessities such as frying oil. Katy Gerdes from Angel Food Bakery (our little sister) spent weeks hunting down confectioner’s sugar, and when she finally spotted a new shipment at Costco, she ran over and loaded up an entire pallet of 50 pound bags into her car just to get her through Christmas. It’s been absolutely unrelenting, and by now you’ve noticed most eateries have inched up prices, added surcharges, tweaked hours, relied on QR codes to save on paper menu costs, and danced like crazy to figure things out. Most of us are exasperated and exhausted, but day after day, we keep showing up to turn on our lights and open our doors with a smile. So please, puh-leeeze continue to support your favorite spots, no matter where you live. As one restaurateur recently posted, “No extravagant meals needed or expensive bottles of wine. Just stopping by for a quick bite and tipping a few extra bucks or grabbing some takeout can make a big difference in what will likely be another tough year for many of your favorite restaurants.\" Thank you from all of us across the globe for your continued support. We love you, we want you, and we all still need you. Pssst: Want all the other True Stories from Hell as soon as they’re published? Click here to sign up for our Behind The Scenes newsletters. January 19, 2023 Hell's Kitchen December 21, 2022 Hell's Kitchen Tragic December 21, 2022 Hell's Kitchen After Mitch Omer (our visionary chef/founder) fell ill, doctors throughout the Twin Cities scrambled to find a cause. Test after test, nothing was found, and then on Dec 18, 2015, Mitch just never woke up, stunning us all. It turns out our beloved Mitch passed away the week before Christmas from an undiagnosed enlarged heart, and after the shock of losing him, we realized that the timing was not just painful, but also tragically poetic. You see, Mitch WAS our Father Christmas. Year after year, he added more and more bling to his Santa Zoot soot, complete with a snappy fedora hat and even spats. Today's True Story isn't very long. Instead, we thought we'd share some pics of this marvelous human being with a truly big, loving, and joy-filled heart. \"Merry Mitchmas!\" to you all, as he used to say while he flipped us all the bird with a smile. Pssst: Want all the other True Stories from Hell as soon as they’re published? Click here to sign up for our Behind The Scenes newsletters. December 21, 2022 Hell's Kitchen November 18, 2022 Hell's Kitchen LUCKY November 18, 2022 Hell's Kitchen Lucky with a side of immense gratitude This is a bit of a personal story from Cyn Gerdes, one of Hell’s Kitchen founders: I’ve always considered myself lucky, maybe because I’m a “glass is half full” kinda person. In this global world that’s full of unimaginable hardship and angst, I’ve somehow managed to stay positive, even though things have hurled my way that should have dropped me. 20 years ago, when Mitch (my chef husband), Steve Meyer (our amazing partner), and I decided to open Hell’s Kitchen, lack of capital should have dropped us in our tracks. We’ve already mentioned several of those trials and tribulations, so I’m not going to rehash those here. But when I think back over those 2 decades, somehow we managed to fall on our knees numerous times and then somehow get back up. In fact, I often felt like I lived inside a Whac-A-Mole game. Lucky. Over the years, other things came our way that continued to remind me how lucky we are at Hell’s Kitchen. Next week is Thanksgiving, and instead of thinking about a turkey dinner, I think back to 2 years ago, when a handwritten envelope postmarked from Luray, Virginia, landed on my desk. When I opened it, a check for $250 fell out. Keep in mind that this was during our long covid-closure, at a time when we were anxiously sweating our dwindling cash flow. We didn’t know anyone from Luray, Virginia, so were shocked to read a simple note that was included. “Don’t need anything in return. Just wishing you a Happy Thanksgiving. Lisa.” Astonished as well as dumbfounded, tears just fell down our cheeks. Lucky. Every restaurant, I’m sure you know, has fans as well as critics. We’re no exception, but have always been lucky to get rave reviews for the most part. What I find interesting is that after an especially brutal week, something manages to bring our spirits back up. Case in point: when a supply of fresh produce arrived in not-so-fresh condition just as our team was prepping for a huge private event, we were sweating bullets waiting for the replacement product. When it arrived, our kitchen team went into lightning-fast prep mode and managed to get the food out exactly on time, with the client unaware of our behind-the-scenes anxiety and panic. (Think of “The Bear,” Hulu’s wildly popular series.) The next day, out of the blue, our Banquet Manager received this note: \"My expectations were super high from all the hype my coworker told me and man were they still somehow blown out of the water and it’s all even MORE DELISH than I thought it would be. T-H-E C-H-E-E-S-E B-O-A-R-D! And the pancakes?! I mean everything!!!! PLEASE tell your staff everything was so good!!!\" Lucky. Every restaurant also has its share of employees who move onto greener pastures. We’re no different, but when our 18-month long covid closure forced many people on our team to work elsewhere, it broke our hearts. Not just because these people were our friends, but also because this was our “A” team. Many have worked at Hell’s Kitchen for year and years, but we obviously understood and wished them well. So imagine our joy when, little by little, many of these same stars texted us back with notes like “any openings?” and “would you consider having me back?” We’re simply blown away that so many have made it back to Hell. Lucky. When my beloved chef/husband/business partner Mitch died rather suddenly back in 2015, I not only lost one of my life’s greatest loves, but also Hell's Kitchen lost its incredible visionary. The loss had us reeling, but without hesitation, everyone at Hell’s Kitchen leaned way in and pulled us through. The creativity and talent that Mitch brought to the table somehow magically transformed into our entire team, and we now are stronger than ever, with a group of employee owners who come up with fresh new recipes, marketing ideas, and ways to pull together a bazillion personalities into a restaurant that’s now stronger than ever. Lucky. Lastly, on a very personal note, when I lost “my Mitch,” I was in my early 60’s and certainly never thought I’d find another love in my life. But two years ago, I met a man whose entire career was in food service. His fabulous wife of 33 years, also well known in the restaurant industry, passed away from cancer just months after Mitch died. When Jeff and I met, we instantly bonded, and crazy as it sounds for two old people to get married, we did exactly that 12 weeks ago. The interesting thing about a widow and widower getting together is that we can freely discuss great stories and share our deep love about the people who left our lives way too early. Lots of laughter, zero jealousy, and nothing but joy back in our lives. We call ourselves \"The Olds\" and we feel Lucky lucky LUCKY. May your life be kissed with luck as well.﻿ Cyn Gerdes November 18, 2022 Hell's Kitchen Older Posts Back To Top Check Gift Card Balance FAQs Awards + Kudos Accessibility Privacy Terms of Use Rate Us on Trip Advisor! Angel Food Bakery Media Kit Search Site Hell's Kitchen, 80 South 9th Street, Minneapolis, MN, 55402, United States 612-332-4700 talktous@hellskitcheninc.com General Inquiries: TALKTOUS@HELLSKITCHENINC.COM |   Events, Large Groups & Catering: EVENTS@HELLSKITCHENINC.COM Cart ( 0 ) body:not(.sqs-edit-mode) #block-yui_3_17_2_1_1534618120267_91406 {\n  display: none !important;\n  visibility: hidden !important;\n  opacity: 0 !important;\n}\nbody.sqs-edit-mode #block-yui_3_17_2_1_1534618120267_91406"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/hells-kitchen/locations/foxwoods",
      "text": "Gordon Ramsay Hell's Kitchen | Foxwoods | Restaurants Gordon Ramsay Restaurants Open Menu Hell's Kitchen Book Venues Menus Private Dining Gift Cards Experiences Foxwoods Book a Table View the Menu Get a Takeout Loading... Hell's Kitchen Foxwoods 350 Trolley Line Blvd, Mashantucket, Connecticut, 06338 (860) 312 - 6455 Email Foxwoods Get directions Opening Hours MON 16:30 - 23:00 TUE 16:30 - 23:00 WED 16:30 - 23:00 THU 16:30 - 23:00 FRI 11:30 - 23:00 SAT 11:30 - 23:00 SUN 11:30 - 23:00 Our restaurant is located in the Grand Pequot Tower and brings Gordon Ramsay's signature dishes and dining experience to Foxwoods’ vast selection of global culinary options for guests. The eatery seats nearly 260 guests, featuring a chef’s counter and 40-seat private dining room. Featuring design elements that draw from the hit television show Hell's Kitchen, the restaurant offers guests an immersive dining experience that combines the energy and excitement of a busy kitchen with upscale comfort and sophistication. The menu features signature classics from the show, including Beef Wellington and Sticky Toffee Pudding, as well as an extensive wine list, craft cocktails, and a carefully curated selection of beers and spirits, all designed to complement the bold and flavorful dishes on the menu. For groups larger than seven guests, please reach out to our team at (860) 312-6455 or email us at Bpuma@foxwoods.com facebook instagram Sign up Careers FAQs About Contact Accessibility Privacy Policy Terms & Conditions Gordon Ramsay Restaurants ©Copyright 2025 Gordonramsayrestaurants.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/en/us/faqs",
      "text": "FAQs | Gordon Ramsay Restaurants Find a restaurant Contact United States - EN United States - EN United Kingdom - EN Korea - EN Korea - KO Open Menu Gordon Ramsay Restaurants North America Restaurants All Restaurants Hell's Kitchen Ramsay's Kitchen Gordon Ramsay Burger Gordon Ramsay Fish & Chips Gordon Ramsay Street Pizza Gordon Ramsay Street Burger Gordon Ramsay Pub & Grill Gordon Ramsay Steak Gordon Ramsay Food Market Gift Cards Experiences Franchise FAQs GENERAL CONTACT I have a question or some feedback to share. How can I get in contact? Please complete the CONTACT FORM for any needs and our team will assist you as soon as possible. RESERVATIONS Can I make a reservation at one of your restaurants? You can find available reservations by simply selecting the location you wish to visit on our locations page , clicking the \"Book Now\" button for that location, then entering your desired date, time, and party size for your reservation. If there is no availability listed, there are no slots available to book now. We can't wait for you to dine with us! Can I make a change to an existing reservation at one of your restaurants? To make changes to an existing reservation, either refer to the confirmation email sent to you at the time of booking, or contact the restaurant directly . FOOD Does one of your restaurants accommodate my food allergy or dietary restriction? For food allergy or dietary restriction questions, please contact the restaurant directly . GIFT CARDS Can I purchase a gift card for Gordon Ramsay North America? Yes! E-Gift Cards are available for purchase here ! View a list of U.S. locations currently accepting E-Gift Cards, here . CAREERS/JOBS How can I look for job postings or apply for a job at Ramsay's Kitchen? Interested in working for Ramsay's Kitchen? CLICK HERE to submit your resume and inquire about open positions. I'm interested in working at the Restaurant Support Center. How can I apply? Interested in a career at the Gordon Ramsay North America restaurant support center? CLICK HERE to submit your resume and inquire about open positions. FUNDRAISERS AND DONATIONS Does Ramsay's Kitchen participate in fundraising events or make charitable donations? If you’d like to request a donation or fundraising participation from Ramsay's Kitchen, CLICK HERE to email our team. While we cannot fulfill all requests, we will review and reply to your request as quickly as possible. Would Gordon like to support our charitable cause by offering a donation or prize? Gordon and Tana have their own foundation in partnership with Great Ormond Street Hospital. The Gordon and Tana Ramsay Foundation has a calendar of events each year, which raise vital funds to support the children’s hospital. All of Gordon and Tana’s charitable efforts are channeled through the foundation, so Gordon is therefore unable to support other charities at this time. For more information about The Gordon and Tana Ramsay Foundation, please CLICK HERE . GORDON RAMSAY Can Gordon help me with a project or offer me some advice? Gordon receives a high volume of requests for personal projects and advice. Unfortunately he’s unable to respond to all of these. Gordon wishes his supporters the best of luck with their endeavors and challenges. Can we get an autograph or signed photo? Due to the high volume of requests and Gordon’s busy schedule we are currently unable to accommodate requests for signed photos or autographs, however Gordon very much appreciates your support. Is Gordon able to send us a message or video for a special person or occasion? Gordon is flattered by the number of requests from those who would like a message recorded for a special occasion or for a friend or family member. Gordon would love to record messages for everyone, but unfortunately this is not possible. Can Gordon attend or speak at our event? Gordon’s schedule is very busy and often booked very far in advance. As much as he would like to, he is unable to attend all the events that he is invited to. Where can I find Gordon's recipes? Some of Gordon’s favorite recipes can be found HERE . We are visiting one of the restaurants, is Gordon available to say hello? We are thrilled that you are dining with us and look forward to welcoming you in a Gordon Ramsay restaurant. Gordon’s busy schedule means he could be anywhere in the world, filming or visiting one of the Gordon Ramsay restaurants. However, you may be lucky and catch him at a time he is visiting the restaurant you are dining in. We wish you a wonderful dining experience either way. I know a restaurant or hotel that needs Gordon's help, could he visit? Gordon has a team of experts that seek out restaurants and hotels in need of his help for his television programs, but he appreciates you keeping your eye out! Contact Careers FAQs About Privacy Policy Terms & Conditions Accessibility Gordon Ramsay Restaurants ©Copyright 2025 Gordonramsayrestaurants.com"
    },
    {
      "url": "https://www.gordonramsayrestaurants.com/restaurant-gordon-ramsay/",
      "text": "Restaurant Gordon Ramsay | Gordon Ramsay Restaurants JAVASCRIPT TURNED OFF Your browser appears to have Javascript disabled. You may find this causes parts of the site to function unexpectedly. Please enable JavaScript Please upgrade your browser It appears you are using an older browser. This site will function better if you upgrade to the latest version Restaurant Gordon Ramsay 68 Royal Hospital Road, London, SW3 4HP 0207 352 4441 Book a Table Menus Inspiration Table Restaurant Gordon Ramsay High Exclusive Hire Behind the Pass The Best Seats in London: The Inspiration Table at Restaurant Gordon Ramsay Behind the Pass at Restaurant Gordon Ramsay Sourcing the very best at Restaurant Gordon Ramsay Our Team Gallery Take A Tour The Book Careers Gifting Menu Restaurant Gordon Ramsay Book a Table Menus Inspiration Table Restaurant Gordon Ramsay High Exclusive Hire Behind the Pass The Best Seats in London: The Inspiration Table at Restaurant Gordon Ramsay Behind the Pass at Restaurant Gordon Ramsay Sourcing the very best at Restaurant Gordon Ramsay Our Team Gallery Take A Tour The Book Careers Gifting Menu Book a Table Tap to call 0207 352 4441 68 Royal Hospital Road, London, SW3 4HP Find us Restaurant Gordon Ramsay Nestled in the heart of Chelsea, Restaurant Gordon Ramsay remains Gordon's first wholly owned restaurant. Established in 1998, it quickly gained recognition and earned three Michelin stars in 2001, a distinction it proudly holds today. Our flagship restaurant offers an exquisite dining experience, combining elegant modern French cuisine with impeccable service. Under the leadership of Chef de Cuisine Kim Ratcharoen, our talented team continues to uphold the legacy of culinary excellence established by Gordon Ramsay himself. This summer, discover menus that celebrate the season's finest ingredients and showcase vibrant flavours and delicate textures while bringing a fresh perspective to timeless dishes. Book Your Table Gifts & Experiences Give the ultimate gift with a three-Michelin-star dining experience at Restaurant Gordon Ramsay. Discover gift vouchers *Party size 1 2 3 4 5 6 +9 party size Click here Book a table Back to Top Contact us 68 Royal Hospital Road, Chelsea London SW3 4HP 0207 352 4441 restaurant reservations 0207 592 1373 events @gordonramsay.com groups, events and experiences reservations royalhospitalroad @ gordonramsay.com View Map Opening Hours Tuesday - Saturday Lunch 12pm-1:30pm Dinner 6pm-9:15pm View All Menus Restaurant Information We would like all of our guests to feel free to express their own individual style however, we do ask guests to avoid shorts, tracksuits, hoodies and hats. Smart trainers are fine. We know lots of our guests like to dress smartly which we appreciate. Ultimately we want every guest to feel at home. We kindly ask that payment is by credit or debit card only. Reservations *Party size 1 2 3 4 5 6 Book now Contact us 68 Royal Hospital Road, Chelsea London SW3 4HP 0207 352 4441 restaurant reservations 0207 592 1373 events @gordonramsay.com groups, events and experiences reservations royalhospitalroad @ gordonramsay.com View Map Opening Hours Tuesday - Saturday Lunch 12pm-1:30pm Dinner 6pm-9:15pm View All Menus Restaurant Information We would like all of our guests to feel free to express their own individual style however, we do ask guests to avoid shorts, tracksuits, hoodies and hats. Smart trainers are fine. We know lots of our guests like to dress smartly which we appreciate. Ultimately we want every guest to feel at home. We kindly ask that payment is by credit or debit card only. Reservations *Party size 1 2 3 4 5 6 Book now Newsletter sign up Sign up to our newsletter There was a problem Sorry, we couldn't sign you up. Please try again Personal details: *Title Mr Mrs Miss Ms Please contact me about: Yes I would like to receive latest marketing information by email from Restaurant Gordon Ramsay Yes I would like to receive the latest marketing information by email from Gordon Ramsay Restaurants, about all of our restaurants For more information please see our privacy policy . We will of course keep your data safe and secure and if you change your mind you can unsubscribe at any time on any marketing email we send or email us at guestrelations@gordonramsay.com Sign up Thank you You've subscribed to our newsletter Gordon Ramsay Group ©Copyright 2025 Gordonramsayrestaurants.com Disclaimer Privacy Policy Cookie Policy Terms & Conditions Interested in Gordon Ramsay? Click here 3 You are being redirected to the GORDON RAMSAY SHOP Go to shop Cancel"
    },
    {
      "url": "https://www.gordonramsay.com/gr/contact/",
      "text": "Contact & Enquiries | Gordon Ramsay Group Gordon Ramsay.com Academy Restaurants & Bars UK RESTAURANTS US RESTAURANTS Recipes Chicken Recipes Beef Recipes Vegetarian Recipes Ultimate Fit Food Masterclasses The Gordon Ramsay Masterclass About Gordon Gordon & Tana Ramsay Foundation Books HexClad By Chef Ramsay Chef Blast Gordon Ramsay Wines TV Studio Ramsay Careers Gifts Menu JAVASCRIPT TURNED OFF Your browser appears to have Javascript disabled. You may find this causes parts of the site to function unexpectedly. Please enable JavaScript Please upgrade your browser It appears you are using an older browser. This site will function better if you upgrade to the latest version Contact Us FINE DINING RESTAURANTS Restaurant Gordon Ramsay 020 7352 4441 royalhospitalroad @ gordonramsay.com 68 Royal Hospital Road Chelsea London SW3 4HP Restaurant Gordon Ramsay - High 020 7592 1618 RGRHigh@gordonramsay.com 22 Bishopsgate London EC2N 4BQ Pétrus 020 7592 1609 petrus@ gordonramsay.com 1 Kinnerton Street Knightsbridge London SW1X 8EA Restaurant 1890 020 7499 0124 restaurant1890 @gordonramsay.com Restaurant 1890 Savoy Hotel Strand London WC2R 0EU SAVOY GRILL & RIVER RESTAURANT Savoy Grill 020 7592 1600 savoygrill@gordonramsay.com Savoy Grill Savoy Hotel Strand London WC2R 0EZ River Restaurant 020 7499 0122 riverrestaurant @gordonramsay.com River Restaurant Savoy Hotel Strand London WC2R 0EZ LUCKY CAT Lucky Cat - Mayfair 020 7107 0000 luckycat@gordonramsay.com 10 Grosvenor Square Mayfair London W1K 6JP Lucky Cat - Manchester 016 1424 9150 luckycatmanchester@gordonramsay.com 100 King Street Manchester M2 4WU Lucky Cat - Bishopsgate 020 7592 1617 luckycatbishopsgate@gordonramsay.com 22 Bishopsgate London EC2N 4AJ BAR & GRILL Bar & Grill - Mayfair 020 7495 2211 barandgrill@gordonramsay.com Please note that all our bookings are managed online. For anything else, please call us on the number above. 10 - 13 Grosvenor Square Mayfair London W1K 6JP HEDDON STREET KITCHEN 020 7592 1212 heddonstreetkitchen@gordonramsay.com Please note that all our bookings are managed online. For anything else, please call us on the number above. 3-9 Heddon Street London W1B 4BE BREAD STREET KITCHEN Please note that our bookings for all Bread Street Kitchen restaurants are managed online. For anything else, please call the restaurant on the number below. Bread Street Kitchen & Bar - St Paul's 020 3030 4050 stpauls@breadstreetkitchen.com 10 Bread Street London EC4M 9AJ Bread Street Kitchen & Bar - Southwark 020 7592 7977 southwark@breadstreetkitchen.com 47-51 Great Suffolk Street London SE1 0BS Bread Street Kitchen & Bar - The City 020 7499 0125 thecity@breadstreetkitchen.com 11, 13, 14 South Place London EC2M 7EB Bread Street Kitchen & Bar - Edinburgh 013 1252 5200 edinburgh@gordonramsay.com 4 St Andrew Square Edinburgh EH2 2BD Bread Street Kitchen & Bar - Liverpool 020 7592 7945 liverpool@gordonramsay.com 45-47 Paradise Street Liverpool L1 3EU Bread Street Kitchen & Bar - Battersea 020 7592 7952 battersea@breadstreetkitchen.com 319 The Power Station 1st Floor Battersea Power Station Turbine Hall A Circus Road South London SW11 8DD Bread Street Kitchen & Bar - Limehouse 020 7592 7950 limehouse@breadstreetkitchen.com 44 Narrow Street London E14 8DP Bread Street Kitchen, Bar & Rooftop - Stratford 020 7499 0118 stratford@breadstreetkitchen.com 9 Endeavour Square London E20 1JN PIZZA EAST Pizza East - Shoreditch 020 7349 9650 shoreditch@pizzaeast.com Please note that all our bookings are managed online. For anything else, please call us on the number above. 56 Shoreditch High Street London E1 6JJ Pizza East - Stratford 020 7499 0099 stratford@pizzaeast.com Please note this restaurant is walk-in only. For anything else, please call us on the number above. 9 Endeavour Square Stratford London E20 1JN PLANE FOOD Plane Food +44 (0) 208 897 4545 planefood@gordonramsay.com Please note that all our bookings are managed online. For anything else, please call us on the number above. Terminal 5 Wellington Road Heathrow Airport Hounslow TW6 2GA GENERAL ENQUIRIES For reservation enquiries: Please contact the restaurants directly. Contact information can be found in the dropdown sections above. For feedback on your experience: guestrelations@gordonramsay.com For groups, events and private dining enquiries: 020 7592 1373 or email events@gordonramsay.com For voucher-related queries: For all masterclasses, email experiences@gordonramsay.com For technical voucher enquiries, please email guestrelations@gordonramsay.com Alternatively, you can visit our gifts and experiences website . To make use of your voucher, simply book online noting the unique voucher reference in the special requests field. Please visit the Restaurants & Bars page for information on all of Gordon’s restaurants and locations. GORDON RAMSAY ACADEMY Contact Gordon Ramsay Academy 020 7352 2442 Find Gordon Ramsay Academy 57-61 Commercial Way Woking Surrey GU21 6HN Hire Gordon Ramsay Academy Our professional kitchens are available to hire for filming and location hire purposes. Please visit our Gordon Ramsay Academy Studio page. CHARITY Would Gordon like to support our charitable cause by offering a donation or prize? Gordon and Tana have their own foundation in partnership with Great Ormond Street Hospital. The Gordon and Tana Ramsay Foundation has a calendar of events each year, which raise vital funds to support the children’s hospital. All of Gordon and Tana’s charitable efforts are channelled through the foundation, so Gordon is therefore unable to support other charities at this time. For more information about The Gordon and Tana Ramsay Foundation, please visit our website. CAREERS Join the Gordon Ramsay Restaurants Team Please visit the Careers section of the website to learn more about being part of the Gordon Ramsay Restaurants Team, and view our current vacancies. GORDON Can Gordon attend or speak at our event? Gordon’s diary is very busy and often booked very far in advance. As much as he would like to, he is unable to attend all the events that he is invited to. Can we get an autograph or signed photo? Due to the high volume of requests and Gordon’s busy schedule we are currently unable to accommodate requests for signed photos or autographs, however Gordon very much appreciates your support. Is Gordon able to send us a message or video for a special person or occasion? Gordon is flattered by the number of requests from those who would like a message recorded for a special occasion or for a friend or family member. Gordon would love to record messages for everyone, but unfortunately this is not possible. We are visiting one of the restaurants, is Gordon available to say hello? We are delighted that you are dining with us and look forward to welcoming you in a Gordon Ramsay restaurant. Gordon’s busy schedule means he could be anywhere in the world, filming or visiting one of the many restaurants in the Gordon Ramsay Group. However, you may be lucky and catch him at a time he is visiting the restaurant you are dining in. We wish you a wonderful dining experience either way. I know a restaurant or hotel that needs Gordon’s help, could he visit? Gordon has a team of experts that seek out restaurants and hotels in need of his help for his television programmes, but he appreciates you keeping your eye out! Can Gordon help me with a project or offer me some advice? Gordon receives a high volume of requests for personal projects and advice, and is sadly unable to respond to all of these. Gordon wishes his supporters the best of luck with their endeavours and challenges. Gordon on TV Gordon has his own production company with a dedicated development team, so we’re not currently able to take on additional ideas. Gordon’s books Gordon is a published author of a number of books, most notably his autobiography, Roasting in Hell's Kitchen. Gordon’s cookery books include Ultimate Home Cooking, Ultimate Cookery Class, and most recently the Bread Street Kitchen Cook Book with over 100 restaurant recipes to cook at home, so there is something for everyone from budding chefs to those who simply want to recreate their favourite meals at home. You can find out more here . Gordon’s recipes Some of Gordon’s favourite recipes can be found here . GORDON RAMSAY RESTAURANTS PRESS OFFICE For press and media enquiries relating to the Gordon Ramsay Restaurant Group, contact us here. GORDON RAMSAY GROUP CONTACT INFORMATION Gordon Ramsay Group 539-547 Wandsworth Road London SW8 3JD Tel: 020 7592 1360 If you haven’t found the answer to your question above, please contact us here . Gordon Ramsay Holdings Limited registered in England and Wales company number: 3457208 Back to Top Newsletter sign up Sign up to our newsletter There was a problem Sorry, we couldn't sign you up. Please try again Personal details: Title* Mr Mrs Miss Ms Please contact me about: Yes I would like to receive latest marketing information by email from Gordon Ramsay Yes I would like to receive the latest marketing information by email from Gordon Ramsay Restaurants, about all of our restaurants in the group For more information please see our privacy policy . We will of course keep your data safe and secure and if you change your mind you can unsubscribe at any time on any marketing email we send or email us at guestrelations@gordonramsay.com Sign up Thank you Thank you for signing up for our e-newsletter, giving you news about the latest happenings, events and offers across the Gordon Ramsay Restaurants. Contact Disclaimer Privacy Policy Cookie Policy Do Not Sell or Share My Personal Information Gordon Ramsay Restaurants ©Copyright 2025 www.gordonramsayrestaurants.com Interested in Gordon Ramsay restaurants? Click here 3 You are being redirected to the GORDON RAMSAY SHOP Go to shop Cancel"
    }
  ]
}