{
  "fuentes": [
    {
      "url": "https://trowbridge.gov.uk/contact-us/",
      "email": "info@trowbridge.gov.uk"
    },
    {
      "url": "https://rutherfordctytn.govoffice.com/sheriff-staff",
      "email": "lmarchesoni@rcsotn.org"
    },
    {
      "url": "https://www.gleneira.vic.gov.au/contact-us",
      "email": "media@gleneira.vic.gov.au"
    },
    {
      "url": "https://www.glengower.ca/",
      "email": "glen.gower@ottawa.ca"
    },
    {
      "url": "https://www.stmaryspsmaghera.com/contact-us/",
      "email": "info@stmarysps.maghera.ni.sch.uk"
    },
    {
      "url": "https://www.stmaryskids.org/about/our-leadership/",
      "email": "info@stmaryskids.org"
    },
    {
      "url": "https://bakercountypress.com/2019/09/the-way-it-was-who-named-glen-st-mary/",
      "email": "advertising@bakercountypress.com"
    },
    {
      "url": "https://bakercountypress.com/2019/09/the-way-it-was-who-named-glen-st-mary/",
      "email": "editor@bakercountypress.com"
    },
    {
      "url": "https://bakercountypress.com/2019/09/the-way-it-was-who-named-glen-st-mary/",
      "email": "sports@bakercountypress.com"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "cynthia.robinson@td.com"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "allen@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "bthomas@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "cdixon@citofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "clerkoffice@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "dallen@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "dburch@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "gredfern@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "lowens@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "mcampbell@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "mstewart@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "nfrigiola@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "rreed@cityofliveoak.org"
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "email": "utility@cityofliveoak.org"
    },
    {
      "url": "https://toucandesign.net/florida/baker-county-florida/glen-st-mary-florida-social-media-marketing/",
      "email": "info@toucandesign.net"
    },
    {
      "url": "https://glenindia.com/pages/contact-us",
      "email": "dm@glenindia.com"
    },
    {
      "url": "https://glenindia.com/pages/contact-us",
      "email": "enquiry@glenindia.com"
    },
    {
      "url": "https://glenindia.com/pages/contact-us",
      "email": "u003edm@glenindia.com"
    }
  ],
  "mails": [
    "advertising@bakercountypress.com",
    "allen@cityofliveoak.org",
    "bthomas@cityofliveoak.org",
    "cdixon@citofliveoak.org",
    "clerkoffice@cityofliveoak.org",
    "cynthia.robinson@td.com",
    "dallen@cityofliveoak.org",
    "dburch@cityofliveoak.org",
    "dm@glenindia.com",
    "editor@bakercountypress.com",
    "enquiry@glenindia.com",
    "glen.gower@ottawa.ca",
    "gredfern@cityofliveoak.org",
    "info@stmaryskids.org",
    "info@stmarysps.maghera.ni.sch.uk",
    "info@toucandesign.net",
    "info@trowbridge.gov.uk",
    "lmarchesoni@rcsotn.org",
    "lowens@cityofliveoak.org",
    "mcampbell@cityofliveoak.org",
    "media@gleneira.vic.gov.au",
    "mstewart@cityofliveoak.org",
    "nfrigiola@cityofliveoak.org",
    "rreed@cityofliveoak.org",
    "sports@bakercountypress.com",
    "u003edm@glenindia.com",
    "utility@cityofliveoak.org"
  ],
  "nombre_sitio": "govoffice.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://trowbridge.gov.uk/contact-us/",
      "text": "Contact Us | Trowbridge Town Council - Get in Touch for Inquiries and Support Skip to content Discover Trowbridge See and do Accommodation Eating and Drinking Shopping Getting Around Twinning What’s On? Mayoral Civic Dinner Active Festival Trow Vegas in the Park Bandstand Sessions Uniform Services Day Remembrance Parade Christmas Lights Hiring of our Park For Locals & Residents Live, Study & Work Live Study Work Mayor’s Pages Meet the Mayor Mayor’s Blog Mayor’s Charities Awards Your Council Councillors Meet the Team Committees Meetings Town Council Projects Grants Finance Tender & Procurement Information Governance Personal data and your rights Freedom of Information Publication Scheme Feedback and Complaints The Town Crier Our Services Neighbourhood Services Allotments Parks and green spaces Street cleaning Report-it Information Services The Civic Active Trowbridge Trowbridge Museum Weekly Market Community Venues Cemeteries Roundabout Sponsorship Vacancies Why work for us? Current Vacancies Volunteering Report-it News Roadworks Trowbridge Leisure Centre Longfield Gyratory Contact Us Home > Contact Us Contact Us If you would like to contact us then simply fill out our contact form below or use the contact details supplied. Name Email Subject Message Send Contact details Trowbridge Town Council St Stephen’s Place Trowbridge Wiltshire BA14 8AH Tel: 01225 765072 Email: info@trowbridge.gov.uk Opening hours Please note our new opening hours for 2025 Monday – Friday 9:00am – 4:30pm Please note that we are closed on weekends and Bank Holidays. *Please note: Closure on Monday 1st September 2025 for staff training. Follow us Facebook Instagram LinkedIn Quick links About Us Feedback Vacancies Sitemap About Us Feedback Vacancies Sitemap What’s On? Your Council Our Services Contact Us What’s On? Your Council Our Services Contact Us Contact 01225 765072 info@trowbridge.gov.uk © 2025 Trowbridge Town Council Cookies Privacy Terms Accessibility Cookies Privacy Terms Accessibility Site by Brightside This website uses cookies to improve your experience. We use cookies to collect information about how you use our website so we can improve our services. Read More Decline Cookie Settings Accept Accept All Cookies are small text files that can be used by websites to make a user's experience more efficient. The law states that we can store cookies on your device if they are strictly necessary for the operation of this site. For all other types of cookies we need your permission. This site uses different types of cookies. Some cookies are placed by third party services that appear on our pages. Necessary Always Active Necessary cookies help make a website usable by enabling basic functions like page navigation and access to secure areas of the website. The website cannot function properly without these cookies. Name Domain Purpose Expiry Type wpl_user_preference trowbridge.gov.uk WP GDPR Cookie Consent Preferences 1 year HTTP Marketing Marketing Marketing cookies are used to track visitors across websites. The intention is to display ads that are relevant and engaging for the individual user and thereby more valuable for publishers and third party advertisers. Analytics Analytics Analytics cookies help website owners to understand how visitors interact with websites by collecting and reporting information anonymously. Name Domain Purpose Expiry Type _ga trowbridge.gov.uk Google Universal Analytics long-time unique user tracking identifier. 2 years HTTP Preferences Preferences Preference cookies enable a website to remember information that changes the way the website behaves or looks, like your preferred language or the region that you are in. Unclassified Unclassified Unclassified cookies are cookies that we are in the process of classifying, together with the providers of individual cookies. Name Domain Purpose Expiry Type _ga_CL155GTF72 trowbridge.gov.uk --- 2 years --- ttwid tiktok.com --- 12 months --- msToken tiktok.com --- 10 days --- Save And Accept Cookies ⛭ Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://rutherfordctytn.govoffice.com/sheriff-staff",
      "text": "Sheriff & Staff - Rutherford County, TN Skip to main content search menu Search Home Public Services Agriculture Extension Online Payments Archives Courthouse Museum Collections & Resources Online Exhibits Historic Cemetery Survey Historical Research Center Historic Property Survey Historic Photo Collection Research Policies Archive History Research Links Building Codes Our History Building Code Adoption & Updates Building Code Links Building Code FAQ Development Tax School Facilities Tax Residential Building Permits Residential Building Inspections Building Code Forms Plans Review Demolition Tiny Homes Request Building Inspection Electrical Permit Request Electrical Inspection Property Maintenance/Zoning Home Based Business Report Property Violation Adjustments & Appeals Building Code Reports 2025 Building Permits Staff Directory Community Learning Center Election Candidate Information Voter Election Workers Election Forms & Links Legal Notices Election Maps Election Results Enviroment Education Education GIS News Highway Department Park & Recreation Parking Planning & Engineering Planning Department Engineering Department Stormwater Steal This!: Hands-On Education Fair Zoning Board of Appeals Planning & Engineering Documents Planning & Engineering Fees Planning & Engineering FAQs Property Assessor Register of Deeds Filing Requirements Recording Policy & Fees State Fees Title Search E-Recording Solid Waste Solid Waste News & Notices Waste Disposal Recycling Haley Road Landfill Transfer Station Trustee Veteran's Services Health & Safety Adult Detention Ambulance Services Ambulance News/Notices Ambulance Overview Pay Ambulance Bill Medical Records Request Special Teams Ambulance Divisions EMS Careers Medical Examiner Animal Services How To Help, Volunteer or Donate Abuse Adoption Animal Surrender Stray Animals Lost & Found Pets Microchip / Vaccinations PAWS News & Notices PAWS Events Spay and Neuter Taking Care of Your Pet Wildlife Community Care Correctional Work Center Command Staff & K-9 Inmate Services & Programs Correctional Visitation Work Center FAQs Recidivism Punishment vs. Rehab Emergency Management EMA Staff EMA Preparedness Natural & Man-made Disasters Public Health HAZMAT Training Local Weather EMA Calendar Fire - Rescue Agency News Administration Divisions Fire Marshal's Office Open Burning Requirements/Regulations Recruitment FREE Smoke Alarm Installation Online Citizen Complaint Form Contact Us Health Department Clinics Health News & Events Press Releases Health Data Health Services Health Forms Work With Us Health FAQ's Homelessness Juvenile Detention Juvenile's Parent Information PREA Reports/Policy Rutherford Opioid Board Sheriff's Office Court Services AEMIF Chancery Court Circuit Court Clerk Circuit Court Payments Circuit Court Forms & Links Circuit Court Calendar Jury Duty Circuit Court Clerk - Civil Circuit Court Clerk - Criminal Circuit Court - General Sessions Domestic Violence Court Juvenile Court Clerk Juvenile Court Juvenile Court Judiciary Juvenile Court Forms Juvenile Court FAQ's Community Resources Pretrial Release Probation FAQ About Us Court Intake Case Managers Access My Probation Case Drug Screen Information Olive Branch Donations Make A Payment Coldest Nights Info Community Resources Recovery Court DUI Court Mental Health Court Recovery Court (Drug Court) Veteran's Court Re-Entry Program Meet the Team Resources Forms Youth Services Administration Budget & Finance Personnel Forms Proposed Budgets by Year Polices & Procedures Budget Committee Meeting Schedules List of Commissioners Standing Committees Other Boards & Committees View Agendas/Minutes for Meetings Budget and Audit Information Inventory Department State Travel Regulations Vendor Registration County Attorney County Buildings County Mayor GIS Services Human Resources Open Positions Open Records Employment FAQ ADA/Title II Title VI Drug Free Workplace Equal Employment Opportunity Retirement Forms Training Employees Only Contact Us Insurance and Risk Management About Us 2026 Retiree Annual Enrollment Employee Insurance Benefits New Employee Benefits Special Enrollments Wellness Incentive Program Wellness News Employee Assistance Program On-the-Job Injury (OJI) Safety Programs Property & Liability Benefits & Insurance Committee Bid Opportunities Staff Inventory Control County General Schools Property FAQ Government Rutherford County Government AI Transparency Statement County Mayor County Commission Meeting Schedules County Commission Budget, Finance, & Investment Ethics Committee Health & Education Property Management Public Safety Public Works & Planning Purchasing Committee Steering, Legislative & Governmental List of Commissioners Standing Committees Other Boards & Committees View Agendas/Minutes for Meetings Commission Rule and Regulations Commissioner Webmail County Clerk Short-Term Rental Property Vehicle Titles Sales Tax Calculator Electronic Insurance Verification System License Plates New to State Beer Permits Boats Dealer Info & EZ Tag Name Change Business Information Estate & Wills Marriage Licenses Passports Public Records Policy Clerk Forms Upcoming Holidays Upcoming Meetings & Events RCTV Current Schedule Watch Live Online Past Videos Circuit Court Clerk Register of Deeds Property Assessor Sheriff's Office Trustee Search Navigation, primary Public Services Agriculture Extension Online Payments Archives Courthouse Museum Collections & Resources Online Exhibits Historic Cemetery Survey Historical Research Center Historic Property Survey Historic Photo Collection Research Policies Archive History Research Links Building Codes Our History Building Code Adoption & Updates Building Code Links Building Code FAQ Development Tax School Facilities Tax Residential Building Permits Residential Building Inspections Building Code Forms Plans Review Demolition Tiny Homes Request Building Inspection Electrical Permit Request Electrical Inspection Property Maintenance/Zoning Home Based Business Report Property Violation Adjustments & Appeals Building Code Reports 2025 Building Permits Staff Directory Community Learning Center Election Candidate Information Voter Election Workers Election Forms & Links Legal Notices Election Maps Election Results Enviroment Education Education GIS News Highway Department Park & Recreation Parking Planning & Engineering Planning Department Engineering Department Stormwater Steal This!: Hands-On Education Fair Zoning Board of Appeals Planning & Engineering Documents Planning & Engineering Fees Planning & Engineering FAQs Property Assessor Register of Deeds Filing Requirements Recording Policy & Fees State Fees Title Search E-Recording Solid Waste Solid Waste News & Notices Waste Disposal Recycling Haley Road Landfill Transfer Station Trustee Veteran's Services Health & Safety Adult Detention Ambulance Services Ambulance News/Notices Ambulance Overview Pay Ambulance Bill Medical Records Request Special Teams Ambulance Divisions EMS Careers Medical Examiner Animal Services How To Help, Volunteer or Donate Abuse Adoption Animal Surrender Stray Animals Lost & Found Pets Microchip / Vaccinations PAWS News & Notices PAWS Events Spay and Neuter Taking Care of Your Pet Wildlife Community Care Correctional Work Center Command Staff & K-9 Inmate Services & Programs Correctional Visitation Work Center FAQs Recidivism Punishment vs. Rehab Emergency Management EMA Staff EMA Preparedness Natural & Man-made Disasters Public Health HAZMAT Training Local Weather EMA Calendar Fire - Rescue Agency News Administration Divisions Fire Marshal's Office Open Burning Requirements/Regulations Recruitment FREE Smoke Alarm Installation Online Citizen Complaint Form Contact Us Health Department Clinics Health News & Events Press Releases Health Data Health Services Health Forms Work With Us Health FAQ's Homelessness Juvenile Detention Juvenile's Parent Information PREA Reports/Policy Rutherford Opioid Board Sheriff's Office Court Services AEMIF Chancery Court Circuit Court Clerk Circuit Court Payments Circuit Court Forms & Links Circuit Court Calendar Jury Duty Circuit Court Clerk - Civil Circuit Court Clerk - Criminal Circuit Court - General Sessions Domestic Violence Court Juvenile Court Clerk Juvenile Court Juvenile Court Judiciary Juvenile Court Forms Juvenile Court FAQ's Community Resources Pretrial Release Probation FAQ About Us Court Intake Case Managers Access My Probation Case Drug Screen Information Olive Branch Donations Make A Payment Coldest Nights Info Community Resources Recovery Court DUI Court Mental Health Court Recovery Court (Drug Court) Veteran's Court Re-Entry Program Meet the Team Resources Forms Youth Services Administration Budget & Finance Personnel Forms Proposed Budgets by Year Polices & Procedures Budget Committee Meeting Schedules List of Commissioners Standing Committees Other Boards & Committees View Agendas/Minutes for Meetings Budget and Audit Information Inventory Department State Travel Regulations Vendor Registration County Attorney County Buildings County Mayor GIS Services Human Resources Open Positions Open Records Employment FAQ ADA/Title II Title VI Drug Free Workplace Equal Employment Opportunity Retirement Forms Training Employees Only Contact Us Insurance and Risk Management About Us 2026 Retiree Annual Enrollment Employee Insurance Benefits New Employee Benefits Special Enrollments Wellness Incentive Program Wellness News Employee Assistance Program On-the-Job Injury (OJI) Safety Programs Property & Liability Benefits & Insurance Committee Bid Opportunities Staff Inventory Control County General Schools Property FAQ Government Rutherford County Government AI Transparency Statement County Mayor County Commission Meeting Schedules County Commission Budget, Finance, & Investment Ethics Committee Health & Education Property Management Public Safety Public Works & Planning Purchasing Committee Steering, Legislative & Governmental List of Commissioners Standing Committees Other Boards & Committees View Agendas/Minutes for Meetings Commission Rule and Regulations Commissioner Webmail County Clerk Short-Term Rental Property Vehicle Titles Sales Tax Calculator Electronic Insurance Verification System License Plates New to State Beer Permits Boats Dealer Info & EZ Tag Name Change Business Information Estate & Wills Marriage Licenses Passports Public Records Policy Clerk Forms Upcoming Holidays Upcoming Meetings & Events RCTV Current Schedule Watch Live Online Past Videos Circuit Court Clerk Register of Deeds Property Assessor Sheriff's Office Trustee facebook X youtube instagram Sheriff & Command Staff Expand All Sheriff Mike Fitzhugh Sheriff Mike Fitzhugh was elected as Rutherford County Sheriff in September, 2018. He joined the Sheriff’s Office in 1994 as a patrol officer and soon trained new deputies. He served as a patrol sergeant, lieutenant and captain. He supervised the communications, records and warrants divisions. He earned the Rutherford County Crime Stoppers’ Officer of the Year. Fitzhugh started out his career at BellSouth where he rose in the ranks to serve as manager of marketing, corporate and community affairs, personnel and business marketing. He is a graduate of Central High School in Murfreesboro. He earned his Bachelor of Science Degree from Middle Tennessee State University. Fitzhugh volunteered at the Rutherford County Rescue Squad and served as the director for four years. He and his wife, Janice, have six children and 16 grandchildren. He is a member of First Baptist Church in Murfreesboro. Fitzhugh is an active support of MTSU football and men’s and women’s basketball. He enjoys reading and lake activities. Chief Deputy Keith Lowery Keith D. Lowery serves as Deputy Chief of the Rutherford County Sheriff’s Office. Chief Lowery, an Army veteran, started his law enforcement career in 1987 as a corrections deputy and a patrol deputy at the Sheriff's Office.  He joined Smyrna Police Department as a patrol officer in 1990, later promoted to detective, the working his way up to Captain of the Special Services Division. He has previously served as a Major and Director of the Information Services Division at the Sheriff's Office, as Assistant Chief of Police at La Vergne Police Department, then returned to the Rutherford County Sheriff's Office as Deputy Chief. \"I endeavor to help the Sheriff's Office continue to progress,\" Lowery said.  \"I want to move people in a common direction, to assist in completing projects and to undertake any unforeseen challenges.  It is my vision to maintain and expand the rapport with the other public safety agencies and to continue to grow in my career as a serving within public safety.\" His responsibilities include direct command of the Communications Division and the Information Technology Division.  He supervises the Deputy Chiefs who command the Criminal Investigations, Patrol, Special Enforcement Bureau, Detention, School Resource Officers, Administration, Evidence, Maintenance, Fleet, Warrants and Records, Community Services, and the Judicial/Court Security Divisions. Chief Lowery is a graduate of Northwestern University School of Police Staff and Command, and Oakland High School.  He studied communications and robotics at the National Radio Institute.  He completed FBI LEEDA Trilogy training, and numerous technical operations, command, or management courses during his 34-year law enforcement career.  Chief Lowery has also received honors as Smyrna Police Department's Officer of the Year, and APCO IT Technician of the Year. Britt Reed, Deputy Chief of Law Enforcement Deputy Chief Britt Reed supervises the law enforcement divisions of the Sheriff's Office including patrol, criminal investigations, school resource officers, judicial services and civil and criminal warrants. He joined the Sheriff's Office in 1995 as a patrol deputy. He was promoted to detective four years later. He rose through the ranks as detective sergeant, patrol lieutenant and detective captain until becoming a major in June 2022. He earned his bachelor's degree in criminal justice administration and his master's degree in criminal justice at MTSU. Reed completed the Northwestern University Center for Public Safety School of Staff and Command and the FBI LEEDA Leadership Trilogy of Supervisor Leadership Institute, Executive Leadership Institute and Command Leadership Institute He completed specialized training in crimes against children, homicide and fire investigations, SWAT leadership, tactical operations and FBI LEEDA Supervisor Liability and Terrorism. Reed is a board member of the Rutherford County Child Advocacy Center. Kevin Henderson, Deputy Chief of Adult Detention Center Deputy Chief Kevin Henderson started his role at the Rutherford County Adult Detention Center November 1, 2021.  He served 30 years at the Shelby County Sheriff's Office and Division of Corrections.  He rose through the ranks to be captain.  He recently retired as chief of security with the Division of Corrections. As chief of security, Henderson handled security issues for inmates, staff, maintenance, meal service and transportation.  He supervised about 400 employees at two corrections facilities. \"During my tenure, we became a fiscally solid system.  First and foremost I am a servant of the taxpayers,\" Henderson said.  He strives to get the best out of the staff.  \"I'm a culture changer,\" said Henderson adding he is a team builder and very inclusive.  \" I am a stickler for order and I like for things to be done right.\" Deputy Chief Henderson is a 25-year veteran.  He served in the Iraq war during six years of active duty, four years with the U.S. Navy and two years with the Air National Guard.  He served as a U.S. Marines medic.  He remained in the Army National Guard. Steve Spence, Deputy Chief of Support Services Deputy Chief Steve Spence is a 34-year law enforcement veteran who joined the Rutherford County Sheriff's office in 1987. He has risen through the ranks and served in several assignments including detention, patrol, and training. As the previous major, Spence supervised the Patrol Division, Criminal and Civil Warrants, the Criminal Investigations Division, School Resource Officers, and Judicial Services. Spence leads the Support Services Division including administrative services and human resources, payroll, accounts payable, central warrants and records, law enforcement training, facility management, fleet management and  community services. He was the Special Weapons and Tactics Team commander and one of the original members when the SWAT team was established.  He also served as the Rutherford County Chairman for Homeland Security District 5. Spence completed the FBI Law Enforcement Executive Development Association (LEEDA) Executive Command Leadership Course, along with several specialized schools, including Basic Terrorism Liaison Officer Course, Crisis Intervention Training Course, Crisis Intervention Training Instructor Course and Train the Trainer Course in Incident Command Systems. He earned the Rutherford County Crime Stoppers' Officer of the Year and was awarded the Noon Exchange Club Officer of the Year. Health & Safety Adult Detention Ambulance Services Animal Services Community Care Correctional Work Center Emergency Management Fire - Rescue Health Department Homelessness Juvenile Detention Rutherford Opioid Board Sheriff's Office Contact Us Mike Fitzhugh , Sheriff 615-904-3089 Rutherford Cty Sheriff’s Office & Adult Detention Center 940 New Salem Highway Murfreesboro, TN 37129 Non-Emergency : (615) 898-7777 Emergency: 911 Community Services: (615) 904-3019 Narcotics: (615) 895-3609 Public Info: (615) 904-3089 Lobby Hours : 8:00 AM to 10:00 PM The Sheriff's Office does not offer fingerprinting services Rutherford County Recovery Plan Useful Links Agendas & Minutes Alert Rutherford Sign Up Licenses & Tags Pay Taxes Online Court Information Birth Records Connect With Us Facebook Instagram YouTube 2024 Â© Official Website of Rutherford County ADA/Title II | Privacy Policy Government Websites by Catalis"
    },
    {
      "url": "https://www.gleneira.vic.gov.au/contact-us",
      "text": "Contact us - Glen Eira City Council | Glen Eira City Council City Council Libraries Leisure STF Glen Eira City Council - Home page logo Services Services Rubbish and recycling Pets and animals Community support Planning and building Rates Parking Maintaining your streets Sustainable Glen Eira Family and children Youth Seniors Disability and accessibility Business support Support and safety Sports and leisure Parks and playgrounds Venues Arts and culture Libraries Our City Our City What's On Arts and culture Getting around History and heritage Sports and leisure Parks and playgrounds Venues In Your Area Classified Trees Placemaking Libraries About Council About Council News Careers Councillors Council projects Grants and recognition Meetings and agendas Our organisation Our performance Policies Sustainability initiatives Strategies and plans Get involved Get involved Advocacy How we engage with the community Active engagements Glen Eira Community Voice Community Engagement E-newsletter How to raise issues with us Volunteering Philanthropic partnerships Have your say Contact us Pay / Report / Apply Pay / Report / Apply How can we help Hard rubbish collection Parks and playgrounds Pay your rates Work with us Planning and building Pay / Report / Apply See all services Search Enter text and select option from the drop-down list Submit search Homepage Contact us Contact us We're here to help you in any way we can. Key tasks Submit a general enquiry or report an issue Make a complaint Request a review of a fine (infringement) Claim for compensation Read our Customer Service Charter Online Submit a general enquiry or report an issue Check out our Pay/Report/Apply page to apply for services online, make a payment or report an issue Snap Send Solve, free to download from the App Store and Google Play Report your missed bins within two days from the collection day through our online request system Email us at mail@gleneira.vic.gov.au By live chat Live chat is available on our website Monday to Friday from 9am to 5pm. The link is at the bottom right of this page. By phone Call us on 03 9524 3333 , Monday to Friday, 8am to 5.30pm (Tuesday 8am to 7.15pm) Emergencies (after hours) call 03 9524 3333 and follow the prompts. In-person Visit us at the Glen Eira Town Hall, corner Glen Eira and Hawthorn Roads, Caulfield Customer Service open Monday to Friday, 8am to 5.30pm Building and Planning counters open Monday to Friday, 8.30am to 5pm By mail Send mail to: PO Box 42, Caulfield South, Victoria 3162 Media enquiries Email us at media@gleneira.vic.gov.au Relay and accessible services Internet relay users connect to NRS then ask for 03 9524 3333 Teletypewriter (TTY) on 133 677 and ask for 03 9524 3333 Speak and Listen (speech-to-speech) users can call 1300 555 727 then ask for 03 9524 3333 Complaints Do you have a complaint about the quality of our service, or a recent action or decision? We value your feedback as understanding your experience with us will help us to improve. Our Complaints Handling Policy describes in detail how we receive and handle complaints, visit our Make a complaint page to submit your complaint. Claims for compensation If you have experienced loss, injury or damage that you believe to be due to the fault of Council and you believe you have a compensation claim, visit our Claims for compensation page. Back to top Locations Glen Eira City Council Corner Glen Eira and Hawthorn Roads Caulfield, Victoria View map PO Box 42 Caulfield South 3162 Contact us Online Get in touch online Tel 03 9524 3333 Email mail@gleneira.vic.gov.au National Relay Service (NRS) Step 1: contact NRS through your preferred NRS call channel NRS call numbers and links . Step 2: provide the NRS with our phone number 03 9524 3333 Languages русский 中文 Italiano 한국어 ελληνικά हिंदी Stay connected Email Subscribe Facebook Instagram LinkedIn Vimeo Bentleigh Bentleigh East Brighton East Carnegie Caulfield Elsternwick Gardenvale Glen Huntly McKinnon Murrumbeena Ormond St Kilda East Privacy Disclaimer and copyright Accessibility acknowledgement of country © 2025 Glen Eira City Council"
    },
    {
      "url": "https://www.glengower.ca/",
      "text": "Home - Glen Gower | Councillor / Conseiller | Stittsville About Development Events Newsletter Volunteers Contact Select Page HERE TO HELP! Contact my team with your questions or concerns. Here's how to reach us Latest news and updates NOTEBOOK: Motion to restrict parking on Brae Crescent Today at City Council I brought forward a notice of motion to install year-round on-street parking restrictions on Brae Crescent between Stittsville Main Street and Norway Spruce Street. Earlier this year, we received approval to install one-sided winter parking... OCTOBER 7: Stittsville South (W-4) update meeting An information meeting about the future community known as Stittsville South (W-4) is taking place at the Johnny Leroux Arena (10 Warner-Colpitts Lane) on October 7 from 6:30 p.m. to 8:30 p.m. This future community has been progressing through the City’s development... Councillor Glen’s Weekly Newsletter: September 10, 2025 O-Train Line 1 closed September 13 and 14 for East Extension performance testing La version française suit O-Train Line 1 will be closed and full R1 service will run this weekend as planned work continues to prepare for the launch of the O-Train East Extension to Trim Station. Following the successful completion of integration activities,... City releases final draft of the new Zoning By-law The City has released the final draft of the new Zoning By-law, a set of regulations that sets rules on what can be built “as of right”, without having to seek specific permission. The new Zoning By-law will implement the policies and directions in the City’s Official... Upcoming events in Stittsville Send your event info to glen.gower@ottawa.ca September 2025 September 9: Jack's Skate Join Jack and his family for an hour of open skating from 3:00 P.M. to 4:00 P.M. at the Myers Automotive Rink (The Bell Sensplex), 1565 Maplegrove Road where they are encouraging... Councillor Glen’s Weekly Video / September 6, 2025 Good morning! Today I’m in front of Flewellyn-Jones House on Fernbank Road.   https://youtu.be/v5lsjU3pB5g   This week’s updates: Update on the fire at Flewellyn-Jones House, and a bit of history Stittsville Muslim Association - support from the community... Fall Community Cleanup – Call for Volunteers! La version française suit On Saturday, September 20 from 12:45 p.m. to 2 p.m., join Councillor Glen's team and the Rotary Club of Ottawa–Stittsville at WJ Bell Rotary Peace Park (1751 Main Street, between Brigade Ave and Fernbank Rd) for our Fall Community Cleanup,... September 2025: Multicultural and Human Rights Calendar La version française suit  We publish a monthly calendar listing the main commemorative dates of various religions and cultures, as well as important dates related to strengthening human rights and diversity. If you have comments or suggestions for dates to add to the... Are vaccinations on your back-to-school checklist? La version française suit As children head back to the classroom, Ottawa Public Health (OPH) is reminding families to take precautions to help prevent the spread of vaccine-preventable diseases by ensuring their children and youth are up to date with their routine... New website helps patrons and venue owners explore Ottawa at Night La version française suit The City of Ottawa Nightlife Office has launched the Ottawa at Night website to help build awareness for the city’s nightlife, to promote nightlife safety and to assist nightlife businesses. The site caters mostly to individuals who want to... Councillor Glen’s Weekly Newsletter: September 4, 2025 Committee updated on final draft of new Zoning By-law and upcoming consultations La version française suit The Planning and Housing Committee today received an update on the status of the final draft of the new Zoning By-law, which will be released for public comment on Monday, September 8. The new Zoning By-law will help put the City’s Official... Committee approves Proposed 2026 Budget Directions La version française suit The Finance and Corporate Services Committee approved the Proposed 2026 Budget Directions, Timeline and Consultations Process. The City continues its Service Review to drive innovation, find efficiencies and savings, improve market... News from the Ottawa Public Library – Stittsville Branch La version française suit Sunday Hours Resume! As of Sunday, September 7, the Stittsville Branch of the OPL resumes regular Sunday opening hours after our summer hiatus. For more information about our hours of operation, please click here. Please check out these... 4829 Abbott Street East: Zoning By-law Amendment and Site Plan Control application La version française suit  The City of Ottawa has received a Zoning By-law Amendment and Site Plan Control application for the property located at 4829 Abbott Street East, located on the north side of Abbott Street East and west of Terry Fox Drive in the Fernbank... Councillor Glen’s Weekly Video / August 30, 2025 Good morning! Today I’m on Stittsville Main Street at the Stittsville Muslim Association community building. https://youtu.be/ZMSRgBws7VU   This week’s updates: Supporting the Stittsville Muslim Association after an incident of hateful vandalism Support for... Staff recommend demolition of Flewellyn-Jones House on Fernbank Road La version française suit (Photo: Flewellyn-Jones House, November 2013. Photo by Glen Gower.)/(Photo : Maison Flewellyn-Jones, novembre 2013. Photo de Glen Gower.) In a report to the Built Heritage Committee, City staff are recommending the approval of an application... Help shape the future of housing in our city La version française suit  Ottawa is a vibrant and growing city, with many people choosing to live, work and play here. However, access to affordable housing remains a critical and complex issue. Many residents who live on low and moderate incomes face challenges... UPDATE: Zoning for 1174 Carp at committee on September 3, 2025 UPDATE: City Council approved this application on September 10, 2025. La version française suit The Zoning By-law Amendment application for 1174 Carp Road is on the agenda for Planning and Housing Committee on September 3, 2025. The staff report was published... « Older Entries Judith Cox with the Stittsville Goulbourn Horticul Thanks to the Stittsville Rotary Club for organizi Here's my weekly #Stittsville video update, includ Annual Firefighters Memorial Service today at City Back to School at Maplewood today! Thanks to everyone who took part in today’s bike Here's my weekly #Stittsville video update:\nInclu Bike Rodeo at the parking lot of CARDELREC Recreat A few photos form this year’s @fiertecappride pa Load More... Follow on Instagram GET IN TOUCH Click here to contact Glen! SUBSCRIBE TO OUR NEWSLETTER Click here to sign up! Contact 613-580-2476 glen.gower@ottawa.ca City of Ottawa 3-1-1 www.ottawa.ca Email Newsletter Click here to subscribe ©2018-2025 Glen Gower | City Councillor for Stittsville Ward | City of Ottawa"
    },
    {
      "url": "https://www.stmaryspsmaghera.com/contact-us/",
      "text": "Contact Us Access Keys: Skip to content (access key S) Home page (access key 1) Site map (access key 2) Access key details (access key 0) Search Skip to Content Accessibility Sitemap Menu Home Our School Vision Staff Board of Governors Policies News Classes P.1 - Miss Glasgow P.2 - Ms Bradley P.2/3 - Mrs Proctor P.3 - Mrs Loughran P.4 - Mr Convery P.4 - Ms Shaw P.5 - Mr McGuckin P.5 - Miss Kelly P.6 - Mr Mulholland P6/7 Mrs Mulholland P.7 - Mrs Mc Kenna LSC1 - Mrs Burke LSC 2 - Ms Mulholland LSC2 - Ms Johnstone ASC - Mr Mullan Parents PE Days Calendar Holiday List Dinner Menu Online Safety at Home Home Learning Links Pupils Pupil Council Eco Team Extended Schools Wrap-Around Care Regional Training Centre Contact Us Contact Us St Mary's Primary School 47 Glen Rd Maghera BT46 5AP Phone: 028 7964 2712 Email: info@stmarysps.maghera.ni.sch.uk St Mary's Primary School, 47 Glen Rd, Maghera BT46 5AP  Phone: 028 7964 2712 Cookie Policy Website Privacy Policy Sitemap Website by School Web Design | Login"
    },
    {
      "url": "https://www.stmaryskids.org/about/our-leadership/",
      "text": "Our Leadership - St. Mary's Kids Go to St. Mary's Kids Home Visitor Info Contact & Locations Careers Events News Blog English Link [glt language=”English” label=”English”] Search Go to St. Mary's Kids Home About Our Mission Our History Our Leadership Our Medical Services Team Programs & Services Inpatient Services & Long-Term Care Aquatic Therapy Complementary Care Healing Arts & Therapeutic Recreation Rehabilitation Neuro-Rehabilitation Nursing Family Resource Directory Palliative Care Pediatric Feeding Disorders Respiratory Therapy Spinal Cord Injury Rehabilitation Spiritual Care Day & Outpatient Services ABA Therapy (Extraordinary Pediatrics) Aquatic Therapy Early Childhood Services Medical Day Healthcare Program Pediatric Feeding Disorders Seating and Mobility Spinal Cord Injury Rehabilitation Home Care St. Mary’s Home Care Home Care & Community Palliative Care Remote Patient Monitoring Early Education CPSE Evaluations SEIT Services Special Needs Preschool Community Programs Care Coordination Services For Families Get To Know Us Your Stay at St. Mary’s Family Services What to Expect Visitor Guidelines Resident Rights Family Newsletter Family as Partners in Care Grievance Process PFCC Champions Resource Library Patient & Family Advisory Council What is PFAC? PFAC Goals PFAC Charter Become a Member Ways To Give Donate Annual Fund Corporate Giving Planned Giving Tribute Gifts In-Kind & Holiday Giving Giving Societies Volunteer Why Give Donor Stories Your Impact Patient Stories Donate Home About Our Leadership Our Leadership St. Mary’s Healthcare System for Children is a touchstone in the treatment and healing process for our patients and their families. Behind every milestone our patients achieve is a team of visionary leaders with one shared mission: to make a lasting difference in the lives of medically complex children. From our President to our Board of Directors, their compassion and commitment drive everything we do—for the little ones who need it most. Executive Leadership Sean R. Lally President & CEO Sean R. Lally is the President and Chief Executive Officer of St. Mary’s Healthcare System for Children, New York City’s only provider of pediatric long-term and r... William Mead Executive Vice President, Chief Financial Officer William L. Mead, MBA, CPA, Executive Vice President, Chief Financial Officer of St. Mary’s Healthcare System for Children.\r\nJoining St. Mary’s in 2014, Bill has be... Dr. Carla P. Cangemi, MD, FAAP Vice President and Chief Medical Officer Dr. Cangemi is the Vice President and Chief Medical Officer of St. Mary's Healthcare System for Children.\r\nCarla P. Cangemi, MD, FAAP, FCCM has been Chief Medical Off... Patricia Hackenjos Vice President, Chief People and Culture Officer Patricia Hackenjos is Vice President, Chief People and Culture Officer of St. Mary’s Healthcare System for Children.\r\n\r\nPatricia (Trish) Hackenjos is the Vice Presid... Steven Polinsky Vice President & Chief Information Officer Steven Polinsky, Vice President and Chief Information Officer of St. Mary’s Healthcare System for Children.\r\nSteven is responsible for all Information Technology str... Adam Waxer Chief Legal Officer/General Counsel Adam Waxer is the Chief Legal Officer/General Counsel of St. Mary’s Healthcare System for Children.\r\nAdam is responsible for all legal and compliance matters at St. ... Dawn Cuglietto, PsyD Assistant Vice President, Strategic Planning & Clinical Innovation Elvira Fardella-Roveto, RN,FNP B-C Vice President, Administrator, St. Mary's Home Care Board of Directors Cindy S. Johnson, Co-Chair Stephen Brent Wells, Co-Chair Raymond M. Planell, Esq., Vice Chairman Samuel R. Karetsky, Secretary/Treasurer Stuart Acker Alexander K. Buchholz Ruth Colp-Haber Anthony Coniglio Risa Heller Mark Goldberg Wendy Goldstein Nancy Karch Thomas Kissane William Lerner Jeffrey Levine Henry T. Lievre Vincent L. Riso (In Memoriam) Peter E. Roth Mother Miriam, CSM, Founding Director Sr. Mary Jean, CSM, Founding Director Clinical Management Carla P. Cangemi, MD, FAAP Vice President and Chief Medical Officer Dawn Cuglietto, PsyD Assistant Vice President, Patient & Family Services and Rehabilitation Elvira Fardella-Roveto, RN, FNP B-C Vice President, Administrator, Home care Licensures & Memberships Licensure New York State Department of Health New York State Department of Education Memberships American Hospital Association American Public Health Association Association for the Care of Children’s Health Children’s Hospice International Children’s Hospital Association Continuing Care Leadership Coalition Greater New York Hospital Association Healthcare Association of New York State Home Care Association of New York State National Association for Home Care National Subacute Care Association Contact Us (718) 281-8800  | info@stmaryskids.org Follow Us Twitter Channel Facebook Profile YouTube Channel Instagram Profile Linkedin Profile Subscribe to Our Newsletter St. Mary’s Hospital for Children 29-01 216th Street Bayside, NY 11360 Telephone: (718) 281-8800 St. Mary’s Preschool Queens Borough President Helen Marshall Early Education Center Telephone: (718) 281-8848 Center for Pediatric Feeding Disorders Telephone: (718) 281-8541 ABA Therapy / Extraordinary Pediatrics Telephone: (516) 621-2681 CMS Overall Rating: 5 | Health Inspection Rating: 4 Staffing Rating: 5 | QM Rating: 5 Visitor Info Programs & Services For Families Privacy Corporate Compliance Corporate Hotline Employees & Contractors Pandemic Emergency Plan Privacy Policy Request Medical Records Transparency in Coverage Medical Hospital Resources Access the resources and information you need to be a strong advocate for a child with a complex medical condition. Learn More Center for Innovation The Mission of St. Mary's Center of Innovation is to improve the health and quality of life for children with special healthcare needs and their families through the development, acceleration, and research of innovative processes, programs and technologies. Learn More Copyright © 2025 St. Mary's Healthcare System for Children. All Rights Reserved. Built by Social Driver . About Expand Navigation Our Mission Our History Our Leadership Our Medical Services Team Programs & Services Expand Navigation Inpatient Services & Long-Term Care Expand Navigation Aquatic Therapy Complementary Care Healing Arts & Therapeutic Recreation Rehabilitation Neuro-Rehabilitation Nursing Palliative Care Pediatric Feeding Disorders Respiratory Therapy Spinal Cord Injury Rehabilitation Spiritual Care Day & Outpatient Services Expand Navigation ABA Therapy Aquatic Therapy Early Childhood Services Medical Day Healthcare Program Pediatric Feeding Disorders Early Childhood Services Seating and Mobility Spinal Cord Injury Rehabilitation Home Care Expand Navigation St. Mary’s Home Care Home Care & Community Palliative Care Remote Patient Monitoring Early Education Expand Navigation CPSE Evaluations SEIT Services Special Needs Preschool Community Programs Expand Navigation Care Coordination Services For Families Expand Navigation Get To Know Us Your Stay at St. Mary’s Expand Navigation Family Services What to Expect Visitor Guidelines Resident Rights Family Newsletter Family as Partners in Care Grievance Process PFCC Champions Family Resource Directory Resource Library Ways To Give Expand Navigation Donate Annual Fund Corporate Giving Planned Giving Tribute Gifts In-Kind Giving Giving Societies Volunteer Giving Tuesday Why Give Expand Navigation Donor Stories Your Impact Patient Stories Donate Visitor Info Contact & Locations Careers Events News Blog English Link [glt language=”English” label=”English”] Search Close Modal Close Modal"
    },
    {
      "url": "https://bakercountypress.com/2019/09/the-way-it-was-who-named-glen-st-mary/",
      "text": "The Way It Was: Who named Glen St. Mary? - The Baker County Press Close Menu Log In Subscribe Home Advertise Legal Notices News Obituaries Community Sports Opinion Calendar E-Edition Newspaper-2021 Newspaper-2022 Newspaper-2023 Newspaper-2024 Newspaper-2025 Facebook X (Twitter) Instagram Home Advertise Legal Notices E-Edition Newspaper-2021 Newspaper-2022 Newspaper-2023 Newspaper-2024 Newspaper-2025 About Us Login Facebook X (Twitter) Instagram YouTube Subscribe Now! News Crime Government Obituaries Community Sports Opinion Calendar Baker Backroads Home » The Way It Was: Who named Glen St. Mary? Uncategorized The Way It Was: Who named Glen St. Mary? By Joel Addington September 18, 2019 Updated: September 19, 2019 No Comments 4 Mins Read 31 Views Share Facebook Twitter Pinterest LinkedIn Tumblr Email Share Facebook Twitter When searching for the imaginative person or persons responsible for the romantic name of ‘Glen Saint Mary’, three names are most often mentioned; a postmistress by the name of Mrs. Theresa Cole, the founder of the Glen Nurseries, Mr. George L. Taber, and a retired sea captain by the name of J. M. ‘Roger’ Vaughn. To be certain, no southern cracker with the habit of labeling sites and areas ‘Devil’s Cup and Saucer’, ‘Possum Trot’, and ‘Breakfast Branch’ is included. Of the three, Mr. Taber, as a founder and developer of Glen, received the honor of the christening of Glen Saint Mary, and his story will be treated in a later article. Mrs. Cole, the former Miss Theresa M. Tilton is the least known of the three. She was from ‘up north’, and first appears on local records in 1883. She purchased several pieces of land in and around Glen in 1883 and ‘84. She sold land to Jesse E. Cole in 1887, and, later that year, became his wife. She was Glen’s second appointment to the office of postmaster (22 September 1882), following D. Lansing Skinner. She was re-appointed as Theresa M. Cole on 20 April 1887. After that, the Coles slipped from the Baker County scene. The last candidate for naming Glen Saint Mary could have qualified, but he arrived too late. He was sea captain Roger Vaughn. In May of 1883, a deed was filed granting him 160 acres of land for $3,000 from Carr B. and Ada McClenny, known today as the Eiserman Place. This was an extensive and well-kept farm. On the property was a huge double pen log house which Capt. Vaughn converted into a showplace by filling it with his collected treasures from around the world. The cracker folk fortunate enough to visit inside claimed it was a beautiful sight, full of crystal, china, and oddities. Statues and hunters’ trophies decorated corners and walls. Great chandeliers brilliantly illuminated the spacious rooms, and, a novelty in Baker County, carpets covered the floors. The captain was also an artist, and several of his oils hung among the many others he had collected from all over the world. A neighboring widow, Mrs. Caroline (nee Kersey) Lauramore was hired by the Vaughns as housekeeper. She lived nearby on the present Ponsell Nursery, and when the benevolent Capt. Vaughn died about 1895, she was retained to assist Mrs. Vaughn. The Widow Vaughn continued to pay Mrs. Lauramore well until she (Mrs. Vaughn) ‘fell into unfortunate company’. A doctor, described as unsavory and given to drink, moved from Jacksonville into her home and allegedly helped her spend her money. When her cash was depleted Mrs. Vaughn paid Mrs. Lauramore with paintings and other valuables from the house. Almost weekly, objects of art and fine furniture were hauled away to Jacksonville to pay off ever-mounting debts. Between unscrupulous lawyers and the doctor, the distraught widow was soon a pauper and died soon after. ‘Vaughn’s Wash Hole’ and an occasional old-timer’s, reference to ‘the Old Vaughn Place’ is all that remains. However, an ironic and happier epilogue to the Vaughn story concerns a son of Mrs. Lauramore. He is Mr. H. H.’Bruiser’ Lauramore, soon to be 100 years of age. For many years he was gardener for Mrs. Nina Cummer, by way of his employ at Mr. Taber’s Glen Nurseries, and recently retired as landscape artist of the famed Cummer Gallery of Art. More will appear on him later this month. By the late Gene Barber, who chronicled Baker County history in The Press in his column, The Way It Was. This piece was first published in 1975 . gene barber glen st. mary history they way it was Share. Facebook Twitter Email Joel Addington Website X (Twitter) The Baker County Press Managing Editor Related Posts Community Jane Johns: Survivor of scalping and shooting by Indians August 13, 2025 Uncategorized $716K river resiliency grant August 7, 2025 Community ‘The Way it Was’ auditions coming up soon! August 6, 2025 Opinion Gene Barber’s ‘The Way It Was’ takes the stage soon July 24, 2025 Uncategorized Okefenokee mine nixed; Conservation group buys site July 3, 2025 Uncategorized Christian Cruisers 1st annual car show at Walmart July 3, 2025 Add A Comment Comments are closed. © 2025 The Baker County Press. Contact Us Contact Advertising/Production Director: Jessica Prevatt – advertising@bakercountypress.com Contact Classifieds: Camille FitzPatrick Contact News Editor: Joel Addington – editor@bakercountypress.com Contact Publisher: Jessica Prevatt – advertising@bakercountypress.com Contact Sports Editor: Kevin Upright – sports@bakercountypress.com Privacy Policy E-edition Submit Type above and press Enter to search. Press Esc to cancel. Ad Blocker Enabled! Ad Blocker Enabled! Our website is made possible by displaying online advertisements to our visitors. Please support us by disabling your Ad Blocker. Sign In or Register Welcome Back! Login below or Register Now . Log In Remember Me Lost password? Register Now! Already registered? Login . Password (please type it twice) * password strength indicator First Name * Last Name * Street Address * City, State * Zip Code * Enter a Valid Phone number (including area code) * Yes, I want to receive updates via email. Register A password will be e-mailed to you."
    },
    {
      "url": "https://liveoak.govoffice.com/staff_board?pri=0",
      "text": "Community Redevelopment Staff & Board Members - Live Oak, Florida Skip to main content search menu Search Home About Holiday  Schedule Calendar Public Notices Fair Housing Standard Florida Small Business Development Center Offer Up Meet Up Spot Public Safety Reminder about Natural Gas USDA Statement of Non-Discrimination Title VI/Non-Discrimination Policy Statement of Nondiscrimination ADA Transition Plan Site Map Job Openings Feedback Forum Announcements Accessibility Statement Community Links Government Mayor and City Council Mayor Davis'  Welcome Letter Elected Officials City Manager City Attorney Council District Map Swearing in Ceremony July 12, 2022 Public Records/Records Custodian Request for Qualifications\\Proposals\\Bids CRA Community Redevelopment Staff & Board Members CRA Agendas 2020 CRA Agendas 2021 CRA Board Meeting Agendas 2022 CRA Board Meeting Agendas 2023 CRA Board Meeting Agendas CRA Meetings Audio 2020 CRA Board Meeting Audio 2021 CRA Board Meeting Audio 2022 CRA Board Meeting Audios 2023 CRA Board Meeting Audio CRA Grants Brownfields Grants CRA Annual Reports CRA Budgets City Council Meetings Agenda and Minutes 2022 City Council Meeting Agendas 2022 City Council Meeting Minutes 2022 City Council Meeting Packets 2023 City Council Meeting Agenda 2023 City Council Meeting Minutes Audio of Meetings 2022 City Council Meetings Audio 2023 City Council Meeting Audio City Departments Administration City Policies Facebook Policy Garage, Carport, & Yard Sales Policy Gas Leak Policy Live Oak Tree Removal Policy Waste Disposal:Yard & Household Debris Policy Water Leak Policy Animal Control/Pet Adoption Building Department City Clerk Business Tax Receipt Cemetery Cemetery GIS Map Link Ordinances Code Enforcement Economic Development Finance Budget Financial Statements Local Pension Plan Information Fire Department Staff Directory Division of Safety and Training Fire Prevention and Education Sparky The Fire Dog Smokey Bear History Fire Department Archives Events Human Resources Police Department Welcome Page Directory Departmental Divisions Contact Live Oak Police About the Chief Message From The Chief Our Mission Statement Programs and Event History Page CRIME STOPPERS Police Academy Public Works Planning, Zoning, & Development Economic Development Items Requests for Zoning Data & Zoning Map Land Development Regulations  ( LDR ) Commercial / Residential Development Review and Approval Special Temporary Uses & Events Subdivisions Land Use, Zoning and Other Public Hearing Matters DCA Notices of Intent Sign Regulations Comprehensive Plan Residents Utility Services Annual Water Quality Report Gas Service Safety Reminder Natural Gas Opening a Utility Account Utility Rates Water Usage Tips 811 Call Before You Dig Pay My Utility Bill Search A Caring Community Navigation, primary Home About Holiday  Schedule Calendar Public Notices Fair Housing Standard Florida Small Business Development Center Offer Up Meet Up Spot Public Safety Reminder about Natural Gas USDA Statement of Non-Discrimination Title VI/Non-Discrimination Policy Statement of Nondiscrimination ADA Transition Plan Site Map Job Openings Feedback Forum Announcements Accessibility Statement Community Links Government Mayor and City Council Mayor Davis'  Welcome Letter Elected Officials City Manager City Attorney Council District Map Swearing in Ceremony July 12, 2022 Public Records/Records Custodian Request for Qualifications\\Proposals\\Bids CRA Community Redevelopment Staff & Board Members CRA Agendas 2020 CRA Agendas 2021 CRA Board Meeting Agendas 2022 CRA Board Meeting Agendas 2023 CRA Board Meeting Agendas CRA Meetings Audio 2020 CRA Board Meeting Audio 2021 CRA Board Meeting Audio 2022 CRA Board Meeting Audios 2023 CRA Board Meeting Audio CRA Grants Brownfields Grants CRA Annual Reports CRA Budgets City Council Meetings Agenda and Minutes 2022 City Council Meeting Agendas 2022 City Council Meeting Minutes 2022 City Council Meeting Packets 2023 City Council Meeting Agenda 2023 City Council Meeting Minutes Audio of Meetings 2022 City Council Meetings Audio 2023 City Council Meeting Audio City Departments Administration City Policies Facebook Policy Garage, Carport, & Yard Sales Policy Gas Leak Policy Live Oak Tree Removal Policy Waste Disposal:Yard & Household Debris Policy Water Leak Policy Animal Control/Pet Adoption Building Department City Clerk Business Tax Receipt Cemetery Cemetery GIS Map Link Ordinances Code Enforcement Economic Development Finance Budget Financial Statements Local Pension Plan Information Fire Department Staff Directory Division of Safety and Training Fire Prevention and Education Sparky The Fire Dog Smokey Bear History Fire Department Archives Events Human Resources Police Department Welcome Page Directory Departmental Divisions Contact Live Oak Police About the Chief Message From The Chief Our Mission Statement Programs and Event History Page CRIME STOPPERS Police Academy Public Works Planning, Zoning, & Development Economic Development Items Requests for Zoning Data & Zoning Map Land Development Regulations  ( LDR ) Commercial / Residential Development Review and Approval Special Temporary Uses & Events Subdivisions Land Use, Zoning and Other Public Hearing Matters DCA Notices of Intent Sign Regulations Comprehensive Plan Residents Utility Services Annual Water Quality Report Gas Service Safety Reminder Natural Gas Opening a Utility Account Utility Rates Water Usage Tips 811 Call Before You Dig Pay My Utility Bill Community Redevelopment Agency Staff and Board Members Staff CRA Co ordinator Nicholas Frigiola nfrigiola@cityofliveoak.org 386-362-2009 CRA Assistant C hristian Dixon cdixon@citofliveoak.org 386-362-2009 Board Members Per Ordinance 861 and in accordance with the Community Redevelopment Act Sections 163.330 through 163.450, the Agency Board of Directors is comprised of 7 members:  5 City Council Members (Elected Officials) and 2 appointed members (appointed by Council) from within the redevelopment area.  The CRA Board is as follows: Tommie Jefferson 101 White Ave. SE Councilmember, District 1 (386) 209-8680 tjefferson @cityofliveoak.org (term ends June of 2026) Lynda Brown-Owens 101 White Ave. SE Councilmember, District 2 (386) 209-6924 lowens@cityofliveoak.org (term ends June of 2024) David Burch 101 White Ave. SE Chair; Councilmember, District 3 (386) 362-2211 dburch@cityofliveoak.org (term ends June of 2024) Matt Campbell 101 White Ave. SE Councilmember, District 4 (386) 590-0852 mcampbell@cityofliveoak.org (Term ends June of 2026) Tesie Allen 101 White Ave. SE Councilmember, District 5 (386) 208-3691 t allen@cityofliveoak.org (Term ends June of 2024) Cindy Robinson 101 White Ave. SE Appointed Member T.D. Bank (386) 364-5528 Cynthia.Robinson@td.com (Term ends June of 2023) Tammy Mobley 101 White Ave. SE Appointed Member Retired (Term ends June of 2023) Follow us on social media! Contact Us City of Live Oak Community Redevelopment Agency 416 Howard St. E. Live Oak, FL 32064 Phone: (386) 362-2276 Fax: (386) 330-6507 City of Live Oak, Florida    © Copyright 2019    All Rights Reserved 101 White Avenue S.E.  Live Oak, Florida  32064 Phone 386-362-2276    Fax 386-362-4305    Email clerkoffice@cityofliveoak.org Utilities Email utility@cityofliveoak.org Disclaimer:  According to Florida Public Records Law, email correspondence to and from the City of Live Oak, including email addresses and other personal information, is public record and must be made available to the public and media upon request, unless otherwise exempt by the Public Records Law.  If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity.  Instead, contact this office by phone or in writing. Government Websites by Catalis"
    },
    {
      "url": "https://toucandesign.net/florida/baker-county-florida/glen-st-mary-florida-social-media-marketing/",
      "text": "Glen St. Mary Florida Social Media Marketing, Toucan Design, Graphic Design, Web Design, Branding, Marketing Skip to content Home Design Services Menu Toggle Graphic Design Logo Design Social Media Marketing Web Design Web Design Services Menu Toggle Web Design Social Media Marketing Printing Services Our Work Menu Toggle Agricultural Menu Toggle Eco Agro Aviation Menu Toggle Simcom Construction Menu Toggle Josko Services Ecommerce Menu Toggle Magma Diamond Tools My Lullaby Boutique Financial Menu Toggle Elevation Financial Group Food & Beverage Menu Toggle ABC Fine Wine & Spirits HomeMaker Juice Government Menu Toggle Florida Department of Health OBTNext Homes Menu Toggle M Lahr Homes Hotel Menu Toggle Delta Orlando Resort Holiday Inn Lake Buena Vista Housing Menu Toggle The Park Apartments Insurance Menu Toggle O’Neil, Lee + West Manufacturing Menu Toggle Custom Comfort Medtek Eco Agro Endotec Magma Diamond Tools Universal Polishing Systems Medical Menu Toggle Custom Comfort Medtek Daouk Orthopedics Endotec UroViu Real Estate Menu Toggle MSquared RE/MAX Exclusive Collection Retail Menu Toggle My Lullaby Boutique Solutions Bridal Restaurant Menu Toggle Gator’s Dockside Restaurant Ibendoo Ramen Maria Bonita Mexican Restaurant Norman’s Restaurant Ritz-Carlton Orlando Raglan Road Irish Pub Disney Springs® Terra Cotta Pizza Services Menu Toggle Family First Pools Josko Services Shopping Menu Toggle Magma Diamond Tools My Lullaby Boutique Telecommunications Menu Toggle Last Mile Corp Transportation Menu Toggle Star Taxi Travel & Tourism Menu Toggle Norwegian Cruise Line Contact Menu Toggle New Client Contact Employment Inquiry Vendors & Partners Inquiry Search for: Search Main Menu Call Now Call Now Schedule A Call Schedule A Call Home Design Services Menu Toggle Graphic Design Logo Design Social Media Marketing Web Design Web Design Services Menu Toggle Web Design Social Media Marketing Printing Services Our Work Menu Toggle Agricultural Menu Toggle Eco Agro Aviation Menu Toggle Simcom Construction Menu Toggle Josko Services Ecommerce Menu Toggle Magma Diamond Tools My Lullaby Boutique Financial Menu Toggle Elevation Financial Group Food & Beverage Menu Toggle ABC Fine Wine & Spirits HomeMaker Juice Government Menu Toggle Florida Department of Health OBTNext Homes Menu Toggle M Lahr Homes Hotel Menu Toggle Delta Orlando Resort Holiday Inn Lake Buena Vista Housing Menu Toggle The Park Apartments Insurance Menu Toggle O’Neil, Lee + West Manufacturing Menu Toggle Custom Comfort Medtek Eco Agro Endotec Magma Diamond Tools Universal Polishing Systems Medical Menu Toggle Custom Comfort Medtek Daouk Orthopedics Endotec UroViu Real Estate Menu Toggle MSquared RE/MAX Exclusive Collection Retail Menu Toggle My Lullaby Boutique Solutions Bridal Restaurant Menu Toggle Gator’s Dockside Restaurant Ibendoo Ramen Maria Bonita Mexican Restaurant Norman’s Restaurant Ritz-Carlton Orlando Raglan Road Irish Pub Disney Springs® Terra Cotta Pizza Services Menu Toggle Family First Pools Josko Services Shopping Menu Toggle Magma Diamond Tools My Lullaby Boutique Telecommunications Menu Toggle Last Mile Corp Transportation Menu Toggle Star Taxi Travel & Tourism Menu Toggle Norwegian Cruise Line Contact Menu Toggle New Client Contact Employment Inquiry Vendors & Partners Inquiry Home Design Services Menu Toggle Graphic Design Logo Design Social Media Marketing Web Design Web Design Services Menu Toggle Web Design Social Media Marketing Printing Services Our Work Menu Toggle Agricultural Menu Toggle Eco Agro Aviation Menu Toggle Simcom Construction Menu Toggle Josko Services Ecommerce Menu Toggle Magma Diamond Tools My Lullaby Boutique Financial Menu Toggle Elevation Financial Group Food & Beverage Menu Toggle ABC Fine Wine & Spirits HomeMaker Juice Government Menu Toggle Florida Department of Health OBTNext Homes Menu Toggle M Lahr Homes Hotel Menu Toggle Delta Orlando Resort Holiday Inn Lake Buena Vista Housing Menu Toggle The Park Apartments Insurance Menu Toggle O’Neil, Lee + West Manufacturing Menu Toggle Custom Comfort Medtek Eco Agro Endotec Magma Diamond Tools Universal Polishing Systems Medical Menu Toggle Custom Comfort Medtek Daouk Orthopedics Endotec UroViu Real Estate Menu Toggle MSquared RE/MAX Exclusive Collection Retail Menu Toggle My Lullaby Boutique Solutions Bridal Restaurant Menu Toggle Gator’s Dockside Restaurant Ibendoo Ramen Maria Bonita Mexican Restaurant Norman’s Restaurant Ritz-Carlton Orlando Raglan Road Irish Pub Disney Springs® Terra Cotta Pizza Services Menu Toggle Family First Pools Josko Services Shopping Menu Toggle Magma Diamond Tools My Lullaby Boutique Telecommunications Menu Toggle Last Mile Corp Transportation Menu Toggle Star Taxi Travel & Tourism Menu Toggle Norwegian Cruise Line Contact Menu Toggle New Client Contact Employment Inquiry Vendors & Partners Inquiry Search for: Search Main Menu Call Now Call Now Schedule A Call Schedule A Call Home Design Services Menu Toggle Graphic Design Logo Design Social Media Marketing Web Design Web Design Services Menu Toggle Web Design Social Media Marketing Printing Services Our Work Menu Toggle Agricultural Menu Toggle Eco Agro Aviation Menu Toggle Simcom Construction Menu Toggle Josko Services Ecommerce Menu Toggle Magma Diamond Tools My Lullaby Boutique Financial Menu Toggle Elevation Financial Group Food & Beverage Menu Toggle ABC Fine Wine & Spirits HomeMaker Juice Government Menu Toggle Florida Department of Health OBTNext Homes Menu Toggle M Lahr Homes Hotel Menu Toggle Delta Orlando Resort Holiday Inn Lake Buena Vista Housing Menu Toggle The Park Apartments Insurance Menu Toggle O’Neil, Lee + West Manufacturing Menu Toggle Custom Comfort Medtek Eco Agro Endotec Magma Diamond Tools Universal Polishing Systems Medical Menu Toggle Custom Comfort Medtek Daouk Orthopedics Endotec UroViu Real Estate Menu Toggle MSquared RE/MAX Exclusive Collection Retail Menu Toggle My Lullaby Boutique Solutions Bridal Restaurant Menu Toggle Gator’s Dockside Restaurant Ibendoo Ramen Maria Bonita Mexican Restaurant Norman’s Restaurant Ritz-Carlton Orlando Raglan Road Irish Pub Disney Springs® Terra Cotta Pizza Services Menu Toggle Family First Pools Josko Services Shopping Menu Toggle Magma Diamond Tools My Lullaby Boutique Telecommunications Menu Toggle Last Mile Corp Transportation Menu Toggle Star Taxi Travel & Tourism Menu Toggle Norwegian Cruise Line Contact Menu Toggle New Client Contact Employment Inquiry Vendors & Partners Inquiry Glen St. Mary Florida Social Media Marketing By Toucan Design / May 29, 2014 At Toucan Design, we use an integrated social media strategy. We develop customized strategies based on your Glen St. Mary Florida social media marketing goals and resources. The strategies focus on the execution of content creation, engagement, community management, best practices, brand monitoring, and sentiment analysis. Glen St. Mary Florida Social Media Marketing Personalized Approach GET OUR PRICING GUIDE! Fill your email address below, and we’ll send you our latest pricing guide right away. Please enable JavaScript in your browser to complete this form. Email * Get Pricing Guide We follow a personalized strategic approach to the creation of content for your brand. All our social media campaigns are focused on delivering value, inspiration, information, and education, and giving your target audience reasons to follow and/or engage with you. We know that social media is about being ‘social’ and not ‘selling’. And that is where we have been successful in developing and providing personalized Glen St. Mary Florida social media marketing strategies and solutions to our clients. When it comes to matching pace with your Baker County target audience and the platforms they spend time on, your brand must become a content creator. Our efforts are persistently focused on relevancy and authenticity to generate genuine social engagement. How It Works Social Media Platforms We Market Instagram Our team shares the beauty of everyday moments with new customers on Instagram. We post Fun Videos. Share Your Stories. Express Yourself. Create Cool Videos. Share With Friends. Share Your Photos daily. Facebook We post daily to Facebook, a social media website which allows users to connect with new customers, work colleagues or people they don’t know, online. It allows users to share your pictures, music, videos, & articles. X (formerly Twitter) We help you engage with new customers on the X platform. From breaking news and entertainment to sports and politics, new potential customers get the full story with all the live commentary. LinkedIn Engage with over 750 million+ members. We manage your professional identity. Build and engage with your professional network. Access knowledge, insights and opportunities. Pinterest Enable saving and discovery of information like recipes, home, style, motivation, and inspiration on the internet using images and, on a smaller scale, animated GIFs and videos, in the form of pinboards. The Types of Glen St. Mary Florida Social Media Posts We Develop The Types of Posts We Employ LIKE DRIVERS COMMENT DRIVERS SHARE DRIVERS WEB TRAFFIC DRIVERS RELATIONSHIP BUILDERS CREDIBILITY BUILDERS PRESENCES BUILDERS PROMOTIONAL POSTS LIKE DRIVERS Like Drivers Posts that encourage people to leave a comment or that promote conversation, so subscribers see more posts in general. We create daily social media posts that encourage users to engage. They are highly likely to leave a like or comment and engage in a conversation. This contributes to the algorithm to improve the visibility of the posts. Like generators are important part of our social media strategy and are especially relied upon when our clients have low followership. While ‘likes’ are seen as a low-value form of engagement by the algorithms, it is a powerful strategy to invite and encourage post-likers to transform into page-likers. There is a stronger emphasis on best-performing posts which are perfect for boosting The posts can include images, stories, or quotes with inspirational, uplifting, or humorous messages COMMENT DRIVERS Comment Drivers These types of post are generic “feel good” image or video posts that are super-easy to “comment” and move on. Such social media posts include feel-good images or video content that deserve a quick comment from users. We follow this social media strategy on accounts or channels that have at least a medium-sized following. Some of the more effective and more engaging examples of such posts include: Trivia questions, quizzes, & surveys Quote this image This or That? Posts with fill in the blanks Open-ended questions The goal is to boost engagement levels. The strategy can also include measures to invite commenters to become account or channel fans or followers. With this strategy, there is a greater emphasis on the best-performing posts. SHARE DRIVERS Share Drivers Generic posts with calls-to-action to share post for increased exposure & likes. We develop social media sharing strategies involving posts with compelling calls-to-action (CTA) for sharing the posts. This further leads to growth in exposure and likes. Some of the key features of our share-driver strategies are as follows: Share-drivers generate the best results when there is low social media followership Identifying and boosting the best-performing posts Targeting and rewarding the sharers Some effective ways to add value to the posts and drive shares include the addition of videos, infographics, images, linking to relevant/useful content on your website, and external resource linking. Some of the more effective strategies for share-generating posts include: Share to make a difference Share if you agree Share to a friend who is/has ______ Share something to a friend’s timeline to make their day more special Let Toucan Design take care of writing social media content for your business. WEB TRAFFIC DRIVERS Web Traffic Drivers Any partial content from your website that leaves followers wanting more. What they should want is more content they can only get from your website. Sharing brief excerpts from your website on your social media accounts can leave your followers wanting more. We create social media strategies to generate website traffic. This includes guiding them to get the whole content by visiting your website. This begins by ensuring your website is optimized, boosting visibility, and brand awareness. Some of the more effective web traffic generating strategies include: Creating visuals that complement your post content Reaching your audience when they are most active Writing better CTAs Using hashtags to boost visibility Make it easy to share your content Audience engagement A web traffic generation strategy is not just focused on driving your existing followers to your webpages, but also on enabling them to share your content and pages and drive additional traffic. Over the years, Toucan Design has mastered the art of engaging new potential customers. RELATIONSHIP BUILDERS Relationship Builders Public posts to praise or promote a person with whom you want to build a relationship. We strongly believe that social media marketing is about being ‘social’. So, relationship building is at the heart of social media marketing. We develop and implement multiple relationship-builder strategies. This includes: Showing appreciation to customers through contests, promotions, giveaways, and coupons. Contests and giveaways create excellent social media marketing opportunities, further generating lots of buzz and placing your brand on top of everyday trending lists. Responding to all online reviews, including positive and negative ones. Public posts for praising/promoting followers or customers who are ideal candidates for brand relationship building. Such posts are used sparingly to maintain their potency and effectiveness. They generate higher impact and target influencers and referral sources. Consistency is the key to building customer relationships and our team provides professional daily design and posting services. CREDIBILITY BUILDERS Credibility Builders These have low engagement, but demonstrate & position you as an expert. Credibility building strategies feature low engagement but place you as an authority in your authority, niche, or field of specialization. We develop your credibility building strategy and respective posts with the following elements in focus: This strategy is more important and effective for high complexity businesses or brands with low trust. The posts work better with mentions or questions for generating referrals. These posts are never boosted to ensure value proposition. Some of the key strategies used for credibility building posts include: Following a consistent and well-planned posting schedule Keeping tabs on the competition and current trends Experimenting with your content PRESENCES BUILDERS Presence Builders Post meant to have no significant engagement but demonstrate high levels of activity to increase visibility. Presence builder social media posts are used to demonstrate high levels of activity and to boost visibility. They may not have as much significance in terms of driving engagement. Such posts help maintain your brand/business’ relevance and ensure you appear in your followers’ feed. Only more successful posts qualify for boosting. Visual posts, without or without text are common examples. This includes images and memes that are humorous, trending, ironic, and relevant to your business. We will create an editorial schedule and keep the content fresh to maintain interest. PROMOTIONAL POSTS Promotional Posts Any post that promotes a product, service, event, etc. Often, without directly asking for the sale. This social media marketing strategy promotes your product, service, event, or other developments without directly asking for sales. These posts can serve various purposes or goals, including: Attracting new customers Building brand loyalty Driving leads & sales Our promotional posts are creatively versatile and perfect for boosting. We constantly test the success of these posts to make adjustments. We specialize in creating graphics that help maintain consistency in your social media branding with your company’s brand. Our experienced and qualified team can take over the burden of designing and writing social media posts for your business or professional practice. Social Media Marketing Success Story Browse JOSKO Service’s social media posts below, featuring daily Instagram posts🡭 . View their entire project here🡭 . Glen St. Mary Social Media Marketing Social Media Marketing Monthly Offerings 3 packages offered to fit your companies posting needs. Our team designs and writes daily to your Facebook, Instagram, Twitter and/or LinkedIn social media accounts. Social Media Marketing Monthly Offerings 3 packages offered to fit your companies posting needs. Our team designs and writes daily to your Facebook, Instagram, Twitter, LinkedIn and Pinterest social media accounts. Daily Posting We post to the social media platform of your choice! $ 250 Monthly 1 daily post 7 days a week 365 days a year English or Spanish Network of your choice Facebook, Instagram, Twitter, LinkedIn, or Pinterest Click Here Click to get started! Add Another Network Add any additional network of your choice! $ 150 Monthly Additional network of your choice Add 1 of the 4 networks Facebook, Twitter, LinkedIn, or Pinterest Want more networks? See our 3 network pacakge special! Click Here Click to get started! 3 Social Media Networks We post to 3 social media platforms of your choice! $ 495 Monthly 1 daily post to 3 networks 7 days a week 365 days a year English or Spanish 3 networks of your choice Facebook, Instagram, Twitter, LinkedIn, or Pinterest Click Here Click to get started! Popular Ready To Start? Great! Start Your Glen St. Mary Florida Social Media Marketing Project Today Fill your information below and a representative will contact you to get started! Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Business Name * Pick A Package * Single Social Media Platform Single Platform + Another Platform Three Social Media Platforms [Best Value] Please select your desired Social Media Platform(s) Your Social Media Selection * Instagram Facebook Twitter LinkedIn Please select up to 3 platforms based on your package selection. Describe your business in one sentence: * What are your business goals? * Who are your potential clients? * Attach your logo Click or drag a file to this area to upload. Not require, but always helpful to get you started! Anything else you'd like to add? Submit Post navigation ← Previous Post Next Post → Ready to Start? Call our award-winning team 24/7 at (407) 245-8022 Your company’s success\nis our success. Get in touch 407-245-8022 Services Graphic Design Services Logo Design Services Web Design Services Print Design Services Printing Services Social Media Marketing SEO Services Project Locations Dola Ohio Graphic Design November 19, 2021 Mount Croghan South Carolina Graphic Design February 20, 1991 Jupiter Florida Social Media Marketing April 6, 2007 Mangonia Park Florida Logo Design April 8, 1991 Venus Texas Social Media Marketing August 11, 2017 Our Work Featured Work Aviation Construction Food & Beverage Restaurant About Terms & Conditions Pricing Blog New Clients Brand Assets Copyright ©2025 Toucan Design, Inc. | All Rights Reserved Facebook-f Twitter Instagram"
    },
    {
      "url": "https://glenindia.com/pages/contact-us",
      "text": "Contact Us | Get in Touch with Glen for Support & Inquiries"
    }
  ]
}