{
  "fuentes": [
    {
      "url": "https://member.grandharbor.com/employment",
      "email": "employment@grandharbor.com"
    },
    {
      "url": "https://member.grandharbor.com/employment",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://member.grandharbor.com/privacy-policy",
      "email": "info@grandharbor.com"
    },
    {
      "url": "https://member.grandharbor.com/privacy-policy",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://grandharbor.com/golf/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://grandharbor.com/contact/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "info@harborclub.com"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "u003einfo@harborclub.com"
    },
    {
      "url": "https://grandharbor.com/privacy-policy/",
      "email": "info@grandharbor.com"
    },
    {
      "url": "https://grandharbor.com/weddings-events/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://grandharbor.com/beach-club/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://grandharbor.com/about/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://grandharbor.com/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://goodharborgroup.com/",
      "email": "info@goodharborgroup.com"
    },
    {
      "url": "https://grandharbor.com/contact-us/",
      "email": "membership@grandharbor.com"
    },
    {
      "url": "https://grandharbor.com/dining/",
      "email": "membership@grandharbor.com"
    }
  ],
  "mails": [
    "employment@grandharbor.com",
    "info@belfairsgolfclub.co.uk",
    "info@goodharborgroup.com",
    "info@grandharbor.com",
    "info@harborclub.com",
    "membership@grandharbor.com",
    "u003einfo@harborclub.com"
  ],
  "nombre_sitio": "grandharbor.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://member.grandharbor.com/employment",
      "text": "Employment - Grand Harbor Grand Life Public Archive 2025 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September 2024 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2023 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2022 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2021 Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December Call Us Login Member Login MENU Grand Life Public Archive 2025 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September 2024 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2023 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2022 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2021 Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December Employment Life is GRAND, work can be too! Grand Harbor Golf and Beach Club is always looking for people who are sincerely interested in providing the highest quality services to be found anywhere; the most unique aspect of the Company is our extraordinary people. We strongly believe that every person who works here, regardless of his job, is a professional at whatever he or she does and contributes greatly to the overall success of the Company. We have worked hard to recruit the best and we highly value every employee on the team. Some of the ways we recognize the hard work of our employees are through holiday parties, end of season parties and annual health fairs. We also offer complimentary employee meals and golf privileges during the summer. Moreover, we offer competitive wages and a beautiful working environment. To apply, please send your resume and cover letter or application to: Grand Harbor Golf & Beach Club Attn: Human Resources 4985 Club Terrace Vero Beach, FL 32967 OR E-mail to employment@grandharbor.com Grand Harbor Golf and Beach Club is an equal opportunity employer and maintains a drug-free workplace. Our hiring process includes criminal background checks and drug screenings. Credit checks are also conducted for some positions. Employment Privacy Policy Terms of Service Contact Us 4985 Club Terrace • Vero Beach, Florida 32967 772.778.9000 | membership@grandharbor.com Follow us on Facebook Follow us on Twitter © 2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://member.grandharbor.com/privacy-policy",
      "text": "Privacy Policy - Grand Harbor Grand Life Public Archive 2025 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September 2024 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2023 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2022 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2021 Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December Call Us Login Member Login MENU Grand Life Public Archive 2025 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September 2024 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2023 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2022 Grand Life January Grand Life February Grand Life March Grand Life April Grand Life May Grand Life June Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December 2021 Grand Life July Grand Life August Grand Life September Grand Life October Grand Life November Grand Life December Privacy Policy Feel free to visit grandharbor.com to access a multitude of useful information about our club and amenities without telling us who you are or submitting any information about yourself. If you choose to give us any personal or contact information that we may need to respond to your requests for information, send you a newsletter, or keep you informed about news or upcoming events, we will keep this information confidential. We will never share, sell or rent individual personal information to anyone without your advanced permission or unless ordered by a court of law. If you have received unwanted, unsolicited email sent from us or claiming to be sent from us, please forward a copy of that email with your comments to info@grandharbor.com . Employment Privacy Policy Terms of Service Contact Us 4985 Club Terrace • Vero Beach, Florida 32967 772.778.9000 | membership@grandharbor.com Follow us on Facebook Follow us on Twitter © 2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://grandharbor.com/golf/",
      "text": "Golf - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us GOLF One of the Treasure Coast's most prestigious golf communities With two championship golf courses to choose from, each course has its own unique characteristics and style. We also feature a driving range and aqua range, two chipping greens, and two putting greens. Both 18-hole golf courses have recently undergone extensive renovations and uphold meticulous maintenance to provide members with a superior golf experience. HARBOR COURSE RIVER COURSE Partners with Nature Recently redesigned and renovated, the River Course celebrates its origins designer, Joe Lee, while adding elements of sustainability and design updates to meet the demands of the modern golfer. Designed with picturesque views among pristine water vistas and a well-balanced layout, this course provides an exceptional golfing experience to both experienced and beginning golfers. EXPERIENCE GRAND HARBOR Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://grandharbor.com/contact/",
      "text": "Contact Grand Harbor - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us Contact Us Thank you for visiting Grand Harbor Golf and Beach Club. For general inquiries, please contact us at 772-778-9000 or complete the form below. A member of our team will respond to you promptly. Grand Harbor – Main Clubhouse 4985 Club Terrace Vero Beach, FL 32967 Grand Harbor Beach Club 8500 Highway A1A, Vero Beach, Florida 32963 Name Email Address Message SUBMIT Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "text": "Contact - Harbor Club GA Real Estate Golf Lifestyle Memberships Find Homes Inquire Real Estate Golf Lifestyle Membership About Weddings & Events Blog Gallery Contact Discover the Harbor Club Lifestyle We hope you enjoyed your virtual visit to Harbor Club, but nothing compares to experiencing our beautiful community firsthand. To schedule an in-person tour, or to simply learn more about life at Harbor Club, reach us at (800) 505-GOLF (4653) or info@harborclub.com today. Visit Us 1111 Polo Circle Suite 102 Greensboro, GA 30642 (800) 505.GOLF or (706) 453.9690 info@harborclub.com Get Directions Get In Touch Contact us today and learn more about life at Harbor Club. First Name* Last Name* Phone Number* Email Address* Zip/Country Code* Contact Preference* Email Call Text I am interested in* Real Estate Golf Membership Wedding Private Event Local Outings Learn More Golf Learn More Keep In Touch @HARBORCLUBONLAKEOCONEE 1111 Polo Circle Greensboro Georgia 30642 Get Directions 866 805 5253 info@harborclub.com Harbor Club All Rights Reserved © 2023 Real Estate Golf Lifestyle Membership About Weddings Events Blog Gallery Accolades Contact Resident Log In Member Log In Front Gate Guest Registration Privacy Policy Cookie Policy © 2025 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions. 1111 Polo Circle Greensboro Georgia 30642 Get Directions Resident Log In Member Log In Privacy Policy Cookie Policy ©2023 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Harbor Club All Rights Reserved © 2023 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions."
    },
    {
      "url": "https://grandharbor.com/privacy-policy/",
      "text": "Privacy Policy - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us Privacy Policy Feel free to visit grandharbor.com to access a multitude of useful information about our club and amenities without telling us who you are or submitting any information about yourself.\n\nIf you choose to give us any personal or contact information that we may need to respond to your requests for information, send you a newsletter, or keep you informed about news or upcoming events, we will keep this information confidential. We will never share, sell or rent individual personal information to anyone without your advanced permission or unless ordered by a court of law. If you have received unwanted, unsolicited email sent from us or claiming to be sent from us, please forward a copy of that email with your comments to info@grandharbor.com ."
    },
    {
      "url": "https://grandharbor.com/weddings-events/",
      "text": "Weddings & Events - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us Weddings & events Your Backdrop for Unforgettable Moments Whether elegant and refined or relaxed and casual, Grand Harbor is the perfect setting for your next event. VENUES ClubHouse For those looking for a formal and elegant atmosphere, we recommend our sophisticated Clubhouse located on our Vero Beach golf courses. Beach Club For those looking for a formal and elegant atmosphere, we recommend our sophisticated Clubhouse located on our Vero Beach golf courses. Turning Your Vision Into Reality Take the stress out of planning. Our Director of Special Events is ready to assist you every step of the way. Every detail of your event including location, setup, and menu can be customized to fit your specific needs and tastes. Our Director of Special Events can also make special arrangements for music, photography, flowers, and additional items. Specialty menu packages designed by our talented event and culinary staff are available to choose from should you wish to make planning your event even easier. Our catering team is trained to provide services for any occasion. Give us a call today to plan your next luncheon, cocktail party, dinner party, golf tournament, fundraiser, corporate event, holiday party, birthday party, bar/bat mitzvah, bridal shower, baby shower, anniversary party, rehearsal dinner, wedding ceremony, or reception. Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://grandharbor.com/beach-club/",
      "text": "Beach Club - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us BEACH CLUB Experience Oceanfront Tranquility A sanctuary where sun, sand, and sophistication unite, where members and their families have access to a private beach club for sunning, swimming, fitness, and seaside dining. The recently completed $6 million renovated beach club sits on over 5 acres of pristine Atlantic Coastal beach property with 400 feet of ocean tranquility. BEACH Stroll along the elevated walkway across sea grapes and dunes down to our private beach. This serene retreat features exceptional beach service that caters to your every need. Start your day with a sunrise yoga session, where the soothing sound of waves provide the perfect backdrop for relaxation and meditation. Pool & Cabana Deck Whether you’re looking to cool off or get some exercise, our expansive swimming pool is ideal for a refreshing dip, featuring a wading area and a lap pool with stunning views of the pristine Atlantic coast. The inviting pool deck features comfortable chaise lounges with umbrellas and shaded cabanas, perfect for unwinding with a good book or enjoying quality time. Beachside Bar The Beach Club Bar is the hub of camaraderie and socialization, where everyone knows your name. With stunning ocean views and a relaxed atmosphere, it’s the perfect place to unwind after a day in the sun. Our friendly staff serves refreshing cocktails, local craft beers, and delicious bar menu bites. Whether you’re catching up with friends, enjoying a sunset drink, or making new connections, the Beach Club Bar fosters lasting friendships in a welcoming environment. Dining Savor island-inspired cuisine in a breathtaking setting, with options for both indoor and outdoor dining that boast stunning oceanside views. Under the creative direction of Chef Rico, our menu features fresh seafood and a classic-with-a-twist style, offering dishes that surprise and delight the palate. Don’t miss our special events and live music, including the popular Full Moon Rising beach parties. The Shell Dining Room features panoramic views of the outdoors, complete with folding glass doors that open to let in the refreshing ocean breeze when the weather allows. EXPERIENCE GRAND HARBOR Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://grandharbor.com/about/",
      "text": "About - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us OUR STORY CONTINUOUSLY ELEVATING CLUB LIFE FOR OUR MEMBERSHIP Our membership is at the heart of our story. Everything we do is designed to enhance their club experience. Located in beautiful Vero Beach, we provide unparalleled opportunities for leisure and recreation. From our two thoughtfully designed and exciting golf courses to the tranquil expanse of our Beach Club, every day at Grand Harbor is a chance to live exceptionally. EXPERIENCE GRAND HARBOR OUR STAFF Michael Gibson General Manager LEARN MORE Troy Pare Director of Golf LEARN MORE Josh Breda Director of Agronomy LEARN MORE Rico Hosena Beach Club Executive Chef LEARN MORE Joe Ferro Executive Chef LEARN MORE Tim Blouin Executive Pastry Chef LEARN MORE Marco Osorio Director of Sports LEARN MORE Jodi Vogt Director of Membership LEARN MORE Matt depino Director of Facilities and Construction TONY ALBANO Manager of Information Systems Donna rainbow Beach Club Manager Walter Ruiz F&B Operations Manager Robby Gutermuth Clubhouse Operations Manager Joel Brown Assistant F&B Manager Andrian Bitere Manager in Development Jennifer Moore Chief Financial Officer Joy Hernandez Director of Human Resources Grand Harbor is indeed GRAND with an amazing membership and staff! Deb Fletcher, Grand Harbor Member EXPERIENCE GRAND HARBOR Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved Michael Gibson General Manager Michael Gibson’s professional achievements span over three decades of excellence in the golf and hospitality industry. He has been a dedicated member of the CMAA Seminole Region Charity Golf Tournament Committee over 25 years, showcasing his commitment to charitable causes. Michael served as General Manager at Old Marsh Golf Club, where he helped achieve six years of Platinum Clubs of America status and Emerald Distinguished Club honors. He participated in the 2014 Boca Ballroom Battle, raising over $50,000 for the George Snow Scholarship Fund. Under his leadership, Boca Grove was named a Top 100 Golf Shop by the Association of Golf Merchandisers in 2019 and won Country Club of the Year from Luxury Travel Guide. Michael has served as General Manager of Grand Harbor Golf & Beach Club for nearly four years, following the transition from developer ownership to a member-owned club. During his tenure, the Club has gained 400+ new members, and his leadership was instrumental in earning the Distinguished Clubs of America award. Michael’s dedication to the Club and its members is unwavering, continuously enhancing the member experience. Living grand has never been better! Troy Pare Director of Golf at Grand Harbor Troy Pare, originally from Rhode Island, has been a golf professional for 27 years, with 17 years as a Head Golf Professional/Director of Golf. He began his current role as Director of Golf at Grand Harbor Golf and Beach Club in Vero Beach, Florida, on March 4, 2021, where he also works on the membership team. Prior to Grand Harbor, Troy served as Head Golf Professional at Ledgemont Country Club and as Director of Operations & Head Golf Professional at The Preserve at Boulder Hills, a private club offering outdoor activities like golf, hunting, and fly fishing. He was also the Head Golf Professional at Wannamoisett Country Club in Rumford, Rhode Island. Married for 23 years with two teenage boys, Troy thrives in the busy, multi-tasking environment of Grand Harbor. Josh Breda Director of Agronomy Josh Breda is the Director of Agronomy at Grand Harbor, bringing over 24 years of experience in agronomy and golf course maintenance. He holds a Bachelor of Science degree in Turfgrass Science from Clemson University and has previously worked at renowned clubs such as The Ford Plantation in Richmond Hill, GA, The Savannah Golf Club, The Polo Club in Boca Raton, and Riddell’s Bay Golf Club in Warwick, Bermuda. With a passion for working outdoors and a love for the game of golf, Josh finds his favorite aspect of working at Grand Harbor to be the close-knit team atmosphere and the opportunity to maintain beautiful, world-class golf courses. His day-to-day responsibilities include overseeing all aspects of turf management, coordinating with the grounds team, and ensuring the courses are in top condition for members and guests throughout the year. Rico Hosena Executive Chef at Grand Harbor Chef Rico Hosena has been in the kitchen since 1989, working and training with chefs from all over the world. He started working for the five-star luxury resort, Sofitel Philippine Plaza Manila. This is where Rico learned to be versatile in all food and beverage operations, starting as a cook and then learning the ropes as a waiter and guest services professional. In 2007 Rico came to America on an H2B program, where he met Michael Gibson working at Old Marsh Golf Club. Every six months, he would travel north and work at other restaurants and Clubs including Kiawah Island, Mountain Air Country Club and Martha’s Vineyard. In April 2021, Rico had the opportunity to join Michael again when he was offered the position as Executive Chef of the Beach Club. Rico’s goal has been to elevate the dining experience by offering exceptional restaurant-quality food, breaking away from the typical country club fare. With his team, he is turning the vision of creating the best restaurant in Vero Beach into a reality. Joe Ferro Executive Chef Joe began his career in Buffalo, NY at popular restaurants Le Metro Bistro and Bakery and The Left Bank, expanding his culinary knowledge in these scratch kitchens. He soon became Executive Chef at the historic Buffalo Launch Club, the world’s oldest power boating club. Following his passion for food and cooking, he moved to South Florida. Eventually he joined the team at Table 26, later taking over as Executive Chef. Years later he moved on the The Club at Admirals Cove (AC) as Executive Sous Chef. After five years at AC, Joe took on the role of Executive Chef at Grand Harbor. Joe aims to leave his culinary mark by creating a home where his creative vision and extensive expertise can flourish. His ability to blend traditional techniques with modern flair sets him apart, making him a standout in the industry. Tim Blouin Executive Pastry Chef Tim Blouin began his career at Grand Harbor in 2001, though his culinary journey started long before that. Originally from Nashua, New Hampshire, Tim discovered his passion for cooking in high school, studying Culinary Arts. He went on to attend New Hampshire College Culinary Institute and briefly trained at a culinary school in Northern France. His early career was filled with seasonal work, spending summers at The Harbor View Hotel on Martha’s Vineyard and winters at The Village at Breckenridge in Colorado. Tim’s true passion for pastry ignited when he trained under Master Pastry Chef Steven James at The Balsams Grand Resort in Dixville Notch, New Hampshire. Chef James introduced him to pastry competitions and arranged opportunities to work with top pastry chefs during the off-seasons at prestigious locations such as Mohonk Mountain House in New York, The Cloister on Sea Island in Georgia, Kingsmill Resort in Virginia, and The American Club in Wisconsin. Tim eventually found his way to Vero Beach, Florida, after visiting a friend working at Windsor, and the rest is history. Tim is one of Grand Harbor’s “sweetest” assets, bringing passion and expertise to every creation. With his personal touch, each dessert becomes a true masterpiece! Marco Osorio Director of Sports With a career spanning over 20 years, Marco has a unique background as an ATP player, high-performance coach, tournament organizer, and club manager. He reached the top 200 in both singles and doubles and, as a Davis Cup player for Mexico, claimed victories over Roger Federer and the Bryan brothers. After retiring from professional tennis, Marco became one of Mexico’s top high-performance coaches, mentoring multiple national champions and serving as Davis Cup Captain. Marco has also organized over 50 world-class tournaments, earning five International Tennis Federation (ITF) awards for hosting the best “Grade A” tournaments globally—events as prestigious as the Grand Slams. In club management, he served as COO of Mexico’s largest sports club organization and successfully turned around the Vero Beach Tennis Club after purchasing it in 2011. He later became General Manager of the Boulevard. Since 2018, Marco has worked at Grand Harbor, first as Head Tennis Professional and then as Tennis Director. In 2021, he took on a dual role as Sports Director and Tournament Director for the Vero Beach International Tennis Open. Marco also holds three graduate degrees, including an MBA, and frequently speaks at sports and tennis conferences worldwide. Jodi Vogt Director of Membership Jodi is the Director of Membership at Grand Harbor, where she finds joy in both welcoming prospective members and building lasting relationships with current ones. She enjoys meeting new people, giving tours of the club, and sharing the unique experiences Grand Harbor has to offer. Along with handling the membership application process, Jodi ensures a smooth and personalized experience for each new member. With a background in psychology, sociology, and nonprofit management, Jodi brings a warm and thoughtful approach to her work, making every member feel welcome and appreciated at Grand Harbor."
    },
    {
      "url": "https://grandharbor.com/",
      "text": "Grand Harbor Golf & Beach Club - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us The Pleasure is all Ours A private club experience unmatched on the Treasure Coast. EXPERIENCE GRAND HARBOR THE GRAND STORY As Vero Beach’s premier private club, Grand Harbor is not just a place to be—it’s a place to belong. Membership opens the doors to lasting connections and cherished memories, set against the backdrop of breathtaking landscapes and impeccable service. Join us at Grand Harbor, where life is not just lived, it’s celebrated. ABOUT GRAND HARBOR Golf Grand Harbor offers two championship golf courses, each with unique styles and distinctive challenges. Learn  More Beach Club A sanctuary where sun, sand, and sophistication unite. Learn  More Dining Grand Harbor offers diverse dining options, from refined dinners to relaxed meals by the poolside. Learn  More Tennis Grand Harbor’s tennis facility provides members a top-tier space to play, practice, and enjoy tennis. Learn  More Experiences Grand Harbor features events, activities, tournaments, and culinary experiences for all members. Learn  More Fitness Grand Harbor promotes a vibrant, active lifestyle with various fitness programs tailored for members. Learn  More EXPERIENCES Vero Beach International Tennis Open The Mercedes-Benz, Porsche, Audi of Melbourne Vero Beach International Tennis Open (VBITO) at Grand Harbor Golf & Beach Club promises an exciting week! Over 100 top Women’s Tennis Association players will compete for tour rankings and the tournament title. Alongside thrilling matches, Grand Harbor will host a range of social events, including a fashion show, art show, dinner dance, wine social, Kids Day, and a Kids Tennis Clinic. Presented by GHO Homes and Cleveland Clinic Indian River Hospital, VBITO is a premier event showcasing top tennis talent. Click here Spring Fling Our farewell to Season and our seasonal friends, the Spring always lets us end on a high note. Held at our newly renovated Beach Club, members and guests dance the night away while enjoying captivating performances, live music, and a delicious variety of culinary delights. Click here Club Championship Golf Tournaments Men’s, women’s, and mixed. Member/Member and Member/Guest. We have a line-up of exciting golf tournaments monthly. The only question… Will you bring home the trophy? Click here Grand Harbor Cup The Grand Harbor Cup is one of our most cherished traditions, celebrating camaraderie, competition, and the spirit of the game. This year, 176 members participated, showcasing exceptional talent and teamwork across both courses, which were in immaculate championship condition. Click here Chef’s Table Indulge in an unforgettable evening of gourmet dining at Grand Harbor’s Chef’s Table. Savor a meticulously crafted five-course set menu, each course expertly paired with the finest wines to enhance your culinary journey. With limited seating available, this exclusive event promises an intimate and exquisite dining experience. Click here Dink & Drink Take a swing at our Dink & Drink pickleball tournament. Regardless of your skill level, Dink & Drink is a great way to meet new people, spend time with friends, and get some exercise! Click here \"We have been members of Grand Harbor Golf and Beach Club for twenty-five years and we have watched it go through all sorts of changes, emerging now to the simply amazing and embracing Club that it is in 2024. We are truly “living grand” and loving it grandly.” - Tom and Joanne Balshi \"Grand Harbor Golf and Beach Club is truly a magical place where we’ve\nmade so many great memories with our family and the new friends we've\nmet. From food offerings and events to golf, tennis, pickleball - all made wonderful by the welcoming staff-the experience is top-notch! And the Beach Club is simply the crown jewel. It's so easy to make any day special at Grand Harbor and we look forward to doing that for years to come!\" Gary and Beth Talmadge \"Grand Harbor is a very special place here people enjoy the fabulous lifestyle, and yet appreciate their good fortune by giving  back to others.\" Diane Defrancisci EXPERIENCE GRAND HARBOR Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://goodharborgroup.com/",
      "text": "Professional Staffing Placement - Good Harbor Group 781-209-5416 Menu Home Services Life Sciences Healthcare IT Information Technology Executive Search Consultants Careers About Contact Staffing Done Differently Why Good Harbor Group? 1 : 1 3 qualified candidates per opening 10 % Fill ratio 80% 50 % Retention Rate 97% Our Services Our Services Our services range from project-based solutions, large-scale engagements, to individual resources staffed on a contract, contract-to-hire, and permanent placement basis. Industries Served Life Sciences Healthcare IT Information Technology Executive Search Learn More Our Process Consultation: We partner with you to identify your staffing needs and goals. Sourcing: Using our extensive network and advanced recruitment tools, we find qualified candidates. Screening: Every candidate undergoes thorough vetting to ensure they meet your technical and cultural requirements. Placement: We handle the logistics of onboarding, ensuring a smooth transition for both the candidate and your team. We’ve got you covered… We provide US based resources in all 50 states. What our customers are saying Good Harbor Group provided world class service and performance that drove this implementation forward. This level of service does not go unnoticed and there will be more business coming your way because of it. Vice President Implementation Healthcare Vendor Our firm engaged Good Harbor Group on a complex search based on the recommendation of a professional colleague. They were a true partner from the beginning, effectively representing our firm and helping to build our brand.   It never felt like a vendor relationship and we are thrilled with the candidate we selected. Vice President, Talent Acquisition Technology Client Our firm hired Good Harbor Group to conduct a search for a Vice President of Sales.  Their proprietary process is deliberate and effective, resulting in us hiring the perfect candidate for the role.  Good Harbor Group’s extensive vetting process saves their clients significant time from interviewing multiple candidates. My CFO, Board of Directors and I feel they delivered high-value and we will use Good Harbor Group again. CEO Financial Services Over the past decade, Good Harbor Group has provided high value recruiting services to our organization. We had previously engaged other firms but few come close to Good Harbor Group’s “white glove” service. They excel at finding senior level candidates that not only meet the technical requirements but are excellent additions to our culture. CEO Technology Client Good Harbor Group is one of the best recruitment firms of senior talent I’ve worked with. They take the time to understand our business model and value proposition, which has allowed them to identify precisely the types of talent we look for. CEO Financial Services Thank you for all your help with recruiting top talent for our critical roles. I appreciate the support and have really enjoyed working with Good Harbor Group. Director of Operations Technology client Good Harbor Group was able to source very time sensitive, critical engineering roles for our organization.  We were working with other large staffing agencies that were unable to deliver after many weeks and months. Good Harbor Group not only quickly recruited highly qualified candidates that not only met our technical requirements but were excellent culture fits as well.  I believe this is a major differentiator from other agencies. They took the time to listen to our specific needs and ultimately exceeded our expectations. Vice President Healthcare provider While most staffing firms present high volumes of candidates hoping they find a match, our goal is to provide the right qualified candidates that meet your specific requirements. LinkedIn Phone 781-209-5416 Address Info@goodharborgroup.com Address 178 Albion St. Ste 210 Wakefield, MA 01880 Services All Services Life Sciences Healthcare IT Information Technology Executive Search Quick Links About Careers Consultant Experience Contact © 2025 Good Harbor Group. All Rights Reserved. Menu"
    },
    {
      "url": "https://grandharbor.com/contact-us/",
      "text": "Contact Grand Harbor - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us Contact Us Thank you for visiting Grand Harbor Golf and Beach Club. For general inquiries, please contact us at 772-778-9000 or complete the form below. A member of our team will respond to you promptly. Grand Harbor – Main Clubhouse 4985 Club Terrace Vero Beach, FL 32967 Grand Harbor Beach Club 8500 Highway A1A, Vero Beach, Florida 32963 Name Email Address Message SUBMIT Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved"
    },
    {
      "url": "https://grandharbor.com/dining/",
      "text": "Dining - Grand Harbor Golf and Beach Club Skip to content Skip to content MEMBER LOGIN Home About Membership Golf Beach Club Tennis Dining Experiences Fitness Contact Us Dining Featured Restaurant BEACH CLUB Savor island-inspired cuisine in a breathtaking setting, with options for both indoor and outdoor dining that boast stunning oceanside views. Under the creative direction of Chef Rico, our menu features fresh seafood and a “classic-with-a-twist” style, offering dishes that surprise and delight the palate. Don’t miss our special events and live music, including the popular Full Moon Rising beach parties. The Shell Dining Room features panoramic views of the outdoors, complete with folding glass doors that open to let in the refreshing ocean breeze when the weather allows. Executive Chef Rico Hosena Chef Rico Hosena has been in the kitchen since 1989, working and training with chefs from all over the world. He started working for the five-star luxury resort, Sofitel Philippine Plaza Manila where he learned to be versatile in all food and beverage operations, starting as a cook and then learning the ropes as a waiter and guest services professional. In 2007 Rico came to America and met Michael Gibson. Every six months, he would travel north and work at other restaurants and Clubs including Kiawah Island, Mountain Air Country Club and Martha’s Vineyard. In April 2021, Rico had the opportunity to join Michael again when he was offered the position as Executive Chef of the Beach Club. Rico’s goal is to elevate the dining experience by offering exceptional restaurant-quality food, breaking away from the typical country club fare. With his team, he is turning the vision of creating the best restaurant in Vero Beach into a reality. Our Restaurants Grand Main Dining Room LEARN MORE Joe Lee Grill LEARN MORE Pete Dye Grill LEARN MORE Spoonbill's LEARN MORE Shell Dining room LEARN MORE Oceanside Dining LEARN MORE Culinary Experiences Chef’s Table Indulge in an unforgettable evening of gourmet dining at Grand Harbor’s Chef’s Table. Savor a meticulously crafted five-course set menu, each course expertly paired with the finest wines to enhance your culinary journey. With limited seating available, this exclusive event promises an intimate and exquisite dining experience. Visiting Sommelier Dinner and Wine Pairing Spend an evening amusing your taste buds with light-bodied to rich, bold, and complex wines as we journey through our chef’s bespoke menu developed to enhance and complement our featured wines. Burgers & Brews Join us at the Main Clubhouse each month for a mouthwatering variety of burgers and your favorite brews. Don’t forget to leave room for our delectable desserts including milkshakes and ice cream floats! EXPERIENCE GRAND HARBOR I describe my style of cooking as “classic with a twist”. I take the best things I’ve learned over the years, whether it’s keeping the kitchen spotless or experimenting with new ideas and bring them together to create something special. Chef Rico Hosena, Executive Chef at the Beach Club Clubhouse: 4985 Club Terrace, Vero Beach, Florida 32967 772-778-9000 Beach Club: 8500 Highway A1A, Vero Beach, Florida 32963 772-231-2600 Twitter Instagram Facebook-f Phone-alt Envelope Quick Links About Membership Membership Portal Terms of Service Contact Us INQUIRE TODAY First Name Last Name Email Address Message SUBMIT ©2025 Grand Harbor Golf & Beach Club. All Rights Reserved GRAND MAIN DINING ROOM For a refined evening out in a formal dining setting, enjoy a variety of signature dishes including prime rib, filet, and locally sourced seafood. With a dance floor and the ability to accommodate live music, this dining area is also very popular for hosting events. JOE LEE GRILL This is the go-to spot for golfers looking to enjoy a delicious lunch after a round. Savor a refreshing cocktail from our full bar and enjoy it on the second-floor outdoor balcony, which overlooks the golf course, before indulging in a casual yet sophisticated dining experience. PETE DYE GRILL Looking for a more formal yet relaxing dining atmosphere? The Pete Dye Grill provides an elegant setting to gather for a drink and conversation by the intimate indoor fireplace before sitting down for dinner. The Pete Dye is the ideal venue for upscale dining events and wine tastings, where expertly crafted dishes promise to satisfy even the most discerning palates. SPOONBILL'S Satisfy your breakfast or lunch cravings at the outdoor café-style setting of Spoonbills. Whether you’re looking for something to-go before a round of golf or if you prefer to have a seat overlooking the putting area, Spoonbills is the perfect venue for casual fare. SHELL DINING ROOM Indulge in a dinner of tenderloin filet, the grand poke bowl, and other locally sourced seafood at the Shell Dining Room in our Beach Club. This elegant indoor venue features a sushi and raw bar and breathtaking panoramic views of the pool and beach. OCEANSIDE DINING Take in the tranquil blue waters of the Atlantic Ocean or a picturesque sunset while enjoying your meal outdoors at our Beach Club on our poolside deck. Enjoy a cocktail at our fabulous indoor/outdoor bar with wrap-around views of the pool and ocean."
    }
  ]
}