{
  "fuentes": [
    {
      "url": "https://guidetogreatergainesville.com/south-main-station-developing-more-mixed-used-spaces/",
      "email": "scott@costellocm.com"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "email": "flagstaff@grandcanyonbrewingco.com"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "email": "graphics@grandcanyonbrewingco.com"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "email": "info@grandcanyonbrewingco.com"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "email": "kingman@grandcanyonbrewingco.com"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "email": "page@grandcanyonbrewingco.com"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "email": "sales@grandcanyonbrewingco.com"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "email": "williams@grandcanyonbrewingco.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/grand-scheme-brewing-gainesville",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/grand-scheme-brewing-gainesville",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://www.grandcentralbrew.com/",
      "email": "info@grandcentralbrew.com"
    },
    {
      "url": "https://www.grandcentralbrew.com/meet-the-founder/",
      "email": "info@grandcentralbrew.com"
    },
    {
      "url": "https://www.visitgainesville.com/dine/restaurant/grand-scheme-brewing/",
      "email": "info@visitgainesville.com"
    },
    {
      "url": "https://www.sisyphusbrewing.com/pages/about-sisyphus-brewing",
      "email": "sisyphus_brewing_-_grey_logo_1000x@2x.jpg"
    },
    {
      "url": "https://www.visitgainesville.com/event/brews-and-brains-at-grand-scheme-brewing/",
      "email": "info@visitgainesville.com"
    }
  ],
  "mails": [
    "corporate@giftly.com",
    "flagstaff@grandcanyonbrewingco.com",
    "graphics@grandcanyonbrewingco.com",
    "info@grandcanyonbrewingco.com",
    "info@grandcentralbrew.com",
    "info@visitgainesville.com",
    "kingman@grandcanyonbrewingco.com",
    "merchants@giftly.com",
    "page@grandcanyonbrewingco.com",
    "sales@grandcanyonbrewingco.com",
    "scott@costellocm.com",
    "sisyphus_brewing_-_grey_logo_1000x@2x.jpg",
    "williams@grandcanyonbrewingco.com"
  ],
  "nombre_sitio": "grandschemebrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://guidetogreatergainesville.com/south-main-station-developing-more-mixed-used-spaces/",
      "text": "South Main Station Developing More Mixed-Used Spaces - Guide to Greater Gainesville About Us Advertise Contact Us SiteMap Facebook Twitter Linkedin Instagram Youtube Now Reading South Main Station Developing More Mixed-Used Spaces 0 Fierce Featured Why Greater Gainesville? Alachua County Map History of Alachua County Communities Live Work Play Municipalities Gainesville Alachua Archer Hawthorne High Springs Lacrosse Micanopy Newberry/Jonesville Waldo Real Estate Apartments Commercial Real Estate Know Your Neighbor Education School Map K-12 Private Magnets Career and Tech Online University of Florida UF Online Santa Fe College: A Global Focus Health Care Public Health Services Hospitals & Emergency Care UF Health Specialty Clinics & Services Non-Emergency Care Business Business Community Biotechnology Greater Gainesville Chamber Innovation Incubators & Startups Culture Food Scene Breweries & Distilleries Arts Sports and Recreation Weekend Getaways Lifestyle & Wellness Music Scene Things To Do Pet Services Non-Profit Getting Settled Moving Quick Tips Emergency Contact Numbers Transportation Voter Information & Engagement Gator Sports LATEST NEWS Business , Gainesville South Main Station Developing More Mixed-Used Spaces by webmaster July 23, 2023 webmaster Read Next Know Your Neighbor: Dr. Brian K. Marchman By Rebecca Gleiberman With the recent uptick in high rises and chain restaurants, South Main Station seeks to keep things local and bring a return to what makes Greater Gainesville special. The lot that has become South Main Station is rich with history. Originally built as a cotton gin in 1882, the building burnt down in 1907. The property was later purchased by Baird Hardware Company due to its proximity to the train depot –– now known as Depot Park. The railroad ran along the side of the still-standing Baird Warehouse, where its tracks are still visible today. Nearly 100 years after the cotton gin, the old Baird Warehouse was purchased by Hoch Shitama and became the home of his company Akira Wood , an architectural woodworking business that remains there to this day. With the vision of creating a public space for the community, the Shitama family considered the idea of reimagining the space. When Depot Park was developed, driving business toward the Southeast portion of town, the idea slowly became a reality. “I’ve been interested in design for a long time, this idea of creating beautiful spaces. It’s something Akira has done for a long time. They have worked with world-class architects but mostly in other places because Gainesville is such a small town. So, I think our family sees this as an opportunity to really build something beautiful like that here, in our home space and in this community that is very dear to us and that we’re very connected to,” said Mariko Shitama, daughter of Hoch Shitama and director of development for South Main Station. With restaurants that include Humble Wood Fire and Bingo Deli , as well as the Heartwood Soundstage for live music and events, and a weekly farmers market, South Main Station is set to become a local hot spot, with a vision to expand even more in the future. “Our long-term vision for the space is to create a campus-like environment that is pedestrian-oriented, with retail and food and drink and lots of connected outdoor space where you can come and spend a couple hours or a whole day,” said Shitama. A mixed-use space that will include retail and a food hall is the ultimate vision for South Main Station. Another upcoming addition to the space is Grand Scheme Brewing which owners Joe Simmons and Brett Ader will be opening in 2023 in between Bingo Deli and Humble Wood Fire. “We are very excited for this next addition to South Main Station,” said Shitama. With these newest plans in the works, South Main Station is evolving from not only a thriving hub of local business but a thriving community in itself. Businesses and Events at South Main Station Heartwood Soundstage – Recording studio and music venue Akira Wood – Architectural woodworking Humble Wood Fire – Pizzeria location. Regular menu and espresso Wednesday – Sunday 11 AM – 9 PM and Brunch Friday–Sunday, 9 a.m. – 2 p.m. Bingo Deli + Pub – Focused on local and seasonal cuisine. Open for dinner Monday, Wednesday, and Friday 5 – 9 PM; Wednesday 4 – 9 PM; and open for lunch and dinner Saturday and Sunday, 12 – 8 p.m. GNV Farmers’ Market – Live music, local farmers, bakers and crafters open Thursdays, 4 p.m. – 7 p.m. COMING SOON 2023: Grand Scheme Brewing Sign Up to Our Newsletter Get notified about exclusive offers every week! SIGN UP I would like to receive news and special offers. Tags Akira Wood Bingo Deli + Pub GNV Farmers’ Market Greater Gainesville heartwood soundstage Humble Wood Fire South Main Station 0 webmaster July 23, 2023 0 Shares Share 0 Tweet Share Share Guide to Greater Gainesville Annual Digital All Issues HOME: Living in Greater Gainesville Monthly Digital All Issues Guide to Greater Tampa Bay Annual Digital All Issues Info Tech, Inc. Separates Into Two Independent Companies Previous Article Communities Know Your Neighbor: Dr. Brian K. Marchman Next Article Related Posts Featured Kind Spirits – The Good Pour Spotlight Featured Empowering Expectant Mothers Featured Driven with Purpose, Leading with Love Culture The Ultimate Blockbuster Communities Know Your Neighbor: Tessa Skiles Communities Outstanding Service In Real Estate Contact Us CostelloCM. Gainesville, FL (352) 281-2072 (352) 372-5957 scott@costellocm.com Subscribe to receive GUIDE news & articles in your inbox! SIGN UP I would like to receive news and special offers. Copyright © 2024 Costello Communications & Marketing, LLC Facebook Twitter Instagram Linkedin Scroll To Top Fierce Featured Why Greater Gainesville? Alachua County Map History of Alachua County Communities Live Work Play Municipalities Gainesville Alachua Archer Hawthorne High Springs Lacrosse Micanopy Newberry/Jonesville Waldo Real Estate Apartments Commercial Real Estate Know Your Neighbor Education School Map K-12 Private Magnets Career and Tech Online University of Florida UF Online Santa Fe College: A Global Focus Health Care Public Health Services Hospitals & Emergency Care UF Health Specialty Clinics & Services Non-Emergency Care Business Business Community Biotechnology Greater Gainesville Chamber Innovation Incubators & Startups Culture Food Scene Breweries & Distilleries Arts Sports and Recreation Weekend Getaways Lifestyle & Wellness Music Scene Things To Do Pet Services Non-Profit Getting Settled Moving Quick Tips Emergency Contact Numbers Transportation Voter Information & Engagement Gator Sports LATEST NEWS About Us Media Kit Contact Us Facebook Twitter Instagram Linkedin"
    },
    {
      "url": "https://www.grandcanyonbrewery.com/contact",
      "text": "Contact | Grand Canyon Brewing top of page HOME THE JOURNEY OUTPOSTS BEER DISTILLERY SPIRITS EVENTS AWARDS SHOP CONTACT More Use tab to navigate through the menu items. Williams Production Facility & Brewpub 301 North 7th St Williams, AZ 86046 Google Maps ​ Open Daily, 2 p.m. - close Closing times vary from 8-10 p.m. 800-513-2072 928-635-1911 williams@grandcanyonbrewingco.com Flagstaff Brewpub 1800 South Milton Rd Flagstaff, AZ 86001 Google Maps ​ Open Daily, 11 a.m. – 10 p.m. 800-513-2072 928-774-1114 flagstaff@grandcanyonbrewingco.com Page Brewpub 714 North Navajo Rd Page, AZ 86040 Google Maps ​ Open Daily, 11 a.m. – 10 p.m. 800-513-2072 928-645-4089 page@grandcanyonbrewingco.com Kingman Brewpub 312 East Beale Street Kingman, A Z 86041 Google Maps Open Daily 11am - 9pm 800-513-2072 928- 628-0828 kingman@grandcanyonbrewingco.com Distribution or Sales Team sales@grandcanyonbrewingco.com Media Inquiries graphics@grandcanyonbrewingco.com > I accept terms & conditions Thanks for submitting! Site Menu HOME THE JOURNEY OUTPOSTS BEER DISTILLERY COMMUNITY SHOP CONTACT TAPROOM GIFTCARDS © 2021 Grand Canyon Brewing Company Williams, AZ 301 North 7th St Williams, AZ 86046 Sunday - Wednesday 11 am – 8:30 pm Thursday - Saturday 11am - 9 pm* ​ ​ closing times sometimes vary based on season.  Please call during winter months about evening closures. ​ 800-513-2072 928-635-1911 williams@grandcanyonbrewingco.com Flagstaff, AZ 1800 South Milton Rd Flagstaff, AZ 86001 Sunday - Wednesday 11 am – 8:30 pm Thursday - Saturday 11am - 9 pm 800-513-2072 928-774-1114 flagstaff@grandcanyonbrewingco.com Page, AZ 714 North Navajo Dr Page, AZ 86040 Sunday - Wednesday 11 am – 9:30 pm Thursday -Saturday 11 am - 10 pm 800-513-2072 928-645-4089 page@grandcanyonbrewingco.com Kingman, AZ 312 East Beale St Page, AZ 86401 Sunday - Wednesday 11 am – 8:30  pm Thursday - Saturday 11 am - 9 pm 800-513-2072 928-628-0828 kingman@grandcanyonbrewingco.com bottom of page"
    },
    {
      "url": "https://www.giftly.com/gift-card/grand-scheme-brewing-gainesville",
      "text": "Grand Scheme Brewing Giftly - Beautiful Gift Card Alternative Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Gainesville Restaurants Grand Scheme Brewing Grand Scheme Brewing Gift Card Grand Scheme Brewing Giftly A beautiful gift card alternative for Grand Scheme Brewing Grand Scheme Brewing 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Grand Scheme Brewing (9) (352) 359-5153 Categories Breweries Location 619 S Main St Unit 1B, Gainesville, FL Gift Ideas for Grand Scheme Brewing Looking for the perfect gift for the beer enthusiast in your life? Look no further than Grand Scheme Brewing in Gainesville, Florida. This local gem offers a variety of unique and thoughtful gifts that are sure to delight any craft beer lover. For a truly special and personalized gift, consider gifting a Grand Scheme Brewing gift card. This allows the recipient to choose their favorite brews and experience the brewery's inviting atmosphere firsthand. It's a gift that keeps on giving, providing endless opportunities for enjoyment and relaxation. If you're looking for a more tangible gift, why not pick up a selection of Grand Scheme Brewing merchandise? From stylish t-shirts and cozy hoodies to trendy pint glasses and growlers, there is something for everyone in the brewery's merchandise collection. These items not only make great gifts but also allow the recipient to show off their love for great beer. For a truly memorable gift, consider putting together a custom beer gift basket featuring a mix of Grand Scheme Brewing's finest brews. Pair it with some local snacks or artisanal treats for a thoughtful touch. It's a gift that is sure to impress and show your loved one just how much you care. With its diverse range of gift options and commitment to quality, Grand Scheme Brewing is the perfect place to find a gift that is as unique and special as the person receiving it. Give the gift of great beer and unforgettable experiences with Grand Scheme Brewing. Click here to send a gift up to $1,000 with the suggestion to use it at Grand Scheme Brewing. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Grand Scheme Brewing Nestled in the vibrant city of Gainesville, Florida, Grand Scheme Brewing stands out as a must-visit destination for beer enthusiasts and casual patrons alike. This beloved establishment, located in the 32601 area, is a gem in the local brewery scene. Grand Scheme Brewing offers a unique and inviting atmosphere where visitors can relax and unwind while savoring a wide selection of expertly crafted beers. From hoppy IPAs to rich stouts and refreshing lagers, there is a brew to suit every palate. The knowledgeable staff at Grand Scheme Brewing is passionate about their craft and always happy to recommend the perfect pint for each guest. The brewery's dedication to quality extends beyond its beverages. The industrial-chic decor, complete with exposed brick walls and sleek wooden accents, creates a trendy yet cozy ambiance that sets the stage for a memorable experience. Whether you're enjoying a cold beer at the bar or gathering with friends in the spacious seating area, Grand Scheme Brewing offers a welcoming space for all. In addition to its exceptional beer selection and inviting atmosphere, Grand Scheme Brewing frequently hosts exciting events and special promotions, making each visit a new and exciting experience. From trivia nights to live music performances, there is always something happening at this lively establishment. For a taste of the local beer scene in Gainesville, look no further than Grand Scheme Brewing. With its stellar brews, inviting atmosphere, and commitment to excellence, this brewery has earned its place as a beloved favorite among locals and visitors alike. Great Alternatives Buy a Gift & Greeting Card for Cypress & Grove Brewing Company : Cypress & Grove Brewing Company in Gainesville is a vibrant and inviting craft brewery, serving up a wide variety of handcrafted beers in a relaxed and friendly atmosphere. Gift $100 for First Magnitude Brewing Company : First Magnitude Brewing Company in Gainesville is a captivating craft brewery that delights beer enthusiasts with its innovative brews and vibrant taproom ambiance. Updated: August 28, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Grand Scheme Brewing gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Grand Scheme Brewing. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Grand Scheme Brewing or anywhere else they like! Top Related Gifts Braised Onion Comfort Food with a Twist 754 NE 25th Ave, Ocala, FL 4.0 (451) • $$ • New American Biscottis Biscottis: Brunch, Sweets, and More 3556 St John's Ave, Jacksonville, FL 4.3 (919) • $$ • American 100 Proof Saloon Good Food, Drinks, Game Day Vibes 1735 NW Pine Ave, Ocala, FL 3.7 (12) • $$ • American Giovanni's Italian Restaurant Authentic Italian Flavors Await You 875 Rinehart Rd, Lake Mary, FL 4.1 (376) • $$ • Italian Blackadder Brewing Company Belgian Brews in a Classic Setting 618 NW 60th St, Gainesville, FL 4.5 (84) • $$ • Breweries Swamp Head Brewery Brewing Florida's Finest Flavors 3650 SW 42nd Ave, Gainesville, FL 4.6 (180) • $$ • Breweries Infinite Ale Works Endless Flavors, Exceptional Brews 304 S Magnolia Ave, Ocala, FL 4.1 (94) • $$ • Breweries Halpatter Brewing Burgers, Brews, and Good Times 264 NE Hernando Ave, Lake City, FL 4.6 (63) • $$ • Breweries More Nearby Businesses Big Hammock Brewery 103 SE 1st Ave, Ocala, FL 4.7 (123) • $$ • Breweries The Swamp Restaurant 1104 SW 2nd Ave, Gainesville, FL 3.0 (276) • $$ • Venues & Event Spaces Tikka Express 1011 W University Ave, Gainesville, FL 4.2 (134) • Indian Dragonfly Sushi and Sake 201 SE 2nd Ave, Gainesville, FL 4.1 (981) • $$ • Sushi Bars The Wandering Jew 219 NW 10th Ave, Gainesville, FL Food Trucks Maude's Classic Cafe 101 SE 2nd Pl, Gainesville, FL 3.1 (219) • $ • Coffee & Tea El Indio Real Mexican Food 407 NW 13th St, Gainesville, FL 3.8 (263) • $ • Mexican Bingo Deli & Pub 619 S Main St, Gainesville, FL 4.0 (33) • Delis Underground Kitchen 722 NW 5th Ave, Gainesville, FL 4.8 (17) • Soul Food Opus Coffee - Davis Medical Plaza 2000 SW Archer Rd, Gainesville, FL 4.6 (5) • Coffee & Tea Opus Coffee - Innovation Square 800 SW 2nd Ave, Gainesville, FL 4.3 (29) • Coffee & Tea Publix Super Market- Gainesville 1302 N Main St, Gainesville, FL 3.0 (32) • $$ • Grocery Dry Wrought Cider Tap Room 409 SW 4th Ave, Gainesville, FL 3.5 (2) • Cideries HASS Kitchen 1220 W University Ave, Gainesville, FL 4.1 (91) • $$ • New American Hiatus Brewing Company 6230 SW State Rd 200, Ocala, FL 4.2 (53) • $$ • Breweries The Paper Bag 11 SE 1st Ave, Gainesville, FL 4.4 (50) • Sandwiches Tinker Latin Restaurant & Food Truck 502 S Main St, Gainesville, FL 4.2 (191) • $$ • Venezuelan Public & General 1000 NE 16th Ave, Gainesville, FL 4.2 (267) • $$ • Bars Tup Tim Thai Restaurant 1232 W University Ave, Gainesville, FL 4.1 (201) • Thai Sandwich Inn 110 NE 16th Ave, Gainesville, FL 3.7 (81) • $ • Sandwiches Ice Cream & Crêpes Eatery 1025 W University Ave, Gainesville, FL 4.1 (42) • $ • Coffee & Tea Goldie's Burgers 201 SE Depot Ave, Gainesville, FL 4.2 (50) • Salad Grove Street Farmers Market 1001 NW 4th St, Gainesville, FL 4.0 (2) • Farmers Market The Patio Pizza & Provisions 5 SE 2nd Ave, Gainesville, FL 4.2 (19) • Pizza Midpoint Park and Eatery 931 SW 2nd Ave, Gainesville, FL 4.5 (18) • Food Trucks City Food Hall 150 NW 13th St, Gainesville, FL 4.7 (6) • Food Court Boss Subs 931 SW 2nd Ave, Gainesville, FL 5.0 (7) • Food Trucks Go Noodle 150 NW 13th St, Gainesville, FL Noodles SquareHouse Pizza 405 SW 4th Ave, Gainesville, FL 4.6 (174) • $$ • Pizza V Pizza - Gainesville 115 SE 1st St, Gainesville, FL 4.2 (324) • $$ • Pizza 16th Avenue Diner 207 NE 16th Ave, Gainesville, FL 4.7 (78) • $ • Breakfast & Brunch Grill Express 808 W University Ave, Gainesville, FL 4.8 (66) • Middle Eastern Gainzville Hub 21 SW 2nd St, Gainesville, FL 5.0 (18) • Juice Bars & Smoothies afternoon 231 NW 10th Ave, Gainesville, FL 4.2 (359) • $$ • New American Dick Mondell's 412 SW 4th Ave, Gainesville, FL 4.2 (185) • $ • Burgers M & D West African Cuisine 405 NW 13th St, Gainesville, FL 4.6 (27) • African Xclusive Eatz 926 W University Ave, Gainesville, FL 5.0 (2) • Soul Food Lubans Coffee 21 SE 2nd Pl, Gainesville, FL 4.5 (2) • Cafes Arepa Burger 404 SE 2nd St, Gainesville, FL 4.2 (19) • $ • Food Trucks Di Big Jerk 619 W University Ave, Gainesville, FL 4.2 (13) • Food Trucks Simon Semrani 10 S Main St, Gainesville, FL New American Humble Wood Fire Bagel Shop 307 SW 4th Ave, Gainesville, FL 4.1 (90) • $$ • Bagels See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Breweries 4.8 6-9 5 single place gcdp beautiful_gift_card_alternative_in_title_tag Gainesville, FL XL S Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://www.grandcentralbrew.com/",
      "text": "Grand Central Brewhouse | Brewery in St. Petersburg, FL Skip to content About Our Story Our Team Our Mission Code Of Conduct On Tap Our Beer Food LALA St. Pete Menu Community Brew good SUSTAINABILITY Visit TAPROOM BEER GARDEN STAMMTISCH TERRACE Events Private Events Book An Event Contact About Our Story Our Team Our Mission Code Of Conduct On Tap Our Beer Food LALA St. Pete Menu Community Brew good SUSTAINABILITY Visit TAPROOM BEER GARDEN STAMMTISCH TERRACE Events Private Events Book An Event Contact Facebook Instagram Brewery, Taproom and Beer Garden in St. Petersburg, FL Local Brews and Vibrant Vibes at  Grand Central Brewhouse in St. Pete Discover the essence of St. Pete’s craft beer culture at Grand Central Brewhouse—a dynamic, two-story brewery, taproom, and beer garden that’s the heartbeat of the community. Renowned for its expertly crafted lagers, Grand Central Brewhouse seamlessly blends tradition with innovation, offering an experience that’s as authentic as it is enjoyable. The taproom at Grand Central Brewhouse is more than just a place to grab a drink; it’s where local flavors and community spirit come to life. Enjoy a pint alongside American pub favorites and Mediterranean-inspired dishes from LALA St. Pete, all within a space designed for connection and relaxation. Whether it’s mingling in the spacious beer garden or attending one of the many vibrant events hosted here, Grand Central Brewhouse offers a welcoming atmosphere for all. VIEW TAP LIST See Menu BUILT FOR COMMUNITY BREWED WITH HEART What sets Grand Central Brewhouse apart is its commitment to giving back. With every sip, you’re contributing to local causes, as a portion of proceeds supports charitable initiatives in the community. This dedication to making a difference makes Grand Central Brewhouse more than just a brewery—it’s a place where great beer, good food, and purpose come together. More Details SPECIALTY & QUALITY BEERS From the time-honored ingredients and brewing techniques to the thoughtfully selected glassware, our beers pay homage to tradition. We offer a variety of classic styles with a focus on artisanal lagers that range from golden to black and crisp to malty. Our lagers are stored using European serving tank technology to ensure that every distinct flavor makes it to your glass as intended. VIEW TAP LIST FOOD BY LALA ST. PETE While visiting Grand Central Brewhouse, order food from LALA St. Pete without leaving your seat. Choose from a wide variety of Meditarranean-inspired dishes and elevated American cuisine. SEE MENU ROOM FOR ALL Steps away from Central Avenue, our expansive indoor and outdoor spaces offer an urban, dog-friendly retreat for the community to gather, bond, make memories, and celebrate. Explore the Space HOST A PRIVATE EVENT Book our Stammtisch room and terrace for your next special gathering. LEARN MORE Why Choose Grand Central Brewhouse? Experience specialty craft beers in one of St. Pete’s most iconic breweries. Indulge in thoughtfully curated dishes from LALA St. Pete while enjoying a relaxed, stylish ambiance. Support local charities with every visit, knowing your experience makes a positive impact. At Grand Central Brewhouse, you’ll find more than just exceptional brews—you’ll find a vibrant community hub where tradition, taste, and togetherness thrive. Visit today and see why Grand Central Brewhouse is a must-experience destination in St. Pete. More Details what our customers say about us Ben 7 months ago Good beer, a clean spacious environment, and friendly beertenders. 10/10 ... Chris Redfield 7 months ago Fantastic coffee stout, and also food from next door great. ... Samantha Shikany 7 months ago Best brewery hands down!!! Best beer, best crew, best atmosphere around! My home away from home! ... Avi Genuth 8 months ago Had an amazing experience! The beer was great and CJ was a great bartender and guide! ... Michael Sedita 8 months ago Great beer, staff, and vibe. ... Ric Rini 8 months ago Fantastic location for large parties. The venue has large open spaces with an outside non covered patio where live music is played. Roof top patio bar with a covered climate controlled section that is warm and welcoming, gives you that cozy feeling. The beer is Lager centric but they have a fantastic variety of other brews on tap and the quality is superb.  Hungry? No problem food is prepared by LaLa (just next door) with a twist on Mediterranean bar bites. This is a clean inviting place that you can just hangout for hours. ... Nahiyan Khan 8 months ago I hosted my wedding rehearsal dinner event here and the staff was amazing and extremely helpful! Brenda and Stacy were so helpful in answering my questions leading up to the event and were so helpful on site during the event too -- absolutely made everything seamless. The private event space upstairs is beautiful, my guests loved it. Thank you GCB! ... Philip Cropp 8 months ago Love the vibe, beers & staff. If I still lived in DTSP, this would be my spot. 🍺 ... nathan miller 8 months ago Great beer, atmosphere, and live music with food next door…can’t ask for much more! ... Join us on Sunday, September 7 at 5 PM when The Sundaes take the stage for a Sunday night set you won’t want to miss. If you could piece together a supergroup whose harmonies could stretch the weekend just a little longer, this would be it. Each member brings their own talent and energy, coming together to create a sound that feels equal parts timeless and feel-good. Come hang. 10 1 Open post by grandcentralbrewhouse with ID 18020757095751390 10 1 Speak Easy returns to GCB On September 6th at 7PM with their signature blend of groove-heavy rhythm, catchy lyrics, and high-energy performance. Since forming at USFSP in 2017, they’ve become a staple of the St. Pete music scene and have played stages across Florida including Gasparilla Music Fest, Clearwater Jazz Fest, and the Floridian Social Club. Expect electric guitar solos, tight harmonies, and a sound that’s sure to move a crowd. 14 0 Open post by grandcentralbrewhouse with ID 18049245218298443 14 0 SkaFest Vol. 3 was an absolute blast. Thanks to everyone who came out to dance, drink, and make it another unforgettable day. Our SkaFest shirts went fast this year and we’re already down to fewer than 20 left. Mediums are sold out, but we still have a handful of Smalls, plus L, XL, and 2XL. If you missed grabbing one at the festival, now’s the time to stop by and pick one up before they’re gone. 46 3 Open post by grandcentralbrewhouse with ID 18075631139018210 46 3 Pinellas Run Club meets tonight (September 4th) at 6 PM right here at the brewery. After a quick overview, runners and walkers head out for a their chosen distance route. After the run enjoy $2 off GCB beers. It’s one of the biggest run clubs in the area and always a great time. 27 0 Open post by grandcentralbrewhouse with ID 17847367746556737 27 0 On Friday, September 5 at 6 PM Crisis the Jazz Project returns to GCB! If you haven’t heard of them before, they are a jazz project featuring members of well-known Tampa Bay bands stepping outside their usual sound. Blending their backgrounds into something unexpected, this group brings a fresh take on jazz with familiar faces in less familiar territory. Catch them live and see what happens when musicians push past the edges of their genre. 11 0 Open post by grandcentralbrewhouse with ID 17999308943656733 11 0 Our latest collaboration with @pointybelbrew, Rice Rice Baby, is a clean and refreshing rice lager brewed with Riverbend Pilsner malt and jasmine rice. The rice lends a delicate floral aroma and a subtle sweetness that lightens the body while keeping the finish crisp and dry. Perle and Saaz hops add gentle spice and a touch of herbal character that complement the malt and rice without overpowering them. The result is a bright lager with notes of toasted baguette and fragrant jasmine blossom, culminating in a clean, refreshing close. At 4.5% ABV, this lager shows that true complexity can be found in simplicity. Rice Rice Baby is on tap now, and we`ll also be pouring it today, Sunday August 31, at the Cool & Crispy Festival at Point Ybel Brewing. Stop by and grab a glass! 33 2 Open post by grandcentralbrewhouse with ID 18057786497113047 33 2 On Sunday, August 31 at 2 PM The Fernando Cruz Trio returns to Grand Central Brewhouse for an afternoon of rich, expressive jazz led by saxophonist, composer, and educator Fernando Cruz. A standout in the Florida music scene, Fernando brings a deep, soulful energy to the stage inspired by legends like Coltrane, Rollins, and Parker. Join us for a performance that blends technical mastery with heartfelt improvisation. 8 0 Open post by grandcentralbrewhouse with ID 18491141893069259 8 0 Today’s the day! SkaFest Vol. 3: Lager’s Not Dead kicks off at 1 PM. We’ve got seven bands lined up to keep the music rolling all day long, fresh lagers pouring nonstop, and some great vendors joining the party. Music starts at 1 PM and runs through the night. Grab your crew, lace up those dancing shoes, and get ready to skank the day away with us! 41 3 Open post by grandcentralbrewhouse with ID 17917168335157232 41 3 SkaFest is back this Saturday! Lager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet. The lineup: 💥 Eric Best – 1 PM - 1:45PM 💥 Over Wait Mammal – 2 PM - 2:45 PM 💥 Saganaki Bomb Squad – 3 PM - 3:45 PM 💥 Chilled Monkey Brains – 4 PM - 5 PM 💥 Floridaze – 5:15 PM - 6:30 PM 💥 Control This! – 6:45 PM - 7:45 PM 💥 Victims of Circumstance – 8 PM - 9:45 PM We’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day. This event takes place in the Beer Garden and will be held rain or shine. We have plenty of tent coverage set up for the occasion. *Performance times are subject to change. See you at SkaFest! 38 0 Open post by grandcentralbrewhouse with ID 17981312699736682 38 0 On Friday, August 29 at 6 PM Ultra Vinyl takes the stage with a set full of hits from across the decades. This Tampa Bay-based cover band brings a polished, high-energy performance that’s perfect for fans of live music you know and love. Whether you’re here to dance or just enjoy a great show with a beer in hand, Ultra Vinyl delivers the soundtrack. 5 0 Open post by grandcentralbrewhouse with ID 18058524002105109 5 0 21 2 Open post by grandcentralbrewhouse with ID 17853359745469320 21 2 On Saturday, August 23 at 6 PM The Rich Sheldon Band brings their blend of soulful Americana, folk, and roots rock to Grand Central Brewhouse. With influences ranging from the Grateful Dead and Bob Marley to Dylan and The Beatles, Rich and his band deliver a mix of original tunes, bluesy ballads, and jam-worthy covers that feel timeless. 7 0 Open post by grandcentralbrewhouse with ID 17975079755875857 7 0 Load More SIGN UP FOR THE BREWHOUSE BULLETIN Email Subscribe Address 2340 Central Ave. St. Petersburg, FL 33712 Hours Sun - Wed: 12pm - 10pm Thurs: 12pm - 11pm Fri - Sat: 12pm - 12am *After 9pm: 21 & Up Only GET IN TOUCH (727) 202-6071 [email protected] Share your experience Facebook Instagram Yelp BLog Employee Portal © Grand Central Brewhouse, St. Petersburg, FL | Privacy Policy | Powered & Designed by Brewing Sites Home About On Tap Our Beer Food Community Visit Events Private Events Contact Home About On Tap Our Beer Food Community Visit Events Private Events Contact Facebook Instagram"
    },
    {
      "url": "https://www.grandcentralbrew.com/meet-the-founder/",
      "text": "Meet the Founder - Grand Central Brewhouse Skip to content About Our Story Our Team Our Mission Code Of Conduct On Tap Our Beer Food LALA St. Pete Menu Community Brew good SUSTAINABILITY Visit TAPROOM BEER GARDEN STAMMTISCH TERRACE Events Private Events Book An Event Contact About Our Story Our Team Our Mission Code Of Conduct On Tap Our Beer Food LALA St. Pete Menu Community Brew good SUSTAINABILITY Visit TAPROOM BEER GARDEN STAMMTISCH TERRACE Events Private Events Book An Event Contact Facebook Instagram Brewery, Taproom and Beer Garden in St. Petersburg, FL Meet the Founder KEVIN MILKEY Kevin Milkey, our visionary founder, made the leap from a successful insurance career to the craft beer world. His passion and expertise drive the success of our craft beer brewery. After retiring from a successful career in insurance, Kevin has decided to take his talents to the craft beer industry. Exactly what those talents are remains debatable. But what is not debatable is his love of beer and spending time at craft breweries. Prior to establishing Grand Central Brewhouse, Kevin was one of the three original employees at American Strategic Insurance, more commonly known as ASI, a property insurance company based in St. Petersburg. After 21 years at ASI and following the acquisition of ASI by Progressive Insurance Group, Kevin retired from ASI. But long before he retired, he dreamt of owning a craft brewery someday. Kevin was an early enthusiast of craft beers, long before most people had heard of craft beers or microbrews. Before any craft breweries opened locally, Kevin regularly stopped into Shep’s on Fourth Street to pick up new craft beer to sample from around the country. Kevin, his wife Jeanne, and son Jack love to travel and craft breweries, pubs, beer halls, and beer tours became a significant part of the itinerary wherever they traveled in both the U.S. and Europe. The laid-back environment and large variety of innovative beers at craft breweries presented the ideal combination to spend quality time. In recent years, the brewery stops have become “research” trips. Kevin has incorporated many ideas from breweries and pubs from around the world into his vision for Grand Central Brewhouse, most notably serving beer directly from serving tanks. Kevin has also completed the Brewing Arts Program offered by USF St. Petersburg where he not only learned how to brew beer but gained foundational knowledge of owning and operating a brewery. Kevin moved to Florida from New York City in 1991 and quickly fell in love with the Tampa Bay area. Away from the brewery, Kevin is very active in the community, sitting on two charitable boards and supporting several local non-profits through the Milkey Family Foundation he established with Jeanne to support local charities in the St. Petersburg area. He is a huge sports fan and enthusiastically supports our Tampa Bay professional teams. An avid runner, Kevin has completed 11 marathons, which helps complement his other passion, beer. return to news Join us on Sunday, September 7 at 5 PM when The Sundaes take the stage for a Sunday night set you won’t want to miss. If you could piece together a supergroup whose harmonies could stretch the weekend just a little longer, this would be it. Each member brings their own talent and energy, coming together to create a sound that feels equal parts timeless and feel-good. Come hang. 10 1 Open post by grandcentralbrewhouse with ID 18020757095751390 10 1 Speak Easy returns to GCB On September 6th at 7PM with their signature blend of groove-heavy rhythm, catchy lyrics, and high-energy performance. Since forming at USFSP in 2017, they’ve become a staple of the St. Pete music scene and have played stages across Florida including Gasparilla Music Fest, Clearwater Jazz Fest, and the Floridian Social Club. Expect electric guitar solos, tight harmonies, and a sound that’s sure to move a crowd. 14 0 Open post by grandcentralbrewhouse with ID 18049245218298443 14 0 SkaFest Vol. 3 was an absolute blast. Thanks to everyone who came out to dance, drink, and make it another unforgettable day. Our SkaFest shirts went fast this year and we’re already down to fewer than 20 left. Mediums are sold out, but we still have a handful of Smalls, plus L, XL, and 2XL. If you missed grabbing one at the festival, now’s the time to stop by and pick one up before they’re gone. 46 3 Open post by grandcentralbrewhouse with ID 18075631139018210 46 3 Pinellas Run Club meets tonight (September 4th) at 6 PM right here at the brewery. After a quick overview, runners and walkers head out for a their chosen distance route. After the run enjoy $2 off GCB beers. It’s one of the biggest run clubs in the area and always a great time. 27 0 Open post by grandcentralbrewhouse with ID 17847367746556737 27 0 On Friday, September 5 at 6 PM Crisis the Jazz Project returns to GCB! If you haven’t heard of them before, they are a jazz project featuring members of well-known Tampa Bay bands stepping outside their usual sound. Blending their backgrounds into something unexpected, this group brings a fresh take on jazz with familiar faces in less familiar territory. Catch them live and see what happens when musicians push past the edges of their genre. 11 0 Open post by grandcentralbrewhouse with ID 17999308943656733 11 0 Our latest collaboration with @pointybelbrew, Rice Rice Baby, is a clean and refreshing rice lager brewed with Riverbend Pilsner malt and jasmine rice. The rice lends a delicate floral aroma and a subtle sweetness that lightens the body while keeping the finish crisp and dry. Perle and Saaz hops add gentle spice and a touch of herbal character that complement the malt and rice without overpowering them. The result is a bright lager with notes of toasted baguette and fragrant jasmine blossom, culminating in a clean, refreshing close. At 4.5% ABV, this lager shows that true complexity can be found in simplicity. Rice Rice Baby is on tap now, and we`ll also be pouring it today, Sunday August 31, at the Cool & Crispy Festival at Point Ybel Brewing. Stop by and grab a glass! 33 2 Open post by grandcentralbrewhouse with ID 18057786497113047 33 2 On Sunday, August 31 at 2 PM The Fernando Cruz Trio returns to Grand Central Brewhouse for an afternoon of rich, expressive jazz led by saxophonist, composer, and educator Fernando Cruz. A standout in the Florida music scene, Fernando brings a deep, soulful energy to the stage inspired by legends like Coltrane, Rollins, and Parker. Join us for a performance that blends technical mastery with heartfelt improvisation. 8 0 Open post by grandcentralbrewhouse with ID 18491141893069259 8 0 Today’s the day! SkaFest Vol. 3: Lager’s Not Dead kicks off at 1 PM. We’ve got seven bands lined up to keep the music rolling all day long, fresh lagers pouring nonstop, and some great vendors joining the party. Music starts at 1 PM and runs through the night. Grab your crew, lace up those dancing shoes, and get ready to skank the day away with us! 41 3 Open post by grandcentralbrewhouse with ID 17917168335157232 41 3 SkaFest is back this Saturday! Lager’s Not Dead: SkaFest Vol. 3 hits Grand Central Brewhouse on Saturday, August 30 from 1 PM to 10 PM, and it’s shaping up to be one of the best yet. The lineup: 💥 Eric Best – 1 PM - 1:45PM 💥 Over Wait Mammal – 2 PM - 2:45 PM 💥 Saganaki Bomb Squad – 3 PM - 3:45 PM 💥 Chilled Monkey Brains – 4 PM - 5 PM 💥 Floridaze – 5:15 PM - 6:30 PM 💥 Control This! – 6:45 PM - 7:45 PM 💥 Victims of Circumstance – 8 PM - 9:45 PM We’ll have a wide array of fresh lagers pouring all day, a misting tent to keep you cool, and vendors like JB’s Hot Dogs, Churned Ice Cream, and Planet Retro hanging out for the day. This event takes place in the Beer Garden and will be held rain or shine. We have plenty of tent coverage set up for the occasion. *Performance times are subject to change. See you at SkaFest! 38 0 Open post by grandcentralbrewhouse with ID 17981312699736682 38 0 On Friday, August 29 at 6 PM Ultra Vinyl takes the stage with a set full of hits from across the decades. This Tampa Bay-based cover band brings a polished, high-energy performance that’s perfect for fans of live music you know and love. Whether you’re here to dance or just enjoy a great show with a beer in hand, Ultra Vinyl delivers the soundtrack. 5 0 Open post by grandcentralbrewhouse with ID 18058524002105109 5 0 21 2 Open post by grandcentralbrewhouse with ID 17853359745469320 21 2 On Saturday, August 23 at 6 PM The Rich Sheldon Band brings their blend of soulful Americana, folk, and roots rock to Grand Central Brewhouse. With influences ranging from the Grateful Dead and Bob Marley to Dylan and The Beatles, Rich and his band deliver a mix of original tunes, bluesy ballads, and jam-worthy covers that feel timeless. 7 0 Open post by grandcentralbrewhouse with ID 17975079755875857 7 0 Load More SIGN UP FOR THE BREWHOUSE BULLETIN Email Subscribe Address 2340 Central Ave. St. Petersburg, FL 33712 Hours Sun - Wed: 12pm - 10pm Thurs: 12pm - 11pm Fri - Sat: 12pm - 12am *After 9pm: 21 & Up Only GET IN TOUCH (727) 202-6071 [email protected] Share your experience Facebook Instagram Yelp BLog Employee Portal © Grand Central Brewhouse, St. Petersburg, FL | Privacy Policy | Powered & Designed by Brewing Sites Home About On Tap Our Beer Food Community Visit Events Private Events Contact Home About On Tap Our Beer Food Community Visit Events Private Events Contact Facebook Instagram"
    },
    {
      "url": "https://www.visitgainesville.com/dine/restaurant/grand-scheme-brewing/",
      "text": "Grand Scheme Brewing - Visit Gainesville Cookie Settings Close About cookies Essential Analytics Targeting Social media About cookies This control panel describes what kinds of cookies are present on this website and allows you to enable or disable different types of cookies. Cookies are small pieces of text saved by websites to your computer. Cookies are how your computer remembers things you’ve already done on the internet and are an important part of making modern websites work properly. Because cookies may contain information about your browsing habits, some people prefer to turn them off entirely. However, turning off cookies can prevent websites from working the way you expect. Essential cookies These cookies are critical to the functioning of this website and cannot be disabled through this control panel. They don’t contain any information about your identity. They can be disabled through your browser, but doing so could cause some parts of this website to stop working. WordPress wordpress_, wp- Always enabled Analytics cookies These cookies collect information on visitors to our website to help us understand how well our website is working and how to improve it. No vendors are present in this group. Targeting cookies These cookies collect information on your browsing habits to help our advertising partners show you more relevant ads. No vendors are present in this group. Social media cookies These cookies help social media sites understand your likes and dislikes so they can show you more relevant content. They also make it easier to share contents from other websites such as ours to your social media profiles. No vendors are present in this group. Communities University of Florida Blog Meetings & Industry Sports Things To Do Outdoor Recreation Eat & Drink Stay Events MENU SEARCH Things To Do LIVE MUSIC & PERFORMING ARTS FAMILY-FRIENDLY ATTRACTIONS MUSEUMS, GALLERIES & ART WALKS TOURS SHOPPING HISTORY & HERITAGE ITINERARIES ALL ARE WELCOME Outdoor Recreation FRESHWATER SPRINGS PARKS & PLACES HIKING PADDLING TRAILS PICKLEBALL BIRDING HOT SPOTS BIKING GOLF FISHING Eat & Drink RESTAURANTS BREWERIES & WINERIES HOMEGROWN IN ALACHUA COUNTY Stay BED & BREAKFAST Hotels & Lodging RV PARKS & CAMPING VACATION RENTALS Events WHAT’S GOOD.® GUIDE All Events Communities University of Florida Blog Meetings & Industry Sports Breweries & Wineries Grand Scheme Brewing 619 S Main St Gainesville, \n                                    \n                                                                            FL                                    \n                                                                            32601 Get Directions View Website Overview Located within South Main Station, Grand Scheme Brewing features craft beers on a tap with a rotating menu of ales, IPAs, porters and more. CHECK OUT WEEKLY TRAVEL INSPIRATION Explore What's Good. ® PLAN YOUR VISIT WITH A FREE VISITOR GUIDE GRAB A VISITOR GUIDE SIGN UP FOR THE WHAT’S GOOD.® GUIDE Complete form to signup to email list or request a visitor guide by mail. \" * \" indicates required fields First Name * Last Name * Email * checkbox Sign up for our What's Good Weekly Event Guide Receive a printed Visitors Guide in the mail Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Comments This field is for validation purposes and should be left unchanged. Δ Alachua County Visitors & Convention Bureau 33 N Main St, Gainesville, FL 32601 Toll free: (866) 778-5002 Local: (352) 374-5260 info@visitgainesville.com Facebook Instagram Twitter YouTube LinkedIn #WhyILoveGNV • @visitgainesville About Us Contact Us Press Coverage Routes to Roots Carbon Offset Project Partner and Business Resources Apply for a Grant Submit an Event Submit An RFP Tourism Economic Impacts Media Resources Travel Writers, Bloggers and Photographers Filming in Gainesville Alachua County Community and Travel Resources Emergency Preparedness Accessibility Legal Disclaimers, Public Records & Accessibility Privacy Policy Google Translate Disclaimer © 2025 Visit Gainesville Alachua County, FL"
    },
    {
      "url": "https://www.sisyphusbrewing.com/pages/about-sisyphus-brewing",
      "text": "Sisyphus Brewing | About Us BUY  COMEDY  TICKETS  HERE! OUR BEER + - On Tap ABOUT + - Taproom Our Story COMEDY & EVENTS + - Events Calendar & Tickets PRIVATE PARTIES + - Event Space Rental Cart ( $ 0.00 ) OUR BEER + - On Tap ABOUT + - Taproom Our Story COMEDY & EVENTS + - Events Calendar & Tickets PRIVATE PARTIES + - Event Space Rental Cart ( $ 0.00 ) About Sisyphus Brewing Why did you name your brewery Sisyphus? Where did the name come from? I have been asked these questions thousands of times, but I have in the past been afraid to give the true answer. “He’s the greek guy, you know the one that pushes a rock up a hill over and over again. We have a small brew system, so we are like Sisyphus, always brewing.” That’s my stock answer, and it’s partially right, but hides the truth with its seemingly peaceful musing . I used to spend an inordinate amount of time thinking about suicide. It seemed to be the only thought that permeated my head, nearly everyday, for many years. I was taught that mental health issues are shameful, and are not to be discussed. So I suffered in quiet, alone in my own head. My junior year of college, I took a philosophy class that introduced me to the philosophical essay, “The Myth of Sisyphus.” Which begins with a phrase that most certainly caught Suicidal Sam’s attention. “There is only one true philosophical problem, and that is suicide. Deciding whether or not life is worth living, is to answer the fundamental question in philosophy. All other questions follow from that.” For the first time in my life, I felt not alone. Like someone understood. Ironically that someone was a dead Frenchman, but I felt connected like never before. I read, and I agreed. Man is here on Earth, with limited faculties, but within those faculties lie the ability to comprehend our place in the universe. Sisyphus is each of us. The rock is the absurdity of the universe. The confrontation between the meaninglessness of a single life in an infinite universe. No rocks we move can carve our place in the history of the universe, for we are just organic matter moving around other organic and inorganic matter. Nothing we do can matter in the grand scheme of things. We, as humans, can’t help but think about the big picture, and suddenly our existence seems to stop mattering. I feel as if I am a single raindrop identified and named in a monsoon. Only the naming and following of said raindrop so closely distinguishes it from the millions that fall next to, before, and after it. We could name all of the raindrops if we liked and found the time. Like raindrops, our fate was bore as our journey began. We travel from one point, birth, to another point, death, and hope to prosper on the way. But why? Why do we care? Why do we want to live? Why should we live? What is the point of all this? And this line of questioning, led me to dark places, where it seemed the only escape was a final escape. But then Camus, and Sisyphus, and I started listening to a voice in my head that had been silenced long ago. It was my voice, telling me what I wanted in life. I wanted a challenge, I wanted to do something I love. Something that made me greet the cold indifference of the universe head on, and defy it as I pushed forward into life. There is so much to humanity that gets lost in the scale of the universe. There is music, love, laughter, food, dancing, and of course beer. There’s a near infinite number of things to explore on our planet, and beyond. I wanted to do it, as much as possible, before time ran out. But my depression was still there, and I did what I had avoided for so long, I sought help. And it helped. And I’m still here today. Seek help if you need it, it makes you stronger, not weaker. Your struggle isn’t unique, it isn’t shameful, it is part of being human. We are here as a relaxing retreat from it all, a brewery comedy club, made out of a vision and desire to thrive.  And we think it's a pretty cool spot. TAPROOM HOURS Monday : closed Tuesday/Wednesday: 4 - 9PM Thursday: 4 - 11PM Friday/Saturday: 1 - 11PM Sunday: 1 - 6PM SISYPHUS BREWING - MINNEAPOLIS 712 Ontario Avenue West #100 Minneapolis, MN 55403 Entrance is around the corner on Aldrich (612) 444-8674 Quick Drinks Home Tap List Events Calendar Host an Event BUY TICKETS © Sisyphus Brewing 2025 Ecommerce Software by Shopify Pipeline Theme Twitter Facebook Instagram"
    },
    {
      "url": "https://www.visitgainesville.com/event/brews-and-brains-at-grand-scheme-brewing/",
      "text": "Brews and Brains at Grand Scheme Brewing - Visit Gainesville Cookie Settings Close About cookies Essential Analytics Targeting Social media About cookies This control panel describes what kinds of cookies are present on this website and allows you to enable or disable different types of cookies. Cookies are small pieces of text saved by websites to your computer. Cookies are how your computer remembers things you’ve already done on the internet and are an important part of making modern websites work properly. Because cookies may contain information about your browsing habits, some people prefer to turn them off entirely. However, turning off cookies can prevent websites from working the way you expect. Essential cookies These cookies are critical to the functioning of this website and cannot be disabled through this control panel. They don’t contain any information about your identity. They can be disabled through your browser, but doing so could cause some parts of this website to stop working. WordPress wordpress_, wp- Always enabled Analytics cookies These cookies collect information on visitors to our website to help us understand how well our website is working and how to improve it. No vendors are present in this group. Targeting cookies These cookies collect information on your browsing habits to help our advertising partners show you more relevant ads. No vendors are present in this group. Social media cookies These cookies help social media sites understand your likes and dislikes so they can show you more relevant content. They also make it easier to share contents from other websites such as ours to your social media profiles. No vendors are present in this group. Communities University of Florida Blog Meetings & Industry Sports Things To Do Outdoor Recreation Eat & Drink Stay Events MENU SEARCH Things To Do LIVE MUSIC & PERFORMING ARTS FAMILY-FRIENDLY ATTRACTIONS MUSEUMS, GALLERIES & ART WALKS TOURS SHOPPING HISTORY & HERITAGE ITINERARIES ALL ARE WELCOME Outdoor Recreation FRESHWATER SPRINGS PARKS & PLACES HIKING PADDLING TRAILS PICKLEBALL BIRDING HOT SPOTS BIKING GOLF FISHING Eat & Drink RESTAURANTS BREWERIES & WINERIES HOMEGROWN IN ALACHUA COUNTY Stay BED & BREAKFAST Hotels & Lodging RV PARKS & CAMPING VACATION RENTALS Events WHAT’S GOOD.® GUIDE All Events Communities University of Florida Blog Meetings & Industry Sports February 21, 5:00 p.m. - 7:00 p.m. Brews and Brains at Grand Scheme Brewing Grand Scheme Brewing 619 S Main St. Gainesville, \n                                \n                                                                    FL                                \n                                                                    32601 Directions Event Website Overview Come and enjoy a drink while you listen to 10-15 minute talks about glaciers, conspiracy theories, character likeability and more from some of the best professors at the University of Florida. The featured special presentation is from Gainesville Mayor Harvey Ward! This event will be held at Grand Scheme Brewing from 5-7 pm on Friday, February 21. The event is sponsored by the University of Florida Bateman Team and EveryLibrary. Grand Scheme Brewing is family-friendly. CHECK OUT WEEKLY TRAVEL INSPIRATION Explore What's Good. ® PLAN YOUR VISIT WITH A FREE VISITOR GUIDE GRAB A VISITOR GUIDE SIGN UP FOR THE WHAT’S GOOD.® GUIDE Complete form to signup to email list or request a visitor guide by mail. \" * \" indicates required fields First Name * Last Name * Email * checkbox Sign up for our What's Good Weekly Event Guide Receive a printed Visitors Guide in the mail Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Phone This field is for validation purposes and should be left unchanged. Δ Alachua County Visitors & Convention Bureau 33 N Main St, Gainesville, FL 32601 Toll free: (866) 778-5002 Local: (352) 374-5260 info@visitgainesville.com Facebook Instagram Twitter YouTube LinkedIn #WhyILoveGNV • @visitgainesville About Us Contact Us Press Coverage Routes to Roots Carbon Offset Project Partner and Business Resources Apply for a Grant Submit an Event Submit An RFP Tourism Economic Impacts Media Resources Travel Writers, Bloggers and Photographers Filming in Gainesville Alachua County Community and Travel Resources Emergency Preparedness Accessibility Legal Disclaimers, Public Records & Accessibility Privacy Policy Google Translate Disclaimer © 2025 Visit Gainesville Alachua County, FL"
    }
  ]
}