{
  "fuentes": [
    {
      "url": "https://www.fairwaysandfundays.com/about-us/",
      "email": "info@fairwaysandfundays.com"
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/golf",
      "email": "grandelakes@caddiemaster.org"
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/golf",
      "email": "grandelakesleads@marriott.com"
    },
    {
      "url": "https://www.grandelakes.com/dining/fairways-pub",
      "email": "grandelakesleads@marriott.com"
    },
    {
      "url": "https://fairwayscountryclub.com/contact_information.html",
      "email": "info@fairwayscc.com"
    },
    {
      "url": "https://fairwayscountryclub.com/contact_information.html",
      "email": "info@fairwayscc.com"
    },
    {
      "url": "https://fairwayscountryclub.com/contact_information.html",
      "email": "info@fairwayscc.com"
    },
    {
      "url": "https://fairwayscountryclub.com/contact_information.html",
      "email": "logo-dark@2x1.png"
    },
    {
      "url": "https://www.fairwaygroup.com/",
      "email": "pensions@fairwaygroup.com"
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/spa",
      "email": "grandelakesleads@marriott.com"
    },
    {
      "url": "https://www.grandelakes.com/contact",
      "email": "grandelakesleads@marriott.com"
    },
    {
      "url": "https://www.grandelakes.com/blog/fairways-pub-restaurant-near-me-review",
      "email": "grandelakesleads@marriott.com"
    },
    {
      "url": "https://www.fairwayinnsheffield.co.uk/our-pub",
      "email": "fairwayinn.sheffield@phoenixpub.co.uk"
    },
    {
      "url": "https://www.grandelakes.com/meetings-weddings",
      "email": "grandelakesleads@marriott.com"
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/grand-lakes-sports",
      "email": "grandelakesleads@marriott.com"
    },
    {
      "url": "https://camra.org.uk/pubs/fairways-brinsworth-149032",
      "email": "fairways@bateman.co.uk"
    },
    {
      "url": "https://www.grandelakes.com/dining/the-ritz-carlton",
      "email": "grandelakesleads@marriott.com"
    }
  ],
  "mails": [
    "fairwayinn.sheffield@phoenixpub.co.uk",
    "fairways@bateman.co.uk",
    "grandelakes@caddiemaster.org",
    "grandelakesleads@marriott.com",
    "info@fairwaysandfundays.com",
    "info@fairwayscc.com",
    "logo-dark@2x1.png",
    "pensions@fairwaygroup.com"
  ],
  "nombre_sitio": "grandelakes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fairwaysandfundays.com/about-us/",
      "text": "About Us - Fairways and FunDays Customise Your Dream Tour Tour Packages back Tour Packages Golf Staycations Golf Packages Ireland 2026 Golf Packages Ireland 2027 World Top 100 Tours Helicopter Golf Tours Pre-packaged Tour Specials back Northwest of Ireland West of Ireland Gift Voucher Golf Courses back Eastern Courses Southern Courses Northern Courses Western Courses Midland Courses Non-Golfers back Boat Tours Cookery Schools Culture Cycling Family Fun Fishing Hill Walking Genealogy Horse Riding Sightseeing Spa Treatments Shopping Surfing The Experience back Overall Experience What Is Included Welcome Gifts Hotels Transport Best Attractions Fun Competition Evening Entertainment Optional Extras About Us back About Us T 2 Green Meet the Team Ireland’s Best Golf Tour Operator Golf Industry Professionals FAQ’s Awards, Accreditations & Partnerships Our Chosen Charity Partners Testimonials Download Tour Brochure Ireland Travel Guide Free Ireland Golf Map Contact Us Search Book your free\n                            consultation Contact Us Customise Your Dream Tour Tour Packages Tour Packages Golf Staycations Golf Packages Ireland 2026 Golf Packages Ireland 2027 World Top 100 Tours Helicopter Golf Tours Pre-packaged Tour Specials Northwest of Ireland West of Ireland Gift Voucher Golf Courses Golf Courses Eastern Courses Southern Courses Northern Courses Western Courses Midland Courses Eastern Courses Southern Courses Northern Courses Western Courses Midland Courses Non-Golfers Non-Golfers Boat Tours Cookery Schools Culture Cycling Family Fun Fishing Hill Walking Genealogy Horse Riding Sightseeing Spa Treatments Shopping Surfing Boat Tours Cookery Schools Culture Cycling Family Fun Fishing Hill Walking Genealogy Horse Riding Sightseeing Spa Treatments Shopping Surfing The Experience The Experience Overall Experience What Is Included Welcome Gifts Hotels Transport Best Attractions Fun Competition Evening Entertainment Optional Extras Overall Experience What Is Included Welcome Gifts Hotels Transport Best Attractions Fun Competition Evening Entertainment Optional Extras About Us About Us About Us T 2 Green Meet the Team Ireland’s Best Golf Tour Operator Golf Industry Professionals FAQ’s Awards, Accreditations & Partnerships Our Chosen Charity Partners Testimonials Download Tour Brochure Ireland Travel Guide Free Ireland Golf Map About Us T 2 Green Meet the Team Ireland’s Best Golf Tour Operator Golf Industry Professionals FAQ’s Awards, Accreditations & Partnerships Our Chosen Charity Partners Testimonials Download Tour Brochure Ireland Travel Guide Free Ireland Golf Map Contact Us About Us Home About Us Established in March 2014, Fairways and FunDays has revolutionised the Golf Vacation experience by providing the Ultimate Golf and Ireland experience for all our clients.  Since this time, Fairways and FunDays has demonstrated that it is the leading Irish Golf Tour Operator and was named Europe’s Best Golf Tour Operator at the prestigious World Golf Awards in 2020 and 2021.  Fairways and FunDays has also been voted Ireland’s Best Golf Tour Operator at the World Golf Awards for the past seven consecutive years at the World Golf Awards.  These awards are presented to the company who have demonstrated the highest qualities in all aspects of their business and was decided by previous clients and by Golf and Tourism industry figures.  Since its incorporation, Fairways and FunDays has grown from a family business to a market leader within the Ireland Golf Vacation sector. Fairways and FunDays exclusively sell Irish Golf Holidays and Ireland Vacations.  Therefore, we are specialists in Ireland and Irish Golf Tours, and have expertise in relation to how clients can make the very most of their time in our beautiful country and enjoy the very best that Ireland has to offer. The experienced and passionate team at Fairways and FunDays provide all our clients with an Ultimate Golf and Ireland experience.  Our tours ensure that clients receive a taste of all that is great and unique about Ireland both “on and off the fairways.” The team at Fairways and FunDays have taken a ground-breaking approach to Golf Tourism and have ensured that our clients whether Golfers or Non-Golfers enjoy the most authentic Irish experience available.  We are the first Golf Tour Operator to offer attractive and customised itineraries to Non-Golfers and Families who are travelling as part of a group.  Our Non-Golfer options have proved so successful that Fairways and FunDays have also welcomed a large number of groups of non-golfing clients to Ireland on incredible sightseeing and leisure tours. Apart from offering the Highest Quality Ireland Golf Vacation experience, Fairways and FunDays also offer the Best Value Irish Golf Holiday’s.  Our firm offers a 110% Price Promise – if you can find the same tour cheaper elsewhere, we will match this price and give you a 10% refund. While all of the management team at Fairways and FunDays are experienced golfers, the management team also have over 30 years’ experience working within the Irish Tourism and Hospitality Industry.  This is the perfect mix of passion, expertise and experience. Our team have developed close working relationships with the best golf courses in Ireland, best hotels in Ireland, best tourist attractions in Ireland, best restaurants in Ireland and the best evening entertainment locations throughout the Island of Ireland.  We promise all our clients an unforgettable visit to Ireland regardless of your budget or the duration of your stay. Fairways and FunDays is a member of the International Association of Golf Tour Operators (IAGTO).  Fairways and FunDays also work closely with Tourism Ireland and Failte Ireland (Ireland’s governing Tourism bodies). The team at Fairways and FunDays are passionate about Ireland, and are passionate about the world class golf facilities and visitor experience which Ireland has to offer.  We want to share this passion with you and ensure that you experience first-hand all that is great about Ireland. Magical Memories are Guaranteed on all our incredible Irish Golf Tours and Ireland Vacations. Quick Links Customise Your Tour Tour Packages About Us Free Ireland Travel Guide Download Free Ireland Map Golf Industry Professionals Terms & Conditions Cookie Policy Privacy Statement Contact Us Contact Us Ireland Office Fairways and FunDays Limited, Unit W10G, Ladytown Business Park, Naas, Co. Kildare, W91 X603 Ireland Tel: +353 4587 1110 Email: info@fairwaysandfundays.com US Office 11807 Westheimer Road, Suite 550, PMB 885, Houston 77077, Texas Tel: 1800 7799 810 Email: info@fairwaysandfundays.com Awards Winner of Ireland’s Best Golf Tour Operator at the prestigious World Golf Awards for the past 8 years, and four-time winner of Europe’s Best Golf Tour Operator, Fairways and FunDays offer the best Ireland Golf Packages available at the very best prices. Ireland is the only destination that we sell, therefore Fairways and FunDays is the true industry specialist in offering the most authentic and best Ireland Golf Trips available. Magical memories are guaranteed on all our Ireland Golf Vacations! © Fairways and FunDays 2025. All\n                Rights Reserved. {{ALERT TITLE}} {{ALERT BODY}} × × Manage Consent To provide the best experiences, we and our partners use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us and our partners to process data such as anonymous browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept All Dismiss Preferences Save preferences Preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/golf",
      "text": "Orlando Hotels With Golf Courses FL | Grande Lakes Orlando Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY Video Features Pause Play Sound On Sound Off Video Description Experience world-class golfing at Grande Lakes Orlando. This video showcases the stunning, scenic golf course, players perfecting their game, and spectators enjoying the serene ambiance. Whether you're a seasoned golfer or a casual fan, immerse yourself in an unforgettable golfing experience surrounded by natural beauty Close Modal View Full Video Events/Activities View Menu Events and Activities Waterpark Pools Cabanas Spa Golf Grande Lakes Sports Ritz Kids Itineraries Shopping Home Events/Activities Golf Golf Where Legends Play The Ritz-Carlton Golf Club, a gem in the region's golfing scene, offers a unique blend of sport and nature. Set on a beautiful ecological site, our golf course is a certified Audubon Sanctuary, featuring a vibrant mix of ponds, wetlands, live oaks and local fauna. As the privileged host of the PNC Championship, the 18-hole championship course tests the abilities of every skill level. It includes a clubhouse, a restaurant, and golf lessons for all ages for a complete golfing experience. Reserve Tee Time - Golf Where Legends Play Reserve Tee Time for Golf Where Legends Play Previous Next More Info 18-hole golf course designed by two-time British Open champion Greg Norman All-grass driving range, putting green, and practice facility Upscale, full-service clubhouse with pro shop and Fairways Pub restaurant and bar Five sets of tees available for varying shot options, with closely mowed turf and short roughs Certified as Audubon Cooperative Sanctuary and endorsed by United States Golf Association Recognized by Golf Course Management magazine as the National Resort Course winner in the \"Environmental Leaders in Golf\" category Members Club available for Florida residents and frequent visitors Home of the PNC Championship Experience an unforgettable stay at Grande Lakes, where you can witness 20 Major Champions team up with a family member to compete for the coveted PNC Championship. Our special PNC Championship Package is perfect for families, offering tickets for two adults and two children, plus a $50 resort credit. Location: The Ritz-Carlton Golf Club Date: December 18 – 21, 2025. Time: 8:00am - 6:00pm Go to previous slide Go to next slide FAMILY GOLF Before 3 p.m., Juniors 15 and under receive 50% off the rack rate with a paying adult. After 3 p.m., Juniors 15 and under play complimentary with a paying adult. Juniors 15 and under receive complimentary club rentals when playing with a paying adult; balls are not included. Reserve for FAMILY GOLF Golf Instruction Elevate your golf game, regardless of your skill level, with group or private lessons from PGA Golf Pro Larry Rinker. He'll guide you through simple modifications to your golf swing that will allow you to play at your best. Take advantage of Larry's PGA Tour experience and start enhancing your golf game today. Learn More for Golf Instruction Caddie Concierge Program The Ritz-Carlton's tradition of excellent service extends to the golf course through our innovative Caddie Concierge program. Each group is paired with a professional attendant who offers expert guidance on course navigation, hole description and target lines, golf ball location, yardage stats, and golf club cleaning. They'll also provide you with course strategy tips and attend to flagsticks. For reservations or more information about our Caddie Concierge, please call (407) 393-4987 or email grandelakes@caddiemaster.org Membership Become a member and enjoy access to The Ritz-Carlton family pool, Grande Lakes Sports, and 14 dining outlets. You'll also save on room rates, spa services, retail, and food/beverage purchases. Learn more for Membership Going Green The Ritz-Carlton Golf Club has been designated as a Certified Audubon Cooperative Sanctuary. Endorsed by the U.S. Golf Association, this certification ensures the protection and enhancement of wildlife habitats. Plus, the golf club is GEO Certified, signifying adherence to strict standards in nature, water, energy, supply chain, pollution control, and community engagement, with a commitment to continuous improvement. Tennis & Pickleball The Ritz-Carlton Golf & Tennis Club features two tennis courts and two pickleball courts. Improve your game through drills, clinics, and personal instruction from our USPTA certified tennis professional, Marcelo Gouts. For court reservations and lessons call (407) 393-4900. PRO SHOP Elevate your golf game with premium equipment from our Pro Shop. We offer cutting-edge drivers, woods, wedges, and putters, crafted to enhance your performance. Paired with our top-tier golf apparel, you'll stay cool, comfortable, and stylish on the course. Phone: 407-393-4900 Hours Monday - Sunday: 7:00 am - 4:00 pm Fairways After an exhilarating round of golf, unwind with a satisfying meal complemented by a scenic view of the 18th hole. Our clubhouse offers an extensive selection of crafted microbrews and draught beers, carefully selected to enhance your dining experience. View Menu for Fairways Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton Golf - The Ritz-Carlton 888-707-9325 JW Marriott Golf - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton Golf - The Ritz-Carlton 888-707-9325 JW Marriott Golf - JW Marriott 800-433-5402"
    },
    {
      "url": "https://www.grandelakes.com/dining/fairways-pub",
      "text": "Bars and Lounges in Orlando FL | Grande Lakes Orlando Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY Video Features Pause Play Sound On Sound Off Video Description Indulge in a culinary journey at The Ritz-Carlton, Orlando, Grande Lakes. This video highlights our exquisite dining experiences, from artfully crafted dishes to stunning restaurant settings. The camera zooms on the mixologist curating handcrafted drinks. Explore diverse flavors, impeccable service, and the perfect blend of innovation and tradition, all set against the backdrop of our serene and luxurious resort. Close Modal View Full Video The Ritz-Carlton View Menu The Ritz-Carlton JW Marriott Home Dining The Ritz-Carlton A Fresh Take On Fine Dining Experience an exquisite culinary journey at The Ritz-Carlton. Our eclectic menus, ranging from upscale steakhouse and seafood cuisine to authentic Southern dishes, will surely delight epicurean connoisseurs. We proudly spotlight our sustainability pledge at Whisper Creek Farm, our very own farm, garden, and apiary, which supplies fresh, local produce to our restaurants and bars. Culinary Masters 23 October Thursday 6:00pm - 10:00pm Knife & Spoon Experience a five-course dinner crafted by MICHELIN-recognized chefs, perfectly paired with selections from a world-renowned winemaker and guided by a member of the Court of Master Sommeliers. Reserve for Culinary Masters Learn More of Culinary Masters Go to previous slide Go to next slide Knife & Spoon Dive into a world of exquisite flavors at our signature steak & seafood restaurant, masterfully curated and helmed by the renowned Chef John Tesar. Our restaurant's quality and excellence have been recognized with a MICHELIN star in 2022 and 2023, a testament to our relentless commitment to delivering a superior dining experience. RESERVE for Knife & Spoon Group Dining about Knife & Spoon Website about Knife & Spoon Menu about Knife & Spoon 3D Tour about Knife & Spoon Location: Lobby level Dress Code: Smart Casual 5:30 pm - 11:00 pm Go to previous slide Go to next slide Go to previous slide Go to next slide Lobby Lounge Experience a relaxed yet sophisticated setting ideal for sipping on a cocktail or indulging in our meticulously crafted light fare menu, all while taking in the stunning views of our gardens, lakes, and golf course. Location: Lobby level Dress Code: Casual Sunday - Thursday 4:00 pm - 12:00 am Friday - Saturday 4:00 pm - 1:00 am Menu for Lobby Lounge 3D Tour of Lobby Lounge Go to previous slide Go to next slide Bleu Find a cool retreat at our poolside alfresco restaurant. Treat yourself to our juicy burgers or fresh seafood, or keep it light with our crisp salads. To cool off, try our tropical frozen drinks, made with the freshest ingredients for the ultimate refreshment. Location: Poolside Dress Code: Beach attire Monday - Sunday: 11:00 am - 6:00 pm Menu for Bleu 3D Tour of Bleu Highball & Harvest Highball & Harvest pays homage to Florida's vibrant agricultural legacy, carved by the railroad era in the 1800s, by serving farm-fresh meals with ingredients from our on-site Whisper Creek Farm. The menu boasts authentic Southern fare accompanied by artisanal cocktails crafted by master mixologists. RESERVE for Highball & Harvest Group Dining about Highball & Harvest website about Highball & Harvest Menu about Highball & Harvest 3D Tour about Highball & Harvest Location: Ground level Dress Code: Casual Breakfast: 7:00 am - 11:00 am Lunch: 11:30 am - 2:30 pm Bar Bites: 2:30 pm - 10:00 pm Dinner: 5:30 pm - 10:00 pm Go to previous slide Go to next slide Go to previous slide Go to next slide Vitale, Spa Café Give your body the VIP treatment it deserves at Vitale. Refuel after a rigorous workout or soothing spa treatment with our health-centric menu. Our range of vibrant salads, revitalizing drinks, and smoothies are tailored to replenish your body and enhance your well-being. Location: Spa ground level Dress Code: Casual Monday - Friday: 11:00 am - 4:00 pm Saturday - Sunday: 11:00 am - 5:00 pm Menu for Vitale, Spa Café 3D Tour of Vitale, Spa Café Go to previous slide Go to next slide Fairways Pub Wind down your day at the links with Fairways Pub's exceptional clubhouse fare and a vast selection of crafted microbrews and draught beer. The pub overlooks the 18th hole and the resort, offering a breathtaking view as you enjoy your meal. Location: Golf Clubhouse Dress Code: Casual Lunch | 11:00 am - 4:00 pm Bar | 7:00 am - 5:00 pm Bunker Bar | 9:00 am - 4:00 pm *Hours are subject to change daily based on rounds and business-level needs Menu for Fairways Pub 3D Tour of Fairways Pub Go to previous slide Go to next slide first drop Step into First Drop for a genuine artisanal beverage experience. Delight in our freshly brewed drip coffee complemented with curated small bites. Our offerings range from breakfast and lunch sandwiches, to salads, pastries, candy, and snacks. Location: Lobby level Dress Code: Casual Sunday - Thursday: 6:00 am - 6:00 pm Friday - Saturday: 6:00 am - 7:00 pm 3D Tour for first drop Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton The Ritz-Carlton - Dining - The Ritz-Carlton 888-707-9325 JW Marriott The Ritz-Carlton - Dining - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton The Ritz-Carlton - Dining - The Ritz-Carlton 888-707-9325 JW Marriott The Ritz-Carlton - Dining - JW Marriott 800-433-5402"
    },
    {
      "url": "https://fairwayscountryclub.com/contact_information.html",
      "text": "Fairways & The Green's Grille & Pub | Contact Information & Form Contact Find Us Book Event × Fairways Event Request Form Check out my CoffeeCup Form Facebook 781.933.7666 info@Fairwayscc.com MENU Home Functions Wedding Packages Showers Social Events Corporate Events Golf Outings Funeral Collations Green's Grille Green's Restaurant Green's Functions Special Events Media Contact Contact Information Request Info Directions CONTACT US We would like to hear from you! Contact Us! Send us an Email Name * Email * Phone Subject * Services -- Select One -- Fairways Function Green's Grille Function Green's Grille Restaurant & Pub Other Message * Send Message Headquarters: Fairways at Woburn Country Club The Green's Grille & Pub 5 Country Club Road Woburn, MA 01801 Phone: 781.933.7666 Fax: 781.933.4799 Email: Info@Fairwayscc.com Office Hours: 9:00 - 5:00 Monday - Friday Functions & Sales Kristen Sullivan Cell Phone: (off hours only) 617-968-3021 Fairways Facebook Green's Grille & Pub Facebook AN ELEGANT, ICONIC VENUE FOR THE WEDDING DAY OR SPECIAL EVENT OF YOUR DREAMS! A venue like no other with beautiful scenery, outstanding food and professional event plannersâlet us make your special day everything you want it to be and so much more. Fairways & The Green's Grille & Pub at Woburn Country Club 5 Country Club Road â¢ Woburn, MA Phone: 781.933.7666 Fax: 781.933.4799 Email: Info@Fairwayscc.com Client Testimonials This venue was insanely affordable. I know weddings can get up there but the first thing that caught my eye about this place was how affordable it was especially for all you get. It has great places to take pictures outside. The inside of the country club looks amazing when everything is set up. Food is so yummy. Christina If you have your reception at the Fairways of Woburn Country Club all your hard work will be rewarded by your guests calling you the next day telling you how wonderful it was. The room is warm and inviting. I would absolutely have another event there! Joseph G. PERFECT!!!!!!! From the moment we walked in and met Terry we new we had found the right place. Right from the start she was very accommodating and extremely up front that this was OUR wedding and wanted everything to be absolutely perfect for us. Fred The layout was perfectly so everyone could hear people give speeches and there was no \"back\" table. There is also an outside tent so people can go outside to cool off or a side room with bar for those who need a more quiet area to sit and relax. Nicholas We wanted a romantic, intimate, and elegant environment and the Fairways at the Woburn Country Club had it all, including a beautiful stone fireplace and scenic grounds for pictures. Wanda I love the Fairways, and I love Terry even more for making sure our big day was special in every way. I didn't have to worry about a thing. Terry was on top of everything and made sure everything went smoothly. Our guests raved about the food and how friendly the staff was... an amazing time! Ella Pags The food was absolutely delicious and we were able to choose some foods that weren't traditional wedding fare that got wonderful feedback from our guests. The setup of the room was also beautifully presented. Susan Our son's bar mitzvah, featuring a DJ, LED lighting specialists, an extra stage, full catering, and open bar for 135 guests. Terry was a wonderful partner in planning the event, and the main thing for me is that she delivered EVERYTHING she said she would - happy with the food quality too. Mathew We wanted a romantic, intimate, and elegant environment and the Fairways at the Woburn Country Club had it all, including a beautiful stone fireplace and scenic grounds for pictures. Wanda Book An Event! Someone will get back to you with pricing & details. Copyrights Â© All Rights Reserved by Fairways of Woburn Country Club. Website by Kelsey Media Productions Privacy Policy"
    },
    {
      "url": "https://www.fairwaygroup.com/",
      "text": "Fairway: Private Client | Corporate | Funds | Pensions & Savings | Fairway Services About Us Our People Careers News and Views Log in Get in Touch Our Services Fairway is an independent, owner-managed fiduciary group offering private client, corporate, funds and pension trustee services. We are an award-winning trust company distinguished for excellence and a personal touch. Services Private Client Explore Private Client Succession Planning Family Office Philanthropy Corporate Explore Corporate Real Estate Corporate Governance Islamic Finance Funds Explore Funds Fund Administration Manager of Managed Entities Trustee Services Jersey Private Funds Pensions & Savings Explore Pensions & Savings Retirement Trusts Occupational Pensions International Savings Employer Solutions Explore Employer Solutions About Us Learn More Our People Learn More Careers Learn More News and Views Learn More Services Private Client Overview Succession Planning Family Office Philanthropy Corporate Overview Real Estate Corporate Governance Islamic Finance Funds Overview Fund Administration Manager of Managed Entities Trustee Services Jersey Private Funds Pensions & Savings Overview Retirement Trusts Occupational Pensions International Savings Employer Solutions About Us Our People Careers News and Views Log in Get in Touch Excellence in Private Client, \nCorporate, Funds and Pension services Get in touch Fairway Group is different. Because we’re independent and owner-managed, the decisions we make are for the benefit of our clients, ensuring your returns are maximised, your assets protected and your teams’ futures secured. As a Jersey headquartered business, our clients can be assured of the reliability, political and economic stability and comprehensive regulatory and legal framework which has kept Jersey at the forefront of global finance for over 60 years. We are consciously independent. Our Services Private Client Corporate Funds Pensions & Savings Employer Solutions Private Client Protecting and growing our clients’ assets through tailored, specialist service with a personal touch. Find out more Contact us Corporate We understand the demands of working within the fast-paced corporate and real estate environment. Find out more Contact us Funds An innovative and tailored funds offering, expertly delivered to meet each client's individual needs. Find out more Contact us Pensions & Savings A leading provider of innovative pension & savings solutions to enable our clients to invest for the future. Find out more Contact us Employer Solutions We tailor our solutions to meet the needs of our clients, regardless of their size, location or scheme complexity. Find out more Contact us 100% Owner-managed £6.5bn Assets Under Administration 24 Years back to back growth since launch 124 Our clients span across 124 countries Why Fairway? Our independence and structure allows us to take a long-term, client-centric approach to the way in which we do business. We take great pride in providing our clients with innovative solutions backed by administrative and technical excellence across our offering, whether that be to reach retirement goals, for succession planning, to maximise returns or to protect and enhance assets. Your dedicated client team will be director-led and provide a proactive and nimble service, striving to get it right first time and every time. Find out more about us Leadership MEET THE REST OF THE TEAM Alistair Rothwell . Chief Executive Officer Jersey Meet Alistair Aslam Shareef . Managing Director, Kuwait Kuwait Meet Aslam Peter Culnane . Director and Head of Pensions Jersey Meet Peter Matt Ebbrell . Chief Operating Officer Jersey Meet Matt MEET THE REST OF THE TEAM News View All 17 December 2024 Private Client News Fairway's Private Client Team Shortlisted for Two Awards in Citywealth's Magic Circle Awards 2025 We are thrilled to announce that Dominique Burnett, Private Client Director, has been shortlisted for 'Trustee of the Year' and Fairway's Family Office Team has been shortlisted for 'Family Office Services of the Year' in Citywealth's Magic Circle Awards 2025. Read Article 23 December 2024 Private Client News Latest in the Middle East: CT Law Updates in the UAE Since the United Arab Emirates (UAE) introduced its corporate tax framework 18 months ago, many businesses have been getting to grips with the new tax rules and have been working tirelessly to ensure tax compliance. Fairway's Chris Mourant, Associate Director, discusses recent ministerial decisions that have been published since the introduction of the Federal Decree-Law No. 47 of 2022 on the Taxation of Corporations and Businesses (the “UAE CT Law”), with the most recent, on 18th November 2024. Read Article 14 November 2024 Private Client News Chris Mourant, Associate Director in Private Client won 'Trustee of the Year - Director' at Citywealth's Future Leaders Awards 2024 We are delighted to announce that Chris Mourant, Associate Director in Private Client is the Gold winner for 'Trustee of the Year - Director' category at Citywealth's Future Leaders Awards 2024. Read Article Awards Services Private Client Corporate Funds Pensions & Savings Employer Solutions Group About Us Our People Careers News and Views Get in touch +44 1534 511700 Follow us Terms and Conditions Privacy Policy Cookie Policy Legal and Regulatory Information Security"
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/spa",
      "text": "Hotels in Orlando with Spas | Grande Lakes Orlando Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY Video Features Pause Play Sound On Sound Off Video Description Unwind in the serene luxury of the Grande Lakes Spa. This video begins with an expansive view of the elegant spa, followed by a tranquil moment as a guest strolls through the refined surroundings. Discover a haven of relaxation, where every detail is designed to rejuvenate your mind, body, and spirit. Close Modal View Full Video Events/Activities View Menu Events and Activities Waterpark Pools Cabanas Spa Golf Grande Lakes Sports Ritz Kids Itineraries Shopping Home Events/Activities Spa Nature-Inspired Spa Retreat in Orlando The Ritz-Carlton Spa Welcome to our nature-inspired Spa retreat in Orlando, a sanctuary spanning 40,000 sq. ft. Disconnect from the world as you immerse in the tranquil elements of nature and emerge refreshed, relaxed and revitalized. This wellness retreat boasts 40 treatment rooms and a full salon offering a wide array of services. Between or post-treatment, relax in our serene adult-only lap pool or refuel with nutritious fare at Vitale, Spa Café. Signature therapies, including massages and body treatments, incorporate herbs from the resort's organic garden, honey from its resident bees, and citrus from local orchards for a unique wellness experience. Reserve Treatment - Nature-Inspired Spa Retreat in Orlando The Ritz-Carlton Spa Reserve Treatment for Nature-Inspired Spa Retreat in Orlando The Ritz-Carlton Spa Spa Summer Savings Save up to 20% on select treatments from Sunday to Thursday. Treat yourself to a spa day or new skincare routine. This limited-time offer ends on September 30, 2025. Book Now for Spa Summer Savings Go to previous slide Go to next slide Treat Yourself to a Spa Day With our skilled technicians at your service, your requests are listened to and met with outstanding personalized attention. From setting up the appointment to the end of your session, we ensure that the service is customized to your preferences. To learn more or to schedule a treatment, contact our spa team at (407) 393-4200. Treatment Menu about Treat Yourself to a Spa Day 12+ Group Treatment Menu about Treat Yourself to a Spa Day Monday - Friday: 9:00am - 5:00pm Saturday - Sunday: 9:00am - 7:00pm Go to previous slide Go to next slide Find Your Oasis Indulge the senses in a sanctuary of relaxation and discover a carefully curated collection of pampering treatments for a holistic experience unlike any other. Let us make the world revolve around you. Previous Next Featured Spa Treatments Massage Facial Body Treatment Nails Go to previous slide Go to next slide Aescape Introducing the first fully automated, AI massage for personal wellness and recovery. Get on-demand massages tailored to your likes and needs. Set your pressure preferences, pick your music, and adjust treatments to your style. The Aerview console, a tablet interface, lets you control your Aescape massage experience. The system scans your body generating 1.2 million 3D points of data to create a topographic image for the perfect massage. With synchronized dual arms, enjoy the benefits of a full 60-minute massage in just 30 minutes. Try the world's most advanced massage and elevate your wellness routine. Book Today - Aescape Book Today for Aescape Frequently Asked Questions Florida Resident Savings Florida Resident Savings Florida residents enjoy a 15% savings on treatments Monday through Thursday year-round. Excludes holidays. Packages/offers cannot be combined and are subject to availability. Florida ID required. Prior to Arrival Prior to Arrival What time shall I arrive? To enhance your Spa experience, please arrive 30 minutes before your scheduled treatment. Do I shave before my treatment? Shaving is not recommended prior to service. If you choose to shave, please do so at least six to eight hours before your appointment. For hair removal services, body hair must be at least ¼ inch long for effective removal. Avoid prolonged sun exposure for 24 hours before or after waxing. Avoid any physical activity that will cause excessive heat or perspiration following the service. Brazilian bikini waxing is not available. What should I not bring to the Spa? Lockers are available for clothing; however, it is recommended that you leave valuable items in the safe in your guest room or at home. Cell phones and pagers must be turned off while you are in the Spa. Spa Services Spa Services Do you have to be a certain age to enjoy spa treatments? Spa Facility and Spa Pool use is for guests 18 years of age or older. Guests under 18 years of age are not eligible for body treatments and massages. Guests 16-17 years of age may have facials, with a parent or legal guardian present. Guests 5-15 years or under are eligible for manicures, pedicures, haircuts, and hairstyling only. May I use the fitness center amenities without getting a spa treatment? Fitness Center use is for guests 18 years of age or older. Guests 16-17 years of age have access with a parent or legal guardian, or an authorized consent form. Guests 15 years and under, including infants, are not permitted. Are gift certificates available from the Spa? You may purchase gift certificates for a specific dollar amount. Spa gift certificates can be used toward services or purchases at Tranquility, Spa boutique. Contact the Spa for additional information. Upon Arrival Upon Arrival What do I wear? Most body treatments are enjoyed without clothing, however, please wear whatever is comfortable for you. Disposable underwear is available upon request. During all treatments, the body is fully draped, except for the area being worked on. Robes and slippers are provided in the men's and women's lounges before and after treatments. What about my comfort? Your Spa experience is your time, and you should delight in it to the fullest. If you experience discomfort due to room temperature, massage pressure, music volume, or any other conditions, please tell your therapist immediately. Health Questions Health Questions What if I have special health concerns? When making reservations, please notify the agent if you have high blood pressure, allergies, any physical ailments or disabilities, or if you are pregnant (there are a few services that should be avoided during pregnancy, specifically in the first trimester, but many that can be enjoyed). Spa Policies Spa Policies What if I am late for my treatment? Arriving late will simply limit the time of your treatment, thus lessening its effectiveness and your pleasure. Your treatment will end on time so the next guest will not be delayed. The full value of your treatment will be charged. What if I need to cancel my scheduled appointment? If you must reschedule or cancel your appointment, please notify the spa at least 24 hours in advance to avoid being charged the full service fee. Cancellations of packages or private parties require one week's notice. Groups are subject to a four-week cancellation policy. Please see the Group Coordinator for additional information. Are gratuities included? For your convenience, a 22% service charge will be added to each spa service received. The service charge is dispersed to the spa staff members who served you during your visit. Additional gratuities are at your discretion. How do I pay? A credit card number is required at the time reservations are made. All major credit cards and travelers checks are accepted. You may also charge spa services to your hotel bill or member account. Fitness Center As a registered guest, you have free access to our fitness center, complete with free weights, weight machines, and cardio equipment with TVs. We also provide a variety of workout programs from around the world, including HIIT, Yoga, and Pilates. You can join group fitness classes or opt for private lessons. For personal training sessions and fee details, call us in advance at (407) 393-4200. The fitness center is open 24-hours for your convenience. Vitale, Spa Café After a workout session or a rejuvenating treatment at our facility, you can head over to Vitale. Here you can revitalize your body with health-focused cuisine. We feature a variety of wholesome salads, nutrient-packed power drinks, and tasty smoothies. Monday - Friday: 11:00 pm -4:00 pm Saturday - Sunday: 11:00 am -5:00 pm Menu for Vitale, Spa Café Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton Spa - The Ritz-Carlton 888-707-9325 JW Marriott Spa - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton Spa - The Ritz-Carlton 888-707-9325 JW Marriott Spa - JW Marriott 800-433-5402"
    },
    {
      "url": "https://www.grandelakes.com/contact",
      "text": "Hotels in Orlando, FL | Grande Lakes Orlando Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY Video Features Pause Play Sound On Sound Off Video Description The video opens with sweeping aerial views of the lush 500-acre resort, showcasing tranquil waterways, golf courses, and scenic grounds. Guests are seen enjoying gourmet dining, lounging by sparkling pools with private cabanas, and engaging in family activities. Highlights include kayaking, eco-tours, and rounds of golf, capturing moments of relaxation, adventure, and connection. The video also showcases the grand facade of the property and highlights guests enjoying water slides, a lazy pool, and the poolside firepit. Close Modal View Full Video HIDDEN Luxury in the Heart of orlando Inspired by the opulent era of Florida's historic hotels, Grande Lakes stands as the premier resort destination in Orlando, FL. Our luxury hotels boast a remarkable range of offerings, from rejuvenating spa experiences and championship golf to delectable farm-to-table dining, family activities and exquisite pools featuring luxurious new cabanas. Unparalleled opportunities for relaxation, recreation and adventure beckon families, couples, groups and all travelers. Nestled amidst over 500 acres of pristine natural landscapes, tranquil lakes and a thriving farm, Grande Lakes, Orlando transcends the conventional notion of a mere luxury hotel—it is an exceptional escape. View fall newsletter View fall newsletter - HIDDEN Luxury in the Heart of orlando HIDDEN Luxury in the Heart of orlando Fall & Festive Fun Join us this fall for exciting events including Fall at Grande Lakes, Campari dinner series, Thanksgiving buffets and a haunted magic show. In addition, discover our enchanting festive plans! We are excited to unveil a brand-new ice skating rink and fire pit experience alongside our Winter Wonderland Market. Fall about Fall & Festive Fun Festive about Fall & Festive Fun Theme Park Ticket Holder Exclusive Offer Your Orlando theme park adventure begins at Grande Lakes Orlando. Guests staying at The Ritz-Carlton and JW Marriott Orlando, Grande Lakes can enjoy transportation to and from Universal Orlando, SeaWorld Orlando and Walt Disney Word Resort, complimentary parking, daily resort credit and more! The Ritz-Carlton about Theme Park Ticket Holder Exclusive Offer JW Marriott about Theme Park Ticket Holder Exclusive Offer Two Unique Hotels, One Iconic Resort View All Rooms for The Ritz Carlton View all rooms for JW Marriott Specials And Packages Theme Park Ticket Holder Offer Savings of up to 18% off room rate Up to $100 daily resort credit Complimentary self-parking & park shuttle Theme park ticket discounts The Ritz-Carlton for Theme Park Ticket Holder Offer JW Marriott for Theme Park Ticket Holder Offer Festive Escape Savings up to 30% when booked early - by September 30, 2025 $100 daily resort credit Four ice skating tickets per stay Self-parking The Ritz-Carlton for Festive Escape JW Marriott for Festive Escape Grande Escape Package Up to $100 daily resort credit Complimentary parking THE RITZ-CARLTON for Grande Escape Package JW MARRIOTT for Grande Escape Package Family Escape Package Guaranteed connecting rooms Room with one king bed Room with two queen beds 2 PM check out THE RITZ-CARLTON for Family Escape Package JW MARRIOTT for Family Escape Package Stay Longer. Save More Up to 20% savings for stays of five or more nights THE RITZ-CARLTON for Stay Longer. Save More JW MARRIOTT for Stay Longer. Save More Go to previous slide Go to next slide Luxury Residences Experience unparalleled luxury and privacy in our new three—or four-bedroom residences. Set against the stunning backdrop of Grande Lakes, these two-story homes exude the elegance of a grand estate. Enjoy luxury features such as a private pool, multi-vehicle garage, full kitchen for your family gatherings, and a summer kitchen for al fresco dining. These residences cater to your every need, making them an ideal home away from home. View Residences for Luxury Residences Unique Culinary Journeys Discover a collection of diverse culinary experiences driven by the desire to delight the palate, blending local ingredients with global flavors. Savor menus rooted in sustainability from our on-property Whisper Creek Farm that powers our restaurants, lounges, and cocktail bars, offering the freshest take on fine dining. The Ritz-Carlton for Unique Culinary Journeys JW MARRIOTT for Unique Culinary Journeys Go to previous slide Go to next slide Endless experiences The Ritz-Carlton JW Marriott A world of possibilities lies just outside your guestroom. Our 500-tropical-acre backyard offers an unmatched blend of leisure and adventure exclusive to hotel guests. Unlock a world of curated outdoor experiences through Grande Lakes Sports. From guided safari excursions and kayaking through the Headwaters of the Florida Everglades to mountain biking, falconry, fishing, and more, adventure is in no shortage. See Activities about Experience a vibrant escape at JW Marriott Orlando. Dive into three stunning pools with a lazy river and exclusive areas for kids and adults, and play on a championship 18-hole golf course crafted by Greg Norman. Savor flavors from twelve diverse dining venues and enjoy versatile spaces perfect for any gathering or celebration. See Activities about Enhance Your Stay Grande Lakes Orlando offers distinctive amenities, dining experiences, curated events, and much more. Whether you're a current guest or a future visitor looking to customize your stay, you can start planning here. The Ritz-Carlton for Enhance Your Stay JW MARRIOTT for Enhance Your Stay Discover All You Can Do At Grande Lakes Explore All Activities Discover All You Can Do At Grande Lakes Waterpark Pool Spa Golf Sports Ritz Kids View Details of Waterpark View Details of Pool View Details of Spa View Details of Golf View Details of Sports View Details of Ritz Kids The Upcoming Event Awaits. 11 October Saturday Fall at Grande Lakes Festival Event Info for The Upcoming Event Awaits. View Full Calendar for The Upcoming Event Awaits. Weddings Meetings Say \"I do\" In unmatched elegance Featuring a variety of spaces including intimate meeting rooms, poolside and lawn venues, along with an expansive ballroom, The Ritz-Carlton sets the stage for timeless events of any size. Learn More for Say \"I do\" In unmatched elegance Meet in the Heart of Orlando With more than 100,000 square feet of space, including scenic outdoor venues and three elegant ballrooms complete with world-class catering, weddings, retreats, and special events are made spectacular at JW Marriott Orlando. Learn More for Meet in the Heart of Orlando Planning Your Trip At Grande Lakes Orlando, every day is unique and filled with exciting opportunities. Our resort's privileged location offers guests so much variety that we made the burden of planning the ideal vacation effortless. Discover our itineraries, day trips and recommendations to enhance your Orlando retreat. Family Couples Work-Play Wellness Foodies Outdoor Enthusiasts Girls’ Getaway Guys’ Getaway Multi-Generational Go to previous slide Go to next slide Stay Connected Seasonal Newsletter Keep up to date with seasonal developments and activities from Grande Lake Orlando. View Newsletter for Seasonal Newsletter Grande Stories Explore the rich history of Orlando and discover how Grande Lakes is the region's most unexpected luxury destination. View Stories for Grande Stories Join our Mailing List Subscribe to our email newsletter to be the first to know about Grande Lakes offers and events. Sign Up for Join our Mailing List Follow us and Share: #GrandeLakesOrlando Facebook Instagram Explore Gallery for Explore Gallery Frequently Asked Questions Is there a resort fee? Is there a resort fee? Yes, a resort fee of $55 plus tax will be added to your daily room rate and allows for the inclusion of luxury amenities and services, including: Enhanced high-speed guest room Internet Mountain bike rental at Grande Lakes Sports (two bikes, one hour/day/room) The Headwaters Waterslides at the JW Marriott AquaVenture 360 interactive waterpark (two guests per room) Shuttle transportation to Sea World, Walt Disney World, and Universal Orlando (24-hour advance reservations required, call x4005) Tennis court access for two guests (one hour per day, per room - tennis racquets & balls are included with court access) Pickleball court access for two guests (one hour per day, per room - pickleball paddles & balls are included with court access) Is there a parking fee? Is there a parking fee? Yes, The Ritz-Carlton and JW Marriott charge a parking fee. The Ritz-Carlton exclusively offers valet parking, while JW Marriott offers both self-parking and valet parking. Valet: $58 plus tax Self-parking: $40 plus tax Are pets allowed at Grande Lakes Orlando? Are pets allowed at Grande Lakes Orlando? Two cats or dogs per room are welcome at The Ritz-Carlton Orlando and JW Marriott Orlando, Grande Lakes. There is a $250 USD (+ tax) non-refundable cleaning fee per stay. Service animals are allowed at both resorts. Is Grande Lakes Orlando family friendly? Is Grande Lakes Orlando family friendly? Yes, Grande Lakes Orlando is family-friendly, offering a range of activities and amenities for families. Our resorts feature family-friendly pools, outdoor activities, and a kids' club, as well as dining options suitable for all ages. How far is Grande Lakes Orlando from Theme Parks? How far is Grande Lakes Orlando from Theme Parks? Universal Epic Universe: 3 miles Sea World: 3 miles Universal Studios: 8 miles Walt Disney World: 9 miles Does Grande Lakes Orlando offer a shuttle service to and from the local theme parks? Does Grande Lakes Orlando offer a shuttle service to and from the local theme parks? Yes, We offer a complimentary shuttle service to Universal Orlando/EPIC, Sea World, Magic Kingdom and Epcot. Are there Shipping & Handling Fees Are there Shipping & Handling Fees The Ritz-Carlton Shipping & Handling Rates Click Here JW Marriott Shipping & Handling Rates Click Here Does Grande Lakes Orlando have a conservation program? Does Grande Lakes Orlando have a conservation program? Yes, Grande Lakes Orlando has a conservation program focused on sustainability and environmental stewardship. We are committed to practices that minimize its environmental impact, including water conservation, energy efficiency, waste reduction, and supporting Orlando's local wildlife habitats. Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton Home - The Ritz-Carlton 888-707-9325 JW Marriott Home - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton Home - The Ritz-Carlton 888-707-9325 JW Marriott Home - JW Marriott 800-433-5402"
    },
    {
      "url": "https://www.grandelakes.com/blog/fairways-pub-restaurant-near-me-review",
      "text": "Blog Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY Outside Everday Outside the Everyday Outside the Everyday READ ARTICLE READ Outside the Everyday ARTICLE Rich Land Central Florida is a rich land with a long history Exploring The Rich Land and Long History of Central Florida: An Informative Insight Mar 19, 2025 Central Florida is a rich land with a long history - Blog READ THIS POST READ Central Florida is a rich land with a long history POST Warm Welcoming The Warm, Welcoming EvrBar Mastering the Art of Making a Great First Impression, Time After Time Mar 19, 2025 The Warm, Welcoming EvrBar - Blog READ THIS POST READ The Warm, Welcoming EvrBar POST Stewards Stewards of the land PRIMO OFFERS A TASTE OF ITALY FRESH FROM THE GARDEN: Savour Authentic Italian Flavours Mar 19, 2025 Stewards of the land - Blog READ THIS POST READ Stewards of the land POST A Hotel Within A “HOTEL WITHIN A HOTEL” THE RITZ-CARLTON CLUB LOUNGE OFFERS NEW LEVELS OF GUEST SERVICE: Unveiling Unmatched Hospitality Mar 19, 2025 A “HOTEL WITHIN A HOTEL” - Blog READ THIS POST READ A “HOTEL WITHIN A HOTEL” POST Swim Dine Out Swim in and dine out Savor Mouth-Watering Burgers and More, Poolside at Knife Burger: An Unforgettable Dining Experience Mar 19, 2025 Swim in and dine out - Blog READ THIS POST READ Swim in and dine out POST Previous 1 | 2 | 3 Next Filter By Story Blog Home Stewards A Hotel Within Firstblog For Lovers Fun Comes Waves Golf Connects Hooked Fishing Hotel Outside Everday Rich Land Serenity Southern Swim Dine Out The Sweet Life Thoughtfully Warm Welcoming Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton Blog - The Ritz-Carlton 888-707-9325 JW Marriott Blog - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton Blog - The Ritz-Carlton 888-707-9325 JW Marriott Blog - JW Marriott 800-433-5402"
    },
    {
      "url": "https://www.fairwayinnsheffield.co.uk/our-pub",
      "text": "Our Pub - The Fairway Inn in Birley The Fairway Inn Book Now Menus Offers What's On Book Now Birley Lane, Birley, Sheffield, South Yorkshire, S12 3BP 0114 2653692 Currently Closed We open at Scroll There's Always a Warm Welcome Good food & great times at The Fairway Inn The Fairway Inn is a warm, family-friendly pub with a community atmosphere. We have a nice buzz about us. With super friendly and helpful staff, nothing is too much. Join us at the bar where you’ll be greeted with a warm welcome. We are known for doing great pub food at a fantastic price, plus our huge range of drinks. No matter the occasion, whether you’re joining us for lunch with friends, stopping by for tea with the kids or just don’t want to cook dinner, you’re in the right place. Dine alfresco in our outdoor area or take a seat in our dining area. Hungry? We’ve got you sorted. We do generous portions of delicious food that cater to every taste. There’s plenty on our menu for you to choose from. Fancy a drink? We’ve got you covered with our impressive drinks menu. From cold draught lagers all the way to smooth American bourbons, we’ve got everything. Facilities Beer Garden Dog Friendly Kids Play Area Cask Ales Pool Table Car Park Dartboard Accessible Access Amazon Lockers Accessible Parking Baby Changing High Chairs Free Wifi Indoor Screens Gallery Your local dog friendly pub in Birley Come and enjoy drinks and delicious food with your furry friend at your side. Our beloved pets go everywhere with us, which is why we’re happy to welcome them into the whole pub at The Fairway Inn. Find out more Find Us Birley Lane, Birley, Sheffield, South Yorkshire, S12 3BP 0114 2653692 FairwayInn.Sheffield@phoenixpub.co.uk Pubs Nearby The Fairway Inn Find Us Birley Lane, Birley, Sheffield, South Yorkshire, S12 3BP 0114 2653692 FairwayInn.Sheffield@phoenixpub.co.uk Opening Times Monday 12pm-10pm Tuesday 12pm-10pm Wednesday 12pm-10pm Thursday 12pm-10pm Friday 12pm-12am Saturday 12pm-12am Sunday 12pm-10pm Food Service Times Monday 12pm-8pm Tuesday 12pm-8pm Wednesday 12pm-8pm Thursday 12pm-8pm Friday 12pm-8pm Saturday 12pm-8pm Sunday 12pm-7pm Explore Marston's: Find Other Marston's Pubs Marston's Inns Marston's Careers Christmas 2025 Function Room Hire Privacy Policy Terms & Conditions Terms Of Use Accessibility Feedback FAQs by propeller"
    },
    {
      "url": "https://www.grandelakes.com/meetings-weddings",
      "text": "Top Event Space Orlando | Grande Lakes Orlando Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY The Ritz-Carlton View Menu Overview The Ritz-Carlton Venues JW Marriott Venues Start Planning Home Meetings & Weddings Set Your Event Apart In Central Florida The Ritz-Carlton and JW Marriott combine at Grande Lakes for inspired meetings, weddings and events in Central Florida. With more than 169,000 square feet of space, choose a venue perfectly tailored to your special occasion. Plan a lavish gala in one of our six ballrooms or host intimate executive retreats surrounded by acres of tropical gardens, lakes and wetlands. Organize a board meeting in one of 56 breakout rooms and rely on our expert planning team for a flawlessly executed day in Orlando, Florida. 56 Breakout Rooms 169,000 SQ FT Flexible Event Space 70,000 SQ FT Outdoor Function Space 27,000 SQ FT Foyer Space 30,000 SQ FT Largest Ballroom View Available Group Dates Event Menu Wedding Menu Holiday Menu Floorplan Group Facts Sheet Virtual Tour Start Planning Your Event for The Ritz-Carlton View Available Group Dates Event Menu Wedding Menu Holiday Menu Floorplan Group Facts Sheet Virtual Tour Start Planning Your Event for JW Marriott Meetings & Events Set the stage for a flawless event at Grande Lakes Orlando. Tailor your meeting or gala to fit any size guest list from 10 to up to 1,650. Whether hosting an executive board meeting or large-scale convention, the possibilities are limitless. Previous Next With modern conference rooms and tailored planning, our hotel is a premier venue in Orlando, FL Let our event planner see to everything from banquet hall décor to group outings in Orlando, FL Energize your guests with delicious catering, ranging from coffee breaks to multi-course banquets Stay connected - all event space features free Wi-Fi and cutting-edge A/V equipment Enjoy your down time between meetings by visiting some of Orlando's most popular tourist attractions See More Hide Service Details Audio-Visual Services Complete audiovisual services and equipment are available for rental including projectors, video players and recorders, monitors, cameras, data monitors, screens, audio components, staging, lighting, sound systems and video teleconferencing. Technical support is offered. All arrangements may be made with professional, on-site Event Technology specialists. Themed Events Our professional event planners can create the ultimate themed party for you and your guests. Any event may be customized to meet your preferences. Destination Services The on-site Destination Services team arranges transportation from small VIP shuttle vans to full-sized tour buses; entertainment; décor and themed events. Special off-site programs can be arranged. Other Meeting Services A Conference Concierge, appointed to work with the group, attends to details and offers assistance with special requests during the meeting. With personal service as a trademark of Grande Lakes Orlando, our Meetings and Special Events team are pleased to assist you with the selection of flowers, linens, music, and décor to ensure that you will experience the highest quality and expression of your event. Environmental Responsibility Meetings and events at Grande Lakes are carefully designed to create an unparalleled guest experience while protecting our natural resources. Within our hotels, we reduce energy and water usage, offer a linen and terry reuse program, and utilize environmentally preferable cleaning products. Our meeting venues support a sustainable future by offering recycled paper products and pens, water service options, organic and local food, and sustainable seafood options. Wedding Venues Where Dreams Come True Embark on your marital journey at Grande Lakes Orlando. Our enchanting indoor and outdoor venues are perfect for your special day. We offer luxurious amenities, impeccable service, extraordinary catering, and professional technical services that will exceed your expectations. Whether you choose one of our elegant ballrooms or our lake-side gazebo, your walk down the aisle will be unforgettable. We cater to all types of wedding celebrations, from bridal showers to traditional rehearsal dinners and ethnic receptions. Previous Next Wedding venue information Celebrate your wedding in style at The Ritz-Carlton Orlando, Grande Lakes, where you can choose from the grand Ritz-Carlton Ballroom, the sophisticated Plaza and Tuscany Ballrooms, or a beautifully manicured function lawn. Each venue offers an elegant setting, perfect for creating cherished memories and an unforgettable experience for you and your guests. wedding faq What is the role of the Grande Lakes Wedding Team? Our Weddings Team consists of Wedding Sales Executives and Wedding Service Managers. In your initial planning stage, our Wedding Sales Executives will: Check availability for preferred dates Tour wedding locations to assist in selecting the most appropriate venue to meet your needs Design an estimated proposal of costs inclusive of food, beverage, and ceremony rental fees Establish preferred room rates and your guest room block Create a Wedding Agreement to secure your date and location(s) Once your Wedding Agreement has been returned, our Wedding Services Manager will: Design your event Recommend Wedding Vendors in such areas as wedding planning, floral design, photography, videography, officiant, entertainment, invitations, and wedding attire Act as a liaison between your wedding vendors and the hotel Design your floor plan inclusive of such items as tables, dance floor, bars, and wedding cake table Partner with our Culinary Team to customize your personal wedding menu Monitor your guest room block Create an estimate of charges outlining your financial commitment and deposit schedule Detail your Banquet Event Order and Wedding Resume outlining your event specifics To communicate all aspects of your wedding to the hotel Oversee Ceremony and Reception set-up, food preparation, and other hotel operations Review the accuracy of the banquet check, prior to the completion of your final bill What additional wedding items does Grande Lakes Orlando provide? In addition to banquet tables, chairs, and china, the hotel offers a complimentary selection of specialty linen, charger plates, menu cards, dance floor, staging, and cocktail table centerpieces. We can also assist in renting upgraded items such as specialty chairs, upgraded linens, and specialty china. What wedding activities are available for my guests? Get ready for your big day by relaxing in our Spa. We can assist you in planning everything from a day of rejuvenation before the wedding, hair and makeup services, or a party in our luxurious pedicure suite. While some members of the wedding party may relax at the Spa, you can invite others to participate in a golf tournament, fishing, or even eco-tours! Your guests can enjoy an entire weekend filled with activities ensuring memories last a lifetime. Do you have a florist on-site? Our Grande Lakes Floral Team is located on-site and may provide you with the utmost care in personal customization of floral décor for your entire wedding event, even if your ceremony takes place off the property. Costs vary. I'd like to welcome my guests staying at the hotel with something special. Can the hotel assist me with this? Our team will work with you in designing personal welcome gifts, favors, and wedding party gifts. We strive to create meaningful gifts that envelop your personality. Cost may vary per amenity. Planning Guide What is helpful to know when contacting the hotel? The most helpful information for your Wedding Sales Consultant is knowing an approximate number of guests, what time of day you may be interested in, as well as a range of preferred dates. What happens if we book an outside venue and the weather does not cooperate? All events that are booked outdoors will automatically be reserved with a backup location. Your indoor venue will be guaranteed 30 days prior to your wedding and typically takes place in one of our beautiful ballrooms. May I take wedding photographs on the hotel property? Wedding photography is only allowed exclusively for couples getting married at The Ritz-Carlton Orlando, Grande Lakes. Wedding Timeline What is the typical timeline for planning my wedding at The Ritz-Carlton Orlando, Grande Lakes? Initial Planning Stage (approximately, but not limited, to 6 - 12 months prior) Detail Planning Stage (from contract signing to 1 month prior) Contact our Wedding Sales Consultant to check availability and tour locations Reserve your wedding date by having your Wedding Sales Consultant create a Wedding Agreement detailing your date, time, location, room block, and deposit schedule Return your Wedding Agreement within one week with a 25% non-refundable deposit Detail Planning Stage (from contract signing to 1 month prior) Complete your Wedding Planning Guide provided by your Wedding Services Manager Research and book wedding vendors Design your wedding menu and room layout with your Wedding Services Manager Provide a 50% non-refundable deposit 60 days prior to your wedding date Book Spa, Golf, and other guest activities Final Planning Stage (approximately one month prior to wedding day) Provide a final deposit based on estimated charges 21 days prior Sign and return Banquet Event Orders detailing all food and beverage for your wedding at least 2 weeks prior Provide a final guest count to your Wedding Services Manager 72 business hours in advance Culinary May we bring in an outside caterer? All events at The Ritz-Carlton Orlando, Grande Lakes are catered by our exceptional culinary team. Specialty cuisines such as Indian are available and we encourage you to speak with our Wedding Sales Consultant about additional culinary options. What will my reception cost? Typical dinner reception pricing for butler passed hors d'oeuvre, a plated or buffet dinner, open bar, champagne toast, and wedding cake may range from $230 - $300 per person exclusive of tax and service charges. Pricing is guaranteed six months in advance and may vary depending on the actual menu selection. Celebrate Your Special Occasion Turn your special moments into cherished memories at Grande Lakes Orlando. Our venue options accommodate indoor and outdoor events from intimate to grand. From spacious ballrooms to a charming rustic farm, Grande Lakes Orlando is the perfect location for birthdays, holidays, anniversaries, graduations, family reunions, and coming-of-age celebrations. Connect with our team of experts to plan a memorable occasion, from venue to menu, and everything in between. Explore The Beauty of our Outdoor Venues Citrus Garden The dramatic backdrop of the Citrus Garden is the perfect place to host receptions for up to 150 and seated banquets for up to 100. Set the stage with 2,700 square feet of event space and create your perfect event. Da Vinci Lawn & Terrace With 25,200 square feet of flourishing lawns, tropical garden and intimate balconies, we offer paradise in Central Florida. Host receptions for up to 2,100 or seated banquets for up to 1,000, and experience the natural beauty of Grande Lakes. Primo Garden At the Primo Garden, you're invited to soak up the beauty of nature. This charming garden, nestled on the lower level of the Primo restaurant, can host events for up to 50 people, whether it's a sit-down dinner or a vibrant reception. Valencia Lawn Overlooking Grande Lake and its dramatic sunsets, this 24,600-square-foot lawn can host receptions for up to 2,260 and seated banquets for up to 1,120. Oasis Lawn Located adjacent to the JW Waterpark alongside the Oasis Cabanas, the 11,319 square-foot Oasis Lawn accommodates up to 200 rounds or up to 400 for receptions. Fairways Lawn Set between the 18th hole of the Golf Clubhouse, this space hosts receptions for up to 2,100 and seated banquets for to 1,500. Imagine the possibilities with 20,000 square feet of tropical paradise. Palm Courtyard Located adjacent to The Ritz-Carlton pool, the 2,000 square-foot Pool Courtyard accommodates up to 140 rounds of up to 200 for receptions. Whisper Creek Farm An authentic farm-to-fork experience fit for seated groups of up to 250 and receptions of up to 600. Our 6,000-square-foot fruit and vegetable garden with adjoining 11,000 square-foot outdoor event space allows guests to pick and eat the produce, and connect with the space in a more intimate way. Go to previous slide Go to next slide Event Services Audio-Visual Technology Elevate your event with our comprehensive audiovisual rental services, offering everything from projectors to sound systems. Our professional onsite Event Technology specialists ensure seamless setup and support, allowing you to focus on your event. Dedicated Event Managers For weddings, Marriott Certified Wedding Planners can assist you in defining a vision for your special day and ensuring every detail is perfect. For other meetings and events, our planners can handle everything from banquet hall décor to group outings. Conference Concierge Planning a conference? Experience unparalleled attention to detail with our Conference Concierge, appointed to work with your group to help manage every aspect of your meeting and ensure that all of your special requests are met. Impact Experiences Immerse yourself in a meaningful and rewarding stay with The Ritz-Carlton's Impact Experiences. These unique opportunities allow you to contribute to the local community, making a genuine and lasting impact. Each program offers compelling social and environmental activities that go beyond the ordinary. catering Customize your menu and wow attendees with catering provided by our experienced culinary team, including set-ups for buffet-style receptions, plated dinners, or pre-function gatherings. Event Planning Let our team help you plan every aspect of your event so you can focus on what matters. Our event management team can you assist with your selection of flowers, linens, music, and décor. Go to previous slide Go to next slide The Ritz-Carlton Room Capacity Chart Meeting Room Dimensions (LxWxH) Area (sq.mt) Theater Schoolroom Conference U-Shape Reception Banquet The Ritz-Carlton Ballroom 55.2x27.1x4.9 1458.2 1750 1100 - - 1650 1060 The Ritz-Carlton Salon I 14x13.7x4.9 179.9 215 132 - 42 200 120 The Ritz-Carlton Salon II 14x13.7x4.9 179.9 215 132 - 42 200 120 The Ritz-Carlton Salon III 13.7x27.1x4.9 369.6 400 265 - 75 400 240 The Ritz-Carlton Salon IV 13.7x27.1x4.9 369.6 400 265 - 75 400 240 The Ritz-Carlton Salon V 14x13.7x4.9 179.9 215 132 - 42 200 120 The Ritz-Carlton Salon VI 14x13.7x4.9 179.9 215 132 - 42 200 120 The Ritz-Carlton Salon I & II -x-x- 359.7 350 168 50 75 250 200 The Ritz-Carlton Salon I, II, & III -x-x- 729.3 768 550 - 80 825 530 The Ritz-Carlton Salon I, II, III, & IV -x-x- 1098.8 1152 825 - - 1230 790 The Ritz-Carlton Salon III & IV -x-x- 739.1 768 550 50 75 825 530 The Ritz-Carlton Salon IV, V & VI -x-x- 729.3 768 550 50 50 825 530 The Ritz-Carlton Salon III, IV, V & VI -x-x- 1098.8 1152 725 - - 1230 790 The Ritz-Carlton Salon V & VI -x-x- 359.7 350 168 50 75 250 200 The Plaza Ballroom 19.8x28x4.3 562.5 580 350 - 78 635 400 Plaza Salon I 19.8x9.4x4.3 186.3 180 120 - 39 210 120 Plaza Salon II 19.8x9.4x4.3 190 180 120 - 39 215 120 Plaza Salon III 19.8x9.4x4.3 186.3 180 120 - 39 210 120 Plaza Salon I & II -x-x- 376.3 120 240 6075 - 60 - Plaza Foyer II & III -x-x- 162.5 - - - - 200 - Plaza Salon II & III -x-x- 376.3 350 225 - 50 250 180 Florence 4.6x7.3x- 33.4 30 12 12 - 25 20 Pisa 4.6x7.3x- 33.4 30 12 12 - 25 20 The Tuscany Ballroom 26.5x47.2x6.4 1252.8 1500 900 - - 1400 960 Tuscany Salon A 8.8x11.6x6.4 101.1 90 60 26 30 110 60 Tuscany Salon B 8.8x11.6x6.4 101.1 90 60 26 30 110 60 Tuscany Salon C 8.8x11.6x6.4 101.1 90 60 26 30 110 60 Tuscany Salon D 26.5x12.2x6.4 323.3 350 230 - - 350 200 Tuscany Salon E 26.5x12.2x6.4 323.3 350 230 - - 350 200 Tuscany Salon F 8.8x9.1x6.4 79.5 80 45 24 24 90 50 Tuscany Salon G 8.8x9.1x6.4 79.5 80 45 24 24 90 50 Tuscany Salon H 8.8x9.1x6.4 79.5 80 45 24 24 90 50 Tuscany Terrace -x-x- 278.7 - - - - 100 80 Trieste 7.3x6.1x2.7 44.8 30 20 12 15 50 20 Verona I 6.7x8.8x2.7 57.5 50 24 20 20 65 30 Verona II 13.7x6.4x2.7 85 50 42 30 30 95 40 Siena I & II 18.6x13.1x2.7 243.9 270 140 48 48 275 160 Siena I 7.3x13.1x2.7 97.5 100 60 26 30 110 60 Siena II 11.3x13.1x2.7 146.3 140 90 30 33 165 100 Napoli I & II 13.1x13.1x2.7 171.5 200 84 36 48 190 120 Napoli I 6.7x13.1x2.7 85.7 80 42 30 32 95 50 Napoli II 6.7x13.1x2.7 85.7 80 42 30 32 95 50 Capri 9.4x8.2x2.7 79.5 80 45 24 27 90 50 Genoa I 6.4x7x2.7 44.5 40 18 18 18 50 20 Genoa II 9.4x9.8x2.7 92.4 80 50 24 27 100 50 Genoa III 6.4x9.8x2.7 66.7 70 30 20 24 80 40 Amalfi I, II 19.2x8.8x2.7 166.6 150 110 40 44 185 110 Amalfi I 9.1x8.8x2.7 79.5 60 56 20 24 90 50 Amalfi II 9.8x8.8x2.7 87 60 56 20 24 95 50 The Boardroom 7x6.1x2.7 43.5 0 0 12 0 0 0 Egret -x-x- 92.9 36 24 20 15 50 20 Heron -x-x- 92.9 36 24 20 15 50 20 Da Vinci Lawn -x-x- 1858 - - - - 2100 1000 Da Vinci Terrace -x-x- 483.1 - - - - 200 150 Palm Courtyard -x-x- 882.6 - - - - 250 200 Citrus Garden -x-x- 250.8 - - - - 200 150 Fairways Lawn -x-x- 1858 - - - - 2500 1500 Whisper Creek Farm -x-x- 1021.9 - - - - 800 400 Milan I 5.8x9.1x2.7 53 40 24 22 21 50 20 Milan II 7.3x10.7x2.7 78 84 45 22 24 80 50 Milan III 10.1x12.2x2.7 122.6 120 66 28 33 125 60 Milan I, II & III -x-x- 247.1 180 100 40 42 275 130 Milan I & II -x-x- 119.8 120 63 28 30 130 70 Milan II & III -x-x- 185.3 180 108 40 42 200 110 Adelphia 6.1x9.1x2.7 55.7 70 30 22 24 70 30 Vittoria 2.4x5.2x2.7 12.6 - - 6 - - - Bocce Ball Courts -x-x- 83.6 - - 200 - 200 200 Da Vinci Lawn & Terrace -x-x- 2341.1 - - - - 2100 - JW Marriott Room Capacity Chart Lobby Level Sq. Ft. Sq. Meters Dimensions (Ft.) Banquet Rounds of 10 Reception Conference Classroom U-Shape Theater Hollow Square Exhibit 8×10 vert. Palazzo Ballroom 19,984 1,857 99×201×18 1,450 2,104 — 1,332 — 2,156 — 123 Salons A or F 1,661 154 50×33×18 110 175 — 100 42 187 52 — Salons B or G 1,661 150 50×32×18 110 170 — 108 42 200 52 — Salons C or H 1,661 154 43×33×18 110 175 — 100 42 187 52 — Salons D or E 5,009 465 50×99×20 320 527 26 340 — 550 — — Foyer and Pre-Function 7,552 702 — — 800 — — — — — — Mediterranean Ballroom 29,666 2,756 126×234×18 2,300 3,123 — 1,980 — 3,248 — 198 Salons 1 or 6 2,285 212 42×54×18 150 241 — 144 54 234 68 — Salons 2 or 7 2,289 213 42×54×18 150 241 — 160 54 234 68 — Salons 3 or 8 2,285 212 42×46×18 150 241 — 144 54 234 68 — Salons 4 or 5 7,938 737 126×63×21 660 836 44 522 — 896 — — Foyer and Pre-Function 9,796 910 — — 1,031 — — — — — — Coquina Ballroom 28,000 2,601 120×240×29 2,100 3,000 — 1,800 — 3,100 — 167 Coquina North or South 14,400 1,338 120×120×29 1,050 1,500 90 900 — 1,550 — — Meeting Planner Office 300 28 — — — 10 — — — — — Lower Level Sq. Ft. Sq. Meters Dimensions (Ft.) Banquet Rounds of 10 Reception Conference Classroom U-Shape Theater Hollow Square Exhibit 8×10 vert. Segura 1 708 66 41×17×12 30 75 28 42 28 67 34 — Segura 2 662 62 41×16×12 30 70 24 39 28 63 34 — Segura 3 1,074 100 41×26×12 60 113 30 68 32 118 40 — Segura 4 982 91 41×24×12 60 103 30 70 32 118 40 — Segura 5 1,120 104 43×25×12 60 118 30 78 38 127 46 — Segura 6 1,044 97 43×24×12 60 110 30 70 32 124 40 — Del Lago 1 - 4, each 800 74 25×32×12 50 84 26 58 26 96 34 — Marbella 1 843 78 42×20×12 40 89 28 50 30 90 36 — Marbella 2 976 91 42×24×12 60 103 34 68 32 109 40 — Marbella 3 815 76 42×19×12 40 86 28 48 30 85 36 — Marbella 4 1,041 97 41×24×12 60 110 28 68 32 111 40 — Amarante 1 731 68 19×37×12 30 77 22 42 22 68 28 — Amarante 2 or 3 808 75 25×32×12 50 85 26 54 22 90 28 — Cordova 1 777 72 44×17×12 40 82 28 45 30 75 36 — Cordova 2 1,169 109 44×26×12 80 123 28 78 34 120 44 — Cordova 3 896 83 44×21×12 40 94 26 56 30 106 36 — Cordova 4 903 84 29×30×12 60 95 24 60 26 95 36 — Cordova 5 749 70 37×20×12 40 79 22 51 28 75 34 — Cordova 6 845 79 37×23×12 60 89 24 58 26 84 34 — Milagro Boardroom 670 62 20×32×12 — — 12 — — — — — Barcelona 272 25 17×16×12 10 — 8 — — — — — Brava 675 63 27×25×9 40 65 18 36 23 55 30 — Dorada 675 63 27×25×9 50 70 20 34 23 53 30 — Cataluna 1 1,015 94 35×29×9 60 95 65 37 26 67 30 — Cataluna 2 928 86 32×29×9 60 90 75 42 27 62 36 — Cataluna 1 & 2 — — — — — — — — 145 — — Madrid — — — 20 — 12 — 14 24 18 — Palma 336 31 21×16×9 20 — 18 — — — — — Petra 384 36 24×16×9 30 — 20 — — — — — Sevilla 1 2,040 190 60×34×9 130 175 48 113 54 159 60 — Sevilla 2 1,456 135 52×28×9 90 150 38 80 44 114 50 — Almeria 1 832 77 36×17×12 30 56 24 40 10 75 10 — Almeria 2 1,115 104 27×36×12 60 75 24 50 24 56 20 — Almeria 3 1,242 115 46×27×9 70 126 30 64 31 88 36 — Monterey 2,964 275 52×57×12 200 250 42 88 43 120 50 — Lower Level Pre-Function Space 14,068 1,307 22×29×12 — 1,365 — — — — — — Outdoor Event Space Sq. Ft. Sq. Meters Dimensions (Ft.) Banquet Rounds of 10 Reception Conference Classroom U-Shape Theater Hollow Square Exhibit 8×10 vert. Citrus Garden 2,700 251 — 100 150 — — — — — — Fairways Lawn 20,000 1,858 — 1,500 2,500 — — — — — — Lobby Patio 500 — — 30 50 — — — — — — Mediterranean Porte-Cochere 10,000 929 — 800 1,200 — — — — — 500 Quench South Lawn 4,500 418 — 120 200 — — — — — — Valencia 20,000 1,858 — 1,000 2,100 — — — — — — Valencia Terrace 4,600 427 — 120 160 — — — — — — Veranda 1,000 93 — 40 60 — — — — — — Whisper Creek Farm 11,000 1,022 — 400 800 — — — — — — Room Set-up Examples Banquet Generally used for meals and sessions involving small group discussions. A five foot round table seats eight people comfortably. A six foot round table seats 10 people comfortably. Conference and Hollow Square Appropriate for interactive discussions and note-taking sessions for fewer than 25 people. Many hotels have elegant \"boardrooms\" for 10 to 20 people, equipped with full audiovisual capabilities, a writing board, cork board and a flip chart. E-Shape, U-Shape and T-Shape Appropriate for groups of fewer than 40 people. These are best for interaction with a leader seated at the head of the setup. Audiovisual is usually best set up at the open end of the seating. Theater Appropriate for large sessions and short lectures that do not require extensive note-taking. This is a convenient setup to use before breaking into discussion or role-playing groups because chairs can be moved. Reception Stand-up social function where beverages and light foods are served. Foods may be presented on small buffet tables or passed by servers. May precede a meal function. Schoolroom or Classroom The most desirable setup for medium to large-size lectures. Requires a relatively large room. Tables provide attendees with space for spreading out materials and taking notes. Ovals and Rounds Generally used for meals and sessions involving small group discussions. A five foot round table seats eight people comfortably. A six foot round table seats 10 people comfortably. Equipments and Services Audio-Visual Equipment 35MM Projector AV Technician Film Projector with Screen LCD Panel LCD Projector Microphone Overhead Projector PA System TV TV Production Service Provider Teleconferencing Video Camera Videoconferencing Walkie Talkies Wired Internet Event Services Carpenter Certified Meeting Planner Decorator Electrician Event Lighting Locksmith Message Service Photographer Registration Service Security Guards Translator Event Equipment & Supplies Blackboards Direction Signs Easels Flip Chart & Markers Name Cards Pens / Pencils / Notepad Podium Lectern Portable Stage Spotlights Stack Chairs Tables Wall Charts Business Services Computers Copy Service Fax Service On-Site Business Center is Staffed Overnight Delivery/Pickup Post/Parcel Printers Catering Services Afternoon Break Coffee Break Continental Breakfast Full Breakfast Lunch Dinner Reception Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton Meetings & Weddings - Overview - The Ritz-Carlton 888-707-9325 JW Marriott Meetings & Weddings - Overview - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton Meetings & Weddings - Overview - The Ritz-Carlton 888-707-9325 JW Marriott Meetings & Weddings - Overview - JW Marriott 800-433-5402"
    },
    {
      "url": "https://www.grandelakes.com/things-to-do/grand-lakes-sports",
      "text": "Outdoor Activities in Orlando FL| Grande Lakes Orlando Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY Video Features Pause Play Sound On Sound Off Video Description Embrace adventure and outdoor fun at Grande Lakes Orlando. This video showcases on-site sports and activities, including cycling through lush green landscapes, kayaking serene waterways, boat rides, and birdwatching. Discover the perfect balance of excitement and nature, creating unforgettable moments in a breathtaking setting. Close Modal View Full Video Events/Activities View Menu Events and Activities Waterpark Pools Cabanas Spa Golf Grande Lakes Sports Ritz Kids Itineraries Shopping Home Events/Activities Grand Lakes Sports Grande Lakes Sports Embark on a journey surrounded by 500 acres of secluded luxury, ideal for families, couples, and group retreats. At Grande Lakes Sports, we offer an exclusive collection of outdoor activities that will fuel your adventurous spirit. Watch the headwaters of the Everglades come alive on a sunrise safari, test your fishing skills on one of our eleven lakes, tackle our hidden mountain bike trail, or delve into the intriguing world of falconry. Eco-Tours Prepare for an extraordinary two-hour Eco-Tour through Shingle Creek. Paddle along the serene waterways in a kayak or canoe, taking in the breathtaking natural scenery. Accompanied by a professional guide, you'll traverse the property in an Outfitter's all-terrain golf cart, journeying to the headwaters of the Everglades. Here, you'll have a rare opportunity to see the rich wildlife that makes Florida famous. Reserve for Eco-Tours Go to previous slide Go to next slide Images for Sunrise Safari Join one of our Certified Florida Master Naturalists on a guided trip on the wild side as you explore the beginning of a new day on the 500-acre Grande Lakes Orlando resort. From the comfort of a customized, all-terrain golf cart, you will have a chance to observe and photograph whitetail deer, bobcats, North American river otters, foxes, raccoons, alligators, and a host of birds ranging from great horned owls to roseate spoonbills. Monday - Sunday 7:00 am - 9:00 am Reserve for Sunrise Safari Images for Archery Master the artistry and precision of archery in a lush tropical setting at our resort. This exclusive experience strikes a unique balance by developing strength, improving focus, and enhancing mental resilience while also being relaxing, meditative and fun. Reserve for Archery Falconry Experience the ancient art of falconry, a 4,000-year-old practice, right here at Grande Lakes. Learn about the species, rules, and history of this fascinating tradition. After a quick training session, join us in the field where birds of prey will swoop down from the trees at your call. What makes this experience so unique is that it's not offered anywhere else in the State of Florida. We take pride in being Florida's sole certified falconry experience approved by the U.S. National Fish & Wildlife Service. Don't let this opportunity fly away! Reserve - Falconry Reserve for Falconry Go to previous slide Go to next slide Hidden Trail Mountain Bikes Get ready for an exhilarating mountain biking experience on our extensive grounds. Our two-mile radius trail is tailored for intermediate and advanced riders, providing an unmatched blend of adventure and fun. Find Grande Lakes Sports in The Ritz-Carlton breezeway on the ground floor to rent your bike. Call (407) 393-4531 to contact Grande Lakes Sports. Kayaks & Canoes Experience the thrill of the great outdoors with your friends and family in a canoe or a single-seater kayak. As you paddle through our tranquil Grande Lake, witness the vibrant wildlife that makes Central Florida unique. Coastal Wake We offer fully customizable charters for unforgettable all-day water escapes. We pride ourselves on our luxury wake board experience. Our top-tier service will give you a day on the water you will never forget! This is an off-property activity located in Maitland, FL. Reserve your experience with Coastal Wake by dialing 407-399-7080 or email Michael@coastalwake.com. Go to previous slide Go to next slide Fishing Join our seasoned fishing guide on a private expedition to catch trophy largemouth bass within our expansive 500 acre resort. With 12 diverse lakes and ponds and the remote 48 acre Shingle Lake, you can opt to fish from a Hyde drift boat or roam the terrain in our custom Outfitter's golf cart. This catch-and-release adventure requires no license, and we provide all the necessary fishing gear. Reserve for Fishing Go to previous slide Go to next slide Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton Grand Lakes Sports - The Ritz-Carlton 888-707-9325 JW Marriott Grand Lakes Sports - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton Grand Lakes Sports - The Ritz-Carlton 888-707-9325 JW Marriott Grand Lakes Sports - JW Marriott 800-433-5402"
    },
    {
      "url": "https://camra.org.uk/pubs/fairways-brinsworth-149032",
      "text": "Fairways, Brinsworth                            - CAMRA - The Campaign for Real Ale Shop Learn &\n                            Discover Volunteer Resources Area CAMRA - Campaign for Real Ale logo Search button Pubs & Clubs Pubs & Clubs Nearby Use my location to find nearby pubs & clubs Events Events & Festivals Browse our list of events and festivals Beers & Breweries Breweries Nearby Use my location to find nearby breweries Search button Search button Pubs & Clubs Pubs & Clubs Nearby Use my location to find nearby pubs & clubs Events Events & Festivals Browse our list of events and festivals Beers & Breweries Search button Breweries Nearby Use my location to find nearby breweries CAMRA - Campaign for Real Ale logo About About Who we are Our Awards What we stand for Promotional Campaigns Our Leadership Our Regional Leaders Our staff Contact us / FAQs Feedback & Complaints Beer Magazine Media Centre What's Brewing Raffle Learn and Discover Pubs and wellbeing Clubs Our Regions Podcast Books Shop Volunteer Job opportunities Leave a legacy Digital Futures Our branches Our Branches Find a place to visit With over 220 CAMRA branch locations to enjoy beer, pubs or meet new people. Membership Membership Member Benefits Membership Rates Gift Memberships Partner Benefits Find discount Scheme Pubs Find Voucher scheme Pubs & clubs FAQs Young members Find a CAMRA Festival Join Now Member Benefits CAMRA Member Benefits Access incredible value through our member benefits CAMRA Discount Scheme CAMRA Discount Scheme The Real Ale Discount Scheme offers CAMRA members discounts at over 3,600 of pubs across the\n                            UK CAMRA Voucher Scheme CAMRA Voucher Scheme The Real Ale ider & Perry Vouchers are redeemable at over 1,200 of pubs across the UK. Pubs & Clubs Going to Pubs & Clubs Search for Pubs & Clubs Real Ale, Cider and Perry Vouchers Good Beer Guide Pubs & Clubs Curated Guides Historic pub interiors Outstanding Conversions and Restorations Community Owned and Community Run Pubs Going to pubs by public transport Scoring beer quality in pubs TasteMatch Campaigning Pub Campaigning Clubs Campaigning Pubs Code Adjudicator Save your local pub Pubs and wellbeing Pub of the Year Bailey Head, Oswestry Bailey Head, Oswestry, SY11 1PZ Club of the Year Firs Club, Codsall Station Road, Codsall, WV8 1BX Events & Festivals Events & Festivals Find events Beer festivals Social events Training events CAMRA meetings AGM Other events Submit an event Up-Coming Events Chappel Beer Festival Chappel & Wakes Colne Station, Live now Cannock Independent Beer festival Cannock, Starts 1 day from now 18th Moreton Beer and Cider Festival Moreton in Marsh Gloucestershire, Starts 2 days from now The Botallack Beer Festival at the Queens Arms Botallack, Starts 2 days from now Late Summer Beer and Cider by the Sea Eastbourne , Starts 2 days from now Featured Events Featured Events St Albans Beer & Cider Festival St Peter's Street, St Albans, Hertfordshire, AL1 3LD 24-27\n                                September 2025 Ayrshire Real Ale Festival Municipal Buildings, South Beach, Troon, South Ayrshire, KA10 6EF 2-4\n                                October 2025 Beers & Breweries Beers & Breweries Find Breweries Find Beers Beer styles TasteMatch Champion Beer of Britain Winner Penzance - Mild Penzance Brewing Company, Crowlas, TR20 8DX Champion Beer of Britain Silver Sarah Hughes - Snowflake Beacon Hotel, 129 Bilston Street, Sedgley, Dudley, DY3 1JE Champion Beer of Britain Bronze Church End - Fallen Angel Ridge Lane, Nuneaton, CV10 0RD Cider & Perry Cider & Perry Find real cider and perry producers In order to be real, cider and perry should never be concentrated then diluted – either in terms of\n                    the juice used, or the alcohol content. Cider & Perry Pub of the Year That Beer Place, Chester 116, Foregate Street, Chester, Chester, CH1 1HB FAQs Frequently asked questions Understand more about real Cider and Perry Submit Producer Submit Producer Let us know if you think we've missed a real cider or perry maker. This information will be\n                    displayed publicly. Take Action Save your local pub Has your local pub closed? Pubs across the UK are being lost forever to conversion or demolition. Campaigning resources Additional resources Our campaign resources aim to provide you with a wide range of information and materials you’ll need to become a fantastic campaigner for pubs, beer and cider! Political Campaigning The Budget The Surrender Principle Beer Tax Business Rate Reform Pubs Code Adjudicator High Street Rental Auctions Small Brewers Relief Cider Tax Labelling Community Action Public transport National Beer Scoring System Beer Quality Accreditation Handpump hijack TasteMatch Shop Learn & Discover Volunteer Resources Area My Trips Facebook Twitter Instagram Join Us Sign in CAMRA - Campaign for Real Ale logo CAMRA - Campaign for Real Ale logo Search button Pubs & Clubs Pubs & Clubs Nearby Use my location to find nearby pubs & clubs Events Events & Festivals Browse our list of events and festivals Beers & Breweries Breweries Nearby Use my location to find nearby breweries Search button Search button Pubs & Clubs Pubs & Clubs Nearby Use my location to find nearby pubs & clubs Events Events & Festivals Browse our list of events and festivals Beers & Breweries Search button Breweries Nearby Use my location to find nearby breweries Open main menu Join Us Sign in Home About Membership Pubs & Clubs Events & Festivals Beers & Breweries Cider & Perry Take Action Facebook Twitter Instagram Youtube About Who we are Our Awards What we stand for Promotional Campaigns Our Leadership Our Regional Leaders Our staff Contact us / FAQs Feedback & Complaints Beer Magazine Media Centre What's Brewing Raffle Learn and Discover Pubs and wellbeing Clubs Our Regions Podcast Books Shop Volunteer Job opportunities Leave a legacy Digital Futures Our branches Our Branches Find a place to visit With over 220 CAMRA branch locations to enjoy beer, pubs or meet new people. Going to Pubs & Clubs Search for Pubs & Clubs Real Ale, Cider and Perry Vouchers Good Beer Guide Pubs & Clubs Curated Guides Historic pub interiors Outstanding Conversions and Restorations Community Owned and Community Run Pubs Going to pubs by public transport Scoring beer quality in pubs TasteMatch Campaigning Pub Campaigning Clubs Campaigning Pubs Code Adjudicator Save your local pub Pubs and wellbeing Pub of the Year Bailey Head, Oswestry Bailey Head, Oswestry, SY11 1PZ Club of the Year Firs Club, Codsall Station Road, Codsall, WV8 1BX Events & Festivals Find events Beer festivals Social events Training events CAMRA meetings AGM Other events Submit an event Up-Coming Events Chappel Beer Festival Chappel & Wakes Colne Station, Live now Cannock Independent Beer festival Cannock, Starts 1 day from now 18th Moreton Beer and Cider Festival Moreton in Marsh Gloucestershire, Starts 2 days from now The Botallack Beer Festival at the Queens Arms Botallack, Starts 2 days from now Late Summer Beer and Cider by the Sea Eastbourne , Starts 2 days from now Featured Events Featured Events St Albans Beer & Cider Festival St Peter's Street, St Albans, Hertfordshire, AL1 3LD 24-27\n                                September 2025 Ayrshire Real Ale Festival Municipal Buildings, South Beach, Troon, South Ayrshire, KA10 6EF 2-4\n                                October 2025 Beers & Breweries Find Breweries Find Beers Beer styles TasteMatch Champion Beer of Britain Winner Penzance - Mild Penzance Brewing Company, Crowlas, TR20 8DX Champion Beer of Britain Silver Sarah Hughes - Snowflake Beacon Hotel, 129 Bilston Street, Sedgley, Dudley, DY3 1JE Champion Beer of Britain Bronze Church End - Fallen Angel Ridge Lane, Nuneaton, CV10 0RD Cider & Perry Find real cider and perry producers In order to be real, cider and perry should never be concentrated then diluted – either in terms of\n                    the juice used, or the alcohol content. Cider & Perry Pub of the Year That Beer Place, Chester 116, Foregate Street, Chester, Chester, CH1 1HB FAQs Frequently asked questions Understand more about real Cider and Perry Submit Producer Submit Producer Let us know if you think we've missed a real cider or perry maker. This information will be\n                    displayed publicly. Save your local pub Has your local pub closed? Pubs across the UK are being lost forever to conversion or demolition. Campaigning resources Additional resources Our campaign resources aim to provide you with a wide range of information and materials you’ll need to become a fantastic campaigner for pubs, beer and cider! Political Campaigning The Budget The Surrender Principle Beer Tax Business Rate Reform Pubs Code Adjudicator High Street Rental Auctions Small Brewers Relief Cider Tax Labelling Community Action Public transport National Beer Scoring System Beer Quality Accreditation Handpump hijack Membership Member Benefits Membership Rates Gift Memberships Partner Benefits Find discount Scheme Pubs Find Voucher scheme Pubs & clubs FAQs Young members Find a CAMRA Festival Join Now Member Benefits CAMRA Member Benefits Access incredible value through our member benefits CAMRA Discount Scheme CAMRA Discount Scheme The Real Ale Discount Scheme offers CAMRA members discounts at over 3,600 of pubs across the\n                            UK CAMRA Voucher Scheme CAMRA Voucher Scheme The Real Ale ider & Perry Vouchers are redeemable at over 1,200 of pubs across the UK. You have visited this venue View all visits Home > Regions > Yorkshire > Rotherham > Fairways, Brinsworth Fairways, Brinsworth You have visited this venue View all visits Directions Beer Score Trip + Favourites Want to visit Visited Beer Score Beer score Trip Favourites Want to visit Visited You want to visit - You have this in Open Operator: Brown Bear Pub Co Bawtry Road, Brinsworth, S60 5NU (View on Google Map) (01709) 838111 Email Website Facebook Back Fairways, Brinsworth Bawtry Road, Brinsworth, S60 5NU (View on Google Map) 1 of 7:\n                                    (Pub, Garden, Key). Published on 24-06-2020 2 of 7:\n                                    (Pub, External). Published on 31-12-2018 3 of 7:\n                                    (Pub). Published on 24-06-2020 4 of 7:\n                                    (Bar). Published on 24-06-2020 5 of 7:\n                                    (Garden). Published on 16-10-2016 6 of 7:\n                                    (Sign). Published on 16-10-2016 7 of 7:\n                                    (Pub). Published on 16-10-2016 1 of 7:\n                                            (Pub, Garden, Key). Published on 24-06-2020 2 of 7:\n                                            (Pub, External). Published on 31-12-2018 3 of 7:\n                                            (Pub). Published on 24-06-2020 4 of 7:\n                                            (Bar). Published on 24-06-2020 5 of 7:\n                                            (Garden). Published on 16-10-2016 6 of 7:\n                                            (Sign). Published on 16-10-2016 7 of 7:\n                                            (Pub). Published on 16-10-2016 View all Description Additional information Formerly owned by Yorkstone Property Ltd, who bought the pub from the Spirit group in 2008, the Fairways was acquired in Jan 2016 by Lincolnshire brewer George Bateman & Son Ltd for an undisclosed sum. As a result three Batemans cask beers have been installed on the bar, one of which is changing. This substantial roadside pub, on the main road from Sheffield to Bawtry is approximately 1.5 miles from the M1, junction 34 and 2 miles from junction 33. It overlooks Phoenix Golf Course to the rear with views across the greens. An extensive food menu is served, including breakfast. Special offers on meals on certain days. There are seven letting rooms. Events inc a Saturday night quiz and occasional weekend live music and an open mic night on Thursdays. Information for this venue is provided by the Rotherham Branch of CAMRA Previous Names Local Authority Rotherham District (B) Last updated 14/01/2024 Last surveyed 10/02/2023 Leasehold owner unknown Freehold owner Batemans Pub ID ROT/023 Asset of Community Value Opening Times Food Times Monday 8:00am - 11:00pm Tuesday 8:00am - 11:00pm Wednesday 8:00am - 11:00pm Thursday 8:00am - 11:00pm Friday 8:00am - Midnight Saturday 8:00am - Midnight Sunday 8:00am - 11:30pm Monday 8:00am - 8:30pm Tuesday 8:00am - 8:30pm Wednesday 8:00am - 8:30pm Thursday 8:00am - 8:30pm Friday 8:00am - 8:30pm Saturday 8:00am - 8:30pm Sunday 8:00am - 5:00pm Ready to find your perfect pint? Unlock TasteMatch and all of CAMRA’s online tools from just 99p/month with our Explorer Pass, or join as a member to get the best of pubs, beer and breweries plus discounts at the bar. Find out more Current beers Spot a Beer Beer Score This Pub serves no changing\n                beers and 3 regular beers. Regular and recently seen Close modal Batemans - XB TasteMatch Prediction View beer Mark as pouring Score this beer Favourites Batemans - XB Session Bitter Dispense: Handpump ABV: 3.7% Vegan: No Gluten Free: No This beer is served regularly. Batemans - XB Session Bitter • 3.7% More pub\n                                            details Close\n                                                panel Batemans - XB This beer is served regularly at Fairways, Brinsworth. ABV 3.7% Dispense Handpump Style Session Bitter Colour Vegan No Gluten Free No Mark as pouring Score this beer Add to favourites Close modal Batemans - XXXB TasteMatch Prediction View beer Mark as pouring Score this beer Favourites Batemans - XXXB Premium Bitter Dispense: Handpump ABV: 4.8% Vegan: No Gluten Free: No This beer is served regularly. Batemans - XXXB Premium Bitter • 4.8% More pub\n                                            details Close\n                                                panel Batemans - XXXB This beer is served regularly at Fairways, Brinsworth. ABV 4.8% Dispense Handpump Style Premium Bitter Colour Vegan No Gluten Free No Mark as pouring Score this beer Add to favourites Close modal Batemans - Gold (Also known as Yella Belly Gold) TasteMatch Prediction View beer Mark as pouring Score this beer Favourites Batemans - Gold (Also known as Yella Belly Gold) Session Golden Ale Dispense: Handpump ABV: 3.9% Vegan: No Gluten Free: No This beer is served regularly. Batemans - Gold (Also known as Yella Belly Gold) Session Golden Ale • 3.9% More pub\n                                            details Close\n                                                panel Batemans - Gold (Also known as Yella Belly Gold) This beer is served regularly at Fairways, Brinsworth. ABV 3.9% Dispense Handpump Style Session Golden Ale Colour Vegan No Gluten Free No Mark as pouring Score this beer Add to favourites Source: Regional Your scores Join CAMRA to access beer scoring and view scores for other pubs. Become a member . Retrieving scores You have no beer scores submitted. Champion Beer Of Britain Award The Champion Beer of Britain is one of the most prestigious beer competitions in the world. It is the ultimate honour for UK brewers and has helped put many into the national spotlight. Nominations are now Open Join CAMRA to choose Britain’s Champion Beer! Become a member Judging for the competition takes around a year, starting with individual nominations from CAMRA members and tasting panel nominations, leading to a series of rigorous regional heats adhering to a strict blind tasting policy. Facilities Sports TV TNT & SKY Lunchtime Meals Breakfast served from 7 to 10am Evening Meals Live Music Open mic on thu eve, Occ weekends Garden Family Friendly Disabled Access Parking Accommodation 7 rooms Events Sat Quiz Function Room Area can be closed off on request Restaurant Smoking Wi Fi AccessAble Features Cask Ale Transport Close to bus routes (40m) First South Yorkshire: 73, 74, 208 Help keep our information accurate! Notice an error or missing details? Help us keep our pub & club information accurate by sharing any corrections or updates you spot. Suggest an edit Nearby View All Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens at 11:00am Phoenix Sports & Social Club Pavilion Phoenix Sports & Social Club\n                Club, in Brinsworth 3 Changing\n                                                Beers Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens at 8:00pm Three Magpies Sizzling Pub & Grill Sizzling Pubs (Mitchells & Butlers)\n                Pub, in Brinsworth Cask Ale not available Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens at 4:00pm Inn Time Stop Inn Time Ltd\n                Pub, in Brinsworth Cask Ale not available Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens in 49 minutes Stop Inn 21 Coffee Shop & Bistro Stop Inn Time Ltd\n                Restaurant, in Brinsworth Cask Ale not available Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens in 49 minutes Valentines Restaurant, in Brinsworth Cask Ale not available Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens at 4:00pm Brinsworth Social Club Brinsworth Social Club\n                Club, in Brinsworth Cask Ale not available Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens at 11:00am Centre (The) Brinsworth Community Trust\n                Other Drinking Establishment, in Brinsworth Cask Ale not available Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens at 2:00pm Thirsty Flame Bar & Restaurant Independent\n                Pub, in Brinsworth Cask Ale not available Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens at 12:00pm Yorkshire Terrier Pub, in Brinsworth 1\n                            Regular,\n                                                                            1 Changing\n                                                Beers Beer score Trip Favourites Want to visit Visited You have visited this venue View all visits Closed • Opens in 49 minutes Waverley Waverley Inns\n                Pub, in Catcliffe 1 Changing\n                                                Beer Love Cask Beer? Join CAMRA to support the campaign to access more features plus access to a range\n                            of different benefits. Become a member CAMRA - Campaign for Real Ale logo Campaign for Real Ale Whether you're already a CAMRA member, are thinking of joining, have any queries buying a\n                        product or supporting our campaigns,\n                        please visit our FAQs and contact page for more\n                        information. Browse Join CAMRA About Visit Pubs & Clubs Take Action Events Breweries Beers Learn & Discover Shop Privacy Policy Accessibility Statement Articles of Association Cookie Policy Manage cookies Terms & Conditions Discourse What's Brewing Branch Support If you’re looking to reach out to your local branch, you can find the best\n                        contact here . Feedback and complaints If you would like to give CAMRA feedback or make a complaint this can be\n                        done here . If you would like to feedback about this website please visit here . © Campaign for Real Ale 2023 - 2025 (ce-10) Facebook Twitter Instagram Youtube Home Search Pubs TasteMatch Account Privacy Overview We use cookies, which are small text files, to improve your experience on our website and to show you personalised content. You can allow all or manage them individually. Accept all Cookies Necessary Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-Necessary (Analytics) Disabled These cookies help us to improve your web experience. They allow us to gather feedback on your behaviour and to show adverts relevant to you. You can turn this off here. Save and close Cookies We use cookies, which are small text files, to improve your experience on our website and to show you personalised content. You can allow all or manage them individually. Accept all Cookies Manage ​ Close modal"
    },
    {
      "url": "https://www.grandelakes.com/dining/the-ritz-carlton",
      "text": "Bars and Lounges in Orlando FL | Grande Lakes Orlando Skip to main content Menu Accommodations Offers Dining Meetings & Weddings Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Experiences Gallery Our Resort Book Your Stay Call reservation booking widget Close Close Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Book your stay. booking widget - booking widget Select Hotel Please Select The Ritz-Carlton JW Marriott The Residences ARRIVAL Departure Rooms 1 2 3 4 5 6 Guest 1 2 3 4 5 6 book youR STAY Video Features Pause Play Sound On Sound Off Video Description Indulge in a culinary journey at The Ritz-Carlton, Orlando, Grande Lakes. This video highlights our exquisite dining experiences, from artfully crafted dishes to stunning restaurant settings. The camera zooms on the mixologist curating handcrafted drinks. Explore diverse flavors, impeccable service, and the perfect blend of innovation and tradition, all set against the backdrop of our serene and luxurious resort. Close Modal View Full Video The Ritz-Carlton View Menu The Ritz-Carlton JW Marriott Home Dining The Ritz-Carlton A Fresh Take On Fine Dining Experience an exquisite culinary journey at The Ritz-Carlton. Our eclectic menus, ranging from upscale steakhouse and seafood cuisine to authentic Southern dishes, will surely delight epicurean connoisseurs. We proudly spotlight our sustainability pledge at Whisper Creek Farm, our very own farm, garden, and apiary, which supplies fresh, local produce to our restaurants and bars. Culinary Masters 23 October Thursday 6:00pm - 10:00pm Knife & Spoon Experience a five-course dinner crafted by MICHELIN-recognized chefs, perfectly paired with selections from a world-renowned winemaker and guided by a member of the Court of Master Sommeliers. Reserve for Culinary Masters Learn More of Culinary Masters Go to previous slide Go to next slide Knife & Spoon Dive into a world of exquisite flavors at our signature steak & seafood restaurant, masterfully curated and helmed by the renowned Chef John Tesar. Our restaurant's quality and excellence have been recognized with a MICHELIN star in 2022 and 2023, a testament to our relentless commitment to delivering a superior dining experience. RESERVE for Knife & Spoon Group Dining about Knife & Spoon Website about Knife & Spoon Menu about Knife & Spoon 3D Tour about Knife & Spoon Location: Lobby level Dress Code: Smart Casual 5:30 pm - 11:00 pm Go to previous slide Go to next slide Go to previous slide Go to next slide Lobby Lounge Experience a relaxed yet sophisticated setting ideal for sipping on a cocktail or indulging in our meticulously crafted light fare menu, all while taking in the stunning views of our gardens, lakes, and golf course. Location: Lobby level Dress Code: Casual Sunday - Thursday 4:00 pm - 12:00 am Friday - Saturday 4:00 pm - 1:00 am Menu for Lobby Lounge 3D Tour of Lobby Lounge Go to previous slide Go to next slide Bleu Find a cool retreat at our poolside alfresco restaurant. Treat yourself to our juicy burgers or fresh seafood, or keep it light with our crisp salads. To cool off, try our tropical frozen drinks, made with the freshest ingredients for the ultimate refreshment. Location: Poolside Dress Code: Beach attire Monday - Sunday: 11:00 am - 6:00 pm Menu for Bleu 3D Tour of Bleu Highball & Harvest Highball & Harvest pays homage to Florida's vibrant agricultural legacy, carved by the railroad era in the 1800s, by serving farm-fresh meals with ingredients from our on-site Whisper Creek Farm. The menu boasts authentic Southern fare accompanied by artisanal cocktails crafted by master mixologists. RESERVE for Highball & Harvest Group Dining about Highball & Harvest website about Highball & Harvest Menu about Highball & Harvest 3D Tour about Highball & Harvest Location: Ground level Dress Code: Casual Breakfast: 7:00 am - 11:00 am Lunch: 11:30 am - 2:30 pm Bar Bites: 2:30 pm - 10:00 pm Dinner: 5:30 pm - 10:00 pm Go to previous slide Go to next slide Go to previous slide Go to next slide Vitale, Spa Café Give your body the VIP treatment it deserves at Vitale. Refuel after a rigorous workout or soothing spa treatment with our health-centric menu. Our range of vibrant salads, revitalizing drinks, and smoothies are tailored to replenish your body and enhance your well-being. Location: Spa ground level Dress Code: Casual Monday - Friday: 11:00 am - 4:00 pm Saturday - Sunday: 11:00 am - 5:00 pm Menu for Vitale, Spa Café 3D Tour of Vitale, Spa Café Go to previous slide Go to next slide Fairways Pub Wind down your day at the links with Fairways Pub's exceptional clubhouse fare and a vast selection of crafted microbrews and draught beer. The pub overlooks the 18th hole and the resort, offering a breathtaking view as you enjoy your meal. Location: Golf Clubhouse Dress Code: Casual Lunch | 11:00 am - 4:00 pm Bar | 7:00 am - 5:00 pm Bunker Bar | 9:00 am - 4:00 pm *Hours are subject to change daily based on rounds and business-level needs Menu for Fairways Pub 3D Tour of Fairways Pub Go to previous slide Go to next slide first drop Step into First Drop for a genuine artisanal beverage experience. Delight in our freshly brewed drip coffee complemented with curated small bites. Our offerings range from breakfast and lunch sandwiches, to salads, pastries, candy, and snacks. Location: Lobby level Dress Code: Casual Sunday - Thursday: 6:00 am - 6:00 pm Friday - Saturday: 6:00 am - 7:00 pm 3D Tour for first drop Marriott Grande Lakes 4040 Central Florida Parkway, Orlando, Florida 32837 The Ritz-Carlton: facebook instagram JW Marriott: facebook instagram Sign Up For Exclusive Email Offers Event Calendar - TRC Events Calendar - JW FAQs Destination Press Directions Donations The Ritz-Carlton The Ritz-Carlton - Dining - The Ritz-Carlton 888-707-9325 JW Marriott The Ritz-Carlton - Dining - JW Marriott 800-433-5402 Copyright © 1996 - 2025 Marriott International, Inc. All rights reserved. Company Proprietary Information Powered by MDS Privacy Center Terms of Use Accessibility The Ritz-Carlton JW Marriott Site Map Your Privacy Rights Close Menu Marriott Grande Lakes, 4040 Central Florida Parkway, Orlando Florida Call Accommodations The Ritz-Carlton JW Marriott Luxury Residences JW Marriott Renovation The Ritz Carlton Club Offers The Ritz-Carlton JW Marriott Dining The Ritz-Carlton JW Marriott Experiences Events/Activities Waterpark Pools Cabanas Spa Golf Grand Lakes Sports Ritz Kids Itineraries Shopping Meetings & Weddings Overview Start Planning Gallery Our Resort Destination Resort Map Conservation Local Attractions Press & Media Destination Universal Orlando Resort Partnership Event Calendar - TRC Events Calendar - JW FAQs Close Close Menu The Ritz-Carlton The Ritz-Carlton - Dining - The Ritz-Carlton 888-707-9325 JW Marriott The Ritz-Carlton - Dining - JW Marriott 800-433-5402"
    }
  ]
}