{
  "fuentes": [
    {
      "url": "https://www.graytonbeer.com",
      "email": "aspen@allbad.com"
    },
    {
      "url": "https://www.graytonbeer.com",
      "email": "aspen@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com",
      "email": "info@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/team",
      "email": "aspen@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/team",
      "email": "info@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/events",
      "email": "aspen@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/events",
      "email": "info@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/contact",
      "email": "aspen@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/contact",
      "email": "info@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/shop/p/godzillashirt",
      "email": "aspen@graytonbeer.com"
    },
    {
      "url": "https://www.graytonbeer.com/shop/p/godzillashirt",
      "email": "info@graytonbeer.com"
    },
    {
      "url": "https://www.thedestinlog.com/story/business/2019/10/13/grayton-beer-company-marketing-director-helps-set-tone-for-business/2540839007/",
      "email": "aadame@nwfdailynews.com"
    },
    {
      "url": "https://www.visitsouthwalton.com/listing/grayton-beer-taproom/",
      "email": "info@graytonbeer.com"
    }
  ],
  "mails": [
    "aadame@nwfdailynews.com",
    "aspen@allbad.com",
    "aspen@graytonbeer.com",
    "info@graytonbeer.com"
  ],
  "nombre_sitio": "graytonbeer.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.graytonbeer.com",
      "text": "Grayton Beer Company | Craft Brewery in Grayton Beach, FL 0 Skip to Content EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION TAPROOM IS CLOSED UNTIL FREEPORT LOCATION OPENS! TAPROOM IS CLOSED UNTIL FREEPORT LOCATION OPENS! TAPROOM IS CLOSED UNTIL FREEPORT LOCATION OPENS! 217 Serenoa Rd, Santa Rosa Beach, FL 32459  • 850.231.4786 General info@graytonbeer.com • Events aspen@graytonbeer.com Email Address Sign Me Up! Thank you! Take 10% our merch with code: WELCOME10"
    },
    {
      "url": "https://www.graytonbeer.com/team",
      "text": "Team — Grayton Beer Co. 0 Skip to Content EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Andrew Johnson - CEO Andrew has worked in the beer industry for well over 20 years, spending the last 8 with Grayton Beer Company. With a love for the outdoors and deep appreciation for craftsmanship, it’s no surprise he ended up on the Emerald Coast, overseeing the production, branding and creative team at GBC. Andrew’s role of Chief Executive Officer requires oversight and direction in operations of the production facility, sales, brewing, distribution, and warehouse management. When not at the brewery, You will find Andrew on his vintage Harley, wood-working, or spending time with his two wonderful children and English Setter. His love and appreciation of vintage finds lends a hand to the well curated atmosphere around the workplace. Josh Gauger- Director of Brewing Operations Josh was born and raised in Watsontown, Pennsylvania where he  attended Slippery Rock University, graduating with a degree in physics. A passion for people, beer and craftsmanship drove Josh into the brewing industry. He then joined Grayton Beer in 2015. He started as an assistant brewer in his home town then worked his way up and has since been brewing for over 13 years. Josh spent his years as a brewer honing and perfecting our family of beers and leading the team that makes them. He is now our Director of Brewing Operations, running the lab, quality assurance, raw materials procurement, R&D, and keeping a steady eye on the bright future of Grayton Beer Company. Ryan Trumpfheller - Lead Brewer A true master of his craft, Ryan brings a decade of brewing experience to Grayton Beer Company. Born and raised in Dallas, TX, he began his journey in 2015, quickly developing a passion for the art of brewing. In 2018, he moved to Grayton where he has since taken on the pivotal role of Lead Brewer. Ryan is the creative force behind many of our signature beers, meticulously developing recipes that balance innovation and tradition. He hand-selects our raw materials, ensuring each batch meets the highest standards. Outside of the brewery, Ryan enjoys cycling along local trails, exploring new travel destinations with his wife Mallory, and relaxing at home with their beloved bunny Nala. His commitment to discovery, both in brewing and life, is what sets Ryan apart as a true leader in the craft beer world Zach Thomas- Packaging/Warehouse Manager A pivotal part of Grayton Beer Company, Zach has been expertly managing packaging and logistics since joining the team in 2016.  With 8 years of experience, Zach has become the backbone of our packaging and warehouse operations. He oversees every aspect of logistics, from coordinating shipping and receiving to leading the production line, ensuring that our beers are flawlessly canned, bottled, and delivered. Whether it’s managing a complex production schedule or troubleshooting challenges on the floor, Zach ensures everything runs like clockwork. Outside the brewery, Zach is all about family. He enjoys spending time with his wife and two young daughters. When he’s not with them, you can find him perfecting his barbecue skills. ASPEN MANSFIELD - CMO As Chief Marketing Officer of Grayton Beer Company, Aspen Mansfield oversees all aspects of brand development, marketing strategy, and visual identity. She plays a key role in shaping the company’s public image, driving market growth, and ensuring consistency across campaigns and product lines. With a strong foundation in creative direction, digital content, and experiential marketing, Aspen brings both vision and execution to the forefront of Grayton’s continued expansion. When she’s not at Grayton, you can find her teaching Pilates or working on mid-century modern interior design projects, often with her dachshund Lou by her side and a strong iced espresso in hand. Matt Bruce Director of Sales Account Relations Ethan Reis Brewer/Cellarman TJ Carroll Taproom Bartender Jelani Hyman Grayton Supreme Chef Stewart Strickland Production / Full Time Sarah Clendenen Production/ Full Time Matthew Warner Production / Part Time Gregory Brown Production/ Part Time Mark Jones Production/ Part Time 217 Serenoa Rd, Santa Rosa Beach, FL 32459  • 850.231.4786 General info@graytonbeer.com • Events aspen@graytonbeer.com Email Address Sign Me Up! Thank you! Take 10% our merch with code: WELCOME10"
    },
    {
      "url": "https://www.graytonbeer.com/events",
      "text": "Grayton Beer Events — Grayton Beer Co. 0 Skip to Content EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION PURCHASE TICKETS!! Book Your Private Event Or Show Below Name * First Name Last Name Email * Subject * Message * We will get back to you shortly! 217 Serenoa Rd, Santa Rosa Beach, FL 32459  • 850.231.4786 General info@graytonbeer.com • Events aspen@graytonbeer.com Email Address Sign Me Up! Thank you! Take 10% our merch with code: WELCOME10"
    },
    {
      "url": "https://www.graytonbeer.com/contact",
      "text": "Contact — Grayton Beer Co. 0 Skip to Content EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Contact Us General Inquires- info@graytonbeer.com                                                                             Events & Media- aspen@graytonbeer.com WE are moving to a new location. Stay tuned for more exciting news aout this! Our taproom is closed until our new location in Freeport is open! Phone (850) 399-7007 Facebook Instagram 217 Serenoa Rd, Santa Rosa Beach, FL 32459  • 850.231.4786 General info@graytonbeer.com • Events aspen@graytonbeer.com Email Address Sign Me Up! Thank you! Take 10% our merch with code: WELCOME10"
    },
    {
      "url": "https://www.graytonbeer.com/shop/p/godzillashirt",
      "text": "Grayton Beer Company Godzilla Shirt — Grayton Beer Co. 0 Skip to Content EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION Open Menu Close Menu EVENTS SHOP BEER TEAM TAPROOM CONTACT DISTRIBUTION SHOP › Godzilla Shirt Image 1 of 3 Image 2 of 3 Image 3 of 3 Godzilla Shirt $29.00 Our barrel-aged baltic porter is now printed on cotton. Go Go Godzilla! Size: Select Size Small Medium Large 2XL Quantity: Add To Cart Added! Our barrel-aged baltic porter is now printed on cotton. Go Go Godzilla! 217 Serenoa Rd, Santa Rosa Beach, FL 32459  • 850.231.4786 General info@graytonbeer.com • Events aspen@graytonbeer.com Email Address Sign Me Up! Thank you! Take 10% our merch with code: WELCOME10"
    },
    {
      "url": "https://www.thedestinlog.com/story/business/2019/10/13/grayton-beer-company-marketing-director-helps-set-tone-for-business/2540839007/",
      "text": "Grayton Beer Company's Blaich is marketing whiz News Sports Entertainment Lifestyle USA TODAY Obituaries eNewspaper Legals Subscribe BUSINESS Grayton Beer Company's Blaich is marketing whiz Tony Adame | 850-315-4440 | aadame@nwfdailynews.com SANTA ROSA BEACH – Grayton Beer Company owner Jamey Price spreads his arms far apart to explain how his business works. His right hand represents the brewing and manufacturing wing of their award-winning beer. His left hand represents his company’s sales wing. “So you have this one thing over here and one thing over here,” said Price, gesturing to either hand. “We can make great beer all day long and send out sales people going door-to-door to sell it all day long, but you need to have someone who can connect those two things. For us, that’s Chelsea. She’s the one that makes that connection for us.” Price is talking about Marketing Director Chelsea Blaich, who has been with Grayton for two years and is also closing in on the end of her yearlong stint as president of the Young Professionals of Walton County. Blaich’s job, in her own words, is to “have all the answers” for anything and everything to do with Grayton, which has a 30,000 square-foot brewery (217 Serenoa Road) and a Brewpub (170 E. County Highway 30A) in Santa Rosa Beach. Grayton was founded in 2011, and the Brewpub opened in April 2018. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. The main facility in Santa Rosa Beach really is something to behold – a beer lover’s paradise, to put it lightly. Visitors step into a world of large, silver tanks stretching up to the ceiling that seem like high-rise buildings. There’s also a taproom with expansive seating that can also be converted to use for events, including concerts or wedding receptions. Walking through Grayton’s office, it’s not hard to tell what kind of trajectory the company is on, with the walls dedicated to pictures signed by some of the musical acts and celebrities to come through, including country star Jason Isbell. “One of the cool things about being here is the look on people’s faces when they walk in (to the brewery) for the first time,” Blaich said. “It really is jaw-dropping.” Blaich, a Panama City native, earned her Business Administration degree from Huntington (Ala.) College. After college, she worked for the Walton County Tourist Development Council before spending four years with Proffit PR out of Miramar Beach, where Blaich lives with her husband, Chase. Price created the marketing director position at Grayton specifically for Blaich. “My favorite thing to tell people is that I went from working with women in all heels to bearded, manly dudes brewing beer, which is a bit more relaxed vibe,” Blaich said. “The thing about (Grayton) is that the effort these guys put into their product and what they’re putting out is really something to admire. “It made me really want to sink my teeth into the job, and for the size we are and the production now that we have, where we’ve grown to selling in six states, is an impressive feat for a small, family-owned brewery. And I think that’s what makes it special.” Blaich’s role at Grayton is all-encompassing, and includes everything from social media to community outreach. Last week, Grayton made a big splash on the national scene with a silver medal in the Red/Amber American Ale at the Great American Beer Festival, perhaps the most elite beer competition in the world and one that draws over 60,000 visitors to Denver every year. “(Blaich) handles everything, from marketing demands in print and social media to PR,” Price said. “She’s the one that is the support system for the team that’s out there selling beer in order to get us more points of distribution … I can’t say it enough, but she really is a phenomenal asset.” Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Licensing & Reprints Help Center Manage Account Give Feedback My Print Account Subscribe Today Newsletters Facebook X eNewspaper Jobs Real Estate Classifieds Shopping 10BEST LocaliQ © 2025 www.thedestinlog.com. All rights reserved."
    },
    {
      "url": "https://www.visitsouthwalton.com/listing/grayton-beer-taproom/",
      "text": "Grayton Beer Taproom - Visit South Walton, FL Skip to main content x Neighborhoods All Neighborhoods Miramar Beach Seascape Sandestin Dune Allen Gulf Place Santa Rosa Beach Blue Mountain Beach Grayton Beach WaterColor Seaside Seagrove WaterSound Seacrest Alys Beach Rosemary Beach Inlet Beach Plan Your Trip Start Planning Your Trip Beach Safety Visitor Center Newsletter Signup Plan Your Trip Trip Ideas Travel Guides Getting Here Beach and Bay Access Locations Things To Do Arts & Culture Concierge Dining Entertainment Events Golf Outdoors & Nature Shopping Spa & Fitness Transportation Water Activities Explore Authentic Walton All Things To Do Culinary Stay 81 Perfect Awards Beach Safety Beach Access Meetings Weddings Store Events Travel Guides Perfect Awards Beach Safety Beach Access Meetings Weddings Store Events Travel Guides Search the Site explore our beach Neighborhoods Explore our Neighborhoods Our 16 distinct beach neighborhoods offer variety to suit any vision of the ideal getaway. Explore Neighborhoods Miramar Beach Seascape Sandestin Dune Allen Gulf Place Santa Rosa Beach Blue Mountain Beach Grayton Beach WaterColor Seaside Seagrove WaterSound Seacrest Alys Beach Rosemary Beach Inlet Beach plan your Trip Step Away And Get Closer Experience the warmth of family moments on the sun-kissed shores of South Walton, Florida. Whether you’re lounging on the beach or building sand castles, creating lifelong memories feels effortless here. Explore More Videos Beach Safety Ensure a fun-filled experience for all. Visitor Center Pop in to learn more. Newsletter Signup Get the latest from South Walton. Plan Your Trip There's a perfect trip for everyone. Find yours here. Trip Ideas Find suggestions for the perfect trip. Travel Guides Order or download our travel guides and start planning. Getting Here Traveling here is a breeze. Beach and Bay Access Locations Put your feet in the sand. things to Do Millions of Moments to Remember Part of South Walton’s charm is its ability to provide each visitor with a personalized yet communal experience, appealing to all generations. Read More Arts & Culture Concierge Dining Entertainment Events Golf Outdoors & Nature Shopping Spa & Fitness Transportation Water Activities Explore Authentic Walton Culinary Stay 81 = Grayton Beer Taproom Description Grayton Beer Company’s Taproom is located in our 30,000 square-foot, state-of-the-art production facility in Santa Rosa Beach, Florida. The open-air, industrial space provides a beautiful backdrop for one-of-a-kind events. With a tap wall of 20+ unique beers, an open floor plan, intimate string lighting and a stage, this is the perfect space to throw a party. Grayton Beer Company's Taproom can accommodate up to 300 guests, making it one of the largest indoor event facilities in South Walton. Amenities Max Capacity : 300 Address 217 Serenoa Rd Santa Rosa Beach, FL 32459 Contact info@graytonbeer.com (850) 231-4786 Visit Website 1 /7 Directions to Grayton Beer Taproom Explore Santa Rosa Beach Santa Rosa Beach is the spot for those who can’t get enough of everything South Walton offers. Variety is at the heart of this beach neighborhood – lush parks, sugar-white sand, craft breweries and amazing eats - and it was recently named one of Travel + Leisure’s Top 5 Favorite Towns in America. Check It Out Contact Press & Media Perfect Awards Partners Artist of the Year Beach Safety 81 Get a Visitor Guide Sign Up For Our eNewsletter Facebook Created with Sketch. Instagram Created with Sketch. Youtube Created with Sketch. Pinterest Created with Sketch. 25777 US Highway 331 South Santa Rosa Beach, Florida 32459 (800) 822-6877 or (850) 267-1216 Privacy & Terms of Use GDPR FAQ © Copyright 2025 Walton County TDC, All rights reserved. Visit South Walton uses cookies and related technologies to improve the way our site functions for you as a visitor. Read More A cookie is a text file that is stored on your device. We use these text files for functionality such as to analyze our traffic or to personalize content. You can choose to accept or discontinue cookies for this site and you may also review our policies at any time by visiting our privacy policy page . Remember, if you choose to disable or delete cookies and/or select \"Discontinue\", you will not have access to the full functionality of our website. Accept Discontinue"
    }
  ]
}