{
  "fuentes": [
    {
      "url": "https://news.wgcu.org/section/business/2024-03-03/great-wolf-lodge-general-manager-lays-out-the-water-resorts-details-in-advance-of-september-opening",
      "email": "wgcumain@fgcu.edu"
    },
    {
      "url": "https://www.orlandosentinel.com/2024/11/06/great-wolf-lodge-naples-florida-first-indoor-water-park-open/",
      "email": "pconnolly@orlandosentinel.com"
    },
    {
      "url": "https://www.greatwolf.com/ppc",
      "email": "ppc@greatwolf.com"
    },
    {
      "url": "https://www.greatwolf.com/ppc",
      "email": "u003eppc@greatwolf.com"
    }
  ],
  "mails": [
    "pconnolly@orlandosentinel.com",
    "ppc@greatwolf.com",
    "u003eppc@greatwolf.com",
    "wgcumain@fgcu.edu"
  ],
  "nombre_sitio": "greatwolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://news.wgcu.org/section/business/2024-03-03/great-wolf-lodge-general-manager-lays-out-the-water-resorts-details-in-advance-of-september-opening",
      "text": "Great Wolf Lodge general manager lays out the water resort's details in advance of September opening | WGCU PBS & NPR for Southwest Florida Search Query Show Search LIVE TV Schedules TV Schedules Radio Schedules TV Schedules Radio Schedules News Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Listen WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs Watch Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Education For Educators For Parents Watch PBS Kids For Educators For Parents Watch PBS Kids Events WAYS TO GIVE Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Member Login WGCU Member Login PBS Passport Login WGCU Member Login PBS Passport Login © 2025 WGCU News Menu PBS and NPR for Southwest Florida Show Search Search Query LIVE TV Donate Play Live Radio Next Up: 0:00 0:00 0:00 0:00 Available On Air Stations On Air Now Playing WGCU-FM News Stream On Air Now Playing WGCU-FM Classical On Air Now Playing WGCU Beacon All Streams Schedules TV Schedules Radio Schedules TV Schedules Radio Schedules News Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Arts & Culture Business/Economy Crime Culture & Connections Education Environment Government & Politics Gulf Coast Life Health Hurricane Recovery Immigration Science & Tech Southwest Florida In Focus News Sports Water Quality Report Weather Page Beacon Listen WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs WGCU-FM Live WGCU Classical Gulf Coast Life Gulf Coast Life Arts Edition Gulf Coast Life Book Club Three Song Stories The Last Ride With the Wild Things Ye Gods All Radio Programs Watch Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Live TV Video On Demand PBS Passport Southwest Florida In Focus News WGCU YouTube Channel WGCU News YouTube The Florida Channel Education For Educators For Parents Watch PBS Kids For Educators For Parents Watch PBS Kids Events WAYS TO GIVE Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Membership Renew Your Membership Major Giving Planned Giving Strategic Campaign Corporate Sponsorship Member Login WGCU Member Login PBS Passport Login WGCU Member Login PBS Passport Login Business/Economy Great Wolf Lodge general manager lays out the water resort's details in advance of September opening WGCU Published March 3, 2024 at 9:59 PM EST Facebook LinkedIn Email Print File / Special to WGCU A big-name water park is finally opening its doors in Collier County later this year. Southwest Florida Business Today Publisher Karen Moore recently heard the details at a Southwest Florida commercial real estate conference. We’ve been hearing about this Great Wolf Lodge attraction coming to Collier County for a few years now. Recently, General Manager Jason Bays gave some details about this new tourist attraction and provided some background on the project. \"We were looking for land in Florida for a very long time, about a decade, looking for development planning areas that we could develop... This will be our 21st lodge in our portfolio. We're owned by Blackstone, a private equity firm and they bought us in 2019 for about $2.6 billion,\" he said. Bays then described more about the all-indoors water park which will have 500 hotel rooms, and entertainment features with names like Ten Paw Alley and MagiQuest. \"So our waterpark, 84-degrees year round, it’s about the size of two football fields. So 93,000 square feet in there. And...it's weather-proof,\" he said. \"In addition to the water park, we'll also have a 61,000 square foot Game Board Adventure Center as well. That's gonna provide a lot of different fun attractions for our for our guests to enjoy too,\" Bays said. \"We will have five restaurants onsite that are also open to the public that are going to be highly immersive themed attractions.\" Bays also said that the Great Wolf Lodge will have a major impact on Collier County’s economy. \"Collier County did a study on the economic impact of the Great Wolf Lodge over a 30-year-period,\" he explained. \"And it showed Great Wolf will have a $5 billion impact over the next 30 years on the county with the spending and economic impact.\" Mays said the lodge will have over 100 suites that will be specific to multigenerational families. “ I wanna share that at Great Wolf, there's a couple of things that we're going to do. I’ve met with every single high school principal ... in Collier County. We're going to set up workforce development (and) on-the-job training. We will build relationships so that we can provide not just jobs, not just full-time jobs, but career paths and career growth,” he said. “And I'll share that one of the most critical things that we're going to be able to do is have some really great pack members who are ready to bring joy to families.” Mays continued speaking about the project in wolf terms, where the term pack members refers to employees. “The South Florida project will be about a $275 million investment and we'll have about 600-700 pack members. So everyone here will be talking the wolf language after today,” he said The grand opening for Great Wolf Lodge is planned for September 2024. Karen Moore is a contributing partner for WGCU and the publisher of SWFL Business Today . Tags Business/Economy WGCU News Moore About Business Collier County Facebook LinkedIn Email Print Latest Stories Trump blames rhetoric from the left for political violence after Charlie Kirk murder Government & Politics Florida congressman and governor candidate Byron Donalds faces rampant ridicule after Epstein birthday book gaffe Charlie Kirk, a Trump ally and voice for young conservatives, dies at age 31 In 2024, COVID dropped from the list of top 10 causes of death in U.S. Right-wing activist Charlie Kirk fatally shot at speaking event in Utah Israel's attacks on Hamas in Qatar stun the Gulf and dash chances for a Gaza ceasefire Stay Connected twitter instagram youtube facebook linkedin © 2025 WGCU News Make a Donation Become a Member Major Giving Corporate Sponsor Donate Your Car or Boat About WGCU Staff Directory Careers FCC Public Files Privacy Policy CALL: 239-590-2300 EMAIL: wgcumain@fgcu.edu Directions & Parking Member Login Sign Up for Emails"
    },
    {
      "url": "https://www.orlandosentinel.com/2024/11/06/great-wolf-lodge-naples-florida-first-indoor-water-park-open/",
      "text": "Great Wolf Lodge: Florida's first indoor water park now open Skip to content All Sections Subscribe Now 76°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Home Page Daily e-Edition Evening e-Edition News News Latest Headlines Politics Education National News Local News Local News Lake County Orange County Osceola County Seminole County Health Health Medicare Sports Sports High School Sports UCF Knights Orlando Magic Mike Bianchi Commentary Florida Gators Business Business Tourism Economy Real Estate GrowthSpotter Consumer Reviews Weather Weather Conditions and Forecasts Hurricanes Hurricane preparedness Hurricane Tracks Opinion Opinion Letters to the Editor Scott Maxwell Commentary Editorials Endorsements Entertainment Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Events Travel Travel Theme Parks Epic Universe Explore Florida Cruises Florida & Caribbean Experiences Obituaries Obituaries News Obituaries Place an Obituary Branded Content Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classifieds Services About the Orlando Sentinel Manage Subscription Subscriber Benefits Sign up for Newsletters Buy an advertisement Sign up for email newsletters Sign Up Theme Parks | Great Wolf Lodge: Florida’s first indoor water… Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Subscribe Login Account Settings Contact Us Log Out Spoof a user Sign up for email newsletters Sign Up Subscribe Login Search 76°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Theme Parks Travel Theme Parks Epic Universe Explore Florida Cruises Florida & Caribbean Experiences Trending: ☹️ Ticked off! 🚀 Launch schedule 🔍 Restaurant Inspections 🏠 Homeless Camping Ban 💻 Donate to Sentinel News Fund ❓🧔🏾‍♂️❓Read Asking Eric Breaking News Conservative activist Charlie Kirk assassinated at Utah university Things To Do Theme Parks Great Wolf Lodge: Florida’s first indoor water park is now open Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X The indoor water park is the focal point of any Great Wolf Lodge resort, including the new one now open in Naples. (Courtesy Great Wolf Lodge) By Patrick Connolly | pconnolly@orlandosentinel.com | Orlando Sentinel UPDATED: November 6, 2024 at 10:07 AM EST Great Wolf Lodge’s newest location lands in Naples with a 92,000-square-foot water park, a 62,000-square-foot adventure park and a 500-room resort, altogether providing more than 500,000 square feet of inside space for escaping the elements. Subscribe to continue reading this article. Already subscribed? To log in, click here. Originally Published: November 6, 2024 at 10:00 AM EST Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X RevContent Feed Most Popular Most Popular Orange schools to reassign over 100 school teachers amid enrollment drops Orange schools to reassign over 100 school teachers amid enrollment drops 7 Central Florida restaurants shut down last week 7 Central Florida restaurants shut down last week DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida Conservative activist Charlie Kirk assassinated at Utah university Conservative activist Charlie Kirk assassinated at Utah university Florida’s ban on open carry of guns is unconstitutional, appeals court rules Florida’s ban on open carry of guns is unconstitutional, appeals court rules TV, kickoff time set for UCF’s home game vs. Bill Belichick and North Carolina TV, kickoff time set for UCF’s home game vs. Bill Belichick and North Carolina UCF offensive line coach Shawn Clark hospitalized for medical emergency UCF offensive line coach Shawn Clark hospitalized for medical emergency Miss Manners: This evil woman will be at the funeral, and I need to know my options Miss Manners: This evil woman will be at the funeral, and I need to know my options Bianchi: Why losing its biggest investor could be the best thing for Orlando’s baseball dream Bianchi: Why losing its biggest investor could be the best thing for Orlando's baseball dream Universal nabs 5 Golden Tickets: 4 for Epic, 1 for Volcano Bay Universal nabs 5 Golden Tickets: 4 for Epic, 1 for Volcano Bay More in Theme Parks Imagineering show digs into details of Disney castles Legoland Florida passes good for rest of ’25, all of ’26 Universal nabs 5 Golden Tickets: 4 for Epic, 1 for Volcano Bay Selena Gomez joins lineup at Madame Tussauds Orlando 2024 November 6 Tribune Publishing Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News South Florida Sun-Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company Info Archives Contact Us at the Orlando Sentinel Community News Fund Careers Manage Account Newsletters Daily e-Edition Evening Edition Help Advertise with Us Place an Ad Auto Listings Find a Job About the Orlando Sentinel Photo requests, reprints Send us a News Tip Subscriber Services & Help Site Map Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Policy Cookie Preferences CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Orlando Sentinel Close"
    },
    {
      "url": "https://www.greatwolf.com/ppc",
      "text": "Preferred Pack Member | Great Wolf Lodge Skip Content Choose Your Lodge Great Wolf Resorts West Anaheim, CA Colorado Springs, CO Grand Mound, WA San Francisco /  Manteca, CA Scottsdale / Salt River, AZ South Atlanta / LaGrange, GA Charlotte / Concord, NC Dallas / Grapevine, TX Houston / Webster, TX Naples, FL Williamsburg, VA Midwest Chicago / Gurnee, IL Cincinnati / Mason, OH Kansas City, KS Minneapolis / Bloomington, MN Sandusky, OH Traverse City, MI Wisconsin Dells, WI Northeast Baltimore / Perryville, MD Boston / Fitchburg, MA Mashantucket, CT Pocono Mountains, PA Canada Niagara Falls, Ontario, CA Great Wolf Resorts Choose Your Destination West Anaheim, CA Colorado Springs, CO Grand Mound, WA San Francisco /  Manteca, CA Scottsdale / Salt River, AZ South Atlanta / LaGrange, GA Charlotte / Concord, NC Dallas / Grapevine, TX Houston / Webster, TX Naples, FL Williamsburg, VA Midwest Chicago / Gurnee, IL Cincinnati / Mason, OH Kansas City, KS Minneapolis / Bloomington, MN Sandusky, OH Traverse City, MI Wisconsin Dells, WI Northeast Baltimore / Perryville, MD Boston / Fitchburg, MA Mashantucket, CT Pocono Mountains, PA Canada Niagara Falls, Ontario, CA PREFERRED PACK CLUB ENJOY UP TO 30% OFF The Great Wolf Lodge Preferred Pack Club (PPC) program is our affiliate, employee/member discount program that we offer to businesses and organizations across North America. This program offers discounted rates for qualified employees or members of an organization to stay at any of our Great Wolf Lodge locations across North America for up to 30% off. Ready To Apply? Ready To Apply? Get in touch with a sales professional for detailed information. Apply Here Frequently Asked Questions What is the Preferred Pack Club Program (PPC)? Our PPC, Preferred Pack Club, program is the employee/member discount program that we offer to businesses/associations as a perk to employees/members to stay at any Great Wolf Lodge across the United States of America and Canada for up to 30% off. How do I apply to have my company/organization to be a part of the Great Wolf Preferred Pack Club (PPC)? Go to the “Request More Information” tab and fill out the required field. Someone from our team will follow up with you and provide you additional details about the program. What sort of discount will my company get by being a part of this program? Up to 30% off our best available rate. What lodges can I use this discount at? All of our Great Wolf Resort properties across Canada and the USA. If I have any questions, who do I reach out to? You can email any questions you have to [email protected] JUMP IN THE RESORT AMENITIES With our massive indoor water park, amazing attractions, complimentary daily events and activities, and delicious dining options, there’s no shortage of ways to play. Choose Your Lodge Water Park Access Sliding & splashing fun for the whole pack Various Attractions Exciting attractions for everyone Delicious Dining Options Fresh food for every appetite Entertainment Free and fun daily family events Water Park Access Sliding & splashing fun for the whole pack Various Attractions Exciting attractions for everyone Delicious Dining Options Fresh food for every appetite Entertainment Free and fun daily family events FIND YOUR LODGE Great Wolf Lodge is North America's largest family of indoor water park resorts. With over 20 lodges (and more on the way), you're only a short drive away from adventure. Find Your Lodge Grand Mound, WA Grand Mound, WA Grand Mound, WA Boston / Fitchburg, MA Boston / Fitchburg, MA Boston / Fitchburg, MA Traverse City, MI Traverse City, MI Traverse City, MI Minneapolis / Bloomington, MN Minneapolis / Bloomington, MN Minneapolis / Bloomington, MN Niagara Falls, Ontario, CA Niagara Falls, Ontario, CA Niagara Falls, Ontario, CA Mashantucket, CT Mashantucket, CT Mashantucket, CT Wisconsin Dells, WI Wisconsin Dells, WI Wisconsin Dells, WI Pocono Mountains, PA Pocono Mountains, PA Pocono Mountains, PA Chicago / Gurnee, IL Chicago / Gurnee, IL Chicago / Gurnee, IL Sandusky, OH Sandusky, OH Sandusky, OH Baltimore / Perryville, MD Baltimore / Perryville, MD Baltimore / Perryville, MD San Francisco /  Manteca, CA San Francisco /  Manteca, CA San Francisco /  Manteca, CA Cincinnati / Mason, OH Cincinnati / Mason, OH Cincinnati / Mason, OH Colorado Springs, CO Colorado Springs, CO Colorado Springs, CO Kansas City, KS Kansas City, KS Kansas City, KS Williamsburg, VA Williamsburg, VA Williamsburg, VA Charlotte / Concord, NC Charlotte / Concord, NC Charlotte / Concord, NC Anaheim, CA Anaheim, CA Anaheim, CA Scottsdale / Salt River, AZ Scottsdale / Salt River, AZ Scottsdale / Salt River, AZ Atlanta / LaGrange, GA Atlanta / LaGrange, GA Atlanta / LaGrange, GA Dallas / Grapevine, TX Dallas / Grapevine, TX Dallas / Grapevine, TX Houston / Webster, TX Houston / Webster, TX Houston / Webster, TX Naples, FL Naples, FL Naples, FL Near You 0 MILES 0 MILES 0 MILES Highlight Nearest Lodges Share my Location Near You 0 MILES 0 MILES 0 MILES Highlight Nearest Lodges Share my Location Arizona Scottsdale / Salt River California San Francisco /  Manteca California Anaheim Colorado Colorado Springs Connecticut Mashantucket Florida Naples Georgia Atlanta / LaGrange Illinois Chicago / Gurnee Kansas Kansas City Maryland Baltimore / Perryville Massachusetts Boston / Fitchburg Michigan Traverse City Minnesota Minneapolis / Bloomington North Carolina Charlotte / Concord Ohio Cincinnati / Mason Ohio Sandusky Ontario Niagara Falls Pennsylvania Pocono Mountains Texas Dallas / Grapevine Texas Houston / Webster Virginia Williamsburg Washington Grand Mound Wisconsin Wisconsin Dells 00 Days 00 Hours 00 Minutes 00 Seconds Book now We use cookies and similar technologies for a variety of purposes such as improving your experience on this site, analyzing web traffic data, and showing you personalized advertising, including targeted advertising through third parties, as further described in our Cookie Policy . By continuing to use our site, you agree to our Terms & Conditions (which include arbitration of certain claims) and Privacy Policy . Close General Info Locations Voyagers Club Preferred Pack Club Groups & Meetings Gift Cards Careers Media Blog Mobile App Accessibility Sitemap Check-In Essentials Water Park & More Water Park Safety Rules Activities Dining Suites Offers Deals Day Passes Birthday Parties Customer Support Lost & Found Donation Requests Legal Info Terms & Conditions Privacy Policy Cookie Policy Your California Privacy Rights © 2025 Great Wolf Resorts, Inc. All rights reserved. Find Your Lodge Grand Mound, WA Grand Mound, WA Grand Mound, WA Boston / Fitchburg, MA Boston / Fitchburg, MA Boston / Fitchburg, MA Traverse City, MI Traverse City, MI Traverse City, MI Minneapolis / Bloomington, MN Minneapolis / Bloomington, MN Minneapolis / Bloomington, MN Niagara Falls, Ontario, CA Niagara Falls, Ontario, CA Niagara Falls, Ontario, CA Mashantucket, CT Mashantucket, CT Mashantucket, CT Wisconsin Dells, WI Wisconsin Dells, WI Wisconsin Dells, WI Pocono Mountains, PA Pocono Mountains, PA Pocono Mountains, PA Chicago / Gurnee, IL Chicago / Gurnee, IL Chicago / Gurnee, IL Sandusky, OH Sandusky, OH Sandusky, OH Baltimore / Perryville, MD Baltimore / Perryville, MD Baltimore / Perryville, MD San Francisco /  Manteca, CA San Francisco /  Manteca, CA San Francisco /  Manteca, CA Cincinnati / Mason, OH Cincinnati / Mason, OH Cincinnati / Mason, OH Colorado Springs, CO Colorado Springs, CO Colorado Springs, CO Kansas City, KS Kansas City, KS Kansas City, KS Williamsburg, VA Williamsburg, VA Williamsburg, VA Charlotte / Concord, NC Charlotte / Concord, NC Charlotte / Concord, NC Anaheim, CA Anaheim, CA Anaheim, CA Scottsdale / Salt River, AZ Scottsdale / Salt River, AZ Scottsdale / Salt River, AZ Atlanta / LaGrange, GA Atlanta / LaGrange, GA Atlanta / LaGrange, GA Dallas / Grapevine, TX Dallas / Grapevine, TX Dallas / Grapevine, TX Houston / Webster, TX Houston / Webster, TX Houston / Webster, TX Naples, FL Naples, FL Naples, FL Near You 0 MILES 0 MILES 0 MILES Highlight Nearest Lodges Share my Location Near You 0 MILES 0 MILES 0 MILES Highlight Nearest Lodges Share my Location Arizona Scottsdale / Salt River California San Francisco /  Manteca California Anaheim Colorado Colorado Springs Connecticut Mashantucket Florida Naples Georgia Atlanta / LaGrange Illinois Chicago / Gurnee Kansas Kansas City Maryland Baltimore / Perryville Massachusetts Boston / Fitchburg Michigan Traverse City Minnesota Minneapolis / Bloomington North Carolina Charlotte / Concord Ohio Cincinnati / Mason Ohio Sandusky Ontario Niagara Falls Pennsylvania Pocono Mountains Texas Dallas / Grapevine Texas Houston / Webster Virginia Williamsburg Washington Grand Mound Wisconsin Wisconsin Dells"
    }
  ]
}