{
  "fuentes": [
    {
      "url": "https://shopgreenparrot.com/pages/contact",
      "email": "shop@greenparrot.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "bob@greenparrotrestaurant.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "dave@greenparrotrestaurant.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "madalyn@greenparrotrestaurant.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "michael@greenparrotrestaurant.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "bob@greenparrotrestaurant.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "dave@greenparrotrestaurant.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "madalyn@greenparrotrestaurant.com"
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "email": "michael@greenparrotrestaurant.com"
    },
    {
      "url": "https://www.greenparrot.co.nz/contact/",
      "email": "info@greenparrot.co.nz"
    },
    {
      "url": "https://www.parrot.com/en/corporate/corporate-governance-board-directors",
      "email": "buyers-remorse@parrot.com"
    },
    {
      "url": "https://www.parrot.com/en/corporate/corporate-governance-board-directors",
      "email": "u003ebuyers-remorse@parrot.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "bensalem@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "doylestown@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "levittown@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "lowermoreland@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "lowersouthampton@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "newtown-pa@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "northampton@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "plymouthwhitemarsh@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "uppersouthampton@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "warminster@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "dino.ciliberti@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "feedback@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "jeff.werner@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "justin.heinze@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "newhope-lambertville@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "peter.blanchard@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "u003epeter.blanchard@patch.com"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "email": "yardley@patch.com"
    },
    {
      "url": "https://greenparrot.com/gift-shop",
      "email": "shop@greenparrot.com"
    },
    {
      "url": "https://www.parrot.com/en/corporate/corporate-governance-key-managers",
      "email": "buyers-remorse@parrot.com"
    },
    {
      "url": "https://www.parrot.com/en/corporate/corporate-governance-key-managers",
      "email": "u003ebuyers-remorse@parrot.com"
    },
    {
      "url": "https://shopgreenparrot.com/",
      "email": "shop@greenparrot.com"
    },
    {
      "url": "https://route1views.com/travel/green-parrot-bar-key-west/",
      "email": "guest@domain.com"
    },
    {
      "url": "https://greenparrotequip.com/",
      "email": "info@greenparrotequip.com"
    },
    {
      "url": "https://greenparrotequip.com/",
      "email": "needhelp@asting.com"
    }
  ],
  "mails": [
    "bensalem@patch.com",
    "bob@greenparrotrestaurant.com",
    "buyers-remorse@parrot.com",
    "dave@greenparrotrestaurant.com",
    "dino.ciliberti@patch.com",
    "doylestown@patch.com",
    "feedback@patch.com",
    "guest@domain.com",
    "info@greenparrot.co.nz",
    "info@greenparrotequip.com",
    "jeff.werner@patch.com",
    "justin.heinze@patch.com",
    "levittown@patch.com",
    "lowermoreland@patch.com",
    "lowersouthampton@patch.com",
    "madalyn@greenparrotrestaurant.com",
    "michael@greenparrotrestaurant.com",
    "needhelp@asting.com",
    "newhope-lambertville@patch.com",
    "newtown-pa@patch.com",
    "northampton@patch.com",
    "peter.blanchard@patch.com",
    "plymouthwhitemarsh@patch.com",
    "shop@greenparrot.com",
    "u003ebuyers-remorse@parrot.com",
    "u003epeter.blanchard@patch.com",
    "uppersouthampton@patch.com",
    "warminster@patch.com",
    "yardley@patch.com"
  ],
  "nombre_sitio": "greenparrot.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://shopgreenparrot.com/pages/contact",
      "text": "Contact\n – Green Parrot Gift Shop Skip to content The Green Parrot | Key West Men's/Unisex Men's/Unisex Men's Tanks Men's T-Shirts Men's Long Sleeve Women's Women's Women's Tanks Women's T-Shirts Women's Long Sleeve Sweatshirts Hats + Visors More More Kids + Games Stickers + Magnets Keychains + Ornaments Souvenirs Coozies Drinkware Barware Art + Books Totes, Towels + Bandanas Gift Cards Log in Country/region United States |\n      USD\n      $ Search United Kingdom GBP\n                  £ United States USD\n                  $ Åland Islands EUR\n                € Albania ALL\n                L Andorra EUR\n                € Australia AUD\n                $ Austria EUR\n                € Belarus USD\n                $ Belgium EUR\n                € Bosnia & Herzegovina BAM\n                КМ Bulgaria BGN\n                лв. Canada CAD\n                $ Croatia EUR\n                € Czechia CZK\n                Kč Denmark DKK\n                kr. Estonia EUR\n                € Faroe Islands DKK\n                kr. Finland EUR\n                € France EUR\n                € Germany EUR\n                € Gibraltar GBP\n                £ Greece EUR\n                € Guernsey GBP\n                £ Hong Kong SAR HKD\n                $ Hungary HUF\n                Ft Iceland ISK\n                kr Ireland EUR\n                € Isle of Man GBP\n                £ Israel ILS\n                ₪ Italy EUR\n                € Japan JPY\n                ¥ Jersey USD\n                $ Kosovo EUR\n                € Latvia EUR\n                € Liechtenstein CHF\n                CHF Lithuania EUR\n                € Luxembourg EUR\n                € Malaysia MYR\n                RM Malta EUR\n                € Moldova MDL\n                L Monaco EUR\n                € Montenegro EUR\n                € Netherlands EUR\n                € New Zealand NZD\n                $ North Macedonia MKD\n                ден Norway USD\n                $ Poland PLN\n                zł Portugal EUR\n                € Romania RON\n                Lei Russia USD\n                $ San Marino EUR\n                € Serbia RSD\n                РСД Singapore SGD\n                $ Slovakia EUR\n                € Slovenia EUR\n                € South Korea KRW\n                ₩ Spain EUR\n                € Svalbard & Jan Mayen USD\n                $ Sweden SEK\n                kr Switzerland CHF\n                CHF U.S. Outlying Islands USD\n                $ Ukraine UAH\n                ₴ United Arab Emirates AED\n                د.إ United Kingdom GBP\n                £ United States USD\n                $ Vatican City EUR\n                € Facebook Instagram Men's/Unisex Men's Tanks Men's T-Shirts Men's Long Sleeve Women's Women's Tanks Women's T-Shirts Women's Long Sleeve Sweatshirts Hats + Visors More Kids + Games Stickers + Magnets Keychains + Ornaments Souvenirs Coozies Drinkware Barware Art + Books Totes, Towels + Bandanas Gift Cards Search Log in Cart Contact Contact form Name Email * Phone number Comment Send Quick links Search Contact Visit Us Green Parrot Bar 601 Whitehead Street Key West, FL 33040 305-294-6133 (bar) 305-295-3450 (gift shop) shop@greenparrot.com Keep in Touch Email Facebook Instagram Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard Shop Pay Visa © 2025, Green Parrot Gift Shop Powered by Shopify Refund policy Privacy policy Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://greenparrotrestaurant.com/contact",
      "text": "Green Parrot Restaurant - Contact Us Home About Us Menu Drinks Specials Catering Events Jobs ORDER NOW Order a Gift Card Address 240 N. Sycamore Street Newtown, PA 18940 Phone 215-504-7277 Email General Manager: Bob Lutz Bob@greenparrotrestaurant.com Executive Chef: Michael DeAngeles Michael@greenparrotrestaurant.com FOH Manager: Madalyn Madalyn@greenparrotrestaurant.com FOH Manager: Dave Dave@greenparrotrestaurant.com 240 N. Sycamore Street Newtown, PA 18940. 215-504-7277 © 2009 - 2025 - The Green Parrot. Website designed and hosted by: Home About Us Menu Drinks Specials Catering Events Jobs"
    },
    {
      "url": "https://www.greenparrot.co.nz/contact/",
      "text": "Contact – The Green Parrot Cafe Home Menu History Contact Home Menu History Contact The Green Parrot Cafe | Contact 86 page-template,page-template-full_width,page-template-full_width-php,page,page-id-86,edgt-core-1.0,ajax_fade,page_not_loaded,,hudson-ver-1.6, vertical_menu_with_scroll,smooth_scroll,blog_installed,wpb-js-composer js-comp-ver-6.8.0,vc_responsive Contact Us Δ WEDNESDAY – SATURDAY 5.30pm – Late Dinner Private Lunch Bookings Available email us on info@greenparrot.co.nz 16 Taranaki Street, Te Aro Wellington 6011 Phone 04 384 6080 Email info@greenparrot.co.nz FOLLOW US Instagram"
    },
    {
      "url": "https://www.parrot.com/en/corporate/corporate-governance-board-directors",
      "text": "Corporate Governance: Board of Directors | Parrot Image menu Homepage ANAFI UKR CHUCK 3.0 ANAFI Ai ANAFI USA SDK & Solutions Company Support My account Corporate Governance: Board of Directors The board of director is comprised of 8 members. It is chaired by Henri Seydoux, founder and CEO of Parrot, joined by 3 men directors and 4 women directors. Currently, 6 members of the board are independent. Parrot has adopted the Middlenext corporate governance code ; each year, the compliance is detailed in the Annual Report . The term of office of the directors is six years. The bylaws require the Board of directors to meet at least four times a year, and it may hold additional meetings if required by the economic situation or any specific events. The Board of directors is made up of two standing committees: the Audit and CSR Committee, the Appointments and Compensation Committee, The rules of procedure of the Board of Directors is available in French on t his link (PDF download) . More information on Corporate Governance is presented each year in Chapters 12 and 14 of the Annual report . Henri SEYDOUX, Founder Chairman and CEO Henri Seydoux founded Parrot in 1994 and has served as Chairman and Chief Executive Officer since its creation. Self-educated, he began his career in 1978 as a trainee with “Journal Actuel”, where he was later employed as a journalist from 1979 to 1980. In 1981, he joined the sales team at the “Matin de Paris” newspaper. Then, in 1982, he joined SSCI as an operating system software developer, before working for Microarchi from 1983 to 1984 in the same role. In 1985, he set up BBS, a company intended to market the micro archi operating system. In 1986, he created BSCA, a synthetic 3D imaging company, and became its Chairman and Chief Executive Officer from 1986 to 1990. In 1991, with three other partners, he founded and became a director in the luxury goods company Christian Louboutin. Agnès BUREAU-MIRAT (independent) Agnès Bureau-Mirat was appointed as a director of the Company on June 21, 2017. A graduate of IEP Paris and holder of a master's degree in human resources management from Université Paris IX Dauphine, she is also a certified company director with the Institut Français des Administrateurs in Paris and the Institute of Directors in London. Agnès Bureau-Mirat began her career at La Samaritaine. In 1990, she joined the Ciments Français-Italcementi group, where she held various positions in international human resources management, in Paris and Bergamo. In 1999, she joined Vivendi Universal as HR Development Director for publishing and video games, before being appointed HR Director for the Health division. In 2003, she became Head of Worldwide Human Resources for the Valeo Group's Aftermarket activities, and in 2006, she was appointed Director of Human Resources and member of the Executive Committee of the Arjowiggins Group. She joined Elior in 2009 as Director of Human Resources and CSR, and is a member of the Group's Executive Committee, supporting its international growth and return to the stock market. She also sits on the board of Grupo Areas in Barcelona, one of the world leaders in concession catering and stores in airports, railway stations and freeways. Since 2017, she has been the founding Chairman of SpringBoard, a Paris-based governance consultancy that works with French and European companies. Since 2021, Agnès Bureau-Mirat has been a member of the National Commission in charge of examining draft legislation on employee savings schemes under the aegis of the Ministry of Labor, Employment and Integration. She works with Sciences Po and the Institut Français des Administrateurs on corporate governance training for company directors. Isabelle CARRERE, (independent) Isabelle Carrère was appointed a director of the Company on June 13, 2019 for the remainder of Anne Samak's term of office. Her appointment was renewed at the Annual General Meeting of June 15, 2022. After ten years as an auditor and consultant with Arthur Andersen, Isabelle Carrère was appointed CFO of the Yves Rocher Group, before joining the LISI Group in 1999, becoming Deputy CEO of LISI Aerospace and LISI Medical. She left LISI in 2009 to set up Alba & Co, her own advisory business, which supports industrial companies in their growth projects, focusing on three main areas: digital, international and M&A. A specialist in the world of aeronautics, Isabelle has focused Alba's activities more specifically on the worlds of defense transport, associated data management, and the production of critical components and sub-assemblies. Isabelle Carrère also sits on the boards of the LISI Group and the FIBI-Aplix Group. She is a graduate of ESCP Europe and holds a chartered accountancy diploma. Amira HABERAH (independent) Amira Haberah was co-opted as a director of Parrot by the Board of Directors on June 17, 2021, following the resignation at the end of July 2021 of Marie Ekeland. Her appointment was ratified by the Annual General Meeting of June 15, 2022. Amira Haberah has joined Parrot's Board of Directors as an independent director. A graduate in Entrepreunariat from HEC Paris, she helped develop Withings' brand and sales, first as E-commerce Product Manager, then as Direct Sales and Digital Marketing Manager. There she acquired her expertise in marketing and sales strategy, which she will be able to pass on to Parrot. In 2017 she co-founded ZOOV and took charge of sales and marketing development for this fast-growing urban mobility start-up. In 2021, Zoov will become Fifteen after merging with Smoove, to become the European leader in mobility services for cities. As Chief Marketing and Sales Officer, she is constantly facing the challenges of developing new technologies, in terms of sales strategy, operational efficiency and business model management. Stéphane MARIE (independent), head of Audit and CSR committee Stéphane Marie was appointed Director of the Company on June 18, 2009. Stéphane Marie is a chartered accountant and statutory auditor, and a graduate of the HEC Executive MBA and Dauphine business schools. He spent 9 years with international audit firms, including nearly 3 years in the United States, before joining RSM in Paris in 1994. He is currently a Partner and member of the Management Committee, and specializes in statutory and audit engagements for groups in the real estate, industry and retail sectors. He chairs the ATH technical association. Jean-Marie PAINVIN Jean-Marie Painvin was appointed to the Board of Directors on June 24, 2003. A graduate of Rice University in Texas with a master's degree in mechanical engineering, he began his career in 1975 as regional manager of Trailor S.A.. From 1981 to 1988, he was Sales and Marketing Director of Compagnie Deutsch. In 1988, he became President of Deutsch Relays, Inc. in the United States, before being appointed head of Compagnie Deutsch in 1994, a position he held from 1999 to 2006. He was Chairman and CEO of the Deutsch Group until 2012. In 2013, he founded JMC Investment a Family Office, of which he is Chairman. Natalie RASTOIN (independent) Natalie Rastoin was appointed a director of the Company on May 31, 2011. President of Ogilvy Paris until May 2020, Natalie Rastoin has spent her career in advertising and communications. She now heads her own consulting firm, Polytane, and is senior advisor to Little Wing (strategy and corporate communications). After starting out in strategic planning, she joined Saatchi & Saatchi in 1986 as Development Director, before being appointed Vice President, European Development, in 1991. In 1992, she became Managing Director of BDDP Conseil's Paris agency, before taking over as Managing Director of Ogilvy & Mather Paris in 1997 (1997-2005), and then as President of the Ogilvy Group until 2020. Natalie Rastoin has worked with numerous high-tech clients, notably on globalization issues for global brands (Cisco, Yahoo!, IBM, AOL, Google), as well as start-ups, in particular in collaboration with NUMA, whom she advises. She is also a director of Pégase (Carel, Carvil brands) and a board member of the Camargo Foundation and the Eneris Infrastructure group. Geoffroy ROUX DE BÉZIEUX (independent), head of Appointments & Compensation Committee Geoffroy Roux de Bézieux was appointed to the Board of Directors of Parrot for the first time at the Annual General Meeting on June 24, 2006. Geoffroy Roux de Bézieux graduated from the ESSEC business school and obtained a DESS (post-graduate diploma) from the Dauphine business school in 1984. He did his national service in the Special Forces (Commandos Marine), with whom he served in Africa and Lebanon. He is now a reserve naval captain. After 10 years with the L'Oréal group, Geoffroy Roux de Bézieux created The Phone House, the first chain of stores dedicated to cell phones. In 2004, he founded Omea Telecom (Virgin mobile), which launched the first alternative mobile operator, before creating the Notus group in 2015, of which he is currently Chairman. Chairman of the Croissance plus association from 2005 to 2008, he was Chairman of Unédic from 2008 to 2010 and Vice-Chairman of the MEDEF from 2013 to 2018, before becoming its Chairman in July 2018. He left the MEDEF presidency in July 2023. Financial news Regulated information CSR & Governance Share information Shareholders meeting Calendar & Contact All drones Partnerships Newsroom Press contacts Investors Careers Developer Image menu Homepage 2025 Parrot Drones SAS. All rights reserved Legal mentions / Privacy Policy / Supplier Code of Conduct Cookies"
    },
    {
      "url": "https://patch.com/pennsylvania/newtown-pa/newtown-restaurant-owner-plans-fight-eviction-court",
      "text": "Green Parrot Fighting Eviction As Coronavirus Cripples Business | Newtown, PA Patch Skip to main content Newtown, PA Subscribe News Feed Events Local Businesses Classifieds Post Advertise Nearby Northampton News Yardley News Lower Southampton News Upper Southampton News Levittown News New Hope-Lambertville News Warminster News Doylestown News Bensalem News Lower Moreland News Local News Community Corner Crime & Safety Politics & Government Schools Traffic & Transit Obituaries Personal Finance Neighbor News Best Of Seasonal & Holidays Weather Arts & Entertainment Business & Tech Health & Wellness Home & Garden Sports Travel Kids & Family Pets Restaurants & Bars Real Estate Events Local Businesses Classifieds See all communities Advertise Promote on Patch In partnership with Nearby Communities Northampton, PA Yardley, PA Lower Southampton, PA Upper Southampton, PA Levittown, PA New Hope-Lambertville, PA Warminster, PA Doylestown, PA Bensalem, PA Lower Moreland, PA State Edition Pennsylvania National Edition Top National News See All Communities Thank you to our Local Business Sponsor: Juniper Village at Bucks County In partnership with Business & Tech Green Parrot Fighting Eviction As Coronavirus Cripples Business The Green Parrot, an Irish-themed pub and restaurant in Newtown, has been in business since 2009. ​It may not survive 2021. Peter Blanchard , Patch Staff Posted Wed, Jan  6, 2021 at 10:55 am ET | Updated Wed, Jan  6, 2021 at 2:30 pm ET From left, Green Parrot bar manager Nick O'Hey, owner Bob Lutz and marketing manager Eric Scott Gold. (Photo Provided) NEWTOWN, PA — Last week, business owner Bob Lutz received word from his attorney that his landlord is seeking a judgment in court regarding tens of thousands of dollars in late rent payments. For Lutz, owner of the Green Parrot Restaurant on Sycamore Street, the notice is just one more obstacle brought on by the COVID-19 pandemic, which has crippled his business for the past nine and a half months. While he was able to benefit from the Payroll Protection Program, a forgivable loan to help small businesses keep their workers on payroll during the pandemic, it hasn't been enough to make up for steep losses in revenue since mid-March. Find out what's happening in Newtown for free with the latest updates from Patch. Subscribe Despite attempts to make partial payment arrangements, the landlord is seeking a judgment in court, Lutz said. \"There’s a major situation with our landlord that needs to be done to be able to do business long term,\" Lutz told Patch. \"I hope we get there. I don’t know if we’ll get there, but we’re gonna do our damndest.\" Find out what's happening in Newtown for free with the latest updates from Patch. Subscribe The Green Parrot, an Irish-themed pub and restaurant located at the corner of Sycamore Street and Durham Road in Newtown, has been in business since 2009. The restaurant may not survive long enough to see 2022. (Google Maps) Lutz' attorney is arguing that the statewide shutdown has severely impacted his client's ability to maintain proper finances, according to court documents. The property is owned by Sycamore Street LLC. Gaetano Barone, managing member for the company, also owns other commercial properties bounded by Durham Road, Sycamore Street, Silo Drive and Ice Cream Alley, according to court filings. His attorney, Dana Plon, said the tenant has been behind on payments since before the pandemic began. \"This tenant was in default well before the pandemic,\" Plon told Patch. \"At this point he still owes money for the pre-pandemic period. He has made absolutely no partial payments.\" Running On Empty When Gov. Tom Wolf enacted a ban on indoor dining in mid-December, it may have been the final death blow for the restaurant, and while hundreds of establishments openly defied the governor's orders , Lutz did not open for indoor dining during the mandated shutdown period. Related: Bucks County Restaurants, Gyms Defying COVID-19 Restrictions There is currently a state and federal moratorium on evictions during the pandemic, but the measure doesn't apply to commercial businesses. Facing potential bankruptcy, Lutz has sought help from his loyal patrons and community members. He recently organized a fundraiser for his employees that have children, raising more than $3,000 in cash and gift cards, including a $2,150 donation from the nurses at St. Mary's Medical Center. Lutz is also seeking help from The Barstool Fund , a lifeline for small businesses launched by Barstool Sports Founder Dave Portnoy. The effort has funded dozens of struggling enterprises nationwide, including several in the greater Philadelphia area, where Barstool Sports is headquartered. \" I think if we can get any type of funds to survive, we owe it to our staff to stay in the game,\" Lutz said. \"I promised them I would do everything I can to be able to have them work to provide for their families.\" Send local news tips, photos and press releases to peter.blanchard@patch.com . Get more local news delivered straight to your inbox. Sign up for free Patch newsletters and alerts. Share More from Newtown Schools | 10h 19 Council Rock Students Named National Merit Scholarship Semifinalists Schools | 10h 3 George School Students Named Merit Scholarship Semifinalists Crime & Safety | 20h Officer Retires After 28 Years Of Service In Newtown Township Featured Events Sep 10, 2025 The Greatest Hits of Broadway Sep 12, 2025 Iconic Women of Music with Bucks County's Rae Radick Sep 13, 2025 Rivergate Neighborhood Garage Sale Sep 13, 2025 Advent Lutheran Church Annual Flea Market Sep 13, 2025 McConkey's Market Sep 13, 2025 Pig Roast “Hope After the Storm” Sep 13, 2025 Sal “The Voice” Valentinetti Sep 14, 2025 Northampton Day 2025 Sep 14, 2025 Krendl the Illusionist (Family Show) Sep 15, 2025 Minds in Motion Sep 17, 2025 AAUW invites you to: Paid Family & Medical Leave - The Time is Right! Sep 18, 2025 Fall in Love with the All New Simply Cabinetry of Newtown Sep 18, 2025 2nd Annual Greg McDonald Foundation - Celebrity Golf Classic - AFTER PARTY Sep 18, 2025 Community Energy Series - Workshop #1 Sep 23, 2025 Free Informational Seminar: Aging in Place with Friends Life Care Sep 24, 2025 2nd Annual Dinner & Fashion Show sponsored by Bucks County Foundation for Aging Sep 27, 2025 Rooted In Our Future Sep 28, 2025 5k Any Way & Color Run Race for Accessibility Oct 7, 2025 Learn about Options to Manage your Pain + Add your event Featured Classifieds Gigs & Services Professional Kitchen Cabinet Painting OR Door & Drawer Replacement - SAVE 75%! Other Larry P. Pelullo, Retired Carpenter with over 30 years Experience + Add your classified Featured Businesses Anthony Petsis & Associates People Centered Advice In Like Kindness Foundation Inc. Donate and Shop at ILK Juniper Village at Bucks County Juniper Village at Bucks County, senior living community Cabinet Painting Guru Refresh Your Dated Kitchen Cabinets And Save 75% + Promote your business Latest News Nearby Philadelphia, PA News Jalen Carter Fined $57,222 For Spitting On Cowboys Quarterback Newtown, PA News 19 Council Rock Students Named National Merit Scholarship Semifinalists Newtown, PA News 3 George School Students Named Merit Scholarship Semifinalists Newtown, PA News Officer Retires After 28 Years Of Service In Newtown Township Newtown, PA News 'Yoga At The Market' Returning To Wrightstown Farmer's Market Find out what’s happening in your community on the Patch app Corporate Info About Patch Careers Partnerships Advertise on Patch Support FAQs Contact Patch Community Guidelines Posting Instructions Terms of Use Privacy Policy © 2025 Patch Media. All Rights Reserved."
    },
    {
      "url": "https://greenparrot.com/gift-shop",
      "text": "Gift Shop — Green Parrot | A Sunny Place for Shady People | Key West Bar & Music Venue 0 Skip to Content Music Live Music Calendar History Since 1890 Smirk History of Music Jukebox In The Press Bar Cams Happenings Charity Bingo Ukulele Night Tradesman Day Shop Gift Shop Liquor Store Contact LIVE MUSIC CALENDAR Open Menu Close Menu Music Live Music Calendar History Since 1890 Smirk History of Music Jukebox In The Press Bar Cams Happenings Charity Bingo Ukulele Night Tradesman Day Shop Gift Shop Liquor Store Contact LIVE MUSIC CALENDAR Open Menu Close Menu Folder: Music Back Live Music Calendar Folder: History Back Since 1890 Smirk History of Music Jukebox In The Press Bar Cams Folder: Happenings Back Charity Bingo Ukulele Night Tradesman Day Folder: Shop Back Gift Shop Liquor Store Contact LIVE MUSIC CALENDAR Gift Shop Our gift shop, originally known as Parrotphenalia, is located adjacent to the Southard Street doors of the Bar. Small but mighty, you’ll find lots of tasteful souvenirs, apparel and hats. Phone: 305-295-3450 Email: shop@greenparrot.com Hours Sunday - Thursday: 10am - 9pm Friday & Saturday: 10am -10pm Shop Now Green Parrot Bar 601 Whitehead Street Key West, FL 33040 305-294-6133 Hours Sunday — Thursday 10am — 2am Friday & Saturday 10am — 4am Gift Shop NEWS & EVENTS Sign up Email * Thanks for signing up! We’ll keep you informed. Copyright © 2025 The Green Parrot Bar . All Rights Reserved. | Design & Development by Wonderdog Studios | Accessibility"
    },
    {
      "url": "https://www.parrot.com/en/corporate/corporate-governance-key-managers",
      "text": "Corporate Governance: Key Managers | Parrot Image menu Homepage ANAFI UKR CHUCK 3.0 ANAFI Ai ANAFI USA SDK & Solutions Company Support My account Corporate Governance: Key Managers The management team comprises ten top managers in charge of the Group's operational management: R&D, Sales and Marketing, Production and Purchasing, Finance, HR, etc. completed by the managers of the commercial drone subsidiaries. The biographies of Parrot's key managers are presented below. Additional information is available on the Annual report / reference document : information on the compensation of the executive officers and corporate officers (Chapter 15 - Compensation and Benefits) and the management chart and the bonus share / stock option allocation policy (Chapter 17 - Employees). Henri SEYDOUX, Founder Chairman and CEO Parrot Group Henri Seydoux founded Parrot in 1994 and has served as Chairman and Chief Executive Officer since its creation. Self-educated, he began his career in 1978 as a trainee with “Journal Actuel”, where he was later employed as a journalist from 1979 to 1980. In 1981, he joined the sales team at the “Matin de Paris” newspaper. Then, in 1982, he joined SSCI as an operating system software developer, before working for Microarchi from 1983 to 1984 in the same role. In 1985, he set up BBS, a company intended to market the micro archi operating system. In 1986, he created BSCA, a synthetic 3D imaging company, and became its Chairman and Chief Executive Officer from 1986 to 1990. In 1991, with three other partners, he founded and became a director in the luxury goods company Christian Louboutin. Anne-Sophie HERELLE, SVP, Chief Financial Officer Parrot group Anne Sophie Herelle joined Parrot in April 2024 as the Group's Chief Financial Officer. She began her career at JPMorgan in London as an M&A advisor for industrial clients throughout Europe, before joining the French sovereign wealth fund (Fonds Stratégique d'Investissement, now Bpifrance) as Investment Director when it was created in 2009. She was promoted to member of the Bpifrance Capital Développement Management Committee in 2017, in charge of investments in ETIs and large companies. In particular, she has represented Bpifrance on the boards of several French companies in various sectors. In 2022, she joined Eurobio Scientific, a major player in the field of in vitro diagnostics, listed on Euronext Growth Paris, as Deputy Managing Director, in charge of finance and information systems for the Group. Anne-Sophie Herelle is a graduate of HEC Paris. Elise TCHEN THEBAULT, SVP, Chief Industrial & Purchasing Officer Parrot Drones Elise Tchen Thebault joined Parrot in 2000 to oversee product manufacturing and is currently SVP, Chief Industrial and Purchasing Officer. She has transformed this department into an industrial division capable of sustaining strong growth. Since September 2006, Elise has been heading up Parrot's asian based operations, previously in China and now in South Korea, and is also responsible of the Purchase department. She has developed an entity covering both the industrial section and component sourcing. This entity is enabling the Group to be as close as possible to suppliers in order to ensure effective control over quality and reduce the costs of the products manufactured. After graduating from ENSEM in Nancy, she began her career at Renault, first in the research division, and then in the cabling engineering research team. Chris ROBERTS, SVP, Chief Revenue Officer Chris Roberts joined Parrot in 2006, establishing the business & subsidiary in the UK as Managing Director, since then Chris has experienced multiple roles & businesses for Parrot around the world including VP Europe, CEO ANZ, VP JAPAC & from 2016 as Chief Sales & Marketing Officer, being a key architect and instrumental in Parrot’s “drone transition strategy” to commercial & professional markets. Chris is currently SVP, Chief Revenue Officer with responsibility for the global Parrot Drones business operations. Chris is a globally experienced proven senior executive level leader, entrepreneur and business transformer with +30 years Hi-Tech experience across UAV, premium consumer electronics, telecoms & automotive sectors. Internationally seasoned with missions based in APAC, Europe, UK & the USA at an executive general management level in sales, marketing & operations. Chris founded and was CEO of a successful start-up company specialising in enterprise sales and technical solutions for automotive electronics & mobile communications. Chris graduated with a Masters in Business Administration from the University of Adelaide (Australia) with high performance in strategic management, global branding and business performance improvement. Pierre-Elie FORT, SVP Chief People Officer Pierre-Elie Fort is the Human Resources Director at Parrot Drone since January 2019, and currently SVP Chief People Officer. He holds a dual Master of Labor Law and Human Resources and began his career in 2006 as an HR Lawyer in a media and radio group. He then dedicated himself to recruitment as a Consultant within the specialised group Michael Page. With these achievements in two key areas of the HR function, he went on to hold various position as HR Manager, first in an event agency and then, at the end of 2010, at Acticall Sitel, a global leader in customer relations. Pierre Elie Fort joined the Parrot Group at the beginning of 2015 as Legal and Social Affairs Manager before taking on the role of HR Manager in 2017. Ludovic FLORET, General Counsel Parrot Group Ludovic Floret joined Parrot in December 2014. He completed a Master 2 degree in International Law in 1990 and began his career as a Corporate lawyer in major engineering groups. First in the nuclear sector at Framatome (Areva), then in water treatment at Degrémont (Suez Environnement), during which he participated in numerous projects in Asia and America. In 2003 he created the legal department of the company Souriau ( aeronautic equipment), where he participed in the international development (India, Morocco, USA) during two successive LBOs. He became legal director of Oberthur Technologies (smart card) in 2011. Ludovic has more than 25 years of experience in leading High-Tech players, with strong exerptise in contract negotiation, litigation, M & A, risk management and compliance. In addition to Legal Affairs, he manages the Group's insurance program. Andrey KLEYMENOV, CEO Pix4D Andrey Kleymenov joined Pix4D in September 2022 as Chief Commercial Officer. In the summer of 2024, he was appointed CEO and continues to head the Commercial team. Andrey Kleymenov holds a Master of Business Administration degree from IMD in Lausanne. He started his career in 1995 and worked in various sectors including banking institutions, management consulting and industrial companies.  Before joining Pix4D Andrey Kleymenov held leadership roles in business development, marketing and sales management in Pentair, a global water technologies company, and launched several digital ventures in Switzerland. Christoph STRECHA, Chief Scientist at Pix4D Dr. Christoph Strecha is the founder of Pix4D which he managed as CEO until the summer of 2024. Headquartered in Switzerland, Pix4D has offices in the USA, Germany, Spain and China. After it first invested in 2013, Parrot today owns 95% of Pix4D. Pix4D develops and markets software for production of survey grade 3D models, orthomosaics and analytics from images which can be used in a variety of industries. Pix4D's technology is focused on the professional processing of images aquired by any camera, it is adapted to all the leading drone equipment. Christoph Strecha received a PhD from the Catholic University of Leuven (Belgium) in 2008, completing his thesis on multi-view stereo. His research interests include structure and motion techniques and city modeling. A prominent figure in his field, Christoph Strecha is still involved in the work of several Commissions of the International Society for Photogrammetry and Remote Sensing. He has authored numerous papers and in 2015 received the Carl Pulfrich Award for his work in computer vision and photogrammetry. Financial news Regulated information CSR & Governance Share information Shareholders meeting Calendar & Contact All drones Partnerships Newsroom Press contacts Investors Careers Developer Image menu Homepage 2025 Parrot Drones SAS. All rights reserved Legal mentions / Privacy Policy / Supplier Code of Conduct Cookies"
    },
    {
      "url": "https://shopgreenparrot.com/",
      "text": "Green Parrot Bar | Key West | Bar T Shirts\n – Green Parrot Gift Shop Skip to content The Green Parrot | Key West Men's/Unisex Men's/Unisex Men's Tanks Men's T-Shirts Men's Long Sleeve Women's Women's Women's Tanks Women's T-Shirts Women's Long Sleeve Sweatshirts Hats + Visors More More Kids + Games Stickers + Magnets Keychains + Ornaments Souvenirs Coozies Drinkware Barware Art + Books Totes, Towels + Bandanas Gift Cards Log in Country/region United States |\n      USD\n      $ Search United Kingdom GBP\n                  £ United States USD\n                  $ Åland Islands EUR\n                € Albania ALL\n                L Andorra EUR\n                € Australia AUD\n                $ Austria EUR\n                € Belarus USD\n                $ Belgium EUR\n                € Bosnia & Herzegovina BAM\n                КМ Bulgaria BGN\n                лв. Canada CAD\n                $ Croatia EUR\n                € Czechia CZK\n                Kč Denmark DKK\n                kr. Estonia EUR\n                € Faroe Islands DKK\n                kr. Finland EUR\n                € France EUR\n                € Germany EUR\n                € Gibraltar GBP\n                £ Greece EUR\n                € Guernsey GBP\n                £ Hong Kong SAR HKD\n                $ Hungary HUF\n                Ft Iceland ISK\n                kr Ireland EUR\n                € Isle of Man GBP\n                £ Israel ILS\n                ₪ Italy EUR\n                € Japan JPY\n                ¥ Jersey USD\n                $ Kosovo EUR\n                € Latvia EUR\n                € Liechtenstein CHF\n                CHF Lithuania EUR\n                € Luxembourg EUR\n                € Malaysia MYR\n                RM Malta EUR\n                € Moldova MDL\n                L Monaco EUR\n                € Montenegro EUR\n                € Netherlands EUR\n                € New Zealand NZD\n                $ North Macedonia MKD\n                ден Norway USD\n                $ Poland PLN\n                zł Portugal EUR\n                € Romania RON\n                Lei Russia USD\n                $ San Marino EUR\n                € Serbia RSD\n                РСД Singapore SGD\n                $ Slovakia EUR\n                € Slovenia EUR\n                € South Korea KRW\n                ₩ Spain EUR\n                € Svalbard & Jan Mayen USD\n                $ Sweden SEK\n                kr Switzerland CHF\n                CHF U.S. Outlying Islands USD\n                $ Ukraine UAH\n                ₴ United Arab Emirates AED\n                د.إ United Kingdom GBP\n                £ United States USD\n                $ Vatican City EUR\n                € Facebook Instagram Men's/Unisex Men's Tanks Men's T-Shirts Men's Long Sleeve Women's Women's Tanks Women's T-Shirts Women's Long Sleeve Sweatshirts Hats + Visors More Kids + Games Stickers + Magnets Keychains + Ornaments Souvenirs Coozies Drinkware Barware Art + Books Totes, Towels + Bandanas Gift Cards Search Log in Cart Since 1890 An iconic Key West saloon with dive bar credibility where locals come to kick back. Sweatshirt Sale! Last Chance... No Snivelling Lightweight Pullover No Snivelling Lightweight Pullover 5.0 /\n                  5.0 (1) 1\n                  total reviews Regular price From $30.00 USD Regular price Sale price From $30.00 USD Unit price / per Mayan Bird Lightweight Zip Hoodie Mayan Bird Lightweight Zip Hoodie 5.0 /\n                  5.0 (1) 1\n                  total reviews Regular price From $35.00 USD Regular price Sale price From $35.00 USD Unit price / per Shield Hoodie Shield Hoodie 5.0 /\n                  5.0 (1) 1\n                  total reviews Regular price From $40.00 USD Regular price Sale price From $40.00 USD Unit price / per Ombre Ladies Crewneck Sweatshirt Ombre Ladies Crewneck Sweatshirt 5.0 /\n                  5.0 (1) 1\n                  total reviews Regular price $40.00 USD Regular price Sale price $40.00 USD Unit price / per First & Last Bar Zip Hoodie First & Last Bar Zip Hoodie Regular price From $40.00 USD Regular price Sale price From $40.00 USD Unit price / per Parachute Patch 1/4 Zip Sweatshirt Parachute Patch 1/4 Zip Sweatshirt 5.0 /\n                  5.0 (2) 2\n                  total reviews Regular price $40.00 USD Regular price Sale price $40.00 USD Unit price / per Keep Us Top of Mind! Mayan Bird Visor Mayan Bird Visor Regular price $20.00 USD Regular price Sale price $20.00 USD Unit price / per Flying Guitar Baseball Hat Flying Guitar Baseball Hat Regular price $26.00 USD Regular price Sale price $26.00 USD Unit price / per Mayan Parrot Baseball Hat Mayan Parrot Baseball Hat Regular price $26.00 USD Regular price Sale price $26.00 USD Unit price / per Building Patch Trucker Hat Building Patch Trucker Hat Regular price From $30.00 USD Regular price Sale price From $30.00 USD Unit price / per GP x Bart Bridge Stash Hat GP x Bart Bridge Stash Hat Regular price $42.00 USD Regular price Sale price $42.00 USD Unit price / per Support Live Music Hat Support Live Music Hat Regular price $35.00 USD Regular price Sale price $35.00 USD Unit price / per Sunny Place Hat Sunny Place Hat Regular price $35.00 USD Regular price Sale price $35.00 USD Unit price / per Soundcheck Baseball Hat Soundcheck Baseball Hat Regular price $26.00 USD Regular price Sale price $26.00 USD Unit price / per View all Skip to product information Open media 1 in modal 1 / of 2 Jukebox T Shirt Regular price $30.00 USD Regular price Sale price $30.00 USD Unit price / per Sale Sold out Size Extra Small Variant sold out or unavailable Small Variant sold out or unavailable Medium Variant sold out or unavailable Large Variant sold out or unavailable Extra Large Variant sold out or unavailable 2X Variant sold out or unavailable 3X Variant sold out or unavailable 4X Variant sold out or unavailable Color Coral Variant sold out or unavailable Cream Variant sold out or unavailable Quantity ( 0 in cart) Decrease quantity for Jukebox T Shirt Increase quantity for Jukebox T Shirt Add to cart This item is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Share Share Link Close share Copy link View full details Skip to product information Open media 1 in modal 1 / of 8 Jim Fossum Photo Print Regular price $30.00 USD Regular price Sale price $30.00 USD Unit price / per Sale Sold out Color Southard Nighttime Variant sold out or unavailable B&W Reef Relief Benefit Variant sold out or unavailable Whitehead LE#1 Variant sold out or unavailable Parachute Variant sold out or unavailable Whitehead LE#2 Variant sold out or unavailable Southard Street Day Color Variant sold out or unavailable Southard Street B/W Variant sold out or unavailable Smirk Variant sold out or unavailable Quantity ( 0 in cart) Decrease quantity for Jim Fossum Photo Print Increase quantity for Jim Fossum Photo Print Add to cart This item is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Share Share Link Close share Copy link View full details Skip to product information Open media 1 in modal 1 / of 1 Bart Bridge GP x Bart Bridge Patch Regular price $14.00 USD Regular price Sale price $14.00 USD Unit price / per Sale Sold out Quantity ( 0 in cart) Decrease quantity for GP x Bart Bridge Patch Increase quantity for GP x Bart Bridge Patch Add to cart This item is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Share Share Link Close share Copy link View full details Bring the Bar to you! GPS 1 Ale Tap Handle GPS 1 Ale Tap Handle Regular price $70.00 USD Regular price Sale price $70.00 USD Unit price / per Glass Ashtray Glass Ashtray Regular price $15.00 USD Regular price Sale price $15.00 USD Unit price / per Plush Bar Mop Plush Bar Mop Regular price $12.00 USD Regular price Sale price $12.00 USD Unit price / per Paddle Bottle Opener Paddle Bottle Opener Regular price $10.00 USD Regular price Sale price $10.00 USD Unit price / per Corkscrew Corkscrew Regular price $3.50 USD Regular price Sale price $3.50 USD Unit price / per Soft Six-Pack Cooler Soft Six-Pack Cooler Regular price $10.00 USD Regular price Sale price $10.00 USD Unit price / per NEW Bottle Opener Keychain NEW Bottle Opener Keychain Regular price $4.00 USD Regular price Sale price $4.00 USD Unit price / per Parrot Wine Opener Parrot Wine Opener Regular price $7.00 USD Regular price Sale price $7.00 USD Unit price / per View all A Sunny Place For Shady People Unwavering spirit, great music, a place to share a beverage or a thought, a place where anything is possible, anytime. A place where people tell their stories un-distracted, stripped of veneer, of pretense and of charade. A space to just be. Visit The Bar For The Little Parrotkeets Kids End Of The Road T-Shirt Kids End Of The Road T-Shirt Regular price $22.00 USD Regular price Sale price $22.00 USD Unit price / per Baby Onesie - Parrotkeet Baby Onesie - Parrotkeet Regular price $22.00 USD Regular price Sale price $22.00 USD Unit price / per Toddler T-Shirt - Here For The Popcorn Toddler T-Shirt - Here For The Popcorn Regular price $22.00 USD Regular price Sale price $22.00 USD Unit price / per Kids T-Shirt - Here For The Popcorn Kids T-Shirt - Here For The Popcorn Regular price $22.00 USD Regular price Sale price $22.00 USD Unit price / per View all Who We Are As someone once said, “if there was a recipe for this place, and someone took the care to write it down, I’m sure we would have lost it by now.” Our History What The People Want We are constantly blown away by our  live music lineup... if you plan on checking out the music at The Parrot you’d better pack a lunch. Live Music Schedule Watch Live See what you're missing or wave to a friend on our Bar Cam... snag a front-row balcony seat at Soundcheck on our Stage Cam. Bar Cams Let customers speak for us from 163 reviews You are what you wear I’ve been wearing your tee’s for over twenty five years easy!  Thanks for sharing Killer 09/08/2025 Circle Logo Quick & friendly! Quick service as I was heading to the 2nd line parade! KeKe 09/08/2025 Green Parrot Head T Shirt 👍 👍 Gary 09/07/2025 Chalkboard T Shirt great fit and great great fit and great design CHRIS 09/06/2025 Jukebox T Shirt Cute and keeps my beer Cute and keeps my beer cold!! Terri from Rockledge,FL 09/05/2025 Bottle Zip Coozie Love it!! And love Love it!! And love GP! Joe 09/03/2025 Parrot Wine Opener I love my swag I love my swag and the dude who waited on me was super friendly Dawn 09/03/2025 Mayan Parrot Trucker Hat Looking forward to repping The Green Parrot Looking forward to repping The Green Parrot. Had a wonderful Sunday afternoon listening to live music and drinking cold beer. DMo 09/01/2025 Building Shield T Shirt great great t Thomas 08/31/2025 1st & Last Bar T Shirt I love the quality of the fabric I love the quality of the fabric.  The fit is perfect. Victoria 08/30/2025 Circle Logo All All good! Craig 08/29/2025 1890 T Shirt I love these flip flops! Kinos are the very best. However, I received the men's cut. They seem to fit but def the men's cut of the Lily Kino Betty 08/26/2025 Kino Sandals x Green Parrot Great quality got alot of positive Great quality got alot of positive comments Bruce 08/25/2025 No Snivelling Coozie Love this hat! Got many compliments on it already Love this hat! Got many compliments on it already. Thanks, Green Parrot! Also loved the lady who sold it to me - she was very helpful. Anonymous 08/23/2025 GP x Bart Bridge Stash Hat BRING THEM BACK !!!!!!!!!!!!!! I like the shirt and wish you would bring back all the old colors you used to have. I have purchased all of them and now i need to replace them they are worn out  Please bring those colors back   THANKS I wear them all the time STEPHEN 08/22/2025 Weird Are Welcome Tank Top Quick links Search Contact Visit Us Green Parrot Bar 601 Whitehead Street Key West, FL 33040 305-294-6133 (bar) 305-295-3450 (gift shop) shop@greenparrot.com Keep in Touch Email Facebook Instagram Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard Shop Pay Visa © 2025, Green Parrot Gift Shop Powered by Shopify Refund policy Privacy policy Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://route1views.com/travel/green-parrot-bar-key-west/",
      "text": "Green Parrot Bar Key West, Florida - Route 1 Views Home Travel Articles Create About FAQ About Shop Login/ Signup Search for: Home Travel Articles Create About FAQ About Shop Sign in Sign up Search for: On route and almost there ! Previous Next Green Parrot Bar Key West, Florida Once described as an historic mythological landmark in the form of debauchery and drink, this iconic Key West Saloon with Dive Bar credibility is where locals and visitors in the know come to catch real live music almost every day of the week. On the Southeast corner of Southard Street and Route 1 (Whitehead Street) this 100 year-old building, that was once a grocery store, where in the  back room local musicians created impromptu jam sessions often playing into the night is how it all began. During WW II it became a hangout for submarine sailors stationed at the base only a block away.   When the Navy pulled out in the seventies Key West became a haven for hippies, bikers, vagabonds and free-spirited nomads. Later on with the discovery of Key West Pink shrimp, when the shrimpers returned the bar morphed into a shit-kickin fisherman’s honky talk,  where they came with cash and laden with contraband from Jamaica to Columbia. As Bridges widened and tourism boomed Key West finally found its place as the only Caribbean City that Americans could reach by car. With the sounds of music, tropical breezes, whirling ceiling fans, clacking of pool balls, laughter around the darts, this funky laid-back open air bar is the place to party.  This is where the locals come for poetry slams, divorce celebrations, bachelor parties, memorial services, hurricane parties, pet birthday bashes and you name it. The Green Parrot Bar is a place for travelers to rendezvous, to mingle with the bars cast of eccentric local characters. This is a bar with no cover and no minimum, the only thing to eat is yummy salty tasty popcorn.  No Sniveling here,  just a few steps off Route 1, See all the upcoming Live Music Events at https://www.greenparrot.com/key-west-live-music/ David Garland FL Naval Air Station Key West Jan 23, 2023 Bars Friends Next Location: Naval Air Station Key West FL Get Directions David Garland Jan 23, 2023 Share Green Parrot Bar Key West, Florida SHARE 2 Like 0 'been there 1 Comment 0 Share Submit Comment Anonymous Sounds like fun 0 Like Reply 1 year Submit Comment Timeline David created this post 3 years ago Related Experiences Have you had an experience at this place? Share your own experience here! Share Your Experience More Views For You! Have another story to tell? Create an account and get started . It's free! Top Show List See Map reset Posts View History Loading Views . . . Looking for something different? Go on a journey through East Coast States Go back destination: Current Screen: Browsing History Close FOLLOW US GET IN TOUCH Question? Request? Issues? Get in touch with us here. Contact Name * Last * Email * Message * Captcha Submit If you are human, leave this field blank. About FAQS Login Shop Register Travel RT1 Privacy Notice Terms of Use About Route 1 © 2025 Double Ohs Music, LLC. All Rights Reserved. Route1Views Loading Close Save changes"
    },
    {
      "url": "https://greenparrotequip.com/",
      "text": "Restaurant Equipment GREEN PARROT SOLUTIONS LLC Home About us Our Services Why us Our Products Contact us GREEN PARROT SOLUTIONS Supplier of Restaurant Equipment About us GREEN PARROT SOLUTIONS Supplier of Restaurant Equipment About us GREEN PARROT SOLUTIONS Supplier of Restaurant Equipment About us About us About us At Green Parrot Solutions, our focus is providing you with the best restaurant equipment for your place of business to top quality small wares and residential equipment for your home. We have accumulated many repeating and satisfied customers through the years due to the legacy our founder implemented before us. From restaurants and taverns to hotels and institutions, we know the best ways to create beautiful and functional workspaces that deliver results for our clients. Whether you're starting a new restaurant, re-designing or replacing, our team will guide your project to its greatest potential. We will work with you from product selection to installation and service. We pride ourselves on the positive relationships we have developed with many local General Contractors from small to the largest multi-million dollar projects we have completed. We can effectively manage costs and provide timely response on any project. We consult with both the architect and the client about the kitchens use, specifying equipment that best suits the application in both function and cost. When you partner with us for your kitchen needs, you are partnering with a company of experienced professionals who will accomplish your projects completely and correctly, with compliance and safety in mind. If you are looking for unique Restaurant Equipment at comparative prices Green parrot solutions is the best choice for you. Looking for something special and can't find it, ask us and we will get it for you. Read More Years of Experience Years of Experience Providing best brands at comparative prices Best quality assurance After-sale Service Support Restaurant Equipment From Concept to design, budgeting to value engineering, to project management, we offer the expertise to argument designs and meet the clientâs requirements. we work alongside you to figure out the maximum usage for the available space with your concept. Our consultants work closely with our customers to identify the most efficient, useful equipment to their particular operation. Read More New New Products Cooking Equipment Cooking Performance Group S60-N Natural Gas 10 Burner 60\" Range with 2 Standard Ovens Refrigeration Equipment Avantco SS-3F-HC 81 5/16\" Stainless Steel Solid Door Reach-In Freezer Commercial Work Tables Regency 24\" x 36\" 16 Gauge Type 304 Stainless Steel Enclosed Base Table with Sliding Doors and Adjustable Midshelf Our Services Our Services Extensive Product Selection We have one of the largest in-stock inventory of equipment, with more than thousand different items available for immediate shipment. You can come in to inspect and compare items, versus looking at a picture in a catalog or online. We are Specializing in new, used, and scratch & dent equipment. We offer cooking, holding, warming, refrigeration, beverage, and food preparation equipment. Read More Quality Assurance We bring a level of expertise that is unmatched by our piers, to assist you in designing and remodeling luxury kitchens also assist with all kitchen equipment, layouts and specification. We tailor our project for your specific needs. We will do the job professionally, and to your satisfaction. We use state-of-the-art methods and high standards of craftsmanship. We feature energy-efficient materials to ensure your restaurant build and remodeling project is properly designed and completed on time. We also use the latest technology and equipment advancement to make sure your food service or restaurant kitchen design is precisely what you require. Read More Expert Guidance and Support Our consultants create customized layouts for chefs and owners to view. Our staff offers you the following services to assist you in all the important planning and design stages of opening or remodeling your business: Design and layout of kitchen, bar, and dining areas, equipment specification, and coordinating with contractors and architects. We work with our customers throughout all stages of the process. Whether you are starting from scratch or updating an existing kitchen, a commercial kitchen project can be overwhelming; Green Parrot solutions takes the stress out of the experience by guiding customers through the process step by step. Read More Why us Why us In short, Green Parrot Solution is not just a restaurant equipment distributor, we are your business solution. When you want to open a new restaurant or expand your current site, we will help you design your kitchen and equip your kitchen, from very small local shops to the largest restaurant in the town, we have helped several big and small restaurant projects. With our customer-friendly website, we offer our customers near and far, the same quality services and prices which our local clients benefit. With our extensive product catalog customers can save their time searching for new equipment. It all right here. Restaurant Equipment Subscribe Newsletter Subscribe Our Products Our Products Our Products Refrigeration Equipment Cooking Equipment Cooking Equipment Storage Equipment Restaurant Equipment FAQ Frequently Asked Questions Why is equipment important in restaurants? The primary benefit of maintaining your restaurant equipment is better food. Properly maintained kitchen equipment produces better food for your customers. Not only will your food be tastier, production speed increases as well, so your customers can enjoy fresh food fast. Your kitchen equipment must be reliable. When you own an ice cream or smoothie shop you need to prepare delicious grilled dishes quickly. What are the factors to consider us when purchasing equipment? If your business is looking to purchase or upgrade existing equipment there are a range of factors you will need to consider before doing so. We have experience and well reputed in this market, besides we consider your budget, and your need and then we offer you the best product that suits you, and your business, Why do we care about products maintenance? An effective maintenance program will make plant and equipment more reliable. Fewer breakdowns will mean less dangerous contact with machinery is required, as well as having the cost benefits of better productivity and efficiency. Additional hazards can occur when machinery becomes unreliable and develops faults Maintenance allows these faults to be diagnosed early to manage any risks. However, maintenance needs to be correctly planned and carried out. Unsafe maintenance has caused many fatalities and serious injuries, either during the maintenance or to those using the badly maintained or wrongly maintained/repaired equipment. At Green Parrot Solutions, we use the National and International standards for equipment maintenance Restaurant Equipment Contact us Contact us Send Message Address 2407 W Wrangler Blvd, Seminole, OK, 74868 Phone +1 (405) 648-0979 Email info@greenparrotequip.com GREEN PARROT SOLUTIONS LLC Restaurant Equipment Get Involved Now GREEN PARROT SOLUTIONS LLC As a provider of restaurant equipment, we specialize in offering a diverse range of high-quality products to meet the needs of the foodservice industry. Links Home About us Our Services Why us Our Products Contact us Contact +1 (405) 648-0979 info@greenparrotequip.com 2407 W Wrangler Blvd, Seminole, OK, 74868 Support Subscribe Copyright GREEN PARROT SOLUTIONS LLC Â©2024. All Rights Reserved needhelp@asting.com +1 (405) 648-0979"
    }
  ]
}