{
  "fuentes": [
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.greekbaseball.com/",
      "email": "contact@greekbaseball.com"
    },
    {
      "url": "https://www.saint-katherines.org/about_us/website-and-listserv",
      "email": "stkconnect@stkchurch.com"
    }
  ],
  "mails": [
    "contact@greekbaseball.com",
    "gabe@journeysherwood.org",
    "info@journeysherwood.org",
    "leadershipboard@journeysherwood.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "scott@journeysherwood.org",
    "stkconnect@stkchurch.com"
  ],
  "nombre_sitio": "greekfestivalmlb.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.greekbaseball.com/",
      "text": "Greek Baseball Home History Team Coaching Staff National Team All-Time Leaders/Records Career Statistics Shop Contact Us Send an Email New Player Submission Other Links WBSCÂ Europe World Rankings Hellenic Baseball SoftballÂ Federation Support the Team Send a Donation Sponsorship Opportunities The last Greek ballplayer wants to bring baseball back to the country All News The last Greek ballplayer wants to bring baseball back to the country 2025 European Baseball Championship Announced U-23 National Team development is underway Are there baseball teams in Greece? Hellas wins 2024 Prague Baseball Week Championship Greece finishes Championship in 13th place... Qualifies for 2025 Euro Baseball One month away from 2023 Euro Championship 2023 European Baseball Championship 2022 Prague Baseball Week Former player Chris Demetral named new Manager Upcoming Event 2025 European Championship Final Position:Â - Current Record: - 20/9/2025 10:30am Milan, IT Lithuania - : - Greece 21/9/2025 10:30am Milan, IT Greece - : - Switzerland 22/9/2025 3:30pm Milan, IT Greece - : - Italy Federation Message \"After a long period of inactivity, the Hellenic Baseball Softball Federation is reactivating with the two sports now unified. The aim of the Federation is to create the new generation of sportsmen and women, to spread sports and to find new sports venues. In this new effort with completely different conditions from those of the past, everyone has a place. The strength of the Federation is the knowledge, experience and disposition of all the sportsmen and women who have climbed the home.\" - Kostis Liarommatis HBSF President Sponsorship The Greek National Baseball team is continuously looking for sponsorships and donations to help fund annual team expenses that include operations, travel, accomodations, camps, workouts, etc. We are extremely appreciative of all support. The National team is a 501c3 non-profit as well as a member of the Hellenic Baseball Softball Federation. If you are interested in supporting, you will be able to receive a tax deductible write off as part of our non-profit status. All News The last Greek ballplayer wants to bring baseball back to the country 2025 European Baseball Championship Announced U-23 National Team development is underway Are there baseball teams in Greece? Hellas wins 2024 Prague Baseball Week Championship Greece finishes Championship in 13th place... Qualifies for 2025 Euro Baseball One month away from 2023 Euro Championship Upcoming Event Final Position:Â - Current Record: - 20/9/2025 10:30am Milan, IT Lithuania - : - Greece 21/9/2025 10:30am Milan, IT Greece - : - Switzerland 22/9/2025 3:30pm Milan, IT Greece - : - Italy Tweets by GreekBaseball Sponsorship The Greek National Baseball team is continuously looking for sponsorships and donations to help fund annual team expenses that include operations, travel, accomodations, camps, workouts, etc. We are extremely appreciative of all support. The National team is a 501c3 non-profit as well as a member of the Hellenic Baseball Softball Federation. If you are interested in supporting, you will be able to receive a tax deductible write off as part of our non-profit status. contact@greekbaseball.com Â© 2025 Hellas Baseball. All rights reserved"
    },
    {
      "url": "https://www.saint-katherines.org/about_us/website-and-listserv",
      "text": "Website and Listserv | Saint Katherine Greek Orthodox Church Saint Katherine Greek Orthodox Church Falls Church, VA About Us Church Services in PDF Metropolis of New Jersey Encyclicals, Memorandums, and Press Releases Clergy Resources and Links Website and Listserv Archbishop Elpidophoros' Messages, Encyclicals, Homilies, and Schedule Forms and Information for Baptisms and Weddings Office Information Sunday Bulletins Greek Folk Dance Lessons Our Faith The Orthodox Church House of God Worship The Sacraments Special Services Teachings Spirituality History The Church Contact Us Online Giving Ways to Give Online Donations Ministries Our Ministries Bookstore Schools, Studies, and Book Clubs Service Organizations Youth Groups Young Adult Groups Calendar Newsletter Greek Orthodox Metropolis of New Jersey Saint Katherine Greek Orthodox Church Falls Church, VA About Us Church Services in PDF Metropolis of New Jersey Encyclicals, Memorandums, and Press Releases Clergy Resources and Links Website and Listserv Archbishop Elpidophoros' Messages, Encyclicals, Homilies, and Schedule Forms and Information for Baptisms and Weddings Office Information Sunday Bulletins Greek Folk Dance Lessons Our Faith The Orthodox Church House of God Worship The Sacraments Special Services Teachings Spirituality History The Church Contact Us Online Giving Ways to Give Online Donations Ministries Our Ministries Bookstore Schools, Studies, and Book Clubs Service Organizations Youth Groups Young Adult Groups Calendar Newsletter Website and Listserv About Us Website and Listserv Presvytera Pauline Pavlakos is the webmaster of the Saint Katherine website and the list owner of the Saint Katherine Church mailing list. Please contact her at StKConnect@stkchurch.com regarding the listserv (email list) and/or the website. Presvytera utilizes many of the Archdiocese Department of Internet Ministries ' free services. She used one of their website templates and customized it for Saint Katherine. The website is hosted on the Archdiocese web server. Presvytera Pauline also uses a listserv which allows her to create, and continually maintain, our church's email list on the Internet. Click on this link to subscribe to our listserv. We are extremely grateful to the Archdiocese for offering these free services to our parish and hope that you find the website and listserv to be informative and useful. About Us Church Services in PDF Metropolis of New Jersey Encyclicals, Memorandums, and Press Releases Clergy Resources and Links Website and Listserv Archbishop Elpidophoros' Messages, Encyclicals, Homilies, and Schedule Forms and Information for Baptisms and Weddings Office Information Sunday Bulletins Greek Folk Dance Lessons Saint Katherine Greek Orthodox Church 3149 Glen Carlyn Road Falls Church, VA 22041 Phone: (703) 671-1515 | Email Us Our Patron Saint Our Clergy Our Faith Ways to Give Our Calendar Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    }
  ]
}