{
  "fuentes": [
    {
      "url": "https://www.groveresortorlando.com/surfari-water-park/parties-events",
      "email": "sales@groveresortorlando.com"
    },
    {
      "url": "https://www.booking.com/hotel/us/the-grove-resort-and-spa.html",
      "email": "us@3x.png"
    }
  ],
  "mails": [
    "sales@groveresortorlando.com",
    "us@3x.png"
  ],
  "nombre_sitio": "groveresortorlando.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.groveresortorlando.com/surfari-water-park/parties-events",
      "text": "Book Parties & Events at Surfari Water Park | Grove Resort Amenity Rentals FlowRider Activities Parties & Events Longboard Bar & Grill The Grove Resort faq 833-641-2147 The Grove Resort faq 833-641-2147 Book a room Amenity Rentals FlowRider Activities Parties & Events Longboard Bar & Grill More Amenity Rentals FlowRider Activities Parties & Events Longboard Bar & Grill More Book a room Host Your Next Event at Surfari Water Park Book Birthday Parties, Graduations, and Weddings Celebrate your special occasions at Surfari Water Park! From birthday parties and graduation celebrations to unforgettable weddings, our water park is the perfect venue for any event. To book your memorable gathering, please contact our sales department at sales@groveresortorlando.com . Availability is limited, so be sure to reserve your spot soon! All Guests Can Enjoy Free Surfari Water Park Access Celebrate your special occasions at Surfari Water Park! From birthday parties and graduation celebrations to unforgettable weddings, our water park is the perfect venue for any event. View all offers and packages Surfari Water Park Kids Birthday Package The Grove's Surfari Water Park is the perfect place to celebrate your child's birthday! Sun, splash, and sundries will make for an unforgettable birthday! For guests and locals alike, enjoy a celebration in the sun! Book Now Surfari Water Park Girls Trip Package Get away with your girls! Spend a day in the sun with your favorite friends sipping on champagne, enjoying the sun, and enjoying the heated pool at Surfari Water Park. Book Now Florida/Georgia Resident Rate Florida and Georgia residents save up to 25% on your stay. The perfect getaway is right in your backyard. Every resort guest gets FREE entry into the heated Surfari Water Park! Rates From: $123 Book Now Stay More, Save More The longer you stay, the more you save! Save up to 35% when you book the Stay More Save More promotion.  The longer you stay, the more you save. Enjoy FREE access to the fully heated Surfari Water Park and amazing amenities all the family will love! Rates From: $123 Book Now Create memories here Perfect for Weddings, Parties, and More To book your memorable gathering, please contact our sales department. Availability is limited, so be sure to reserve your spot soon! Start Planning Media & Awards Careers Owner Login Travel professionals Privacy Policy Accessibility Health & safety 14501 Grove Resort Ave, Winter Garden, FL 34787 Toll Free Reservations: 877-890-7932 Hotel Toll Free: 833-641-2147 Hotel Local Number: 407-545-7500 Hotel Fax number: 321-319-6793 © 2024 The Grove Resort & Water Park Orlando Book a Room"
    },
    {
      "url": "https://www.booking.com/hotel/us/the-grove-resort-and-spa.html",
      "text": "The Grove Resort & Water Park Orlando, Orlando (updated prices 2025) Skip to main content ARS List your property Register Sign in Stays Flights Car rental Attractions Airport taxis More Check-in date — Check-out date 2 adults · 0 children · 1 room Search Home Hotels All resorts United States Florida (FL) Orlando The Grove Resort & Water Park Orlando (Resort) (US) Deals Overview Info & prices Facilities House rules Guest reviews (11,082) More Reserve We Price Match Travel Proud The Grove Resort & Water Park Orlando The Grove Resort & Water Park Orlando 14501 Grove Resort Avenue, Orlando, FL 34787, United States After booking, all of the property’s details, including telephone and address, are provided in your booking confirmation and your account. – Great location - show map +98 photos The Grove Resort & Water Park Orlando Reserve now Gallery Close Scored 7.8 7.8 Rated good Good 11,082 reviews Guests who stayed here loved “ We have been to the Grove a few times and it’s our new family vacation spot, we will be trying to go 2 times a year. They have everything you need right on property. ” Justin United States “ Very nice hotel! I love that there’s different places to eat & multiple splash parks to enjoy for the family. Shuttles run for the nearby theme parks which is a plus! I would stay again. ” Alexas United States “ The room was very clean and it has all what I need for my family ” Ramos United States “ the condos where perfect for q family of 5. The hallways and elevators all have a smell to them. Not very clean. ” Ariana United States “ I love how it accommodated the whole family and You don't have to drive anywhere else for the kids.  Everything is in arm reach. ” Shekisha United States “ Our 4 nights stay was amazing. The cleanliness of our 3 br and 2 ba Superior  was very pleasing. The staff was prompt, very nice and willing to help.  The adult pool was very nice and they have a... ” Iris United States “ The rooms are spacious. The pools and waterpark are a lot of fun. My kids love the flowrider and it’s not a bad price. The staff is very friendly and helpful. ” Joseph United States “ Beautiful resort felt like we were home away from home ” Cheyenne United States “ We loved all of the things for our family to do including pools and water park. The arcade was great on a rainy afternoon and so was the art room. ” Emily United States “ Location was perfect for everything and price was great ” James United States Categories: Staff 8.1 Facilities 8.1 Cleanliness 8.2 Comfort 8.2 Value for money 7.8 Location 8.3 Free Wifi 7.5 1 / 106 Scored 7.8 7.8 Rated good Good 11,082 reviews Guests who stayed here loved “ We have been to the Grove a few times and it’s our new family vacation spot, we will be trying to go 2 times a year. They have everything you need right on property. ” Justin United States “ Very nice hotel! I love that there’s different places to eat & multiple splash parks to enjoy for the family. Shuttles run for the nearby theme parks which is a plus! I would stay again. ” Alexas United States “ The room was very clean and it has all what I need for my family ” Ramos United States “ the condos where perfect for q family of 5. The hallways and elevators all have a smell to them. Not very clean. ” Ariana United States “ I love how it accommodated the whole family and You don't have to drive anywhere else for the kids.  Everything is in arm reach. ” Shekisha United States “ Our 4 nights stay was amazing. The cleanliness of our 3 br and 2 ba Superior  was very pleasing. The staff was prompt, very nice and willing to help.  The adult pool was very nice and they have a... ” Iris United States “ The rooms are spacious. The pools and waterpark are a lot of fun. My kids love the flowrider and it’s not a bad price. The staff is very friendly and helpful. ” Joseph United States “ Beautiful resort felt like we were home away from home ” Cheyenne United States “ We loved all of the things for our family to do including pools and water park. The arcade was great on a rainy afternoon and so was the art room. ” Emily United States “ Location was perfect for everything and price was great ” James United States Categories: Staff 8.1 Facilities 8.1 Cleanliness 8.2 Comfort 8.2 Value for money 7.8 Location 8.3 Free Wifi 7.5 Scored 7.8 7.8 Rated good Good 11,082 reviews Facilities 8.1 Cleanliness 8.2 Comfort 8.2 Value for money 7.8 Location 8.3 Total 7.8 Free Wifi 7.5 Great location! 8.3 You might be eligible for a Genius discount at The Grove Resort & Water Park Orlando. Sign in to check if a Genius discount is available for your selected dates. Genius discounts at this property are subject to booking dates, stay dates, and other available deals. About this property Offering a heated outdoor pool and located just 10 minute' drive from Walt Disney World, and also a Surfari Waterpark that has a lazy river, slides, kids splash area and family friendly park activities. The resort has an on-site bar where guests can enjoy a drink.\n\nEach spacious suite includes a fully equipped kitchen, a living room, and a dining area. A washing machine and dryer are provided, as is a screened-in balcony. Some suites feature views of the lake or pool.\n\nFree WiFi is available throughout the property and private parking is available on site. Guests will also find gift shop at the property.\n\nGuests can enjoy various activities in the surroundings, including golfing and fishing. The nearest airport is Orlando International Airport, 22 mi from The Grove Resort & Water Park Orlando. Couples in particular like the location – they rated it 8.2 for a two-person trip. Distance in property description is calculated using © OpenStreetMap Most popular facilities 4 swimming pools Private Parking Free Wifi Family rooms Non-smoking rooms Fitness center 3 restaurants Facilities for disabled guests Tea/Coffee Maker in All Rooms Bar Property highlights Top Location: Highly rated by recent guests (8.3) Want a great night's sleep? This property was highly rated for its very comfy beds. Private Parking Available On Site Activities: Fitness center Golf course (within 2 miles) Fishing Reserve Save the property Sign in, save money Sign in to see if you can save 10% or more at this property. Sign in Create an account Availability We Price Match Select dates to see this property's availability and prices Check-in date — Check-out date 2 adults · 0 children · 1 room Search Room Type Number of guests Three-Bedroom Two Bath Condo (Free Water Park Access) 1 king bed and 1 sofa bed and 2 queen beds × 8 + × 7 Show prices Two-Bedroom Condo Resort View (Free Water Park Access) 1 king bed and 1 sofa bed and 1 queen bed × 6 + × 5 Show prices Two-Bedroom Condo Superior View (Free Water Park Access) 1 king bed and 1 sofa bed and 1 queen bed × 6 + × 5 Show prices Three-Bedroom Two Bath Superior Condo (Free Water Park Access) 1 king bed and 1 sofa bed and 2 queen beds × 8 + × 7 Show prices Three-Bedroom Three Bath Condo (Free Water Park Access) 1 king bed and 1 sofa bed and 2 queen beds × 8 + × 7 Show prices Three-Bedroom Three Bath Superior Condo (Free Water Park Access) 1 king bed and 1 sofa bed and 2 queen beds × 8 + × 7 Show prices Two Bedroom Family Condo Resort View (Free Water Park Access) 2 full beds and 1 king bed and 1 sofa bed × 7 + × 6 Show prices Two Bedroom Family Condo Superior View (Free Water Park Access) 2 full beds and 1 king bed and 1 sofa bed × 7 + × 6 Show prices Superior Studio (Free Water Park Access) 1 king bed + Show prices Superior One Bedroom Suite  (Free Water Park Access) Bedroom 1 king bed Living room 1 sofa bed + Show prices Superior Two Bedroom Suite (Free Water Park Access) Bedroom 1 1 king bed Bedroom 2 1 queen bed Living room 1 sofa bed × 6 + × 5 Show prices Three Bedroom Suite ADA Accessible Bathtub (Free Water Park Access) Bedroom 1 1 king bed Bedroom 2 1 queen bed Bedroom 3 1 queen bed Living room 1 sofa bed × 8 Show prices Two Bedroom Suite ADA Accessible Bathtub (Free Water Park Access) Bedroom 1 1 king bed Bedroom 2 1 queen bed Living room 1 sofa bed × 6 Show prices Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Something went wrong – please try again later. Guest reviews Scored 7.8 7.8 Rated good Good · 11,082 reviews Read all reviews Categories: Staff 8.1 Facilities 8.1 Cleanliness 8.2 Comfort 8.2 Value for money 7.8 Location 8.3 Free Wifi 7.5 Select topics to read reviews: Room Swimming pool Clean Kids Towel Guests who stayed here loved J Justin United States “ We have been to the Grove a few times and it’s our new family vacation spot, we will be trying to go 2 times a year. They have everything you need right on property. ” Read more Alexas United States “ Very nice hotel! I love that there’s different places to eat & multiple splash parks to enjoy for the family. Shuttles run for the nearby theme parks which is a plus! I would stay again. ” Read more Ramos United States “ The room was very clean and it has all what I need for my family ” Read more A Ariana United States “ the condos where perfect for q family of 5. The hallways and elevators all have a smell to them. Not very clean. ” Read more S Shekisha United States “ I love how it accommodated the whole family and You don't have to drive anywhere else for the kids.  Everything is in arm reach. ” Read more I Iris United States “ Our 4 nights stay was amazing. The cleanliness of our 3 br and 2 ba Superior  was very pleasing. The staff was prompt, very nice and willing to help.  The adult pool was very nice and they have a bar right there for your convenience. We pretty... ” Read more J Joseph United States “ The rooms are spacious. The pools and waterpark are a lot of fun. My kids love the flowrider and it’s not a bad price. The staff is very friendly and helpful. ” Read more C Cheyenne United States “ Beautiful resort felt like we were home away from home ” Read more E Emily United States “ We loved all of the things for our family to do including pools and water park. The arcade was great on a rainy afternoon and so was the art room. ” Read more James United States “ Location was perfect for everything and price was great ” Read more Read all reviews Area info Restaurants 3 Restaurants On Site Valencia Restaurant Cuisine American • Local Open for Breakfast • Lunch • Dinner Ambience Family-friendly • Modern Dietary options Vegan • Gluten-free The Springs Bar and Grill Cuisine American Open for Lunch • Dinner • Cocktail hour Ambience Family-friendly • Modern Dietary options Vegan • Gluten-free Longboard Bar and Grill Cuisine American • Grill/BBQ Open for Lunch Ambience Family-friendly Dietary options Vegan • Gluten-free House rules The Grove Resort & Water Park Orlando takes special requests – add in the next step! Check-in From 4:00 PM to 12:00 AM Guests are required to show a photo ID and credit card at check-in. You need to let the property know what time you'll be arriving in advance. Check-out From 6:00 AM to 10:00 AM Cancellation/ prepayment Cancellation and prepayment policies vary according to accommodation type. Enter your stay dates and check the conditions of your selected option. Children & Beds Child policies Children of all ages are welcome. To see correct prices and occupancy info, add the number and ages of children in your group to your search. Crib and extra bed policies 0 - 2 years Crib upon request US$20 per stay Prices for cribs aren't included in the total price. They'll have to be paid for separately during your stay. The number of cribs allowed depends on the option you choose. Check your selected option for more info. There are no extra beds available at this property. All cribs are subject to availability. Age restriction The minimum age for check-in is 21 Pets Pets are not allowed. Groups When booking more than 6 rooms, different policies and additional fees may apply. Cards accepted at this property The fine print Must-know information for guests at this property The resort fee is charged per night plus city tax. See the Price column for details. The parking fee does not include city tax. See the Price column for details. Guest under the age of 21 can only check in with a parent or official guardian. Guests are required to show a photo ID and credit card upon check-in. Please note that all Special Requests are subject to availability and additional charges may apply. Please inform The Grove Resort & Water Park Orlando of your expected arrival time in advance. You can use the Special Requests box when booking, or contact the property directly using the contact details in your confirmation. Guests under the age of 18 can only check in with a parent or official guardian. Show more Show more The Best of Orlando Click here to see more hotels and accommodations near popular landmarks in Orlando Cities Orlando Kissimmee Mount Dora Sanford Clermont Airports Orlando Sanford International Airport Daytona Beach International Airport Orlando International Airport Landmarks Camping World Stadium Downtown Orlando Amway Center Dr. Phillips Center for the Performing Arts Lake Eola Park Thornton Park Church Street Station Countries Regions Cities Districts Airports Hotels Places of interest Vacation Homes Apartments Resorts Villas Hostels B&Bs Guest Houses Unique places to stay Reviews Discover monthly stays Support Coronavirus (COVID-19) FAQs Manage your trips Contact Customer Service Safety Resource Center Discover Genius loyalty program Seasonal and holiday deals Travel articles Booking.com for Business Traveller Review Awards Car rental Flight finder Restaurant reservations Booking.com for Travel Agents Terms and settings Privacy & cookies Terms & conditions Accessibility Statement Partner dispute Modern Slavery Statement Human Rights Statement Partners Extranet login Partner help List your property Become an affiliate About About Booking.com How We Work Sustainability Press center Careers Investor relations Corporate contact ARS Booking.com is part of Booking Holdings Inc., the world leader in online travel and related services. Copyright © 1996–2025 Booking.com™. All rights reserved. Start of dialog content Verified reviews from real guests. We have more than 70 million property reviews, all from real, verified guests . How does it work? 1 It starts with a booking It starts with a booking The only way to leave a review is to first make a booking. That's how we know our reviews come from real guests who have stayed at the property. 2 Followed by a trip Followed by a trip When guests stay at the property, they check out how quiet the room is, how friendly the staff is, and more. 3 And finally, a review And finally, a review After their trip, guests tell us about their stay. We check for naughty words and verify the authenticity of all guest reviews before adding them to our site. If you booked through us and want to leave a review, please sign in first. Sign in and leave a review End of dialog content Check-in date Check-out date « » Mo Tu We Th Fr Sa Su Close calendar"
    }
  ]
}