{
  "fuentes": [
    {
      "url": "https://allmusicmagazine.com/venues/grove-roots-brewing-company/",
      "email": "all-music-logo-white@2x.png"
    },
    {
      "url": "https://www.goodbeerhunting.com/blog/2024/1/12/iowas-big-grove-brewery-defies-the-odds-and-categorization",
      "email": "aim-true@2x.png"
    },
    {
      "url": "https://www.goodbeerhunting.com/blog/2024/1/12/iowas-big-grove-brewery-defies-the-odds-and-categorization",
      "email": "brand-mark@2x.png"
    },
    {
      "url": "https://www.goodbeerhunting.com/blog/2024/1/12/iowas-big-grove-brewery-defies-the-odds-and-categorization",
      "email": "shop@goodbeerhunting.com"
    },
    {
      "url": "https://www.goodbeerhunting.com/blog/2024/1/12/iowas-big-grove-brewery-defies-the-odds-and-categorization",
      "email": "shop@goodbeerhutning.com"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "makersco-257x144@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "makersco-300x167@2x-300x167.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "gotcandy-copy-257x144@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "gotcandy-copy-300x167@2x-300x167.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "live-music-copy-257x144@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "live-music-copy-300x167@2x-300x167.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "moonlightmarket-257x144@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "moonlightmarket-300x167@2x-300x167.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "peacockandpine-copy-257x144@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "peacockandpine-copy-300x167@2x-300x167.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "petalsglow-copy-257x144@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "petalsglow-copy-300x167@2x-300x167.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "ricks-257x144@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "ricks-300x167@2x-300x167.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "scarecrow-with-welcome-150x150@2x-150x150.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "scarecrow-with-welcome-200x200@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "scarecrow-with-welcome-45x45@2x.jpg"
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "email": "scarecrow-with-welcome-83x83@2x.jpg"
    }
  ],
  "mails": [
    "aim-true@2x.png",
    "all-music-logo-white@2x.png",
    "brand-mark@2x.png",
    "gotcandy-copy-257x144@2x.jpg",
    "gotcandy-copy-300x167@2x-300x167.jpg",
    "live-music-copy-257x144@2x.jpg",
    "live-music-copy-300x167@2x-300x167.jpg",
    "makersco-257x144@2x.jpg",
    "makersco-300x167@2x-300x167.jpg",
    "moonlightmarket-257x144@2x.jpg",
    "moonlightmarket-300x167@2x-300x167.jpg",
    "peacockandpine-copy-257x144@2x.jpg",
    "peacockandpine-copy-300x167@2x-300x167.jpg",
    "petalsglow-copy-257x144@2x.jpg",
    "petalsglow-copy-300x167@2x-300x167.jpg",
    "ricks-257x144@2x.jpg",
    "ricks-300x167@2x-300x167.jpg",
    "scarecrow-with-welcome-150x150@2x-150x150.jpg",
    "scarecrow-with-welcome-200x200@2x.jpg",
    "scarecrow-with-welcome-45x45@2x.jpg",
    "scarecrow-with-welcome-83x83@2x.jpg",
    "shop@goodbeerhunting.com",
    "shop@goodbeerhutning.com"
  ],
  "nombre_sitio": "groveroots.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://allmusicmagazine.com/venues/grove-roots-brewing-company/",
      "text": "Grove Roots Brewing Company - All Music Magazine Logout Search Search News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact News Reviews Album Reviews Concert Reviews Interviews Galleries Podcasts Editorials Videos Contact Festivals Contributors Advertising Festivals Contributors Advertising Venues Edit Venue Details Add Upcoming Show Reset Password Grove Roots Brewing Company Winter Haven Rock (863) 291-0700 info@groveroots.com View Website 302 3rd Street SW Winter Haven FL 33881 Smoking About The Venue Grove Roots Brewing Co. is a fiercely local craft brewery and taproom located in downtown Winter Haven, Florida. Our mission? To create inventive, artisanal beers inspired by the traditions and tastes of Central Florida’s citrus past. Through partnerships with major producers and mom-and-pop growers alike, we’re reclaiming the land and getting back to our roots. But let’s make one thing clear: we’re not just paying homage to an industry that once was. We’re here to celebrate what still is, savoring our citrus heritage with every sip. Upcoming Events: No events yet, check back later! Contact Us © 2025 All Music Magazine. All rights reserved. Privacy Policy"
    },
    {
      "url": "https://www.goodbeerhunting.com/blog/2024/1/12/iowas-big-grove-brewery-defies-the-odds-and-categorization",
      "text": "Harder, Better, Faster, Stronger — How Iowa’s Big Grove Brewery Defies the Odds and Categorization  — Good Beer Hunting Good Beer Hunting Stories Sightlines Podcast b-Roll Events More… Search Toggle Menu Good Beer Hunting Editorial The Stories Sightlines Podcast B-Roll Blogs Sorry for Partying by Michael Kiser Banquet and Chill by Kyle Kastranec Ferments at Low Temps by Stephanie Byce Beer is Offal by Mark Spence The Pull of Joy by Lily Waite Retrocausality by Evan Rail You Must Be Mad by Beth Demmon This Must Be the Place by Oliver Gray Altered States by Holly Regan Let Go or Get Dragged by Jerard Fagerberg Bootlegger's Baby by Jamaal Lemon Podcasts Electing to Drink Boss Barista Good for You Underwriting Into the Wild with New Belgium Brewing Mother of Invention with Guinness Beer is Labor with East Brother Beer Co. Coming to America with Guinness Fervent Few Community sponsors Message in a Bottle with Brewery Ommegang Beer and a Shot with Miller High Life From Barons to Barrels with Captain Pabst Age of Rediscovery with Menabrea Next Germination with Guinness Compound Interest with SMBX Olly Olly with Oskar Blues Brewery Experiences Events Uppers & Downers Olly Olly Misc About The Studio Jobs Style Guide Contact Follow Search Special Projects Cider/Food Tip Your Bartenders with Captain Pabst Signifiers Harder, Better, Faster, Stronger — How Iowa’s Big Grove Brewery Defies the Odds and Categorization January 12, 2024 At Big Grove Brewery’s release party for Richard the Whale—an imperial stout that resurfaces every December—folks have been lined up since 5 a.m. Jarrett Walsh isn’t one of them, but he did bike here before noon, toting the last few years of Richards with him. The staff addresses him as one of their own, which demands an explanation. It was deep winter, he tells me, and he was there at the bar, sipping, sitting, and doing some work. The men next to him asked what he liked most—and least—about what he was drinking, and he was struck by their interest in his words. Naturally, they were Big Grove’s brewers, “and it just turned into us sitting for two hours talking about beer. It was so … thoughtful.” That’s not Walsh’s only anecdote about the Iowa brewery. Nor is he alone in his affection: Down the bar are Big Grove fans in Richard the Whale T-shirts, hats—there’s even a Richard the Whale arm tattoo on a burly, grinning redhead. Turn in any direction, it seems, and there’s a level of devotion to Big Grove that seems more akin to religion or celebrity. At the very least, many here seem at home. And, perhaps, they are. Big Grove seems to have tapped a communal need, becoming a restaurant and social club almost as much as it is a brewery—one that’s expanded production four-fold in five years, while many others its size are flailing. Scott Selix—co-founder of Lua Brewing Company, a former lead brewer and bar manager for Big Grove, and past president of the Iowa Brewers Guild—has an idea as to how this growth is happening. When I press him for an explanation on Big Grove’s remarkable ascent, he pulls no punches: “They have better people than other breweries do. You can quote me as saying that. The people are better.” Looking at Big Grove’s unicorn stats—and the diehard fans in this room—I’m tempted to agree with Selix. But what does “better” mean? As much as can be explained, here’s how a little Iowa brew pub went from 3.5 barrels to 100,000, a farm-town David who’s toppling Goliath. THE ROOTS OF THE RISE Big Grove once benefitted from a case of “right place, right time.” In 2008, the first iteration of the brewery wasn’t even a brewery. Red’s Ale House, a modest taproom in North Liberty—about 20 minutes from Iowa City—accidentally introduced the state to craft beer. “Wasn't really a thing back then,” says co-founder Matt Swift. “We put 18 taps on the line and the distributors were like, ‘Hey, I think your beer is going to go bad if you have 18 taps.’” “ They have better people than other breweries do. You can quote me as saying that. The people are better. ” — Scott Selix, co-founder, Lua Brewing Company The beer didn’t go bad. Within months, if you wanted your beer released in Iowa, you came through Red’s. The demand eventually got the team thinking of brewing, and their first plan eyed a small shed in Red’s backyard. By 2012, the three-founder team—Faye Swift, her son Matt Swift, and Doug Goettsch—knew they’d outgrow that shed, instead opening up a food-focused brewpub in nearby Solon and adopting a new name: Big Grove. Solon, a tiny town of 3,000, is widely referred to as the Iowa Hamptons, just Farmer Brown–style. Oddly wealthy but still rural, it was an opportunity to push the envelope, slowly, with 3.5 barrels and a willingness to carry Busch Light. “Everybody was a macro beer drinker until they were a micro beer drinker,” says Goettsch, the trio’s hospitality expert. Big Grove happily tossed out domestics to those who requested them (“Don’t care whatcha buy so long as you buy it from me!”), knowing many would eventually get curious about local beer—and they did. “Don't force anything down people's throats,” Goettsch says, softly. “Let them discover these things. Be the place they made that discovery.” IF YOU FEED THEM, THEY WILL COME The same goes for the food, which is also Goettsch’s handiwork. Prior to Big Grove, he was working at The Culinary Institute of America in California’s Napa Valley. Goettsch recruited former Iowan Ben Smart, of Seattle’s five-diamond Herbfarm, and the two-man team quickly got to breaking rules. Their menus left genre in the dust, with lines reading from “tater-tot casserole” to “harissa meatballs.” The middle of the menu stayed farm-town approachable; the outside sang in experiments—though it all focused on quality and complexity. Smart told Goettsch he wanted “to do everything as hard as possible,” and Goettsch responded in kind. “I said, ‘Yep, if we're going to do a cheeseburger, it's going to be the best damn cheeseburger we’ve ever had.’” Goettsch is a core driver of Big Grove’s big-tent approach, from hawking those domestic bottles to plating up his family-recipe mac ’n’ cheese. He’s also a devout believer in being hands-on. As he puts it: “People like to see the owner. You can't pay people to run your business.” The partially deflated air mattress in the upstairs office speaks for itself. ...AND THE BEER? Red’s Ale House may not have had much competition in 2008, but by the time Big Grove came to be in 2012, breweries were popping up all across Iowa. Today, the Hawkeye State is no beer desert: 126 craft breweries currently have open doors, ranking it 15th in the nation for breweries per capita (5.4). What’s more, Iowa is no quality-beer desert, either, with Confluence, Pivo, Backpocket, Iowa Brewing Company, and SingleSpeed all calling the state home. Iowa breweries have racked up the medals, many from the same small-to-midsize towns in which Big Grove operates. But Big Grove’s doing something every other brewery is not: growing precipitously, stratospherically. With the largest statewide presence, it’s now up to four locations—the original brewpub in Solon; the Iowa City brewery, which opened in 2017; the Des Moines taproom, which opened in 2022; and Cedar Rapids, which opened just before Christmas 2023. It’d be tempting to think that’s the secret to Big Grove’s success—selling to yourself, that is—but the timeline doesn’t cooperate. The brewery increased output +37% from 2020 to 2021, both before the Des Moines expansion and during the pandemic. That year, it crossed over the 15,000-barrel mark to become a “regional” brewery, a category defined by the Brewers Association. From 2021 to 2022, Big Grove did it again: a +20% jump in production, from 19,759 to 23,849 barrels. “We have never made enough beer to meet demand,” Swift says, matter-of-factly—Swift says everything matter-of-factly. “In the history of the company, we have never met demand.” In 2023, Big Grove became Iowa’s fastest-growing and biggest craft beer brand, claiming a 10% share of the state’s craft sales. Since 2018, much of that number can be traced to Easy Eddy, Big Grove’s most popular brew by far. In 2023, it was 56% of sales, and previous years aren’t much different. “ We have never made enough beer to meet demand. In the history of the company, we have never met demand. ” — Matt Swift, co-founder, Big Grove Brewery One of the first shelf-stable hazy IPAs on the market, Easy Eddy is the brainchild of Andy Joynt, Big Grove’s head brewer, whom most seem to describe with wonder and awe. (Luckily, he’s unassuming and nerdy.) Naturally, Big Grove is capitalizing on Easy Eddy’s success by expanding into a family of “Eddy” brands, like the Royal Eddy Imperial Hazy IPA and the Eddy Tropical & Juicy. “He’s the fucking man,” Swift says to me while turning to Joynt. “You knew. How did you know?” “... I don’t know about that,” Joynt shrugs. TO COMMUNITY AND BEYOND During the first pandemic summer, Big Grove’s Iowa City location became a community focal point. With the parking lot transformed into a patio and drive-thru, cars lined up and down the block for cheeseburgers, fries, and to-go beers—and for lifeboats of sanity, hope, and much-needed carbs. “We did not get the PPP loan in Q2,” says Swift, referring to the US loan program to help businesses stay afloat. “We sold too much.” Even local folks who aren’t into Richard the Whales and Easy Eddies tend to express one sentiment: “I respect who they are to the community.” The Big Grove for Good program—which typically focuses on “trees, trails, and water”—offers grants to the three counties in which Big Grove currently operates. Brewery staffers can also be found regularly donating to local businesses and actively volunteering during storm and flood cleanup (a common occurrence in eastern Iowa). “We want to matter to wherever we go,” says Swift. “We want to make a positive impact wherever we are.” It’ll be interesting, then, to see how Big Grove navigates its next moves: mattering outside of Iowa. Will Big Grove become too big? GO NORTH, EAST, AND WEST, YOUNG EDDY Big Grove’s new Cedar Rapids location—only a half hour from both Iowa City and Solon—adds another 21,000 square feet to the company’s growing footprint. The 15-barrel Lager house–style brewing setup features open fermentation, which comes readily showcased for the taproom’s 200-plus guests. “ We want to matter to wherever we go. We want to make a positive impact wherever we are. ” — Matt Swift, co-founder, Big Grove Brewery That’s not the only brick-and-mortar expansion on the books. Cementing it in the nation’s top-3% of breweries by production, a 68,000-barrel facility is mid-construction a few miles from the original location in Iowa City. All in all, Big Grove’s production numbers will increase by more than +50% in 2024. And then there’s distribution: The team recently signed a deal with Stern Beverage, out of Illinois, to get their products up and down the Mississippi River. They’re also expanding into Omaha, Nebraska. “Rooted in Iowa,” their logo reads—what happens when Big Grove sends those roots beyond the Hawkeye State? Swift knows it’s a risk. I ask him if he’s concerned about the “New Glarus effect,” aka Big Grove losing its appeal once it's available across state lines—once it veers into chain territory. He says, characteristically and without hesitation, “Absolutely.” He follows it up with, “But we have the best team in the state, so we’ll see.” Words + Photos by Jacqueline Kehoe Women-Led, Women-Brewed — Kweza Craft Brewery in Kigali, Rwanda The Philosophy of the Farmer Brewers — Brouwerij Hof ten Dormaal in Tildonk, Belgium The Shop Beer gear, Artwork, and Publications that’ll drive you to drink Saison Sweatshirt $45.00 Feel Goods Tote $20.00 GBH Mascot Tee $20.00 Seltzer Sweatshirt $45.00 Dope Girls — Volume 6 $20.00 Twitter Instagram Pinterest Facebook All content ©2023 Good Beer Hunting. A strategic venture of Feel Goods Company . \"Good Beer Hunting®\" is an international registered trademark of Good Beer Hunting LLC."
    },
    {
      "url": "https://dailyridge.com/2018/08/02/grove-roots-brewing-company-hosts-moonlight-market/",
      "text": "Grove Roots Brewing Company Hosts Moonlight Market - DailyRidge.com Sign in Home Auto Business & Economy Health Entertainment Politics Crime Obituaries About Advertise With Us! Contact Us Sign in Welcome! Log into your account your username your password Forgot your password? Password recovery Recover your password your email Search DailyRidge.com Fast Factual Free News! Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. 73.9 F Winter Haven Wednesday, September 10, 2025 Sign in / Join About Contact Us Advertise With Us! Facebook Instagram Twitter Vimeo Youtube DailyRidge.com Fast Factual Free News! Home Auto Business & Economy Health Entertainment Politics Crime Obituaries About Advertise With Us! Contact Us More Search August 2, 2018 Staff Reporter Facebook Twitter Youtube - Advertisement - Latest Posts Florida Chiefs of the Gridiron: FSU scalps East Texas A&M Haines City CRA Board Pushes for Full-Time Director Over Consultant Option Polk County Sheriff's Office Polk County Sheriff’s Office Deputies Arrest More Than 50 People for Driving Under the Influence Florida Highway Patrol Ohio Man Allegedly Offers Sexual Favors to Trooper After 100 MPH Traffic Stop in Polk County Grove Roots Brewing Company Hosts Moonlight Market 7610 Share Facebook Twitter Grove Roots Brewing Company Hosts Moonlight Market By Allison Williams Grove Roots Brewing Company is a local craft brewery and taproom right in Downtown Winter Haven. Located at 302 3 rd Street SW in Winter Haven, this large open space poses a perfect environment to host the monthly Moonlight Market every fourth Wednesday of the month. The summer passing showers did not stop the food trucks from setting up. Rick’s Bar-B-Q had their “2 go” food truck set up outside the entrance along with the Got Candy food truck. Guests gathered inside to enjoy local beers provided by Grove Roots. Some guests sat back and relaxed at the large tables, while others jammed out to some live music. Vendors set up tables inside the brewery. The Makers Co. had a display set up at the event. The Makers Co. owner, Gina Smith hosts wood sign workshops and has a DIY craft studio. Smith started this business and has the help of her husband Darryl. She considers herself a “crafter at heart.” “I love making things for others and teaching others and bringing out their creative side,” Smith said. “How I came to this idea of starting this business was when I attended a workshop with my coworkers and fell in love with the process of creating something beautiful that you could be proud to hang in your home or give as a gift. I also loved that it was quality time spent with your friends.” The Smith’s offered $10 off to anyone who signed up for one of their workshops at the Moonlight Market event. For more information, visit their website: https://themakerscofl.com Another vendor was Kay’s Creations . Owner Kay Teehan, a retired teacher from the Polk County School District, creates door décor wreaths. “I found it very satisfying and when my workroom was bulging with wreaths and my friends and family had enough wreaths to last forever, I knew I needed to market them,” Teehan said. With the help of her husband Larry, she finds it rewarding to be able to share her creative gift with the community. “My door wreaths are all one-of-a-kind and reflect seasonal and holiday motifs,” Teehan said. ”I also create sports wreaths, wedding wreaths, and wreaths for special occasions. All my wreaths are treated with UV protection and scotch-guarded. They will last many years for my customers to enjoy season after season.” Wreath Photos by Kay Teehan Other vendors at the market included: Peacock and Pine Aura Accessories (Lutz, FL) Olive + Lemon Creations (Winter Haven, FL – Etsy) Petals + Glow (Plant City – Etsy) Gail K Benoit’s Art and Plants Bump Galletta (Lakeland) Plants and Pamperin’ (Lakeland) The next Moonlight Market is set for August 22. Click the Facebook link for more information: https://www.facebook.com/events/322929034857882/ For vendor information, email [email protected] Staff Reporter See Full Bio August 2, 2018 Staff Reporter Facebook Instagram Twitter Youtube RELATED ARTICLES Winter Haven Sheriff Judd: Arrests Made in Lake Winterset Riot Caught on Video Winter Haven Youth For Christ of Polk County Receives 70th AED from Culpepper’s Cardiac Foundation Polk County How a $90 Million Idea Will Launch Polk County Into Orbit Polk County AdventHealth Acquires Bond Clinic, Expanding Its Reach Across Polk County Winter Haven Mulberry Man Arrested After Alleged Armed Confrontation at Gas Station Latest Posts Florida Chiefs of the Gridiron: FSU scalps East Texas A&M Haines City CRA Board Pushes for Full-Time Director Over Consultant Option Polk County Sheriff's Office Polk County Sheriff’s Office Deputies Arrest More Than 50 People for Driving Under the Influence Florida Highway Patrol Ohio Man Allegedly Offers Sexual Favors to Trooper After 100 MPH Traffic Stop in Polk County - Advertisement - Don't Miss Florida Chiefs of the Gridiron: FSU scalps East Texas A&M Haines City CRA Board Pushes for Full-Time Director Over Consultant Option Polk County Sheriff's Office Polk County Sheriff’s Office Deputies Arrest More Than 50 People for Driving Under the Influence Florida Highway Patrol Ohio Man Allegedly Offers Sexual Favors to Trooper After 100 MPH Traffic Stop in Polk County Polk County Sheriff's Office Six Arrested Following Fatal Hit and Run at Willow Oak Mobile Home Park DailyRidge.com Fast Factual Free News! Advertise About Contact Us Advertise With Us! Links Winter Haven Daily Lake Wales Daily Political Bourbon Stay connected Facebook Twitter © 2021 WinterHavenDaily.com | All rights reserved."
    }
  ]
}