{
  "fuentes": [
    {
      "url": "https://www.pub.gov.sg/contact-us",
      "email": "pub_newatervc@pub.gov.sg"
    },
    {
      "url": "https://www.pub.gov.sg/contact-us",
      "email": "pub_qsm@pub.gov.sg"
    },
    {
      "url": "https://www.pub.gov.sg/contact-us",
      "email": "pub_sgwa@pub.gov.sg"
    },
    {
      "url": "https://www.pub.gov.sg/contact-us",
      "email": "pub_sgwx@pub.gov.sg"
    },
    {
      "url": "https://www.pub.gov.sg/contact-us",
      "email": "pub_waterhub@pub.gov.sg"
    },
    {
      "url": "https://guiltyseabeachbar.com/contact-us/",
      "email": "info@guiltysea.com"
    },
    {
      "url": "https://www.guiltyseabeachbar.com/about",
      "email": "info@guiltysea.com"
    },
    {
      "url": "https://guiltyseabeachbar.com/",
      "email": "info@guiltysea.com"
    },
    {
      "url": "https://guiltyseabeachbar.com/specials/",
      "email": "info@guiltysea.com"
    },
    {
      "url": "https://guiltyseabeachbar.com/about-guilty-sea/",
      "email": "info@guiltysea.com"
    },
    {
      "url": "https://guiltyseabeachbar.com/rewards/",
      "email": "info@guiltysea.com"
    }
  ],
  "mails": [
    "info@guiltysea.com",
    "pub_newatervc@pub.gov.sg",
    "pub_qsm@pub.gov.sg",
    "pub_sgwa@pub.gov.sg",
    "pub_sgwx@pub.gov.sg",
    "pub_waterhub@pub.gov.sg"
  ],
  "nombre_sitio": "guiltyseabeachbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pub.gov.sg/contact-us",
      "text": "Contact Us | PUB, Singapore’s National Water Agency sg-crest A Singapore Government Agency Website How to identify Official website links end with .gov.sg Government agencies communicate via .gov.sg websites (e.g.\ngo.gov.sg/open). Trusted websites Trusted websites Secure websites use HTTPS Look for a lock ( ) or https:// as an added precaution. Share sensitive information\nonly\non\nofficial, secure websites. Public General Public Homepage View All E-Services Singapore's Water Loop Singapore Water Story Sustainability and Environment Water Conservation Key Initiatives Our Water SG60 Flood Resilience Get Flood-Wise NEWater Smart Water Meter Get Involved Partnerships Water Wally & Sally Club Social Contest Places of Interest Marina Barrage NEWater Visitor Centre Our Reservoirs and Waterways Filming and Photography Professionals Professionals Log in to B&P Portal Log in to POWS Portal Requirements Licensed Plumbers Qualified Persons Sewer Pipelines CCTV Contractors Application Forms Earth Control Measures Mandatory Water Efficiency Requirements Water Supply Services Trade Effluent Grease Trap Resources Codes of Practice and Standard Drawings Guides and Handbooks Industry Circulars PUB Services Plans Resources on Water Efficiency Measures Awards and Certification Singapore Watermark Awards Water Efficiency Awards Water Efficient Building Certification ABC Waters Certification Industry Industry Research & Innovation Research & Development Innovation Funding Publications Tenders & Contracts Upcoming Tenders eGuarantee@Gov Enterprise Singapore Water Exchange PUB Consultants Events and Programmes Global Innovation Challenge Singapore International Water Week Singapore Water Webinar Series ABC Waters Professional Programme e-Services e-Services Public Find a Licensed Plumber Book a Tour Make a Payment Rental of Event  Spaces Apply for Vessel Permits Register for Geographical Studies Calculate School Water Efficiency Index Apply / Terminate Water Supply Request for a Water Saver Pack Professionals Business & Professional (B&P) Portal Regulatory Submission Enquiry Submission Status Check Obtain New/Replacement of Plumber Licence Apply to be a Licensed Plumber Apply for Water Efficiency Labelling Scheme Ratings Apply Singapore Water Academy Courses Resources Resources Newsroom Media Releases Forum Replies Clarifications Notices Featured Stories Resources Gallery Publications About Us Careers × Most Popular Water Loop Licensed Plumbers Marina Barrage Water Conservation × Public Professionals Industry e-Services Resources About Us Careers Main Menu General Public Homepage View All E-Services Singapore's Water Loop Key Initiatives Get Involved Places of Interest General Singapore's Water Loop Learn more Singapore Water Story Sustainability and Environment Water Conservation General Key Initiatives Learn more Our Water SG60 Flood Resilience Get Flood-Wise NEWater Smart Water Meter General Get Involved Learn more Partnerships Water Wally & Sally Club Social Contest General Places of Interest Learn more Marina Barrage NEWater Visitor Centre Our Reservoirs and Waterways Filming and Photography Main Menu Professionals Log in to B&P Portal Log in to POWS Portal Requirements Resources Awards and Certification Professionals Requirements Learn more Licensed Plumbers Qualified Persons Sewer Pipelines CCTV Contractors Application Forms Earth Control Measures Mandatory Water Efficiency Requirements Water Supply Services Trade Effluent Grease Trap Professionals Resources Learn more Codes of Practice and Standard Drawings Guides and Handbooks Industry Circulars PUB Services Plans Resources on Water Efficiency Measures Professionals Awards and Certification Learn more Singapore Watermark Awards Water Efficiency Awards Water Efficient Building Certification ABC Waters Certification Main Menu Industry Research & Innovation Tenders & Contracts Enterprise Events and Programmes Industry Research & Innovation Learn more Research & Development Innovation Funding Publications Industry Tenders & Contracts Learn more Upcoming Tenders eGuarantee@Gov Industry Enterprise Learn more Singapore Water Exchange PUB Consultants Industry Events and Programmes Learn more Global Innovation Challenge Singapore International Water Week Singapore Water Webinar Series ABC Waters Professional Programme Main Menu e-Services Public Professionals e-Services Public Learn more Find a Licensed Plumber Book a Tour Make a Payment Rental of Event  Spaces Apply for Vessel Permits Register for Geographical Studies Calculate School Water Efficiency Index Apply / Terminate Water Supply Request for a Water Saver Pack e-Services Professionals Learn more Business & Professional (B&P) Portal Regulatory Submission Enquiry Submission Status Check Obtain New/Replacement of Plumber Licence Apply to be a Licensed Plumber Apply for Water Efficiency Labelling Scheme Ratings Apply Singapore Water Academy Courses Main Menu Resources Newsroom Resources Resources Newsroom Learn more Media Releases Forum Replies Clarifications Notices Featured Stories Resources Resources Learn more Gallery Publications Home Contact Us Home Contact us Notice Cessation of PUB Counter Collection Services at NEA Customer Service Centre at Environment Building Collections of payments to PUB will no longer be available at the NEA Customer Service Centre at Environment Building from 1 February 2019. Customers can continue to make payment via internet banking, online credit card and GIRO arrangement . Contact Us How to Reach Us Locations More Information Online Help and Feedback Forms Send us an enquiry or feedback . Alternatively, you can download the myENV App from the App Store and Google Play store to get online help and send feedback. Toll-Free 24hr Call Centre (Local) To contact us, you can call 1800-CALL-PUB*. You may also reach us at 65216470. *Airtime charges apply for mobile calls to 1800 service lines; only calls from regular land lines are free of charge. 24hr Call Centre (International) To contact us from overseas, you can use the following number: 62255782 . PUB Headquarters Address: 40 Scotts Road #22-01 Environment Building Singapore 228231 Singapore Water Academy Address: 80 Toh Guan Road East WaterHub Singapore 608576 Email: pub_sgwa@pub.gov.sg Marina Barrage Address: 8 Marina Gardens Drive Marina Barrage Singapore 018951 Phone: 65145959 65145959 NEWater Visitor Centre Address : 20 Koh Sek Lim Road NEWater Visitor Centre Singapore 486593 Phone: 65467874 65467874 Email: pub_newatervc@pub.gov.sg Getting to NEWater Visitor Centre: Nearest MRT station: Tanah Merah (Exit A) Bus Services available: 12, 24, 31 & 38 Opening Hours: 9am – 5.30pm (Tuesdays to Sundays, including Public Holidays) (Closed on Mondays) Singapore Water Exchange Address : 84 Toh Guan Road East Singapore 608501 Email: pub_sgwx@pub.gov.sg Getting to Singapore Water Exchange: By Bus: 183, 106, 963, 173 By MRT: From Bukit Batok MRT - Bus 173, 189, 963 From Clementi MRT - Bus 183 From Jurong East MRT - Bus 41 , 183 Quality Service Manager Your feedback on our service quality is important to us. For service-related matters, please email us at pub_qsm@pub.gov.sg and we will get back to you within three working days. For issues on water supply, used water drainage and NEWater, you can submit your feedback via the online form . Call our PUB 24-hour Call Centre at 1800-2255-782 1800-2255-782 (Toll-Free Line) or at 6521-6470 6521-6470 to send us urgent feedback on major pipe bursts and water interruptions. If you suspect a scam, you may also call this number to verify if the call you received from a PUB officer is genuine. Whistleblowing Channel PUB Whistleblowing Channel is an independent line for employees, contractors, customers and stakeholders of PUB to report any unethical, fraudulent or corrupt practices, in good faith, without fear of retaliation, for investigation and action subject to applicable laws. Types of whistleblowing reports Electronic Report Physical Report To submit a electronic report: Please go through the guidelines below. Please submit your details in the online form . To indicate that you have read and you agree to the guidelines, please click on the hyperlink \"guidelines\" to open the window and tick on the check box at the bottom of the page. Please click submit after checking all your info and attached files are included. Guidelines to read before using the Whistleblowing channel: The whistleblowing channel is part of PUB’s feedback channel. Reporting must be done in good faith. To encourage responsible use of the whistleblowing channel, you must identify yourself and indicate your name and contact details in the report. Your identity and the concerns or irregularities raised by you will be treated with confidence and every effort will be made to ensure that confidentiality is maintained throughout the process. In reporting any unethical, fraudulent or corrupt activity, you shall, to the best of your ability, ensure that the information you provide is accurate. Your report should include details of : dates or period of time of the suspected activity staff involved and place (name and location) value of any money or asset involved any external parties involved (name, description and address) how you came to know about the suspected activity any potential sources of additional information about the matter in question This whistleblowing guidelines is intended to provide a framework to promote responsible and secure whistleblowing and protect genuine whistleblowers from any unfair treatment as a result of their report. A whistleblower, whether an external party or employee, makes an allegation in good faith but it is not confirmed by the investigation, no action will be taken against him or her. If, however, he or she has made an allegation frivolously, maliciously or for personal gain, appropriate or disciplinary action may be taken against him or her, as the case may be, including reporting the matter to the police. Upon completion and submission of your report, you will receive an acknowledgement receipt with a reference number. Please keep the receipt for future reference. Filter by Topics How to Reach Us Locations More Information Online Help and Feedback Forms Send us an enquiry or feedback . Alternatively, you can download the myENV App from the App Store and Google Play store to get online help and send feedback. Toll-Free 24hr Call Centre (Local) To contact us, you can call 1800-CALL-PUB*. You may also reach us at 65216470. *Airtime charges apply for mobile calls to 1800 service lines; only calls from regular land lines are free of charge. 24hr Call Centre (International) To contact us from overseas, you can use the following number: 62255782 . PUB Headquarters Address: 40 Scotts Road #22-01 Environment Building Singapore 228231 Singapore Water Academy Address: 80 Toh Guan Road East WaterHub Singapore 608576 Email: pub_sgwa@pub.gov.sg Marina Barrage Address: 8 Marina Gardens Drive Marina Barrage Singapore 018951 Phone: 65145959 65145959 NEWater Visitor Centre Address : 20 Koh Sek Lim Road NEWater Visitor Centre Singapore 486593 Phone: 65467874 65467874 Email: pub_newatervc@pub.gov.sg Getting to NEWater Visitor Centre: Nearest MRT station: Tanah Merah (Exit A) Bus Services available: 12, 24, 31 & 38 Opening Hours: 9am – 5.30pm (Tuesdays to Sundays, including Public Holidays) (Closed on Mondays) Singapore Water Exchange Address : 84 Toh Guan Road East Singapore 608501 Email: pub_sgwx@pub.gov.sg Getting to Singapore Water Exchange: By Bus: 183, 106, 963, 173 By MRT: From Bukit Batok MRT - Bus 173, 189, 963 From Clementi MRT - Bus 183 From Jurong East MRT - Bus 41 , 183 Quality Service Manager Your feedback on our service quality is important to us. For service-related matters, please email us at pub_qsm@pub.gov.sg and we will get back to you within three working days. For issues on water supply, used water drainage and NEWater, you can submit your feedback via the online form . Call our PUB 24-hour Call Centre at 1800-2255-782 1800-2255-782 (Toll-Free Line) or at 6521-6470 6521-6470 to send us urgent feedback on major pipe bursts and water interruptions. If you suspect a scam, you may also call this number to verify if the call you received from a PUB officer is genuine. Whistleblowing Channel PUB Whistleblowing Channel is an independent line for employees, contractors, customers and stakeholders of PUB to report any unethical, fraudulent or corrupt practices, in good faith, without fear of retaliation, for investigation and action subject to applicable laws. Types of whistleblowing reports Electronic Report Physical Report To submit a electronic report: Please go through the guidelines below. Please submit your details in the online form . To indicate that you have read and you agree to the guidelines, please click on the hyperlink \"guidelines\" to open the window and tick on the check box at the bottom of the page. Please click submit after checking all your info and attached files are included. Guidelines to read before using the Whistleblowing channel: The whistleblowing channel is part of PUB’s feedback channel. Reporting must be done in good faith. To encourage responsible use of the whistleblowing channel, you must identify yourself and indicate your name and contact details in the report. Your identity and the concerns or irregularities raised by you will be treated with confidence and every effort will be made to ensure that confidentiality is maintained throughout the process. In reporting any unethical, fraudulent or corrupt activity, you shall, to the best of your ability, ensure that the information you provide is accurate. Your report should include details of : dates or period of time of the suspected activity staff involved and place (name and location) value of any money or asset involved any external parties involved (name, description and address) how you came to know about the suspected activity any potential sources of additional information about the matter in question This whistleblowing guidelines is intended to provide a framework to promote responsible and secure whistleblowing and protect genuine whistleblowers from any unfair treatment as a result of their report. A whistleblower, whether an external party or employee, makes an allegation in good faith but it is not confirmed by the investigation, no action will be taken against him or her. If, however, he or she has made an allegation frivolously, maliciously or for personal gain, appropriate or disciplinary action may be taken against him or her, as the case may be, including reporting the matter to the police. Upon completion and submission of your report, you will receive an acknowledgement receipt with a reference number. Please keep the receipt for future reference. Contact Us Help and Feedback Report Vulnerability Privacy Statement Terms of Use © 2025 Government of Singapore Last Updated 08 Mar 2024"
    },
    {
      "url": "https://guiltyseabeachbar.com/contact-us/",
      "text": "Contact Guilty Sea Sports Pub Today Skip to content (727)-361-2220 We’re known for our amazing Sandwiches, Wings, & Burgers! 301 Gulf Boulevard\nIndian Rocks Beach, FL\n33785 Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Menu Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Gift Cards Contact Us Click Here Contact Info Phone : (727)-361-2220 Address : 301 Gulf Boulevard Indian Rocks Beach,FL 33785 info@guiltysea.com Location Hours : Mon, Tue, Wed, Thur, Fri 4:00PM - 12:00AM Sat, Sun 11:00AM - 12:00AM Social Media Contact  US NOW OR STOP BY TODAY For guest comments or suggestions please feel free to send us an inquiry or tell us how to how to contact you by completing the form below. Name * Email * Phone Number Message Submit Order Specials Reservations Parties Catering First Name * Last Name * Address * City * State * Your Email * Select the subject of your comment or question from the list in the box below. You may find answers to your questions on our Wedding FAQ page or Restaurant FAQ page. —Please choose an option— Reservation Request Restaurant Staff Restaurant Food Gift Certificates Weddings Banquets Lodging Tours Employment Website Comment Please tell us how you learned about us... Search Engine Advertisement Website Friend/Colleague Other Contact Us www.bonappetitrestaurant.com Subscribe to Newsletter * indicates required field Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. Hours Mon, Tue, Wed, Thur, Fri 4:00PM - 12:00AM Sat, Sun 11:00AM - 12:00AM Quick Links Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Menu Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Contact Us (727)-361-2220 301 Gulf Boulevard Indian Rocks Beach, FL 33785 info@guiltysea.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. © GuiltySea-Sports-Pub | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://www.guiltyseabeachbar.com/about",
      "text": "About Guilty Sea Sports Pub Skip to content (727)-361-2220 We’re known for our amazing Sandwiches, Wings, & Burgers! 301 Gulf Boulevard\nIndian Rocks Beach, FL\n33785 Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Menu Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Gift Cards About Guilty Sea WHY GUILTY SEA? Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. CONSIDER US\nYOUR SECOND HOME Guilty Sea Sports Pub has great food and a great atmosphere to help you unwind and watch all your favorite teams all season long! View Menu Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. Hours Mon, Tue, Wed, Thur, Fri 4:00PM - 12:00AM Sat, Sun 11:00AM - 12:00AM Quick Links Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Menu Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Contact Us (727)-361-2220 301 Gulf Boulevard Indian Rocks Beach, FL 33785 info@guiltysea.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. © GuiltySea-Sports-Pub | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://guiltyseabeachbar.com/",
      "text": "Guilty Sea Sports Pub - Indian Rocks Beach, FL Skip to content (727)-361-2220 We’re known for our amazing Sandwiches, Wings, & Burgers! 301 Gulf Boulevard\nIndian Rocks Beach, FL\n33785 Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Menu Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Gift Cards Welcome To GUILTY SEA SPORTS PUB B ook A T able *Powered By OpenTable 1 Person 2 Person 3 Person 4 Person 28.6.2023 29.6.2023 30.6.2023 01.7.2023 11:30am 12:00pm 02:45pm 05:30pm RESERVE TABLE Why Guilty Sea? We are blessed with the opportunity to take this journey as an adventure into something fun… I likened this location as if it were a ship. So a ship’s name would be fitting. I like the names of sailing vessels, trawlers, or ships some are unique. When I said The Guilty Sea Sports Pub, no one said no. And so it goes an adventure into our sports pub as a new addition to our Crabby Bill’s family brands. Even if everyone doesn’t like the name we can agree it’s different.-Matt Sr. Loder. Contact Us Upcoming Events DJ Vegas Jay Friday, September 12 9:00 PM - 1:00 AM See All Upcoming Events Trivia Wednesday, September 17 7:00 PM - 9:00 PM Trivia Now Rotating Locations Each Week Between Guilty Sea & Monstah Lobstah IRB See All Upcoming Events Dueling Pianos Friday, September 19 8:00 PM - 11:00 PM Join us EVERY 3rd FRIDAY for Dueling Pianos! See All Upcoming Events DJ Vegas Jay Friday, September 26 9:00 PM - 1:00 AM See All Upcoming Events Trivia Wednesday, October 01 7:00 PM - 9:00 PM Trivia Now Rotating Locations Each Week Between Guilty Sea & Monstah Lobstah IRB See All Upcoming Events DJ Vegas Jay Friday, October 03 9:00 PM - 1:00 AM See All Upcoming Events Previous Next Menu Highlights Starters Smash Burger Sandwiches Drinks View Starters Menu Crispy Crab Cake $15.00 with lump crab, crispy fried, with remoulade Mozzarella Cheese Logs $12.00 fried and sprinkled with parmesan. served with marinara Beer Battered Onion Rings $9.50 Served with ranch Fried Dill Pickle Chips $8.50 Hand breaded and served with ranch Big Guilty Mac Burger $18.00 Two patties, lettuce, pickles, onions, yellow American cheese and special sauce on a brioche bun BBQ Brisket Burger $16.00 Smoked brisket, sweet BBQ, beer battered onion rings, and American cheese Bacon Cheddar Burger $15.50 Applewood smoked bacon, cheddar cheese, and grilled onions Guilty Burger $14.00 Guilty sauce, lettuce, tomato, onion, and American cheese Jersey Style Clam Roll $16.00 hand breaded clam strips piled on a buttered split top roll with shredded lettuce and tartar Crab Cake Sandwich $17.00 with lump crab, crispy fried, on a buttered bun with remoulade and shredded lettuce Tampa Cuban $14.00 sliced pork, ham, and salami on buttered pressed Tampa made Cuban bread with pickles, mayo, and mustard Real Grouper Sandwich $20.00 The local's favorite! Served blackened or fried on a buttered bun with lettuce, tomato, onion, and tartar sauce Red Sangria $10.00 Made in house daily Duke Smash $12.00 Duke Bourbon, muddled blackberries, simple syrup, club soda, splash of fresh lemon juice Pineapple Express $11.00 Patron Silver, Patron Citronge, Homemade sour mix, Pineapple juice Original Margarita $11.00 La Adelita Blanco, Triple Sec, Homemade Margarita Mix Book Your Next Party With us! Parties Full Bar Our Drinks Enjoy Fresh, Inspired Cooking Our Menu Specials Wednesday September 10th HAPPY HOURS || MONDAY TO FRIDAY || 4PM-6PM Crowd Pleasers || $12 PITCHERS | $18 BEER BUCKETS ALUMINUM Walk the Plank || $5 BACARDI | $5 LUNAZUL | $6 TITO’S | $6 JACK DANIELS | $6 FORD’S GIN | $7 BUFFALO TRACE Guilty Cocktails || $6 LUNAZUL MARGARITA | $9 FAMILY BRANDS OLD FASHIONED FT. BUFFALO TRACE Quickies || $4 FIREBALL | $4 DIRTY MONKEY | $5 TULLAMORE DEW GREEN TEA SHOTS Guilty Pleasures || $3 WELLS | $4 DOMESTIC DRAFTS | $4 HOUSE WINES DAILY SPECIAL: SMASHBURGER SERVED WITH FRIES || ONLY $10 (excludes big guilty burger) |\r\n\r\nALL YOU CAN EAT FRIED SHRIMP WITH FRIES AND SLAW || ONLY $25 All Specials History OVER THE YEARS 1976 The Beginnings Peter Kreuziger and Chef Karl Riedl opened Bon Appétit Restaurant on Dunedin’s waterfront in 1976. 1986 Break Through Top-notch service, and breathtaking views to Dunedin and Tampa Bay since opening on the coastline in 1976. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. 1996 New Locations Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. A sport pub experience on the beach Menu Don’t miss a single game Events Full Bar Drinks Private  Parties Host your special event at Guilty Sea Sports Pub. We also have table games and live entertainment waiting for you and your fam. So prepare to experience your game at a different level and start living like a champion. Book a Party Book Your Next Party With us ! Our semi-private dining room is available for large parties of up to 46 people. Reserve your party today by giving us a call at (727)-361-2220. Reviews Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. Hours Mon, Tue, Wed, Thur, Fri 4:00PM - 12:00AM Sat, Sun 11:00AM - 12:00AM Quick Links Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Menu Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Contact Us (727)-361-2220 301 Gulf Boulevard Indian Rocks Beach, FL 33785 info@guiltysea.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. © GuiltySea-Sports-Pub | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://guiltyseabeachbar.com/specials/",
      "text": "Special Offers at Guilty Sea Sports Pub Skip to content (727)-361-2220 We’re known for our amazing Sandwiches, Wings, & Burgers! 301 Gulf Boulevard\nIndian Rocks Beach, FL\n33785 Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Menu Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Gift Cards OVERTIME SPECIALS Wednesday September 10th HAPPY HOURS || MONDAY TO FRIDAY || 4PM-6PM Crowd Pleasers || $12 PITCHERS | $18 BEER BUCKETS ALUMINUM Walk the Plank || $5 BACARDI | $5 LUNAZUL | $6 TITO’S | $6 JACK DANIELS | $6 FORD’S GIN | $7 BUFFALO TRACE Guilty Cocktails || $6 LUNAZUL MARGARITA | $9 FAMILY BRANDS OLD FASHIONED FT. BUFFALO TRACE Quickies || $4 FIREBALL | $4 DIRTY MONKEY | $5 TULLAMORE DEW GREEN TEA SHOTS Guilty Pleasures || $3 WELLS | $4 DOMESTIC DRAFTS | $4 HOUSE WINES DAILY SPECIAL: SMASHBURGER SERVED WITH FRIES || ONLY $10 (excludes big guilty burger) |\r\n\r\nALL YOU CAN EAT FRIED SHRIMP WITH FRIES AND SLAW || ONLY $25 Thursday September 11th HAPPY HOURS || MONDAY TO FRIDAY || 4PM-6PM Crowd Pleasers || $12 PITCHERS | $18 BEER BUCKETS ALUMINUM Walk the Plank || $5 BACARDI | $5 LUNAZUL | $6 TITO’S | $6 JACK DANIELS | $6 FORD’S GIN | $7 BUFFALO TRACE Guilty Cocktails || $6 LUNAZUL MARGARITA | $9 FAMILY BRANDS OLD FASHIONED FT. BUFFALO TRACE Quickies || $4 FIREBALL | $4 DIRTY MONKEY | $5 TULLAMORE DEW GREEN TEA SHOTS Guilty Pleasures || $3 WELLS | $4 DOMESTIC DRAFTS | $4 HOUSE WINES DAILY SPECIAL: $1 WINGS ANY STYLE || MINIMUM OF 10 WINGS |\r\n\r\n$17 AYCE BONELESS WINGS | ANY SAUCE Friday September 12th HAPPY HOURS || MONDAY TO FRIDAY || 4PM-6PM Crowd Pleasers || $12 PITCHERS | $18 BEER BUCKETS ALUMINUM Walk the Plank || $5 BACARDI | $5 LUNAZUL | $6 TITO’S | $6 JACK DANIELS | $6 FORD’S GIN | $7 BUFFALO TRACE Guilty Cocktails || $6 LUNAZUL MARGARITA | $9 FAMILY BRANDS OLD FASHIONED FT. BUFFALO TRACE Quickies || $4 FIREBALL | $4 DIRTY MONKEY | $5 TULLAMORE DEW GREEN TEA SHOTS Guilty Pleasures || $3 WELLS | $4 DOMESTIC DRAFTS | $4 HOUSE WINES Saturday September 13th Sunday September 14th Monday September 15th HAPPY HOURS || MONDAY TO FRIDAY || 4PM-6PM Crowd Pleasers || $12 PITCHERS | $18 BEER BUCKETS ALUMINUM Walk the Plank || $5 BACARDI | $5 LUNAZUL | $6 TITO’S | $6 JACK DANIELS | $6 FORD’S GIN | $7 BUFFALO TRACE Guilty Cocktails || $6 LUNAZUL MARGARITA | $9 FAMILY BRANDS OLD FASHIONED FT. BUFFALO TRACE Quickies || $4 FIREBALL | $4 DIRTY MONKEY | $5 TULLAMORE DEW GREEN TEA SHOTS Guilty Pleasures || $3 WELLS | $4 DOMESTIC DRAFTS | $4 HOUSE WINES DAILY SPECIAL: ALL YOU CAN EAT SNOW CRAB LEGS & FRIED SHRIMP WITH FRIES AND SLAW || ONLY $65 Tuesday September 16th HAPPY HOURS || MONDAY TO FRIDAY || 4PM-6PM Crowd Pleasers || $12 PITCHERS | $18 BEER BUCKETS ALUMINUM Walk the Plank || $5 BACARDI | $5 LUNAZUL | $6 TITO’S | $6 JACK DANIELS | $6 FORD’S GIN | $7 BUFFALO TRACE Guilty Cocktails || $6 LUNAZUL MARGARITA | $9 FAMILY BRANDS OLD FASHIONED FT. BUFFALO TRACE Quickies || $4 FIREBALL | $4 DIRTY MONKEY | $5 TULLAMORE DEW GREEN TEA SHOTS Guilty Pleasures || $3 WELLS | $4 DOMESTIC DRAFTS | $4 HOUSE WINES DAILY SPECIAL: ALL YOU CAN EAT SNOW CRAB LEGS & FRIED SHRIMP WITH FRIES AND SLAW || ONLY $65 Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. Hours Mon, Tue, Wed, Thur, Fri 4:00PM - 12:00AM Sat, Sun 11:00AM - 12:00AM Quick Links Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Menu Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Contact Us (727)-361-2220 301 Gulf Boulevard Indian Rocks Beach, FL 33785 info@guiltysea.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. © GuiltySea-Sports-Pub | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://guiltyseabeachbar.com/about-guilty-sea/",
      "text": "About Guilty Sea Sports Pub Skip to content (727)-361-2220 We’re known for our amazing Sandwiches, Wings, & Burgers! 301 Gulf Boulevard\nIndian Rocks Beach, FL\n33785 Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Menu Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Gift Cards About Guilty Sea WHY GUILTY SEA? Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. CONSIDER US\nYOUR SECOND HOME Guilty Sea Sports Pub has great food and a great atmosphere to help you unwind and watch all your favorite teams all season long! View Menu Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. Hours Mon, Tue, Wed, Thur, Fri 4:00PM - 12:00AM Sat, Sun 11:00AM - 12:00AM Quick Links Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Menu Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Contact Us (727)-361-2220 301 Gulf Boulevard Indian Rocks Beach, FL 33785 info@guiltysea.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. © GuiltySea-Sports-Pub | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://guiltyseabeachbar.com/rewards/",
      "text": "Join Our Rewards Program Today | Guilty Sea Sports Pub Skip to content (727)-361-2220 We’re known for our amazing Sandwiches, Wings, & Burgers! 301 Gulf Boulevard\nIndian Rocks Beach, FL\n33785 Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Menu Home Menu Specials Drinks Order Pick-up/Delivery UberEats Live Music & Events Catering Reservation Contact Shop Jobs Rewards Gift Cards Guilty Sea Rewards Dive Into Amazing Rewards! Earn points just for dining with us and redeem them for exceptional rewards! Not a member yet? Join now and get $5 OFF on your next visit. Join Now How It Works? Earn Points Receive points with every dollar spent at the Original Crabby Bill’s Get Rewarded Use points to redeem available rewards that include menu items and exclusive experiences Loyal Benefits Receive additional benefits as you reach new membership status, such as surprise rewards Are You Already A Member? Sign in Here About Bon Appétit The critically acclaimed Bon Appétit Restaurant has been bringing exquisite cuisine, top-notch service, and breathtaking views to Dunedin and Tampa Bay since opening on the coastline in 1976. Guests enjoy panoramic views of St. Joseph’s Sound and a stunning vista that includes Honeymoon Island, Caladesi Island, and Clearwater Beach. Featuring an award-winning menu with an emphasis on seafood and international cuisine, Chef Cirino Cruz and his team focus on highlighting simple, fresh ingredients. Throughout the busy season (January – May), the kitchen team premieres special menu features – a testament to their creative eye and signature style. A full lunch and dinner menu is always available for both our indoor dining room, as well as our outdoor bar and marina café. We are honored to have you at our table and are here to ensure you and your guests have a wonderful meal. Please let us know if we can do anything to make your experience here one to remember. Thank you and Bon Appetit !! Bon Appetit is proud part of The Original Crabby Bills Family Brandsfrom our team Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. Hours Mon, Tue, Wed, Thur, Fri 4:00PM - 12:00AM Sat, Sun 11:00AM - 12:00AM Quick Links Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Menu Specials Drinks Order Parties Catering Live Music & Events Shop About Guilty Sea Jobs Contact Us (727)-361-2220 301 Gulf Boulevard Indian Rocks Beach, FL 33785 info@guiltysea.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up Welcome to your second home, Guilty Sea Sports Pub. Located on Indian Rocks Beach, we are guilty of bringing fun to the beach. So indulge yourself for a good time with your favorite sports, games, ice-cold beer, and a selected menu inspired by all the true fanatics in the area and the world. © GuiltySea-Sports-Pub | All rights reserved. | Terms, Privacy, and ADA Compliance"
    }
  ]
}