{
  "fuentes": [
    {
      "url": "https://tstays.com/what-to-do/best-breakfast-gulf-drive-cafe/",
      "email": "reservations@tstays.com"
    },
    {
      "url": "https://gulfcoastgrillcenter.com/contact-us/",
      "email": "joe@gulfcoastgrillcenter.com"
    },
    {
      "url": "https://annamariaislandchamber.org/directory-search/gulf-drive-cafe-kokonut-hut-2/",
      "email": "info@annamariaislandchamber.org"
    },
    {
      "url": "https://www.gulfcoastcf.org/contact-us",
      "email": "info@gulfcoastcf.org"
    },
    {
      "url": "https://datagraphs.com/contact-us",
      "email": "info@datalanguage.com"
    },
    {
      "url": "https://datagraphs.com/contact-us",
      "email": "sales@datagraphs.com"
    },
    {
      "url": "https://datagraphs.com/contact-us",
      "email": "u003esales@datagraphs.com"
    },
    {
      "url": "https://www.gulfstreammarine.com/team-category/team/",
      "email": "gsm-logo-white@2x.png"
    },
    {
      "url": "https://www.gulfstreammarine.com/team-category/team/",
      "email": "gsm-logo@2x.png"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "bkk.reservation@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "dmm.sales@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "doha.sales@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gfusca@aviaworldna.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "groups.russia@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "jed.sales@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "maa.sales@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "mct.sales@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "mnl.reservation@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "nevine.adel@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "ruh.sales@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "res.dac@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "russia@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "switzerland@aviareps.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "tlv.sales@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "ticketing@pashatravel.az"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "venkataraman.subramanian@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "admin@falcontravel.travel"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "airport.tbs@voyager.ge"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "auh.helpdesk@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "cantkt@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "contactfrance@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "del.res@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "doha.reservations@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "dxb.helpdesk@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gfkul@abadi.com.my"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gfres.bom@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gfsaleshkg@groupmcl.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gfselpax@wex.co.kr"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gfusca@aviaworldna.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair.ams@aviareps.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair@airlinerepservices.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair@aviationservices.com.sg"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair@discoverspain.net"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair@goldstar.gr"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair@gozengsa.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair@orthodoxou.com.cy"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfair@rephouse.it"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "gulfaircmb@keells.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "hyd.res@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "jomon.mani@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "kalpana@president.com.np"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "res.masm@keells.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "res@gulfair-jo.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "reservations.kuwait@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "salah.muftah@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "sales@shebatravel.net"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "shatkt@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "trv.res@gulfair.com"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "email": "u003egroups.russia@gulfair.com"
    },
    {
      "url": "https://tstays.com/what-to-do/cafes-guide-gulf-drive-cafe/",
      "email": "reservations@tstays.com"
    }
  ],
  "mails": [
    "admin@falcontravel.travel",
    "airport.tbs@voyager.ge",
    "auh.helpdesk@gulfair.com",
    "bkk.reservation@gulfair.com",
    "cantkt@gulfair.com",
    "contactfrance@gulfair.com",
    "del.res@gulfair.com",
    "dmm.sales@gulfair.com",
    "doha.reservations@gulfair.com",
    "doha.sales@gulfair.com",
    "dxb.helpdesk@gulfair.com",
    "gfkul@abadi.com.my",
    "gfres.bom@gulfair.com",
    "gfsaleshkg@groupmcl.com",
    "gfselpax@wex.co.kr",
    "gfusca@aviaworldna.com",
    "groups.russia@gulfair.com",
    "gsm-logo-white@2x.png",
    "gsm-logo@2x.png",
    "gulfair.ams@aviareps.com",
    "gulfair@airlinerepservices.com",
    "gulfair@aviationservices.com.sg",
    "gulfair@discoverspain.net",
    "gulfair@goldstar.gr",
    "gulfair@gozengsa.com",
    "gulfair@orthodoxou.com.cy",
    "gulfair@rephouse.it",
    "gulfaircmb@keells.com",
    "hyd.res@gulfair.com",
    "info@annamariaislandchamber.org",
    "info@datalanguage.com",
    "info@gulfcoastcf.org",
    "jed.sales@gulfair.com",
    "joe@gulfcoastgrillcenter.com",
    "jomon.mani@gulfair.com",
    "kalpana@president.com.np",
    "maa.sales@gulfair.com",
    "mct.sales@gulfair.com",
    "mnl.reservation@gulfair.com",
    "nevine.adel@gulfair.com",
    "res.dac@gulfair.com",
    "res.masm@keells.com",
    "res@gulfair-jo.com",
    "reservations.kuwait@gulfair.com",
    "reservations@tstays.com",
    "ruh.sales@gulfair.com",
    "russia@gulfair.com",
    "salah.muftah@gulfair.com",
    "sales@datagraphs.com",
    "sales@shebatravel.net",
    "shatkt@gulfair.com",
    "switzerland@aviareps.com",
    "ticketing@pashatravel.az",
    "tlv.sales@gulfair.com",
    "trv.res@gulfair.com",
    "u003egroups.russia@gulfair.com",
    "u003esales@datagraphs.com",
    "venkataraman.subramanian@gulfair.com"
  ],
  "nombre_sitio": "gulfdrivetiki.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tstays.com/what-to-do/best-breakfast-gulf-drive-cafe/",
      "text": "BEST BREAKFAST - GULF DRIVE CAFE - TStays Home About Properties What To Do Blog Contact Login Login Need an account? Register here! Forgot Password? Register I agree with terms & conditions A password will be e-mailed to you Register Back to Login Reset Password Reset Password Return to Login Home About Properties What To Do Blog Contact Menu Home About Properties What To Do Blog Contact Book Your Stay BEST BREAKFAST – GULF DRIVE CAFE Best Breakfast , Casual Dining Anna Maria Island, FL 900 Gulf Dr N, Bradenton Beach, FL 34217, United States View Map +1 941-778-1919 gulfdrivetiki.com Read Recent Reviews Categories Casual Dining Best Pizza Best Burgers Best Subs Best Chinese Food Best Mexican Food Best Brunch Best Kid Friendly Restaurants Best Barbecue Food Best Tex-Mex Best Patio Dining Best Sushi Best Vegan Restaurants Best Fast Casual Best Breakfast Best Wings Best Vietnamese Food Best Diner Best Gluten Free Restaurants Fine Dining Best Seafood Best Steakhouses Best Romantic Restaurants Best Fine Dining Best Restaurants with a View Bars and Cafes Cafes Guide Best Sports Bars Breweries Best Cocktails Live Music Venues Best Happy Hours Best Karaoke Liquor & Treats Best Wine Shops Best Liquor Stores Best Ice Cream and Treats Best Italian bakery Activities Golf Courses Tennis Courses Beach Guide Fishing Charter Guide Kayaking Festivals and Fairs Watersports Amusement Parks Aquariums and Zoos Dolphin Tours and Water Excursions Sunset Cruises Spa and Wellness Family Activities Bike Rentals Best Massage Horse Riding Eco Tourism Options Boating Segways and Segway Tours Jet Surfing Swimming with Manatees Snorkel and Skimboards Gym and Fitness Beach Workout Groups Island Tours Boat Tours Kids fun Sightseeing Watching Sunrise Best Marinas Area Piers Parks & Preserves Florida Wildlife Eco-Tourism Options Events & Nightlife AMI Events Guide Weddings Guide Nightlife Guide Arts, Culture and Museums Guide Festivals and Fairs Guide Photographers Guide Transportation Island Transportation Trolley guide Airport transportation Car Rentals Guide Golf Carts Guide Shopping & Accommodations Fish Markets guide Food & Grocery Shopping Holiday Shopping Guide to Buying Local Arts & Souvenirs Farmer’s Market Guide Guide to Rental Equipments Concierge Services Guide Accomodations & Resorts Guide Spa & Wellness Guide Weather & Local Knowledge Island info Weather Guide Local Emergency Guide Hurricane Info & Public Safety Latest Area News Medical Facilities and Pharmacies Vacation Planning Guide City All Cities Anna Maria Island, FL Navarre Beach, FL Other  Interesting Places You Might Like: BEST ACTIVITIES – AMC BRADENTON CINEMA Learn More AQUARIUMS AND ZOOS – MOTE MARINE LABORATORY AND AQUARIUM Learn More BEST RESTAURANTS – THE RIVERHOUSE WATERFRONT RESTAURANT Learn More ARTS, CULTURE & MUSEUM GUIDE – SARASOTA’S CLASSIC CAR MUSEUM Learn More AMUSEMENTS PARKS – JUMPIN FUN INFLATA PARK Learn More BEST BURGERS – SKINNY’S PLACE Learn More GULF DRIVE CAFE BEGINNINGS & HISTORY The Gulf Drive Café opened in 1981 and has been a local and tourist favorite on Anna Maria Island ever since. George and Wendy Kokolis, the current owners, bought the historic property in 1987. Over the course of 45 years, Kokolis’ significant experience in the restaurant sector has grown. After celebrating almost 20 years as proprietors, they chose to rebuild and extend the Café into The Kokonut Hut, a bar, and The Sunset by Gulf Drive Café, an event venue. Owner George Kokolis George Kokolis, who had spent his whole life in the restaurant sector and had trained as a chef, had always wanted to have his own restaurant. “I’ve been in the business for 47 years and I worked many years to make this dream come true. I’ve owned four restaurants, each one bigger than the one before, but I never dreamed I would own a place as big as Gulf Drive Café,” he says. “The place I owned prior to this I did the volume all year that I put out in one month here.” That volume is attributable in part to distinctive breakfast, lunch, and dinner products such as Belgian waffles and Gulf grouper dinners fished locally. “Guests come in and reminisce about coming here to have the waffles when we were considered the breakfast place on the island,” George Kokolis says. “Time has brought about many changes to the café but we still serve the same favorites the guests love.” Gulf Drive Cafe & The Kokonut Hut The property is on 2 acres of the Gulf of Mexico coastline and includes a variety of amenities for guests to enjoy. Delicious meals, superb service, chilled beverages, and live entertainment are all part of the package. A notable diving area and underwater archaeological preservation are directly in front of the company. Local and visiting divers dive to see The Regina, a sugar barge that drowned in 1940 while transporting more than 300,000 liters of molasses from Havana, Cuba. BEST BREAKFAST ON AMI : GULF DRIVE CAFE Best Breakfast – Gulf Drive Cafe At this time the Gulf Drive Cafe serves coffee and breakfast with a breathtaking view of the Gulf. It’s easy to understand why Southern Living Magazine named this restaurant one of the “greatest breakfasts in Florida” after a visit! Breakfast is available until 1 p.m., so you may have Beignets, street tacos, and Banana Foster French toast. There’s something for everyone’s taste, so the whole family will be happy. The Gulf Drive Cafe is also a terrific place to spend lunch or supper! CUSTOMER REVIEWS Below are a few sample reviews from Google. A Google reviewer wrote: As you are traversing Anna Maria island, there are multiple dining options. Gulf Drive Cafe provides a beautiful beachfront location with ample covered outdoor seating overlooking the gulf. Service was excellent, and attentive. Food was excellent and fairly priced. If you are looking for the beach dining experience, this is it. Amazing food and outstanding staff right on the beach, what more could you ask for Our Location Looking for Vacation Inspiration? Sign up to enjoy exclusive benefits and for personalized recommendations. Submit TStays is a family owned property management company, with a focus on Family and Couples Vacation Destinations. CONTACT 934 Massachusetts Avenue, Arlington MA 02476 (941) 242-7775 reservations@tstays.com FOLLOW US Facebook Instagram Airbnb OUR PROPERTIES Mare é Fiori View Property Dunes View Property 2023 TStays™. All Rights Reserved. Website by SalesElevation . Privacy Policy Terms Contact Privacy Policy Terms Contact × Log in to your account Login Don't have an account? | Forgot Password Create an account I agree with terms & conditions Create an account *A password will be e-mailed to you Already a member? Sign in! Forgot Password Reset Password Return to Login"
    },
    {
      "url": "https://gulfcoastgrillcenter.com/contact-us/",
      "text": "Contact Us Page - Gulf Coast Grill Center Skip to content Home Outdoor Kitchens Outdoor Kitchens Get Estimate Services Propane Delivery BBQ Grill Cleaning BBQ Grill Repair Portable Grill / Smoker Our Grills Our Grills Grill Types Brands Napoleon Grills – Phantom Series American Made Grills Big Green Egg Alfresco Grills Gallery Learn Blog Get Estimate Grill Types About Us About Us Contact Us Page Gallery Privacy Policy X Contact Us Contact Us Get your Grill On! We’d love to hear from you. Please fill out this form Name Email Message Phone Upload Photos -10MB max each. Send Get in touch with us Don't hesitate to contact us for more information Don’t hesitate to reach out to us with any questions or for expert advice. At Gulf Coast Grill Center, we’re here to help you with all your outdoor kitchen, grill, and propane needs. Your perfect outdoor space is just a call or message away. Click to get an Estimate! Address 7976 Seminole Blvd. Suite 3\nSeminole, Fl 33772 Phone Number (727) 564-9626 Email Address joe@gulfcoastgrillcenter.com Follow us on social : Icon-facebook Icon-linkedin Icon-instagram-1 Youtube Home About Us Contact Our Grills Estimate Propane Office Address 7976 Seminole Blvd. Suite 3 Seminole, Fl 33772 Phone & Email : (727) 564-9626 / joe@gulfcoastgrillcenter.com Visit Us Facebook-f Instagram Youtube Copyright © 2024 Shirt Brain Custom Products, Inc."
    },
    {
      "url": "https://annamariaislandchamber.org/directory-search/gulf-drive-cafe-kokonut-hut-2/",
      "text": "Gulf Drive Cafe & Kokonut Hut - Anna Maria Island Chamber of Commerce Call us Anna Maria Island Chamber of Commerce Call today 941-778-1541 Facebook Twitter Instagram Youtube Pinterest LinkedIn Jobs Request Info Join Now MENU MENU Directory Where to Stay Where to Eat Where to Shop Fun & Leisure Weddings Special Events Home Services Professional Services Relocation Resources Community Resources View All Categories Events About our Island Events Community Events Chamber Events Submit Your Event Event & Scholarship Forms About Demographics, Climate, Wildlife Anna Maria Island History Volunteer Opportunities Job Listings Subscribe to Our Newsletter Community Coupons Island Trolley About the Trolley Track the Trolley Advertise on the Trolley Trolley Giving Back Program Membership Membership Account Become a Member Learn How We Can Help You Staff Ambassadors Board of Directors Contact Gulf Drive Cafe & Kokonut Hut Home » Gulf Drive Cafe & Kokonut Hut Restaurants/Bars/Delis/Markets Where to Eat Contact Information Phone: 941-778-1919 Address: 900 Gulf Dr N ,  Bradenton Beach, FL 34217 Website: GulfDriveTiki.com Map Contact Contact This Business Owner Your Name (required) Your Email (required) Your Message Found 586 listings N/A Featured McNary Law Legal Services Professional Services If you’re navigating a divorce, resolving custody issues or preparing an estate plan to protect what matters most, our firm is committed to safeguarding your rights, securing your future and guiding you through every step of the legal process with clarity & confidence Phone: 941-345-1662 Address: 1904 Manatee Ave W, Second floor, ,  Bradenton, Florida, United States 34205 Website: mcnary.law N/A Featured Fun Boat Tours Fun and Leisure Recreational - Adventures/Tours Fun Boat Tours offers daily dolphin tours, sunset cruises, and private charters. Departing Holmes Beach along the waters of Anna Maria Island, Tampa Bay, and Palma Sola Bay, you’ll view the wildlife with the mangrove islands, fishing villages, and the Sky Way Bridge as your backdrop. Phone: 941-400-2763 Address: 5501 Marina Dr ,  Holmes Beach FL 34217 Website: FunBoatTours.com N/A Featured LuxBlack Enterprise Fun and Leisure Transportation and Shuttle Services Reliable & personalized transportation service from AMI to/from various airports like TPA, SRQ, PIE, MCO, PGD, RSW & MIA. If you are planning a night out, whether its pleasure or business, we will take you and bring you back to your place. Every ride includes cold drinks and snacks. Car [...] Phone: 941-301-5158 Address: Serving Bradenton-Sarasota Website: LuxBlackEnterprise.com N/A Featured Cannons Marina Fun and Leisure Recreational - Adventures/Tours Recreational Rentals - Water/Air/Land Boat Rentals on Longboat Key – Easy, Fun, and Hassle-Free!\nAt Cannons Marina, we make boating and boat rentals on Longboat Key a breeze! Choose from the area’s best selection of new rental boats, available for half-day, full-day, or multi-day rentals.\nEnjoy crystal-clear Gulf waters, explore nearby sandbars, or cruise the Intracoastal [...] Phone: 941-383-1311 Address: 6040 Gulf of Mexico Drive – ICW Marker 33 ,  Longboat Key, FL, United States 34228 Website: CannonsMarina.com N/A Featured Florida West Coast Airport Transportation Fun and Leisure Transportation and Shuttle Services Florida West Coast Airport Transportation in Bradenton, FL specializes in high quality and reliable airport transfer services. Offering convenient, punctual, professional transportation to and from major airports, their fleet ensures a comfortable travel experience. They cater to individuals, families, and groups ensuring customer satisfaction. Phone: 941-324-5413 Address: Serving the West Coast of Florida , , Florida, United States 34217 Website: FlWestCoast-Transportation.com N/A Featured Ace Online Marketing Marketing Products/Services Professional Services Ace Online Marketing are experts in all things online. We’ll turbo charge your online traffic through direct emails, social media and fine tuning your website for driving sales and customer acquisition. Phone: 941-725-6285 Address: 101 S. Bay Blvd. Ste. 2 ,  Anna Maria, FL, United States 34216 Website: AceOnlineMarketing.com N/A Featured Anchor Down Real Estate and Rentals Property Management Real Estate Companies - Listing Relocation Resources Our mission is to provide a customer experience that exceeds industry standards through communication, effective management and a pricing structure that keeps the “income” of your investment as a priority.\nOur entire management system was developed with an “owner mentality” and it contributes to everything we do. Here at Anchor Down [...] Phone: 941-301-8629 Address: 9801 Gulf Dr., Unit 9 ,  Anna Maria, FL 34216 Website: BradentonPropertyManagement.com N/A Featured Lourdes Boutique Retail - Clothing/Accessories/Jewelry/Gifts Where to Shop Handcrafted items. Coverups, pants, skirts, tops, bags, all handmade with a Brazilian weaving technique. Phone: 941-713-3947 Address: 119 Bridge Street, Ste. 235 ,  Bradenton Beach, FL, United States 34217 N/A Featured Island Cabinets & Design Builders/Contractors/Construction & Maintenance Services Home Services Providing all your cabinetry needs in one place: Kitchens/Baths, Outdoor Kitchens, Bars, Entertainment Centers, Home Offices, Closets, & Garages. We love to work with our clients, to take your dreams & ideas and make them a reality that will last for years to come! Phone: (248) 802-7802 Address: 5508 Marina Dr., Unit B ,  Holmes Beach, FL, United States 34209 Website: IslandCabinetsandDesign.com N/A Featured Ace Handling LLC Roofing Home Services We are a family owned and operated full service roof replacement and repair company.  We specialize in roof coatings, asphalt and architectural shingle, tile, modified bitumen, EPDM and TPO.  We also seal and tint pavers, as well a pressure/soft wash roofs and all exterior spaces.  We are [...] Phone: 941-681-52149 Address: Serving Manatee & Sarasota Counties , , United States Website: AceHandlingRoofs.comServing Show more listings Anna Maria Island 5313 Gulf Drive, Holmes Beach, FL 34217 941-778-1541 info@annamariaislandchamber.org Facebook Twitter Instagram Youtube Pinterest LinkedIn © Anna Maria Island Chamber of Commerce . All rights reserved. Digital marketing by Two Oceans Digital . Site Map | ADA Website Compliance | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.gulfcoastcf.org/contact-us",
      "text": "Contact Us | Gulf Coast Community Foundation Skip to main content Search Search Share Facebook Twitter Linkedin Google + Email Ways to Give Grants Scholarships Contact Us Room Rentals Donor Log-in Give Now About Us Board Staff Mission, Vision, & Values Financials & Stewardship Strategic Plan 2024-2027 Careers Our Impact Arts & Culture Civic & Economic Development Disaster Response Education Environment Health & Human Services Professional Advisors Why Gulf Coast CAP® Study Group Let's Partner Together Your Resource Blog Your Philanthropy Ways To Give Creating Your Fund Donor Stories Your Philanthropy Team Community Partners Grants Gulf Coast Leadership Institute Invest In Incredible I3 Digital Room Rentals Media & Events Blog In the News Workshops Publications Brand Toolkit 2024 Impact Report Donor Login Donate Now Get In Touch Contact Us For Media Inquiries please call Kelly Carlstein, Vice President of Brand Strategy, 941.486.4618 Connect With Us Room Requests Click Here Headquarters 601 Tamiami Trail South Venice, FL 34285 941.486.4600 Get Directions Philanthropy Center 1549 State Street Sarasota, FL 34236 941.777.1270 Get Directions Media Inquiries Kelly Carlstein 941.486.4618 Email info@gulfcoastcf.org Fax 941.486.4699 Fill out my online form . Contact Headquarters 601 Tamiami Trail South Venice, FL 34285 941.486.4600 Philanthropy Center 1549 State Street Sarasota, FL 34236 941.777.1270 Email info@gulfcoastcf.org Brand Toolkit EIN 59-1052433 SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. SUBSCRIBE TO OUR ENEWS Learn more about how we transform our region. required Email Address * First Name Last Name no thanks Give Now Gulf Coast can accept online donations for a number of selected funds and organizations. Give Now Find Us on Donor Log-In Board Portal Grants Scholarships Contact Us Privacy Policy Sitemap Copyright 2025 Gulf Coast Community Foundation All Rights Reserved"
    },
    {
      "url": "https://datagraphs.com/contact-us",
      "text": "Contact Data Graphs: Get in Touch with Our Team Product Technology Solutions By Use Case GraphRAG AI AI Product Deployment Knowledge Hub Reference Data Management Multi Modal Asset Management Digital Labeling By Industry Media and Entertainment Sports Global Brands AgriTech News and Publishing Healthcare See all Solutions Company About Us Contact News Request a Demo Partner Program Resources Knowledge Base Developer SDK API Docs Blog Demo Get in touch If you want to know more, we would really love to hear from you Leatherhead Office Riverbridge House Guildford Road Leatherhead KT22 9AD United Kingdom London Office Unit 110, Business Design Centre 52 Upper St London N1 0QH United Kingdom Switzerland Office Wunderraum Büro Churerstrasse 54 8808 Pfäffikon Switzerland Copyright © 2025 Data Language. All Rights Reserved. Data Graphs Home Product Technology Support Information Privacy Policy Terms Social Responsibility Trust Center Follow Us @ datagraphs / datagraphs"
    },
    {
      "url": "https://www.gulfstreammarine.com/team-category/team/",
      "text": "Team | Gulf Stream Marine Operating Hours Customer Access LOGISTEC News CAREERS Why Us Our Expertise Network Brownsville Cedar Port Corpus Christi Freeport Houston Care Terminal Manchester Terminal Lake Charles Pascagoula Safety & Environment Contact Us Select Page Archives for Michel Miron 16 October 2019 Read more Michel Miron 16 October 2019 Michel Miron is Vice-President of Operations in Montreal. Michel is responsible for all aspects of the operations for the cargo handling and stevedoring activities in Canada with a main focus on health and safety.Michel has over 25 years of hands-on experience in the... Read more Michel Miron 16 October 2019 Michel Miron is Vice-President of Operations in Montreal. Michel is responsible for all aspects of the operations for the cargo handling and stevedoring activities in Canada with a main focus on health and safety.Michel has over 25 years of hands-on experience in the... Read more Search for: Recent Posts BLUE WOLF CAPITAL FINALIZES ACQUISITION OF LOGISTEC CORPORATION IN PARTNERSHIP WITH STONEPEAK AND NAMES NEW CHIEF EXECUTIVE OFFICER LOGISTEC Named Terminal Operator of the Year and Wins an Award in Safety  at the International 2021 Heavy Lift Awards LOGISTEC and Gulf Stream Marine Officially Certify Five Terminals in the U.S. Gulf Coast LOGISTEC and Gulf Stream Marine Continue their Commitment to Green Marine Environmental Program by Certifying Five Terminals in the U.S. Gulf Coast Gulf Stream Marine Pursues its Strategic Expansion with the Asset Acquisition of Coastal Cargo of Texas Inc. and Gulf Coast Storage Inc. Archives January 2024 October 2021 June 2021 January 2021 July 2020 June 2020 October 2019 CONTACT US [email protected] Tel: (713) 926-7611 10000 Manchester Street, Ste. C Houston, Texas 77012 Investors Media Legal Notice Contact Us Â© 2024 Gulf Stream Marine We use cookies to enhance your user experience and analyze how our website is used. You may manage your cookie preferences by accessing the banner on the left-hand side of your screen. Cookie settings ACCEPT Manage consent Close Cookie Settings We use the Strictly Necessary cookies, which cannot be disabled, to allow our website to function properly. We also use Performance Cookies to help us improve your user experience and Social Media Cookies to track social media users. Please note that using this website will place all cookies on your device except for the Performance Cookies and the Social Media Cookies, if you choose to disable them. Strictly Necessary Strictly Necessary Always Enabled These cookies are required for you to browse the website and use all of its functionalities. They are typically only placed in response to actions made by you which amount to a request for information, such as logging in or filling in forms. These cookies do not collect any information that can identify you personally and solely collect aggregated information which remains anonymous. Performance Cookies performance These cookies provide us with the ability to register visits and traffic sources in order to measure and improve the performance of our website. These cookies do not collect any information that can identify you personally and solely collect aggregated information which remains anonymous. By disabling these cookies, we will not know when you have visited our website and will not be able to monitor its performance. Save & Accept"
    },
    {
      "url": "https://www.gulfair.com/contact-us",
      "text": "Contact Us | Gulf Air Menu Menu Join Falconflyer Login Search Book Manage / Check-in Flight status Gulf Air Holidays Explore Falconflyer Flying with us Help Contact us About Gulf Air Board of Directors Careers Executive Management Media Center Services Book Hotels Opens in a new tab Book a car Opens in a new tab Flight Pass Opens in a new tab Travel Insurance Opens in a new tab E-Visa Transparency Conditions of Carriage Terms of Use Privacy Policy Cookie Policy Agent Debit Memo Policy Binding Corporate Rules Refund Policy Bahrain Stopover Conditions Prepaid Seat Selection Terms and Conditions Passenger Rights Optional services fees U.S. Passenger Service Policy Tarmac Delays Other Cargo Flight Status Gulf Air App Cookie Consent Subscribe to our Newsletter to receive updates on deals Sign up for our newsletter and receive the latest updates, offers and promotions straight to your inbox. Mr Mrs. Sign up By signing up to the Gulf Air Newsletter, you consent to receive marketing and promotional emails to the email address provided and agree to the terms & conditions and privacy policy We want to hear from you Improving our customers' experiences whether at the airport, in the air or online is our primary focus. Share feedback Opens in a new tab Contact us All right reserved © 2025 - Gulf Air Privacy Policy Terms & Conditions Sitemap Chat with Saqer"
    },
    {
      "url": "https://tstays.com/what-to-do/cafes-guide-gulf-drive-cafe/",
      "text": "CAFES GUIDE - GULF DRIVE CAFE - TStays Home About Properties What To Do Blog Contact Login Login Need an account? Register here! Forgot Password? Register I agree with terms & conditions A password will be e-mailed to you Register Back to Login Reset Password Reset Password Return to Login Home About Properties What To Do Blog Contact Menu Home About Properties What To Do Blog Contact Book Your Stay CAFES GUIDE – GULF DRIVE CAFE Bars and Cafes , Cafes Guide Anna Maria Island, FL 900 Gulf Dr N, Bradenton Beach, FL 34217, United States View Map +1 941-778-1919 gulfdrivetiki.com Read Recent Reviews Categories Casual Dining Best Pizza Best Burgers Best Subs Best Chinese Food Best Mexican Food Best Brunch Best Kid Friendly Restaurants Best Barbecue Food Best Tex-Mex Best Patio Dining Best Sushi Best Vegan Restaurants Best Fast Casual Best Breakfast Best Wings Best Vietnamese Food Best Diner Best Gluten Free Restaurants Fine Dining Best Seafood Best Steakhouses Best Romantic Restaurants Best Fine Dining Best Restaurants with a View Bars and Cafes Cafes Guide Best Sports Bars Breweries Best Cocktails Live Music Venues Best Happy Hours Best Karaoke Liquor & Treats Best Wine Shops Best Liquor Stores Best Ice Cream and Treats Best Italian bakery Activities Golf Courses Tennis Courses Beach Guide Fishing Charter Guide Kayaking Festivals and Fairs Watersports Amusement Parks Aquariums and Zoos Dolphin Tours and Water Excursions Sunset Cruises Spa and Wellness Family Activities Bike Rentals Best Massage Horse Riding Eco Tourism Options Boating Segways and Segway Tours Jet Surfing Swimming with Manatees Snorkel and Skimboards Gym and Fitness Beach Workout Groups Island Tours Boat Tours Kids fun Sightseeing Watching Sunrise Best Marinas Area Piers Parks & Preserves Florida Wildlife Eco-Tourism Options Events & Nightlife AMI Events Guide Weddings Guide Nightlife Guide Arts, Culture and Museums Guide Festivals and Fairs Guide Photographers Guide Transportation Island Transportation Trolley guide Airport transportation Car Rentals Guide Golf Carts Guide Shopping & Accommodations Fish Markets guide Food & Grocery Shopping Holiday Shopping Guide to Buying Local Arts & Souvenirs Farmer’s Market Guide Guide to Rental Equipments Concierge Services Guide Accomodations & Resorts Guide Spa & Wellness Guide Weather & Local Knowledge Island info Weather Guide Local Emergency Guide Hurricane Info & Public Safety Latest Area News Medical Facilities and Pharmacies Vacation Planning Guide City All Cities Anna Maria Island, FL Navarre Beach, FL Other  Interesting Places You Might Like: BEST ACTIVITIES – AMC BRADENTON CINEMA Learn More AQUARIUMS AND ZOOS – MOTE MARINE LABORATORY AND AQUARIUM Learn More BEST RESTAURANTS – THE RIVERHOUSE WATERFRONT RESTAURANT Learn More ARTS, CULTURE & MUSEUM GUIDE – SARASOTA’S CLASSIC CAR MUSEUM Learn More AMUSEMENTS PARKS – JUMPIN FUN INFLATA PARK Learn More BEST BURGERS – SKINNY’S PLACE Learn More GULF DRIVE CAFE BEGINNINGS & HISTORY The Gulf Drive Café opened in 1981 and has been a local and tourist favorite on Anna Maria Island ever since. George and Wendy Kokolis, the current owners, bought the historic property in 1987. Over the course of 45 years, Kokolis’ significant experience in the restaurant sector has grown. After celebrating almost 20 years as proprietors, they chose to rebuild and extend the Café into The Kokonut Hut, a bar, and The Sunset by Gulf Drive Café, an event venue. Owner George Kokolis George Kokolis, who had spent his whole life in the restaurant sector and had trained as a chef, had always wanted to have his own restaurant. “I’ve been in the business for 47 years and I worked many years to make this dream come true. I’ve owned four restaurants, each one bigger than the one before, but I never dreamed I would own a place as big as Gulf Drive Café,” he says. “The place I owned prior to this I did the volume all year that I put out in one month here.” That volume is attributable in part to distinctive breakfast, lunch, and dinner products such as Belgian waffles and Gulf grouper dinners fished locally. “Guests come in and reminisce about coming here to have the waffles when we were considered the breakfast place on the island,” George Kokolis says. “Time has brought about many changes to the café but we still serve the same favorites the guests love.” Gulf Drive Cafe & The Kokonut Hut The property is on 2 acres of the Gulf of Mexico coastline and includes a variety of amenities for guests to enjoy. Delicious meals, superb service, chilled beverages, and live entertainment are all part of the package. A notable diving area and underwater archaeological preservation are directly in front of the company. Local and visiting divers dive to see The Regina, a sugar barge that drowned in 1940 while transporting more than 300,000 liters of molasses from Havana, Cuba. AT THE GULF DRIVE CAFE, YOU MAY HAVE A FUN FRUITY COCKTAIL! Best Breakfast – Gulf Drive Cafe At this time the Gulf Drive Cafe serves coffee and breakfast with a breathtaking view of the Gulf. It’s easy to understand why Southern Living Magazine named this restaurant one of the “greatest breakfasts in Florida” after a visit! Breakfast is available until 1 p.m., so you may have Beignets, street tacos, and Banana Foster French toast. There’s something for everyone’s taste, so the whole family will be happy. The Gulf Drive Cafe is also a terrific place to spend lunch or supper! CUSTOMER REVIEWS Below are a few sample reviews from Google. A Google reviewer wrote: As you are traversing Anna Maria island, there are multiple dining options. Gulf Drive Cafe provides a beautiful beachfront location with ample covered outdoor seating overlooking the gulf. Service was excellent, and attentive. Food was excellent and fairly priced. If you are looking for the beach dining experience, this is it. Amazing food and outstanding staff right on the beach, what more could you ask for Our Location Looking for Vacation Inspiration? Sign up to enjoy exclusive benefits and for personalized recommendations. Submit TStays is a family owned property management company, with a focus on Family and Couples Vacation Destinations. CONTACT 934 Massachusetts Avenue, Arlington MA 02476 (941) 242-7775 reservations@tstays.com FOLLOW US Facebook Instagram Airbnb OUR PROPERTIES Mare é Fiori View Property Dunes View Property 2023 TStays™. All Rights Reserved. Website by SalesElevation . Privacy Policy Terms Contact Privacy Policy Terms Contact × Log in to your account Login Don't have an account? | Forgot Password Create an account I agree with terms & conditions Create an account *A password will be e-mailed to you Already a member? Sign in! Forgot Password Reset Password Return to Login"
    }
  ]
}