{
  "fuentes": [
    {
      "url": "https://352today.com/news/257752-habitat-ocala-strawberry-festival-raises-funds-and-spirits/",
      "email": "news@352today.com"
    },
    {
      "url": "https://habitatocala.org/strawberry-festival-rev/",
      "email": "jblack@habitatocala.org"
    },
    {
      "url": "https://www.habitatla.org/about-us/board-and-staff/",
      "email": "info@habitatla.org"
    },
    {
      "url": "https://habitatocala.org/homeownership/",
      "email": "tarens@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/volunteering/",
      "email": "aburrows@habitatocala.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "ajacoby@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "aprichard@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "avaldivia@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "avanlandingham@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "dclark@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "dcollins@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "development@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "eburgard@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "epatrick@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "gjohnston@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "icraib@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "info@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "jbuzzell@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "jgutierrez@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "jhenn@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "jklippel@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "jplayer@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "jspencer@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "kdeiber@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "kdunn@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "kkopala@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "klockamy@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "kmilner@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "kpaolucci@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "ldennis@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "lhindley@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "lmcvey@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "mmack@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "msigmund@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "nzaretsky@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "rsanchez@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "rturlington@orangehabitat.org"
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "email": "tphillips@orangehabitat.org"
    },
    {
      "url": "https://www.habitatocala.org/strawberry-festival",
      "email": "jblack@habitatocala.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "20donate@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "20info@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "homerepairs@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "homerepairs@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "development@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "finance@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "homeownership@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "info@habitatgsf.org"
    },
    {
      "url": "https://habitatgsf.org/team/",
      "email": "invoices@habitatgsf.org"
    },
    {
      "url": "https://www.ocala.com/story/entertainment/local/2014/02/27/strawberry-festival-to-sweeten-downtown/31934399007/",
      "email": "rick.allen@starbanner.com"
    },
    {
      "url": "https://habitatocala.org/strawberry/",
      "email": "jblack@habitatocala.org"
    },
    {
      "url": "https://352today.com/news/257752-habitat-ocala-strawberry-festival-returns-with-car-show-live-entertainment-and-family-fun/",
      "email": "news@352today.com"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "aburrows@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "bpeters@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "cgarcia@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "dunderwood@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "jblack@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "jjames@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "jlamb@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "jruttenber@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "mbadge@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "rpeters@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "tarens@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "tlanning@habitatocala.org"
    },
    {
      "url": "https://habitatocala.org/staff/",
      "email": "tpokorny@habitatocala.org"
    }
  ],
  "mails": [
    "20donate@habitatgsf.org",
    "20info@habitatgsf.org",
    "aburrows@habitatocala.org",
    "ajacoby@orangehabitat.org",
    "aprichard@orangehabitat.org",
    "avaldivia@orangehabitat.org",
    "avanlandingham@orangehabitat.org",
    "bpeters@habitatocala.org",
    "cgarcia@habitatocala.org",
    "dclark@orangehabitat.org",
    "dcollins@orangehabitat.org",
    "development@habitatgsf.org",
    "development@orangehabitat.org",
    "dunderwood@habitatocala.org",
    "eburgard@orangehabitat.org",
    "epatrick@orangehabitat.org",
    "finance@habitatgsf.org",
    "gjohnston@orangehabitat.org",
    "homeownership@habitatgsf.org",
    "homerepairs@habitatgsf.org",
    "icraib@orangehabitat.org",
    "info@habitatgsf.org",
    "info@habitatla.org",
    "info@orangehabitat.org",
    "invoices@habitatgsf.org",
    "jblack@habitatocala.org",
    "jbuzzell@orangehabitat.org",
    "jgutierrez@orangehabitat.org",
    "jhenn@orangehabitat.org",
    "jjames@habitatocala.org",
    "jklippel@orangehabitat.org",
    "jlamb@habitatocala.org",
    "jplayer@orangehabitat.org",
    "jruttenber@habitatocala.org",
    "jspencer@orangehabitat.org",
    "kdeiber@orangehabitat.org",
    "kdunn@orangehabitat.org",
    "kkopala@orangehabitat.org",
    "klockamy@orangehabitat.org",
    "kmilner@orangehabitat.org",
    "kpaolucci@orangehabitat.org",
    "ldennis@orangehabitat.org",
    "lhindley@orangehabitat.org",
    "lmcvey@orangehabitat.org",
    "mbadge@habitatocala.org",
    "mmack@orangehabitat.org",
    "msigmund@orangehabitat.org",
    "news@352today.com",
    "nzaretsky@orangehabitat.org",
    "rick.allen@starbanner.com",
    "rpeters@habitatocala.org",
    "rsanchez@orangehabitat.org",
    "rturlington@orangehabitat.org",
    "tarens@habitatocala.org",
    "tlanning@habitatocala.org",
    "tphillips@orangehabitat.org",
    "tpokorny@habitatocala.org"
  ],
  "nombre_sitio": "habitatocala.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://352today.com/news/257752-habitat-ocala-strawberry-festival-raises-funds-and-spirits/",
      "text": "Habitat Ocala Strawberry Festival raises funds and spirits - 352today Close ✕ Search Ocala 78° F Explore Home News Community Crime & Safety Equine Health & Wellness Sports Weather Updates Trending Features 352’s Local Expert Best of the 352 Local Deals 352 Seasonal Guides Contests Contest Rules Things To Do Events Submit Events Entertainment Weather Forecast Hurricane Weather Center Obituaries About Newsletter Signup Advertise With Us Careers Submit News Habitat Ocala Strawberry Festival raises funds and spirits The festival takes place Saturday, March 2, at the McPherson Government Complex from 9 a.m. until 5 p.m. and features more than 230 vendors, a car show, a pie-eating contest, and, of course, STRAWBERRIES. By Kathy Dugan February 28, 2024 4:04 pm Facebook X LinkedIn 352today Kathy Dugan/352today Order your flats of strawberries early from Habitat for Humanity of Marion County's Ocala Strawberry Festival before they sellout. OCALA, FL ( 352today.com ) – Habitat for Humanity of Marion County’s Ocala Strawberry Festival is celebrating its 10th year on Saturday, March 2, at the McPherson Government Complex from 9 a.m. until 5 p.m. Arrive early so that you can take the entire day to soak in the festivities. Getting there early will also help you secure a good parking spot with the assistance of volunteers from the Marion Therapeutic Riding Association (MTRA). The $5 parking fee helps support MTRA. With over 230 different vendors, a bigger-than-ever car show featuring cool vehicles, BMX shows, and a pie-eating contest, there’s something for everyone. Musical performances include the Petty Experience Band and Chris Patti , a Frank Sinatra tribute artist. There will be no shortage of shortcakes and other strawberry delights. Courtesy: Kathy Dugan/352today The festival offers visitors an opportunity to purchase fresh strawberries. The pre-sale price for a flat is $20 each .  You can reserve your flat and pick it up on Friday, March 1, from the white tent at the McPherson complex. The flats sell out quickly during the festival, so it’s advisable to reserve yours. “They’re from Plant City,” said Joanne Black, development director for Habitat for Humanity of Marion County. “We actually get with a farmer down in Plant City.” You can also indulge in a variety of strawberry treats, including pies, strawberry shortcakes and more. A fun feature of the festival is the dedicated kid’s zone which includes a petting zoo. Kids and adults alike are invited to learn about different animals in a hands-on setting. Kids (and grownups) can get hands-on with the animals at the petting zoo in the Kids Zone. Courtesy: Kathy Dugan/352today Your participation in the festival plays a key role in furthering Habitat for Humanity’s mission of building a new home each year known as the “Strawberry House.”  The proceeds from the festival directly support the construction of affordable housing for low-income families. Get ready to have a “berry” good time at the Habitat Ocala Strawberry Festival while contributing to Habitat for Humanity as they continue to build homes and enrich lives. Facebook X LinkedIn Kathy Dugan Kathy is what is called a \"River Rat\" from Dunnellon, spending a lot of time on the beautiful Rainbow River growing up.  She's spent 18+ years in radio news and more than 30 years as a journalist. She holds an AA in Mass Communications from the College of Central Florida. Story © 2024 Saga Communications - Images © 2024 Saga Communications More in Entertainment WEEKEND TOP PICKS: A Mashup of Fall-Themed Fun, Live Shows and More Horseback Riding in Marion County is an Autumn Experience that's Magical in Nature City of Belleview Announces 2025 Light Up Lake Lillian Holiday Celebration Editor's Picks WEEKEND TOP PICKS: A Mashup of Fall-Themed Fun, Live Shows and More Marion County Sheriff's Office Investigating Fatal Stabbing on W Highway 326 Defunct Ocala - Eerie Acres: Chiefland's Once-Spooky Halloween Haven Trending TRAFFIC ALERT: Serious Crash on State Road 200 in Front of Lowe’s Causing Major Delays Ocala Police Seek Help Identifying Woman Accused of Racking Up $11,000 in Fraudulent Charges Marion County Sheriff's Office Investigating Fatal Stabbing on W Highway 326 Top Stories Entertainment 18 minutes ago WEEKEND TOP PICKS: A Mashup of Fall-Themed Fun, Live Shows and More This weekend features fall fun, live shows and markets for everyone to enjoy early fall celebrations and lively events. Crime & Safety 22 hours ago Marion County Sheriff’s Office Investigating Fatal Stabbing on W Highway 326 A man died from stab wounds after a violent incident in northwest Ocala. Detectives with the Marion County Sheriff’s Office are actively investigating the homicide. Features 1 day ago Defunct Ocala – Eerie Acres: Chiefland’s Once-Spooky Halloween Haven Exploring the lost landmarks and attractions that shaped Marion County’s past. Local 20 hours ago TRAFFIC ALERT: Double Lane Closures on Northbound I-75 in Ocala Begin September 14 Nighttime construction will reduce I-75 northbound traffic to a single lane from County Road 462 to County Road 484 through Sept. 19 as part of ongoing infrastructure improvements. Weather Updates 9 minutes ago WEEKEND WEATHER:  Sunny Mornings with Scattered Afternoon Storms Expected this Weekend. Ocala can expect mostly sunny skies during the mornings this weekend, with a chance of scattered thunderstorms each afternoon, according to the National Weather Service. Highs will stay in the mid to upper 80s. Newsletter Signup Privacy Policy Terms of Use AI Use Policy Advisory Public Notice - Non-Discriminatory Ad Contracts Some images copyright AP, Clipart.com © Copyright 2025 Saga Communications, Inc , All rights reserved. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://habitatocala.org/strawberry-festival-rev/",
      "text": "Strawberry Festival - REV - Habitat for Humanity of Marion County Donate Now Skip to content Home homeownership Application for Homeownership FAQs volunteer ways to volunteer events Women Build Bowl2Build Hookin’ For Habitat Fishing Tournament Strawberry Festival All Events ReStore visit us make a donation donate Make A Donation ways to donate Builders Circle Corporate Sponsorship Hope Builders land donations Legacy Builder vehicle donations about who we are board of directors staff financials & policies careers Habitat News pressroom contact Habitat Ocala Strawberry Festival Festival hosted by Habitat for Humanity of Marion County featuring live music, entertainment, vendors, food, & STRAWBERRIES. All proceeds go towards the building of a new, affordable home for a low income family. 601 SE 25 th Avenue Ocala, Fl 34471 jblack@habitatocala.org Saturday, March 4th, 2023 9:00am-5:00pm Quick Links Vendor Become a vendor at the 2023 festival! Entertainment 2023 entertainment list coming soon! Car Show Signup today for the 2023 Car Show. Sponsor Become a sponsor of one of the BIGGEST events in Marion County. Volunteer Signup to volunteer at our upcoming festival. Event Details Ready for a “Berry” good time? The 8th annual Habitat Ocala Strawberry Festival is coming to the McPherson complex on Saturday, March 4, 2023. The festival begins at 9 am with FREE admission and ends at 5 pm. Volunteers from Marion Therapeutic Riding Association (MTRA) will assist with traffic control and parking for the festival. Proceeds collected from parking ($5 per vehicle) will benefit the Marion Therapeutic Riding Association and Habitat for Humanity of Marion County. The festival starts with over 230 unique and exciting vendors, a kid’s zone with a petting zoo, strawberry food items that melt in your mouth, a bigger-than-ever car show with cool cars, trucks, and motorcycles, a pie-eating contest, a BMX show. Top-notch entertainment will be with performances from the Petty Experience Band, and Chris Patti, a Great Crooners and Frank Sinatra Tribute Artist. Many nonprofits will have vendor booths, and Several photo booths will be available. The festival offers fresh strawberries (from Plant City farmers) to purchase with many delicious strawberry treats. Come watch the strawberry pie eating contest. The festival is for all ages, there is food for all tastes and fun for all generations of festival-goers. Habitat for Humanity could not host this event without our dedicated volunteers who have donated their time, efforts, and knowledge to assist. There are over 700 volunteers assisting throughout the festival. Habitat would like to thank all our wonderful and dedicated sponsors for helping us host another great event. All proceeds raised at the annual Strawberry Festival will be used to build a new home which will be called the Strawberry House for low-income families with an affordable mortgage and a safe and secure environment to raise their children. For more information visit www.habitatocala.org/strawberry . Our Vendors Our Habitat Ocala Strawberry Festival boasts numerous vendor booths. From strawberry vendors to local merchants, check out our current 2023 Vendor List or download our 2023 Vendor Map by clicking the links below. Download 2023 Vendor Map PDF ➜ CLICK HERE TO VIEW 2023 VENDOR LIST 2023 Vendor List A1 Lilla Rose A5 Rustic Charm by Don A11 SWEET BOTTOMS AROMATHERAPY A13 Boho Goat Goat Milk Soap A18 Bayou Billy Sweet Tea A19 Bayou Billy Sweet Tea A20 Children’s education fund A21 Children’s education fund A27 Brian’s Bites Concessions A28 Brian’s Bites Concessions AA1 Calypso Kettle Corn AA2 Calypso Kettle Corn B1 Knottyline Sticker and Shades B2 Knottyline Sticker and Shades B6 Lularoe with Lauren O. B-17 Breadbreakers Ministries C1 SACRED EARTH CRYSTALS C2 SACRED EARTH CRYSTALS C2 Swinehearts Chattahoochee Gold Sauce C3 Handmade By Me C5 EF High School Exchange Year C8 Lunar Light Bowtique C9 The Licorice Guy & Bags from the Beach C10 The Licorice Guy & Bags from the Beach C13 Ellie’s Rico Dulces LLC C14 Kelly Garcia Creations C15 Kelly Garcia Creations C21 Nana’s Circle of Love C24 Primos Kitchen C25 Primos Kitchen C26 Primos Kitchen D1 Pampered Chef with Karin Van Duzee D7 Warren’s Power Washing D15 Stoneton Gems D17 Gaskins Honey Co D18 Sunflower Bag Co D19 Florida National Cemetery D23 Bev’s Craft Boutique D24 GWRRA FL1-F2 Ocala Gold Wing Chapter D25 GWRRA FL1-F2 Ocala Gold Wing Chapter E1 Gizmoe, Inc E-2 Gizmoe, Inc E7 Ocala Electric E-8 Above Artistic E20 The Krafty Kettle, LLC F-1 F2 F9 Get Reel Fishing Apparel – (RBFT Enterprises LLC) F10 Get Reel Fishing Apparel – (RBFT Enterprises LLC) F11 G1 Dixie Fixins G12 Townecraft Mkgt G2 Dixie Fixins G4 Lewis Woodworks G9 Mismatched stitches H1 H2 H9 Little Luvin Stitches I1 Troll Treasures I6 Nessiknacks0301 I11 DS Jewelry & Creations j1 j2 J9 Art Wood and Glass K1 k2 K5 Trinity Baptist Church Ocala K11 Diane’s Cornhole Bags L1 L2 N1 Kona Ice Ocala N2 Kona Ice Ocala O1 Stanford’s jerky O6 Real Spices of NY O7 Stained Gorgeous P1 The Tea Jug P2 The Tea Jug P6 COSaction  Convention of States P11 The Coastal Farmhouse Q1 Fun Time Foods Q7 First Baptist Church of Ocala Q8 First Baptist Church of Ocala R1 Fun Time Foods S1 Two Chubby Seacows S11 Marion County Sheriff’s Foundation S12 Marion County Sheriff’s Foundation S2 Em’s Cryo Treats S25 LifeSouth Community Blood Centers S26 Beautiful Creatures’ Farm To You Revue S27 Beautiful Creatures’ Farm To You Revue S35 Kona Ice Ocala S-6 Walking Dog Toys (horses,cats,unicorns,pigs toys) Close Become A Vendor Thank you for supporting Habitat for Humanity of Marion County and the Habitat Ocala Strawberry Festival! We are excited that you want to become a vendor for our upcoming festival. Register now by clicking the link below to a part of a unique event and experience a festival like no other! Register to become a vendor ➜ Vendor Information Habitat wants all vendors to do well therefore there is a limited number of vendors selling the same products permitted at the event. Vendor spaces will not be assigned until application fees are paid in full. Vendor spaces are 12×12 in grassy area. Vendors must provide their own tent, table, and chairs. Corner spaces, electricity, and meal deals are optional with additional fees. Register for the festival as soon as possible to hold your vendor space as they sell fast. If you would like to register as a vendor but unsure if you will be approved, please send an email to our Development Director, Joanne Black, at jblack@habitatocala.org with the items you would like to sell, she will respond as soon as possible so you can register for the event. Entertainment BMX Trickstars BMX Trickstars will return for another year – sponsored by The Tobacco Free Partnership of Marion County! BMX Trickstars is an all-inclusive traveling BMX stunt show that was started by X-Games medalist Rob Nolli to bring an exciting display of BMX bike stunts and freestyle tricks to events across the nation. With over 30 years of experience, our shows offer flatland freestyle and high flying ramp action from Florida’s most professional, experienced, and innovative bicycle stunt riders. Live Music We’ll be jammin’ out to live music at the 2023 Habitat Ocala Strawberry Festival! Top-notch live entertainment will rock out on stage with performances by The Petty Experience Band, Chris Patti, a Great Crooners, and Frank Sinatra Tribute Artist. 2023 Auto Show Auto Show for all types of vehicles! Enter your TRUCK, CAR, MOTORCYCLE, or UNIQUE VEHICLE for a chance to win Best of the Best in the vehicle category, bragging rights, and a cool trophy. The show offers music, chance drawings, split the pot, plus access to the Habitat Strawberry Festival! Price to Enter: $20 – Before February 15TH $25 – After February 15TH I WANT TO ENTER THE CAR SHOW Become A Sponsor Become a sponsor of one of the BIGGEST events in Marion County! We have many different levels that suit your needs including recognizing your business in different ways. Just click the button below to view our different sponsorship opportunities. View Sponsorship Opportunities ➜ View Sponsorship Rules & Regulations ➜ If you do not see a sponsorship level that suits your needs, please contact Joanne at jblack@habitatocala.org to design a level just for your business. Become a sponsor of one of Marion County’s biggest festival events and the Strawberry House as well as helping a low-income family become a home owner with affordable monthly mortgage payments. Become A Volunteer READ THE VOLUNTEER APPLICATION WAIVER THEN FILL OUT THE FORM BELOW: Click here to view/download waiver ➜ All volunteers must have a Release and Waiver of Liability form submitted prior to any hours of service. You can read the waiver below, then fill out the form below and submit your information to our Volunteer Coordinator. Habitat for Humanity of Marion County is a locally run affiliate of Habitat for Humanity International, a global nonprofit housing organization. We aim to empower individuals and families to build and buy their own homes with the help of people in our community. Quick Links Apply Volunteer Donate Habitat ReStore Events Contact Pressroom Contact Us 1321 SE 25th Loop Suite 103 Ocala, FL 34471 Find us ➜ (P) 352-351-4663 (F) 352-351-3081 Mon-Fri | 8:00am-4:30pm Send us a message ➜ ReStore 200 ReStore 10800 SW 91st Ave, Ocala, 34481 Get directions ➜ 27th Restore 926 NW 27th Ave, Ocala, 34475 Get directions ➜ (P) 352-401-0075 Mon-Sat | 8:30am-4:30pm ©2023 Habitat for Humanity of Marion County, All rights reserved."
    },
    {
      "url": "https://www.habitatla.org/about-us/board-and-staff/",
      "text": "Habitat L.A. Executive Board and Supporting Staff Members for Sustainable Housing Navigation Who We Are About Habitat LA Our Homes Partner Homeowners Newsroom Meet Habitat LA Career Opportunities How to Apply Homeownership Habitat LA Downpayment Assistance Home Repairs Education and Counseling Neighborhood Revitalization Community Building Disaster Relief Get Involved Individual Volunteer Opportunities Team Build Opportunities Home Builders Blitz Events Advocate 2024 Election Awareness Faith and Church Habitat Young Professionals Veterans/Military Families Hollywood for Habitat for Humanity Youth Programs Become a Habitat LA Contractor Support Us Donate Items Donate Funds Donate a Car Other Ways to Give Host Your Own Fundraiser Habitat LA (PRICE) Application ReStore Locations and Hours Volunteer at ReStore Donate Items What We Sell ReStore FAQs Shop Donate Donate Now Donate Monthly Search Who We Are About Habitat LA Our Homes Partner Homeowners Newsroom Meet Habitat LA Career Opportunities How to Apply Homeownership Habitat LA Downpayment Assistance Home Repairs Education and Counseling Neighborhood Revitalization Community Building Disaster Relief Get Involved Individual Volunteer Opportunities Team Build Opportunities Home Builders Blitz Events Advocate 2024 Election Awareness Faith and Church Habitat Young Professionals Veterans/Military Families Hollywood for Habitat for Humanity Youth Programs Become a Habitat LA Contractor Support Us Donate Items Donate Funds Donate a Car Other Ways to Give Host Your Own Fundraiser Habitat LA (PRICE) Application ReStore Locations and Hours Volunteer at ReStore Donate Items What We Sell ReStore FAQs Shop Donate Donate Now Donate Monthly Search Meet Habitat LA Board of Directors Habitat LA is led by a Board of Directors who guide the organization strategically to accomplish our mission of eliminating substandard housing. Board members serve in a voluntary capacity and are not compensated for their time. Meet the Board Habitat LA Staff Our full-time staff is made up of passionate people who believe deeply in the cause of affordable housing and the promise of a more livable Greater Los Angeles. Senior Leadership Team Erin Rank President & CEO Erin Rank is the President & CEO of Habitat for Humanity of Greater Los Angeles (Habitat LA). Under her more than two decades of leadership, Habitat LA has helped build new affordable homes in partnership with thousands of volunteers each year. Habitat LA also helps people with critical home repairs, and recently helped families rebuild after the CA wildfires. Rank has led the organization to be the top nonprofit Residential Home Builder in Los Angeles four years in a row. She has held several leadership positions for Habitat for Humanity International, served as the Board Chair of Housing California, and was recently named to the Federal Home Loan Bank Affordable Housing Advisory Council. Erin has built homes in countries all around the world, and this year she celebrates her personal 1,000th home completed in Los Angeles. Her accolades include being named among the “Top 100 Irish Americans” by Irish American Magazine and she was named as “Alumni of the Year” by Pepperdine University. She received a B.A. in Psychology from the University of Missouri and a Master of Arts from Pepperdine University. Angy Smith Senior Vice President, Retail Operations Darrell Simien Senior Vice President, Community Development Francesca DiBrito Senior Vice President, Resource Development Isabel Lee Chief of Staff Dr. Dinesa Thomas-Whitman SVP of Programs & Government Relations Helen Dosta Vice President, Resource Development A. Jo-An Allen Turman, M.A. Head of Global Entertainment Partnerships for Habitat for Humanity & Real Estate Broker Join Our Team To contact a member of our staff, click here . Tel: 310-323-4663 Fax: 310-323-0789 info@habitatla.org Bellflower 8739 Artesia Blvd., Bellflower, CA 90706 Torrance 18600 Crenshaw Blvd., Torrance, CA 90504 Los Angeles 1071 S. La Brea Ave., Los Angeles, CA 90019 Habitat for Humanity of Greater Los Angeles is a registered 501(c)(3) nonprofit organization. All contributions are tax deductible. Please see our donor privacy policy. Search Quick Links Contact Us About Us Donate Volunteer Privacy Policy © 2020 Habitat for Humanity of Greater Los Angeles, all rights reserved. English العربية 简体中文 繁體中文 Nederlands English Français Deutsch Italiano 한국어 Português Русский Español ไทย Tiếng Việt Type and Press “enter” to Search Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://habitatocala.org/homeownership/",
      "text": "Homeownership - Habitat for Humanity of Marion County Donate Now Skip to content Home homeownership Application for Homeownership FAQs volunteer ways to volunteer events Women Build Bowl2Build Hookin’ For Habitat Fishing Tournament Strawberry Festival All Events ReStore visit us make a donation donate Make A Donation ways to donate Builders Circle Corporate Sponsorship Hope Builders land donations Legacy Builder vehicle donations about who we are board of directors staff financials & policies careers Habitat News pressroom contact Homeownership Stepping into a better tomorrow. Is homeownership with Habitat right for you? Habitat selects future homeowners for our homeownership program through three sets of criteria. Before you apply, make sure you have: Need For Housing We partner with families who have low to moderate incomes, and who experience crowding, expensive rent, or unsafe conditions in their current housing. Willingness To Partner All Habitat homeowners attend homebuyer education courses and invest sweat equity to help build homes. Ability To Pay Future homeowners will pay affordable mortgage payments that are around 30% of their gross monthly income. DOWNLOAD DOCUMENTATION CHECKLIST Thank you for your interest in becoming a homeowner! Our homeownership program empowers working individuals and families to build and buy their own homes. We partner with our future homeowners every step of the way, and provide the education and support needed to become successful homeowners. Ready To Apply? Click the “Begin Orientation” button below, the form will open in a new window , and you will be led through our homeownership orientation. It is important that you read each page carefully and acknowledge that you understand the content of each page. The orientation should take approximately 15 minutes to complete. After you complete the orientation, you will receive an email directing you to the Homeowner Interest Form. Make sure to fill out all the required information and pay the non-refundable $45 individual Credit Report Fee ($75 for joint applicants). Our team will respond to you within a week of submission. BEGIN ORIENTATION Frequently Asked Questions Owning a home is one of the biggest responsibilities in a person’s life, and there are always many questions and concerns regarding home ownership. Each question is important, and part of the Habitat for Humanity program is to make sure we provide the answers to those questions, so that our applicants and homeowners are well-informed. How can someone apply to the Habitat Homeownership program? View our Homeownership Orientation Fill out & submit the Homeownership Interest Form Submit the Credit Report fee – $45 per applicant ($75 joint applicants) We will be in touch with you after receipt of both the completed Homeownership Interest form & the Credit Report fee. Can I speak to a Habitat for Humanity of Marion County’s staff member one-on-one to get more information about the program? Please call 352-351-4663 and ask to speak to Tori our Family Services Director tarens@habitatocala.org Does Habitat for Humanity of Marion County give houses away? No – Habitat for Humanity is a “Hand-Up NOT a Hand-Out. Families who are in need of decent, affordable housing apply locally to Habitat for Humanity for homeownership. Their ability to repay an affordable mortgage or small loan, as well as their level of housing need and willingness to partner with Habitat, are among the selection criteria for becoming a Habitat homeowner. Who does Habitat for Humanity of Marion County serve? HFHMC builds homes and serves families and individuals in Marion County. We work in good faith with people who have a need for safe, affordable housing, have an ability to pay an affordable mortgage and who have a willingness to partner with us in the construction of their home. Family Partners are required to invest 350 hours of “sweat equity” – time spent on the build site, Homeowner Education, Habitat events, and our ReStore’s. How long does it take to get an answer after I complete the Homeownership Interest Form and submit the Credit Report fee? You should receive a response within one week of receipt. How does my credit score affect the application process? Credit history is important, and each case is reviewed on an individual basis. Does Habitat for Humanity of Marion County only accept families? We accept individuals and families living in Marion County. Where does Habitat for Humanity of Marion County build? We build in the City of Ocala, Silver Springs Shores, Marion Oaks, and Dunnellon. Do applicants have to be pre-approved by a Bank or Financial Institution? Once approved for the homeownership program, Habitat will refer you to a partner lender at the appropriate time and walk with you throughout the journey to homeownership. Are Habitat for Humanity of Marion County homeowners allowed to sell their home? Habitat partner families can sell their home at any time. However, all Habitat for Humanity of Marion County homes are built on property owned by Habitat for Humanity Community Land Trust. The trust will own the land and the homeowner will own the house and improvements (similar to a condominium). At closing, homeowner will sign a 99-year lease for the land and pay a $35 monthly ground lease fee to the Community Land Trust. If the homeowner decides to sell the property in the future, the Community Land Trust has first right of refusal to purchase the home. The purchase price will be based on a formula in the lease to determine the net equity earned while the homeowners owned the house. Can Habitat for Humanity of Marion County build on land I own? No – Habitat for Humanity of Marion County provides the land. The land is part of the Community Land Trust as stated from the above paragraph. How long will it take before I can move into a Habitat home? It can take 12-18 months from first application to the close on your new home. Family Partner Stories Check out our #FamilyPartner stories and see how Habitat for Humanity of Marion County is changing lives! Davis Family For Brittani Davis, homeownership has always been more than just a goal—it’s been a dream of providing her teenage son with the stability and security she cherished as a child. […] Read More Webb Family In July 2023, Kerri took the first step toward fulfilling that dream by joining Habitat for Humanity of Marion County. Over the past year, she has dedicated herself to the program, contributing an incredible 420 sweat equity hours. […] Read More Rehak Family Jessica Rehak’s journey with Habitat for Humanity of Marion County began in June 2022 with a dream—one of stability, security, and creating a place to truly call home. […] Read More Habitat for Humanity of Marion County is a locally run affiliate of Habitat for Humanity International, a global nonprofit housing organization. We aim to empower individuals and families to build and buy their own homes with the help of people in our community. Quick Links Apply Volunteer Donate Habitat ReStore Events Contact Pressroom Contact Us 1321 SE 25th Loop Suite 103 Ocala, FL 34471 Find us ➜ (P) 352-351-4663 (F) 352-351-3081 Mon-Fri | 8:00am-4:30pm Send us a message ➜ ReStore 200 ReStore 10800 SW 91st Ave, Ocala, 34481 Get directions ➜ 27th Restore 926 NW 27th Ave, Ocala, 34475 Get directions ➜ (P) 352-401-0075 Mon-Sat | 8:30am-4:30pm ©2023 Habitat for Humanity of Marion County, All rights reserved."
    },
    {
      "url": "https://habitatocala.org/volunteering/",
      "text": "Volunteering - Habitat for Humanity of Marion County Donate Now Skip to content Home homeownership Application for Homeownership FAQs volunteer ways to volunteer events Women Build Bowl2Build Hookin’ For Habitat Fishing Tournament Strawberry Festival All Events ReStore visit us make a donation donate Make A Donation ways to donate Builders Circle Corporate Sponsorship Hope Builders land donations Legacy Builder vehicle donations about who we are board of directors staff financials & policies careers Habitat News pressroom contact Ways To Volunteer Help us continue to build hope. Habitat For Humanity of Marion County is a volunteer driven organization, so we depend heavily on a strong volunteer base to help with our efforts. Simply put, Habitat would not exist without the help of volunteers. We’re looking for skilled and unskilled construction workers, retail workers and office help. Construction Volunteering I WANT TO VOLUNTEER AT A JOB SITE ReStore Volunteering I WANT TO VOLUNTEER AT THE RESTORE Group Volunteering OUR GROUP WANTS TO VOLUNTEER Event Volunteering Women Build 2025 event volunteer opportunities are open! I WANT TO VOLUNTEER FOR THE WOMEN BUILD Court Ordered Community Service I WANT TO VOLUNTEER Court Ordered Community Service OVERVIEW Habitat for Humanity of Marion County welcomes volunteers who are required to complete court ordered community service hours. In order to assure a positive experience, please read the following policy. QUALIFICATIONS Applicant must be at least 16 years of age with a valid ID. Charges we do not accept: – Violence (battery, domestic violence, any type of assault) – Weapon charges – Any kind of Theft – Breaking and entering (burglary and/or robbery) – Felony DUIs – Lewd behavior or Sexual Offenses – Larceny – Animal Abuse *You must bring in a copy of the court order when you come in for your volunteer orientation* REQUIREMENTS Applicant is responsible for signing in and out during your volunteer shift at the site. Habitat is not responsible for hours not logged or not signed. HOW TO APPLY To apply, contact Volunteer Manager, Angela Burrows at 352-351-4663 or email at aburrows@habitatocala.org . TERMINATION Habitat for Humanity of Marion County reserves the right to terminate agreement for court ordered community service if the participant is in any way unproductive, disruptive, or in any other way negatively impacts the accomplishment of the daily goals. Close Habitat for Humanity of Marion County is a locally run affiliate of Habitat for Humanity International, a global nonprofit housing organization. We aim to empower individuals and families to build and buy their own homes with the help of people in our community. Quick Links Apply Volunteer Donate Habitat ReStore Events Contact Pressroom Contact Us 1321 SE 25th Loop Suite 103 Ocala, FL 34471 Find us ➜ (P) 352-351-4663 (F) 352-351-3081 Mon-Fri | 8:00am-4:30pm Send us a message ➜ ReStore 200 ReStore 10800 SW 91st Ave, Ocala, 34481 Get directions ➜ 27th Restore 926 NW 27th Ave, Ocala, 34475 Get directions ➜ (P) 352-401-0075 Mon-Sat | 8:30am-4:30pm ©2023 Habitat for Humanity of Marion County, All rights reserved."
    },
    {
      "url": "https://www.orangehabitat.org/staffandboard",
      "text": "Staff and Board | Habitat for Humanity of Orange County Skip to Main Content Click here to learn more about Tropical Storm Chantal Recovery Efforts. ✕ Chantal Recovery About Back About History Impact Race and Housing Where We Build Global Staff and Board Join Our Team Services Back Homeownership Apply Weavers Grove Repairs Get Involved Back Volunteer AmeriCorps Advocacy Ways to Give Partnerships The Latest Back Blog Events Sign up for Emails ReStore Give Sign up for Emails Translate Site Search Staff and Board Our staff work on a hybrid schedule and not consistently in the office. If you’d like to speak with a specific staff member in person, please email or call to make an appointment. Leadership Jennifer Player President and CEO Office: 919-932-7077 Ext.\t\t\t215 jplayer@orangehabitat.org Advocacy This team is responsible for working with our government partners on the local, state, and national levels to increase access to affordable housing at a policy level. This team also manages our government grants program. Alice Jacoby Vice President of Policy and Advocacy Office: 919-213-7088 ajacoby@orangehabitat.org Jack Spencer Grants & Advocacy Coordinator Office: 910-359-6213 jspencer@orangehabitat.org Finance & Administration This team is responsible for the administration and operations side of keeping the affiliate running. Grace Johnston Vice President of Finance & Administration gjohnston@orangehabitat.org Alyn Valdivia Human Resources Manager Office: 919-932-7077 Ext.\t\t\t211 avaldivia@orangehabitat.org Margaret Mack Administrative Assistant Office: 919-932-7077 Ext.\t\t\t212 mmack@orangehabitat.org Homeowner Services This team is responsible for managing the people our programs serve from application to completion of construction and even post move in. Laine Hindley Vice President of Homeowner Services Office: 919-932-7077 Ext.\t\t\t213 lhindley@orangehabitat.org Robin Barrett Homeownership and Lending Manager Office: 919-932-7077 Ext.\t\t\t233 rbarrett@orangehabitat.org Kate Milner Homeownership Coordinator Office: 919-932-7077 Ext.\t\t\t236 kmilner@orangehabitat.org Logan McVey Program Manager Office: 919-932-7077 Ext.\t\t\t224 lmcvey@orangehabitat.org Derek Clark Program Coordinator Office: 910-448-6475 dclark@orangehabitat.org Emilie Patrick AmeriCorps Program Coordinator epatrick@orangehabitat.org New Home Construction This team is responsible for building the new construction homes for the homeownership program. Richard Turlington Vice President of Construction Office: 919-932-7077 Ext.\t\t\t217 rturlington@orangehabitat.org Jeni Klippel Construction Manager jklippel@orangehabitat.org Eddie Burgard Site Supervisor eburgard@orangehabitat.org Alec Vanlandingham Site Supervisor avanlandingham@orangehabitat.org Daniel Collins Site Supervisor dcollins@orangehabitat.org Ricardo Sanchez Site Supervisor rsanchez@orangehabitat.org Nikita Zaretsky Site Supervisor nzaretsky@orangehabitat.org Kevin Deiber Site Supervisor kdeiber@orangehabitat.org Mike Sigmund Construction Assistant msigmund@orangehabitat.org Ansel Prichard Land Acquisition Manager Office: 919-932-7077 Ext.\t\t\t220 aprichard@orangehabitat.org Ian Craib AmeriCorps Site Supervisor icraib@orangehabitat.org Volunteer Engagement This team is responsible for coordinating all construction volunteer activities including individuals, groups, and regular crew. Julia Henn Volunteer Engagement Coordinator jhenn@orangehabitat.org Project Management This team is responsible for managing subcontractors, permitting, and ordering supplies. Jesús Gutierrez Project Manager Cell: 919-730-0718 jgutierrez@orangehabitat.org Kendra Lockamy Construction Administrator klockamy@orangehabitat.org Justine Buzzell Project Supervisor jbuzzell@orangehabitat.org Home Repair This team is responsible for managing the Home Repair Program, Home Recycles, and the Habitat Emergency Loan Program (HELP). Taylor Phillips Repairs Manager tphillips@orangehabitat.org Lana Dennis Repairs Coordinator ldennis@orangehabitat.org Development This team is responsible for raising funds to support the mission. Shanell Smaw Vice President of Development Office: 919-932-7077 Ext.\t\t\t218 development@orangehabitat.org Krissy Dunn Major Gifts Officer Office: 919-932-7077 Ext.\t\t\t210 kdunn@orangehabitat.org Kaitlyn Kopala Communications Manager Office: 919-932-7077 Ext.\t\t\t221 kkopala@orangehabitat.org Kim Paolucci Development Associate Office: 919-932-7077 Ext.\t\t\t223 kpaolucci@orangehabitat.org Board of Directors Andy Buchanan Blackfin Real Estate Investors Justin Coleman University United Methodist Church Lida Coleman Retired CPA Matt Ewend UNC Health Zac Hedrick, Treasurer SouthState Bank Mimi Hock Understory Design Kelly Holcombe Blue Cross Blue Shield North Carolina Dan Jewell Landscape Architect Emil Malizia UNC Department of City & Regional Planning Gordon Merklein UNC Associate Vice Chancellor for Real Estate and Campus Enterprises Jim McNeely CertaPro Painters of Chapel Hill Anna Millar, Chair Project Kitty Hawk M.C. Ragsdale Retired Attorney Joan Siefert Rose, Vice Chair, Secretary National Association of Corporate Directors Research Triangle Chapter John Stanley Lenovo Annetta Streater UNC Adams School of Dentistry Stephen Whitlow Abt Associates Michael Zuber, Past Chair Investors Trust Interested in joining our Board of Directors or Committee? Interested in getting involved with Orange Habitat’s Board of Directors or one of our many committees? Fill out the form below and we will reach out! Join a committee or Board of Directors Name * First Last * Last Email * Subject * I am interested in Board of Directors Construction Committee Development Committee Finance Committee Homeowner Services Committee Policy & Advocacy Committee Message * Submit If you are human, leave this field blank. Δ Interested in Working for Orange Habitat? See our current openings. Click here facebook instagram twitter youtube linkedin Give Volunteer Apply Contact Us 88 Vilcom Center Drive, Suite L110 Chapel Hill, NC 27514 info@orangehabitat.org 919-932-7077 About Sign Up for Emails Blog Events Strategic Plan FY24 Annual Report © 2025 Habitat for Humanity of Orange County. Privacy Policy Accessibility Nonprofit Web Design by NMC"
    },
    {
      "url": "https://www.habitatocala.org/strawberry-festival",
      "text": "Strawberry Festival - REV - Habitat for Humanity of Marion County Donate Now Skip to content Home homeownership Application for Homeownership FAQs volunteer ways to volunteer events Women Build Bowl2Build Hookin’ For Habitat Fishing Tournament Strawberry Festival All Events ReStore visit us make a donation donate Make A Donation ways to donate Builders Circle Corporate Sponsorship Hope Builders land donations Legacy Builder vehicle donations about who we are board of directors staff financials & policies careers Habitat News pressroom contact Habitat Ocala Strawberry Festival Festival hosted by Habitat for Humanity of Marion County featuring live music, entertainment, vendors, food, & STRAWBERRIES. All proceeds go towards the building of a new, affordable home for a low income family. 601 SE 25 th Avenue Ocala, Fl 34471 jblack@habitatocala.org Saturday, March 4th, 2023 9:00am-5:00pm Quick Links Vendor Become a vendor at the 2023 festival! Entertainment 2023 entertainment list coming soon! Car Show Signup today for the 2023 Car Show. Sponsor Become a sponsor of one of the BIGGEST events in Marion County. Volunteer Signup to volunteer at our upcoming festival. Event Details Ready for a “Berry” good time? The 8th annual Habitat Ocala Strawberry Festival is coming to the McPherson complex on Saturday, March 4, 2023. The festival begins at 9 am with FREE admission and ends at 5 pm. Volunteers from Marion Therapeutic Riding Association (MTRA) will assist with traffic control and parking for the festival. Proceeds collected from parking ($5 per vehicle) will benefit the Marion Therapeutic Riding Association and Habitat for Humanity of Marion County. The festival starts with over 230 unique and exciting vendors, a kid’s zone with a petting zoo, strawberry food items that melt in your mouth, a bigger-than-ever car show with cool cars, trucks, and motorcycles, a pie-eating contest, a BMX show. Top-notch entertainment will be with performances from the Petty Experience Band, and Chris Patti, a Great Crooners and Frank Sinatra Tribute Artist. Many nonprofits will have vendor booths, and Several photo booths will be available. The festival offers fresh strawberries (from Plant City farmers) to purchase with many delicious strawberry treats. Come watch the strawberry pie eating contest. The festival is for all ages, there is food for all tastes and fun for all generations of festival-goers. Habitat for Humanity could not host this event without our dedicated volunteers who have donated their time, efforts, and knowledge to assist. There are over 700 volunteers assisting throughout the festival. Habitat would like to thank all our wonderful and dedicated sponsors for helping us host another great event. All proceeds raised at the annual Strawberry Festival will be used to build a new home which will be called the Strawberry House for low-income families with an affordable mortgage and a safe and secure environment to raise their children. For more information visit www.habitatocala.org/strawberry . Our Vendors Our Habitat Ocala Strawberry Festival boasts numerous vendor booths. From strawberry vendors to local merchants, check out our current 2023 Vendor List or download our 2023 Vendor Map by clicking the links below. Download 2023 Vendor Map PDF ➜ CLICK HERE TO VIEW 2023 VENDOR LIST 2023 Vendor List A1 Lilla Rose A5 Rustic Charm by Don A11 SWEET BOTTOMS AROMATHERAPY A13 Boho Goat Goat Milk Soap A18 Bayou Billy Sweet Tea A19 Bayou Billy Sweet Tea A20 Children’s education fund A21 Children’s education fund A27 Brian’s Bites Concessions A28 Brian’s Bites Concessions AA1 Calypso Kettle Corn AA2 Calypso Kettle Corn B1 Knottyline Sticker and Shades B2 Knottyline Sticker and Shades B6 Lularoe with Lauren O. B-17 Breadbreakers Ministries C1 SACRED EARTH CRYSTALS C2 SACRED EARTH CRYSTALS C2 Swinehearts Chattahoochee Gold Sauce C3 Handmade By Me C5 EF High School Exchange Year C8 Lunar Light Bowtique C9 The Licorice Guy & Bags from the Beach C10 The Licorice Guy & Bags from the Beach C13 Ellie’s Rico Dulces LLC C14 Kelly Garcia Creations C15 Kelly Garcia Creations C21 Nana’s Circle of Love C24 Primos Kitchen C25 Primos Kitchen C26 Primos Kitchen D1 Pampered Chef with Karin Van Duzee D7 Warren’s Power Washing D15 Stoneton Gems D17 Gaskins Honey Co D18 Sunflower Bag Co D19 Florida National Cemetery D23 Bev’s Craft Boutique D24 GWRRA FL1-F2 Ocala Gold Wing Chapter D25 GWRRA FL1-F2 Ocala Gold Wing Chapter E1 Gizmoe, Inc E-2 Gizmoe, Inc E7 Ocala Electric E-8 Above Artistic E20 The Krafty Kettle, LLC F-1 F2 F9 Get Reel Fishing Apparel – (RBFT Enterprises LLC) F10 Get Reel Fishing Apparel – (RBFT Enterprises LLC) F11 G1 Dixie Fixins G12 Townecraft Mkgt G2 Dixie Fixins G4 Lewis Woodworks G9 Mismatched stitches H1 H2 H9 Little Luvin Stitches I1 Troll Treasures I6 Nessiknacks0301 I11 DS Jewelry & Creations j1 j2 J9 Art Wood and Glass K1 k2 K5 Trinity Baptist Church Ocala K11 Diane’s Cornhole Bags L1 L2 N1 Kona Ice Ocala N2 Kona Ice Ocala O1 Stanford’s jerky O6 Real Spices of NY O7 Stained Gorgeous P1 The Tea Jug P2 The Tea Jug P6 COSaction  Convention of States P11 The Coastal Farmhouse Q1 Fun Time Foods Q7 First Baptist Church of Ocala Q8 First Baptist Church of Ocala R1 Fun Time Foods S1 Two Chubby Seacows S11 Marion County Sheriff’s Foundation S12 Marion County Sheriff’s Foundation S2 Em’s Cryo Treats S25 LifeSouth Community Blood Centers S26 Beautiful Creatures’ Farm To You Revue S27 Beautiful Creatures’ Farm To You Revue S35 Kona Ice Ocala S-6 Walking Dog Toys (horses,cats,unicorns,pigs toys) Close Become A Vendor Thank you for supporting Habitat for Humanity of Marion County and the Habitat Ocala Strawberry Festival! We are excited that you want to become a vendor for our upcoming festival. Register now by clicking the link below to a part of a unique event and experience a festival like no other! Register to become a vendor ➜ Vendor Information Habitat wants all vendors to do well therefore there is a limited number of vendors selling the same products permitted at the event. Vendor spaces will not be assigned until application fees are paid in full. Vendor spaces are 12×12 in grassy area. Vendors must provide their own tent, table, and chairs. Corner spaces, electricity, and meal deals are optional with additional fees. Register for the festival as soon as possible to hold your vendor space as they sell fast. If you would like to register as a vendor but unsure if you will be approved, please send an email to our Development Director, Joanne Black, at jblack@habitatocala.org with the items you would like to sell, she will respond as soon as possible so you can register for the event. Entertainment BMX Trickstars BMX Trickstars will return for another year – sponsored by The Tobacco Free Partnership of Marion County! BMX Trickstars is an all-inclusive traveling BMX stunt show that was started by X-Games medalist Rob Nolli to bring an exciting display of BMX bike stunts and freestyle tricks to events across the nation. With over 30 years of experience, our shows offer flatland freestyle and high flying ramp action from Florida’s most professional, experienced, and innovative bicycle stunt riders. Live Music We’ll be jammin’ out to live music at the 2023 Habitat Ocala Strawberry Festival! Top-notch live entertainment will rock out on stage with performances by The Petty Experience Band, Chris Patti, a Great Crooners, and Frank Sinatra Tribute Artist. 2023 Auto Show Auto Show for all types of vehicles! Enter your TRUCK, CAR, MOTORCYCLE, or UNIQUE VEHICLE for a chance to win Best of the Best in the vehicle category, bragging rights, and a cool trophy. The show offers music, chance drawings, split the pot, plus access to the Habitat Strawberry Festival! Price to Enter: $20 – Before February 15TH $25 – After February 15TH I WANT TO ENTER THE CAR SHOW Become A Sponsor Become a sponsor of one of the BIGGEST events in Marion County! We have many different levels that suit your needs including recognizing your business in different ways. Just click the button below to view our different sponsorship opportunities. View Sponsorship Opportunities ➜ View Sponsorship Rules & Regulations ➜ If you do not see a sponsorship level that suits your needs, please contact Joanne at jblack@habitatocala.org to design a level just for your business. Become a sponsor of one of Marion County’s biggest festival events and the Strawberry House as well as helping a low-income family become a home owner with affordable monthly mortgage payments. Become A Volunteer READ THE VOLUNTEER APPLICATION WAIVER THEN FILL OUT THE FORM BELOW: Click here to view/download waiver ➜ All volunteers must have a Release and Waiver of Liability form submitted prior to any hours of service. You can read the waiver below, then fill out the form below and submit your information to our Volunteer Coordinator. Habitat for Humanity of Marion County is a locally run affiliate of Habitat for Humanity International, a global nonprofit housing organization. We aim to empower individuals and families to build and buy their own homes with the help of people in our community. Quick Links Apply Volunteer Donate Habitat ReStore Events Contact Pressroom Contact Us 1321 SE 25th Loop Suite 103 Ocala, FL 34471 Find us ➜ (P) 352-351-4663 (F) 352-351-3081 Mon-Fri | 8:00am-4:30pm Send us a message ➜ ReStore 200 ReStore 10800 SW 91st Ave, Ocala, 34481 Get directions ➜ 27th Restore 926 NW 27th Ave, Ocala, 34475 Get directions ➜ (P) 352-401-0075 Mon-Sat | 8:30am-4:30pm ©2023 Habitat for Humanity of Marion County, All rights reserved."
    },
    {
      "url": "https://habitatgsf.org/team/",
      "text": "Our Team - Habitat for Humanity San Francisco Bay Area Habitat for Humanity Greater San Francisco Bay Area and Providing Affordable Homes and Homeownership Opportunities Who We Are Our Mission Our History Our Team What We Do Homebuilding Homeownership Home Preservation Housing Advocacy How to Help Donate Now Legacy Giving Other Ways to Give Volunteer Corporate Partnerships Learn More Family Stories Events Family Stories Homeowner Resources Homebuyer Readiness Program Publications Contact Careers News Publications How to Apply Homeownership Home Repairs Search Our Mission Our History Our Team Homebuilding Homeownership Home Preservation Housing Advocacy Donate Now Legacy Giving Other Ways to Give Volunteer Corporate Partnerships Family Stories Events Family Stories Homeowner Resources Homebuyer Readiness Program Publications Contact Careers News Publications Homeownership Home Repairs Search Go Who We Are The team at Habitat for Humanity Greater San Francisco is made up of people with a wide variety of experiences and backgrounds, who are joined together by a shared passion for our community and for the transformative power of homeownership. Leadership Our Teams Office of the CEO Real Estate Construction Finance & Operations Fund Development Homeownership & Community Engagement Home Preservation Board of Directors Leadership Read More Maureen Sedonaen Chief Executive Officer Maureen Sedonaen Chief Executive Officer Maureen is the Chief Executive Officer of Habitat Greater San Francisco, serving Marin, San Mateo, and San Francisco Counties. Over the last 8 years, she has overseen incredible pipeline growth and increased mission impact across the organization as we build, preserve, finance and advocate for affordable homeownership. An inspiring and strategic leader with a highly successful track record leading in both the non-profit and social impact private sector, Maureen has served in executive leadership roles for 3+ decades at leading organizations. She was the Founder, President, and CEO of the Youth Leadership Institute and for over 2 decades worked with hundreds of communities, foundations, and organizations throughout the U.S. and internationally on effective and transformative youth leadership, philanthropy, civic engagement, and policy initiatives. Maureen holds an MBA in Strategic Leadership from Dominican University and a Certificate in Non- Profit Management from the Harvard Business School.  She has received numerous honors and recognition for her work locally, statewide, and nationally. She was selected as an original member of the prestigious Forbes Non-Profit Council and has served as a mentor, advisor and strategist to numerous start-ups, philanthropic foundations, municipalities, school districts and business groups across the U.S. and abroad. She is a frequent guest on podcasts and as a speaker, facilitator and strategic advisor. Believing strongly in servant leadership, Maureen currently serves as the Vice Chair of the Board of the Marin Community Foundation and a Board member of the C4 of the influential Housing Action coalition. She serves as a member of the Habitat for Humanity International’s, U.S. Council where she serves as the Chair of the Advocacy Committee representing 1,000 Affiliates in the U.S.  She is the immediate past Chair of Habitat California, a network of 33 Habitat Affiliate organizations in CA. Read More Jen Wilds Chief Financial Officer Jen Wilds Chief Financial Officer With more than 20 years of finance and operations experience Jen is responsible for financial management and strategy at Habitat Greater San Francisco. Prior, Jen served as Vice President of Finance at Hotel Tonight, leading finance, accounting, and IT functions. Previously, she served as the Senior Vice President of Finance for CBS Interactive. In her role, Jen led a team responsible for forecasting, budgeting, and pricing for more than 35 online brands. Before CBS Interactive, she began her career as an analyst for Capital One Financial Corporation in its Marketing & Analysis and Operations groups. Jen has an S.B. in Mechanical Engineering from Harvard College and an M.B.A. from the Stanford Graduate School of Business. Read More Jim Feeley Vice President of Construction Jim Feeley Vice President of Construction A results-oriented construction and development professional with over 40 years of expertise in all facets of the industry, Jim became Habitat for Humanity Greater San Francisco’s Vice President of Construction in April 2022. Jim leads the construction team consisting of staff, subcontractor partners, volunteers, and homeowners through the process of homeownership development and construction across San Francisco, Marin, and San Mateo Counties. Prior to joining Habitat GSF, Jim served as Vice President of Construction for Trammell Crow Residential, Northern California Division, a nationwide apartment developer. He has overseen over 2,600 homes, apartments, and condominiums in the Bay Area, including tenant occupied rehab, midrise market-rate and affordable mixed use rental apartments and for sale high-rise condominiums. Read More Angelica Resendez Vice President of Homeownership & Community Engagement Angelica Resendez Vice President of Homeownership & Community Engagement Angelica Resendez started her journey with Habitat for Humanity when she was 10 years old and learned that her parents, two younger sisters, and she would be moving into their own Habitat home in San Jose. Having grown up in a Habitat home changed everything for Angelica and her family—they were able to focus on education, careers, wealth building, civic engagement, health, and wellness, among so many other things. Because of this stable home and everything it provided, Angelica knew that whatever she did in life, that it would have a positive impact in the lives of others. This led to Angelica dedicating her life’s work to important causes such as education, youth development, family engagement, and affordable housing. Angelica has been a part of the Homeowner Development Department at Habitat for Humanity Greater San Francisco since 2014, most recently as Vice President of the department, and feels blessed to be able to pay it forward and serve incoming and current Habitat GSF homeowners. Read More Pam Dorr Vice President of Home Preservation Pam Dorr Vice President of Home Preservation With nearly two decades of experience developing and leading affordable housing organizations in the U.S., Pam oversees one of the organization’s most important initiatives – preserving homeownership and combating displacement for low-income Bay Area families through critical home repairs. Pam most recently served as the Executive Director for the Community Land Trust Association of West Marin (CLAM) where she worked to expand access to affordable homeownership through innovative, community-based solutions. Prior to CLAM, Dorr was the Director of Affordable Housing for a Menlo Park-based organization, Soup, where she helped found the Valley Community Land Trust, a CLT that works with underserved families in San Mateo and Santa Clara Counties. Read More Christopher Berini Chief Development Officer Christopher Berini Chief Development Officer With over 3 decades of mobilizing communities to support each other and drive social change, Christopher leads fundraising and resource development for Habitat GSF. Whether fighting for social justice, health justice, financial justice, or – more recently – housing justice, his life’s calling has been and will continue to be building stronger, healthier, more engaged and inclusive communities. Christopher’s education focused on literature and creative writing, and his early career was in corporate relationship building, leading to a passion for telling great stories and developing authentic partnerships. After a move to the Bay Area from North Carolina in 2000, he considers himself an “honorary local” after 25 years here. With a wonderful husband and a beautiful child, he has firmly put down roots here — and is more passionate than ever about making this a region where everyone can thrive. Office of the CEO Jasmine Brennan Chief of Staff Jasmine Brennan Chief of Staff With more than 15 years of experience working in the nonprofit sector, Jasmine brings a deep understanding of nonprofit operations and a proven ability to foster enhanced team communication and collaboration to her role of Chief of Staff. She works closely with the CEO and Executive Team to develop and implement the strategic direction of the organization. Jasmine is also responsible for managing the Office of the CEO, is the main liaison to the Board of Directors, and oversees the internal operations of the organization. Prior to joining Habitat GSF, Jasmine worked for the United Nations Development Programme where she was a Project Manager leading teams working in sub-Saharan Africa. She also served as Executive Administrator for the PIPRA Foundation, Interim CEO for Ag Partner Exchange and Board Secretary for Global Access in Action. She is a San Francisco native who grew up in the Visitacion Valley neighborhood, witnessing firsthand how housing insecurity affects vulnerable communities, and is passionate about driving change locally. Nell Cloutier Director of Measurement & Learning Tara Legoski Office Coordinator Holden Weisman Director of Policy and Advocacy To get in touch with the team please email info@HabitatGSF.org Real Estate Doug Fowler Director of Real Estate Development Robert Smith Project Manager Construction Maria Anderson Home Preservation Assistant Project Manager John Baxter Home Preservation Field Technician Erin Colton Sr. Director of Construction Pam Diaz Construction Manager - Home Preservation Kevis Halphen Home Preservation Project Manager Conor Hanvey Home Preservation Project Manager Alex Iturreria Construction Project Manager Patrick Kelly Senior Home Preservation Technician Michael Lew Playhouse & Warehouse Manager Andrew Moyer Senior Construction Project Manager Finance & Operations Christine Cuevas Operations Manager Sarah Duval Director of Business Systems Areli Gallegos Accounting Manager Katherine Jacques Recruiting & Training Manager Maggie Jasso Associate Accountant Danny LeSon Director of HR and Operations Adrionna Moss Assistant Loan Officer Luc Nguyen Project Accountant Sam Richman Accounting Clerk Carmen Robinson Data Coordinator Lidia Vieyra Senior Loan Officer Michelle Wong Payroll Benefits Specialist To get in touch with our finance and operations team please email finance@HabitatGSF.org For invoicing and payments please email invoices@HabitatGSF.org Fund Development Trent Cooper Vice President of Philanthropy Abby Delgado Director of Marketing Kaitlin Donnelly Assistant Public Funding Manager Xandrine Griffin Major Gifts Officer Amy Jensen Development Operations Manager Brianna Lowrie Director of Corporate & Community Partnerships Mark Sisk Corporate and Community Partnership Manager Ashley Spooner-Choi Director of Public Funding & Grants Leo Stroe Director of Corporate and Family Philanthropy Christina Tran Digital Content Coordinator To get in touch with our fund development team please email development@habitatgsf.org Homeownership & Community Engagement Sergio Herrera Community Engagement Specialist Niko LaBarbera Homeownership Programs Manager Belinda Sullivan Director of Volunteer & Partnership Development To get in touch with our homeownership and community engagement team please email homeownership@habitatgsf.org Home Preservation Abraham Vicente Senior Home Preservation and Outreach Specialist To get in touch regarding home preservation please email HomeRepairs@HabitatGSF.org Board of Directors Read More Brandon Brown Chair Brandon Brown Chair Partner, Kirkland & Ellis LLP Brandon Brown is a trial lawyer, specializing in high-tech patent, trade secret, and copyright intellectual property litigation in U.S. Federal Courts and at the International Trade Commission. Brandon has successfully managed trial teams to jury and bench trial victories and is routinely recognized for his work in high-profile intellectual property matters. American Lawyer has twice named Brandon and his team “Litigators of the Week” for securing multi-hundred-million trial verdicts, highlighting Brandon’s ability to “adeptly present complex technical information” to a jury. In addition to his time in the court, Brandon leverages his legal and technical experience to provide strategic counseling to a number of high-profile clients and matters. Brandon holds a bachelor’s degree in computer science from Boston University, and a law degree from U.C. Berkeley. Outside of his legal practice, Brandon previously served as the Chairman of the non-profit Youth Leadership Institute, growing its budget and impact from $3M to $7M a year, and expanding its staff and footprint to extend throughout California and worldwide. Read More Carl Cade Vice Chair Carl Cade Vice Chair Vice President, Construction & Repositioning, Hudson Pacific Properties Carl Cade leads a team of 20 project managers and support team members who build out office space and long-term value-add investments in Hudson Pacific’s 29 office properties in Northern California.  A member of Hudson’s Northern California leadership team, Carl oversees the firm’s community engagement work in the region. His 25-year real estate career has spanned Development, Redevelopment, Construction, Finance, and Asset Management roles working in Office, Retail, Multi-Family, Homebuilding, and K-12 School property types. Carl previously worked at Westfield, Tribune Real Estate Holdings, and the Los Angeles Unified School District. Born and raised in the Fruitvale District of Oakland and Bernal Heights in San Francisco, Carl worked for 20 years in Los Angeles real estate before returning to San Francisco in April 2020 to take on his current role at Hudson Pacific. Carl has served in numerous volunteer and civic roles with a focus on creating and supporting institutions that create equity and stability in urban communities including: President of the Westside Urban Forum, Board Chair of the LA Neighborhood Land Trust, and Commissioner of LA Fire and Police Pensions (all in Los Angeles). Carl holds a BA in Urban Studies and Political Science from Vassar College and an MBA from Harvard Business School. He and his husband Max live in the Western Addition. Read More Dameon Philpotts IPC - Board Member Dameon Philpotts IPC - Board Member COO, Citizens Private Bank Dameon is an experienced risk, banking, and lending executive that is responsible for leading First Republic. As the regulator and internal and external auditor liaison, vice president general administration, policy, credit risk, and loan loss allowance; Dameon is responsible for performing a variety of duties across First Republic Bank’s Credit Administration platform. Prior to his role in Credit Administration, Dameon was the Director of Credit Risk where he was responsible for identifying, assessing, measuring, and monitoring credit risk across the Bank and ensuring appropriate risk controls and responses. Prior to First Republic Bank, he was Vice President, Commercial Banking at Union Bank.  He received his Master’s in Business Administration from George Washington University and B.A. from Franklin and Marshal. He is also board member for America Scores Bay Area. Read More Nancy Turner Treasurer Nancy Turner Treasurer Managing Director, Point Olema Capital Partners Nancy Turner is a Managing Director at Point Olema Capital Partners. Previously she was a Vice President at Jordan Park, an investment management and financial advisory firm with over $12 billion in assets under management. She is an empathetic problem solver with deep financial experience and expertise. Previously, she was a Managing Director in investment banking at Perella Weinberg Partners executing complex restructuring transactions involving contested valuations, raising capital, M&A, strategic alternative assessment and stakeholder negotiations. She previously worked at Greenhill & Co and Houlihan Lokey. Nancy started her career as an Analyst at Cambridge Associates and as an Accountant in commercial finance. She earned her BA from Duke University and her MBA from the University of Virginia Darden School of Business. She lives in Mill Valley with her husband and three daughters. Nancy volunteers at St. Vincent de Paul, San Francisco Marin Food Bank, Redwoods Senior Community and Marine Humane Society with her family. Read More Magali Limeta Secretary Magali Limeta Secretary Sr. Revenue Cycle Analyst, UCSF Medical Center Magali Limeta is a proud first generation Mexican-American from Novato, California. She was the first in her family to graduate university and received a degree in Anthropology from the University of California, Los Angeles. She’s the Senior Revenue Cycle Analyst for UCSF, an advocate for social change, and an active member of the San Rafael Evening Rotary Club. She was selected for 4 fellowships including Front Line Leaders Academy, New American Leaders, Emerge California, and New Leaders Council. As the former President of the Marin County Young Democrats and current AD-10 Delegate to the California Democratic Party she has dedicated time and been recognized for her contributions to Marin County. Her passion is rooted in her struggles navigating the education system, on her own, as a first generation Mexican-American. She believes that together we can reform systems to break down the barriers to access housing, healthcare and education. Read More Sam Allen Board Member Sam Allen Board Member SVP & Chief Operating Officer, Salesforce.org Sam Allen is a highly accomplished executive with diverse skills encompassing team leadership, business development, alliance creation, asset management and acquisitions, forged in the Fortune 50 & honed in start-ups. He is a fiscally savvy and innovative leader who runs through walls. Sam has demonstrated his skill as an exemplary growth architect and catalyst to scale. Intuitive, analytical with an acute business acumen, Sam excels at aligning core business with strategic goals. He is experienced and adept at M&A, Venture Capital and Angel fund raising. Read More Sam Cheikh Board Member Sam Cheikh Board Member Managing Director, Hines Sam is responsible for new business generation, development and asset management in Hines’ Bay Area office with a focus on Silicon Valley. He most recently served as the development officer for Hines’ Piercy industrial project a 600,000 square-foot, Class A industrial building in San Jose, California. Sam initially joined Hines as an assistant construction manager in Orange County, working on the development of 2211 Michelson, a 271,000 square-foot, Class A office building in Irvine, California. 2211 Michelson was the first LEED Silver Certified office building on the West Coast. Sam rejoined Hines in the San Francisco office in 2011 and has since been driving the growth of Hines’ Silicon Valley portfolio while also mentoring the next generation of Bay Area leaders. He has steered the acquisition of 1.2 million square feet of office, industrial and R&D projects totaling approximately $450 million and over 2.4 million square feet of development. In addition, Sam has helped procure over 2.9 million square feet of tech office campus development for third-party clients. Sam holds a Bachelor of Science in Business Administration from the University of Southern California and a Master of Science in Real Estate Development from Columbia University. Outside of the office, Sam enjoys spending time with his wife and young children in addition to travelling and looking for the next best Japanese restaurant. Read More George Gigounas Board Member George Gigounas Board Member Partner, Co-Chair, Environmental practice Group, DLA Piper George Gigounas focuses his practice on resolving environmental and product-related litigation, enforcement and compliance issues for clients with industrial, manufacturing, and product-based businesses. He builds on a strong background in environmental science, a familiarity with the technical, chemical and mechanical processes involved in industrial operations, and an understanding of the geophysical and toxicity issues arising with hazardous wastes, toxic exposures and environmental remediations. George draws his litigation skills from a background involving advocacy for industrial entities, manufacturers, oil businesses, and insurance, consumer and pharmaceutical product firms. He has defended numerous government enforcement actions and complex civil lawsuits under federal CERCLA and RCRA laws and related state laws. He advises on compliance with product safety laws and regulations, particularly regarding California laws, including long experience in Proposition 65 litigation. He also helps clients ascertain and monitor their regulatory compliance, develop testing programs, implement required certifications and handle enforcement actions or litigation under federal and state laws. Read More Heidi Hansen Board Member Heidi Hansen Board Member Principal, Heidi Hansen Architect Heidi Hansen is an architect known for her stunning home designs and collaborative style. Heidi is highly engaged as a volunteer, and dedicated to affordable housing, environmental issues, children’s rights, and access to education. She has been actively volunteering with Habitat for Humanity Greater San Francisco and participated in our 2017 Global Village trip to Viet Nam. She will be heading to Nepal with us in November for the Legacy trip. Heidi brings many valuable relationships via her networks in Marin, San Francisco, and the Peninsula. Read More Mihir Khilnani Board Member Mihir Khilnani Board Member Managing Director, KPMG, LLP Mihir is a Managing Director in KPMG’s Consulting practice focused on assisting organizations with their governance, risk management, operational excellence, and business transformation efforts. He has advised and assisted Management and the Board of Directors of numerous organizations with setting strategy, achieving operational excellence, managing risk, and building resilience through periods of economic turbulence, disruptive technology and innovation, changing competitive landscapes, and evolving regulatory frameworks. Mihir has advised and assisted numerous Fortune 500 and private organizations implement and expand their governance, risk management, and operational excellence efforts in the Americas, Europe, Middle East, and Africa (EMEA), and Asia-Pacific regions, including emerging markets such as Brazil, Russia, India, and China. As part of these efforts, he has managed and coordinated large global teams in multiple locations simultaneously to ensure his clients achieve their strategic objectives. Read More Stephen Koch Board Member Stephen Koch Board Member Principal, Baker Street Associates Stephen Koch is a real estate professional with forty years of experience in real estate development, real estate finance, leasing, and consulting.  Over the course of his career Stephen has worked for various real estate organizations including Prometheus Development, AMB (now Prologis), Catellus Development Co., AIG, and as an independent consultant.  In his capacity as a consultant Stephen has served both public and private clients including Stanford University, the City of Mountain View, the California College of the Arts, the San Francisco Opera, and various family funds.  Stephen is an active member of the Urban Land Institute and Lambda Alpha International.  Stephen received his B.A. from Yale College in 1971 and his MBA from Stanford University in 1976. Read More Claire Kurmel Board Member Claire Kurmel Board Member Claire Kurmel (she/her) is a retired marketing professional with keen management and mentoring skills. She has deep knowledge of the investment management industry where she built brand awareness and drove growth through strategic marketing plans and innovative programs. Most recently, Claire served as the Managing Director of Channel Marketing at Parnassus Investments. Prior to Parnassus, she worked at Matthews Asia, State Street Global Advisors, Blackrock, and Barclays Global Investors. Throughout her career, Claire delivered integrated marketing plans and successful product launch initiatives. Her tactical toolkit includes advertising, brochures, direct mail, email, events, infographics, social media, videos, webcasts, and web landing pages. Claire’s community and volunteer efforts include former leadership roles with the Financial Communications Society in San Francisco and the UC Davis Graduate School of Management’s alumni board. Claire lives in San Francisco with her husband. She enjoys boating, hiking, and skiing throughout Northern California. She is an enthusiastic amateur artist, and her creative pursuits include ceramics, painting, and drawing. Read More Jacob Moss Board Member Jacob Moss Board Member In-House Counsel, Plant Construction Company, LP Jacob Moss serves as Plant’s first and only In-House Counsel. Mr. Moss is a member of the executive management team and is responsible for overseeing risk management for the entire company. Mr. Moss negotiates and manages all contracts, including prime contracts, subcontracts and various vendor agreements. He also oversees outside counsel for all litigation, pre-litigation, construction, employment, human resources, Cal/OSHA and general commercial issues. Mr. Moss obtained a juris doctor from Santa Clara University School of law, and a Bachelor of Arts from Bucknell University where he played varsity baseball for four years. Read More Tamsen Plume Board Member Tamsen Plume Board Member Executive Partner, Holland and Knight Tamsen Plume is the executive partner of Holland & Knight’s San Francisco office and partner of the firm’s West Coast Land Use and Environmental Group. She has extensive experience representing investors, developers, national companies and agencies in due diligence, permitting and compliance with a particular expertise in complex land use-related contracts, including Development Agreements and Disposition and Development Agreements. Projects include entitlement procurement, including CEQA compliance, from local, state and federal agencies for residential, retail, commercial and mixed-use projects. Ms. Plume received her B.A. from University of Virginia with honors and her J.D. from Hastings College of Law, cum laude. She is part of the California and District of Columbia Bar Associations. Read More Nicholas Raby Board Member Nicholas Raby Board Member SVP, Global Workplace Services, Salesforce Nick currently serves as SVP, Global Workplace Services for Salesforce. Previously, Nick served as Facebook’s Director of Corporate Real Estate for North America, where he managed all aspects of the company’s North America real estate strategy and portfolio, which spans over 55 offices in approximately 25 cities. Prior to that, Nick spent nearly 7 years as in-house legal counsel to Facebook’s Global Real Estate and Data Center Development teams, negotiating numerous real estate and renewable energy transactions and securing land use entitlements and economic incentives for Facebook’s office and data center development projects worldwide.  Nick earned his J.D. from the University of San Francisco, School of Law in 2006 (along with an honors certificate in intellectual property law) and his B.A. in Political Science from UCLA in 2001. Read More Josie Ramirez Board Member Josie Ramirez Board Member Josie currently serves as the Managing Director for California CRA Residential Lending at Silicon Valley Bank, a Division of First Citizens Bank. She has 30+ years combined experience in the Non-Profit and Residential Lending career fields, with 17 years focused on CRA Residential Lending at retail banks and 13 years with a Non-Profit Community Development Corporation (CDC) and Non-Profit Organizations. Throughout her career, Josie has served in a variety of roles, yet all committed to providing affordable homeownership and/or housing for low- to moderate- income households.   Previously Josie was with Boston Private Bank for 10+ years where she was a vital contributor in designing and implementing the bank’s first CRA Residential Lending Program in California. Prior to joining Boston Private Bank, she was the Executive Director at Homeownership SF and before that Programs Director at Mission Economic Development Agency. She dedicated 10 years at South County Housing (Non-Profit CDC) serving in a variety of roles including Program Manager of its Sweat Equity Program; Property Manager of several affordable rental, multi-family communities; and Department Manager of its Homeownership and Neighborhood Development Services. Read More Rob Tersini Board Member Rob Tersini Board Member Rob Tersini joined The Sobrato Organization in 2014. As Senior Vice President of Real Estate and Development, he works on the entitlement and execution of new development projects from San Jose to San Francisco. His responsibilities include oversight of the design and project teams, as well as the construction, marketing, and lease-up of all the active developments. Rob has been a member of the Urban Land Institute and an active member of NAIOP’s since 2014.  He received his Bachelor of Science degree from California Polytechnic State University in San Luis Obispo. Read More Mark Tortorich Board Member Mark Tortorich Board Member Vice President for Northern California Service Delivery, Kaiser Permanente Mark Tortorich is the Vice President for Northern California Service Delivery with Kaiser Permanente’s National Facilities Services. In this capacity, Mark oversees a 400-person staff supporting capital facilities projects, clinical technology, facilities operations, and real estate acquisition. The 10-year strategic plan incorporates cashflows between $1B and $2B annually. Prior to joining Kaiser, Mark was the Vice President for Real Estate Design and Construction for Stanford Health Care and Lucile Packard Children’s Health at Stanford. An architecture graduate from California Polytechnic State University in San Luis Obispo, Mark is a Fellow of the American Institute of Architects and an Executive Leadership Team member for the American Heart Association’s Hard Hats for Heart campaign. Read More Lou Vasquez Board Member Lou Vasquez Board Member Lou Vasquez is a Founding Partner and Managing Director of BUILD, where he oversees the firm’s business strategy and executive management. Over the course of his 30-year career in real estate development, Vasquez has participated in the acquisition, entitlement, development, construction and management of more than $1 billion of residential and commercial product. Prior to forming BUILD in 2004, Vasquez worked in senior management at a number of prominent Bay Area residential and commercial real estate development companies, including Trammell Crow, Greenbriar Homes, Bay Communities, Oxford Development, and Archstone Communities. Through his volunteer work as a board member of Habitat for Humanity and as a founding board member of the Mission Preparatory School, Mr. Vasquez is committed to ensuring that San Francisco remains a diverse city providing opportunities for its most vulnerable citizens. Habitat for Humanity Greater San Francisco Bay Area and Providing Affordable Homes and Homeownership Opportunities 415-625-1000 300 Montgomery Street Suite 450 San Francisco, CA 94104 LinkedIn Twitter Facebook Instagram YouTube Who We Are Our Mission Our History Our Team What We Do Homebuilding Homeownership Home Preservation Housing Advocacy How to Help Donate Now Legacy Giving Other Ways to Give Volunteer Corporate Partnerships Learn More Family Stories Events Family Stories Homeowner Resources Homebuyer Readiness Program Publications Contact Careers News Publications How to Apply Homeownership Home Repairs Cookie Preferences Privacy Policy Terms of Use © 2025 Habitat for Humanity Greater San Francisco Serving the Bay Area in San Francisco, San Mateo, and Marin Counties Back to Top Search Go Who We Are Our Mission Our History Our Team What We Do Homebuilding Homeownership Home Preservation Housing Advocacy How to Help Donate Now Legacy Giving Other Ways to Give Volunteer Corporate Partnerships Learn More Family Stories Events Family Stories Homeowner Resources Homebuyer Readiness Program Publications Contact Careers News Publications How to Apply Homeownership Home Repairs LinkedIn Twitter Facebook Instagram YouTube Translate Let’s stay connected Sign up for the monthly Habitat GSF newsletter to stay in touch and keep up to date on affordable homebuilding and homeownership in San Francisco, San Mateo & Marin counties. ×"
    },
    {
      "url": "https://www.ocala.com/story/entertainment/local/2014/02/27/strawberry-festival-to-sweeten-downtown/31934399007/",
      "text": "Strawberry Festival to sweeten downtown News Sports Entertainment Lifestyle Advertise Obituaries eNewspaper Legals LOCAL Strawberry Festival to sweeten downtown Party will revel in music, crafts, dancing and, of course, lots of berries Rick Allen Staff writer The son of a Delaware vegetable farmer who became a contestant on \"Dancing with the Stars\" will be the musical headliner Saturday at Marion County's Strawberry Festival. Up-and-coming country star Chuck Wicks — known for the songs \"Stealing Cinderella\" and \"All I Ever Wanted\" — is scheduled to perform at 3:45 p.m. on Ocala's downtown square; his concert will wrap up a day of music, dancing and, most notably, eating more strawberries than we're typically accustomed to consuming hereabouts. The Strawberry Festival and Craft Show is a large-scale fundraiser for — and hosted by — Habitat for Humanity of Marion County. It will saturate the square with all things strawberry, as well as a full day of crafts and entertainment. Ocala's own Victoria Sexton will perform before Wicks, a notion that thrills the Vanguard High School graduate and current University of Florida student. \"I'm completely obsessed with his song 'Stealing Cinderella,'\" Sexton said. Sexton is a familiar face on local stages, especially Ocala Civic Theatre. The singer/songwriter has played the downtown square for several festivals and, last year, opened for country super group Montgomery Gentry at Citizens' Circle at City Hall. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. \"Last year, it was so nerve-wracking and fun and an amazing experience opening up for Montgomery Gentry; the audience was absolutely fantastic,\" she recalled. The festival will offer a full lineup on two stages, with all music at the gazebo on the square and an array of dancers, gymnasts, acoustic musicians and even a Pet Parade at Citizens' Circle. There also will be a car show. Wicks is proud of his humble beginnings. In his Facebook bio, he tells of growing up in small Smyrna, Del. \"I was a normal kid. Loved sports, chased the girls and got 'Cs' in high school. I also worked my tail off helping out mom and pop.\" He also talks about finding success as a musician in Nashville and his stint on \"DWTS.\" It was \"a blast and it was cool to be part of a No. 1 TV show. Just wish I was singing instead of dancing in tights.\" Interestingly, he doesn't mention he was paired with his then-girlfriend at the time, \"DWTS\" professional dancer Julianne Hough, who's also a country singer and actress. But the real star of the day is, of course, the luscious red berry with its seeds on the outside and sweet juicy flavor bursting from within. \"We're getting three pallets,\" said Sarah Isaacs, one of the coordinators of this first-time signature event for Habitat for Humanity. That works out to about 3,600 pounds of strawberries being trucked in from Plant City — which is in the midst of its own annual strawberry festival. That works out to about, roughly, 100,000 strawberries — give or take a few. Will that be enough? We'll know Saturday. \"We don't want to run out,\" said Brad Nimmo, president and CEO of Habitat in Marion County. \"But if we do, we leave 'em wanting more. We know this is a first-year event\" — meaning organizers had to guess how many strawberries to buy for their pre-sale by the flat and for the various yummies available Saturday. \"Still,\" he added, \"we don't want to overbuy either.\" The berries coming here will be used for strawberry shortcake, strawberry bread, homemade strawberry ice cream, strawberry tarts, chocolate-dipped strawberries, strawberry pancakes and, of course, just strawberries by the carton or flat for taking home. \"We could have gotten the strawberries from California, but we wanted Florida berries,\" Nimmo said. Florida, by the way, is the second-largest strawberry producing state right after California. And strawberries are a recommended addition to daily diets. They're fat free, low in calories and high in such nutrients as potassium, folic acid and fiber. Just one serving — eight strawberries — provides more vitamin C than an orange, according to the WebMD website. Moreover, they \"protect your heart, increase your HDL (good) cholesterol, lower your blood pressure and guard against cancer,\" adds the WebMD article. The idea for this festival stems back to Nimmo's time at the Brevard County Habitat for Humanity years ago, where nowadays their strawberry festival raises as much as $200,000 a year. This being the first year in Ocala, he said he wasn't sure how much the day's activities here might raise, although every $40,000 it raises means a new Habitat house can be built for a needy family. Janie Pope, the city's central business district program manager, said she's thrilled. \"This is exactly what we envisioned happening as part of our downtown revitalization efforts,\" she said. Moreover, this new downtown festival is a way to bring a bit of the Plant City hoopla to Ocala. \"There are a lot of people who can't get to Plant City,\" Nimmo said, \"and this is an opportunity for them to sample here what they can't get to there.\" Rick Allen can be reached at rick.allen@starbanner.com or 867-4154. Entertainment schedule Community Stage (Citizens' Circle at City Hall) 9 a.m.: VSDance 9:30 a.m.: Hula Hoop Contests (Divisions: Kids, Adults, Seniors, & Parent/Child) 10 a.m.: Royalty Girls 10:30 a.m.: Legendz Gymnastics 11 a.m.: Acoustic singer James Faulkner 11:30 a.m.: Extensions Dance Studio Noon: Pet Parade (Pet/Owner Look Alike, Best Trick, Best Kiss, Ugliest Dog, Best Costume) No entry fee, anyone can join, only requirement is dogs must be leashed. 12:30 p.m.: Honey's School of Dance 1 p.m.: Phantastic Sounds 1:30 p.m.: Dance Party hosted by Casana Fink 1:45 p.m.: Balcony Dance 2 p.m.: Phantastic Sounds 2:30 p.m.: Brian Morse of TrebleHawk Music Stage (Gazebo) 11 a.m.: Tabitha Newborn (time tentative) Noon: Deondra Bender (time tentative) 1 p.m.: Steel October (time tentative) 2:15 p.m.: David Lane (time tentative) 3:05 p.m.: Victoria Sexton 3:45 p.m.: Chuck Wicks When: 8 a.m.-5 p.m. Saturday Where: Downtown Square to Citizens' Circle Cost: free; food, drinks and crafts extra (351-4663) Strawberry and Craft Festival Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.ocala.com. All rights reserved."
    },
    {
      "url": "https://habitatocala.org/strawberry/",
      "text": "Strawberry Festival - Habitat for Humanity of Marion County Donate Now Skip to content Home homeownership Application for Homeownership FAQs volunteer ways to volunteer events Women Build Bowl2Build Hookin’ For Habitat Fishing Tournament Strawberry Festival All Events ReStore visit us make a donation donate Make A Donation ways to donate Builders Circle Corporate Sponsorship Hope Builders land donations Legacy Builder vehicle donations about who we are board of directors staff financials & policies careers Habitat News pressroom contact Habitat Ocala Strawberry Festival A Berry-Good Time! Festival hosted by Habitat for Humanity of Marion County featuring live music, entertainment, vendors, food, & STRAWBERRIES. All proceeds go towards the building of a new, affordable home for a low income family. 601 SE 25 th Avenue Ocala, Fl 34471 jblack@habitatocala.org Saturday, March 7, 2026 9:00am-5:00pm LIKE THE HABITAT STRAWBERRY EVENT ON FACEBOOK Quick Links Sponsor Become a sponsor of one of the BIGGEST events in Marion County. Festival Photos View photos from the 2025 Habitat Ocala Strawberry Festival! Event Details Ready for a “Berry” good time? The 12th annual Habitat Ocala Strawberry Festival is returning to the McPherson complex on Saturday, March 7, 2026. The festival begins at 9 am with FREE admission and ends at 5 pm. Volunteers from Marion Therapeutic Riding Association (MTRA) will assist with traffic control and parking for the festival. Proceeds collected from parking ($5 per vehicle) will benefit the Marion Therapeutic Riding Association and Habitat for Humanity of Marion County. The festival starts with over 235 unique and exciting vendors, a kid’s zone with a petting zoo, strawberry food items that melt in your mouth, a bigger-than-ever car show with cool cars, trucks, and motorcycles, a pie-eating contest, a BMX show, and a variety of live entertainment throughout the day. Many nonprofits will have vendor booths, and several photo booths will be available. The festival offers fresh strawberries (from Plant City farmers) to purchase with many delicious strawberry treats. Come watch the strawberry pie-eating contest. The festival is for all ages, there is food for all tastes and fun for all generations of festival-goers. Habitat for Humanity could not host this event without our dedicated volunteers who have donated their time, efforts, and knowledge to assist. There are over 700 volunteers assisting throughout the festival. Habitat would like to thank all our wonderful and dedicated sponsors for helping us host another great event. All proceeds raised at the annual Strawberry Festival will be used to build a new home which will be called the Strawberry House for low-income families with an affordable mortgage and a safe and secure environment to raise their children. Shout Out To Our Sponsors! Thank you to our sponsors of one of the BIGGEST events in Marion County! Photos from the 2025 Habitat Ocala Strawberry Festival Habitat for Humanity of Marion County is a locally run affiliate of Habitat for Humanity International, a global nonprofit housing organization. We aim to empower individuals and families to build and buy their own homes with the help of people in our community. Quick Links Apply Volunteer Donate Habitat ReStore Events Contact Pressroom Contact Us 1321 SE 25th Loop Suite 103 Ocala, FL 34471 Find us ➜ (P) 352-351-4663 (F) 352-351-3081 Mon-Fri | 8:00am-4:30pm Send us a message ➜ ReStore 200 ReStore 10800 SW 91st Ave, Ocala, 34481 Get directions ➜ 27th Restore 926 NW 27th Ave, Ocala, 34475 Get directions ➜ (P) 352-401-0075 Mon-Sat | 8:30am-4:30pm ©2023 Habitat for Humanity of Marion County, All rights reserved."
    },
    {
      "url": "https://352today.com/news/257752-habitat-ocala-strawberry-festival-returns-with-car-show-live-entertainment-and-family-fun/",
      "text": "Habitat Ocala Strawberry Festival returns with car show, live entertainment, and family fun - 352today Close ✕ Search Ocala 78° F Explore Home News Community Crime & Safety Equine Health & Wellness Sports Weather Updates Trending Features 352’s Local Expert Best of the 352 Local Deals 352 Seasonal Guides Contests Contest Rules Things To Do Events Submit Events Entertainment Weather Forecast Hurricane Weather Center Obituaries About Newsletter Signup Advertise With Us Careers Submit News Habitat Ocala Strawberry Festival returns with car show, live entertainment, and family fun Enjoy a day of classic cars, fresh strawberries, live music, and exciting activities at the 11th annual Habitat Ocala Strawberry Festival on March 1, 2025. By Kathy Dugan February 18, 2025 1:41 pm Facebook X LinkedIn 352today Kathy Dugan/352today Order your flats of strawberries early from Habitat for Humanity of Marion County's Ocala Strawberry Festival before they sell out. OCALA, FL ( 352today.com ) – The 11th annual Habitat Ocala Strawberry Festival returns to the McPherson Complex on Saturday, March 1, 2025, promising a full day of family-friendly activities, live entertainment, and a bigger-than-ever car show. The festival runs from 9 a.m. to 5 p.m. with free admission. Car enthusiasts can enter their trucks, cars, motorcycles, or unique vehicles for a chance to win in categories including Best of Show and People’s Choice. Trophies and bragging rights will be awarded to top entries. The registration fee is $15 before Feb. 28 and $20 thereafter. The show will also feature music, chance drawings, and a split-the-pot raffle. Kids (and grownups) can get hands-on with the animals at the petting zoo in the Kids Zone. Courtesy: Kathy Dugan/352today The festival boasts more than 235 vendors, a kid’s zone with a petting zoo, and an array of strawberry-themed treats, including fresh strawberries from Plant City farmers. Attendees can also enjoy a BMX stunt show, a strawberry pie-eating contest, and nonprofit vendor booths. There will be no shortage of shortcakes and other strawberry delights. Courtesy: Kathy Dugan/352today Parking is $5 per vehicle, with proceeds benefiting the Marion Therapeutic Riding Association and Habitat for Humanity of Marion County. Festival proceeds will help build the “Strawberry House,” providing an affordable home for a local family in need. With over 700 volunteers assisting, organizers express gratitude to all supporters and sponsors who make the event possible. Facebook X LinkedIn Kathy Dugan Kathy is what is called a \"River Rat\" from Dunnellon, spending a lot of time on the beautiful Rainbow River growing up.  She's spent 18+ years in radio news and more than 30 years as a journalist. She holds an AA in Mass Communications from the College of Central Florida. Story © 2025 Saga Communications - Images © 2025 Saga Communications More in Entertainment WEEKEND TOP PICKS: A Mashup of Fall-Themed Fun, Live Shows and More Horseback Riding in Marion County is an Autumn Experience that's Magical in Nature City of Belleview Announces 2025 Light Up Lake Lillian Holiday Celebration Editor's Picks WEEKEND TOP PICKS: A Mashup of Fall-Themed Fun, Live Shows and More Marion County Sheriff's Office Investigating Fatal Stabbing on W Highway 326 Defunct Ocala - Eerie Acres: Chiefland's Once-Spooky Halloween Haven Trending TRAFFIC ALERT: Serious Crash on State Road 200 in Front of Lowe’s Causing Major Delays Ocala Police Seek Help Identifying Woman Accused of Racking Up $11,000 in Fraudulent Charges Marion County Sheriff's Office Investigating Fatal Stabbing on W Highway 326 Top Stories Entertainment 19 minutes ago WEEKEND TOP PICKS: A Mashup of Fall-Themed Fun, Live Shows and More This weekend features fall fun, live shows and markets for everyone to enjoy early fall celebrations and lively events. Crime & Safety 22 hours ago Marion County Sheriff’s Office Investigating Fatal Stabbing on W Highway 326 A man died from stab wounds after a violent incident in northwest Ocala. Detectives with the Marion County Sheriff’s Office are actively investigating the homicide. Features 1 day ago Defunct Ocala – Eerie Acres: Chiefland’s Once-Spooky Halloween Haven Exploring the lost landmarks and attractions that shaped Marion County’s past. Local 20 hours ago TRAFFIC ALERT: Double Lane Closures on Northbound I-75 in Ocala Begin September 14 Nighttime construction will reduce I-75 northbound traffic to a single lane from County Road 462 to County Road 484 through Sept. 19 as part of ongoing infrastructure improvements. Weather Updates 9 minutes ago WEEKEND WEATHER:  Sunny Mornings with Scattered Afternoon Storms Expected this Weekend. Ocala can expect mostly sunny skies during the mornings this weekend, with a chance of scattered thunderstorms each afternoon, according to the National Weather Service. Highs will stay in the mid to upper 80s. Newsletter Signup Privacy Policy Terms of Use AI Use Policy Advisory Public Notice - Non-Discriminatory Ad Contracts Some images copyright AP, Clipart.com © Copyright 2025 Saga Communications, Inc , All rights reserved. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "url": "https://habitatocala.org/staff/",
      "text": "Staff - Habitat for Humanity of Marion County Donate Now Skip to content Home homeownership Application for Homeownership FAQs volunteer ways to volunteer events Women Build Bowl2Build Hookin’ For Habitat Fishing Tournament Strawberry Festival All Events ReStore visit us make a donation donate Make A Donation ways to donate Builders Circle Corporate Sponsorship Hope Builders land donations Legacy Builder vehicle donations about who we are board of directors staff financials & policies careers Habitat News pressroom contact Our Staff Administrative Staff Rob Peters President/CEO Ext. 202 rpeters@habitatocala.org Melissa Badge Chief Financial Officer Ext. 201 mbadge@habitatocala.org Jeff Ruttenber Senior Project Manager Ext. 216 jruttenber@habitatocala.org Joanne Black Chief Development & Retail Officer Ext. 214 jblack@habitatocala.org Tori Arens Homebuyer Services Director Ext. 204 tarens@habitatocala.org Justin Lamb Strategic Partnership & Advocacy Director Ext. 218 jlamb@habitatocala.org Carmen Garcia Development Events Manager Ext. 203 cgarcia@habitatocala.org Angela Burrows Volunteer Manager Ext. 210 aburrows@habitatocala.org Teresa Lanning Mortgage Originator Ext. 217 tlanning@habitatocala.org Tess Pokorny Administrative Assistant/AP tpokorny@habitatocala.org ReStore Staff Scheduling: Ext. 222 Debby Underwood 200 Store Manager Ext. 226 dunderwood@habitatocala.org Brian Peters Interim Store Manager Ext. 223 bpeters@habitatocala.org Construction Staff Josh James Construction Director jjames@habitatocala.org Carson Sherrod – Construction Manager Mark Seymour – Site Supervisor Jerry Bryant – Site Supervisor Paul Panicola – Site Supervisor Habitat for Humanity of Marion County is a locally run affiliate of Habitat for Humanity International, a global nonprofit housing organization. We aim to empower individuals and families to build and buy their own homes with the help of people in our community. Quick Links Apply Volunteer Donate Habitat ReStore Events Contact Pressroom Contact Us 1321 SE 25th Loop Suite 103 Ocala, FL 34471 Find us ➜ (P) 352-351-4663 (F) 352-351-3081 Mon-Fri | 8:00am-4:30pm Send us a message ➜ ReStore 200 ReStore 10800 SW 91st Ave, Ocala, 34481 Get directions ➜ 27th Restore 926 NW 27th Ave, Ocala, 34475 Get directions ➜ (P) 352-401-0075 Mon-Sat | 8:30am-4:30pm ©2023 Habitat for Humanity of Marion County, All rights reserved."
    }
  ]
}