{
  "fuentes": [
    {
      "url": "https://www.cityspringstheatre.com/about/staff-2/",
      "email": "info@cityspringstheatre.com"
    },
    {
      "url": "https://www.cityspringstheatre.com/about/staff-2/",
      "email": "info@cityspringstheatre.com"
    },
    {
      "url": "https://www.harristheaterchicago.org/staff-board",
      "email": "info@harristheaterchicago.org"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "boxoffice@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "dan.trottier@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "erika.march@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "julie.rossi@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "liz.curtis@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "liz.curtis@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "morgan.dayley@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "richard.perez@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "casting@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "julie.rossi@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "press@townhalltheatre.com"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "email": "richard.perez@townhalltheatre.com"
    }
  ],
  "mails": [
    "boxoffice@townhalltheatre.com",
    "casting@townhalltheatre.com",
    "dan.trottier@townhalltheatre.com",
    "erika.march@townhalltheatre.com",
    "info@cityspringstheatre.com",
    "info@harristheaterchicago.org",
    "julie.rossi@townhalltheatre.com",
    "liz.curtis@townhalltheatre.com",
    "morgan.dayley@townhalltheatre.com",
    "press@townhalltheatre.com",
    "richard.perez@townhalltheatre.com"
  ],
  "nombre_sitio": "hainescitytheatre.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cityspringstheatre.com/about/staff-2/",
      "text": "Staff | City Springs Theatre Company Staff | City Springs Theatre Company Skip to content Box Office (M-F) 10am-5pm 404-477-4365 info@CitySpringsTheatre.com TICKETS Shows & Tickets Upcoming Shows Subscribe Venue and Ticket Policies Know Before You Go – The Producers Gift Certificates Past Productions Education Pre-Pro Company Login Pre-Pro Tech Program Student Matinees College Process Private Lessons Competition Team Master Classes Weekly Classes Scholarships Faculty Bios VENUE Support Producers Circle Scholarship Fund Annual Giving Institutional Sponsorships Leading Ladies Individual Partners Institutional Partners Auditions About Board of Directors Advisory Board Staff Careers Press Donor Privacy Policy Contact Menu Shows & Tickets Upcoming Shows Subscribe Venue and Ticket Policies Know Before You Go – The Producers Gift Certificates Past Productions Education Pre-Pro Company Login Pre-Pro Tech Program Student Matinees College Process Private Lessons Competition Team Master Classes Weekly Classes Scholarships Faculty Bios VENUE Support Producers Circle Scholarship Fund Annual Giving Institutional Sponsorships Leading Ladies Individual Partners Institutional Partners Auditions About Board of Directors Advisory Board Staff Careers Press Donor Privacy Policy Contact Executive Natalie DeLancey | Executive Director Natalie DeLancey became the Executive Director of City Springs Theatre Company (CSTC) in 2021 after previously helping to form the company as the Managing Director beginning in 2017. She is responsible for overseeing overall operations, fundraising, and artistic vision for CSTC, including raising $3 million annually for the organization and serving roughly 50,000 patrons and students each season. Before City Springs Theatre Company, Natalie was the Director of Arts Education & Community Outreach for ArtsBridge Foundation, the arts education outreach arm of Cobb Energy Performing Arts Centre. Natalie left Cobb Energy Centre in 2017 after winning the program’s first-ever Southeastern Regional Emmy Award for Live Special Event Coverage for the Georgia High School Musical Theatre Awards show produced that year on Georgia Public Broadcasting. Earlier in her career, Natalie served as the Artist Partnerships Manager at Young Audiences, Woodruff Arts Center and as the Manager on Duty at the Jennie T. Anderson Theatre in the Cobb County Civic Center complex. Natalie has a performance background in musical theatre and received a BA in Theatre & Performance Studies from Kennesaw State University’s College of the Arts. Natalie was a member of the 2014 Arts Leaders of Metro Atlanta class, selected for the inaugural 30 Under 30 program with the International Association of Venue Managers in 2015, a member of Leadership Cobb’s class of 2016, received the 2016 Ernest Barrett Award from the Cobb Chamber for her commitment to excellence, and was a member of the 2024 class of Leadership Perimeter. She was recently awarded with the 2024 BOLD Award: Businesswoman Dedicated to Doing Good from the Greater North Fulton Chamber of Commerce and​​ honored as the 2024 inductee into the Georgia Theater Conference’s Hall of Fame. She currently serves as Chair of the Greater Perimeter Chamber of Commerce. Natalie is passionate about high-quality entertainment and arts education, and is thrilled to be in a community that fully supports those initiatives! Artistic Shuler Hensley | Artistic Director Shuler Hensley has been with City Springs Theatre Company since inception with a mission to connect the company to the Broadway district! Shuler is currently starring in Brodway’s The Music Man playing the role of Marcellus Washburn. Most recently he starred as Tom Kettle in Broadway’s The Ferryman and was seen in the New Group’s production of Sweet Charity opposite Sutton Foster. He previously starred on Broadway in No Man’s Land (also Berkeley Repertory Theatre), Waiting For Godot, in repertory, opposite Patrick Stewart, Ian McKellen and Billy Crudup, as The Monster in Young Frankenstein (also the U.S. National Tour), Kerchak in Tarzan, Jud Fry in Oklahoma! (also at The National Theatre and London’s West End- Tony, Drama Desk, Outer Critics Circle and Olivier Awards) and Javert in Les Misérables. He has been seen Off-Broadway: Assassins (Encores!) How The Grinch Stole Christmas at Madison Square Garden, Carousel at Avery Fisher Hall with the New York Philharmonic, The Most Happy Fella and Fiorello! (Encores!), The Whale (Lucille Lortel and Obie Awards; Outer Critics Circle, Drama League, and Drama Desk nominations), Silence! The Musical, Sweet And Sad (Drama Desk Award for Outstanding Ensemble), That Hopey Changey Thing, The Great American Trailer Park Musical. His other credits include the Kennedy Center’s production of The Guardsman, directed by Gregory Mosher, Ghost Brothers Of Darkland County (Alliance Theatre), All About Us (Westport Playhouse), The Phantom in The Phantom of the Opera (Hamburg, Germany), The Most Happy Fella (American Songbook/Lincoln Center). Opera appearances include Wozzeck (Curtis Institute Of Music), Regina (Kennedy Center). Shuler has also performed with the New York Philharmonic, San Francisco Symphony Orchestra and the New World Symphony Orchestra. TV credits include: “Murder of a President”, “Shades of Blue,” “Banshee”, “The Americans,” “Ed,” “Deadline,” “Gary Powers,” “Law & Order: SVU,” “Criminal Intent,” “The Jury.” Film includes: The Greatest Showman, After.Life, The Legend of Zorro; Van Helsing; Monday Night Mayhem; Someone Like You; The Bread, My Sweet; Opa! Proud Equity member. Shuler was awarded the “Stage Performance of the Year” by New York Magazine in recognition for his work in The Whale. Shuler is also the namesake of the Georgia High School Musical Theatre Awards at Cobb Energy Performing Arts Centre.​ Nick Walker Jones | Artistic Associate Nick joins the City Springs Theatre Company staff after most recently appearing in the successful productions of Disney’s Beauty and the Beast (as Lumiere); Legally Blonde (as Warner Huntington III), and Jersey Boys (as Bob Gaudio.) Since earning a Bachelor of Fine Arts in Music Theatre from Florida State University, Nick has had a successful theatrical career Off-Broadway, touring nationally, appearing regionally across the country, and now locally in Atlanta and Sandy Springs. He has also previously worked with the theatre’s City Springs Theatre Conservatory, served as interim Company Manager, and has been fortunate enough to appear additionally in the company’s productions of West Side Story, Monty Python’s Spamalot, Fiddler on the Roof, and White Christmas . Business Steve Hauser | Director of Business & Legal Affairs Steve Hauser joins the CSTC team after a lengthy career as an in-house lawyer and senior executive at The Coca-Cola Company and general counsel of CONA Services, a Coca-Cola system IT services company. With a background in entertainment and marketing law and business development, Steve handles overall legal support for CSTC and also works on partner alliances and other strategic business matters. A founder of CSTC and its former board chair, Steve’s actual theater experience consists of playing sax in the pit orchestra for college productions of Carousel and 1776! Steve has been actively involved in the arts and non-profit activities in Atlanta, including board membership with Habitat for Humanity Georgia and Atlanta Lyric Theatre and support of various non-profits through the Atlanta Pro Bono Legal Partnership. Steve and his wife Susan live in Sandy Springs.​ Nejra Lilic | Business Manager Nejra is a graduate of Kennesaw State University with degrees in Accounting and in Management Information Systems. At KSU she was on both the Dean’s and the President’s lists. She previous has worked as an accountant for Lippman & Company, LLC, and as a Senior Advisory Associate for Maudlin & Jenkins, LLC. Nejra is a member of the American Institute of CPAs and the Georgia Society of CPAs. Marketing and Development Mason Wood | Director of Media & Marketing Mason is a New Orleans native who has been marketing and creating digital content for the arts  since 1996. His 21st century clients have included Trevanna Entertainment, Spotify, The Red Bull Music Academy, Renaissance Hotels, The Apollo Theater (Harlem, NY), The Gallery Players (Brooklyn, NY), The National World War II Museum (New Orleans), WYES-TV (New Orleans), and the Cobb County Center for Excellence in the Performing Arts. He has also worked on personal projects with filmmaker Edgar Wright, actor Harry Shearer and his wife, singer Judith Owen. For eleven years, Mason worked as the Director of Video Production for Intersection, an Alphabet-owned media and technology company in New York City. His background in video production began in broadcast news, as an Emmy-winning producer for ChicagoLand TV News, before moving on-camera as a reporter-anchor for WAFB-TV, the CBS affiliate in Baton Rouge, LA, and also as a reporter and film critic for the New Orleans newspaper Gambit Weekly. Mason served as the Director of Marketing for the historic Saenger Theatre in New Orleans from 2001-2005, leading the efforts to celebrate the building’s 75 anniversary. Occasionally he has appeared onstage as an actor, including roles in 1776, Amadeus, Into The Woods, Picasso at the Lapin Agile, The 39 Steps , Young Frankenstein , Shrek , and Monty Python’s Spamalo t. In March 2025 he briefly stepped into the roles of J.P Morgan/The Judge in CSTC’s production of Ragtime The Musical for a two performances and remembered his lines. IG: @masonwoodvideo Vernalisa Rougeux | Director of Corporate Sponsorships Grounded in the performing arts, Vernalisa Rougeux received a full vocal scholarship to college, where she was also elected Student Government Association president. There she discovered the power of connecting people from diverse backgrounds. That foundation has shaped her path and now comes full circle in her role as Director of Corporate Sponsorships at City Springs Theatre Company. In this position, she leads efforts to cultivate partnerships that advance the organization’s mission and deepen community engagement, combining her artistic passion with her expertise in building meaningful relationships. Prior to joining City Springs Theatre Company, Vernalisa produced fund generating events for the Greater North Fulton Chamber of Commerce. There, she led the Chamber’s BOLD Women’s Committee and programming and oversaw signature events such as the BOLD Women’s Leadership Summit, the Annual Golf Classic, and the Taste of North Fulton for the region. She worked closely with corporate sponsors and community leaders to deliver impactful experiences that strengthened both business and community connections. A graduate of the Leadership North Fulton Class of 2025 , Vernalisa is dedicated to fostering collaboration and creating opportunities that inspire growth. In addition to her professional work, she has worked with local businesses and organizations to develop strategies for expanding community partnerships to bring people together. Lesley Gamwell | Press and Media Relations For all press and media inquiries, contact Lesley Gamwell  of Rountree Group Communications at 404-309-6915 , or via email at lgamwell @ rountreegroup.com Production Matthew Peddie | Production Manager Photo and bio coming soon. T.J. King | Technical Director T.J.’s production experience in carpentry, rigging and automation is backed by many Broadway shows and National/International tours. He has helped to build, install and present some shows such as Come From Away, Moulin Rouge and Rent . He holds a BFA in theatre production from the University of Florida. When not building for the stage and screen, he also does home improvement and renovation projects. T.J. is thrilled to share his enthusiasm for the arts with CSTC and join the movement for creating high quality theatre in the Atlanta area. He is very lucky to have the support of his amazing wife Autumn and two incredible boys. Justin Gamerl | Production Carpenter Photo and bio coming soon! Kathy Oliver | Associate Production Manager Ka With a career spanning over two decades in the film and television industry, Kathy’s credits include “The Bondsman”, “Ozark”, “American Horror Story”, “Preacher” and “Abraham Lincoln: Vampire Hunter”. Kathy brings with her a strong background in supervision & coordination and is excited to bring her strong sense of logistics and creative problem-solving skills to the fast paced world of live performance. Sam Skelton | Orchestra Manager A native of Conyers, Georgia, Sam Skelton has been active on the Atlanta music scene for well over three decades. Mr. Skelton graduated summa cum laude from Georgia State University with a degree in Jazz Studies. During his course of study at GSU, Sam was a Montgomery Music Scholar and a two-time fellowship recipient to the Aspen Music Festival. He continued his saxophone studies with Kenneth Radnofsky at Boston University in 1991 focusing on classical saxophone and music education. Other teachers include David and James “Dub” Hudson and Jeff Benedict. Sam is currently Director of Jazz Studies and Senior Lecturer in Saxophone at Kennesaw State University. He is also Artistic Director of GSO Jazz and GYSO Jazz. Sam served as Professor of Saxophone at Georgia State University from 1991 to 2004 and was Jazz Ensemble Director at Georgia Tech from 2002-2004 and Artist-in-Residence at The University Of Georgia Jazz Department. He served as Visiting Professor of Saxophone at Furman University 2001-02. Professional associations include: The Jazz Educators Network, Georgia Music Educators Association, Georgia Association of Jazz Educators, National Academy of Recording Arts & Sciences (voting member) and the American Federation of Musicians. For his contributions to the city’s cultural life, Atlanta Public Broadcasting named him a “Lexus Leader in the Arts” in 2003. Sam is proud to be a Conn-Selmer and D’Addario Artist. ​ Patron Services and Administration Devon Szklanka | Donor Relations & Operations Manager Bio Coming Soon! Greta Goldberg | Box Office Coordinator Greta Goldberg is an Atlanta native and originally started her time at City Springs Theatre Company as a Patron Services Representative. She has been an avid theatre lover since childhood and has worn many hats throughout her years of being in theatre. Greta received her Bachelor of Arts from Kennesaw State University in Theatre & Performance Studies. She started out as a performer, but has spent most of her time behind the scenes in various roles: dramaturgy, writing, assistant directing, theatre management, costuming, etc. Greta most recently spent time working in the Cobb County Library System.  She is very honored and excited to step into her new role as Studio Coordinator and help continue to bolster the wonderful theatre community at City Springs Theatre Company. Education Jenna Gamerl | Director of Education Originally from Hughesville, Pennsylvania, Jenna received her BFA in dance education and musical theatre from The University of the Arts in Philadelphia. Jenna joined the national tour of “Sesame Street Live,” performing the role of Ernie and Live Dancer for two seasons. She then became the performance director for two domestic and international tours of “Sesame Street/USO Experience” for military families. Jenna serves as the assistant stage manager for City Springs Theatre Company as well as a performer for various companies throughout Atlanta. She loves helping students discover their artistic passions and dreams as they find their voice in life.​ Brian Wittenberg | Education Manager An Atlanta native, Brian Wittenberg received his BFA in Musical Theatre from the University of Alabama at Birmingham. He has performed in productions at City Springs Theatre Company, Mill Mountain Theatre Company, Flat Rock Playhouse, Atlanta Lyric Theatre and more. He has also directed several productions across the Atlanta area. Most recently, Brian served as the theater director at Chattahoochee High School in Johns Creek, GA. As an artist, he is fiercely dedicated to leaning into hope so that we as a community can make tangible changes to the world through the power of storytelling. As an educator, Brian hopes to create environments where students are able to express themselves fully and encourage and develop their passion for telling stories. City Springs Theatre Company Offices and Studios 8601 Dunwoody Place Suite 136, Sandy Springs, GA 30350 Performance Venue Byers Theatre, 1 Galambos Way, Sandy Springs, GA  30328 404-477-4365 info@cityspringstheatre.com Shows Education Venues Auditions About Support Contact Menu Shows Education Venues Auditions About Support Contact Follow Us Facebook Instagram Twitter LinkedIn JOIN OUR MAILING LIST City Springs Theatre Company is dedicated to entertaining, educating, and enriching lives by creating world class theatre experiences and innovative arts education that drive cultural richness and economic vitality. Copyright 2023 © All rights Reserved SUBSCRIBE TO OUR NEWSLETTER SIGN UP! JOIN THE ELITE CLUB Scroll to Top"
    },
    {
      "url": "https://www.harristheaterchicago.org/staff-board",
      "text": "Staff + Board | Harris Theater Skip to main content Close Search Search Harris Theater Virtual Stage Display Search Field Donate Discover Harris Theater Presents Resident Companies Engagement + Education HT Virtual Stage Our Space Learn About Our Space Specifications + Rates Support Donate Now Ways to Give Creative Future Fund Planned Giving Sponsor a Seat Events + Tickets Subscribe + Save Subscribe to any of the Harris Theater Presents series for the deepest discount. Learn More Subscribe to HTP 25/26 Upcoming Events Box Office Digital Ticket Login Digital Ticket FAQ Student Discounts Seating Chart Toggle Side Navigation Close Search Search Discover Toggle Menu Harris Theater Presents Resident Companies Engagement + Education HT Virtual Stage Our Space Toggle Menu Learn About Our Space Specifications + Rates Support Toggle Menu Donate Now Ways to Give Creative Future Fund Planned Giving Sponsor a Seat Events + Tickets Toggle Menu Subscribe to HTP 25/26 Upcoming Events Box Office Digital Ticket Login Digital Ticket FAQ Student Discounts Seating Chart Our Story Toggle Menu Mission + Vision Commitment to Equity + Core Values Our History Employment Staff + Board HT Associate Board Plan Your Visit Toggle Menu Directions + Parking Digital Ticket Login Digital Ticket FAQ Seating Chart Code of Conduct Hotel + Restaurant Partners Accessibility Our Neighborhood FAQs Close Search Search Harris Theater Virtual Stage Display Search Field Donate For Press Contact Do Not Sell or Share My Data 205 E. Randolph Chicago, IL, 60601 Box Office: 312.334.7777 info@harristheaterchicago.org Non-Performance Day Phone Hours Monday – Friday: Noon to 5PM Saturday – Sunday: Closed Performance Day Phone Hours Monday – Friday: Noon to Curtain Saturday – Sunday: Two hours prior to performance until Curtain Walk-Up Box Office Hours The box office opens 60 minutes prior to every performance. Facebook Twitter Instagram Staff + Board Share Share on Facebook Share on Twitter Share with Email STAFF Leadership Team Lori Dimun, Alexandra C. and John D. Nichols President and Chief Executive Officer Laura Hanssel, Chief Financial Officer Susan Lape, Vice President of Development Emily Macaluso, Vice President of Operations and Production / General Manager Kari Shaffer, Vice President of Marketing and Sales Finance and Administration Pragnesh Gandhi, Director of Finance Danielle Pender, Director of Human Resources Development Cate Mascari, Director of Donor Relations Nathaniel Davis, Director of Institutional Giving Madison R. Jones, Manager of Donor Events and Communications Emma Lawrence, Board and Donor Relations Coordinator Marketing Adriana Prieto, Director of Marketing Amelia Thelen, Marketing Manager Maria Orozco, Digital Marketing Manager Programming and Engagement Laura Stellwagon, Director of Programming and Engagement Ticketing Codashti McAllister, Tessitura Administrator Juanita Smith, Box Office Treasurer Naomi Clark, Marley Doakes, Kylie Stone, Tadhg Mitchell Ticketing Services Representatives Production Ben Jones, Director of Production Clare Roche, Production Manager Anthony Montuori, Head Carpenter and IATSE Steward Sam Begich, Head Electrician Laura Hamernick, Head of Audio Richard Hoyle, Head of Props Morgan Wright, Head Fly Operations and Front of House Jennifer Martin, Director of Operations Craig McNabb, Audience and Access Services Manager Bridget Savage, Concessions and Special Events Manager Josie Moore , Theater Administration Coordinator Ezra Brown, Juwan Harris, Jorge Castaneda, Christian Nix, Manson Scurlock Security Staff Dillon Zamora, RyAnne Galowich, Amber Johnson House Managers Melany Reed, Saints Coordinator The Saints, Volunteer Usher Corps Facilities and Venue Services Ed Mlakar, Facilities Engineer Leticia Cisneros, Venue Services Manager Berto Rivera, Facility Operations Manager Juan Medina, Facility Operations Assistant Delia Ochoa, Venue Services Associate Victor Orozco, Venue Services Associate BOARD OF TRUSTEES Officers Peter M. Ellis, Chairman Claire O’Grady, Vice Chair Nancy Santi, Vice Chair Lori Dimun**, President and CEO Sara Albrecht, Secretary Robert J. Gauch, Treasurer Trustees Alaina Anderson Kathryn Kovitz Arnold Bernard Bartilad Kori Coleman** Michelle N. Durpetti Louise Frank Ted Grady Sandra P. Guthman*, Past Chairman Caryn Harris*, Past Vice Chair Joan W. Harris*, Past Chairman Terell Johnson** Sherry Jursa Christine N. Evans Kelly Merrillyn J. Kosier*, Past Chairman Franco La Marca D'Andrae Larry Michael McStraw Sarah Solotaroff Mirkin Alexandra C. Nichols*, Past Chairman Kenneth R. Norgan † Gregory J. O’Leary Abby McCormick O’Neil*, Past Chairman Scott Rafferty Jai Shekhawat John Q Smith David Snyder, Past Chairman Sunitha Thomas Marilyn Fatt Vitale Maria Zec Life Trustees Peter M. Ascoli Cameron S. Avery John W. Ballantine Marshall Field V Robin S. Tryloff As of July 2025 *member of Executive Committee **ex-officio † fondly remembered ASSOCIATE BOARD The Harris Theater Associate Board supports the Harris Theater by expanding audiences and strengthening efforts to connect art, artists, and communities through the Mix at Six series and events throughout the season. Learn more . Stay connected! Sign up or update your email preferences. Manage Account Image Credits Image taken by Kyle Fluback For Press Contact Do Not Sell or Share My Data 205 E. Randolph Chicago, IL, 60601 Box Office: 312.334.7777 info@harristheaterchicago.org Non-Performance Day Phone Hours Monday – Friday: Noon to 5PM Saturday – Sunday: Closed Performance Day Phone Hours Monday – Friday: Noon to Curtain Saturday – Sunday: Two hours prior to performance until Curtain Walk-Up Box Office Hours The box office opens 60 minutes prior to every performance. FAQ My Account Our Story Our Space © 2025 Harris Theater at Millennium Park Site By Interactive Strategies Facebook Twitter Instagram"
    },
    {
      "url": "https://www.townhalltheatre.com/contactus",
      "text": "Contact Us — Town Hall Theatre Company Skip to Content Open Menu Close Menu Donate to THTC Donate A Letter from the AD Donors Buy Tickets Single Tickets Subscribe Plan Your Visit 2025-2026 Season Snowbound: A Holiday Tale Tiny Beautiful Things Past Productions Special Events Front Porch Music Presents Yes and D&D Education About THEd Fall 2025 Adult Education THEd Residencies Young Playwrights Festival About Mission and History Team and Board DEIJ Commitment Press Room Contact Us Get Involved Volunteer Auditions Jobs and Internships Submissions 0 0 0 0 Donate to THTC Donate A Letter from the AD Donors Buy Tickets Single Tickets Subscribe Plan Your Visit 2025-2026 Season Snowbound: A Holiday Tale Tiny Beautiful Things Past Productions Special Events Front Porch Music Presents Yes and D&D Education About THEd Fall 2025 Adult Education THEd Residencies Young Playwrights Festival About Mission and History Team and Board DEIJ Commitment Press Room Contact Us Get Involved Volunteer Auditions Jobs and Internships Submissions Open Menu Close Menu Folder: Donate to THTC Back Donate A Letter from the AD Donors Folder: Buy Tickets Back Single Tickets Subscribe Plan Your Visit Folder: 2025-2026 Season Back Snowbound: A Holiday Tale Tiny Beautiful Things Past Productions Folder: Special Events Back Front Porch Music Presents Yes and D&D Folder: Education Back About THEd Fall 2025 Adult Education THEd Residencies Young Playwrights Festival Folder: About Back Mission and History Team and Board DEIJ Commitment Press Room Contact Us Folder: Get Involved Back Volunteer Auditions Jobs and Internships Submissions Contact Us Address: 3535 School Street, Lafayette, CA  94549 Box Office Phone: (925) 283-1557 Box Office Email: BoxOffice@TownHallTheatre.com Box Office Hours of Operation: Thursday-Friday 4:00pm-6:00pm and Saturday 2:00pm-4:00pm Production Office and Town Hall Education Phone: (925) 283-6673 Media Inquiries: press@townhalltheatre.com; Casting Inquiries: casting@townhalltheatre.com Town Hall Theatre Staff Contacts Managing Director: Morgan Dayley Morgan.Dayley@TownHallTheatre.com Artistic Director:  Richard Perez Richard.Perez@TownHallTheatre.com Education Director:  Erika March Erika.March@TownHallTheatre.com Technical & Facilities Director:  Dan Trottier Dan.Trottier@TownHallTheatre.com Director of Community Experience:  Elizabeth Curtis Liz.Curtis@TownHallTheatre.com Production Assistant:  Julie Rossi Julie.Rossi@TownHallTheatre.com Stay in the loop Sign up with your email address to receive news and updates. Email Address Sign Up Thank you! Town Hall Theatre Company 3535 School Street, Lafayette, CA. 94549 Box Office: 925-283-1557 Production & Education Office: 925-283-6673"
    }
  ]
}