{
  "fuentes": [
    {
      "url": "https://hainescity.com/179/Swim-Lessons",
      "email": "heidi.mcintee@hainescity.com"
    },
    {
      "url": "https://hainescity.com/161/Planning-Division",
      "email": "dsea@hainescity.com"
    },
    {
      "url": "https://hainescity.com/161/Planning-Division",
      "email": "planmanager@hainescity.com"
    },
    {
      "url": "https://hainescity.com/161/Planning-Division",
      "email": "planner2@hainescity.com"
    },
    {
      "url": "https://hainescity.com/161/Planning-Division",
      "email": "zoninginspector@hainescity.com"
    },
    {
      "url": "https://hainescity.com/161/Planning-Division",
      "email": "planner1@hainescity.com"
    },
    {
      "url": "https://hainescity.com/397/Private-Parties",
      "email": "heidi.mcintee@hainescity.com"
    },
    {
      "url": "https://www.lakemonroewaterfund.org/board/",
      "email": "info@lakemonroewaterfund.org"
    },
    {
      "url": "https://hainescity.com/416/Programs",
      "email": "heidi.mcintee@hainescity.com"
    },
    {
      "url": "https://hainescity.com/173/Aquatics",
      "email": "heidi.mcintee@hainescity.com"
    },
    {
      "url": "https://www.aquadocinc.com/about-our-company/team/",
      "email": "info@aquadocinc.com"
    }
  ],
  "mails": [
    "dsea@hainescity.com",
    "heidi.mcintee@hainescity.com",
    "info@aquadocinc.com",
    "info@lakemonroewaterfund.org",
    "planmanager@hainescity.com",
    "planner1@hainescity.com",
    "planner2@hainescity.com",
    "zoninginspector@hainescity.com"
  ],
  "nombre_sitio": "hainescity.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://hainescity.com/179/Swim-Lessons",
      "text": "Swim Lessons | Haines City, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Living & Visiting Doing Business How Do I... Facebook Twitter Instagram Instagram Search Home Departments Parks & Recreation Department Aquatics Swim Lessons Swim Lessons The Lake Eva Aquatic Center and the Janet J. Smith Aquatic Facility both offer a variety of swim lesson classes through the American Red Cross Learn to Swim program. All classes are taught by American Red Cross certified Water Safety Instructors. Swim Lessons are $40.00 per child, per session. Each session is 8 classes. Registration for the Fall 2025 swim lesson sessions will open up on Tuesday, August 12, 2025 at 8:30 AM, and will continue until all spots have been filled. Registration will be available in-person at the Lake Eva Community Center, the Oakland Neighborhood Center, and online using the Community Pass Registration Website . Need assistance with our online registration system? Here is a how to guide: Online Registration Instructions Check the links below for class schedules: Parent & Child Lessons: Ages 6 months - 2 years Preschool Lessons: Ages 3-5 Learn-to-Swim: Ages 6 - 14 Other Lessons: Adult Classes & Private Lessons ********** Scholarship Opportunities Morris & Leah West Foundation Thank you to the Morris & Leah West Foundation for their continued sponsorship of free swim lessons for the community. Now in the 4th year of their sponsorship, the foundation will be providing 50 free swim lessons this year. For more information about this program, please contact the Morris & Leah West Foundation directly at https://www.morrisandleahwestfoundation.org/ American Red Cross Centennial Program Our continued partnership with the American Red Cross Centennial program will allow Haines City Parks & Rec to offer one (1) reduced-rate session per participant (while scholarship funds last). WaterSmartFL State Voucher Haines City Parks & Recreation is now a vendor for the WaterSmartFL State Voucher. The purpose of this program is to increase water safety and prevent drowning in Florida by providing free swimming lessons to eligible Florida families. What is needed to apply for a voucher? 1. Proof of income (gross family income of no more than 200% of the federal poverty guidelines). 2. Proof of Florida residency. 3. Child’s date of birth (only children ages four and younger at the time of application are eligible). To apply for this voucher, visit the Florida Health website here: https://azapps.floridahealth.gov/SLVoucher CONTACT US Aquatics Superintendent : Heidi McIntee Phone: (863) 421-3700 Email: heidi.mcintee@hainescity.com 1 of 1 people found this page helpful. Was this page helpful for you? Yes No Parent & Child Preschool Learn to Swim Other Lessons Pay Utility Bill START UTILITY SERVICES job openings Report An Issue Public Records Contact Us 620 East Main Street Haines City, Florida 33844 Phone: 863-421-3600 Helpful links Subscribe to City Manager’s Report Cemeteries Online Community Redevelopment Agency (CRA) Parks & Recreation /QuickLinks.aspx FAQs What are the hours of operation for the Lake Eva Community Center? What are the hours of operation for the Oakland Neighborhood Center? What is the address to the Lake Eva Event Center? /FAQ.aspx Using This Site Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Under Florida law, email addresses are public records. If you do not want your email address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://hainescity.com/161/Planning-Division",
      "text": "Planning Division | Haines City, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Living & Visiting Doing Business How Do I... Facebook Twitter Instagram Instagram Search Home Departments Development Services Department Planning Division Planning Division Overview The Planning Division is responsible for current and long-range planning and development review. In fulfilling that responsibility, the Division is charged with developing and maintaining two of the City’s regulatory documents: Land Development Regulations These documents are designed to protect and preserve the residents' and visitors' quality of life in the City of Haines City. Staff Liaisons Planning staff also serves as liaison to the: Board of Adjustments Planning Commission Each of these boards plays an integral role in achieving the goals set forth by the City Commission. Planning Forms Board of Adjustment Variance - ADA - v1 Conditional Use Administrative - APDF - v1 Conditional Use Application - City Commission Action - ADA - v.3 Voluntary Annexation Petition Consent - APDF Was this page helpful for you? Yes No Contact Us April  Brown Planning Manager Email April Brown More Information Grace Malpartida, MPA, MSCJ Planner Email Grace Malpartida More Information Calvin  Clarke Planner Email Calvin Clarke More Information Brandi Lane Zoning Inspector Email Brandi Lane More Information Valene Bailey Executive Assistant Email Valene Bailey More Information Building Division Planning Division Zoning Inquiry Pay Utility Bill START UTILITY SERVICES job openings Report An Issue Public Records Contact Us 620 East Main Street Haines City, Florida 33844 Phone: 863-421-3600 Helpful links Subscribe to City Manager’s Report Cemeteries Online Community Redevelopment Agency (CRA) Parks & Recreation /QuickLinks.aspx FAQs How do I know if I am dealing with a reputable contractor? What is my property zoned? /FAQ.aspx Using This Site Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Under Florida law, email addresses are public records. If you do not want your email address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://hainescity.com/397/Private-Parties",
      "text": "Private Parties | Haines City, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Living & Visiting Doing Business How Do I... Facebook Twitter Instagram Instagram Search Home Departments Parks & Recreation Department Aquatics Group Outings Private Parties Private Parties The Lake Eva Aquatic Center and the Janet J. Smith Aquatic Facility can be reserved for your private events. Reservations are available on Saturdays and Sundays only. Lake Eva Aquatic Center Reservations for Lake Eva Aquatic Center are now open and are available on weekends only from June 14, 2025  - November 16, 2025. Janet J. Smith Aquatic Facility Reservations for Janet J. Smith Aquatic Facility are now open and are available on weekends only from May 3, 2025  - September 28, 2025. Available times are 9:30-11:30 AM or 6:30-8:30 PM . All reservations must be made at least fourteen (14) days in advance. Reservations must be made in-person at the Lake Eva Community Center, located at 555 Ledwith Ave., or at the Oakland Neighborhood Center, located at 915 Ave. E, between the hours of 8:00 AM - 8:00 PM. Please bring your completed application, photo I.D., proof of residency (if you reside inside the city limits of Haines City), and all applicable fees when coming to book your date. All reservation requests must be approved by the Parks & Recreation Director. Aquatic Facility Reservation Form Note: Facilities can only be reserved for one party at a time per facility, per time slot. The rental fees listed are for the 2 hour time block listed above. Lifeguard fee of $10 per hour, per lifeguard is also required. CONTACT US Aquatics Superintendent : Heidi McIntee Phone: (863) 421-3700 Email: heidi.mcintee@hainescity.com Lake Eva Aquatics Center RESIDENT FEE (plus sales tax) NON-RESIDENT FEE (plus sales tax) LIFEGUARD FEE (plus sales tax) Competition Pool $150 $250 $60 Kiddie Pool $150 $250 $100 Entire Facility $150 $250 $140 Janet J. Smith Aquatic Facility RESIDENT FEE (plus sales tax) NON-RESIDENT FEE (plus sales tax) LIFEGUARD FEE (plus sales tax) Entire Facility $100 $200 $80 Was this page helpful for you? Yes No Private Parties Field Trips Pay Utility Bill START UTILITY SERVICES job openings Report An Issue Public Records Contact Us 620 East Main Street Haines City, Florida 33844 Phone: 863-421-3600 Helpful links Subscribe to City Manager’s Report Cemeteries Online Community Redevelopment Agency (CRA) Parks & Recreation /QuickLinks.aspx FAQs What are the hours of operation for the Lake Eva Community Center? What are the hours of operation for the Oakland Neighborhood Center? What is the address to the Lake Eva Event Center? /FAQ.aspx Using This Site Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Under Florida law, email addresses are public records. If you do not want your email address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.lakemonroewaterfund.org/board/",
      "text": "Our People - Lake Monroe Water Fund Skip to content Home About Us Mission Our People Partners Programs Lawns/Gardens/Farms Forests/Woodlands Septic Systems Learn Water Funds About Lake Monroe Drinking Water Recreation Natural Heritage Economy News Events Get Involved Menu Home About Us Mission Our People Partners Programs Lawns/Gardens/Farms Forests/Woodlands Septic Systems Learn Water Funds About Lake Monroe Drinking Water Recreation Natural Heritage Economy News Events Get Involved GIVE Home About Us Mission Our People Partners Programs Lawns/Gardens/Farms Forests/Woodlands Septic Systems Learn Water Funds About Lake Monroe Drinking Water Recreation Natural Heritage Economy News Events Get Involved Menu Home About Us Mission Our People Partners Programs Lawns/Gardens/Farms Forests/Woodlands Septic Systems Learn Water Funds About Lake Monroe Drinking Water Recreation Natural Heritage Economy News Events Get Involved GIVE Home About Us Mission Our People Partners Programs Lawns/Gardens/Farms Forests/Woodlands Septic Systems Learn Water Funds About Lake Monroe Drinking Water Recreation Natural Heritage Economy News Events Get Involved Menu Home About Us Mission Our People Partners Programs Lawns/Gardens/Farms Forests/Woodlands Septic Systems Learn Water Funds About Lake Monroe Drinking Water Recreation Natural Heritage Economy News Events Get Involved DONATE ENDOWMENT OUR PEOPLE Staff Michelle Cohen Executive Director Board of Directors Jane MartinRetired Venture Capitalist LMWF President & Treasurer Cassie Hauswald The Nature Conservancy LMWF Secretary Alex Crowley Indiana Energy Independence Fund Dan Davis Community Foundation of Jackson County Christian Freitag Conservation Law Center Justin Meschter City of Bloomington Utilities Sandy LynchIndividual Scott Mills Brown County Joe Schmees The Nature Conservancy Eric Spoonmore Greater Bloomington Chamber of Commerce Teri Willey Pathway to Cures Consultants Mike Chaveas National Forest Management Randy JonesIndividual Bill Weeks Conservation Law Center Michelle Cohen Michelle Cohen joined the water fund in 2022, bringing 12 years of experience heading other environmental entities to the role of Executive Director, first as the Brown County Solid Waste Management District Manager, and subsequently as the Executive Director for the Indiana Recycling Coalition (now dubbed Circular Indiana). She graduated magna cum laude from Wittenberg University, and then came to Bloomington where she earned a Master’s of Science degree in Environmental Science from the (O’Neill) School for Public and Environmental Affairs at Indiana University. Michelle has lived in the area for over 25 years and enjoys spending time with her family and dog in the great outdoors. Jane Martin Jane’s career in Venture Capital has spanned 5 decades beginning in Chicago with Allstate’s $250 million portfolio then moving to Silicon Valley to join USVP as a General Partner in its first three funds. After retiring to Bloomington in the 1990’s she began investing as a Limited Partner in multiple Venture Funds and doing pro bono work. In 1999 she spun out IU’s first technology company, Wisdom Tools, and served as its CEO. In 2001 she joined Massachusetts based Village Ventures as a General Partner and cofounded an affiliate fund, Spring Mill Ventures, in 2004. Jane received her B.S. from IU’s Kelley School of Business. She received her CFA Charter in 1979. She is on multiple nonprofit boards and is an active angel investor in social impact investments. Eric Spoonmore Eric Spoonmore became the president & CEO of the Greater Bloomington Chamber of Commerce on December 1, 2021. Prior to joining the Chamber, he served for six years as the elected District 4 Representative on the Monroe County Council including two years as Council president. In addition to his service on the County Council, Eric has more than a decade of experience as an administrator at the Kelley School of Business. He received his bachelor’s and M.P.A. degrees from Indiana University Bloomington where he studied management & public administration. Cassie Hauswald With a strong desire to protect the very place she calls home, Cassie Hauswald has worked on conservation issues for the past two decades. Cassie is currently the Director of Freshwater Programs for the Same Shine Foundation. She previously served as The Nature Conservancy in Indiana’s freshwater ecologist, focusing on aquatic habitats with consideration for how rural land use impacts the health of our rivers and streams.  Cassie welcomes the opportunity to be a part of an effort to connect conservation action with an improved Lake Monroe, a drinking water source for her and so many others. Cassie holds a Bachelor’s degree from Butler University and a Masters of Biology from the University of Louisville where her research focused on the life history of elephant ear mussels in southern Indiana’s Blue River.  In her free time, Cassie enjoys running and hiking with her husband and flat-coated retrievers, traveling, gardening, and enjoying the great outdoors. Alex Crowley Alex Crowley is the Executive Director of the Indiana Energy Independence Fund whose vision is to build a community-focused initiative that offers a range of financial products and services that allows Hoosiers to take control of their energy costs and move toward energy independence. He previously served as the Director of Economic & Sustainable Development with the City of Bloomington.  While with the City his responsibilities were to cultivate a resilient community built on shared prosperity, economic opportunity, environmental stewardship, and a thriving arts and culture ecosystem.  Before joining the City, Alex helped to run and launch small businesses in and around Bloomington. His professional background combines advertising and operations management in a variety of fields including telecommunications.  He has held leadership positions at Ogilvy & Mather: New York, AT&T and Insight Communications.  He served on the Board at Cardinal Stage Company.  Alex is a native of New Haven, Connecticut, a graduate of Fordham College in New York, a composer, and the doting father of a sophomore Boilermaker, and two high schoolers. Dan Davis Dan Davis of Seymour is the President and Chief Executive Officer of the Community Foundation of Jackson County. His work in philanthropy is a second career having earlier spent 30 years as a newspaper reporter and editor. Dan is a graduate of Indiana University, majoring in English at IUPUI in Indianapolis. He and his wife, Karen, have two daughters. Beside his family, Dan is passionate about the St. Louis Cardinals, IU sports, as well as hiking in Hoosier woodlands and helping others through his philanthropic work with the Foundation. Christian Freitag Christian Freitag joined Conservation Law Center in 2019 as its second executive director, replacing founder and longtime director W. William Weeks III. For the previous 18 years, he served as executive director of Sycamore Land Trust, a nonprofit land conservation organization in Southern Indiana. Freitag graduated from the Maurer School of Law in 1997 and clerked from 1997–1999 for former Indiana Chief Justice Randall T. Shepard. He received his PhD from IU’s O’Neill School of Public and Environmental Affairs in 2010, where his research focused on the implementation of the National Environmental Policy Act on public agencies including the US Forest Service. The topic of his dissertation was “An Institutional Analysis of the National Environmental Policy Act in the United States Forest Service.” Freitag received the Distinguished Hoosier Award in 2007 from Indiana Governor Mitchell E. Daniels, Jr. He lives in the beautiful, unglaciated hardwood forests of Southern Indiana with his wife, Paige, and two Labrador retrievers. Alexandra \"Sandy\" Lynch Alexandra “Sandy” Lynch joined the water fund’s board in February, 2024. She is a retired local professional who brings extensive experience in communications, non-profit leadership, public relations, fundraising, and newsletter production to her board role with the water fund. She developed an affinity for Lake Monroe Reservoir as a young teen who learned about its construction in the 1960’s. Justin Meschter Justin currently serves as the water quality coordinator for City of Bloomington Utilities where he works on compliance and keeps up with regulatory changes. Prior to his current role Justin was a water quality analyst for City of Bloomington Utilities. Before joining us in Indiana, Justin worked as a staff scientist at the Smithsonian Environmental Research Center in Edgewater Maryland on a NOAA vegetation survey to help improve the accuracy of LiDAR determination in wetland ecosystems. Justin has an extensive background in environmental science and coastal ecology. He earned a BS in environmental science from Villanova University where he worked as a laboratory manager at Villanova for 2 years on research projects relating to climate change in tidal wetlands. He then went on to earn a masters degree in environmental science from the University of Maryland. Justin enjoys time at the lake and hiking with his dogs. Scott Mills Scott earned a Ph.D. in Animal Science from Iowa State in 1982 and spent his career in the school of Agriculture (Animal Science department) at Purdue (1984-2016) teaching physiology and nutrition, and conducting research on animal growth. Scott and his wife retired to Brown County in 2014 which has allowed them to spend a lot of time enjoying the outdoors.  Scott has been active with Brown County Habitat for Humanity and as a member of the ad hoc Bicycle/Pedestrian Committee for Nashville. Joe Schmees Joe Schmees has worked in the environmental and water resources field for over 17 years. He worked for the Indiana Department of Environmental Management from 2007 until 2018 and managed the Indiana State Nonpoint Source and Total Maximum Daily Load Programs for over three years. Joe was the Executive Director of the Indiana Association of Soil and Water Conservation Districts from 2018 through 2022. He began as the Freshwater Strategy Manager for the Indiana Chapter of The Nature Conservancy in 2023. He has been active in various professional organizations and is currently the Past President of the Indiana Lakes Management Society and the Treasurer of the Indiana Water Resources Association. Joe has served three gubernatorial appointments, including the Indiana Stormwater Taskforce (2019), the Indiana Wetlands Taskforce (2021), and currently the Indiana Invasive Species Council. Joe received his B.S. in biology and B.A. in chemistry from Wittenberg University and completed the Indiana Watershed Leadership Academy through Purdue University. Joe lives in Fishers with his wife Lauren, and their daughter and son. He is an avid reader, likes to run, and loves spending time paddling and fishing in his canoes. He is the President of his HOA and a volunteer with his kids’ school and extracurricular clubs. Josh Wagner Josh is a forester operating Wagner Forestry in southern Indiana. He works with private landowners and conservation organizations to help manage their forested land for long term health and biodiversity. Prior to starting Wagner Forestry, Josh had the opportunity to work with other private land management organizations, the National Park Service, and Trees For Tomorrow Natural Resource Education Center. Josh received a B.S. in Outdoor Recreation and Natural Resource Management from Indiana University in 1999. He lives in the North Fork Salt Creek watershed with his wife and three sons. Teri Willey Teri recently joined the team at the National Hemophilia Foundation to launch the new Pathway to Cures (P2C) venture philanthropy fund focused on investments in companies developing therapies for inheritable blood disorders.  Teri has been in the business of commercializing early-stage research results for over 35 years and most recently as the founding managing director of IU Ventures’ Indiana Philanthropic Venture Fund. Teri served as a senior executive for business development for Cold Spring Harbor Laboratory, Mount Sinai School of Medicine in NYC, was the founding chief executive of Cambridge Enterprise Ltd in Cambridge England and a co-founder of ARCH Development Partners an early-stage Midwest venture fund.  She was involved in state government in Indiana as a founding member of the Indiana 21 st Century Fund and is a Sagamore of the Wabash. Mike Chaveas Mike Chaveas is the Forest Supervisor of the Hoosier National Forest; responsible for the management and protection of 204,000 acres of multiple-use public land and resources, managed for the benefit of present and future generations of Americans and located in nine southern Indiana counties from the shores of Lake Monroe to the Ohio River.  Mike previously worked in Oregon as a District Ranger on the Mount Hood National Forest, as a Deputy District Ranger on the Coconino National Forest in northern Arizona and for the U.S. Forest Service’s International Programs office, coordinating technical assistance in countries throughout Africa.  Prior to joining the Forest Service, Mike served with the Peace Corps as a Wildlife Biologist in the Eastern High Atlas National Park in Morocco. Mike holds a Bachelor of Science in Wildlife Science from Virginia Tech and Master’s degrees in Public Affairs and Environmental Science from Indiana University.  He has been the Supervisor of the Hoosier National Forest since 2014. Randy Jones I am a graduate of Anderson University with a BA in Biological Sciences. I am a registered Environmental Health Specialist in Indiana. After graduating I was hired by the Henry County Health Dept. and served as Director of the Environmental Division of said department for approx. 9 years. I was hired by the Indiana Department of Environmental Management, and after 30 years of employment with IDEM I retired as a Senior Environmental Scientist in 2016. During my tenure with IDEM I worked with both the Office of Water Management (OWM) as well as the Office of Land Quality (OLQ). Working with the agricultural community and rule development for the same was a large part of my position responsibilities. I have experience in writing county ordinances with respect to residential onsite septic system regulations, and the enforcement of those ordinances. I presently serve on the Brown County Area Planning Commission as well as the Brown County Board of Zoning Appeals and have served on the Board of Supervisors for Soil and Water Conservation Districts. Bill Weeks W. William Weeks is a Clinical Professor of Law Emeritus at the Indiana University Maurer School of Law. He holds the Scolnik Clinical Chair in Conservation Law. He is the Chair of the Conservation Law Center, which he founded 16 years ago, and directed through 2018. The Center provides legal counsel to conservation organizations, works to improve conservation law and policy, and offers law students clinical experience in the practice of law and the profession’s public service tradition. Earlier in his career, Professor Weeks practiced law in Indianapolis and Washington, D.C. He was also State Director, Director of the Center for Compatible Economic Development, Chief Operating Officer, and Executive Vice President of The Nature Conservancy. He graduated magna cum laude from the Indiana University Maurer School of Law in 1979. Upon graduation, he was elected a member of the Order of the Coif. He is the author of Beyond the Ark (Island Press, 1996) as well as numerous publications relating to conservation of biodiversity, water quality, and conservation easement law. Bill also currently serves on the board of directors of Sycamore Land Trust. Follow Read Subscribe Participate Donation Get Involved Education 642 N Madison St, Bloomington, IN 47404 info@lakemonroewaterfund.org Lake Monroe Water Fund is a nonprofit, tax-exempt charitable organization (tax identification number 86-1645499) under Section 501(c)(3) of the U.S. Internal Revenue Code. Donations are tax-deductible as allowed by law.  We will not sell, share or trade our donors' names or personal information with any other entity, nor send mailings to our donors on behalf of other organizations. We may use a service provider to process donations. If we do, we will instruct the provider that our donors’ information may only be used as necessary for processing the donation.  Copyright © 2025 Lake Monroe Water Fund"
    },
    {
      "url": "https://hainescity.com/416/Programs",
      "text": "Programs | Haines City, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Living & Visiting Doing Business How Do I... Facebook Twitter Instagram Instagram Search Home Departments Parks & Recreation Department Aquatics Programs Programs Senior Citizen Swim  |  Ages 55+ Fee: Ages 55 - 64: $20 + tax  for the season Ages 65+: FREE! *All ages must register for the season, including ages 65+. Registration opens Tuesday, April 1, 2025 Program Dates ( Dates and pool operations are subject to change based on staff levels, water temperature below 74° F, and/or air temperature below 55° F at time of opening activity.) Monday, April 28, 2025 – Thursday, October 16, 2025 Spring Schedule : April 28 – May 21, 2025 Janet J. Smith Aquatic Facility | Mondays & Wednesdays 10:30 - 11:30 AM Summer & Fall Schedule : June 2 – October 16 Janet J. Smith Aquatic Facility | Mondays 10:30 - 11:30 AM Lake Eva Aquatic Center | Wednesdays & Thursdays 10:30 - 11:30 AM Junior Lifeguard Program This course is designed for ages 11-14 year olds that are interested in acquiring lifeguard skills, including: Aquatic emergency prevention Team response in water & on land Practice the skills of CPR, first aid, and using an AED Basic personal training Emergency action plans Participant must pass a swim test prior to registration. No classes schedule at this time. Uniform: JR. Lifeguard shirt, hip pack, whistle, and lanyard (included and will be provided) Swim suit (not included, must provide own) For more information, please contact Heidi McIntee, Aquatics Superintendent, at heidi.mcintee@hainescity.com . Haines City Tritons Swim Team The Lake Eva Aquatics Center is the home of the Haines City Tritons Swim Team. The Tritons are coached by Jim and Laurie Grazier, as well as a handful of assistant coaches that bring different levels and knowledge to the team. Their experienced coaching staff has the combined experience that accommodates swimmers of all skill levels and ages. They take pride in developing the competitive skills necessary for swimmers to reach their greatest potential by coaching every athlete towards the  achievement of their personal goals, and instilling a culture of character growth that will be beneficial in life beyond the sport of competitive swimming. For more information, please contact Coach Jim Grazier or visit the Haines City Tritons website. CONTACT US Aquatics Superintendent : Heidi McIntee Phone: (863) 421-3700 Email: heidi.mcintee@hainescity.com Was this page helpful for you? Yes No Weather Policy Group Outings Swim Lessons Training Programs Lake Eva Aquatics Center Janet J. Smith Aquatic Facility Pool Pass Information Pay Utility Bill START UTILITY SERVICES job openings Report An Issue Public Records Contact Us 620 East Main Street Haines City, Florida 33844 Phone: 863-421-3600 Helpful links Subscribe to City Manager’s Report Cemeteries Online Community Redevelopment Agency (CRA) Parks & Recreation /QuickLinks.aspx FAQs What are the hours of operation for the Lake Eva Community Center? What are the hours of operation for the Oakland Neighborhood Center? What is the address to the Lake Eva Event Center? /FAQ.aspx Using This Site Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Under Florida law, email addresses are public records. If you do not want your email address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://hainescity.com/173/Aquatics",
      "text": "Aquatics | Haines City, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Living & Visiting Doing Business How Do I... Facebook Twitter Instagram Instagram Search Home Departments Parks & Recreation Department Aquatics Aquatics Haines City Parks and Recreation operates two aquatic facilities: the Lake Eva Aquatic Center and the Janet J. Smith Aquatic Facility. Lake Eva Aquatic Center 321 S. 6th Street Haines City, FL 33844 863-421-3715 2025 Operating Schedule: Weekends Only: August 9 – November 16, 2025 *Open Labor Day Hours: 12:00PM - 6:00PM Amenities: Kid's Play Area: Young kids will love the wet/dry play area with a zero-depth entry lagoon pool, slide, splash pad, and water activities. Competition Pool: Fun for all ages, this pool offers six (6), 25-yard lanes for the experienced swimmer, and a 3.5ft - 5ft are for beginners. Pavilion: Cool off in the shade or celebrate a special occasion with family and friends. Concession Stand: Whet your appetite with burgers, hot dogs, snacks, and beverages. Janet J. Smith Aquatic Facility 1900 N. 10th Street Haines City, FL 33844 2025 Operating Schedule: Weekends Only: August 9 – TBD *Open Labor Day Hours: 12:00PM - 6:00PM Amenities: The Janet J. Smith  Aquatic Facility features a zero-depth entry into the splash-pad like end of a 3,328 sq. ft. pool that expands to a 5ft deep lap swim area with three (3) 25-yard lanes. CONTACT US Aquatics Superintendent : Heidi McIntee Phone: (863) 421-3700 Email: heidi.mcintee@hainescity.com Janet J. Smith Aquatic Facility Was this page helpful for you? Yes No Weather Policy Group Outings Swim Lessons Training Programs Lake Eva Aquatics Center Janet J. Smith Aquatic Facility Pool Pass Information Pay Utility Bill START UTILITY SERVICES job openings Report An Issue Public Records Contact Us 620 East Main Street Haines City, Florida 33844 Phone: 863-421-3600 Helpful links Subscribe to City Manager’s Report Cemeteries Online Community Redevelopment Agency (CRA) Parks & Recreation /QuickLinks.aspx FAQs What are the hours of operation for the Lake Eva Community Center? What are the hours of operation for the Oakland Neighborhood Center? What is the address to the Lake Eva Event Center? /FAQ.aspx Using This Site Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Facebook Twitter Pinterest Delicious Blogger LinkedIn Home My Account Printer Friendly Email Page Contact Us RSS Site Map Translate Page Notifications Documents Government Websites by CivicPlus® Under Florida law, email addresses are public records. If you do not want your email address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.aquadocinc.com/about-our-company/team/",
      "text": "Aqua Doc Team - Meet Our Pond Maintenance Company | Aqua Doc Skip to content (800) 689-5253 About Us Meet The Team Locations Carolinas Georgia Ohio Pennsylvania Virginia Our Community Awards & Accolades Photo Gallery Testimonials Services Lake & Pond Management Lake Monitoring Services LakeTech Monitoring Waterscapes & Ornamental Ponds Fountains Aeration Fish Services Cattails Stormwater Management Metal Craft Dock Systems Pond Construction Products Lake & Pond Products Algaecides Herbicides Colorant Dyes Surfactants Beneficial Bacteria and Muck Digesters Fish Care Lake and Pond Accessories Pond Rakes and Nets Goose Control RIBBIT WEAR Waterscapes Algaecides & Treatments Clarifiers & Cleaners Bacterias and Enzymes Fish & Plant Care Aerators & De-Icers Pumps Liner Decor Lighting Spitters & Bubblers Rock Covers Waterscapes Accessories Nets Filter Media Tubing Patch Kits Fountain Systems AquaMaster Fountains Airmax Fountains Kasco Fountains Aeration Systems AquaMaster Aerators Airmax Aerators Vertex Aerators Vertex Aerator Replacement Parts, Maintenance Kits and Accessories De-Icers and Circulators Algae & Plant I.D. Resources Videos Trade Shows & Events News & Press FAQs Retail Catalog Newsletter The Frog Blog Contact Us Ask the Expert Careers 0 items FREE CONSULTATION PAYMENT PORTAL LOGIN FREE CONSULTATION PAYMENT PORTAL LOGIN About Us Meet The Team Locations Carolinas Georgia Ohio Pennsylvania Virginia Our Community Awards & Accolades Photo Gallery Testimonials Services Lake & Pond Management Lake Monitoring Services LakeTech Monitoring Waterscapes & Ornamental Ponds Fountains Aeration Fish Services Cattails Stormwater Management Metal Craft Dock Systems Pond Construction Products Lake & Pond Products Algaecides Herbicides Colorant Dyes Surfactants Beneficial Bacteria and Muck Digesters Fish Care Lake and Pond Accessories Pond Rakes and Nets Goose Control RIBBIT WEAR Waterscapes Algaecides & Treatments Clarifiers & Cleaners Bacterias and Enzymes Fish & Plant Care Aerators & De-Icers Pumps Liner Decor Lighting Spitters & Bubblers Rock Covers Waterscapes Accessories Nets Filter Media Tubing Patch Kits Fountain Systems AquaMaster Fountains Airmax Fountains Kasco Fountains Aeration Systems AquaMaster Aerators Airmax Aerators Vertex Aerators Vertex Aerator Replacement Parts, Maintenance Kits and Accessories De-Icers and Circulators Algae & Plant I.D. Resources Videos Trade Shows & Events News & Press FAQs Retail Catalog Newsletter The Frog Blog Contact Us Ask the Expert Careers OUR TEAM A winning team, striving for excellence in environmental stewardship & sustainability. Solving problems. Providing solutions. OUR CORPORATE TEAM LEADERS Services Products Algae & Plant ID Contact US JOHN M. WILSON JR. President John holds a degree in Computer Science and a focus of study in Business & Marketing from Cleveland State University. His passion for lakes and ponds began in 1983, when he began working for the small family company that would one day become AQUA DOC. In 1989 John purchased the company from founder William P. Cloonan and has grown AQUA DOC into the industry leader it is today. To this day, John’s hands-on involvement with his company has not changed and he can still be found on the many lakes and ponds AQUA DOC manages and meeting with clients. John and the AQUA DOC Team have been recognized by the Lake-Geauga Fast Track 50 for eight consecutive years as one of Lake and Geauga County’s fastest growing companies and Case Western Reserve Weatherhead School of Management’s Weatherhead 100 as one of the fastest growing companies in the State of Ohio. John is an active member of NALMS; North American Lake Management Society, MAPMS; Midwest Aquatic Plant Management Society, CAI; Community Associations Institute, OLMS; Ohio Lake Management Society, APMS; Aquatic Plant Management Society, AERF; Aquatic Ecosystem Restoration Foundation, and RISE; Responsibility for Sound Environment. When John is not out on the waters, he is spending quality time with his wife of thirty-two years, Jeanine and their two children, Maddie and Johnny III. John’s hobbies include playing hockey and baseball, and can often be found attending sporting events from the local Kirtland High School football game to the World Series. JEANINE WILSON Owner - Executive Vice President of Sales, Marketing, and Information Technology Jeanine Wilson is a long-time owner of AQUA DOC with her husband John Wilson AKA \"Big Frog\". While working closely with John in the early years of AQUA DOC Jeanine pursued her own career in Technical Sales. She was with AT&T assisting medium and very large businesses for over 26 years. With over 37 years of technical sales experience, she is now leading AQUA DOC sales, marketing, and IT. She is so excited to take all her experience and work with the wonderful AQUA DOC Family!! In her spare time, she loves to spend time with family, travel, listen to music, and is a collector of fine art. TIM HOLMES Chief Operating Officer Tim joined the AQUA DOC team as its Chief Operating Officer in December 2024. He comes to AQUA DOC with 25+ years of experience leading organizations and helping businesses grow, primarily in corporate financial services. He has also served as a consultant, advisor, and board member to privately owned businesses and their owners, in numerous industries. A year after being introduced to John Wilson, Tim joined AQUA DOC and quickly came to appreciate the company’s unique position in the industry and vast opportunities that leverage their 40+ years of success with tremendous client satisfaction, long-term relationships, and a loyal team committed to delivering world-class aquatic science products and services. Tim is married with four grown children. He treasures his time with family and friends, including time with his adult children living throughout the US. He also explores new activities, the outdoors, and travels with his wife, Julie. John Wilson’s 30+ years of playing hockey have Tim contemplating a return to the sport after a hiatus since high school, but that story is not yet written. BRIAN DIRK Chief Financial Officer Brian joined the AQUA DOC team as its Chief Financial Officer in September 2022. Brian comes to AQUA DOC with over 27 years of experience in the accounting/finance field that includes non-profit higher education, both private and publicly held distribution companies, manufacturing, and public accounting. Brian is married with two children. In his free time, he enjoys spending time with family and friends. Brian has a passion for Cleveland sports teams and would like to pick up the game of softball and volleyball once again. HEATH SPENCE V.P. Corporate Operations Heath has been a valued member of the AQUA DOC team for more than twenty years. While obtaining his Biology degree at Bowling Green University, Heath had the opportunity to study at the Gulf Coast Research Lab in Ocean Springs, Mississippi where his passion for aquatics emerged. He shares his passion and vast knowledge with all AQUA DOC team members by developing and teaching AQUA DOC University. AQUA DOC U is a yearly, multi-leveled set of courses aimed at growing the skills and expertise of all AQUA DOC Aquatic Specialists and support staff. As General Manager, Heath oversees the AQUA DOC pond management programs from chemistries to customer service. Heath is a licensed scuba diver, a skill he utilizes in his profession and free-time diving in waters from Ohio to the Caribbean. CYNTHIA BOWES Director of Finance and Human Resources Cynthia joined the AQUA DOC team in 2006. With a focus on finance and human resources, Cynthia manages the financial administration team as well as employee payroll and benefit packages. Cynthia also has extensive knowledge of AQUA DOC’s retail products and enjoys helping customers choose the right size pump or chemistry to keep their watergardens and ponds clean and healthy. When away from work, Cynthia loves being with her family and her beloved dog Moxiee, and maintaining her own backyard watergarden. DENISE PATTON Corporate Client Relations Manager Denise joined AQUA DOC in early 2019. She earned her Bachelors of Business Management, with honors, from Indiana Wesleyan. With her bubbly, outgoing personality, she has developed her place here at AQUA DOC Lake & Pond Management. Building and maintaining relationships comes natural to Denise. Before joining the AQUA DOC family, Denise served as Vice President of Lyman Health Care Solutions LLC. Partnering with the President, she assisted customers with marketing strategies, advertising, branding evaluation and website review. Prior to her career at Lyman, Denise was the Marketing Director for Capio Partners, and collaborated with the Chief Healthcare Strategy Officer to create and manage integrated challenges.  Denise got her start at the Cleveland Clinic Foundation, where she gained her knowledge in overall operations, clinical operations, health information management and revenue cycle management. Outside of her business life, Denise enjoys spending time with her family, friends and her beloved cockapoo, Winston. MERISSA BAUMGARTNER Purchaser and Inventory Controller; Corporate Manager of Fountain and Aeration Technology Merissa joined the AQUA DOC team in 2018, bringing with her an abundance of financial expertise acquired through years of managing a commercial recycling company and earning a bachelor’s degree in business. She started her career at AQUA DOC as a member of the finance team responsible for purchasing. In her current role, Merissa oversees all purchasing, handles month-end inventory, and manages all fountain and aeration divisions company-wide. When she’s not working, Merissa enjoys spending quality time with her family, little nephew Brian, and friends.  She also enjoys listening to music and cruising to new destinations. MEGAN SABA Advertising and Marketing Manager Megan joined AQUA DOC in early 2020 and has taken charge of the company's print and marketing materials, as well as managing our social media presence. With nearly 20 years of experience, Megan is an accomplished professional with a wealth of knowledge in graphic design, marketing, print media, and brand awareness. Her dedication to both her work and family makes her a valuable asset to the AQUA DOC team. Outside of her professional life, Megan cherishes spending time with her son, Jace. They enjoy attending seasonal festivals together and exploring amusement parks, creating cherished memories outside of the office. RACHAEL REA Retail Specialist Rachael joined AQUA DOC Lake & Pond Management in 2017. Rachael brought with her a unique vibe and creative customer service experience. Her true passion for building relationships has given her an edge above and beyond just the sale. This passion has been clear as Rachael has grown our Retail Department further than she could've imagined. Rachael began her career at AQUA DOC in communications and customer service and overall client relationship building. Through hard work and determination, Rachael has proven herself to be a true leader. In her free time, Rachael enjoys spending quality time with her family and her pets, Scooter, Panini, Grey Goose, Cygnet, Tink, Mochi, Stella, and Crunch. AMY WANCHISN Customer Service Call Center Manager Amy joined AQUA DOC in 2024 as the Customer Service Call Center Manager. Previously, Amy had a career for over 20 years in public health serving as the Administrative Services Supervisor in the Office of Epidemiology, Surveillance, and Informatics truly embracing what it means to provide a pleasant experience for every customer. In her free time Amy enjoys spending time with her nieces and nephews and supporting various non-profit organizations. RON NEWMAN Corporate Manager of Sales and Business Development Ron joined AQUA DOC in the Spring of 2020 following an extensive career in hospitality sales and sales management, specializing in customer care, and sales training. With his vast knowledge in sales management and networking skills, Ron will forward the mission of promoting the expansion of existing markets and the development of new markets as well. Ron is married with two children and dog, Willo. He enjoys any and all outdoor adventures and challenges. JENNIFER GRUNDY Corporate Manager of Sales and Business Development New to the AQUA DOC in 2024, Jennifer Grundy joins the team as Corporate Manager of Sales and Business Development. Jennifer brings deep experience in marketing and business development, cultivated through leadership positions across multiple vertical industries. Most recently, Jennifer worked for 18 years in the construction industry as Director of Marketing and Sales for a mining and manufacturing company. Jennifer will collaborate with regional branches to uncover opportunities to achieve consistent growth while identifying market insights that keep AQUA DOC’s customers informed about best practices in aquatic and stormwater management. She has learned that working hard and building relationships are key to success, but having a team and products you believe in is also essential. As a Thiel College graduate, Jennifer holds a bachelor’s degree in Fine Art and Business Administration. She also attended the Art Institute of Pittsburgh. When meeting Jennifer, you instantly realize she is very positive and determined. “There is always a way, either find a way or make a way” is advice that has stuck with her, reminding her that she can solve the most challenging problems with ingenuity, creativity, and a little faith. In Jennifer’s spare time, you’ll likely find her working on a restoration project for her century home, gardening, practicing yoga, hiking, and spending time with family, friends, and her rescue dogs. DAVE GRABOWSKI Director of Cleveland Operations Originally from Buffalo, NY, Dave joined the AQUA DOC team in 2016. His passion for customer service and desire to succeed has been a perfect addition to the growth of the AQUA DOC team. Dave’s “lead by example” approach has led to his position as Director of Cleveland Operations. Dave is happily married to his wife Rachel and has four children, Tyler, Nolee, Nate, and Ramona. He enjoys coaching, camping, live music, sporting events, and traveling with his family and friends. SARAH CLARK Water Garden Division Sales Manager Sarah joined the AQUA DOC team in 2017 after working at the Greater Cleveland Aquarium. She obtained her Bachelor’s in Biology from Westminster College and a Master’s in Geographic Information Systems (GIS) from Cleveland State.  Sarah’s passion for the environment has given her the edge to succeed as Watergarden Division Sales Manager. Her knowledge not only has added to the growth of her team, but has given her the advantage to develop the entire division. While Sarah is not at work, she occasionally freelances as a photographer and makeup artist, and she enjoys traveling concerts, and her babies Frank, Pickles, and Daisy. CARTER BAILEY Aquatic Biologist Originally from Upstate New York, Carter grew up knowing he wanted to work with freshwater in a way that could help people. This desire led him to study environmental sciences, earning his BS in Environmental Science with a concentration in Watershed Hydrology from State University of New York College of Environmental Science and Forestry, and a MS in Lake Management from the State University of New York College at Oneonta. After receiving his masters, Carter joined AQUA DOC in 2013 and moved to Ohio. Carter believes that in the freshwater environment, lake managers bridge the gap between stakeholders and the scientific community. His position at AQUA DOC allows him to bridge that gap and fulfill his desire to help people by working with citizens, citizen groups, and government agencies to maximize their freshwater resources. In his free time, Carter enjoys hiking, mountain biking, fishing, skiing, and snowmobiling. EDWARD KWIETNIEWSKI Certified Lake Manager / Limnologist Ed Kwietniewski has been a member of the AQUA DOC community for 7 years. Working within the company’s Large Lakes division, Ed focuses on developing comprehensive management plans that can be utilized to form the building blocks to accomplish lake health goals. He specializes in water quality assessments, lake strategic planning, and stakeholder relationship development. Ed has a Master of Science in Lake Management through SUNY Oneonta in NY as well as his Certified Lake Managers certificate through the North American Lake Management Society. He believes that well-managed lakes utilize a data-driven assessment approach that matches them to best management practices that support the lake’s overall sustainable well-being. DESHAWN JOHNSON Aquatic Biologist / Stormwater Specialist DeShawn joined the AQUA DOC team in 2019. Deshawn has a BS in Zoology from Kent State University and is a PhD candidate with Kent State University. He focuses on a variety of environmental services including water and sediment depth surveys to determine the need for dredging, inspections of stormwater management facilities to ensure compliance with stormwater regulations, and post-construction maintenance of stormwater control measures. DeShawn has been married to his wife Natalie since 2017 and has two children – Natasha and Desmond. In his free time, he enjoys board games, card games, anime, weightlifting, and bowling. BROCK KOPPELMAN Columbus Branch Manager Brock joined AQUA DOC in 2018, bringing with him a plethora of knowledge and expertise in the world of aquatics. Brock carries a Bachelors in Biology and Chemistry and an endorsement in Education. With his understanding of the science within, Brock feels it is important to educate both current and potential clients regarding their individual lake or pond. His passion for the outdoors brings Brock and his family on many adventures, hiking, fishing, camping and hunting from a tree stand. “Get out and explore the great outdoors and visit your local fresh water ponds. For on the way to discovering truth in nature, one discovers life.” MATHEW KAPAS Columbus/Central Ohio Waterscapes Mathew joined the AQUA DOC team in 2021, bringing a wealth of experience within the water garden industry from 18+ years of experience, specifically in the areas of design and construction. Mathew’s prior experience in the industry has led him to build a wide variety of water features throughout Ohio and beyond. This experience and desire to be the best push Mathew to build with the newest technology and style, as well as adding in his own unique flare. Mathew also holds his Bachelor’s degree in Early Childhood Education from Walsh University that allowed him to pursue a career as a literacy specialist in the elementary setting, as well as high school coach for almost a decade. Ultimately, he loves the outdoors and creating one-of-a-kind pieces of art for people to enjoy within the comfort of their own homes, which has driven him to dive head-first into the career path of custom water features. Outside of work, Mathew is a family man who enjoys spending time with his wife Joy, two daughters - Lakelyn and Lowen, and dog – Colbie. Mathew loves to golf, fish, root on the Cleveland Browns/ Ohio State Buckeyes, and work in his yard. JARED MOORE Cincinnati Branch Manager Jared joined the AQUA DOC team in 2012 after graduating from the University of Cincinnati with a Civil and Environmental Engineering degree. Jared’s love of the water led him to his career with AQUA DOC and becoming a licensed applicator. As production manager, Jared not only manages his customer’s ponds, but oversees routing and scheduling for the Cincinnati division. When not spending time with his wife and three children, Jared enjoys fishing, kayaking and is an active member of The Hobie Kayak Fishing Team. ZACHARY REINHART Toledo Branch Manager Zak joined AQUA DOC in 2014. Along with maintaining his customers’ ponds he also does scheduling and personally conducts consultations throughout Northwest Ohio on algal and plant management strategies. He has a degree in Fish Management and Aquaculture Sciences from Hocking College. Zak has prior field experience studying and testing waters in Canada and the Ohio River. He has also worked with the Ohio Department of Natural Resources. Zak has been an avid outdoorsman since he was very young. His hobbies include fishing, kayaking, camping, and hiking. CHRIS BREWER Raleigh Branch Manager A North Carolina native, Chris joined AQUA DOC in the Fall of 2022. With over 15 years of expertise in pond management, water gardens, and fountain systems, Chris brings a wealth of knowledge in fisheries management, aquatic vegetation, water quality management, erosion and sediment control. He is committed to providing exceptional customer service and ensuring the highest standards in aquatic environments. Chris enjoys spending time with his wife and son, hunting, fishing and relaxing on the back porch. ALEX CECIL Charlotte Branch Manager Alex Cecil brings a strong academic background and a passion for environmental science. He earned his Associate of Science in Biology from Central Piedmont Community College before continuing his education at the University of North Carolina Wilmington, where he received degrees in Marine Biology and Environmental Science. With a deep appreciation for nature, Alex loves to spend his free time exploring new places and hiking in the great outdoors. He’s also an avid fan of the Avengers, making him a true enthusiast of both nature and superhero adventures. TREVOR TELMAN Georgia Branch Manager Trevor joined the AQUA DOC team in 2023, retiring from the US Navy after 24 years of service. Trevor carries a Bachelor of Science in Healthcare and a Master’s degree in Emergency and Disaster Management. His passion for being on the water brought him to AQUA DOC and he believes educating the public about their lakes or ponds is essential to our environment. In his spare time, Trevor enjoys spending quality time with his family, fishing, boating, and hiking. DEREK JOHNSON Virginia Branch Manager Derek holds a Master of Science in Lake Management. He received his graduate degree from SUNY Oneonta in New York and focused his research and thesis on writing a comprehensive lake management plan for a lake association in New York. Derek holds the designation of Certified Lake Manager through the North American Lake Management Society, an organization that brings scientists and professionals together to foster the management and protection of lakes and reservoirs, and has over a decade of experience in lake, pond, and fisheries management. It was at Paul Smith’s College in New York, where Derek earned his undergraduate degree, a Bachelor of Science in Fish and Wildlife Management with a concentration in fisheries management and realized his true passion for freshwater aquatic ecosystems. HENDERSON BEAM Charleston, SC Regional Manager Growing up in a military family, Henderson likes to joke that he’s from everywhere and nowhere when asked where he’s from. In 2019, Henderson graduated NC State with a B.S. in Science, Technology and Society with a Minor in Wildlife Sciences and Concentration in Environmental Ethics. With a background in residential pond, stormwater, and fisheries management, he joined AQUA DOC in 2025, looking to get back into life in the outdoors. Henderson couldn’t be more thankful for his wife and the life they have built here SC. His past-time typically consists of taking care of the homestead, fishing, hunting or camping. CONTACT OUR TEAM TODAY Sign Up For Our Newsletter Name * Email * Street Address * City, State, Zip * Locations Cleveland | 10779 Mayfield Rd. Chardon, OH 44024 Columbus | 255 Enterprise Dr. Lewis Center , OH 43035 Cincinnati | 3101 Exon Ave. Cincinnati, OH 45241 Toledo | 25581 Fort Meigs Rd. Suite B Perrysburg, OH 43551 Pennsylvania | 245 N. Perry Highway, Mercer, PA 16137 Georgia | PO Box 104 Ball Ground, GA 30107 8302 Ball Ground Hwy Ball Ground GA 30107 Carolinas | 10127 Division Dr., Raleigh, NC, 27603 Carolinas | 2011 Corporate Dr., Unit 2 Wilmington, NC 28405 Carolinas | 1945 Scott Futrell Dr., Charlotte, NC 28208 Carolinas | Charleston, SC Virginia | 2134 Berkmar Dr., Charlottesville, VA 22901 Call Today! 800-689-5253 info@aquadocinc.com Privacy Policy Terms of Service Shipping & Returns Policy My Local Page Privacy Policy © 2024 AQUA DOC®. All Rights Reserved. Powered by Top Rated Local®"
    }
  ]
}