{
  "fuentes": [
    {
      "url": "https://www.sapelohammockgolfclub.com/",
      "email": "share@cornerstonegp.com"
    },
    {
      "url": "https://www.gabesanders.com/neighborhood/hammock-creek",
      "email": "nicole@pineapplegroupfl.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.hammockbeach.com/",
      "email": "sales@hammockbeach.com"
    }
  ],
  "mails": [
    "info@belfairsgolfclub.co.uk",
    "nicole@pineapplegroupfl.com",
    "sales@hammockbeach.com",
    "share@cornerstonegp.com"
  ],
  "nombre_sitio": "hammockcreekgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sapelohammockgolfclub.com/",
      "text": "Home - Sapelo Hammock Golf Club Skip to main content Skip to footer Sapelo Hammock Golf Club Home Course Book a Tee Time Member Tee Times Course Info Lessons + Clinics Gift Certificates Events Events Calendar Tournaments Tournament Request Form Facilities Clubhouse Pro Shop Cafe + Menu Stay + Play Eagles Nest News + Photos Newsletters In The Media Photo Galleries Memberships Membership Info Membership Applications Contact Us Contact Us Join Our E-Club How Did We Do? Welcome To Sapelo Hammock Golf Club BOOK NOW ABOUT US GIFT CERTIFICATES At Sapelo Hammock Sapelo Hammock Golf Club provides an excellent golf experience featuring the scenic coastal landscape. Live oak trees hung with Spanish moss shade the fairways, and expansive marsh views that change with the tides provide the backdrop to a challenging yet accessible 18-hole course. Sapelo Hammock Golf Club is more than a golf club. It is rich in history, committed to community leadership outreach, and a center for charitable and social activities throughout the county. Conveniently located off Interstate-95, Sapelo Hammock Golf Club is just 50 minutes down the coast from Savannah and 50 minutes north of Saint Simons Island. Book Tee Time Tee times are now available up to 14 days in advance. Book Now Memberships Take your love of the game to the next level. Join Today Contact Us Send us a call or shoot us an email. We can't wait to hear from you! Get in Touch Host Your Next Event With Us! Tournament Request E-Club Register for our e-club to receive special offers, discounts, and more! Subscribe Reviews Write a review today! Footer Weather TOWNSEND WEATHER Visit Us Sapelo Hammock Golf Club 1354 Marshview Drive NE Shellman Bluff, GA 31331 Follow Us Follow us on Facebook Twitter Instagram Contact Us Phone: (912) 832-4653 Email: share@cornerstonegp.com Copyright © 2025 Sapelo Hammock Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.gabesanders.com/neighborhood/hammock-creek",
      "text": "Hammock Creek Real Estate | Palm City, Florida Homes For Sale Skip to main content Home Search Basic Search Advanced Search Map Search Address Search Listing ID Search Spotlight Properties Buyers Ocean Access Waterfront Homes Treasure Coast Condos with Boating Access New Construction Info First Time Buyers Tips Buyer FAQ's Mortgage Calculator Free Buying Guide Moving Tips Sellers Seller Resources Getting Ready to Sell Neighborhood Sold Report Free Selling Guide Free Home Evaluation Market Data Florida Real Estate Data Martin County Real Estate Data St. Lucie County Real Estate Data Local Market Reports Areas Martin County St. Lucie County Communities Stuart Jensen Beach Palm City Sewalls Point Hutchinson Island Hobe Sound Port St. Lucie Fort Pierce Jupiter Blog About Meet Pineapple Group Testimonials Contact Open main menu Home Search Basic Search Advanced Search Map Search Address Search Listing ID Search Spotlight Properties Buyers Ocean Access Waterfront Homes Treasure Coast Condos with Boating Access New Construction Info First Time Buyers Tips Buyer FAQ's Mortgage Calculator Free Buying Guide Moving Tips Sellers Seller Resources Getting Ready to Sell Neighborhood Sold Report Free Selling Guide Free Home Evaluation Market Data Florida Real Estate Data Martin County Real Estate Data St. Lucie County Real Estate Data Local Market Reports Areas Martin County St. Lucie County Communities Stuart Jensen Beach Palm City Sewalls Point Hutchinson Island Hobe Sound Port St. Lucie Fort Pierce Jupiter Blog About Meet Pineapple Group Testimonials Contact Close main menu Hammock Creek Palm City VIEW Hammock Creek Homes For Sale Recently Sold Listings Discover The Value Of Your Property Sign Up For New Listing Email Alerts List Your Property with Local Real Estate Experts Questions?...Contact Me Hammock Creek Homes in Palm City Florida Hammock Creek in Palm City is actually three separate gated communities anchored by the Hammock Creek Golf Club.  Information about playing this course or memberships can be found on their website here: https://www.hammockcreekgolfclub.com/ The three communities that make up Hammock Creek are the Preserve, the Sanctuary, and the Estates.  Homes were built beginning in 1997 and completed in 2004.  The home builder was Lennar Homes and homes range in size from single story 3 bedroom, 2 and ½ bathroom homes with two-car garages and a living area of 2,061 sq. feet all the way up to 2-story homes with 6 bedrooms, 4 bathrooms and 3-car garages with greater than 4,000 sq. ft. of living area.  There are homes that have private pools as well as a number of homes with either golf course views and/or lake views. This community is very well situated with easy access to I-95 or Florida’s Turnpike as well as just a short drive to historic downtown Stuart, Martin County’s beaches, and the many waterways, boat ramps, and marinas. All ages and pets are welcome.  There are restrictions about leaving trucks and motorcycles in the driveways overnight.  Children in Hammock Creek are zoned to attend the Palm City Elementary School, the Hidden Oaks Middles School, and Martin County High School. Each of these three communities has separate home owner’s associations and as of May 2024, the HOA fees were $98.00 per month in the Preserve, $101.00 per month in the Sanctuary, and $168.00 a month in the Estates of Hammock Creek.  The Estates of Hammock Creek is the only one with a community pool. Search Here for Hammock Creek Real Estate . Click here to view recent Hammock Creek market reports Get in Touch * Name * Phone * Email * Questions/Comments By giving us your phone number and email address, you are giving Pineapple Group - Stuart FL Real Estate permission to contact you via email, phone, or text. Home Search Buyers Sellers Market Data Areas Communities Blog About 2391 SE Ocean Blvd Stuart, FL 34996 (772) 763-8506 | nicole@pineapplegroupfl.com Copyright © 2025 |\n            Information deemed reliable, but not guaranteed. Privacy Policy | Accessibility Real Estate Web Design by Dakno Marketing . Opens in a new window."
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.hammockbeach.com/",
      "text": "Hammock Beach Golf Resort & Spa™ | Oceanfront Florida Resort in Palm Coast FL The Resort Membership Gift Cards & Amenities Search Gallery Contact Book Now Stay Stay Ocean Tower Main Tower Villas Lodge Yacht Harbor Village Cinnamon Beach Homes Ocean Tower Main Tower Lodge Villas Vacation Rentals Offers Play Play Spa & Wellness Racquets Pools & Beach Activities Holidays Food & Wine Classic Shop Spa & Wellness Pools & Beach Activities Savor Savor Atlantic Grille Delfinos Italian Chophouse Loggerheads Sports Pub Stix Authentic Sushi Ocean Bar Café Lobby Bar Pizza & Gelato Beach Brew Hammock House Breakfast Lunch Dinner Golf Golf Ocean Course Conservatory Course Golf Groups Meet the Pros Offers Ocean Course by Jack Nicklaus Conservatory Course by Tom Watson Meet Meet Meetings Golf Groups Team Building Meet the Team Start Planning Meetings & Events Golf Groups & Tournaments Celebrate Celebrate Venues Start Planning Wedding Venues Start Planning Book Now 877-586-0180 Menu Previous Next Item 2 Florida’s Premier Oceanfront Destination Golf Resort A truly unique experience, Hammock Beach Golf Resort & Spa is situated on a stunning stretch of unspoiled beach along Florida's Atlantic Coast in Palm Coast. Discover the ease of coastal living - perfect for family vacations, weekends with friends or elevated corporate retreats. Your beachfront escape begins here. One Oceanfront Resort Five Distinct Stays Sophisticated coastal décor and classic style is the hallmark of Hammock Beach Golf Resort & Spa. Choose from a one-bedroom suite or two, three and four-bedroom condominiums, each featuring a master bedroom and private bathroom with dual vanities, a walk-in shower with a large garden tub, and an open-air covered balcony with ocean and golf course views. Ocean Towers Learn More Main Tower Learn More Villas Learn More Lodge Learn More Vacation Rentals Learn More Jack Nicklaus & Tom Watson Signature Courses World-Class Golf Nestled along the shoreline and overlooking the Atlantic Ocean, our Jack Nicklaus-designed Ocean Course is a breathtaking experience to behold. Our award-winning course winds along pristine wetlands and sparkling lakes offering golf aficionados a truly unforgettable day on the links. The breathtaking Conservatory Course, designed by Tom Watson, is highlighted by waterfalls, babbling brooks, and field stone work. Learn More 8 Distinct Dining Options A Culinary Journey Hammock Beach Golf Resort & Spa offers eight distinct dining options—from artisan coffee at Beach Brew to poolside bites at Ocean Bar & Café, elevated American fare at Loggerheads Sports Pub, fresh seafood at Atlantic Grille, and Italian classics at Delfinos Italian Chophouse. Don’t miss the housemade gelato at Hammock Beach Pizza & Gelato. Learn More Indulge in Tranquility Spa & Wellness Escape your worries and enter a world of tranquility and relaxation at our full-service on-site spa. Experience the feeling of serenity and luxury with expert massages and signature treatments featuring thalassotherapy products rich with minerals from the sea. Learn More Oceanfront Weddings Florida Beach Weddings Say “I do” with the ocean as your backdrop and the rolling greens of our golf course at your side—or opt for a romantic beachfront ceremony with your toes in the sand on Hammock Beach’s pristine shoreline. Our resort offers an array of stunning ceremony settings and welcomes weddings of all sizes. We are proud to accommodate a variety of cultural and specialty traditions for groups of up to 250 guests. Learn More Oceanfront Weddings Florida Beach Weddings Say “I do” with the ocean as your backdrop and the rolling greens of our golf course at your side—or opt for a romantic beachfront ceremony with your toes in the sand on Hammock Beach’s pristine shoreline. Our resort offers an array of stunning ceremony settings and welcomes weddings of all sizes. We are proud to accommodate a variety of cultural and specialty traditions for groups of up to 250 guests. Learn More Productive Gatherings Meetings, Events & Retreats Host your next meeting or corporate retreat in a setting that inspires. Combined with oceanfront elegance with state-of-the-art facilities to create the ideal backdrop for productive gatherings and unforgettable events. With over 50,000 square feet of indoor and outdoor event space, we accommodate everything from executive board meetings to large-scale conferences, Golf tournaments, team-building retreats, and milestone celebrations. Learn More Follow us on Instagram @HammockBeach Close Discover Summer's Secret Side Your Private Paradise Still Awaits at Hammock Beach. Book by September 30th, enjoy up to 30% off our regular rates, plus a $100 food and beverage credit for stays through March 13th. Unlock the Secret Book Now Contact Us Home Stay Stay Ocean Tower Main Tower Villas Lodge Yacht Harbor Village Cinnamon Beach Homes Ocean Tower Main Tower Lodge Villas Vacation Rentals Offers Play Play Spa & Wellness Racquets Pools & Beach Activities Holidays Food & Wine Classic Shop Spa & Wellness Pools & Beach Activities Savor Savor Atlantic Grille Delfinos Italian Chophouse Loggerheads Sports Pub Stix Authentic Sushi Ocean Bar Café Lobby Bar Pizza & Gelato Beach Brew Hammock House Breakfast Lunch Dinner Golf Golf Ocean Course Conservatory Course Golf Groups Meet the Pros Offers Ocean Course by Jack Nicklaus Conservatory Course by Tom Watson Meet Meet Meetings Golf Groups Team Building Meet the Team Start Planning Meetings & Events Golf Groups & Tournaments Celebrate Celebrate Venues Start Planning Wedding Venues Start Planning Search The Resort Membership Gift Cards & Amenities 200 Ocean Crest Dr, Palm Coast, FL 32137 Call Us: 877-586-0180 sales@hammockbeach.com 200 Ocean Crest Dr, Palm Coast, FL 32137 866-841-0287 instagram facebook youtube Hammock Beach Golf Resort & Spa, all rights reserved 2025. Contact Us FAQs Photos Lost & Found Careers Owners Portal Privacy Policy Accessibility Press & Awards JOIN OUR MAILING LIST First Name Last Name Zip Code Email Address Yes, I would like to receive emails with offers. Yes, I would like to receive emails with offers. Submit Hammock Beach Golf Resort & Spa, all rights reserved 2025."
    }
  ]
}