{
  "fuentes": [
    {
      "url": "https://www.golfstonycreek.com/contactus/",
      "email": "bdober@olparks.com"
    },
    {
      "url": "https://www.golfstonycreek.com/contactus/",
      "email": "cdunne@olparks.com"
    },
    {
      "url": "https://www.golfstonycreek.com/contactus/",
      "email": "greensmanager@olparks.com"
    },
    {
      "url": "https://www.sugarcreekgolfcourse.com/contact-us/",
      "email": "managernchrisco@sugarcreekgolfcourse.com"
    },
    {
      "url": "https://www.sugarcreekgolfcourse.com/contact-us/",
      "email": "info@sugarcreekgolfcourse.com"
    },
    {
      "url": "https://www.sugarcreekgolfcourse.com/contact-us/",
      "email": "nchrisco@sugarcreekgolfcourse.com"
    },
    {
      "url": "https://www.rushcreek.com/",
      "email": "info@rushcreek.com"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2022-06-16/mystic-creek-golf-club-welcomes-new-director-of-golf",
      "email": "rmyers@troon.com"
    },
    {
      "url": "https://siouxfalls.business/buyer-announced-for-spring-creek-golf-course/",
      "email": "jodi@siouxfalls.business"
    },
    {
      "url": "http://thecreekgolfclub.com/about/",
      "email": "chipridley@thecreekgolfclub.com"
    },
    {
      "url": "http://thecreekgolfclub.com/about/",
      "email": "kelliestevens@yahoo.com"
    },
    {
      "url": "http://thecreekgolfclub.com/about/",
      "email": "mikebyce@thecreekgolfclub.com"
    },
    {
      "url": "http://thecreekgolfclub.com/about/",
      "email": "taylorhough@thecreekgolfclub.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "brian.legg@galleagolfproperties.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "chris.gallea@galleagolfproperties.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "leslie.gallea@galleagolfproperties.com"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "email": "vincent.cringoli@galleagolfproperties.com"
    },
    {
      "url": "https://buffalocreekgc.com/",
      "email": "maston@kempersports.com"
    },
    {
      "url": "https://buffalocreekgc.com/",
      "email": "maston@kempersports.com"
    },
    {
      "url": "https://www.golfcedarcreek.com/contactus/",
      "email": "golfpro@twp.berkeley.nj.us"
    },
    {
      "url": "https://lanecreekgolfclub.com/",
      "email": "jlord@lanecreekgolfclub.com"
    },
    {
      "url": "https://www.wolfcreekgc.com/contact/",
      "email": "info@wolfcreekgc.com"
    },
    {
      "url": "https://breakingeighty.com/creek-club-reynolds",
      "email": "fancybox_loading@2x.gif"
    },
    {
      "url": "https://breakingeighty.com/creek-club-reynolds",
      "email": "sean@breakingeighty.com"
    }
  ],
  "mails": [
    "bdober@olparks.com",
    "brian.legg@galleagolfproperties.com",
    "cdunne@olparks.com",
    "chipridley@thecreekgolfclub.com",
    "chris.gallea@galleagolfproperties.com",
    "fancybox_loading@2x.gif",
    "golfpro@twp.berkeley.nj.us",
    "greensmanager@olparks.com",
    "info@rushcreek.com",
    "info@sugarcreekgolfcourse.com",
    "info@wolfcreekgc.com",
    "jlord@lanecreekgolfclub.com",
    "jodi@siouxfalls.business",
    "kelliestevens@yahoo.com",
    "leslie.gallea@galleagolfproperties.com",
    "managernchrisco@sugarcreekgolfcourse.com",
    "maston@kempersports.com",
    "mikebyce@thecreekgolfclub.com",
    "nchrisco@sugarcreekgolfcourse.com",
    "rmyers@troon.com",
    "sean@breakingeighty.com",
    "taylorhough@thecreekgolfclub.com",
    "vincent.cringoli@galleagolfproperties.com"
  ],
  "nombre_sitio": "hammockdunesclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golfstonycreek.com/contactus/",
      "text": "Contact Us - Stony Creek Golf Course Skip to primary navigation Skip to main content Skip to footer Stony Creek Golf Course Oak Lawn, IL Tee Times Golf Course Tour Rates Mini Golf Lessons Scorecard Leagues Leagues Junior League Adult Leagues Driving Range Driving Range Driving Range Passes Simulators Bar & Grill Events Calendar Outings Banquets Online Store Gift Certificates Chili Open Contact Contact Us Rules & Regulations E-Club Sign Up Contact Us Now Hiring-Available Positions Listed Below Click on the listed position to view job description Pro Shop Staff Bar & Grill Staff Kitchen Staff Weekend Custodian CLICK HERE for the OLPD Job Application General Manager – Brian Dober PGA Associate Phone: (708) 857-2433 ext 2308 Email: bdober@olparks.com Assistant Manager – Chris Dunne PGA Associate Phone: (708) 857-2433 ext 2307 Email: cdunne@olparks.com Superintendent – Tim Scott Follow us on Facebook Directions Footer Contact Us 5850 W. 103rd Street, Oak Lawn, IL 60453 1 (708) 857-2433 Quick Links Home Tee Times Gift Certificates Join our Email Club Contact Us Follow Us Facebook Instagram Stony Creek Golf Course | 5850 W. 103rd Street | Oak Lawn, IL 60453 | (708) 857-2433 Copyright © 2025 Stony Creek Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.sugarcreekgolfcourse.com/contact-us/",
      "text": "Contact Us - Sugar Creek Golf Course Skip to primary navigation Skip to main content Sugar Creek Golf Course High Ridge, MO Home Course Course Details Driving Range Tee Times Memberships Events Tournaments Banquets & Special Events Leagues Shop Gift Cards Checkout Contact Employment Contact Us Sugar Creek Golf Course & Banquet Center 5224 Country Club Drive High Ridge, Missouri 63049 Phone: (636) 677- 4070 Email: info@sugarcreekgolfcourse.com Our Staff Nick Chrisco General Manager nchrisco@sugarcreekgolfcourse.com Sorkis Webbe Jr Owner Operator Gary Tschannen Golf Instructor Katie Leigh Santangelo Director of Marketing (314) 217 – 6813 sugarcreekevents.katie@gmail.com Sorry - your browser does not support iframes. Page Footer Follow Us Facebook Instagram Contact Us: 5224 Country Club Drive, High Ridge, Missouri 63049 (636) 677-4070 info@sugarcreekgolfcourse.com Sugar Creek Golf Course | 5224 Country Club Drive, High Ridge, Missouri 63049 | (636) 677-4070 Copyright © 2025 Sugar Creek Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.rushcreek.com/",
      "text": "Rush Creek Golf Club - Maple Grove, MN Golf Course Information Hole-by-Hole Flyovers Course Rates Cardholder Programs Mac Nine Course Availability Tee Times Lessons Golf Lessons Adult Programs Junior Programs Restaurant Events Events Overview Golf Events Weddings Parties & Banquets Meetings Funerals & Memorials Event Menu & Room Layouts Events Calendar Store Galleries Decor Ideas Golf Course MacMillan Ballroom Skye Room Weddings Highlander Pub The Mac Nine Wedding Pictures Wedding Ceremonies Contact Contact Us Staff Employment Opportunities EClub Sign Up Book A Tee Time 763-494-0400 Rush Creek Golf Club Welcome to an unparalleled golf, dining, and event experience. Minnesota's Premier Golf Facility Welcome to Minnesota's premiere golf facility, just 20 minutes from downtown Minneapolis! Rush Creek was founded in 1996 by W. Duncan MacMillan. He had a spectacular vision to turn an old golf course and farm into a first class golf facility. An avid sportsman, he wanted to make sure golf was a sport that everyone could participate in, so he created a private club feel for a public golf course. Working with renowned architects, John Fought and Bob Cupp, the course and original clubhouse were built and his dream became a reality. Soon after golfers started playing, it became quite evident that a clubhouse expansion was needed. In 2000, our MacMillan Ballroom and Banquet Center were opened. South-west exposure gives breath-taking views of the golf course and wetlands. You will experience the \"Wow!\" factor. We are proud to continue our founder's vision and work hard to provide a high level of service. We look forward to making your visit one of a kind. 008 0053 0214 IMG 2363 EricVestPhotography KarlyChrisWedding 5 Course Hole 18 Building Image 2 View Upcoming Events Check out what’s coming up at the club. View Event Calendar Take a Virtual Tour Take a walk through Rush Creek Golf Club! View Now Weddings & Events Make your special day the perfect memory. More Information \"An incredible job each and every time we have our tournament at Rush Creek. I've been attending and/or chairing golf tournaments for a number of years and you are, by far, the BEST club I've worked with. Would recommend you to anyone looking for a first class event!\" Lynne Sneed, Terry Anderson Memorial \"We are so glad we chose Rush Creek for our reception site - it took the wedding to a whole new level!\" Jessie & Jesse, Bride & Groom \"I have been working on my game with Aaron Jacobson over the last four years. He is a fabulous teacher. My handicap is now a 6 and I just shot 76 - my lowest round ever. These days when I hit a really good shot I say out loud, 'Thanks Coach'.\" Ed Chanin \"What was most impressive was your staff. They were nothing short of excellent.\" Tom Mahlke Cardholder Programs Become a cardholder today and call Rush Creek your home course. More Info Location 7801 County Road 101 Maple Grove, MN 55311 Get Directions Call Us 763.494.0400 Email Us info@rushcreek.com Follow SIGN UP TO RECEIVE OUR E-NEWS First Name (*) Invalid Input Last Name (*) Invalid Input Email (*) Invalid Input Submit Receive email updates on course information, restaurant, junior golf and more. Free to sign up. Unsubscribe anytime. © 2022 Rush Creek Golf Club | Contact Us | Site Map Powered by foreUP Close Home Golf Course Information Hole-by-Hole Flyovers Course Rates Cardholder Programs Mac Nine Course Availability Tee Times Lessons Golf Lessons Adult Programs Junior Programs Restaurant Events Events Overview Golf Events Weddings Parties & Banquets Meetings Funerals & Memorials Event Menu & Room Layouts Events Calendar Store Galleries Decor Ideas Golf Course MacMillan Ballroom Skye Room Weddings Highlander Pub The Mac Nine Wedding Pictures Wedding Ceremonies Contact Contact Us Staff Employment Opportunities EClub Sign Up × Current Hours for The Highlander Pub Open daily at 10:30am"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2022-06-16/mystic-creek-golf-club-welcomes-new-director-of-golf",
      "text": "Mystic Creek GC welcomes new director of golf Skip to main content News GOLF INDUSTRY TFC / PR NEWSWIRE Industry AGM Business Links Living NGCOA VORTEX RAIN CHECK CAREERS Calendar Features COLUMNS DESIGN NOTES TFC INBOX LIFESTYLE EPSON TOUR THE FRIARS GOLF CLUB POLLS Podcasts Content Clubhouse Cookie Jar Golf Driver$ Golf Innerview ModGolf Videos Content Clubhouse Coach Mo Golf Show Up River Film Co. Events Archives Show Search Search Query Submit Search Industry News Mystic Creek Golf Club welcomes new director of golf Jun 16, 2022 LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print El Dorado, Ark. (June 16, 2022) – Mystic Creek Golf Club in El Dorado, Arkansas recently welcomed Sandy Davison as the club’s new director of golf. In his new position, Davison will oversee all golf operations for the 18-hole facility, which Golfweek recently named the Best Course You Can Play in Arkansas, and rated the course No. 38 on its “Top 100 Courses You Can Play in the U.S.” ranking. Davison is a second-generation teacher, player, and Certified PGA Golf Professional who grew up in the golf industry. He has over 25 years of experience as a PGA golf professional, serving at some of the most prestigious clubs in the country including Baltusrol Golf Club in New Jersey; Desert Mountain Golf Club, Superstition Mountain Golf & Country Club and Paradise Valley Country Club in Arizona; The Club at Carlton Woods in Texas; and TPC Sawgrass in Florida. An accomplished player, Davison has played in the United States Amateur and British Amateur Championships, and finished as Medalist in the prestigious North & South Amateur in Pinehurst, North Carolina. While attending the University of North Florida, he was a First Team All-American and a member of the 1993 NAIA National Championship golf team. He was later inducted into the University of North Florida Athletic Hall of Fame. Davison graduated first in his class in the PGA Golf Professional Training Program and later became one of the first 28 PGA golf professionals in the United States to complete all six levels of the PGA Certified Professional Program. The Certified Professional Program includes a Harvard Mentor Plus curriculum and is equivalent to an advanced college degree. “We are very pleased to add Sandy Davison to our management team as our Director of Golf at Mystic Creek,” said Mystic Creek Golf Club General Manager Cody Lack. “Sandy’s outstanding professional experience and passion for service will be instrumental in providing our members and guests a world-class golf experience at our club.” A native of Ponte Vedra Beach, Florida, Davison grew up in a golf family, his father was the chief operating officer and his mother was the director of merchandising for the PGA TOUR’s TPC Network. Mystic Creek Golf Club is an 18-hole, Kenneth Dye, Jr-designed course managed by Troon. Open since May 2013, Mystic Creek Golf Club features cathedral pines similar to Augusta, high-flashing bunkers similar to those designed by A.W Tillinghast and domed greens with runoffs similar to Pinehurst No. 2. Just after opening in 2013, the semi-private course was named one of the “Best New Courses” by Golf Digest. With impeccable course conditions and outstanding service, Mystic Creek Golf Club continues to be recognized as the regions premier course.  The course annually hosts The Murphy USA El Dorado Shootout, an Epson Tour event, and has also hosted a number of other high profile events, including the Men’s Sunbelt Collegiate Championship and the Women’s Southland Conference Championship in 2021. For information on Mystic Creek Golf Club, visit www.golfmysticcreek.com or call (870) 312-0723. About Troon Headquartered in Scottsdale, Ariz., Troon is the world’s largest golf and golf-related hospitality management company providing services at 680-plus locations around the globe, including managing 665-plus 18-hole equivalent golf courses. In addition to golf, Troon specializes in homeowner association management, private residence clubs, estate management and associated hospitality venues. Troon’s award-winning food and beverage division operates and manages 670-plus food and beverage operations located at golf resorts, private clubs, daily fee golf courses and recreational facilities. With properties located in 45-plus states and 30-plus countries, Troon’s family of brands includes Troon Golf, Troon Privé, Troon International, Indigo Sports, CADDIE MASTER, Peter Burwash International, True Club Solutions, Cliff Drysdale Tennis, RealFood Hospitality, Strategy and Design, Casa Verde Golf, and ICON Management Services. For additional news and information, visit www.Troon.com . Media Contact: Rob Myers Troon 480.477.0506 rmyers@troon.com Tags Industry News Troon LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print 960 Morrison Drive, Suite 300, Charleston, South Carolina 29403 Copyright © 2025, The First Call, a division of Buffalo Groupe , LLC. All rights reserved. Who We Are About Us Media Kit Press Release Program Archives Support Subscribe Privacy Policy Terms of Use"
    },
    {
      "url": "https://siouxfalls.business/buyer-announced-for-spring-creek-golf-course/",
      "text": "New owner shares plans for Spring Creek Golf Course - SiouxFalls.Business Retail Real Estate Food & Drink In-Depth Videos More Latest News Submit News Retail Development Food & Drink Real Estate Health Care Corner Office The Incubator Jodi’s Journal Thought Leader Up-And-Comer People In-Depth 605 Made Learning Giving Back Photos General Jobs Executive Homes Events After Hours Partners About Us/Contact Site Spotlight Loft Life Retail Real Estate Food & Drink In-Depth Videos More Latest News Submit News Retail Development Food & Drink Real Estate Health Care Corner Office The Incubator Jodi’s Journal Thought Leader Up-And-Comer People In-Depth 605 Made Learning Giving Back Photos General Jobs Executive Homes Events After Hours Partners About Us/Contact Site Spotlight Loft Life Search for: Search for: Home Trending Latest News After Hours Development Real Estate New owner shares plans for Spring Creek Golf Course Jodi Schwan 3 months ago 406 shares Share Tweet LinkedIn June 4, 2025 — and updates June 5 A local group of investors has purchased Spring Creek Golf Course with a plan to improve it while continuing to operate it as a public course. The 126-acre, 18-hole course southeast of Sioux Falls was built in 1994 and sits along the Big Sioux River adjacent to Good Earth State Park at Blood Run. It was purchased by Fore Score LLC, led by Dann Grevlos, who serves as managing partner. Grevlos and his wife, Cindi, along with their children, Brett, Aimee Kokenge and Conor, had talked about buying a golf course earlier this year before learning Spring Creek was for sale. “They’ve all been avid golfers,” he said. “It was a great idea, but there was nothing we could do about it.” The family is entrepreneurial as well. Grevlos’ parents and then his brother Dave owned the Shop ‘N Cart stores. Grevlos owned the Neon Casino and other casinos for years. He also had an aqua massage store at the Mall of America and now works in gaming and procurement for partners internationally. He initially reached out to Bri Kacmarynski at NAI Sioux Falls after learning of the Spring Creek listing to get some numbers, not thinking it would come together to buy it, he said. “Then, I got home and talked to our kids and my brother Mike, who is a performance coach for golf and wrote a book on golf, and his son, Will (who is a pro golfer), and said, ‘Why not us?'” Grevlos said. “We had 60 days to close, so we had to raise enough money to purchase it and put together a team.” He ultimately amassed 20 local investors, with the criteria being that had they to be people “who really love golf,” he said. “So it was really nice to meet with them and most said yes, and we have a really good group of investors who want to be part of a golf course and love to golf.” The South Dakota Parks & Wildlife Foundation acquired Spring Creek as a contract for deed by the original owners and developers, Spring Creek Country Club, in 2015 and then leased it back to the group with an agreement that it would maintain and run the course. At the time, the thought was that the course eventually could become part of Good Earth State Park. The foundation’s board of directors “made the strategic decision to sell the golf course, ensuring that the property continues to serve the community while enabling the Foundation to focus on its core mission,” it said. Proceeds from the sale will be reinvested to support future enhancements at Good Earth State Park and the surrounding area. “Our foundation is thrilled to announce the sale of Spring Creek Golf Course to Fore Score LLC,” said Patrick Wyss, board chair. “Our intention has always been to preserve Spring Creek as an outdoor recreation asset for the community. While we are not equipped to operate a public golf course, we are confident that this sale keeps Spring Creek a vibrant recreational destination. The proceeds from this sale will be reinvested into the park system, especially Good Earth State Park, to benefit future generations.” Along with the proceeds from the $2.5 million sale, the Parks & Wildlife Foundation is planning to launch a statewide fundraising campaign to support 28 unique improvement projects across 19 state parks. Projects include new visitor centers, indoor fish-cleaning stations, amphitheaters, trail bridges and more. “Our foundation exists to enhance outdoor recreation for future generations,” executive director Kristina Coby said. “We will continue to support South Dakota’s parks and wildlife, just as we have for nearly 40 years.” The deal was brokered by NAI Sioux Falls, including Kacmarynski and brokers Gregg Brown and Dennis Breske. It was financed partially by Plains Commerce Bank. “We’re excited that we procured a buyer group of resourceful and entrepreneurial professionals committed to keeping the golf course public and accessible to all Sioux Falls residents,” Breske said. The course will continue operating under its current management while the Grevlos team works through an operational transition sometime this summer. “Everyone wants this a public course. We had no intention of doing anything but a public course,” Grevlos said. “There are a lot of family engagements. Sioux Falls Christian and Harrisburg students golf out there, and we like that. We’ve all golfed there many times, and I love the course.” The current groundskeeper “does an excellent job” and will stay on along with the team, he added. Going forward, there are several improvements planned, beginning with replacing a bridge at hole No. 12 that washed out years ago. That will allow the hole to go back to a par 4 from a par 3. The plan also is to upgrade the golf carts and add two golf simulators to start as part of a broader effort to bring in winter revenue and look for additional amenities for the neighborhood. “We want to be good with the neighborhood,” Grevlos said. “We’re looking at something we can do for the neighborhood that would be a winter activity.” There also will be beverage carts added and additional food options that are being determined. By the end of next golf season, the team might be ready to raze the current clubhouse and build a new one that also would function as an event venue. Some of the investors have a background in the event business, he said. “An event center at a golf course can generate some really nice net income,” Grevlos said. “We brought in people that have the same vision. We’re going to throw revenue into upgrades. We’re not a distribution business for now. We want to get this thing state-of-the-art and make it as good of a golf course as it can be.” The course currently does about 26,000 rounds annually, he said. “We think we can get that up to where some of the city courses are, to add 10,000 or 12,000 rounds a year, which will be really good for the city and the investors,” he said. For Grevlos, who lives less than 15 minutes from the course, the whole deal has been a bit of a dream come true, he said. “The ironic part is I was golfing a few times a week with our kids, and I haven’t golfed in weeks,” he said because of all the work to put the deal together. “We all got together last night and celebrated until 1 a.m. because we couldn’t believe it happened.” Tags: Fore Score NAI Sioux Falls South Dakota Parks & Wildlife Foundation Spring Creek Golf Course Want to stay in the know? Get our free business news delivered to your inbox. Leave this field empty if you're human: Previous L&S executive tapped to lead South Dakota Chamber Next Sioux Falls housing market shows drop in closed sales for May Related Posts Arnolds Park Amusement Park reopens after two-week closure 5 years ago Galleria filling up as businesses start opening 6 years ago Twin Cities university to start classes in Sioux Falls 8 years ago Sign Up Business news delivered to your inbox. Leave this field empty if you're human: Videos Art trail, popular restaurant, flower farm offer 3 reasons for visit to Garretson 2 months ago Your Future STEM camp connects middle school students with area employers 2 months ago CEO Series: Michael Jensen 2 months ago New owner shares plans for Spring Creek Golf Course By Jodi Schwan A local group of investors has purchased Spring Creek Golf Course. News Tip Have a business news item to share with us? PARTNERS Sioux Falls Area Community Foundation Vance Thompson Vision Sioux Metro Growth Alliance Augustana University Eide Bailey Experience Sioux Falls POET, LLC Minerva’s Morrie’s Steakhouse Central Bank Dakota State University MarshMcLennan Agency Interstate Office Products Dawley Farm Village USD Beacom School of Business SDN Communications Sanford Health Journey Group TSP Click Rain Grille 26 Prairie Family Business Great Life South Dakota Biotech First National Bank Woods, Fuller, Schultz & Smith, P.C. Avera Sioux Falls Development Foundation © SiouxFalls.Business Scroll to top"
    },
    {
      "url": "http://thecreekgolfclub.com/about/",
      "text": "The Creek Golf Club | Spartanburg's Home Course | About Us BOOK A TEE TIME HOME ABOUT MEMBERSHIP TOURNAMENTS THE CLUB LADIES KIDS BOOK A TEE TIME HOME ABOUT MEMBERSHIP TOURNAMENTS THE CLUB LADIES KIDS About Our mission here at The Creek Golf Club is to provide you and your family with the best recreational value in the upstate. If you have any questions, please feel free to contact us.  Thank you for visiting us here online. About Our mission here at The Creek Golf Club is to provide you and your family with the best recreational value in the upstate. If you have any questions, please feel free to contact us.  Thank you for visiting us here online. Our Team Taylor Hough General Manager taylorhough@thecreekgolfclub.com Office: 864-583-7084 Cell: 864-809-8180 Taylor's Bio Taylor Hough, born and raised in Spartanburg, SC has been in the business of golf for 25 years. As a graduate of USC Upstate, Taylor was a four-year letterman and a 1993 South Carolina State Amateur Champion. Taylor was involved with management at Lan-yair Country Club for over 10 years and purchased The Creek in 1998. Taylor loves that The Creek is truly “Spartanburg’s Home Course” because so many of the folks in the area come for golf and community. Taylor has been married for 25 years and has two beautiful girls one who plays collegiate Volleyball and the other who plays collegiate golf and practices here at The Creek. It’s truly a family affair. Mike Byce Director of Golf mikebyce@thecreekgolfclub.com Office: 864-583-7084 Cell: 864-809-5187 Mike's Bio Elected to membership in the PGA of America in 1999 4 Year Letterman on Clemson University Men’s Golf Team Awarded PGA Junior Golf Leader in 2007 Credentialed leader in the Junior Golf community since 1999 Chip Ridley PGA, Head Golf Pro chipridley@thecreekgolfclub.com Office: 864-583-7084 Cell: 864-494-2740 Chip's Bio Director of GSP Under Armour Tour Elected to membership in the PGA of America in 2011 Graduate of Clemson University PGA Golf Management Program Director of the Spartanburg Chapter of the SC Junior Golf Association Credentialed leader in the junior golf community since 2011 Kellie Stevens Office Manager kelliestevens@yahoo.com Office: 864-583-7084 Weldon Davis Superintendent wd9716@gmail.com Office: 864-583-7084 Cell: 864-809-8178 Our History (The Country Club of The South) Our story begins in 1940. The US Army is preparing for WWII and had to train a lot of young men to be soldiers. Spartanburg native US Senator James F. Byrnes was instrumental in getting the Army to purchase a tract of land just 5 miles south of downtown Spartanburg to construct a US Army training facility. The facility represented a $10,000,000 investment ($172,000,000 in current money) The facility named Camp Croft after Major General Edward Croft trained over 200,000 soldiers from 1940-1946 and provided a much-needed stimulus for Spartanburg, still reeling from the depression. The state of the art facility was so nice that the new Army recruits dubbed it The Country Club of the South . Interestingly, the facility also housed over 900 German POW’s during the war. The Spartanburg Little Theater that sits just behind the 18 th Tee was used for entertainment during training an remains as the only structure that has survived. After the war, much of the property was given to the state to form Camp Croft State Park and ultimately the property that the club sits on was developed into a golf course in 1964 designed by noted golf course architect Russell Breeden. Artifacts can still be found around the course today. Contact Us (864) 583-7084 Notice: JavaScript is required for this content. CONTACT: Team Members (864) 583-7084 The Creek Golf Club 640 Keltner Ave, Spartanburg, SC 29302 WEBSITE BY: Neue South Co. Arrowhead Design Co. Copyright © The Creek Golf Club, Spartanburg, SC. All Rights Reserved 2018 Come Visit!"
    },
    {
      "url": "https://www.millcreekgolf.com/contactus/",
      "text": "Contact Information - Mill Creek Golf Club Skip to primary navigation Skip to main content Mill Creek Golf Club Welcome to Mill Creek Golf Club! Home Tee Times Tee Times Member Tee Times Memberships About About Us Rates Course Tour Golf Shop Instruction Course Photos Mill Creek Golf Club Welcome to Mill Creek Golf Club! Online Store Shop Cart Checkout Events Outings & Tournaments Wedding Packages Weddings Gallery Banquets & Events Events Calendar The Tavern Contact Contact Us Join our E-Club Join the Team Employment Apply Now Contact Information Mill Creek Golf Club 128 Cedars Avenue Rochester, NY 14428 Tel : (585) 889-4110 Name Position Chris Gallea General Manager Vinny Cringoli Head Golf Professional Brian Legg Head Superintendent Chris Gallea Sales & Events Map & Directions Award Winning Golf We work hard to offer the best course, conditions & value in Rochester. Thanks for your support! Click Here for the Video as we receive the Award! What People Are Saying: Mill Creek is one of my favorite courses in Rochester to play. It's very well kept and the level of professionalism always remains. If anyone is looking for a good course for business competitive, or leisure play - they should definitely give Mill Creek a shot! Kevin R - Webster, NY Weddings & Banquets Click Here Golf Outings & Events Click Here Tavern Restaurant Click Here Page Footer Contact Us Address : 128 Cedars Ave Churchville, NY 14428 Email: chris.gallea@galleagolfproperties.com Phone : (585) 889-4110 Follow Us Facebook Instagram Twitter Mill Creek Golf Club | 128 Cedars Ave | Churchville, NY 14428 | (585) 889-4110 Copyright © 2025 Mill Creek Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://buffalocreekgc.com/",
      "text": "Buffalo Creek Golf Club - Dallas Golf Clubs at Buffalo Creek Golf Club (972) 771-4003 Facebook Instagram Facebook Instagram Contact E-Club Directions Bettys Grill Menu Media Employment Golf Course Rates Annual Passes Score card Hole By Hole Golf Instruction Instruction Golf Clinics and Camps FAQs Events Upcoming Events Host an Event Golf Tournament Leagues Spark League VIRTUAL TEE TIME ASSISTANT Online Store Select Page Buffalo Creek returns to the original vision of the Perry Family The Perry Family had assumed full oversight of the course and has selected KemperSports to take over with the reopening of the course, daily operations and events. As part of the relationship, KemperSports improves guest service, overall customer satisfaction and enhance golf course conditions. Buffalo Creek Golf Club a must play course in the Dallas Area. Buffalo Creek Golf Club: Where Dallas Meets Majestic Greens Discover Buffalo Creek Golf Club, a hidden gem just 30 minutes east of downtown Dallas . Nestled along the eastern shore of Lake Ray Hubbard , our meticulously designed par-71 course offers an unforgettable golfing experience. Key Features : Rolling Hills and Majestic Trees : Immerse yourself in the natural beauty of our course, where rolling hills and majestic trees frame each fairway. Champion Dwarf Bermuda Greens : Experience pristine greens that challenge and delight golfers of all levels. Practice Facilities : Sharpen your skills with our diverse practice amenities, perfect for refining your driving and short game. Event Pavilion : Whether it’s a corporate outing, baby shower, or holiday party, our pavilion provides an exciting space for your next celebration. Buffalo Creek Golf Club invites you to tee off in style, enjoy our course for your next Fundraiser or Corporate event. Visit us today and elevate your golfing journey! “Why five stars? If you have been paying attention to the transformation of this golf course, it would be easy to understand. From late June to late August and into September their staff has worked tirelessly to improve the greens. With outstanding results. All while maintaining and improving a world class public golf course!” - Buffalo Creek Guest Subscribe to our e-club and follow us on social media for the latest news on Buffalo Creek Golf Club! Subscribe To Our E-Club Today! Success! First Name Last Name Email Subscribe Visit Our Facebook | Follow us On Instagram | Connect with us on LinkedIN Contact Visit Us Buffalo Creek Golf Club 624 Country Club Drive Rockwall, TX 75032 972-771-4003 Hours of Operation CLUBHOUSE Monday to Sunday 6:00 AM–8:00 PM DRIVING RANGE Monday 6:30 AM – 5 PM Tuesday 12:00 PM – DUSK Wednesday – Sunday 6:30 AM – DUSK Contact Us General Manager Mark Aston Maston@Kempersports.com Book a Tournament or Event General Manager Mark Aston Maston@kempersports.com 972-771-4003 Privacy Policy © Copyright Buffalo Creek Golf Club – Website by Lightspeed We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies. However, you may visit \"Cookie Settings\" to provide a controlled consent. Cookie Settings Accept All Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT ×"
    },
    {
      "url": "https://www.golfcedarcreek.com/contactus/",
      "text": "Contact Us - Cedar Creek Golf Course Skip to primary navigation Skip to main content Phone TEE TIMES BIRDIES BAR & GRILL Cedar Creek Golf Course Home Tee Times Rates About About Us Scorecard Annual Passes Driving Range Course Photos Golf Clinics Events Outings Upcoming Events Contact Contact Us Location Veterans Park Bill Zimmermann, Jr. Way Contacts Harry Leonard General Manager Phone: (732) 269-4460 Email: HLeonard140@gmail.com Page Footer Contact Info Address : Cedar Creek Golf Course 489 Forest Hills Parkway Bayville NJ, 08721 Email : golfpro@twp.berkeley.nj.us Phone : (732) 269-4460 Cedar Creek Golf Course | Cedar Creek Golf Course 489 Forest Hills Parkway Bayville NJ, 08721  | (732) 269-4460 Copyright © 2025 Cedar Creek Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://lanecreekgolfclub.com/",
      "text": "Home | Lane Creek Golf Club | Athens, Georgia HOME GOLF COURSE Course Layout Course Rates OUTINGS & EVENTS ABOUT US Course News Photo Gallery CONTACT US Contact Us Job Openings Facebook Instagram TEE TIMES HOME GOLF COURSE Course Layout Course Rates OUTINGS & EVENTS ABOUT US Course News Photo Gallery CONTACT US Contact Us Job Openings Facebook Instagram TEE TIMES Lane Creek At A Glance Originally opened in 1992, Lane Creek Golf Club is an 18-hole public golf course located just outside of beautiful Athens, Georgia. Designed by Mike Young, Lane Creek Golf Club remains a local favorite in the area. All 18 greens, along with the practice putting green, feature Champion Bermuda grass. The practice facility includes 12,000 square feet of tee area, contoured target greens and 7,000 square foot putting green. The clubhouse offers a fully stocked golf shop and the Pin High Patio. Our staff of golf professionals is always willing to assist with your golfing needs. Come see why Lane Creek is the best public golf course in the Athens area! Book Your Tee Time Contact Lane Creek About Lane Creek Golf Club Recently purchased in 2024, the course is owned by Steven Schorr, a prominent real estate developer who has recently turned his attention to owning premier golf courses across the United States.  With over 25 years in real estate and investment, Mr. Schorr has accumulated a diverse portfolio that spans commercial and residential properties across the country.  His focus on golf and leisure properties has resulted in Lane Creek showcasing a growing portfolio of golf facilities focused on quality, service, fun, and a passion for the game. Mr. Schorr has chosen Pinnacle Golf Properties of Charlotte, North Carolina to manage Lane Creek Golf Club. Pinnacle has earned a reputation for quality management services with a focus on excellent customer service and golfer experience.  Pinnacle brings state-of-the-art technology to their operations and yet still manages to retain great personal interaction with the guests that play their courses. About Us Under new ownership in 2024, Lane Creek Golf Club showcases a portfolio of golf facilities focused on quality, service, fun, and a passion for the game. Course News Golf Course Lane Creek Golf Club is an exciting 18-hole golf course with Champion Bermuda greens that remains one of the Best Public Courses in the Athens area. Course Layout Golf Outings Lane Creek Golf Club will provide the ultimate in customer service for your golf outing with its professional assistance in every phase of your event. Outing Request Pin High Patio Grab a bite before or after your round, relax and enjoy the view from inside or on the back patio. Come for golf, stay for the food on the Pin High Patio! Learn More NEWS & HAPPENINGS More News Front entrance to clubhouse completed! November 26, 2024 – – Front entrance has been completed and is ready to be walked on! Keep an eye out for some more projects coming in hot. Thank you again for your patience! See the renovations at Lane Creek! November 24, 2024 – – Phase 1 of bunker renovations are nearing completion, and we are excited to show off some of the final products. Bunker renovations have begun at Lane Creek! September 14, 2024 – – We ask all guest to please skip the hole our bunker contractors are currently working on to ensure their safety while working and to keep their work efficient. We have more exciting news at Lane Creek! September 7, 2024 – – Stop by the clubhouse to get some new Lane Creek merchandise. We also have UGA towels, head covers, and more to show off your team spirit on the course. 1201 Club Drive Bishop, GA 30621 Find Us Google Maps Phone (706) 769-6699 (762) 400-1101 Hours of Operation Monday to Sunday 7:00am – 7:00pm Important Links Book Your Tee Time Contact Lane Creek Course News Course Rates Job Openings Outings & Events Photo Gallery Jacob Lord, GM Follow us on Facebook Follow us on Instagram Local Weather Forecast -º - - - - - - - - - - - - - - Watkinsville weather Lane Creek Golf Club is managed by Charlotte based Pinnacle Golf Properties. Known for quality service and premier course conditions, Pinnacle is proud to be associated with such a wonderful facility and surrounding community. Copyright © 2025. Lane Creek Golf Club. Website managed by Total Golf Resources. Home Privacy Policy HOME GOLF COURSE Course Layout Course Rates OUTINGS & EVENTS ABOUT US Course News Photo Gallery CONTACT US Contact Us Job Openings Facebook Instagram TEE TIMES"
    },
    {
      "url": "https://www.wolfcreekgc.com/contact/",
      "text": "Contact Wolf Creek Golf Club | 800 491 3093 404-344-1334 ATLANTA WEATHER X Home (current) Golf Course Course Information Scorecard Course Layout Driving Range Facilities Gallery Tournaments Book Now Contact Wolf Creek Contact Contact Please use the form below to contact us. We will get back to you as soon as possible! First Name Last Name Please enter a valid name. Phone Number Please enter a valid name. Email Please enter a valid name. Subject Please enter a valid name. Message Please enter a valid name. I agree to receive email news, updates, and promotions from Wolf Creek Golf Club. Submit Wolf Creek Golf Course Show Map Hide Map 3000 Union Rd SW Atlanta, GA 30331, United States 123movies embedded maps google For Inquiry contact: info@wolfcreekgc.com 404-344-1334 CONTACT Hours Monday 7AM - 7PM Tuesday 7AM - 7PM Wednesday 7AM - 7PM Thursday 7AM - 7PM Friday 7AM - 7PM Saturday 7AM - 7PM Sunday 7AM - 7PM Address 3000 Union Rd SW Atlanta, GA 30331 info@wolfcreekgc.com 404-344-1334 Home (current) Course Information Scorecard Course Layout Driving Range Facilities Gallery Tournaments Book Now Contact © , Wolf Creek Golf Club, all rights reserved."
    },
    {
      "url": "https://breakingeighty.com/creek-club-reynolds",
      "text": "The Creek Club at Reynolds Lake Oconee: A Visual Masterpiece Close Menu Facebook Instagram Instagram YouTube X (Twitter) Subscribe Home About Product Reviews Golf Shoes Golf Bags Golf Clubs Golf GPS Golf Launch Monitors Golf Rangefinders Golf Recovery Buying Guides Best Golf Shoes Best Launch Monitors Best Simulator Studios Best Golf Rangefinders Best Golf Bags Best Golf Cart Speakers Best Putting Mats Best Golf Clubs Best Golf Drivers Best Fairway Woods Best Golf Irons Best Golf Hybrids Best Golf Wedges Travel Golf Resorts Private Golf Clubs Best in State Hotel Reviews Breaking Eighty Top 100 All Golf Course Reviews View All I Went Back to Brasada Ranch After 12 Years — Here’s What Surprised Me May 29, 2025 Why Vietnam Might Be the Most Underrated Golf Destination in the World May 1, 2025 Dutchman’s Pipe Club Lives up to (High) Expectations February 3, 2025 The Richland Course at Reynolds Lake Oconee is a Wonderful Marriage of Old and New October 29, 2024 Why Ballyneal is One of the Best Destination Golf Clubs in the World July 16, 2025 Hoiana Shores: Insane Links Golf in…Vietnam?! July 8, 2025 Dutchman’s Pipe Club Lives up to (High) Expectations February 3, 2025 The Richland Course at Reynolds Lake Oconee is a Wonderful Marriage of Old and New October 29, 2024 Why Ballyneal is One of the Best Destination Golf Clubs in the World July 16, 2025 Best Golf Courses in Oregon: Everything You Need to Know September 3, 2024 Best Golf Courses In New York: It’s (Private) Golf Mecca February 27, 2024 Best Golf Courses In California: The Best Golf State in America? January 4, 2024 The Park Hyatt London River Thames: A Stunner Near Battersea July 22, 2025 Peninsula NYC Review: One of New York’s Grandest Hotels January 9, 2025 Indulgent Paradise: Why Nemacolin Resort is a Must-Visit August 12, 2024 I Wasn’t Prepared for Just How Special Sensei Porcupine Creek Would Be. June 6, 2024 The 4 Best Golf Travel Bags in 2025 (and One You Should Definitely Avoid) September 8, 2025 10 Best Golf Rangefinders in 2025 (I’ve Tested Every One) September 8, 2025 8.9 Does the Mileseey GenePro G1 Do TOO Much? Well… August 27, 2025 9.3 The Infinity Tour Next% 2 are My Favorite Nike Golf Shoes in Years August 27, 2025 The 4 Best Golf Travel Bags in 2025 (and One You Should Definitely Avoid) September 8, 2025 10 Best Golf Rangefinders in 2025 (I’ve Tested Every One) September 8, 2025 8.9 Does the Mileseey GenePro G1 Do TOO Much? Well… August 27, 2025 9.3 The Infinity Tour Next% 2 are My Favorite Nike Golf Shoes in Years August 27, 2025 Why Ballyneal is One of the Best Destination Golf Clubs in the World July 16, 2025 Hoiana Shores: Insane Links Golf in…Vietnam?! July 8, 2025 I Went Back to Brasada Ranch After 12 Years — Here’s What Surprised Me May 29, 2025 Why Vietnam Might Be the Most Underrated Golf Destination in the World May 1, 2025 Eighty Club Contact Home » Golf Course Reviews » Private Golf Clubs » The Creek Club at Reynolds Lake Oconee: A Visual Masterpiece Private Golf Clubs The Creek Club at Reynolds Lake Oconee: A Visual Masterpiece By Sean Ogle Updated: March 20, 2024 1 Comment Pretttttty. Share Facebook Twitter LinkedIn Pinterest Email When I visited Reynolds Lake Oconee I was excited to experience all that it had to offer. And for as much as I was looking forward to experiencing the renowned Great Waters course , it was a lesser-known course I was secretly even more excited about. What is it? The Creek Club. The Creek Club is a 2007 Jim Engh design that is the most under-the-radar course at Reynolds Lake Oconee. The 14th tee shot at The Creek Club. Why is it under the radar? Because, unlike its five sister courses , The Creek Club is the only course in the Reynolds Lake Oconee community that’s fully private. Because of that, it doesn’t get quite the attention that the courses with resort play do. But when you tee it up there? You’ll experience a visual treat rarely seen anywhere else. Interested in learning more? Let’s check out the course. First Impressions of The Creek Club I just said the Creek is a visual treat rarely seen anywhere else – but there is an exception. That exception just so happens to be one of my favorite golf courses on the planet: The Golf Club at Black Rock in Coeur d’Alene, Idaho. Jim Engh has built his reputation as the go-to course architect for developments on mountainous, or hard to build on property. You see this at Black Rock where he literally carved par 3s into the side of rocky ridges, and built par 5s down cavernous canyons. The result is one of the most fun collections of golf holes I’ve ever played. And throughout the round it kind of feels like you’re playing “Black Rock East.” As you might expect based on Jim’s other projects, the Creek Club has the most severe elevation changes of all the courses at Reynolds – by a long shot. The massive downhill tee shot on Hole 9 From the moment I pulled up to the course, I could tell this place was going to be exactly what I’d hoped it would be: fun. The course is stunning. The criss-cross mow patterns across its zoysia turf only adds to the views. Whether you’re looking over the wild 18th hole from the clubhouse perched above it, or standing on the 1st tee – you just feel like you’re in for an exciting 4 hours of golf. And the good news? You are. The Front 9 at The Creek Club The opening hole gives you a little bit of everything that you’ll find on the course. It’s a par 5 featuring a tee shot from an elevated tee to a wide fairway below. First hole at The Creek Club Reynolds Lake Oconee. A solid drive will give you a risk/reward opportunity if you want to go for it in two. If you elect to layup, you’ll have a wedge shot to a tricky green perched up on a hill with a bit of an amphitheater bowl surrounding it – one of Engh’s signature design elements. It’s not a tough shot, but land short? You’re 40 yards back down the hill. Unfortunately, my approach was a couple feet short. Down the hill I go. But the round started with a bang when I chipped it up and in for a birdie. Although due to the severity of the slope, I didn’t even get to see it drop. Miss your approach even a little short on the 1st hole? This is where you end up. There’s a huge variety of holes at The Creek Club, short holes, long holes, split fairways, uphill, downhill – you name it, it’s here. I call this adventure golf, and I love it. The second hole has rumpled fairways, which is a recurring theme here. You’re not likely to find a flat lie many places on the course. The 2nd hole. A good drive leaves you a wedge into the green, but slice it right and you’ll have a blind approach to a green that feels like it’s as deep as a football field – because it nearly is. The only thing I’ve seen like it in golf is the wonderful 4th at Spyglass Hill. Besides the wild look of the Creek Club, its most defining feature is its wild greens. Crazy mounds, curves, funnels – Creek has it all. The purist might look at the greens and scoff. But the typical golfer who just likes to have a good time? They’ll have a smile on their face the whole round. The 3rd is one of my favorite holes on the course. A pair of strategically placed bunkers in the middle of the fairway force you to be smart off the tee. A well-struck driver will leave you a short, yet precarious, wedge shot over the “creek” where the course gets its name. You’ve got some choices to make off the third tee. However, an iron to the left side of the fairway will give you the best angle on your approach, despite being a little bit of a longer shot. The course has a nice variety of par 3s that vary from extremely challenging to hole in one magnets. The 4th is the first one-shotter. It features more signature Engh elements with an amphitheater green, mounded bunkering, and a very undulating green. The par 3, 4th hole. If the 5th were a par 5, it’d be a spitting image of the 5th at Black Rock: Straight forward tee shot on the 5th at Black Rock, but your second shot is where you really have a choice to make. Here’s the 5th at Creek: The 5th at Creek Club looks similar to the 5th at Black Rock. The 8th throws you some Tobacco Road vibes: The 8th at Creek Club And you really get a sense of the elevation of the course when you take a look at the 9th hole from the green: Looking back on 9. The Back Nine at The Creek Club The back 9 immediately hits you with my favorite stretch of holes on the property in 10-13. The par 4 10th forces you to make a similar decision as you did on #3: try and clear the bunkers for the shortest approach possible, or lay it up left for the best angle, but a longer shot. The tee shot on 10. Approach on 10. I had no idea that Georgia was a place that got tornados. But a couple years ago, a tornado tore through the back 9 at The Creek Club. Specifically, it took off to the right of the par 3 11th: Pretttttty. It then took down some trees that used to be in the fairway of the wonderful par 5, 12th. The split fairway par 5, 12th hole. Fortunately, while the holes may have a bit of a different look to them now, they’re still fantastic golf holes. You take one look at The Creek Club and next to describing it as “beautiful,” if you had one word, you might say “intimidating.” But for as scary as the course looks, it’s actually more friendly than you might think. Nowhere is this more apparent than the par 3, 13th. The green is a giant S-curve, which makes for some of the craziest putts in all of Reynolds. The par 3, 13th. But if you know where to hit the ball, the green complex has a tendency to funnel balls right down to the hole. In fact, I was told this hole gives up more hole-in-ones than just about any other hole in the country, with an average of over 200 a year. The 18th is one of the most unique holes you’ll ever play. Aside from a tee shot that drops over 100 feet to the fairway below, it’s also one of the only holes I can think of that has three separate greens. (The 9th on the River Course at Blackwolf Run is the only other that comes to mind off-hand.) Tee shot on 18. We had the left green position which is the most challenging of the three, but each alters the strategy of how you’d play it. The 18th features 3 different greens. The 18th is a hole to look forward to on a course that’s full of fun holes. Final Thoughts on The Creek Club I’ve made it no secret, I love fun golf courses – and if you were to sum up The Creek Club in one word, “fun” would be a good one. The zoysia grass is a joy to play off of. But beware, it can tend to be a little slippery for carts. We even referred to this phenomenon as the “zoysia shuffle.” It can almost feel like you’re dancing around the fairway even when there’s no moisture in sight. I will say, The Creek Club isn’t a course I’d want to play every day. It’s extremely hilly, quirky, and is next to impossible to walk. The good news for Platinum Members of Reynolds is that they have 5 other courses to choose from that are included in their membership. So having a course like this that combines unique features, beautiful design, and fun golf holes is icing on the cake of one of the most complete membership offerings I’ve ever seen. The clubhouse at The Creek Club is fantastic as well. The views over-looking 18 are really special, and it feels like a vibrant private club. Throw in an excellent range and practice facilities, and you’ve got a very intriguing package. Yes, diehard golf architecture critics will find things to complain about. And you know what? That’s fine. Because while they’re busy critiquing the ridiculous greens or up and down routing – the rest of the members and lucky guests (like me) will be grinning ear to ear while they hit some of the most fun golf shots of their life. If there’s one thing I learned after 4 days at Reynolds Lake Oconee , it’s that the place was built to cater to a relaxed lifestyle and people who want to have fun. And if you can’t have fun playing the Creek? Then I’m not sure you’re someone I’d like to golf with. If you get the chance to visit The Creek Club at Reynolds , I highly suggest you take the opportunity. It’ll be a round you won’t soon forget. If you’re unable to access the Creek but planning to golf at Reynolds, consider playing the Oconee course which has some very fun moments of it’s own. georgia reynolds Previous Article Great Waters Golf Course: The Crown Jewel of Reynolds Lake Oconee Next Article Top 100 Golf Courses 2021: Honorable Mentions Sean Ogle As the Founder of Breaking Eighty Sean has spent the last 10+ years reviewing the best golf products and golf courses in the world. He prides himself on only writing about products and courses he's experienced first hand, and helping others find exactly what they need to enhance their enjoyment of the game we all love so much. Related Posts Why Ballyneal is One of the Best Destination Golf Clubs in the World July 16, 2025 Hoiana Shores: Insane Links Golf in…Vietnam?! July 8, 2025 Dutchman’s Pipe Club Lives up to (High) Expectations February 3, 2025 The Richland Course at Reynolds Lake Oconee is a Wonderful Marriage of Old and New October 29, 2024 1 Comment Ken Towe on July 8, 2023 5:53 pm As was mentioned, the Creek Club is not a walking course, but in addition the often steep up and down topography makes it difficult for older golfers as they get even older. Especially in and out of the deep bunkers and on to and back out of the undulating ‘sunken’ greens. But a joy and a pleasure for the younger members. Reply Leave A Reply Cancel Reply Save my name, email, and website in this browser for the next time I comment. Notify me of follow-up comments by email. Notify me of new posts by email. Δ Quest: Play Top Courses Currently: Top 100 in America: 49/100 Top 100 Public: 36/100 Top 100 in World: 52/100 Next Up: Good question! Email me! sean@breakingeighty.com About Us About The Eighty Club Affiliate Disclosure Cookie Policy Privacy Policy Contact Buying Guides Best Golf Rangefinders Best Golf Launch Monitors Best Golf GPS Best Golf Bags Best Golf Shoes More Golf Buying Guides Golf Coupon Codes Golf Courses and Travel Golf Resorts Private Golf Clubs Hotel Reviews Breaking Eighty Top 100 Best in State All Golf Course Reviews X (Twitter) Instagram YouTube © 2012-2025 Location 180, LLC Submit Type above and press Enter to search. Press Esc to cancel."
    }
  ]
}