{
  "fuentes": [
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "email": "membership@lhymca.com"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "email": "candice.halsey@myharourclub.com"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "email": "david.buganski@myharbourclub.com"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "email": "grace.swink@myharbourclub.com"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "email": "jim.coyne@myharbourclub.com"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "email": "juan.acevedo@myharbourclub.com"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "email": "megan.yenzer@myharbourclub.com"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "email": "selene.rui@myharbourclub.com"
    },
    {
      "url": "https://harborhillscountryclub.com/club-info/",
      "email": "harborhillscc@columbus.rr.com"
    },
    {
      "url": "https://harborhillscountryclub.com/club-info/",
      "email": "harborhillscc@columbus.rr.com"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "info@harborclub.com"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "email": "u003einfo@harborclub.com"
    },
    {
      "url": "https://www.harborhills.com/contact/",
      "email": "harborhillscountryclub@harborhills.com"
    },
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "email": "heritageharbormaintenance@verizon.net"
    },
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "email": "hproshop@tampabay.rr.com"
    },
    {
      "url": "https://harborhillscountryclub.com/contact-us/",
      "email": "harborhillscc@columbus.rr.com"
    },
    {
      "url": "https://harborhillscountryclub.com/contact-us/",
      "email": "harborhillscc@columbus.rr.com"
    },
    {
      "url": "https://www.harborhills.com/about-harbor-hills",
      "email": "arich@harborhills.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "email": "ashley.varela@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "email": "dan.hewitson@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "email": "ramiro.magallon@invitedclubs.com"
    }
  ],
  "mails": [
    "arich@harborhills.com",
    "ashley.varela@invitedclubs.com",
    "candice.halsey@myharourclub.com",
    "dan.hewitson@invitedclubs.com",
    "david.buganski@myharbourclub.com",
    "grace.swink@myharbourclub.com",
    "harborhillscc@columbus.rr.com",
    "harborhillscountryclub@harborhills.com",
    "heritageharbormaintenance@verizon.net",
    "hproshop@tampabay.rr.com",
    "info@harborclub.com",
    "jim.coyne@myharbourclub.com",
    "juan.acevedo@myharbourclub.com",
    "megan.yenzer@myharbourclub.com",
    "membership@lhymca.com",
    "ramiro.magallon@invitedclubs.com",
    "selene.rui@myharbourclub.com",
    "u003einfo@harborclub.com"
  ],
  "nombre_sitio": "harborhills.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "text": "Contact - Lakeland Hills Family YMCA Skip to content LAKELAND HILLS FAMILY Y LAKELAND HILLS FAMILY Y MENU LAKELAND HILLS FAMILY Y Search for: JOIN REGISTER GIVE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login X CLOSE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login REGISTER HERE Give Search for: Contact 2025-08-25T10:48:20-06:00 Contact Us Lakeland Hills YMCA is community-centered, bringing people of all ages and backgrounds together, to nurture potential and mobilize local communities to effect lasting and meaningful change. We look forward to helping you with your needs and answering any questions you may have. Feel free to contact us via the form below or through a membership representative at one of our local YMCAs. Contact Us Form × Contact Lakeland Hills Family Y Name * First Last Email * Who do you want to contact? * President and Chief Executive Officer, Alex Martinez Fund Development Associate, Dante Gonzalez Health & Wellness Director, Kelly Najjar Assistant Camp and Program Director, Quentin Pickering Camp & Youth Program Director, Linnea Berry Website Manager, Carmen Fritsch HR Director, Renee Dorn Chief Operating Officer, Devon Maloney Assistant Aquatics Director & Swim Lesson Coordinator, Yash Kothari Controller, Gail Shelby Fitness Director, Gerry Gessie Member Services Coordinator, Hope Hornick IT Director, Jonathan Ogintz Aquatics Manager/Lifeguard Coordinator, Sydney Jasinski Vice President Fund Development, Kaite Burke Community Engagement Manager, Kelly Horvath Early Childhood Learning Center Director, Michele Leaman Buildings and Grounds Assistant Director, Mika Newman Buildings and Grounds Director, Mike Ambrosi Membership Administrator/Day Camp Bookkeeper, Nancy Dunham Member Services Director, Reneé Welch Vice President Marketing and Membership, Rosemary Linder Day Competitive Swim Team & HR Administrator, Sarah Gulbin Senior Program Director, Shannon Bujoreanu Chief Financial Officer, Robert Marzan Early Childhood Learning Center Program Specialist & I-SWAP Manager, Cynthia Rodriguez Message * CAPTCHA Phone This field is for validation purposes and should be left unchanged. Δ Close Lakeland Hills Family YMCA 100 Fanny Road Mountain Lakes, NJ Phone: 973-334-2820 membership@lhymca.com Frequently Asked Questions What are your facility hours? Our hours are: Monday – Friday 5:00 A.M – 10:30 P.M. Saturday – Sunday 7:00 A.M. – 6:00 P.M. Directions Can I access other YMCA’s with my Lakeland Hills YMCA membership? Yes. We are proud to offer our members access to YMCA facilities across the United States and Canada that participate in Nationwide Membership. This way, our members can use the Y as often as they like, making it easier to achieve their health and wellness goals. Are group exercise classes available? Yes. We have over 65 weekly classes offered from Yoga to HIT. These classes offer a great workout in a class setting, and are all included with your membership. Can I bring a friend? Yes. As a member, you are given 3 guest passes per year. You can bring a friend up to 3X for free. After that there is a fee. Guests/friends can use facility a max of 3X per year and then must become a member. Is there a trial membership to try out the Y? Yes. We have a 1-Week Trial Membership for free.  After that, we have several options that you can choose as a new member. What benefits do I get with my membership? Full Privilege Membership entitles you to use the pool, basketball gymnasium, Health and Fitness Training Center, general membership locker rooms, as well as group fitness, yoga, spinning classes, and all aqua exercise classes. Plus, three free guest passes per year and a fitness orientation. Some age restrictions apply. Long Term Locker Membership offers full privilege membership plus an assigned locker and towel service in an adult only locker room which includes steam room, sauna and TV. What are the pool hours? For Pool Hours and available swim times, please visit our schedules page where you can download swim times as well as gymnasium and group fitness class times. Do you offer financial assistance? Yes. We offer financial aid to ensure that no one is turned away from a Y program or service due to an inability to pay. Visit our Financial Assistance page for more information. STAY CURIOUS Want to know more about how you can make an impact in the community? Fill out this simple form to learn how to get involved. About Us Join Give Volunteer Test Contact Leadership Team Register Privacy Policy Member Login Facility Hours Y Hours Mon-Fri: 5:00am-10:15pm Sat-Sun: 7:00am – 5:45pm Desk Hours Mon-Fri: 8:00am-8:00pm Sat-Sun: 8:00am – 4:00pm Learn more >> CONNECT WITH US Copyright © Lakeland Hills YMCA Lakeland Hills YMCA | 100 Fanny Road | Mountain Lakes, NJ 07046 | 973.334.2820 Site designed by Daxko Toggle Sliding Bar Area Page load link Both Tai Chi classes will be cancelled Thursday, September 11. Last chance this week to register for fall classes, which begin Monday, September 8. Registration available 24/7 online. + +"
    },
    {
      "url": "https://members.myharbourclub.com/our-team",
      "text": "Our Team - Harbour Club Member Login Home Menu Home Home Our Story Activities Directions & Hours Calendar Our Team Dress Code Work at Our Club Take a tour of the Club and see what you can enjoy. Set Up a Tour INTERESTED IN MEMBERSHIP Grace Swink Membership Director 843.823.0523 Our Team Jim Coyne Role: General Manager / Partner at BNG Hospitality Serving Since: 2018 Phone Number: 843.723.9680 Email Jim Coyne Jim has a business degree from UCF in Orlando Florida and has an extensive 30 year leadership career within the Private Club industry having worked at some of the most exclusive private club’s in the US both on the west and east coast. Jim has held the title of GM in both City and Golf and Country clubs and has extensive experience in all aspects of club management and leadership. David Buganski Role: Assistant General Manager Serving Since: 2018 Phone Number: 843.823.0531 Email David Buganski David joined the Harbour Club team in January 2018. His primary focus is bringing first-rate service to all members, guests, and private events. He stresses friendliness, product knowledge, systems and procedures. David brings over 20 years of hospitality and food & beverage experience. He moved to South Carolina in 2000 after graduating from The University of Toledo with a degree in Business Administration. Small Business has been a main focus both in degree and experience. Some highlights of experience are co-founding/operating a vacation rental property business on Daufuskie Island and spending 10 years as General Manager of a local busy family restaurant. David is committed to finding great people to add to the service team and deliver above and beyond results for Harbour Club. When David is not providing service at Harbour Club, he is likely enjoying time with his wife and young family. Grace Swink Role: Director of Membership Serving Since: 2024 Phone Number: 843.823.0169 Email Grace Swink Grace Swink joined the Harbour Club team as a Receptionist in 2020 when the Club opened its new location. She later was rehired as a Membership Assistant in 2021. Since then, Grace has been promoted to Member Relations and Marketing. She is an East Carolina University graduate and grew up in Raleigh, North Carolina. Grace’s favorite part about working at Harbour Club is building relationships with Members. Megan Yenzer Role: Member Relations Director Serving Since: 2024 Phone Number: 843.823.0169 Email Megan Yenzer Megan Yenzer joined the Harbour Club team in 2024 as Member Relations Director. She was raised in St. Louis, Missouri and attended The University of Mississippi where she earned her Bachelor of Science in Integrated Marketing Communications in 2022. When she is not at the Harbour Club, you can find her outdoors and exploring the beautiful city of Charleston. Juan Acevedo Role: Executive Chef Serving Since: 2023 Phone Number: 843.823.0532 Email Juan Acevedo Chef Juan was Born in Rochester, New York, and raised in Florida. Chef is a Le Cordon Bleu Orlando graduate. He started his career with an internship at Disney World's Magic Kingdom Castle, and he then opened Legoland Florida and Streamsong Golf Resort. He was the Sous Chef of Disney Springs Portobello, an Executive Chef for Sage Dining Services, an Executive Sous Chef for Jekyll Island Resort in Georgia, and most recently an Executive Sous Chef at Wyndham Grand in downtown Pittsburgh. When Chef Juan is not cooking, he is running half and full marathons and spending time with his seven children. Chef is excited to be able to bring his experience to the Harbour Club and be a part of creating successful systems, standards, and culture. Selene Rui Role: Club Accountant Serving Since: 2019 Phone Number: 843.823.0529 Email Selene Rui Selene Rui was born and raised in Torino, Italy. She studied hotel management and languages and left Italy after graduating from college to experience the “full immersion” of different idioms and cultures. Her goal was to live in each country for 12 to 18 months, learning the language, cultural uses, and costumes of many places. After living in different parts of Europe, she decided to venture out to the United States for an 18-month contract. 18 months became 18 years, during which she gained American citizenship through naturalization, a stable job, and a house. She still needs her “Italy fix”; she visits the country and culture that shaped her, including her family and friends. She went back to school in the United States and got into accounting as math and numbers are not opinion-based. She sees her future still in accounting and HR. When she’s not at work she can be found mingling in the gym, busy with outside activities or dancing to Latin music. Candice Halsey Role: Director of Private Events Serving Since: 2022 Phone Number: 843.823.0528 Email Candice Halsey Candice Halsey joined the Harbour Club team in February 2022 as the Director of Private Events. She was raised in North Carolina and attended Johnson & Wales, where she earned her bachelor’s degree in Sports & Event Management. For the next six years she worked for the NFL’s Carolina Panthers in Charlotte, NC. Coastal living was calling, and Candice moved to Charleston in 2016. Candice has always enjoyed planning and executing a vast array of events, most recently being weddings. Candice is excited to bring her experience to the Members and their guests of the Harbour Club and continue to go the extra mile and exceed their expectations. When she’s not planning the Club’s elaborate events, Candice is likely enjoying the beach with her son and attending music or sporting events. © All Rights Reserved. Member Login"
    },
    {
      "url": "https://harborhillscountryclub.com/club-info/",
      "text": "About Us | Harbor Hills 740-928-3596 harborhillscc@columbus.rr.com Facebook Facebook Home About Us About Us Board Of Directors Get Involved News Golf Course Course Info Rates Scorecard Course Photos Online Tee Times Membership Membership Promotions Rules & Regulations GHIN membership Shareholder Events Outings Leagues Banquet Room Event Calendar Contact Us Contact Directions Online Tee Times Select Page About Us Welcome to Harbor Hills Country Club Harbor Hills Country Club is a 9 hole semi-private golf course located on the north shore of Buckeye Lake that opened in 1925. We are proud that we are the topped ranked 9 hole golf course in Ohio! Harbor Hills Country Club offers a private banquet hall to meet the needs of a golf outing as well as for special and formal events. Your guests will enjoy a warm and spacious room with hardwood floors and a large stone gas fireplace. Our covered porch directly off the room provides a beautiful view of the community and a glimpse of Buckeye Lake. Harbor Hills Country Club provides in-house catering through our partners at Boland Entertainment. Whether you’re planning a company golf outing or a charity fundraiser, we pride ourselves on delivering flawlessly-executed outings. Our spectacular golf course and friendly service allow you to relax and enjoy the event while we take care of all the details. From tee to green, you’ll experience a well-kept golf course with manicured greens. Book Tee Times Online Directions from Columbus Take 70 E to Exit 129B Merge onto OH-79 N/Hebron Rd toward Newark. Take the US-40 ramp toward Hebron/Zanesville/I-70 ALT W. Turn right onto E main ST/US 40E. Turn right onto Mill Dam Rd SE/CR 489. Turn Left onto Christland Hill Rd SE/CR 596. Turn right onto Freeman Memorial Dr. SE. half mile on left is HHCC. Announcement Scroller Ohio Golf Guide\\'s Rated #1 9 Hole Course in Ohio        Ohio Golf Guide\\'s #1 Played 9 Hole Course in Ohio Directions from Zanesville Take 70 W to Exit 132, OH-13 Thornville/Newark. Turn left onto Jacksontown RD SE/OH-13. Turn right onto Christland Hill Rd SE/CR 596. Continue to follow CR-596. Turn Left onto Freeman Memorial Dr. SE. half mile on left HHCC. Address Harbor Hills Country Club 225 Freeman Memorial Dr. Hebron, Ohio 43025 Contact Us Phone: (740) 928-3596 E-Mail: harborhillscc@Columbus.rr.com Facebook Powered by ForeUP"
    },
    {
      "url": "https://www.harborclub.com/contact",
      "text": "Contact - Harbor Club GA Real Estate Golf Lifestyle Memberships Find Homes Inquire Real Estate Golf Lifestyle Membership About Weddings & Events Blog Gallery Contact Discover the Harbor Club Lifestyle We hope you enjoyed your virtual visit to Harbor Club, but nothing compares to experiencing our beautiful community firsthand. To schedule an in-person tour, or to simply learn more about life at Harbor Club, reach us at (800) 505-GOLF (4653) or info@harborclub.com today. Visit Us 1111 Polo Circle Suite 102 Greensboro, GA 30642 (800) 505.GOLF or (706) 453.9690 info@harborclub.com Get Directions Get In Touch Contact us today and learn more about life at Harbor Club. First Name* Last Name* Phone Number* Email Address* Zip/Country Code* Contact Preference* Email Call Text I am interested in* Real Estate Golf Membership Wedding Private Event Local Outings Learn More Golf Learn More Keep In Touch @HARBORCLUBONLAKEOCONEE 1111 Polo Circle Greensboro Georgia 30642 Get Directions 866 805 5253 info@harborclub.com Harbor Club All Rights Reserved © 2023 Real Estate Golf Lifestyle Membership About Weddings Events Blog Gallery Accolades Contact Resident Log In Member Log In Front Gate Guest Registration Privacy Policy Cookie Policy © 2025 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions. 1111 Polo Circle Greensboro Georgia 30642 Get Directions Resident Log In Member Log In Privacy Policy Cookie Policy ©2023 Harbor Club · 1111 Polo Circle · Greensboro, Georgia 30642 · Phone: 866.805.5253 Harbor Club All Rights Reserved © 2023 Real estate featured on this website hosted by Harbor Club may be owned by unrelated third parties. Harbor Club Real Estate is not involved in the sale of such properties. Access and rights to amenities in Harbor Club are subject to membership requirements, dues, fees and other limitations. Information herein is believed to be accurate, but is not warranted. All information including, but not limited to, plans, elevations, specifications, prices, square footage, available homes, amenities, and services are subject to change without prior notice or obligation. Dimensions shown on plans are approximate. Oral representations cannot be relied upon as correctly stating representations of the seller. For correct representations, reference should be made to the written purchase agreement and disclosure documents to be provided by the seller to a purchaser. No person shall be subjected to discrimination because of race, color, religion, sex, handicap, familial status, or national origin in the sale, rental, or advertising of dwellings, in the provision of brokerage services, or in the availability of residential real estate-related transactions."
    },
    {
      "url": "https://www.harborhills.com/contact/",
      "text": "Contact Us | Get in Touch Today — Harbor Hills Country Club Skip to Content Open Menu Close Menu Gift Cards Homes View Models Quick Move Ins Featured Promotions Harbor Hills Resales Custom Homes Why You Should Buy a New Home Features Live Green Keys to Building a Better Home 4 Car Garage Club Book a Tee Time Club Amenities Membership Services Golf Tennis & Pickleball Weddings Gift Cards News Blog News & Events Calendar Videos Contact Contact Us Location Map About Harbor Hills Community Service Reviews Videos 1 0 0 Gift Cards Homes View Models Quick Move Ins Featured Promotions Harbor Hills Resales Custom Homes Why You Should Buy a New Home Features Live Green Keys to Building a Better Home 4 Car Garage Club Book a Tee Time Club Amenities Membership Services Golf Tennis & Pickleball Weddings Gift Cards News Blog News & Events Calendar Videos Contact Contact Us Location Map About Harbor Hills Community Service Reviews Videos 1 0 0 Open Menu Close Menu Gift Cards Folder: Homes Back View Models Quick Move Ins Featured Promotions Harbor Hills Resales Custom Homes Why You Should Buy a New Home Features Live Green Keys to Building a Better Home 4 Car Garage Folder: Club Back Book a Tee Time Club Amenities Membership Services Golf Tennis & Pickleball Weddings Gift Cards Folder: News Back Blog News & Events Calendar Videos Folder: Contact Back Contact Us Location Map About Harbor Hills Community Service Reviews Videos 1 CONTACT US We would love to send you more information on Harbor Hills. Please fill out the form below. Email harborhillscountryclub@harborhills.com Phone 352-753-7000 About Us Central Florida's premiere custom home builder and country club community. Read More... Award Winning Community & Homes Testimonials \"I enjoy the open spaces, the views, and the many amenities available.\" - Perry Ressler, Metro World Wide Read More... Recent Posts Featured Sep 8, 2025 LEESBURG HUMANE SOCIETY’S FOREVER HOME PET TRUST BY NIKKI HOFFMAN Sep 8, 2025 Sep 8, 2025 Sep 2, 2025 THE 24th ANNIVERSARY OF THE 9-11 TRAGEDY BY NIKKI HOFFMAN Sep 2, 2025 Sep 2, 2025 Aug 25, 2025 LABOR DAY CELEBRATION IN HARBOR HILLS BY NIKKI HOFFMAN Aug 25, 2025 Aug 25, 2025 Aug 18, 2025 THE SECOND ANNUAL HEART FOR CHARITY GOLF TOURNAMENT BY NIKKI HOFFMAN Aug 18, 2025 Aug 18, 2025 Contact Us Harbor Hills 6538 Lake Griffin Rd. Lady Lake, FL 32159 (352) 753-7000 Pro Shop / Tee Times Call: (352) 753-7711"
    },
    {
      "url": "https://www.heritageharborgolf.com/contactus/",
      "text": "Contact Us - Heritage Harbor Golf and Country Club Skip to primary navigation Skip to main content Heritage Harbor Golf and Country Club Lutz, FL Home Golf Course Info Scorecard Hole by Hole Tee Times Facilities Golf Facilities Practice Facilities Pro Shop Double Bogey’s Tavern & Grille Heritage Harbor Golf and Country Club Lutz, FL Lessons Events Outings & Events Tournament Info Request Outing Info SRK Camp HOA Community Development Community Event Calendar HOA Info Home Owner’s Associations Architectural Information HOA Member Area Neighbors Helping Neighbors HOA Documents HOA Meeting Minutes For Sale/For Rent Sign Guidelines Contact Contact Join the Harbor’s E-Club Directions to Heritage Harbor Staff Listing ADA Compliance & Accessibility Contact Us Heritage Harbor Golf & Country Club 19502 Heritage Harbor Parkway Lutz, Florida 33558 Double Bogeys Tavern & Grille phone (813)949-6841  Ext. 3 Pro Shop and Golf Course phone (813) 949-4886 fax (813) 909-4826 hhproshop@gmail.com Clubhouse Front Desk phone (813) 949-6841 fax (813) 909-4826 hhcluboffice@gmail.com Golf Course Superintendent (813) 909-4336 heritageharbormaintenance@verizon.net Page Footer Contact Us Address : 19502 Heritage Harbor Pkwy Lutz, FL, 33558 Email : hhcluboffice@gmail.com Phone : 813-949-6841 Facebook Local Weather Copyright © 2025 Heritage Harbor Golf and Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://harborhillscountryclub.com/contact-us/",
      "text": "Contact Us | Harbor Hills 740-928-3596 harborhillscc@columbus.rr.com Facebook Facebook Home About Us About Us Board Of Directors Get Involved News Golf Course Course Info Rates Scorecard Course Photos Online Tee Times Membership Membership Promotions Rules & Regulations GHIN membership Shareholder Events Outings Leagues Banquet Room Event Calendar Contact Us Contact Directions Online Tee Times Select Page Pro Shop: (740) 928-3596 Harbor Hills Country Club and its staff strive to provide the best service possible to all its members and patrons. If you have any questions or wish to be notified of other events, please contact us. Address: 225 Freeman Memorial Dr.Hebron, Ohio 43025 Request More Info First Name * Last Name * Email * Phone Comments/Questions? If you are human, leave this field blank. Directions from Columbus Take 70 E to Exit 129B Merge onto OH-79 N/Hebron Rd toward Newark. Take the US-40 ramp toward Hebron/Zanesville/I-70 ALT W. Turn right onto E main ST/US 40E. Turn right onto Mill Dam Rd SE/CR 489. Turn Left onto Christland Hill Rd SE/CR 596. Turn right onto Freeman Memorial Dr. SE. half mile on left is HHCC. Announcement Scroller Ohio Golf Guide\\'s Rated #1 9 Hole Course in Ohio        Ohio Golf Guide\\'s #1 Played 9 Hole Course in Ohio Directions from Zanesville Take 70 W to Exit 132, OH-13 Thornville/Newark. Turn left onto Jacksontown RD SE/OH-13. Turn right onto Christland Hill Rd SE/CR 596. Continue to follow CR-596. Turn Left onto Freeman Memorial Dr. SE. half mile on left HHCC. Address Harbor Hills Country Club 225 Freeman Memorial Dr. Hebron, Ohio 43025 Contact Us Phone: (740) 928-3596 E-Mail: harborhillscc@Columbus.rr.com Facebook Powered by ForeUP"
    },
    {
      "url": "https://www.harborhills.com/about-harbor-hills",
      "text": "About Harbor Hills | Explore, Connect, Enjoy Today — Harbor Hills Country Club Skip to Content Open Menu Close Menu Gift Cards Homes View Models Quick Move Ins Featured Promotions Harbor Hills Resales Custom Homes Why You Should Buy a New Home Features Live Green Keys to Building a Better Home 4 Car Garage Club Book a Tee Time Club Amenities Membership Services Golf Tennis & Pickleball Weddings Gift Cards News Blog News & Events Calendar Videos Contact Contact Us Location Map About Harbor Hills Community Service Reviews Videos 1 0 0 Gift Cards Homes View Models Quick Move Ins Featured Promotions Harbor Hills Resales Custom Homes Why You Should Buy a New Home Features Live Green Keys to Building a Better Home 4 Car Garage Club Book a Tee Time Club Amenities Membership Services Golf Tennis & Pickleball Weddings Gift Cards News Blog News & Events Calendar Videos Contact Contact Us Location Map About Harbor Hills Community Service Reviews Videos 1 0 0 Open Menu Close Menu Gift Cards Folder: Homes Back View Models Quick Move Ins Featured Promotions Harbor Hills Resales Custom Homes Why You Should Buy a New Home Features Live Green Keys to Building a Better Home 4 Car Garage Folder: Club Back Book a Tee Time Club Amenities Membership Services Golf Tennis & Pickleball Weddings Gift Cards Folder: News Back Blog News & Events Calendar Videos Folder: Contact Back Contact Us Location Map About Harbor Hills Community Service Reviews Videos 1 A great community allows its homeowners to feel a sense of privacy, security, and serenity, while providing a place to socialize, interact and celebrate life. A great Club greets each member with a smile as if they are family, while paying close attention to their needs through personalized service. A great home mirrors the homeowner’s personality, down to even the most intricate details that make us who we are. Our Harbor Hills family values these ideals down to its core and it's evident in everything we do. WHAT MAKES HARBOR HILLS GREAT Building upon our industry leading Florida Home Building experience, our team of dedicated professionals have collectively built tens of thousands of New Florida Homes and now culminate in the homes that we build for you at Harbor Hills. It's Our Life's Work and we are passionate about what we do. Harbor Hills is family owned and operated and is backed by one of the nations's most prestigious institutions.  On any given day, family members and our extended Harbor Hills family are onsite and available to serve you. IT IS WHO WE ARE We invite you to explore our web site and learn about our one of a kind community.  Be sure to subscribe to our YouTube Channel and explore our facebook page . We are especially proud of the tremendous impact that our Club has on our surrounding community and are pleased to report that in 2014 the club and affiliated organizations donated approximately $100,000 to various community charities.  Please take a look at our community service page for more information. Of course there is no better way to experience Harbor Hills than to be our guest and visit us.  Call (352) 753-7000 or email us to inquire about our Get Away and Play program. We look forward to seeing you at the Harbor Hills Country Club and sharing our Life's Work with you. AN INVITATION TO YOU Do you have questions or require assistance? A team member is standing by to assist you. CONTACT US About Us Central Florida's premiere custom home builder and country club community. Read More... Award Winning Community & Homes Testimonials \"I enjoy the open spaces, the views, and the many amenities available.\" - Perry Ressler, Metro World Wide Read More... Recent Posts Featured Sep 8, 2025 LEESBURG HUMANE SOCIETY’S FOREVER HOME PET TRUST BY NIKKI HOFFMAN Sep 8, 2025 Sep 8, 2025 Sep 2, 2025 THE 24th ANNIVERSARY OF THE 9-11 TRAGEDY BY NIKKI HOFFMAN Sep 2, 2025 Sep 2, 2025 Aug 25, 2025 LABOR DAY CELEBRATION IN HARBOR HILLS BY NIKKI HOFFMAN Aug 25, 2025 Aug 25, 2025 Aug 18, 2025 THE SECOND ANNUAL HEART FOR CHARITY GOLF TOURNAMENT BY NIKKI HOFFMAN Aug 18, 2025 Aug 18, 2025 Contact Us Harbor Hills 6538 Lake Griffin Rd. Lady Lake, FL 32159 (352) 753-7000 Pro Shop / Tee Times Call: (352) 753-7711"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/mission-hills-country-club/who-we-are",
      "text": "About Us | Mission Hills Country Club in Rancho Mirage × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Calendar Opens in new tab Newsletter Opens in new tab Member Login Opens in new tab Careers Mission Hills Country Club Main Site Navigation Who We Are Golf Amenities Membership Host An Event Join Now Host Event Contact Us Contact Us Menu Who We Are Our Team Calendar Directions & Hours Our History Golf Arnold Palmer Signature Course Dinah Shore Tournament Course Pete Dye Challenge Course Golf Academy Game On Golf Lessons Crush It! Youth Golf Lessons Galleri Classic Amenities Dining Racquet Sports Wellness Spa Croquet Champions Club Villas Membership XLife Benefits Host An Event Event Rooms Contact Us Real Estate Resources Calendar Opens in new tab Newsletter Opens in new tab Member Login Opens in new tab Careers Home Who We Are Skip Image Carousel Our Team Calendar Directions & Hours Our History Mission Hills Country Club: A Legacy of Excellence in Coachella Valley Where History, Community, and Innovation Unite For decades, Mission Hills Country Club has set the standard for luxury and leisure in Rancho Mirage, CA. Known for its iconic golf courses, world-class racquet sports facilities, and vibrant community, Mission Hills is more than just a country club—it’s a place where generations come together to play, connect, and make memories in the heart of the Coachella Valley. Shaping Legends in the Coachella Valley Since its founding in 1971, Mission Hills Country Club has been a hub for connection and camaraderie. The Dinah Shore Tournament Course, opened in 1972, brought international acclaim and cemented the club’s reputation as a premier golf destination in the Coachella Valley. Hosting the LPGA major now known as The Chevron Championship, Mission Hills has long been a breeding ground for champions, a legacy proudly upheld by its Members. Explore Our Timeline A Premier Lifestyle in Rancho Mirage Mission Hills Country Club offers a luxurious lifestyle, with 54 holes of championship golf and world-class racquet sports facilities, including 43 courts. The club hosts prestigious events like the PGA Champions Galleri Classic and PPA Tour The Masters, providing ample opportunities for competition and improvement. Members also enjoy a resort-style pool, spa, and exceptional dining, making it the ultimate destination for leisure and community in Rancho Mirage. Continuing Our Legacy in the Desert Mission Hills remains dedicated to evolving while honoring the heritage that established its status as a Coachella Valley icon. We’re enhancing amenities and introducing new experiences to ensure Members enjoy nothing less than excellence. Our vision is to be the premier destination for those seeking a premium lifestyle, where tradition and innovation seamlessly blend, positioning Mission Hills at the forefront of luxury country clubs in the Coachella Valley for generations to come. Explore Membership Dan Hewitson SVP & Managing Director Contact Me 760-883-5322 Contact Me About Dan + Close Dan Hewitson information modal Dan Hewitson SVP & Managing Director Serving since 2007 760-883-5322 Dan.Hewitson 760-883-5322 Dan.Hewitson Contact Me About Dan Dan comes to Mission Hills from his previous role as Regional Operations Managing Director for 18 clubs within the Pacific region of Invited. This is such a special opportunity and he is thrilled with the ability to dedicate his focus to our Clubs in the desert and deliver a premier club experience at Mission Hills our Members can all be proud of.  Dan has lived in the Palm Desert area for more than 15 years and raised his five children here. Like you, he considers the desert his home and Mission Hills a very special place. Contact Me Ashley Varela Club Manager Contact Me 760-883-1579 Contact Me + Close Ashley Varela information modal Ashley Varela Club Manager Serving since 2020 760-883-1579 Ashley.Varela 760-883-1579 Ashley.Varela Contact Me Contact Me Ramiro Magallon Membership Director Contact Me Contact Me + Close Ramiro Magallon information modal Ramiro Magallon Membership Director Serving since 2024 Ramiro.Magallon Ramiro.Magallon Contact Me Contact Me Join the Mission Hills Community Membership Learn the benefits of membership at Mission Hills and start experiencing the very best of Palm Springs and beyond. Learn More Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Golf Amenities Membership Host An Event Contact Us Mission Hills Country Club Opens in new window 34600 Mission Hills Dr Rancho Mirage, CA \r\n                                92270 1 760-324-9400 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    }
  ]
}