{
  "fuentes": [
    {
      "url": "https://hardwickprojects.com.au/team/sean_hardwick.php",
      "email": "admin@hardwickprojects.com.au"
    },
    {
      "url": "http://hardwickcompany.com/contact-us/",
      "email": "allenh@hardwickcompany.com"
    },
    {
      "url": "http://hardwickcompany.com/contact-us/",
      "email": "david@hardwickcompany.com"
    },
    {
      "url": "http://hardwickcompany.com/contact-us/",
      "email": "jay@hardwickcompany.com"
    },
    {
      "url": "http://hardwickcompany.com/contact-us/",
      "email": "rkh@hardwickcompany.com"
    },
    {
      "url": "https://www.spokesman.com/stories/2019/aug/27/plans-progress-for-proposed-hardwick-sons-hardware/",
      "email": "amye@spokesman.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://dtjax.com/organizer/hardwicks/",
      "email": "lexi@dtjax.org"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/contact-us-2-w.asp",
      "email": "applepay@2x.png"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/contact-us-2-w.asp",
      "email": "info@hardwickcountrystore.co.uk"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/contact-us-2-w.asp",
      "email": "mastercard@2x.png"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/contact-us-2-w.asp",
      "email": "visa-electron@2x.png"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/contact-us-2-w.asp",
      "email": "visa@2x.png"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "email": "sgoodwin@surgetechak.com"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "brianna@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "kylie@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "lindsey@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "shirley@teamjackfoundation.org"
    },
    {
      "url": "https://www.floridatheatre.com/connect/press-and-news",
      "email": "beth@floridatheatre.com"
    },
    {
      "url": "https://www.floridatheatre.com/connect/press-and-news",
      "email": "beth@floridatheatre.com"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/about-us-1-w.asp",
      "email": "applepay@2x.png"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/about-us-1-w.asp",
      "email": "info@hardwickcountrystore.co.uk"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/about-us-1-w.asp",
      "email": "mastercard@2x.png"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/about-us-1-w.asp",
      "email": "visa-electron@2x.png"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/about-us-1-w.asp",
      "email": "visa@2x.png"
    },
    {
      "url": "https://hardwickandsons.com/pages/contact",
      "email": "service@ehardwicks.com"
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "email": "ben@hardwickes.co.uk"
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "email": "ca@hardwickes.co.uk"
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "email": "d.stoker@hardwickes.co.uk"
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "email": "davidhall@hardwickes.co.uk"
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "email": "davidharper@hardwickes.co.uk"
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "email": "davidshaw@hardwickes.co.uk"
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "email": "peterrobinson@hardwickes.co.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "email": "complaint.info@financial-ombudsman.org.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "email": "customer.relations@wickes.co.uk"
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "email": "wickes@clarioncomms.co.uk"
    },
    {
      "url": "https://mynorthwest.com/uncategorized/dori-hardwick-sons/1435648",
      "email": "sblumenfeld@bonneville.com"
    },
    {
      "url": "https://mynorthwest.com/uncategorized/dori-hardwick-sons/1435648",
      "email": "sblumenfeld@bonneville.com"
    }
  ],
  "mails": [
    "admin@hardwickprojects.com.au",
    "allenh@hardwickcompany.com",
    "amye@spokesman.com",
    "applepay@2x.png",
    "ben@hardwickes.co.uk",
    "beth@floridatheatre.com",
    "brianna@teamjackfoundation.org",
    "ca@hardwickes.co.uk",
    "complaint.info@financial-ombudsman.org.uk",
    "customer.relations@wickes.co.uk",
    "d.stoker@hardwickes.co.uk",
    "david@hardwickcompany.com",
    "davidhall@hardwickes.co.uk",
    "davidharper@hardwickes.co.uk",
    "davidshaw@hardwickes.co.uk",
    "info@hardwickcountrystore.co.uk",
    "info@reception-plus.de",
    "jay@hardwickcompany.com",
    "kylie@teamjackfoundation.org",
    "lexi@dtjax.org",
    "lindsey@teamjackfoundation.org",
    "mastercard@2x.png",
    "peterrobinson@hardwickes.co.uk",
    "rkh@hardwickcompany.com",
    "sblumenfeld@bonneville.com",
    "service@ehardwicks.com",
    "sgoodwin@surgetechak.com",
    "shirley@teamjackfoundation.org",
    "visa-electron@2x.png",
    "visa@2x.png",
    "wickes@clarioncomms.co.uk"
  ],
  "nombre_sitio": "hardwicksbarjax.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://hardwickprojects.com.au/team/sean_hardwick.php",
      "text": "Hardwick Projects | Canberra's Building, Renovation & Extension Experts 0 Skip to Content Home About Services Projects Contact CALL Open Menu Close Menu Home About Services Projects Contact CALL Open Menu Close Menu Home About Services Projects Contact CALL CANBERRA’S TRUSTED EXPERTS IN BUILDING NEW HOMES, RENOVATIONS &              EXTENSIONS VIEW PROJECTS ↓ Award-Winning Local Builder Years Experience: 15+ Servicing: Canberra & Surrounding Regions Google Reviews : 5.0 ★★★★★  Rated Projects Completed : 100+ Your trusted builder with 15+ years experience At Hardwick Projects Pty Ltd, we pride ourselves on delivering exceptional craftsmanship, tailored to your vision. With a commitment to high-quality finishes, personalised service, and unmatched reliability, we ensure every project exceeds expectations. Our personalised approach guarantees that each detail is handled with precision, providing a seamless experience from start to finish. OUR STORY What We Offer NEW HOMES From concept to completion, we specialise in building high-quality new homes ranging from $500K to $2M. RENOVATIONS We transform existing spaces with renovations tailored to your vision, with project values from $50K to $1M. EXTENSIONS Whether adding space or functionality, our extensions are designed to enhance your home, starting at $100K and up to $1.5M. Explore Recent Projects Projects Deakin Bathroom Home Yarralumla Kitchen Home Stirling Family Residence Springrange Family Home Palmerston Bathroom Renovation Nanima Country Home Kambah Heritage House Hawker Family Home Hall Heritage Home Kind Words “Sean’s team did a great job on our renovation and extension in Downer. We did a lot of research and spoke to many builders before ultimately deciding to go with Sean - because he was open and honest, patient with us, and a genuinely nice bloke. Sean was personally involved in all aspects of the build from start to finish (including helping us choose appliances!). Sean kept us regularly informed, the quality of the work was excellent, and the team was always friendly and respectful. Our neighbours even commented on how lovely the tradies were!  Will happily engage Sean to do further work on our place and would recommend to others.” Paul Denny Downer, ACT “From initial consultation through to completion Sean and the Hardwick team were outstanding and exceeded our expectations. The craftsmanship, the attention to detail, and respect this team has is unique and unparalleled. In a stressful and overwhelming time the Hardwick team know how to put you at ease, they were constantly in contact and ensured all were on the same page to achieve an amazing renovation.  I have and will continue to recommend the Hardwick team, and will definitely use them again in the future.” Bec and Toby White Street, Campbell ACT “The team at Hardwick Projects have been exceptional. Sean’s comfortable yet professional manner made us feel far more than ‘just clients’.  The team is unrivalled and have taken every effort to keep us informed at every stage of the project.” Anonymous Yarralumla, ACT “The team at Hardwick Projects are skilful at their craft, and entirely professional in the way they go about their business. From the very first meeting with Sean when we explained our ideas, through to the finishing touches, the Hardwick team has been exceptional in their communications across the entire duration of the build.  Five out of five stars.” Suomi-Botham Family Narrabundah, ACT HARDWICK PROJECTS Hardwick Projects is an award-winning builder specialising in projects such as new builds and renovations across the Canberra region and surrounding areas. Renowned for our attention to detail and exceptional craftsmanship, we deliver bespoke services tailored to your vision. Whether you're planning a stunning new home or transforming your existing space through a renovation, our skilled and experienced team ensures every project is completed to the highest standard. With a focus on innovation, functionality, and timeless design, Hardwick Projects is dedicated to creating spaces that inspire. Explore our projects , learn more about our services , and meet the passionate professionals in our About Us section. Email Address SIGN UP Thank you! GET LATEST INSIGHTS Stay updated with building, renovation and design trends Home About Services Projects Get a quote Contact Privacy Policy Terms and Conditions GET IN TOUCH Unit 14/9 Beaconsfield St, Fyshwick ACT 2609 admin@hardwickprojects.com.au +61 432 339 446 Copyright © 2024 Hardwick Projects PTY LTD. Licence No : 00149840 ACN : 69 612 839 228. Website by Y2Y3"
    },
    {
      "url": "http://hardwickcompany.com/contact-us/",
      "text": "Contact Us – Hardwick Company, Inc. Skip to content Processing fabricated and prefabricated steel since 1909 Menu Home Services Spirals Tight Radius Bending Capabilities Online Quote Contact Us Contact Us: Bessemer Plant 2525 8th Avenue Bessemer, Alabama 35020 Phone: (205) 426-7952 Fax: (205) 425-9812 Map this location » David Hardwick: david@hardwickcompany.com Allen Hardwick: allenh@hardwickcompany.com Jay Hardwick: jay@hardwickcompany.com Bob Hardwick: rkh@hardwickcompany.com World Class Bending Featured in the July 2011 edition of The Fabrocator magazine. Click here to read the article! Bessemer Plant 2525 8th Avenue Bessemer, Alabama 35020 Map this location » Phone: (205) 426-7952 Fax: (205) 425-9812 Theme: Overlay by Kaira . Copyright © Hardwick Company, Inc. Locations in Birmingham and Bessemer"
    },
    {
      "url": "https://www.spokesman.com/stories/2019/aug/27/plans-progress-for-proposed-hardwick-sons-hardware/",
      "text": "Plans progress for proposed Hardwick & Sons hardware store in Post Falls Skip to main content Arrow-right Camera The Spokesman-Review Newspaper The Spokesman-Review Newspaper The Spokesman-Review Spokane, Washington  Est. May 19, 1883 Current Temperature 67°F Current Conditions Haze View complete weather report Menu Search News Sports Business A&E Weather Obits Puzzles Newsletters e-Edition Classifieds Customer Care Subscribe My account Log in Activate Log out Close Color Scheme Use system setting Light theme Dark theme Subscriber Actions Log In Subscribe Activate My account Log out Staff Options Reset cache Access admin Edit this page Log out Connect With Us Go to e-Edition Sign up for newsletters Customer Care Support Local Journalism Donate Visit the S-R Shop Buy Photo Reprints News Washington Idaho Nation World Health Marijuana Election Center Government Federal Government WA Government ID Government Local Government Weather Further Review Sports Outdoors Gonzaga basketball Gonzaga women WSU football WSU basketball EWU football EWU basketball High School Sports Spokane Chiefs Spokane Indians Seattle Mariners Seattle Seahawks Seattle Sounders Zephyr/Velocity UW football UW basketball Idaho football Idaho basketball Whitworth Business Local business National business Real Estate Arts and Entertainment A&E Music Stage Movies TV Food Dining Art Books Summer Stories Trips Opinion Opinion Letters to the Editor Archives Today’s News Special Sections Search Multimedia Photos Reader Photos Picture Stories Video Classifieds General Classifieds Homes/Rentals Employment Auto Connection Pets: Jimmy's Clubhouse Public Records Brides Births Birthday/Anniversary Form Announcements Advertising Advertise with us Advertising inserts Subscribe now Close Washington Idaho Business Education Health Photos Further Review News Business Plans progress for proposed Hardwick & Sons hardware store in Post Falls Tue., Aug. 27, 2019 Hardwick & Sons, which has been based in Seattle since 1932, is moving to Post Falls. Owner Dean Hardwick said construction could be complete by July for a new retail store, warehouse and wood shop. (Courtesy photo) X Email Reddit SMS By Amy Edelen amye@spokesman.com (509) 459-5581 After rising property taxes and traffic congestion forced longtime Seattle hardware store Hardwick & Sons to announce its closure after more than 81 years of business, owner Dean Hardwick chose to build a new location. Plans are now progressing for a development in Post Falls, following approval in July by city officials to annex two parcels of land at 3820 and 3850 E. Mullan Ave. to make way for a Hartwick retail store, warehouse and wood shop. “Hopefully, a lot of people in the trades will appreciate us, and your average folks, too,” said Hardwick, adding the new location won’t be a conventional hardware store that sells paint or an abundance of electrical supplies. “It will be very interesting for people and it will be different. It won’t be like ACE  or True Value ” hardware stores. Hardwick & Sons – which carries specialty tools like Japanese pruning saws and unique, hard-to-find items – was founded in 1932 by Charles Hardwick, Dean’s grandfather. The store moved to 4214 Roosevelt Way N.E. in Seattle’s U-District in 1938. Dean and his brother, Bill, assumed ownership of the store in 1976 and ran it together until Bill died in 2017. Hardwick said property taxes have been accelerating more than 25% annually on the fourth-generation, family-owned business and that prompted him to sell the Seattle building in a 1031 Exchange, which is essentially a swap of one property for another while deferring capital gains tax on the sale. Bellevue-based 4214 Roosevelt Way LLC purchased the property in April for $17.2 million, according to King County assessor’s records. Harwick is continuing to operate the Seattle store until construction begins for a proposed 22-story high-rise on the site. Hardwick said proceeds from the sale will go toward building a more than 9,000-square-foot, built-to-suit hardware store, a 7,000-square-foot warehouse and a 3,200-square-foot wood shop in Post Falls. Mark Latham, founder and president of Post Falls-based ML Architect & Associates Inc., is designing the project. Hardwick said another reason behind the move to Post Falls is proximity to family. His wife grew up in Spokane Valley and his father-in-law is a business owner in Coeur d’Alene. “My wife and I are going to be closing on a home in Coeur d’Alene at the end of the month,” Hardwick said last week. “She will enjoy coming back to where she grew up.” Hardwick plans to work part time alongside his son, Paul, who will  operate the Post Falls store. The next step in the development process is to submit building permits, Hardwick said. Construction could be underway in October and  complete by July, he added. Post Falls Community Development Director Bob Seale said Hardwick & Sons will likely be well-received by the community. “The location will be great and is easily accessible by the surrounding communities as well,” he said. “It’s another great small business to be added to our community to increase options available here and serve the citizens of Post Falls as well as the greater Kootenai County area.” The Spokesman-Review Newspaper Local journalism is essential. Give directly to The Spokesman-Review's Northwest Passages community forums series -- which helps to offset the costs of several reporter and editor positions at the newspaper -- by using the easy options below. Gifts processed in this system are tax deductible. Meet Our Journalists Subscribe now to get breaking news alerts in your email inbox Get breaking news delivered to your inbox as it happens. Sign up Top Stories in Business John Deere, a U.S. icon, is undermined by tariffs and struggling farmers Boeing plans to hire replacements for striking workers Southwest Airlines will offer free Wi-Fi on all flights, with a catch Job cuts jump 66% year to date; DOGE, uncertainty and AI are major factors Sponsored Content Simple weeknight dinners featuring your favorite dairy products When evenings are packed with after-school activities, homework, and errands, dinner needs to be fast, filling, and family-friendly. Healthy and delicious doesn't hurt either. Follow Us Facebook Instagram TikTok X Newsletter Support Local Journalism Donate Visit the S-R Shop Buy Photo Reprints Subscribe Print edition home delivery Newspaper Routes Available Help Customer Care Sitemap Directory Subscription Services User Subscribe My Account Log in/Register Activate Log out Advertising Spokesman Digital Print & Digital Advertising Classifieds Obituaries More Masthead Staff Cowles Company Jobs Newsroom Jobs at The Spokesman-Review Archives/Research RSS Feeds Jumble Crossword Horoscopes Contact Us Downtown Spokane 999 W Riverside Ave Spokane, Wa 99201 Mailing Address P.O. Box 2160 Spokane, WA 99210 Customer Care: (509) 747-4422 Newsroom: (509) 459-5400 © Copyright 2025, The Spokesman-Review | Community Guidelines | Terms of Service | Privacy Policy | Copyright Policy"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Nachricht Datenschutz name First name Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://dtjax.com/organizer/hardwicks/",
      "text": "Hardwicks - Downtown Jacksonville Visit Visit Overview Dining Bars & Nightlife Hotels Shopping Arts & Culture Sports Parks & Riverfront Jacksonville Riverwalk Events & Meeting Spaces Services Anchor Institutions Tours Experiences Live Work Invest Donate Events Map Parking & Transit Downtown History Shop #DTJax e-Gift Card Blog Downtown Jacksonville Events Map Parking & Transit Downtown History Shop #DTJax e-Gift Card Blog Visit Visit Overview Dining Bars & Nightlife Hotels Shopping Arts & Culture Sports Parks & Riverfront Jacksonville Riverwalk Events & Meeting Spaces Services Anchor Institutions Tours Experiences Live Work Invest Donate Hardwicks 0 events found. Submit Event Notice There were no results found. Notice There were no results found. Hardwicks Events Organizers Hardwicks Email 0 Website http://0 Events from this organizer Today Upcoming Upcoming Select date. Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Submit Event Only events occurring within Downtown Jacksonville will be accepted. If you have any questions pleas e contact us. Submit Event Only events occurring within Downtown Jacksonville will be accepted. If you have any questions please email lexi@dtjax.org . Visit Live Work Invest Donate Events Map Parking & Transit Downtown History Shop #DTJax e-Gift Card Blog Downtown Vision Inc. About Downtown Vision Board Staff Opportunities Meeting Space Rental Downtown Ambassadors Research PlacemakingJax Our Events First Wednesday Art Walk OLD Third Thursday Sip and Stroll DTJax Awards DTJax Gala Connect Meeting Notifications Quarterly Stakeholder Meeting Media Pay DVI Downtown Vision, Inc. 29 W. Duval St. Jacksonville, FL 32202 Contact Us Terms & Conditions Report An Issue Site powered by Wingard Downtown Jacksonville Join Our Newsletter ©2025 Downtown Vision, Inc. All Rights Reserved."
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/contact-us-2-w.asp",
      "text": "Hardwick Country Store Contact Us What are you looking for? CHRISTMAS DELIVERY:  LAST ORDER DATE FRIDAY 20TH BY 10AM! HURRY! View here Hardwick Country Store Womens Accessories Ariat Baleno Barbour Footwear Gibson's LE CHAMEAU Toggi View All Mens Accessories Footwear Jackets Legwear Tops & Shirts LE CHAMEAU View All Equestrian & Pets Animal Grooming & Accessories Tack & Riding Accessories View All Children's Clothing Accessories Boys Footwear Girls View All Toys & Games Toys & Games View All Outdoor Pursuit Sale Clearance Men Women View All Terms and Conditions Returns View All Blog Womens Accessories Ariat Baleno Barbour Footwear Gibson's LE CHAMEAU Toggi View All Mens Accessories Footwear Jackets Legwear Tops & Shirts LE CHAMEAU View All Equestrian & Pets Animal Grooming & Accessories Tack & Riding Accessories View All Children's Clothing Accessories Boys Footwear Girls View All Toys & Games Toys & Games View All Outdoor Pursuit Sale Clearance Men Women View All Terms and Conditions Returns View All Blog Contact Us If you have any questions please get in touch. Phone: 01723 859785 (9.00am - 5.00pm) Address: Hardwick Country Store, Main Road, Brompton-by-Sawdon, Scarborough, YO13 9DP, . Alternatively, use this contact form and we will get back to you as soon as possible. * Required Field Name: * Email Address: * Message: Please enable JavaScript in your browser to send us a message. Sign Up For Exclusive News & Offers Home Blog About Us Contact Us Returns Delivery Blog Terms Sitemap Privacy Hardwick Agricultural Engineers, Main Road, Brompton-by-Sawdon YO13 9DP 01723 859785 / 01723 859658 info@hardwickcountrystore.co.uk © Copyright 2020-2022 Hardwick Country Store All rights reserved Close Don't Miss Out Sign up for exclusive offers this Autumn! Sign Up Now"
    },
    {
      "url": "https://surgetechak.com/contact/",
      "text": "Get in Touch with Surge Tech - Contact Us Today Skip to content HOME MANAGED SERVICES NETWORK SUPPORT AND MONITORING Monitored Security Disaster Recovery HIPAA Compliance IT SERVICES Chief Information Officer Cloud Services VoIP Phone Services Training and Consulting CONTACT Contact Us Contact SurgeTechAK 2023-08-24T10:13:42-08:00 Get In Touch! Complete the form below and a representative from Surge Technologies will be in touch to discuss your organizational needs. Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Let's talk Phone 907-947-2744 Get In Touch Email sgoodwin@surgetechak.com Get In Touch Contact Info Anchorage Mobile: 907-947-2744 Email: mailto: sgoodwin@surgetechak.com Managed Services Network Support and Monitoring Monitored Security Disaster Recovery HIPAA Compliance IT Services CIO (Chief Information Officer) Cloud Services VoIP Phone Services Training and Consulting © Copyright | Surge Technologies of Alaska | All Rights Reserved | Anchorage Alaska Web Design by Bianca Frank Design Page load link Go to Top"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "text": "Board & Staff | Team Jack Foundation Follow Follow Follow Follow U Search  Shop w News w Blog Donate Search for: About Us About Us Our Mission Our History Jack Hoffman Board & Staff Financials Contact Us Our Impact Projects & Progress We Fund Nebraska Childhood Brain Tumor Program Scientific Advisory Board Apply for TJF Grant Research Articles Brain Cancer About Brain Cancer What is DIPG? Brain Cancer Facts Cancer Awareness Months Brain Tumor Awareness Month Childhood Cancer Awareness Month Family Resources Events Takedown the Tumor Gala Golf Classic An Evening with Henry Winkler Miles for Team Jack Radiothon Texas Golf Broken Chair Trophy View All Events Get Involved Fundraise Workplace Giving Host an Event Birthday Fundraiser Partner Memorials Give Our Sponsors Volunteer Heroes Donate Shop Blog Select Page About Us Team Jack Board and Staff Team Jack Board Members The Team Jack Foundation is a nonprofit under the leadership of a volunteer board of directors consisting of community and business leaders from around Nebraska and the country. The board meets monthly to discuss budgets, events and other news about the fight against childhood brain cancer. The expert guidance of our volunteer board consistently drives Team Jack to new heights. Rex Burkhead Rex Burkhead is a retired running back of the National Football League. Originally drafted by Cincinnati in the sixth round (190th overall) of the 2013 NFL Draft, Burkhead spent four seasons with the New England Patriots, before signing with the Texans prior to the 2021 season. He was a key offensive contributor each season for the Patriots and was a member of the Patriots 2018 Super Championship team, scoring the last two touchdowns during the thrilling overtime AFC Championship against the Kansas City Chiefs. Burkhead played college football at the University of Nebraska, which is where his story with Team Jack began. Rex has played an important part to the development and ongoing success of the Team Jack Foundation. Not only does Burkhead serve as a board member on the Foundation’s board of directors, but he was instrumental in the Foundation’s inception itself. Team Jack was formed to raise funds for pediatric brain cancer research. Its namesake is Jack Hoffman, a 18-year-old from Nebraska who has been battling the disease for most of his life. Hoffman and Burkhead formed an unlikely friendship when Burkhead was a star player at Nebraska that has continued to this day. Hoffman even won a “Best Moment” ESPY award when he entered Nebraska’s 2013 spring game and scored a 69-yard touchdown while sporting No. 22, Burkhead’s number during his college days. The two even met President Barack Obama together at the White House in 2013. Rex is from Plano, TX, where he currently resides with this wife, Danielle, and two sons, Jett and Steel. Karen Carson Karen Carson is a Co-founder of Fat Brain Toys, a retailer and manufacturer of educational toys and games. Karen’s introduction to the toy industry came about at the suggestion of her then 10-year old son, Adam. In the Fall of 2002, after finding it difficult to locate specialty toys online, her son suggested that she and her husband Mark build their own website to better serve the growing demand for toys online. Carson accepted the challenge from her son and thus began a new career in the toy industry. Since 2002, Fat Brain Toys has grown into one of the largest online toy stores in the country. Recognizing the importance of a true multi-channel experience, Fat Brain Toys has since expanded into brick & mortar retail, opening retail store experiences in Omaha, Nebraska and Overland Park, Kansas. In addition to the company’s direct-to-consumer efforts, the company also designs and wholesales it’s own line of products to over 2,000 retailers around the world. Fat Brain Toys is a frequent benefactor to a number of non-profit organizations that support the needs of children, including: Team Jack Foundation, Omaha Children’s Hospital Foundation, Royal Family Kids, The Toy Bank, and many others. Karen has been married to her husband and business partner, Mark, since 1992, and lives in Elkhorn, Nebraska. Karen and Mark have three children, Adam, Makenzie, and Jenna. Scott Fangman Scott Fangman has 20+ years of industry experience and is the Director of Business Development at Wealth Enhancement Group where he leads outreach to RIAs across the US. He was most recently as the Business Development Officer – M&A for Advisor Seekers, leading their markets and sales team. Scott joined Wealth Enhancement Group because of the shared purpose, mission, and values. Scott previously held regional leadership roles at TD Ameritrade Institutional, where he was recognized multiple times for his accomplishments in surpassing company goals. A Nebraska native, Scott currently resides in Omaha, NE with his wife Anne and their 2 (teenage!) children. When not working, Scott enjoys hiking and reading. Scott also serves on the Board of Directors for the Team Jack Foundation raising funds and awareness for pediatric brain cancer research – his son is a survivor. Dr. Kari Galyen Dr. Kari is originally from Pierce, NE. She went to the University of Nebraska. Dr. Kari Galyen is a general practice family physician. Dr. Galyen and her husband, Dr. Jim Galyen, own and operate Sunny Meadow Medical Clinic in Norfolk, Nebraska. Originally from Pierce, NE, Dr. Galyen attended the University of Nebraska Medical Center where she received her medical doctor (MD) degree. She then completed a dual internal medicine/family practice residency in Omaha and Kearney, NE. Dr. Galyen is a strong advocate for increased funding for child brain cancer research and was a guest speaker at the 2013 Team Jack Foundation Gala. She has a strong commitment to helping improve treatment options and overall survivorship for children facing the disease. Dr. Galyen is married to Dr. Jim Galyen and together they live in Atkinson, NE with their four children, Ainsley, Brody, Blake and Luke. Brianna Hoffman Brianna Hoffman is a pharmacist at West Holt Medical Services in Atkinson, NE. She is also the Co-Founder and Board Chair of the Foundation. To contact: Brianna@TeamJackFoundation.org Kenneth Maxwell Kenneth Maxwell is the co-founder and Vice President of Advertising for Proxibid.com, a privately held Nebraska based e-commerce Company serving more than a million buyers, and thousands of businesses, auction companies, and non-profit organizations worldwide. In his tenure with the company he has led multiple teams responsible for the design and development of their real-time auction platform, and more recently, led the expansion of the company’s marketing team to provide advertising and creative services to Proxibid and their clients. Prior to Proxibid, Kenneth was the creative director for another Nebraska based startup – Leftbid.com, and was also a professional artist, selling original art through Anderson O’Brien Fine Art Gallery in Nebraska. Kenneth studied fine art at the University of Nebraska – Lincoln, and abroad in Florence, Italy. He is classically trained in painting and sculpture and graduated from UNL with a degree in Fine and Performing Arts. Ken resides in Omaha with his wife Lynn, and two children, Kate and Harrison – as well as two black Labrador retrievers, Cira and Chloe, AKA – “the meatballs”. Tiffany Miller Tiffany Miller serves as Deputy General Counsel for First Bank & Trust, Brookings, SD. She has practiced in the banking and financial services industry for over 16 years, specializing in contract negotiation and compliance. Outside of the office, Tiffany is involved in a number of community activities. She serves on the board of directors for Downtown Sioux Falls, Inc., and is on the Sioux Falls Area Chamber of Commerce Community Appeals Committee. Tiffany is motivated to serve the Foundation by the grueling and potentially harmful treatments currently used to treat pediatric brain cancer patients and the dire need for more funding to support pediatric cancer research. In honor of Jack and all children who are called to the front lines in the battle against cancer, Tiffany is committed to the Team Jack mission of raising awareness and funds for pediatric cancer research. She and her family are proud to Take A Stand in the fight against brain cancer together with the Team Jack Foundation. Tiffany and her husband, Dr. Nate Miller, are parents to two young boys, Noah and Luke. Janae Simard Janae Simard is a Registered Dental Hygienist with Family and Implant Dentistry in Lincoln, NE, since 1997. Janae is an originating member of the Team Jack Foundation board and is committed to helping the organization fund pediatric brain cancer research. She was appointed secretary for the Team Jack Foundation in 2013. Janae and her husband Robby live in Omaha, Nebraska with their two boys, Eli and Luke. The Simard family is dedicated to helping the Team Jack Foundation improve treatment for children with brain tumors. Having endured their own family adversity with one of their own children, Janae is a compassionate leader who is known for being a “hands on” servant leader for the Foundation. Janae is active in her childrens’ school and devotes much of her spare time working with children. She enjoys traveling, scuba-diving and family activities. Mark Walz Mark was born and raised in Lincoln, Nebraska. He graduated Summa Cum Laude from Nebraska Wesleyan University in 1988 with a Bachelor of Science Degree in Economics and an emphasis in Accounting. Mark began his professional career in 1988 as an independent auditor with the international accounting firm of Touche Ross & Co. (now Deloitte) in their Lincoln, Nebraska office. His client focus was primarily the banking and insurance industries. In May of 1991, Mark left Deloitte to become the Accounting Manager at Farmers Mutual Insurance Company of Nebraska and has been employed in various positions of increasing responsibility with Farmers Mutual since that time. He was promoted to Controller in 1997; Treasurer in 1999; Vice President and Treasurer in 2002; Senior Vice President, Treasurer and Chief Financial Officer in 2006; Executive Vice President, Treasurer and Chief Operating Officer in 2009; President, Treasurer and Chief Operating Officer in 2010; President and Chief Executive Officer in 2014; and Chairman, President and Chief Executive Officer in 2015. Mark is a member of both the American Institute of Certified Public Accountants and the Nebraska Society of Certified Public Accountants. Mark serves on the Board of Directors of Farmers Mutual Insurance Company of Nebraska, National Association of Mutual Insurance Companies, Nebraska Property and Liability Insurance Guaranty Association, Nebraska Chamber of Commerce, United Way, Team Jack, Junior Achievement, and the US Bank Advisory Board. *Andy Hoffman (Board Chairman 2013 - 2021) Courageous. Passionate. Gregarious. Brave. Selfless. Spiritual. Unwavering. These are just a few of the words used to describe our Team Jack Foundation co-founder, Andy Hoffman. Tributes have poured in from around the country following Andy’s passing on Monday, March 1. Andy was shockingly diagnosed with glioblastoma multiforme, a rare and very aggressive cancer, after having a seizure while running on the Cowboy Trail, in his hometown of Atkinson, Nebraska, in July 2020. Even after getting this devastating news, Andy was more determined than ever to find ways to raise money for Team Jack. And fast, while he was still able. Following his diagnosis, the Team Jack Foundation launched the “Twice the Fight” campaign as a way to show support for both Jack and Andy Hoffman’s brain cancer battles. One of Andy’s first visions to raise money for Team Jack was to sell t-shirts, and this time selling “Twice the Fight” t-shirts saw nearly 3,000 sold for over $65,000 raised. Earlier in 2020, Andy worked hard to fulfill his New Year’s resolution and finished writing his first book, “Yards After Contact” which details the family’s experience during Jack’s fight. It was published in October 2020 and has been a huge success. From the beginning, Andy made one thing clear with his book: 100% of the proceeds for the book sales go to Team Jack and, Team Jack would own the copyright to the book. To date, over 2,500 books have been sold, raising nearly $80,000 for Team Jack. In the book, Andy writes: “This book is the mission statement for the Team Jack Foundation, a Nebraska business that tirelessly works daily to improve brain cancer treatment in its region and nationally fund child brain cancer research. I hope you can open this book and know Jack and what his foundation stands for.” In early December, both ESPN and BigTen Networks produced shows giving an update on the Hoffmans’ life with cancer. The ESPN E:60 story aired as part of programming highlighting the importance of cancer research during ESPN’s 14th consecutive V Week on Dec.1-12. Andy spoke with Chris Connelly about his fight and his hopes for the future of those fighting childhood brain cancer. “This is going to sound screwy, but it’s been a blessing,” he said. “We’re supposed to thank God for the challenges that he gives us, and I’ve prayed the thank-you prayer. Thank you, God, for giving me brain cancer. Because he knows what he’s doing. And you don’t.” Check off another chance for Andy to raise awareness of this disease. Andy always looked to seize every opportunity to raise awareness for childhood brain cancer and fund research from some of the brightest research minds in the country. Although the Hoffmans knew the research they were funding may not benefit their son Jack, he did it for all the families down the road that will receive the horrible diagnosis of pediatric brain cancer. Andy remained hopeful even when faced with the grim nature of his prognosis. Andy worked hard to squeeze more life into his 42 years than most get in a lifetime. He did a couple of bucket list items, including a New Mexico elk hunt with his kids, his wife, and brothers during the last months of his life. He kept his unwavering faith and spent every moment possible with his family. In mid-February, his condition progressed, and his fight ended on Monday, March 1, where he peacefully passed away at home surrounded by his loving family. He is survived by his wife Brianna, children Jack, Ava and Reese, parents Gary and Karen Hoffman of Spencer, brothers Tony (Amy) Hoffman of Crofton and Michael (Jacky) Hoffman of Spencer, sister Julia (Chris) Jones of Tellico Plains, TN, parents-in-law Kerry and Bonnie Stiner of Burke, SD, sister-in-law Tiffany (Nate) Miller of Sioux Falls, SD, brother-in-law Kollin (Sarah) Stiner of Lakeville, MN, nephews Nathan Hoffman of Spencer, Hudson and Hayden Hoffman of Spencer, Luke Jones of Cleveland, OH, Matt and Nate Jones of Clarksburg, MD, Noah, Luke and Graham Miller of Sioux Falls, SD, and Karson Stiner of Lakeville, MN, nieces Alison (Justin) Wegenke of Fort Collins, CO, Samantha (Cody) Kahl of Grand Island, NE, Lauryn and Amelia Hoffman of Spencer, and Isabel and Nora Stiner of Lakeville, MN. He was also excited to be a Great Uncle to Will and Wren Wegenke and Alton Kahl. He was preceded in death by his brother Luke Hoffman. The Team Jack Foundation is committed to working harder than ever to ensure Andy’s legacy shines, and his mission grows. He had big ideas and big dreams for the foundation, and we will focus on making those a reality. He is irreplaceable and his smile and energy will be missed. But we will always follow the path he set to be a success. And fight on in his honor. How lucky we all are to have known him. * * Tragically, Jack’s dad, Andy Hoffman, was diagnosed with brain cancer (glioblastoma) in July of 2020. He battled for seven months before passing away from the disease. The Team Jack Foundation is committed to upholding Andy’s legacy by working harder than ever to fund the cure for childhood brain cancer. Team Jack Staff Team Jack’s caring, driven staff is dedicated to ending childhood brain cancer by pushing Team Jack forward every day. Kylie Dockter, Executive Director Kylie (Tielke) Dockter joined the Foundation in August 2013 as the first full time employee for the Foundation and is excited to be part of the fight against pediatric brain cancer. Kylie received her Bachelor of Science degree in Journalism: Public Relations in December 2009 from the University of Nebraska at Kearney with a minor in Political Science and has strong qualifications in management, marketing and sales through educational and job experience. She has been involved in the non-profit sector for over thirteen years. Prior to the Foundation, Kylie was the Director of Marketing and then Executive Director of a non-profit that benefits nearly 50 non-profits in the Denver, CO metro area. In addition to management skills, she assisted in planning large scale events to raise money for these 50 non-profits. She joined the Team Jack Foundation in August 2013 as the Chief Development Director and is now the Executive Director of the Foundation. Working with a Foundation that has such an impact on children and children’s lives has truly been a career dream for Kylie, so she is very excited to join such a prestigious and impactful Foundation to help with their goals. She was born and raised in Atkinson, NE and is married to her husband Stuart Dockter who is originally from North Dakota and together they have a daughter, Graesyn, and a son, Hayes. To contact: kylie@teamjackfoundation.org Lindsey Nemetz, Director of Marketing Lindsey (Mlnarik) Nemetz, a native of Clearwater, Nebraska, earned her degree in Business Administration from Nebraska Wesleyan University in 2001. While at NWU, she was a member of the Prairie Wolves women’s basketball and softball teams from 1997 to 2001. Lindsey now lives in Atkinson with her husband, Chris, and their five children: Maci, Drake, Avery, Landri, and Brooke. After a six-year career in property and casualty insurance, Lindsey shifted her focus to raising her family. In October 2013, she began working for the Team Jack Foundation on a limited part-time basis. Over time, her role and passion for the mission grew, leading her to become the Foundation’s Director of Marketing in November 2018. She is deeply dedicated to helping find a cure for childhood brain cancer. To contact: lindsey@teamjackfoundation.org Shirley Rossman, Event Coordinator Shirley Rossman joined the Team Jack Foundation in August 2020, assisting with donation processing and merchandise shipping. Before that, she spent her career as an elementary school teacher, retiring from West Holt Public Schools in 2020. A lifelong resident of Atkinson, Shirley and her husband, Bruce, are proud parents of four grown daughters which includes a set of triplets, and grandparents to ten grandchildren. To contact: shirley@teamjackfoundation.org Make an impact through your inbox News, upcoming events and research updates delivered straight to your inbox. About Us Our Mission Jack Hoffman Board & Staff Fund Allocation Financials Our Impact Scientific Advisory Board Sponsored Grants Research Articles Brain Cancer Family Resources Cancer Awareness Months Get Involved Fundraise Give Events Our Sponsors Volunteer Follow Follow Follow Follow Follow © 2025 Team Jack Foundation. POB 607, 47640 US Highway 20, STE 2, Atkinson, NE, 68713. All Rights Reserved. Team Jack Foundation, Inc. is exempt from federal income tax under section 501(c)3, ID Number 46-2301134, of the internal revenue code. All contributions to the Foundation are tax deductible. Privacy Policy • Contact"
    },
    {
      "url": "https://www.floridatheatre.com/connect/press-and-news",
      "text": "Press and News | Florida Theatre Skip to content Accessibility Buy Tickets Search Florida Theatre Close Search JOIN OUR E-CLUB Sign-In About History Staff Board of Directors Tech Specs FAQ'S Connect Join our E-Club Rental Information Contact Us Press and News Annual Report Employment Events & Tickets Events & Tickets Annual Fundraising Events Ovation Seating Chart Box Office Info Gift Cards Theatreworks Support Membership Become a Member Corporate Partnerships Centennial Campaign Planned Giving Volunteer Merch Donation - One-Time Adopt-A-Seat Bricks The Remedy Lounge Visit Parking & Transportation Accessibility FAQ's Seating Chart First Concert Certificate Close Search JOIN OUR E-CLUB Sign-In Home / Connect / Press and News Press and News FLORIDA THEATRE REQUEST FOR PROPOSALS (RFP) HISTORICAL THEATRE MARQUEE REPLACEMENT Click here for more information on the Request for Proposals for the above-mentioned project. FLUME DEMO & STAGE LEFT RENOVATIONS Click here for more information on the Request for Proposals for the above-mentioned project. FLORIDA THEATRE PRESS RELEASES September 2025 Show Press Releases Eddie Griffin At the Florida Theatre Date & Time - Sat. Sep 13, 2025 @ 7:00 PM Press Release Event Link Led Zeppelin – Led Zeppelin II Classic Albums Live - Summer Concert Series At the Florida Theatre Date & Time – Sun. Sep 14, 2025 @ 7:30 PM Press Release Event Link Avatar: The Last Airbender In Concert The 20th Anniversary Tour At the Florida Theatre Date & Time – Fri. Sep 19, 2025 @ 7:30 PM Press Release Event Link The Steely Dan Project At the Florida Theatre Date & Time – Sat. Sep 20, 2025 @ 8:00 PM Press Release Event Link POP 2000 Tour With Chris Kirkpatrick of *NSYNC, O-Town, BBMAK, Ryan Cabrera & LFO At the Florida Theatre Date & Time – Thu. Sep 25, 2025 @ 7:30 PM Press Release Event Link Nate Jackson At the Florida Theatre Date & Time – Fri. Sep 26, 2025 @ 7:30 PM Press Release Event Link Not Dead Yet! John Cleese and The Holy Grail/50 th Anniversary (Q&A with John Cleese on stage LIVE after the screening of “Monty Python and The Holy Grail”) At the Florida Theatre Date & Time - Sat. Sep 27, 2025 @ 7:00 PM Press Release Event Link Michael Carbonaro Lies On Stage At the Florida Theatre Date & Time – Sun. Sep 28, 2025 @ 7:00 PM Press Release Event Link October 2025 Show Press Releases Marc Broussard At the Florida Theatre Date & Time – Wed. Oct 1, 2025 @ 8:00 PM Press Release Event Link Blippi Join The Band Tour! At the Florida Theatre Date & Time – Fri. Oct 3, 2025 @ 6:00 PM Press Release Event Link Steep Canyon Rangers At the Ponte Vedra Concert Hall Date & Time – Fri. Oct 3, 2025 @ 7:30 PM Press Release Event Link Billy Bob Thornton and The Boxmasters At the Florida Theatre Date & Time – Sun. Oct 5, 2025 @ 7:00 PM Press Release Event Link Billy Goats Gruff (Theatreworks) At the Florida Theatre Date & Times - Mon. Oct 6, 2025 @ 10:00 AM & 11:45 AM Press Release Event Link The Psychology of Cults At the Florida Theatre Date & Time – Wed. Oct 8, 2025 @ 8:00 PM Press Release Event Link The Witcher In Concert At the Florida Theatre Date & Time – Thu. Oct 9, 2025 @ 7:30 PM Press Release Event Link Heather McMahan The Bamboozled Tour At the Florida Theatre Date & Time – Fri. Oct 10, 2025 @ 8:00 PM Press Release Event Link Trevor Wallace The Alpha Beta Male At the Florida Theatre Date & Time – Sat. Oct 11, 2025 @ 7:00 PM Press Release Event Link Colin Mochrie & Brad Sherwood Asking For Trouble At the Florida Theatre Date & Time – Sun. Oct 12, 2025 @ 7:00 PM Press Release Event Link The Vampire Circus At the Florida Theatre Date & Time – Tue. Oct 14, 2025 @ 7:30 PM Press Release Event Link Jesus \"Aguaje\" Ramos & The Buena Vista Orchestra At the Florida Theatre Date & Time – Wed. Oct 15, 2025 @ 8:00 PM Press Release Event Link Billy Joel Legends Live! The Lords of 52nd Street At the Florida Theatre Date & Time – Thu. Oct 16, 2025 @ 8:00 PM Press Release Event Link Sons of Mystro For Kids (Theatreworks) At the Florida Theatre Date & Time – Fri. Oct 17, 2025 @ 10:30 AM Press Release Event Link Sons Of Mystro At the Florida Theatre Date & Time – Fri. Oct 17, 2025 @ 7:00 PM Press Release Event Link Abducted by the 80's With Wang Chung, Men Without Hats, and Naked Eyes At the Florida Theatre Date & Time – Sun. Oct 19, 2025 @ 7:00 PM Press Release Event Link Johnnyswim | When the War is Over Tour Featuring SHUA At the Florida Theatre Date & Time – Tue. Oct 21, 2025 @ 7:30 PM Press Release Event Link Australia’s Thunder From Down Under Temptation Tour 2025 At the Florida Theatre Date & Time – Fri. Oct 24, 2025 @ 7:30 PM Event Link The Rocky Horror Picture Show Opening Act/Live Band – Julia Gulia Hosted By Karrissa Wade At the Florida Theatre Date & Time – Sat. Oct 25, 2025 @ 8:00 PM Press Release Event Link Science of Magic (Theatreworks) At the Florida Theatre Date & Times – Mon. Oct 27, 2025 @ 10:00 AM & 11:45 AM Press Release Event Link The Florida Ballet “Dracula” At the Florida Theatre Date & Time – Wed. Oct 29, 2025 @ 7:00 PM Press Release Event Link Brian Culbertson Day Trip Tour At the Florida Theatre Date & Time – Fri. Oct 31, 2025 @ 8:00 PM Press Release Event Link November 2025 Show Press Releases Strangelove The Depeche Mode Experience At the Florida Theatre Date & Time – Tue. Nov 4, 2025 @ 8:00 PM Press Release Event Link Blank Space The Unofficial Taylor Swift Tribute At the Florida Theatre Date & Time – Wed. Nov 5, 2025 @ 7:30 PM Press Release Event Link Hotel California A Salute To The Eagles At the Florida Theatre Date & Time – Thu. Nov 6, 2025 @ 8:00 PM Press Release Event Link Josh Johnson The Flowers Tour At the Florida Theatre Date & Time - Fri. Nov 7, 2025 @ 7:00 PM Press Release Event Link Stephen Wilson Jr. SØN OF DAD TOUR 2025 At the Florida Theatre Date & Time – Sat. Nov 8, 2025 @ 8:00 PM Press Release Event Link Stardew Valley Symphony of Seasons At the Florida Theatre Date & Time – Sun. Nov 9, 2025 @ 7:00 PM Press Release Event Link NUTCRACKER! Magical Christmas Ballet At the Florida Theatre Date & Time – Thu. Nov 13, 2025 @ 7:00 PM Press Release Event Link Jake Shimabukuro At the WJCT Soundstage Date & Time – Fri. Nov 14, 2025 @ 7:30 PM Press Release Event Link Gabriel Rutledge At the Ponte Vedra Concert Hall Date & Time – Fri. Nov 14, 2025 @ 7:30 PM Press Release Event Link An Evening with Emerson, Lake & Palmer At the Florida Theatre Date & Time – Fri. Nov 14, 2025 @ 8:00 PM Press Release Event Link George Janko Man On Water Tour At the Florida Theatre Date & Time – Sat. Nov 15, 2025 @ 7:00 PM Press Release Event Link Trey Kennedy At the Florida Theatre Date & Time - Sun. Nov 16, 2025 @ 7:00 PM Press Release Event Link The Life & Music of George Michael At the Florida Theatre Date & Time – Tue. Nov 18, 2025 @ 7:30 PM Press Release Event Link Crystal Gayle At the Ponte Vedra Concert Hall Date & Time - Tue. Nov 18, 2025 @ 7:30 PM Press Release Event Link Blackberry Smoke Rattle, Ramble and Roll Tour 2025 At the Florida Theatre Date & Time – Wed. Nov 19, 2025 @ 8:00 PM Press Release Event Link Rain A Beatles Christmas Tribute At the Florida Theatre Date & Time – Thu. Nov 20, 2025 @ 7:30 PM Press Release Event Link Floyd Nation At the Florida Theatre Date & Time – Fri. Nov 21, 2025 @ 8:00 PM Press Release Event Link Kings of the South Featuring Paul Wall & Ying Yang Twins At the Florida Theatre Date & Time - Sat. Nov 22, 2025 @ 8:00 PM Press Release Event Link Michael Blaustein At the Florida Theatre Date & Time – Sun. Nov 23, 2025 @ 7:00 PM Press Release Event Link Moana Live-To-Film Concert At the Florida Theatre Date & Time – Wed. Nov 26, 2025 @ 6:00 PM Press Release Event Link An Evening With Peter Billingsley Following A Screening of “A Christmas Story” At the Florida Theatre Date & Time – Fri. Nov 28, 2025 @ 7:30 PM Press Release Event Link 112 Room 112 Tour At the Florida Theatre Date & Time – Sat. Nov 29, 2025 @ 8:00 PM Press Release Event Link Chris D’Elia Straight Outta The Multiverse At the Florida Theatre Date & Time – Sun. Nov 30, 2025 @ 7:00 PM Press Release Event Link December 2025 Show Press Releases A Nostalgic Night with Macaulay Culkin Following a 35th Anniversary Screening of Home Alone At the Florida Theatre Date & Time – Wed. Dec 3, 2025 @ 7:00 PM Press Release Event Link Bill Murray & His Blood Brothers At the Florida Theatre Date & Time – Thu. Dec 4, 2025 @ 8:00 PM Press Release Event Link Micky Dolenz Of The Monkees At the Florida Theatre Date & Time – Fri. Dec 5, 2025 @ 7:30 PM Press Release Event Link Nurse Blake At the Florida Theatre Date & Time – Sat. Dec 6, 2025 @ 7:00 PM Press Release Event Link Lady A At the Florida Theatre Date & Time – Sun. Dec 7, 2025 @ 7:00 PM Press Release Event Link The 34 th Annual Community Nutcracker At the Florida Theatre Date & Time – Fri. Dec 12, 2025 @ 7:30 PM, Sat. Dec 13, 2025 @ 1:00 PM, Sat. Dec 13, 2025 @ 7:30 PM Press Release Event Link The Fab Four Tribute To The Beatles' \"Help!\" And The Hits At the Florida Theatre Date & Time - Sun. Dec 14, 2025 @ 7:30 PM Press Release Event Link A Peter White Christmas With Mindi Abair and Vincent Ingala At the Ponte Vedra Concert Hall Date & Time – Mon. Dec 15, 2025 @ 8:00 PM Press Release Event Link Vienna Light Orchestra Christmas Tour 2025 At the Florida Theatre Date & Times – Tue. Dec 16, 2025 @ 3:00 PM and 7:00 PM Press Release Event Link Michael W. Smith At the Florida Theatre Date & Time – Wed. Dec 17, 2025 @ 7:30 PM Press Release Event Link Wheel of Fortune LIVE! At the Florida Theatre Date & Time – Fri. Dec 19, 2025 @ 7:30 PM Press Release Event Link Justin Willman One For The Ages Tour At the Florida Theatre Date & Time – Sat. Dec 20, 2025 @ 7:00 PM Press Release Event Link Charles Dickens' “A Christmas Carol” At the Florida Theatre Date & Time – Sun. Dec 21, 2025 @ 7:00 PM Press Release Event Link Cirque Musica Holiday Wonderland At the Florida Theatre Date & Time – Mon. Dec 22, 2025 @ 7:00 PM Press Release Event Link Gary Owen At the Florida Theatre Date & Time – Sat. Dec 27, 2025 @ 8:00 PM Press Release Event Link Brad Williams The Growth Spurt Tour At the Florida Theatre Date & Time – Wed. Dec 31, 2025 @ 9:00 PM Press Release Event Link January 2026 Show Press Releases MANIA:  The ABBA Tribute At the Florida Theatre Date & Time – Tue. Jan 13, 2026 @ 8:00 PM Press Release Event Link Herb Alpert & The Tijuana Brass & Other Delights At the Florida Theatre Date & Time – Wed. Jan 14, 2026 @ 7:30 PM Press Release Event Link Tango After Dark At the Florida Theatre Date & Time – January 15, 2026 @ 8:00 PM Press Release Event Link Benise & Pavlo: Guitar By Candlelight At the WJCT Soundstage Date & Time – Thu. Jan 15, 2026 @ 7:00 PM Press Release Event Link Jesse Cook At the WJCT Soundstage Date & Time – Fri. Jan 23, 2026 @ 7:30 PM Press Release Event Link An Evening With Itzhak Perlman At the Florida Theatre Date & Time – Mon. Jan 26, 2026 @ 8:00 PM Press Release Event Link Geoff Tate’s Operation: Mindcrime – The Final Chapter Tour At the Florida Theatre Date & Time – January 28, 2026 @ 8:00 PM Press Release Event Link Yellow Brick Road: A Tribute to Elton John At the Florida Theatre Date & Time – Fri. Jan 30, 2026 @ 8:00 PM Press Release Event Link The Radiohead Trip Laser Spectacular At the Florida Theatre Date & Time – Sat. Jan 31, 2026 @ 8:00 PM Press Release Event Link February 2026 Show Press Releases Mutts Gone Nuts At the Florida Theatre Date & Time – Sun. Feb 1, 2026 @ 2:00 PM Press Release Event Link The Choir of Man At the Florida Theatre Date & Time – Thu. Feb 5, 2026 @ 7:30 PM Press Release Event Link A1A – The Official & Original Jimmy Buffett Tribute Show At the Florida Theatre Date & Time – February 6, 2026 @ 8:00 PM Press Release Event Link Drew and Ellie Holcomb Never Gonna Let You Go Tour At the Florida Theatre Date & Time – Wed. Feb 11, 2026 @ 7:30 PM Press Release Event Link Cirque FLIP Fabrique Blizzard At the Florida Theatre Date & Time – Wed. Feb 18, 2026 @ 7:30 PM Press Release Event Link Chris Botti At the Florida Theatre Date & Time – Sun. Feb 22, 2026 @ 7:00 PM Press Release Event Link Rioult Dance The Ravel Dances At the Florida Theatre Date & Time - Tue. Feb 24, 2026 @ 7:30 PM Press Release Event Link Neil Diamond Celebration: I Am… He Said With Special Guests RITZ VOICES At the Florida Theatre Date & Time – Thu. Feb 26, 2026 @ 7:30 PM Press Release Event Link Pink Martini At the Florida Theatre Date & Time – Fri. Feb 27, 2026 @ 8:00 PM Press Release Event Link MJ LIVE – Michael Jackson Tribute Concert At the Florida Theatre Date & Time - Sat. Feb 28, 2026 @ 7:30 PM Press Release Event Link March 2026 Show Press Releases TUSK The Classic Tribute Of Fleetwood Mac At the Florida Theatre Date & Time – Fri. Mar 6, 2026 @ 8:00 PM Press Release Event Link Get The Led Out A Celebration of “The Mighty Zep” At the Florida Theatre Date & Time – Sun. Mar 8, 2026 @ 7:00 PM Press Release Event Link RENT - In Concert 30th Anniversary At the Florida Theatre Date & Time – Tue. Mar 10, 2026 @ 7:30 PM Press Release Event Link The Bronx Wanderers At the Florida Theatre Date & Time – Wed. Mar 11, 2026 @ 7:30 PM Press Release Event Link The Orchestra Starring former members of the Electric Light Orchestra (ELO) With the Jacksonville Rock Orchestra At the Florida Theatre Date & Time – Wed. Mar 18, 2026 @ 8:00 PM Press Release Event Link Whose Live Anyway? With Ryan Stiles, Greg Proops, Jeff B. Davis, and Joel Murray At the Florida Theatre Date & Time – Thu. Mar 19, 2026 @ 7:30 PM Press Release Event Link Hannah Berner At the Florida Theatre Date & Time – Fri. Mar 20, 2026 @ 7:30 PM Press Release Event Link Masters of Illusion At the Florida Theatre Date & Time – Sun. Mar 22, 2026 @ 7:30 PM Press Release Event Link Forever Donna The Ultimate Donna Summer Tribute Featuring Rainere Martin At the Florida Theatre Date & Time – Fri. Mar 27, 2026 @ 8:00 PM Press Release Event Link April 2026 Show Press Releases Leonid & Friends At the Florida Theatre Date & Time – Mon. Apr 6, 2026 @ 8:00 PM Press Release Event Link Peppa Pig My First Concert At the Florida Theatre Date & Time – Thu. Apr 16, 2026 @ 6:00 PM Press Release Event Link The Rush Tribute Project At the Florida Theatre Date & Time – Tue. Apr 21, 2026 @ 7:30 PM Press Release Event Link One Night of Queen: Performed by Gary Mullen & The Works At the Florida Theatre Date & Time – Wed. Apr 29, 2026 @ 8:00 PM Press Release Event Link Florida Theatre News Press Releases Florida Theatre is the 5 th most attended theatre in the world and the #1 most attended concert venue in Jacksonville! Press Release & Photos Photo Credit - Justin Drain 7 th Annual Holiday Movie & Food Drive at the Florida Theatre benefitting Feeding Northeast Florida on December 18 th Press Release Florida Theatre welcomes new board member Priyanka Murthy Press Release & Photos A Message from the Florida Theatre about Ticket Brokers: www.floridatheatre.com is the Only Authorized Website and Ticket Seller for the Florida Theatre! Press Release & Photo Orlando Resident Wins Coveted Florida Theatre Annual Ticket Drawing in Jacksonville Press Release & Photo Jamie Kent, Programming Manager of Theatreworks at the Florida Theatre, wins the 2023 Excellence in Arts Education Award from the Florida Alliance for Arts Education Press Release & Photo Auld & White Constructors Receives An Associated Builders & Contractors Excellence In Construction Award For The Second-Floor Members’ Lounge At The Florida Theatre Press Release & Photos Florida Theatre Wins CREW Jax Impact Award Press Release The Red Velvet Curtain From The Historic Florida Theatre Lives On Through Pine Castle And At Hardwicks Press Release The Florida Theatre Announces Distinguished Committee Chairs & Members For The Florida Theatre Ball In 2024 Press Release The Florida Theatre Announces Changes To Their 2023 Board Of Directors Press Release Florida Theatre's Attendance Ranks #4 In The Nation for 2023 Press Release Florida Theatre Issues Annual Report For Fiscal 2023: A Monumental Year Of Shows And Ren\"ovation\" Press Release The Florida Theatre Ball:  Vegas-Style Saturday, May 18 th at the Florida Theatre Press Release Florida Theatre and Duval County Public Schools to host three, free, private sensory-friendly Theatreworks shows for students on the ASD spectrum in April of 2024 Press Release Get Married by Elvis or Renew Your Vows at the Florida Theatre Ball – Vegas Style! Press Release Florida Theatre Announces The 2024-2025 Theatreworks Season Press Release The Florida Theatre Ball:  Vegas-Style, Presented By DEX Imaging Raises Over $200,000 For The Historic Venue Press Release WJCT Public Media Shares New Season of Hit Podcast: Untold Stories Returns This Summer for Another Season of Audio Storytelling Press Release The Florida Theatre Welcomes Two New Board Members Press Release & Photos Florida Theatre Adds New Show To The 2024-2025 Theatreworks Season Press Release Florida Theatre & Theatreworks Are Celebrating National Arts In Education Week September 9-13, 2024 Press Release Annual Florida Theatre Ticket Drawing Starts September 13, 2024 Get Yours Today For A Chance To Win Exclusive Show Tickets Press Release 11th Annual Blues, Brews, Bourbon & BBQ Raises Over $47,000 For The Historic Florida Theatre! Press Release 2024 Board of Director Updates at the Florida Theatre Press Release The Florida Theatre’s Haunted History Fact Sheet Florida Theatre Is The #1 Most-Attended Live Performance Venue In The Region! Press Release Jacksonville Resident Wins Coveted Florida Theatre Annual Ticket Drawing Press Release Florida Theatre Wins Three “Folio Best of Jax Awards” For 2024! Press Release Florida Theatre Issues Annual Report For Fiscal 2024:  “In The Groove” Press Release Board of Directors Update at the Florida Theatre Press Release Just Announced!  David Benfield, Co-Host of First Coast Living, to be the MC/Auctioneer of The Florida Theatre Ball: 90’s Style on Saturday, May 17 th Press Release The Florida Theatre Ball: 90’s Style Raises More Than $230,000! Press Release Florida Theatre Announces The 2025-2026 Theatreworks Season Press Release Save The Date/August 21st/Blues, Brews, Bourbon & BBQ/Support The Florida Theatre/Tickets On Sale Now! Press Release Pollstar mid-year numbers are out:  Florida Theatre is still the most-attended venue of any size in the region! Press Release Florida Theatre wins prestigious \"Outstanding Historic Theatre Award\" from the League of Historic American Theatres! Press Release The annual Florida Theatre ticket drawing starts! Only 1,500 drawing tickets will be sold! Press Release 12 th Annual Blues, Brews, Bourbon & BBQ raises over $50,000 for the historic Florida Theatre! Press Release & Photos Corporate Partner Press Releases Florida Theatre announces a new corporate partner:  First Horizon Press Release & Photos Florida Theatre Announces A New Corporate Partner:  The Haskell Company Press Release Florida Blue Continues 17-year Partnership with Historic Florida Theatre Press Release Liberty Landscape Supply Renews Their Corporate Partnership With The Florida Theatre Press Release Florida Theatre Announces A New Corporate Partner:  Remedy Staffing Press Release Florida Theatre Announces A New Corporate Partner:  Wingard Press Release Florida Theatre Announces A New Corporate Partner:  Jon Smith Subs Press Release Citi Continues 27-Year Partnership With Florida Theatre And Theatreworks Press Release Florida Theatre Announces A New Corporate Partner:  JEA Press Release Bono’s Pit BAR-B-Q Continues Partnership With Historic Florida Theatre Press Release Florida Blue Continues 18-Year Partnership With Historic Florida Theatre Press Release Ameris Bank Continues Partnership With Historic Florida Theatre Press Release Florida Theatre Announces A New Corporate Partner:  Ammerman Wealth Management Press Release Florida Theatre Announces A New Corporate Partner:  Westminster Teak Press Release Liberty Landscape Supply Continues Five-Year Corporate Partnership With The Historic Florida Theatre Press Release & Video Citi Continues 29-Year Partnership With Florida Theatre And Theatreworks Press Release & Video Remedy Lounge Press Release FOR IMMEDIATE RELEASE January 25, 2023 MEDIA CONTACT: Beth Carper, Press & Media Relations Manager beth@floridatheatre.com / (904) 562-5988 FLORIDA THEATRE ANNOUNCES NEW VIP MEMBER LOUNGE, FIRST EXPANSION OF THE THEATRE’S PUBLIC SPACE IN 95 YEARS, CONTINUATION OF $10 MILLION CAPITAL IMPROVEMENT PLAN, REMEDY STAFFING IS THE NAMING RIGHTS PARTNER The historic Florida Theatre in downtown Jacksonville, FL will officially unveil its newest amenity, a brand new 3,000 square foot lounge for its donors and supporters, on Monday, February 13, 2023. Mayor Lenny Curry and other dignitaries will participate in a ribbon cutting at 5:30 p.m. It is the first expansion of the venue’s public space in its 95-year history ( click here for images ). The Florida Theatre also announced Remedy Staffing as the naming rights partner for the new member lounge. The member lounge will formally be known as the “Remedy Lounge.” The Remedy Lounge was constructed by repurposing the formerly vacant second floor of the Florida Theatre Office Building. Connecting the Theatre to the office building and repurposing the space as a revenue generating amenity for supporters was the brainchild of Florida Theatre President Numa Saisselin. “We all know the Florida Theatre as a great place to see great performances, but we also know it’s aging. We want our artists and audiences to walk out saying, ‘Wow, everything about that experience was first class.’ The Remedy Lounge goes a long way to achieving that goal in the front-of-house area.” The Remedy Lounge will serve the Florida Theatre’s more than 1,300 individual members and Corporate Partners, who make an annual contribution in support of the nonprofit historic theatre and its programming. Individual membership starts at $250 a year, and anyone can become a Florida Theatre member at any time on the Theatre’s website: www.floridatheatre.com . Access to the Remedy Lounge will be from the second-floor lobby of the Theatre, adjacent to the existing men’s room. The men’s room entrance has been relocated, creating a clear path to the Remedy Lounge entrance through the existing vestibule. Within the Remedy Lounge, donors and supporters will find an array of amenities including: A 25-foot-long bar, with a backlit Onyx façade and three bartending positions. Two new single-fixture women’s rooms. A new three-fixture men’s room. Flat screen TVs with closed circuit coverage of the stage. A display of autographed headshots of performers who have appeared at the Theatre. A display of Florida Theatre memorabilia. A custom donor wall acknowledging donations to the Theatre’s capital campaign. A full bar, with premium wines and liquors unavailable at the lobby bars. A bar menu that showcases the Northeast Florida brewing and distilling industries, with an emphasis on locally brewed beverages, such as Manifest distillery and breweries like Intuition, Aardwolf, Ruby Beach and Veterans United. The Remedy Lounge accommodates over 300 people standing, and can also be reconfigured to accommodate 150 people seated at tables, enabling the Theatre to utilize the lounge as an alternate performance space on nights that the Theatre itself is dark. The Remedy Lounge will also be rentable for business, civic and private events. With the opening of the Remedy Lounge, the third-floor space that has been serving as the theatre’s Donor Lounge for the last 10 years will be returned to public use, providing Florida Theatre customers access to a balcony level bar and balcony level bathrooms. Simultaneous to construction of the Remedy Lounge, a storage room on the second floor has been repurposed as a brand-new men’s room. Says Numa Saisselin, “In addition to introducing the Remedy Lounge, putting a bar and two restrooms back in service for the public will shorten the lines throughout the building, which is a win for everyone.” The Remedy Lounge was designed by KBJ Architects, and constructed by Auld & White Constructors, with oversight on behalf of the Florida Theatre by Clark Advisory Services. Construction of the Remedy Lounge is the third step in a multi-year capital improvement plan expected to cost $20 million. Some of that work is already complete. In 202o, the Theatre replaced all of its fixed seating with new historically-appropriate seats, doubled its accessible seating, replaced its assistive listening system, and purchased and installed a new concert sound system. In 2021, the Theatre purchased and installed a new stage lighting system. The Remedy Lounge is Phase 3, and the fourth phase comes in the summer of 2023, when the Theatre will close for four months to repair the decorative plaster and paint the lobbies and auditorium; replace the heating, ventilation and air conditioning system; refurbish all of the existing public bathrooms; and move the electrical vault for the building to a higher floor. Further improvements include connecting the street level lobby spaces, restoring the marquee, and the improving the backstage dressing rooms and green room. “The Florida Theatre was not designed for enjoying live shows and musical acts.  It was designed 95 years ago for movies.  We want to make the building functionally better for the way we use it today by improving the lobbies, lounge and bar areas and restrooms with 50-year solutions so we can be financially solvent for the next 100 years,” said Ed White of Auld & White Constructors, who is also a Florida Theatre Board Member. Improving the historic Florida Theatre has been a goal of the nonprofit organization’s Board of Directors. Says Board Chairperson Leslie Gordon, “The Theatre’s 100th anniversary is coming in 2027. Our capital improvement plan is about making the Florida Theatre experience better, and making the Theatre’s finances sustainable for another 100 years. In addition to improving the customer experience, the financial impact of introducing a new lounge and returning the third-floor bar to the public strengthens the Florida Theatre’s fiscal sustainability.” Brian Rose, the owner of Remedy says, “Live theatre is important because there is nothing like it. Joining people together, often shoulder to shoulder, from so many different walks of life enjoying live theatre encourages freedom of thinking, empathy for different points of view, and above all, a place to gather and often let your mind wonder. As Remedy celebrates 30 years in Jacksonville, we believe it is vital as a major employer in the community to support the renovation project currently underway at the Florida Theatre. The Theatre touches so many of us in the community and serves an essential purpose in our vibrant and energetic downtown. We are excited to welcome you to the Remedy Lounge and encourage you to enjoy what the Florida Theatre has to offer our great city.” The Florida Theatre’s capital improvement plan has been funded by private donations, a restoration fee assessed on all ticket sales, and a matching grant from the City of Jacksonville’s capital improvement budget. Says Saisselin, “We are fortunate to have a Mayor and a City Council that know that partnering with arts and cultural organizations is good for our quality of life, and good for our economy.” In a typical year the Florida Theatre generates a $14 million impact for the City, including $10 million of household income supporting the full-time equivalent of over 400 jobs. “For almost 100 years, the Florida Theatre has been at the heart of our modern arts scene in Downtown Jacksonville,” said Mayor Lenny Curry.  “I am excited to see this expansion come to life and look forward to sharing this new experience with our residents and visitors.” About the Florida Theatre There is something for everyone at the Florida Theatre.  From pop, jazz, rock, comedy, country and blues to ballet and opera, the historic Florida Theatre offers over 150 cultural and entertainment events annually for every taste and age.  For tickets, or to learn more about our educational performances for schools, rentals, membership or the nonprofit corporation that manages this majestic place, please visit us at www.floridatheatre.com . About Remedy Staffing Remedy Intelligent Staffing is a nationwide professional staffing organization with over 50 years of recruiting and selection expertise to match job candidates with positions where they will succeed.  As the franchise division of Employbridge, the nation's largest industrial staffing company with over 400 locations, we are a national leader in workforce management solutions. The recruiters in our locally owned and managed Remedy offices are experts in matching what you do best with what our client company’s value most. A great job for you, a productive employee for our clients. We're dedicated to getting good people good jobs. We have short-term and long-term temporary staffing assignments available along with opportunities for permanent hire. If you're seeking light industrial, clerical, skilled or professional jobs or staff, we have the expertise to assist you. Please check out your local Remedy office for further details.  For more info, visit https://www.remedystaffing.com/ . About Community First Credit Union Since 1935, the story of Community First has unfolded from launching in a high school basement as the Duval County Teachers Credit Union to a 19-branch, 153,000 plus - member financial institution open to anyone who lives, works, or attends school in one of the following counties: Baker, Brevard, Broward, Clay, Duval, Flagler, Indian River, Lake, Martin, Nassau, Orange, Palm Beach, Putnam, Seminole, St. Johns, St. Lucie, or Volusia. Membership is also open to any relative of an existing or eligible Community First Credit Union of Florida member. In addition, Community First offers membership to Select Employer Groups, including all employees of Brooks Rehabilitation, Miller Electric Company, and Web.com. See more info at www.communityfirstfl.org . ### The Florida Theatre Was Nominated For Theater Of The Year By The Academy Of Country Music FOR IMMEDIATE RELEASE MEDIA CONTACT: Beth Carper, Press & Media Relations Manager Florida Theatre (904) 562-5988 / beth@floridatheatre.com THE FLORIDA THEATRE WAS NOMINATED FOR THEATER OF THE YEAR BY THE ACADEMY OF COUNTRY MUSIC JACKSONVILLE, FL, April 14, 2023 – The 58th Academy of Country Music Awards nominations have been announced, and the Florida Theatre has been nominated for Theater of the Year.  Hosted by Dolly Parton and Garth Brooks, the ACM Awards will stream live on Prime Video on Thursday, May 11 th at 8 p.m. from the Ford Center at The Star in Frisco, Texas. Theater of the Year nominees includes Crystal Grand Music Theatre - Wisconsin Dells, WI, Florida Theatre - Jacksonville, FL, Grand Ole Opry - Nashville, TN, Orpheum Theater - Omaha, NE and Stiefel Theatre - Salina, KS. Northeast Florida garnered two venue nominations.  The St. Augustine Amphitheatre was nominated in the Outdoor Venue of the Year category.  Outdoor Venue of the Year nominees includes Bank of NH Pavilion - Gilford, NH, FirstBank Amphitheater - Franklin, TN, Greek Theatre - Los Angeles, CA, Santa Barbara Bowl - Santa Barbara, CA, St. Augustine Amphitheatre - St. Augustine, FL and The Wharf Amphitheater - Orange Beach, AL. Awards are voted on by Academy of Country Music members, which boasts a record-high membership this year of nearly 5,000 members and serves as a powerhouse advocate for Country fans, artists, and all facets of the business. Established in 1966, the Academy of Country Music Awards is the longest-running country music awards show and made history in 2022 as the first major awards ceremony to exclusively live stream in partnership with Prime Video. This year’s show marks its return to Texas since the landmark 50th ACM Awards, which broke a Guinness World Record in 2015 for being the most-attended awards show with more than 70,000 attendees at AT&T Stadium in Arlington, Texas. The 58th Academy of Country Music Awards is produced by Dick Clark Productions, with Raj Kapoor, Barry Adelman, and Fonda Anita serving as executive producers and Damon Whiteside serving as executive producer for the Academy of Country Music.  Patrick Menton is the co-executive producer. Follow the Academy of Country Music on Facebook , Twitter , Instagram , and TikTok , join the conversation with #ACMawards, and sign up for the FREE ACM A-List for the latest news + updates in your email inbox. About the Florida Theatre There is something for everyone at the Florida Theatre.  From pop, jazz, rock, comedy, country, and blues to ballet, the historic Florida Theatre annually offers over 150 cultural and entertainment events for every taste and age.  For tickets or to learn more about our educational performances for schools, rentals, membership, or the nonprofit corporation that manages this majestic place, please visit us at www.floridatheatre.com . About the Academy of Country Music Founded in Southern California in 1964 as a regional trade organization, the ACADEMY OF COUNTRY MUSIC (ACM) has grown in almost 60 years since into a leading association for the country music industry. Now headquartered in Nashville, TN, and boasting record-high membership of nearly 5,000 nationwide, the Academy serves as a powerhouse advocate for country fans, artists, and all facets of the business, as well as a supporter of philanthropic work through charitable partner ACM LIFTING LIVES, dedicated to improving lives through the power of music and providing aid in times of need, with a focus on health initiatives. 2023 looks to be another monumental year for the Academy, with the ACM Awards returning to Texas on May 11 and streaming live for a global audience on Prime Video. Still, the only major awards show to live stream. The Academy also remains relentlessly committed to creating a more inclusive environment for underrepresented groups in country music, from the boardroom to the stage, and over the last year, has launched both ACM LEVel Up, a two-year professional development and enrichment curriculum for rising leaders, and OnRamp, a guaranteed income program for Black members of the Nashville music community, in partnership with the Black Music Action Coalition. For more information, log onto ACMcountry.com or ACMLiftingLives.org . ### A Collaboration Between Community Organizations Provides New Access to Arts FOR IMMEDIATE RELEASE MEDIA CONTACT: Beth Carper, Press & Media Relations Manager Florida Theatre (904) 562-5988 / beth@floridatheatre.com Thousands of Elementary School Students Participate in Pilot Field Trip Initiative A Collaboration Between Community Organizations Provides New Access to Arts JACKSONVILLE, Fla. – June 12, 2023 – The Cathedral Arts Project (CAP), in partnership with Kids Hope Alliance (KHA), the Florida Theatre, Duval County Public Schools (DCPS), and the John F. Kennedy Center for the Performing Arts, announced today the launch of a pilot collaborative field trip program for elementary school students. On June 20, 2023, approximately 3,400 elementary school students from both public and charter schools are invited to attend a live performance at the historic Florida Theatre. The effort is meant to increase student interest and access to the arts. “The very first step in improving access to arts education is piquing students’ interest in the arts,” said Kimberly L. Hyatt, CAP president & CEO. “We are excited to implement this research-backed initiative with a group of community partners who share CAP’s vision for Northeast Florida to lead the nation in providing essential and accessible arts education.” CAP's Landscape of Education in the Arts in Duval (LEAD) survey data shows the main priority in service of improving access to arts education for Jacksonville's children is implementing a field trip initiative for all elementary school students. Through CAP’s work with the University of North Florida’s Data Science for Social Good program, data showed that even one field trip experience to a cultural destination like a museum or theatre drastically improves student grades in literacy, math, and science. The students will attend the show Doug Berky’s Gems: The World’s Wisdom Stories . The performance will introduce attendees to fables from cultures across the globe and will include a literacy component. DCPS summer learning packets will be distributed to students attending the event, including reading materials to enhance the field trip experience. “School field trips are not just play-time out of the classroom; they’re an opportunity to take what was learned in the classroom and see it brought to life in the real world,” said Numa Saisselin, president of the Florida Theatre. “That is especially true in a theatre setting. Whether it’s watching an acrobat apply the laws of science or a theatrical adaptation of a story told in a book, the impact on a student’s academic success is profound.” Funding for this initiative is provided by PNC Foundation and Rice Family Foundation. In addition, KHA and DCPS will provide bus transportation for all participants. “Exposing youth to the arts encourages creativity, opens pathways to expression and introduces a world beyond limitations,\" said Kenneth Darity, chief programs officer with the Kids Hope Alliance. ### About the Cathedral Arts Project: The Cathedral Arts Project (CAP) is a nationally recognized nonprofit provider of quality visual and performing arts instruction for school-aged children in Northeast Florida. CAP’s mission is to empower every child’s creative spirit, elevate arts educators in their field and advocate for access and equity in arts education. Learn more at capkids.org. About the Florida Theatre: There is something for everyone at the Florida Theatre.  From pop, jazz, rock, comedy, country, and blues to ballet, the historic Florida Theatre annually offers over 150 cultural and entertainment events for every taste and age.  For tickets or to learn more about our educational performances for schools, rentals, membership, or the nonprofit corporation that manages this majestic place, please visit us at www.floridatheatre.com . About Kids Hope Alliance: With the vision that every child and youth will reach their academic, career, and civic potential, Kids Hope Alliance: The Jacksonville Partnership for Children, Youth, and Families (KHA), a fiscal agency of the City of Jacksonville, is responsible for overseeing the implementation and management of children and youth programs, services, and activities, accomplished through third-party service providers. For more information, please visit www.kidshopealliance.org . About PNC Foundation: The PNC Foundation, which receives its principal funding from The PNC Financial Services Group ( www.pnc.com ), actively supports organizations that provide services for the benefit of communities in which it has a significant presence. The foundation focuses its philanthropic mission on early childhood education and community and economic development, which includes the arts and culture. Through PNC Grow Up Great®, its signature cause that began in 2004, PNC has created a bilingual $500 million, multi-year initiative to help prepare children from birth to age 5 for success in school and life. The Historic, Nonprofit Florida Theatre Will Undergo A Historic Renovation This Summer FOR IMMEDIATE RELEASE MEDIA CONTACT: Beth Carper, Press & Media Relations Manager Florida Theatre (904) 562-5988 / beth@floridaTheatre.com THE HISTORIC, NONPROFIT FLORIDA THEATRE WILL UNDERGO A HISTORIC RENOVATION THIS SUMMER JACKSONVILLE, FL, June 30, 2023 - The Florida Theatre will be closed from July to October of this year for the next round of renovations in its Centennial Campaign, which started in 2019.  The Centennial Campaign was launched to prepare the historic theatre for its 100 th anniversary in 2027. During the closure, the Florida Theatre will repair all the flaking and peeling decorative plaster in the auditorium, paint the lobbies and the auditorium with fidelity to the 1927 color palette, replace the entire heating, ventilation, and air conditioning system, move the building’s electrical vault from the first to the third floor and update all the public restrooms. These projects build upon projects that have already been accomplished at the Florida Theatre, which include replacing the Theatre’s 1,865 fixed seats, doubling the wheelchair seating capacity, installing a new assistive listening system for the hard of hearing, improving aisle lighting and handrails, especially in the balcony, installing a new concert sound system and lighting system and repurposing the second floor of the office building into the new Remedy Lounge; which was the first expansion of the venue’s public space in 95 years. Auld and White is the general contractor for the project, and Sauer is doing the HVAC work.  Clark Advisory Services is the Theatre’s representative, and the plaster/paint work is being done by EverGreene Studios, who drilled core samples to match the original color(s) of the Theatre. Saul Lucio, who has been the Technical Director of the Florida Theatre for 40 years, said this is the most extensive work he has seen done at the Theatre (except the Remedy Lounge) since it reopened almost 40 years ago in 1983.  “We have replaced the A/C and have painted the place before – but we have never done it all at once.  This will be a huge undertaking,” said Lucio. The City of Jacksonville has been an important partner in financing this endeavor, matching private donations dollar for dollar.  The Florida Theatre’s Capital Campaign has been funded by 138 donors and a restoration fee is assessed on all ticket sales. “We want to make the building functionally better for how we use it today by improving it with 50-year solutions so we can be financially solvent for the next 100 years,” said Ed White of Auld & White Constructors, who is also a member of the Florida Theatre’s Capital Campaign Committee. “By the end of this calendar year, over the last four years, we will have raised and spent $15 million on building improvements to the historic Florida Theatre,” said Numa Saisselin, President of the Florida Theatre.  “After this, there’s about $8 million left of work to do to get the rest of the building where it needs to be, including expanding the entry lobby; a new artist hospitality space; dressing room improvements; marquee restorations; and administrative office improvements,” said Saisselin. “I have been going to the Florida Theatre for years,” said Don Cameron, Florida Theatre First Vice Chair and Chair-Elect of the Board of Directors.  “It has always been great, but this renovation will improve the intimate experience.  Not only will the Theatre be restored to its original splendor, but it will also include the modern tech/sound system, social spaces (lobby, VIP lounge), and conveniences (new restrooms) that you would expect at a new venue.  It will offer the best of both worlds – as it will be vintage and new.  While still offering great entertainment at a great price.” While the Florida Theatre is closed for renovations, it will continue to book and put great new shows on sale for the fall and have off-site events, member events, and more. To learn more about the Florida Theatre, visit floridatheatre.com. ### About the Florida Theatre The Florida Theatre is a 1,900-seat historic theatre located in downtown Jacksonville, Florida, that first opened its doors on April 8, 1927, and was listed on the National Register of Historic Places in 1983. The Florida Theatre Performing Arts Center, Inc. is a private, not-for-profit, 501(c)(3) organization founded in 1987 to manage, program, and preserve the historic Florida Theatre in a public/private partnership with the City of Jacksonville, which owns the building. Learn more at floridatheatre.com. Florida Theatre Ranked 39th Most Attended Theatre In The World JACKSONVILLE, FL, July 5, 2023 – Concert industry trade magazine Pollstar released its attendance charts for the first half of 2023 (December 12, 2022, through June 26, 2023); and the Florida Theatre has been ranked the 39 th most-attended theatre in the world in the auditorium and theatre category and is ranked 50 th in ticket sales, based on gross receipts . Notable venues in this attendance chart include Radio City Music Hall in New York City (ranked #1 in tickets), the Fox Theatre in Atlanta (ranked #8 in tickets), and the Microsoft Theater in Los Angeles (ranked #17 in tickets). Notable venues the Florida Theatre out-ranked include the Theater at Madison Square Garden (ranked #47 in tickets), the Grand Ole Opry House (ranked #82 in gross receipts), and Royal Albert Hall (ranked #88 in gross receipts). The Florida Theatre earned its status on this chart the hard way, one night at a time… which, according to Numa Saisselin, President of the Florida Theatre, speaks to the support of Jacksonville and the success of the Theatre’s programming at the 1,865-seat venue. In 75% of the time, the Florida Theatre has done 90% of the number of shows they did last year (117 in 2023 versus 126 in 2022) and 85% of the number of tickets they did last year. To date, the Florida Theatre has sold 102,057 tickets with $5,138,361 in gross receipts during the 2023 season. This ranking is especially significant because the Florida Theatre will be closed from July to October for $8 million in renovations (re-plastering and repainting the interior, replacing the HVAC, updating the bathrooms, and moving the electrical vault from the 1 st to the 3 rd floor) and will lose 10 to 20 shows during the shutdown as well as the last quarter of its fiscal year. Pollstar tracks attendance across the top 200 theatres worldwide each year based on gross sales and the number of tickets sold. ### About the Florida Theatre The Florida Theatre is a 1,865-seat historic theatre located in downtown Jacksonville, Florida, that first opened its doors on April 8, 1927, and was listed on the National Register of Historic Places in 1983. The Florida Theatre Performing Arts Center, Inc. is a nonprofit corporation founded in 1987 to manage, program, and preserve the historic Florida Theatre in a public/private partnership with the City of Jacksonville, which owns the building. The Florida Theatre is Season Sponsored by Community First Credit Union. 10th Annual Blues, Brews, Bourbon & BBQ Raises Over $55,000 For The Historic Florida Theatre FOR IMMEDIATE RELEASE MEDIA CONTACT: Beth Carper, Press & Media Relations Manager (904) 562-5988 / beth@floridatheatre.com 10 th ANNUAL BLUES, BREWS, BOURBON & BBQ RAISES OVER $55,000 FOR THE HISTORIC FLORIDA THEATRE JACKSONVILLE, FL, September 14, 2023 – The historic, nonprofit Florida Theatre raised over $55,000 during its 10 th annual Blues, Brews, Bourbon & BBQ event last week at Bowing Oaks.  Many thanks to all the vendors, sponsors, members, and Theatre supporters who donated their services and purchased tickets to this amazing fundraiser! Publix Charities was the Presenting Sponsor of the September 7 th event benefitting the historic Florida Theatre.  “Publix Charities is proud to support the Florida Theatre as they provide diverse and memorable arts and entertainment experiences.  We are happy to help in their important work,” said Kelly Williams-Puccio, Executive Director of Publix Charities. Blues, Brews, Bourbon & BBQ, was held at Bowing Oaks this year, as the Florida Theatre is still under renovation with plans to reopen in October. Bowing Oaks has been a Corporate Partner of the Florida Theatre since 2019.  \"Bowing Oaks is proud to be a Corporate Partner with the Florida Theatre and was honored to host this year's Blues, Brews, Bourbon & BBQ event,” said Jim Efstathion, Owner of Bowing Oaks.  “We look forward to our continued partnership with the Theatre and hosting many more events for the Jacksonville community.\" “Blues, Brews & BBQ has been a regular part of the Florida Theatre schedule since 2013.  Adding a fourth ‘B’ to the equation, Bourbon, gave the event another dimension of Southern food and beverage culture to explore, and having the event at Bowing Oaks also added another dimension,” said Numa Saisselin, President of the Florida Theatre.  “The Florida Theatre is closed for renovations this summer, and we’re so grateful to owner Jim Efstathion and his staff at Bowing Oaks for taking us in.  We’re also grateful to the sponsors, including Publix, Bold City, Manifest, Bono’s, and the ticket buyers for supporting the nonprofit Florida Theatre.  We’re open again on October 28th with a full slate of shows now on sale at floridatheatre.com.” Attendees of this annual event enjoyed an electrifying evening of live Blues music from the Snacks Blues Band and Henry Jones, unlimited local BBQ, the best craft beer, and a curated bourbon selection. “We always love supporting the local gem that we call the Florida Theatre, but when you include  Bourbon, Local Brews, Blues Music, and tasty BBQ, the decision is a no-brainer!  It's one of our favorite events of the year,” said Brian Miller, Owner of Bold City Brewery. “Thanks so much for the great partnership,” said Jim Webb – VP Development/Partner with Manifest.  “It was a great event, and we enjoyed meeting new people and seeing tried and true supporters of the Florida Theatre.  Can’t wait to be there on (re)opening night in October.” “Blues, Brews, Bourbon & BBQ is one of our favorite events of the year.  It truly allows us to showcase our food and catering capabilities at Bono’s Pit BBQ with one of our favorite partners, the Florida Theatre,” said Josh Martino, President of the Home Team Restaurant Group.  “We are excited for the many upcoming shows and performances at one of our favorite venues in town and can’t wait to see the amazing renovation.” The Florida Theatre wishes to thank all the generous vendors and sponsors below who made this wonderful event possible: VENDORS - Blues Snacks Blues Band Henry Jones Brews AIBC (Amelia Island Brewing Co.) Ancient City Brewing Bold City Brewery Legacy Ale Works Ruby Beach Brewing Co. Seven Bridges Grille Southern Swells Brewing Co. Veterans United Craft Brewery Wicked Barley Brewery Bourbon/Spirits Blue Note Bourbon Manifest Post Meridiem Canned Cocktails BBQ Bono’s Pit BBQ Since 1949 G’s Slow-Smoked BBQ Legacy Ale Works Mojo BBQ Seven Bridges Grille The Bearded Pig The Grub Brothers Competition BBQ Underbelly Wicked Barley Brewery Desserts Cinotti’s Bakery Nothing Bundt Cakes Small Cakes Venue Bowing Oaks Miscellaneous Axe Champ Jacksonville Jaguars SPONSORS - AVL – In-Kind Sponsor CK Direct – Brew Sponsor Community First Credit Union – VIP Sponsor Eisman & Russo – Blues Sponsor Millennium Physician Group – Brew Sponsor Publix – Presenting Sponsor Click here to see photos of the event. All proceeds from the annual Blues, Brews, Bourbon & BBQ fundraiser will go to the historic, nonprofit Florida Theatre, which will reopen after the next phase of renovations is complete on October 28 th for The Rocky Horror Picture Show. Since its inception in 2013, Blues, Brews, Bourbon & BBQ, formerly Blues, Brews & BBQ, has raised $351,697.98 for the historic, nonprofit Florida Theatre. To see all the exciting events that are coming up and for tickets to all future shows, please visit www.floridatheatre.com . About the Florida Theatre The Florida Theatre is a 1,865-seat historic theatre located in downtown Jacksonville, Florida, that first opened its doors on April 8, 1927, and was listed on the National Register of Historic Places in 1983. The Florida Theatre Performing Arts Center, Inc. is a nonprofit corporation founded in 1987 to manage, program, and preserve the historic Florida Theatre in a public/private partnership with the City of Jacksonville, which owns the building. The Florida Theatre is Season Sponsored by Community First Credit Union.  To learn more, visit www.floridatheatre.com . ### The Newly Renovated Historic Florida Theatre Is Set To Reopen October 28, 2023 FOR IMMEDIATE RELEASE MEDIA CONTACT: Beth Carper, Press & Media Relations Manager Florida Theatre (904) 562-5988 / beth@floridaTheatre.com THE NEWLY RENOVATED HISTORIC FLORIDA THEATRE IS SET TO REOPEN OCTOBER 28, 2023 JACKSONVILLE, FL, October 9, 2023 – The wait is over.  The paint and plaster are dry.  The newly renovated historic Florida Theatre in downtown Jacksonville is set to reopen on Saturday, October 28, 2023, at 8 p.m. for The Rocky Horror Picture Show.  Mayor Donna Deegan and other dignitaries will participate in a ribbon cutting on Friday, October 27, 2023, at 5:30 p.m. inside the lobby/auditorium for the big reveal. The Florida Theatre has been closed since mid-July (2023) to renovate the 96-year-old facility.  All the flaking and peeling decorative plaster in the auditorium has been repaired, the lobbies and the auditorium have been painted with fidelity to the 1927 color palette, the entire heating, ventilation, and air conditioning system has been replaced, and the building’s electrical vault has been moved from the first to the third floor.  But probably the thing people will notice the most is that all the public restrooms have been updated.  Ironically, the Florida Theatre will reopen around the 40 th anniversary of the last major renovation that took place in 1983. See photos of the summer 2023 restoration here. These projects build upon projects that have already been accomplished at the Florida Theatre, which include replacing the Theatre’s 1,865 seats, doubling the wheelchair seating capacity, installing a new assistive listening system for people who are hard of hearing, improving the aisle lighting and handrails, especially in the balcony, installing a new concert sound system and lighting system, and repurposing the second floor of the office building into the new Remedy Lounge, which was the first expansion of the venue’s public space in 95 years. This project has been a labor of love…from The City of Jacksonville (who has matched private donations) to the Centennial Campaign donors to Florida Theatre Members to the Principal Artisans below who have been feverishly restoring the building to its original grandeur over the summer…and everyone in Northeast Florida who has ever bought a ticket to a show at the Florida Theatre and paid the $4.50 restoration fee…to maintain and preserve this Jacksonville jewel. “The Florida Theatre is one of downtown Jacksonville's gems.  With its 100th birthday approaching, this is an exciting time to restore the Theatre to its full splendor,” said Mayor Donna Deegan.  “I look forward to seeing the Theatre’s facelift and supporting our City’s vibrant performing arts scene by attending a show when it reopens – and I encourage everyone to do the same.” Auld and White Constructors was the general contractor for this project.  Sauer Mechanical did the HVAC work.  EverGreene Architectural Arts did all the plaster/paint work and restored the tapestries.  And Beacon Electric moved the electrical vault from the first to the third floor so it would no longer be a flood risk. “Auld & White Constructors is honored to have been Florida Theatre's Construction Partner for its renovations and next-generation mechanical system upgrades.  AWC recognizes that the timely completion of the recent work at Jacksonville's iconic cultural hub was critical in enhancing the patron experience for the Theatre's upcoming shows and Centennial Celebration.  I'm proud of our team's hard work and unwavering dedication to preserving the legacy and building the future of this historic Northeast Florida landmark for years to come,” said Nate Marty, CEO of Auld & White Constructors. “Sauer Mechanical is proud to participate in the historic Florida Theatre renovation.  During the shut-down period, we have replaced the aging rooftop chillers with new Daikin air-cooled chillers and the sixth-floor custom-built air handler and outdoor air unit with all associated chilled water piping air distribution.  HVAC upgrades during this phase also included demolition of the boiler system no longer in use, replacing restroom exhaust fans, and upgrading the controls system,” said Heather Staggs-Miller, Project Manager with Sauer Mechanical. “There were several things that were unique about the Florida Theatre project,” said Jeff Greene AIC-PA, Executive Chairman & Founder of EverGreene Architectural Arts.  “Like the mysterious connection to John Eberson, one of America’s most prominent architects known for movie palace designs in the atmospheric theatre style (the outdoor feel inside).  The original four faux tapestries that hang in the Florida Theatre were painted.  Since they are the same size and have the same imagery as the ones in the Tampa Theatre (which Eberson did), we were able to replicate them.  When we did our forensic research and put all the Theatre finishes under the microscope, we realized they were painted with the same paint and style that Eberson used.  His signature, per se.  It was fascinating to see what his influence did.” Greene said, “A big part of what we do at EverGreene is connect back to history.  We wanted to return the Florida Theatre to its original, authentic self.  When the building was renovated in the 1970s, they moved away from that a bit.  We wanted to return as accurately as possible to what it looked like in 1927.  The challenge was the short time frame we had.  The surprise or mystery was the Eberson connection.  But we did our research, added some interpretation, and found the harmony and balance we were striving for.” “As a lifelong resident of Jacksonville with many wonderful memories surrounding the Florida Theatre, this project has been a challenging opportunity for Beacon as well as an honor to be part of,” said Shawn Heath, Owner of Beacon Electrical Contractors.  Beacon moved the building’s electrical vault from the first to the third floor and replaced most of the electrical panels and the conduit systems that supply power to the electrical panels. “Over the last four years, by the end of this calendar year, we will have raised and spent $15 million on building improvements to the historic Florida Theatre,” said Numa Saisselin, President of the Florida Theatre.  “After this, there’s about $8 million left of work to do to get the rest of the building where it needs to be, including expanding the entry lobby, a new artist hospitality space, dressing room improvements, marquee restorations, and administrative office improvements,” said Saisselin.  According to Saisselin, the cherry on top would be bringing the original vertical blade sign back (pictured here) that used to adorn the Theatre. All of these projects, under the banner of the Centennial Capital Improvement Plan, which started in 2019, aim to prepare the historic Florida Theatre for its 100 th birthday in 2027 and the next 100 years. “Our $15 million renovation has intensified the already unique Florida Theatre experience - it’s truly at a new level.  And we can’t wait for our customers to see!  As the Theatre approaches its 100th birthday in 2027, we must remember – this is one of the last remaining theatres of its kind in our country!  And we have to take care of it, nurture it, and support it so we can continue to laugh, cry, dance, sing, and do all that we do in our beloved Florida Theatre,” said Dr. Leslie Gordon, Ed.D., Chairperson of the Board of Directors at the Florida Theatre. ### About the Florida Theatre The Florida Theatre is a 1,865-seat historic theatre located in downtown Jacksonville, Florida, that first opened its doors on April 8, 1927, and was listed on the National Register of Historic Places in 1983. The Florida Theatre Performing Arts Center, Inc. is a private, not-for-profit, 501(c)(3) organization founded in 1987 to manage, program, and preserve the historic Florida Theatre in a public/private partnership with the City of Jacksonville, which owns the building.  Learn more at www.floridatheatre.com . The Florida Theatre Tapestry News Coverage Action News Jax First Coast News JaxToday Yahoo News WOKV News Break PRESS CONTACT Beth Carper, Press and Media Relations Manager beth@floridatheatre.com Top Address 128 East Forsyth Street , Suite 300 Jacksonville FL 32202 Florida Theatre Phone Numbers Phone: (904)355-5661 Fax: (904)355-2787 Box Office: (904)355-2787 About History Staff Board of Directors Tech Specs FAQ'S Connect Join our E-Club Rental Information Contact Us Press and News Annual Report Employment Events & Tickets Events & Tickets Annual Fundraising Events Ovation Seating Chart Box Office Info Gift Cards Theatreworks Support Membership Volunteer Merch Donation - One-Time Adopt-A-Seat Bricks The Remedy Lounge Visit Parking & Transportation Accessibility FAQ's Seating Chart First Concert Certificate Our Sponsors Copyrights © 2025\t\t\tFlorida Theatre Privacy Policy • Terms & Conditions • Web Accessibility a carbon house experience"
    },
    {
      "url": "https://www.hardwickcountrystore.co.uk/about-us-1-w.asp",
      "text": "Hardwick Country Store About Us What are you looking for? CHRISTMAS DELIVERY:  LAST ORDER DATE FRIDAY 20TH BY 10AM! HURRY! View here Hardwick Country Store Womens Accessories Ariat Baleno Barbour Footwear Gibson's LE CHAMEAU Toggi View All Mens Accessories Footwear Jackets Legwear Tops & Shirts LE CHAMEAU View All Equestrian & Pets Animal Grooming & Accessories Tack & Riding Accessories View All Children's Clothing Accessories Boys Footwear Girls View All Toys & Games Toys & Games View All Outdoor Pursuit Sale Clearance Men Women View All Terms and Conditions Returns View All Blog Womens Accessories Ariat Baleno Barbour Footwear Gibson's LE CHAMEAU Toggi View All Mens Accessories Footwear Jackets Legwear Tops & Shirts LE CHAMEAU View All Equestrian & Pets Animal Grooming & Accessories Tack & Riding Accessories View All Children's Clothing Accessories Boys Footwear Girls View All Toys & Games Toys & Games View All Outdoor Pursuit Sale Clearance Men Women View All Terms and Conditions Returns View All Blog Welcome to Hardwick Country Store, partnered with Hardwick Agricultural Engineers, a family owned agricultural machinery supplier that has been established for over 30 years. In 2015 we expanded into our new building and created our new big country store which is located in north Yorkshire at Brompton-by-Sawdon between Pickering and Scarborough on the A170. Weâre here to help the  farmer, equestrians, country pursuits, gardeners and fashion lovers. Whether youâre just looking for a jumper to wear day to day or a dress for a summer party we have it. We stock some of the top brands such as Joules , Toggi , Deerhunter , Le Chameau , Percussion, Ariat and so much more. Our friendly staff are here to provide you with a reliable and cheery service. We also stock a large variety of pet feed and can order any requested feed that your pet canât resist. Sign up to our monthly news letter so you can keep up to date with any talks and open nights we will be holding. Hardwick Country Store Sign Up For Exclusive News & Offers Home Blog About Us Contact Us Returns Delivery Blog Terms Sitemap Privacy Hardwick Agricultural Engineers, Main Road, Brompton-by-Sawdon YO13 9DP 01723 859785 / 01723 859658 info@hardwickcountrystore.co.uk © Copyright 2020-2022 Hardwick Country Store All rights reserved Close Don't Miss Out Sign up for exclusive offers this Autumn! Sign Up Now"
    },
    {
      "url": "https://hardwickandsons.com/pages/contact",
      "text": "Contact Us\n – Hardwick & Sons Skip to content Your cart is empty Continue shopping Have an account? Log in to check out faster. Your cart Loading... Order special instructions Order special instructions Estimated total $ 0.00 USD Taxes, Discounts and shipping calculated at checkout View Cart Update Check out MENU Workshop Workshop Brushes Safety Shims Miscellaneous Workshop Items Workshop Organization Occidental Leather Occidental Leather Tool Belt Systems Tool & Fastener Bags Belts, Pads, & Suspenders Tool Vests & Beltless Systems Tool Holders, Pouches, & Accessories Clothing Clothing Hardwick's Hats & Shirts Gloves Finishing Finishing Waxes Stains Shellac Milk Paint Foam Brushes & Chip Brushes Adhesives & Glues Adhesives & Glues FastCap Adhesive Cover Caps Wood Glue Caulking Guns Tool Rolls & Aprons Tool Rolls & Aprons Tool Rolls Aprons Buffing Wheels & Compounds Buffing Wheels & Compounds Buffing Wheels Abrasive & Polishing Compounds Kitchen Kitchen Microplane Kitchen Tools Kitchen Knives Tool Bags Tool Bags Veto Pro Pac Bags Klein Tool Bags Abrasives Abrasives Uneeda Sandpaper Sandpaper & Sanding Sponges Steel Wool Norton Abrasives Aladdin Lamp Co. Special Items Novelty & Special Items Lubricants Wood Log in Sign in Log in Country/region Afghanistan (AFN\n                              ؋) Åland Islands (EUR\n                              €) Albania (ALL\n                              L) Algeria (DZD\n                              د.ج) Andorra (EUR\n                              €) Angola (USD\n                              $) Anguilla (XCD\n                              $) Antigua & Barbuda (XCD\n                              $) Argentina (USD\n                              $) Armenia (AMD\n                              դր.) Aruba (AWG\n                              ƒ) Ascension Island (SHP\n                              £) Australia (AUD\n                              $) Austria (EUR\n                              €) Azerbaijan (AZN\n                              ₼) Bahamas (BSD\n                              $) Bahrain (USD\n                              $) Bangladesh (BDT\n                              ৳) Barbados (BBD\n                              $) Belarus (USD\n                              $) Belgium (EUR\n                              €) Belize (BZD\n                              $) Benin (XOF\n                              Fr) Bermuda (USD\n                              $) Bhutan (USD\n                              $) Bolivia (BOB\n                              Bs.) Bosnia & Herzegovina (BAM\n                              КМ) Botswana (BWP\n                              P) Brazil (USD\n                              $) British Indian Ocean Territory (USD\n                              $) British Virgin Islands (USD\n                              $) Brunei (BND\n                              $) Bulgaria (BGN\n                              лв.) Burkina Faso (XOF\n                              Fr) Burundi (BIF\n                              Fr) Cambodia (KHR\n                              ៛) Cameroon (XAF\n                              CFA) Canada (CAD\n                              $) Cape Verde (CVE\n                              $) Caribbean Netherlands (USD\n                              $) Cayman Islands (KYD\n                              $) Central African Republic (XAF\n                              CFA) Chad (XAF\n                              CFA) Chile (USD\n                              $) China (CNY\n                              ¥) Christmas Island (AUD\n                              $) Cocos (Keeling) Islands (AUD\n                              $) Colombia (USD\n                              $) Comoros (KMF\n                              Fr) Congo - Brazzaville (XAF\n                              CFA) Congo - Kinshasa (CDF\n                              Fr) Cook Islands (NZD\n                              $) Costa Rica (CRC\n                              ₡) Côte d’Ivoire (XOF\n                              Fr) Croatia (EUR\n                              €) Curaçao (ANG\n                              ƒ) Cyprus (EUR\n                              €) Czechia (CZK\n                              Kč) Denmark (DKK\n                              kr.) Djibouti (DJF\n                              Fdj) Dominica (XCD\n                              $) Dominican Republic (DOP\n                              $) Ecuador (USD\n                              $) Egypt (EGP\n                              ج.م) El Salvador (USD\n                              $) Equatorial Guinea (XAF\n                              CFA) Eritrea (USD\n                              $) Estonia (EUR\n                              €) Eswatini (USD\n                              $) Ethiopia (ETB\n                              Br) Falkland Islands (FKP\n                              £) Faroe Islands (DKK\n                              kr.) Fiji (FJD\n                              $) Finland (EUR\n                              €) France (EUR\n                              €) French Guiana (EUR\n                              €) French Polynesia (XPF\n                              Fr) French Southern Territories (EUR\n                              €) Gabon (XOF\n                              Fr) Gambia (GMD\n                              D) Georgia (USD\n                              $) Germany (EUR\n                              €) Ghana (USD\n                              $) Gibraltar (GBP\n                              £) Greece (EUR\n                              €) Greenland (DKK\n                              kr.) Grenada (XCD\n                              $) Guadeloupe (EUR\n                              €) Guatemala (GTQ\n                              Q) Guernsey (GBP\n                              £) Guinea (GNF\n                              Fr) Guinea-Bissau (XOF\n                              Fr) Guyana (GYD\n                              $) Haiti (USD\n                              $) Honduras (HNL\n                              L) Hong Kong SAR (HKD\n                              $) Hungary (HUF\n                              Ft) Iceland (ISK\n                              kr) India (INR\n                              ₹) Indonesia (IDR\n                              Rp) Iraq (USD\n                              $) Ireland (EUR\n                              €) Isle of Man (GBP\n                              £) Israel (ILS\n                              ₪) Italy (EUR\n                              €) Jamaica (JMD\n                              $) Japan (JPY\n                              ¥) Jersey (USD\n                              $) Jordan (USD\n                              $) Kazakhstan (KZT\n                              ₸) Kenya (KES\n                              KSh) Kiribati (USD\n                              $) Kosovo (EUR\n                              €) Kuwait (USD\n                              $) Kyrgyzstan (KGS\n                              som) Laos (LAK\n                              ₭) Latvia (EUR\n                              €) Lebanon (LBP\n                              ل.ل) Lesotho (USD\n                              $) Liberia (USD\n                              $) Libya (USD\n                              $) Liechtenstein (CHF\n                              CHF) Lithuania (EUR\n                              €) Luxembourg (EUR\n                              €) Macao SAR (MOP\n                              P) Madagascar (USD\n                              $) Malawi (MWK\n                              MK) Malaysia (MYR\n                              RM) Maldives (MVR\n                              MVR) Mali (XOF\n                              Fr) Malta (EUR\n                              €) Martinique (EUR\n                              €) Mauritania (USD\n                              $) Mauritius (MUR\n                              ₨) Mayotte (EUR\n                              €) Mexico (USD\n                              $) Moldova (MDL\n                              L) Monaco (EUR\n                              €) Mongolia (MNT\n                              ₮) Montenegro (EUR\n                              €) Montserrat (XCD\n                              $) Morocco (MAD\n                              د.م.) Mozambique (USD\n                              $) Myanmar (Burma) (MMK\n                              K) Namibia (USD\n                              $) Nauru (AUD\n                              $) Nepal (NPR\n                              Rs.) Netherlands (EUR\n                              €) New Caledonia (XPF\n                              Fr) New Zealand (NZD\n                              $) Nicaragua (NIO\n                              C$) Niger (XOF\n                              Fr) Nigeria (NGN\n                              ₦) Niue (NZD\n                              $) Norfolk Island (AUD\n                              $) North Macedonia (MKD\n                              ден) Norway (USD\n                              $) Oman (USD\n                              $) Pakistan (PKR\n                              ₨) Palestinian Territories (ILS\n                              ₪) Panama (USD\n                              $) Papua New Guinea (PGK\n                              K) Paraguay (PYG\n                              ₲) Peru (PEN\n                              S/) Philippines (PHP\n                              ₱) Pitcairn Islands (NZD\n                              $) Poland (PLN\n                              zł) Portugal (EUR\n                              €) Qatar (QAR\n                              ر.ق) Réunion (EUR\n                              €) Romania (RON\n                              Lei) Russia (USD\n                              $) Rwanda (RWF\n                              FRw) Samoa (WST\n                              T) San Marino (EUR\n                              €) São Tomé & Príncipe (STD\n                              Db) Saudi Arabia (SAR\n                              ر.س) Senegal (XOF\n                              Fr) Serbia (RSD\n                              РСД) Seychelles (USD\n                              $) Sierra Leone (SLL\n                              Le) Singapore (SGD\n                              $) Sint Maarten (ANG\n                              ƒ) Slovakia (EUR\n                              €) Slovenia (EUR\n                              €) Solomon Islands (SBD\n                              $) Somalia (USD\n                              $) South Africa (USD\n                              $) South Georgia & South Sandwich Islands (GBP\n                              £) South Korea (KRW\n                              ₩) South Sudan (USD\n                              $) Spain (EUR\n                              €) Sri Lanka (LKR\n                              ₨) St. Barthélemy (EUR\n                              €) St. Helena (SHP\n                              £) St. Kitts & Nevis (XCD\n                              $) St. Lucia (XCD\n                              $) St. Martin (EUR\n                              €) St. Pierre & Miquelon (EUR\n                              €) St. Vincent & Grenadines (XCD\n                              $) Sudan (USD\n                              $) Suriname (USD\n                              $) Svalbard & Jan Mayen (USD\n                              $) Sweden (SEK\n                              kr) Switzerland (CHF\n                              CHF) Taiwan (TWD\n                              $) Tajikistan (TJS\n                              ЅМ) Tanzania (TZS\n                              Sh) Thailand (THB\n                              ฿) Timor-Leste (USD\n                              $) Togo (XOF\n                              Fr) Tokelau (NZD\n                              $) Tonga (TOP\n                              T$) Trinidad & Tobago (TTD\n                              $) Tristan da Cunha (GBP\n                              £) Tunisia (USD\n                              $) Türkiye (USD\n                              $) Turkmenistan (USD\n                              $) Turks & Caicos Islands (USD\n                              $) Tuvalu (AUD\n                              $) U.S. Outlying Islands (USD\n                              $) Uganda (UGX\n                              USh) Ukraine (UAH\n                              ₴) United Arab Emirates (AED\n                              د.إ) United Kingdom (GBP\n                              £) United States (USD\n                              $) Uruguay (UYU\n                              $U) Uzbekistan (UZS\n                              so'm) Vanuatu (VUV\n                              Vt) Vatican City (EUR\n                              €) Venezuela (USD\n                              $) Vietnam (VND\n                              ₫) Wallis & Futuna (XPF\n                              Fr) Western Sahara (MAD\n                              د.م.) Yemen (YER\n                              ﷼) Zambia (USD\n                              $) Zimbabwe (USD\n                              $) Update country/region Country/region USD\n      $ | United States AFN\n              ؋ | Afghanistan EUR\n              € | Åland Islands ALL\n              L | Albania DZD\n              د.ج | Algeria EUR\n              € | Andorra USD\n              $ | Angola XCD\n              $ | Anguilla XCD\n              $ | Antigua & Barbuda USD\n              $ | Argentina AMD\n              դր. | Armenia AWG\n              ƒ | Aruba SHP\n              £ | Ascension Island AUD\n              $ | Australia EUR\n              € | Austria AZN\n              ₼ | Azerbaijan BSD\n              $ | Bahamas USD\n              $ | Bahrain BDT\n              ৳ | Bangladesh BBD\n              $ | Barbados USD\n              $ | Belarus EUR\n              € | Belgium BZD\n              $ | Belize XOF\n              Fr | Benin USD\n              $ | Bermuda USD\n              $ | Bhutan BOB\n              Bs. | Bolivia BAM\n              КМ | Bosnia & Herzegovina BWP\n              P | Botswana USD\n              $ | Brazil USD\n              $ | British Indian Ocean Territory USD\n              $ | British Virgin Islands BND\n              $ | Brunei BGN\n              лв. | Bulgaria XOF\n              Fr | Burkina Faso BIF\n              Fr | Burundi KHR\n              ៛ | Cambodia XAF\n              CFA | Cameroon CAD\n              $ | Canada CVE\n              $ | Cape Verde USD\n              $ | Caribbean Netherlands KYD\n              $ | Cayman Islands XAF\n              CFA | Central African Republic XAF\n              CFA | Chad USD\n              $ | Chile CNY\n              ¥ | China AUD\n              $ | Christmas Island AUD\n              $ | Cocos (Keeling) Islands USD\n              $ | Colombia KMF\n              Fr | Comoros XAF\n              CFA | Congo - Brazzaville CDF\n              Fr | Congo - Kinshasa NZD\n              $ | Cook Islands CRC\n              ₡ | Costa Rica XOF\n              Fr | Côte d’Ivoire EUR\n              € | Croatia ANG\n              ƒ | Curaçao EUR\n              € | Cyprus CZK\n              Kč | Czechia DKK\n              kr. | Denmark DJF\n              Fdj | Djibouti XCD\n              $ | Dominica DOP\n              $ | Dominican Republic USD\n              $ | Ecuador EGP\n              ج.م | Egypt USD\n              $ | El Salvador XAF\n              CFA | Equatorial Guinea USD\n              $ | Eritrea EUR\n              € | Estonia USD\n              $ | Eswatini ETB\n              Br | Ethiopia FKP\n              £ | Falkland Islands DKK\n              kr. | Faroe Islands FJD\n              $ | Fiji EUR\n              € | Finland EUR\n              € | France EUR\n              € | French Guiana XPF\n              Fr | French Polynesia EUR\n              € | French Southern Territories XOF\n              Fr | Gabon GMD\n              D | Gambia USD\n              $ | Georgia EUR\n              € | Germany USD\n              $ | Ghana GBP\n              £ | Gibraltar EUR\n              € | Greece DKK\n              kr. | Greenland XCD\n              $ | Grenada EUR\n              € | Guadeloupe GTQ\n              Q | Guatemala GBP\n              £ | Guernsey GNF\n              Fr | Guinea XOF\n              Fr | Guinea-Bissau GYD\n              $ | Guyana USD\n              $ | Haiti HNL\n              L | Honduras HKD\n              $ | Hong Kong SAR HUF\n              Ft | Hungary ISK\n              kr | Iceland INR\n              ₹ | India IDR\n              Rp | Indonesia USD\n              $ | Iraq EUR\n              € | Ireland GBP\n              £ | Isle of Man ILS\n              ₪ | Israel EUR\n              € | Italy JMD\n              $ | Jamaica JPY\n              ¥ | Japan USD\n              $ | Jersey USD\n              $ | Jordan KZT\n              ₸ | Kazakhstan KES\n              KSh | Kenya USD\n              $ | Kiribati EUR\n              € | Kosovo USD\n              $ | Kuwait KGS\n              som | Kyrgyzstan LAK\n              ₭ | Laos EUR\n              € | Latvia LBP\n              ل.ل | Lebanon USD\n              $ | Lesotho USD\n              $ | Liberia USD\n              $ | Libya CHF\n              CHF | Liechtenstein EUR\n              € | Lithuania EUR\n              € | Luxembourg MOP\n              P | Macao SAR USD\n              $ | Madagascar MWK\n              MK | Malawi MYR\n              RM | Malaysia MVR\n              MVR | Maldives XOF\n              Fr | Mali EUR\n              € | Malta EUR\n              € | Martinique USD\n              $ | Mauritania MUR\n              ₨ | Mauritius EUR\n              € | Mayotte USD\n              $ | Mexico MDL\n              L | Moldova EUR\n              € | Monaco MNT\n              ₮ | Mongolia EUR\n              € | Montenegro XCD\n              $ | Montserrat MAD\n              د.م. | Morocco USD\n              $ | Mozambique MMK\n              K | Myanmar (Burma) USD\n              $ | Namibia AUD\n              $ | Nauru NPR\n              Rs. | Nepal EUR\n              € | Netherlands XPF\n              Fr | New Caledonia NZD\n              $ | New Zealand NIO\n              C$ | Nicaragua XOF\n              Fr | Niger NGN\n              ₦ | Nigeria NZD\n              $ | Niue AUD\n              $ | Norfolk Island MKD\n              ден | North Macedonia USD\n              $ | Norway USD\n              $ | Oman PKR\n              ₨ | Pakistan ILS\n              ₪ | Palestinian Territories USD\n              $ | Panama PGK\n              K | Papua New Guinea PYG\n              ₲ | Paraguay PEN\n              S/ | Peru PHP\n              ₱ | Philippines NZD\n              $ | Pitcairn Islands PLN\n              zł | Poland EUR\n              € | Portugal QAR\n              ر.ق | Qatar EUR\n              € | Réunion RON\n              Lei | Romania USD\n              $ | Russia RWF\n              FRw | Rwanda WST\n              T | Samoa EUR\n              € | San Marino STD\n              Db | São Tomé & Príncipe SAR\n              ر.س | Saudi Arabia XOF\n              Fr | Senegal RSD\n              РСД | Serbia USD\n              $ | Seychelles SLL\n              Le | Sierra Leone SGD\n              $ | Singapore ANG\n              ƒ | Sint Maarten EUR\n              € | Slovakia EUR\n              € | Slovenia SBD\n              $ | Solomon Islands USD\n              $ | Somalia USD\n              $ | South Africa GBP\n              £ | South Georgia & South Sandwich Islands KRW\n              ₩ | South Korea USD\n              $ | South Sudan EUR\n              € | Spain LKR\n              ₨ | Sri Lanka EUR\n              € | St. Barthélemy SHP\n              £ | St. Helena XCD\n              $ | St. Kitts & Nevis XCD\n              $ | St. Lucia EUR\n              € | St. Martin EUR\n              € | St. Pierre & Miquelon XCD\n              $ | St. Vincent & Grenadines USD\n              $ | Sudan USD\n              $ | Suriname USD\n              $ | Svalbard & Jan Mayen SEK\n              kr | Sweden CHF\n              CHF | Switzerland TWD\n              $ | Taiwan TJS\n              ЅМ | Tajikistan TZS\n              Sh | Tanzania THB\n              ฿ | Thailand USD\n              $ | Timor-Leste XOF\n              Fr | Togo NZD\n              $ | Tokelau TOP\n              T$ | Tonga TTD\n              $ | Trinidad & Tobago GBP\n              £ | Tristan da Cunha USD\n              $ | Tunisia USD\n              $ | Türkiye USD\n              $ | Turkmenistan USD\n              $ | Turks & Caicos Islands AUD\n              $ | Tuvalu USD\n              $ | U.S. Outlying Islands UGX\n              USh | Uganda UAH\n              ₴ | Ukraine AED\n              د.إ | United Arab Emirates GBP\n              £ | United Kingdom USD\n              $ | United States UYU\n              $U | Uruguay UZS\n              so'm | Uzbekistan VUV\n              Vt | Vanuatu EUR\n              € | Vatican City USD\n              $ | Venezuela VND\n              ₫ | Vietnam XPF\n              Fr | Wallis & Futuna MAD\n              د.م. | Western Sahara YER\n              ﷼ | Yemen USD\n              $ | Zambia USD\n              $ | Zimbabwe Facebook Instagram Search... Search Sign in Log in Cart Cart SHOP BY VENDOR Aladdin Alfa Tools Bahco Bessey Buck Bros Buck Knives Clifton C.S. Osborne Channellock Crown Tools Dan's Whetstone Co. Dasco Dico Polishing DMT Sharpening Dogyu Dubuque Clamp Co. Eklind Estwing Excel Blades FastCap Fein Tools Felco Flexcut General Tools Gränsfors Bruk Henry Taylor Tools Hultafors Imperial Blades Insty-Bit Irwin Johnson Level Jorgensen Klein Tools Kreg Tool Kunz Lutz File Handles Malco Marshalltown Mayhew Microplane Milwaukee Tool Mora of Sweden North Bay Forge Norton Abrasives Noxon Spring Tools Lenox Occidental Leather Goods Olfa Opinel Pferd Tools Picard Picquic Shinwa Skil Power Tools Stabila Stanley Starrett Stiletto Stringliner Stubai Swanson Tool Co. Tajima Tools Tennessee Hickory Handles Thomas Flinn & Co. Triumph Two Cherries Ulmia Vaughan Veritas Veto Pro Pac Vix-Bits Vogel W.L. Fuller Wall Lenk Wera Wiha Wiss Wood is Good Wood Owl Tools Boring Tools & Drill Bits Countersinks & Counterbores Self-Centering Vix-Bits Drilling Bits Plug Cutters Wood Owl Boring Bits Insty-Bit Taps & Dies Pry Bars, Nail Pullers & Nail Sets Pry Bars Japanese Nail Pullers & Pry Bars Nail Sets Punches & Chisels Swedish Svedbro Wrecking Bars Clamps Bessey Clamps Jorgensen Clamps Dubuque Clamps Pinch Dogs Spring Clamps Specialty Clamps Vises Measuring & Layout Tools Levels Plumb Bobs, Reels, & Mason Line Calipers & Dividers Tape Measures Chalk Lines & Ink Lines Awls & Scribes Layout Gauges Squares Rules & Straight Edges Knives Opinel Knives Japanese Laminated Knives Mora Knives Specialty Knives Buck Knives Utility Knives & Blades Olfa Knives Scraping Tools Swiza Knives Hammers & Mallets Japanese Hammers Estwing Hammers Stiletto Hammers Dalluge Hammers Vaughan Hammers Vaughan Grayvik Hammers Woodworking Mallets Specialty Hammers Replacement Hammer Handles Pliers, Cutters & Snips Maun Pliers Specialty Pliers Specialty Cutters Sharpening Waterstones Arkansas Natural Stones Files Diamond Stones Oil Stones Tool Jigs Strops & Accessories Screwdrivers & Bits Wera Screwdrivers & Bits Picquic Screwdrivers Screwdrivers Wrenches & Sockets Nailers, Riveting, Staplers & Staples Rivet Tools & Rivets Nailers Nailers, Staplers & Staples QUALITY TOOLS Hardwick & Sons is pleased to offer quality & unique tools from around the world for people who desire special & well-crafted tools. Tools that are made to last. Woodworking Rasps & Scrapers Rasps Cabinet Scrapers & Burnishers Specialty Scrapers Perforated Rasps & Surform Tools Handles for Files, Rasps & Tools Microplane Tools Drawknives, Adzes, & Froes Drawknives North Bay Forge Adzes Gränsfors Bruk Adzes Froes Adzes Hand Saws Stanley Hand Saws Japanese Saws Japanese Saw Blades Specialty Saws Hacksaws Planes & Shaving Tools Stanley Planes Spokeshaves Inshaves Scorps Specialty Planes Plane Irons Chisels & Carving Japanese Laminated Chisels Stanley Chisels North Bay Forge Carving Carving Axes Two Cherries Carving Two Cherries Chisels & Gouges Flexcut Micro Carving Tools Flexcut Palm Carving Tools Flexcut Mallet Carving Tools Buck Bros. Chisels Stubai Carving Tools Turning Tools Wood Lathe Tools Router Bits Amana Router Bits Irwin Router Bits Kreg Tools Woodworking From beautifully hand-crafted carving knives to unique Japanese saws, discover distinctive & special tools made for the serious woodworker. Hardware Cabinet Hardware Cabinet Knobs Handles & Pulls Classic Brass Knobs Classic Glass Knobs & Pulls Cabinet Hinges Cabinet Latches, Locks & Keys Wood Hardware Door Hardware Doorknobs Door Rosettes Door Escutcheons Door Latches & Strikes Door Hinges Spindles & Parts Window Hardware Sash Hardware Casement Hardware Transom Hardware Shutter, Screen & Storm Door Window Hinges House & Furniture Hardware Label Holders Keyhole Escutcheons Hooks Picture Moulding Hooks Ice Box Hardware Casters Specialty Furniture Hardware Screws & Parts Utility Hardware Bolt Snaps Screw Hooks Eyebolts & Screw Eyes Braces, Plates & Corner Irons S-Hooks Barrel Bolts, Hasps & Utility Hinges U-Bolts, Eyes, & Cleats Specialty Hardware FastCap Fasteners & Anchors Gate & Outdoor Hardware House Numbers Gate Handles & Pulls VINTAGE-STYLE HARDWARE Offering timeless & classy hardware for those who desire to fashion their homes with charm, quality, & style. Power Tools Festool Festool Drills Track Saws Planex & Accessories Dust Extractors & Vacuum Accessories Fein Fein Oscillating Tools Fein Oscillating Blades Fein Sanding & Polishing Fein Scraping, Grout & Rasping Fein Vacuums & Accessories Fein Angle Grinders Fein Accessories Pferd Pferd Grinding & Cut-Off Wheels Pferd Bench Grinding Wheels Pferd Files Pferd Fine Grinding & Finishing Milwaukee Milwaukee Drills Milwaukee Accessories Power Tool Accessories FastCap Power Tool Accessories Drill Chucks & Arbors Reciprocating Saw Blades Jig Saw Blades V-Belts Circular Saw & Hole Saw Blades Irwin Circular Saw Blades Japanese Sanwa Blades Tenryu Blades Starrett Hole Saws Imperial Blades Router Bits Skil Power Tools Other Power Tools Amana Router Bits Irwin Router Bits Grinding Wheels STREAMLINED-DESIGN & POWER State of the art power tools ~ Authorized Festool & Fein dealer. Garden & Outdoor Axes & Hatchets Gränsfors Bruk Axes Gränsfors Bruk Sheaths Gränsfors Bruk Handles Axes Axe Handles Felco Tools Felco Pruners Felco Loppers Garden Tools Digging Tools Weeders Sickles Cultivators, Hoes & Rakes Bonsai Tools Pruners & Shears Garden Saws Bamboo Loppers & Shears Bahco Gardening Tools Bahco Loppers & Shears Striking Tools Rock Breaking & Pick Tools Replacement Handles Logging Tools Other Garden Items Jute Twine GARDEN VARIETY From Hori Hori's to Swedish Axes we got you covered. More Workshop Brushes Safety Shims Miscellaneous Workshop Items Workshop Organization Occidental Leather Tool Belt Systems Tool & Fastener Bags Belts, Pads, & Suspenders Tool Vests & Beltless Systems Tool Holders, Pouches, & Accessories Clothing Hardwick's Hats & Shirts Gloves Finishing Waxes Stains Shellac Milk Paint Foam Brushes & Chip Brushes Adhesives & Glues FastCap Adhesive Cover Caps Wood Glue Caulking Guns Tool Rolls & Aprons Tool Rolls Aprons Buffing Wheels & Compounds Buffing Wheels Abrasive & Polishing Compounds Kitchen Microplane Kitchen Tools Kitchen Knives Tool Bags Veto Pro Pac Bags Klein Tool Bags Abrasives Uneeda Sandpaper Sandpaper & Sanding Sponges Steel Wool Norton Abrasives Aladdin Lamp Co. Aladdin Lamps Wicks, Mantles, & Accessories Special Items Novelty & Special Items Lubricants Wood MORE TO EXPLORE Clothing, Abrasives, Specialty Items, & More. Used Corner Used Hardware Vintage Hardware Used Tools Used Pliers & Cutters Used Woodworking Tools Used Wrenches & Sockets Used Clamps Used Saw Blades Used Plumbing Tools Used Garden Tools Used Automotive Tools Used Power Tool Accessories Other Used Items Unique & Antique HARD-TO-FIND Items you can't get anywhere else. Home / Contact Us KEEP IN TOUCH Please enter your information below, and we will respond as soon as possible. Name Email * Phone number Order No Message SUBMIT CONTACT INFO Locations 3820 E Mullan Ave Post Falls, ID 83854 USA Store Hours 8-6 M-F 9-6 SAT Contact service@ehardwicks.com Join Our Community Receive the latest news and info from Hardwick & Sons! Enter your email address.... SUBSCRIBE CUSTOMER SERVICE Privacy Policy Shipping Policy Return Policy FAQ's CONTACT service@ehardwicks.com LOCATION 3820 E Mullan Ave Post Falls, ID 83854 (Brick & Mortar Store Opening 2025) ONLINE STORE HOURS 9-5 M-F Facebook Instagram Payment methods American Express Bancontact Diners Club Discover iDEAL Mastercard PayPal Shop Pay Venmo Visa Copyright © 2025, Hardwick & Sons Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "http://www.hardwickesaccountants.co.uk/contact.html",
      "text": "Hardwickes Accountants - Contact Us Toggle navigation Telephone: 01782 219555 01782 219555 Home Services Contact Contact Us Location Hardwickes Chartered Accountants Etruria Old Road Stoke-on-Trent Staffordshire ST1 5PE Telephone: 01782 219555 Fax: 01782 219666 Email: ca@hardwickes.co.uk Partners Name Email Peter Robinson F.C.A., M.A.(Oxon) peterrobinson@hardwickes.co.uk David Hall F.C.A davidhall@hardwickes.co.uk David Shaw F.C.A., BSc.(Hons) davidshaw@hardwickes.co.uk Dean Stoker A.C.A, BSc. (Hons) d.stoker@hardwickes.co.uk Ben Hall A.C.A, B.A, (Hons) ben@hardwickes.co.uk Practice Manager Name Email Pat Clarke ca@hardwickes.co.uk Consultant Name Email David Harper F.C.A davidharper@hardwickes.co.uk Etruria Old Road Stoke-on-Trent Staffordshire ST1 5PE Telephone: 01782 219555 Web design by Yellow Circle Web"
    },
    {
      "url": "https://www.wickes.co.uk/contactus",
      "text": "Get In Touch | Wickes.co.uk Online 0 Rapid Delivery within 3 hours* Skip to content Skip to navigation menu Sign-in / Register Track my order Project list Wickes Wickes Ideas & Advice Store Locator Basket Basket 0 Basket Basket 0 back to top Kitchens Wickes Bespoke Kitchens View all Ranges Kitchen Offers Kitchen Brochure Kitchen Finance View all Wickes Bespoke Kitchens Wickes Lifestyle Kitchens Shaker Kitchen Slab Kitchen J-pull Kitchen Kitchen Samples View More View all Wickes Lifestyle Kitchens Cabinets Kitchen Units Appliance Doors Decorative Panels Plinths & Cornices View More View all Cabinets Worktops & Upstands Laminate Worktops Solid Wood Worktops Splashbacks Upstands View all Worktops & Upstands Taps All Kitchen Taps Kitchen Mixer Taps Kitchen Monobloc Taps Boiling Water Taps View all Taps Sinks All Kitchen Sinks Ceramic Sinks Granite & Composite Sinks Stainless Steel Sinks View More View all Sinks Home Office Fitted Home Office Fitted Home Workspaces Home Office Design & Installation View all Home Office Accessories Cabinet Handles & Knobs Kitchen Lighting Kitchen Paint Kitchen Radiators View More View all Accessories Appliances Ovens Hobs Cooker Hoods Fridges & Freezers View More View all Appliances Design & Installation Kitchen Design & Installation Kitchen Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Bathrooms Wickes Bespoke Bathrooms View all Suites Bathroom Offers Book a Free Design Appointment Bathroom Finance View More View all Wickes Bespoke Bathrooms Bathroom Suites Cairo Scandi Miami Bathrooms Brochure View More View all Bathroom Suites Showers & Enclosures Showers Shower Accessories Shower Enclosures Shower Panels View More View all Showers & Enclosures Baths & Accessories All Baths Bath Panels Shower Baths Straight Baths View all Baths & Accessories Basins All Basins Cloakroom Basins Vanity Units Pedestal Basins View all Basins Furniture & Cabinets Cabinets & Storage Fitted Bathroom Furniture Modular Bathroom Furniture Vanity Units View all Furniture & Cabinets Toilets & Accessories All Toilets Back to Wall Toilets Toilet Seats Toilet Units View all Toilets & Accessories Taps All Bathroom Taps Bath Taps Basin Taps Tap Washers & Repairs View all Taps Accessories Bathroom Mirrors Bathroom Tiles Toilet Seats Towel Radiators View all Accessories Design & Installation Bathroom Design & Installation Bathroom Ideas & Advice Tiling Ideas & Advice Flooring Ideas & Advice View all Design & Installation Gardens & Landscaping Fencing & Gates Fence Panels Fence Posts Fencing Accessories Gates & Metal Railings View More View all Fencing & Gates Garden Maintenance Compost, Topsoil & Bark Lawn Seed & Feeds Compost Bins & Buckets Weed Membrane View More View all Garden Maintenance Garden Decor Trellis & Screening Sleepers & Raised Beds Edging & Logrolls Garden Planters View More View all Garden Decor Garden Tools Leaf Blowers Grass & Hedge Trimmers Garden Power Tools Garden Hand Tools View More View all Garden Tools Sheds Wooden Sheds Plastic Sheds Storage Boxes Greenhouses View More View all Sheds Paving & Walling Paving Slabs Block Paving Outdoor Tiles Wall Bricks View More View all Paving & Walling Decking Timber Deckboards Decking Joists & Supports Composite Decking Decking Tiles View More View all Decking Garden Watering Hose Pipes Water Butts Pressure Washers Watering Accessories View More View all Garden Watering Garden Supplies Plant Food Weedkiller Growing Accessories Weeding & Clearing View More View all Garden Supplies Garden Autumn Essentials Garden Tidy Firewood & Firelighters Patio Heaters Garden Furniture & BBQ Covers View More View all Garden Autumn Essentials Building Materials Timber Treated Sawn Planed Square Edge Treated Sawn C16 CLS Studwork View More View all Timber Sheet Materials Plywood Sheets MDF Sheets OSB Sheets Loft Boards View More View all Sheet Materials Cement & Aggregates Ballast & Sub Base Cement Sand Gravel View More View all Cement & Aggregates Plaster & Plasterboard Plasterboard Plaster Coving Plastering Adhesives View More View all Plaster & Plasterboard Insulation Loft Insulation Insulation Board Cavity Wall Insulation Insulation Foil View More View all Insulation Roofing PVC Corrugated Sheets Bitumen Sheets Roof Felt Roof Tiles View More View all Roofing Nails & Screws Screws Sealants Fixings Nails View More View all Nails & Screws Guttering & Drainage Round Line Guttering Square Line Guttering Soil Pipes & Fittings Channel Drainage View More View all Guttering & Drainage Bricks & Lintels Blocks Bricks Block Paving Concrete Lintels View More View all Bricks & Lintels Building Supplies Builders Metalwork Damp Proofing Protective Sheeting Fascias & Soffits View More View all Building Supplies Doors & Windows Internal Doors White Doors Oak Veneer Doors Pine Doors Glazed Internal Doors View More View all Internal Doors External Doors Front & Back Doors Exterior French Doors Bifold Patio Doors Garage Doors View More View all External Doors Hardware Door Handles Door Locks & Latches Door Hinges Door Knobs View More View all Hardware Windows uPVC Windows Roof Windows Velux Windows Window Security View More View all Windows Trending Internal Doors Cottage Internal Doors Black Internal Doors 1930s Internal Doors Grey Internal Doors View all Trending Internal Doors Window Accessories Window Sills Window Handles Curtain Poles Window Blinds View More View all Window Accessories Security Door Locks & Latches Door Bolts Padlocks Security Alarms View More View all Security Bedroom Furniture & Fitted Sliding Doors Sliding Wardrobe Doors Modular Wardrobes Click Fitted Furniture Bedroom Furniture View all Bedroom Furniture & Fitted Sliding Doors Fire Safety & Alarms Fire Doors Smoke Alarms Fire Door Hinges Carbon Monoxide Detectors View More View all Fire Safety & Alarms Conservatories Lean To Conservatories Edwardian Conservatories Solid roof Conservatories Victorian Conservatories View all Conservatories Flooring & Tiling Flooring by Type Laminate Flooring Luxury Vinyl Flooring Parquet & Herringbone Solid Wood Flooring View More View all Flooring by Type Laminate by Colour Grey Brown White Beige View More View all Laminate by Colour Flooring Accessories Underlay Skirting Boards Adhesives & Sealants Flooring Tools View More View all Flooring Accessories Price per m2 Flooring Offers Under £15m2 £15 to £20 per m2 £21 to £34 per m2 View all Price per m2 Flooring Samples Laminate Samples Luxury Vinyl Samples Engineered Wood Samples Solid Wood Samples View all Flooring Samples Tiles by Type Bathroom Tiles Kitchen Tiles Floor Tiles Wall Tiles View all Tiles by Type Tiles by Colour Grey White Mosaic Patterned View all Tiles by Colour Tile Accessories Tile Adhesives Tile Grout Tiling Tools Tile Trims View all Tile Accessories Tile Samples Ceramic Samples Porcelain Samples Boutique Samples View all Tile Samples Installation Services Tiling Ideas & Advice Tiling Services Flooring Ideas & Advice Flooring Services View all Installation Services Painting & Decorating Interior Paint Wall & Ceiling Paint Bathroom Paint Paint Mixing Kitchen Paint View More View all Interior Paint Brand Dulux Wickes Crown Cuprinol View More View all Brand Paint by Type Emulsion Trade Paint Metal Paint Undercoats & Primers View More View all Paint by Type Decorating Tools Paint Rollers & Trays Paint Brushes Dust Sheets Abrasive & Sanding Tools View More View all Decorating Tools Exterior Paint Masonry Paint Shed & Fence Paint Garden Furniture Paint Decking Paint View More View all Exterior Paint Wood Treatment Interior Wood Paint Varnish Wood Stain Wood Preservatives & Treatment View More View all Wood Treatment Wallpaper Bedroom & Living Room Wallpaper Decorative Wallpaper Lining Paper Wallpaper Paste & Tools View More View all Wallpaper Mouldings Wall Panelling Beading Architrave Decorative Mouldings View More View all Mouldings Shelving & Storage Storage Boxes Shelves Shelf Brackets Freestanding Shelves View More View all Shelving & Storage Samples Paint Visualiser Dulux Tester Pots Wickes Tester Pots Crown Tester Pots View More View all Samples Electrical & Lighting Interior Lights Ceiling Lights Downlights LED Tubes & Battens Spotlights View all Interior Lights Outdoor Lights Wall Lights Low Voltage Garden Lights Work Lights Security Lights View all Outdoor Lights Light Bulbs All Light Bulbs GU10 Light Bulbs Decorative Bulbs B22 Light Bulbs View all Light Bulbs Electrical Cable EV Charging Extension Leads Portable Heaters View all Electrical Switches & Sockets Dimmer Switches Indoor Sockets Indoor Switches Outdoor Switches & Sockets View all Switches & Sockets Smart Home Smart Appliances Smart Heating Smart Lighting Smart Security View all Smart Home Security & Alarms Home Security Alarms Safes & Key Safes Security Lights Safes View all Security & Alarms Portable Heating & Cooling Portable Heaters Smart Heaters Cooling Fans View all Portable Heating & Cooling Ventilation & Ducting Dehumidifiers Ducting, Vents & Airbricks Fans & Air Conditioning Extractor Fans View all Ventilation & Ducting Heating & Plumbing Plumbing Copper Pipes & Fittings Plastic Pipe & Fittings Plumbing Tools & Accessories Waste Pipes & Fittings View all Plumbing Radiators Designer Radiators Double Panel Radiators Single Panel Radiators Towel Radiators View More View all Radiators Central Heating Boilers & Boiler Packs Heating Controls Central Heating Treatment Smart Heating View all Central Heating Fires & Surrounds Coal & Logs Gas Fires Electric Fires Fire Suites View all Fires & Surrounds Portable Heating Portable Heaters Smart Heaters View all Portable Heating Tools & Workwear Power Tools Cordless Drills Power Saws Sanders Nail Guns View More View all Power Tools Hand Tools Brickworking Tools Hand Saws Plastering Tools Woodworking Tools View More View all Hand Tools Workwear & Safety Trousers & Shorts Footwear Work Gloves Dust Masks View More View all Workwear & Safety Power Tool Accessories Drill Bits Sanding Accessories Angle Grinder Discs Batteries & Chargers View More View all Power Tool Accessories Tool Storage Tool Storage Systems Tool Boxes Tool Bags Tool Chests View More View all Tool Storage Ladders & Platforms Step Ladders Extension Ladders Combination Ladders Loft Ladders View More View all Ladders & Platforms Construction & Landscaping Landscaping Tools Workbenches Wheelbarrows Cement Mixers View More View all Construction & Landscaping Cleaning Supplies Vacuum Cleaners Cleaning Tools Car & Window Cleaning Cleaning Fluids View More View all Cleaning Supplies Measuring Levelling Tools Spirit Levels Laser Measuring Tools Detectors Tape Measures View More View all Measuring Levelling Tools Equipment Motoring Hot Glue Guns Work Lights Generators View More View all Equipment Renewables & Energy Wickes Solar Why choose Wickes solar? Advantages of solar? Solar panel installation Book a free quote View all Wickes Solar Renewable Energy Products Solar Panels Air Source Heat Pumps EV Charging Stations View all Renewable Energy Products Energy Efficiency Energy Efficient Home Energy Ratings How To Improve Your Home’s EPC Rating Lighting View all Energy Efficiency Energy Saving Advice Insulation Heating Lighting Draught Proofing View all Energy Saving Advice Helpful Guides Solar PV Buying Guide Heat Pump Buying Guide How To Insulate A Loft Upcycling Furniture View all Helpful Guides Wickes Solar Solar Energy Advantages of solar View all Solar Energy Wickes Solar Why choose Wickes solar? Solar panel installation View all Wickes Solar Get a Free No Obligation Quote Solar finance Solar Panel Price Estimator View all Get a Free No Obligation Quote Help & Advice How do solar panels work? Solar energy- advantages & disadvantages Solar panel myth busting View all Help & Advice Offers The Big Event The Big Timber Event The Big Tiles Event The Big Flooring Event The Big Doors Event View all The Big Event Latest Offers The Big Kitchens Event The Big Loft Event The Big Gardens Event Building Materials Offers View More View all Latest Offers Clearance Tiles Kitchens Bathrooms Gardens View all Clearance Log In / Register Track Order Ideas & Advice Project list Home Get In Touch Get In Touch - We're Here to Help Whether you’re interested in a new Kitchen or Bathroom, want to talk about products, need help with an order or anything in between we’re here to help. Please choose which drop down option accurately describes your query and use the contact details set out within the drop down box or complete the Contact form below. Track your order Use our handy tool to see the status of your order. You can track its location whilst it is on its way to you - with or without a Wickes account. To track your Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom'. Scroll down, it's just below. With our handy order tracking tool you can see: The date your order will be delivered The delivery carrier Where each part of your order will be delivered from When your Click & Collect order is ready to collect from your local store We're unable to offer live order tracking just yet, but we'll send you a text the day before your delivery with further details on when you can expect your order to arrive. Contact our customer service team When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We are open: Monday - Saturday: 8am - 6pm Sunday: 10am - 5pm Here's some hints to help you choose the best way to contact us for your enquiry: Complete our Contact Form, scroll down, it's just below. We aim to respond to all enquiries within 48 hours. If you've received a damaged delivery or a faulty product, we'll ask you to email us some photos Use Live Chat - click ‘Chat’ on the bottom right of this page If you're unsure about what you've ordered If you've a question about our stock If you're asking about a delivery that's due today You can also call us on 0330 123 4123 If there's a queue you'll be given the option to ask for a call back. We’ll call you back when it's your turn. Contact our designed kitchen and bathroom team Wickes kitchen, bathroom or home office enquiries For enquiries about a Wickes kitchen, bathroom or home office order, please complete our contact form; selecting 'Kitchen & bathroom' as your reason for contacting us. Scroll down, it's just below. If you’d like to talk, call us on 0344 892 2721 . If you’d prefer to use Live Chat - click ‘Chat’ on the bottom right of this page. When getting in touch with us, we need to confirm we’re talking to the right person. We’ll ask you a few questions to confirm you’re the person that paid for the order. If you’d like someone else to speak on your behalf, please ensure they’ve all the information necessary to pass our required Data Protection checks. Any conversation about order amendments, including refund requests, must be with the person that paid for the order. We’re open: Monday - Friday 8am - 6pm Saturday - 8am - 4pm To book a design appointment Whether you're looking for a new kitchen, bathroom or home office; our Design Consultants have the knowledge and expertise to help you plan your space perfectly. Complete our online form Call us on: 0800 011 3031 We’re open: Monday - Friday: 9am - 8pm Saturday & Sunday: 9am - 5:30pm Community programme and charity requests We support charities and local communities in two ways: Nationally, we’re proud to be supporting The Brain Tumour Charity as our corporate charity partner.  This means we’re unable to offer monetary support to other causes. Locally, we support  the community through our Wickes Community Programme by providing products to help local charities and not for profit community groups. To apply for a product donation just head in to your local store and speak to the manager. Terms and conditions Press and media Please contact the press office at Clarion Communications on (0)20 7479 0910 or email wickes@clarioncomms.co.uk . Please note, these contact details are for media enquiries only. Complaints Our Commitment We’re dedicated to providing a professional and valued service to our customers and partners. We strive to handle customer complaints promptly and fairly. Contacting Us If you're unhappy with something, the fastest way to reach us is through our online chat service. If you'd prefer to talk, call us at 0330 123 4123 : Choose option 1 for a Wickes kitchen, bathroom or home office complaint. Choose option 3 for all other complaints. To escalate your concern, use the contact form below. Select the relevant order type and choose \"Something went wrong and I want to raise a complaint.\" We will acknowledge your complaint within 48 hours and forward it to the appropriate team. Further information might be needed to fully investigate your complaint. Alternatively, you can write to us at our registered address: Complaints Team Wickes Building Supplies Limited Vision House 19 Colonial Way Watford WD24 4JL To help us respond to you as quickly as possible, please include: Your name and address A contact phone number and email Your order number Details of your complaint with supporting photos Actions you’d like us to consider In the event that the customer services team is unable to resolve your complaint, or if you’re unhappy with the outcome, you can escalate your complaint by emailing customer.relations@wickes.co.uk , who will acknowledge your complaint within 48 hours and send it to the appropriate team. Resolution We aim to resolve your complaint at the first point of contact. Once the investigation is complete, you will be informed of the outcome. If you remain unhappy with the outcome, you can refer the decision to The Furniture and Home Improvement Ombudsman . They will review your case and may request further information from you or from us. Their decision will be binding upon us. For more information, visit fhio.org . Complaints relating to financial agreements If your complaint relates to the lender, it will be forwarded to them within five days of receipt. We will inform you once it has been sent. If the complaint is partially about the lender's actions, that part will be sent to the lender to investigate, while we will investigate the part related to the sale of the financial product and service. We will conduct a thorough and independent investigation and agree on a suitable outcome with you. Once our investigation is complete, we will inform you of the outcome. If you’re unhappy with the outcome, you can refer your complaint to the Financial Ombudsman Service . They can be contacted at: Phone: 0800 023 4567 Email: complaint.info@financial-ombudsman.org.uk Mail: Financial Ombudsman Service, Exchange Tower, London E14 9SR Contact form Required Field Reason for contacting us Order & support enquiries How can we help? To place a new order To cancel my order and request a refund Was your order placed online or in store? Online Store Product or stock availability information Order delivery or collection To view or track the status of your order, click here . Was your order placed online or in store? Online Store Select one of the below to provide more detail about your query Enquiry about my delivery Enquiry about my click & collect order My delivery is late My delivery has failed My delivery had items missing, damaged, or an incorrect quantity Please select an option To make a product guarantee claim What is the reason for your claim? Damaged product Product fault I have an enquiry not related to a specific order Something went wrong and I want to raise a complaint Wickes installed project How can we help? Make an existing order enquiry Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Make an Installation workmanship guarantee claim Does your order include a premium solid surface worktop? Yes No Something went wrong and I want to raise a complaint Bespoke kitchens & bathrooms How can we help? Make an existing order enquiry Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Book or amend a delivery date Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No Make a product guarantee claim Is your project installed by Wickes? Yes No Does your order include a premium solid surface worktop? Yes No What is the reason for your claim? Damaged product Product fault Something went wrong and I want to raise a complaint Personal information First Name Last Name Email Phone Number Postcode Additional information Please help us to resolve your enquiry as quickly as possible by providing us with photos of the product showing any visible damage or fault, your order number (if known) and any other relevant details in the fields available. Order Number Attachments Add image or document Enquiry max 2500 characters ( 2500 characters left ) Sorry, something has gone wrong when trying to send your form. Please try submitting your form again or contact our customer service team on 0330 123 4123. Submit Please enter a valid email address Thank you for signing up for emails Ways to Pay About Wickes Careers at Wickes Company History Community Programme Responsible Business CALM Wickes Corporate PLC Help & Support Get In Touch Store Locator Accessibility Rate & Review FAQs Share Your Feedback Sitemap Our Policies Returns & Refunds Security Online Modern Slavery Corporate Governance Privacy Policy Cookie Policy Your cookie settings Terms & Conditions Our Services Payments Track My Order Delivery Information Click & Collect TradePro Membership Free Design Appointment Copyright © 2025 Wickes.co.uk Wickes Building Supplies Limited, Vision House, 19 Colonial Way, Watford, WD24 4JL Company Registration No. 1840419 VAT No. 336725881"
    },
    {
      "url": "https://mynorthwest.com/uncategorized/dori-hardwick-sons/1435648",
      "text": "Hardwick & Sons Hardware heads out of Seattle to Idaho after 87 years Close Log In/Sign Up MyNorthwest Home News Sports KIRO Opinion Traffic Weather Lifestyle Podcasts LIVE Radio KIRO Newsradio 97.3 FM Seattle Sports Seattle Red News MyNorthwest News MyNorthwest Weather MyNorthwest Traffic MyNorthwest History MyNorthwest Politics Crime Blotter National News World News Money Odd News Photo Galleries Sponsored Stories Opinion Seattle's Morning News Gee and Ursula Jake and Spike John Curley Jason Rantz Sports Seattle Sports Brock and Salk Bump and Stacy Wyman and Bob Seahawks Mariners Kraken UW Huskies The Reset Podcast Tools MyNorthwest App KIRO Newsradio App Seattle Red App Seattle Sports App Search the Site Earthquake Tracker School Closings Share Photos With Us Advertise With Us Employment Contest Rules Connect Contact Us Newsletters Contests and Events Community Outreach Just Serve Facebook X (Twitter) Instagram KIRO on YouTube Seattle Sports on YouTube Seattle Red on YouTube RSS KIRO NEWSRADIO SEATTLE SPORTS Seattle Red | Log In/Sign Up News Sports Traffic Weather Podcasts Video Listen Live Menu SEATTLE NEWS ARCHIVES & FEATURES Hardwick & Sons Hardware heads out of Seattle to Idaho after 87 years Jun 28, 2019, 4:11 PM                        | Updated: Jul 1, 2019, 7:51 am Seattle's Hardwick's Hardware store is leaving after 88 years in business. The neighborhood is evolving and taxes are too high, owners say. (Courtesy of Hardwick's Hardware) (Courtesy of Hardwick's Hardware) BY DORI MONSON SHOW The Dori Monson Show is on KIRO Newsradio (weekdays Noon-3). When Hardwick & Sons first opened up, Prohibition was in full swing, jazz was the trendiest music around, and the radio was the gathering point for families in the evening. But 87 years later, the family-owned hardware store — which has stood at 42nd Street and Roosevelt Way in the U District for 81 of those years — is closing up shop. The property has officially been sold, and the Hardwicks are moving to Post Falls, Idaho. The family is not shutting the doors forever on the hardware business, however — instead, they will open up a new shop in Post Falls. Increased crime in the area played a major role in the decision. Last year, owner Dean Hardwick told the Dori Monson Show that he regularly sees violence outside of the shop. Theft has also been a huge problem for the small business. Hard times for Hardwick’s — Seattle out-taxes small business “We would find needles, and people would be tenting in our backyard, our parking lot … and plus, I’m just kind of fearful for my kids,” Hardwick said. “I have a daughter who occasionally closes out when I’m not there, and I make sure that one of our longstanding employees [is] with her to walk her to the car.” Even without the crime, selling tools, hardware, plumbing, and electrical equipment from a small shop in the era of discount chain stores and online shopping is no easy task. Hardwick said that he made “a negative $4 an hour” last year. The new plan in Idaho is to beef up the shop’s website, which Hardwick’s son — the future fourth-generation owner of the business — is busy expanding. When Hardwick and his late brother first inherited Hardwick & Sons upon their father’s passing, their mother charged a very low amount of rent so that they could add to the business while starting families of their own. Hardwick wants to do the same for his son, whom he called a diligent worker. “All my kids have a good work ethic and they’re all best friends to one another,” he said. The family is sad to say goodbye to Seattle after nearly a century of business, but they’re looking with hope toward their new home in Idaho. “I’m really sad about it, but it’s just too dangerous here,” he said. Listen to the Dori Monson Show weekday afternoons from 12-3 p.m. on KIRO Radio, 97.3 FM. Subscribe to the podcast here . Associated Press Appeals court rules Trump doesn’t have the authority to fire Copyright Office director WASHINGTON (AP) — A divided appeals court ruled Wednesday that President Donald Trump doesn’t have the authority to unilaterally remove and replace the director of the U.S. Copyright Office. A three-judge panel from the U.S. Court of Appeals for the District of Columbia Circuit voted 2-1 to temporarily block Trump’s Republican administration from firing Shira […] 13 minutes ago Associated Press Jason Esteves resigns from Georgia Senate to focus on campaign for governor ATLANTA (AP) — Democratic gubernatorial candidate Jason Esteves of Atlanta resigned from his Georgia state Senate seat Wednesday, the first of many candidates who will face that choice as they pursue statewide office in 2026. “One thing has become clear from my time in the Senate: the challenges Georgia is facing require bold solutions and […] 58 minutes ago Associated Press Study links more frequent and severe heat waves to pollution from major fossil fuel producers Fifty-five heat waves over the past quarter-century would not have happened without human-caused climate change, according to a study published Wednesday. Planet-warming emissions from 180 major cement, oil and gas producers contributed significantly to all of the heat events considered in the study, which was published in the journal Nature and examined a set of […] 1 hour ago MyNorthwest Staff I-5 on-ramp reopened after semi-truck got stuck Wednesday morning A southbound ramp on I-5 in Seattle has reopened after traffic was completely blocked during morning commutes Wednesday following a semi-truck accident. 1 hour ago Associated Press Trump loves the spotlight that comes with sports. He especially loves when it’s on him WASHINGTON (AP) — President Donald Trump couldn’t stand to cede the spotlight in 2020 as the Washington Nationals opened their pandemic-shortened season at home against the New York Yankees by having Dr. Anthony Fauci throw the first pitch. ″I think I’m doing that on Aug. 15 at Yankee Stadium,” the president said shortly before Fauci […] 1 hour ago Associated Press She was adopted into an abusive US home. Decades later, immigration policies sent her back to Brazil It sounded like freedom, like a world of possibility beyond the orphanage walls. Maria Pires was getting adopted. At 11, she saw herself escaping the violence of the Sao Paulo orphanage, leaving Brazil for America. A single man in his 40s, Floyd Sykes III, came to meet her. He signed paperwork and brought Maria home. […] 1 hour ago Sponsored Articles September is Prostate Cancer Awareness Month Prostate cancer is a very serious disease, but most men diagnosed with prostate cancer do not die from it. Many treatment options are available, especially in Seattle. 7 Steps to a Successful Retirement In 7 Steps to a Successful Retirement, CPA and advisor Brian Evans lays out a clear, principle-driven roadmap to help individuals transition from working years to a comfortable retirement. Stacey Grund Finding hope and healing at The Salvation Army’s Addiction Recovery Program The Salvation Army’s Seattle Adult Rehabilitation Program (ARP) helps people find healing and lifelong sobriety. Estate planning gains momentum as more Americans seek clarity and control As life grows more unpredictable, estate planning is emerging as a critical tool for individuals and families to protect their interests and ensure their wishes are honored. Voices beneath the waves: Orca vocalizations Recent studies suggest that Bigg's orcas may have more vocal variation than once thought. How to achieve your dream kitchen with J&M Remodel When it comes to transforming your kitchen into the heart of your home, J&M Remodel stands out as a trusted partner in the Seattle area. Close Hardwick & Sons Hardware heads out of Seattle to Idaho after 87 years Facebook < path id=\"pathAttribute\" d=\"M 8.917969 7.773438 L 367.417969 7.773438 L 367.417969 366.273438 L 8.917969\n    366.273438 Z M 8.917969 7.773438 \" /> Twitter LinkedIn Email Story Seattle, Washington, USA Contact Us Follow on Facebook Follow on Twitter Email Alerts Advertise With Us Employment Part of the MyNorthwest.com Network of Sites AIM Digital Agency © 2025 Bonneville International. All rights reserved. Terms of Use | Privacy Policy | Video Policy | Do Not Sell My Data EEO Public File Report | Copyright Infringement | Licensing FCC Public File: KIRO-FM | KIRO-AM | KTTH | \n                FCC STATION REPRESENTATIVE: Scott Blumenfeld - SBLUMENFELD@BONNEVILLE.COM 206.726.7000"
    }
  ]
}