{
  "fuentes": [
    {
      "url": "https://brisbaneharmonycentre.com.au/contact-us/",
      "email": "askus@brisbaneharmonycentre.com.au"
    },
    {
      "url": "https://brisbaneharmonycentre.com.au/contact-us/",
      "email": "orangeleavestile_01@2x.png"
    },
    {
      "url": "https://brisbaneharmonycentre.com.au/contact-us/",
      "email": "whiteleavestile_01@2x.png"
    },
    {
      "url": "https://harmonyhousepei.com/upcoming-events/",
      "email": "info@ticketpro.ca"
    },
    {
      "url": "https://harmonymusicschool.co.uk/contact/",
      "email": "info@harmonymusicschool.co.uk"
    },
    {
      "url": "https://harmonymusicschool.co.uk/contact/",
      "email": "info@your-domain.com"
    },
    {
      "url": "https://www.juventasmusic.org/board-staff",
      "email": "boxoffice@juventasmusic.org"
    },
    {
      "url": "https://www.juventasmusic.org/board-staff",
      "email": "info@juventasmusic.org"
    },
    {
      "url": "https://www.juventasmusic.org/board-staff",
      "email": "info@juventmusic.org"
    },
    {
      "url": "https://harmonyluxuryevents.com/",
      "email": "info@ndiscovered.com"
    },
    {
      "url": "https://harmonyluxuryevents.com/",
      "email": "sebastian@aldusleaf.org"
    },
    {
      "url": "https://harmonyprogram.org/our-staff-board/",
      "email": "info@harmonyprogram.org"
    },
    {
      "url": "https://projectharmony.com/about/team/board-members/",
      "email": "light-purple-bg-1199x493@2x.jpg"
    },
    {
      "url": "https://projectharmony.com/about/team/board-members/",
      "email": "light-purple-bg-1599x658@2x.jpg"
    },
    {
      "url": "https://projectharmony.com/about/team/board-members/",
      "email": "light-purple-bg-399x164@2x.jpg"
    },
    {
      "url": "https://projectharmony.com/about/team/board-members/",
      "email": "light-purple-bg-619x255@2x.jpg"
    },
    {
      "url": "https://www.harmony-themusicschool.com/team-1",
      "email": "info@harmonybangalore.com"
    },
    {
      "url": "https://harmonyprogram.org/contact/",
      "email": "info@harmonyprogram.org"
    }
  ],
  "mails": [
    "askus@brisbaneharmonycentre.com.au",
    "boxoffice@juventasmusic.org",
    "info@harmonybangalore.com",
    "info@harmonymusicschool.co.uk",
    "info@harmonyprogram.org",
    "info@juventasmusic.org",
    "info@juventmusic.org",
    "info@ndiscovered.com",
    "info@ticketpro.ca",
    "info@your-domain.com",
    "light-purple-bg-1199x493@2x.jpg",
    "light-purple-bg-1599x658@2x.jpg",
    "light-purple-bg-399x164@2x.jpg",
    "light-purple-bg-619x255@2x.jpg",
    "orangeleavestile_01@2x.png",
    "sebastian@aldusleaf.org",
    "whiteleavestile_01@2x.png"
  ],
  "nombre_sitio": "harmonylivemusic.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://brisbaneharmonycentre.com.au/contact-us/",
      "text": "Contact us - Brisbane Harmony Centre Brisbane Harmony Centre is a Covid-safe business which complies with the Queensland Government’s ‘Workers in a healthcare setting (COVID-19 Vaccination Requirements) Direction’ as a part of our workplace health and safety obligations. We aim to maintain a safe and healthy clinic for staff, clients and the wider community. Brisbane Harmony Centre Psychology for trauma and life's other challenges About us Clients Therapies We Offer Bookings Reading Work With Us Professionals Supervision Training News Contact us About us Clients Therapies We Offer Bookings Reading Work With Us Professionals Supervision Training News Contact us Brisbane Harmony Centre Psychology for trauma and life's other challenges Brisbane Harmony Centre Psychology for trauma and life's other challenges MENU Home Contact us Contact us STREET ADDRESS: Brisbane Harmony Centre Ground Floor, 6 Broadway Street, Woolloongabba POSTAL ADDRESS: Brisbane Harmony Centre PO Box 8120, Woolloongabba QLD 4102 PHONE: (07) 3148 6685 FAX: (07) 3319 4682 Follow Brisbane Harmony Centre on Facebook. Follow Brisbane Harmony Centre on LinkedIn. Parking If you are driving to Brisbane Harmony Centre, there is ample 2P street parking along Broadway Street. On the rare occasions when we are open for appointments on a Gabba event day , we will contact you before your appointment to discuss parking with you, as parking becomes 15 minutes all day along Broadway Street. Public Transport Brisbane Harmony Centre is well served by public transport. We are off Ipswich Road, which is regularly serviced by many buses including Routes 113 , 117 , 124 , 125 , 172 and 203 . We are also close to the Gabba, the Southeast Busway , and Park Road and Buranda train stations. You can get specific route advice from TRANSlink . Contact Form If you have enquiries please use our contact form. Please be aware that many of our clinicians are unable to accommodate new clients due to very high demand for our services. Please check with the clinic BEFORE you see your GP for a mental healthcare plan to ensure that the psychologist has availability. Please enable JavaScript in your browser to complete this form. Your name * First Last Contact phone number(s) * Email * Your availability during the week * Any preference for which therapist you'd like to hear from A brief explanation of how we can help * SEND Feedback We love to hear from you about your experiences with us, and we would genuinely like to know if we didn’t meet your expectations.  If you have any feedback to offer us, please use our Contact Form, and know that feedback will be reviewed in our regular clinic meeting as a whole clinic, and your concern will be addressed respectfully, empathically, and safely in the service of care and quality of our services. © Brisbane Harmony Centre TEXT Ground Floor, 6 Broadway Street Woolloongabba QLD 4102 Ph: (07) 3148 6685 PRIVACY POLICY About us Clients BACK Therapies We Offer Bookings Reading Work With Us Professionals BACK Supervision Training News Contact us"
    },
    {
      "url": "https://harmonyhousepei.com/upcoming-events/",
      "text": "Upcoming Events - Harmony House Upcoming Events The Lounge Shop Gift Card All Products Cart Checkout Redeem a Gift Card Gift Card Balance More Book an event About News Art Gallery Subscribe Contact Us Select Page Upcoming Events  Events are posted regularly, so watch for a favourite performer or group that you may want to come and see in this up-close-and-personal setting. As soon as any performance or event is listed here on the website (or in any form of advertising), tickets ARE available. Book on-line or call Ticketpro at 1-888-311-9090 . Ticket Information Ticketpro’s on-line booking system is a very efficient, safe and secure way to reserve your seats for any of our shows. To reserve seats to any of our performances, please call Ticketpro at 1-888-311-9090 or book online at Ticketpro Atlantic Tickets are final sale All tickets are subject to Ticketpro fees All tickets will be emailed — must have a valid email. If you experience any issues, please call Ticketpro first for assistance. If you require help from Harmony House staff, please call us directly at (902) 964-2255 and we will be happy to help! THANK YOU! September 2025 Inside The Wreck of the Edmund Fitzgerald/Songs of Gordon Lightfoot TWO EXTRA SHOWS ADDED! OCT 17TH AND 18TH AT 8PM September 10th to October 18th. Fifty years ago this November, the SS Edmund Fitzgerald sank beneath the icy waters of Lake Superior, taking all 29 crew members with her. This tragic shipwreck was immortalized in song by the great Canadian songwriter Gordon Lightfoot. In a Harmony House world premiere, […] Sep 10 - Oct 18 8:00 pm - 10:00 pm Facebook Twitter Linkedin Email View Detail No event found! Harmony House Live music & performances 19814 Route 2 Hunter River, PE  C0A 1N0 Google Map/Directions Tickets Upcoming Events Buy Tickets Online Buy tickets by phone at 1-888-311-9090 Social Email Facebook Instagram Twitter YouTube © Harmony House | Website by SunriseWeb.ca"
    },
    {
      "url": "https://harmonymusicschool.co.uk/contact/",
      "text": "Contact - Harmony Music School - Get In Touch Today Skip to content Call us 0114 2576780 | info@harmonymusicschool.co.uk Facebook X Instagram LinkedIn Email About 20 for 20 Caring about our Community Why Harmony Works Climate Pledge Blog Joe Bonomassa – Patron Dean Andrews – Patron 1 Year On FAQ Testimonials Tea Dance Lessons Bass Lessons Drum Lessons Guitar Lessons Keyboard Lessons Music Production Online Lessons Organ Lessons Piano Lessons Singing Lessons Theory Lessons Ukulele Lessons Group Sessions Dementia Friendly Sessions Choir Primary Schools Book Now Contact Offers FREE Lessons School Holiday Activities Contact Abby Abrames 2023-11-08T14:21:27+00:00 GET IN TOUCH WE'D LOVE TO HEAR FROM YOU Get In Touch Email: info@harmonymusicschool.co.uk Call 0114 257 67 80 My son has been having lessons at Harmony for 6 years now and my daughter for 3. Aubrey is very encouraging and supportive and really relates to the kids. I love the passion that Aubrey inspires and would definitely recommend Harmony. Top teacher, top school. Thanks for giving my kids a focus and a love of all music. You're all amazing! Karen Blackwell At nearly 50 I decided to act on a long standing desire to play the guitar! So glad I found this place to help and encourage me!!! Simon Wilkinson Alex had his first official online guitar lesson  today and loved every minute – thank you !!! Kirsty Gillespie Every lesson at Harmony Music School in my opinion is both fun and challenging, I feel I am always given the opportunity to work on anything I am finding difficult, I would recommend Harmony Music School to anyone wanting to take lessons. Karl Neal Send Us A Message Your Name (required) Your Email (required) Your Phone Number (required) Your Message × Ecclesfield Opening Hours Monday -Thursday 3.25pm – 9.00pm Friday 3.25pm -8.00pm Saturday 9.25am – 2.30pm 8 Town End Rd, Ecclesfield, Sheffield S35 9YY (Previously Kinetic and The Griffin) For privacy reasons Google Maps needs your permission to be loaded. For more details, please see our Privacy Policy . I Accept Contact Info Ecclesfield Site – 8 Town End Road, Ecclesfield, Sheffield S35 9YY. Call us 0114 257 67 80 Get Social RECENT POSTS Can music play a part in positive mental health? What does it mean to learn to sing? The  Harmonious Path to Wellbeing: How Music Lessons Benefit Your Mind, Body, and Soul Join us on Facebook Harmony Music School Company Reg No 8269207 © Copyright 2005 - |   Website by by Valley Marketing |   All Rights Reserved   |   For Privacy Policy Click here |   For T&Cs Click here Facebook X Instagram LinkedIn Email Toggle Sliding Bar Area Page load link This website uses cookies and third party services. Ok Go to Top"
    },
    {
      "url": "https://www.juventasmusic.org/board-staff",
      "text": "Board & Staff — Juventas New Music Ensemble 0 Skip to Content Home About Juventas All Upcoming Concerts Ensemble Composers Board & Staff Join Our Team Club Magenta Subscription Concerts 2025-26 Mainstage Season Neighborhood Series All Past Concerts Music for All Listen Concert Videos Discography News Press Room Composer Features Support Donate Now Supporters Annual Report Legacy Merchandise Advertise with Juventas Buy Tickets Open Menu Close Menu Home About Juventas All Upcoming Concerts Ensemble Composers Board & Staff Join Our Team Club Magenta Subscription Concerts 2025-26 Mainstage Season Neighborhood Series All Past Concerts Music for All Listen Concert Videos Discography News Press Room Composer Features Support Donate Now Supporters Annual Report Legacy Merchandise Advertise with Juventas Buy Tickets Open Menu Close Menu Home Folder: About Back Juventas All Upcoming Concerts Ensemble Composers Board & Staff Join Our Team Club Magenta Subscription Folder: Concerts Back 2025-26 Mainstage Season Neighborhood Series All Past Concerts Music for All Folder: Listen Back Concert Videos Discography Folder: News Back Press Room Composer Features Folder: Support Back Donate Now Supporters Annual Report Legacy Merchandise Advertise with Juventas Buy Tickets Board & Staff Board of Directors John A. Carey, President Andrew Wilkins, Treasurer Meghan Guidry, Clerk Minjin Chung Carson Cooman Lynn Eustis Meg Fuchs Leslie Jacobson Kaye Karen Ruymann Oliver Caplan, ex officio Staff Oliver Caplan Artistic and Executive Director Read Bio Kyla Blocker General Manager Read Bio Saskia den Boon Grant Writer and Graphic Designer Read Bio Molly Breen-Aronson Development Coordinator Read Bio Bella Kelly Arts Administration Intern Read Bio Aimee Lents Arts Administration Intern Read Bio Email Signup ATTEND A CONCERT 2025-26 Mainstage Season Buy Tickets Buy a Subscription SUPPORT JUVENTAS Donate Now Annual Report PRESS ROOM Press Releases Photos Composer Features BOX OFFICE Questions? Email boxoffice@juventasmusic.org © 2025 JUVENTAS NEW MUSIC ENSEMBLE Juventas New Music Ensemble P.O. Box 230015 Boston, MA 02123 info@juventasmusic.org"
    },
    {
      "url": "https://harmonyluxuryevents.com/",
      "text": "HOME HOME SERVICES CORPORATE GALLERY CONTACT US HOME SERVICES CORPORATE GALLERY CONTACT US More HOME SERVICES CORPORATE GALLERY CONTACT US HOME SERVICES CORPORATE GALLERY CONTACT US Telling \nUnforgettable \nStories Telling \nUnforgettable \nStories Telling \nUnforgettable \nStories Telling \nUnforgettable \nStories Let us help you organize the perfect event! GET IN TOUCH WELCOME Harmony Luxury Events & Management offers design, production and coordination for a variety of special events to suit your needs. Our motto is to think outside the box and push the limits of the imagination, at the same time indulging in a sophisticated aesthetic. ❖ Creative Director and Owner, Sophie Valdivieso , brings her background in customer service, sales and education to bring a sense of reliability, attention to detail and organization into her work, creating unforgettable stories in event design. ❖ We will help you create a one-of-a-kind affair and we look forward to hearing from you! Live Events include: weddings, anniversaries, bridal and baby showers, galas, concerts and a variety of corporate functions. ABOUT US CREATING MEMORABLE EVENTS Event planning is an art and a journey. The essence of our work is your wish. Every last detail is considered in the production of a stylish, one-of-a-kind event that will fulfill your aspirations and musings. We are dedicated to professionalism, building a trusting relationship and to your peace of mind. OUR APPROACH We will help you conceive a warm and inviting celebration that will truly create an impression and forever memories. Catering to the uniqueness of you, we bring your vision to life in an alluring atmosphere with soul. VERSATILE SERVICE Our wide range of vendors ensure you have exactly the event you want. From corporate event functions to anniversary parties to magical weddings, we help you find the event schedule that works for you. Contact us to meet with a planner and talk about our many options. Reviews FEATURED IN Social Harmony Luxury Events & Management Copyright © 2025 Harmony Luxury Events - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://harmonyprogram.org/our-staff-board/",
      "text": "Our Staff & Board - Harmony Program Skip to content DONATE Toggle Navigation About Us Our Mission & Impact Our Model Our History Our Staff & Board Programming Community-Based Instruction Ensembles Summer Camp Midwinter Intensive Scholarship Opportunities News & Media Press Program Updates Gallery Student Stories Support Us Donate Contributors Annual Gala Work With Us Current Opportunities Apply to Teach Teaching Artist Fellowship Bring Harmony to Your Community Toggle Navigation About Us Our Mission & Impact Our Model Our History Our Staff & Board Programming Community-Based Instruction Ensembles Summer Camp Midwinter Intensive Scholarship Opportunities News & Media Press Program Updates Gallery Student Stories Support Us Donate Contributors Annual Gala Work With Us Current Opportunities Apply to Teach Teaching Artist Fellowship Bring Harmony to Your Community Toggle Navigation About Us Our Mission & Impact Our Model Our History Our Staff & Board Programming Community-Based Instruction Ensembles Summer Camp Midwinter Intensive Scholarship Opportunities News & Media Press Program Updates Gallery Student Stories Support Us Donate Contributors Annual Gala Work With Us Current Opportunities Apply to Teach Teaching Artist Fellowship Bring Harmony to Your Community DONATE Our Staff & Board glenn rosko 2025-09-03T15:29:16+00:00 Our Staff & Board Our Staff Anne Fitzgibbon Founder and Executive Director Abbie Minard Executive Assistant & Operations Manager Jackie Garcia Director of Development Gracen Williams Development Associate Joanne Chang Senior Manager, Teaching Artist Training Katherine Dorosh-Walther Senior Manager, Ensembles & Partnerships Lauren Hobbs Manager, School Partnerships Danny King Manager, School Partnerships Ryan Shaw Program Assistant Board of Directors Dr. Kalmon Post, Board Chair Douglas Henck, Treasurer Adriana Diaz Evan Gogel Kevin Gore Nancy Hager Kirsten Kern Keri Jackson Kunzle Anthony McGill George Melas Chizu Mendoza Roy Niederhoffer Eliah Seton Rick Song Erin Williams Associate Board Christina Abossedgh Sarah Hernandez Shannon Huntsman Joshua Jefferies Arthur Ji Joshua Ingram Megan McGill Tamika Merise Eliot Murphy Andrew Resnick Christopher Sabaitis Mina Whangbo Join Our Mailing List Sign up for emails and stay informed of concerts, events, and other updates. * indicates required Email Address * First Name * Harmony Program 244-250 W 54th St, Ste 300 New York, NY 10019 (646) 450-0759 info@harmonyprogram.org Contact Us Financial Information Privacy Policy Terms Of Service Financial Information Privacy Policy Terms Of Service © 2025 Harmony Program - All Rights Reserved Page load link Anne Fitzgibbon Founder and Executive Director Anne Fitzgibbon is a social entrepreneur with 30 years of experience in nonprofit leadership, public policy/government, and arts education. She founded the Harmony Program while working as a policy advisor in the administration of New York City Mayor Michael R. Bloomberg and was awarded a year-long Fulbright Fellowship in 2007 to study “El Sistema,” Venezuela’s world-renowned national youth orchestra system, and adapt tenets of the model to serve children in New York City. As a leader and innovator in the field of music education, Anne has led workshops for musicians, educators, and nonprofit entrepreneurs abroad and at home at universities and conservatories, including Princeton University, Oberlin College, the Manhattan School of Music, and others. Anne holds a graduate degree in Public Affairs from Princeton University and an undergraduate degree from Barnard College. She studied clarinet at the Juilliard School through the Columbia/Barnard/Juilliard exchange program. Abbie Minard Executive Assistant & Operations Manager A writer, artist, and historian at heart, Abbie is devoted to supporting arts education and cultural institutions through storytelling and administration. She previously served as Superintendent Team Manager at Partnership Schools after several roles in public history, archives, and editorial work during college. Abbie graduated from Princeton University in 2020, concentrating in American history with a certificate in creative writing, while devoting time to music through coursework and participation in the Princeton Laptop Orchestra. She has hosted a freeform music radio program since 2017, first on WPRB, now on WFMU, and is an active performing artist, incorporating electroacoustic tap dance with art pop songwriting. Abbie has toured her music in Japan, Canada, and across the United States. Jackie Garcia Director of Development Jackie Garcia is a seasoned development professional with expertise in strategic fundraising and organizational management. Most recently, she served as Vice President of Development at Black Girls Code. Previously, Jackie worked as Director of Development at The Friends of Governors Island, where she also led as interim Executive Director. Additional work experiences at Hudson Guild, Madison Square Boys & Girls Club, and the Wildlife Conservation Society (Bronx Zoo) represent Jackie ‘s ongoing commitment to social impact and New York City. Gracen Williams Development Associate Gracen is a social impact professional with a background in non-profits and sustainability. She is a lover of the arts and music, drawing inspiration from her experience as an oboe player in her current role as Development Associate at the Harmony Program. She previously led the Food Recovery Network at Oregon State University and held a development role at Move For Hunger. She has also explored social entrepreneurship in a past fellowship at The Ripple Center. Holding dual bachelor’s degrees in Business Administration and Sustainability, Gracen is committed to creating positive social impact in her professional career. Joanne Chang Senior Manager, Teaching Artist Training Dr. Joanne Chang is an educator, administrator, and pianist with experience building and managing impactful arts programs in K–12, collegiate, and community settings. She has held teaching faculty and administrative roles at institutions including The Juilliard School, Manhattan School of Music, Nightingale-Bamford School, 92NY, Music Teachers National Association, and Indiana University. Joanne holds a Doctor of Music in Piano Performance from Indiana University and a Graduate Diploma in Collaborative Piano from The Juilliard School as a Kovner fellow. With a strong background in teaching, performing, and leadership, Joanne is passionate about combining this expertise to provide inclusive, positive impact music education experiences that center student growth and community engagement. Katherine Dorosh-Walther Senior Manager, Ensembles & Partnerships Lauren Hobbs Manager, School Partnerships Lauren Hobbs is an educator, administrator, and soprano with expertise in building and managing impactful music programs in NYC’s top-performing charter school network. She played a key role in designing and implementing the choral music program at Hudson Yards Middle School, establishing a strong foundation for voice study within the school community, and managed logistics for the Grade 3–4 and Middle School Honors Network Choir programs. As a performer, Lauren has toured internationally with the vocal ensemble Magnum Opus, presenting Fauré’s Requiem in concert at prestigious venues across Reims, Strasbourg, and Paris, France. She holds a Bachelors of Music in music education from New York University with minors in public policy and management focusing on arts administration within the nonprofit sector. Lauren is passionate about collaborating with fellow educators to build rigorous, high-performing music classrooms that prioritize musical excellence, culturally responsive teaching, and student ownership. She is committed to fostering environments where all students can thrive artistically, think critically, and develop the confidence and discipline that extend beyond the music room. Danny King Manager, School Partnerships Danny King is an accomplished educator and performer with a deep passion for supporting music education and promoting the arts. He holds a Master of Music degree in classical clarinet from the Manhattan School of Music, as well as a bachelor’s degree in both music education and clarinet performance from Illinois State University. Danny ’s diverse background includes teaching general music and band, managing performance libraries, and working in arts administration. Previously he held positions as woodwinds instructor for four consecutive marching band seasons in Illinois, woodwind coach and masterclass teacher for Illinois State University’s Junior High and High School Band Camp, and substitute teacher/teacher assistant in general education settings. In addition to his educational work, Danny is an active chamber musician based in New York City. He regularly performs with a variety of ensembles, including Hydra Winds and Delicious Bass, and is a sought-after freelance woodwind specialist. Ryan Shaw Program Assistant Ryan Shaw is an arts administrator with a background in bass trombone performance and Mandarin Chinese. His experience includes an operations internship with the Orpheus Chamber Orchestra, as well as internships and contract work at The Tianjin Juilliard School and its annual Piano Festival. He holds a master’s degree from The Tianjin Juilliard School and dual bachelor’s degrees in music performance and Chinese language & literature from Boston University. Outside of the arts, he has worked in a range of roles, including as a substitute teacher and a bilingual medical assistant, gaining experience in education and healthcare settings. Go to Top"
    },
    {
      "url": "https://projectharmony.com/about/team/board-members/",
      "text": "Board Members - Project Harmony Halfway to St. Patrick’s Day Get Involved Donate Wish List Volunteer Service League Project Be Someone 2023 Donors Careers Events News Press Services Response Services Children and Family Services Multidisciplinary Team Coordination Missing Youth Services Anti-Trafficking Services Triage Center Prevention Connections Training Resources What to Expect FAQs Protective Factors How to Report Abuse Signs of Abuse Youth Fire Setter Intervention Suicide Prevention Toolkit Online Resources Safety Tips 9 Rules for Adults 5 Steps to Protecting Our Children 8 Questions for Safer Sleepovers Common Tricks Walking Safety Halloween Safety Tips Technology Safety About Our Mission Our History Annual Report Our Team Team Partners Board Members Join Our Team Facility Dogs Training Calendar eLearning Training Development Hope Champions Podcast Request Training Hope Champions Learn Your ACE Score Building Resilience Hopeful Testimonies Donate Services Response Services Children and Family Services Multidisciplinary Team Coordination Missing Youth Services Anti-Trafficking Services Triage Center Prevention Connections Training Resources What to Expect FAQs Protective Factors How to Report Abuse Signs of Abuse Youth Fire Setter Intervention Suicide Prevention Toolkit Online Resources Safety Tips 9 Rules for Adults 5 Steps to Protecting Our Children 8 Questions for Safer Sleepovers Common Tricks Walking Safety Halloween Safety Tips Technology Safety About Our Mission Our History Annual Report Our Team Team Partners Board Members Join Our Team Facility Dogs Training Calendar eLearning Training Development Hope Champions Podcast Request Training Hope Champions Learn Your ACE Score Building Resilience Hopeful Testimonies Donate To Report Child Abuse Nebraska: 1 (800) 652-1999 Iowa: 1 (800) 362-2178 To Contact Us (402) 595-1326 Hours: Mon-Fri: 8 a.m. - 5 p.m. After hours by appointment only Board Members The mission of Project Harmony is to protect and support children, collaborate with professionals and engage the community to end child abuse and neglect. Board of Directors Chairman Mike Jung Grit Road Partners Vice-Chairman Chanda Chacón Children's Nebraska Secretary Jim Jansen Creighton University Treasurer Phil Ruden Prodigy Asset Management, LLC Bret Blackman University of Nebraska Sara Boyd Ascend Advisory LLC Tre Brashear Lozier Enterprises Amy Christensen Mutual of Omaha Anna Colón Omaha Police Department Monique Farmer Avant Solutions Dean Hollis Diventures Don Kleine Douglas County Attorney Leo Knowles McGrath North Brett Lindstrom Bridges Trust Andrea Marshall Andrea Marshall Consulting Paige Ritter Community Volunteer Anna Castner Wightman FNBO Chris Wikoff Werner Enterprises Bryan Wilson Midwest Technology Partners Debbie Wood TransWood, Inc. Ellen Wright Community Volunteer Lachelle Rankins, ex officio Project Harmony Service League Community Cabinet Cindy and Mogens Bay Annie and Ken Bird Susan A. Buffett Henry Davis Dawn and Sid Dinsdale Jane and John Ellsworth Susan and Ken Ferrarini Therese Fitzgibbons and Timothy Fitzgibbons, M.D. Kay Lynn Goldner and John Goldner, M.D. Lisa and Gary Gotsdiner Cindy and Scott Heider Gloria and Howard Kaslow Diny and Jim Landen Dianne Lozier Anne McGuire and Michael McGuire, M.D. Jeanie Neff Sandy and Dave Parker Jessie and Dean Rasmussen Jill and Bruce Rasmussen Mary Lynn and Richard Reiser Beth and Harley Schrager Terri Schrager Dee and Mike Walter Anne and Arnie Weitz Barbara and Wally Weitz Judy and Gale Wickersham Ellen and Stavely Wright Lyn Ziegenbein Service League - Board of Directors President Lachelle Rankins Vice-President Derek Laub Secretary/Treasurer Adam Heser Events Chair Jacob Enenbach Membership Chair Ryan Kalkwarf Dan Allen Tammi Bishop Deborah Boler Adam Christensen Paul Fitzgibbons Molly Harvey Minja Herian Alicia Huntington Patty Jansen Lindsey Jessen Kathy Kalkwarf Chris Kestel Carol Ketcham Monica Lanik Caitlin Mell Joani Mullin Jason Parker Lezlie Peterson Yvonne Pflug Amanda Pontow Kim Rocheville Jack Warren Joy Watanabe Pam Weekly Make A Donation Make a donation today to end child abuse. View Our Trainings Ending the cycle of abuse through education. Report Abuse Learn what to do you if you suspect abuse or neglect. Speaking of Children Register today for our annual conference and luncheon. We wish to thank you for your hospitality and the wonderful program and tour of Project Harmony. We are so fortunate to have an organization acting on the behalf of our children with such outstanding enthusiasm and dedication. - Rotary Club of Omaha Northwest Thank you so much for coming to Children’s and speaking to our staff. Your talk on “Understanding Poverty” was excellent, and I could see “wheels turning” as some staff members commented on simple ways their interactions might make a difference for children and parents. - Patty Carrell, CMSW I have felt that my input has been highly valued and respected when it comes to doing my job, and that is something that speaks volumes to the working environment here at Project Harmony. - Brenda Jewell We began collaborating with the Project Harmony through their Connections program last year, and we’ve continued the partnership. Connections represents an extremely valuable partnership and an opportunity to provide our students with a bridge to mental health services. - Papillion La Vista Community Schools Our experience and partnership with Project Harmony/Connections has been fantastic! It is a comfort knowing we have a partner who can connect our students and families with the appropriate resources in times of crisis or trauma. - Millard Public Schools This shadowing experience actually made me very interested in this field. One aspect that helped me narrow my choice of careers is the environment that Project Harmony had. It was very upbeat, cheerful and bright. - UNMC High School Alliance Program – Student Journal We would like to take this opportunity to thank Project Harmony for planning and delivering professional development to our 70 counselors, social workers and community counselors. We feel fortunate to have such a valuable resource in our community to partner with. - Millard Public Schools You have a top rate program – really national quality. I’m totally impressed. - Lisa Fontes At our last D2 Center Board meeting, I was describing the training and professional development we provide for our staff. At the top of the list was Project Harmony. Please know that you are providing an invaluable service to nonprofits in our community. - Greg Emmel Congratulations on the great media coverage of your Stewards class at Project Harmony on WOWT. You did a great job articulating the importance of prevention, and Susan was amazing too. Thank you so much for your partnership and all the important work you are doing. - Cindy McElhinney – Darkness to Light Just wanted to know that you made a difference in my life, and I will be using that momentum to make a difference in the lives of others. You are truly a rock star and a role model for me. Thank you for a new life I’m getting the chance to live. - Anonymous Many children through my caseload have received a backpack generously donated to the Project Harmony Triage Center. I have witnessed many faces light up when given the opportunity to pick out a new backpack, and I am very grateful for the generosity of the Junior League. - DHHS – Children & Family Services I have never felt as valued at other organizations like I do at Project Harmony. I really feel that the culture of a working environment is incredibly important. If an employee feels respected, valued and supported, that person will likely give more to fulfill the mission. - Javier Castellote Nick and Javier were great teachers and role players. It gave us an opportunity to see how someone in that situation would have reacted to our questions. They did a great job at showing us the difference between sympathy and empathy. - Anonymous I was able to shadow Mr. Nick Zadina. He was in charge of dealing with abused kids and help them. I am thankful to know all the information I learned during shadowing because it was eye opening. - UNMC High School Alliance Program – Student Journal The experience at Project Harmony was a deepening reminder of empathy that will be vital in my career as a nurse. I felt my perspective was widened on how others think, especially when discussing the assumptions we make. - Anonymous I didn’t know how many people work at Project Harmony, so I drew a lot to show how much Project Harmony means to me! - Project Harmony Client As difficult as a removal is on a child, the backpack they receive at Project Harmony provides a sense of belonging and hope. It truly is amazing something that seems so simple can change the perspective and shine light on these children. - DHHS – Children & Family Services Great leadership for a wonderful cause with outstanding long-term goals. Keep on doing all the good you do. - Bill & Jean O’Conner Project Harmony is the reason I started my journey in college. I just finished my associates and I'm going for my bachelors now in Child Protection and Juvenile Justice. Y'all helped my daughter back in early 2013 and I knew what I wanted to do with my life — help children. - LaLa Ann A young lady who works in our field told me that she loved what we do here at Project Harmony — she had been to Project Harmony seven years ago for a forensic interview. She said her positive experience was the biggest reason she is doing the work that she is today. - Trainee I found out that my foster son is going to have a forensic interview here at Project Harmony soon. It’s been interesting being on the other side of things and feeling so reassured that the child I care so deeply about is in very caring and capable hands. - Jessica Kroeker Nick demonstrated how one person could impact a huge group of student nurses by just attending his presentation. He gave me the reason, the courage to act, and the knowledge how to save victims that I will face in my future nursing career. - Anonymous I recently attended the Testifying Training course. Since that class I have been subpoenaed three times, and I had to testify at each hearing. Without this class I would have been less than prepared and too nervous to be credible. Thank you so much! - Jenny Lewis You are part of the solution. The cycle of abuse does not have to continue, but we can’t end it alone. Anyone has the power to be someone who makes our community a safe place for all children. make a donation Contact Media Kit Store Terms of Use Privacy Statement Anti-Discrimination Policy Newsletter Subscribers \" * \" indicates required fields First Name Last Name Email * CAPTCHA Email This field is for validation purposes and should be left unchanged. Find Us 11949 Q Street Omaha, NE  68137 Give Us a Call (402) 595-1326 Report Child Abuse Nebraska: 1 (800) 652-1999 Iowa: 1 (800) 362-2178 Accredited By"
    },
    {
      "url": "https://www.harmony-themusicschool.com/team-1",
      "text": "Meet the Team — Harmony - The Music School 0 Skip to Content About Our Vision Meet the Team Accomplishments Alumni Testimonials Collaborations News Music Programmes Voice Piano Guitar Drums Violin Music Theory IGSCE/AS & A Level/ ICSE Events Event Tickets Workshops Past Workshops Concerts Student Recitals Archives Harmony Summer Vocal Intensive The Harmony Chorus Careers Scholarships contact us Open Menu Close Menu About Our Vision Meet the Team Accomplishments Alumni Testimonials Collaborations News Music Programmes Voice Piano Guitar Drums Violin Music Theory IGSCE/AS & A Level/ ICSE Events Event Tickets Workshops Past Workshops Concerts Student Recitals Archives Harmony Summer Vocal Intensive The Harmony Chorus Careers Scholarships contact us Open Menu Close Menu Folder: About Back Our Vision Meet the Team Accomplishments Alumni Testimonials Collaborations News Folder: Music Programmes Back Voice Piano Guitar Drums Violin Music Theory IGSCE/AS & A Level/ ICSE Folder: Events Back Event Tickets Workshops Past Workshops Concerts Student Recitals Archives Harmony Summer Vocal Intensive The Harmony Chorus Careers Scholarships contact us Our Founder Sandra Oberoi, MMus, BMus, EFP Founder and Director | Curriculum Developer | Head of Voice Studies | Artistic Director – The Harmony Chorus Ms. Oberoi founded Harmony - The Music School in 2008 and presently oversees the development of our curriculum, handles continuing professional development for teachers, mentors advanced students, and directs the award-winning youth choir - The Harmony Chorus. An internationally respected music educator, international singer and researcher, she is on the Board of the International Society for Music Education and Chairs the Advocacy Committee. She remains an active member of the National Association of Teachers of Singing, USA and the National Association for Music Education, USA. She has an Estill Figure Proficiency Certificate from Estill Voice International an organisation focused on singing and vocal health. Besides performing across the world, Ms. Oberoi regularly gives keynote addresses and presentations on the benefits of music education, health of the voice, music and adolescents, philosophy of music education and teaching for creativity. She has a Masters in Music and Voice from Northwestern University, USA and is presently pursuing her doctoral studies in Music Education at the World No.1 Institute of Education, University College London. Our Team Kezevi Neihu, DipLCM Head of Academics | Theory | Voice | Violin Mr. Neihu has been involved with Harmony - The Music School since 2013. A versatile musician, he teaches music theory, voice and violin at Harmony and also instructs the ICGSE/AS/A level Music courses. He has completed all three levels of The Somatic Voicework™ certificate from LoVetri Institute for Somatic Voicework, Baldwin Wallace University and a Diploma in Music Teaching from the London College of Music. His sessions are designed to stimulate critical thinking in music and help build confidence and healthy habits in musicians of all ages. Karen Carvalho, Dip. ABRSM Head of Piano Studies | Theory | Accompanist Ms. Carvalho has a Diploma in Piano from the Associated Board of Royal School of Music and guides intermediate to advanced level pianists in their music journey. A versatile pianist herself, she is enthused by the praise she often gets for her extremely enthralling musical performances but most of all finds great joy in sharing her music gift with others and enriching their lives! Grace Maureen, DipLCM Voice | Early Childhood Music A versatile singer and gifted orator, Ms. Maureen works with children and adolescents in bringing out the best in their voices. With a Diploma in Early Childhood Studies, she is particularly drawn to young, developing voices and uses a lot of storytelling, fun and games in her sessions. Ms. Maureen is an active member of The International Society for Music Education. Tiara Michelle Oberoi, LLCM Musical Theatre | Theory Ms. Oberoi, a Musical Theatre and drama enthusiast teaches singing, acting techniques, music theory and composition. She has a Licentiate from the London College of Music in Musical Theatre and is presently studying BA (Hons) at the Royal Central School of Speech and Drama, U.K. Her composition, Lacrimosa, won the Commonwealth International Composition Challenge in 2020. Ms. Oberoi is passionate about music and acting and guides students in being confident and skilled performers by creatively combining acting and singing techniques. She is Head of Engagement at The Harmony Chorus. Mercy Kurian Voice | Theory Ms. Kurian is a gifted teacher who works with all ages. She is particularly focused on helping students with mental health issues find their purpose through singing. A talented artist, she often combines singing and art to creatively bring out the best in her students. Rokuono Neihu Piano  |  Theory |  Accompanist A passionate teacher, who enjoys working with young children, Ms. Neihu’s piano sessions are child-centred and fun enabling her to connect with a child’s imagination and cultivating creative exploration. Shakthi Sam Drums Mr. Sam has been with Harmony - The Music School since 2009 and has nurtured several top performing drummers across Bangalore. He is committed to building skill through versatile drumming techniques and practical experiences including ear training. He has created drum programs that are today used across many schools and churches to build technique and skill. Khiyan Vallikad, LTCL, DipLCM Teaching Diploma |  Piano A lawyer with a passion for music, he is now a committed piano teacher who enjoys challenging his students to think outside the box to build creativity. His teaching style is versatile and includes a blend of Western Classical and Contemporary styles enabling students to gain confidence in their instrument. Mr. Vallikad presently balances teaching, accompanying higher grade singing students and performing across Bangalore. Eric Gerald Guitar  | Bass A versatile guitar instructor, Mr. Gerald is highly skilled and has played with a number of bands across Bangalore and lends his time to several top music recording projects across the world. Naomi Suzzan Administrative Assistant Ms Suzzan offers her expertise in troubleshooting and helping students, parents and teachers remain connected with each other. Having worked with young children and being musically trained herself, she offers a fair insight on several different issues related to classes, scheduling and examinations. Manoj S Naik Support Staff Mr. Naik oversees all activities taking place in-person at Harmony and ensures that everything goes smoothly. Questions? Contact Us +91 95133 28255 +91 93436 28255 877, 7th Cross, 3rd Block Koramangala, Bangalore - 560034, India info@harmonybangalore.com ﻿ About Vision Team Accomplishments Alumni Testimonials Scholarships Music Programmes Voice Piano Guitar Drums Violin Music Theory IGSCE/AS & A Level/ ICSE Events Concerts Student Recitals Archives Collaborations News The Harmony Chorus School Policies FAQs Privacy Policy Terms of Service"
    },
    {
      "url": "https://harmonyprogram.org/contact/",
      "text": "Contact - Harmony Program Skip to content DONATE Toggle Navigation About Us Our Mission & Impact Our Model Our History Our Staff & Board Programming Community-Based Instruction Ensembles Summer Camp Midwinter Intensive Scholarship Opportunities News & Media Press Program Updates Gallery Student Stories Support Us Donate Contributors Annual Gala Work With Us Current Opportunities Apply to Teach Teaching Artist Fellowship Bring Harmony to Your Community Toggle Navigation About Us Our Mission & Impact Our Model Our History Our Staff & Board Programming Community-Based Instruction Ensembles Summer Camp Midwinter Intensive Scholarship Opportunities News & Media Press Program Updates Gallery Student Stories Support Us Donate Contributors Annual Gala Work With Us Current Opportunities Apply to Teach Teaching Artist Fellowship Bring Harmony to Your Community Toggle Navigation About Us Our Mission & Impact Our Model Our History Our Staff & Board Programming Community-Based Instruction Ensembles Summer Camp Midwinter Intensive Scholarship Opportunities News & Media Press Program Updates Gallery Student Stories Support Us Donate Contributors Annual Gala Work With Us Current Opportunities Apply to Teach Teaching Artist Fellowship Bring Harmony to Your Community DONATE Contact admin 2023-08-03T20:15:43+00:00 Contact Us Get in Touch Name * Email * Message Thank you for getting in touch! × There was an error trying to send your message. Please try again. × Submit Join Our Mailing List Sign up for emails and stay informed of concerts, events, and other updates. * indicates required Email Address * First Name * Harmony Program 244-250 W 54th St, Ste 300 New York, NY 10019 (646) 450-0759 info@harmonyprogram.org Contact Us Financial Information Privacy Policy Terms Of Service Financial Information Privacy Policy Terms Of Service © 2025 Harmony Program - All Rights Reserved Page load link Go to Top"
    }
  ]
}