{
  "fuentes": [
    {
      "url": "https://usaihc.org/board-of-directors",
      "email": "harpcomp@indiana.edu"
    },
    {
      "url": "https://usaihc.org/board-of-directors",
      "email": "harpcomp@iu.edu"
    },
    {
      "url": "https://guidetoflorida.com/jacksonville/food-drink/harps-american-pub--grill",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/jacksonville/food-drink/harps-american-pub--grill",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.harpersbrewpub.com/about-us",
      "email": "harpersbrewpub@aol.com"
    },
    {
      "url": "https://harpsamericanpub.com/deck-rentals",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://theirishharppub.com/",
      "email": "info@theirishharppub.com"
    },
    {
      "url": "https://theirishharppub.com/",
      "email": "jesse@morningstarbusinessbuilders.com"
    },
    {
      "url": "https://harpsamericanpub.com/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://harpsamericanpub.com/photos",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://harpsamericanpub.com/menus",
      "email": "filler@godaddy.com"
    }
  ],
  "mails": [
    "directory@guidetoflorida.com",
    "filler@godaddy.com",
    "harpcomp@indiana.edu",
    "harpcomp@iu.edu",
    "harpersbrewpub@aol.com",
    "info@theirishharppub.com",
    "jesse@morningstarbusinessbuilders.com",
    "name@yoursite.com"
  ],
  "nombre_sitio": "harpsamericanpub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://usaihc.org/board-of-directors",
      "text": "USA International Harp Competition USA International Harp Competition Home About About USAIHC Board of Directors Sponsors Past Competitions 13th Competition - 2025 12th Competition - 2022 11th Competition - 2019 10th Competition - 2016 9th Competition - 2013 8th Competition - 2010 7th Competition - 2007 6th Competition - 2004 5th Competition - 2001 4th Competition - 1998 3rd Competition - 1995 2nd Competition - 1992 1st Competition - 1989 Composition Contest USAIHC Ruth Inglefield Composition Contest RICC Rules & Procedures RICC Frequently Asked Questions Concert Series Noël Wan - Laureate Concert Claudia Lamanna - Laureate Concert Brandee Younger Trio - Pop & Jazz Concert All Past Concerts Harp Start About Harp Start Request a Harp Start News Harpist Renée Murphy 8th RICC Winner Announced USAIHC Winners' Recent Appointments Stage IV Concerto Announcement Francine Marseille, Executive Director All News and Press Releases Donate Susann McDonald Legacy Donation Make a Donation Membership Contact Volunteering Home / About / About USAIHC Board of Directors Sponsors Past Competitions / 13th Competition - 2025 12th Competition - 2022 11th Competition - 2019 10th Competition - 2016 9th Competition - 2013 8th Competition - 2010 7th Competition - 2007 6th Competition - 2004 5th Competition - 2001 4th Competition - 1998 3rd Competition - 1995 2nd Competition - 1992 1st Competition - 1989 Composition Contest / USAIHC Ruth Inglefield Composition Contest RICC Rules & Procedures RICC Frequently Asked Questions Concert Series / Noël Wan - Laureate Concert Claudia Lamanna - Laureate Concert Brandee Younger Trio - Pop & Jazz Concert All Past Concerts Harp Start / About Harp Start Request a Harp Start News / Harpist Renée Murphy 8th RICC Winner Announced USAIHC Winners' Recent Appointments Stage IV Concerto Announcement Francine Marseille, Executive Director All News and Press Releases Donate / Susann McDonald Legacy Donation Make a Donation Membership Contact / Volunteering / Inspiration | Appreciation | Excellence Board of Directors Home / About / About USAIHC Board of Directors Sponsors Past Competitions / 13th Competition - 2025 12th Competition - 2022 11th Competition - 2019 10th Competition - 2016 9th Competition - 2013 8th Competition - 2010 7th Competition - 2007 6th Competition - 2004 5th Competition - 2001 4th Competition - 1998 3rd Competition - 1995 2nd Competition - 1992 1st Competition - 1989 Composition Contest / USAIHC Ruth Inglefield Composition Contest RICC Rules & Procedures RICC Frequently Asked Questions Concert Series / Noël Wan - Laureate Concert Claudia Lamanna - Laureate Concert Brandee Younger Trio - Pop & Jazz Concert All Past Concerts Harp Start / About Harp Start Request a Harp Start News / Harpist Renée Murphy 8th RICC Winner Announced USAIHC Winners' Recent Appointments Stage IV Concerto Announcement Francine Marseille, Executive Director All News and Press Releases Donate / Susann McDonald Legacy Donation Make a Donation Membership Contact / Volunteering / Susann McDonald, Founder & Artistic Director Emeritus Board of Directors Elizabeth Hainen is Artistic Director of the USAIHC. She studied under Susann McDonald at the Indiana University School of Music, where she received Bachelor and Artist Diploma degrees. Hainen holds the Maryjane Mayhew Barton Chair in Harp Studies for the Curtis Institute of Music and also serves as Artistic Director for Harp at Boyer School of Music, Temple University. As Founding Artistic Director of the Lyra Society, an organization to promote new works for the harp and educate young harpists, she has provided educational outreach to hundreds of school children in urban Philadelphia. Click here to read more. Emmanuel Ceysson is Associate Artistic Director of the USAIHC. Born and raised in France, he was admitted unanimously as a student of the prestigious Paris Conservatoire at the age of 16, and over the succeeding 10 years collected the highest international distinctions and prizes. He teaches masterclasses worldwide, leading a pro-bono harp development program for Latin America in Colombia, serving as a visiting professor at the London Royal Academy of Music, and the Sibelius Academy in Helsinki, Finland, and leading his harp studios at the New York Mannes School of Music. Click here to read more. View fullsize Joyce Claflin, President & Chair View fullsize Linda Wood Rollo, Vice President & Associate Artistic Director Emeritus View fullsize Barbara Lepke-Sims, Vice President View fullsize Debra Pekin, Secretary View fullsize Jaymee Haefner, Treasurer View fullsize Heaven Fan View fullsize Emily Fife View fullsize Jung Kwak View fullsize Emily Levin View fullsize Perry Maull View fullsize Wendy Muston View fullsize Kaori Ogawa View fullsize Jill Pitz View fullsize Ann Yeung View fullsize Gillian Benet Sella View fullsize Lucy Scandrett View fullsize Donna Spears View fullsize Elzbieta Szmyt, Ex Officio View fullsize Angela Yau Home / About / About USAIHC Board of Directors Sponsors Past Competitions / 13th Competition - 2025 12th Competition - 2022 11th Competition - 2019 10th Competition - 2016 9th Competition - 2013 8th Competition - 2010 7th Competition - 2007 6th Competition - 2004 5th Competition - 2001 4th Competition - 1998 3rd Competition - 1995 2nd Competition - 1992 1st Competition - 1989 Composition Contest / USAIHC Ruth Inglefield Composition Contest RICC Rules & Procedures RICC Frequently Asked Questions Concert Series / Noël Wan - Laureate Concert Claudia Lamanna - Laureate Concert Brandee Younger Trio - Pop & Jazz Concert All Past Concerts Harp Start / About Harp Start Request a Harp Start News / Harpist Renée Murphy 8th RICC Winner Announced USAIHC Winners' Recent Appointments Stage IV Concerto Announcement Francine Marseille, Executive Director All News and Press Releases Donate / Susann McDonald Legacy Donation Make a Donation Membership Contact / Volunteering / USA International Harp Competition Vision Our vision is to be a global platform for the harp that will inspire artistic excellence, encourage personal growth, launch careers and create community between musicians and their audiences. Mission The USA International Harp Competition exists to inspire, promote, and sustain artistic excellence while fostering a broader appreciation of the harp and its repertoire. Bringing people together through the universal language of music, we enhance international and community relationships by producing our harp competition, composition contest, concert series, and educational programs. Competition Videos Visit our Youtube channel to view the USAIHC video collection. VIDEOS More than the Gold Founded in 1989 by Susann McDonald, the USAIHC is known as the foremost solo harp competition in the world, but it is so much More than the Gold . The video details the four core programs which make up the USAIHC, and also highlights our invaluable community engagement in our Host Families program. Enjoy learning about our: Solo Performance Competition USAIHC Ruth Inglefield Composition Contest Harp Start educational program Concert Series Community engagement - Host Families Dream with US(AIHC) At all levels of the USA International Harp Competition, from our Stars of Tomorrow performers to our forty contestants, dreams are what fuel each individual to reach their personal best. The USAIHC’s four programs – the Solo Harp Performance Competition, the USAIHC Ruth Inglefield Composition Contest, Harp Start educational program, and Concert Series – are the framework that allow dreams to flourish and be shared. Our Competition and Composition Contest provide the opportunity for harpists and composers to make their dreams become reality, while Harp Start and our Concert Series share these dreams with people of all ages and backgrounds through culturally enriching performances. Dream with us and consider making a donation to the USA International Harp Competition! USA International Harp Competition, Inc. P.O. Box 5008, Bloomington, IN 47407      +1 (812) 856-5715        harpcomp@iu.edu"
    },
    {
      "url": "https://guidetoflorida.com/jacksonville/food-drink/harps-american-pub--grill",
      "text": "Harps American Pub & Grill - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Jacksonville Food & Drink Harps American Pub & Grill Harps American Pub & Grill Share American Cuisine Restaurants 4070 Herschel St, Jacksonville, Florida, 32210 Send Message 904-389-5631 Vote for Us! | American Cuisine Restaurants Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Harps American Pub & Grill Visit Website harpsamericanpub.com Online Social Profiles Phone Number 904-389-5631 Location 4070 Herschel St Jacksonville , Florida , 32210 United States × Map View Get Directions Cancel FEATURED LISTINGS! Nino's Bakery & Cafe Punta Gorda, FL 33950 Website 941-833-8912 Leroy's Southern Kitchen & Bar Punta Gorda, FL 33950 Website 941-505-2489 Tarrazu Coffee Co. Coconut Creek,  33063 Website 954-890-0610 READ AND REAP! Southern Comfort With a Side of Soul! Look Good, Feel Better—The Revive Way Not Your Average Apartment Complex in Gainesville, FL (And That’s the Point) MORE TO EXPLORE! Best of Florida Voting Best American Cuisine Restaurants in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    },
    {
      "url": "https://www.harpersbrewpub.com/about-us",
      "text": "ABOUT US | Welcome to Harper's! top of page HOME WHAT'S NEW Special Event ABOUT US MENUS BEER EVENTS APPLY NOW MERCHANDISE LOCATION & CONTACT Menus (New) More... Use tab to navigate through the menu items. About Us! Harper’s Restaurant & Brewpub was founded September 6, 1997 and named after Thomas Harper O’Brien, a graduate from the Michigan Agricultural College (M.S.U.). He’s the father of Trisha O’Brien Riley another Spartan grad. Born in East Lansing. Trisha and her husband Pat bought Dooley’s in East Lansing to build the first brewpub and music venue to encompass Tom’s passion for enjoying the company of others, especially fellow Spartans. This passion drove him to recruit high school players for the M.S.U. football program, so much so, that when it was deemed that only students could help recruit, Tom went back to school at the age of 70. Today, Harper O’Brien Riley, Tom’s grandson, carries on his legacy as a true Spartan combining his love for the community with his commitment to real hospitality. This East Lansing neighborhood gathering place is truly a family affair, beginning with the Riley family, Pat, Trisha, Brittlyn (Richard), Chanelle (Michael) and Harper, laying all of the ceramic tiles on the floors and walls, to operating the business or making creative elements for the overall décor. Shelly Toth (Financial Manager), Kirk Kowalski (brewmaster), Zulma Ayala and Allen Hines (kitchen leadership team) are Harper’s extended family, ready to serve each and every customer with a smile. Along with this service comes great fun food, exclusive beer and drinks, and dancing too! Couple this loyal and devoted team with approximately 80 other ready-to-serve team players and you have a true team of professionals ready to make your day better and brighter. We Welcome Feedback Rate Us Pretty bad Not so good Good Very good Awesome Rate Us Send Thanks for submitting! ONLINE SHOP LOCATION & CONTACT CONTACT US 131 Albert Ave. East Lansing, MI 48823 E  / Harpersbrewpub@aol.com ​T  /  517-333-4040 OPENING HOURS Every day: 12:00pm-2:00am ©2020 Harper's Restaurant and Brewpub bottom of page"
    },
    {
      "url": "https://harpsamericanpub.com/deck-rentals",
      "text": "Deck Rentals Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals More Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Account My Account Sign out Sign In My Account Deck / Restaurant Rentals Deck / Restaurant Rentals Do you have an upcoming party, reunion, wedding reception, banquet, or something else? We've got you covered! Overlooking Big Fishweir Creek, our deck is a beautiful spot for a party. We will work with you and your needs ranging from catering to decorating! Contact us today for more information. (Rentals for parties of 30 or more. Reservations for any less) Hours Open today 11:00 am – 10:00 pm Rental Inquiries Rental Inquiries Name Email* This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Connect With Us Join Our Rewards Program To Receive Harps Emails! SpotOn rewards, discounts, & Harps info right to your inbox! Sign Up For Our Emails Here! Copyright © 2025 Harps American Pub & Grill - All Rights Reserved. Menus & Online Ordering Powered by College Football Saturday! We're bringing back the School Loan Special! $32* for 20 wings AND a domestic pitcher Saturdays :: 3-Close *cash discount Specials Here! This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://theirishharppub.com/",
      "text": "The Irish Harp Pub – Home Is Where The Harp Is Home Menu Entertainment Rooms Merchandise E-Gift About Contact Home Menu Entertainment Rooms Merchandise E-Gift About Contact RESERVATIONS NOTL Golf Tournament CLOSED Shaw Express Menu Make A Reservation Humane Society 50/50 Music Trivia Unplugged Patio Blues Night Live Music Open Mic Night Date Night Trad Sessions Bingo Night CLOSED Bring Fido European Football HOME IS WHERE THE HARP IS Welcome To THE IRISH HARP PUB A Message From The Founder In 2005, the heritage building that is now ours was a neglected and vacant wreck. However, I decided to take on the restoration of the site and lovingly reproduce an authentic Irish Pub in beautiful Niagara-on-the-Lake. This fourteen-month project involved shipping the entire pub and restaurant contents from Ireland. What you see today is the award-winning \"Irish Harp Pub\". Our mission is to bring you not only the true \"Irish Experience\" which is great food and beer, but most of all that unique Irish atmosphere and friendliness. All my staff is committed to making your visit to \"The Harp\" really special. Our extensive menu of home-style cooked food and a wide selection of beers and whiskies will hopefully make your visit memorable. The Irish Harp is proud to have been awarded many accolades over the years, and our constant objective is to improve our services to you on a daily basis. From my General Manager to my kitchen staff, we constantly strive to bring you a \"wee bit of Ireland\" here in the prettiest town in Canada - Niagara-on-the-Lake. Enjoy your visit - and as we say in Ireland, \"May the wind always be at your back and the road ahead be straight and narrow\". Trevor Smyth - Founder of the Irish Harp Pub From County Derry, N. Ireland 1949-2013 Read More Read Less FOOD + DRINK MENU ENTERTAINMENT CALENDAR ROOMS ABOVE THE PUB 08 September, 2025 Monday Bring Fido Daily Free Admission Event Ongoing 245 King St. Niagara-on-the-Lake All Day View Detail Facebook WhatsApp Email 09 September, 2025 Tuesday Music Trivia Weekly Free Admission Event 245 King St. Niagara-on-the-Lake 8:00 pm - 10:00 pm View Detail Facebook WhatsApp Email 10 September, 2025 Wednesday UNPLUGGED: Patio Performances Weekly Free Admission Event Live Music 245 King St. Niagara-on-the-Lake 6:30 pm - 9:30 pm View Detail Facebook WhatsApp Email 10 September, 2025 Wednesday Ryan Thomas Smelle Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 6:30 pm - 9:30 pm View Detail Facebook WhatsApp Email 11 September, 2025 Thursday Paddyman Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 7:30 pm - 10:30 pm View Detail Facebook WhatsApp Email 12 September, 2025 Friday The Feverish Lemons Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 8:30 pm - 11:30 pm View Detail Facebook WhatsApp Email 13 September, 2025 Saturday New Rising Sun Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 8:30 pm - 11:30 pm View Detail Facebook WhatsApp Email 14 September, 2025 Sunday Pat Matthews Duo Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 2:00 pm - 5:00 pm View Detail Facebook WhatsApp Email 14 September, 2025 Sunday Blues Series Repeating Event Free Admission Event Live Music 245 King St. Niagara-on-the-Lake 7:30 pm - 10:30 pm View Detail Facebook WhatsApp Email 15 September, 2025 Monday Open Mic Night Repeating Event Free Admission Event 245 King St. Niagara-on-the-Lake 7:30 pm - 10:30 pm View Detail Facebook WhatsApp Email 17 September, 2025 Wednesday Doppelgänger Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 6:30 pm - 9:30 pm View Detail Facebook WhatsApp Email 18 September, 2025 Thursday Josh Edwards Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 7:30 pm - 10:30 pm View Detail Facebook WhatsApp Email 19 September, 2025 Friday Damn Animal Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 8:30 pm - 11:30 pm View Detail Facebook WhatsApp Email 20 September, 2025 Saturday Jack van Ginger Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 8:30 pm - 11:30 pm View Detail Facebook WhatsApp Email 21 September, 2025 Sunday NOTL Golf Tournament Repeating Event Special Ticketed Event 245 King St. Niagara-on-the-Lake 9:00 am View Detail Facebook WhatsApp Email 21 September, 2025 Sunday Fiddlin’ Around Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 2:00 pm - 5:00 pm View Detail Facebook WhatsApp Email 22 September, 2025 Monday Grass Mud Horse Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 7:30 pm - 10:30 pm View Detail Facebook WhatsApp Email 24 September, 2025 Wednesday The Black Sheep Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 6:30 pm - 9:30 pm View Detail Facebook WhatsApp Email 25 September, 2025 Thursday The Other Band Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 7:30 pm - 10:30 pm View Detail Facebook WhatsApp Email 26 September, 2025 Friday Right Proper Lads Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 8:30 pm - 11:30 pm View Detail Facebook WhatsApp Email 27 September, 2025 Saturday Patsy & The Muscle Repeating Event Band Profile Live Music 245 King St. Niagara-on-the-Lake 8:30 pm - 11:30 pm View Detail Facebook WhatsApp Email Join Our INNER CIRCLE Get early reservation access to our special events, receive member-only offers & enter into our weekly $25 gift card giveaway. Subscribe Our Location 245 King St. Niagara-on-the-Lake (905) 468-4443 info@theirishharppub.com ACCESSIBILITY The pub is wheelchair accessible. Handicap bathrooms are available. Hours of Operation Monday 11:00 am - Midnight Tuesday 11:00 am - Midnight Wednesday 11:00 am - Midnight Thursday 11:00 am - Midnight Friday 11:00 am - 1:00 am Saturday 11:00 am - 1:00 am Sunday 11:00 am - Midnight Recent Reviews Designed & Maintained by Morningstar Business Builders"
    },
    {
      "url": "https://harpsamericanpub.com/",
      "text": "Harps American Pub & Grill - Pub, Great Food Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals More Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Account My Account Sign out Sign In My Account HARPS\nAmerican Pub & Grill HARPS\nAmerican Pub & Grill HARPS\nAmerican Pub & Grill HARPS\nAmerican Pub & Grill Overlooking Big Fishweir Creek, we've been Jacksonville's home for great food & good times for 30+ years! #HarpsRiverside 904-389-5631 HARPS\nAmerican Pub & Grill HARPS\nAmerican Pub & Grill HARPS\nAmerican Pub & Grill HARPS\nAmerican Pub & Grill Overlooking Big Fishweir Creek, we've been Jacksonville's home for great food & good times for 30+ years! #HarpsRiverside 904-389-5631 Grab a HARPS Gift Card today! Looking for the perfect gift? Our gift cards are the best way to show your biggest HARPS fan you care! Purchase Gift Card HERE Location 4070 Herschel St, Jacksonville, FL 32210 (904) 389-5631 Hours Open today 11:00 am – 10:00 pm Look inside to see why WE'VE been everyone's neighborhood favorite for over 30 years! sEE OUR MENU Join Our Rewards Program To Receive Harps Emails! SpotOn rewards, discounts, & Harps info right to your inbox! Sign Up For Our Emails Here! Copyright © 2025 Harps American Pub & Grill - All Rights Reserved. Menus & Online Ordering Powered by College Football Saturday! We're bringing back the School Loan Special! $32* for 20 wings AND a domestic pitcher Saturdays :: 3-Close *cash discount Specials Here! This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://harpsamericanpub.com/photos",
      "text": "Photos | Harps American Pub & Grill Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals More Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Account My Account Sign out Sign In My Account Look and see why we’re a neighborhood favorite! Follow Our Instagram @HarpsRiverside Discover What Our Diners Are Raving About! Join Our Rewards Program To Receive Harps Emails! SpotOn rewards, discounts, & Harps info right to your inbox! Sign Up For Our Emails Here! Copyright © 2025 Harps American Pub & Grill - All Rights Reserved. Menus & Online Ordering Powered by College Football Saturday! We're bringing back the School Loan Special! $32* for 20 wings AND a domestic pitcher Saturdays :: 3-Close *cash discount Specials Here! This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://harpsamericanpub.com/menus",
      "text": "Menus Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals More Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home Photos About Menus & Online Ordering Beer & Wine Live Music/Events Deck Rentals Account My Account Sign out Sign In My Account HARP’S KIDS MENU HARP'S KIDS COLORING MENU ONLINE ORDERING ORDER HERE! Welcome to Harps American Pub & Grill - where great food meets great company! Copyright © 2025 Harps American Pub & Grill - All Rights Reserved. Menus & Online Ordering Powered by College Football Saturday! We're bringing back the School Loan Special! $32* for 20 wings AND a domestic pitcher Saturdays :: 3-Close *cash discount Specials Here! This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}