{
  "fuentes": [
    {
      "url": "https://www.farmcreditfl.com/about-us/leadership",
      "email": "admin@farmcreditfl.com"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "jillian@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "julie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "natalief@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "allyson@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "breanne@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "caroline@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "cassidee@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "charreese@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "delite@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "genevieve@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "info@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "jesse@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "john@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kellie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kiffen@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "kristen@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "lily@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "madeleine@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "molly@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "natalie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "paula@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "rob@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "sean.kontos@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "stephanie@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "susan@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "taylor@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "thea@farmfreshri.org"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "email": "turon@farmfreshri.org"
    },
    {
      "url": "https://www.buckeyeranch.org/contact-us/",
      "email": "fostercarereferrals@buckeyeranch.org"
    },
    {
      "url": "https://www.buckeyeranch.org/contact-us/",
      "email": "fostercarereferralscincinnati@buckeyeranch.org"
    },
    {
      "url": "https://www.hastingshealth.co.nz/contact-us",
      "email": "hastingshealth@hhc.co.nz"
    },
    {
      "url": "https://www.hastingshealth.co.nz/contact-us",
      "email": "hastingshealth@hhc.co.nz"
    },
    {
      "url": "https://www.hastingshealth.co.nz/contact-us",
      "email": "havelocknorthhealth@hhc.co.nz"
    },
    {
      "url": "https://www.hastingshealth.co.nz/contact-us",
      "email": "reception@clivemed.co.nz"
    },
    {
      "url": "https://upperhastingsranch.org/contact-us",
      "email": "contact@sansoxygen.com"
    },
    {
      "url": "https://upperhastingsranch.org/contact-us",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://upperhastingsranch.org/contact-us",
      "email": "gmasuda@cityofpasadena.net"
    },
    {
      "url": "https://upperhastingsranch.org/contact-us",
      "email": "nsullivan@cityofpasadena.net"
    },
    {
      "url": "https://www.growthspotter.com/news/osceola-county-developments/gs-news-hastings-coon-lake-20201222-vptuwlg47zbrtfugjx6xmosbbq-story.html",
      "email": "lkinsler@growthspotter.com"
    },
    {
      "url": "https://www.growthspotter.com/news/osceola-county-developments/gs-news-hastings-coon-lake-20201222-vptuwlg47zbrtfugjx6xmosbbq-story.html",
      "email": "lkinsler@growthspotter.com"
    },
    {
      "url": "https://ranchowl.com/contact-us/",
      "email": "info@ranchowl.com"
    },
    {
      "url": "https://www.hastingsgroup.uk/contact-us",
      "email": "pr@hastingsdirect.com"
    },
    {
      "url": "https://www.partyslate.com/venues/hastings-ranch-farm",
      "email": "contact@partyslate.com"
    }
  ],
  "mails": [
    "admin@farmcreditfl.com",
    "allyson@farmfreshri.org",
    "breanne@farmfreshri.org",
    "caroline@farmfreshri.org",
    "cassidee@farmfreshri.org",
    "charreese@farmfreshri.org",
    "contact@partyslate.com",
    "contact@sansoxygen.com",
    "delite@farmfreshri.org",
    "filler@godaddy.com",
    "fostercarereferrals@buckeyeranch.org",
    "fostercarereferralscincinnati@buckeyeranch.org",
    "genevieve@farmfreshri.org",
    "gmasuda@cityofpasadena.net",
    "hastingshealth@hhc.co.nz",
    "havelocknorthhealth@hhc.co.nz",
    "info@farmfreshri.org",
    "info@ranchowl.com",
    "jesse@farmfreshri.org",
    "jillian@farmfreshri.org",
    "john@farmfreshri.org",
    "julie@farmfreshri.org",
    "kellie@farmfreshri.org",
    "kiffen@farmfreshri.org",
    "kristen@farmfreshri.org",
    "lily@farmfreshri.org",
    "lkinsler@growthspotter.com",
    "madeleine@farmfreshri.org",
    "molly@farmfreshri.org",
    "natalie@farmfreshri.org",
    "natalief@farmfreshri.org",
    "nsullivan@cityofpasadena.net",
    "paula@farmfreshri.org",
    "pr@hastingsdirect.com",
    "reception@clivemed.co.nz",
    "rob@farmfreshri.org",
    "sean.kontos@farmfreshri.org",
    "stephanie@farmfreshri.org",
    "susan@farmfreshri.org",
    "taylor@farmfreshri.org",
    "thea@farmfreshri.org",
    "turon@farmfreshri.org"
  ],
  "nombre_sitio": "hastingsranchandfarm.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.farmcreditfl.com/about-us/leadership",
      "text": "Leadership | Farm Credit of Florida Skip to main content Farm Credit of Florida Menu Main navigation Loans & Services Open Loans & Services Farm Loans Home Loans Land Loans Equipment Loans & Leasing Crop Insurance Next Generation Farmers Member Benefits Open Member Benefits Account Management Patronage Program Payment Options Locations About Us Open About Us Leadership Financial Reports Careers Customer Reviews Real Estate Agent Resources Apply Now Secondary Navigation Contact Us Digital Banking English Español Search Enter keywords here... Leadership Breadcrumb Home About Us Leadership Agriculture is Local. So Are Our Decision Makers. When you are a Farm Credit of Florida member you have the financial and agricultural experience and strength of our local leadership beside you. We are strategically advised by some of the best and most successful thought leaders in the agricultural industry. Our Board of Directors and Executive Leadership Team work diligently to maintain an efficient and sound Association all while keeping one thing in mind... your success. Board Executive Leadership Team Wayne Simmons Board Chairman Wayne H. Simmons , Chairman, is a citrus grower, certified crop advisor, timber farmer, realtor, and rental property owner from LaBelle, Florida. He is an owner and President of Simmons Family Grove, Inc.  He is an owner and manager of LaBelle Fruit Company, LLC, LaBelle Housing Company, LLC and LaBelle Timber Company, LLC. Mr. Simmons is a Broker Associate of Southern Heritage Real Estate and Investments, and with Greene Forest & Farm Realty, LLC.  He is a Director and President of the Gulf Citrus Growers Association.  Mr. Simmons is a Director of Florida Citrus Mutual, and a member of Florida Gulf Coast University Agriculture Advisory Committee.  Mr. Simmons is a past Director of the Citrus Research and Development Foundation. He is also a member of the Hendry County Farm Bureau and the Realtors Land Institute.  Mr. Simmons serves on the Board of the National Agricultural Research, Extension, Education and Economics Advisory Board – Citrus Disease Subcommittee. Mr. Simmons was elected to the Farm Credit of Florida board in 2014 and his term of office is 2023 - 2026.  He also serves on the AgFirst District Advisory Committee.  Mr. Simmons serves as chair of the  Executive Committees. See Bio Marty McKenna Vice Chairman Martin J. “Marty” McKenna is a citrus grower and operates McKenna Brothers, Inc., a privately owned citrus and harvesting operation.  He has ownership in Dixie Belle Grove Partnership, Tombstone Grove Partnership, JMCK Enterprises, LLC, New Port Groves Partnership, EdMac Partnership, and McKenna Family Enterprises, LLC.  Mr. McKenna is a Director, Officer, and has ownership interest in McKenna Brothers, Inc., McKenna & Associates Citrus, Inc., McKenna Harvesting, Inc., and Poachers Hammock Grove, Inc.  He manages Firetower Grove Partnership.  Mr. McKenna serves on the Board of Florida’s Natural Growers.  He is President and an Officer of Orange Growers Marketing Association, Inc. He is a former Chairman and currently serves on the Florida Citrus Commission.  Mr. McKenna was elected to the Farm Credit of Southwest Florida board in 2009.  His current term of office is 2024-2027.  He serves as Chairman of the Credit/Lending Committee. He is also on the Executive and Governance Committees. See Bio Toby Basore Tobin J. “Toby” Basore is a vegetable grower in Western Palm Beach County.  He is an owner and manager of TKM Bengard Farms, LLC, a vegetable grower and packing company, and Cypress Cooling, LLC, a vegetable cooling and shipping company.  He is an owner and President of TKM Farms, Inc., a vegetable grower and packing company and an owner and senior officer of TKM Management, Inc.  He is a Director of the Florida Fruit and Vegetable Association (and serves as Director and past Chairman of the Florida Vegetable Exchange), and a past Director of the Wedgworth Leadership Institute Alumni Association, a graduate of the Wedgworth Leadership Institute and a member and past Director of the Leadership Palm Beach County organization.  Mr. Basore was elected to the Farm Credit of Florida board in 2014 and his current term of office is 2023 - 2026.  He is a current member of the Credit/Lending and Governance Committees.  He also serves on the AgFirst Legislative Advisory Committee. See Bio Roger Davis Roger W. Davis is a tobacco, corn, timber farmer, and cattle rancher based in Alachua County. He is owner, President and Director of R & H Farms, Inc. He owns CWH Land, LLC and RFD Land, LLC, and is an owner and Managing Partner of 848 Land, LLC.  He is a member of the SHARE Council at the University of Florida and a member of Florida Farm Bureau.  Mr. Davis was elected to the Farm Credit of North Florida board in 1998 and his current term of office is 2025 - 2028.  He is on the Audit Committee, he also serves on the AgFirst Nominating Committee. See Bio Eric Hopkins W. Eric Hopkins , is a sugarcane and vegetable grower in Western Palm Beach County, employed by, and part owner of, Hundley Farms, Inc.  He is the Board Chairman of Pioneer Growers Cooperative and serves as Director on the Boards of Hundley Farms, Inc., Frontier Produce, Inc., Double H Farms, Inc., Florida Fruit and Vegetable Association, and Law Enforcement Assistance Foundation, a fund raising organization.  He is President of Sunshine Sweet Corn Farmers of Florida. He serves as a Director of Elberta Logistics International, LLC, an agricultural transport business, is an owner and managing member of Many H’s, LLC, an agricultural transport business, and is an owner and managing member of American Berry Company, LLC, a blueberry growing business.  Mr. Hopkins had previously held elected director positions on the Boards of Farm Credit of South Florida and Farm Credit of Florida from 2009 until 2013.  During this time, he was a member of the Audit Committee. On January 30, 2014, the Board appointed Mr. Hopkins as an appointed stockholder director, a position established under the Bylaws and his current term of office is 2023 - 2026. Mr. Hopkins is a current member of the Compensation and Executive Committees. See Bio Bob Lines Bobby G. “Bob” Lines , is a cattle rancher, as well as a Bahia sod and seed producer in Palm Beach, Martin, and Okeechobee Counties.  Mr. Lines co-owns and operates Agricultural Land Services, Inc. and Lines Ag Properties, LLC.  He is a grassing contractor that provides sodding and seeding services to various government projects.  Additionally, he supervises 4L Land & Cattle, LLC which is a beef cattle cow-calf operation.  He is also a past Director and past President of the Florida Quarter Horse Association and is a current National Director Emeritus of the American Quarter Horse Association.  Mr. Lines was originally appointed to the Farm Credit of Florida board in 2015 for a term that expired in 2016, and his current term of office is 2024-2027. Mr. Lines serves on the Credit/Lending, Governance and Executive Committees. See Bio John Newbold, III John R. Newbold, III owns, operates and is President of Forest Groves, Inc., a cut-foliage farm and vineyard.  He is an owner and manager of Newbold Farms, LLC. He is a Director of the Putnam County Fair Authority.  He serves as Director and President of the Florida Wine and Grape Growers Association, and is a Director of the Viticulture Advisory Council, the Crescent City Cemetery Association, and the Florida Wildflower Cooperative.  He serves on the Board of Supervisors of the Putnam County Soil & Water Conservation District, and on the Board of Trustees of the Putnam First Cancer Fund.  Mr. Newbold was elected to the Farm Credit of Florida board in 2014 and his current term of office is 2023 - 2026.  Mr. Newbold serves as chair of the Compensation Committee and is a current member of the Executive Committee. See Bio Hal Phillips Harrell H. “Hal” Phillips, Jr. is a cattleman and veterinarian in Levy and Marion Counties.  Dr. Phillips owns and operates Phillips Ranch, a ranching and background / stocker operation, with almost 1,200 breeding age beef cattle and background approximately 1,000 calves annually.  The ranch also produces hay, sod, grass seed, small grains, and timber. Dr. Phillips has 37 years of experience as a veterinarian.  He serves as Director, and is past President, of both the Florida Cattlemen’s Association and the Marion County Cattlemen’s Association.  Dr. Phillips is a past Director of the National Cattlemen’s Beef Association.  He serves as Director on the Southeastern Youth Fair Board.  He was originally appointed to the Farm Credit of Florida board in 2015 for a term that expired in 2016, and then was elected to serve a term of office from 2016 – 2017.  His current term of office is 2023 - 2026.  Dr. Phillips is a current member of the Governance and Compensation Committees. See Bio Francisco Pines Francisco J. Pines serves as an Outside Director of the Association.  He is the founder and managing partner of Francisco J. Pines, PA, a law firm in Coral Gables, Florida, that specializes in the protection of constitutional property rights and the representation of property owners, ranchers, growers, and business owners in eminent domain proceedings.  In addition to his property defense practice, he acts as preferred title agent to national developers in connection with real estate transactions and land use and development counsel for large scale planned communities.  He holds various leadership roles in family-owned entities involved in agriculture and commercial real estate.  Mr. Pines served two terms on the Florida Citrus Commission and is a graduate of the Wedgworth Leadership Institute Class V.  He was originally appointed to the Board in 2022 for a term which expired in 2023. His current term of office is 2023 – 2026. Mr. Pines serves on the Compensation and Credit/Lending committees. See Bio Barney W. Rutzke, Jr. Barney W. Rutzke, Jr. is a member of a family that has been farming and ranching in Florida since 1907.  He is the current owner of Railroad Nursery, Inc., Everglades Swamp Tours, Outback Ranch and Caloosa Plant Farms.  Barney Rutzke, Jr. currently serves on the Florida Farm Bureau Federation Board, is the Past-President/Current Board Member of Dade County Farm Bureau, the Past-President/Current Board Member of the Miami-Dade Chapter of the FNGLA, a Board member on the Miami-Dade Agricultural Practices Advisory Board, sits on the Advisory Committee for UF/IFAS Tropical Research Extension Center (TREC) and is on the Board of the Hendry County Farm Bureau.   Mr. Rutzke is serving his first term on the Farm Credit of Florida Board of Directors, with his current term running from 2025 to 2028. He serves on the Audit and Credit/Lending Committees. See Bio Bobby Sexton Robert G. “Bobby” Sexton is a citrus grower from Vero Beach, Florida. He is the owner, a Director and President of Oslo Citrus Growers Association, Inc. He is co-owner and serves as Chairman of Oslo Packing Company and Sexton Inc., family real estate companies. He is co-owner and serves as a Director on the Board of Lost Legend, LLC. He is a shareholder and also serves as a Director on the Board of the Federal Agricultural Mortgage Corporation (Farmer Mac). He serves on the Board of the Scholarship Foundation of Indian River County and the Indian River Citrus League. Mr. Sexton was elected to the Farm Credit of South Florida board in 1995 and his current term of office is 2025 - 2028. He is a current member of the Audit and Governance Committees. See Bio Lisa Sherman Alisa “Lisa” Sherman operates a beef cattle operation in Highlands County and is a Certified Public Accountant in Lake Placid. Ms. Sherman is an officer and serves on the board of Lake Childs Citrus, Inc., The Great Fruit Company, Inc., Highlands County 4H Club Foundation, Inc., Embassy Ministries, Inc., Good Care Home, Inc., and Lisa Sherman, CPA, P.A.  Ms. Sherman is an officer of Citrus Marketing Services, Inc.  She had previously held an Outside Director position on the boards of Farm Credit of Southwest Florida and Farm Credit of Florida from 2008 until May 2014.  On May 29, 2014, the board appointed Ms. Sherman as an appointed stockholder director, a position established under the Bylaws and her current term of office is 2023 - 2026. Ms. Sherman serves as chair of the Audit Committee and is a current member of the Compensation and Executive Committees. See Bio Don Tanner Donald G. \"Don\" Tanner Jr. operates Oak Hill Farms Cattle Company, which is a cow/calf and stocker operation in Callahan, FL.  He has a three generation relationship with Farm Credit. His family (grandparents and parents) produced hay and cattle and were contract poultry growers for what became Tyson Foods, Inc. in Jacksonville, where he worked in management for the company itself in live production, plant operations, and ultimately Controller of the Jacksonville Complex. He is Controller at reforestation contractor Mizell Development, Inc., and President of Oak Hill Farms Cattle Company. He currently serves as a Director of Farmers Federal Credit Union where he was past chair of the Supervisory Committee. He is a Director of Nassau County Farm Bureau and current member of the Florida Farm Bureau Beef Advisory Committee. He is a past Officer/Director and current member of the Nassau County Cattlemen's Association and past Director/Trustee and current member of the Northeast Florida Fair Association. Mr. Tanner is also a Public Arbitrator with the Financial Industry Regulatory Authority (FINRA). He was elected to the Farm Credit of Florida Board in 2021, and his current term of office is 2024-2027. Mr. Tanner is a member of the Audit and Compensation Committees.  Mr. Tanner serves as the Board Cybersecurity Specialist and holds the National Association of Corporate Directors (NACD) CERT Certificate in Cybersecurity Oversight. See Bio Amanda Taylor Amanda E. Taylor serves as an Outside Director of the Association. She is co-founder and partner of Houston Taylor, PLLC, a law firm in St. Petersburg, Florida.  She is a member of Taylor Farms, LLC, a commercial cow/ calf operation.  Ms. Taylor serves on the Board of the Florida State Fair Authority and is a graduate of the Wedgworth Leadership Institute. She was appointed to the Board on February 23, 2022, and her current term of office is 2024 - 2027. Ms. Taylor serves on the Credit/Lending and Executive committees. See Bio John Gregory Chief Executive Officer John Gregory joined Farm Credit of Florida as President/Chief Executive Officer, February 2025. John Gregory brings a wealth of experience in the banking and financial services industry. Before joining Farm Credit of Florida, John spent 12 years at Farm Credit of Northwest Florida, including three years as President/CEO. Throughout his career, he has worked with farmers and ranchers nationwide, holding various leadership positions within the agriculture focused financial services sector. His extensive background includes roles as a loan officer, special assets manager and capital markets officer, providing him with a deep understanding of Farm Credit and its mission. A second-generation Floridian and a member of the Florida Bar, John graduated from Florida State University and earned his law degree from the University of Montana. See Bio Clint Bower Chief Lending Officer Clint serves as Chief Lending Officer for Farm Credit of Florida. He leads teams in lending, marketing, and crop insurance and ensures that providing exceptional customer experience is at the core of the Association's business development initiatives. He began his career in the financial services industry in 2001 and has served in various lending roles. Prior to joining Farm Credit of Florida, he was the Chief Business Development Officer with Farm Credit of New Mexico. With nearly a decade of senior management and executive-level experience, Clint joined Farm Credit of Florida in 2022 as Chief Lending Officer. See Bio Ronald (Ron) Brame Jr. Chief Credit Officer Ron serves as Chief Credit Officer for Farm Credit of Florida. He oversees the credit risk management process, ensuring the soundness of lending decisions and the overall health of the Association's loan portfolio. Ron started his professional journey with Farm Credit of South Florida as a Commercial Loan Officer. He later worked as a lender at commercial banks before rejoining Farm Credit of Florida in 2012 as a Corporate Lender. With time, he shifted his focus towards Credit Administration and Management, and in 2024, he was selected to become the Association's Chief Credit Officer. See Bio Laura Craker Chief Financial Officer Laura joined Farm Credit of Florida as Chief Financial Officer in June 2012 and was previously employed by community banks in South Florida as Chief Financial Officer and Director of Accounting.  Laura earned a Bachelor of Science Degree in Accounting from Florida State University and a Masters of Business Administration Degree from Florida International University.  She is also a licensed Certified Public Accountant in the State of Florida. See Bio Dawn Goodspeed Chief Technology Officer Dawn is the Director of Loan Operations and Information Technology for Farm Credit of Florida and has served in the Farm Credit System for over 31 years. Dawn began her career with Farm Credit of South Florida in 1989 as an Accountant, and soon became Assistant Operations Manager, managing the accounting, finance, and daily operations. Named Controller of Farm Credit of South Florida in 2003, she served in that capacity for several years. With 31 years experience in Accounting, Operations and recently serving as Administrator for the IT Department, Dawn was named the Director of Loan Operations and Information Technology for Farm Credit of Florida. See Bio Roland Kampf Chief Risk Officer In April 2012, Roland Kampf joined Farm Credit of Florida bringing with him over 23 years of Farm Credit experience.  Roland began his career as an Examiner with the Farm Credit Administration, and has held several positions at various Farm Credit System institutions. See Bio Donna Manion Chief Human Resources Officer Donna serves as Chief Human Resources Officer for Farm Credit of Florida. She leads the Association’s human resources strategy, focusing on culture, talent development, and organizational effectiveness to support long-term business success. She began her career in human resources leadership across industries including finance, media, and nonprofit. Prior to joining Farm Credit of Florida, she was Vice President of Human Resources at Suncoast Credit Union, where she led transformative initiatives in people strategy and technology integration. Donna joined Farm Credit of Florida in 2025 as Chief Human Resources Officer. See Bio Farm Credit of Florida 11903 Southern Blvd. Suite 200 West Palm Beach , FL 33411 Tel: (800) 432-4156 Fax: (561) 965-9099 NMLS: 453938 Footer Navigation Capitalization Bylaws Ethics Statement Disclosures Privacy Policy CCPA Careers Social Links Instagram Facebook Twitter LinkedIn Equal Housing Lender © 2025 Farm Credit of Florida"
    },
    {
      "url": "https://www.farmfreshri.org/about/staff-board/",
      "text": "Staff & Board Farm Fresh Rhode Island A hub for local food since 2004 VISIT US Welcome Event Rental Opportunities About Our Building Our Co-Locators PROGRAMS Bonus Bucks Farmers Markets Farm to School & Community Education Harvest Kitchen Hope’s Harvest Market Mobile ABOUT Mission History Staff & Board Job Opportunities SUPPORT Donate Asparagus Fest Local Food Fest Volunteer NEWS STAFF & BOARD All Staff Board Members Madeleine Pugsley Data Management Community Education AmeriCorps Direct Service Member ☓ Madeleine Pugsley Madeleine grew up in Los Angeles, cooking, singing, and staging elaborate home theatricals with their little sister. They moved to New Mexico to study philosophy and the history of science at St. John’s College, graduating in 2022. An avid bibliophile, they have worked as a private tutor, a college housing coordinator, and four years as a library assistant. In 2023, Madeleine was caught by the siren song of small-scale sustainable agriculture, moving to Maine to be a farm apprentice with MOFGA. They are thrilled to combine their passion for cooking, community, and mother earth’s gifts at Farm Fresh Rhode Island. Natalie Faragon Food Access Operations Manager ☓ Natalie Faragon Natalie (she/her/hers) is from Long Island, New York. From a young age, she helped tend her family’s vegetable garden and learned to cook with whole, fresh produce. Her passion for food and service inspired her to move to Providence in 2015 to attend Johnson & Wales University, where she earned a degree in Restaurant, Food, and Beverage Management. Natalie is a part time yoga instructor at two local studios and enjoys connecting with her students by teaching mindfulness and movement practices. She lives in Providence with her partner, and in her free time, she enjoys hiking, reading, eating ramen, and playing video games. Sheila Brush Board of Directors, Secretary Retired, Former Director of Programs, Grow Smart RI ☓ Sheila Brush “Farm Fresh Rhode Island does two things that I care deeply about — supporting and strengthening our local farms and working to ensure that all Rhode Islanders, regardless of income, can enjoy the benefits of healthy local food. I have long admired the way Farm Fresh uses resources creatively, effectively, and efficiently to achieve its mission. As Farm Fresh launches new and exciting initiatives, I welcome the opportunity to help advance its work.” Natalie Varrallo Managing Director ☓ Natalie Varrallo Natalie is a food scientist, advocate, and educator focused on improving sustainability and food security, primarily within marginalized communities. She has a Bachelor of Science in Botany and Sustainable Agriculture, a Sustainable MBA, a Master of Science in Food Justice, and a Master of Science in Sustainable Food Systems. Natalie has spent her career working in many different facets of the food system. Her approach to work seeks to combine social justice and education while simultaneously increasing nutrition and food security within communities. Food is a foundational human right, and Natalie believes food can be used as a bridge to emphasize a compassionate and continual progression toward a more sustainable world. Paula Gill Director of Business & Administration ☓ Paula Gill Paula is a local urban gardener with a love for growing and eating fresh, organic produce. A trip to Italy sparked a desire to change the way she feeds herself, after being deeply impacted by Italians’ passionate relationship to food and the Slow Food movement there. Since that impactful trip, she has dreamt of farming in Tuscany. By joining the Davis Park Community Gardens, as well as becoming a beekeeper, she has been able to make this dream a reality right here in Providence. Paula brings with her a first-hand knowledge of running a small business, in addition to her knack for numbers. She is excited about all that Farm Fresh RI is accomplishing and being an active member of the sustainable food movement in Rhode Island. Caroline Grand Associate Director of Marketing ☓ Caroline Grand A native of New Orleans, Louisiana, Caroline was raised with a love for both the culinary arts and local ecosystems. She grew up duck hunting, fishing, beekeeping, raising chickens, and tending to her family garden, where she developed a deep appreciation for both cultivated crops and wild flora. After graduating with a Master of Arts in English Literature from Northeastern University, Caroline honed her skills in both writing and pedagogy to develop marketing initiatives for an alternative educational retreat in New York City. As an adoptive New Englander, she is thrilled to marry her professional skills and personal passions at Farm Fresh Rhode Island for the betterment of the community she lives in and loves. In her free time, Caroline enjoys reading, cooking, knitting, plant foraging, and printmaking. Stephanie Pike Farm and Sea to School Director ☓ Stephanie Pike Stephanie was born and raised in Rhode Island and loves to be surrounded by good food and good people. She is a Registered Dietitian who received her training from URI and Keene State College, and has always focused her efforts on community nutrition and food insecurity. Stephanie’s career and personal paths have led her to work, volunteer, and educate in many community-based settings with a variety of groups. She believes in the power of food to create lasting change and strives to support communities in meaningful food and food systems exploration and learning. Allison Fleet Board of Directors Partner, Partridge, Snow & Hahn LLP ☓ Allison Fleet Taylor Jacobs Assistant Director of Grants & Data ☓ Taylor Jacobs Taylor grew up surrounded by family gardens — her grandparents even housed some chickens in their backyard. Always hearing her mother pine for the first tomatoes of the season, it wasn’t until a trip to Italy a few years ago that Taylor truly got it. On that trip, she spent five months volunteering on farms in Italy, Greece, and Japan. While trying her hand at making goat cheese, caring for emus, and milking cows, she lived the connection between farmers, animals, the land, and the food that we eat. After returning stateside, she began her Farm Fresh RI journey, first serving as an AmeriCorps VISTA member, and now acting as our Nutrition Education Associate. In her spare time, she loves illustrating, playing with her pet rats, and learning about cheesemaking. Breanne Penkala Hope's Harvest Operations Manager ☓ Breanne Penkala Breanne is a RI native with a passion for fresh, local, and affordable food. After working on organic farms for the last 7 years in Upstate New York, Breanne is happy to finally return to the Ocean State. Breanne is excited to join the Hope’s Harvest team, building connections with local farmers and other food related organizations, while recovering produce from local farms and improving food security. In her free time, Breanne enjoys gardening, trying out all of the local ice cream shops, spending time by the ocean, and hiking with her dog. Julie Rondot Farmers Market Program Manager ☓ Julie Rondot Originally from France, Julie Rondot moved to Rhode Island and joined Farm Fresh RI motivated by her desire to make healthy, local food accessible to everyone. With a degree in Communication and Human Resources, she previously worked as a communications manager and events coordinator in France. Eager to make a real impact and passionate about nature, she pivoted her career to the environmental sector where she campaigns for equitable access to local food. Outside of her professional pursuits, she finds pleasure in hiking, camping, and exploring nature. She hopes to help others rediscover and reconnect to nature’s natural beauty and bounty! Branden Lewis Board of Directors Chef & Professor, Johnson & Wales University ☓ Branden Lewis Jane Sabatini Board of Directors, Co-Chair Retired Certified Public Accountant ☓ Jane Sabatini “The mission of Farm Fresh RI is powerful to me — bringing local food to all communities and making fresh, local, healthy food affordable. I’m also impressed with its emphasis on nutrition education for all age groups from children to seniors; I believe this outreach is vital if we are to address the growing obesity and related health issues in our society. I hope to be able to help in advancing these objectives.” Allyson Jennings Assistant Director of  Hunger Relief ☓ Allyson Jennings Ally is a Rhode Island native with a passion for environmental sustainability and community engagement. After graduating from Johnson & Wales University in 2018 with degrees in Business Administration and Event Management, she served a year with the AmeriCorps National Civilian Community Corps (NCCC). Following her NCCC term, Ally joined Farm Fresh as the Farm to Food Pantry AmeriCorps VISTA. Now serving as the Assistant Director of Hunger Relief, Ally is excited to continue working with growers/producers, hunger relief agencies, and state agencies to help support the local food system. In her spare time, Ally enjoys hiking, camping, dancing, and baking. Mathew Lamoore Market Mobile Fleet and Facilities Manager ☓ Mathew Lamoore Jason Evans, Ph.D. Board of Directors Dean, Johnson & Wales University ☓ Jason Evans, Ph.D. Genevieve Primeau Market Mobile Sales Coordinator ☓ Genevieve Primeau Genevieve’s interest in food systems began while working in the local culinary scene in Providence. It was a formative experience to see first-hand all the moving parts in restaurant operation, while being surrounded by food-oriented people! Then there was a great moment of reckoning during the lockdown of 2020, when she was left to reflect on both the interconnectedness and the vulnerabilities of those systems. Nowadays, she is drawn to the agricultural tech space and particularly moved by the issue of food waste. She is pleased to have found marvelous company working on the Market Mobile team. As for her free time, she’s still searching for a “creative” hobby — suggestions are welcome! Cheryl Zecchin Farmers Market Associate ☓ Cheryl Zecchin Diego Juarez Building Security & Maintenance Events Associate ☓ Diego Juarez Kelley McShane Board of Directors Managing Partner, The Granny Squibb Company ☓ Kelley McShane “It is an honor to work with people who are passionate about the Rhode Island food and beverage industry, supporting local business and farmers, and making sure that healthy food is accessible to all Rhode Islanders. Their work is more important now than ever. I am thrilled to be a part of Farm Fresh Rhode Island’s Board of Directors.” Kristen (KD) Dayton Harvest Kitchen Program Support ☓ Kristen (KD) Dayton Kristen (KD) Dayton is an enthusiastic communicator, a lifelong learner, and an advocate for connecting people through food. A recent graduate of the Sustainable Food Systems program at Johnson & Wales University, she enjoys facilitating information exchange and instructing people of all ages and backgrounds in how to appreciate food. In addition to her degree from Johnson & Wales, KD also holds a Master’s degree in International Relations from the University of Kent and dual Bachelor’s degrees in Political Science and Philosophy. She worked for several years in strategic communications for the international development sector of the federal government, and this experience grew her passion for travel and learning about other cultures. KD is delighted to work with Farm Fresh RI, shifting her career towards supporting the future of our global and local food systems. John Gray Community Events Director & Co-Locator Liaison ☓ John Gray Whether in Iowa where he was born and raised, New York city where he cut his teeth in the hospitality industry or now in Providence where he’s laid roots, connecting with people through food has always been at the center of the table in John’s life. Over the past two decades, John developed a deep appreciation for serving the highest quality ingredients with the highest quality service while working for some amazing restaurant groups including the Momofuku group in NYC and The Eddy here in PVD. His last foray in the service industry provided the opportunity to achieve a lifelong passion as an owner/operator of Saint Monday on the west side. Most recently, John worked in the Development office of College Unbound, located right up the street on Federal Hill. He hopes to utilize all those varied skills (maybe add a little song and dance from his theater days) in building community and connections through Farm Fresh RI. Onyx Sanchez Market Mobile Packhouse Associate ☓ Onyx Sanchez Delite Primus Director of Advancement ☓ Delite Primus Delite grew up in Steamboat Rock, Iowa, on her family’s corn, soybean, and dairy farm, learning early on the importance of food origin, food security, and the hard work and dedication needed to grow a passion from seed. After receiving her bachelor’s degree in Business Administration from Wartburg College (Waverly, IA) she began her career in Development with United Way of Central Iowa where she gained a strong foundation in donor relations and fundraising. After stops at Habitat for Humanity in Minnesota and Heifer International in California, she landed in Moab, Utah, at a food-based nonprofit called the Youth Garden Project (YGP). As Associate Director and later Executive Director of YGP, Delite led the organization and staff team, while having a specific focus on fundraising efforts — increasing individual donors, corporate partnerships, and grant awards during her tenure. Her 10 years at the organization nurtured her interest in being connected to community food systems and increasing healthy food access. Most recently, Delite served as a Proposal Development Specialist with Utah State University, working directly with faculty as well as state and federal agencies to secure funding for Agriculture and Natural Resource programs. Delite and her partner relocated to Rhode Island in 2019 to be closer to family. She was thrilled to find an organization like Farm Fresh RI that is the perfect merger of her personal passions and professional experience. Away from work, Delite enjoys working in her own garden, riding her bike, hiking a trail, traveling, and any day that involves more hours outside than less. And of course, she enjoys relaxing at one of South County’s amazing beaches. Jesse Rye Executive Director ☓ Jesse Rye Jesse Rye is the Executive Director of Farm Fresh Rhode Island. He has been with Farm Fresh RI since 2012, and in that time has helped to scale and support the work of Farm Fresh both in Rhode Island and New England. In the last few years, Jesse helped the organization to navigate the major changes necessitated by the COVID-19 pandemic while moving the organization to a newly constructed food hub facility adjacent to downtown Providence. Jesse has experience on the community level as nonprofit manager; statewide as program director and communications specialist; and nationally as a researcher and advocate. Jesse as a part of Farm Fresh is determined to grow a local food system that values the environment, health, and quality of life of farmers and eaters. In addition to his work at Farm Fresh, Jesse has volunteered his time as a board member for Farm to Institution New England, Food Solutions New England, the Rhode Island Food Policy Council, and Red Tomato. Aoife Lee Bird Events and Administrative Associate ☓ Aoife Lee Bird Aoife Bird loves the woods, the plants, and all things food. Born and raised in New England, wild foraging in the woods and waters alongside her mom, she spent the last many years communing with the plants and wilds of the Pacific Northwest. Over the years she has been a caterer, a bookseller, a baker, an archivist, a (very) small-scale farmer, and a healer. Aoife earned her culinary degree from the New England Culinary Institute a million years ago and has since gone on to earn a degree in archaeology from the University of Oregon focusing on people’s use of plants, foods, and ritual. She continued on to gain a Master’s degree in East Asian Medicine from the Oregon College of Oriental Medicine as well as another in Nutrition from the National University of Natural Medicine. In addition, she has graduate certificates in Ecopsychology and in Sustainable Food Systems. She has extensive training in Western herbalism from the Arctos School of Botanical Medicine in Portland, OR, and loves to make medicine. She earned her Permaculture Design Certificate from the Permaculture Women’s Guild and is a member of the American Herbalist Guild, The American Anthropology Association, the American Nutrition Association, and the International Association of Culinary Professionals. Aoife recently returned to her home state of Rhode Island and brought with her a teenager daughter, a Newfoundland named Jeff, a Chihuahua named Sunny, a black kitty named Bitsie, and a baby kitten named Kiki. She loves to walk in the woods, talk to the plants, and explore all the grocery stores everywhere. Angel Mendez Board of Directors Executive Director, Red Tomato ☓ Angel Mendez Turon Williams Market Mobile Operations Manager ☓ Turon Williams Turon moved to Providence at a very early age. He has attended the community college of RI. Turon also has been dealing in produce since 2005, when he was a manager for multiple wholesale companies. He firmly believes that building a successful team starts with great leadership and communication. In Turon’s spare time, he officiates basketball games for the kids across the east coast. Turon is very excited to join the Farm Fresh RI team, and believes that he can teach and learn from his coworkers, as well as associates. Virginia Branch Board of Directors Principal Owner, Branch Architects ☓ Virginia Branch Rob Andreozzi Board of Directors Owner, Pizza Marvin ☓ Rob Andreozzi As a restaurant owner, Farm Fresh makes it possible to connect with local farmers in a meaningful way. Utilizing Market Mobile allows me to focus on growing my restaurant and building my team while still being able to support the best local farms at the same time. While Market Mobile is the program I interact with most frequently, I look forward to contributing my energy and passion into supporting and advocating for the success of each of the initiatives that Farm Fresh has to offer the community. Rob Glover Farmers Market Technology Specialist ☓ Rob Glover Rob’s introduction to agriculture came about through working on small farms in the WWOOF program, where they discovered their love for the field. Their eventual goal is to run their own farm to help provide wholesome food for their community and help foster a love of farming in others. They have worked throughout many different levels of the production chain in local food enterprises, building skills to help them realize this dream. Rob is excited to bring those skills to Farm Fresh RI, where they strive to support local farmers and help strengthen a sustainable, resilient, and equitable food system in Rhode Island. Danielle Demers Harvest Kitchen Markets & Cafe Coordinator ☓ Danielle Demers Danielle, Dani for short, was born and raised in Attleboro, MA, and now is a native of Warwick, RI. Before joining the Farm Fresh RI team, she worked for Sodexo food services for six years as a rounds chef and caterer. Danielle loves cooking with a passion. She also loves the outdoors, her houseplants. and her three dogs!  Danielle looks forward to helping out the community and working with the Farm Fresh family at Harvest Kitchen. Kristine Merz Board of Directors Founder and CEO, Orange Square ☓ Kristine Merz “As board chair, I get to live my values that locally grown food is not only nutritious and delicious, but creates important economic opportunities, provides health benefits and community engagement, and reduces environmental impact. I am grateful for the opportunity to support leadership and staff in any way so that together we can achieve the mission and vision of this very important organization.” Caitlyn Goeden Farmers Market Associate ☓ Caitlyn Goeden Originally from Massachusetts, Caitlyn moved to Rhode Island in 2015 to attend Roger Williams University where she graduated with a degree in Criminal Justice. She loved Rhode Island so much, she decided to make it her home! While she works full time in field of victim services, Caitlyn wanted to become more involved and engaged in the greater-Providence community. She thought no better way to do that than to join the Farm Fresh Farmer’s Market Team! In her free time, Caitlyn enjoys cooking dinner, trying out new recipes, eating ice cream, and spending time in the sunshine. She is frequently making meals out of the random findings from the pantry and having themed picnics in the park with friends. Charreese Braxton Harvest Kitchen Production Manager ☓ Charreese Braxton Charreese was born and raised in Philadelphia, PA. She moved to Providence to attend Johnson & Wales University in 2016. She graduated with a B.S. in Food Service Management with a focus in Food Sustainability in 2020. Since moving to Providence she has worked in various restaurants, getting her feet wet in the industry, which got her involved in working with local products from farms in the New England area. Rigoberto Ogubando Market Mobile Driver's Assistant ☓ Rigoberto Ogubando Jillian Caruso Harvest Kitchen Education Manager ☓ Jillian Caruso Jillian was born and raised in Warwick, RI; recently, she moved to Canterbury, CT. She attended and recently graduated the Culinary Institute of America in Hyde Park, NY with a BPS in Applied Food Studies. She has worked her entire life in kitchen and this is a refreshing new beginning for her. Jillian is passionate about her garden, reading, and her two nieces. Jillian is excited to start her career in nonprofits at Farm Fresh RI. Brayden Puddington Board of Directors Vice President - Commercial Banker, J.P. Morgan Chase & Co. ☓ Brayden Puddington Quote Coming Soon! Kellie Beretta Assistant Director of Development ☓ Kellie Beretta As the daughter of a chef, food has been a major part of Kellie’s life since birth. Originally from New York, she studied Baking & Pastry Arts/ Food Service Management at Johnson & Wales University (North Miami), and spent several years managing bakeries. After leaving kitchens and graduating with a Masters in Public Administration from Suffolk University, she knew she wanted to work with food in a different way, which led her to pursue a career at food focused non-profits. Previously she was Senior Development Manager at Project Bread, a Massachusetts based anti-hunger organization and Director of Individual Giving at Chef Ann Foundation, focusing on scratch cooking in schools. A lover of all things local and devoted farmers market shopper, Kellie is thrilled to be at Farm Fresh RI! When not training for a marathon, quahogging, or on a boat, Kellie can be found relaxing at home in Jamestown with her husband and rescue puppy, Princess Leia. Susan Clausen Director of Facilities ☓ Susan Clausen After graduating from the University of Illinois and spending a year giving back to the community as a CETA worker for a grassroots recycling program (before everybody recycled!), Susan worked as a studio assistant for several glass artists. For well over a decade, she continued working in the jewelry industry, living in North Carolina, Pennsylvania, Maine, and Rhode Island. In 1985, she was a founding member of the unjuried, uncensored arts organization in Providence called AS220, and spent countless hours volunteering and eventually being employed by AS220 as Property Manager — a role she held for 16 years. Her commitment to building community and working in the nonprofit sector then led her to Farm Fresh RI, where she hit the ground running to help complete and launch our brand-new facility Providence (during a pandemic!). All throughout her career, Susan has maintained an art studio where she continues to produce mixed media artworks and dabbles in music. She sees cooking as another creative practice, and has found great pleasure cooking healthy foods from local farms. John Auger Board of Directors, Co-Chair Managing Director IT projects, Blue Cross & Blue Shield of Rhode Island ☓ John Auger “I believe access to fresh and local food is key to addressing many of the health, economic, and environmental issues we face in our communities and our nation. Farm Fresh RI has been on the leading edge of tackling these challenges for years. The organization’s focus on availability of local and affordable foods, its nutrition education programs, and efforts to improve the impact of food production on our environment are critical steps to achieving a healthy farm to fork community. I’m appreciative of the opportunity to be part of the Farm Fresh RI team, and I look forward to participating in advancing the values and mission they represent.” Andrea Aguilar Farmers Market Associate ☓ Andrea Aguilar Andrea grew up in New York and came to Providence to study culinary arts at Johnson & Wales University. After graduation, she took a gap year and went to work with her mom at her bakery, decorating cakes and then went to work at a bank. Now, Andrea wants to go back to school to pursue a Bachelor’s degree in children’s nutrition. In her free time, she likes to cook and bake for her family, tend to her garden, and have picnics in the park. Sean Kontos Harvest Kitchen Program Director ☓ Sean Kontos Sean is a native of Dover, NH, who has been working in the food service industry for 13 years. After graduating from Johnson & Wales University with a degree in culinary arts in 2011, he went on to cook around Nantucket and the seacoast of New Hampshire, focusing on local and sustainable cooking particularly tied to whole animal butchery. After backpacking through Europe, he and his now wife, moved to Providence where he worked at Local 121, eventually becoming head chef. Most recently, he helped open Farm & Coast Market in South Dartmouth, MA, as a butcher and chef. Sean started out as a volunteer with our RI Farm to School program until moving on to work with Harvest Kitchen. Hurricayne Cabral Market Mobile Program Director ☓ Hurricayne Cabral Hurricayne has lived in the Providence area his whole life, graduating from Shea High School in Pawtucket. He started working at Farm Fresh RI in 2018, and since then has grown a strong appreciation for local farmers — in particular, for all the hard work they do every day. Cayne loves working at Farm Fresh and getting products from those local farmers and producers out into the community in many different ways — from delivery to some of the top restaurants in Rhode Island to bringing fresh food right to someone’s front door. When he’s not working hard at Farm Fresh, Cayne enjoys spending quality time with family and friends. He also loves to travel, having visited several different countries and states… and counting! Molly Ellis Assistant Director of Business & Administration ☓ Molly Ellis Molly is a lifelong Rhode Islander. She started out as a volunteer for Farm Fresh RI at the Wintertime Farmers Market in Pawtucket in 2008, and continued through various work study programs and AmeriCorps VISTA terms before becoming a full-time staff member in 2013. Since then, she has managed at least six different farmers markets, become an expert in tent repair, and helped to administer our federal FINI grant that provides funding for the Bonus Bucks program. In her free time, Molly enjoys folk music and dance as well as gardening. Cassidee Jones Community Education Manager ☓ Cassidee Jones Native to Alabama, Cassidee grew up spending time outside with family, from fishing to gardening to demolishing a watermelon daily (or so it seemed). Everything about life in rural AL was centered around agriculture and poverty, resulting in a food desert. Cassidee decided that there had to be more, so she went in search of an answer at Auburn University, receiving a degree in history as well as political science focusing on African history and food politics, with a minor in sustainability. Her studies combined with five years in the service industry led her to pursue a Masters in Food Security and International Development from the University of Sussex in England. She began working with international organizations to support access to products to treat malnutrition, but involvement in her community garden and a desire to tackle root causes of food injustice led her to Farm Fresh RI. Now she pursues her passion by day and her million hobbies by night, including pottery, tufting, home renovation, cycling, swimming, and more. Nancy Reiter Board of Directors Retired, Former Senior Technical Director and Lean/Six Sigma Black Belt, AT&T ☓ Nancy Reiter I came to Farm Fresh RI as a volunteer gleaner with Hope’s Harvest.  The concept of eliminating food waste at the source and making fresh, local produce available to all Rhode Island residents became my passion.  Understanding the larger picture, I am proud to devote my time, hands, knowledge, and skills to Farm Fresh to further the vision of a robust local food chain accessible to all. Kiffen Ratkevich Market Mobile Sales Manager ☓ Kiffen Ratkevich A native of Newport, RI, Kiffen has long been passionate about food and his community. After cooking professionally for 10 years, he moved on to program and project management. Kiffen is excited to join Farm Fresh RI and be an active member of the sustainable and equitable food movement in Rhode Island. He enjoys cooking for his friends and family and spending time with his wife at the beach. Thea Upham Nutrition Incentive Projects Director ☓ Thea Upham Thea moved to Providence in 2004 to attend Johnson & Wales University and graduated with a degree in Food Service Entrepreneurship. She has spent the past 10 years working with food in different capacities — as a chef, farmers market vendor, and farm hand — and has always been mindful of linking her work to the larger local food system. She firmly believes that the decisions we make about what we eat and where it comes from can have great impacts on the health and welfare of our local community. Thea ties these ideals into her work at Farm Fresh RI every day. Rodolfo Lucero Market Mobile Driver ☓ Rodolfo Lucero Lily Harding Lead Community Educator ☓ Lily Harding Lily grew up in California, but she got attached to Providence while getting her Biology degree from Brown University. She believes that food is central to community, just and sustainable food systems are essential, and education should be accessible, relevant, and fun. Lily has loved working with kids at summer camps, and is so excited to engage youth in understanding food systems as part of the Community Education team at Farm Fresh RI! Outside of work, you’ll find Lily running, cooking, and doing crossword puzzles. Natasha Brotherns Market Mobile Inventory Manager ☓ Natasha Brotherns Natasha was born and raised in Providence, RI. She explains, “Growing up my family always kept a small farm and that’s where we ate most of our vegetables and fruit from as well. My interest in food and how it’s grown and distributed comes from my deep roots. My great grandmother being 100% Filipino, fresh produce has always been a part of our dinner table — grown and picked right in our backyard. Having spent most of my working years in the food industry, it’s opened my eyes to such varieties of food and also different cultures. I’d love to continue getting educated on our food system and how we can make it better, safer, and healthier!” Farm Fresh Rhode Island is an Equal Opportunity Provider CONTACT 401–312–4250 10 Sims Ave, unit 103 Providence, RI 02909 LOCAL FOOD RESOURCES RI Farmers Markets Guide Double Your SNAP/EBT Order Local Food Volunteer with Us Ag Exchange Public Forum GET WEEKLY NEWS © 2025 · Farm Fresh Rhode Island · Credits · Design & Development by // DESIGN AGENCY // VISIT US ▼ Welcome Event Rental Opportunities About Our Building Our Co-Locators PROGRAMS ▼ Bonus Bucks Farmers Markets Farm to School & Community Education Harvest Kitchen Hope’s Harvest Market Mobile ABOUT ▼ Mission History Staff & Board Job Opportunities SUPPORT ▼ Donate Asparagus Fest Local Food Fest Volunteer NEWS"
    },
    {
      "url": "https://www.buckeyeranch.org/contact-us/",
      "text": "Contact Us | Reach The Buckeye Ranch | Buckeye Ranch Blog In the News Careers Newsletter Sign Up Donate Now Our Services Residential Treatment Services Psychiatric Residential Treatment Facility (PRTF) Qualified Residential Treatment Program (QRTP) Community-Based Mental Health Intensive Family Support Program (IFSP) Intensive Home-Based Therapy (IHBT) Multi-Systemic Therapy (MST) Functional Family Therapy (FFT) Outpatient (OP) program Integrated Co-Occuring Treatment (ICT) Education-Based Mental Health School-Based Mental Health Services The Bonner Academy Somali Outreach and Mental Health Program Early Childhood Mental Health Child Welfare Services Permanent Family Solutions Network (PFSN) Foster Care Foster Parent Benefits We Raise Hope Foster Parent Conference Support Services Foster Parent Training Foster Care Parent Education Resources FAQ’s Transitional Age Youth My Place Bridges Post-Emancipation Services Integrated Care Services Same-Day Access Care Coordination OhioRISE Community Medication Management Get Involved Donate Now In-Kind Donations Volunteer A Positive Note Home Runs for Hometown Kids Hope for the Holidays Become a Foster Parent Foster Parent Training Foster Care Parent Education Resources Foster Parent Benefits Support Services FAQ’s We Raise Hope Foster Parent Conference About Us Our Work Trauma-Informed Care Treatment Approaches DEI Declaration Principles of Quality Care Impact Reports Our Locations Whitehall, OH – Headquarters Grove City, OH – Residential Treatment Campus Columbus, OH – The Bonner Academy Columbus, OH – My Place Cincinnati, OH – The Buckeye Ranch Foster Care Newark, OH – The Buckeye Ranch Foster Care Blog Our History Our Leadership Resources Caregiver Peer Support Groups Our Board General FAQs Join Our Team Careers Internships Contact Request Services Foster Care Referrals My Place Referral Records Requests Youth and Family Rights Newsletter Sign Up Blog In the News Careers Newsletter Sign Up Donate Now address 4653 East Main Street Whitehall, Ohio 43213 call us (614) 875-2371 national suicide prevention lifeline Call 988 address 4653 East Main Street Whitehall, Ohio 43213 call us (614) 875-2371 national suicide prevention lifeline Call 988 Request Services Contact Us Contact Our Team with Questions Today! Contact Us general service inquiries Please contact our Admissions and Engagement Department for more specific information about how our programs and services can support you and your family. Inquiry for services can be made by clicking the button below or by calling 614-875-2371 Monday-Friday 8:30 a.m.-4:30 p.m. Should you need to contact us via fax, that number is 614-384-7703. Access Services Same-Day Access If families need walk-in Same-Day Access support, that is available in-person at our Michael and Paige Crane Center for Children and Families Headquarters (4653 E. Main Street location Whitehall, OH) Mondays/Tuesdays/Thursdays from 9 a.m. to 3 p.m. or Wednesdays from 9 a.m. to 6 p.m. If our East Main location is not an option for you, please call us at 614-384-7798. Learn More foster care inquiries Are you interested in becoming a foster parent? Fill out our interest form below or give us a call at (800) 296-5113. Become a Foster Parent Today Are you a referring agency for foster care? Line Arrow 22 Please email/call our offices Monday through Friday from 9 a.m. to 5 p.m. to speak to a staff member regarding referrals: Central Ohio Offices: fostercarereferrals@buckeyeranch.org Cincinnati Office: fostercarereferralscincinnati@buckeyeranch.org Should you be seeking a foster home for a child after regular business hours, please call our after-hours office lines: Central Ohio Placements: (614) 312-9773 Cincinnati Placements: (513) 508-0935 our locations and program offerings Michael and Paige Crane Center for Children and Families Headquarters 4653 East Main Street Whitehall, OH 43213 (614) 875-2371 View on map Offerings: Same-Day Access, Care Management Entity (CME), Permanent Family Solutions Network (PFSN), Foster Care, Transitional Aged Youth, Bridges, Community-Based Mental Health programs (MST, FFT, IFSP, IHBT, ICT, and Outpatient), Teletherapy options, Community Medication Management, and Training Learn More Grove City Residential Campus 5665 Hoover Road Grove City, OH 43123 (614) 875-2371, press 2 View on map Offerings: Residential programs, including QRTP and PRTF, Outpatient program therapy services, and Training Learn More The Bonner Academy (Day Treatment) 2865 West Broad Street Columbus, OH 43204 (614) 875-2371, press 5 View on map Offerings: Education-Based Mental Health programs, Early Childhood Mental Health, Somali Outreach and Mental Health, The Bonner Academy, and Outpatient program therapy services Learn More My Place 1625 East Mound Street Columbus, OH 43205 614-875-2371, press 6 View on map Offerings: Transitional Age Youth Independent Living Campus Learn More The Buckeye Ranch Newark Office 195 Union Street, Suite B-3 Newark, OH 43055 (614) 875-2371, press 4 View on map Offerings: Foster Care and Outpatient program therapy services Learn More The Buckeye Ranch Cincinnati Office 4623 Wesley Avenue, Suite G Cincinnati, OH 45212 (513) 772-5800 View on map Offerings: Foster Care Learn More 4653 East Main Street Whitehall, Ohio 43213 (614) 875-2371 services Education-Based Mental Health Community-Based Mental Health Child Welfare Residential Treatment Integrated Care Request Services Become A Foster Parent about us FAQ’s Careers In the News Blog Our Locations quick links Donate Now A Positive Note Volunteer Impact Reports Privacy Policy Client Rights follow us Stay in touch Sign up for our newsletter mailing list: Sign Up National Suicide Prevention Lifeline Call or text 988 Providing 24/7 crisis support across the US. © Buckeye Ranch 2025. All rights reserved. Top"
    },
    {
      "url": "https://www.hastingshealth.co.nz/contact-us",
      "text": "Contact Us | The Hastings Health Centre Home Urgent Care Radiology General Practice Hastings Health Centre Mairangi Waimoana Ngahere Havelock North Health Centre Clive Medical Centre Special Services & Business Partners News Fees Contact Us Become a Patient Feedback Careers Manage My Health A white background with a few lines on it Home Urgent Care Radiology General Practice Hastings Health Centre Mairangi Waimoana Ngahere Havelock North Health Centre Clive Medical Centre Special Services & Business Partners News Fees Contact Us Become a Patient Feedback Careers Contact Us Main Phone Number: 06 873 8999 Waimoana Suite: 06 873 8554 Ngahere Suite: 06 873 8553 Mairangi Suite: 06 873 8551 Havelock North: 06 877 8011 Follow us on Facebook @Hastings Health Centre Fill form to get in touch Name: Email: Phone: Message: Thanks for contacting us. We will get in touch with you shortly. Oops, there was an error sending your message. Please try again later. The Hastings Health Centre Address: 303 St Aubyn Street West Hastings 4122 Phone: 06 873 8999 Email: hastingshealth@hhc.co.nz The Havelock North Health Centre Address: 26 Middle Road Havelock North Phone: 06 877 8011 Email: havelocknorthhealth@hhc.co.nz The Clive Medical Centre Address: 3 Williamson Road Clive Phone: 06 870 0402 Email: reception@clivemed.co.nz **in An Emergency Call 111 For An Ambulance** Home Urgent Care Radiology General Practice Hastings Health Centre Mairangi Waimoana Ngahere Havelock North Health Centre Clive Medical Centre Special Services & Business Partners News Fees Contact Us Become a Patient Feedback Careers Open Hours Urgent Care & Pharmacy: Every Day 8am To 8pm GP Suites & Special Services: Monday - Friday 8am To 5pm (Closed On Public Holidays) Contact Us Call Us On: (06) 873 8999 ﻿ Address: 303 St Aubyn St West, Entry Via Nelson St ﻿ Powered by 543 Website Design & Online Advertising"
    },
    {
      "url": "https://upperhastingsranch.org/contact-us",
      "text": "Upper Hastings Ranch Association UHRAPasadena@gmail.com Home Contact Us Events Services UHRA in the News UHRA Members (Sign In) Pasadena News More Home Contact Us Events Services UHRA in the News UHRA Members (Sign In) Pasadena News Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out UHRAPasadena@gmail.com Signed in as: filler@godaddy.com Home Contact Us Events Services UHRA in the News UHRA Members (Sign In) Pasadena News Account My Account Sign out Sign In My Account Social Contact Us Looking for our holiday lights? Look for information about Holiday Light Up on Facebook and Instagram: https://www.facebook.com/UHRAPasadena/ Light Up is nightly from 6 - 10 pm during the dates listed in December, always ending on December 31. No tickets are needed. We're a neighborhood. Driving is recommended. We live in the Foothills, and there are many streets. You can walk if you'd like. Are you a resident with questions? Upper Hastings Ranch Pasadena, CA Contact your block captain, email UHRAPasadena@gmail.com , or check NextDoor.com. \nCouncilmember Gene Masuda 626-744-4740 / gmasuda@cityofpasadena.net Noreen Sullivan, Field Rep nsullivan@cityofpasadena.net Pasadena Citizen Service Ctr 626-744-7311 Email UHRA Email UHRA Name* Email* Sign up for our email list for news, event information, and more. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Email UHRA Get directions Upper Hastings Ranch Association Upper Hastings Ranch Association\nPO Box 5131\nPasadena, CA 91117\nUS UHRAPasadena@gmail.com Copyright © 2025 Upper Hastings Ranch Association - All Rights Reserved. Powered by GoDaddy Website Builder This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.growthspotter.com/news/osceola-county-developments/gs-news-hastings-coon-lake-20201222-vptuwlg47zbrtfugjx6xmosbbq-story.html",
      "text": "Couple who sold ranch to St. Cloud for future park reinvest in Osceola – GrowthSpotter Skip to content All Sections Subscribe Now 70°F Thursday, September 11th 2025 Home Page News Projects Notable Home Sales Hotels & Hospitality Residential Developments Single Family Residential Multi-Family Residential Build to Rent Senior Living Retail and Dining Office and Medical Industrial Developments Downtown Orlando Downtown Orlando Lake County Orange County Osceola County Polk County Seminole County Volusia County About Our Ads Contact us Sign up for our email newsletter Sign Up Couple who sold ranch to St. Cloud for future… Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Subscribe Login Account Settings Contact Us Log Out Spoof a user Sign up for our email newsletter Sign Up Subscribe Login Search 70°F Thursday, September 11th 2025 Downtown Orlando Lake County Orange County Osceola County Polk County Seminole County Volusia County Business Real Estate Couple who sold ranch to St. Cloud for future park reinvest in Osceola Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn By Laura Kinsler | lkinsler@growthspotter.com | GrowthSpotter UPDATED: December 22, 2020 at 8:31 PM EST George and Debbie Hastings, who sold their beloved ranch on Jones Road to the City of St. Cloud this month, have found another slice of paradise to preserve in Osceola County. The city paid $5.75 million for the Hastings Ranch & Farm property, which is surrounded by new residential development. Debbie Hastings told GrowthSpotter they had originally bought the land as a place to raise cattle and horses, and to camp and fish. Over the years, the compound evolved into a popular wedding and event venue and fall festival business. The city had been pursuing the 219.4 acres for more than a year before voting in September to approve the purchase, which closed on Dec. 14. “There’s a lot of growth happening in the Narcoossee area, and that’s great because it creates jobs,” Debbie Hastings said. “But there has to be a balance. That’s why we chose to go the route of selling it for a park instead of a housing development.” George Hastings said they wanted to find another ranch property nearby where they could build a home and move the animals. “There’s not a lot of options left within the Urban Growth Boundary of Osceola County,” he said. “That’s where we wanted to be. All of our family members live in close vicinity.” It just so happened, broker Daryl Carter — who sold them the Jones Road property — had a listing that met their requirements. A Carter-led investment group bought a three-parcel assemblage on Coon Lake in 2016 for $1.3 million. He sold it to the Hastings this week for $3.5 million. “Anytime we can take $1.3 million and turn it into $3.5 million in four years, I’ll do that deal,” Carter said. Located just east of Pine Grove Road, the land is on the Alligator Chain of Lakes and has canals linking it to Center Lake, Trout Lake and Lake Lizzie. The total sale involved 236.5 acres, thought only 100 acres is usable. The property already has an agricultural exemption. Their new neighbor will be Preston Tyson, who already sold his property on the west side of Pine Grove Road for a new subdivision and has filed preliminary plans for another 296 homes on the 92-acres across from his homestead. The Hastings said they feel grateful to have been able to save two Narcoossee area ranches for future generations to enjoy and to have a site where they can continue their agritourism business and philanthropic work. “That area is so hot right now. You’ve got all the big builders looking in that general area,” George Hastings said. “I’m pretty sure they were looking at the Coon Lake property, too. I felt like Daryl wanted to do the right thing, too.” Have a tip about Central Florida development? Contact me at lkinsler@GrowthSpotter.com or (407) 420-6261, or tweet me at @byLauraKinsler . Follow GrowthSpotter on Facebook , Twitter and LinkedIn . Originally Published: December 22, 2020 at 3:31 PM EST Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Click to share on LinkedIn (Opens in new window) LinkedIn Most Popular Most Popular New subdivision with estate lots planned for red-hot Horizon West New subdivision with estate lots planned for red-hot Horizon West New owner seeks co-developer for defunct Kissimmee condo hotel project New owner seeks co-developer for defunct Kissimmee condo hotel project Lake board approves tax incentives to lure high quality hotels Lake board approves tax incentives to lure high quality hotels Minneola approves uses for potential US 27 grocery store, gas station project Minneola approves uses for potential US 27 grocery store, gas station project Apopka affordable housing project could break ground next year Apopka affordable housing project could break ground next year Kissimmee-based CapStrata chosen for Kmart redevelopment site Kissimmee-based CapStrata chosen for Kmart redevelopment site Matthew Cormia’s life as an architect began with building blocks Matthew Cormia's life as an architect began with building blocks Ultra modern beachfront home sells for $7.3M Ultra modern beachfront home sells for $7.3M Hunt Bros. wants to rezone 173 acres of former groves in Lake Wales for industrial use Hunt Bros. wants to rezone 173 acres of former groves in Lake Wales for industrial use More in Real Estate New owner seeks co-developer for defunct Kissimmee condo hotel project Apopka affordable housing project could break ground next year Lake board approves tax incentives to lure high quality hotels New subdivision with estate lots planned for red-hot Horizon West 2020 December 22 Tribune Publishing Chicago Tribune Sun Sentinel of Fla. Hartford Courant The Virginian-Pilot Studio 1847 New York Daily News Orlando Sentinel The Morning Call of Pa. Daily Press of Va. Company Info Home Terms of Service Cookie Preferences Privacy Policy Subscribe Now Subscriber Terms and Conditions Cookie Policy Cookie Preferences California Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 GrowthSpotter Close"
    },
    {
      "url": "https://ranchowl.com/contact-us/",
      "text": "Contact Us - RanchOwl.com Skip to content RanchOwl.com Your Guide to Smarter Ranching. Menu Menu Home About Us Blog Contact Us Contact Us We’d Love to Hear From You Whether you’ve got a question about ranching, a tip to share, or just want to say howdy, Ranch Owl is here to listen. We’re always looking to connect with fellow land stewards, ranchers, and anyone passionate about living wisely and working the land. Have a suggestion for a topic you’d like us to cover? Want to collaborate or contribute to RanchOwl.com? Or just curious about something you’ve read on the site? Let’s Talk Ranch Life Fill out the contact form below, and we’ll get back to you as soon as possible. No bots. No nonsense. Just real people who care about ranching smart. Reach Out Today ✅ Got a ranching question? ✅ Want to partner or advertise with us? ✅ Interested in contributing your tips? 👉 Use the form below to drop us a line—we’ll reply faster than a gate slam in a windstorm. Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Message or Email Name * First Last Email * Comment or Message Submit Prefer email? You can reach us directly at info@ranchowl.com Smart Ranching Starts Here... Search Recent Posts What is a Fruit Orchard: Meaning and Examples with Types of Orchards, Planning Guide, Management Practices, and Successful Commercial Growing Operations Home About Us Blog About the Author Contact Us Privacy Policy Terms and Conditions © 2025 RanchOwl.com • Built with GeneratePress English English Deutsch Español Français Italiano Polski Svenska Suomi Português Română Slovenščina Slovenčina Nederlands Dansk Ελληνικά Čeština Magyar Lietuvių Latviešu Eesti Hrvatski Gaeilge Български Norsk Türkçe Bahasa Indonesia Português (Brasil) 日本語 한국어 简体中文 العربية Русский हिन्दी Українська Srpski Accessibility  Adjustments Powered by OneTap Back Bigger Text Cursor Letter Spacing Readable Font Align Text Line Height Colors Grayscale Brightness Invert Colors Orientation Highlight Links Stop Animations Hide Images Reading Mask Reading Line Highlight Al Reset Settings Version 2.3.2"
    },
    {
      "url": "https://www.hastingsgroup.uk/contact-us",
      "text": "Contact Us | Hastings Group Skip to content About us Reports Financial results and reports Section 172 Statements Corporate responsibility reports Investor notices A responsible business Sustainability overview Operating responsibly Operating responsibly Modern slavery statement Tax strategy Valuing our colleagues and customers Valuing our colleagues and customers Diversity and inclusion Supporting our local communities Reducing our environmental impact News and announcements Careers Contact us Sampo CONTACT US Get in touch for more information about the Hastings Group Registered office details Hastings Group Conquest House Collington Avenue Bexhill-on-Sea East Sussex TN39 3LW Media contacts Hastings Group Conquest House Collington Avenue Bexhill-on-Sea East Sussex TN39 3LW Contact For media enquiries, please contact pr@hastingsdirect.com For customer enquiries, please refer to Help Centre & FAQs | Hastings Direct Sampo Group Fabianinkatu 21 00130 Helsinki Finland Media enquiries, Sampo plc www.sampo.com/contact-us ​​​​​ Find out more about... About us Financial results and reports Careers Popular links News and announcements Careers Modern slavery statement Gender pay gap report Section 172 Statements Sampo Our brands and products Hastings Direct Hastings Direct YouDrive InsurePink People's Choice Latest reports Sustainability Reports Contact us Hastings Group Conquest House Collington Avenue Bexhill-on-sea East Sussex TN39 3LW Terms of use | Privacy policy | Cookie policy ©2025 Hastings Group Holdings Limited Share Twitter Facebook LinkedIn Google+ Email"
    },
    {
      "url": "https://www.partyslate.com/venues/hastings-ranch-farm",
      "text": "Hastings Ranch & Farm | St. Cloud Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Hastings Ranch & Farm Find Venues / Florida / St. Cloud / Hastings Ranch & Farm Unclaimed Hastings Ranch & Farm 6475 Bass Hwy, St Cloud, FL 34771, USA Request info Favorite Owner hasn't claimed this business If you own this business, claim your profile to update information, add photos, and more. Claim Profile Overview Gallery 1 Vendor Connections 2 About Hastings Ranch & Farm Hasting Ranch & Farm in St. Cloud, Florida, is a venue for events that exudes southern-inspired beauty and authenticity. It is tucked away in one of the most serene and natural settings in Osceola County. Hastings Ranch & Farm will invigorate and enrich any event from beginning to end with its picturesque open ranch fields, spreading oak trees, tranquil private lake, lovely converted dairy barn, and much more.\n\nNearly endless chances for breath-taking ceremonies, thought-provoking gatherings, and joyous receptions are offered by the more than 500 acres of rural splendor. It is possible to avoid the tension that comes with venues and tourist destinations that are more based in cities by going to Hastings Ranch and Farm. Even the greatest outdoor celebrations may be held in comfort at our site, and our indoor, air-conditioned celebrations can host up to 150 guests. Our wedding celebrations are bursting with our distinctive southern elegance that will assist create that once in a lifetime moment, in addition to festivals, retreats, and other events that we cater.\n\nAwe-inspiring photography and cinematography are guaranteed by our historic barn, outdoor wedding chapel, and acres of working ranch fields. As a consequence, a destination event is created that is the ideal fusion of intimacy, authenticity, and unspoiled beauty. Pricing Packages Hastings Ranch & Farm hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Map 6475 Bass Hwy, St Cloud, FL 34771, USA Follow Us Visit Website Call If you own this business, claim your profile to update information, add photos, and more. Claim Profile Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    }
  ]
}