{
  "fuentes": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "email": "enquiries@displaysuk.co.uk"
    },
    {
      "url": "https://staffboard.com/",
      "email": "contact@staffboard.de"
    },
    {
      "url": "https://whiteheronestate.com/contact/",
      "email": "info@whiteheronestate.com"
    },
    {
      "url": "https://www.heron.org/contact-us/",
      "email": "info@heron.org"
    },
    {
      "url": "https://haughtyheron.com/about-the-haughty/",
      "email": "haughtyheronpsj@yahoo.com"
    },
    {
      "url": "https://www.heronvalley.co.uk/pages/contact",
      "email": "mobile-new-logo_351x@2x.png"
    },
    {
      "url": "https://www.heronvalley.co.uk/pages/contact",
      "email": "sales@heronvalley.co.uk"
    },
    {
      "url": "https://haughtyheron.com/",
      "email": "haughtyheronpsj@yahoo.com"
    },
    {
      "url": "https://www.heron.org/about-us/",
      "email": "info@heron.org"
    },
    {
      "url": "https://haughtyheron.com/live-music-events/",
      "email": "haughtyheronpsj@yahoo.com"
    },
    {
      "url": "https://www.heronworksllc.com/",
      "email": "hannah@heronworksllc.com"
    },
    {
      "url": "https://heronfoods.com/contact-us/",
      "email": "press@bmstores.co.uk"
    },
    {
      "url": "http://haughtyheron.com/contact-us.cfm",
      "email": "haughtyheronpsj@yahoo.com"
    },
    {
      "url": "https://heronagency.com/contact-us/",
      "email": "info@heronagency.com"
    },
    {
      "url": "https://www.heron.org/our-team/",
      "email": "info@heron.org"
    },
    {
      "url": "https://haughtyheron.com/the-loft/",
      "email": "haughtyheronpsj@yahoo.com"
    },
    {
      "url": "https://www.herontx.com/about/management/",
      "email": "heronmc@eversana.com"
    },
    {
      "url": "https://www.herontx.com/about/management/",
      "email": "info@herontx.com"
    },
    {
      "url": "https://www.heronworksllc.com/contact",
      "email": "hannah@heronworksllc.com"
    }
  ],
  "mails": [
    "contact@staffboard.de",
    "enquiries@displaysuk.co.uk",
    "hannah@heronworksllc.com",
    "haughtyheronpsj@yahoo.com",
    "heronmc@eversana.com",
    "info@heron.org",
    "info@heronagency.com",
    "info@herontx.com",
    "info@whiteheronestate.com",
    "mobile-new-logo_351x@2x.png",
    "press@bmstores.co.uk",
    "sales@heronvalley.co.uk"
  ],
  "nombre_sitio": "haughtyheron.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.displaysuk.co.uk/signage-perspex-frames/perspex-acrylic-poster-photo-frames/staff-photo-boards-for-schools-business/",
      "text": "Staff Photo Boards For Schools & Business This site is best viewed with javascript enabled. For help enabling javascript please click here . search close Search Quote ( 0 ) Checkout 0 item s £ 0.00 Home Products Exhibition Stands Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays See all Outdoor Displays Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers See all Display Cases Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases See all Exhibition & Display Boards for Hire or Rent Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire See all Leaflet, Brochure, Menu & Card Holders Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders See all Banner Stands Pull Up Roller Banners Double Sided Pull Up Banner Stands Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays See all Counters & Plinths Portable Counters & Workstations Promotion / Demonstration Counters Lectern Test Category Pedestals See all Noticeboards & Whiteboards Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards See all Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Lightboxes Dibond Signs See all Display Boards Folding Display Boards Folding Screen Room Dividers Panel and Pole Display Boards Display Board Accessories See all Specialist Displays Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture See all Perspex Cut To Size Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size See all About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Quote ( 0 ) 50,000+ products in stock 1,000 stock product lines with over 50,000 products in stock Custom made displays Rapid delivery on custom made Perspex acrylic displays Next day delivery Next day delivery on many products if ordered by mid day UK Manufacturer Many of our products are made in our own UK factory Cutting edge technology Experts in printed acrylic panels - any size, any shape menu close Products Exhibition Stands Back All Pop Up Exhibition Stands Modular Exhibition Stands Fabric Exhibition Stands Shell Scheme Graphics Information Points & iPad Displays Extra Wide & Linked Banner Stands Outdoor Displays Back All Outdoor Display Flags Outdoor Display Banners & Frames Pavement Signs Gazebos, Parasols & Inflatables Cafe Barriers Outdoor Display Counters Outdoor Custom Printed Chairs Display Cases Back All Perspex Acrylic Display Cases, Boxes & Cubes Display Case Plinths Glass Display Cases Bespoke Acrylic Display Cases Token, Ballot, Collection Boxes Flat Pack Acrylic Display Cases Bespoke Perspex Display Cases Exhibition & Display Boards for Hire or Rent Back All Folding Display Boards for Hire Panel And Pole Display Boards for Hire Brochure Stands for Hire Exhibition Counters for Hire Banner Stands for Hire Leaflet, Brochure, Menu & Card Holders Back All Countertop Leaflet Holders Wall Mounted Leaflet Holders Floorstanding Brochure Holders Menu Holders Perspex Business Card Holders Rotating Brochure Holders Greeting Card Displays Business Card Holders Banner Stands Back All Pull Up Roller Banners Double Sided Pull Up Banner Stands Replaceable Cassette Roller Banners Extra Wide & Linked Banner Stands Fabric Banner Stands Rigid Board Displays Banner Stand Accessories Tension Banner Stands Counters & Plinths Back All Portable Counters & Workstations Promotion / Demonstration Counters Lectern Media Cabinets Test Test category for acrylic pedestals Test Category Pedestals Noticeboards & Whiteboards Back All Perspex Acrylic Wall Mounted Noticeboard Pinnable Wall Mounted Noticeboards Fire Retardant Wall Mounted Noticeboards Lockable / Tamperproof Noticeboards Wall Mounted Fire Retardant Lockable Tamperproof Noticeboards Freestanding / Mobile Noticeboards Whiteboards Glass Noticeboards Flipcharts & Easles Outdoor Noticeboards Acrylic Noticeboards Pinnable Noticeboards Write On Glassboards Signage & Perspex Frames Back All Perspex Acrylic Poster Photo Frames Perspex Acrylic Signs and Letters Magnetic Blocks & Signs Staff Photo Boards Lightboxes Dibond Signs Printed Foamex Signs Site Safety Signs Snap Frames Sign Fittings & Accessories Hoarding Panels Acrylic Awards and Trophies Acrylic Noticeboards Printed Correx Signs Retail & Point Of Sale Printed Plywood and Wood Display Boards Back All Folding Display Boards Folding Screen Room Dividers Aluminium & Graphic Folding Display Boards Panel and Pole Display Boards Office Screens Display Board Accessories Specialist Displays Back All Catering & Sneeze Guards Cable Kits Retail & Point Of Sale NHS Signs & Displays Acrylic Furniture Educational Furniture & Displays Social Distancing Screens Printed Outdoor Garden Art Garden Mirrors, Outdoor Mirrors & Illusion Mirrors Acrylic Photo Prints Shed, Playhouse, Greenhouse Windows Eco Lawn Edging From Recycled Plastic Decorative Garden Wall Panels Garden Structures, Gazebos, Arbours & Swings Garden Ornaments & Planters Acrylic Photo Prints Perspex Acrylic Splashbacks Perspex Cut To Size Back All Acrylic Glazing Clear Acrylic Panels Cut To Size Perspex Acrylic White 069 Cut To Size Perspex Acrylic Black 962 Cut To Size Perspex Acrylic Grey 9640 Cut To Size Perspex Acrylic Grey 9981 Cut To Size Perspex Acrylic Yellow 260 Cut To Size Perspex Acrylic Red 4415 Cut To Size Perspex Acrylic Orange 363 Cut To Size Perspex Acrylic Red 431 Cut To Size Perspex Acrylic Red 433 Cut To Size Perspex Acrylic Violet 886 Cut To Size Perspex Acrylic Green 6T81 Cut To Size Perspex Acrylic Green 650 Cut To Size Perspex Acrylic Blue 727 Cut To Size Perspex Acrylic Blue 750 Cut To Size Perspex Acrylic Blue 744 Cut To Size Perspex Acrylic Clear Frost S2 000 Perspex Acrylic Glass Look 6T21 Cut To Size Perspex Acrylic Silver Mirror Perspex Acrylic Blue Mirror 2069 Perspex Acrylic Purple Mirror 102 About Us Services Large Format Printing Services Self Build DIY Exhibition Stands Cut-To-Size Perspex & Plastics Perspex Replacement Boat Windows Perspex Acrylic Secondary Double Glazing Acrylic Fabrication & Display Fabrication Acrylic Display Cases Boxes & Cubes Point Of Sale & POP Fabrication Recycled Acrylic Displays & Greencast Acrylic Sheet Public Sector Procurement - Credit Facilities Contact Home Signage & Perspex Frames Perspex Acrylic Poster Photo Frames Staff Photo Boards For Schools & Business Staff Photo Boards For Schools & Business £ 36.30 ex. VAT £ inc.VAT Options Colour: Black Back Panel White Back Panel Clear Back Panel Clear Frost Back Panel Coloured Back Panel 2: 2: Qty Add to basket Get a quote Staff Photo Notice Boards - Perspex Acrylic Staff photo notice boards, or \"Meet The Team\" boards are a perfect way of letting people know who's who in a school, NHS Wards, general office and commercial workplace, recreation centres, reception areas, etc. Each clear pocket allows a small photo of a relevent member of staff. Options available include: choice of back acrylic colour, the number of photo pockets. We also offer a secure, tamper proof version, please click here for further details. NEW! We can now offer staff boards with your name and logo printed directlty to the top of the display - call for details. Features and Benefits: Please double click on the above images of our acrylic staff photo boards to zoom into a more detailed view Staff photo boards provide a professioal looking wall mounted display panel for quick reference of staff / team members Choice of black, white, clear or clear frost 5mm thick acrylic back panel with polished edges. Corners are rounded with no sharp edges Clear acrylic photo pockets allow staff photos to be changed quickly and easily Supplied with 4 polished sign fittings to give that floating effect off a wall Each photo pocket size is 75mm high x 50mm wide Header panel pocket is 260mm wide x 50mm high Please see the table below for our standard sized staff photo boards. We also manufacture custom sized boards if you require different sized pockets or different quantities of pockets - please call us on 01202 480104 for further details. Staff photo board prices are detailed in the drop down menu at the top of the page. Manufactured to order in our factory in Christchurch, Dorset, UK. Please allow 5 working days for delivery Please see our stand off fittings instructions by clicking here Looking for a a more secure staff photo board which can't be tampered with? Check out our Secure Staff Photo Boards ! Looking for a staff photo board with a different coloured back panel? We have a range of colours available other than our standard colours listed! Please contact us for a quote. Looking for a staff photo board with bespoke printing and branding to suit your business? With state of the art printers, we are able to fully print or brand these staff boards with your logos and messages! If this is something you are interested in, contact us for a quote! Code Photo Pockets Frame Size Width x Height (mm) SB10 10 430mm x 325mm SB20 20 430mm x 515mm SB30 30 500mm x 610mm SB40 40 640mm x 610mm SB50 50 780mm x 610mm SB60 60 780mm x 705mm SB65 65 800mm x 740mm SB70 70 780mm x 800mm SB80 80 780mm x 895mm SB100 100 780mm x 1085mm SB120 120 920mm x 1085mm SB140 140 1060mm x 1085mm SB160 160 1200mm x 1090mm Displays UK provide daily deliveries to most towns and cities in the UK including: Christchurch, Poole, Bournemouth, Swanage, Dorchester, Ferndown, Shaftesbury Sherborne Sturminster Newton Swanage Weymouth Ringwood New Forest Fordingbridge Salisbury Thank you for visiting our website Product Code: 64674569876345 Specification Code 64674569876345 Style Staff Photo Board Location Wall Mounted Weight 10.000 Kg Secured by sagePay Pay with PayPal Pay with Mastercard Pay with Visa × Items Quick basket Newsletter Signup Submit Exhibition Stands Outdoor Displays Display Cases Exhibition & Display Boards for Hire or Rent Leaflet, Brochure, Menu & Card Holders Banner Stands Counters & Plinths Noticeboards & Whiteboards Signage & Perspex Frames Display Boards Specialist Displays Perspex Cut To Size Displays (UK) Limited Displays UK are located in Christchurch, on the Hampshire / Dorset border. We are a proper 'bricks and mortar' manufacturing business not just another internet retailer. Read more… Head Office Units 16-18, 12 Airfield Road, Off Airfield Way, Christchurch, Dorset, BH23 3TG Tel: 01202 480104 Email: [email protected] Connect with us DISQ Display Innovation Service Quality Displays (UK) Limited registered in England and Wales with company number 8896740 and registered address Bank Court, Manor Road, Verwood, Dorset, BH31 6DY. VAT number GB980855382 © Displays (UK) Limited 2025 / Website by Adido / Terms & Conditions / Privacy / Sitemap"
    },
    {
      "url": "https://staffboard.com/",
      "text": "staffboard HR Software [has_children] [de] Dashboard [child] [de] HR-Exzellenz-Dashboard Recruiting (ATS) [child] [de] Gestalten Sie bewusst die Zukunft Ihrer Organisation! Digitale Personalakte [child] [de] Mit der digitalen Personalakte haben Sie die Daten Ihrer Mitarbeiter immer im Blick Abwesenheitsmanagement [child] [de] Organisieren Sie übersichtlich & schnell Ihre Abwesenheiten Feedback & Performance [child] [de] Fördern Sie aktiv die persönliche Entwicklung Ihrer Mitarbeiter durch konstruktives Feedback Learning [child] [de] Planen Sie die Weiterentwicklung Ihrer Mitarbeiter Zeiterfassung [child] [de] Optimieren Sie die HR-Zeiterfassung Lohnabrechnung [child] [de] Mit dem Modul für Lohn & Gehalt erhalten Sie eine guten Überblick für die nächste Lohnabrechnung. Organigramm [child] [de] Visualisieren die Hierarchie und Struktur Ihres Teams Preise [de] Reports [child] [de] Gewinnen Sie wertvolle Einblicke in Ihre Belegschaft mit anpassbaren Berichten, Echtzeitanalysen und Datenvisualisierungstools. HR Insights [de] Unternehmen [has_children] [de] Unternehmen [child] [de] Kooperationspartner [child] [de] Karriere [child] [de] FAQ [child] [de] Kontakt [de] Login [de] HR Software [has_children] [en] Dashboard [child] [en] HR Excellence Dashboard Recruiting (ATS) [child] [en] Consciously shape the future of your organization! Digital Personnel File [child] [en] With the digital personnel file, you always have an overview of your employees' data Absences [child] [en] Organize your absences clearly and quickly Feedback & Performance [child] [en] Actively promote the personal development of your employees through constructive feedback Learning [child] [en] Plan the development of your employees Time Tracking [child] [en] Streamline HR Time Tracking Payroll [child] [en] The module for wages and salaries gives you a good overview for the next payroll. Orgchart [child] [en] Visualize your team's hierarchy and structure Pricing [en] Reports [child] [en] Gain valuable insights into your workforce with customizable reports, real-time analytics, and data visualization tools. HR Insights [en] Company [has_children] [en] About Us [child] [en] Partners [child] [en] Career [child] [en] FAQ [child] [en] Contact [en] Login [en] DE EN ONLINE DEMO BUCHEN Die HR Software für Unternehmensgestalter Ihr Copilot im HR Team Mit staffboard gestalten Sie Ihr Personalwesen nach den Bedürfnissen Ihrer Organisation. Sie schaffen mehr Zeit und Transparenz für Ihr Team, in einer modernen HR Software. JETZT KOSTENLOS TESTEN Good Bye, Papier Chaos! Herzlich Willkommen, Digitale Personalakte! Mit Hilfe der digitalen Mitarbeiterverwaltung können Sie alle Informationen über Ihre Mitarbeiter übersichtlich an einem Ort abspeichern. Suchen Sie mühsam nach Arbeitsverträgen, Attesten oder sonstigen Mitarbeiterdokumenten und verlieren dadurch wertvolle Zeit? Mit unserer Digitalen Personalakte finden Sie alles auf einen Blick im Mitarbeiterprofil. Dank des Employee Self Service (ESS) können zahlreiche Daten eigenständig von den Mitarbeitern gepflegt werden. So sparen Sie Zeit, Geld und natürlich Nerven für andere wichtige Themen. Bewerbermanagement leicht gemacht Mit unserem übersichtlichen Recruiting Modul verlieren Sie nie mehr einen Bewerber aus den Augen. Durch intuitives Drag & Drop können Sie ihre Bewerber schnell durch die Phasen Ihres individuellen Bewerbungsprozesses leiten. Eingangsbestätigungen werden automatisiert versendet und personalisierte Terminvereinbarungen oder Absagen sind mit einem Klick möglich. Viele Funktionen wie das Abgeben von Bewertungen für Bewerber, schreiben von Kommentaren und die Einbindung weiterer Teammitglieder sind problemlos möglich. STAFFBOARD 30 TAGE KOSTENLOS TESTEN! JETZT ANMELDEN Eine kleine Auswahl unserer treuen Kunden. \"Wir sind an dem Punkt, an dem wir ohne dieses Tool schlicht nicht arbeiten könnten.\" Jakob Schoroth (Reparando GmbH) Managing Director ✔️ staffboard wurde in Deutschland gegründet und hat seinen Hauptsitz in München. ✔️ Die Daten werden ausschließlich in Deutschland verarbeitet und verschlüsselt gespeichert. ✔️ Regelmäßige Updates und Backups sorgen für größtmögliche Sicherheit. Zudem liegen ISO-Zertifizierungen der Hosting Provider vor. ✔️ Die staffboard HR Software und die Daten werden in Rechenzentren in Deutschland gehostet. ✔️ Unternehmen mit dem Siegel hinterlegen beim BITMi e.V. den Standard ihrer Maßnahmen bzgl. Datenschutz. ✔️ Für den Vertrag mit den Hosting Provider gilt ausschließlich deutsches Recht, insbesondere das deutsche Datenschutzrecht, das BGB und das HGB. ✔️ Wir unterliegen der Kontrolle eines externen und unabhängigen Datenschutzbeauftragten. ✔️ Eine AV-Vereinbarung mit jedem Kunden gewährleistet Datenschutz und Datensicherheit. ✔️ Unsere Mitarbeiter sind im Umgang mit sensiblen, personenbezogenen Daten geschult und erhalten regelmäßige Unterweisungen. ✔️ 100% Service: Bei Fragen zum Produkt finden Sie stets einen deutschsprachigen Ansprechpartner. ✔️ 100% Qualität: Die in Deutschland designte staffboard HR Software wird auch in Deutschland getestet. ✔️ 100% Zukunft: Die staffboard HR Software ist investitionssicher und wird kontinuierlich weiterentwickelt und aktualisiert. Melden Sie sich für unseren Newsletter an, um regelmäßig über neue Funktionen und Produkt Updates informiert zu werden. Registrien Email sent! Check your inbox to complete your signup. Digitalisieren Sie Ihre HR Prozesse Unsere staffboard HR Software automatisiert und vereinfacht alle wesentlichen Personalprozesse. Dashboard Recruiting (ATS) Digitale Personalakte Abwesenheitsmanagement Feedback & Performance Learning Zeiterfassung Lohnabrechnung Organigramm Reports Kostenlos & unverbindlich Tage testen * Ich akzeptiere die Datenschutzbestimmungen und die AGB . Jetzt anmelden Benutzerfreundlich Unser intuitives Design ermöglicht eine steile Lernkurve ohne große Einarbeitung. Flexibel Jedes Unternehmen ist anders – und das wissen wir. Darum lässt sich staffboard an Ihre Anforderungen anpassen. Online Greifen Sie von überall mit einer verschlüsselten Verbindung auf staffboard zu. SUPPORT Allgemeine Fragen zum Produkt? 089 - 1250 1458 contact@staffboard.de Für technischen Support innerhalb der Software steht Ihnen ein Ticketsystem zur Verfügung. UNTERSTÜTZER & PARTNER Karriere [de] Impressum [de] Datenschutz [de] AGB [de] Career [en] Imprint [en] Privacy Policy [en] Terms & Conditions [en] 2025 © staffboard | Ihr Copilot im HR Team"
    },
    {
      "url": "https://whiteheronestate.com/contact/",
      "text": "Contact Us | White Heron Estate Herefordshire White Heron White Heron Stay Back Overview The Colloquy The Sherriffs The Lodge The Forge Field Cottage Gardener’s Cottage Tours Back Overview E-Bike Farm Tour & Tasting of the estate Private e-bike tours for groups Private Walking Tour & tasting for groups white heron meander – guided 3 day e-bike tour Walking Tour & Tasting Self-Guided slow cycles – E-Bike hire Plan Your Visit Back Overview The Area Eating Out Things To Do Handpicked Suppliers The Estate Back Overview Our Drinks How We Farm Heritage Venue Hire Back Overview Conferences Corporate Breaks Retreats Intimate Weddings Film Location Blog Contact Stay Back Stay Overview The Colloquy The Sherriffs The Lodge The Forge Field Cottage Gardener’s Cottage Tours Back Tours Overview E-Bike Farm Tour & Tasting of the estate Private e-bike tours for groups Private Walking Tour & tasting for groups white heron meander – guided 3 day e-bike tour Walking Tour & Tasting Self-Guided slow cycles – E-Bike hire Plan Your Visit Back Plan Your Visit Overview The Area Eating Out Things To Do Handpicked Suppliers The Estate Back The Estate Overview Our Drinks How We Farm Heritage Venue Hire Back Venue Hire Overview Conferences Corporate Breaks Retreats Intimate Weddings Film Location Blog Contact Home > Contact Get in touch with us Our team are here to help with any questions, feedback, or support you need—just fill out the form below, and we’ll be in touch with you soon. Contact Details Get in touch with us by filling out the form or our details, and a member of our team will respond promptly. Based right here on the estate, able to assist if you’re looking for support, have an inquiry, or simply need more information. We look forward to hearing from you! 01544 340241 White Heron Estate, Lyonshall, Herefordshire, HR5 3JA info@whiteheronestate.com Connect with us Facebook Instagram LinkedIn \" * \" indicates required fields Name * Email Address * Telephone * Message * Altcha This form requires JavaScript! Send Message Where to find us The closest large town is Leominster, easily accessed by A roads from Hereford, Worcester, Shrewsbury and Kidderminster. Take A44 from Leominster towards Rhayader and Kington.  Continue on A44 when it turns to the right signed Pemridge and Kington. Go through the village of Pembridge, and after approx 3.5 miles, going down into a steep dip, take a steep right turn signed The Whittern. Please drive slowly from this point. Follow this lane for exactly 0.8 of a mile and The Colloquy is on the right. (the entrance is signed and is between a stone wall and a hedge).   Drive round to the right for parking. what 3 words The Colloquy, Gardeners Cottage, The Forge and/or The Lodge – ///flagged.selection.thick Field Cottage – ///rummage.clouds.executive Brook Farm House – ///assets.wobbles.saved The Sherriffs – ///fractions.method.offers Book Your Stay Book A Tour Our Sister Companies White Heron Drinks Whittern Farms Join Our Mailing List * indicates required Email Address * Get in touch 01544 340 241 info@whiteheronestate.com White Heron Estate, Lyonshall, Herefordshire, HR5 3JA Facebook Instagram LinkedIn Useful Links The Estate Venue Hire Stay Blog Tours Contact Plan Your Visit Terms & Conditions Privacy Policy Accessibility statement Environmental Statement Registered in England and Wales. Company number: 10201066 © 2025 White Heron Website by eighteen73"
    },
    {
      "url": "https://www.heron.org/contact-us/",
      "text": "Contact Us - Heron Foundation Contact Search Heron home About Us About Us The Evolution of Heron Our Team Careers Portfolio of Work Properly Capitalizing Enterprises Net Contribution Conscious Portfolio Construction — Heron U.S. Community Investing Index Engage with us The Heron Blog Publications FAQs and Resources Contact Us If after perusing our site you have questions that we haven’t answered, please feel free to shoot us a note! Name Organization Name Business Address Business Address 1 Business Address 2 City State Zip Code Country Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Email Address * About Yourself * Δ Contact Us The Heron Foundation P.O. Box 9438, New Haven, CT  06534 (475) 250-1020 info@heron.org Heron home heron facebook link heron twitter link heron linkedin link Contact Us Privacy Policy Terms of Use Copyright 2025\t                \tHeron (475) 250-1020 info@heron.org Back to top"
    },
    {
      "url": "https://haughtyheron.com/about-the-haughty/",
      "text": "About The Haughty Heron in Port St. Joe, Florida Skip to content MENU CLOSE Live Music & Events Package Store The Loft About The Haughty 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm About The Haughty Heron Bar & Package Store The Best Beach Bar in Port St. Joe Upscale down-home–The Haughty Heron is the gathering place where everyone’s a local! Our upscale interior has a full bar and there are always sporting events on one of our 7 big screens. We offer craft cocktails, a complete line of liquors, fine wines, draft beer, and a wide selection of imported craft beers. The outdoor patio bar is a great place to relax with a fine cigar from our humidor and enjoy a sunset over St. Joseph Bay while listening to live music . We are the party headquarters for any special occasion, offering assorted baskets with our fine wines and spirits . Are you looking for a place to hold that special occasion ? The Haughty Heron can help you with that too. We are located next to Port St. Joe Marina and within walking distance of the downtown district restaurants and the Piggly Wiggly Shopping Center. Come see for yourself why we were awarded a Certificate of Excellence by Trip Advisor and voted the best wine/liquor store and bar 2 years in a row! Learn more about our: Live Music & Events Package Store The Loft Vacation Rental Back to home page Back to home page 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm ©2025 The Haughty Heron. All\n          rights reserved. • Site Map • Privacy Policy • Site by KMA"
    },
    {
      "url": "https://www.heronvalley.co.uk/pages/contact",
      "text": "Contact Us\n– Heron Valley Sign in close We've sent you an email with a link to update your password. A password reset email has been sent to the email address on file for your account, but may take several minutes to show up in your inbox. Please wait at least 10 minutes before attempting another reset. Email address * Password * Lost your password? First Name Last Name Email address * Password * Lost your password? Please enter your email address. You will receive a link to create a new password via email. Email address Cancel No account yet? Registering for this site allows you to access your order status and history. Just fill in the fields below, and weâll get a new account set up for you in no time. We will only ask you for information necessary to make the purchase process faster and easier. Create an account Login Search Shop Juices Bubblies Mixers Ciders Vinegar Bar & coffee shop Events Cocktail recipes Apple mojito Bramble Berry daiquiri Dark 'n' stormy Hedgerow stinger Mint julep Moscow mule Mulled cider Partridge in a pear tree Pink panther Pirate pimms Pimms stinger Respect your elders Our story Valley life Contact Shopping basket close No products in the basket. 01548 550 256 Events Our Story Contact Us Free UK delivery close Search Cart ( 0 ) 0 / £0.00 SHOP Juices Bubblies Mixers Ciders Vinegar BAR & COFFEE SHOP Events COCKTAIL RECIPES Apple Mojito Bramble Berry Daiquiri Dark 'n' Stormy Hedgerow Stinger Mint Julep Moscow Mule Mulled Cider Partridge in a Pear Tree Pink Panther Pirate Pimms Pimms Stinger Respect Your Elders Our Story VALLEY LIFE Contact Us If you need to get in touch give us a call, drop an email or use the contact form below: Send How to find us: Heron Valley Cider Ltd Heron Valley Orchards Loddiswell Kingsbridge Devon TQ7 4EA Café opening times: Tues - Sat: 9am-5pm Call us: Office - 01548 550 256 Email: sales@heronvalley.co.uk You are in advanced mode. You can turn it off in left sidebar. To use advanced options, you will need to enter your own Google Maps API  Key. Get Google API Key Shop Juices Bubblies Mixers Ciders Vinegar Useful links Events Bar & Coffee Shop Contact Us Privacy Policy Delivery & Returns Terms of Service Contact us Heron Valley Cider Heron Valley Orchards Loddiswell Kingsbridge Devon, UK TQ7 4EA Office - 01548 550 256 sales@heronvalley.co.uk Heron Valley Orchards Down the grassy lane, over the river, through the orchards and you're there. For as long as we can remember, we've been making traditional Devon cider, apple cider vinegar and delicious juices and bubbly soft drinks here . Newsletter Email address: 2021 Heron Valley Cider Ltd. Registered in England. Company registration number  03402882 Shop 0 Cart My account Scroll To Top Scroll To Top"
    },
    {
      "url": "https://haughtyheron.com/",
      "text": "The Haughty Heron Port St. Joe Bar & Liquor Store Skip to content MENU CLOSE Live Music & Events Package Store The Loft About The Haughty 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm The Haughty Heron in Port St. Joe, FL logo Events Location Best bar in Port St. Joe with live music Come visit Port St. Joe’s favorite place to relax with friends, listen to live music and enjoy a signature cocktail, imported craft beer, or a fine glass of wine. News & Events Click on an event to learn more on our Facebook page View all upcoming events The Haughty Heron in Port St. Joe, FL Sep 10 at 7:01 AM Join us tonight for Music Bingo with Mic tonight at 6:30! 🔥🎶 View Facebook post About The Haughty Overlooking St. Joseph Bay next to Port St. Joe Marina, and open 7 days a week, the Haughty Heron is the gathering place where everyone’s a local. Enjoy an upscale interior with sporting events on 7 big screens and a full-service package store . And there’s always a party in the patio beer garden with live music and events on the bayside stage. Learn more about us Package Store Fine Wine, Liquor, Craft Beer, Cigars Inside our cellar The Loft Fisherman’s Paradise Vacation Rental Photos & reservations Location Click on the map for directions Back to home page Back to home page 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm ©2025 The Haughty Heron. All\n          rights reserved. • Site Map • Privacy Policy • Site by KMA"
    },
    {
      "url": "https://www.heron.org/about-us/",
      "text": "About Us - Heron Foundation Contact Search Heron home About Us About Us The Evolution of Heron Our Team Careers Portfolio of Work Properly Capitalizing Enterprises Net Contribution Conscious Portfolio Construction — Heron U.S. Community Investing Index Engage with us The Heron Blog Publications FAQs and Resources About Us Heron champions the people who believe profoundly in the promise of their community and who dare to chase the shared dreams for the place they call home. We work directly with local organizations that are embedded in, deeply trusted by, and inherently driven by the voice and vision of their neighbors. We invest in their know-how, skills, and determination to build a community that reflects and honors the dignity of all and where prosperity is shared. Heron does not operate as a traditional “funder.” Heron partners with communities to source relevant and actionable research, nurture a learning collaborative of peers, help communities reclaim their narrative of place and self, foster stronger collective agency and social bonds, and provide long-term financial support. We aspire to be, first and foremost, an organization that nurtures a network of local people advancing their communities and achieving the transformation they seek. Heron works mainly in rural communities experiencing persistent poverty, systemic challenges, historic disinvestment, and a legacy of disenfranchisement. We also believe that this model is applicable across all geographic regions, all socio-economic classes, and in urban, rural, and exurban communities alike. Photo by Qusai Akoud What do we believe? The welfare of people and society depends upon the health and resilience of communities. We must do a better job of moving financial and other capital into disadvantaged communities. The power to control and deploy funds for community welfare must reside in communities themselves. Power must be held collectively by an engaged citizenry. An understanding of the community’s history, current health and external trends and threats is necessary to guide decision-making. “Mother Trees” (well-connected, highly resourceful anchor institutions) play a critical role in helping to nourish, inform and lead community activity. A robust population of local enterprise together with other essential social, civic, physical, and enabling systems, is essential in a healthy community. The community must invest in those enterprises and projects that build the stores of human, natural, civic and economic capital the community requires. All serious philanthropic institutions must consciously and aggressively seek to devote all of their assets to the pursuit of their missions. The field of philanthropy needs new models and methods to deploy its capital more effectively. “At its core, Heron is about empowering people and institutions. We empower collections of people because it’s fundamental to the success of our society.” – Buzz Schmidt, Heron Foundation Board Chair What do we do? Over the next eight years, we will transfer the bulk of our financial capital to a cohort of deeply embedded local anchor institutions that are (1) active in rural communities that have faced generations of persistent poverty, (2) committed to building the “collective agency” of increasingly knowledgeable, trusting, and engaged citizens in their communities, and (3) keen to learn and use data and research to help guide their decisions and track their progress. We will provide our community partners with extensive data and research, technical assistance, communications support, and networking opportunities. We will share its growing knowledge broadly to help increase capital flow to the direct control of rural communities. We will  invest all our retained financial capital directly into enterprises and projects that benefit these communities. We will leverage all our internal capabilities and experiences to continue indefinitely as a highly effective builder of healthy communities. Learn more... The Evolution of Heron Our Team The Heron Blog Publications Heron home heron facebook link heron twitter link heron linkedin link Contact Us Privacy Policy Terms of Use Copyright 2025\t                \tHeron (475) 250-1020 info@heron.org Back to top"
    },
    {
      "url": "https://haughtyheron.com/live-music-events/",
      "text": "Live Music & Events at the Haughty Heron in Port St. Joe Skip to content MENU CLOSE Live Music & Events Package Store The Loft About The Haughty 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm Live Music & Events at the Haughty in Port St. Joe Entertainment Indoors & Outdoors If you’re looking for live music in Port St. Joe, there’s no better place to be than The Haughty Heron. We’re open 7 nights a week with lots of live music indoors and out. Our upscale interior is a great place to gather with locals and visitors to enjoy great music where we’ve hosted many Nashville songwriters who like to get away to Florida’s Forgotten Coast. Our outdoor patio beer garden has a full bandshell and bayside stage. There’s plenty of room to spread out and take in a stunning sunset in the background over St. Joseph Bay. Why not make a weekend out of it? Pick up a bottle of wine and rent our upstairs loft . Upcoming Events Visit our Facebook page for dates & details on all events Sep 10 Music Bingo with MIC 5:30 PM / EST Sep 10 Music Bingo with MIC at The Haughty Heron 5:30 PM / EST Dec 31 \"Bad Decisions\" New Years Eve at Haughty Heron 12:00 AM / EST Back to home page Back to home page 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm ©2025 The Haughty Heron. All\n          rights reserved. • Site Map • Privacy Policy • Site by KMA"
    },
    {
      "url": "https://www.heronworksllc.com/",
      "text": "Heron Works 0 Skip to Content SERVICES ABOUT TESTIMONIALS CONTACT Get Started Open Menu Close Menu SERVICES ABOUT TESTIMONIALS CONTACT Get Started Open Menu Close Menu SERVICES ABOUT TESTIMONIALS CONTACT Get Started Fractional Support for Your Growing Business Virtual Assistants, Project and Operations Managers, Podcast Managers, and more! We offer customizable part-time help to meet your business’ needs as it grows. Learn More Virtual Assistance Your day will run more smoothly with help from our fractional virtual assistant services that can help you schedule, coordinate logistics, manage your inbox, and so much more that allows you to focus on the parts of your business you truly enjoy. Project Management Elevate your project efficiency with our comprehensive fractional project management services, tailored to seamlessly integrate with your team and drive success. Our talented project managers will ensure projects are delivered on time and your clients are delighted. Podcast Management Podcast management services include episode planning, editing and production coordination, guest outreach, and promotion management to ensure a smooth process and maximum reach for each podcast. Strategic Consulting Accelerate your business growth with our strategic consulting services, designed to help small businesses scale efficiently and sustainably. Heron Works partners with you to streamline operations, optimize workflows, and implement smart growth strategies that drive long-term success. Our expert consultants bring deep experience in business strategy, financial planning, and operational excellence, ensuring you have the tools and insights needed to thrive in a competitive market. Our Services Operations Management Our operations experts seamlessly manage the day-to-day of your business, enhancing productivity and process streamlining for your business. Personal Assistance Personal assistance services streamline daily life by handling tasks like calendar management, travel arrangements, email organization, and appointment scheduling, ensuring you stay organized and focused on their priorities. Our Expertise We specialize in serving clients that are ready to scale up and need a fractional project manager to accelerate that growth. Our many areas of expertise include: Administrative Support – Calendar management, email organization, and travel planning for streamlined operations. Project Management – Overseeing timelines, resources, and deliverables for efficient project execution. Operations Optimization – Process improvement, workflow creation, and systems management to enhance productivity. Content and Podcast Management – Episode planning, editing and production, guest outreach, and promotion management. Task and Team Management – Delegation, task tracking, and collaboration tools to keep teams aligned and productive. Client and Vendor Relations – Handling inquiries, maintaining communication, and fostering strong external relationships. Marketing Support – Social media scheduling, email campaigns, and content coordination to boost brand visibility. Personal Home Management – Household scheduling, meal planning, appointment setting, and errand coordination to simplify life. Contact Us Have questions or ready to discuss your project needs? Fill out the form below, and our team will get in touch with you shortly! Name * First Name Last Name Email * Message * Requested Services Project Management Operations Management Virtual Assistance Thank you! Heron Works About Contact hannah@heronworksllc.com (434) 409-4523"
    },
    {
      "url": "https://heronfoods.com/contact-us/",
      "text": "Contact Us | Heron Foods Corporate Search In Store Products Search Find your local store Offers In store products Browse instore products. Alcohol Bakery Chips & Potato Cooplands Drinks Food Cupboard Fresh Fridge Essentials Fruit & Veg Health & Beauty Household Ice Cream Meat & Fish Pets Pizza Ready Meals Roasting Essentials Sweet Treats Vegetarian XSELL Product Ranges News Savings stamps Careers Click here to see Even Lower Prices! Menu Store Offers In store products Browse instore products. Alcohol Bakery Chips & Potato Cooplands Drinks Food Cupboard Fresh Fridge Essentials Fruit & Veg Health & Beauty Household Ice Cream Meat & Fish Pets Pizza Ready Meals Roasting Essentials Sweet Treats Vegetarian XSELL Product Ranges News Savings stamps Careers Contact Heron Foods Head office Whatever the question or the problem we would be delighted to hear from you. Over the last few years we’ve helped raise more than £500,000 for our chosen charities, including the Teenage Cancer Trust, Macmillan Cancer Support, Make-A-Wish and Save the Children. This year, we’re supporting The Daisy Appeal, in our heartland in Hull, which has so far raised around £75,000. Registered Office Address Heron Foods Limited The Vault Dakota Drive Estuary Commerce Park Speke Liverpool L24 8RJ By Post Heron Foods Limited Jackson Way Melton East Yorkshire HU14 3HJ By Telephone Head Office: 0345 603 7300* *UK Landline calls cost up to 9p per minute. Mobile call charges vary. The call charge rate will depend on your landline/mobile service provider. Please check with them if you would like to know what rate they are charging you. By Email Email us at info@heronfoods.com Media and press enquiries Email us at press@bmstores.co.uk Get in touch with Heron Type of feedback* Products/Packaging Store Service Home Delivery Complaint Website Other Your name* Your address* How can we help you today* Product Name Price Paid Do you still have the packaging? Yes No Email Address* Contact Number Barcode Number Batch Code Best Before Date Receipt Number Sign up today To receive regular offers, deals and news to your inbox! Title Select... Mr Mrs Ms Miss Dr Name Email Postcode I agree to be emailed Subscribe Top Quality, Low Prices Find your local store About Suppliers Heron Foods Careers Help Customer Service/FAQ’s Returns Policy Terms & conditions Corporate Privacy Policy Cookie policy Legal Corporate Governance Arrangements Tax strategy Corporate Social Responsibility Anti Slavery Gender Pay Gap Packaging Recycling Property GDPR Registered Office Address Heron Foods Limited, The Vault, Dakota Drive, Estuary Commerce Park, Speke, Liverpool, L24 8RJ Correspondence Address Heron Foods Limited, Jackson Way, Melton, East Yorkshire, HU14 3HJ Copyright © 2025 Heron Foods. All rights reserved. All offers are subject to availability. Prices include VAT where applicable. Find us on social media About Suppliers Heron Foods Careers Help Customer Service/FAQ’s Returns Policy Terms & conditions Corporate Privacy Policy Cookie policy Legal Corporate Governance Arrangements Tax strategy Corporate Social Responsibility Anti Slavery Gender Pay Gap Packaging Recycling Property GDPR Contact Registered Office Address Heron Foods Limited, The Vault, Dakota Drive, Estuary Commerce Park, Speke, Liverpool, L24 8RJ Correspondence Address Heron Foods Limited, Jackson Way, Melton, East Yorkshire, HU14 3HJ Copyright © 2025 Heron Foods. All rights reserved. All offers are subject to availability. Prices include VAT where applicable."
    },
    {
      "url": "http://haughtyheron.com/contact-us.cfm",
      "text": "The Haughty Heron Port St. Joe Bar & Liquor Store Skip to content MENU CLOSE Live Music & Events Package Store The Loft About The Haughty 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm The Haughty Heron in Port St. Joe, FL logo Events Location Best bar in Port St. Joe with live music Come visit Port St. Joe’s favorite place to relax with friends, listen to live music and enjoy a signature cocktail, imported craft beer, or a fine glass of wine. News & Events Click on an event to learn more on our Facebook page View all upcoming events The Haughty Heron in Port St. Joe, FL Sep 10 at 7:01 AM Join us tonight for Music Bingo with Mic tonight at 6:30! 🔥🎶 View Facebook post About The Haughty Overlooking St. Joseph Bay next to Port St. Joe Marina, and open 7 days a week, the Haughty Heron is the gathering place where everyone’s a local. Enjoy an upscale interior with sporting events on 7 big screens and a full-service package store . And there’s always a party in the patio beer garden with live music and events on the bayside stage. Learn more about us Package Store Fine Wine, Liquor, Craft Beer, Cigars Inside our cellar The Loft Fisherman’s Paradise Vacation Rental Photos & reservations Location Click on the map for directions Back to home page Back to home page 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm ©2025 The Haughty Heron. All\n          rights reserved. • Site Map • Privacy Policy • Site by KMA"
    },
    {
      "url": "https://heronagency.com/contact-us/",
      "text": "Contact Heron Agency, Public Relations, Social Media, Marketing What Work Clients Leadership Blog Connect Select Page CONTACT US We’d love to hear from you! Name (Required) Email (Required) Message (Required) Facebook This field is for validation purposes and should be left unchanged. Δ Address 2626 N. Lincoln Avenue Chicago, IL 60614 Email info@heronagency.com Phone (773) 969-5200 Subscribe to our newsletter Sign up to receive our newsletter and keep up with the latest news, events, and happenings from Heron. First Name Last Name Email * Instagram This field is for validation purposes and should be left unchanged. Δ Follow Follow Follow Follow Follow Follow Follow us on Instagram WHAT WORK CLIENTS LEADERSHIP CAREERS BLOG CONNECT Latest Posts Top Chicago Activities Before Back to School: Heron’s Guide to Soaking Up Summer August 12, 2025 Top Things to Do this August in Chicago: Triathlons, Cruise Views, Craft Brews & Everything in Between July 30, 2025 Heron’s Guide to Change: Chicago Nonprofits Transforming Communities July 16, 2025 Address 2626 N. Lincoln Avenue Chicago, IL 60614 Email info@heronagency.com Phone (773) 969-5200 SUBSCRIBE | PRIVACY STATEMENT | TERMS OF USE Copyright ©  2000-2025  Heron"
    },
    {
      "url": "https://www.heron.org/our-team/",
      "text": "Our Team - Heron Foundation Contact Search Heron home About Us About Us The Evolution of Heron Our Team Careers Portfolio of Work Properly Capitalizing Enterprises Net Contribution Conscious Portfolio Construction — Heron U.S. Community Investing Index Engage with us The Heron Blog Publications FAQs and Resources Team Staff Zaw Min Aung Research Associate Shelley Curnow Director, Systems Operations Kelly Donnelly Managing Director Jenna Koloski Senior Director, Healthy Communities Christopher Thompson Senior Director for Investments John Weiler Managing Director, Finance and Administration Board of Directors Paul Costello Director Jim King Director Felecia Lucky Director Dan McKay, Esq. Director Buzz Schmidt Board Chair Greg Watson Director Heron home heron facebook link heron twitter link heron linkedin link Contact Us Privacy Policy Terms of Use Copyright 2025\t                \tHeron (475) 250-1020 info@heron.org Back to top"
    },
    {
      "url": "https://haughtyheron.com/the-loft/",
      "text": "The Loft at The Haughty Heron in Port St. Joe, Florida Skip to content MENU CLOSE Live Music & Events Package Store The Loft About The Haughty 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm The Loft Vacation Rental Upstairs Accommodations The upstairs loft of the Haughty Heron is a special place to stay for your next get-a-way to Port St. Joe. Within walking distance of great restaurants, Port St. Joe Marina, Bluewater Outriggers, Piggly Wiggly grocery store and more. We’re a favorite for fishermen taking a charter out of the marina and offer plenty of amenities with a tennis court, the Bay Walk waterfront trail, a historic downtown shopping district, a public boat ramp and a lighthouse all nearby. This beautifully furnished two-bedroom apartment features an open floor-plan kitchen, living and dining area, and second-floor porch overlooking the bay. The Loft is also available to rent for parties and other social events. Contact us today for more information Back to home page Back to home page 117 Sailors Cove Dr. Port St. Joe, FL 32456 (850) 229-3463 [email protected] Mon - Thurs: 10am-10pm Fri & Sat: 10am-12am Sun: 10am-8pm ©2025 The Haughty Heron. All\n          rights reserved. • Site Map • Privacy Policy • Site by KMA"
    },
    {
      "url": "https://www.herontx.com/about/management/",
      "text": "Management - Heron Therapeutics Skip to content Aug 15 2025 - \n\t\t\t\tHeron Therapeutics, Inc. Adopts Tax Benefits Preservation Plan to Protect NOL... Aug 8 2025 - \n\t\t\t\tHeron Therapeutics Announces Q2 2025 Financial Results and Highlights Commercial... Aug 8 2025 - \n\t\t\t\tHeron Therapeutics Announces Comprehensive Capital Restructuring to Support... Aug 8 2025 - \n\t\t\t\tHeron Therapeutics Reschedules Second Quarter 2025 Earnings Release and Conference... × Product Portfolio Overview Product Pipeline SUSTOL® CINVANTI® ZYNRELEF® APONVIE® Our Focus Overview Acute Care Oncology Care Medical Professionals Overview Acute Care Solutions Oncology Care Solutions Publications IITs, Grants, Sponsorships, and Contributions Investors Corporate Presentations News Releases Events SEC Filings Stock Information Analyst Coverage Corporate Governance Board of Directors Committee Composition Corporate Governance Documents Information Request E-mail Alerts RSS Feeds About Overview Management Board of Directors Compliance Contact Us Careers open menu Management Craig Collard Chief Executive Officer Ira Duarte Executive Vice President, Chief Financial Officer William Forbes Executive Vice President, Chief Development Officer Mark Hensley Chief Operating Officer Brett Fleshman Chief Business Officer Kevin Warner, PharmD Senior Vice President, Medical Affairs Strategy and Engagement John Arthur, Ph.D. Senior Vice President, Manufacturing & Supply Robert Sullivan Senior Vice President, Oncology Care Franchise and Commercial Operations Ryan Craig Vice President, Marketing David Barozzino Vice President, Strategic Growth and Customer Development Melissa Jarel Executive Director, Legal John Aiken Executive Director, People Management and Training Craig Collard Chief Executive Officer Mr. Collard most recently served as the Chief Executive Officer of Veloxis Pharmaceutics A/S (now Veloxis Pharmaceuticals Inc., “Veloxis”) before it was acquired by Asahi Kasei Corp, a transplant-focused pharmaceutical company with its principal office in Cary, North Carolina, from 2015 to December 2021. Prior to joining Veloxis, Mr. Collard served as the Chief Executive Officer and the Chairman of the Board of Directors of Cornerstone Therapeutics, Inc., a pharmaceutical company (“Cornerstone”), from 2011 until it was acquired by Chiesi Farmaceutici S.p.A. in 2014. Mr. Collard also served as Cornerstone’s Interim Chief Financial Officer, from 2010 to 2011, and as its President, from 2008 to 2011. Mr. Collard served as the Founder, President and Chief Executive Officer of Cornerstone BioPharma Inc. (formerly Cornerstone BioPharma Holdings, Ltd.), a pharmaceutical company, and as a member of its board of directors, from 2004 to 2008. Prior to that, Mr. Collard served as President and Chief Executive Officer of Carolina Pharmaceuticals, Inc., a specialty pharmaceutical company that he founded in 2003. Mr. Collard currently serves on the board of directors of TerrAscend Corp., a North American cannabis operator based in Mississauga, Canada, since December 2018. Mr. Collard previously served as a member of the board of directors of Sierra Oncology, Inc., a San Mateo, California-based late-stage biopharmaceutical company acquired by GlaxoSmithKline plc, from May 2020 to July 2022. He also served as Chairman of Opiant Pharmaceuticals, Inc., a specialty pharmaceutical company developing therapies to treat substance and use disorders and drug overdose since October 2018 until being acquired by Indivior on March 1, 2023. Mr. Collard holds a B.S. in Engineering from the Southern College of Technology (now Southern Polytechnic State University). Back to top Ira Duarte Executive Vice President, Chief Financial Officer Ira Duarte joined Heron as Executive Vice President, Chief Financial Officer in June 2023. Ms. Duarte brings significant experience and expertise in financial leadership to Heron. Prior to joining Heron, Ms. Duarte served in financial leadership roles from 2016 to 2023, most recently as Chief Financial Officer, at Veloxis Pharmaceuticals, Inc., a fully integrated specialty pharmaceutical company. Prior to that, Ms. Duarte served as the Corporate Controller at BioDelivery Sciences, Inc. from 2014 to 2016, and from 2009 to 2014 she was Senior Director of Corporate Finance for Chiesi USA, Inc. and Director of Accounting and Financial Planning for Cornerstone Therapeutics, Inc., where she was a core member of the team that guided the sale of Cornerstone Therapeutics, Inc. to Chiesi Farmaceutici S.p.A. Ms. Duarte previously held various roles from Staff to Senior Manager at Ernst & Young Global Limited. Ms. Duarte currently serves on the board of directors of TerrAscend Corporation and has since December 2022. Ms. Duarte is a Certified Public Accountant and holds a B.S. in Accounting from Florida Atlantic University. Back to top William Forbes Executive Vice President, Chief Development Officer William Forbes has served as our Executive Vice President, Chief Development Officer since June 2023.  Dr. Forbes brings more than thirty years of pharmaceutical product development experience to Heron and has contributed to 14 marketing approvals spanning a diverse range of therapeutic areas in the U.S. and European markets.  Prior to joining Heron, Dr. Forbes served as the Chief Development Officer at Trevi Therapeutics, Inc. from 2021 to 2022. From 2016 to 2020, Dr. Forbes served as the President and CEO of Vivelix Pharmaceuticals, Ltd., where he was the founder and responsible for all strategic and operational aspects of the organization. Prior to that, Dr. Forbes served as the Chief Development Officer at Salix Pharmaceuticals, Inc. as the Head of Medical and R&D from 2005 to 2015. Earlier in his career, Dr. Forbes held various positions in clinical research and development at Metabasis Therapeutics, Inc., Otsuka America Pharmaceuticals, Inc., and Glaxo, Inc.  Dr. Forbes received his Doctor of Pharmacy degree from Creighton University, and he completed fellowships in cardiovascular research at Creighton Cardiac Center and in clinical research at Glaxo, Inc. Back to top Mark Hensley Chief Operating Officer Back to top Brett Fleshman Chief Business Officer Brett Fleshman joined Heron as Chief Business Officer in August 2024. Mr. Fleshman contributes 25 years of experience in corporate and business development, commercial strategy, and marketing of pharmaceuticals, biologics, and surgical devices to the management team, further enabling the company’s next phase of growth. Prior to joining Heron, Brett Fleshman served as Managing Director at NovaQuest Capital Management, a leader in product-based financing for late-stage clinical and commercial biopharmaceutical programs where he was responsible for deal sourcing, structuring nondilutive investments, negotiations, diligence, and post-close investment management. Prior to NovaQuest, Mr. Fleshman served as Vice President of Strategy and Corporate Development for Veloxis Pharmaceuticals, where he helped formulate a turnaround commercialization strategy which led to the company’s acquisition in 2020 by Asahi Kasei. Previously, Mr. Fleshman held senior commercial and business development roles at Cornerstone Therapeutics, supporting numerous company acquisitions, asset purchases and territory licenses to build thriving hospital and rare disease businesses that helped lead to the company’s acquisition by Chiesi Pharmaceutici S.p.A. Mr. Fleshman also held senior marketing roles at Ther-Rx Corporation and Genzyme Biosurgery, now Sanofi Genzyme. Throughout his career, Mr. Fleshman has focused on developing efficient strategies for commercializing new products and revitalizing distressed assets. Mr. Fleshman earned a degree in Business Administration from the John M. Olin School of Business at Washington University in St. Louis. Back to top Kevin Warner, PharmD Senior Vice President, Medical Affairs Strategy and Engagement Dr. Kevin Warner began working as Senior Vice President of Medical Affairs Strategy and Engagement with Heron Therapeutics in 2024. Prior to that, he had served as a consultant/advisor and was on the speaker’s bureau with Heron Therapeutics since 2022.  Dr. Warner has been Director of Pharmaceutical Sciences for Osteal Therapeutics since 2015.  He is the co-developer of VT-X7 intra-articular antibiotic irrigation therapy for the treatment of peri-prosthetic joint infection with the primary responsibility for dosing, administration, and monitoring.  In addition to his responsibilities at Heron Therapeutics and Osteal Therapeutics, Dr. Warner is a clinical staff pharmacist at Covenant Healthcare, a 650-bed teaching hospital in Saginaw, MI, and home infusion pharmacist at Covenant HealthCare VNA Home Infusion. Dr. Warner has over 15 years of experience in clinical and infusion pharmacy with a special focus on in pharmacokinetics, pharmacodynamics and perioperative medicine.  Dr. Warner received his Doctor of Pharmacy degree from Ferris State University in Big Rapids, MI. Back to top John Arthur, Ph.D Senior Vice President, Manufacturing & Supply John Arthur, Ph.D. joined Heron as Vice President of Manufacturing and Supply in 2017. Dr. Arthur has more than 20 years of experience in pharmaceutical manufacturing. From 2013 to 2016, he was Vice President of Manufacturing and CMC at Mast Therapeutics, Inc., where he led all CMC activities for multiple Phase 2 and Phase 3 clinical programs. From 2012 to 2013, Dr. Arthur was Senior Director of Manufacturing at Auspex Pharmaceuticals, Inc. Prior to his role at Auspex, he held several positions of increasing responsibility at various biopharmaceutical companies, including Cadence Pharmaceuticals, Inc., Kanisa Pharmaceuticals, Inc., Salmedix, Inc., Prometheus Laboratories Inc., Maxim Pharmaceuticals, Inc. and Ionis Pharmaceuticals, Inc. Dr. Arthur received a B.S. in Biochemistry from Western Washington University, a Ph.D. in organic chemistry from the University of South Carolina, Columbia and conducted his postdoctoral research at Michigan State University. Back to top Robert Sullivan Senior Vice President, Oncology Care Franchise and Commercial Operations Robert Sullivan joined Heron as Senior Director, Oncology Commercial Operations in 2017. He was promoted to Vice President, Contracting and Commercial Operations in 2020, then to Senior Vice President, Oncology Care Franchise and Commercial Operations in 2023. Mr. Sullivan has more than 20 years of experience serving in various leadership positions in Sales, Operations and Market Access with biotechnology companies and group purchasing organizations. From 2007 to 2017, Mr. Sullivan held various positions of increasing responsibility with the International Oncology Network (ION), a division of AmerisourceBergen. He received a B.S. degree in business administration, management from Towson University. Back to top Ryan Craig Vice President, Marketing Ryan Craig joined Heron in August 2023 as Vice President of Marketing. He has more than 22 years of pharmaceutical industry experience in a variety of commercial positions including sales, marketing, market access, training, and corporate strategy. Ryan spent 15 years at Salix Pharmaceuticals progressing from Product Manager to Associate Director of Marketing at the time that Salix was acquired in 2015. He has managed and led numerous product launches across categories including gastroenterology, hepatology, endocrinology, neuroscience, pain, infectious disease, and solid-organ transplant. Prior to joining Heron, Ryan was VP, Marketing and Corporate Strategy at Veloxis Pharmaceuticals.  Ryan holds a BS in Business Administration, with a concentration in Marketing from Radford University. Back to top David Barozzino Vice President, Strategic Growth and Customer Development David Barozzino was hired at Heron in Feb 2019 to help commercialize the build out of the sales force and to launch ZYNRELEF and APONVIE. Prior to Heron, David held numerous roles as Sr. Area Sales Director, Area Vice President of Sales, Sr Product Manager, Regional Sales Manager and carried the sales bag. He brings more than 20 years’ experience across both pharma and medical sales in sales leadership, product launches, sales force expansion, brand management, marketing, and market access. David has been part of the scale up at four different biotech companies from the ground up. David holds a BA in Business Administration from the University of Massachusetts Lowell. Back to top Melissa Jarel Executive Director, Legal Melissa Jarel joined Heron in January 2024 and is responsible for overseeing all aspects of Heron’s legal affairs. Previously, Melissa was a member of the legal team at Veloxis Pharmaceuticals, Inc. (“Veloxis”), most recently serving as Associate General Counsel. Melissa held broad responsibilities while at Veloxis that included managing the organization’s company-wide contracting function, overseeing corporate governance matters, and serving on various committees, including the organization’s promotional and scientific review committees and the compliance committee.  Melissa holds a BS in Business Management with minors in Political Science and Communications from the Florida State University and a Juris Doctor from the University of North Carolina School of Law. Back to top John Aiken Executive Director, People Management & Training John Aiken is the Executive Director of People Management and Training at Heron Therapeutics, where he leads the company’s human resources and training functions with a focus on strategic talent development, organizational effectiveness, and employee engagement. With over 25 years of experience in the life sciences, pharmaceuticals, and healthcare sectors, John brings deep expertise in leadership development, change management, and workforce planning.  Prior to joining Heron, Mr. Aiken held senior leadership roles at Veloxis Pharmaceuticals, Teleflex Medical, Golden Corral Corporation, LabCorp, and Bioventus where he successfully designed and implemented enterprise-wide talent strategies, succession planning frameworks, and global learning programs. He has also held leadership positions in Operations and Marketing.  Mr. Aiken holds a Master of Science in Human Resource Management and a Master of Education with a focus on Adult Education. He is a Certified Talent Management Strategist (CTMS) and an active member of several professional organizations, including SHRM, ATD, and LTEN. Sign-Up for Email Updates Receive news and updates on Heron’s latest innovations. Email@domain.com * © 2025 Heron Therapeutics, Inc. All Rights Reserved. Do Not Share My Personal Information Site Map Terms of Use Privacy Policy Patent Information Government Contractor Information To report an adverse event or product complaint: 844-HERON11 (844-437-6611) heronmc@eversana.com General Information 844-HERON11 (844-437-6611) info@herontx.com Dev Tool: Request: about/management Matched Rewrite Rule: (.?.+?)(?:/([0-9]+))?/?$ Matched Rewrite Query: pagename=about%2Fmanagement&page= Loaded Template: page.php"
    },
    {
      "url": "https://www.heronworksllc.com/contact",
      "text": "Contact — Heron Works 0 Skip to Content SERVICES ABOUT TESTIMONIALS CONTACT Get Started Open Menu Close Menu SERVICES ABOUT TESTIMONIALS CONTACT Get Started Open Menu Close Menu SERVICES ABOUT TESTIMONIALS CONTACT Get Started Contact Us Have questions or ready to discuss your project needs? Fill out the form below, and our team will get in touch with you shortly! Name * First Name Last Name Email * Message * Requested Services Project Management Operations Management Virtual Assistance Podcast Management Company Name * Thank you! Heron Works About Contact hannah@heronworksllc.com (434) 409-4523"
    }
  ]
}