{
  "fuentes": [
    {
      "url": "https://www.havana1957.com/group-dining-events/",
      "email": "fsoares@vehospitality.com"
    },
    {
      "url": "https://communitynewspapers.com/miami-beach-news/the-new-havana-1957-brings-the-glamour-of-old-cuba-to-lincoln-road/",
      "email": "advertising@communitynewspapers.com"
    },
    {
      "url": "https://www.havana1957.com/",
      "email": "info@havana1957.com"
    },
    {
      "url": "https://www.havana1957.com/pembroke-pines/contact/",
      "email": "pembroke@havana1957.com"
    }
  ],
  "mails": [
    "advertising@communitynewspapers.com",
    "fsoares@vehospitality.com",
    "info@havana1957.com",
    "pembroke@havana1957.com"
  ],
  "nombre_sitio": "havana1957.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.havana1957.com/group-dining-events/",
      "text": "Host Group Dining & Events at Havana 1957 | Cuban Cuisine & Hospitality Skip to content Happy hour 🍸💃🇨🇺: 4PM - 6 PM | Mon to fri MAIN MENU MAKE A RESERVATION MAIN MENU MAKE A RESERVATION group dining & events Let us know about your event ideas and we will contact you with recommendations about our best options. Ready to plan your event? Request a proposal now LAS VEGAS Las Vegas The Las Vegas Dining Room offers breathtaking aesthetics, an award-winning menu, and a causual atmosphere making it the perfect private space for intimate weddings, rehearsal dinners and social events, corporate, media or product launch events. The Private Dining Room can accommodate up to 64 guests, or be divided with an imperceptible retractable wall to retain intimacy for smaller gatherings of up to 24 or 40 guests in our east and west room’s respectively. Up to 64 guests 3 Rooms REQUEST FOR PROPOSAL see group menu lincoln road Planning a celebration or a special event? At Havana 1957 Lincoln Road, we bring the authentic flavors of Cuba to your table with our expertly curated group menus. Designed for parties of all sizes, our menus offer a selection of traditional Cuban dishes that will delight your guests. From the rich aroma of our slow-cooked Ropa Vieja to the vibrant zest of our Mojitos, each dish reflects the passion and heritage of Cuban cuisine. Whether it’s a corporate event, family gathering, or festive celebration, our dedicated team ensures a memorable dining experience in the heart of Miami Beach. REQUEST FOR PROPOSAL see group menu ocean drive (940) Host your next event at Havana 1957, located in the iconic Breakwater Hotel, where the charm of Old Havana meets the vibrant energy of Miami Beach. Our group menus are thoughtfully designed to bring authentic Cuban flavors to your celebrations, offering a diverse selection of dishes that reflect Cuba’s rich culinary heritage. Whether you’re planning an intimate gathering, a corporate event, or a large celebration, our group menus feature crowd-pleasing favorites like Lechón Asado, Pollo a la Plancha, and our signature cocktails, including the irresistible Mojito Cubano. Paired with our warm hospitality and lively atmosphere, your event will be unforgettable. REQUEST FOR PROPOSAL see group menu ocean drive (1410) Host your next event at Havana 1957, located in the iconic Breakwater Hotel, where the charm of Old Havana meets the vibrant energy of Miami Beach. Our group menus are thoughtfully designed to bring authentic Cuban flavors to your celebrations, offering a diverse selection of dishes that reflect Cuba’s rich culinary heritage. Whether you’re planning an intimate gathering, a corporate event, or a large celebration, our group menus feature crowd-pleasing favorites like Lechón Asado, Pollo a la Plancha, and our signature cocktails, including the irresistible Mojito Cubano. Paired with our warm hospitality and lively atmosphere, your event will be unforgettable. REQUEST FOR PROPOSAL see group menu espanola way Immerse your guests in the heart of Cuban tradition at Havana 1957, located on the picturesque Española Way. Perfect for group gatherings, our menus are thoughtfully curated to bring the vibrant flavors of Cuba to your special occasions. Enjoy iconic dishes like Ropa Vieja, Mojo-Marinated Lechón Asado, and our famous Havana 1957 Chicken, all crafted with authentic recipes that transport you to Old Havana. Whether you’re planning a family celebration, a corporate event, or a festive soirée, our lively atmosphere and exceptional service make every moment unforgettable. REQUEST FOR PROPOSAL see group menu pembroke pines Host your next gathering at Havana 1957 in Pembroke Pines, where the warmth of Cuban hospitality meets the bold flavors of traditional cuisine. Our group menus are designed to make every celebration special, offering a variety of authentic dishes that cater to all tastes. Savor Cuban classics like Lechón Asado, Vaca Frita, and our signature Havana 1957 Chicken, paired with refreshing Mojitos or handpicked wines. Whether it’s a birthday, corporate meeting, or family reunion, our inviting atmosphere and attentive service ensure an unforgettable dining experience. Plan your event with us today and let Havana 1957 Pembroke Pines create a memorable Cuban-inspired celebration for you and your guests. REQUEST FOR PROPOSAL see group menu For any additional questions please contact our Sales Department at the following email address: fsoares@ vehospitality.com LOCATIONS RESERVATIONS MENU GROUP DINING & EVENTS ABOUT US CONTACT US BLOG LOCATIONS RESERVATIONS MENU GROUP DINING & EVENTS ABOUT US CONTACT US BLOG PHOTO GALLERY GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION PHOTO GALLERY GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION hello@havana1957.com www.havana1957.com ©2024 Havana 1957 Accessibility Statement Privacy Policy Affiliate of Vida & Estilo Hospitality Group | Site Development by DATAKI CLOSE MENU ABOUT US LOCATIONS MENU RESERVATIONS GROUP DINING & EVENTS CATERING PEMBROKE PINES MIAMI BEACH BLOG ABOUT US LOCATIONS MENU RESERVATIONS GROUP DINING & EVENTS CATERING PEMBROKE PINES MIAMI BEACH BLOG GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION CONTACT US GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION CONTACT US hello@havana1957.com"
    },
    {
      "url": "https://communitynewspapers.com/miami-beach-news/the-new-havana-1957-brings-the-glamour-of-old-cuba-to-lincoln-road/",
      "text": "The new Havana 1957 brings the glamour of old Cuba to Lincoln Road | Miami Beach Community News# Sign in Publications Aventura Biscayne Bay Broward Community Newspapers Coral Gables Cutler Bay Doral Fort Lauderdale Kendall Miami-Dade Miami Beach Miami Gardens Miramar North Miami North Miami Beach Palmetto Bay Pinecrest South Dade South Miami Sunny Isles West Park Broward County Miami Community Newspaper Sponsored Content CNEWS TV CNEWS TV Media Kit Grant Miller Michael Miller Susan Miller Gloria Burns Oscar Musibay Willard Shepard Fara Sax Wilson Alvarez Categories Miami Cannabis News Automotive Car Reviews FIU Miami-Dade Community News Sports News Miami Community Newspaper Sponsored Content Newspaper Past Editions Aventura Biscayne Bay Broward Coral Gables Cutler Bay Doral Kendall Miami Beach Miami Gardens Miramar News Palmetto Bay Pinecrest South Miami Sunny Isles West Park Events Submit Event Community Events Photo Gallery Latin Builders Association Community News Legal Notices Place Legal Notices Broward County Legal Notices Miami-Dade County Legal Notices City Legal Notices City of Coral Gables City of Hialeah City of Homestead City of North Miami City of Sweetwater City of West Miami Miami-Dade College Town of Cutler Bay Town of Miami Lakes Village of Biscayne Park Village of Palmetto Bay Village of Pinecrest Inspire Health Articles Past Issues Contact About Us Contact Us Legal Notices Submit Press Release E-Newsletters Subscribe Miami-Dade Email Newsletters Broward County Email Newsletter Aventura Email Newsletter Biscayne Bay Tribune Email Newsletter Coral Gables Email Newsletter Cutler Bay Email Newsletter Doral Email Newsletter Kendall Email Newsletter Miami Beach Email Newsletter Palmetto Bay Email Newsletters Pinecrest Email Newsletter South Miami Email Newsletter Sunny Isles Email Newsletter West Park Email Newsletters Inspire Health Email Newsletter Chamber Spotlight Email Newsletter Subscribe Sign in Welcome! Log into your account your username your password Forgot your password? Password recovery Recover your password your email Search Ads: 305.669.7355 Legal Notices: 305.669.7031 Office: 305.669.7030 Facebook Instagram Linkedin Twitter Youtube Advertise  305.669.7355 Media Kit Pay Online Contact Advertise 305.669.7355 Legal Notices 305.669.7031 Office 305.669.7030 Request Info Submit a Press Release Legal Notices 305.669.7031 Events Submit Event View all Events Special Sections Reviews Facebook Instagram Linkedin Twitter Youtube Publications Aventura Biscayne Bay Broward Community Newspapers Coral Gables Cutler Bay Doral Fort Lauderdale Kendall Miami-Dade Miami Beach Miami Gardens Miramar North Miami North Miami Beach Palmetto Bay Pinecrest South Dade South Miami Sunny Isles West Park Broward County Miami Community Newspaper Sponsored Content CNEWS TV CNEWS TV Media Kit Grant Miller Michael Miller Susan Miller Gloria Burns Oscar Musibay Willard Shepard Fara Sax Wilson Alvarez Categories Miami Cannabis News Automotive Car Reviews FIU Miami-Dade Community News Sports News Miami Community Newspaper Sponsored Content Newspaper Past Editions Aventura Biscayne Bay Broward Coral Gables Cutler Bay Doral Kendall Miami Beach Miami Gardens Miramar News Palmetto Bay Pinecrest South Miami Sunny Isles West Park Events Submit Event Community Events Photo Gallery Latin Builders Association Community News Legal Notices Place Legal Notices Broward County Legal Notices Miami-Dade County Legal Notices City Legal Notices City of Coral Gables City of Hialeah City of Homestead City of North Miami City of Sweetwater City of West Miami Miami-Dade College Town of Cutler Bay Town of Miami Lakes Village of Biscayne Park Village of Palmetto Bay Village of Pinecrest Inspire Health Articles Past Issues Contact About Us Contact Us Legal Notices Submit Press Release E-Newsletters Subscribe Miami-Dade Email Newsletters Broward County Email Newsletter Aventura Email Newsletter Biscayne Bay Tribune Email Newsletter Coral Gables Email Newsletter Cutler Bay Email Newsletter Doral Email Newsletter Kendall Email Newsletter Miami Beach Email Newsletter Palmetto Bay Email Newsletters Pinecrest Email Newsletter South Miami Email Newsletter Sunny Isles Email Newsletter West Park Email Newsletters Inspire Health Email Newsletter Chamber Spotlight Email Newsletter Subscribe More Search Home Miami Beach Community News The new Havana 1957 brings the glamour of old Cuba to Lincoln... Miami Beach Community News Miami Beach Featured The new Havana 1957 brings the glamour of old Cuba to Lincoln Road By Community Newspapers - May 11, 2013 Facebook Twitter Pinterest WhatsApp Commissioner Exposito cutting the ceremonial ribbon. V&E Restaurant group is pleased to announce the opening of Havana 1957- a new restaurant in the heart of South Beach, which combines the flavors of traditional Cuban cuisine with the enchantment and sophistication of Havana in the 1950’s. On Friday, April 26th, Commissioner Exposito, joined by locals and Miami Beach Chamber of Commerce members, participated in the ribbon cutting ceremony welcoming the restaurant to Lincoln Road. With elegant art deco touches, the interior décor of Havana 1957 embodies the jet set lifestyle of the movie stars that made Havana their playground. One of the most outstanding features of the restaurant is the classic Cuban Rum bar, which stocks over 100 varieties of rum from around the world. Here guests can enjoy a Cuba Libre or a Mojito cocktail in a sophisticated ambiance, surrounded by vintage Cuban memorabilia without leaving Miami Beach. Havana 1957’s extensive menu contains authentic Cuban dishes prepared by renowned chef Juan Luis Rosales. By only using the freshest ingredients and perfecting each detail of presentation, the plates capture the vibrant taste that has made Cuban cuisine a culinary staple. Serving breakfast, lunch and dinner, highlights from the menu include the Havana 1957 Specialty (family traditional roasted chicken in a savory Cuban gravy served with white rice, black beans, salad and sweet plantains) as well as Churrasco a la Cubana (juicy charbroiled flank steak topped with grilled onions). Havana 1957 also offers delicious daily specials and a wide selection of seafood plates, sandwiches, salads, soups and bites such as croquetas, masitas de puerco (fried pork) and tostones rellenos (stuffed green plantains with beef or shrimp). Irresistible desserts include the traditional Flan de Leche (baked custard with a layer of caramelized sugar) and Pudin de Pan (old fashioned bread pudding) that are guaranteed to make mouths water with delight. Havana 1957 would not be complete without serving the staple Cuban Coffee, which is brewed exclusively with Café Pilon. The ribbon cutting was a success. The highly anticipated Havana 1957 has arrived on Lincoln Road as a glamorous throwback to the days of the iconic Rat Pack. The restaurant is open daily from 9:00 AM to 1:00 AM and has complimentary wi-fi available for all guests. For more information please call 305.397.8683 or visit www.havana1957.com . ABOUT VE RESTAURANT GROUP Vida & Estilo (Spanish for ‘Life & Style’) is the restaurant group behind some of the most well-known and finest restaurants on Espanola Way located in the heart of South Beach and the downtown Miami/ Brickell area. V&E Restaurant group owns and operates OH! Mexico, Café Nuvo, La Cantina, Mojitos Lounge, Segafredo Brickell and Spazio Nero (the club at Segafredo). The Segafredo franchise has also expanded to Bal Harbour Shops and the historical Espanola Way in Miami Beach. V&E is a corporation that stands by the meaning of their name and goes above and beyond to provide their guests an unforgettable luxury experience by incorporating and combining high-end cuisines, diverse selections of specialty cocktails, music from renowned DJ’s and chic yet comfortable atmospheres. V&E Restaurant Group consists of a team of international and experienced professionals with the drive, ambition and power to take a concept, build on it and successfully incorporate the café, epicurean and nightlife concepts into one. Connect To Your Customers & Grow Your Business Click Here Community Newspapers Facebook Twitter Pinterest WhatsApp Previous article New Chapters: Embarking Together Next article Mother’s Day in Miami Beach… Celebrate a mom like no other in a destination like no other Community Newspapers RELATED ARTICLES MORE FROM AUTHOR 35 Mules Welcomes Fourth Cohort of Startups Drivers Showcase High-Performance Cars for Charity Providing Blind Students Unique Experience Dash of the Titans 5K Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. - Advertisement - Advertise  305.669.7355 Media Kit Pay Online Contact Legal Notices 305.669.7031 Events Special Sections Reviews Advertise Promote your business to the localized audience you want to reach with Miami's Community Newspapers.  Call 305.669.7355 or view our Media Kit. Company Request Information Case Study Media Kit Newsletter Advertising Social Media Advertising Video Podcasts Events Advertising Terms and Conditions Terms & Conditions Privacy Policy Cookie Policy Editorial Policy About Us ADA Compliance Policy Latest Miami News CasaCuba Breakfast Highlights Live Like Bella and Community Leaders CNEWS TV September 10, 2025 0 ________________________________________________________________________\r\nOn September 4th, we hosted another impactful CasaCuba Networking... Unfiltered with the Regalados Episode 1 CNEWS TV September 10, 2025 0 Commissioner Raquel Regalado and her dad, Mayor Tomas Regalado,... LaJamaTV Review: Between 2 Buns Finds Its Home in Kendall Kendall Community News September 9, 2025 0 By: Frankie Zerquera @cheffrankiegetit & Guillermo Alfonso @soflaaa of... Follow us Facebook Instagram Linkedin Mail Twitter Youtube © 2023 Miami's Community Newspapers a Miller Publishing Company. 6796 SW 62nd Avenue South Miami, Florida 33143 (305) 669-7030"
    },
    {
      "url": "https://www.havana1957.com/",
      "text": "Discover the Best Cuban Food Near You at Havana 1957 Skip to content Happy hour 🍸💃🇨🇺: 4PM - 6 PM | Mon to fri MAIN MENU MAKE A RESERVATION MAIN MENU MAKE A RESERVATION Authentic Dine-in, Take Out & Delivery Havana 1957 is a new chain of Cuban restaurants unlike other traditional Cuban restaurants. It sets itself apart by creating a unique dining experience that allows you to spend Un Dia En La Habana and relive the glory and glamour of old Cuba during the 1950’s. BOOK NOW OR ORDER ONLINE Authentic Cuban Cuisine Meets Miami Spice A Culinary Celebration Miami Spice has arrived! Relive the glory of Old Havana with our authentic 3-course lunch ($35) and dinner ($45) this August & September. It’s your chance to indulge in classic Cuban flavors at an unbeatable value. Book your unforgettable experience through OpenTable. (Miami Locations Only) BOOK YOUR TABLE OR ORDER ONLINE Upcoming Events Upcoming Events food & drink our menu Select Location Lincoln Road Ocean Drive (940) Ocean Drive (1410) Española Way Pembroke Pines Las Vegas Select Location Lincoln Road Ocean Drive (940) Ocean Drive (1410) Española Way Pembroke Pines Las Vegas find your nearest restaurant Havana 1957 offers six convenient outposts in Miami, Florida. \nOur traditional Cuban restaurant is unlike any other. Location: 940 Ocean Drive Breakwater Hotel Miami Beach, FL 33139 See On Map ocean drive (940) Location: 1410 Ocean Dr, Miami Beach, FL 33139 See On Map ocean drive (1410) Location: 819 Lincoln Rd, Miami Beach, FL 33139 See On Map Lincoln road Location: 405 Española Way, Miami Beach, FL 33139 See On Map española way Location: 14571 SW 5th St, Pembroke Pines, FL 33027 See On Map pembroke pines Location: 3555 Las Vegas Blvd South Las Vegas, NV 89109 See On Map las vegas Location: 940 Ocean Drive, Breakwater Hotel Miami Beach, FL 33139 See On Map ocean drive (940) Location: 1410 Ocean Dr, Miami Beach, FL 33139 See On Map ocean drive (1410) Location: 819 Lincoln Rd, Miami Beach, FL 33139 See On Map Lincoln road Location: 405 Española Way, Miami Beach, FL 33139 See On Map española way Location: 14571 SW 5th St, Pembroke Pines, FL 33027 See On Map pembroke pines Location: 3555 Las Vegas Blvd South Las Vegas, NV 89109 See On Map las vegas live shows and events We have shows every week at our different locations. Get to know the artists who are part of Havana 1957. planning an event? Group dining\n& events BOOK NOW Contact our Specialist via info@havana1957.com  or submit a Request for Proposal today. Winner for Best Cuban in the New Times Best of Miami Reader’s Poll 2024 for 2nd consecutive year TESTIMONIALS & REVIEWS We love to hear from our guests. Our authentic Cuban restaurant on Lincoln Road in Miami offers a taste of Havana in the 1950s. But don’t take our word for it – read our testimonials below. OH MY!!! Talk about the best service ever at a Restaurant! Freddy, the waiter over at Havana 1957 on Lincoln Street in Miami Beach, FL was AMAZING!!!! Once seated, Freddy took my husband and I drink order, followed by dinner order. The drinks came immediately and the food followed. His drink, food, and desert recommendations were ON POINT! For a minute, we actually thought we were in Havana. Candace Hudson-Jackson Google For my first Cuban Food experience, I most certainly chose the best restaurant! We ordered some local favorites like the sangria and the chicken, and everything had so much good flavor. The plantains were equally as good, along with the hospitality from the server, this is definitely where I'd suggest anyone go for some authentic Cuban food! Charles C. Las Vegas, NV, Yelp Before coming to Miami, I was told by my friends that I could find a lot of good Cuban restaurants here. And now I believed that they were not joking when they said that lol. If Yelp allows half point, I'd give this place 4.5. And I'll explain why.  My boyfriend had the skirt stake. To us, this dish was a little subpar. The stake really lacked seasoning, and was a little chewy. Charles C. Las Vegas, NV, Yelp follow us! @havana1957 LOCATIONS RESERVATIONS MENU GROUP DINING & EVENTS ABOUT US CONTACT US BLOG LOCATIONS RESERVATIONS MENU GROUP DINING & EVENTS ABOUT US CONTACT US BLOG PHOTO GALLERY GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION PHOTO GALLERY GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION hello@havana1957.com www.havana1957.com ©2024 Havana 1957 Accessibility Statement Privacy Policy Affiliate of Vida & Estilo Hospitality Group | Site Development by DATAKI CLOSE MENU ABOUT US LOCATIONS MENU RESERVATIONS GROUP DINING & EVENTS CATERING PEMBROKE PINES MIAMI BEACH BLOG ABOUT US LOCATIONS MENU RESERVATIONS GROUP DINING & EVENTS CATERING PEMBROKE PINES MIAMI BEACH BLOG GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION CONTACT US GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION CONTACT US hello@havana1957.com"
    },
    {
      "url": "https://www.havana1957.com/pembroke-pines/contact/",
      "text": "Visit Havana 1957 in Pembroke Pines | Cuban Food & Cocktails Skip to content Happy hour 🍸💃🇨🇺: 4PM - 6 PM | Mon to fri MAIN MENU MAKE A RESERVATION MAIN MENU MAKE A RESERVATION LOCATIONS Get to know our locations in Miami and Las Vegas Select a location Lincoln Road Ocean Drive (940) Ocean Drive (1410) Española Way Pembroke Pines Las Vegas Select a location Lincoln Road Ocean Drive (940) Ocean Drive (1410) Española Way Pembroke Pines Las Vegas Pembroke Pines RESERVE HERE ORDER ONLINE LOCATION 14571 SW 5th St Pembroke Pines, FL 33027 View map CONTACT INFO (754) 210-3499 hello@havana1957.com HOURS OF OPERATION Sunday to Thursday 12pm – 11pm (Kitchen closed at 10 pm) Fridays & Saturdays 11:30am – 1am Events LIVE ENTERTAINMENT CALENDAR LIVE MUSIC Enjoy a delicious dinner accompanied by live music, then keep the night going with dancing—an experience filled with flavor, rhythm, and unforgettable energy. Wednesdays and Thursdays: Live Music with Indira & Joel (7 pm – 9 pm) Fridays: Rumbavana Live Show! With Indira – from (9:30 – 12AM) Saturday: Rumbavana Live Show! With Mercy Avila  (9:30 PM – 12 AM ) Sundays: La Mecanica del Sabor (4 pm to 7 pm) RUMBAVANA THEMED PARTIES Saturdays are for dancing! Enjoy themed parties every week with live music, delicious food, and surprises that keep the night unforgettable. Come ready to eat, dance, and celebrate! Saturdays from 9:30 p.m. to 1:30 a.m. -1st Saturday of the month: Glow Party -2nd Saturday of the month: 50’s Party -3rd Saturday of the month: Carnival -4th Saturday of the month: Mojito Night Explore our other locations in South Florida Lincoln Road | Española Way | Ocean Drive (940) | Ocean Drive (1410) LOCATIONS RESERVATIONS MENU GROUP DINING & EVENTS ABOUT US CONTACT US BLOG LOCATIONS RESERVATIONS MENU GROUP DINING & EVENTS ABOUT US CONTACT US BLOG PHOTO GALLERY GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION PHOTO GALLERY GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION hello@havana1957.com www.havana1957.com ©2024 Havana 1957 Accessibility Statement Privacy Policy Affiliate of Vida & Estilo Hospitality Group | Site Development by DATAKI CLOSE MENU ABOUT US LOCATIONS MENU RESERVATIONS GROUP DINING & EVENTS CATERING PEMBROKE PINES MIAMI BEACH BLOG ABOUT US LOCATIONS MENU RESERVATIONS GROUP DINING & EVENTS CATERING PEMBROKE PINES MIAMI BEACH BLOG GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION CONTACT US GIFT CARDS LINCOLN ROAD OCEAN DRIVE 940 OCEAN DRIVE 1410 ESPAÑOLA WAY PEMBROKE PINES NEWSLETTER SIGN UP CAREERS RECEIPT REQUEST & INFORMATION CONTACT US hello@havana1957.com"
    }
  ]
}