{
  "query": "havanajacksoceanside.com email",
  "fuentes": [
    {
      "url": "https://quicklocal.com/rtcl_listing/fl/key-colony-beach/havana-jacks-oceanside-restaurant-and-bar/",
      "email": "shakir@glunzoceanbeachhotel.com"
    },
    {
      "url": "https://untappd.com/v/havana-jack-s-oceanside-restaurant-and-bar/4354750",
      "email": "draft@3x.png"
    },
    {
      "url": "https://untappd.com/v/havana-jack-s-oceanside-restaurant-and-bar/4354750",
      "email": "slushie@3x.png"
    }
  ],
  "mails": [
    "shakir@glunzoceanbeachhotel.com",
    "draft@3x.png",
    "slushie@3x.png"
  ],
  "nombre_sitio": "havanajacksoceanside.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://quicklocal.com/rtcl_listing/fl/key-colony-beach/havana-jacks-oceanside-restaurant-and-bar/",
      "text": "Havana Jack’s Oceanside Restaurant and Bar | Quick Local Menu Close Home Business Magazine Industries We Serve Login Home Business Magazine Industries We Serve Login Add a Free Business Home Business Magazine Industries We Serve Login Home / Restaurant / Havana Jack’s Oceanside Restaurant and Bar Havana Jack’s Oceanside Restaurant and Bar Report Abuse Report Abuse × Your Complaint * False or Misleading Information Outdated or Incorrect Details Inappropriate or Offensive Content Scams or Illegal Activities Submit 0.0 rating based on 1,234 ratings (0 Reviews) 401 E Ocean Dr, Key Colony Beach, FL 33051 +1 305-743-4849 www.havanajacksoceanside.com Write a Review About Services Services Areas Questions and Answers Q1 : What is the physical location of  Havana Jack’s Oceanside Restaurant and Bar \n    ? A : The physical location of Havana Jack’s Oceanside Restaurant and Bar is at 401 E Ocean Dr, Key Colony Beach, FL 33051 Q2 : What is the contact phone number for Havana Jack’s Oceanside Restaurant and Bar in 401 E Ocean Dr, Key Colony Beach, FL 33051? A : You can reach Havana Jack’s Oceanside Restaurant and Bar in 401 E Ocean Dr, Key Colony Beach, FL 33051 at +1 305-743-4849 . Q3 : What services or products does  Havana Jack’s Oceanside Restaurant and Bar offer in 401 E Ocean Dr, Key Colony Beach, FL 33051? A : Havana Jack’s Oceanside Restaurant and Bar provides Restaurant services in the  401 E Ocean Dr, Key Colony Beach, FL 33051 area. Q4 : What is the email address of Havana Jack’s Oceanside Restaurant and Bar ? A : Havana Jack’s Oceanside Restaurant and Bar's email address is shakir@glunzoceanbeachhotel.com . Q5 : What is the official website of  Havana Jack’s Oceanside Restaurant and Bar ? A : The official website of Havana Jack’s Oceanside Restaurant and Bar is http://www.havanajacksoceanside.com/ . Customer Reviews Share Business Location Get Directions 401 E Ocean Dr, Key Colony Beach, FL 33051 People Also Viewed Testing Restaurant 5.0 rating based on 1,234 ratings View Details Olive Tree Restaurant 0.0 rating based on 1,234 ratings View Details Blue Hill At Stone Barns 0.0 rating based on 1,234 ratings View Details Doner Point 0.0 rating based on 1,234 ratings View Details Aura Lounge 0.0 rating based on 1,234 ratings View Details Find the best local services and businesses quickly with QuickLocal. Follow Us On Top Cities New York Los Angeles Chicago Houston Phoenix Boston Dallas Miami Atlanta Quick Links Categories Latest Content Business Magazine Contact Us Pricing About Us Help Center Privacy Policy Term of use Services Add a Free Business Create Free Account SEO & Link Building Service Industries We Help Partnership Local Exposure Statewide Exposure National Exposure Article Submission QUICKLOCAL™ is a trademark of Quick Local LLC. Copyright © Quick Local 2025"
    },
    {
      "url": "https://untappd.com/v/havana-jack-s-oceanside-restaurant-and-bar/4354750",
      "text": "Havana Jack's Oceanside Restaurant and Bar - Key Colony Beach, FL - Untappd Blog Top Rated Insiders Help Shop Login Sign Up Sign In Join Now Menu Blog Top Rated Insiders Help Shop This business has not been verified Learn More Unverified Havana Jack's Oceanside Restaurant and Bar Lounge 401 E Ocean Dr Key Colony Beach, FL ( Map ) Incorrect Information? Learn More Yelp Foursquare http://www.havanajacksoceanside.com 401 E Ocean Dr Key Colony Beach, FL\t\t\t\t\t\t ( Map ) http://www.havanajacksoceanside.com Incorrect Information? Learn More This business has not been verified Learn More This Venue is Unverified ( ? This venue is not verified by the owner. Verify your venue today to start publishing menus on Untappd, view analytics, create events and connect with Untappd users. ) Thanks! We'll let you know. Last Updated 04/25/25 Verify this Venue Do you own this Venue? Join Untappd For Business to verify your venue and get more app visibility, in-depth menu information, and more. Request a Demo Social Yelp Foursquare Venue Stats ( ? ) Log In to view Venue Stats Loyal Patrons ( ? ) Log In to view Patrons More Venue Details This Venue is Unverified ( ? This venue is not verified by the owner. Verify your venue today to start publishing menus on Untappd, view analytics, create events and connect with Untappd users. ) Thanks! We'll let you know. Last Updated 04/25/25 Verify this Venue Do you own this Venue? Join Untappd For Business to verify your venue and get more app visibility, in-depth menu information, and more. Request a Demo Photos Log In to view more photos Popular Beers Crazy Lady The Waterfront Brewery Iguana Bait Florida Keys Brewing Co. Fresh Civil Society Brewing Log In to view more beers See Popular Beers Nearby Verified Venues Herbies Bar & Chowder House Verified Seafood Restaurant, BBQ Joint, Beer Bar, Burger Joint 6350 Overseas Hwy Marathon, FL Bongo's Verified Bar, American Restaurant, Beer Garden, Water Park 59300 Overseas Hwy Marathon, FL Porky's Bayside Restaurant and Marina Verified BBQ Joint, Seafood Restaurant, Sushi Restaurant, Breakfast Spot 1400 Overseas Hwy Marathon, FL Recent Activity Kyle Carlson is drinking a Crazy Lady by The Waterfront Brewery at Havana Jack's Oceanside Restaurant and Bar Sat, 30 Aug 2025 20:29:55 +0000 View Detailed Check-in 0 Sarah Lanshe is drinking a Crazy Lady by The Waterfront Brewery at Havana Jack's Oceanside Restaurant and Bar Draft Earned the Drinking Your Paycheck badge! Earned the Middle of the Road (Level 25) badge! Tagged Friends Fri, 22 Aug 2025 23:58:34 +0000 View Detailed Check-in 0 Corey Oxley is drinking an Iguana Bait by Florida Keys Brewing Co. at Havana Jack's Oceanside Restaurant and Bar Purchased at Havana Jack's Oceanside Restaurant and Bar Draft Earned the Bar Explorer (Level 28) badge! Tagged Friends Fri, 22 Aug 2025 23:33:47 +0000 View Detailed Check-in 0 Alberto Dieguez is drinking a Fresh by Civil Society Brewing at Havana Jack's Oceanside Restaurant and Bar Sun, 17 Aug 2025 20:09:12 +0000 View Detailed Check-in 1 Jake Fisher is drinking a Frozen Granita - Pińa Colada Soul by Levante Brewing Company at Havana Jack's Oceanside Restaurant and Bar Not a fan favorite Slushie Thu, 14 Aug 2025 01:08:24 +0000 View Detailed Check-in 0 Log in now to view all drink check-ins at this venue Sign In Join Now Untappd for Business Untappd for Business Blog Breweries Shop Support Careers API Terms Privacy Cookie Policy Do Not Sell My Personal Information"
    }
  ]
}