{
  "fuentes": [
    {
      "url": "http://tompettyweekend.heartwoodsoundstage.com/faq.html",
      "email": "close_white@2x.png"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://heartwoodsoundstage.com/production/",
      "email": "info@heartwoodsoundstage.com"
    },
    {
      "url": "https://heartwoodstudios.us/pages/contact",
      "email": "big_headerlogo_150res-20_250x@2x.png"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "big_headerlogo_150res-20_250x@2x.png",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "close_white@2x.png",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "info@heartwoodsoundstage.com",
    "info@reception-plus.de",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "productions@diamondheadtheatre.com",
    "rtandal@diamondheadtheatre.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "heartwoodsoundstage.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://tompettyweekend.heartwoodsoundstage.com/faq.html",
      "text": "Gainesville Florida's Tom Petty Weekend @ Heartwood Soundstage | FAQ Page Home Lineup Schedule Experience Contact Tom Petty Weekend Lineup Schedule Experience F.A.Q. Contact Buy Pass Frequently Asked Questions When : October 17-19th, 2019 Where : Heartwood Soundstage - Gainesville, FL Why : To honor the music and life of Tom Petty Iâve never been to Tom Petty Weekend. What can I expect? Expect a unique three day indoor/outdoor festival designed to honor Tom in his hometown. The location of the festival (Heartwood Soundstage) has a warm and friendly park-like atmosphere with a friendly attendees from across the country. Heartwoodâs two stages have a capacity of 3500, and features an inside stage that is one the finest performing soundstageâs in the country. What kind of weather should we expect? Traditionally, October weather is wonderful. Highs generally are in the low 80âs, with lows in the upper 60âs. With todayâs unpredictable weather, one should be prepared for the worse case scenarios, from highs in the 90âs (possible, but not likely), to really cool weather (not likely). Sunscreen and a hat is strongly recommended, and itâs best to drink lots of water. Will there be food and drink for sale? There will be a number of high quality food trucks offering many varieties of food at the festival. In addition, we will be serving reasonably priced wine and beer, including this years version of Among The Wildflowers beer from one of four craft breweries in town, Swamphead Brewery. Is there seating? Attendees are encouraged to bring their own lawn chairs. While there is seating in the inside soundstage, attendees are cycled though after each performance during setup / breakdown. Where do I get my Gold / Gold Plus Pass? All passes will be available for pick up at the festival entrance during normal festival hours. Can I get a refund? Refunds are available until 30 days before festival. If you need a refund please contact us via our form, email or phone number. Can I bring a cooler? No, Coolers are not allowed, with an exception for parents of young children. Those coolers will be searched. Is there other Tom Petty related activities on that weekend? In addition to the Tom Petty Weekend festival from Thursday to Saturday, there is a fan organized picnic planned at Tom Petty Park on Sunday the 20th, as well as an unveiling of a new Florida State Historical Marker honoring Tom Petty. On the 19th and 20th, Tom Petty Birthday Bash, a local festival honoring Tom, will take place at Depot Park. parking Please be careful to not park in no parking areas, tow trucks will be removing those parked in an unlawful area. We strongly recommend that you consider Uber or Lyft for your travel to and from the festival. Free Parking Spots We have put together a map of both paid as well as free parking spots within a \"reasonable walking distance\". Again we advise that you travel via Uber or Lyft when possible Tom Petty Weekend FAQ Privacy Terms & Conditions Contact × Thanks for your message! × Please, fill in required fields. × An error occurred while sending data :("
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname First Datenschutz Surname * E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://heartwoodsoundstage.com/production/",
      "text": "Production | Heartwood Soundstage No items found. Shows About Booking FAQs Contact Production Memberships No items found. live video packages We offer artists video and audio capture of live shows! Check out our packages below or contact us to discuss a customized package. Music Package Widget Package 1: B-Roll 15 Sec Reel $250 Deliverable: 15 second landscape and vertical Highlight Reel One roaming B-roll Videographer Pre-show and during show b-roll capture No audio capture, b-roll footage only Package 2: Single Song Livecut $600 Deliverable: One live cut song with live mixed audio Video Director, one Camera Operator Three statics, one operated angle + audio recording (Seated show = minus 2 seats, standing show = minus 4 spots) Package 3: Full Show Capture with B-Roll $1000 Deliverable: Full show capture with post production + audio mix Video Director, two Camera Operators Four statics, two operated angles + audio recording One roaming B-roll Videographer Pre-show and during show b-roll capture (Seated show = minus 2 seats, standing show = minus 4 spots) Show Capture Add-On: $200 for first song, $100 Per Song After Post-produced song (Video edited and audio mixed) To book, contact us at info@heartwoodsoundstage.com Shows About Gallery Booking FAQs Contact Production Memberships No items found. Subscribe to stay up to date Receive the latest information on what's going on I consent to receive automated marketing by text message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Download the Lulu's App Â© , Heartwood Soundstage Privacy Powered by Opendate"
    },
    {
      "url": "https://heartwoodstudios.us/pages/contact",
      "text": "Contact\n – Heartwood Studios Skip to content Winter Hours - Wed-Sat: 10:30-5pm, Sun: 11-4pm, Mon + Tue: CLOSED Home Shop Shop All Products Collections Apparel Apothecary Art Supplies DIY Kits Stories Contact Instagram Home Shop All Products Collections Apparel Apothecary Art Supplies DIY Kits Stories Contact Search Cart Item added to your cart Check out Continue shopping Contact We love hearing from our community members! Whether it's a product inquiry, idea for a custom piece, or a question about our business or workshop please don't hesitate to get in touch! Name Email * Phone number Comment Send Quick links Search Stories Store Contact Heartwood Studios 13 Broadway Suite 1 Saranac Lake, NY 12983 USA Instagram Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Venmo Visa © 2025, Heartwood Studios Powered by Shopify Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    }
  ]
}