{
  "fuentes": [
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://handsofheartland.com/about-us/our-staff/",
      "email": "info@handsofheartland.com"
    },
    {
      "url": "https://www.heartlandbsi.com/contactus.asp",
      "email": "ruth@heartlandbsi.com"
    },
    {
      "url": "https://heartlanddsc.com/contact-us/",
      "email": "info@heartlanddsc.com"
    }
  ],
  "mails": [
    "gabe@journeysherwood.org",
    "info@handsofheartland.com",
    "info@heartlanddsc.com",
    "info@journeysherwood.org",
    "info@theatrenantucket.org",
    "leadershipboard@journeysherwood.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "ruth@heartlandbsi.com",
    "scott@journeysherwood.org"
  ],
  "nombre_sitio": "heartlandbluegrass.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://handsofheartland.com/about-us/our-staff/",
      "text": "Our Team - Hands of Heartland Services 3  DD Waiver  Family Support Waiver  Employment Support  Education  A&D Waiver About Us 3 About Hands of Heartland Our Team Testimonials Locations Careers Giving Back Resources 3 Brochures Behavioral Health Services Transition Services Supported Employment Newsletters Community Engagement How to Qualify for Services Provide Feedback Contact Us a Contact Us U Services 3  DD Waiver  Family Support Waiver  Employment Support  Education  A&D Waiver About Us 3 About Hands of Heartland Our Team Testimonials Locations Careers Giving Back Resources 3 Brochures Behavioral Health Services Transition Services Supported Employment Newsletters Community Engagement How to Qualify for Services Provide Feedback Contact Us a Contact Us U Services 3  DD Waiver  Family Support Waiver  Employment Support  Education  A&D Waiver About Us 3 About Hands of Heartland Our Team Testimonials Locations Careers Giving Back Resources 3 Brochures Behavioral Health Services Transition Services Supported Employment Newsletters Community Engagement How to Qualify for Services Provide Feedback Contact Us Our Team Mason Morgan CEO Mason Morgan has been the CEO of Hands of Heartland since 2019. To start his career, Mason spent three years in the Army and then five years leading a home health care company. Prior to joining HOH, he worked for a Texas based DD provider as President, Chief Operating Officer and Chief Financial Officer. Over those twenty years, Mason worked with large and small providers, helping to create opportunities for people receiving services as well professionals in the field. Mason earned an MBA at Dallas Baptist University and has a BBS in Accounting. He was President of PACSTX, a Texas based provider association for four years and has served in leadership roles on advocacy, legislative, and regulatory committees that are focused on advocating for quality services in multiple states. Brett Samson COO Brett Samson is the COO at Hands of Heartland and has been working with adults with developmental disabilities for over 25 years. He started as a direct support professional in the Omaha area while working on his degree from the University of Nebraska at Omaha. Over the course of his career, Brett has worked in almost every level of direct support and management in the field. Before coming to HOH, Brett served as the CEO of a DD service provider in the Omaha area and has directed services in western Iowa as well. Erin Ruskamp Area Director – Southeast Region Erin Ruskamp is Area Director for the Southeast region with over a decade of experience in the DD field. She has enjoyed serving as an administrator in the Supported Employment program at Hands of Heartland. Erin loves supporting each individual they serve and witnessing them achieve their dreams and unlock their full potential. She is committed to making a positive impact and collaborating with communities, families, and team members to do so. “It is a joy to be a part of their journey towards a brighter future.” Erin is a dedicated parent and community volunteer which further fuels her passion for serving and advocating for people she cares about. She is excited to leverage her skills and experience to continue providing exceptional services to our community’s dynamic, diverse DD population. Nicole Van Pool Regional Director Nicole Van Pool is a Regional Director for Hands of Heartland and has been working in the IDD field for 16 years. Nicole loves providing person centered services and helping people reach their full potential. She has a Bachelor’s in Communication Disorders from University of Nebraska at Kearney (UNK), Master of Public Administration from University of Nebraska at Omaha (UNO) , and a Masters in Certified Behavior Analysis from the University of West Florida. Nicole will take the boards in 2024 to become a board certified behavior analyst. She is from Nevada but now calls Nebraska home; Nicole donates time to many organizations including the Arc of Central Nebraska where she serves on the Board of Directors. Margo Doescher Regional Director Margo Doescher is a Nebraska Regional Director. She has been working in the DD field since 2005. Margo has an Associate’s Degree in Business from Northeast Community College and a Bachelor’s Degree in Psychology from Ashford University. Margo especially enjoys watching the amazing people at Hands of Heartland thrive and achieve their personal goals. She is motivated when team and community members work together with the people they serve. In her community, Margo leads a 4H group and volunteers regularly with the local extension office by judging record books, helping out at camps and whatever else they may need. Rebecca Kpokoudjo Area Director – Omaha Rebecca Kpokoudjo has worked in the IDD field for 26 years following her mother’s footsteps. “I had the opportunity to watch her make a difference in people’s lives and it was amazing.” Rebecca began at Hands of Heartland as a DSP over 19 years ago and kept advancing from weekend staff to lead to overseeing continuous residential services then shifted to work in vocational. After two years in vocational Rebecca was offered the Omaha Area Director position. She appreciates the opportunity work work with amazing people whose support and guidance have played a major part in her growth within the Hands of Heartland family. Theresa Scaife Area Director – Bellevue Theresa Scaife has worked for Hands of Heartland for almost 20 years. She started as a DSP and then became a Residential Supervisor. Next she began working at a Day Center as a DSP and was quickly asked to supervise the Day Center which led to becoming Area Director or Bellevue. She is passionate about providing the best possible services to participants and staff. “It has been a privilege and an honor to serve the people we support for all these years,” she said. Theresa has seen Hands of Heartland grow from one building in Bellevue to several buildings across the region. Before working for Hands of Heartland she worked as a preschool teacher. The receptionist asked if she’d ever thought about working with people with disabilities and  took Theresa to her job where there were three amazing women receiving services. She fell in love with  work in the DD field immediately. That was over just about 21 years ago. “I am blessed to be in this amazing field, I couldn’t imagine doing anything else.” Bailey Payne Associate Area Director – Southeast Region Bailey Payne is the Associate Area Director for the Southeast region. She started as a lead DSP at Hands of Heartland and became the day and residential TMC for Lincoln. As the company continued to grow, she became the Day Services TMC and then moved into the role of Employment Coordinator. With over eight years of experience in the DD field and a degree in Human Services, Bailey has a passion for serving others and is committed to making a difference. She is excited about collaborating to leverage collective strengths to positively impact the communities where the Hands of Heartland family members live and grow. Family and friends at home and work are deeply important to Bailey (as are the Missouri football team). Amy Virgil Area Director – Central Nebraska Amy Virgil is an Associate Area Director for Hands of Heartland. She has been working in the IDD field for over 15 years providing support and services in a variety of roles. Amy started as a direct support professional and held positions that supported employment, community engagement, staff training, development, and quality assurance. As a vocational director, Amy gained day service experience and supported residents in their own apartments and homes. Amy was seeking a degree in criminal justice when she started working in the IDD field and knew she had found her home. “Being able to witness the people we support learn new things and be able to experience life is the reason I love this field…the smiles on their faces when they are enjoying life is priceless.” Mercedes Hammond Associate Area Director Mercedes Hammond is a natural born leader. She has been in the DD field for ten years and started straight out of high school as a Direct Support Professional (DSP) and medication aid. Mercedes started at Hands of Heartland as a DSP in 2021, became a Team Member Coordinator (TMC) in 2022 and is now an Associate Area Director. She is a mother of two and  loves the family atmosphere at Hands of Heartland. Mercedes  feels so grateful to be a part of what Hands of Heartland is building and appreciates the community that grows through connecting with those receiving services, team members, and beyond. Jen Neeley Quality Assurance & Compliance Director Jen Neeley is Quality Assurance and Compliance Director at Hands of Heartland. She has a Bachelor’s degree in Secondary Education from the University of Nebraska at Lincoln (UNL).  After teaching, she began work as a direct care staff with adolescents in residential placement.  In 2003, Jen began working at the Munroe Meyer Institute in an Applied Behavior program for children on the autism spectrum. This led her to work in the DHHS-DD world as a program specialist, shared living provider (for five years), and coordinator into her current role. Jen has a son and siblings who utilize DD services; her goals include creating daily activities and environments at Hands of Heartland that she would want for her own beloved family. Jen loves first time experiences for the people they support, “…when someone sees mountains or a caterpillar for the first time, speaks out in front of a group, puts their shoes on without help…whether big or small in our eyes, these are all grand events to be celebrated.” Jennifer Meints Director of Community Outreach Jennifer Meints has been in the IDD field for more than 20 years. She was a Parent Resource Coordinator at PTI Nebraska, Employment Coordinator for another provider, and has been at Hands of Heartland since June of 2020 as Director of Community Outreach. As the parent of a wonderful child who utilizes IDD services, Jen’s passion is helping families find their voice when facing obstacles with their loved ones. Jennifer is the Board President for the Arc of Lincoln, a board member on the Special Education Advisory Council, and a founding board member for the PHACE Syndrome Community. She served as a chair of the Nebraska Council on Developmental Disability, and won Advocate of the Year for Arc of Nebraska in 2023. Jennifer was appointed board member of Special Education Advisory Council and Vice chair for PTI Nebraska. Jenny Rohr Director of Team Member Resources Jenny Rohr has worked for Hands of Heartland for two years and has been in the human resources field for 15 years. She enjoys helping people and seeing them succeed in their employment. Jenny spent ten years of her HR career working for an agency serving individuals with disabilities. She is excited to be a part of a growing company that is people-centric and provides a valuable service to the communities and people it serves. Tasha Gooden Education and Children Services Director Tasha Gooden is the Education and Children Services Director for Hands of Heartland. Her passion, experience and dedication will drive positive change, enhance educational programs, and uplift the lives of children and families across the country. She is a testament to resilience and has dedicated herself to empowering others. Growing up in Queens, New York, her compassion and keen sense of justice led her to a Bachelor of Science in Criminal Justice degree (which helped her understand the complexities and causes of criminology). Tasha’s desire to make a tangible difference felt like a calling to study counseling. With a Master of Arts degree in Professional Counseling, she has honed the skills needed to assist individuals navigating life’s challenges. Her expansive career also includes time as a PR Director where Tasha executed impactful campaigns and employed her narrative and relationship-building skills. Her leadership in operations and marketing have enabled her to help organizations define their stories and connect meaningfully with their audiences. By leveraging her expertise, Tasha has raised awareness on important issues, challenged stereotypes, and fostered a more inclusive society. Tabatha Cunningham Vice President of Clinical, Quality, & Regulatory Affairs Tabatha Cunningham has been in the IDD field for 16 years and joined Hands of Heartland two years ago as the Quality Assurance & Compliance Director. During the years leading up to playing a key role at Hands of Heartland, Tabatha proudly served the IDD communities as an LPN, RN, Director of Nursing, and SLP provider. Tabatha loves leading & supporting team members and other leaders who make sacrifices everyday to ensure the participants receive the best possible services. She has a strong passion for the medical field and enjoys implementing systems that can benefit everyone from team members, families, and people served by the caring Hands of Heartland team. Angie Huber Director of Behavioral Health Dr. Angie Huber is passionate about providing services to the IDD population. She is the Director of Behavioral Health at Hands of Heartland and has over 15 years experience offering clients psychological services and leading a team of clinicians. Dr. Huber’s experience includes establishing behavior programs for IDD providers, providing testing and evaluation, therapy, and functional analysis. Dr. Huber has a Doctorate in Clinical Psychology and completed her residency with Burke Mental Health Services. She believes in giving back to the community and enjoys volunteering at St. Patrick’s Catholic School educating teachers on mental health and classroom behavior management and provides counseling and evaluation to students when needed. Dr. Huber loves to learn and is always willing to take on challenges. For More Information Speak with one of our team members to see how we can help you enable someone with developmental disabilities. Reach Out to a Team Member Hands of Heartland We offer opportunities for people with developmental disabilities to experience and enjoy life, connection, employment, education, and engagement within their communities. Follow Follow Follow Newsletter Sign-Up Enter your e-mail address to receive our monthly newsletter with inspiring and enlightening content about our organization and the people who we serve. Success! Email Subscribe Contact Our Team 402 933-0680 info@handsofheartland.com Main Office Address 209 Galvin Road North Bellevue, NE 68005 See All Locations Copyright © 2025 Hands of Heartland. All rights reserved. M U"
    },
    {
      "url": "https://www.heartlandbsi.com/contactus.asp",
      "text": "Heartland Business Services, Inc. - Contact Us Home Our Company Services Contact Us Address & Phone Information Heartland Business Services, Inc. 310 S Seventh St.   Suite 1 Fairbury, IL  61739 Phone 815-692-3884 Fax 815-692-3863 E-mail Ruth Teubel, CPA Ruth@HeartlandBSI.com Send us a message First Name* Last Name* Email Address* Re-Enter SAME Email Address to Verify* Phone Number Comments (Limit to 400 alpha-numeric characters) Never send sensitive or payment information including credit card numbers through this form. * Required information © Copyright 2002 - 2025 Heartland Business Services, Inc.  All rights reserved. Website by Route24.net"
    },
    {
      "url": "https://heartlanddsc.com/contact-us/",
      "text": "Contact Heartland DSC - Get in touch with us today! Home Our Impact News Calendar Board Outfitter Info Join Contact Us Donate Menu Menu CONTACT US Name (Required) First Last Email (Required) Phone How can we help? Message ￩ ￫ x × Previous Next Home Our Impact News Calendar Board Outfitter Info Join Contact Us Donate FOLLOW US ON FACEBOOK PHONE: 402-690-3691 Scroll to top"
    }
  ]
}