{
  "fuentes": [
    {
      "url": "https://heartfulness.org/education/help/",
      "email": "education@heartfulness.org"
    },
    {
      "url": "https://heartfulness.org/education/help/",
      "email": "help.educate@heartfulness.org"
    },
    {
      "url": "https://heartfulness.us/peace-series/",
      "email": "houston.tx@heartfulness.org"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "email": "teachertraining@theriveryogadenver.com"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "email": "retreats@theriveryogadenver.com"
    },
    {
      "url": "https://orlandoyouthsoccernetwork.com/contactus",
      "email": "admin@orlandoyouthsoccer.com"
    },
    {
      "url": "https://orlandoyouthsoccernetwork.com/contactus",
      "email": "ocysn@orlandocitysc.com"
    },
    {
      "url": "https://heartfulness.us/orlando-yoga-fest/",
      "email": "orlando.fl@heartfulness.org"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "image-38@2x-1.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "image-38@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "image-39@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "image-40@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "layer_14@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "calm@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "g3840@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "heart-1@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "lotus@2x.png"
    },
    {
      "url": "https://heartfulness.us/",
      "email": "up-arrow@2x.png"
    },
    {
      "url": "https://www.wearewarriorone.com/contactus",
      "email": "info@wearewarriorone.com"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://heartfulness.org/education/",
      "email": "in.wellness@heartfulness.org"
    },
    {
      "url": "https://www.collegeparkyoga.com/learn-more/classes-events",
      "email": "luv@collegeparkyoga.com"
    },
    {
      "url": "https://www.collegeparkyoga.com/learn-more/classes-events",
      "email": "luv@collegeparkyoga.com"
    },
    {
      "url": "https://sedonayogafestival.com/contact-us/",
      "email": "info@sedonayogafestival.com"
    }
  ],
  "mails": [
    "admin@orlandoyouthsoccer.com",
    "calm@2x.png",
    "education@heartfulness.org",
    "g3840@2x.png",
    "heart-1@2x.png",
    "help.educate@heartfulness.org",
    "houston.tx@heartfulness.org",
    "image-38@2x-1.png",
    "image-38@2x.png",
    "image-39@2x.png",
    "image-40@2x.png",
    "in.wellness@heartfulness.org",
    "info@sedonayogafestival.com",
    "info@theatrenantucket.org",
    "info@wearewarriorone.com",
    "layer_14@2x.png",
    "lotus@2x.png",
    "luv@collegeparkyoga.com",
    "ocysn@orlandocitysc.com",
    "orlando.fl@heartfulness.org",
    "retreats@theriveryogadenver.com",
    "teachertraining@theriveryogadenver.com",
    "up-arrow@2x.png"
  ],
  "nombre_sitio": "heartfulness.us",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://heartfulness.org/education/help/",
      "text": "HELP - Heartfulness Education Skip to content Heartfulness From Wonder, W i s d o m Heartfulness Education Trust Heartfulness Education Trust Education Fellowship Heartfulness Research Centre Yoga Essay Event Donate Education Fellowship Heartfulness Research Centre Yoga Essay Event Donate H E L P H eartfulness – E xperience L ife’s P otential A 16 week certificate course for Intermediate Students on Life Skills in association with Board of Intermediate Education, Government of Andhra Pradesh HELP Proposal HELP College Brochure HELP Final Report HELP Impact HELP Feedback Volunteer Donate Time Honorable CM of Andhra Pradesh : Sri N. Chandra Babu Naidu , Deputy CM and Home Minister Sri N. Chinnarajappa , Education Minister Sri Ganta Srinivasa Rao , Smt. B. Udaya Lakshmi , I.A.S, Secretary, Board of Intermediate Education, Release the report of HELP Program at the Collectors Conference on 25th October 2018 at Vijayawada. Article : The Hindu A heartfelt move to help students build strong character Read more Article : New Indian Express Andhra CM N Chandrababu Naidu launches certificate course for intermediate students Read more Article : The Hindu Meditation classes to bust stress for students Read more Our Vision Our vision is to enable teachers and students to live a balanced, purposeful, happy life through heart-based practices, so that they are equipped to contribute to sustainable school reform and community citizenship. HELP is a 16-week certificate course for Students on life-skills and values that equip them with Heartfulness practices, skills and knowledge for quality educational outcomes. Theory of Change THE NEED It is a well-known saying that “Our Children are our Future”. These children, under the current system of school education, are largely being nourished by their lecturers. The result-oriented, examination based education system puts a lot of pressure on students to focus only on academic results, leading to a stressful life. While students develop well and become subject-matter experts, most of them lack the basic life skills. There is little time to focus on values and morals. A slow downfall in the moral standards of today’s youth is quite visible in our current society. THE INTERVENTION HELP: ‘Heartfulness –Experience of Life’s Potential.” Impart the Heartfulness methods to students through a 16- week certificate course. The course will cover: – Heartfulness tools and techniques. – Essential life skills like managing stress, time, conflicts, habits, etc. – Basic human values and positive relationships. THE IMPACT – Improved Concentration and Focus in students. – ‘Centered 1 Students’: where ‘centeredness ’ is defined as a person who is self-confident, emotionally stable and well balanced. – A life where stress is well managed, leading to a joyful and happy society. – Students displaying values of compassion and respect for each other. H E L P H eartfulness – E xperience L ife’s P otential A 16-week certificate course for students of ages 15 – 20, on essential life-skills integrated with Heartfulness meditation tools for self-development. Interested in volunteering your time? Please fill this form and we will get back to you soon. You may also contact us at help.educate@heartfulness.org Notice: JavaScript is required for this content. About Heartfulness Education Trust (HET) Heartfulness Education Trust (HET) was born from the vision that the most effective way to transform society in a generation, is to provide teachers with the opportunity and tools for change and empower them to transform their students. HET comes under the umbrella of a group of organizations, including Shri Ram Chandra Mission (SRCM), Sahaj Marg Spirituality Foundation (SMSF), and Heartfulness Institute (HFI). Together they work towards social transformation by offering Heartfulness methods for individual change. Our self-development programs in schools and colleges are creating a culture of values for both teachers and students, through practical methods of relaxation, introspection and meditation. Board of Intermediate Education, Government of Andhra Pradesh Recommendation BIE (Board of Intermediate Education) has issued a government recommendation addressing the Principals of all Government Junior Colleges, Government-Aided Colleges, and Private Unaided Colleges to incorporate the Heartfulness programs for all their students, in order to reduce stress and nurture ethical and moral values. It further mentions that, such meditation workshops on Heartfulness have already been conducted for more than 50,000 students in the academic year (2017-2018) and these workshops have resulted in: Considerable reduction in stress and anxiety levels; Improved concentration and memory; A more balanced state of mind; and Curbed the unfortunate tendency of suicides in some residential junior colleges. This letter from the AP government requests all principals to utilize the services offered by the Heartfulness team and help schedule and facilitate the 16-week program for their students. Scope The overall scope of the above-mentioned government recommendation actually covers about 3,000 colleges and more than 10 lakh students. During the academic year 2018 – 2019, the HELP Program will cover most of government junior colleges, government-aided colleges and private colleges totalling around 500 colleges and 2 lakhs students across all the 13 districts of Andhra Pradesh. Course Outline The HELP program is a 16-week certificate course for students of Intermediate Education in Andhra Pradesh. This course will be delivered as weekly sessions, with one-hour per week as the delivery mechanism. Every session will cover a unique topic on life skills and values, followed by practical experiential session on Heartfulness tools and techniques. A typical session breakup is as follows: 20 minutes: Topic-related presentation and discussion 30 minutes: Experiential session on Heartfulness Meditation tools 10 minutes: Q&A and follow-up Topic-related presentations will be guided by high-quality video content. Topics will include various elements of science, activities, stories, quotes and morals, which are built into the presentations. The video will equip the presenter with interactive tools to engage with the students and communicate the message in a subtle yet powerful way, where the students learn by listening and engaging actively. Execution Strategy Delivering the HELP course to such a large number of students spread across all districts of AP is a challenging task. A simple and scalable three-step approach model is designed to deliver content to all students in the selected colleges: 1. Identify Champions who will take responsibility for colleges. One champion for 2-3 colleges. 2. Heartfulness core team of trainers will train these Champions on the content and delivery. 3. Champions will deliver the course to the students in their respective colleges. Trainers Core Training Team Create Digital Content Train the Champions Champions Volunteers and Lecturers Champions for Colleges Get trained on content Deliver content to Students Students Course on Life Skills Integration with Meditation Digital Delivery of Content (or) Delivered by Champions HELP Media View more HELP Video (English) View more HELP Video (Telugu) News & Articles Testimonials × Contact Us To know more about Heartfulness Education Trust and our offerings, please visit our website at www.heartfulness.org/education For more information, please send an e-mail to education@heartfulness.org Institute Heartfulness Institute Education Continual Medical Education Yoga Teachers Training Certification Heartfulness Research Quick Links Daaji Sahaj Marg Kanha Shanti Vanam Green Kanha Gurugram Meditation Center Shri Ram Chandra Mission Spirituality Foundation Related Links Publications Digital Store HFNLife online store Heartfulness Magazine Heartfulness practices with a certified trainer are always free of fees or charges, whether in person or online. Find us on: Facebook Twitter YouTube Linkedin Instagram Telegram © Copyright 2024, Site is owned & operated by Sahaj Marg Spirituality Foundation. Privacy Policy • Terms of use Go to Top This website uses cookies to improve your experience. We’ll assume you’re ok with this if you continue on this site. Accept Privacy policy"
    },
    {
      "url": "https://heartfulness.us/peace-series/",
      "text": "Inner Peace to World Peace – Houston, TX – Heartfulness Institute Discover Inner Peace and Wellness: Join Our Community Peace Series Sept. 21 – Oct. 24, 2024 Embark on a transformative journey dedicated to nurturing inner peace and enhancing mental wellness through a series of thoughtfully curated events. We invite you to immerse yourself in a range of activities designed to inspire, heal and connect. Peace Webinar Series Series of 8 Webinars Every Tuesday & Thursday @7PM CT October 1 to October 24 More Info Peace Walk Saturday, September 21, 2024 7:30 AM to 10:30 AM More Info Heartfulness Event Saturday, September 28, 2024 3:00 PM to 6:00 PM More Info Peace Webinar Series Welcome to our transformative series of eight webinars designed to guide you on a journey towards inner peace and holistic well-being. Whether you’re seeking to deepen your yoga practice, enhance your mindful leadership skills or connect with your inner self through meditation techniques, these sessions offer valuable insights and practical tools for a balanced and fulfilling life. You can join the session of your interest or join them all and experience the full benefits of this series as we pave the way for a more peaceful, balanced and fulfilling life. Register once for the entire series Register Webinar 1 | Tuesday, Oct. 1, 7PM CT Holistic Health and Healing: Exploring Yoga and Ayurveda Sharon Kapp Ayurvedic Doctor, Certified Yoga Therapist & Teacher and owner of Houston Yoga  Ayurveda Details Join us for an enriching webinar featuring Sharon Kapp, founder of the Houston Yoga & Ayurveda Center, as we explore a holistic approach to achieving balance and wellness. This session will introduce you to the therapeutic benefits of yoga and the ancient healing practices of Ayurveda. Learn how to maintain mind-body harmony through time-tested techniques designed to prevent and reverse imbalances. Discover therapeutic yoga that rejuvenates both body and spirit, offering stress relief and fitness without the exhaustion of a typical workout. Sharon will also guide us through the principles of Ayurveda, offering natural, holistic solutions for conditions where Western medicine may fall short. From yoga to Ayurveda and Panchakarma, this webinar will open doors to alternative healing, no matter your age, weight, gender, or background. Whether you’re seeking better health, stress relief, or natural healing, this webinar provides practical tools and wisdom for living your best, balanced life. Webinar 2 | Thursday, Oct. 3, 7PM CT The Heartfulness Way – from Inner Peace to Outer Peace Joshua Pollock Heartfulness Trainer, Speaker, Violinist, and Co-Author of the bestselling book 'The Heartfulness Way' Details Our modern, fast-paced world tells us that in order to be happy and fulfilled, we must invest our time and energy in chasing status and success, and accumulating as much as we can. Yet this approach often leaves us feeling empty inside. What if there is another way? What if, instead of gambling our contentment on life’s transient fortunes, we learn to be heartful instead? Heartfulness is a unique, accessible practice that awakens us to the wisdom and inspiration that comes from the heart and transforms us from within. Discover the core techniques of the practice including relaxation, meditation, cleaning and prayer. Using these experimental tools, you’ll realize the joy of a truly heartful life – one filled with compassion, acceptance, and love, connecting your inner peace to outer peace. Webinar 3 | Tuesday, Oct. 8, 7PM CT Exploring Yog Sopanam: A Journey into Ashtanga and Traditional Yogic Wisdom Dr. Hetal Nayak Yog Sopanam Details Join us for an insightful webinar featuring the founder of Yog Sopanam, as we delve into a transformative yoga journey that bridges tradition and modern practice. Yog Sopanam© offers a structured yet flexible approach, paving the way toward Yog Margam© 1, 2, and 3—a progressive exploration of the Ashtanga Primary Series. This 7-step ladder integrates traditional lineage-based pranayam and meditation techniques, along with a comprehensive syllabus that evolves in complexity at each level. Participants will discover how the Yog Sopanam curriculum honors timeless yogic texts, such as the Bhagavad Gita, Yoga Sutras, Hatha Yoga Pradipika, and the Upanishads, while providing adaptable pathways to suit individual proficiency and age. With opportunities to skip levels and engage in community volunteer teaching, this approach offers both 200-hour and 500-hour teacher training programs. Whether you’re a novice or an experienced practitioner, this webinar will showcase how Yog Sopanam supports a deeper understanding of yoga, making it accessible to all. Webinar 4 | Thursday, Oct. 10, 7PM CT Beyond Meditation: Integrating Heartfulness into Daily Life Uma Mullapudi Heartfulness Meditation Trainer Details Practical ways to carry meditation practices into everyday actions. Building peace in personal, professional, and social spheres. Developing lasting habits that promote peace at all levels. Webinar 5 | Tuesday, Oct. 15, 7PM CT Mindful Leadership: Fostering Inner Peace and Wellness in the Corporate World Prasad Sankaran EVP Software & Platform Engineering at Cognizant Details Join us for an insightful webinar featuring Mr. Prasad Sankaran, Executive Vice President at Cognizant, as he shares his perspective on the importance of inner peace in the corporate world and its impact on overall employee well-being. As a leader in a global organization, Mr. Sankaran will discuss how Cognizant’s corporate wellness programs are designed to support mental, emotional, and physical health, fostering a culture of mindfulness and balance. He will explore how organizations can create environments that promote inner calm, resilience, and productivity, contributing to both personal and collective well-being. Drawing from his extensive experience in leadership, Mr. Sankaran will highlight the value of incorporating mindfulness practices into corporate wellness strategies to improve employee engagement, reduce stress, and enhance overall happiness. This webinar will provide valuable insights for both professionals and leaders seeking to create more peaceful, balanced, and thriving workplaces. The session will include a live Q&A and conclude with a universal meditation practice for peace. Webinar 6 | Thursday, Oct. 17, 7PM CT Optimizing Wellness: Cultivating Inner Peace for a Balanced Life Ruchika Behal National Board Certified- Health & Wellness Coach, Applied Functional Medicine Practitioner, Founder - Nourish Your Life Wellness Coaching Details Join us for an empowering webinar featuring Ruchika Behal, a renowned wellness coach, as she explores how cultivating inner peace can lead to overall well-being and personal transformation. With her extensive experience in guiding individuals toward balanced living, Ruchika will share practical techniques to nurture mental, emotional, and physical wellness. In this session, she will highlight the importance of mindfulness, self-care, and positive mindset shifts in achieving long-term peace and happiness. Drawing on her work as a wellness coach, Ruchika will provide actionable strategies for managing stress, improving emotional resilience, and creating a harmonious life. This webinar is an opportunity to learn how simple, effective wellness practices can help you reconnect with your inner calm and lead to a healthier, more peaceful existence. Attendees will benefit from her holistic approach to well-being, with the session concluding with a live Q&A and a guided universal meditation for inner peace. Webinar 7 | Tuesday, Oct. 22, 7PM CT Holistic Healing: Connecting Inner Peace to Physical and Mental Well-Being Dr. Munish Chawla Lifestyle Medicine Details Join us for an enlightening webinar featuring Dr. Munish Chawla, co-founder of Embee Lifestyle Docs and advocate for a holistic approach to health and well-being. As an experienced physician specializing in lifestyle medicine, he will explore the profound connection between inner peace and physical health, emphasizing how mindfulness, nutrition, and lifestyle choices contribute to overall wellness. In this session, Dr. Chawla will share practical strategies for integrating mind-body practices, such as meditation and mindful living, into daily routines to prevent disease and promote long-term health. He will also highlight how cultivating inner peace through these approaches can enhance emotional resilience and community well-being. This interactive webinar is perfect for anyone looking to achieve balance and improve their mental, physical, and social health. It will conclude with a live Q&A session and a short guided meditation. Webinar 8 | Thursday, Oct. 24, 7PM CT Transcendental Meditation: Awakening Inner Peace and Collective Consciousness Dr. Anil Maheshwari Professor at Maharishi International University Details Join us for a profound webinar featuring Dr. Anil Maheshwari, an expert in transcendental meditation and a renowned speaker on collective consciousness. Dr. Maheshwari will explore how individual inner peace can ripple outward to influence societal well-being, offering insights into the power of collective consciousness. Drawing from his extensive experience in meditation, Dr. Maheshwari will explain how transcendental meditation can be a powerful tool for cultivating inner calm, expanding awareness, and contributing to a more peaceful world. This session will guide participants on how personal meditation practices can foster global harmony and how tuning into collective consciousness can enhance both individual and community well-being. Attendees will leave with practical tools to integrate transcendental meditation into their daily lives and a deeper understanding of its role in creating positive social impact. The session will conclude with a live Q&A and a universal meditation practice. Webinar Recordings Play Play Play Play Play Play Play Play Peace Walk Join Heartfulness Houston for a special Peace Day event at the beautiful Sugar Land Memorial Park Pavilion! This free, family-friendly event is open to everyone. Bring your friends, family, and neighbors as we come together to celebrate World Peace Day . A day filled with love, positivity, and community spirit. Opportunities to connect with others who share a passion for peace and unity. When: Saturday, September 21, 2024 – 7:30 AM to 10:30 AM CT Where: Sugarland Memorial Park – 15300 University Blvd Sugar Land, TX 77479 Agenda: 7:30 AM – 8:15 AM      Peace walk around the lake 8:15 AM – 8:45 AM      Yoga & Sound Healing 8:45 AM – 9:30 AM      Refreshments 9:30 AM – 10:30 AM    Heartfulness Meditation Register Heartfulness Event Join us at the Heartfulness Event happening at the beautiful Hindu Temple of The Woodlands for a day filled with love, meditation, and self-discovery. This event is a great opportunity to connect with your inner self and find peace amid our busy lives. When: Saturday, September 28, 2024 – 3:00 PM to 6:00 PM CT Where: Hindu Temple of The Woodlands – 7601 South Forestgate Drive Spring, TX 77382 Agenda: 3:00 PM       Welcome Reception & Cultural program 4:00 PM       Recognition event 5:00 PM       Peace Intention Prayer and meditation Register For any questions, email us at houston.tx@heartfulness.org About Heartfulness Heartfulness Institute, a humanitarian and educational organization that offers simple meditation-based tools for mental and holistic wellbeing. Our mission is to build resilient communities through individual peace and harmony. This is achieved though nurturing the mind through positive affirmations and gentle regulation. Learn More Heartfulness practices with a certified trainer are always free, whether in person or online. Articles Embracing the Heartful Odyssey Sculpting Spiritual Anatomy Embracing the Heartful Odyssey Sculpting Spiritual Anatomy Terms & Conditions Privacy & Cookie Policy Terms & Conditions Privacy & Cookie Policy © 2024 All Right Reserved up English Spanish English"
    },
    {
      "url": "https://www.weseektheriver.com/contact",
      "text": "Contact Us: We're Here to Help! Reach Out to Our Denver Denver Yoga Studio | The River Yoga | Golden Triangle, Sunnyside, Five Points &amp;amp;amp;amp;lt;img height=\"1\" width=\"1\" style=\"display:none\"\n  src=\"https://www.facebook.com/tr?id=646216975547069&amp;amp;amp;amp;amp;ev=PageView&amp;amp;amp;amp;amp;noscript=1\"\n/&amp;amp;amp;amp;gt; 0 Skip to Content About Meet the Team Mission & Vision Contact Us River Partners + Community Locations Golden Triangle Sunnyside Five Points Schedule Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Pricing Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Open Menu Close Menu About Meet the Team Mission & Vision Contact Us River Partners + Community Locations Golden Triangle Sunnyside Five Points Schedule Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Pricing Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Open Menu Close Menu Folder: About Back Meet the Team Mission & Vision Contact Us River Partners + Community Folder: Locations Back Golden Triangle Sunnyside Five Points Folder: Schedule Back Class Schedule Class Descriptions Events & Workshops Private & Small Group Classes Folder: Pricing Back Classes & Memberships Gift Cards Yoga on the Rocks Retreats Teacher Training Online Studio New Here? Contact Us We’d love to hear from you! General Inquiries hello@theriveryogadenver.com To cancel or pause your membership you must notify us via our Membership Change Form at least 7 days before your next billing date Teacher Training & Continuing Ed. Inquiries TeacherTraining@theriveryogadenver.com Retreats retreats@theriveryogadenver.com Frequently Asked Questions Visit us at our 3 Denver, CO locations and online: Five Points Sunnyside Golden Triangle Online Studio Name * First Name Last Name Email * Message * Thank you! Locations Golden Triangle Sunnyside Five Points HELP Contact Us My Account Membership Changes FAQ Careers Connect Newsworthy Gift Cards Nominate a River Magic Maker Community Partners ©2025 The River Yoga | Privacy Policy | Terms and Conditions | Disclaimer | Photography by Jes Kimak | Videography by Reah Agency"
    },
    {
      "url": "https://orlandoyouthsoccernetwork.com/contactus",
      "text": "Contact  Us | Get In Touch Today — Orlando Youth Soccer Network 0 Skip to Content Home Soccer Schools Soccer School Locations Orlando City Soccer Schools Orlando Pride Soccer Schools Affiliate Program Camps & Clinics Camps & Clinics Summer Camps Pride Fantasy Camp Youth Tournaments Youth Tournaments After School Program Youth Waiver Contact  Us Store Open Menu Close Menu Home Soccer Schools Soccer School Locations Orlando City Soccer Schools Orlando Pride Soccer Schools Affiliate Program Camps & Clinics Camps & Clinics Summer Camps Pride Fantasy Camp Youth Tournaments Youth Tournaments After School Program Youth Waiver Contact  Us Store Open Menu Close Menu Home Folder: Soccer Schools Back Soccer School Locations Orlando City Soccer Schools Orlando Pride Soccer Schools Affiliate Program Folder: Camps & Clinics Back Camps & Clinics Summer Camps Pride Fantasy Camp Folder: Youth Tournaments Back Youth Tournaments After School Program Youth Waiver Contact  Us Store Contact us. 655 W. Church Street Orlando, Florida 32805 Orlando Youth Soccer Network ocysn@orlandocitysc.com Name * First Name Last Name Email * Message * Thank you! Follow our journey. Location 655 W. Church Street Orlando, Florida 32805 Contact Us At: admin@orlandoyouthsoccer.com QUICK LINKS Home Affiliate Soccer School Leagues Contact Us Orlando City Orlando Pride Contact admin@orlandoyouthsoccer.com"
    },
    {
      "url": "https://heartfulness.us/orlando-yoga-fest/",
      "text": "Orlando Yoga Festival | Wellness, Yoga, and Eco-Friendly Vendors at Lake Eola – Heartfulness Institute Home Vendors Sponsors Orlando Yoga Fest Register as Attendee Register as Sponsor Register as Vendor Sunday, Nov 9 9.00am – 3.00 pm Free Admission RSVP Now Venue Lake Eola Park Orlando Yoga Fest 2024 Highlights A day full of yoga, Wellness & FUN Join Greater Orlando for a rejuvenating day of Yoga, Wellness and Community 4K+ Visitors | 6 Hour Event | Full Day Yoga Sessions Yoga Expand your wellness knowledge with expert-led sessions Wellness Connect with like-minded individuals in group activities Community Cultivate personal development in a supportive environment Artist Corner Get ready for a creative adventure with Wonder Arte for a fun day of Canvas and Sand Painting. Bring the whole family to explore your artistic talents and make a masterpiece to take home. Enjoy A Fun Filled Day at lake eola park Join us for a day of serenity, wellness, and community at the Heartfulness Yoga and Wellness Festival, set against the tranquil backdrop of Lake Eola Park. This unique event invites the Greater Orlando community to come together for a celebration of holistic health, peace, and connection. Become a vendor or Sponsor at orlando yoga fest Our Platinum Sponsors holistic health marketplace Discover a vibrant marketplace featuring health and wellness vendors, including local artisans, organic food suppliers, and eco-friendly products. Engage with holistic organizations specializing in healing practices such as massage therapy, acupuncture, and mindfulness. Vendors Sponsors Organic Eats Nourish your body with raw, plant-based delights Eco-Chic Apparel Sustainable fashion for conscious living Mindfulness Corner Discover tools for daily mental well-being Fun day for all ages Organic Foods & Drinks All Day Yoga Health & Wellness Workshops Holistic Healing and Therapies Meditation Shop local Vendors Health Care Organizations Kids Activities Sponsors Educational & Informational Booths Local Produce Eco-Chic Apparel Contact Us orlando.fl@heartfulness.org (321) 348-7536 Follow Us Facebook Instagram Youtube Twitter Linkedin Whatsapp Heartfulness practices with a certified trainer are always free, whether in person or online. Articles Embracing the Heartful Odyssey Sculpting Spiritual Anatomy Embracing the Heartful Odyssey Sculpting Spiritual Anatomy Terms & Conditions Privacy & Cookie Policy Terms & Conditions Privacy & Cookie Policy © 2024 All Right Reserved up English Spanish English"
    },
    {
      "url": "https://heartfulness.us/",
      "text": "Heartfulness Institute – Meditation, Relaxation, Yoga, Spirituality emailcanada@heartfulness.org Facebook Tiktok LOGIN Home Events Community About Discover Contact Us Home Events Community About Discover Contact Us FIND A NEW YOU Simple practices for a happy life A yogic practice backed by scientific-research Try Heartfulness Book A Session Countries 1 + Practioners 1 M+ Certified Trainers 1 + BENEFITS Daily Heartfulness for positive changes Contentment Calmness Compassion Courage Clarity RESEARCH Backed by Science Studies prove that Heartfulness significantly reduces burnout and improves mental wellbeing Emotional Exhaustion 1 33 % Stress 2 32 % Insomnia Severity 3 44 % TRY US Go on. Give us a try! Experience change with just 15 minutes of guided meditation every day TRY APP Experience the app for FREE forever! Self-paced and Simple Meditation Includes Numerous Meditations Set Goals and Achieve Them Set a Time for Practice Earn Badges Daily Journal EVENTS Join live Events 3 January HOPE - 1 February Zonal Gathering – Pujya Shri Lalaji Maharaj Birth Anniversary Celebration on Feb 1st and 2nd,2025 in Austin, Texas. TBD 9:00 AM - 2:00 PM More Events TESTIMONIALS See what others have to say Bring that peace into everyday Comfortable, teaching Heartfulness meditation for free! Want to free yourself of all the false impressions you've picked up along the way? Get in touch with your heart ? Feel connected to the Divine? But at the same time keep your feet on the ground ? Bring that peace into everyday situations? This is for you! Makes such a wonderful change to how I listen to people and especially myself! Not a religious practice! This will enhance what you believe already and let you touch your truest loving nature. Give it a chance. Alexi, Richmond, VA Educational, Enlightening, Revealing A friend invited me because of a posting that popped up on Facebook for a free workshop, a 2 1/2 hr beginner meditation workshop. The staff was very welcoming, knowledgeable and I loved the fact that it was a very diverse group. The entire experience was educational, enlightening, revealing and offered great wisdom. Mental health challenges are at an all time high so it warms my heart that this center is here for the community to accommodate as needed. Paula, Richmond, VA Humble and welcoming I found what i was looking for in a simple Meditation Practice takes you direct into experience rather than talking about jargon. Simple Practice - Humble and welcoming people and environment that something for everyone in my family! Maitreya, Richmond, VA 1. Thimmapuram J, Pargament R, Sibliss K, Grim R, Risques R, Toorens E. Effect of heartfulness meditation on burnout, emotional wellness, and telomere length in health care professionals. J Community Hosp Intern Med Perspect. 2017;7(1):21-27. 2. Thimmapuram J, Yommer D, Tudor L, et al. Heartfulness meditation improves sleep in chronic insomnia. J Community Hosp Intern Med Perspect. 2020;10(1):10-15. 3. Iyer RB, Iyer BN. The Impact of Heartfulness-based Elective on Middle School Students. Am J Health Behav. 2019;43(4):812-823. Heartfulness practices with a certified trainer are always free, whether in person or online. Articles Embracing the Heartful Odyssey Sculpting Spiritual Anatomy Embracing the Heartful Odyssey Sculpting Spiritual Anatomy Terms & Conditions Privacy & Cookie Policy Terms & Conditions Privacy & Cookie Policy © 2024 All Right Reserved up English Spanish English"
    },
    {
      "url": "https://www.wearewarriorone.com/contactus",
      "text": "Warrior ONE - CONTACT CLASSES ORLANDO DUNEDIN PRIVATE SESSIONS INTRO SPECIAL! TEAM PROGRAMS & EVENTS TEACHER TRAINING FAQs CONTACT CLASSES ORLANDO DUNEDIN PRIVATE SESSIONS INTRO SPECIAL! TEAM PROGRAMS & EVENTS TEACHER TRAINING FAQs CONTACT Hey! Thanks so much for your interest in Warrior ONE! Have you seen our Q&A page? We have taken the most commonly (and not so commonly!) asked questions and answered them all in one spot. Click HERE to check the Q&A first and see if your question has already been answered! If you are inquiring about PRIVATE sessions or classes for you, your family, your company, or anyone, use THIS FORM to contact us! CONTACT ORLANDO! (use the form below) Name * First Name Last Name Phone * we will try to text you back with a quick answer if possible! (###) ### #### Email Address * Subject * ORLANDO STUDIO Message * Thank you! CONTACT DUNEDIN! (use the form below) Name * First Name Last Name Phone * we will try to text you back with a quick answer if possible! (###) ### #### Email Address * Subject * DUNEDIN STUDIO Message * Thank you! Need help quick? Text us: 407-664-1080 ORLANDO ADDRESS: 820 Lake baldwin lane orlando fl 32803 DUNEDIN ADDRESS: 919 Broadway Dunedin FL 34698 QUESTIONS? TEXT ONE OF THE NUMBERS Listed in this footer OR CLICK HERE FOR OUR FAQ PAGE! NEW? CLICK HERE TO BUY OUR NEW STUDENT PASS - ONE MONTH UNLIMITED CLASSES FOR $49 NEED TO MAKE A CHANGE TO YOUR AUTO-PAY MEMBERSHIP? CLICK HERE! Back To Top 407 664 1080 info@wearewarriorone.com"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://heartfulness.org/education/",
      "text": "Heartfulness Education Trust | Center for Education Innovations Skip to content Heartfulness From Wonder, W i s d o m Heartfulness Education Trust Heartfulness Education Trust Education Fellowship Heartfulness Research Centre Yoga Essay Event Donate Education Fellowship Heartfulness Research Centre Yoga Essay Event Donate Heartfulness Education Trust Creating a Loving, Compassionate Learning Environment through heart-based approach Education Training and Curriculum Yoga Teacher Training Courses Wellness Meditation retreats Fellowship Curriculum for Students About Trust Heart-based Meditation Upcoming Events tt program National Yoga TTC December 1st to 8th, 2019 Hyderabad – Kanha Shanti Vanam Know More ttc HFN Yoga TTC 200 January 11th to 26th, 2020 Hyderabad – Kanha Shanti Vanam Register ttc Wellness Yoga March 7th to 23rd, 2020 Hyderabad – Kanha Shanti Vanam Register Education Heartfulness Education Heartfulness Education enables teachers and students to live a balanced, purposeful, and a happy life using heart-based practices, so that they are equipped to contribute towards a sustainable school reform and community citizenship. Read more > Yoga Start your Yatra. From classical asanas to heart-based meditation with pranahuti, experience Heartfulness Yoga and expand your consciousness. Start on your mat and dive into the infinity of your heart. Look through our Yoga Courses Yoga Teacher Training Course Become a certified yoga teacher with the heart at the center of the practice. Discover Heartfulness Meditation and learn to teach classical Hatha Yoga. Read More > Wellness Take a break for a few days and rejuvenate in one of our Heartfulness Retreats. These moments are for you, caring for your body, mind and soul starting longstanding changes. Discover purity and simplicity, adopt positivity, and let your life be led through your heart. Preventive Health Workshops Make a real change in your wellbeing by gaining awareness in preventive health-care with a retreat including movement, nutrition, life-style guidance and meditation techniques. Learn from wellness experts and experience the benefits. Upcoming workshops > Yoga and Meditation retreats Find with these retreats a special space for you to unwind and to strengthen your body. All the conditions are gathered here to allow change and experience the vastness of the mind and the plenitude of the heart. Read More > Plan a wellness retreat with us: You are interested in using one of our beautiful Heartfulness meditation centers to make a wellness workshop? The Heartfulness Wellness team is here to offer you support. Write to us at: in.wellness@heartfulness.org Fellowship Fellowship Program Passionate about creating social impact, collaborative to synthesize results, philanthropic by heart and dedicated human being – is this You? If yes, then here’s the chance to give yourself to a cause you will be proud of. Partner with us, one year of your full time commitment and sky is our limit, let’s spread Heartfulness. Learn more > The Founder Mr. Kamlesh D. Patel Kamlesh D. Patel, also known as Daaji in the Heartfulnes circle, is the fourth spiritual Guide in the Sahaj Marg system of Raja Yoga meditation. He is a role model for spiritual aspirants seeking the perfect blend of eastern heart and western mind. He travels extensively for spreading Heartfulness and is at home with people from all backgrounds and walks of life, giving special attention to youth. www.daaji.org About The Trust Our Vision To create a new generation of hearts and minds through holistic education based on Heart-based Meditation tools and usher in a highly evolved human civilization. Our Mission Transforming society by equipping the new generation of students with better awareness, compassion, and competence for expanding overall public well-being Trustees Madhava Reddy, Tushar Pradhan, Mohandas Hegde, Sanjay Sehgal, Madhu Kothapalli Advisors Sanjay Bhatia, Venkat Edara, Bhadresh Rami Academic Advisory Council Bhadresh Rami, Nivedita Shreyans, Prasadh Krishna, B. S. Nagabhushana Strategy Council Venkat Edara, Tushar Pradhan, Sanjay Bhatia, Prashant Vasu, Sanjay Sehgal Institute Heartfulness Institute Education Continual Medical Education Yoga Teachers Training Certification Heartfulness Research Quick Links Daaji Sahaj Marg Kanha Shanti Vanam Green Kanha Gurugram Meditation Center Shri Ram Chandra Mission Spirituality Foundation Related Links Publications Digital Store HFNLife online store Heartfulness Magazine Heartfulness practices with a certified trainer are always free of fees or charges, whether in person or online. Find us on: Facebook Twitter YouTube Linkedin Instagram Telegram © Copyright 2024, Site is owned & operated by Sahaj Marg Spirituality Foundation. Privacy Policy • Terms of use Go to Top This website uses cookies to improve your experience. We’ll assume you’re ok with this if you continue on this site. Accept Privacy policy"
    },
    {
      "url": "https://www.collegeparkyoga.com/learn-more/classes-events",
      "text": "Yoga classes at College Park Yoga, Olando Menu Call us 407-999-7871 Schedule Yoga Therapy Yoga Therapy Passes Prices Account login On-Demand Livestream About CPY Contact More CPY Luv CLASSES & EVENTS LUV CPY YOGA THERAPY SHOP RECIPES VIDEOS Created with love by Liquid Fire YogaÂ Search Search Learn More About the LUV of CPY CLASSES & EVENTS CLASSES & EVENTS Yoga In The Galleries with Orlando Museum of Art! Read More July 17, 2025 Featured CLASSES & EVENTS New to CPY students how to's and FAQ's Read More July 17, 2025 Featured CLASSES & EVENTS Sound Immersion and yoga class with CPY Read More June 11, 2025 Featured CLASSES & EVENTS Savasana - the class on sound and yoga sleep Read More May 8, 2025 Featured 1 / 4 Next Featured See into the trees - A Forest - A Yoga class with C&T Aug 26, 2025 Â inÂ VIDEOS Stillness a yoga meditation practice with C&T Aug 26, 2025 Â inÂ VIDEOS Yoga In The Galleries with Orlando Museum of Art! Jul 17, 2025 Â inÂ CLASSES & EVENTS More to LUV Â Class Schedule Class Prices Yoga Therapy See Inside Our Book Your CPY Account View Account Here you can sign up for classes, purchase passes and rent and view videos. Stay in Touch Text: 407-606-7350 â Email: LUV@collegeparkyoga.com CPYÂ Stories All The CPYÂ LUV CLASSES & EVENTS LUV CPY YOGA THERAPY SHOP RECIPES VIDEOS About We have been serving up excellent yoga practice since 2001. If you have injuries, pain, ailments, diseases, or anything that prevents you from thinking you can do yoga (i.e., age) :), contact us. We know how to help people learn yoga and how to use it in a way that changes their lives physically, mentally, spiritually, and emotionally. And we aren't just talking. Come to the studio where we are known for making a difference, not just saying it. Learn more about the 24 years of CPY COLLEGEPARKYOGAÂ® 4100 Edgewater Dr. Orlando, FLÂ 32804 407-999-7871 â All words on this site were written by humans, By the same humans who will guide you in yoga class. Â College Park YogaÂ® Â is a registered trademark and may only be used by owners permission. Navigation CLASSES & EVENTS LUV CPY RECIPES SHOP VIDEOS YOGA THERAPY Class Passes Private sessions Schedule Gift Certs On Demand Livestream Login Created with love by Liquid Fire Yoga Powered by College Park Yoga Â®Â"
    },
    {
      "url": "https://sedonayogafestival.com/contact-us/",
      "text": "Contact Us | Sedona Yoga Festival Explore the Conference Conference Overview SYF Presenters Plan Purchase Passes Lodging Partners Directions and Information FAQ Be Involved How to Participate Be a Partner/Sponsor Be a Vendor Be A Presenter Studio Partners Work Exchange Sponsors About SYF Team Nonprofit Partners Destination Sedona Media & Press Contact Us Blog Register Contact Us We’re here to help! If you need to contact us, please email us first! info@sedonayogafestival.com We are a small team, and we strive to provide the best possible experience for our participants of all kinds — co-creators, guests, presenters, vendors, sponsors, musicians, and drop-ins. We always welcome your kind and constructive feedback. Please contact us and we will do our best to integrate your suggestions into our planning and communications. We believe that all seekers who are called to participate in some way with the Sedona Yoga Festival have a deep capacity to spread joy and transformation in their personal communities. We know you’ll be inspired to do so after experiencing it for yourself! Please check our FAQ page for general questions, but again, don’t hesitate to contact us if there’s a specific way we can be of service. Thank you! Join the Conversation on Social Media! 2026 Passes Available Now! Register Here Website URL (leave blank) Join the SYF Community! Sign up for our newsletter, and be the first to know exciting presenter news, ticket discount opportunities, and ways to be involved in the Sedona Yoga Festival community! I agree to receive communications from SYF about festival news and updates! * SIGN UP! Home Purchase Tickets Media & Press About Us Contact Us Terms and Conditions Return Policy Opt-out preferences Follow Follow Follow © Sedona Yoga Festival 2012-2025 Receive news about Sedona Yoga Festival directly in your inbox and join us in cultivating peace in the field of consciousness! I agree to receive communications from SYF about festival news and updates! * Sign Me Up Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Pin It on Pinterest Shares"
    }
  ]
}