{
  "fuentes": [
    {
      "url": "https://concertgolfpartners.com/2024/05/28/concert-golf-partners-invests-3-million-into-heathrow-legacy-country-club/",
      "email": "epeckels@concertgolfclubs.com"
    },
    {
      "url": "https://concertgolfpartners.com/2024/05/28/concert-golf-partners-invests-3-million-into-heathrow-legacy-country-club/",
      "email": "jpeace@concertgolfclubs.com"
    },
    {
      "url": "https://concertgolfpartners.com/2024/05/28/concert-golf-partners-invests-3-million-into-heathrow-legacy-country-club/",
      "email": "pnanula@concertgolfpartners.com"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2024-05-22/concert-golf-partners-invests-3-million-into-heathrow-legacy-country-club",
      "email": "epeckels@concertgolfclubs.com"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2024-05-22/concert-golf-partners-invests-3-million-into-heathrow-legacy-country-club",
      "email": "mabramowitz@concertgolfclubs.com"
    },
    {
      "url": "https://www.countryclubprestige.com/contact-us/",
      "email": "info@countryclubprestige.com"
    },
    {
      "url": "https://www.legacycars.co.uk/contact/",
      "email": "admin@legacycars.co.uk"
    },
    {
      "url": "https://concertgolfpartners.com/locations/heathrow-country-club-legacy-club-at-alaqua-lakes/",
      "email": "jpeace@concertgolfclubs.com"
    },
    {
      "url": "https://concertgolfpartners.com/locations/heathrow-country-club-legacy-club-at-alaqua-lakes/",
      "email": "membership@concertgolfclubs.com"
    },
    {
      "url": "https://concertgolfpartners.com/locations/heathrow-country-club-legacy-club-at-alaqua-lakes/",
      "email": "pnanula@concertgolfpartners.com"
    },
    {
      "url": "https://www.northeast.golf/concert-golf-partners-heathrow-country-club/",
      "email": "info@hglmedia.com"
    }
  ],
  "mails": [
    "admin@legacycars.co.uk",
    "epeckels@concertgolfclubs.com",
    "info@countryclubprestige.com",
    "info@hglmedia.com",
    "jpeace@concertgolfclubs.com",
    "mabramowitz@concertgolfclubs.com",
    "membership@concertgolfclubs.com",
    "pnanula@concertgolfpartners.com"
  ],
  "nombre_sitio": "heathrowcc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://concertgolfpartners.com/2024/05/28/concert-golf-partners-invests-3-million-into-heathrow-legacy-country-club/",
      "text": "Concert Golf Partners Invests $3 Million into Heathrow Legacy Country Club | Concert Golf Partners Skip to main content Concert Golf Partners (Go to home) Toggle Menu What We Do Toggle sub menu Back Why Concert Golf Leadership Concert Cares Testimonials FAQs Vendors Careers Club Success Toggle sub menu Back Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Our Clubs Solutions Toggle sub menu Back Golf Management Financing Capital Improvements Club Consulting News & Education Contact Back Let’s Talk \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. Close Let's Talk Leadership Careers Concert Cares Privacy Policy Concert Golf Partners Invests $3 Million into Heathrow Legacy Country Club < Back Heathrow Legacy is the first private club in Central Florida to offer Top Tracer Range; Renovations also include 18 new Bermuda greens on the Garl Course, upgrades to both clubhouses, 6 new pickleball courts, pool deck refresh and irrigation HEATHROW, Fla. (May 21, 2024) – A pillar of the North Orlando community, Heathrow Legacy Country Club is installing $3 million worth of upgrades at the historic club. Among the extensive renovations are 10 brand new covered and elegantly furnished TopTracer Range outdoor bays, as well as 18 new Champion Bermuda greens on the Garl Course. Significant golf course irrigation improvements, designed to enhance drainage and elevate course conditions to new heights, were also installed. Heathrow Legacy is now the first private facility in Central Florida to install TopTracer Range, the No. 1 rated range technology, which transforms the traditional driving range experience. The technology provides instant feedback on ball speed, trajectory, distance, and more. TopTracer also enables golfers of all levels to enjoy interactive games and practice sessions, with precise data on performance. The club offers members and guests access to two clubhouses set just two miles apart, with 36 holes of golf that pay homage to namesake designers Ron Garl (Garl Course) and Tom Fazio (Fazio Course). At the Heathrow Clubhouse, renovations were made to the bar, patio, fixtures and HVAC. Meanwhile, the Legacy Clubhouse will soon undergo a complete remodel of the lobby, boardroom, bar and dining space, including new fixtures, flooring, furniture and decor. Heathrow Legacy members also enjoy exclusive access to The Racquet Club, a sprawling onsite tennis and fitness facility, that will add six new pickleball courts this summer. The 13-court tennis facility has hosted the likes of Andre Agassi, Pete Sampras, Jimmy Connors and Billie Jean King. In addition, a brand new pool deck was just installed. Heathrow Legacy was the first club ever owned by Concert Golf Partners, a boutique owner-operator of 33 upscale private golf and country clubs nationwide, with its national headquarters located along the Garl Course. Concert consistently makes annual capital investment in its clubs. The upgrades are aimed at enhancing amenities, service levels and the overall member experience, while building and maintaining a thriving club environment. “This multi-million dollar investment in Heathrow Legacy is part of the ongoing commitment by Concert Golf Partners to continually reinvest in our properties each year, as we preserve and enhance our private clubs for our members nationwide,” said Concert Golf Senior Vice President of Operations Aaron Straub. “The renovations at Heathrow Legacy, including the installation of TopTracer Range and pristine Champion Bermuda greens, have further elevated the upscale amenities available at this iconic club.” The challenging 18-hole Garl Course at Heathrow C.C. has seen several PGA Tour players call the club “home” over the years, including Chris DiMarco, Jim Thorpe, Matt Kuchar, Zach Johnson, Payne Stewart, Sam Ryder and Fulton Allem. Host of nine US Open Qualifiers, the Par 71, 6,888-yard course has a slope of 133 and a 73.8 rating. Featuring water hazards on 16 holes, the course is accentuated by its signature island green on the par-3, 117-yard 12th hole; and an unique island fairway on No. 17, where you must clear danger on both your tee shot and approach. Golf facilities include complete clubhouse services, a pro-shop, a driving area and chipping green. A professional instructional staff offers tailored individual and group instruction and a variety of clinics. Fazio Course architect Tom Fazio has praised it as among his best efforts. The 7,160-yard par 72 course carries a 74.5 rating and 132 slope carved around a dense forest of lush, mature trees with spectacular topography, dramatic slopes, rises and knolls unique to Florida. Hole No. 12 is known as the “Tiger Trap,” as Tiger Woods once appeared out of the surrounding forest to challenge golfers to a closest-to-the-pin contest in a famous Buick TV commercial. The clubs also offer indoor and outdoor dining year-round, in-house sitter care for kids, and a variety of events and classes. For membership information, please contact Eddie Peckels at epeckels@concertgolfclubs.com . GET IN TOUCH Get in Touch \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. 300 International Parkway Suite 150 Lake Mary, FL 32746 What We Do Why Concert Golf Testimonials FAQs Vendors Club Success Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Solutions Golf Management Financing Capital Improvements Club Consulting Our Clubs News Contact Leadership Careers Concert Cares Privacy Policy © 2025 Concert Golf Partners. All Rights Reserved. Web Design & Development by"
    },
    {
      "url": "https://www.firstcallgolf.com/industry-news/release/2024-05-22/concert-golf-partners-invests-3-million-into-heathrow-legacy-country-club",
      "text": "Concert Golf Partners: Invests $3 million into Heathrow Legacy CC Skip to main content News GOLF INDUSTRY TFC / PR NEWSWIRE Industry AGM Business Links Living NGCOA VORTEX RAIN CHECK CAREERS Calendar Features COLUMNS DESIGN NOTES TFC INBOX LIFESTYLE EPSON TOUR THE FRIARS GOLF CLUB POLLS Podcasts Content Clubhouse Cookie Jar Golf Driver$ Golf Innerview ModGolf Videos Content Clubhouse Coach Mo Golf Show Up River Film Co. Events Archives Show Search Search Query Submit Search Industry News Concert Golf Partners invests $3 million into Heathrow Legacy Country Club Heathrow Legacy is the first private club in Central Florida to offer TopTracer Range; Renovations also include 18 new Bermuda greens on the Garl Course, upgrades to both clubhouses, 6 new pickleball courts, pool deck refresh and irrigation May 22, 2024 LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print Editors: For photos of Heathrow Legacy C.C., click here. HEATHROW, Fla. (May 21, 2024) – A pillar of the North Orlando community, Heathrow Legacy Country Club is installing $3 million worth of upgrades at the historic club. Among the extensive renovations are 10 brand new covered and elegantly furnished TopTracer Range outdoor bays, as well as 18 new Champion Bermuda greens on the Garl Course. Significant golf course irrigation improvements, designed to enhance drainage and elevate course conditions to new heights, were also installed. Heathrow Legacy is now the first private facility in Central Florida to install TopTracer Range, the No. 1 rated range technology, which transforms the traditional driving range experience. The technology provides instant feedback on ball speed, trajectory, distance, and more. TopTracer also enables golfers of all levels to enjoy interactive games and practice sessions, with precise data on performance. The club offers members and guests access to two clubhouses set just two miles apart, with 36 holes of golf that pay homage to namesake designers Ron Garl (Garl Course) and Tom Fazio (Fazio Course). At the Heathrow Clubhouse, renovations were made to the bar, patio, fixtures and HVAC. Meanwhile, the Legacy Clubhouse will soon undergo a complete remodel of the lobby, boardroom, bar and dining space, including new fixtures, flooring, furniture and decor. Heathrow Legacy members also enjoy exclusive access to The Racquet Club, a sprawling onsite tennis and fitness facility, that will add six new pickleball courts this summer. The 13-court tennis facility has hosted the likes of Andre Agassi, Pete Sampras, Jimmy Connors and Billie Jean King. In addition, a brand new pool deck was just installed. Heathrow Legacy was the first club ever owned by Concert Golf Partners, a boutique owner-operator of 33 upscale private golf and country clubs nationwide, with its national headquarters located along the Garl Course. Concert consistently makes annual capital investment in its clubs. The upgrades are aimed at enhancing amenities, service levels and the overall member experience, while building and maintaining a thriving club environment. “This multi-million dollar investment in Heathrow Legacy is part of the ongoing commitment by Concert Golf Partners to continually reinvest in our properties each year, as we preserve and enhance our private clubs for our members nationwide,” said Concert Golf Senior Vice President of Operations Aaron Straub. “The renovations at Heathrow Legacy, including the installation of TopTracer Range and pristine Champion Bermuda greens, have further elevated the upscale amenities available at this iconic club.” The challenging 18-hole Garl Course at Heathrow C.C. has seen several PGA Tour players call the club “home” over the years, including Chris DiMarco, Jim Thorpe, Matt Kuchar, Zach Johnson, Payne Stewart, Sam Ryder and Fulton Allem. Host of nine US Open Qualifiers, the Par 71, 6,888-yard course has a slope of 133 and a 73.8 rating. Featuring water hazards on 16 holes, the course is accentuated by its signature island green on the par-3, 117-yard 12th hole; and an unique island fairway on No. 17, where you must clear danger on both your tee shot and approach. Golf facilities include complete clubhouse services, a pro-shop, a driving area and chipping green. A professional instructional staff offers tailored individual and group instruction and a variety of clinics. Fazio Course architect Tom Fazio has praised it as among his best efforts. The 7,160-yard par 72 course carries a 74.5 rating and 132 slope carved around a dense forest of lush, mature trees with spectacular topography, dramatic slopes, rises and knolls unique to Florida. Hole No. 12 is known as the “Tiger Trap,” as Tiger Woods once appeared out of the surrounding forest to challenge golfers to a closest-to-the-pin contest in a famous Buick TV commercial. The clubs also offer indoor and outdoor dining year-round, in-house sitter care for kids, and a variety of events and classes. For membership information, please contact Eddie Peckels at epeckels@concertgolfclubs.com . For more information, visit ConcertGolfPartners.com . About Concert Golf Partners: Concert Golf Partners is a boutique owner-operator of upscale private golf and country clubs focused on preserving the unique culture, identity, and traditions of our 33 clubs nationwide. We ensure this through consistent annual capital investment aimed at enhancing amenities, service levels and the overall member experience at our clubs, while building and maintaining a thriving club environment. Each club features both a strong membership base and financial position. Concert Golf was formed by Peter Nanula, Founder and CEO of Arnold Palmer Golf Management; and Co-Founder and COO, Susan Dunnavant, in 2011. Based near Orlando, the company is known as an experienced and premier buyer of private clubs since its founding. Concert Golf’s portfolio features a unique blend of iconic and select clubs, with courses designed by world-renowned golf architects, including Tom Fazio, Jack Nicklaus and Arnold Palmer. With $250 million of investment capital, Concert Golf strategically searches for both exclusive and up-and-coming private clubs to join our collection. This includes both formerly developer-owned clubs, such as The Club at Renaissance in Fort Myers, Florida, as well as longtime member-owned clubs, such as The Club at Pasadera in Monterey, California. Contact: Michael Abramowitz Concert Golf Partners 561-389-4647 mabramowitz@concertgolfclubs.com Industry News LinkedIn Twitter Email Show more sharing options Share Close extra sharing options LinkedIn Twitter Email Copy Link URL Copied! Print 960 Morrison Drive, Suite 300, Charleston, South Carolina 29403 Copyright © 2025, The First Call, a division of Buffalo Groupe , LLC. All rights reserved. Who We Are About Us Media Kit Press Release Program Archives Support Subscribe Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.countryclubprestige.com/contact-us/",
      "text": "Contact Us - Explore Luxury Car Hire in London - Country Club Prestige Skip to content \"We Deliver Nothing But Excellence\" Facebook-square Instagram Home About Us Book Now Services Gallery Contact Us X Call us for more info 0333 004 0103 Contact Whether you need to make a reservation, get a quote, or just want to learn more about our services, our friendly and knowledgeable customer service team is always available to assist you and answer any questions you may have. Thank you for reading this post, don't forget to subscribe! Call Us On 0333 004 0103 Email Us At info@countryclubprestige.com Address Location 4th Floor, Silverstream House, 45 Fitzroy Street, Fitzrovia, London, W1T 6EB Get a Free Quote Name Email Message Send Experience Luxury Travel Like Never Before Discover a world of unparalleled comfort and style with our luxury transport services. Whether you’re planning a lavish getaway, a corporate event, or a special occasion, our fleet of meticulously maintained vehicles and professional chauffeurs will ensure you arrive in absolute luxury. Book your extraordinary journey today and elevate your travel experience with us. Book Now Address Head office – London 4th Floor, Silverstream House 45 Fitzroy Street Fitzrovia London W1T 6EB Operational Office – Peterborough 148 Fletton Avenue Peterborough PE2 8DA Contact Details Tel: +44 (0) 333 004 0103 Landline: +44 (0) 1733 307 309 Mob: +44 (0) 7850 487 041 Email: info@countryclubprestige.com Opening Hours: Mon – Fri 9:00am – 18:00pm Sat – Sun 10:00am – 16:00pm Facebook Instagram Useful Links Home Gallery Services About Us Contact us Book A Trip Terms and Conditions COPYRIGHT © 2023 countryclubprestige | DESIGN BY NEXGENZ ALL RIGHTS RESERVED"
    },
    {
      "url": "https://www.legacycars.co.uk/contact/",
      "text": "Contact Us | Legacy Cars Ltd | Heathrow Skip to content 0208 033 5165 07482 875193 email Mon to Sat: 10:00 to 17:00 Home About Used Cars Used Car Configurator Servicing Car Insurance Awards FAQ’s Contact Home About Used Cars Used Car Configurator Servicing Car Insurance Awards FAQ’s Contact Free Car Valuation Home About Used Cars Vehicle Sourcing Servicing Car Insurance Awards & Reviews FAQ’s Contact Home About Used Cars Vehicle Sourcing Servicing Car Insurance Awards & Reviews FAQ’s Contact Contact Us Here to help - because it's what we do. We understand that finding the perfect car can be an exciting yet overwhelming process, and we’re here to make it effortless for you. Contacting us is easy. We’re on hand for when you need us. Whether you have questions about our range of cars, want to schedule a test drive, or need expert advice from our knowledgeable staff, please get in touch by phone, email or use our contact form. Address Legacy Cars Limited 450 Bath Road Longford UB7 0EB Contact Details 0208 033 5165 07482 875193 email Whatsapp Feel free to drop us a message on WhatsApp Name Email Phone Message Car Registration Send Based in West London, next to Heathrow Terminal 5 serving North, East, South, West London and the rest of the UK. Useful Information Terms & Conditions Financial Terms & Conditions Warrantywise Momentum Warranties ULEZ Vehicle Checker Recommended Insurance Providers Cuvva Comparethemarket Contact details 0208 033 5165 07482 875193 email Feel free to drop us a message on WhatsApp Car Registration Mileage Service History Full Partial None Number of Owners Any body damage or any other known issues eg  any engine or gearbox concerns What car are you interested in Car Registration Name Email Send To reserve this vehicle, please fill in the form below. Name * Phone Number * Email Address * Vehicle Registration * Enter vehicle registration Deposit * Credit / Debit Card * Reserve Vehicle"
    },
    {
      "url": "https://concertgolfpartners.com/locations/heathrow-country-club-legacy-club-at-alaqua-lakes/",
      "text": "Heathrow Country Club | Concert Golf Partners Skip to main content Concert Golf Partners (Go to home) Toggle Menu What We Do Toggle sub menu Back Why Concert Golf Leadership Concert Cares Testimonials FAQs Vendors Careers Club Success Toggle sub menu Back Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Our Clubs Solutions Toggle sub menu Back Golf Management Financing Capital Improvements Club Consulting News & Education Contact Back Let’s Talk \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. Close Let's Talk Leadership Careers Concert Cares Privacy Policy Orlando, FL Heathrow Legacy Country Club With two spacious clubhouses and courses just miles from one another, Heathrow Legacy Country Club has what you’re looking for. The Heathrow Country Club, established in 1983, is the leading private country club in North Orlando and designed by  Ron Garl. The main clubhouse is 15,000 square feet, with full dining and banquet facilities, and the adjacent Racquet Club consists of a 9,000 square foot clubhouse, a tennis complex with 13 courts, including a stadium center court and one of the premier aquatic facilities in Central Florida. The Legacy Club delivers a world-class golf experience marked with excellent course conditions and high-end amenities, including an 11,000 square foot clubhouse, state-of-the-art meeting rooms, Champion Bermuda greens, and a 10-acre practice facility with target greens and separate chipping, putting and bunker facilities. Developed with sensitivity to the environment Contact Heathrow Country Club – 1200 Bridgewater Drive, Heathrow, FL 32746 The Legacy Club at Alaqua Lakes – 1700 Alaqua Lakes Blvd., Longwood, FL 32779 (407) 333-1450 membership@concertgolfclubs.com Links View Website The Legacy Club Press Release The Heathrow Country Club Press Release Heathrow Country Club’s Partnership with Concert Golf On July 15, 2011, Concert Golf Partners acquired Heathrow Country Club, one of Central Florida’s premier private country clubs, from BB&T in an all-cash transaction. BB&T was the lender that had foreclosed on its loan to the developer of Heathrow’s golf club and 2,200-home master-planned community earlier in the year. “It was a pleasure working with [Concert Golf]; we are very happy with the transaction and we are looking forward to seeing [them] transform this diamond in the rough into the premier course/club it can be,” said the Senior Vice President of BB&T. Heathrow Country Club presented a complex set of challenges for the developer and its banks: two separate bank loans; two foreclosures and two bankruptcies; environmental issues; deferred maintenance; and a declining membership seeking stability and a well-capitalized owner dedicated to the high-quality operation of the club.  “We thrive in these complex, fast-moving situations,” said Peter Nanula, Managing Partner of Concert Golf, which entered into a quick 30-day inspection period.  “Heathrow is our kind of situation:  with over 900 total members and 2,200 homeowners in the community, the club has generated $6-8 million of gross revenues annually but needs focused management and a strong capital base to restore the magic of one of Orlando’s leading private clubs.” Explore Case Studies The Legacy Club’s Partnership with Concert Golf On October 4, 2013, Concert Golf Partners (www.concertgolfpartners.com) acquired the Legacy Club at Alaqua Lakes (www.alaqualakesgolfclub.com), a premier private club in North Orlando featuring an 18-hole Tom Fazio-designed masterpiece. Concert Golf bought the club, previously owned and operated by Heritage Golf Group, from Deutsche Bank via a deed-in-lieu transaction with a novel approach to the club’s membership refund liability. Terms of the transaction were not disclosed; Hilda Allen represented seller Deutsche Bank in the transaction. “We specialize in these complex deal structures, and we are pleased to have both solved the bank’s need for a speedy transaction prior to foreclosure and also addressed the club’s membership refund liabilities,” Peter Nanula of Concert Golf said. “The Legacy Club has an elite golfer membership, who will now enjoy dual-club access at our Heathrow Country Club less than a mile down the street.” Explore Case Studies Revitalize Your Club with Concert Golf Partners Start your recapitalization journey with Concert Golf to help your club become financially secure and up to date. We’ve helped over 25 private clubs across the country overcome obstacles and attract new members. GET IN TOUCH Get in Touch \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. 300 International Parkway Suite 150 Lake Mary, FL 32746 What We Do Why Concert Golf Testimonials FAQs Vendors Club Success Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Solutions Golf Management Financing Capital Improvements Club Consulting Our Clubs News Contact Leadership Careers Concert Cares Privacy Policy © 2025 Concert Golf Partners. All Rights Reserved. Web Design & Development by"
    },
    {
      "url": "https://www.northeast.golf/concert-golf-partners-heathrow-country-club/",
      "text": "Heathrow Country Club: Concert Golf Partners' Prestigious New Acquisition Skip to content SHOW MAGAZINES SUBMIT SUBMIT BLOG POST EVENT REQUEST FOR PROPOSAL BRANDS NEW ENGLAND HOME SHOWS PICKLEBALL NEW ENGLAND (COMING SOON) NEW ENGLAND SNOW SPORTS (COMING SOON) BEST BITES NEW ENGLAND (COMING SOON) SHOW MAGAZINES SUBMIT SUBMIT BLOG POST EVENT REQUEST FOR PROPOSAL BRANDS NEW ENGLAND HOME SHOWS PICKLEBALL NEW ENGLAND (COMING SOON) NEW ENGLAND SNOW SPORTS (COMING SOON) BEST BITES NEW ENGLAND (COMING SOON) SHOW MAGAZINES SUBMIT SUBMIT BLOG POST EVENT REQUEST FOR PROPOSAL BRANDS NEW ENGLAND HOME SHOWS PICKLEBALL NEW ENGLAND (COMING SOON) NEW ENGLAND SNOW SPORTS (COMING SOON) BEST BITES NEW ENGLAND (COMING SOON) SHOW MAGAZINES SUBMIT SUBMIT BLOG POST EVENT REQUEST FOR PROPOSAL BRANDS NEW ENGLAND HOME SHOWS PICKLEBALL NEW ENGLAND (COMING SOON) NEW ENGLAND SNOW SPORTS (COMING SOON) BEST BITES NEW ENGLAND (COMING SOON) Icon-facebook Instagram X-twitter Icon-linkedin SHOW MAGAZINE SUBMIT READ THE TRAVEL PLANNER • Butterfield Bermuda Championship • Distance & Sound Devices • Best in Bags & Carts • Tee 2 Table: Mohegan Sun Northeast Golf Club Only $65/Year $ave Thousands on Rounds Towel Tag | Magazine Subscription Exclusive Events & Contests JOIN THE CLUB SUBSCRIBE FREE Facebook-f Icon-instagram-1 X-twitter Linkedin-in #NortheastGolf NEWS TRAVEL PRO SHOP GEAR FASHION PICKLEBALL GIFTS INDOOR COMMUNITIES EVENTS CONTESTS VOTE MORE MAGAZINES WEEKLY SOCIAL SUBMIT MEDIA KIT NEWS TRAVEL PRO SHOP GEAR FASHION PICKLEBALL GIFTS INDOOR COMMUNITIES EVENTS CONTESTS VOTE MORE MAGAZINES WEEKLY SOCIAL SUBMIT MEDIA KIT Search NEWS TRAVEL PRO SHOP GEAR FASHION PICKLEBALL GIFTS INDOOR COMMUNITIES EVENTS CONTESTS VOTE MORE MAGAZINES WEEKLY SOCIAL SUBMIT MEDIA KIT NEWS TRAVEL PRO SHOP GEAR FASHION PICKLEBALL GIFTS INDOOR COMMUNITIES EVENTS CONTESTS VOTE MORE MAGAZINES WEEKLY SOCIAL SUBMIT MEDIA KIT Search SHOW MAGAZINE SUBMIT Join the Club Facebook-f Icon-instagram-1 X-twitter Linkedin-in #NortheastGolf Search JOIN THE CLUB SUBSCRIBE FREE Search Instagram Facebook JOIN THE CLUB SUBSCRIBE FREE Golf Travel Concert Golf Partners at Heathrow Legacy Country Club February 17, 2025 By Danny and Alice Scott If you google Tripod the bear, you will see Heathrow Legacy Country Club’s informal mascot. His video went viral opening a homeowner’s patio frig door and chomping down a White Claw hard seltzer. The former Legacy Club of Alaqua Lakes was designed by Tom Fazio and is known to be a very tough, challenging course. It is a sanctuary for bears and bobcats, free range chickens and lucky golf members.  It is also famed for the Buick commercial filmed with Tiger Woods surprising golfers for a closest to the pin contest. Five of them won new cars for their winning swings on number 12, now dubbed Tiger Trap. The Fazio course is truly an Audubon International Signature Certified Sanctuary golf course. Legacy as the name implies, has much history tied to its golf as well as tennis with the likes of Agassi, Connors and Billie Jean playing in a small arena that still stands among the many modern courts including of course, pickleball. Legacy Country Club merged with its neighbor Heathrow Country Club making it one of the most prestigious clubs in Florida, only to be enhanced as part of the Concert Golf Partners’ collection with a $3m investment. Heathrow was the first of Concert Golf’s acquisitions in 2013. Heathrow is known as the Garl course, designed by Ron Garl and while still challenging, it is a bit easier to play if you miss the waterways that belie 16 of the 18 holes. Host of nine U.S. Open qualifiers, it has numerous winning PGA Tour players on its member roster including Payne Stewart (the first club member), Jim Thorpe, Chris DiMarco, Matt Kuchar, Zach Johnson and Sam Ryder. The course is a paradise for Florida’s aquatic winged stars as well. Key to Garl’s design is the island green on number 12’s par 3. Concert Golf’s clubhouse and course renovations at Heathrow Legacy Country Club have elevated the golf, social and dining experiences. Heathrow is the only private club to install Trackman demonstrating the forward thinking of Concert Golf’s team. Michael Abramowitz, VP of Public Relations and Communication at Concert Golf provided insight to their acquisition strategy. Their portfolio consists of premier upscale private clubs where people live and work. As a boutique owner/operator, they are disciplined in finding the right clubs where members appreciate the reinvestment. Recapitalization pays off all debt and eliminates member assessments. Shawn Mc Guigan, the GM at Heathrow Legacy shared Concert Golf’s capital investment strategy when acquiring new clubs. They keep the pros and culture of a new private club while assessing and supplementing the staff as opposed to “cleaning house.” Shawn was previously the head pro at Heathrow. Concert Golf might invest money in perhaps updating a/c units or wells that are not front facing but necessary. They listen to the members and upgrade what they have been hoping for such as bunkers. And often they put a lot into kitchen enhancements to attract the best chefs. If Heathrow’s Clubhouse is an example, the resulting cuisine is very fine, and we highly recommend the salad with salmon if the opportunity arises. Concert Golf Partners’ Clubs cover a variety of course designers across the states and members at each enjoy the travel benefit to use any club as if it were their own. The home pro sets up the tee time with the remote pro and member number. The Club at Pasadera is a Jack Nicklaus Signature in Monterey with a 200-yard carry from tees over a canyon. TPC Jasna Polana in Princeton, NJ holds onto the art and heritage of the Johnson and Johnson family with a speakeasy room. The latest acquisitions are Rees Jones’ Golf Club of the Everglades, where members require no tee times, The Georgia Club, Penn Oaks and The Club at SpurWing. Westgate Club sits in Augusta and the list goes on like a harmonic symphony of elite clubs, now totaling 38. www.concertgolfclubs.com Author: Alice & Danny Scott Tags Golf Courses , Golf Lifestyle , Golf News , Golf Tournaments Share this post: Prev Previous Harbor Shores Transformation Continues with New Wee Course Next Honma Golf Redefines Luxury with BERES 09 Collection Next Alice & Danny Scott Related Posts Jim Furyk, Darren Clarke and Mike Weir named captains for Skechers World Champions Cup supporting Shriners Children’s September 10, 2025 “Unveiling College Royale: A Revolution in College Golf Simulator Tournaments” September 9, 2025 “College Royale: The Future of Virtual Golf Tournaments Unveiled” September 9, 2025 European Waterways’ Spirit of Scotland: Our Luxury Barge Journey in the Highlands September 5, 2025 Stay Connected Like Us On Facebook Follow Us On X View our instagram Latest Posts Jim Furyk, Darren Clarke and Mike Weir named captains for Skechers World Champions Cup supporting Shriners Children’s September 10, 2025 “Unveiling College Royale: A Revolution in College Golf Simulator Tournaments” September 9, 2025 “College Royale: The Future of Virtual Golf Tournaments Unveiled” September 9, 2025 Category Lorem ipsum dolor sit amet, consectetur adipiscing elit eiusmod tempor ncididunt ut labore et dolore magna Email Sign Up Read the Magazine Read the Magazine (C) Home Golf Lifestyle Media LLC |. Site Map Sign Up for NORTHEAST GOLF NEWSLETTERS Email Sign Up Get the latest news, the hottest destinations, new product releases, indoor golf trends and more delivered directly to your inbox. Choose your favorites today. CATEGORIES News Travel Pro Shop Indoor Lifestyle SERVICES MAGAZINES Media Kit Golf Show About Submit Blog SOCIAL Facebook Instagram X Linkedin MEMBERSHIP ONLY $65 / YEAR $ave Thousands on Rounds, Retail, Resorts, Indoor Golf & More! JOIN TODAY (C) Home Golf Lifestyle Media LLC |. Site Map Privacy & Policy Help Terms NEWS TRAVEL PRO SHOP GEAR FASHION PICKLEBALL GIFTS INDOOR COMMUNITIES EVENTS CONTESTS VOTE MORE MAGAZINES WEEKLY SOCIAL SUBMIT MEDIA KIT"
    }
  ]
}