{
  "fuentes": [
    {
      "url": "https://heidisjazzclub.com/restaurant-reservations",
      "email": "manager@heidisjazzclub.com"
    },
    {
      "url": "https://www.usaswimming.org/home/find-a-team?format=json",
      "email": "masinfo@usaswimming.org"
    },
    {
      "url": "https://www.everythingbrevard.com/blog/082702-new-owners-to-upgrade-preserve-heidis-jazz-club",
      "email": "contact@heidisjazzclub.com"
    },
    {
      "url": "https://www.everythingbrevard.com/blog/082702-new-owners-to-upgrade-preserve-heidis-jazz-club",
      "email": "info@everythingbrevard.com"
    },
    {
      "url": "https://www.everythingbrevard.com/blog/082702-new-owners-to-upgrade-preserve-heidis-jazz-club",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://www.everythingbrevard.com/blog/082702-new-owners-to-upgrade-preserve-heidis-jazz-club",
      "email": "ncontact@heidisjazzclub.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa-beach/attractions/heidis-jazz-club/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.heidisjazzclub.com/calendar",
      "email": "manager@heidisjazzclub.com"
    },
    {
      "url": "https://www.heidisjazzclub.com/about-us",
      "email": "manager@heidisjazzclub.com"
    },
    {
      "url": "https://www.heidisjazzclub.com/",
      "email": "manager@heidisjazzclub.com"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "agarces@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "ddouget@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "eramoni@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "info@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "jdoyle@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "jlloyd@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "jremetich@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "khafiz@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "lkeller@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "logo-words@2x.png"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "lrobinson@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "programs@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "rfrancis@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "rlyons@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "scarriere@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "sstowe@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "email": "tmelvin@jazzandheritage.org"
    },
    {
      "url": "https://www.jazzpharma.com/about/leadership",
      "email": "logo-jazzpharma@2x.png"
    },
    {
      "url": "https://www.jazzpharma.com/about/leadership",
      "email": "privacy@jazzpharma.com"
    },
    {
      "url": "https://www.heidisjazzclub.com/reservations",
      "email": "manager@heidisjazzclub.com"
    },
    {
      "url": "https://www.heidisjazzclub.com/jazzclub",
      "email": "manager@heidisjazzclub.com"
    },
    {
      "url": "https://www.heidisjazzclub.com/contact",
      "email": "manager@heidisjazzclub.com"
    },
    {
      "url": "https://heidisjazzclub.com/home",
      "email": "manager@heidisjazzclub.com"
    }
  ],
  "mails": [
    "agarces@jazzandheritage.org",
    "chosen-sprite@2x.png",
    "contact@heidisjazzclub.com",
    "ddouget@jazzandheritage.org",
    "eramoni@jazzandheritage.org",
    "info@everythingbrevard.com",
    "info@jazzandheritage.org",
    "jdoyle@jazzandheritage.org",
    "jlloyd@jazzandheritage.org",
    "jremetich@jazzandheritage.org",
    "khafiz@jazzandheritage.org",
    "lkeller@jazzandheritage.org",
    "logo-jazzpharma@2x.png",
    "logo-words@2x.png",
    "lrobinson@jazzandheritage.org",
    "manager@heidisjazzclub.com",
    "masinfo@usaswimming.org",
    "name@yoursite.com",
    "ncontact@heidisjazzclub.com",
    "privacy@jazzpharma.com",
    "programs@jazzandheritage.org",
    "rfrancis@jazzandheritage.org",
    "rlyons@jazzandheritage.org",
    "scarriere@jazzandheritage.org",
    "sstowe@jazzandheritage.org",
    "tmelvin@jazzandheritage.org"
  ],
  "nombre_sitio": "heidisjazzclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://heidisjazzclub.com/restaurant-reservations",
      "text": "Reservations | Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS Restaurant Reservations Separate from the Jazz Club, but located under the same roof is the coziest restaurant on the Space Coast. Join us inside or out on the patio for the finest German Cuisine and relaxing nightly piano playing. Reservations are available via Open Table form below or call us directly: 321-783-6806 ​ **​ Please note that if you purchase tickets for LIVE music on Eventbrite.com, you do NOT need to make reservations through OpenTable, as the Jazz Club serves dinner. To check out the upcoming events at the Jazz Club, click here. Hosting a Private Party? Hosting a corporate event, engagement or special birthday party? We'd love to host it for you. Contact us to get started planning a one-of-a-kind event at Heidi's. Private Party Inquiry First name Last name Email Phone Select a date Any other information/specifics? SUBMIT We'll be in touch soon! follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    },
    {
      "url": "https://www.usaswimming.org/home/find-a-team?format=json",
      "text": "Find A Team Events & Tickets Fan Shop Swim Shop Find A Team Block Party Membership Login / Register Times Times Home Popular Resources Individual Times Search Top Times / Event Rank Power Point Calculator Time Standards National Age Group Records All-Time Top 100 Age Group Scholastic All-America Virtual Offerings IMX/IMR Virtual Club Championship Block Party Leaderboard Club Excellence Data Hub Record Progressions All-Time Top Performers Yearly Top Performers All-Time Relay Splits World Rankings Powered by USA Swimming Continental Lists Meet Results Other Organizations NCAA Information NCAA Division I NCAA Division II NCAA Division III International School Swimming Competitions - China Swimmers & Parents Swimmers & Parents Home Popular Resources Register & Renew Membership USA Swimming University Mental Training & Wellness Anti-Doping Diversity, Equity & Inclusion Disability Nutrition & Recovery Learn the Basics Learn-to-Swim Find a Swim Team & Lessons Rules & Policies Swimmers Athlete Videos Training & Technique Open Water Swim Camps Parents Safe Sport for Parents Become an Official Coaches & Team Leaders Coaches & Team Leaders Home Coaches Coach Requirements Coach Safety Requirements American Development Model Coach Certification Program Coaches Community Coach Mental Health & Wellness Team Leaders Start a New Club Managing Your Team Block Party Grants Marketing Toolkit SWIMS Alerts Swim Camps Connect & Learn Diversity, Equity & Inclusion Disability Programs & Services Resources Registration & Renewal Team Services USA Swimming University Online Meet Entry (OME) Job Board Health Coverage Financial Advising Officials Officials Home Popular Resources Officials Tracking System National Certification & Evaluation National Meet Applications Rules & Policies Online Testing Recognition & Incentive Programs Officials Documents Open Water Officials Getting Started USA Swimming University How to Become an Official LSC Officials Chairs Safe Sport Safe Sport Home Club Tool Kit Report a Concern Complete a Background Check Safe Sport Club Recognition Minor Athlete Abuse Prevention Policy Athlete Protection Training Individuals Suspended or Ineligible Meet the Team Meet the Team Home National Team National Jr. Team Rosters National Team Alumni Athlete Videos 2024 Olympic Team About About Home Organization Overview Leadership Team Board of Directors Staff Directory Contact Us Careers Governance Board Governance Bylaws Rules & Policies Committees Board Meeting Minutes Financials USA Swimming Annual Summit LSC Resources LSC Services LSC Websites LSC Governance LSC Treasurer Operational Risk Resources Media Information Marketing Partners Marketing Resources Insurance Online Member Registration SWIMS Database Newsletter Archive Stakeholder Engagement Foundation DONATE Times Swimmers & Parents Coaches & Team Leaders Officials Safe Sport Meet the Team About Foundation MEMBERSHIP VIDEOS EVENTS & TICKETS SWIM SHOP FAN SHOP FIND A TEAM Donate BACK Times Popular Resources Individual Times Search Top Times / Event Rank Power Point Calculator Time Standards National Age Group Records All-Time Top 100 Age Group Scholastic All-America Virtual Offerings IMX/IMR Virtual Club Championship Block Party Leaderboard Club Excellence Data Hub Record Progressions All-Time Top Performers Yearly Top Performers All-Time Relay Splits World Rankings Powered by USA Swimming Continental Lists Meet Results Other Organizations NCAA Information NCAA Division I NCAA Division II NCAA Division III International School Swimming Competitions - China BACK Swimmers & Parents Popular Resources Register & Renew Membership USA Swimming University Mental Training & Wellness Anti-Doping Diversity, Equity & Inclusion Disability Nutrition & Recovery Learn the Basics Learn-to-Swim Find a Swim Team & Lessons Rules & Policies Swimmers Athlete Videos Training & Technique Open Water Swim Camps Parents Safe Sport for Parents Become an Official BACK Coaches & Team Leaders Coaches Coach Requirements Coach Safety Requirements American Development Model Coach Certification Program Coaches Community Coach Mental Health & Wellness Team Leaders Start a New Club Managing Your Team Block Party Grants Marketing Toolkit SWIMS Alerts Swim Camps Connect & Learn Diversity, Equity & Inclusion Disability Programs & Services Resources Registration & Renewal Team Services USA Swimming University Online Meet Entry (OME) Job Board Health Coverage Financial Advising BACK Officials Popular Resources Officials Tracking System National Certification & Evaluation National Meet Applications Rules & Policies Online Testing Recognition & Incentive Programs Officials Documents Open Water Officials Getting Started USA Swimming University How to Become an Official LSC Officials Chairs BACK Safe Sport Club Tool Kit Report a Concern Complete a Background Check Safe Sport Club Recognition Minor Athlete Abuse Prevention Policy Athlete Protection Training Individuals Suspended or Ineligible BACK Meet the Team National Team National Jr. Team Rosters National Team Alumni Athlete Videos 2024 Olympic Team BACK About Organization Overview Leadership Team Board of Directors Staff Directory Contact Us Careers Governance Board Governance Bylaws Rules & Policies Committees Board Meeting Minutes Financials USA Swimming Annual Summit LSC Resources LSC Services LSC Websites LSC Governance LSC Treasurer Operational Risk Resources Media Information Marketing Partners Marketing Resources Insurance Online Member Registration SWIMS Database Newsletter Archive Stakeholder Engagement BACK Foundation Dive In Find A Team & Lessons Join USA Swimming Today Find a Team or Learn to Swim Welcome to the new Find A Team! Here you can find one of 2,800+ USA Swimming clubs and hundreds of Learn to Swim programs to join the competitive side of the sport (indicated by blue pins on the map). Contact these programs directly to learn about the many options about how to join USA Swimming and enjoy swimming at any level! For more information on this map, please click here Finder Type USA Swimming Club Learn To Swim Club Excellence Level None Bronze Silver Gold Safe Sport Recognized Yes No FILTER HIDE FILTERS SWIM LESSON PROVIDER NETWORK To distinguish these providers, we designate them as part of USA Swimming’s Swim Lesson Provider Network, as these swim lesson providers go above and beyond to provide a safe environment and facility by using trained and certified instructors and\n        lifeguards, low student to teacher ratios, and proven techniques and curricula to ensure a quality learning experience for every child. The benefits of being a part of USA Swimming’s Swim Lesson Provider Network are endless! Swim Lesson Providers are connected to local Water Safety Coalition networks and supporting organizations, and provided access to discounted or free materials\n            and resources to use when hosting water safety events. Additionally, the USA Swimming Foundation has an annual grant fund for learn-to-swim providers who offer services to children who, otherwise, would not have the opportunity to participate\n            swimming lessons. Are you providing youth learn-to-swim services and interested in joining our network of  Swim Lesson Providers? To learn more about the program check out our Swim Lesson Provider Network Requirements. READY TO JOIN OUR NETWORK Are you providing youth learn-to-swim services and interested in joining our network of Swim Lesson Providers? Questions? Contact us via email . Our Community Swimmers Coaches Officials Team Leaders Resources SafeSport Club Portal Find a Team Find Swim Lessons Diversity, Equity & Inclusion Rules & Policies About Overview Board of Directors Careers Contact The Foundation About the Foundation Support the Foundation Ambassadors News & Events Follow DONATE © Copyright 2025 USA Swimming. All Rights Reserved. Privacy Policy Terms of Use Personal Data Request Form"
    },
    {
      "url": "https://www.everythingbrevard.com/blog/082702-new-owners-to-upgrade-preserve-heidis-jazz-club",
      "text": "New Owners to Upgrade, Preserve Heidi’s Jazz Club - Brevard County Florida Business Directory Website Blog Articles - Everythingbrevard.com Women's Event - Unwrap the BEST You October 3-5, 2025 Tickets on Sale Now About Us Advertise Contact Member Login Home Business Directory Local Stories Events Local Resources Emergency Resources & Hotlines Hospitals Local Guides Non-Profits Places of Worship Schools Sheriff - Police - Fire - Ambulance Shopping Transportation Universities Utilities Home Business Directory Local Stories Events Local Resources Emergency Resources & Hotlines Hospitals Local Guides Non-Profits Places of Worship Schools Sheriff - Police - Fire - Ambulance Shopping Transportation Universities Utilities Home Blog New Owners to Upgrade, Preserve Heidi’s Jazz Club Posted in Eats by EverythingBrevard.com Print New Owners to Upgrade, Preserve Heidi’s Jazz Club For over 30 years, Heidi’s Jazz Club has been the No. 1 destination for Brevard County residents to enjoy live music alongside a memorable meal. Husband and wife team Eddie and Heidi Deleuil opened the club in 1992 and ran it successfully together until Heidi died in January 2020 after battling cancer. Eddie kept the club running for a while before deciding to sell. That’s when longtime patron Ori Tal decided to buy the landmark club and keep Heidi’s memory alive. Tal, CEO and owner of ESO Equity Group, discovered Heidi’s in 2008. Back then, he looked forward to evenings spent enjoying delicious meals and listening to live music after a long day at work. When he heard Deleuil planned to sell, he was intrigued by all the club had to offer. “I am not in the restaurant business, but I am in real estate,” Tal said. “So when I decided to take it, I called my friend Rani Marom, who owns a couple of clubs in New York, and said, ‘I don’t understand food and beverage and clubs too much, but you do. Why don’t you join me and be 50% of the club and we will run it together?’ He agreed and the rest is history.” Today, the two friends, who first met in their homeland of Israel, are working together to preserve Heidi’s legacy while building a bigger, better club for the future. They have made significant improvements to the “backline,” adding better sound equipment, lighting, and instruments. Marom’s NYC connections are helping bring more nationally known acts to Heidi’s stage. “We didn’t want to make any drastic changes,” Marom said. “We wanted to preserve the feel of the club. We wanted it to be new, but have the vintage feeling of a New York City jazz bar from the ‘30s or ‘40s.” Tal and Marom have big plans for the future of the club, including an expansion this fall that will bring the number of seats up from 100 to 150 or 175. They will continue to recruit top talent and hope to draw more local patrons alongside visitors. Next to the jazz club sits Heidi’s sister restaurant, Heidelberg, where diners can enjoy European cuisine in a quieter setting with nightly live piano music. The same menu is served in both locations, and everything is prepared from scratch. “Heidelberg’s menu has everything from steak, chops, fish, gazpacho, tartare… really high-end,” Marom said. “We make everything ourselves, the lobster bisque, the dressing for the salads. The menu is European influenced — a bit German, Hungarian — but with an American twist, of course.” You can say I am biased,” added Tal, “but I don’t see another place that gives the same experience in this area. No one has our shows, our atmosphere, our quality of food all together.” “It is good for ages 18 to 80,” Marom said. “That’s why I am in the live music business… everyone feels like they belong.” Heidi’s Jazz Club heidisjazzclub.com 321-783-4559 7 N. Orlando Ave. Cocoa Beach, FL 32931 contact@heidisjazzclub.com Facebook: /HeidisJazzClub Instagram : @heidisjazzclub × Member Login * Email Address * Password Forgot Password? Click to Reset Password Posted By EverythingBrevard.com View Listing × Map View Cancel Share This Page Share About Us Advertise With Us About/Contact Privacy Policy Terms of Use Our Site Home Events Stories Local Guides Business Directory Pick Up a Magazine Get Our Monthly Newsletter Post an Event × Member Login * Email Address * Password Forgot Password? Click to Reset Password"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/cocoa-beach/attractions/heidis-jazz-club/",
      "text": "Heidi's Jazz Club & Restaurant - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Heidi’s Jazz Club & Restaurant Add to Wishlist Heidi's Jazz Club & Restaurant For a place that let’s you kill two birds with one stone, this is your spot. Not only do you get good food, your ears will be tickled with smooth Jazz sounds. Heidi’s Jazz Club is a hangout for jazz lovers and musicians alike. Live music is played Wednesday through Sunday, with featured performances on selected Friday and Saturday evenings, and ‘Heidi’s Open Jam Session’ every Sunday evening. Add to Trip Visit Website Direction 7 N Orlando Ave, Cocoa Beach, FL 32931 Contact (321) 783-4559 Discover More nearCocoa Beach All Hotels Restaurants Events Add to Wishlist Juice N Java Cafe Cocoa Beach Sip into the season with a specialty coffee from Juice N Java Cafe. Add to Trip Add to Wishlist Coastal Market Cocoa Beach Cocoa Beach Fresh • Local • Coastal At Coastal Market, you’ll find everything from handcrafted deli sandwiches and fresh-baked pastries to fresh produce, premium meats, and specialty groceries. We even cater your gatherings with custom trays and menus. Stop by and taste why we’re Cocoa Beach’s favorite neighborhood market! Enjoy  1/2 Sandwich,… Add to Trip Add to Wishlist Fuji Yama THAI and sushi Cocoa Beach Lunch special starting at $12.95, name this ad get Asahi beer for only 5 bucks! Add to Trip Add to Wishlist Boardroom Cocoa Beach Located just steps away from main street, where you can enjoy our casual but trendy atmosphere. We offer the largest selection of boutique wines at the beach by both the glass and bottle; as well as craft, classics & local beer, seltzer and a variety of other beverages like house… Add to Trip Add to Wishlist 2georges oceanside bar & grill Cocoa Beach Enjoy a glass of house wine on us with any dinner purchase! Just minutes from the Cocoa Beach Pier and world-famous Ron Jon Surf Shop, 2georges oceanside bar & grill is a local favorite for fresh seafood, especially known for our world famous jumbo lump crab cakes. We also have… Add to Trip Add to Wishlist Cape Grill and Bar Cocoa Beach Come visit Cape Grill and Bar, the hidden jewel of Cape Canaveral, to try our made-from-scratch Prix Fixe lunch or dinner offerings! We are open to the public inside the Holiday Inn Club Vacations Resort. Both menus feature appetizers of house-made Crab Rangoon Flautas or Mozzarella Sticks, along with a… Add to Trip Add to Wishlist Rebellion Beachside Bar and Bistro Cocoa Beach Enjoy a revolving 4-course prix fixe menu for $45! We are excited to change up this menu as fresh, local ingredients become available! Here’s a sample of what may be available for your reservation! 1st Course: Crudo 2nd Course: Oyster Stew 3rd Course: Roasted Chicken with Mushrooms and Truffles OR… Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist Shark Tank Cocoa Beach Vacation Rentals Cocoa Beach Come to Shark Tank Vacation Rentals, your exclusive getaway just steps from downtown Cocoa Beach and the pristine shores of Florida’s Space Coast. Each unit in our newly renovated quadplex features two bedrooms, a bathroom, and a stylish blend of seaside charm and contemporary elegance. Spend your days surfing, relaxing… Add to Trip Add to Wishlist Space Coast Sights LLC Cocoa Beach Our family owned small business offers excursions that highlight Natural Florida (including hike options), a historic village with a waterfront park, and famous landmarks on sandy beaches. Visit coastal communities of Cocoa, Merritt Island, Cocoa Beach, and Cape Canaveral where dining, entertainment, wildlife, education, and relaxation await. Our sightseeing destinations… Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Cocoa Beach Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Kabob-a-licious Cocoa Beach Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a… Add to Trip Add to Wishlist Central Florida Kayaking Inc. Cocoa Beach Central Florida Kayaking offers guided kayak tours throughout Brevard County, including Merritt Island, Cocoa Beach, Melbourne, and other locations near Orlando. Kayaking tours explore the beauty of The Thousand Islands, mangrove tunnels, and the Indian River Lagoon. If you would like to see dolphins, manatees, and wild birds, or experience… Add to Trip Add to Wishlist Skull & Books VR Cocoa Beach Discover the Space Coast’s most unique adventure! Skull & Books VR combines the magic of a cozy used bookstore with the excitement of a cutting-edge VR arcade—all in one unforgettable destination. Whether you’re solving mysteries in an immersive VR escape room, battling alongside friends in multiplayer games, or just picking… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Phone This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://www.heidisjazzclub.com/calendar",
      "text": "Event Calendar | Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS Event Calendar BACK TO EVENT PAGE Follow @heidisjazzclub to get exclusive details on upcoming events. Join Our Weekly Newsletter Email SUBSCRIBE Thanks for subscribing! follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    },
    {
      "url": "https://www.heidisjazzclub.com/about-us",
      "text": "About Us | Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS About Us. Heidi's Jazz Club and Restaurant is a beloved establishment nestled in the heart of Cocoa Beach, Florida, known for its vibrant atmosphere, delectable cuisine, and outstanding live jazz performances. Since its inception, Heidi's has been a cherished hub for music enthusiasts and food connoisseurs alike, offering a unique blend of entertainment and culinary excellence. ​ Founded with a passion for jazz and a commitment to providing an unforgettable experience, Heidi's Jazz Club has become a cultural landmark in the Cocoa Beach area. The club boasts a warm and inviting ambiance, with dimmed lights, cozy seating, and an intimate setting that sets the stage for an exceptional night of music and dining. ​ Heidi's Restaurant is known for its delectable culinary offerings. The restaurant features continental European classics, as well as desserts that showcase traditional recipes. We serve classic cocktails and a wide selection of old world and new world wines. ​ Heidi's Jazz Club and Restaurant is not merely a venue; it's a haven for those seeking an escape into the world of jazz, fine dining, and camaraderie. With its commitment to excellence in both music and cuisine, Heidi's has become a cherished destination, drawing patrons from Cocoa Beach and beyond to savor the magic that unfolds within its walls. Whether you're looking for a memorable night out, a celebration, or simply a place to unwind, Heidi's Restaurant & Jazz Club invites you to join them for an unforgettable experience where music and fine dining converge in perfect harmony. PRIVATE EVENTS It's always a good time at Heidi's. Book your next private party with us. follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    },
    {
      "url": "https://www.heidisjazzclub.com/",
      "text": "Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS RESTAURANT If you wish to explore our fine dining restaurant with nightly live piano or make reservations, please click button below. RESTAURANT JAZZ CLUB Please click the button below to see our upcoming shows and purchase tickets for the Jazz Club (full menu available). JAZZ CLUB An elevated experience. Located in the heart of Cocoa Beach, Heidi's is a place that fosters late-night conversations, moments over a shared meal, and the chance to meet new friends and colleagues within a warm and welcoming environment. The space offers two distinct experiences: The Jazz Club and the Restaurant . Restaurant Since 1992. Separate from the jazz club, but located under the same roof, Heidi's Restaurant has become a staple and Cocoa Beach icon. Offering continental European classics, as well as desserts that showcase traditional recipes. We serve classic cocktails and a wide selection of old world and new world wines. ABOUT US FREQUENTLY ASKED QUESTIONS Memorable Dining With an elegant ambiance, the Heidi's Fine Dining Restaurant offers continental European classics, as well as desserts that showcase traditional recipes. We serve classic cocktails and a wide selection of old world and new world wines. Experience our classic dishes with a twist for lunch, dinner or Sunday brunch with the girls! view the menus There's always something special going on at Heidi's Fine Dining Restaurant in Cocoa Beach, FL. Click below to see our current specials. See our specials JOIN HERE Check out our new loyalty program today! \"Everything we ordered was good! Great food and ambience. Escargot, carpaccio, grilled fish were great but the desserts literally took the cake. Loved the almond and chocolate torte. Apple strudel was crispy too. We loved it so much that we went to eat here on both days of our stay. The music is extraordinary.\" - Shewta \"We were very pleasantly surprised. The food was delicious and very well prepared. Service was fantastic, and there was live piano with hands-down, the best piano player I have ever experienced at a restaurant.\" -Joy \"Great for a beautiful and quiet romantic dinner! Food & service has always been stellar & we love the live piano. From the Four Seasons salad, filet, escargot, traditional German cuisine offerings, desserts & drinks it is my favorite restaurant in Brevard!\" - Alexander Reservations. Join us inside, or out on the patio, for the finest German Cuisine on the Space Coast and relax with our nightly piano playing. Reservations are available online via the link below or call us directly: 321-783-6806 RESERVATIONS **Please note that if you purchase tickets for LIVE music on Eventbrite.com, you do not need to make reservations through OpenTable, as the Jazz Club serves dinner. To view upcoming Jazz Club events please click here. follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday ,Thursday & Friday 3:00pm - 10:00pm Saturday 11:00am - 10:00pm Sunday 3:00pm - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    },
    {
      "url": "https://www.jazzandheritage.org/about-us/staff/",
      "text": "Staff - The New Orleans Jazz & Heritage Festival and Foundation, Inc. Search for: Search Jazz Fest Heritage School of Music Jazz & Heritage Archive WWOZ The Wein Center Join Mailing List About Us Our History Impact Report Mission Board People News Contact Us We Teach Heritage School of Music Vocal Workshops HSM Beginners Pro-Audio Workshops Jazz & Heritage Archive Allison Miner Series Tom Dent Congo Square Lecture We Build Community Partnership Grants Discretionary Grants Community Outreach Ticket Program Sync Up 2025 Catapult Fund We Celebrate Concerts New Orleans Jazz & Heritage Festival Jazz Fest Gala Crescent City Blues & BBQ Festival Tremé Creole Gumbo Festival Congo Square Rhythms Festival Louisiana Cajun-Zydeco Festival Johnny Jackson Jr. Gospel is Alive! Class Got Brass Gallery Exhibits Events Get Involved Donations Jazz & Heritage Circle Sponsorship Opportunities Volunteer & Internship Opportunities Career Opportunities Donate Menu Jazz & Heritage foundation TEAM Our small yet dedicated staff members are the movers and shakers who work tirelessly to carry out the Foundation’s mission. We come from various disciplines – the arts, fundraising, business and marketing development, theatre, production, finance, audio/visual engineering, and public advocacy. We are passionate about maintaining and creating new initiatives to support Louisiana’s music community, emerging artists, and creatives. Meet our team! Blake-Anthony Johnson Chief Executive Officer Sarita Carriere Director of Finance and Human Resources Derek Douget Director of Music Education at the Heritage School of Music Jason Doyle Director of Production, Technology, & Facilities Mariah C. Forde Assistant Marketing Director Herman Francis Custodian Robert Francis Senior Custodian Andrea Garcés Heritage School of Music Administrator Khalid Hafiz Production and Facilities Manager Laura Keller Digital Collections Manager Jenna Lloyd Archive Photography Technician Rachel Lyons Archive & Cultural Heritage Director Tara Melvin Administrative Associate Elizabeth Ramoni Grants & Programs Administrator Jarrod Remetich Accountant Kia Robinson Hatfield Director of Programs, Marketing, and Communications Shanna Stowe Fundraising and Development Associate Raquel Tejeda Executive Assistant to the CEO & Board Liaison Zachary Thierry Accounts Payable Specialist Kendra Thompson A/V Digital Media Technician Cole Williams Manager of Community Partnerships & Arts Advocacy Keep In Touch Keep up-to-date on all the news and events from the Jazz & Heritage Foundation. GET UPDATES Connect With Us Follow us on social media for fresh updates and live content. Locale New Orleans Jazz & Heritage Foundation 1205 N. Rampart Street New Orleans, LA 70116 (504) 558-6100 Contact Us Privacy Policy Brand & Trademark Guidelines Disclaimer To Report Fraud, Waste, and Abuse Sitemap 2022 IRS Form 990 All contents © 2009–2025 by The New Orleans Jazz & Heritage Festival and Foundation, Inc. All Rights Reserved. Site handcrafted with love by Deep Fried . Please ensure Javascript is enabled for purposes of website accessibility We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://www.jazzpharma.com/about/leadership",
      "text": "Leadership | Jazz Pharmaceuticals This site is intended for a global audience Contact Us About Leadership Board of Directors Global Footprint History Corporate Values Corporate Development Partnering Contact Pioneering Pathways Medicines Our Medicines Drug Safety Medical Information US Medical Information Outside of the US Manufacturing Science Pipeline Clinical Trials Non-Interventional Studies Expanded Access Independent Scientific Research Clinical Trial Data Sharing Plain Language Summary Our Purpose Patient Support Corporate Giving Patient Resources Corporate Sustainability and Social Impact Ethical Standards Medical Education Fellowships Transfers of Value in Europe Our Stories Science Stories Patient & Caregiver Stories Leader Perspectives News Press Release Archive Events Archive Company News Investors Events / Presentations Financials Resources Stock Information Careers Home | About Jazz > Leadership Leadership About Jazz Leadership Board of Directors Global Footprint History Corporate Values Corporate Development Partnering Contact We’re dedicated to developing life-changing medicines for people with limited or no options, so they can live their lives more fully. Executive Committee Our leadership team has a proven track record of successfully developing and commercializing therapeutics and creating programs that result in better patient care. They’ve also driven shareholder value and built Jazz Pharmaceuticals into an employer of choice. Renee Gala President and Chief Executive Officer Full Bio Liz Henderson Senior Vice President, Technical Operations Full Bio Robert Iannone, M.D., M.S.C.E. Executive Vice President, Global Head of Research and Development, Chief Medical Officer Full Bio Philip L. Johnson Executive Vice President and Chief Financial Officer Full Bio Heidi Manna Executive Vice President and Chief People Officer Full Bio John Miller Senior Vice President, Corporate Strategy Full Bio Neena M. Patil Executive Vice President and Chief Legal Officer Full Bio Samantha Pearce Executive Vice President, Chief Commercial Officer Full Bio Renee Gala / President and Chief Executive Officer Ms. Gala was appointed president and chief executive officer, effective August 2025. She brings more than 30 years of experience across finance, strategy, corporate development and commercialization. Ms. Gala previously served as Jazz’s president and chief operating officer overseeing the company’s global business operations, which include commercial, medical, research and development, technical operations and quality, as well as corporate strategy. Ms. Gala previously served as Jazz’s chief financial officer from 2020 until being appointed as president and chief operating officer in 2023. Ms. Gala has played a critical role in driving Jazz's ongoing transformation, including architecting a business development strategy that has diversified the Company's portfolio, driven total revenue growth of nearly 90%, built broad capabilities, and established a pipeline that has positioned the Company for value creation and sustainable growth. Ms. Gala is a passionate proponent of improving diversity of thought and background, innovation and inclusion within the healthcare industry. Experience and Education Prior to joining Jazz in 2020, Ms. Gala served as the chief financial officer of GRAIL Inc., a healthcare company focused on early cancer detection. From 2014 to 2019, she served as senior vice president and chief financial officer of Theravance Biopharma, Inc., a biopharmaceutical company, following its spin-out from Theravance, Inc. (now INVA). Ms. Gala joined Theravance in 2006 and held various roles in the finance organization before leading the company’s spin-out transaction. Prior to that, Ms. Gala served in various roles in global treasury, pharmaceutical sales and corporate strategy/business development at Eli Lilly and Company from 2001 to 2006. Before joining Eli Lilly, Ms. Gala spent seven years in the energy industry in positions focused on corporate finance, project finance, and mergers and acquisitions. Ms. Gala currently serves on the board of Dexcom and has previously served on the board of multiple biotech companies, including Gossamer Bio, Gyroscope Therapeutics (acquired by Novartis) and Corcept Therapeutics. Ms. Gala holds a B.S. in Mathematics from Vanderbilt University and an M.B.A. from Columbia Business School. Liz Henderson / Senior Vice President, Technical Operations Liz Henderson was appointed senior vice president, Technical Operations in August 2023. Ms. Henderson has extensive experience in commercial leadership roles at the regional and global level in technical operations, global manufacturing and supply chain management. Throughout her career, she’s demonstrated a strong passion for helping patients across the world through advancements in technology. Experience and Education Prior to joining Jazz, Ms. Henderson held various roles of increasing responsibility at Merck KGaA including executive vice president of Global Manufacturing & Supply Chain, senior vice president APAC Region & Healthcare Sustainability lead and managing director and general manager, UK & Republic of Ireland. Prior to her tenure at Merck KGaA, Ms. Henderson held manufacturing leadership roles at Amgen and Pfizer. Ms. Henderson received a Bachelor of Science degree in Analytical Chemistry from Dublin City University, Ireland. Robert Iannone, M.D., M.S.C.E. / Executive Vice President, Global Head of Research and Development, Chief Medical Officer Robert Iannone has been Jazz’s executive vice president and global head of research and development since May 2019. Dr. Iannone oversees all aspects of preclinical research and clinical development, clinical operations and regulatory affairs. Dr. Iannone brings more than 18 years of experience in clinical drug development, having worked across therapeutic areas and phases of development, most recently on immuno-oncology programs at Merck, AstraZeneca and Immunomedics. Experience and Education From April 2018 until May 2019, Dr. Iannone served as head of research and development and chief medical officer of Immunomedics, Inc., a biopharmaceutical company. Prior to that, from July 2014 to April 2018, Dr. Iannone served in the roles of senior vice president and head of immuno-oncology, global medicines development and the global products vice president at AstraZeneca plc, a global science-led biopharmaceutical company. From 2004 to 2014, Dr. Iannone served in management roles at Merck Co., Inc., a global biopharmaceutical company, culminating in his role as executive director and section head of oncology clinical development. From 2001 to 2004, he served as assistant professor of pediatrics and from 2004 to 2012 as adjunct assistant professor of pediatrics at the University of Pennsylvania School of Medicine. Dr. Iannone served on the board of directors of Jounce Therapeutics, Inc., a clinical-stage immune-oncology company, from January 2020 – May 2023.  In June 2023, he was appointed as a Non-Executive Director to Autolus Therapeutics’ Board of Directors, a clinical-stage biopharmaceutical company. Dr. Iannone has also served on the Cancer Steering Committee of the Biomarkers Consortium/Foundation for the National Institutes of Health since 2011 and is currently on the executive committee of the Biomarkers Consortium.  From May 2021 to August 2025, Dr. Iannone was a member of the Board of Directors of  iTeos Therapeutics, a clinical-stage immune-oncology.  Dr. Iannone received a B.S. from The Catholic University of America with Summa Cum Laude honors, an M.D. from Yale University with Alpha Omega Alpha distinction, and an M.S.C.E. from University of Pennsylvania. He completed his residency and chief residency in pediatrics and a fellowship in pediatric hematology-oncology at Johns Hopkins University. Philip L. Johnson / Executive Vice President and Chief Financial Officer Mr. Johnson was appointed chief financial officer in March 2024. Mr. Johnson brings extensive experience in global financial leadership roles within the pharmaceutical industry, as a management consultant, and as an investment banker in the U.S. and Europe. Throughout his career, he’s taken on finance roles of increasing responsibility while gaining experience around the world including in Japan, Latin America, Spain, Italy and the U.S. Mr. Johnson is also committed to community and social impact efforts and serves on a variety of community boards of directors. Experience and Education From January 2018 to February 2024, Mr. Johnson served as group vice president and treasurer of Eli Lilly and Company. Joining Eli Lilly and Company in 1995, Mr. Johnson served in a variety of roles, increasing in responsibility, culminating in his role as group vice president and treasurer. Prior to his career at Lilly, Mr. Johnson served as a management consultant for McKinsey & Co. and worked with investment banks in Milan, Italy and Chicago, Illinois. Mr. Johnson received a B.S from the University of Illinois and a Master of Management from the Kellogg School of Management at Northwestern University. Heidi Manna / Executive Vice President and Chief People Officer Heidi Manna has been Jazz’s chief people officer since 2018 and oversees the human resources and internal communication functions for the Company. With more than 25 years of experience in human capital management across multiple industries including pharmaceuticals, consumer products, food and beverage and management consulting, she has developed expertise in HR strategy, talent management, culture development, organizational effectiveness, and change management. Ms. Manna is a purpose-driven strategist passionate about helping companies develop human capital and organizational development strategies to unlock the potential of people. Experience and Education Prior to joining Jazz, from 2010 until 2018, she served as vice president of human resources at Campbell Soup Company, a global food company. While there, Ms. Manna held a variety of senior leadership positions in human resources across talent management, organizational development, workforce planning, and culture development to shape the human capital strategies for the business. She also led the transformation of the HR operating model to better serve the business. From 1996 to 2010, Ms. Manna held various leadership roles at Bristol-Myers Squibb, a global biopharmaceutical company, across a wide spectrum of the human resource function, including HR business partnership, talent management, operations and compensation. She started her career at Andersen Consulting (Accenture). Ms. Manna currently serves on the Employer Advisory Board for the University of Pennsylvania, and previously served on the board of directors for Seven Oaks Acquisition Corp, a special purpose acquisition company. She received a B.S. from Binghamton University and an M.B.A. from the State University of New York at Buffalo. John Miller / Senior Vice President, Corporate Strategy John Miller was appointed to senior vice president, corporate strategy in October, 2022. He was previously senior vice president of global product strategy and program management, after serving as vice president of global product strategy. Prior to that, Mr. Miller held  various management roles within the oncology therapeutic area. He is currently responsible for leading corporate strategy and portfolio management, defining therapeutic and disease areas of interest to guide corporate development and R&D strategies and driving long-range planning. Experience and Education John Miller was appointed senior vice president of global product strategy and program management as of September 2019. From February 2015 to September 2019, he served as Jazz’s vice president of global product strategy, and from August 2012 to February 2015, he served in various management roles within the oncology therapeutic area. Prior to that, from February 2012 to August 2012, Mr. Miller was director of US and global marketing, metabolic diseases at Alexion Pharmaceuticals, and from February 2011 to February 2012, he was director of strategic marketing at Enobia Pharma. Prior to February 2011, Mr. Miller served in various product commercialization roles at Jazz Pharmaceuticals, Inc., and Genzyme Corporation. Mr. Miller received a B.S. in biochemistry from the University of Mississippi and an M.B.A. from Boston University Graduate School of Management. Neena M. Patil / Executive Vice President and Chief Legal Officer Neena M. Patil has served as Jazz’s chief legal officer since July 2019. Ms. Patil oversees all legal, corporate affairs and government relations matters for the Company. Ms. Patil also has executive responsibility for the global compliance and ethics program. Ms. Patil is recognized for her track record of execution, including in connection with strategic transactions, drug approvals and commercial launches and for her successful resolution of complex litigation, compliance investigations, and other corporate reputation matters. Ms. Patil has worked for several global biopharmaceutical companies over her career and currently serves on the board of Teleflex Inc., a global medical technology company, where she is a member of the Nominating and Corporate Governance Committee. Ms. Patil is also a member of the BIO Board of Directors and Health Section Governing Board. Experience and Education From September 2018 to July 2019, Ms. Patil served as senior vice president, general counsel and corporate secretary of Abeona Therapeutics Inc., a clinical-stage biopharmaceutical company. Prior to that, from May 2008 to October 2016, Ms. Patil served in various management positions at Novo Nordisk Inc., culminating in her role as vice president for legal affairs and associate general counsel. Prior to 2008, she worked for several other global biopharmaceutical companies including Pfizer, GPC Biotech and Sanofi. Ms. Patil received a B.A. from Georgetown University and a J.D. and Master of Health Services Administration from the University of Michigan. Samantha Pearce / Executive Vice President, Chief Commercial Officer Samantha Pearce was appointed Chief Commercial Officer in July 2024. With more than 30 years of experience in the pharmaceutical industry, Ms. Pearce has a track record of scaling commercial operations to achieve transformational growth and accelerated access to medicines across geographies. She is particularly passionate and effective at unifying teams around a singular vision and instilling a performance and enterprise mindset. Ms. Pearce previously served as Jazz’s senior vice president of Europe and International. Experience and Education From March 2010 to December 2019 prior to joining Jazz, Ms. Pearce held various global senior management positions with Celgene Corporation, most recently as vice president and general manager of international markets. Prior to that, from August 2002 to March 2010, she served in management positions at AstraZeneca plc, culminating in her role as director of specialist care. Prior to August 2002, she worked for DuPont Pharmaceuticals. Ms. Pearce received a B.Sc. from Birmingham University, U.K. and an M.B.A. from Cranfield University, UK. About Pioneering Pathways Medicines Science Our Purpose Our Stories News Careers Investors © 2025 Jazz Pharmaceuticals, Inc. All Rights Reserved. This site is intended for a global audience Privacy Statement U.S. Consumer Health Data Privacy Policy Terms of Use Social Media Global Guidelines Cookie Policy Sitemap Thank you for contacting Jazz Pharmaceuticals Corporate Development & Partnering Error sending email. Please contact site administration Contact Corporate Development / Partnering Personal Information (All fields are required) Please provide details on this opportunity Full Name: Title: Organization: Address Line 1: Address Line 2: City: State: - Select - NO STATE ALABAMA ALASKA AMERICAN SAMOA ARIZONA ARKANSAS CALIFORNIA COLORADO CONNECTICUT DELAWARE DISTRICT OF COLUMBIA FEDERATED STATES OF MICRONESIA FLORIDA GEORGIA GUAM GU HAWAII IDAHO ILLINOIS INDIANA IOWA KANSAS KENTUCKY LOUISIANA MAINE MARSHALL ISLANDS MARYLAND MASSACHUSETTS MICHIGAN MINNESOTA MISSISSIPPI MISSOURI MONTANA NEBRASKA NEVADA NEW HAMPSHIRE NEW JERSEY NEW MEXICO NEW YORK NORTH CAROLINA NORTH DAKOTA NORTHERN MARIANA ISLANDS OHIO OKLAHOMA OREGON PALAU PENNSYLVANIA PUERTO RICO RHODE ISLAND SOUTH CAROLINA SOUTH DAKOTA TENNESSEE TEXAS UTAH VERMONT VIRGIN ISLANDS VIRGINIA WASHINGTON WEST VIRGINIA WISCONSIN WYOMING ARMED FORCES AFRICA \\ CANADA \\ EUROPE \\ MIDDLE EAST ARMED FORCES AMERICA (EXCEPT CANADA) ARMED FORCES PACIFIC Zip Code: Country: Phone Number: Email Address: First Name: Therapeutic Area: Indication: Mechanism of Action: Highest Development Phase: Overview of Opportunity including non-confidential information supporting the rationale for the molecular target, proof-of-concept for a particular technology and other relevant details. ATTENZIONE: La richiesta di informazioni di carattere medico – scientifico è riservata ai\n        SOLI professionisti sanitari (medici, farmacisti ospedalieri).\n        Con la compilazione dei dati professionali nella finestra che apparirà premendo\n        il bottone sottostate l’Utente dichiara di essere un professionista sanitario e\n        si impegna a fornire dati completi e veritieri. Ho letto e capito l’avviso sopra contenuto Grazie per aver contattato Jazz Pharmaceuticals Corporate Development & Partnering Errore nell'invio dell'e-mail. Si prega di contattare l'amministrazione del sito Nome Cognome Nome Ospedale Indirizzo Specializz. N° Ordine Ord. Prov. E-mail N. Telefono Medico Farmacista Ospedaliero Prodotto per il quale si richiede il contatto: Vyxeos Defitelio Sunosi Motivo richiesta contatto (opzionale) : Ricezione Informazione medico scientifica Privacy Request Form Thank you! We'll get back to you shortly. Error sending email. Please contact site administration This page is intended for U.S. residents only. We are not accepting requests from individuals in states other than California, Washington and Nevada. If you are not a resident of any of these states, please do NOT continue. Please select and enter the required fields on the form below.  We need this information to process your request and to take necessary steps to verify your identity. We will contact you if we need any additional information. Please note that your rights may vary under applicable state privacy laws and may be subject to limitations. I am making this request for myself or on behalf of someone else * Myself On behalf of someone else Select request type * Access Data Correct Data Deletion request Limit the use of my sensitive personal information Revoke consent What is your relationship with Jazz Pharmaceuticals? * Patient/Consumer Health Care Professional Contractor/Consultant Job Applicant Former Employee Other: Please describe below Select Jazz Pharmaceuticals Product(s) * Epidiolex® (cannabidiol) Xyrem® (sodium oxybate) Xywav™ (calcium, magnesium, potassium and sodium oxybates) Defitelio® (defibrotide sodium) Rylaze™ (asparaginase erwinia chrysanthemi (recombinant)-rywn) Vyxeos® (daunorubicin and cytarabine) Zepzelca™ (lurbinectedin) First Name * Last Name * Date of Birth – (MM/DD/YYYY) * Email address * Please use the email address you have previously provided to Jazz Pharmaceuticals Telephone Number * Fax number * Address * City * State * ZIP * Country * Jazz Pharmaceuticals, Inc. 3170 Porter Dr., Palo Alto, California 94304 https://www.jazzpharma.com/privacy-statement/ For further information please contact Jazz Pharmaceuticals’ Privacy  Office at privacy@jazzpharma.com The information on this page is intended for visitors in Continue You are leaving the page Leave You are leaving the PAGETITLE HERE page Leave Thank you for visiting JazzPharma.com. The site you are about to visit is maintained\n        by a third party who is solely responsible for its content; Jazz Pharmaceuticals is not responsible for\n        the content or privacy practices of any third-party websites. Click Cancel to return or OK to\n        continue. Ok Cancel You are now leaving www.JazzPharma.com. Thank you for visiting. The information on\n      the website you are entering is intended for visitors in the United States only. Ok Cancel Continue"
    },
    {
      "url": "https://www.heidisjazzclub.com/reservations",
      "text": "Reservations | Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS Restaurant Reservations Separate from the Jazz Club, but located under the same roof is the coziest restaurant on the Space Coast. Join us inside or out on the patio for the finest German Cuisine and relaxing nightly piano playing. Reservations are available via Open Table form below or call us directly: 321-783-6806 ​ **​ Please note that if you purchase tickets for LIVE music on Eventbrite.com, you do NOT need to make reservations through OpenTable, as the Jazz Club serves dinner. To check out the upcoming events at the Jazz Club, click here. Hosting a Private Party? Hosting a corporate event, engagement or special birthday party? We'd love to host it for you. Contact us to get started planning a one-of-a-kind event at Heidi's. Private Party Inquiry First name Last name Email Phone Select a date Any other information/specifics? SUBMIT We'll be in touch soon! follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    },
    {
      "url": "https://www.heidisjazzclub.com/jazzclub",
      "text": "Events and Live Music | Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS Elevated Dining with a Welcoming Atmosphere Heidi's Jazz Club has been the number one hangout for jazz lovers and jazz musicians on Florida's Space Coast since Heidi and Eddie opened the club in 1992. We feature a n elevated dining experience with cocktails, live music, and continental European cuisine. View our dinner menu here. Live music every Wednesday through Sunday with featured performers on selected Friday and Saturday evenings and Heidi's Open Jam Session every Sunday evening. See you at Heidi's! UPCOMING EVENTS CALENDAR VIEW Join Our Weekly Newsletter Email SUBSCRIBE Thanks for subscribing! Hosting a Private Party? Hosting a corporate event, engagement or special birthday party? We'd love to host it for you. Contact us to get started planning a one-of-a-kind event at Heidi's. Private Party Inquiry First name Last name Email Phone Select a date Any other information/specifics? SUBMIT We'll be in touch soon! follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    },
    {
      "url": "https://www.heidisjazzclub.com/contact",
      "text": "Contact | Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS Contact. 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 Contact Form First name Last name Email Phone Subject Any other information/specifics? SUBMIT We'll be in touch soon! PRIVATE EVENTS It's always a good time at Heidi's. Book your next private party with us. Frequently Asked Questions. Q: If I have live event tickets, do I need to make dinner reservations? A: No, additional dinner reservations are not needed with live event tickets. The full dinner menu is available in the Jazz Club. ​ Q: Is there a dress code? A: Yes, casual fine dining dress code enforced. For men - collared shirts, dress pants, dress shoes and/or and optional sports coat or blazer. For women - dress shirts/blouses, d ress pants, skirts, or dresses and dress shoes or elegant sandals. Please, no beach wear. ​ Q: Can we watch the jazz show from restaurant? A: While the jazz club and the restaurant are under the same roof, they are two different areas of the establishment. The restaurant features live piano music nightly. While the jazz club has free and ticketed events weekly. ​ ​ Have a question that is not listed here? Contact us and we will do our best to answer you as quickly as possible. CONTACT US follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    },
    {
      "url": "https://heidisjazzclub.com/home",
      "text": "Events and Live Music | Heidi's Jazz Club & Restaurant | Cocoa Beach top of page HOME MENU BRUNCH LUNCH DINNER SPECIALS JAZZ CLUB EVENTS GIFT CARDS More... Use tab to navigate through the menu items. RESERVATIONS Elevated Dining with a Welcoming Atmosphere Heidi's Jazz Club has been the number one hangout for jazz lovers and jazz musicians on Florida's Space Coast since Heidi and Eddie opened the club in 1992. We feature a n elevated dining experience with cocktails, live music, and continental European cuisine. View our dinner menu here. Live music every Wednesday through Sunday with featured performers on selected Friday and Saturday evenings and Heidi's Open Jam Session every Sunday evening. See you at Heidi's! UPCOMING EVENTS CALENDAR VIEW Join Our Weekly Newsletter Email SUBSCRIBE Thanks for subscribing! Hosting a Private Party? Hosting a corporate event, engagement or special birthday party? We'd love to host it for you. Contact us to get started planning a one-of-a-kind event at Heidi's. Private Party Inquiry First name Last name Email Phone Select a date Any other information/specifics? SUBMIT We'll be in touch soon! follow us @heidisfinedining Subscribe to get exclusive updates Email SUBSCRIBE Thanks for subscribing! NAVIGATE Home Restaurant Menus Private Events Jazz Club Gift Cards FAQs Contact Media & Press Releases RESTAURANT HOURS & PHONE CONTACT Wednesday & Thursday 3:00pm - 9:00pm Friday & Saturday 12:00pm - 10:00pm Sunday 11:00am - 10:00pm P: (321) 783-6806 JAZZ CLUB HOURS & PHONE CONTACT Wednesday & Thursday 4:00pm - 10:00pm Friday & Saturday 4:00pm - 11:00pm Sunday 4 :00pm - 10:00pm P: (321) 783-4559 7 N Orlando Ave, Cocoa Beach, FL 32931 E: manager@heidisjazzclub.com FOLLOW US ON SOCIAL MEDIA​ @heidisfinedining @heidisjazzclub ©2024 Heidi's Jazz Club and Restaurant - All rights reserved - Design by Ryen Creative bottom of page"
    }
  ]
}