{
  "fuentes": [
    {
      "url": "https://www.hellnblazesbrewing.com/",
      "email": "info@hellnblazesbrewing.com"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/beer",
      "email": "info@hellnblazesbrewing.com"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/building",
      "email": "info@hellnblazesbrewing.com"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/events",
      "email": "info@hellnblazesbrewing.com"
    },
    {
      "url": "https://destinationbrevard.com/local-supporters/37360/hell-n-blazes-brewing-company/",
      "email": "ryan@destinationbrevard.com"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/contact-us",
      "email": "info@hellnblazesbrewing.com"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/contact-us",
      "email": "info@hellnblazesbrewery.com"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/contact-us",
      "email": "info@hellnblazesbrewing.com"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/about-us",
      "email": "info@hellnblazesbrewing.com"
    }
  ],
  "mails": [
    "info@hellnblazesbrewery.com",
    "info@hellnblazesbrewing.com",
    "ryan@destinationbrevard.com"
  ],
  "nombre_sitio": "hellnblazesbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hellnblazesbrewing.com/",
      "text": "Hell 'n Blazes Brewing Company | Craft Beer and Gastropub | Melbourne, FL top of page HOME BREWERY OUR BEER KITCHEN OUR BUILDING EVENTS More Use tab to navigate through the menu items. CONTACT US Creating Community through Great Craft Beer, Great Food & Great Times! Old Florida Lifestyle with the Comfort of Your Own Living Room Located in Historic Downtown Melbourne, FL, Hell 'n Blazes Brewing Company operates out of a fully renovated 120-year-old former hardware and farm supply store. Our family-and-friends microbrewery is known for brewing great craft beer, fantastic craft cocktails, and delicious Gastropub food! BEST FLORIDA BEER OUR BEER Homage to the Sunshine State in Every Bite Our Florida-inspired menu draws inspiration from the state's iconic landmarks, indigenous ingredients, and historic influences. Every dish and drink is a testament to the tapestry of flavors that have shaped Florida's culinary landscape. OUR KITCHEN Corporate Groups to Intimate Weddings, We've Got You Covered We take immense pride in offering a versatile venue and thoughtfully curated catering menus that accommodate a multitude of occasions and private gatherings. EVENTS Now Proudly Serving Liquor & Finely Crafted Cocktails Crafting cocktails at our establishment is an artistry that celebrates Florida's vibrant flavors. With a commitment to using only locally sourced ingredients and homegrown spirits, our mixologists conjure up liquid masterpieces that capture the essence of the Sunshine State. OUR COCKTAILS PATIO NOW OPEN FOLLOW US ON INSTAGRAM HELL 'N BLAZES BREWING CO. Tel: 321-821-4052 Email: info@HellnBlazesBrewing.com 1002 E New Haven Ave, Melbourne, FL 32901 Monday: 11am - 9pm Tuesday - Thursday: 11 am – 10 pm Friday & Saturday: 11 am – 11 pm Sunday: 11am - 8pm m © 2035 by Hell 'n Blazes Brewing Co. SUBSCRIBE Sign up to receive HnB news and updates. Email Subscribe Thanks for submitting! bottom of page"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/beer",
      "text": "Award Winning Craft Beer | Hell 'n Blazes | Florida Brewery top of page HOME BREWERY OUR BEER KITCHEN OUR BUILDING EVENTS More Use tab to navigate through the menu items. CONTACT US Our Beer Our team embraces the essence of tradition in brewing, utilizing the finest global ingredients, sourcing hops and malts meticulously tailored to each beer style. Our approach appeals to those who appreciate the craftsmanship and authenticity that comes with staying true to the time-honored brewing methods. 17 BEERS ON TAP 2000+ GALLONS SOLD 14 AWARDS EARNED 9 YEARS OF BREWING FIND HELL 'N BLAZES ON TAP HELL 'N BLAZES BREWING CO. Tel: 321-821-4052 Email: info@HellnBlazesBrewing.com 1002 E New Haven Ave, Melbourne, FL 32901 Monday: 11am - 9pm Tuesday - Thursday: 11 am – 10 pm Friday & Saturday: 11 am – 11 pm Sunday: 11am - 8pm m © 2035 by Hell 'n Blazes Brewing Co. SUBSCRIBE Sign up to receive HnB news and updates. Email Subscribe Thanks for submitting! bottom of page"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/building",
      "text": "Hell 'n Blazes Brewing Company | A Space Coast Historical Landmark top of page HOME BREWERY OUR BEER KITCHEN OUR BUILDING EVENTS More Use tab to navigate through the menu items. CONTACT US OUR BUILDING TAPROOM THE VAULT & GAME ROOM RENOVATION HISTORY TAPROOM TAPROOM Step into our brewery taproom, a charming Florida rustic oasis where traditional brews and comfort intertwine. With seating for many, the space offers a warm and inviting atmosphere. Sink into plush couches, catch the latest game belly up to the wrap-around bar, and savor a few of our finely crafted beers. VAULT & GAME ROOM THE VAULT & GAME ROOM Step through our real vintage vault door and back into history. What was once an 1800s bank vault is now your private social space. One door over is our expansive game room stocked with flat-screen TVs, darts, and table football. RENOVATION RENOVATION In June 2015, Don DiFrisco and his nephew and sons had a vision for this 120-year-old building to be the site of Florida's next great craft brewery. The Hell 'n Blazes team would take the next 12 months renovating the building to support a 300-capacity taproom and a 2,500 BBL/yr brewing operation. HISTORY HISTORY 1002 E New Haven Ave has a rich history. The building was originally constructed in 1898 to be a hardware store, bank, and mortuary owned by Charles Stewart and his partner Frank Fee, the then Mayor of Melbourne.  Later, the location would become a farm supply for the Melbourne community and later a consignment shop and Christmas Cottage for 30 years. HELL 'N BLAZES BREWING CO. Tel: 321-821-4052 Email: info@HellnBlazesBrewing.com 1002 E New Haven Ave, Melbourne, FL 32901 Monday: 11am - 9pm Tuesday - Thursday: 11 am – 10 pm Friday & Saturday: 11 am – 11 pm Sunday: 11am - 8pm m © 2035 by Hell 'n Blazes Brewing Co. SUBSCRIBE Sign up to receive HnB news and updates. Email Subscribe Thanks for submitting! bottom of page"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/events",
      "text": "Private Events & Weddings at Hell 'n Blazes Brewing Co. | Brevard County top of page HOME BREWERY OUR BEER KITCHEN OUR BUILDING EVENTS More Use tab to navigate through the menu items. CONTACT US PRIVATE PARTIES No two parties are the same. That's why Hell 'n Blazes offers eclectic spaces to host celebrations of various sizes. Our venue in historic downtown Melbourne has unique settings for both private and semi-private gatherings. Whether you want to celebrate a milestone, mingle with friends, connect over beers, or host a gathering with your family, Hell 'n Blazes has it all. More Details Inquire About a Party CATERING MENU CORPORATE EVENTS Forget the stuffy ballroom or just another office meeting!  Hell 'n Blazes thrives by supporting local Florida businesses interested in using the taproom for meetings, presentations, and team building. ​ Our Vault Room comfortably seats 20-30 guests with table space. The 75\" TV provides the presentation tool to engage the whole group.​ We offer the taproom during off-hours for larger groups to allow your team the workspace it needs!  Our patio is now available for private gatherings as well. More Details Inquire About an Event CATERING MENU WEDDINGS Unite your love in the Sunshine State! Escape to the enchanting world of love and craft beer at our Florida brewery wedding venue! Imagine exchanging vows surrounded by the rustic charm of our brewery, savoring craft beer brewed on-site, delighting in delectable cuisine, and dancing the night away in our spacious areas and outdoor patio. Create unforgettable memories in a setting that perfectly blends romance and relaxed vibes. More Details Inquire About a Wedding CATERING MENU HELL 'N BLAZES BREWING CO. Tel: 321-821-4052 Email: info@HellnBlazesBrewing.com 1002 E New Haven Ave, Melbourne, FL 32901 Monday: 11am - 9pm Tuesday - Thursday: 11 am – 10 pm Friday & Saturday: 11 am – 11 pm Sunday: 11am - 8pm m © 2035 by Hell 'n Blazes Brewing Co. SUBSCRIBE Sign up to receive HnB news and updates. Email Subscribe Thanks for submitting! bottom of page"
    },
    {
      "url": "https://destinationbrevard.com/local-supporters/37360/hell-n-blazes-brewing-company/",
      "text": "Hell n Blazes Brewing Company  -  Destination Brevard Local Business Directory Skip to content Facebook Instagram X YouTube Home Local Directory Dining Guide Upcoming Events Paid Promotions More Destination Brevard’s Daily Updates Movie Times in Brevard County Photo Galleries Video Gallery Today’s Weather Brevard County Libraries Calendar Cafe Mi Casa Newsletter About Us Search for: Search for: Local Directory Admin 2022-11-07T14:17:45-05:00 Hell n Blazes Brewing Company Home » Hell n Blazes Brewing Company Address: 1002 E New Haven Ave , Melbourne, Florida, United States 32901-5437 Description: Innovating a bold and unique craft brew experience for passionate and discerning lovers of fine ales and lagers. American Cuisine Breweries brewery Contact Information Phone: 3218214052 Website: Visit Our Site Facebook Page: Visit Our Facebook Email: info@hellnblazesbrewing.com Menu: Our Menu Map © Copyright 2000 - by Space Coast Event Calendar and Destination Brevard\r\n | All Rights Reserved | Powered by FrontPageSolution Page load link Go to Top"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/contact-us",
      "text": "Get In Touch with Hell 'n Blazes Brewing Co. | Melbourne, FL top of page HOME BREWERY OUR BEER KITCHEN OUR BUILDING EVENTS More Use tab to navigate through the menu items. CONTACT US LET'S CHAT Inquire About an Event PHONE EMAIL 321-821-4052 info@hellnblazesbrewing.com ADDRESS 1002 E New Haven Ave Melbourne, US-FL 32901 First Name Last Name Email Message Send Thanks for submitting! HELL 'N BLAZES BREWING CO. Tel: 321-821-4052 Email: info@HellnBlazesBrewing.com 1002 E New Haven Ave, Melbourne, FL 32901 Monday: 11am - 9pm Tuesday - Thursday: 11 am – 10 pm Friday & Saturday: 11 am – 11 pm Sunday: 11am - 8pm m © 2035 by Hell 'n Blazes Brewing Co. SUBSCRIBE Sign up to receive HnB news and updates. Email Subscribe Thanks for submitting! bottom of page"
    },
    {
      "url": "https://www.hellnblazesbrewing.com/about-us",
      "text": "About Hell 'n Blazes Brewing | Craft Beer +Restaurant | Historic Downtown Melbourne top of page HOME BREWERY OUR BEER KITCHEN OUR BUILDING EVENTS More Use tab to navigate through the menu items. CONTACT US About Us Finding Inspiration in Every Turn This is your About Page. This space is a great opportunity to give a full background on who you are, what you do and what your website has to offer. Double click on the text box to start editing your content and make sure to add all the relevant details you want site visitors to know. OUR TEAM Todd Furbeck Brewmaster Drew Campbell Head Chef Julie Cahours Front of House Manager IN THE NEWS Every website has a story, and your visitors want to hear yours. This space is a great opportunity to give a full background on who you are, what your team does, and what your site has to offer. Double click on the text box to start editing your content and make sure to add all the relevant details you want site visitors to know. If you’re a business, talk about how you started and share your professional journey. Explain your core values, your commitment to customers, and how you stand out from the crowd. Add a photo, gallery, or video for even more engagement. Our Clients HELL 'N BLAZES BREWING CO. Tel: 321-821-4052 Email: info@HellnBlazesBrewing.com 1002 E New Haven Ave, Melbourne, FL 32901 Monday: 11am - 9pm Tuesday - Thursday: 11 am – 10 pm Friday & Saturday: 11 am – 11 pm Sunday: 11am - 8pm m © 2035 by Hell 'n Blazes Brewing Co. SUBSCRIBE Sign up to receive HnB news and updates. Email Subscribe Thanks for submitting! bottom of page"
    }
  ]
}