{
  "fuentes": [
    {
      "url": "http://www.floridagolfmagazine.com/FGMwinter2017/heron-creek-arthur-hills.html",
      "email": "joestine@floridagolfmagazine.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/heron-creek-golf-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/heron-creek-golf-club/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://www.golfpactravel.com/sarasota-golf-courses/heron-creek-golf-&-country-club",
      "email": "info@teetimesusa.com"
    }
  ],
  "mails": [
    "info@naplesgolfguy.com",
    "info@teetimesusa.com",
    "joestine@floridagolfmagazine.com",
    "matt@naplesgolfguy.com"
  ],
  "nombre_sitio": "heroncreekgcc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://www.floridagolfmagazine.com/FGMwinter2017/heron-creek-arthur-hills.html",
      "text": "Heron Creek Golf & Country Club in North Port, Florida Florida Golf Magazine The Golf Magazine of America's Premier Golf State - Winter 2017 Issue Facebook YouTube Heron Creek Golf & Country Club in North Port, FL Written for Florida Golf Magazine's by Golf Course Architect, Arthur Hills Watch video in \"Full Screen\" Mode. World renowned golf course architect, Arthur Hills is seen here in front of the beautiful 21,000 square feet Clubhouse at Heron Creek Golf & Country Club. Hills designed all 27 holes of the Oaks, Marsh and Creek Nine layouts at Heron Creek Golf & Country Club. Heron Creek Golf & Country Club 5301 Heron Creek Blvd, North Port, FL 34287 941-240-5100, heroncreekgcc.com Architect: Arthur Hills, ASGCA 27 Holes, Year Opened - 1999 Heron Creek Golf & Country Club, by Arthur Hills, ASGCA Back in 1998, we designed 27 holes for Dr. Hans-Jurgen Reichardt at Heron Creek Golf & Country Club in North Port, Florida. Hans and Monika Reichardt have been the sole owners of the Club since it opened in 1999 and have done a fine job of taking care of the three 9-hole courses. Recently (in the summer of 2016), they re-grassed all 27 greens, plus four 10,000-square-foot practice greens. They have also re-grassed several fairways and rebuilt many of their bunkers. Now, all three of the nine-hole courses are in magnificent condition. Needless to say, the loyalty of the membership is beyond words. The challenging (but not intimidating) course design of the Oaks, Marsh and Creek Nines at Heron Creek includes natural beauty, sparkling water features, and elevation changes that are unique in Southwest Florida. Director of Golf Maintenance, Tom Rainey and golf course owners Hans and Monika Reichardt inspect the newly regrassed greens at Heron Creek Golf & Country Club. Of the 676 acres at Heron Creek, more than 430 acres (including the golf course) have been set aside as permanent, environmentally-protected nature preserves, creating lakes and green space for residents, as well as providing natural habitat for a wide variety of birds and other wildlife. We worked very carefully to fit the golf course and the residential areas on the land. The neighborhood homes and the golf course complement, rather than compete with the native landscape. They are bordered by natural vegetative buffers along with stands of native trees and pristine lakes--all of which serve as quiet retreats for the abundant wildlife. The three nine-hole courses at Heron Creek are distinctly different, but the third nine or âCreek Nineâ is generally regarded as the most difficult. One characteristic that is common to all three courses is that the starting and the finishing holes are very memorable. The Oaks Nine One of the premier golf practice and learning facilities on the west coast of Florida can be found at Heron Creek. Situated high above the surrounding landscape, the enormous range with tees on both endsâsome 400 yards apartâgives members the opportunity to experience varying wind conditions or take in a private lesson from one of the talented professionals on the golf staff. The short game practice area and learning center provide numerous shot options for those seeking to fine tune their games before strolling to the adjacent first tee on the Oaks Nine. 500 yards, par five, 1st Hole - Oaks Nine The 500 yard, par five, 1st Hole of the Oaks course at Heron Creek Golf & Country Club is located next to the 400 yard long Learning Center and Practice Range. The 500-yard, par-5 first hole on the Oaks Nine has significant elevation changes that are unique to southwest Florida. Itâs no wonder that it is one of the Signature holes. Off the tee, the landing area for a good drive is on an elevated plateau that terminates with a \"speed slot\" that runs downhill. Drives that are hit well enough to reach the speed slot can roll an extra 30 or 40 yards. This provides an excellent opportunity to reach the elevated green on the par 5 in two strokes. 429 yards, par four, 2nd Hole - Oaks Nine The 2nd Hole is Arthur Hillsâ favorite hole on the Oaks Nine. The second hole on the Oaks Nine is one of my favorite holes and certainly one of the membersâ favorites as well. This par four requires an exacting tee shot that finishes between two massive oak trees that appear to be literally spanning the width of the fairway. If one is fortunate enough to get safely past the two oaks, it's a beautiful second shot to a peninsula-style green with a large bunker on the left side and water on the right. This is one of the many holes at Heron Creek that has been completely re-grassed from tee to green. Many times during the day, this hole can be teeming with wildlife in the form of the great blue heron and many species of native water fowl. In addition, there is a healthy population of white-tailed deer, several families of otters that frolic around in the waters, a few bobcats, foxes and several endangered species that include gopher tortoises and scrub jays. All in all, there is a tremendous amount of wildlife to be discovered at Heron Creek! The Marsh Nine Not surprisingly, considering its name, the environmental story continues on the âMarshâ Nine. This loop has a healthy supply of natural areas and protected wetlands. Indeed, of the three nine-hole courses at Heron Creek, the Marsh Nine has the most protected wetland and marsh areas. The vistas from the back tees of the holes of the Marsh Nine are incredible. 190 Yards, Par three, 3rd Hole - Marsh Nine At 190 yards from the back tees, the third hole of the Marsh course is a favorite Signature hole that is the topic of much conversation around the bar following a round. Itâs a par three with a forced carry, requiring a well-struck shot over a beautiful natural area (environmentally-sensitive wetland) to a fairly large and accessible green. The 7-handicap rating is deceiving because this short hole requires a very good shot if the player is to find the green. The 190 yard, par three, 3rd Hole of the Marsh course is a favorite of the members at Heron Creek Golf & Country Club 394 yards, par four, 7th Hole - Marsh Nine The 394 yard, par four, #7 Marsh at Heron Creek Golf & Country Club. With its stunning vistas, standing on the 394-yard back tee of #7 Marsh is one of the treasured pleasures at Heron Creek. The par 4 has a large body of water which, from the professional tees, definitely comes into play. There are a couple families of American bald eagles that come back to Marsh #8 every year to nest and raise there young. They teach their fledglings how to catch fish in the ponds on the side of Marsh #7 and #8. 345 yards, par four, 8th Hole - Marsh Nine The 8th Hole of the Marsh Nine is a favorite of Heron Creek members. Complete with Bald Eagles and environmentally sensitive wetlands, #8 Marsh epitomizes the design vision Arthur Hills and Dr. Reichardt had for Heron Creek Golf & Country Club. #8 Marsh is truly the most memorable golf hole on the course, particularly in the late afternoon. Enjoying another gorgeous South Florida sunset while challenging a spectacular lake and wetland nearly overwhelms the senses. Not just a favorite with golfers, this is also the hole where eagle families come back every year to teach their young to fish. #8 Marsh epitomizes the design vision we had for Heron Creek. The Creek Nine The Creek Nine is the third nine at the 27-hole championship layout at Heron Creek Golf & Country Club. Home to gopher tortoise and scrub jay, the Creek course meanders through some of the developmentâs most beautiful and natural landscapes. One of the more noteworthy characteristics of this nine is that very few homes can be seen from the fairways and greens. The developer gave us enough land to properly complete the design work. We routed the three nine-hole courses through the community so that the homes never come into play. In fact, there are many holes at Heron Creek that have no homes on them whatsoever. Perhaps the most unique of the three courses at Heron Creek, the Creek Nine takes players on a journey through a variety of ânaturalâ adventures. For instance, as you drive your golf cart between the 4th and 5th holes, there is nearly a quarter mile of sandy cart path through a secluded habitat of natural oak canopy. All of the members love that experience! 506 yards, par five, 4th Hole - Creek Nine #4 Creek, the 506 yards, par 5 is rated 2nd hardest hole of the Creek Nine at Heron Creek. Placing your tee shot between the coquina shell bunker on the right and the sand bunkers on the left will leave you in position to have a go at this devilish little green in two. 414 yards, par four, 9th Hole - Creek Nine On #9 Creek, aim your tee shot just right of the monocle bunker near the pond for the best angle into the green. A high left-to-right shot is required on your 2nd shot to get it close and avoid the deceptively deep sand pits on the right. The 9th Hole on the Creek Course at Heron Creek is a great finishing hole. As the round comes to a close on the Creek Course, players drive their golf carts over a large bridge that traverses Price Boulevard. When they look ahead to the finishing hole from atop the bridge, it's a gorgeous sight. The ninth hole on the Creek Course is a great finishing hole with no homes in sight! A tranquil lake on the left off the tee is beautiful and is usually successfully negotiated by most players. However, two pot bunkers in the right rough can challenge those who are too cautious of the water off the tee. Those who do challenge the water are rewarded with a birdie opportunity following an open approach to the long axis of the putting surface. This is an exciting and gorgeous way to finish a great round and a great day at Heron Creek! - Arthur Hills, 2017 Heron Creek Golf & Country Club 5301 Heron Creek Blvd, North Port, FL 34287 941-240-5100, heroncreekgcc.com Florida Golf Magazine The Golf Magazine of America's Premier Golf State - Winter 2017 Issue Facebook YouTube Menu FGM Homepage • FGM Winter 2017 Issue FGM Winter 2017 Issue Submenu The Florida Golf Architecture of Arthur Hills Vista Plantation GC Jonathan's Landing GC Collierâs Reserve CC Heron Creek G&CC Miami Beach GC Normandy Shores GC Golf Tips By Gary Wiren Iron Man of Saint Andrews • FGM Winter 2016 Issue FGM Winter 2016 Issue Submenu Golf Course Designer Pete Dye honored with Don A. Rossi Award by the Golf Course Builders Association of America (GCBAA) Golf Tips By Gary Wiren Golfâs Ironman Gary Wiren: At 80 still drives a golfball 300 yards Developing A Golf Course Maintenance Budget Krista Puistie Captures NWGA Championship at Remington GC 2016 Florida's Best 5-Star Golf Real Estate Communities Golden Ocala Golf & Equestrian Club Willoughby Golf Club Rotonda G&CC, 99 Holes - \"Open to the public for daily-fee golf\" The 2015 Florida Open for Golfers with Disabilities • FGM Winter 2015 Issue FGM Winter 2015 Issue Submenu In Vero Beach; The Florida Golf Course Architecture of Ron Garl at Indian River Club The Florida Golf Architecture of Jack Nicklaus at Trump National Golf Club, Jupiter 2014 Florida Open for Golfers with Disabilities and/or Mobility Challenges Golf Instruction: By Gary Wiren, PhD Using Learning-Training Aids To Enhance Golf PERFORMANCE Readersâ Choice Survey Results; Floridaâs Favorite Golf Courses For 2015 Golf Course Designer, Pete Dye Unveils Redesign of His 30-Year Old Original Design at The Ford Plantation New 18-Hole Championship Golf Course To Be Designed By Tiger Woods At âTrump World Golf Club Dubaiâ • FGM Fall 2013 Issue FGM Fall 2013 Issue Submenu [VIDEO] The Florida Golf Course Architecture of Pete Dye [VIDEO] In Boynton Beach: Delray Dunes Golf & Country Club, The First Golf Course I Ever Designed In Florida, written by Pete Dye [VIDEO] In Vero Beach: The Moorings Yacht & Country Club, Pete Dyeâs Only Short Course, written by Pete Dye [VIDEO] In Jupiter: The Dye Preserve Golf Club, What You See Is What You Get, written by Pete Dye [VIDEO] In Palm Beach Gardens: Old Marsh Golf Club, The Environmental Challenge That Became An Audubon Sanctuary, written by Pete Dye [VIDEO] In Dominican Republic: Teeth of the Dog at Casa de Campo, Pete Dyeâs First-Ever Island Creation, Literally Made By Hand, by Pete Dye Pete Dyeâs Golf Course Design Philosophies, by Pete Dye Golf Instruction: YIPS, By Gary Wiren, PhD, Master PGA Professional Florida Golf Real Estate Memoirs Of The Legendary Iron Man Of Saint Andrews More Florida Golf Magazine Winter 2017 issue of Florida Golf Magazine features \"The Florida Golf Architecture of Arthur Hills\" Click here to read it. Pete Dye is on the cover of the Winter 2016 issue of Florida Golf Magazine. Click here to read it. Golf Architect Ron Garl & Indian River Club, and Trump National Jupiter are showcased in the Winter 2016 issue of Florida Golf Magazine. Click here to read it. The Florida Golf Architecture of Pete Dye showcased in the Fall 2013 issue of Florida Golf Magazine Click here to read it. 200 Years in the making: The Memoirs Of The Legendary Iron Man Of Saint Andrews Florida's Finest 5-Star Real Estate Golf Course Communities with Golf Homes For Sale Read More Get in touch FLORIDA GOLF MAGAZINE, is printed quarterly and delivered to 50,000 serious golfers, including the General Managers of over 1,100 Florida golf course facilities. FLORIDA GOLF MAGAZINE features a unique blend of Florida golf course photography, course reviews and real estate showcases mixed with Florida golf resort and travel feature stories. Plus our celebrity interviews, golf articles and tips by nationally known contributing editors will always interest serious golf readers throughout America's premier golf state. To advertise in Florida Golf Magazine call the Editor: Joe Stine, at 863-227-2751 or 863-294-2621. Joe Stine, Editor Publisher 604 Country Lane NE Winter Haven, Florida 33881 863-227-2751 or 863-294-2621 joestine@floridagolfmagazine.com © 2018 Joseph A. Stine, All rights reserved. Florida Golf Magazine"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/heron-creek-golf-club/",
      "text": "Heron Creek Golf Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Greater Sarasota Golf Communities Heron Creek Golf Club Heron Creek Golf and Country Club is a semi-private golf club with 27 championship holes of golf. The course was designed by world-class architect Arthur Hills. In addition to the golf course, members will enjoy a 25-acre state-of-the-art golf learning center and practice facility. Alosl, there are 6 practice areas and 5 practice greens for golfers of all skill levels to improve their game. The focal point of the community is the 21,000 square foot clubhouse. Further, the club offers both fine dining and a more casual option in the Grille Room. Whether you’re looking for a more formal dining experience or a casual meal you can enjoy a meal overlooking the golf course. Members also have access to 5 lighted Har-Tru Tennis Courts, Resort Style Swimming Pool, Spa, Sun Deck and State-of-the-art Fitness Center. Also, the golf course is surrounded by single family homes and villas. Additionally, many properties include a view of the golf course, private preserve, or serene lakes. This gated golf community offers multiple residential options including single family homes, villas and condos. The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. Contact us today for more information. Location: North Port Club Type: Semi-Private Membership Type: Pay as You Play or One-Time Initiation Fee Real Estate Heron Creek Homes: $325,000 – $900,000 View Homes for Sale The Naples Golf Guy Team has 20 years of experience helping Buyers and Sellers with their real estate needs in Southwest Florida. Call, text or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report. Membership Information Maximum # of Memberships 550 Golf Memberships Is Membership Required? Yes Non-Resident Memberships Available? Yes Membership Fees Golf Membership Initiation Fee: $10,000 Annual Golf Dues: $7,776 Social Membership Initiation Fee: $3,000 Annual Social Dues: $2,952 Please be aware, other membership options may be available. Additional fees such as capital assessments, a food and beverage minimum, trail fee or taxes may apply. Please feel free to contact us for additional information. Golf Course Information Opened 1975 Course Architect Arthur Hills Number of Courses 1.5 (27 Holes) Caddies Available No Practice Range Yes Own your own cart Yes Course Ratings / Scorecards Oaks/Marsh Par: 72 Holes: 18 Yards Rating Slope Black 6869 72.4 142 Blue 6260 70.5 138 White 5914 68.7 122 Green 5345 66.9 113 Gold 4890 64.4 107 Ladies Tees: Green 5345 71.6 127 Gold 4890 68.6 121 Red 4619 67.4 114 Par: 72 Holes: 18 Yards Rating Slope Black 6825 72.5 143 Blue 6311 70.9 141 White 5863 69.0 122 Green 5312 66.4 117 Gold 4923 64.0 111 Ladies Tees: Green 5312 71.6 130 Gold 4923 68.6 124 Red 4468 66.8 115 Par: 72 Holes: 18 Yards Rating Slope Black 6792 72.5 143 Blue 6305 71.0 140 White 5853 68.5 125 Green 5345 66.5 114 Gold 4872 63.8 108 Ladies Tees: Green 5345 71.4 129 Gold 4872 68.2 123 Red 4543 66.8 116 Amenities Gated community 27 holes of golf Driving range Five (5) practice greens Club house Tennis Pickleball Fitness center Community pool Where is Heron Creek Golf Country Club Located Heron Creek Golf Country Club 5301 Heron Creek Blvd. North Port, FL 34287 941.423.6955 Visit Club Website Back to Greater Sarasota Golf Communities Note: We make every effort to make sure our information for this Golf Club is current and accurate. Information about the tees and membership change over time. Please feel free to email us at info@naplesgolfguy.com if you see any information that needs to be corrected. Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.golfpactravel.com/sarasota-golf-courses/heron-creek-golf-&-country-club",
      "text": "Heron Creek Golf and Country Club | Heron Creek Tee Times × About Golfpac Travel With over 50 years’ experience, Golfpac provides custom golf packages , vacations, and discount travel specials\r\n                        to over 40 golf destinations .  Here at www.golfpactravel.com you can research information and ratings on courses , hotels and resorts , find the best deals, and even quote and book your vacation all online. Whether you’re\r\n                        looking for a weekend getaway or a full-blown golf adventure, you can rely on the travel experts at Golfpac. Over 50 years of experience Over 675,000 satisfied travelers Over 2,200,000 rounds booked Over 600 courses, hotels & resorts Tee times confirmed in advance My Trip , your vacation website Outstanding rates & service Call 888-848-8941 to speak to a real, live person. Together, we have a combined 30 years experience in the golf travel industry. Close 888-848-8941 Sign In Account & Packages Join a Trip {{total | currency}} {{result.Name}} Toggle navigation Golf Courses Florida {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Orlando's Greatest Orlando Tampa Bay Miami - Ft. Lauderdale Naples - Ft. Myers West Palm Beach - Port St. Lucie Jacksonville Sarasota Cocoa Beach - Melbourne Daytona Beach - Palm Coast Destin Tallahassee Arizona {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Scottsdale - Phoenix California {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Diego Palm Springs Pebble Beach Alabama {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Gulf Shores Montgomery Birmingham Huntsville South Carolina {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Hilton Head Kiawah Island Myrtle Beach Nevada {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Las Vegas Virginia {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Williamsburg Michigan {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Traverse City Area Dominican Republic {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Punta Cana / Higuey Puerto Rico {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Puerto Rico Texas {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Antonio Utah {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} St. George Lodging & Resorts Florida {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Orlando's Greatest Orlando Tampa Bay Miami - Ft. Lauderdale Naples - Ft. Myers West Palm Beach - Port St. Lucie Jacksonville Sarasota Cocoa Beach - Melbourne Daytona Beach - Palm Coast Destin Tallahassee Arizona {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Scottsdale - Phoenix California {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Diego Palm Springs Pebble Beach Alabama {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Gulf Shores Montgomery Birmingham Huntsville South Carolina {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Hilton Head Kiawah Island Myrtle Beach Nevada {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Las Vegas Virginia {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Williamsburg Michigan {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Traverse City Area Dominican Republic {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Punta Cana / Higuey Puerto Rico {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Puerto Rico Texas {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Antonio Utah {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} St. George Specials Stay and Play Resorts Unlimited Golf / Book By Specials Limited Time Deals / Early Bird / Night Free Florida {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Orlando Tampa Bay Miami - Ft. Lauderdale Naples - Ft. Myers West Palm Beach - Port St. Lucie Jacksonville Sarasota Cocoa Beach - Melbourne Daytona Beach - Palm Coast Destin Tallahassee Arizona {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Scottsdale - Phoenix California {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Diego Palm Springs Pebble Beach Alabama {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Gulf Shores Montgomery Birmingham Huntsville South Carolina {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Hilton Head Kiawah Island Myrtle Beach Nevada {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Las Vegas Virginia {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Williamsburg Michigan {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Traverse City Area Dominican Republic {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Punta Cana / Higuey Puerto Rico {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Puerto Rico Texas {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Antonio Utah {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} St. George Build a Package Instant Golf Packages You Design Your Package We Design Your Package Book Tee Times Florida {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Orlando's Greatest Orlando Tampa Bay Miami - Ft. Lauderdale Naples - Ft. Myers West Palm Beach - Port St. Lucie Jacksonville Sarasota Cocoa Beach - Melbourne Daytona Beach - Palm Coast Destin Tallahassee Arizona {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Scottsdale - Phoenix California {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Diego Palm Springs Pebble Beach Alabama {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Gulf Shores Montgomery Birmingham Huntsville South Carolina {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Hilton Head Kiawah Island Myrtle Beach Nevada {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Las Vegas Virginia {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Williamsburg Michigan {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Traverse City Area Dominican Republic {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Punta Cana / Higuey Puerto Rico {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} Puerto Rico Texas {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} San Antonio Utah {{::numOfRegions = location.Regions.length; \"\"}}\n                {{::columnLimit = regionLimit(numOfRegions); \"\"}} St. George Rental Cars {{result.Name}} Choose your Hotel ------------------------------------------------------------------- {{listItem.Name}} Heron Creek Golf & Country Club Semi-Private Course North Port, FL (25) reviews About Package Deals Stats/Overview Map Added Value Reviews Restrictions & Fees Special Promotions The following promotional discounts apply: {{promo.Name}} Must book between {{promo.BookBetweenStart}} and {{promo.BookBetweenEnd}}. Must stay between {{promo.StayBetweenStart}} and {{promo.StayBetweenEnd}}. {{promo.WebsiteVerbiage}} Heron Creek Golf & Country Club Golf Packages Course Facts Year Built: 1999 Course Designer: Arthur Hills Club Type: Semi-Private Course Club Facilities Banquet Facilities: Yes Bar: Yes Club Rentals: Yes *Cleveland $50 Clubhouse: Yes Dress Code: Collared Shirts Required Driving Range: Yes Food: Yes GPS: No Homes: homes along most holes On-Site Restaurant: Yes Pro Shop: Yes Shower: Yes Water: Water comes into play on lots of holes COURSE STATS Tees Yardage Rating Slope Back 6869 73.00 143 Middle 6348 70.80 132 Front 5940 68.80 122 Ladies 4787 67.70 115 About Heron Creek Golf & Country Club The moment you step onto the first tee at Heron Creek, you'll experience the exhilaration of playing the brilliantly designed and meticulously maintained 27-hole, championship course. Arthur Hills is renowned for his ability to integrate the features of the natural landscape into his work and produced a design that is uniquely tailored to each golf course. The challenging, but not intimidating, course design includes elevation changes unique to Southwest Florida, sparkling water features, and all the natural beauty of Heron Creek. Heron Creek features a `Golf Learning Center' - offering golf teaching programs for every aspect of the game, for every level of player. It also features an expansive practice facility that includes several teaching stations, three bunkered chipping, pitching greens and two large undulating practice putting greens. With the variety and challenges offered by the Oaks, Marsh and Creek Nine layouts, playing golf at Heron Creek is an experience you'll want to repeat over and over again. Added Value Complimentary range balls included. — Valid 1/1/2017 - 4/30/2026 Reviews Add a Comment {{starRating = review.Rating; \"\"}} Reviewed {{formatDate(review.Date)}} Reviewed {{formatDate(review.Date)}} {{formatDate(review.Date)}} {{review.Comment}} {{totalPages = findNumberOfPages(pager.totalItems/pager.selectedPageSize); \"\"}} « {{n}} » Heron Creek Golf & Country Club Restrictions & Fees Please note, this course has a strict booking window and can only be confirmed exact time 7 days in advance. Please contact your agent with any questions. — 1/1/2024 - 12/31/2029 × Sorry, your browser doesn't support embedded videos. Previous Next Plus {{GalleryImages.length}} more photos {{listing.Id = 12028; \"\"}}\r\n                    {{listing.Name = 'Heron Creek Golf & Country Club'; \"\"}}\r\n                    {{listing.Address = '3401 South Sumter Boulevard, North Port, FL 34287'; \"\"}}\r\n                    {{listing.StarRating = 4.50; \"\"}}\r\n                    {{listing.MainImage = '/images/gallery/12028/i12028.jpg'; \"\"}}\r\n                    {{listing.Latitude = '27.128000000'; \"\"}}\r\n                    {{listing.Longitude = '-82.222000000'; \"\"}}\r\n                    {{listing.Region = 'sarasota'; \"\"}} {{::item.Id = listing.Id; \"\"}}\r\n    {{::item.Name = listing.Name; \"\"}}\r\n    {{::item.Address = listing.Address; \"\"}}\r\n    {{::item.StarRating = listing.StarRating; \"\"}}\r\n    {{::item.MainImage = listing.MainImage; \"\"}}\r\n    {{::item.Latitude = listing.Latitude; \"\"}}\r\n    {{::item.Longitude = listing.Longitude; \"\"}}\r\n    {{::item.Region = listing.Region; \"\"}}\r\n    {{::item.Type = \"golfcourses\"; \"\"}} Build Your Own Package with {{item.Name}} Golf Only Rates Shared Cart Included {{::rate.Time}} {{item.Region.indexOf('Vegas') != -1 ? rate.GolfOnlyRate : rate.DisplayGolfOnlyRate | currency}} No Rates Found 1 player 2 players 3 players 4 players 5 players 6 players 7 players 8 players 9 players 10 players 11 players 12 players 13 players 14 players 15 players 16 players 17 players 18 players 19 players 20 players 21 players 22 players 23 players 24 players 25 players 26 players 27 players 28 players 29 players 30 players 31 players 32 players 33 players 34 players 35 players 36 players 37 players 38 players 39 players 40 players 41 players 42 players 43 players 44 players 45 players 46 players 47 players 48 players 49 players 50 players 51 players 52 players 53 players 54 players 55 players 56 players 57 players 58 players 59 players 60 players 61 players 62 players 63 players 64 players 65 players 66 players 67 players 68 players 69 players 70 players 71 players 72 players 73 players 74 players 75 players 76 players 77 players 78 players 79 players 80 players 81 players 82 players 83 players 84 players 85 players 86 players 87 players 88 players 89 players 90 players 91 players 92 players 93 players 94 players 95 players 96 players 97 players 98 players 99 players Add to cart Please Call for Rates Highlights ** PLEASE NOTE, we will only be able to arrange your exact tee time 7 days prior to play. Arthur Hill championship designed course with three 9 hole courses to choose Challenging yet not intimidating with lots of variety Host of several Honda Classic qualifying events Course Scorecard × Review Heron Creek Golf & Country Club Add Your Comments If you have stayed or played at Heron Creek Golf & Country Club, we would like to hear from you. Date Visited * Review / Comments * Name (optional) Your Location (optional) Email Address (optional) Close Submit Review 2024-2025 Digital Golf Vacation Planning Guide The 58-page all digital Golf Vacation guide, features our Top Golf Travel Destinations including Orlando, Florida, Arizona, Las Vegas, Hilton Head, Palm Springs, and Myrtle Beach.\r\n    With exclusive videos, sound clips, and immersive content, you’ll feel like you’re already there.\r\n    Whether you’re dreaming of championship courses, stunning resorts, or that perfect blend of luxury and challenge, we’ve got you covered. View Online Gift Certificates Give the golfer in your life a Golfpac travel certificate good for their next golf vacation with us. They never expire, and can be purchased for any amount. Buy Now Customer Comments Become a Member Golf Package Deals Gift Certificates Players Championship Tickets Ship Your Golf Clubs Sprechen Sie Deutsch? Sitemap Orlando's Greatest Golf & Packages Orlando Golf & Packages Tampa Golf & Packages Miami Golf & Packages Naples Golf & Packages West Palm Beach Golf & Packages Jacksonville Golf & Packages Sarasota Golf & Packages Cocoa Beach Golf & Packages Daytona Beach Golf & Packages Destin Golf & Packages Tallahassee Golf & Packages Scottsdale Arizona Golf & Packages San Diego Golf & Packages Palm Springs Golf & Packages Pebble Beach Golf & Packages Hilton Head Golf & Packages Kiawah Island Golf & Packages Myrtle Beach Golf & Packages Las Vegas Golf & Packages Williamsburg Golf & Packages Traverse City Area Golf & Packages Puntacana Golf & Packages Puerto Rico Golf & Packages San Antonio Golf & Packages St. George Golf & Packages Alabama Golf & Packages About GolfPac Travel Frequently Asked Questions Terms and Conditions / Rainouts & Cancellations Privacy Policy Contact Us With over 50 years’ experience, Golfpac Travel provides custom golf packages, vacations, and discount travel specials to over 40 golf destinations. Read More. Copyright© 2025 Golfpac Travel®. All rights reserved. | Golfpac Tour Operator Site"
    }
  ]
}