{
  "fuentes": [
    {
      "url": "https://variety.com/2019/digital/news/rooster-teeth-jordan-levin-matt-hullum-1203347749/",
      "email": "obits@variety.com"
    },
    {
      "url": "https://www.cars-rooster.com/contact",
      "email": "contact@roosterapp.info"
    },
    {
      "url": "https://roosterusa.com/pages/contact-us",
      "email": "salesusa@roostersailing.com"
    },
    {
      "url": "https://roosterusa.com/pages/get-in-touch-with-us",
      "email": "sales@roostersailing.com"
    },
    {
      "url": "https://roosterusa.com/pages/get-in-touch-with-us",
      "email": "salesusa@roostersailing.com"
    },
    {
      "url": "https://roosterusa.com/pages/get-in-touch-with-us",
      "email": "salesusa@roostersailing.com"
    },
    {
      "url": "https://roosterusa.com/pages/get-in-touch-with-us",
      "email": "trade@roostersailing.com"
    },
    {
      "url": "https://hgroosters.com/contact/",
      "email": "contactus@hgroosters.com"
    },
    {
      "url": "https://www.hansongrey.com/contact-us",
      "email": "info@hansongrey.com"
    },
    {
      "url": "https://jobs.hiringourheroes.org/",
      "email": "applicantaccommodation@t-mobile.com"
    }
  ],
  "mails": [
    "applicantaccommodation@t-mobile.com",
    "contact@roosterapp.info",
    "contactus@hgroosters.com",
    "info@hansongrey.com",
    "obits@variety.com",
    "sales@roostersailing.com",
    "salesusa@roostersailing.com",
    "trade@roostersailing.com"
  ],
  "nombre_sitio": "hgroosters.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://variety.com/2019/digital/news/rooster-teeth-jordan-levin-matt-hullum-1203347749/",
      "text": "Rooster Teeth Names Jordan Levin GM, Matt Hullum Moves to Content Role Rooster Teeth Names Jordan Levin GM, Matt Hullum Moves to Content Role Plus Icon Film Plus Icon TV Plus Icon What To Watch Plus Icon Music Plus Icon Docs Plus Icon Digital & Gaming Plus Icon Global Plus Icon Awards Circuit Plus Icon Video Plus Icon What To Hear Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Got a Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Variety Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Plus Icon Click to expand the Mega Menu Plus Icon Click to Expand Search Input Variety Plus Icon Read Next: Apple Unveils iPhone 17 Line, Including Ultrathin ‘Air,’ Keeping Prices Level With Last Year’s Models Login Account Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Login Open Drodpwon Menu Account Open Drodpwon Menu Variety Digital Variety Archives VIP+ Welcome Manage Account View Variety Archives Variety Digital Login Subscribe Log Out Home Digital News Sep 24, 2019 2:00pm PT Jordan Levin Takes Reins at Rooster Teeth, Co-Founder Matt Hullum Shifts to New Role By Todd Spangler Plus Icon Todd Spangler NY Digital Editor xpangler Latest Audible’s ‘Harry Potter’ Series Expands Cast With Keira Knightley, Kit Harington, James McAvoy, Simon Pegg and More 3 hours ago Spotify Finally Launches HD Lossless Audio for Premium Subscribers 5 hours ago Warner Bros. Discovery Sues Dish Over Sling TV Short-Term ‘Passes,’ Alleging Breach of Contract 20 hours ago See All Courtesy of Rooster Teeth Two weeks after announcing a mass layoff , WarnerMedia-owned Rooster Teeth is shaking up its management team: Jordan Levin , former CEO of AwesomenessTV and the WB, has been named general manager. With Levin’s appointment, Rooster Teeth co-founder and former CEO Matt Hullum is moving into a newly created role as chief content officer. He will work with Levin to oversee all creative and content operations, including Rooster Teeth Studios, at the fandom-focused digital media, events, ecommerce and games company. In addition, Rooster Teeth co-founders Geoff Ramsey and Burnie Burns are taking on new roles. Burns, previously RT’s chief creative officer, is shifting to an executive producer role to lead high-profile projects across the company. Ramsey will get expanded oversight as executive creative director, leading strategic creative direction for Rooster Teeth’s direct-to-consumer businesses and collaborating with Rooster Teeth Studios. Related Stories Taraji P. Henson, Kerry Washington, Jennifer Hudson, Jesse Williams and Michael Ealy to Headline CultureCon Lineup (EXCLUSIVE) Levin will report to Tom Pickett, CEO of Otter Media ’s Ellation group, which encompasses Rooster Teeth, Crunchyroll and VRV after a restructuring late last year (following AT&T’s buyout of Otter from Chernin Group). Popular on Variety “Today’s announcements are a reflection of our commitment and confidence in Rooster Teeth and its value inside the WarnerMedia portfolio,” Tony Goncalves, CEO of Otter Media, said in a statement. “With Jordan at the helm, the founders are enabled to focus on the creative pipeline and expand on the market-leading franchises Rooster Teeth is known for.” The changes come on the heels of Austin-based Rooster Teeth axing 13% of its staff, or around 50 employees. Hullum, in a Sept. 12 internal memo , said RT managers “adjusted their teams to meet the needs of our future.” In a statement Tuesday, Hullum said, “Leading Rooster Teeth has been one of the greatest privileges of my life. Despite an ever-changing industry and an ongoing series of acquisitions and integrations, we managed to grow the company to more than 10 times the size it was when I began as CEO just over seven years ago. It’s been an incredible ride, and now I’m beyond excited to be returning to the creative work that inspired me to want to co-found Rooster Teeth in the first place.” Rooster Teeth Studios head of development Ryan P. Hall will continue in his current role. The company also announced promotions and expanded duties for several other execs: Luis Medina, SVP of partnerships and strategy, will now oversee operations and strategic partnerships for Rooster Teeth’s family of direct-to-consumer digital brands including Achievement Hunter, Funhaus, the Roost, and other content for Rooster Teeth’s membership site and YouTube network. Doreen Copeland, former head of live action, will now serve as VP, head of production operations for Rooster Teeth Studios. Barbara Dunkelman, previously director of social and community marketing, will now serve as creative director for Rooster Teeth’s Direct comedic content, including RT Shorts and RT Life. Levin most recently was CEO of Awesomeness, the youth-skewing digital studio and network behind projects including Netflix film “To All the Boys I’ve Loved Before” and Hulu’s critically acclaimed “PEN15.” He exited the company after Viacom acquired Awesomeness , which was previously jointly owned by Comcast’s NBCUniversal, Verizon and Hearst. Before joining Awesomeness in 2017, Levin was the NFL’s first chief content officer and briefly served as GM of Microsoft’s now-defunct Xbox Entertainment Studios. In 2005, Levin founded Generate, a studio and talent management company he sold to Alloy Digital; he served as president of the new entity, before it merged with Break Media formed Defy Media in 2013. In 1994, Levin joined the WB Television Network (now the CW) as part of its founding executive team, eventually climbing the ranks to become the youngest network CEO in broadcast TV history before stepping down a year later in 2004. Prior to the WB, he worked at Disney’s TV studio as a creative exec. Rooster Teeth was founded in 2003 — before the birth of YouTube — by Burns, Hullum, Ramsey, Gus Sorola and Joel Heyman. RT has cultivated a loyal and active fanbase. Original productions include the long-running “Red vs. Blue” sci-fi spoof; “RWBY,” the first Western anime-style series to be distributed in Japan; and animated mecha series “Gen:Lock,” with Michael B. Jordan voicing the lead role. Rooster Teeth Studios also has content deals with HBO Max, Netflix, Cartoon Network, Discovery and Outlier Society, as well as partnerships with Hasbro, WarnerMedia’s ELeague, Scholastic, DC, and Warner Bros. Consumer Products. On its website, Rooster Teeth counts 3 million registered community members and the company sells a subscription-streaming service called First. It also operates RTX, series of annual gaming and internet conventions, a game-publishing division, and a merchandise arm. “Over the past 16 years, Matt, Burnie, Geoff and Gus have built a world-class entertainment company amidst a turbulent marketplace engaging a fervent community of fans through a diverse portfolio of successful, entrepreneurial businesses,” Levin said in a statement. “I’m grateful to be returning to both Austin, which has been my family’s second home, as well as the WarnerMedia family, to realize Rooster Teeth’s ambitions of producing more content in more places to reach and expand its community wherever they are and will be.” Levin, a member of the Directors Guild of America, made his directorial debut in 2004 on an episode of Greg Berlanti’s “Everwood” on the WB. He also won a trio of Emmy Awards as an executive producer on three NFL productions and is a member of the Academy of Television Arts & Sciences. Levin is past chairman of NATPE, former president of the Hollywood Radio & Television Society and serves on the boards of other industry organizations. Read More About: Jordan Levin, Matt Hullum, Otter Media, Rooster Teeth Jump to Comments More from Variety The Awards Season Gamble: Why Festival Strategy Can Make or Break Oscar Dreams Brendan Fraser Finds a New Oscar Vehicle in Hikari’s ‘Rental Family’ at TIFF Sweden Selects Tarik Saleh’s ‘Eagles of the Republic’ as Oscar Submission Chile Sends ‘The Mysterious Gaze of the Flamingo’ to the Oscars (EXCLUSIVE) Lav Diaz’s ‘Magellan’ Sails to Oscar Waters as Philippines’ International Feature Entry Japan Picks Lee Sang-il’s Hit Kabuki Drama ‘Kokuho’ as Oscar Submission JavaScript is required to load the comments. Loading comments... Most Popular Glen Powell Says Chris Pratt in ‘Guardians of the Galaxy’ Changed Hollywood Leading Men: You Can Be ‘Sillier’ and Not Just ‘Brooding’ Like Robert… Joaquin Phoenix, Nicola Coughlan and More Join 3,900 Industry Names Pledging Not to Work With Israeli Film Institutions 'Complicit in War Crimes' James McAvoy Allegedly Attacked in Toronto Bar While Premiering ‘California Schemin” at TIFF Dwayne Johnson Says Weight Loss Is for New Acting Role; He’s Playing a 70-Year-Old Man Whose Best Friend Is a Chicken: ‘I Still Have a Long Way to Go… Michael Caine Coming Out of Retirement at 92 Years Old for Vin Diesel’s ‘Last Witch Hunter 2’ at Lionsgate ‘Wake Up Dead Man: A Knives Out Mystery’ Takes TIFF Audience to Church With Rapturous World Premiere ‘One Battle After Another’ First Reactions: Steven Spielberg Praises PTA and DiCaprio’s ‘Incredible’ New Movie as Press Call It One of the Year’s… Tim Robinson’s HBO Series ‘The Chair Company’ Gets Release Date, First-Look Images ‘Bachelorette’ Surprise: ‘Secret Lives of Mormon Wives’ Star Taylor Frankie Paul to Lead Season 22 Audible’s ‘Harry Potter’ Series Expands Cast With Keira Knightley, Kit Harington, James McAvoy, Simon Pegg and More Must Read Film COVER | Channing Tatum's 'Roofman' Reinvention By Andrew Wallenstein 1 week Film Venice Film Festival Reviews Film Cooper Hoffman on ‘The Long Walk,’ Coming of Age After 'Licorice Pizza' TV ‘SNL’ Adds Five: Meet the New Cast Members Film E. Jean Carroll Hopes Her Explosive Telluride Doc Will ‘Finish Off’ Donald Trump Sign Up for Variety Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Variety Confidential A Variety and iHeartRadio Podcast More From Our Brands Rolling Stone Fran Drescher on the Legend of Bobbi Flekman Robb Report U.S. Imports of Swiss Watches Were 107% Higher in July Than June Sportico Golf Rounds Plunge at U.S. Courses as Canadians Go Elbows Up at Trump WWD Emporio, Giorgio Armani Spring 2026 Shows Confirmed in Milan TVLine Save the Dates: Doc’s Return, Dope Girls, Futurama Season 13 Binge and More Variety About Us Advertise Media Kit Careers Legal Terms of Use Privacy Policy California Privacy Rights Privacy Preferences AdChoices Your Privacy Choices Accessibility Magazine Customer Service Back Issues Subscribe Help More Newsletters Archives Events Luminate Connect Instagram Twitter YouTube Facebook LinkedIn Variety The Business of Entertainment Subscribe Today Have a News Tip? Let us know Variety Close the menu Expand the sub menu Film News Reviews Podcasts Box Office Events Columns Trailers Expand the sub menu TV News Reviews Podcasts Ratings Pilot Scorecard Columns Trailers Expand the sub menu What To Watch Lists & Features Expand the sub menu Music News Album Reviews Concert Reviews Hitmakers Music For Screens Grammys Expand the sub menu Docs Lists & Features Expand the sub menu Tech Features Global VIP+ Tech Expand the sub menu Global News Asia Markets & Festivals Features Expand the sub menu Awards Circuit News Film Predictions TV Predictions Video Artisans Columns Awards Circuit Podcast Expand the sub menu Video Popular Cover Shoots - Behind the Scenes Actors on Actors Power of Women Events Artisans Expand the sub menu What to Hear Lists & Features Expand the sub menu More Coverage Obituaries - submit obituaries to obits@variety.com Photos Podcasts Scene Voices Theater Expand the sub menu More Variety Live Media Summits Vscore Luminate - Film & TV Variety Archives Variety500 Industry Executives Have a News Tip? Newsletters Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Alerts and Newsletters Your Email Sign Up Sign Up By providing your information, you agree to our Terms of Use and our Privacy Policy .\n\t\t\t\tWe use vendors that may also process your information to help provide our services. // This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Follow Us Got a Tip? Switch edition between U.S. Edition Asia Edition Global Edition U.S. Asia Global Advertise About Contact Us Variety is a part of Penske Media Corporation. © 2025 Variety Media, LLC. All Rights Reserved. Icon Link Plus Icon ad"
    },
    {
      "url": "https://www.cars-rooster.com/contact",
      "text": "Rooster | Contact Us"
    },
    {
      "url": "https://roosterusa.com/pages/contact-us",
      "text": "Contact Us\n\n        – ROOSTER USA Skip to content Free UPS ground shipping on orders over $75 Men Men Highlights Highlights Shop All Men New & Coming Soon Outlet Gift E-vouchers Ranges Ranges Aquafleece® Hot Stuff Polypro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Women Women Highlights Highlights New & Coming Soon Outlet Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Junior Junior Highlights Highlights New & Coming Soon Outlet Shop All Junior Clothing Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Proctection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual All Technical Casual Polos & Tees Shorts & Trousers Sweaters & Hoodies Jackets Accessories Accessories Buoyancy Aids Buoyancy Aids Adult Buoyancy Aid Junior Buoyancy Aids Gloves Gloves Adult Gloves Junior Gloves Boots & Socks Boots & Socks All Socks All Boots Bags & Backpacks Hats & Headwear Harnesses Changing & Essentials Towels & Ponchos Sunglasses Repair Kits Gift Card Shop By Sport Shop By Sport Dinghy Sailing Inshore & Coastal Sailing SUP/Paddle Boarding Windsurfing Kayaking Coastal/Offshore Rowing Boat Parts Boat Parts Rooster® Boat Parts Rooster® Boat Parts Bags & Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip All Rope All Rope Sheets Halyards Control Lines Splicing Tools Discover Discover The Rooster Blog Rooster Riders Ambassadors Sponsorship Enquires Event Prizes Enquires Product Care Gear Guide Gear Guide Gear Guide What to Wear Know your Aquafleece Layering Guide New Log in New Men Highlights All Men's Clothing New & Coming Soon Outlet Gift E-vouchers Waterwear Coastal & Offshore Hikers Impact Protection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical casual All Technical Casual Polos & Tees Shorts & Trousers Jackets Women Highlights All Women's Clothing New & Coming Soon Outlet Waterwear Coastal & Offshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & LongJohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual All Technical Casual Jackets Polos & Tees Sweaters & Hoodies Shorts & Trousers Junior Highlights All Junior Clothing New & Coming Soon Outlet Waterwear Coastal & Offshore Hikers Impact Protection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & LongJohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual All Technical Casual Polos & Tees Sweaters & Hoodies Shorts & Trousers Jackets Accessories Buoyancy Aids Junior Buoyancy Aids Adult Buoyancy Aids Gloves Junior Gloves Adult Gloves Footwear Socks Boots & Trainers Bags & Backpacks Harnesses Hats and Headwear Changing & Essentials Towels & Poncho Sunglasses Repair Kits Shop by Sport Dinghy Sailing Inshore & Coastal Sailing SUP/paddle boarding Wind & Foil Sports Kayaking Coastal/Offshore Rowing Boat Parts Rooster® Boat Parts Bags and Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip Sails and Sail Numbers Rooster® Rope and Rigging Sheets Halyards Control Lines Shock Cord Splicing Tools The Blog Ambassadors Fun Stuff Boat Maintenance Tips Campaigning Kit Guide Rooster News Technique Tips Tuning Guide Gear Guides What to Wear Know your Aquafleece Layering Guide Select Store EU UK Search Log in 0 items Men Men Highlights Highlights Shop All Men New & Coming Soon Outlet Gift E-vouchers Ranges Ranges Aquafleece® Hot Stuff Polypro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Women Women Highlights Highlights New & Coming Soon Outlet Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Junior Junior Highlights Highlights New & Coming Soon Outlet Shop All Junior Clothing Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Proctection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual All Technical Casual Polos & Tees Shorts & Trousers Sweaters & Hoodies Jackets Accessories Accessories Buoyancy Aids Buoyancy Aids Adult Buoyancy Aid Junior Buoyancy Aids Gloves Gloves Adult Gloves Junior Gloves Boots & Socks Boots & Socks All Socks All Boots Bags & Backpacks Hats & Headwear Harnesses Changing & Essentials Towels & Ponchos Sunglasses Repair Kits Gift Card Shop By Sport Shop By Sport Dinghy Sailing Inshore & Coastal Sailing SUP/Paddle Boarding Windsurfing Kayaking Coastal/Offshore Rowing Boat Parts Boat Parts Rooster® Boat Parts Rooster® Boat Parts Bags & Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip All Rope All Rope Sheets Halyards Control Lines Splicing Tools Discover Discover The Rooster Blog Rooster Riders Ambassadors Sponsorship Enquires Event Prizes Enquires Product Care Gear Guide Gear Guide Gear Guide What to Wear Know your Aquafleece Layering Guide New Log in Men Highlights Shop All Men New & Coming Soon Outlet Gift E-vouchers Ranges Aquafleece® Hot Stuff Polypro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Women Highlights New & Coming Soon Outlet Gift E-Vouchers Waterwear Coastal & Inshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Junior Highlights New & Coming Soon Outlet Shop All Junior Clothing Gift E-Vouchers Waterwear Coastal & Inshore Hikers Impact Proctection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual All Technical Casual Polos & Tees Shorts & Trousers Sweaters & Hoodies Jackets Accessories Buoyancy Aids Adult Buoyancy Aid Junior Buoyancy Aids Gloves Adult Gloves Junior Gloves Boots & Socks All Socks All Boots Bags & Backpacks Hats & Headwear Harnesses Changing & Essentials Towels & Ponchos Sunglasses Repair Kits Gift Card Shop By Sport Dinghy Sailing Inshore & Coastal Sailing SUP/Paddle Boarding Windsurfing Kayaking Coastal/Offshore Rowing Boat Parts Rooster® Boat Parts Bags & Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip All Rope Sheets Halyards Control Lines Splicing Tools Discover The Rooster Blog Rooster Riders Ambassadors Sponsorship Enquires Event Prizes Enquires Product Care Gear Guide Gear Guide What to Wear Know your Aquafleece Layering Guide New Log in Your cart\n                \n                  ( 0 items ) Spend $100.00 more for free shipping Congratulations! Your order qualifies for free shipping Your cart is empty Enable cookies to use the shopping cart Loading... Subtotal: $0.00 Loading... Taxes and shipping calculated at checkout View cart Check out Search Most searched products: 10L Roll Top Dry Bag Regular price $42.00 Sale price $42.00 Regular price Unit price / per 2.5 Layer Repair Kit Regular price $18.00 Sale price $18.00 Regular price Unit price / per 2/3mm Pull Fid Splicing Needle Regular price $24.00 Sale price $24.00 Regular price Unit price / per 3/4 Classic Hikers 4/3mm Regular price $182.00 Sale price $182.00 Regular price Unit price / per 4000 Trapeze Rope Set Replacement Regular price $67.00 Sale price $67.00 Regular price Unit price / per Talk about your brand Use this text to share information about your brand with your customers. Describe a product, share announcements, or welcome customers to your store. Contact form Name Email * Phone number Message * Send Need help? Working hours: Monday- Friday 9am-4:30pm (GMT) Email: salesUSA@roostersailing.com Phone: +1 757 778 9997 About About Us All Reviews Find a Stockist Trade Portal Customer Care Terms & Conditions Privacy & Cookie Policy Contact Us Returns PPE Technical Files Material Technology Material Safety Data Discover Rooster Riders Ambassadors Sponsorship Enquires Event Prize Enquires Product Care Blogs Blog Home Rooster News The Rooster Blog & Archives Hints and tips Kit Guide Ambassadors Boat Tests Campaigning Fun Stuff Technique Tips Tuning Guide © 2025, ROOSTER USA . Search Cart 0 items Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://roosterusa.com/pages/get-in-touch-with-us",
      "text": "Get in Touch with Us\n\n        – ROOSTER USA Skip to content Free UPS ground shipping on orders over $75 Men Men Highlights Highlights Shop All Men New & Coming Soon Outlet Gift E-vouchers Ranges Ranges Aquafleece® Hot Stuff Polypro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Women Women Highlights Highlights New & Coming Soon Outlet Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Junior Junior Highlights Highlights New & Coming Soon Outlet Shop All Junior Clothing Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Proctection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual All Technical Casual Polos & Tees Shorts & Trousers Sweaters & Hoodies Jackets Accessories Accessories Buoyancy Aids Buoyancy Aids Adult Buoyancy Aid Junior Buoyancy Aids Gloves Gloves Adult Gloves Junior Gloves Boots & Socks Boots & Socks All Socks All Boots Bags & Backpacks Hats & Headwear Harnesses Changing & Essentials Towels & Ponchos Sunglasses Repair Kits Gift Card Shop By Sport Shop By Sport Dinghy Sailing Inshore & Coastal Sailing SUP/Paddle Boarding Windsurfing Kayaking Coastal/Offshore Rowing Boat Parts Boat Parts Rooster® Boat Parts Rooster® Boat Parts Bags & Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip All Rope All Rope Sheets Halyards Control Lines Splicing Tools Discover Discover The Rooster Blog Rooster Riders Ambassadors Sponsorship Enquires Event Prizes Enquires Product Care Gear Guide Gear Guide Gear Guide What to Wear Know your Aquafleece Layering Guide New Log in New Men Highlights All Men's Clothing New & Coming Soon Outlet Gift E-vouchers Waterwear Coastal & Offshore Hikers Impact Protection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical casual All Technical Casual Polos & Tees Shorts & Trousers Jackets Women Highlights All Women's Clothing New & Coming Soon Outlet Waterwear Coastal & Offshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & LongJohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual All Technical Casual Jackets Polos & Tees Sweaters & Hoodies Shorts & Trousers Junior Highlights All Junior Clothing New & Coming Soon Outlet Waterwear Coastal & Offshore Hikers Impact Protection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & LongJohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual All Technical Casual Polos & Tees Sweaters & Hoodies Shorts & Trousers Jackets Accessories Buoyancy Aids Junior Buoyancy Aids Adult Buoyancy Aids Gloves Junior Gloves Adult Gloves Footwear Socks Boots & Trainers Bags & Backpacks Harnesses Hats and Headwear Changing & Essentials Towels & Poncho Sunglasses Repair Kits Shop by Sport Dinghy Sailing Inshore & Coastal Sailing SUP/paddle boarding Wind & Foil Sports Kayaking Coastal/Offshore Rowing Boat Parts Rooster® Boat Parts Bags and Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip Sails and Sail Numbers Rooster® Rope and Rigging Sheets Halyards Control Lines Shock Cord Splicing Tools The Blog Ambassadors Fun Stuff Boat Maintenance Tips Campaigning Kit Guide Rooster News Technique Tips Tuning Guide Gear Guides What to Wear Know your Aquafleece Layering Guide Select Store EU UK Search Log in 0 items Men Men Highlights Highlights Shop All Men New & Coming Soon Outlet Gift E-vouchers Ranges Ranges Aquafleece® Hot Stuff Polypro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Women Women Highlights Highlights New & Coming Soon Outlet Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Junior Junior Highlights Highlights New & Coming Soon Outlet Shop All Junior Clothing Gift E-Vouchers Waterwear Waterwear Coastal & Inshore Hikers Impact Proctection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Technical Casual All Technical Casual Polos & Tees Shorts & Trousers Sweaters & Hoodies Jackets Accessories Accessories Buoyancy Aids Buoyancy Aids Adult Buoyancy Aid Junior Buoyancy Aids Gloves Gloves Adult Gloves Junior Gloves Boots & Socks Boots & Socks All Socks All Boots Bags & Backpacks Hats & Headwear Harnesses Changing & Essentials Towels & Ponchos Sunglasses Repair Kits Gift Card Shop By Sport Shop By Sport Dinghy Sailing Inshore & Coastal Sailing SUP/Paddle Boarding Windsurfing Kayaking Coastal/Offshore Rowing Boat Parts Boat Parts Rooster® Boat Parts Rooster® Boat Parts Bags & Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip All Rope All Rope Sheets Halyards Control Lines Splicing Tools Discover Discover The Rooster Blog Rooster Riders Ambassadors Sponsorship Enquires Event Prizes Enquires Product Care Gear Guide Gear Guide Gear Guide What to Wear Know your Aquafleece Layering Guide New Log in Men Highlights Shop All Men New & Coming Soon Outlet Gift E-vouchers Ranges Aquafleece® Hot Stuff Polypro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Women Highlights New & Coming Soon Outlet Gift E-Vouchers Waterwear Coastal & Inshore Hikers Impact Protection Spray Tops & Smocks Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual Jackets Polos & Tees Shorts & Trousers Sweaters & Hoodies Junior Highlights New & Coming Soon Outlet Shop All Junior Clothing Gift E-Vouchers Waterwear Coastal & Inshore Hikers Impact Proctection Spray Tops & Smocks Tech Bottoms Tech Tops Thermal Base Layers UV Rash Base Layers Wetsuits & Longjohns Ranges Aquafleece® Hot Stuff PolyPro™ RaceArmour™ SB Inshore Supertherm® Thermaflex® Technical Casual All Technical Casual Polos & Tees Shorts & Trousers Sweaters & Hoodies Jackets Accessories Buoyancy Aids Adult Buoyancy Aid Junior Buoyancy Aids Gloves Adult Gloves Junior Gloves Boots & Socks All Socks All Boots Bags & Backpacks Hats & Headwear Harnesses Changing & Essentials Towels & Ponchos Sunglasses Repair Kits Gift Card Shop By Sport Dinghy Sailing Inshore & Coastal Sailing SUP/Paddle Boarding Windsurfing Kayaking Coastal/Offshore Rowing Boat Parts Rooster® Boat Parts Bags & Boat Covers Padded Toestraps Tillers and Extensions Deck Grip / Non Slip All Rope Sheets Halyards Control Lines Splicing Tools Discover The Rooster Blog Rooster Riders Ambassadors Sponsorship Enquires Event Prizes Enquires Product Care Gear Guide Gear Guide What to Wear Know your Aquafleece Layering Guide New Log in Your cart\n                \n                  ( 0 items ) Spend $100.00 more for free shipping Congratulations! Your order qualifies for free shipping Your cart is empty Enable cookies to use the shopping cart Loading... Subtotal: $0.00 Loading... Taxes and shipping calculated at checkout View cart Check out Search Most searched products: 10L Roll Top Dry Bag Regular price $42.00 Sale price $42.00 Regular price Unit price / per 2.5 Layer Repair Kit Regular price $18.00 Sale price $18.00 Regular price Unit price / per 2/3mm Pull Fid Splicing Needle Regular price $24.00 Sale price $24.00 Regular price Unit price / per 3/4 Classic Hikers 4/3mm Regular price $182.00 Sale price $182.00 Regular price Unit price / per 4000 Trapeze Rope Set Replacement Regular price $67.00 Sale price $67.00 Regular price Unit price / per Get in Touch with Us YOUR QUESTIONS, FEEDBACK, AND NEEDS MATTER We're here to make your experience exceptional. Whether you have questions, suggestions, or specific needs, our dedicated team is ready to assist you. Contact us today and let's connect! Customer Service Telephone: +1 757 778 9997 Monday 10am-4:30pm GMT Tuesday-Friday 9am-4:30pm GMT Email: salesusa@roostersailing.com Live Chat: Monday 10am-4:30pm GMT Tuesday-Friday 9am-4:30pm GMT Explore Opportunities as a Rooster Products Stockist Are you interested in carrying Rooster products in your retail store? We welcome the opportunity to partner with you. As an authorized stockist, you can offer our high-quality products to your customers. To learn more about becoming a Rooster Products stockist, please reach out to us at trade@roostersailing.com . We look forward to discussing how we can collaborate and help you expand your offerings. Holiday season shipping dates, make sure you get your gifts in time (subject to courier delays): Ground/standard Mainland US: East Coast= Monday 18th December. West Coast= Wednesday 13th December. (these date are estimation and not guaranteed) Overnight/Express Mainland US: Tuesday 19th December before 12pm (EST) Need help? Working hours: Monday- Friday 9am-4:30pm (GMT) Email: salesUSA@roostersailing.com Phone: +1 757 778 9997 About About Us All Reviews Find a Stockist Trade Portal Customer Care Terms & Conditions Privacy & Cookie Policy Contact Us Returns PPE Technical Files Material Technology Material Safety Data Discover Rooster Riders Ambassadors Sponsorship Enquires Event Prize Enquires Product Care Blogs Blog Home Rooster News The Rooster Blog & Archives Hints and tips Kit Guide Ambassadors Boat Tests Campaigning Fun Stuff Technique Tips Tuning Guide © 2025, ROOSTER USA . Search Cart 0 items Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://hgroosters.com/contact/",
      "text": "Contact - H.G. Roosters Home Our History Menu Weekly Happenings Contact Connect with us at H.G. Roosters Facebook Instagram YouTube Email ContactUs@HGRoosters.com Phone (561) 517-8180 Address 823 Belvedere Road West Palm Beach, FL 33401 @HGRoosters Follow Us on Instagram The Historic H.G. Roosters Palm Beach County’s very own Cheers. Serving the LGBT Community since 1984. Designated historic in 2021 due to our cultural contribution to the City Facebook Page – @HGRoosters Instagram Page – @hgroosters YouTube Page – @RoostersWPB-TV Location 823 Belvedere Road West Palm Beach, FL 33401 (561) 517-8180 Summer Hours Until Oct 15 Sunday through Wednesday 3:00 pm – 2 am Thursday 3:00 pm – 3:00 am Friday and Saturday 3:00 pm – 4:00 am Kitchen Hours Sunday to Thursday 4:00 pm – 11:00 pm Friday to Saturday 4:00 pm – 12:00 am © 2024 · H.G. Roosters · All rights reserved"
    },
    {
      "url": "https://www.hansongrey.com/contact-us",
      "text": "Contact Us | Connect Now — HG Group 0 Skip to Content Jobs About About Us Our Brands & Values Meet the Team Frameworks & Accreditations Careers at HG Latest News Services Nursing AHP/HSS Medical Social Care Primary Care International Permanent Candidate How We Help Compliance Process Training We Provide Revalidation & Appraisals Timesheets Refer A Friend Register Request a callback Open Menu Close Menu Jobs About About Us Our Brands & Values Meet the Team Frameworks & Accreditations Careers at HG Latest News Services Nursing AHP/HSS Medical Social Care Primary Care International Permanent Candidate How We Help Compliance Process Training We Provide Revalidation & Appraisals Timesheets Refer A Friend Register Request a callback Open Menu Close Menu Jobs Folder: About Back About Us Our Brands & Values Meet the Team Frameworks & Accreditations Careers at HG Latest News Folder: Services Back Nursing AHP/HSS Medical Social Care Primary Care International Permanent Folder: Candidate Back How We Help Compliance Process Training We Provide Revalidation & Appraisals Timesheets Refer A Friend Register Request a callback Contact Us Contact HG Group today to take one step closer to filling your vacancies with the best healthcare staff out there. You can call or use the online form below and we will match you up with the perfect candidates. Connect with Recruiters and Career Resources Today! Phone: 0203 983 2211 Email: info@hansongrey.com St James House, 27-43 Easter Road Romford, Essex RM1 3NH Name * First Name Last Name Email * Phone * (###) ### #### What are you looking for? * I'm looking for a job I'm looking for talent General Enquiry Additional Information Thank you! Connect with us on Social media Contact HG Group Phone: 0203 983 2211 Email: info@hansongrey.com St James House, 27-43 Eastern Road Romford, Essex RM1 3NH Website Privacy Policy | Data Privacy Policy | Carbon Reduction Plan | Modern Slavery Act | Careers at HG | Report Something All rights reserved © Website by Jump"
    },
    {
      "url": "https://jobs.hiringourheroes.org/",
      "text": "HOH Job Board Jobs Companies HiringOurHeroes.org Jobs Companies HiringOurHeroes.org Info Close Find Your Next Dream Job Connecting Skilled Military-Community Talent With American Businesses Search Latest Jobs Supervisor (Commercial) Paragon Systems • Burnsville, MN, US • 1h ago veteran 1h ago Apply Armed Security Officer Paragon Systems • Full-time • Alameda, CA, US • 1h ago veteran 1h ago Apply Federal Tax Compliance Senior Manager Andersen Tax LLC • Full-time • Seattle, Washington, United States • 2h ago 2h ago Apply Mobile Associate - Retail Sales T-Mobile • Part-time • New Prague, MN, US • $19 - $20 / hour • 4h ago 4h ago Apply Mobile Associate - Retail Sales T-Mobile • Part-time • Half Moon Bay, CA, US • 4h ago 4h ago Apply Mobile Associate - Retail Sales T-Mobile • Part-time • Nashua, NH, US • $19 - $20 / hour • 4h ago 4h ago Apply Yard Hostler Southern Glazer's Wine & Spirits • Baton Rouge • 4h ago 4h ago Apply Trade Development Director - PA Southern Glazer's Wine & Spirits • King of Prussia • 4h ago 4h ago Apply Sales Consultant II - On Premise (Las Vegas, NV) Southern Glazer's Wine & Spirits • Las Vegas • 4h ago 4h ago Apply Business Development Manager/Wagner Family of Wines/Upstate NY Southern Glazer's Wine & Spirits • Henrietta • 4h ago 4h ago Apply Merchandiser Southern Glazer's Wine & Spirits • Carmel • 4h ago 4h ago Apply Night Warehouse Associate - Union Southern Glazer's Wine & Spirits • Linden • 4h ago 4h ago Apply Business Development Manager (On Premise)- Portland Southern Glazer's Wine & Spirits • Wilsonville • 4h ago 4h ago Apply Field Sales Manager - Edmonton, AB (Full Book) Southern Glazer's Wine & Spirits • Calgary • 4h ago 4h ago Apply Warehouse Facilities Mechanic Nights Southern Glazer's Wine & Spirits • Shakopee • 4h ago 4h ago Apply AR Supervisor Southern Glazer's Wine & Spirits • Dallas • 4h ago 4h ago Apply Yard Hostler Southern Glazer's Wine & Spirits • Katy • 4h ago 4h ago Apply Sales Consultant II - Off Premise - Grocery (Las Vegas, NV) Southern Glazer's Wine & Spirits • Las Vegas • 4h ago 4h ago Apply Chain Sales Merchandiser, CPWS - Burbank, CA Southern Glazer's Wine & Spirits • Burbank • 4h ago 4h ago Apply Warehouse Worker Night - Supplemental Southern Glazer's Wine & Spirits • Shakopee • 4h ago 4h ago Apply Director of Logistics Southern Glazer's Wine & Spirits • Glenwillow • 4h ago 4h ago Apply Route Driver A - FTM Southern Glazer's Wine & Spirits • Fort Myers • 4h ago 4h ago Apply Sales Consultant - Off Premise (Tempe, South Phoenix, AZ) Southern Glazer's Wine & Spirits • Tempe • 4h ago 4h ago Apply Merchandiser (Longmont, CO) Southern Glazer's Wine & Spirits • Longmont • 4h ago 4h ago Apply Staff Cybersecurity Penetration Tester Southern Glazer's Wine & Spirits • Dallas • 4h ago 4h ago Apply Browse All Jobs Featured Companies Amazon 101 jobs Amazon Web Services 75 jobs Toyota 137 jobs APi Group 12 jobs Johnson & Johnson 220 jobs LinkedIn 202 jobs Brazen 21 jobs Booz Allen Hamilton 92 jobs NBCUniversal 206 jobs Comcast 871 jobs HCA Healthcare 621 jobs Comerica 131 jobs CBRE 66 jobs Prudential 76 jobs Wells Fargo 7947 jobs General Motors 298 jobs Google 92 jobs Lockheed Martin 2393 jobs Salesforce 82 jobs USAA 183 jobs View All Companies Get a - Daily Weekly email of all new jobs Subscribe This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. RSS • Jobs • Contact Us • Privacy © 2025 Hiring Our Heroes Job Board Session Expired Your session has expired. Please login again to continue. Go To Login"
    }
  ]
}