{
  "fuentes": [
    {
      "url": "https://www.hialeahfl.gov/730/Bucky-Dent-Water-Park",
      "email": "madiaz@hialeahfl.gov"
    },
    {
      "url": "https://www.hialeahfl.gov/730/Bucky-Dent-Water-Park",
      "email": "and16329@hialeahfl.gov"
    },
    {
      "url": "https://www.hialeahfl.gov/793/Milander-Aquatic-Center",
      "email": "jhorrego@hialeahfl.gov"
    },
    {
      "url": "https://www.hialeahfl.gov/793/Milander-Aquatic-Center",
      "email": "kh8159@hialeahfl.gov"
    },
    {
      "url": "https://www.hialeahfl.gov/793/Milander-Aquatic-Center",
      "email": "ymcastro@hialeahfl.gov"
    },
    {
      "url": "https://www.hialeahfl.gov/336/Recreational-Facilities",
      "email": "recreation@hialeahfl.gov"
    },
    {
      "url": "https://lacrosse.travelsports.com/facilities/russell-bucky-dent-park/travel-guide",
      "email": "hank@limostar.com"
    },
    {
      "url": "https://lacrosse.travelsports.com/facilities/russell-bucky-dent-park/travel-guide",
      "email": "info@travelsports.com"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "email": "tstuder@astrosecuritymonitoring.com"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://www.hialeahfl.gov/733/Russell-Bucky-Dent-Park",
      "email": "agallegodiaz@hialeahfl.gov"
    }
  ],
  "mails": [
    "agallegodiaz@hialeahfl.gov",
    "and16329@hialeahfl.gov",
    "asset-1@2x.png",
    "cservice@thisistheplace.org",
    "customerservice@thisistheplace.org",
    "hank@limostar.com",
    "info@travelsports.com",
    "jhorrego@hialeahfl.gov",
    "kh8159@hialeahfl.gov",
    "madiaz@hialeahfl.gov",
    "recreation@hialeahfl.gov",
    "tkramer@thisistheplace.org",
    "tstuder@astrosecuritymonitoring.com",
    "ymcastro@hialeahfl.gov",
    "you@domain.com"
  ],
  "nombre_sitio": "hialeahfl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hialeahfl.gov/730/Bucky-Dent-Water-Park",
      "text": "Bucky Dent Water Park | Hialeah, FL Skip to Main Content Traffic Advisory Road Closure at W 29th Street from W 1st Avenue to W 4th Avenue. Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Community Development Milander Center Public Works /QuickLinks.aspx Search City Government Departments Residents Doing Business How Do I... Home Departments Parks & Community Engagement Parks / Pools Water Parks & Pools Bucky Dent Water Park Bucky Dent Water Park Hours of Operation Bucky Dent Water Park is temporarily closed for repairs. We'll be back soon! Swim Lessons For information on swim lessons, please contact Atlantis Swim School. All swim lessons are hosted at Bucky Dent Park Water Park and Milander Aquatic Center. Atlantis Swim School www.Atlantisswimschool.com Atlantisswimschool@gmail.com 786-916-4914 Pool Info Phone Number 305-818-2990 Address 2240 West 60 Street Hialeah, FL 33016 Aquatic Manager Miguel Diaz Assist. Aquatic Manager Tatiana Fernandez Click Here to Email Us Click Here for Directions Babcock Pool Bright Pool Bucky Dent Water Park McDonald Water Park Milander Aquatic Center Reid Pool Walker Pool Job Opportunities Water Advisories Meetings & Agendas Report A Problem Parks & Community Engagement Tyler CSS Permits & Inspections Business Tax Planning & Zoning 501 President Donald J. Trump Avenue,           Hialeah, Florida 33010 Phone: 305-883-5800 Popular Pages Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx FAQs Miami-Dade Count Vote by Mail Miami-Dade Count Voter Registration Make Payments for Public Works /QuickLinks.aspx Site Links Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.hialeahfl.gov/793/Milander-Aquatic-Center",
      "text": "Milander Aquatic Center | Hialeah, FL Skip to Main Content Traffic Advisory Road Closure at W 29th Street from W 1st Avenue to W 4th Avenue. Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Community Development Milander Center Public Works /QuickLinks.aspx Search City Government Departments Residents Doing Business How Do I... Home Departments Parks & Community Engagement Parks / Pools Water Parks & Pools Milander Aquatic Center Milander Aquatic Center Hours of Operation Welcome to Milander Aquatic Center! The following are the hours of operation: Hours of Operation: Mon. & Wed. 5:30am - 9:00pm Tues., Thurs., Fri. 7:30am - 9:00pm Saturday 7:30am - 3:30pm Pricing & Admissions Daily Fee:$3 (Residents) $2 (Seniors) Monthly Membership: $25 (Residents) $15 (Seniors) *Membership also includes use of Bucky Dent Water Park for open lap swimming* Milander Aquatic Center Price Sheet Swim Lessons For information on swim lessons, please contact Atlantis Swim School. Atlantis Swim School www.Atlantisswimschool.com Atlantisswimschool@gmail.com 786-916-4914 Pool Info Phone Number 305-822-2931 Address 4820 Palm Avenue Hialeah, FL 33012 Aquatic Coordinator Helen Regalado Assistant Aquatic Manager Julio Horrego Click Here to Email Us Click Here for Directions Babcock Pool Bright Pool Bucky Dent Water Park McDonald Water Park Milander Aquatic Center Reid Pool Walker Pool Job Opportunities Water Advisories Meetings & Agendas Report A Problem Parks & Community Engagement Tyler CSS Permits & Inspections Business Tax Planning & Zoning 501 President Donald J. Trump Avenue,           Hialeah, Florida 33010 Phone: 305-883-5800 Popular Pages Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx FAQs Miami-Dade Count Vote by Mail Miami-Dade Count Voter Registration Make Payments for Public Works /QuickLinks.aspx Site Links Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.hialeahfl.gov/336/Recreational-Facilities",
      "text": "Recreational Facilities | Hialeah, FL Skip to Main Content Traffic Advisory Road Closure at W 29th Street from W 1st Avenue to W 4th Avenue. Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Community Development Milander Center Public Works /QuickLinks.aspx Search City Government Departments Residents Doing Business How Do I... Home Departments Parks & Community Engagement Parks / Pools Recreational Facilities Recreational Facilities 9 1 1 4 Benny Babcock Park Babcock Park is one of seven recreational facilities with a swimming pool. Although the pool is only open seasonally, Babcock Pool is a great place to spend a hot summer day. Click here for more fun facts! James H. Bright Park Bright Park is named after James H. Bright, one of the founding fathers of the City of Hialeah and the Hialeah Park Casino & Race Track. Click here for more fun facts! Russell \"Bucky\" Dent Park Bucky Dent Park is home to the City's only indoor basketball gymnasium. The gymnasium is occasionally used to host college basketball and volleyball games. Click here for more fun facts! Johnny L. Cotson Park Cotson Park was previously named Seminola Park until the City voted to recognize Johnny L. Cotson Sr. for his active role to better his community. Click here for more fun facts! James H. Goodlet Park Goodlet Park is also home to Goodlet Tennis Center and Goodlet Theater; two sub-sections of the park that offer athletic and cultural art opportunities respectively for our residents. Click here for more fun facts! David H. McDonald Park McDonald Park is a popular destination to host outdoor gatherings such as birthday parties or baby showers with its wide selection of gazebos. Click here for more fun facts! Henry Milander Park Milander Park is also home to Ted Hendricks Stadium which is most commonly utilized by local high schools to host their sporting events throughout the school year. Click here for more fun facts! Leon H. O'Quinn Park Thanks to assistance from Miami-Dade County, O'Quinn Park went through extensive renovations in 2014. Click here for more fun facts! Palm Lakes Park Palm Lakes Park is one of only two recreational facilities not names after someone. Click here for more fun facts! Carl F. Slade Park Slade Park is also utilized by the adjacent school, Hialeah Educational Academy during school hours to provide students with an outdoor element to their day. Click here for more fun facts! Southeast Park Sometimes referred to as the \"hidden gem\" of Hialeah parks, Southeast Park was home to many avid park-goers who went on to become prominent high school and college athletes. Click here for more fun facts! G.C. Sparks Park Sparks Park is used as a \"play site\" for all sports cycles throughout the City's recreational sports calendar. Click here for more fun facts! Senator Roberto Casas Park Senator Roberto Casas Park is the 15th and most recently added recreational facility in the City of Hialeah. Click here for more fun facts! James Silas Walker Community Center A monument dedicated to the Federation of Exiled Cuban Freemasons is also located at Walker Community Center. Click here for more fun facts! Victor Wilde Community Center Wilde Community Center is the only recreational facility with a banquet hall capable of hosting events of 200+ people. Click here for more fun facts! Department Info Phone Number 305-687-2650 Address 900 E 56 Street Building #4 Hialeah, FL 33013 Main Office Hours of Operation Monday - Friday 8:00am - 4:00pm Click Here to Email Us Click Here for Directions Click Here for Our Staff Directory Benny Babcock Park James H. Bright Park Russell \"Bucky\" Dent Park Johnny L. Cotson Park James H. Goodlet Park David H. McDonald Park Henry Milander Park Leon H. O'Quinn Park Palm Lakes Park Carl F. Slade Park Southeast Park G.C. Sparks Park Senator Roberto Casas Park James Silas Walker Community Center Victor Wilde Community Center Job Opportunities Water Advisories Meetings & Agendas Report A Problem Parks & Community Engagement Tyler CSS Permits & Inspections Business Tax Planning & Zoning 501 President Donald J. Trump Avenue,           Hialeah, Florida 33010 Phone: 305-883-5800 Popular Pages Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx FAQs Miami-Dade Count Vote by Mail Miami-Dade Count Voter Registration Make Payments for Public Works /QuickLinks.aspx Site Links Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://lacrosse.travelsports.com/facilities/russell-bucky-dent-park/travel-guide",
      "text": "Russell Bucky Dent Park - Sports Facility in Hialeah, FL - Travel Sports Russell Bucky Dent Park Travel Guide Hialeah, FL Share Print In Miami, Florida, a team of young athletes will discover an array of exciting activities to enjoy. From thrilling sports adventures to team-building experiences, Miami offers something for everyone. Here are some fun things that your team can do in the Miami Area: - Hit the waves: Take advantage of Miami's stunning beaches and try out water sports such as surfing, paddleboarding, or kayaking. - Explore the Everglades: Embark on an unforgettable airboat tour through the picturesque Everglades, spotting unique wildlife and immersing yourselves in nature. - Test your skills on the field: Rent a sports complex and engage in friendly matches across various disciplines, including soccer, football, or basketball. - Visit a professional sports event: Cheer on Miami's renowned sports teams, such as the Miami Heat basketball team or the Miami Dolphins football team, and witness thrilling live matches. - Venture into the air and skydive: Experience the ultimate adrenaline rush as you jump from a plane and take in breathtaking views of the Miami skyline while skydiving. Miami offers endless options for young athletes to have an unforgettable time, combining exhilarating activities with the vibrant culture of this tropical city. Planning Ahead Transportation Rent a charter bus or find a rental car in Hialeah STAR TRANSPORTATION Eagan, MN\n                                    (1493.32 miles) Star is your one-stop shop for professional transportation services.  We offer a diverse fleet of vehicles including 2024-2025 model year Prevost and MCI 56 passenger motor coaches, mini-coaches, passenger vans, SUVs, sedans, and mini-vans.\n\nWe specialize in transportation anywhere in Minnesota and beyond.  Sports teams, school events, airport transfers, point to point, charters, over the road trips and much more. Fleet of over 70 vehicles, and experienced, professional drivers.\n\n24 hour dispatch and reservations.  Family owned and operated for over 27 years.  New model vehicles, safe, professional, friendly drivers.  Licensed and insured.  USDOT 686106.  \n\nAsk for \nHank Miller\nCharter, Groups & Events Specialist\nhank@limostar.com While You're Here Places to Eat Team-friendly restaurants near Russell Bucky Dent Park Chipotle Mexican Grill Hialeah, FL\n                                    (1.9 miles) Panera Bread Doral, FL\n                                    (4.6 miles) Buffalo Wild Wings Miami, FL\n                                    (6.87 miles) Things to Do Need a team activity for the weekend? Launch Trampoline Park - Doral Doral, FL\n                                    (5.37 miles) entertainment center Topgolf - Miami - Doral Doral, FL\n                                    (6.75 miles) entertainment center Dave & Busters - Miami Miami, FL\n                                    (6.92 miles) entertainment center Monster Mini Golf Miramar, FL\n                                    (7.26 miles) mini-golf course Delirium Axe Throwing – Miami Miami, FL\n                                    (7.97 miles) axe throwing In case of emergencies Shops Forget to pack something? Dick's Sporting Goods PEMBROKE, FL\n                                    (9.07 miles) Dick's Sporting Goods Miami, FL\n                                    (9.58 miles) Dick's Sporting Goods AVENTURA, FL\n                                    (12.36 miles) Dick's Sporting Goods DADELAND STATION, FL\n                                    (12.68 miles) Dick's Sporting Goods Miami, FL\n                                    (13.33 miles) Map Notes Print this page and write notes here Share Print Regions All Regions 🇺🇸 United States Alabama Alabama Birmingham (AL) Area Huntsville Area Mobile Area Montgomery Area Alaska Alaska Anchorage Area Fairbanks Area Arizona Arizona Phoenix Area Tucson Area Arkansas Arkansas Little Rock Area California Bay Area California Fresno Area Los Angeles Area Sacramento Area San Diego Area Colorado Colorado Colorado Springs Area Denver Area Fort Collins Area Connecticut Connecticut Hartford Area New Haven Area Stamford Area Delaware Delaware Wilmington, DE Area District of Columbia D.C. Area Florida Florida Fort Myers Area Jacksonville Area Miami Area Orlando Area Tallahassee Area Tampa Area West Palm Beach Area Georgia Atlanta Area Georgia Hawaii Hawaii Honolulu Area Idaho Boise Area Idaho Illinois Chicago Area Illinois Rockford Area Springfield (IL) Area Indiana Evansville Area Fort Wayne Area Indiana Indianapolis Area South Bend Area Iowa Cedar Rapids - Iowa City Area Des Moines Area Iowa Quad Cities Area Kansas Kansas Topeka Area Wichita Area Kentucky Kentucky Lexington Area Louisville Area Louisiana Baton Rouge Area Louisiana New Orleans Area Shreveport Area Maine Bangor Area Maine Portland (ME) Area Maryland Baltimore Area Maryland Massachusetts Boston Area Massachusetts Springfield Area Worcester Area Michigan Ann Arbor Area Detroit Area Grand Rapids - Holland Area Michigan Minnesota Duluth Area Minneapolis Area Minnesota Rochester (MN) Area Mississippi Jackson Area Mississippi Missouri Kansas City Area Missouri Springfield (MO) Area St. Louis Area Montana Billings Area Bozeman Area Missoula Area Montana Nebraska Lincoln Area Nebraska Omaha Area Nevada Las Vegas Area Nevada Reno Area New Hampshire Manchester (NH) Area New Hampshire New Jersey New Jersey Newark Area New Mexico Albuquerque Area New Mexico New York Albany Area Buffalo Area Lake Placid Area Long Island Area New York NYC Area Rochester Area Syracuse Area Utica Area North Carolina Charlotte Area Fayetteville Area Greensboro-Winston-Salem Area North Carolina Raleigh-Durham Area Wilmington Area North Dakota Bismarck Area Fargo Area Grand Forks Area North Dakota Ohio Cincinnati Area Cleveland Area Columbus Area Ohio Toledo Area Oklahoma Oklahoma Oklahoma City Area Tulsa Area Oregon Bend Area Eugene Area Oregon Portland Area Pennsylvania Allentown Area Erie Area Harrisburg Area Pennsylvania Philadelphia Area Pittsburgh Area Puerto Rico Puerto Rico San Juan Area Rhode Island Providence Area Rhode Island South Carolina Charleston Area Columbia Area South Carolina South Dakota Sioux Falls Area South Dakota Tennessee Chattanooga Area Knoxville Area Memphis Area Nashville Area Tennessee Texas Austin Area Corpus Christi Area Dallas Area El Paso Area Houston Area San Antonio Area Texas Utah Salt Lake City Area Utah Vermont Burlington Area Vermont Virginia Norfolk Area Richmond Area Virginia Washington Seattle Area Spokane Area Washington West Virginia Charleston (WV) Area West Virginia Wisconsin Green Bay Area Madison Area Milwaukee Area Wisconsin Wyoming Casper Area Cheyenne Area Wyoming 🇨🇦 Canada Alberta Alberta Calgary Area Edmonton Area British Columbia British Columbia Vancouver Area Vancouver Island Area Manitoba Manitoba Winnipeg Area New Brunswick Fredericton Area Moncton Area New Brunswick Saint John Area Newfoundland and Labrador Newfoundland and Labrador St. John's Area Northwest Territories Northwest Territories Yellowknife Area Nova Scotia Halifax Area Nova Scotia Sydney Area Nunavut Iqaluit Area Nunavut Ontario Hamilton Area Kingston Area London (ON) Area Niagara Falls Area Ontario Ottawa Area Thunder Bay Area Toronto Area Waterloo Area Prince Edward Island Charlottetown Area Prince Edward Island Quebec Montreal Area Quebec Quebec City Area Sherbrooke Area Saskatchewan Regina Area Saskatchewan Saskatoon Area Yukon Whitehorse Area Yukon 🇦🇺 Australia Australian Capital Territory Australian Capital Territory Canberra Area New South Wales New South Wales Newcastle Area Sydney Area Wollongong Area Northern Territory Darwin Area Northern Territory Queensland Brisbane Area Bundaberg Area Cairns Area Gold Coast Area Mackay Area Queensland Toowoomba Area Townsville Area South Australia Adelaide Area South Australia Tasmania Hobart Area Tasmania Victoria Ballart Area Bendigo Area Geelong Area Melbourne Area Victoria Western Australia Bunbury Area Mandurah Area Perth Area Western Australia 🇧🇸 Bahamas New Providence Nassau Area 🇧🇦 Bosnia and Herzegovina Federacija Bosna i Hercegovina Federacija Bosna i Hercegovina Sarajevo Area 🇧🇷 Brazil Amazonas Manaus Area Bahia Salvador Area Ceará Fortaleza Area Distrito Federal Brasília Area Minas Gerais Belo Horizonte Area Paraná Curitiba Area Rio de Janeiro Rio de Janeiro Area São Paulo São Paulo Area 🇭🇷 Croatia Karlovačka Karlovačka Osječko-Baranjska Osječko-Baranjska Primorsko-Goranska Primorsko-Goranska Sisačko-Moslavačka Sisačko-Moslavačka Zagrebačka Zagreb Area Zagrebačka 🇨🇿 Czech Republic Prague Prague Area 🇩🇰 Denmark Copenhagen City Copenhagen Area 🇪🇪 Estonia Harju Harju Tallinn Area Ida-Viru Ida-Viru Narva Area Pärnu Pärnu Area Tartu Tartu Area 🇫🇮 Finland Uusimaa Helsinki Area 🇫🇷 France Auvergne-Rhône-Alpes Lyon Area Île-de-France Paris Area Provence-Alpes-Côte d'Azur Marseille Area 🇩🇪 Germany Bavaria Munich Area Berlin Berlin Area Hamburg Hamburg Area Hesse Frankfurt Area North Rhine-Westphalia Cologne Area 🇬🇧 Great Britain England Birmingham Area England London Area Manchester Area Northern Ireland Northern Ireland Scotland Edinburgh Area Glasgow Scotland Wales Wales 🇬🇷 Greece Attica Athens Area Macedonia and Thrace Thessaloniki Area Peloponnese, Western Greece and the Ionian Islands Patras Area 🇭🇺 Hungary Budapest Budapest Area 🇮🇸 Iceland Capital Reykjavík Area 🇮🇹 Italy Campania Naples Area Emilia-Romagna Bologna Area Friuli-Venezia Giulia Trieste Area Lazio Rome Area Lombardy Milan Area Piedmont Turin Area Veneto Venice Area 🇯🇲 Jamaica Kingston Kingston Area 🇱🇻 Latvia Riga Riga Area 🇱🇹 Lithuania Kaunas Kaunas Area Vilnius Vilnius Area 🇲🇽 Mexico Aguascalientes Aguascalientes Baja California Baja California Baja California Sur Baja California Sur Campeche Campeche Chiapas Chiapas Chihuahua Chihuahua Coahuila Coahuila Colima Colima Durango Durango Federal District Federal District Mexico City Area Guanajuato Guanajuato Guerrero Guerrero Hidalgo Hidalgo Jalisco Jalisco México State México State Toluca Area Michoacán Michoacán Morelos Morelos Nayarit Nayarit Nuevo León Monterrey Area Nuevo León Oaxaca Oaxaca Puebla Puebla Querétaro Querétaro Quintana Roo Quintana Roo San Luis Potosí San Luis Potosí Sinaloa Sinaloa Sonora Sonora Tabasco Tabasco Tamaulipas Tamaulipas Tlaxcala Tlaxcala Veracruz Veracruz Yucatán Yucatán Zacatecas Zacatecas 🇲🇨 Monaco Monaco Monaco Area 🇳🇿 New Zealand Auckland Auckland Aukland Area Bay of Plenty Bay of Plenty Tauranga Area Whakatane Area Canterbury Canterbury Christchurch Area Hawke's Bay Hawke's Bay Napier Area Manawatu-Wanganui Manawatu-Wanganui Palmerston North Area Northland Northland Whangarei Area Otago Dunedin Area Otago Southland Invercargill Area Southland Taranaki Stratford Area Taranaki Tasman Richmond Area Tasman Waikato Hamilton Area Waikato Wellington Wellington Area West Coast Greymouth Area West Coast 🇳🇴 Norway Hordaland Bergen Area Oslo Oslo Area 🇵🇰 Pakistan Balochistan Quetta Area Islamabad Islamabad Area Punjab Faisalabad Area Gujranwala Area Lahore Area Multan Area Sindh Hyderabad Area Karachi Area 🇵🇹 Portugal Lisboa Lisbon Area Porto Porto Area 🇮🇪 Republic of Ireland Dublin Dublin Area 🇷🇴 Romania Bucharest Bucharest Area 🇷🇸 Serbia Belgrade Belgrade Area North Bačka North Bačka South Bačka Novi Sad Area South Bačka 🇸🇰 Slovakia Bratislava Bratislava Area 🇸🇮 Slovenia Gorenjska Gorenjska Osrednjeslovenska Ljubljana Area Osrednjeslovenska Podravska Podravska Savinjska Savinjska 🇪🇸 Spain Barcelona Barcelona Area Madrid Madrid Area Sevilla Sevilla Area 🇸🇪 Sweden Stockholm Stockholm Area 🇨🇭 Switzerland Bern Bern Area Geneva Geneva Area Graubünden Davos Area Zurich Zurich Area 🇹🇭 Thailand Bangkok Metropolis Bangkock Area 🇦🇪 United Arab Emirates Dubay Dubai Area Sports All Sports Hockey Baseball Softball Lacrosse Soccer Basketball Curling Field Hockey Figure Skating Football Golf Irish Dance Rugby Volleyball Events Tournaments All Sports Hockey Baseball Softball Lacrosse Soccer Basketball Curling Field Hockey Figure Skating Football Golf Irish Dance Rugby Volleyball Camps & Clinics All Sports Hockey Baseball Softball Lacrosse Soccer Basketball Curling Field Hockey Football Golf Rugby Volleyball Facilities All Facilities Axe Throwing Basketball Court (Outdoor) Batting Cage BMX Track Boathouse Bocce Court Bowling Alley Boxing Facility Climbing Wall Convention Center Corn Hole Facility Cricket Ground Cross Country Course Curling Facility Dance Studio Disc Golf Course Driving Range Entertainment Center Equestrian Center Field Fieldhouse/Gym Fitness Center Futsal Court Go-Kart Track Golf Course Golf Simulator Gymnastics Facility Harbor Ice Rink Indoor Training Facility Inline/Roller Rink Mini-Golf Course Mountain Mountain Bike Trail Outdoor Ice Rink Padel Court Pickleball Court Platform Tennis (Paddle) Court Pool Racquetball Court Rifle Range Rodeo Facility Ropes Course Ski Resort Squash Court Stadium Tennis Court Track & Field Velodrome Volleyball Court - Sand/Grass Water Venue Shops Brick & Mortar Online Marketplace Categories Accessories Art & Collectibles Bags & Purses Bath & Beauty Books, Movies & Music Craft Supplies & Tools Electronics & Accessories Home & Living Jewelry Paper & Party Supplies Pet Supplies Toys & Games Weddings Team Services Fundraising Hotels Restaurants Sports Medicine Transportation Forum Forum Ages Youth HighSchool College Adult Categories Announcements Camps & Clinics Clubs Coaches Equipment Facilities Fundraising Gifts Hotels Leagues Nutrition Other Playoffs Restaurants Reviews Shops Sports Medicine Things to Do Tournaments Training Transportation Sports Hockey Baseball Softball Lacrosse Soccer Basketball Curling Field Hockey Figure Skating Football Golf Irish Dance Rugby Volleyball Blog Lists Newsletter News Gear Guides Register Login Feedback Lacrosse Facilities Near me All Lacrosse Facilities Tournaments All Lacrosse Tournaments Ages U8 Boys U9 Boys U10 Boys U11 Boys U12 Boys U13 Boys U14 Boys U15 Boys U16 Boys U17 Boys U18 Boys U19 Men U21 Men U8 Girls U9 Girls U10 Girls U11 Girls U12 Girls U13 Girls U14 Girls U15 Girls U16 Girls U17 Girls U21 Women 2006 (24) 2007 (25) 2008 (26) 2009 (27) 2010 (28) 2011 (29) 2012 (30) 2013 (31) 2014 (32) 2015 (33) 2016 (34) 2017 (35) 2018 (36) 2019 (37) MS Girls MS Boys JV Girls JV Boys Prep Boys High School Girls High School Boys College Men College Women Adult Men Adult Women 18+ 27+ 30+ 35+ 40+ 45+ 50+ 55+ 60+ Divisions Novice Recreational Travel Elite Invitation AA A B C Bantam Peewee Midget Boys Girls High School College College - NJCAA Men College - NAIA Men College - NAIA Women College - U Sports College - NCAA D1 Men College - NCAA D2 Men College - NCAA D3 Men College - NCAA D1 Women College - NCAA D2 Women College - NCAA D3 Women Professional Adult Adult Men Adult Women Dates Sep 5 - 7, 2025 Sep 12 - 14, 2025 Sep 19 - 21, 2025 Sep 26 - 28, 2025 Oct 3 - 5, 2025 Columbus Day Oct 10 - 12, 2025 Oct 17 - 19, 2025 Oct 24 - 26, 2025 Oct 31 - Nov 2, 2025 Nov 7 - 9, 2025 Nov 14 - 16, 2025 Nov 21 - 23, 2025 Thanksgiving Nov 28 - 30, 2025 Dec 5 - 7, 2025 Dec 12 - 14, 2025 Dec 19 - 21, 2025 Christmas Dec 26 - 28, 2025 New Years Jan 2 - 4, 2026 Jan 9 - 11, 2026 Martin Luther King (MLK) Day Jan 16 - 18, 2026 Jan 23 - 25, 2026 Jan 30 - Feb 1, 2026 Feb 6 - 8, 2026 Presidents' Day Feb 13 - 15, 2026 Feb 20 - 22, 2026 Feb 27 - Mar 1, 2026 Mar 6 - 8, 2026 St. Patrick's Day Mar 13 - 15, 2026 Mar 20 - 22, 2026 Mar 27 - 29, 2026 Apr 3 - 5, 2026 Apr 10 - 12, 2026 Apr 17 - 19, 2026 Apr 24 - 26, 2026 May 1 - 3, 2026 May 8 - 10, 2026 May 15 - 17, 2026 Memorial Day May 22 - 24, 2026 May 29 - 31, 2026 Jun 5 - 7, 2026 Jun 12 - 14, 2026 Jun 19 - 21, 2026 Jun 26 - 28, 2026 Jul 3 - 5, 2026 Jul 10 - 12, 2026 Jul 17 - 19, 2026 Jul 24 - 26, 2026 Champions All Lacrosse Champions Add your champion team Clubs All Lacrosse Clubs Ages U8 Boys U9 Boys U10 Boys U11 Boys U12 Boys U13 Boys U14 Boys U15 Boys U16 Boys U17 Boys U18 Boys U19 Men U20 Men U21 Men U22 Men U8 Girls U9 Girls U10 Girls U11 Girls U12 Girls U13 Girls U14 Girls U15 Girls U16 Girls U17 Girls U18 Girls U19 Women 2006 (24) 2007 (25) 2008 (26) 2009 (27) 2010 (28) 2011 (29) 2012 (30) 2013 (31) 2014 (32) 2015 (33) 2016 (34) MS Girls MS Boys JV Girls JV Boys High School Girls High School Boys College Men College Women Adult Men Adult Women Divisions Mini Minor Major Junior Recreational Travel AA A Boys Girls High School College College - NJCAA Men College - NJCAA Women College - GLLL College - MCLA Div I College - MCLA Div II College - NAIA Men College - NAIA Women College - NCAA D1 Men College - NCAA D2 Men College - NCAA D3 Men College - NCAA D1 Women College - NCAA D2 Women College - NCAA D3 Women Professional Leagues All Lacrosse Leagues Clinics All Lacrosse Clinics Ages U8 Boys U9 Boys U10 Boys U11 Boys U12 Boys U13 Boys U14 Boys U15 Boys U8 Girls U9 Girls U10 Girls U11 Girls U12 Girls U13 Girls U14 Girls U15 Girls 2006 (24) 2007 (25) 2008 (26) 2009 (27) 2010 (28) 2011 (29) 2012 (30) 2013 (31) 2014 (32) 2015 (33) 2016 (34) 2017 (35) 2018 (36) MS Girls JV Boys High School Girls High School Boys College Men College Women Adult Men Adult Women Divisions Travel Elite Invitation AA A B Boys Girls Prep High School College College - NCAA D1 Men Professional Adult Specialties Camp/Clinic Combine Core Faceoff Functional Goalie Positional Showcase Coaches All Lacrosse Coaches Ages U11 Boys U12 Boys U13 Boys U14 Boys U16 Boys U17 Boys U18 Boys U22 Men U9 Girls U12 Girls 2011 (29) 2016 (34) High School Girls High School Boys College Men Adult Men Adult Women Levels Recreational Travel Boys Girls Prep High School College Specialties Combine Core Functional Goalie Positional Showcase Tryouts Copyright © 2025 Travel Sports Quick Links Homepage Regions Blog Videos Follow Us Information Links About Bug Report / Feature Request Privacy Terms of Use Contact Us info@travelsports.com For Parents Sign up for free to get a personalized experience\n    tailored to you and your players. Our Blog Find A Coach Your Favorite Local Club Discover Tournaments Camps And Clinics Rent Ice Create Your Free Account Join TravelSports.com Write or check out a review on your favorite local club. Find upcoming camps and clinics that you want to sign up for. Discover tournaments in your area or in other states. Are you a business owner? Learn more about how you can reach local sports fanatics through\n                            TravelSports.com Sign Up Now Already have an account? Login Don't leave yet! Subscribe to our newsletter to stay up to date with youth sports in your area Which sports are you interested in? Hockey Figure Skating Lacrosse Baseball Softball Irish Dance Basketball Volleyball Curling Axe Throwing Golf Soccer BMX Racing Rugby Field Hockey Football Subscribe for free Are you a business owner? Learn more about how you can reach local sports fanatics through\n                            TravelSports.com x"
    },
    {
      "url": "https://www.astrosecuritymonitoring.com/contact",
      "text": "Contact | Reach Us Today — Astro Security Monitoring 0 Skip to Content Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu Astro Security Monitoring About Services Videos Contact PAY INVOICE Open Menu Close Menu About Services Videos Contact PAY INVOICE Get in Touch Looking to schedule a service call or an estimate, call or email Troy at: (916) 252-9121 tstuder@astrosecuritymonitoring.com or fill out the form below. Name * First Name Last Name Phone * (###) ### #### Email * Message * Thank you! Astro Security Monitoring 4799 24th Street Sacramento , CA 95822 Sales & Service (916) 252-9121 tstuder@astrosecuritymonitoring.com To Cancel an Alarm Activation Call: (888) 610-4366 The monitoring center is available 24 hrs a day 365 days a year! Make sure you have your account # ready. ACO License 5779 & Contractors License C7 804676"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Updates First Name Last Name Email Department - Select Department - Weddings Events Corporate Groups Dining General Admission Media / Press Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://www.hialeahfl.gov/733/Russell-Bucky-Dent-Park",
      "text": "Russell \"Bucky\" Dent Park | Hialeah, FL Skip to Main Content Traffic Advisory Road Closure at W 29th Street from W 1st Avenue to W 4th Avenue. Read On... Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Community Development Milander Center Public Works /QuickLinks.aspx Search City Government Departments Residents Doing Business How Do I... Home Departments Parks & Community Engagement Parks / Pools Recreational Facilities Russell \"Bucky\" Dent Park Russell \"Bucky\" Dent Park Park Amenities Welcome to Bucky Dent Park! This 25 acre recreational facility has the following park amenities: Lighted youth softball fields (4) Basketball gymnasium Children's playground Gazebo Recreation building Outdoor fitness area Skate park Fun Facts! Bucky Dent Park is named after Russell Earl \"Bucky\" Dent, a former major league baseball player and manager. Bucky Dent Park is home to the City's only indoor basketball gymnasium. The gymnasium is occasionally used to host college basketball and volleyball games. Bucky Dent Park hosted a Presidential Town Hall Meeting in 2018 in which President Trump visited the City of Hialeah to speak about the importance of local government and answer various questions from local business owners and residents. Park Info Phone Number 305-818-9168 Address 2250 West 60 Street Hialeah, FL 33016 Hours of Operation Monday - Friday 2:00pm - 9:00pm Saturday & Sunday 9:30am - 5:30pm Staff Info Park Manager Anthony Gallego Assistant Park Manager Santiago Ante Click Here for Directions Benny Babcock Park James H. Bright Park Russell \"Bucky\" Dent Park Johnny L. Cotson Park James H. Goodlet Park David H. McDonald Park Henry Milander Park Leon H. O'Quinn Park Palm Lakes Park Carl F. Slade Park Southeast Park G.C. Sparks Park Senator Roberto Casas Park James Silas Walker Community Center Victor Wilde Community Center Job Opportunities Water Advisories Meetings & Agendas Report A Problem Parks & Community Engagement Tyler CSS Permits & Inspections Business Tax Planning & Zoning 501 President Donald J. Trump Avenue,           Hialeah, Florida 33010 Phone: 305-883-5800 Popular Pages Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx FAQs Miami-Dade Count Vote by Mail Miami-Dade Count Voter Registration Make Payments for Public Works /QuickLinks.aspx Site Links Make Payments for Public Works Search Maps Email Updates Media Gallery Report Problems City Photo Credits /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}