{
  "fuentes": [
    {
      "url": "https://www.tpkbrewing.com/careers",
      "email": "info@tpkbrewing.com"
    },
    {
      "url": "https://www.tpkbrewing.com/careers",
      "email": "info@tpkbrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://www.ocalamarion.com/food-drink/wineries-breweries-distilleries/",
      "email": "exploreocalamarion@marionfl.org"
    }
  ],
  "mails": [
    "accounts.payable@parkwaybrewing.com",
    "events@parkwaybrewing.com",
    "exploreocalamarion@marionfl.org",
    "grant@parkwaybrewing.com",
    "info@tpkbrewing.com",
    "kim@parkwaybrewing.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com"
  ],
  "nombre_sitio": "hiatusbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tpkbrewing.com/careers",
      "text": "Careers | TPK BREWING CO. top of page ABOUT OUR STORY OUR MISSION OUR STAFF PAST NEWSLETTERS TAVERN FOOD TAPLIST COCKTAILS ZERO PROOF WINE & CIDER GIFT CARDS MERCH GAMING BOOK A GAME MEET THE GMS CORPORATE BOOKINGS PUBLISHED CONTENT WELCOME TO TPK EVENTS SPECIAL EVENTS GAMING CALENDAR FAQS CONTACT More Use tab to navigate through the menu items. Log In > CAREERS TPK Brewing Co. is a craft brewery and public house with a geeky twist! In addition to being your newest, family-friendly neighborhood tavern in Portland, we have a full-time staff of professional Game Masters running various tabletop roleplaying games (TTRPGs) for our patrons. Board game cafes have revolutionized how and where we play board games. We want to bring the revolution to roleplaying games by serving our guests original story content and thematic beer releases. ​ We are a majority queer, woman-of-color owned business, an equal opportunity employer, and deeply committed to diversity and inclusion in the workplace. We believe that imaginative social tabletop gaming is a transformational experience that has historically catered to a very small, exclusionary subset of the population. We exist to help break down those barriers and welcome everyone into the hobby by providing an accessible space to learn, adventure, and explore without judgment. In line with our mission, applicants from underrecognized groups are strongly encouraged to apply. ​ Please read our Code of Conduct here before applying. ​ Our open roles are listed below; if the page is blank, we are not currently hiring but feel free to send a resume to info@tpkbrewing.com and we'll keep it on file until we next open positions on the team. Bartender Part-Time VIEW ROLE We will keep it secret, we will keep it safe. SUBMIT Please verify your email to join the party, adventurer! SIGN UP FOR THE TPK BREWING CO. NEWSLETTER 5051 SE HAWTHORNE BLVD. PORTLAND, OR 97215 WEDNESDAY - MONDAY 11:00 AM - 11:00 PM TUESDAY 5:00 PM - 11:00 PM (503) 231-6354 INFO@TPKBREWING.COM CODE OF CONDUCT & ACCESSIBILITY PRIVACY POLICY CAREERS Special thank you to Simon Sotelo of Weird Wonderful for our main logo design, Lindsey Shea for our website photography, Alejandra Gutiérrez for our \"An Ale for Every Tale\" slogan design, Elodie Kahler for our building illustration, and Spyder for our Val'Ruvina staff portraits! ​ TPK BREWING CO. and AN ALE FOR EVERY TALE are registered trademarks of TPK Brewing, LLC. ​ Interested in supporting the brewery further? Take a look at our Patron Program here . ​ ​ bottom of page"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://www.ocalamarion.com/food-drink/wineries-breweries-distilleries/",
      "text": "Wineries, Breweries & Distilleries | Ocala / Marion County Florida Skip to content 0 Saved Plan Your Trip Get Our App Equestrian Content Navigation Things to Do Equestrian Outdoor Adventures Indoor Adventures Shopping Arts & Culture Golf Agritourism Spas & Wellness Day Trips & Scenic Drives Events Annual Events Horse Shows & Events Submit Your Event Community Calendar Where to Stay Hotels & Motels Campgrounds & RV Parks Vacation Rentals Bed & Breakfasts Food & Drink Wineries, Breweries & Distilleries Plan Your Visit Transportation Weather & Avg Temperatures FAQs Area Vacation Guide OcalaMarion Travel Guide App E-Newsletter Signup Tropical Weather Updates Plan Your Trip Get Our App Equestrian Content Meetings & Events Blog Sports Events Weddings About Us Partners Download Vacation Guide Email Newsletter Signup Get Exclusive Deals Home Food & Drink Wineries, Breweries & Distilleries Beers, Wines, & Spirits - All Locally Made in Marion County Share A charming locale in Central Florida, Ocala/Marion County is welcoming and eclecticâ¦ And thereâs something unique brewing in this off the beaten path location. So whatâs on tap in the area? We have assembled some local breweries, distilleries, and wine stops sure to deliver homemade local flavor. All these businesses make their own product! Pictured Whats On Tap Craft Beer Infinite Ale Works Letâs start with a couple breweries located right in the historic downtown Ocala area. Infinite Ale Works is the oldest brewery in the area, and with dozens of craft beers on tap, and with the ownerâs love of craft Belgian beers, it has become a favorite gathering for travelers and locals alike. Currently located in a repurposed auto service garage, Infinite is soon expanding to move into a repurposed fire house just a few blocks north! Big Hammock Brewery and Bites Big Hammock Brewery and Bites , also located in Downtown Ocala, not only offers 12 taps that feature a mix of BHB's own brews and rotating guest craft beers, but also a unique Asian menu with a twist, offering ramen bowls, Boa Buns, hot pretzels and more. While BHB is the newest brewery in town, its historic location is not. The brewery recently won a Beatification Award from the Historic Ocala Preservation Society for the revitalization of their building. Hiatus Brewing Company Conveniently located right on HWY 200, Hiatus Brewing Company offers a large and fun atmosphere along with their own hand crafted brews to enjoy. Their homegrown selections cover everything from a stout with dark chocolate and peanut flavor to a pineapple blonde, which you can pair with a pretzel and beer cheese, wings, street nachos or other delicious menu items. While you sip on your tap of choice, pick from an assortments of table top board games to play. To top it off, if you find a beer you love and want it for later, you can take a growler home with you! Wine Katya Vineyards Another Downtown Ocala favorite spot for the wine aficionados is Katya Vineyards , which previously won the overall gold medal for Best Florida Winery of the Year at the New York International Wine Competition. What started out as a family-owned winery, Katya Vineyards expanded to a fine dining restaurant with a friendly atmosphere offering an incredible selection of top wines, including their own. The family uses sustainable techniques to create white and red blends that are available to buy at the restaurant by the glass or bottle! Dragon Flower Winery Tucked away in the southern part of the county is the only winery in the destination that you can visit and enjoy the wine on property! Dragon Flower Winery is located in Summerfield, near Lake Weir and open Fridays through Sundays. The family who owns and runs the winery are born and raised Floridians who are always ready to talk handcrafted wine with guests. Every drop of wine sold is made personally by the family and for guests to enjoy as sample flights, by the glass, or by the bottle! Locally made craft beer and cheese and charcuterie boards are also available! While the winery is most celebrated for its Hibiscus wine, also known as Dragon Flower, they also make Sauvignon Blanc, Chardonnay, Carlos, Muscat, Petite Sirah, Bourbon Barrel aged Red Blend and Rose. Spirits Fish Hawk Spirits In the southwestern part of Marion County, bordering Ocala and Dunnellon, sits Fish Hawk Spirits . This award-winning distillery is what you call farm-to-bottle, sourcing corn, herbs and botanicals from the familyâs own farmland to create their unique spirits. These creations total 27 original whiskey, rums, vodkas, absinths and brandy. While the majority of Fish Hawkâs business is distilling for wholesale, they offer select behind-the-scenes tours of their facility. The two-hour tours show the distilling process and offers liquor samplings straight or in a cocktail. Tours are available Thursday-Sunday at 3 pm and can be booked HERE. James Two Brothers Distillers Located right next to the Ocala International Airport and just minutes away from the World Equestrian Center is James Two Brothers Distillers . This micro-distillery that focuses on whiskey and rums offers tours the second Saturday of each month for guests to see the distilling process and taste their handcrafted spirits. Founded by brothers in 2012, the craft distillery specializes in single-batch production of beverage grade-spirits. To schedule a tour, call 352-291-0585. Delicious flavors and fun times, are not limited to these great places. You will also find two speakeasies in Downtown Ocala , as well as a tiki bar and, coming soon, a pirate bar. If kicking back and enjoying a drink and meal on the water is more your style, there are two restaurants on Lake Weir with their own beach or two sitting right on the Withlacoochee and Rainbow Rivers in Dunnellon. Check out all our Food and Drink option HERE . For some more ideas for dining , check out our blog How to Eat and Drink Well in Ocala/Marion County . Please enable JavaScript to show the Partner Listings listings. Featured Partners Ocala Food Walks Brick City Southern Kitchen & Whiskey Bar Ocala Downtown Market Katya Vineyards Food & Drink Let your taste buds guide you through Ocala/Marion County, ï»¿where flavor and adventure go hand in hand. Learn More Start Planning Your Stay In Ocala Vacation Guide Email Newsletter Visitor Center 109 West Silver Springs Boulevard | Ocala, FL 34475 Phone (352) 438-2800 | 1-888-FL-OCALA About Us Blog Media Contact Us Tour Operators Terms of Use Partners Privacy Policy Accessibility Â©2025 Ocala/Marion County Visitors and Convention Bureau This site uses cookies to provide you with an optimized experience. Privacy Policy Accept Quick Search Search Location Map"
    }
  ]
}