{
  "fuentes": [
    {
      "url": "https://www.pgaofcanada.com/job-board/head-professional/head-professional-hidden-lake-golf-club-43205",
      "email": "hr@clublink.ca"
    },
    {
      "url": "https://www.pgaofcanada.com/job-board/head-professional/head-professional-hidden-lake-golf-club-43205",
      "email": "jobs@clublink.ca"
    },
    {
      "url": "https://fairwaysgolfcentre.com/contact-us/",
      "email": "derek@canadianfade.com"
    },
    {
      "url": "https://fairwaysgolfcentre.com/contact-us/",
      "email": "info@fairwaysgolfcentre.com"
    },
    {
      "url": "https://fairwaysgolfcentre.com/contact-us/",
      "email": "wordpress@fairwaysgolfcentre.com"
    },
    {
      "url": "https://sbdctampabay.com/hidden-fairway-golf-club-in-hillsborough-county/",
      "email": "nreyes@usf.edu"
    },
    {
      "url": "https://www.hiddenhillsgc.com/contactus/",
      "email": "info@hiddenhillsgc.com"
    },
    {
      "url": "https://hiddenriver.com/",
      "email": "info@hiddenriver.com"
    },
    {
      "url": "https://www.hiddenlakesgolfclub.com/contact-us",
      "email": "robert@hiddenlakesgolfclub.com"
    },
    {
      "url": "https://fairwayadvisors.com/about/",
      "email": "jeff.davis@fairwayadvisors.com"
    },
    {
      "url": "https://fairwayadvisors.com/about/",
      "email": "jeff.davis@fairwayadvisorsstaging.mystagingwebsite.com"
    },
    {
      "url": "https://www.hiddenfairway.com/about-us",
      "email": "damian@hiddenfairway.com"
    },
    {
      "url": "https://fairwaysofhalfmoon.com/",
      "email": "jessica@fairwaysofhalfmoon.com"
    },
    {
      "url": "https://hiddencreekgolfclub.com/contact/",
      "email": "info@hiddencreekgolfclub.com"
    },
    {
      "url": "https://www.pgaofcanada.com/job-board/director-of-golf/director-of-golf-hidden-lake-golf-club-burlington-on-32263",
      "email": "cboudreau@clublink.ca"
    },
    {
      "url": "https://www.pgaofcanada.com/job-board/director-of-golf/director-of-golf-hidden-lake-golf-club-burlington-on-32263",
      "email": "jobs@clublink.ca"
    }
  ],
  "mails": [
    "cboudreau@clublink.ca",
    "damian@hiddenfairway.com",
    "derek@canadianfade.com",
    "hr@clublink.ca",
    "info@fairwaysgolfcentre.com",
    "info@hiddencreekgolfclub.com",
    "info@hiddenhillsgc.com",
    "info@hiddenriver.com",
    "jeff.davis@fairwayadvisors.com",
    "jeff.davis@fairwayadvisorsstaging.mystagingwebsite.com",
    "jessica@fairwaysofhalfmoon.com",
    "jobs@clublink.ca",
    "nreyes@usf.edu",
    "robert@hiddenlakesgolfclub.com",
    "wordpress@fairwaysgolfcentre.com"
  ],
  "nombre_sitio": "hiddenfairway.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.pgaofcanada.com/job-board/head-professional/head-professional-hidden-lake-golf-club-43205",
      "text": "Head Professional: Hidden Lake Golf Club: Head Professional - PGA of Canada Cookie Settings We respect your privacy We use cookies to help you navigate efficiently and perform certain functions. For more details,\r\nplease refer to our privacy policy. You can control these cookies or consent to their use by\r\nclicking \"Accept All.\" Accept All Cancel × Français Home Media Centre Sponsors Shop Safe Sport Find a Pro More Contact us About Sign In Join Search Join Education Championships Sport Development Benefits Employment Media Centre Français Contact us Shop Professional Golfers' Association of Canada Photos Jobs Post a Job Apprentice Professional Assistant Professional Associate Professional Coach Director of Golf General Manager Head Professional Industry Postings International Postings Teaching Professional Members on the Move Classified Section Find a Pro City and Province or Postal Code Search Radius km Name Facility Specializations Teaching Coaching Golf Operations Management and Leadership Search Head Professional: Hidden Lake Golf Club Facebook Twitter LinkedIn Email Text Formerly known as the Lake Medad Golf and Country Club, Hidden Lake Golf Club opened its doors as a straightforward, albeit enjoyable, 18-hole layout in 1962. Purchased in 1979 by the current ownership, the course was more appropriately renamed after the lake that inconspicuously flows alongside the finishing holes of what is now referred to as the 'Old Course'. Much has changed since 1962 as Hidden Lake Golf Club has expanded into two exceptional, but very distinct, championship courses that cover over 500 acres of picturesque Niagara Escarpment. The atmosphere inside the clubhouse is warm and friendly; the clubhouse caters to both individuals and groups alike. Whatever course you choose, you won't be disappointed. If you appreciate a more traditional, tree-lined course then play the Old Course. The greens are small and flat and water is non-existent. Measuring 6,712 yards, the course is very mature and features lush, tree-lined fairways and extremely small greens. If you prefer large and undulating greens, more generous fairways and plenty of water then the New Course is for you. Measuring 6,743 yards, water comes into play on four holes, but it's the well bunkered contoured greens that provide the real difference. Location Hidden Lake Golf Club Posted 2025-02-24 Deadline 2025-03-16 Job Summary The successful candidate will have the opportunity to work and grow professionally within ClubLink. Under the supervision of the Director of Operations and with an energetic, dynamic and highly motivated team, manage all aspects of golf operations at Hidden Lake Golf Club and ensure that the facility meets the service standards of ClubLink. Responsibilities Specific Duties to Include: Recruitment, hiring, training, and supervision of all staff including assistant and teaching professionals, outside assistants, mechanics, starters and rangers. Implementation of policies and procedures and regular scheduling of staff meetings. Oversee all golf services and operations. Oversee the rental and maintenance of golf cars. Oversee the reservation system, starting, and monitoring of play. Track and verify all players and guests. Oversee the administration of the handicap program. Enforce all rules and regulations governing golf course usage. Develop and manage an innovative tournament program that services all customer segments. Develop and oversee the golf instruction and golfer development programs for all customer segments. Oversee the operations of a well-managed practice facility. Maintain close working relationship with the Superintendent and other department heads. Assist in the marketing and promotion of new memberships / play. Assist in the preparation of budgets, including forecasting and review of all golf revenues and expenses on a daily, weekly, monthly, and annual basis. Maintain and oversee a profitable merchandise concession that is consistent with patron demographics and needs. Implement cash and systems controls to ensure the safekeeping of assets, inventory and resources. Oversee and approve all weekly golf staff time sheets /payroll, purchase orders, and invoices. Supervise physical inventories and the display of merchandise. Assist in the development of necessary systems to safeguard inventories. Assist in the publication of newsletters, informational and promotional materials. Qualifications Successful Candidate will possess the following skills CPGA Class \"A\" Professional preferred A keen desire to deliver outstanding customer service. Ability to take initiative and solve problems effectively. Be extremely organized, with experience in managing events, leagues and retail. Have an engaging personality with good work habits. Ability to learn and develop skill sets. Proficient in Word and Excel software Experience with IBS System and Golf Genius Software. Compensation $53,000-$60,000 plus bonuses Benefits/Perks Participation in ClubLink’s health benefits & RRSP/DPSP program Health spending account Golf equipment package. Room for advancement. Staff meal plan. Discounted merchandise & staff pricing program. Work perk membership. Course Website https://hiddenlake.clublink.ca/ Employment Duration Full-time, permanent. Contact Information ClubLink is an equal opportunity employer committed to providing an inclusive workplace. Please contact jobs@clublink.ca if a workplace accommodation is needed throughout the selection process. Thank you for your interest in ClubLink. Contact Information – Applicants may click here to apply or submit their resume by email to hr@clublink.ca Accepting Applications until March 16th , 2025 Join Education Jobs Events Hall of Fame Foundation © 2025  PGA of Canada 13450 Dublin Line Acton, ON   L7J 2W7 Phone:(800) 782-5764  \r\nFax: (519) 853-5449"
    },
    {
      "url": "https://fairwaysgolfcentre.com/contact-us/",
      "text": "Contact Us - Fairways Golf Performance Centre Skip to content Phone:  519.657.5750 | info@fairwaysgolfcentre.com Facebook Twitter Instagram YouTube Home Indoor Golf Facility Golf Lessons and Coaching Contact Us Contact Us Contact Us fairwaysgolfcentre 2024-02-07T11:37:16-05:00 Get in Touch 519-657-5750 (phone # in use April thru October) To contact us here at Fairways Golf Performance Centre please feel free to call or email us.  If you would prefer to use our “contact us” form below please take a moment to complete the short form and hit the Submit button. We will be back in touch you as quickly as possible usually within 24 hrs. Contact Us Form Please take a moment to complete our Contact Us form below to get in touch with us. Name * Email * Phone Subject * Comments Submit × Thank you for using our Contact Us form.   Your message has been emailed and someone will be in touch via email to answer any questions.  We strive to respond to submissions as quickly as possible. × There was an error trying to send your message. Please try again later. Call 519.657.5750 Email info@fairwaysgolfcentre.com Facebook facebook.com/fairwaysgolfcentre Twitter twitter.com/golfatfairways Instagram instagram.com/fairwaysgolfcentre/ Go to Top"
    },
    {
      "url": "https://sbdctampabay.com/hidden-fairway-golf-club-in-hillsborough-county/",
      "text": "Hidden Fairway Golf Club in Hillsborough County Link to Facebook Link to Youtube Link to X Link to LinkedIn Link to Flickr Link to Slideshare Link to Rss  this site Donate Subscribe Home Solutions Certifications Business Certifications Minority-Owned Business Woman-Owned Business Veteran-Owned Business Consulting & Training Training Training Calendar Consulting Schedule a Consultant Consulta Business Solutions Growth Acceleration Government Contracting International Trade Starting Your Business Disaster Preparedness Student Teams Financing Your Business Resources Business Resources Frequently Asked Questions Insights Blog Media Inquiries About Us Mission / Vision Consultants Meet the Staff Meet Our Clients Partners / Affiliates Training Training Calendar On-Demand Training Results Success Stories Economic Impact Locations Tampa Hernando County Highlands, Hardee, DeSoto Hillsborough Manatee Pasco County Pinellas County Polk County Sarasota Contact Request a Consultant Click to open the search input field Click to open the search input field Search Menu Menu Blog Business Owner Drives Success into Downtown Tampa with Indoor Driving Range Blog , Featured Success Stories , Success Stories Hidden Fairway Golf Club in Hillsborough County Nestled in the heart of North Hyde Park, business owner and University of South Florida alum, Damian Garcia, brings an innovative indoor driving range to downtown Tampa. As an avid golfer, Garcia was quick to notice the need for an indoor driving range where golfers could effectively practice their swing while other guests could enjoy the ample space to gather. That’s when Garcia created Hidden Fairway Golf Club, a unique business that combines state-of-the-art technology with his love of golf. “I’ve always been an avid golfer, but I noticed that people in downtown Tampa were having to drive 30 minutes to go play any time after 6pm, so I tried to bring the best of everything in an environment where they can be here from 5am to 2am,”  Garcia said with a smile. When the business owner first conceived the idea of an indoor driving range, he knew he needed expert guidance to turn his dream into a reality. That’s when he remembered about the Florida SBDC at USF.  “I originally learned about the Florida SBDC at USF when I was actually a student at USF. I remember seeing it I believe back in 2014, 2015, when I was a bicycle delivery driver for Jimmy Johns, and I kept it in the back of my head. Right around Covid, when the wheels for business started that’s where I reached out,” Garcia recalls. Once he reached out to his local Florida SBDC, the entrepreneur was paired with Florida SBDC at USF business consultant, Pablo Arroyo, who assisted him with business planning, market research, and overall business guidance. The comprehensive support he received laid the foundation for his success. Market research conducted by the Florida SBDC at USF revealed a significant demand for an indoor driving range in downtown Tampa. “SBDC has been great from the beginning, from market research on where we were going to build the place, down to just how to talk about my business,” Garcia said. With the help of his business consultant, Garcia was guided through a variety of recommendations that would benefit his business. “Like I said, starting with market research where we really grew. We got some help when it came to being found on Google. And then once we started getting members, down to things like how to do our taxes, how to manage the finances. One of the biggest suggestions we got early on was the QuickBooks set up,” he said. The Florida SBDC at USF also helped Garcia with creating a detailed business plan that included market analysis, financial projections, and strategic planning. “The Florida SBDC at USF was really instrumental in us getting our start-up funds going. We had a little bit of money in advance but setting up an LLC [Limited Liability Company] and setting it up correctly really legitimized us to lenders,” Garcia said. This business plan was not just a roadmap but also a powerful tool to attract investors and secure funding. Armed with this plan, Garcia was able to present a compelling case to potential backers, ensuring he had the capital needed to launch his venture. “We spoke to a couple of lenders and a few off the top of my head that really helped us out was Upgrade for over $25,000, and then we had another 25 to $35,000 from American Express as well. We would not have been able to do it if we didn’t have such a thorough plan in advance and having set up that LLC from day one,” he added. Since working with the Florida SBDC at USF, the indoor driving range has been a resounding success. “Our biggest success so far has just been selling out. The numbers, when we ran the business plan, were a little bit more conservative. We wanted to make sure we were honest, but within seven months we sold out,” Garcia said. Golf enthusiasts from all over Tampa have flocked to the facility, eager to experience the cutting-edge technology and exceptional service. Garcia attributes much of his rapid success to the invaluable support and market research data provided by the Florida SBDC at USF. “Our goal was to have 30 members, we have 30 unlimited members but also, we have a punch pass membership that brings our total membership to around 70. We expected around 15 to 20 our first year and I think a lot of it came down to the market research on the location, that there’s a huge need for this here,” Garcia mentioned. Moving forward, the passionate business owner states that he will continue using the Florida SBDC at USF as he plans to grow his business into new locations. “The SBDC at USF was very monumental in us getting loans and us getting approved and seen by banks. So, as we improve and as we grow, probably go back to the Florida SBDC at USF to secure more loans for our future locations. Moving forward we would definitely work with them again to make sure we can secure those loans,” Garcia said. “I can only say good things about the Florida SBDC at USF,” Garcia said. “I would recommend that anybody talk to the Florida SBDC at USF before they even get started. Even if it’s just a second opinion, to take advantage, because at the end of the day their services are free,” he added. Share this entry Share on Facebook Share on X Share on LinkedIn Share by Mail https://enwqtxc9es4.exactdn.com/wp-content/uploads/2024/06/HFGC-Candid-1-scaled.jpg?strip=all&lossy=1&ssl=1 1707 2560 sbdclarry /wp-content/uploads/2024/10/Locked-Host-Logos-Horizontal-USF-Small-e1728920602651.png sbdclarry 2024-06-03 16:45:13 2025-02-27 00:02:21 Business Owner Drives Success into Downtown Tampa with Indoor Driving Range Categories Business Essentials Business Plans Buying a Business Certifications COVID-19 Crowdfunding Disaster Preparedness Economic Development Finance Government Contracting Growing Your Business Healthcare Human Resources International Trade Marketing Press Releases Radio and Podcast Starting a Business Success Stories Success Stories Videos Tech Commercialization/Tech Transfer Veteran Web and Social Media Subscribe to Newsletter Contact Us Regional Office Contact Info USF CONNECT 3802 Spectrum Blvd., Suite 201 Tampa, FL 33612 813-396-2700 Subscribe to Our Newsletter Florida SBDC Network The Florida SBDC at the University of South Florida is a member of the Florida SBDC Network, a statewide partnership program nationally accredited by the Association of America’s SBDCs and funded in part by the U.S. Small Business Administration, Department of Defense, State of Florida, and other private and public partners, with the University of West Florida serving as the network’s headquarters. Full funding disclosure available at www.floridasbdc.org/funding-disclosures/ . Florida SBDC services are extended to the public on a nondiscriminatory basis. Language assistance services are available for individuals with limited English proficiency. All opinions, conclusions, and/or recommendations expressed herein are those of the author(s) and do not necessarily reflect the views of the SBA or other funding partners. Reasonable accommodations for persons with disabilities and/or limited English proficiency will be made if requested at least two weeks in advance. To request accommodation or language assistance, please contact Nelson Reyes, nreyes@usf.edu, 813.396.2700. Business Assistance State Designated as Florida’s Principal Provider of Business Assistance [§ 288.01, Fla. Stat.] © Florida SBDC at USF   | contact webmaster Link to: Business Owner Brings the Heat to Hillsborough County Link to: Business Owner Brings the Heat to Hillsborough County Business Owner Brings the Heat to Hillsborough County Link to: Beneficial Ownership Information (BOI) Reporting Guide for Small Businesses Link to: Beneficial Ownership Information (BOI) Reporting Guide for Small Businesses Beneficial Ownership Information (BOI) Reporting Guide for Small Businesses Scroll to top Scroll to top Scroll to top Get Answers"
    },
    {
      "url": "https://www.hiddenhillsgc.com/contactus/",
      "text": "Contact Us - Hidden Hills Golf Club Skip to main content Skip to primary sidebar Skip to footer Home Tee Times Golf Course Details Rates Rules & Information Golf Shop Junior Golf Hills Pass Get Hills Pass Member Login Lessons Events Weddings Banquets Golf Outings Upcoming Events Hills Grill Partners Contact Job Opportunities Contact Us E-Club Sign Up Send a Gift The Jacksonville Championship Hidden Hills Golf Club Jacksonville, FL Book My Tee Time! Contact Us Contact Info Hidden Hills Golf Club 3901 Monument Rd. Jacksonville, FL 32225 Phone: (904) 620-0910 Email: info@hiddenhillsgc.com Pro Shop Hours Mon-Sun | 7 a.m. – 6 p.m. Practice Range Hours Sun & Mon | 6 a.m. – 6 p.m. Tue – Sat | 6 a.m. – 7 p.m. Clubhouse Hours Sun, Mon | 7 a.m. – 6 p.m. Tue, Wed, Thu | 7 a.m. – 6 p.m. Friday | 7 a.m. – 9 p.m. Saturday | 7 a.m. – 6 p.m. Golf Staff Wayne Ulmer, PGA Head PGA Professional Ted Hopkins, PGA Professional Emeritus Patrick Libby PGA Assistant We would like to hear from you! Have a question or comment for us? We’ll be happy to help. Just fill out the form below and we’ll get back to you with the answers you need. Or call us at 904-620-0910. Sorry - your browser does not support iframes. Primary Sidebar Contact Form Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone No. * Comments Website Submit Footer Visit Us 3901 Monument Rd. Jacksonville, FL 32225 Follow Us Contact Us (904) 641-8121 info@hiddenhillsgc.com Copyright © 2025 Hidden Hills Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://hiddenriver.com/",
      "text": "Hidden River Golf & Casting Club - Play Golf in Brutus, MI (231) 529-4653 / Toll Free Phone: (800) 325-4653 Facebook Instagram Facebook Instagram Home Golf Course Details Membership Architect’s Comments Instruction Hole in One Club Golf Shop Trovato Events Calendar Online Store Contact Contact Us Exclusive Deals Employment Select Page Welcome to Hidden River Golf & Casting Club. Book your 2025 Tee Times Now. The turn grill is open daily and the bev cart runs most Days. Book a Tee Time A Golf Week top 20 course. Stop in and see what W. Bruce Matthews III had in mind when he created this masterpiece. Golf IN BRUTUS, MI LOCATED 15 MILES NORTH OF PETOSKEY AND 12 MILES EAST OF HARBOR SPRINGS At Hidden River Golf & Casting Club, you’ll discover impeccable course conditions, exceptional service and an exquisite menu. Ranked among GolfWeek’s “Best Courses You Can Play” in 2013-2024, you will immediately recognize that Hidden River is unique to other courses in northern Michigan. The designers relied on a “Lay of the Land” fundamental style, with Push-up greens, fairways that pitch and roll. The putting surfaces are small and very often laid out on the High Areas of the routing. It’s Organic, it’s Natural, It’s Alburg Golf Links. COURSE INFORMATION Explore the Course MEMBERSHIP OPPORTUNITIES Hidden River Golf and Casting Club has developed a cost effective way for you to enjoy club privileges and opportunities. VIEW MEMBERSHIP INFO ARCHITECT’S COMMENTS Hole By Hole Comments On Hidden River By W. Bruce Matthews III, Architect. LEARN MORE Golf Shop The Golf Shop at Hidden River is not your typical golf shop. The Golf Shop offers an excellent variety of golf apparel, along with seasonal casual wear perfect for the Midwest climate LEARN MORE instruction Hidden River hires PGA Golf Professionals who are available by appointment to help you with every part of your game.   Please call 231-529-4653 to set up your appointment. LEARN MORE member events July 11th – 13th 2024 Men’s Royal Wulff Member/Guest (dinner on 11th, golf on 12th & 13th) LEARN MORE Contact Us Get in touch with us by calling or email one of our staff members. Find out our Hours of Operation or just get Directions to Hidden River Golf & Casting Club. GET IN TOUCH TROVATO ITALIAN RESTAURANT We welcome you to visit and enjoy the Hidden River dining experience LEARN MORE Receive Exclusive Deals Follow Follow Follow Follow Hidden River Golf & Casting Club (231) 529-4653 / Toll Free Phone: (800) 325-4653 7688 Maple River Road Brutus, MI 49716 info@hiddenriver.com © Copyright Hidden River Golf & Casting Club Links Website by Lightspeed"
    },
    {
      "url": "https://www.hiddenlakesgolfclub.com/contact-us",
      "text": "Contact - Hidden Lakes Golf Club Book Now Join Our E Club Call us at (386) 427-4138 Shopping Cart Shopping Cart 0 Shopping Cart About Meet the Team About the Course Golf Golf Simulator Rates Memberships Driving Range Teaching and Clinics Find Golf Partners Junior Golf Gallery Events Tournaments Meetings & Special Occasions Club Calendar News 19th Hole Restaurant Shop Online Online Store Cart My Account Contact Us Contact Us Join our E Club Book a Tee Time Book a Tee Time Book Simulator Time Menu Menu Link to Facebook Link to Instagram Link to X Link to Mail Leave us a message! We want to hear from you. Your questions and concerns are of the utmost importance to us. Please use the form below to request additional information about our course, services and promotions. We’d also like to encourage you to voice any concerns you may have and let us know how we’re doing in our efforts to provide the best facility we can possibly provide. Mobile Mobile Phone: 386-427-4138 Hidden Lakes Golf Club 35 Fairgreen Avenue New Smyrna Beach, FL 32168 Mobile Mobile Email: robert@hiddenlakesgolfclub.com Contact Us Your Name * First Last Phone * Email * Please Include Any Additional Details * hCaptcha Name This field is for validation purposes and should be left unchanged. Δ Location: 35 Fairgreen Avenue New Smyrna Beach, FL 32168 Phone: (386) 427-4138 Copyright © Hidden Lakes Golf Club -  Powered by Teesnap. | Privacy Policy | Terms of Service | Cookies | Return Policy | Contact Us Link to Facebook Link to Instagram Link to X Link to Mail Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://fairwayadvisors.com/about/",
      "text": "About Fairway Advisors - Fairway Advisors ABOUT FAIRWAY ADVISORS SERVICES ADVISORY SERVICES BROKERAGE SERVICES MEMBER OWNED CLUBS ALTERNATIVE USE EXPERTS INSTITUTIONAL INVESTOR ADVISORY LENDER SERVICES GOLF COURSE MANAGEMENT TOURNAMENT SOLUTIONS TEE TIME MANAGEMENT SOLUTIONS INSURANCE BANKRUPTCY TRUSTEES LISTINGS OWNER’S MARKETPLACE GOLF COURSES FOR SALE INVITATION ONLY OFFERINGS LISTING REQUEST NOTABLE TRANSACTIONS CLIENTS CONTACT ABOUT FAIRWAY ADVISORS SERVICES ADVISORY SERVICES BROKERAGE SERVICES MEMBER OWNED CLUBS ALTERNATIVE USE EXPERTS INSTITUTIONAL INVESTOR ADVISORY LENDER SERVICES GOLF COURSE MANAGEMENT TOURNAMENT SOLUTIONS TEE TIME MANAGEMENT SOLUTIONS INSURANCE BANKRUPTCY TRUSTEES LISTINGS OWNER’S MARKETPLACE GOLF COURSES FOR SALE INVITATION ONLY OFFERINGS LISTING REQUEST NOTABLE TRANSACTIONS CLIENTS CONTACT About Fairway Advisors Since 2005. Golf industry veteran Jeffrey Davis formed Fairway Advisors in 2005. Prior to creating Fairway Advisors, Mr. Davis was the founder of Cushman & Wakefield’s National Golf Group. In his capacity as Director at Cushman & Wakefield, Mr. Davis sold many notable golf courses throughout the United States. Fairway Advisors was formed to offer the golf course industry professional transaction management and a vast array of advisory services. READ JEFF'S BIO READ KEVITT'S BIO Our Clients The strongest endorsement we can obtain is when our existing clients retain us for additional golf course brokerage assignments. In addition to multiple one-off golf course owners, Fairway Advisors is pleased to have represented the following clients in the current economic cycle. Jeff Davis' Bio In January 2005, Mr. Davis created Fairway Advisors, a national golf course brokerage and advisory firm.  Fairway Advisors was formed to offer the golf course industry professional transaction management and a vast array of advisory services.  Some of Mr. Davis’ noteworthy transactions include Blue Hill Country Club located in Boston which was the host of the 1956 PGA Championship. Apple Ridge Country Club located in Bergen County, New Jersey which was the largest golf course sale in the Northeast in 2014. Edgewood Country Club located in Bergen County, New Jersey which was the largest golf course transaction in the Northeast in 2015. Engineers Country Club located in the Gold Coast of New York’s Long Island. Engineers was the largest golf course transaction in the Northeast for 2017 and was the host of the 1919 PGA Championship and the 1920 US Amateur Championship. In addition to single asset sales/recapitalizations, Mr. Davis has also been called upon to market portfolios. In 2006 GIBG tapped Fairway Advisors to market a nine-course portfolio located in five Eastern States.  In his twenty-year career in the golf industry, Davis has sold, advised, underwritten, or consulted on over $1 billion in golf related assets. Prior to starting Fairway Advisors, Davis founded Cushman & Wakefield’s Golf Group in October 2000. During his tenure at Cushman & Wakefield, Davis sold and advised in excess of $200 million dollars of golf course properties. These prestigious properties include the sale of Legend Trail Golf Club, formerly ranked as one of the “Top 100 to Play” golf courses in United States. Davis also sold world class tournament venues consisting of Valencia Country Club, site of the 1998 Nissan Open and Kemper Lakes Golf Course, home of the 1989 PGA Championship. In 2002, The Kemper Lakes sale represented the highest sales price of any exclusively listed golf course in the United States. Davis’ experience in the golf business began in 1993 when he was a Principal and founder of Hansen Clark Golf Properties. Davis completed transactions for private non-equity, daily fee, and former municipal golf facilities throughout the United States. Hansen Clark Golf Properties, under the guidance of Davis, represented some of the largest golf management companies, institutional investors, lenders and private investors in golf course sales throughout the country. During his term with Hansen Clark, Davis consulted and closed more than $150 million dollars in golf properties. Prior to entering the golf business, Davis was an investment broker in Southern California. Davis is a member of the United States Golf Association and currently resides in Dallas. Davis is a volunteer for The First Tee Foundation. Kevitt Sale's Bio Before joining Fairway Advisors, Kevitt brings a wealth of experience spanning over three decades in the fields of Private Country Club Management and Commercial Real Estate. His career has been marked by a dedication to hospitality, business development, and providing exceptional member experiences, supported by a strong foundation in commercial real estate transactions and negotiations. Kevitt’s journey began with two decades as a Private Country Club General Manager, where he gained extensive expertise in the operations of prestigious private country clubs. He excelled in financial analysis and profit and loss statements, using financial data to make informed decisions. Kevitt was skilled in budgeting and forecasting, consistently ensuring his clubs maintained strong financial performance. His talents extended to managing operational budgets and identifying areas for improvement to increase profitability. Kevitt also demonstrated a deep understanding of food and beverage management, introducing innovative culinary concepts and dining experiences that delighted members and guests. In golf operations, Kevitt played a crucial role by overseeing pro shop operations, organizing tournaments, developing player programs, and enhancing the golf experience for members and guests. He managed turf care programs, contributed to course improvements, and aided in maintaining optimal playing conditions. Kevitt’s expertise in sales and marketing was instrumental in driving club membership growth, creating marketing strategies, nurturing member relationships, and organizing special events to attract and retain members. Throughout his career, Kevitt prioritized team building, providing training, and fostering a culture of excellence and professionalism. Before entering Private Country Club management, Kevitt spent 15 years in commercial real estate. His background in deal-making and business development, coupled with his ability to establish and maintain relationships, was vital to brokering deals and facilitating property transactions. Kevitt’s skill in negotiating and closing complex real estate transactions was a driving force in his commercial real estate career. His deep understanding of market dynamics and a consistent record of securing favorable terms for clients were key to his success. The combination of Kevitt’s expertise in Private Country Club management and commercial real estate provides a strategic approach to golf and real estate ventures, delivering substantial value to owners and buyers of golf-related properties. Our Work Our Services Listings Notable Transactions Our Clients Information About Fairway Advisors Contact Us Main Office | 214.485.1500 jeff.davis@fairwayadvisors.com 201.691.7044 | Tri-State/Met Region 323.763.0007 | Los Angeles 312.593.5434 | Chicago Main Office | 214.485.1500 jeff.davis@fairwayadvisors.com 201.691.7044 | Tri-State/Met Region 323.763.0007 | Los Angeles 312.593.5434 | Chicago"
    },
    {
      "url": "https://www.hiddenfairway.com/about-us",
      "text": "About Us — Hidden Fairway 0 Skip to Content Home Pricing Lessons Location FAQ's Events Schedule a Tour About Us Book Now Open Menu Close Menu Home Pricing Lessons Location FAQ's Events Schedule a Tour About Us Book Now Open Menu Close Menu Home Pricing Lessons Location FAQ's Events Schedule a Tour About Us Book Now About Us Who we are Hidden Fairway was born out of necessity. After the closing of  Golf Grove on Bearss, we were left without any local driving ranges open after 6pm. That’s where we come in. We are an indoor driving range that is capped at 35 members in the heart of North Hyde Park. We offer a way for golfers to pre book sessions and practice in a controlled environment. Contact Us Home | Location | FAQ's | Pricing | About us Location 910 N Rome Ave. Tampa, FL 33606 ©2023, Hidden Fairway, design by Elegance IT Solution"
    },
    {
      "url": "https://fairwaysofhalfmoon.com/",
      "text": "Fairways of Halfmoon – Golf Course and Wedding Venue Saratoga County NY Skip to content Golf Public Course Info Leagues Tournaments Book Tee Times Weddings & Events Weddings Special Events Menu Options Preferred Vendors Tournaments FAQs Venue The Ballroom Clubhouse/ Berkshire Room Hank Hudson Brewery THE OPP Pavilion News Calendar Golf Public Course Info Leagues Tournaments Book Tee Times Weddings & Events Weddings Special Events Menu Options Preferred Vendors Tournaments FAQs Venue The Ballroom Clubhouse/ Berkshire Room Hank Hudson Brewery THE OPP Pavilion News Calendar contact A classic public golf course & wedding/special events venue in halfmoon, NY Fairways Of Halfmoon The Fairways of Halfmoon Golf Course Golf Public Course Info Leagues Tournaments Book Tee Times Weddings & Events Weddings Special Events Menu Options Preferred Vendors Tournaments FAQs Venue The Ballroom Clubhouse/ Berkshire Room Hank Hudson Brewery THE OPP Pavilion News Calendar Golf Public Course Info Leagues Tournaments Book Tee Times Weddings & Events Weddings Special Events Menu Options Preferred Vendors Tournaments FAQs Venue The Ballroom Clubhouse/ Berkshire Room Hank Hudson Brewery THE OPP Pavilion News Calendar contact Golf Course Looking for an afternoon of golf, or to book a vanue for a fundraiser or a golf outing? Learn More Wedding Events Planning an upcoming wedding? Talk with our on-site wedding specailist today. Learn More Special Events We have the a variety of spaces to host your upcoming intimate or large special events. Learn More Contact Us today Do you have questions about our public golf course or about  hosting an event? Learn More An Unforgettable Venue With 30 years of wedding and special event planning in Saratoga County, NY, Fairways of Halfmoon is excited to share our Water Feature Ceremony site, Adirondack Ballroom, and Berkshire Banquet Room with you for your upcoming event. We have the perfect space to host everything from fundraisers, birthday parties, weddings, anniversary celebrations, funerals, and family reunions. Learn More Public Golf Course The 18-hole Fairways of Halfmoon Golf Course features four sets of tees, ranging from 4,578 to 6,237 yards, on its par-72 bent-grass layout. The course, which opened in 1999 and was designed by Gary Van Alstyne, only plays 5,829 yards from the middle tees, and stresses accuracy over distance. Whether its water hazards, bunkers, trees or fescue, the Fairways of Halfmoon offers a diverse layout for golfers of all abilities. Learn More Testimonials See What Our Guests Are Saying The Fairways of Halfmoon is the perfect wedding venue in every way. Sue is incredible and made the planning process easy and fun. She was open to all of our crazy ideas and helped make our dream wedding a reality. Catherine C CEO Was the best experience !\nSue was wonderful and so helpful. Her staff was attentive to our every need. Sue and her staff made our special day so wonderful ! If you need a venue for your wedding book with sue !!!! Joan P. Amazing Experience!!!\nEverything was so beautiful and everyone who works there is kind and also wants to help make sure your day goes smoothly. Totally recommending to everyone I know for weddings/showers anything. Miranda Plan Your Dream Wedding Staffed with an on-site wedding planner, Fairways of Halfmoon will execute the wedding of your dreams.  Contact us today to discuss your ideas. Learn More Fairways Menu Options Whether you are looking for a brunch buffet, heavy hors d'oeuvres, or a multiple course dinner, visit our menu page to begin planning your party today. Learn More Get answers online We field all sorts of questions about special events and weddings.  Many common questions can be answered by visiting our detailed FAQs  page. Learn More Hours of Operation: Clubhouse Indoor & Outdoor Dining: Monday-Friday 5:00 PM-9:00 PM Looking to Plan an Event at Fairways of Halfmoon? Inquire The Fairways of Halfmoon Golf Course and Banquet Facility is a hidden gem destination located in Southern Saratoga County featuring an 18-hole public golf course, elegant event spaces for weddings and other special events, as well as an on-site Brewery​ Facebook-f Instagram Get In Touch 17 Johnson Road Mechanicville, NY 12118 VP of Business Development: Jessica Guido Phone: (518)664-1578 EMAIL: Jessica@fairwaysofhalfmoon.com Quick Links Golf Public Course Info Leagues Tournaments Book Tee Times Weddings & Events Weddings Special Events Menu Options Preferred Vendors Tournaments FAQs Venue The Ballroom Clubhouse/ Berkshire Room Hank Hudson Brewery THE OPP Pavilion News Calendar © 2025 All Rights Reserved."
    },
    {
      "url": "https://hiddencreekgolfclub.com/contact/",
      "text": "Contact Us - Hidden Creek Golf Club Toggle navigation Tee Times About Overview Rates Scorecard Practice Facility Leagues Instruction HiddenCash Program Events Outings Private Parties Gift Cards Contact Us Contact Us Contact Us We'd love to hear your feedback! Please do not hesistate to reach out to use with comments or questions! Give us a call You can reach us at (812) 246-2556. Send us an email Our email address is info@hiddencreekgolfclub.com Swing by Click here for directions! Name * Email * Phone Subject * Message * reCAPTCHA If you are human, leave this field blank. Have a question? Reach out any time (812) 246-2556 About Hidden Creek Formidable 18-hole course and 9-hole executive style links course feature beautiful Zoysia fairways and tees. Contact Info info@hiddencreekgolfclub.com (812) 246-2556 4975 Utica Sellersburg Road Sellersburg, Indiana 47172 Sellersburg, IN 47172, USA HiddenCash Join our HiddenCash program in order to earn free golf. Click here to learn more!"
    },
    {
      "url": "https://www.pgaofcanada.com/job-board/director-of-golf/director-of-golf-hidden-lake-golf-club-burlington-on-32263",
      "text": "Director of Golf: Hidden Lake Golf Club - Burlington, ON: Director of Golf - PGA of Canada Cookie Settings We respect your privacy We use cookies to help you navigate efficiently and perform certain functions. For more details,\r\nplease refer to our privacy policy. You can control these cookies or consent to their use by\r\nclicking \"Accept All.\" Accept All Cancel × Français Home Media Centre Sponsors Shop Safe Sport Find a Pro More Contact us About Sign In Join Search Join Education Championships Sport Development Benefits Employment Media Centre Français Contact us Shop Professional Golfers' Association of Canada Photos Jobs Post a Job Apprentice Professional Assistant Professional Associate Professional Coach Director of Golf General Manager Head Professional Industry Postings International Postings Teaching Professional Members on the Move Classified Section Find a Pro City and Province or Postal Code Search Radius km Name Facility Specializations Teaching Coaching Golf Operations Management and Leadership Search Director of Golf: Hidden Lake Golf Club - Burlington, ON Facebook Twitter LinkedIn Email Text Hidden Lake Golf Club Burlington Post Reader's Choice Award winner for 'Best Golf Course' and 'Best Golf Shop'. Formerly known as the Lake Medad Golf and Country Club, Hidden Lake Golf Club opened its doors as a straightforward, albeit enjoyable, 18-hole layout in 1962. Purchased in 1979 by the current ownership, the course was more appropriately renamed after the lake that inconspicuously flows alongside the finishing holes of what is now referred to as the 'Old Course'. Much has changed since 1962 as Hidden Lake Golf Club has expanded into two exceptional, but very distinct, championship courses that cover over 500 acres of picturesque Niagara Escarpment. The atmosphere inside the clubhouse is warm and friendly; the clubhouse caters to both individuals and groups alike. Whatever course you choose, you won't be disappointed. If you appreciate a more traditional, tree-lined course then play the Old Course. The greens are small and flat and water is non-existent. Measuring 6,712 yards, the course is very mature and features lush, tree-lined fairways and extremely small greens. If you prefer large and undulating greens, more generous fairways and plenty of water then the New Course is for you. Measuring 6,743 yards, water comes into play on four holes, but it's the well bunkered contoured greens that provide the real difference. Location Hidden Lake Golf Club - Burlington, ON Posted 2023-03-06 Deadline 2023-04-14 Job Summary Reporting to the Regional Executive Director of Operations, the Director of Operations is responsible for providing effective leadership at the club. Specifically, he/she will make certain that all club employees are aligned with both the club and ClubLink's business objectives and in so doing ensure that the club's financial, member service and employee engagement targets are met. Responsibilities Leadership Identify, hire and develop key management employees, ensuring that they receive the proper training/instruction in order to maximize their effectiveness in their day-to-day activities. Manage the performance of each of the department managers at the club, setting clear expectations, providing regular feedback and ongoing coaching in an appropriate manner. Ensure professional development opportunities are made available to the management team and their staff. Sales and Financial Management Proactively manage club budget including the labour and expense budgets, ensuring that Member and guest service expectations and overall company goals are being met. Actively seek incremental sources of revenue through banquets and events, increasing merchandise sales and maximizing the tee sheet. Actively seek new Membership opportunities with guests and other potential prospects. Assist in the development of club capital budgets, overseeing that all projects are carried out properly and within budget. Accountable for all purchasing at the club. Member Relations Champion all Member and guest relations initiatives and act as the main point of contact at the club relative to Member or guest issues and concerns. Develop and maintain positive relationships with individual Members and Member groups, proactively seeking ways to improve member and guest satisfaction. Qualifications 7+ years of relevant management/leadership experience. College/University Diploma in a related field.  Experience/knowledge of golf club. operations including knowledge of turf, clubhouse and golf operations would be an asset. Demonstrated time management, organization and oral and written communication skills within a multi-unit operation. Proven track record of sales and sales leadership success, preferably within the golf industry, and a passion for sales and marketing. Strong training & coaching skills. Well-developed strategic planning skills and even stronger execution skills a must. The ability to manage multiple and competing tasks/priorities. Proven experience understanding and analyzing budgets. Expert Member and guest service skills. A history of innovation and a dedication to personal improvement. Compensation Based on experience. Benefits/Perks To be discussed Course Website <a href=\"https://hiddenlake.clublink.ca/\">https://hiddenlake.clublink.ca/</a> Employment Duration This is a Full-Time, Permanent Position. Contact Information Contact Information – Applicants may click here to apply or submit their resume by email to cboudreau@clublink.ca ClubLink is an equal opportunity employer committed to providing an inclusive workplace. Please contact jobs@clublink.ca if a workplace accommodation is needed throughout the selection process. Thank you for your interest in ClubLink. Join Education Jobs Events Hall of Fame Foundation © 2025  PGA of Canada 13450 Dublin Line Acton, ON   L7J 2W7 Phone:(800) 782-5764  \r\nFax: (519) 853-5449"
    }
  ]
}