{
  "fuentes": [
    {
      "url": "http://thehighlandsmhp.com/contact.html",
      "email": "20@750x163.jpg"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/high-rent-abandon-home/article_d9a613f0-dbf0-11ee-916c-07050c0df905.html",
      "email": "john.guerra@highlandsnewssun.com"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/high-rent-abandon-home/article_d9a613f0-dbf0-11ee-916c-07050c0df905.html",
      "email": "webcomments@highlandsnewssun.com"
    },
    {
      "url": "https://www.homelandschorley.co.uk/contact-us/",
      "email": "info@homelandschorley.co.uk"
    },
    {
      "url": "https://umh.com/community/highland-estates/",
      "email": "highlandestates@umh.com"
    },
    {
      "url": "https://umh.com/community/highland-estates/",
      "email": "ir@umh.com"
    },
    {
      "url": "https://umh.com/community/highland-estates/",
      "email": "press@umh.com"
    },
    {
      "url": "https://umh.com/community/highland-estates/",
      "email": "wecanhelp@umh.com"
    },
    {
      "url": "https://highlandparkins.com/contact-us/",
      "email": "denver@highlandparkins.com"
    },
    {
      "url": "https://highlandparkins.com/contact-us/",
      "email": "eric@highlandparkins.com"
    },
    {
      "url": "https://highlandparkins.com/contact-us/",
      "email": "info@highlandparkins.com"
    },
    {
      "url": "https://www.highlands.co.nz/contact-us",
      "email": "info@highlands.co.nz"
    },
    {
      "url": "https://www.highlands.co.nz/contact-us",
      "email": "josie@highlands.co.nz"
    },
    {
      "url": "https://www.mhbay.com/mobile-home-parks/25372-highlands-mobile-home-park-inc-in-clermont-fl",
      "email": "info@nicheinvestments.com"
    },
    {
      "url": "https://www.mobilehomeparkstore.com/mobile-home-parks/25372-highlands-mobile-home-park-inc-in-clermont-fl",
      "email": "info@nicheinvestments.com"
    },
    {
      "url": "https://www.mobilehome.net/mobile-home-parks/25372-highlands-mobile-home-park-inc-in-clermont-fl",
      "email": "info@nicheinvestments.com"
    }
  ],
  "mails": [
    "20@750x163.jpg",
    "denver@highlandparkins.com",
    "eric@highlandparkins.com",
    "highlandestates@umh.com",
    "info@highlandparkins.com",
    "info@highlands.co.nz",
    "info@homelandschorley.co.uk",
    "info@nicheinvestments.com",
    "ir@umh.com",
    "john.guerra@highlandsnewssun.com",
    "josie@highlands.co.nz",
    "press@umh.com",
    "webcomments@highlandsnewssun.com",
    "wecanhelp@umh.com"
  ],
  "nombre_sitio": "highlandsmhp.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://thehighlandsmhp.com/contact.html",
      "text": "Contact Us Home About\r\n\r\n\r\n            Us Amenities Activities Documents Contact\r\n\r\n\r\n            Us The Highlands, Inc. 332 W. Matterhorn\r\n            Street Oro Valley, AZ 85737- 9739 We welcome your\r\n            inquiries and questions. Office Hours: Monday â\r\n            Friday from 10:00 am - 2:00 pm OFFICE:\r\n                 520- 297- 2722 OFFICE EMAIL: diane1highlands@gmail.com BILLING EMAIL: highlands332@gmail.com"
    },
    {
      "url": "https://www.midfloridanewspapers.com/highlands_news-sun/high-rent-abandon-home/article_d9a613f0-dbf0-11ee-916c-07050c0df905.html",
      "text": "High rent, abandon home | Highlands News-Sun | midfloridanewspapers.com Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Login I want to Read local news Find old stories Submit a News tip Write a letter to the editor Subscribe Start/Stop my paper Cancel Services Report that I didn't get my paper Download mobile app Place a classified ad Find a job Find something to do in the area Find staff numbers Buy a photo Learn about the Sun newspaper's history Publications Highlands News-Sun Highlands Sun Lakeland_sun Winter Haven Sun Clermont News Leader Triangle News Leader Four Corners Sun Sumter Sun Times News Business News Archives Classifieds Employment Real Estate Vehicles Place An Ad Obituaries Sports Local National Events Featured Sections Around Town Faith & Family Highlands Health Highlands_homes Well Being In The Heartland Marketing Ideas for Small Business Viewpoint Columns Editorials Letters to the editor Submit a letter Announcements Anniversaries Births Engagements Weddings Subscribe Start subscription Manage my subscription Carrier application E-Paper E-Paper Public Notices HNS Public Notices Florida Public Notices Contact Us Purchase Photos Submit a letter to the editor Submit a news tip Site search Search 76° Venice, FL (34285) Today Cloudy early with scattered thunderstorms developing this afternoon. High 87F. Winds NE at 10 to 15 mph. Chance of rain 50%.. Tonight Variably cloudy with scattered thunderstorms. Low 74F. Winds NE at 5 to 10 mph. Chance of rain 50%. Rainfall near an inch. Updated: September 11, 2025 @ 4:35 am Full Forecast 863-385-6155 Facebook Menu Site search Search Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout How to Set Up Your Account Home E-Paper Featured Sections Around Town Faith & Family Highlands Health Highlands Homes Well Being In The Heartland Welcome Home Marketing Ideas for Small Business Special Sections Obituaries Public Notices HNS Public Notices Florida Public Notices Subscribe Events AP News Business Entertainment International Lifestyles National Sports State Travel Washington Weather Share This Facebook Twitter WhatsApp SMS Email Close High rent, abandon home By JOHN GUERRA\nStaff Writer jguerra Author email Mar 10, 2024 Mar 10, 2024 Updated Apr 14, 2025 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save Facebook Twitter WhatsApp SMS Email Print Copy article link Save Surging lot rents in mobile home parks have forced retirees in Highlands County to abandon their homes and move away. Three retirees whose lot rent increases are forcing them out agreed to tell their story to the Highlands News-Sun. Ron Hall has lived in his manufactured home in Bonnet Lake Estates in Avon Park for decades. The 80-something retired masonry contractor may have to abandon his home in the lot where it sits. He can’t afford to move the home to a less-expensive mobile home community. Leaving homes behind “I don’t know where I’m going to move,” Hall said. “I’m going to try to get into low income housing. I’ll just have to leave my house here. The prices are so high, they are taking our places.” There is irony here: Hall helped build the community of Tanglewood, the well-maintained mobile home development in Sebring. Lisa Martin is in the same boat. “There’s no rent control in the state of Florida,” said Martin, who is also making plans to abandon her trailer. “Several years ago, lot rent here was $275; then it went to $350 in 2022, last year it was $550, and this year it’s $700.” Bonnet Lakes Estates, which property records show is owned by GMF Group Fund II Holdings LLC, adds other charges to the lot bill – a common practice. “The dirt rent is $700, but they charge us to mow the lawn, they charge us a water meter fee, a second water fee, and they charge us to empty the dumpster – that’s another $80 or $90 for those items,” said Robert Hall, who lives a few doors up from Ron. He and Ron Hall are not related. Walked away from his trailer Pointing across the lane to an empty trailer, Robert Hall said, “That guy walked away and abandoned his trailer.” Both Matthew Forssman and Gabe Monfried, listed as managing partners at GMF Group – the company that owns Bonnet Lake Estates – declined to comment and hung up their phones when asked about raising lot rents in the park. To be fair, GMF Group is not breaking the law with its rent increases; Florida law does not limit how much landlords can raise rent. In fact, what’s happening to Bonnet Lakes’ residents is happening to other Highlands County’s retirees whose rents have outpaced their fixed incomes. The University of Florida’s Shimberg Center for Housing Studies in 2023 determined that low-income renters – those who make less than 60 percent of the average median income – make up 28% of Highlands County renters. Cyndi S. Dassinger, director of civil/child support/probate, told the Highlands News-Sun in September 2023 that her office had processed 199 evictions between March and August 2023 – an average of 33 evictions a month. Ingra Gardner, the county’s director of community programs, told the Highlands News-Sun Tuesday the county has State Housing Initiative Partnership Program (SHIP) money for individuals and families on the edge of homelessness. Re-housing assistance “It goes for foreclosure prevention, emergency funds for renters, and provides for rapid re-housing rental assistance,” Gardner said. Unfortunately for the Bonnet Lakes Estates retirees, housing assistance is limited to people whose trailers were built in mid-1994 or sooner. The county, however, can provide first month’s rent and a security deposit for a new rental, as well as deposits for water and power bills at those new locations. The county recently received about $1.2 million from the state for rental assistance and other affordable housing initiatives. The county commission adopted the budget amendment at its March 5 meeting. A spreadsheet Gardner provided the commission shows that SHIP at one point has set aside $325,000 for down payment assistance; $321,209 for housing rehabilitation; $50,000 in foreclosure intervention; $50,000 in emergency home repairs; and $150,000 in emergency housing assistance. Rental assistance shows the need The county’s Affordable Housing Advisory Committee – which recommends where to spend the money — helped develop the rental assistance program about two years ago. “We see a significant need from people who can’t afford the sheer cost of rent,” Gardner said. “The need has increased exponentially for rental assistance.” The SHIP money also goes to rehabilitate substandard single-family, owner-occupied units. Income-verified and certified applicants may be eligible for down payment/closing cost help, too. Gardner’s office works with other affordable housing groups, including the advisory committee, the Heartland Coalition for the Homeless, and other nonprofits in the county. Highest amount The SHIP money comes from each county’s document stamp taxes. People pay the tax when they transfer deeds or other instruments at the courthouse. According to the Highlands County Clerk’s Office, the documentary stamp tax rate can be 35 cents per $100 for one type of document and and 70 cents per $100 for others. The $1.184 million in SHIP money is the highest the county has ever received, County Commission Chair Kevin Roberts told fellow commissioners on March 5. “In the old days, it was $1,000, $5,000 or $20,000,” said Roberts, who sits on the Affordable Housing Advisory Committee. “This is the highest it’s ever been.” For information on housing assistance, contact County Housing Coordinator Lucy Castillo at 863-402-6648. Facebook Twitter WhatsApp SMS Email Print Copy article link Save jguerra Author email Follow jguerra Recommended for you Click Here For More Information Latest News CRA focuses on beautifying Avon Park with art American Legion Post 69 raising money for wreaths Sports Briefs: Former Rays star Franco enters mental health clinic McCarthy rallies Vikings over Bears Florida teams off to a good start Latest e-Edition Highlands News-Sun To view our latest e-Edition click the image on the left. Associated Press News NY-STAR-MOUNTAIN Star Mountain Exits Another Successful Growth and Consolidation of a Low Public Market Correlated, Main Street Business, DCCM, Investment in Partnership with White Wolf Capital Group TIYA Conference 2025: Over 150 Youth Leaders from 15 Countries Gathered to Advance United Nations’ SDGs Sudden deluge of rain floods some streets and halts air and rail traffic in Tokyo Today in History: September 11, al-Qaeda attacks the United States Highlands Special Sections Special Sections South Florida State College Aug 30, 2025 Special Sections Fall High School Sports 2025 Aug 23, 2025 Special Sections Highlands Special Sections Aug 5, 2025 Obituaries Vilma Edith Ameglio Lopez Washburn James Bennett +2 Donald F. Rowe +2 Lyle T. Storlie John H. Yoder Sections Home News Opinions Entertainment Sports e-Edition Online Features Terms of Use Services Subscription_services Submission Forms Classifieds Place An Ad Search Weather midfloridanewspapers.com 321 N Ridgewood Dr Sebring, FL 33870 Phone: 863-385-6155 Email: webcomments@highlandsnewssun.com Facebook Unless otherwise stated, DR Media and Investments and/or licensor own the\n      intellectual property rights for all material on DR Media and Investments.\n      All intellectual property rights are reserved. You may view and/or print\n      pages from http://www.d-rmedia.com/ and its affiliate sites for your own personal use subject to restrictions\n      set in these terms and conditions. The reuse or sharing of any story on DR Media and Investments and its affiliate sites can not be done without written consent. © Copyright 2025 Mid Florida Newspapers 300 South Tamiami Trail, Venice, FL 34285, Venice, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital . × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox"
    },
    {
      "url": "https://www.homelandschorley.co.uk/contact-us/",
      "text": "Contact Homelands Park | Get in Touch Today Home About Us About Homelands Park Part Exchange FAQ’s Our Park Go to Our Park Our Residents Places to Visit Homes For Sale Gallery Contact Us 01746 718145 How can we help you today?  Homelands Park High Green, Chorley, Nr Bridgnorth, Chorley, Shropshire, WV16 6PP  Mobile 07980 828311  Telephone 01746 718145  Email info@homelandschorley.co.uk Contact Us Contact Us Form Name (Required) Telephone (Required) Email (Required) Address (Required) Postcode (Required) Message (Required) Consent for storing submitted data (Required) Yes, I give permission to store and process my data. We are members of the BH&HPA (British Holiday & Home Parks Association). Footer Form Name (Required) Email (Required) Comments (Required) Contact Details  Address Homelands Park, High Green. Chorley, Near Bridgnorth, Shropshire, WV16 6PP England  Email info@homelandschorley.co.uk  Mobile 07980 828311  Telephone 01746 718145 Privacy Policy | Cookie Policy | Disclaimer | Terms of use © 2024 Homelands Park. All Rights Reserved. Created by KiXX"
    },
    {
      "url": "https://umh.com/community/highland-estates/",
      "text": "Highland Estates | UMH Properties Close X Current Location Menu Buy Rent Resident Portal More About UMH Media Resources Careers Investors Self Storage Contact Us X Current Location Home Buy Rent Resident Portal Resources Careers Investors Self Storage Contact Us × Special Promotion × Contact an Agent First Name * Last Name * Email * Phone Number * Your Message * By providing your phone number, you agree to receive text messages from UMH Properties, Inc for the purpose of communicating community news, urgent notifications, and events. Reply “STOP” to opt-out anytime or reply “HELP” for more information. Message and data rates may apply. Message frequency will vary. For more information, please read our Privacy Policy and Terms of Service . × GET PDF Email * × SHOW UNIT AMENITIES × Estimate Your Monthly Payment Based on a year fixed loan Price Loan Amount Marketed Lot Rent Interest Rate Down Payment Estimated Payment $367/mo Community Highland Estates Overview FEATURED HOMES TESTIMONIALS COMMUNITIES NEARBY Community Details Fall in love with a brand new home at Highland Estates, a manufactured home community in beautiful and rural Kutztown, PA. Known for its quaint Dutch community, Highland Estates offers high-quality, turnkey ready homes. UMH Properties, Inc. provides the perfect blend of affordability and sought-after features including open concept floor plans and custom touches. Enjoy this beautifully maintained community with world-class amenities. Our residents also enjoy an on-site pool, playground, basketba... Show More Amenities 24 Hour Maintenance Services Basketball Court Community Center Fitness Center Garbage Removal Included On Site Management Playground Pool Storage Space Pet Policy No Pets Allowed in Rental Homes Small Pets Allowed for Homeowners Dog Weight Limit Ibs: 50 Pet Restriction: Contact community manager for pet breed and age restrictions and for further details regarding our pet policy. Pet Count: 2 Highland Estates 60 Old Route 22 Kutztown, Pennsylvania 19530 Community Manager Jeff Wolfe/Norma Email HighlandEstates@umh.com Phone (610)285-6311 Hours Monday to Friday: 9am to 5pm Saturday: 9:00 AM to 5:00 PM Sunday: Appointment Only Contact Us Featured Homes Pricing and images below are subject to change 51 Pheasant Dr. For Sale $ 50,000 Total sales price $ 1,278 ESTIMATED MONTHLY LOAN & LOT RENT PAYMENT Bed: 3 Bath: 2 SQ Footage: 1624 View Listing Apply Book a Tour Sale Pending 184 Creek Road For Sale $ 69,000 Total sales price $ 1,303 ESTIMATED MONTHLY LOAN & LOT RENT PAYMENT Bed: 3 Bath: 2 SQ Footage: 1064 View Listing Apply Book a Tour Sold 52 Pheasant Dr. For Sale $ 60,000 Total sales price $ 1,180 ESTIMATED MONTHLY LOAN & LOT RENT PAYMENT Bed: 3 Bath: 2 SQ Footage: 1200 View Listing Apply Book a Tour Load more Testimonials What Our Residents Say Incredibly friendly, clean and relaxing. I’ve only been here a short while but I love it already. Kevin K. I love it here! Especially love using the pool in the summertime. My son and daughter both love it here. Jessica and Norma are so kind to us. We are so thankful to have met them. Brian B. Our home is filled with memories of our family & grandkids growing up here, hosting parties, playing tag, nerf, swimming, football, walks, yard sales, baseball, flying kites at the park and so much more . Living here over 25 years now, I have seen it evolve. When the Wolfe family took over the management of the park they made a contribution UMH could never repay them for. They turned this park around and have never stopped improving it. They don't hesitate to help when they can, address issues, resolve problems and are competent and compassionate with their residents! Norma always amazed me how she takes time to know every family. And her Team is always working to improve the park and keep it clean. This community will forever hold a piece of my heart. We are proud to live in Highland Estates and pray the Wolfe's never retire!\nI highly suggest anyone looking for a peaceful community to call home, to check Highland Estates out, a safe neighborhood where you can hang your hat and proudly hang your American flag too. It is a great community to raise your family or even retire, because of the Wolfe family that manages it and their hardworking team that goes above and beyond any other. So my husband and I thank you and toast to you for all you do year after year! Teresa H. This community is such a nice, safe environment. I can genuinely enjoy my time in and around my home, and any issues are answered to right away. I’m appreciative of this home and community! Kellie J. Highland Estates is a safe and quiet neighborhood. I love renting here because you cannot beat the price and amount of space anywhere else. So much better than an apartment with your own yard and driveway. Everyone in the office is so nice and helpful including maintenance who are quick and efficient whenever I have needed anything. Will continue to enjoy living here and will recommend to others as well! Katie D. I love the friendships I have developed with my neighbors and the sense of community makes me feel so safe. Salley K. Very quiet community. The office staff is very accommodating and friendly! Emily G. Highland Estates has been a great place to live. The community is beautifully kept and you can't beat how quiet and peaceful it is. Having lived here for close to 5 years now, it is hard to imagine a good reason to move. It is close to everything, affordable and breaks all of the old stereotypes of a manufactured housing communities. David M. Highland Estates is a very quiet quaint neighborhood. It’s accessible to many restaurants and shops. They have a variety of amenities such as a pool a gym and clubhouse. They also have two playgrounds for the children. If you look around the streets you will see lots of families enjoying the outdoors among our nicely landscapes grounds. Catherine H. This community is so vibrant and full of life. I have lived in various properties for over 10 years in this community, and the one of the major factors that keeps me here and happy is the amazing staff! Jessica Mink and Norma Wolfe are two of the most amazing management staff I have met in my entire life! They always solve any problem that comes up quickly and efficiently. I absolutely love living here and will continue to do so for years to come. Thomas W. Great, friendly, quiet community. We enjoy going to the pool and playground and the staff at Highland Estates is awesome. Whenever you have a question or need something they are always there. Caroline S. It is a great place to live. It’s very quiet and the staff is great. Jason H. Nice, quiet community. Never any trouble and I feel safe at night. Manny M. From the pristine mountain view, to the friendly surrounding, the time spent here has been relaxing. Management, staff, maintenance, are all one of the friendliest I have ever encountered. Quick and responsive to all of your needs, they always go above and beyond to make you feel comfortable. I feel proud to call Highland Estates my home. Nabil S. I grew up here then left, it feels like home here and I’m so happy to be back in this community. The area is quite and peaceful. It’s a beautiful place to live. Aimee Z. My husband and I were one of the first homes in Highland Estates. We have been here 22 years and have been very comfortable and content living here. There are sometimes deer in our back yard and hummingbirds at our feeders. The maintenance staff are always there to help when needed. The neighborhood is always well kept by all that live here, and there are friendly people that usually always have the time to waive or stop to talk. Pets are welcome . Snow is kept up with in the winter. There is a pool and gym and a recreation Hall for parties.  It has been a pleasure living in a community where we can relax and enjoy our lives. John S. Before moving into Highland Estates, my husband and I had been looking in several parks over the years and were not sure if it was going to be a good fit to sell our house and move into a mobile home community. Though we kept coming back to check out the homes in this community because it was always very clean and well maintained compared to others. With much prayer, we were led to purchase a home here. What a blessing! Norma and Jessica are so friendly and helpful. The maintenance crew works hard at keeping up with everything. I have to say, the staff really cares about the community and the residents who live here. Nice neighbors…enjoy the pool…and would definitely recommend Highland Estates to others. Dennis M. Very quiet community. The office staff is very accommodating and friendly! Emily B. Highland Estates is a safe and quiet neighborhood. I love renting here because you cannot beat the price and amount of space anywhere else. So much better than an apartment with your own yard and driveway. Everyone in the office is so nice and helpful including maintenance who are quick and efficient whenever I have needed anything. Will continue to enjoy living here and will recommend to others as well! Katie B. Communities Nearby Communities Nearby Frieden Manor Schuylkill Haven, Pennsylvania Home Prices $135,000 Rental Prices $ 1050 + Mountaintop Narvon, Pennsylvania Home Prices $100,000 Rental Prices $ 1000 + Arbor Estates Doylestown, Pennsylvania Home Prices $104,000 Rental Prices $ 1025 + Valley View Ephrata 1 Ephrata, Pennsylvania Home Prices $90,900 Rental Prices $ 1100 + Valley View Ephrata 2 Ephrata, Pennsylvania Home Prices $90,900 Rental Prices $ 1100 + Valley Stream Mountain Top, Pennsylvania Home Prices $90,900 Rental Prices $ 1000 + Monroe Valley Jonestown, Pennsylvania Home Prices $120,000 Rental Prices $ 1500 + Pleasant View Estates Bloomsburg, Pennsylvania Home Prices $90,900 Rental Prices $ 800 + Brookside Village Berwick, Pennsylvania Home Prices $110,000 Rental Prices $ 950 + Heather Highlands Inkerman, Pennsylvania Home Prices $90,900 Rental Prices $ 850 + Oxford Village West Grove, Pennsylvania Home Prices $120,000 Rental Prices $ 849 + OUR COMMUNITIES Alabama Florida Georgia Indiana Maryland Michigan New Jersey New York Ohio Pennsylvania South Carolina Tennessee LEARN MORE Resources Join Our Team Investors CONTACT Customers: wecanhelp@umh.com Investors: ir@umh.com Press: press@umh.com Phone: 1-800-504-0670 Careers UMH Properties. All rights reserved. Privacy Policy Terms of Use Accessibility Sales & Finance OUR COMMUNITIES Alabama Florida Georgia Indiana Maryland Michigan New Jersey New York Ohio Pennsylvania South Carolina Tennessee Learn More Resources Join Our Team Investors CONTACT Customers: wecanhelp@umh.com Investors: ir@umh.com Press: press@umh.com Phone: 1-800-504-0670 Careers Privacy Policy Terms of Use Accessibility Sales & Finance UMH Properties. All rights reserved."
    },
    {
      "url": "https://highlandparkins.com/contact-us/",
      "text": "Contact Highland Park Insurance | Call, Email, or Chat With Us Skip to content Quote Call Directions Login Menu Insurance Insurance Services Coverage for individuals, private clients, businesses, and commercial properties. Get Quote Get Quote Personal Lines Private Clients Business Insurance Commercial Property Homeowners High Net Worth Vehicles Life Umbrella Boat Landlords Private Client Private Clients Specialized coverage for individuals with high net worth. Get Quote Get Quote Homes & Property Luxury & Exotic Vehicles Jewelry & Valuables Personal Umbrella Business Business Insurance Services Customized coverage for all types of businesses, large and small. Get Quote Get Quote Commercial Property Business Vehicles General Liability Workers Compensation General Liability Workers Comp Commercial Auto Commercial Property Professional Liability Business Owners Policy (BOP) Commercial Package EPLI Insurance Cyber Liability Property Commercial Properties Customized coverage for the unique needs of commercial properties. Onboarding Packet Onboarding Packet Get Quote Get Quote HOAs & Condo Buildings Office Buildings Apartment Buildings Shopping Centers Industrial Buildings Warehouse Buildings Self-Storage Buildings Hotels & Motels Company Our Company About Us Our Team Reviews Blog Careers Get in Touch Contact Make Appointment Refer Friends & Family Location Dallas Office 5740 Prospect Avenue Suite 2000 Dallas , Texas 75206 Phone: 214-699-7484 Fax: 972-521-9229 Get Directions Get Directions Latest Articles How To Prevent a Holiday Season Home Burglary Is Your Vehicle Ready for Winter Weather? 15 Life Changes To Tell Your Insurance Agent About All Blog Articles All Blog Articles About Us Our Team Calendar Contact Latest Reviews Refer Friends & Family Blog Careers Main Menu Insurance Insurance Services Coverage for individuals, private clients, businesses, and commercial properties. Get Quote Get Quote Personal Lines Private Clients Business Insurance Commercial Property Homeowners High Net Worth Vehicles Life Umbrella Boat Landlords Private Client Private Clients Specialized coverage for individuals with high net worth. Get Quote Get Quote Homes & Property Luxury & Exotic Vehicles Jewelry & Valuables Personal Umbrella Business Business Insurance Services Customized coverage for all types of businesses, large and small. Get Quote Get Quote Commercial Property Business Vehicles General Liability Workers Compensation General Liability Workers Comp Commercial Auto Commercial Property Professional Liability Business Owners Policy (BOP) Commercial Package EPLI Insurance Cyber Liability Property Commercial Properties Customized coverage for the unique needs of commercial properties. Onboarding Packet Onboarding Packet Get Quote Get Quote HOAs & Condo Buildings Office Buildings Apartment Buildings Shopping Centers Industrial Buildings Warehouse Buildings Self-Storage Buildings Hotels & Motels Company Our Company About Us Our Team Reviews Blog Careers Get in Touch Contact Make Appointment Refer Friends & Family Location Dallas Office 5740 Prospect Avenue Suite 2000 Dallas , Texas 75206 Phone: 214-699-7484 Fax: 972-521-9229 Get Directions Get Directions Latest Articles How To Prevent a Holiday Season Home Burglary Is Your Vehicle Ready for Winter Weather? 15 Life Changes To Tell Your Insurance Agent About All Blog Articles All Blog Articles About Us Our Team Calendar Contact Latest Reviews Refer Friends & Family Blog Careers Search for: Account 214-699-7484 Clients Resources Send Policies MVR Request Loss Runs Request Mortgagee Change Make a Payment For Clients Client Center Policy Changes Report a Claim Certificates Portal Renewal Questionnaire Client Center Policy Service Report a Claim Certificates Portal MVR Request Loss Runs Request Insurance Companies Mortgagee Change Request Make a Payment Login Search for: Quote Contact Highland Park Insurances Our team are insurance experts for private clients, businesses and families. Insurance Quote Send Policies Contact Eric Graves 2024-06-29T15:54:15-05:00 Highland Park Insurance 5740 Prospect Avenue Suite 2000 Dallas , Texas 75206 Phone: 214-699-7484 Fax: 972-521-9229 Email: info@highlandparkins.com Monday 8:00 AM - 5:00 PM Tuesday 8:00 AM - 5:00 PM Wednesday 8:00 AM - 5:00 PM Thursday 8:00 AM - 5:00 PM Friday 8:00 AM - 5:00 PM Dallas Office Send a message \" * \" indicates required fields Are you a current client? No Yes Name * First Last Email * Phone Can we text you? * Yes No By selecting yes on the option above, you confirm that Highland Park Insurance can send you electronic communications or texts/calls. Please visit our Privacy Policy for more information. Agent Eric Graves Denver Brown Message Looking for a quote? Get Started Here Email This field is for validation purposes and should be left unchanged. Ready to get started, or have questions? Give us a call, or reach out via the contact form here. We're happy to talk about reviewing your current insurance, or help you get a new policy started! Helpful Links Client Center Send Us Current Insurance Request Policy Change Report a Claim Make Appointment Change Mortgagee Insurance Company Directory MVR Request Loss Run Request Refer Friends & Family Get Insurance Our knowledgable agents are experts at finding the right coverage for your family or business. Get your insurance quote now. Get Insurance Quote Get Insurance Quote Send Current Policies Send Current Policies Office Address 5740 Prospect Avenue Suite 2000 Dallas , Texas 75206 Phone: 214-699-7484 Fax: 972-521-9229 View Location › Mailing Office 25 Highland Park Village Suite 100-#553 Dallas, TX 75205 Get Insurance Businesses Commercial Property Private Clients Families & Individuals Trucking All Quote Options Resources Products Blog About Contact Send Current Insurance Refer Friends & Family For Clients Client Center Policy Service Report a Claim Certificates Portal Make a Payment My Profile California DBA: Highland Park Insurance Agency DISCLAIMER: Informational statements regarding insurance coverage are for general description purposes only. These statements do not amend, modify or supplement any insurance policy. Read your policy or consult with your agent for details. Your eligibility for particular products and services is subject to final underwriting and acceptance by the insurance company providing such products or services. This website does not make any representations that coverage does or does not exist for any particular claim or loss, or type of claim or loss, under any policy. Be sure to read the policy, including all endorsements, or prospectus, if applicable. Accessibility | Privacy Policy | Cookie Policy | Terms of Service | Sitemap Copyright © Highland Park Insurance  |  Website hosted by GravityCerts Page load link Start Your Quotes Select an Insurance Type Sorry, your browser doesn't support embedded videos. Family & Individuals Insurance Start Quote Sorry, your browser doesn't support embedded videos. Business Insurance Start Quote Sorry, your browser doesn't support embedded videos. Commercial Properties Start Quote Send Your Current Policies Send Your Current Policies Additional Quote Options Schools / Youth Programs Adult Foster Care Contractors Course of Construction Non Profits Religious Organizations Pollution Liability Quick General Liability Need a Policy Recommendation? Contact Us Make Appointment Call: 214-699-7484 M-F 8:00am – 5pm CST Login Username or Email Password Log in Remember Me Lost password Don't have an account? Create Account Create Account Insurance Fraud Statement Fraud is a crime If your application contains purposefully misleading, absent, or inaccurate information, you could be charged with fraud. Your insurance carrier could potentially void your policy, or you could face civil or criminal charges or penalties. Any person who knowingly and with intent to defraud any insurance company or other person, files an application for insurance or statement of claim containing any materially false information or conceals, for the purpose of misleading, information concerning any fact material thereto, commits a fraudulent act, which is a crime. We use cookies to offer you a better browsing experience, analyze site traffic and personalize content. Read about our Cookie Policy . Ok Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset Sitemap Sitemap"
    },
    {
      "url": "https://www.highlands.co.nz/contact-us",
      "text": "Contact Highlands Experience the Exceptional | Highlands No items found. Experiences Link 3 QUEENSLAND RACING DRIVER CHAMPIONSHIP QUEENSLAND RACING DRIVER CHAMPIONSHIP QUEENSLAND RACING DRIVER CHAMPIONSHIP QUEENSLAND RACING DRIVER CHAMPIONSHIP Text Link Text Link Text Link Text Link U Drive Go Karting Radical U-Drive V8 Muscle Car U-Drive Track Laps Breakfast Subaru WRX Experience Winter Drive Experience We Drive Supercar Fast Dash Highlands Taxi Attractions Link 3 QUEENSLAND RACING DRIVER CHAMPIONSHIP QUEENSLAND RACING DRIVER CHAMPIONSHIP QUEENSLAND RACING DRIVER CHAMPIONSHIP QUEENSLAND RACING DRIVER CHAMPIONSHIP Highlands Mini Golf Bike Hire with Trail Journeys Highlands Museum Loo with a View! Highlands Cafe Take A Virtual Tour Young Guns Virtual Reality Room Highlands Mini Golf Highlands Museum Loo with a View! Experiences Back Experiences U DRIVE Go Karts Radical U-Drive V8 Muscle Car U-Drive Track Laps Breakfast Subaru WRX Experience Winter Drive Experience WE DRIVE Supercar Fast Dash Highlands Taxi Attractions Back Attractions Highlands Mini Golf Bike Hire with Trail Journeys Highlands Museum Loo with a View! Highlands Cafe Take A Virtual Tour Young Guns Virtual Reality Room Events Back Events All Events Track Laps Breakfast at Highlands South Island Endurance Series R3 Highlands MEGA 9 to 5 Events Link 3 All Events Track Laps Breakfast at Highlands South Island Endurance Series R3 Highlands MEGA 9 to 5 Events Getting on track Track days Gift Vouchers Group Bookings Specials GTÂ Membership Link 3 GT Membership Innovation & Technology Park GT Membership Back GT Membership GT Membership Innovation & Technology Park TQF Road Safety Contact Us GT membership Academy News About us Contact Us Contact us Letâs get in touch 03 445 4052 Call us info@highlands.co.nz Email us Opening Mon - Sun: 10am to 4pm ANZAC Day: Open 1pm Christmas Day: Closed Boxing Day: Closed Find us Daily 10am - 4pm GET DIRECTIONS Send enquiry & Feedback We will be monitoring these enquiries during work hours so will respond as soon as possible. Name Phone number Email Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Media enquiry FOR ALL GENERAL MEDIA QUERIES Please contact Josie Spillane Email: josie@highlands.co.nz Stay on-site at Central Park Apartments Planning your next trip to Highlands? Stay at Central Park Apartments! BOOK HERE Stay up to date with news. For all the latest info on our experiences and events, subscribe to our newsletter today. Name Email Thank you for subscribing! Your submission has been received! Oops! Something went wrong while submitting the form. Join 20,000+ readers reading this beautiful newsletter. Media enquiry Working members of the media, series/category, team publicists and photographers are invited to apply for media accreditation for all Hampton Downs promoted events up until June 30th 2020. Make enquiry Had a great day out woth the family Had a great day out woth the family Had a great day out woth the family Had a great day out woth the family Highlands get directions Highlands Motorsport Park, Corner SH6 & Sandflat Road, Cromwell, Otago 03 445 4052 info@highlands.co.nz Â© Copyright 2024 Highlands Motorsport Park Opening hours: 10am-4pm 7 days a week Privacy Policy Terms & Conditions About Us News Event Policies Volunteer at Highlands Terms & Conditions Hampton Downs Game Over Auckland Game Over Queenstown Taupo Motorsport Park Tony Quinn Foundation Get directions"
    },
    {
      "url": "https://www.mhbay.com/mobile-home-parks/25372-highlands-mobile-home-park-inc-in-clermont-fl",
      "text": "Highlands Mobile Home Park Inc - mobile home park in Clermont, FL 25372 Mobile Homes (current) For Sale For Rent Mobile Home Lots For Sale For Rent Mobile Home Parks Resources Buying A Manufactured Home Manufactured Home Appraisers Manufactured Home Dealers Manufactured Home Financing Manufactured Home Inspectors Manufactured Home Insurance Manufactured Home Movers Manufactured Housing Resources Manufactured Housing Regulatory Agencies Manufactured Housing Associations Manufactured Housing Landlord & Tenant Laws Manufactured Housing Articles Manufactured Housing Education Manufactured Home Repairs & Services Manufactured Home Repairs Manufactured Home Electrical Manufactured Home Foundations Manufactured Home Plumbing & HVAC Manufactured Home Septic Manufactured Home Utilities Manufactured Home Parts & Supplies Manufactured Home Parts Manufactured Home Decks, Steps & Sheds Manufactured Home Roofing Manufactured Home Skirting Manufactured Home Windows & Doors Log In Add Listing Mobile Home for Sale Mobile Home for Rent Mobile Home Lot for Sale Mobile Home Lot for Rent Advertise Home Mobile Home Parks Directory Florida Lake Clermont Highlands Mobile Home Park Inc Highlands Mobile Home Park Inc 17730 Us Highway 27 # 6 , Clermont , FL 34715-9530 CONTACT LISTER Contact Information Manager CONTACT LISTER Share Share Tweet Mobile Home Park Details Number of Lots: 66 Listing ID: 25372 Posted On: Mar 9, 2011 Updated On: Mar 9, 2011 Check your credit score before applying to this mobile home community. Free Credit Score Do you own or manage this community? Contact us to improve this listing to attract more residents. Contact Us Contact Information Manager CONTACT LISTER Share Share Tweet Similar Mobile Home Parks Featured Orange Lake 15840 Sr 50, Lot 32 , Clermont , FL 34711 All Age Community OUTDOOR RESORTS AT ORLANDO 9000 U.S. 192 , Clermont , FL 34714 Timber Village MHP 15130 6 Timber Village Rd , Groveland , FL 34736 55+ Community 99 Lots Lakeside Cottages and RV Park 851 Killarney Plaza , Winter Garden , FL 34787 Hyde Park 55+ Community 14253 W Colonial Dr , Winter Garden , FL 34787 55+ Community 396 Lots The best place to find new and used mobile homes, mobile home lots and mobile home parks. MHBay.com is part of the MobileHomeParkStore.com network. Mobile Homes Mobile Homes for Sale Mobile Homes for Rent Articles Mobile Home Lots Mobile Home Lots for Sale Mobile Home Lots for Rent MH Park Directory Our Company Contact Us About Us Advertise Privacy Policy User Agreement NicheInvestments Sites MobileHomeParkStore.com RVPark.com RVParkStore.com SelfStorages.com MHSales.com OutdoorBillboard.com © 2025 NicheInvestments LLC. All Rights Reserved"
    },
    {
      "url": "https://www.mobilehomeparkstore.com/mobile-home-parks/25372-highlands-mobile-home-park-inc-in-clermont-fl",
      "text": "Highlands Mobile Home Park Inc - mobile home park in Clermont, FL 25372 Mobile Home Parks for Sale Learn (current) MHP Boot Camp MHP Books & CD's MHP Forum MHP Articles Resources Buying Mobile Home Parks Early Access to MH Parks for Sale Mobile Home Park Brokers Mobile Home Park Financing Mobile Home Park Glossary Manufactured Housing Directories Mobile Homes for Sale Mobile Home Parks - over 40,000 listed! Expired Mobile Home Park Listings Manufactured Home Dealers/Retailers State Manufactured Housing Associations Manufactured Housing Administrative Agencies Landlord & Tenant Laws by State Mobile Home Park Services 1031 Companies Aerial Photographers Attorneys, Consulting & Due Diligence Auction Companies Community Management Mobile Home Park Help Wanted Mobile Home Park Jobs Wanted Mobile Home Movers Mobile Home Financing Mobile Home Insurance Mobile Home Park Insurance Mobile Home Park Appraisers Mobile Home Park Construction Mobile Home Parts, Products and Services Mobile Home Park Wi-Fi & Networking Investor Directories Mobile Home Park Investors Mobile Home Investors Mobile Home Note Investors Lonnie Dealers & Partnering Parks Log In Add Listing Sell a Park Other Home Mobile Home Parks Directory Florida Lake Clermont Highlands Mobile Home Park Inc Highlands Mobile Home Park Inc 17730 Us Highway 27 # 6 , Clermont , FL 34715-9530 CONTACT LISTER Contact Information Manager CONTACT LISTER Share Share Tweet Mobile Home Park Details Number of Lots: 66 Listing ID: 25372 Posted On: Mar 9, 2011 Updated On: Mar 9, 2011 Check your credit score before applying to this mobile home community. Free Credit Score Do you own or manage this community? Contact us to improve this listing to attract more residents. Contact Us Contact Information Manager CONTACT LISTER Share Share Tweet Similar Mobile Home Parks Featured Orange Lake 15840 Sr 50, Lot 32 , Clermont , FL 34711 All Age Community OUTDOOR RESORTS AT ORLANDO 9000 U.S. 192 , Clermont , FL 34714 Timber Village MHP 15130 6 Timber Village Rd , Groveland , FL 34736 55+ Community 99 Lots Lakeside Cottages and RV Park 851 Killarney Plaza , Winter Garden , FL 34787 Hyde Park 55+ Community 14253 W Colonial Dr , Winter Garden , FL 34787 55+ Community 396 Lots Mobile Home Parks for Sale Mobile Homes for Sale Our Company Contact Us About Us Advertise Privacy Policy User Agreement NicheInvestments Sites MHBay.com RVParkStore.com RVPark.com SelfStorages.com MHSales.com OutdoorBillboard.com © 2025 NicheInvestments LLC. All Rights Reserved"
    },
    {
      "url": "https://www.mobilehome.net/mobile-home-parks/25372-highlands-mobile-home-park-inc-in-clermont-fl",
      "text": "Mobile Home Park in Clermont, FL: Highlands Mobile Home Park Inc Mobile Homes (current) Mobile Homes for Sale Mobile Homes for Rent Foreclosed Mobile Homes Mobile Home Lots For Sale For Rent Mobile Home Parks Resources Mobile Home Buyers & Owners Mobile Home Appraisers Mobile Home Articles Mobile Home Dealers Mobile Home Glossary Mobile Home Inspectors Mobile Home Insurance Mobile Home Loans Mobile Home Movers Mobile Home Products & Services Mobile Home Builders Mobile Home Manufacturers Mobile Home Factory Locations by State Mobile Home Builder Histories Mobile Home Identification Mobile Home Trade Names & Models Mobile Home Park Investing MHP Investing Home Course MHP Investing Boot Camp Mobile Home Associations & Agencies Mobile Home Associations Mobile Home Administrative Agencies Mobile Home Tenant & Landlord Rights Manufactured Housing Statistics Other Mobile Home Links Senior Associations & Resources Log In Add Listing Mobile Home for Sale Mobile Home for Rent Mobile Home Lot for Sale Mobile Home Lot for Rent Advertise Highlands Mobile Home Park Inc 17730 Us Highway 27 # 6 , Clermont , FL 34715-9530 Request More Info Home Mobile Home Parks Directory Florida Lake Clermont Highlands Mobile Home Park Inc Highlands Mobile Home Park Inc 17730 Us Highway 27 # 6 , Clermont , FL 34715-9530 Number of Lots: 66 Property ID: 25372 Posted On: Mar 9, 2011 Updated On: Mar 9, 2011 Listed By: Manager View Phone Number Call (352) 394-3200 View Phone Number Call (352) 394-3200 Share Share Tweet Free Credit Score Do you own or manage this community? Contact us to improve this listing to attract more residents. Contact Us Similar Mobile Home Parks Featured Orange Lake 15840 Sr 50, Lot 32 , Clermont , FL 34711 All Age Community OUTDOOR RESORTS AT ORLANDO 9000 U.S. 192 , Clermont , FL 34714 Timber Village MHP 15130 6 Timber Village Rd , Groveland , FL 34736 55+ Community 99 Lots Lakeside Cottages and RV Park 851 Killarney Plaza , Winter Garden , FL 34787 Hyde Park 55+ Community 14253 W Colonial Dr , Winter Garden , FL 34787 55+ Community 396 Lots Advertise Contact Us Privacy Policy User Agreement © 2025 NicheInvestments, LLC. All Rights Reserved"
    }
  ]
}