{
  "fuentes": [
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "anthony.raimondo@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "art.woodruff@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "brady.lessard@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "building@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "cecil.smith@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "claudia.thomas@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "kerry.wiggins@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "liheap@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "lisa.holder@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "lisa.jones@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "norton.bonaparte@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "pamela.lynch@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "patrick.austin@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "ronnie.mcneil@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "steve.fiorey@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "traci.houchin@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "afterhourservice@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "angela.adkins@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "craig.radzak@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "lindsayc@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "lisa.holder@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "nico.durham@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "nicole.osburn@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "sharon.kraynik@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "sheena.britton@sanfordfl.gov"
    },
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "email": "utilitycustomerservice@sanfordfl.gov"
    },
    {
      "url": "https://downtownsanford.com/contact-us/",
      "email": "kplaudate@downtownsanford.com"
    },
    {
      "url": "https://downtownsanfordmarina.com/contact/",
      "email": "rosemary.aldridge@neel-schaffer.com"
    },
    {
      "url": "https://downtownsanford.com/about/",
      "email": "coordinator@downtownsanford.com"
    },
    {
      "url": "https://downtownsanford.com/about/",
      "email": "kplaudate@downtownsanford.com"
    },
    {
      "url": "https://www.sanfordusa.com/our-team/",
      "email": "rwilkin@sanfordusa.com"
    },
    {
      "url": "https://growsanfordnc.com/about-us/staff-board/",
      "email": "cgaddy@growsanfordnc.com"
    },
    {
      "url": "https://growsanfordnc.com/about-us/staff-board/",
      "email": "cwheby@growsanfordnc.com"
    },
    {
      "url": "https://growsanfordnc.com/about-us/staff-board/",
      "email": "frontdesk@growsanfordnc.com"
    },
    {
      "url": "https://growsanfordnc.com/about-us/staff-board/",
      "email": "jrandolph@growsanfordnc.com"
    },
    {
      "url": "https://growsanfordnc.com/about-us/staff-board/",
      "email": "sgomez@growsanfordnc.com"
    },
    {
      "url": "https://growsanfordnc.com/about-us/staff-board/",
      "email": "ttucker@growsanfordnc.com"
    },
    {
      "url": "https://www.sanfordinfiniti.com/contactus.aspx",
      "email": "flags@2x.png"
    }
  ],
  "mails": [
    "afterhourservice@sanfordfl.gov",
    "angela.adkins@sanfordfl.gov",
    "anthony.raimondo@sanfordfl.gov",
    "art.woodruff@sanfordfl.gov",
    "brady.lessard@sanfordfl.gov",
    "building@sanfordfl.gov",
    "cecil.smith@sanfordfl.gov",
    "cgaddy@growsanfordnc.com",
    "claudia.thomas@sanfordfl.gov",
    "coordinator@downtownsanford.com",
    "craig.radzak@sanfordfl.gov",
    "cwheby@growsanfordnc.com",
    "flags@2x.png",
    "frontdesk@growsanfordnc.com",
    "jrandolph@growsanfordnc.com",
    "kerry.wiggins@sanfordfl.gov",
    "kplaudate@downtownsanford.com",
    "liheap@sanfordfl.gov",
    "lindsayc@sanfordfl.gov",
    "lisa.holder@sanfordfl.gov",
    "lisa.jones@sanfordfl.gov",
    "nico.durham@sanfordfl.gov",
    "nicole.osburn@sanfordfl.gov",
    "norton.bonaparte@sanfordfl.gov",
    "pamela.lynch@sanfordfl.gov",
    "patrick.austin@sanfordfl.gov",
    "ronnie.mcneil@sanfordfl.gov",
    "rosemary.aldridge@neel-schaffer.com",
    "rwilkin@sanfordusa.com",
    "sgomez@growsanfordnc.com",
    "sharon.kraynik@sanfordfl.gov",
    "sheena.britton@sanfordfl.gov",
    "steve.fiorey@sanfordfl.gov",
    "traci.houchin@sanfordfl.gov",
    "ttucker@growsanfordnc.com",
    "utilitycustomerservice@sanfordfl.gov"
  ],
  "nombre_sitio": "historicdowntownsanford.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sanfordfl.gov/contact-us/",
      "text": "Contact Us - Sanford Main Call on: 407.688.5000 Open Hours: Mon - Thur 7:00 am - 5:30 pm & Fri 8:00 am - 1:00 pm Events Utility Payments Jobs News and Alerts Government Vision and Mission Mayor & City Commission City Manager’s Office City Clerk City Commission Meetings Public Records Request Boards and Committees Speakers Bureau Communications Office Citizens Academy Sanford Connects Sanford Says Podcast Public Art Departments Organization Chart Community Relations Community Development Block Grant (CDBG) Low Income Home Energy Assistance Program (LIHEAP) My Brother’s Keeper Race, Equality, Equity and Inclusion Advisory Committee – (REEI) Development Services Planning Division Building Division Code Enforcement Lien Inquiry Procedures Economic Development Business Resources CRA (Community Redevelopment Agency) Finance Purchasing Division Committee Members Human Resources Fire Contact Information Employment Public Services and Safety Information Fire Prevention Sanford Firefighters’ Retirement System Parks & Recreation Adopt-a-Programs Aquatic Center Parks Afterschool Programs, Youth Sports, Summer & Specialty Camps Adult Programs Senior Center and Programs Rental Facilities Police Crime Prevention Records FAQs and Resources Public Works & Utilities Solid Waste and Recycling Water & Sewer Utilities City Attorney Residents Community Survey Resident Guide Sanford Connects Maps of Sanford Emergency Management Community Links Utility Services Bill Payment Building Permits Free Trolley Service Event Calendar Planning an Event Marina Day Slips Business Planning Division CRA (Community Redevelopment Agency) Economic Development Permits Business Tax Utilities Business Resources Visitors Discover Sanford Downtown Parking Map Free Trolley Service RiverWalk Marina Day Slips Event Calendar Public Art How Do I Apply For Job Opportunities Building Permit Certificate of Appropriateness Special Event Permit Find General Service Requests Vacant and Foreclosed Property Registration Citizens Online Police Reporting System My City Commission District Downtown Sanford Parking Maps of Sanford Pay Utility Bill Parking Ticket Report Non-Emergency Incident Code Violation Criminal Activity Request Public Record Pavilion or Facility Rental Utility Service Recycle Bin Submit General Service Requests Vacant and Foreclosed Property Registration Non-Emergency Online Report Police Records Request facebook-square instagram youtube home Contact Us Home Contact Us Information Desk Call: 407.688.5000 Information Line Call: 407.688.5115 (boil water notices and<br> special bulletins) Media Requests Call: 407.688.5019 Communications & Marketing Manager <b>Email:</b> <a href=\"mailto:Lisa.Holder@sanfordfl.gov\">Lisa Holder</a> City Hall Hours Monday-Thursday 7:00am-5:30pm. City Hall Lobby and Utilities Lobby Friday  8:00 am – 1:00pm. 2025 Observed Holidays: Martin Luther King Jr. Day Monday, January 20 Memorial Day Monday, May 26 July 4th Labor Day Monday, September 1 November 21-22 December 25th and 26th Mailing Address: P.O. Box 1788 Sanford, FL 32772-1788 City Hall Address: Mayor and City Commission 407.688.5001 Art Woodruff, Mayor Email Sheena Britton, Commissioner, District 1 Email Kerry Wiggins, Sr., Commissioner, District 2 Email Patrick Austin, Commissioner, District 3 Email Claudia Thomas, Commissioner, District 4 Email City Clerk’s Office 407.688.5010 Traci Houchin, City Clerk Email City Manager’s Office 407.688.5001 Norton N. Bonaparte, Jr., City Manager Email Craig Radzak, Assistant City Manager Email 407.688.5086 Brady Lessard, Economic Development Director Email 407.688.5015 Pamela Lynch, CRA Executive Director Email 407.562.2820 Nicole Osburn, Community Relations & Neighborhood Engagement Director Email 407.688.5132 Community Development Block Grant (CDBG) 407.688.5132 Lisa Holder, Chief Communications & Cultural Affairs Administrator Email 407.688.5019 Nico Durham, Digital Media Specialist Email 407.688.5175 Low Income Home Energy Assistance (LIHEAP) Email 407.688.5167 Development Services 407.688.5163 Anthony Raimondo, Development Services Director Email 407-688.5162 Steve Fiorey, Building Official Email 407.688.5065 Angela Adkins, Administrative Services Manager Email 407.688.5163 Business Tax Receipts Email 407.688.5057 Building Permits Email 407.688.5150 Code Enforcement 407.688.5163 Planning & Development 407.688.5140 Eileen Hinson, Planning Director 407.688.5142 Historic Preservation 407.688.5145 Addressing 407.688.5147 Zoning 407.688.5149 Finance Department 407.688.5020 Cynthia Lindsay, Finance Director Email Fire Department (Non-Emergency) 407.688.5040 Ronnie McNeil , Fire Chief Email Fire Prevention 407.688.5050 Human Resources 407.688.5130 Sharon Kraynik, Human Resources Director Email Recreation 407.688.5120 Lisa Jones, Recreation Director Email Aquatic Center 407.302.1034 Senior Center 407.688.5129 Museum Curator 407.688.5198 Cultural Arts Center/Civic Center 407.688.5129 Stadium Supervisor 407.688.5120 option 6 Police Department (Non-Emergency) 407.688.5070 Cecil Smith, Police Chief Email Public Works 407.688.5080 Solid Waste 407.688.5089 Parks and Grounds 407.688.5103 Streets/Stormwater 407.688.5000 Ext. 5405 Facilities Maintenance 407.688.5000 Ext. 5409 Fleet Maintenance 407.688.5000 Ext. 5412 Utility Department Customer Service (Water and Sewer) Email 407.688.5100 Emergency Utility Service assistance (after 4pm) Email 407.688.5100 Home Jobs Online Payments Contact Us Employee Email Accessibility Connect With Us facebook-square instagram youtube home linkedin twitter 300 N Park Ave Sanford FL, 32771 Opening Hours: Mon – Thur:  7:00 am – 5:30 pm Fri:  8:00 am – 1:00 pm Phone: 407.688.5000 Most Requested Events Calendar Special Event Application Rental Opportunities Water Service Building Permits Emergency Management Public Records Request Explore Parks and Trails Events Citizens Academy Community Center Stay Connected City of Sanford, FL     |     The Friendly City"
    },
    {
      "url": "https://downtownsanford.com/contact-us/",
      "text": "Contact Downtown Sanford Skip to content About Things to Do Events Resources Contact Us About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok About Things to Do Events Resources Contact Us × About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok About Things to Do Events Resources Contact Us × About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok About Things to Do Events Resources Contact Us × About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok Contact us Downtown Sanford, Inc.​ 919-718-4659 ext. 1400 kplaudate@downtownsanford.com 229 Carthage Street, Sanford, NC 27330 Follow Us Facebook-f Twitter Instagram Tiktok Pages About Things to Do Events Resources Contact Us More Links Sponsors Volunteer Privacy Policy Vendor Registration General Vendor Sign up for our newsletter to get updates about events and more. SUBSCRIBE Twitter Facebook-f Instagram Tiktok Dining Shopping Art Services Fun © 2025 Downtown Sanford, Inc. All Rights Reserved."
    },
    {
      "url": "https://downtownsanfordmarina.com/contact/",
      "text": "Contact | Downtown Sanford Marina Skip to content Professionally Managed by F3 Marina Phone: 407-322-2910 Facebook Email WELCOME AMENITIES SERVICES SLIP RESERVATION WET SLIPS LEARN MORE DRY STORAGE LEARN MORE TRANSIENT LEARN MORE NEWS & EVENTS GALLERY CONTACT WELCOME AMENITIES SERVICES SLIP RESERVATION WET SLIPS LEARN MORE DRY STORAGE LEARN MORE TRANSIENT LEARN MORE NEWS & EVENTS GALLERY CONTACT GET IN TOUCH General Questions & Slip Reservation Contact Downtown Sanford Marina 2022-08-02T13:01:53-05:00 Downtown Sanford Marina LOOKING FOR MORE INFORMATION? GET IN TOUCH GENERAL INFORMATION RESERVE YOUR SLIP GENERAL INFORMATION Name (Required) Phone (Required) Email (Required) Subject (Required) Message (Required) Newsletter Join Our Newsletter For News & Updates RESERVE YOUR SLIP Name (Required) First Last Phone (Required) Email (Required) Vessel Name Boat Length In Feet - LOA (Required) Height Beam (Required) Draft (Required) Manufacturer Model Year Requested Arrival Date Requested Departure Date How Did You Learn About us? Newsletter Join Our Newsletter For News & Updates A HIDDEN GEM JOIN US TODAY Lying along the St. Johns River on Lake Monroe, Downtown Sanford Marina offers a beautiful and seamless boating experience. On shore, the stunning Sanford RiverWalk meanders along both sides of the marina, and Historic Downtown Sanford’s shops and restaurants are only a few blocks away. DOWNTOWN SANFORD MARINA Downtown Sanford Marina is located in Central Florida on Lake Monroe. LOCATION 531 N Palmetto Ave | Sanford, Florida Directions CALL US Talk to us with any questions. GET IN TOUCH WITH US TODAY 407-322-2910 Call Us Today 5-DAY WEATHER FORECAST | CLICK HERE FOR DETAILED FORECAST 5-DAY WEATHER FORECAST CLICK HERE FOR DETAILED FORECAST WHAT SETS US APART Lying along the St. Johns River on Lake Monroe, Downtown Sanford Marina offers a beautiful and seamless boating experience. On shore, the stunning Sanford RiverWalk meanders along both sides of the marina, and Historic Downtown Sanford’s shops and restaurants are only a few blocks away. Learn more about the St. Johns River. OUR MARINA 531 N Palmetto Avenue\r\nSanford, Florida 32771 407-322-2910 Monday – Friday: 8 AM – 5 PM\r\nSaturday – Sunday: 8 AM – 6 PM MASTER PLAN UPDATE The City of Sanford is proud to present the Downtown Sanford Marina Master Plan Update , including project status, map and property visuals, and market study results. Please submit any comments or questions to 601.624.7945 or email us here. OWNED & MANAGED BY Professionally Managed By: F3 Marina Owned By: The City of Sanford QUICK LINKS Visit Downtown Sanford Marina F3 Marina Management Team Our Amenities Reserve a Slip Slip Map Marina Approach Local Links Neighborhood Destinations Jeff Damante: General Manager RULES & REGULATIONS × SIGN UP FOR OUR NEWSLETTER Sign up for our newsletter for more information on upcoming events, marina information, and other news from Downtown Sanford Marina. Name (Required) First Last Email (Required) Consent (Required) Yes, sign me up for Downtown Sanford Marina's newsletter Sign Up For Our Newsletter © Copyright | Downtown Sanford Marina | All Rights Reserved | Powered by First Station Media Facebook Email Page load link Go to Top"
    },
    {
      "url": "https://downtownsanford.com/about/",
      "text": "About Downtown Sanford, North Carolina Skip to content About Things to Do Events Resources Contact Us About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok About Things to Do Events Resources Contact Us × About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok About Things to Do Events Resources Contact Us × About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok About Things to Do Events Resources Contact Us × About Things to Do Events Resources Contact Us Twitter Facebook-f Instagram Tiktok About Downtown Sanford Our History Downtown Sanford, Inc. (DSI) is a 501c(3) non-profit dedicated to the economic health and quality of life in Downtown Sanford, North Carolina. DSI strives to continually fulfill its mission, which is as follows: To manage the development of Downtown Sanford as the primary economic, cultural, and social center of the community; to educate the community on the unique assets and historical significance of the downtown area; and to promote and stimulate the improvement of these assets. Upon being selected as a North Carolina Main Street community in 1984, the Downtown Sanford Redevelopment Corporation was formed. In 1980, the National Trust for Historic Preservation had created the National Main Street Center to encourage revitalization in downtown areas that had become victims of urban sprawl. As a member of NC Main Street, the organization follows the Main Street Approach to downtown redevelopment. This approach, which marries historic preservation and economic development, uses four key principles: Organization, Promotion, Design, and Economic Restructuring. In 1997, the Downtown Sanford Redevelopment Corporation embarked on a long-range strategic work plan. Components of the work plan included changing the name to Downtown Sanford, Inc., preparing a market study for downtown, developing the design for Depot Park, and commissioning the initial stages of a streetscape improvement plan. Today, both Depot Park and Phase I of Streetscape have been completed. Marketing efforts continue, including joint local advertising efforts and special events designed to bring visitors from across the state into downtown and Sanford. DSI also continues to address daily issues such as parking, appearance, security, infrastructure (lighting, trash collection, etc.), and administration of its building improvement grant program. DSI is governed by a volunteer Board of Directors, which are appointed by the sitting board members. The funding for the organization comes from private donations and tax revenues generated within a municipal service district. Currently, property owners within the municipal service district pay an additional $.11 per $100 valuation to support downtown initiatives. The City of Sanford also contributes substantially through funding for the Director’s salary and through both financial and in-kind contributions to specific capital improvement projects. Our Mission Downtown Sanford Inc. serves to champion the economic growth of the City of Sanford while preserving the historical integrity of downtown through education, promotion, and management. Our Vision Downtown Sanford is the gateway to the city with an active downtown for entrepreneurial growth and an engaging environment for entertainment. Special Projects These projects have been monumental in shaping Downtown Sanford. View Projects Our Staff Kelli Laudate Executive Director Phone: (919)-718-4659 ex. 1400 Email: kplaudate@downtownsanford.com Madison Bullard Marketing & Operations Coordinator Phone: (919)-718-4659 ex. 1402 Email: coordinator@downtownsanford.com Our Board Brenda Aguirre Travis Beal Tim Childress Ashley Davenport – Chair Ophelia Livingston Joni Martin David Morse Yanira Scott Sharon Spence – Past Chair Peggy Taphorn Jeff Towson Ashley Whitaker – Treasurer/Secretary Porshia Wicker Shawanda Wilson Maria Wright – Vice Chair Meet the Board Pages About Things to Do Events Resources Contact Us More Links Sponsors Volunteer Privacy Policy Vendor Registration General Vendor Sign up for our newsletter to get updates about events and more. SUBSCRIBE Twitter Facebook-f Instagram Tiktok Dining Shopping Art Services Fun © 2025 Downtown Sanford, Inc. All Rights Reserved."
    },
    {
      "url": "https://www.sanfordusa.com/our-team/",
      "text": "Our Team - Sanford Insurance Agency Sanford Insurance Agency (800) 281-9761 Request A Quote Payment & Claims Dental Program Payments About Why Sanford Our Team Personal Insurance Auto Aviation Health Life Property & Homeowner’s Recreational Vehicle Umbrella Commercial Insurance Auto General Liability Healthcare Facilities Professional Liability Property Workers Compensation Umbrella Cyber Sanford Dental Plan Sanford TPA Sanford Captive Employee Benefits Contact Our Team John Neel, Jr. President & CEO View Bio >> X John Neel, Jr., President & CEO Founder of The Sanford Company which was started in October, 2002. Prior to forming Sanford, John was Vice President of Insurance and Risk Management at Central Georgia Health System (CGHS). CGHS includes The Medical Center of Central Georgia, a 518 bed tertiary care teaching hospital. While employed by CGHS, he was responsible for the formation, management, and administration of two Cayman captive insurance companies owned by CGHS. John served as Chief Executive Officer of both of these offshore companies. Mr. Neel, a graduate of the Terry College of Business at the University of Georgia, is a licensed insurance broker in Georgia and received his CIC designation in 1990. He has been involved with the formation and running of many captive insurance companies, Risk Retention Groups and other alternative risk programs. He is a regular speaker at worldwide captive conferences and consults on insurance and risk management issues throughout the United States. Mike Kaplan President of Insurance Services View Bio >> X Mike Kaplan, President of Insurance Services Mike joined Sanford in November 2021 as President and co-owner/partner. Mike is the former Senior Vice President of McGriff Insurance. Prior to McGriff, he was President and Owner of Kaplan Insurance Services. Mike is responsible for the day-to-day operations of Sanford Insurance. A graduate of the University of Georgia Terry Business School with a degree in Risk Management and Insurance, Mike has been in the insurance industry since 1975. He has twice won Professional Insurance Agents of Georgia “Agent of the Year.” Considered one of Macon’s favorite sons, Mike is very active in his hometown community. James M. “Jimbo” Walker Senior Vice President View Bio >> X James M. “Jimbo” Walker, Senior Vice President Jimbo Walker, SVP, co-owner/partner of Sanford Insurance attended the University of Mississippi and then transferred to the University of Georgia, where he received his Bachelor of Science degree in Agricultural Economics. Jimbo has been in the insurance industry since 1982, and has excelled as a personal lines and commercial lines producer. Jimbo is very active in the community and has served on several Board of Directors. Chris Wilson Senior Vice President/Partner View Bio >> X Chris Wilson, Senior Vice President/Partner Chris Wilson is the newest partner of Sanford Insurance joining in November 2022. Chris was Vice President of McGriff Insurance, formally BB&T Insurance, for previous 18 years. Prior to 2004, Chris was teacher and coach at First Presbyterian Day School where he coached football, wrestling and track. Graduate of Georgia Southern University in 1998 and was a 4 year letterman for the football team. Chris will focus primarily on commercial clients and providing mentorship training to young producers at Sanford. Jimmy C. Hinson Sr. Partner/Employee Benefits View Bio >> X Jimmy C. Hinson Sr., Partner/Employee Benefits Jimmy C. Hinson, Sr. V.P., and Partner with Sanford Insurance has over 35 years in the Employee Benefits field. He oversees the overall client relationship , manages carrier relations, and assist the clients with developing and managing their overall benefits program to maximize their premium dollars and the client employees experience. Jimmy has served in various leadership roles as an owner and partner with O’Neal and Hinson, State Practice Leader with McGriff Insurance and in his current position as Employee Benefits Practice Leader and Partner with Sanford Insurance. Jimmy earned his undergraduate degree from Mercer University in 1981. Carson Schilling Partner/Employee Benefits View Bio >> X Carson Schilling, Partner/Employee Benefits Carson joined Sanford Insurance in March of 2023. Carson was previously VP of Employee Benefits at McGriff Insurance, formerly BB&T Insurance, for 11 years. Carson earned an Insurance and Risk Management degree from the University of Georgia in 2011 and was a 4-year letterman for the baseball team. Carson specializes in Employee Benefits and assists clients with defining and accomplishing their benefits goals. He assists with the overall client relationship and management of their benefits program. Josh James Senior Vice President/Partner View Bio >> X Josh James, Senior Vice President/Partner A licensed Professional Insurance Counselor, Josh joined Sanford as an agency Partner in August of 2023. He comes to the team with 13 years of experience guiding clients through the complexities of risk management and providing tailored solutions for financial security. Earning a BBA from Georgia College in 2008 and obtaining Property & Casualty and Life & Health licenses, Josh began his career with Federated Insurance, later moving to a larger brokerage firm in Macon where he built and developed a network of clients. His concentration is connecting with new clients, using his knowledge to provide insurance options and education in our ever-changing industry. Beverly Michael CFO View Bio >> X Beverly Michael, CFO Beverly Michael is a native of Macon, Georgia. She graduated from Mercer University with a degree in Management and began working in the accounting field. Beverly has held positions in accounting and finance in several other industries prior to entering the insurance field. She joined the Sanford team in April 2015 as Business Manager and was promoted in July 2016 to Chief Financial Officer. Jim Lambert CIC, Vice President View Bio >> X Jim Lambert, CIC, Vice President Jim Lambert is a native of Macon, Georgia. He graduated from Middle Georgia College with an Associate Degree in Engineering, Georgia Southern College with a degree in Business Administration and Georgia State University with a Master’s degree in Insurance. A veteran, Jim served in the United States Army from 1969-1976, attaining the rank of Chief Warrant Officer. He accumulated over 500 hours piloting the OH-58 Scout while serving with the 1st Aviation Brigade at Fort Rucker, Alabama. Jim has over 40 years of experience in the insurance industry. He started his career with Georgia Farm Bureau Mutual Insurance Co. as a claims adjuster in 1970. He was also the sales trainer and a district sales manager with Georgia Farm Bureau. He is a past president of the PIA, Professional Insurance Agents of Georgia. In 1980, he founded Allen & Lambert, Inc., a property and casualty insurance agency in Macon, Georgia. He sold the agency in 2010 to the Sanford Insurance Agency and remains active with them in the sales of property and casualty insurance. He is a Certified Insurance Counselor (CIC) and is licensed in 10 states. Rob Wilkin Vice President View Bio >> X Rob Wilkin, Vice President Rob Wilkin received his Bachelor of Science and Master of Science degrees from the University of Georgia in 1999 and 2001 respectively. Post college, he worked with the Federal Crop Insurance Agency as Risk Management Education Director for the Southeastern United States and as a Risk Management Specialist, gaining experience in underwriting, actuarial analysis, and claims management. Rob joined the Sanford team in 2005 where his area of expertise has been developing and managing all aspects of alternative risk financing programs, such as captive insurance companies. He also acts as claims manager for several workers compensation and professional/general liability programs for the Sanford Insurance Agency. He holds Georgia Property & Casualty and Life & Health agent licenses and is a licensed adjuster. Rob maintains the Certified Workers Compensation Professional designation. Jim Wilson Vice President/ Marketing View Bio >> X Jim Wilson, Vice President/ Marketing Jim Wilson recently joined Sanford Insurance in April 2023. A graduate of Presbyterian College with a Bachelor of Science in Business Administration, Jim comes to Sanford with 18 years of experience in the insurance industry. Prior to joining Sanford, he was Vice President and Senior Marketing Lead with McGriff Insurance, formally BB&T Insurance. Prior to 2005, Jim spent time in the financial services industry as Vice President as a Business Banker with BB&T and Bank of America where he specialized in small business lending. Jim will focus on helping producers find the very best solutions for our Sanford Insurance clients. Alan Fennell Employee Benefits View Bio >> X Alan Fennell, Employee Benefits Alan Fennell received his Bachelor of Arts degree from Asbury College in 1996. He continued his education and received his Master of Divinity degree from Erskine Theological Seminary in 1999. After 13 years in church ministry, he obtained his life, accident, and health insurance license in 2012 while working with AFLAC. Alan joined The Sanford Company in 2013. He assists our clients with a clear understanding of their current employee benefits and goals. He further employs strategies to our clients to best serve their needs through employee benefits. He oversees all aspects of the employee benefits program including enrollment, eligibility, networks, claims, and billing issues. Ford Neel Producer View Bio >> X Ford Neel, Producer Ford Neel is a graduate of the University of Georgia. He started his career working at Genesee General as a transportation associate underwriter in Alpharetta, GA. He worked in the transportation department, writing commercial auto new ventures in GA, SC, TN, and AL. Ford joined Sanford in the fall of 2016 as a licensed Life & Health agent managing and overseeing health benefits for nursing facilities through an insurance dental program in the Atlanta and North GA area. In the fall of 2020, he moved to the Property & Casualty side of the agency as a licensed commercial producer. Ford is following his father and will be involved in the formation and running of captive insurance companies. Bryant Walker Producer View Bio >> X Bryant Walker, Producer Bryant Walker joined Sanford Insurance in the spring of 2019 as a personal and commercial lines risk management producer. After receiving his Bachelor of Science in Human Environmental Sciences at the University of Alabama in 2015, he began his insurance career in Atlanta. Bryant, a Macon native, moved back home to work along-side his father, Jimbo Walker, Sr. VP at Sanford Insurance. Ridgon Smisson Producer Josh Thornley Director of Personal Lines View Bio >> X Josh Thornley, Director of Personal Lines Josh was born and raised in Macon, Ga where he attended Mount de Sales Academy. A graduate from the University of Georgia with a degree in Family Financial Planning, Josh has over 10 years of experience in Insurance. After UGA, Josh moved to Atlanta where he began his career in Life and Disability Insurance before switching his focus to Property and Casualty, helping individuals and families with their Personal Lines. Prior to joining Sanford, Josh owned and operated an insurance agency in Roswell, Ga for 5 years where he served over 1,500 families throughout Georgia. Josh is a customer-focused insurance agent with a strong background in various insurance products. That knowledge and his customer first dedication helps clients make informed decisions and better protect themselves from the unknown. Josh, his wife Ashby, and son Penn, are glad to be back in Macon and a part of Sanford Insurance. Contact Local Phone: 478-471-4221 Toll Free: (800) 281-9761 Fax: 478-471-4222 4468 Forsyth Road, Macon, GA 31210 Copyright © 2025 Sanford Company | Website Development by M&R Marketing Group | Privacy Policy"
    },
    {
      "url": "https://growsanfordnc.com/about-us/staff-board/",
      "text": "Staff & Board | Sanford Area Growth Alliance Toggle Navigation Button About Us News & Events Become a Member Member Login Why Sanford Taxes & Incentives Transportation Infrastructure Workforce & Demographics Quality of Life Education Healthcare Housing Culture and Recreation Sites & Properties Central Carolina Enterprise Park Lee County Rail Sites Property Search Key Industries Advanced Manufacturing Agriculture Life Sciences Business Resources Small Business Center RISE Program Workforce Development Chamber of Commerce Member Resources Become a Member Member Directory Member to Member Member Benefits Events Calendar Ambassador Program Leadership Sanford Home / About Us / Staff & Board Meet the Team Sanford Area Growth Alliance United by a Common Goal for Business Prosperity The Sanford Area Growth Alliance (SAGA) is comprised of a partnership between the Lee County Economic Development Corporation (EDC) and Sanford Area Chamber of Commerce. The alliance utilizes the individual strengths of both organizations to expand and diversify Lee County’s economic base. By combining the EDC’s focus on industrial recruitment, jobs and tax base with the Sanford Chamber’s prioritization of small business development, advocacy and networking, SAGA effectively serves as a leading advocate for a prosperous and engaged community. Staff & Leadership SAGA Board Chamber Board Staff Jimmy Randolph CEO jrandolph@growsanfordnc.com Read Bio Jimmy graduated as valedictorian from Western Harnett High School and obtained a B.A. degree in Political Science from UNC-Chapel Hill. He began his professional life in human resources with American Airlines, then returned to Sanford and worked in multiple roles with the Sanford Area Chamber of Commerce for nearly six years. During that time, he served as a board member and volunteer with numerous community organizations, including the United Way and the Lee County Partnership for Children. Todd Tucker Economic Development Director ttucker@growsanfordnc.com Read Bio Todd Tucker has 28+ years of experience in economic development in North Carolina. Todd began his journey at the NC Department of Commerce and later joined Progress Energy's Economic Development team, covering 16 counties in Eastern North Carolina. Todd comes to Sanford from his most recent position as President of the Surry County Economic Development Partnership. Raised in Lillington, NC, he comes from a family deeply rooted in economic development, with his father having served as a local economic developer for many years in Harnett County and others. His family ties extend to Sanford, where his paternal grandparents and father resided until his father settled in Lillington. He is happily married to Conni Tucker and is blessed with two children, Greyson and Anna Katherine. Susan Gomez Chamber of Commerce Director sgomez@growsanfordnc.com Read Bio Susan was born and raised in Queens, NY and moved to Sanford, NC in 1999 after marrying her husband, Gus Gomez. She earned her degree in Psychology from the University of North Carolina at Greensboro and enjoyed her eighteen year career in Human Resources. She appreciates her small town and the quality of life it provided for her and Gus to raise their two daughters, Julianne and Jocelyn. Susan enjoys spending time in Downtown Sanford especially at live music events in Depot Park. Shinita Williams Membership Services & Data Research frontdesk@growsanfordnc.com Read Bio Shinita, a Sanford native, graduated from Fayetteville State University with a degree in Sociology. She previously worked as a Real-Estate Assistant for 10 years before her role at SAGA. She is a well-organized individual with a pleasant attitude and a desire to make a positive mark on society. As a resident of Sanford, Shinita is passionate about community engagement and seeks opportunities that will allow her to serve as a community representative because she cares about making a difference for everyone. Her love for Sanford has sparked a desire to work towards the growth and betterment of the city. She looks forward to doing her part to achieve those goals. Crystal Gaddy Business Retention & Expansion Director cgaddy@growsanfordnc.com Read Bio Effective advocacy and assistance for the existing business community requires strong relationships and excellent communication, and Crystal’s deep roots in Sanford and Lee County coupled with extensive industry experience equip her perfectly for the job. Crystal’s passion for the history and the future of her hometown has been cultivated over five generations of history in Sanford and the Lee County area. Crystal is a proud Yellow Jacket, graduating from Lee Senior High School before obtaining a degree in biology at East Carolina University. She returned home to work for Wyeth Vaccines in roles including bioprocessing, quality and technical transfer technologies. She transitioned with Pfizer to an R&D role, gaining an even greater understanding of the life sciences industry before spending twelve years with Coty, Inc., in Sanford. There she gained a great deal of experience in manufacturing and filling processes. Crystal remains true to her roots, enjoying nature and the unsurpassed beauty of our state. Traveling and experiencing all our state has to offer is a favorite pastime with her family. In Crystal’s words, “My family and I love the farms, restaurants and events around Lee County, and Sanford’s ideal location is something that sets Sanford apart.” Campbell Wheby Communications Coordinator cwheby@growsanfordnc.com Read Bio Campbell Wheby, a native of Sanford, North Carolina, blends small-town roots with a passion for communication and community engagement. Graduating with a Bachelor of Arts in Interpersonal and Organizational Communications from the University of North Carolina at Chapel Hill, Campbell excelled academically, consistently making the Dean's List and joining the Phi Beta Kappa Honors Society. Starting as a Social Media Intern at KidzNotes, Campbell's innovative strategies significantly amplified outreach for the program, leading to her promotion to Program Assistant. She expanded her expertise as a Social Media Intern at The Storied Group, managing campaigns for renowned brands like the Golden Door Wellness Resort and Fangirl Sports Network, as well as interning with Warner Records to create viral TikTok campaigns. With a commitment to social impact, she aims to leverage her expertise to shape narratives and give back to the community she grew up in. Leadership Richard Oldham Chair, Sanford Contractors Chet Mann Vice Chairman, Guild Mortgage Drew Haddock Treasurer, DMJPS PLLC Bill Wilson Secretary, Wilson, Reives & Silverman, PLLC Kirk Smith Lee County Board of Commissioners Darren Steadman Lee County Board of Commissioners Appointee Dehra Green Lee County Board of Commissioners Appointee Rebecca Salmon Mayor, City of Sanford Byron Buckels Sanford City Council Donald Andrews Mayor, Town of Broadway David Foster Dennis A. Wicker Civic Center Alan Dossenbach Dossenbach's Finer Furniture Joe Clancy Express Employment Professionals Ray Trapp Duke Energy Charles Mellette Christian Provision Ministries Ella Pantaleon Multitech Mechanical Dr. Jim Foster Farm Bureau Hunter Stewart Lee & Associates Commercial Real Estate Services Tina Gross Gross Farms Jerry Pedley Mertek Solutions Inc. Jody Albright Central Electric Membership Corporation Steve Malloy Adcock and Associates Carter Keller Carolina Commercial Contractors Jimmy Keen Truist Sandra Holden Caterpillar, Inc. Dave Santoemma Central Carolina Hospital Rich Trogden First Bank Jay Rapp Helix Ventures Kirk Bradley Lee-Moore Capital Company Donnie Oldham Sanford Contractors Todd Baker Carter Bank & Trust Ollie Cotterel Sanford Honda Tom Darden Cherokee Land Company Brian McRae Steel & Pipe Corporation Dr. Lisa Chapman President, Central Carolina Community College Julian Philpott Chair, CCCC Board of Trustees Dr. Chris Dossenbach Superintendent, Lee County Schools Barbara Brothers Representative, CAWD Board Dr. Bill Stone Director, NC Cooperative Extension Lee County Bob Heuts Director, Raleigh Executive Jetport Lisa Minter Lee County Manager Hal Hegwer City of Sanford Manager John Godfrey Town of Broadway Manager Margaret Roberton Chair, Central Carolina Community College Cindy White Bayberry Retirement Inn Clinton Weaver Central Carolina Hospital David Foster Dennis A. Wicker Civic & Conference Center David Morse Bankers Insurance Ed Strickland Deep River Sporting Clays Gus Gomez Miller-Boles Funeral Home Josh Payne The Shed Depot Karen Stanley Stanley's Hme Kelley Dubois Adcock Real Estate Services Laura Powers The Sanford Herald Linda Berryman Fidelity Bank Roberto Montero United Bank Featured News WHAT’S HAPPENING IN SANFORD VIEW ALL NEWS 9 / 4 / 2025 Redeveloped Riverbirch Will Yield Big Economic Benefits 9 / 2 / 2025 SAGA’s 5th Annual Children’s Business Fair 8 / 14 / 2025 Our Greatest Asset 7 / 25 / 2025 SAGA’s Public Policy Luncheons: Where Business, Community, and Conversation Meet Helpful Links About Us Staff & Board News & Events Key Industries Why Sanford Sites & Properties Business Resources Chamber of Commerce Become a Member Member Login Annual Report Get In Touch 919-774-8439 General Inquiry 115 Chatham Street Sanford, NC 27330 Follow Us Facebook Twitter Instagram Linkedin Receive the latest news about the Sanford Community Name * Email * © 2025 Sanford Area Growth Alliance Website by"
    },
    {
      "url": "https://www.sanfordinfiniti.com/contactus.aspx",
      "text": "Contact Sanford INFINITI | Call, Chat or Email Us SANFORD INFINITI Sales 407-915-3838 Service 407-915-3828 Finance 407-915-3838 995 Rinehart Rd Sanford, FL 32771 Service Map Contact Saved Saved SANFORD INFINITI Saved Call 407-915-3838 Directions Home Shop All Inventory New New 2026 QX60 New Vehicles Premium Care Compare INFINITI Models Pre-Owned All Used Vehicles Certified Pre-Owned Vehicles Used INFINITI Vehicles GoldPlus Vehicles Under 50k Miles Gold Plus Vehicles Vehicles Under $20k Courtesy vehicles What Are INFINITI Courtesy Vehicles? Used Specials 1 Price/Market Select Program Certified Pre-Owned Program Sell/Trade Specials New Specials Used Specials Service & Parts Specials Finance & Lease Finance Information Get Pre-Approved Vehicle Protection Plans Elite Protection Plan Purchase Inquiry Quickbuy at Sanford INFINITI INFINITI Lease Program SignatureFLEX Lease Program INFINITI Lease End Experience Service & Parts Service & Parts Schedule Service Service & Parts Specials Service & Parts Financing Order Parts Order Tires About Us About Us Hours & Directions Contact Us Review Us INFINITI Valet Testimonials Home Home Shop All Inventory New New 2026 QX60 New Vehicles Premium Care Compare INFINITI Models Pre-Owned All Used Vehicles Certified Pre-Owned Vehicles Used INFINITI Vehicles GoldPlus Vehicles Under 50k Miles Gold Plus Vehicles Vehicles Under $20k Courtesy vehicles What Are INFINITI Courtesy Vehicles? Used Specials 1 Price/Market Select Program Certified Pre-Owned Program Sell/Trade Specials New Specials Used Specials Service & Parts Specials Finance & Lease Finance Information Get Pre-Approved Vehicle Protection Plans Elite Protection Plan Purchase Inquiry Quickbuy at Sanford INFINITI INFINITI Lease Program SignatureFLEX Lease Program INFINITI Lease End Experience Service & Parts Service & Parts Schedule Service Service & Parts Specials Service & Parts Financing Order Parts Order Tires About Us About Us Hours & Directions Contact Us Review Us INFINITI Valet Testimonials In-Stock Vehicles are Free of New Tariffs - Shop Now Contact Fill out the form below and we'll contact you shortly. * Contact Name: *First Name *Last Name *E-Mail Address *Phone Zip Code Department Select Department Sales Inquiry Service Inquiry General Inquiry Comments: By clicking this box, I agree to receive in-person or automated telemarketing calls and texts from SANFORD INFINITI at the number I entered. I understand that my consent is not required for purchase. Let's Talk *Required Fields Phone Sales: 407-915-3838 Service: 407-915-3828 Finance: 407-915-3838 Address SANFORD INFINITI 995 Rinehart Rd Sanford, FL 32771 Hours and Directions | SANFORD INFINITI | 995 Rinehart Rd, Sanford, FL 32771 | Sales: 407-915-3838 | Sitemap | Privacy | InfinitiUSA.com | Service: 407-915-3828"
    }
  ]
}