{
  "fuentes": [
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info-dk@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info-me@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info-ro@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info-uk@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info-us@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info.apac@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info.fi@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info.japan@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info@acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info@acrelec.de"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info@be.acrelec.cominfo"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "info@nl.acrelec.com"
    },
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "email": "office@se.acrelec.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "boyle@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "jc@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "josh@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "mark@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "sundar@beerboard.com"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "email": "tom@beerboard.com"
    },
    {
      "url": "https://cm.dunedinfl.com/members/member/hob-brewing-co-8320",
      "email": "info@dunedinfl.com"
    },
    {
      "url": "https://hob.beer/",
      "email": "events@hob.beer"
    },
    {
      "url": "https://mthoodbrewing.com/about-us/",
      "email": "info@mthoodbrewing.com"
    },
    {
      "url": "https://mthoodbrewing.com/about-us/",
      "email": "rjackson@mthoodbrewing.com"
    },
    {
      "url": "https://mthoodbrewing.com/about-us/",
      "email": "tilikum@mthoodbrewing.com"
    },
    {
      "url": "https://hobbsbeer.com/terms-of-use/",
      "email": "info@hobbsbeer.com"
    },
    {
      "url": "https://hobbsbeer.com/",
      "email": "info@hobbsbeer.com"
    },
    {
      "url": "https://cm.dunedinfl.com/list/member/hob-brewing-co-8320",
      "email": "info@dunedinfl.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://hob.beer/upcoming-events",
      "email": "stef@hob.beer"
    }
  ],
  "mails": [
    "accounts.payable@parkwaybrewing.com",
    "boyle@beerboard.com",
    "events@hob.beer",
    "events@parkwaybrewing.com",
    "grant@parkwaybrewing.com",
    "info-dk@acrelec.com",
    "info-me@acrelec.com",
    "info-ro@acrelec.com",
    "info-uk@acrelec.com",
    "info-us@acrelec.com",
    "info.apac@acrelec.com",
    "info.fi@acrelec.com",
    "info.japan@acrelec.com",
    "info@acrelec.com",
    "info@acrelec.de",
    "info@be.acrelec.cominfo",
    "info@dunedinfl.com",
    "info@hobbsbeer.com",
    "info@mthoodbrewing.com",
    "info@nl.acrelec.com",
    "jc@beerboard.com",
    "josh@beerboard.com",
    "kim@parkwaybrewing.com",
    "mark@beerboard.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com",
    "office@se.acrelec.com",
    "rjackson@mthoodbrewing.com",
    "stef@hob.beer",
    "sundar@beerboard.com",
    "tilikum@mthoodbrewing.com",
    "tom@beerboard.com"
  ],
  "nombre_sitio": "hob.beer",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://acrelec.co.uk/get-in-touch/",
      "text": "Contact Us - Acrelec Home About About Company Team Members CSR Careers Services Drive Thru Kiosk Digital Signage Self Checkout News Contact Us Want To Talk To Us? If you want to talk to us about how we can help you transform your customer experience, or ask about our latest technology, you can reach us on the form below and someone will be in touch as soon as possible! We would also be delighted to welcome you to our office to meet the team and show you round our products on display in our showroom. Acrelec UK Phone +44 (0)20 3506 1041 Address East Wing, Focus 31 Mark Road, Hemel Hempstead, HP2 7BW, United Kingdom. Send us a message Please select the products you are interested in Digital Signage Kiosk Self  Checkout By Sending this message I agree to the Terms and Conditions Discover Our Offices Around the World EMEA Americas Asia Acrelec France +33 (0)1 72 03 24 10 info@acrelec.com 2 rue Louis Broglie 77400 Saint-Thibault des Vignes France Belgium +32 (0)15 70 15 00 info@be.acrelec.cominfo@be.acrelec.com Wayenborgstraat 8 2800 Mechelen Belgium Denmark +45 8880 7730 info-dk@acrelec.com Krondalvej 9A 2610 Rødovre Denmark Finland +358 (0) 44 773 7733 info.fi@acrelec.com Tarmontie 6 E 15860 Hollola Finland Germany +49 (0) 89 41 41 423 70 info@acrelec.de Einsteinstraße 12 85716 Unterschleißheim Bavaria Nertherlands +31 (0) 33 245 55 95 info@nl.acrelec.com Marconistraat 12b, 3861 NK Nijkerk Netherlands Romania +40 21 310 33 04 info-ro@acrelec.com Calea Vacaresti, no.391 Area 03.A.14 40069 Bucarest Spain +34 91 659 18 10 info-es@acrelec.cominfo-es@acrelec.com Avda Camino de lo Cortao n. 34 Nave 8, 28703, San Sebastian de los Reyes Sweden +46 8 466 9888 office@se.acrelec.com Söderbyvägen 1D 195 60 Arlandastad Sweden UAE +971 4 454 9789 info-me@acrelec.com Austria Business Centre 6th Floor, Concord Tower Dubai Media City 126732 USA – CHICAGO +1 (877) 334 9737 info-us@acrelec.com 1327 W Washington Blvd Units 2B & 2C Chicago, IL 60607 USA – PITTSBURGH +1 (877) 334 9737 info-us@acrelec.com 5490 Campbells Run Road Pittsburgh PA 15205 USA – OKLAHOMA +1 (877) 334 9737 info-us@acrelec.com 340 S Eckroat St Oklahoma City OK 73129 Brazil +55 (11) 98453.3003 info-us@acrelec.com Alameda Santos, 2300 – floor 11 Jardim Paulista São Paulo – SP ACRELEC JAPAN | アクレレックジャパ +81 (0)3-6433‑0663 info.japan@acrelec.com 〒 140-0001\nChoei Building 4F\n1-13-7 Kita-Shinagawa, Shinagawa-ku\nTokyo\nJapan ASIA LIMITED info@acrelec.com Unit B, 8/F, OfficePlus @ Mong Kok 998 Canton Road, Mong Kok\nKowloo Hong Kong CHINA / MANUFACTURING + 886 2 8501 1090 info.apac@acrelec.com N°669 JinXiu Avenue Jiashan County, Jiaxing City Zhejiang\nChina CHINA / SALES + 886 2 8501 1090 info.apac@acrelec.com Room 11C, No.98 Liuhe Road, Huangpu district\nShanghai 200001 ASIA LIMITED SINGAPORE BRANCH LTD info@acrelec.com 6 Shenton way #33-00 Oue Downtown\nSingapore (068809) Subscribe To Our Newsletter Company About Services News Contact Us Products Drive Thru Self Checkout Kiosk Digital Signage Contact Us +44 (0) 20 3506 1041 info-uk@acrelec.com East Wing\nFocus, 31 Mark Road,\nHemel Hempstead, HP2 7BW A private limited company incorporated in England under company number 7210638. Registered at East Wing\nFocus, 31 Mark Road,\nHemel Hempstead, HP2 7BW Copyright © 2025. Acrelec Terms and Conditions Privacy Policy SITE BY STAXO"
    },
    {
      "url": "https://www.beerboard.com/meet-the-team/",
      "text": "Meet The Leadership Team | BeerBoard Search for: Search for: Home Solutions Retail Solutions SmartOrders SmartBar SmartMenus Supplier Solutions About Team Partners Integrations Careers News Stories & Releases In the News On-Premise Insights Contact Request a Demo Login Skip to content Home Solutions Retail Solutions SmartOrders SmartBar SmartMenus Supplier Solutions About Team Partners Integrations Careers News Stories & Releases In the News On-Premise Insights Contact Request a Demo Login Alcohol Industry Experts Meet Our Leadership Team Contact Us Home Meet The Leadership Team Share Facebook Twitter LinkedIn Email Mark Young Founder & CEO mark@beerboard.com Sundar Ravindran Chief Technology Officer sundar@beerboard.com John Boyle SVP Business Development boyle@beerboard.com Tom Young VP Client Relations tom@beerboard.com Josh Solomon VP Channel Partnerships josh@beerboard.com JC Whipple VP Marketing & Communications jc@beerboard.com Let's deliver the right solution for your business Book a Consultation Key Pages About Us Retail Solutions Supplier Solutions Our Clients Meet The Team Contact Us Search Beers & Bars Near You Claim Your Brand Bar Login Brewery Login Privacy Policy Terms & Conditions Recent Posts Buddy’s Pizza Taps BeerBoard to Power Alcohol Intelligence (AI), Streamline Beverage Operations and Strengthen Supplier Partnerships August 4, 2025 Kirby Ice House Partners with BeerBoard to Optimize Alcohol Management with Cutting-Edge Technology July 29, 2025 Follow Us © 2025 BeerBoard Top"
    },
    {
      "url": "https://cm.dunedinfl.com/members/member/hob-brewing-co-8320",
      "text": "HOB Brewing Co. | Breweries, Bars & Clubs Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login/Sign-Up info@dunedinfl.com 301 Main Street, Dunedin, FL 34698 Facebook Ovaicon-instagram Youtube Yelp Linkedin Menu Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login / Sign-Up HOB Brewing Co. Home HOB Brewing Co. Categories Breweries, Bars & Clubs 931 Huntley Ave. Dunedin FL 34698 (727) 474-5584 Visit Website Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Email us info@dunedinfl.com Make a call (727) 733 – 3197 About The Dunedin Chamber of Commerce supports initiatives that make our community a better place to live in and do business. Become a Member Facebook-f Instagram Youtube Linkedin Explore About Us Our Team Latest News Contact Request Ribbon Cutting Request Member Spotlight Upcoming Events Video Credit: Maas Media Photo Credit: Dorky Daisy Photography Website Design/Development: Mirror Marketing © Copyright 2024 – Dunedin Chamber of Commerce"
    },
    {
      "url": "https://hob.beer/",
      "text": "HOB Brewing Co 0 Skip to Content Home About Contact Food at HOB Upcoming Events Private Events Barrel District Experience HOB Give Back HOB Merchandise Hob Merch Gift Cards Buy Gift Cards Check Gift Card Balance Beers Brews On Tap Open Menu Close Menu Home About Contact Food at HOB Upcoming Events Private Events Barrel District Experience HOB Give Back HOB Merchandise Hob Merch Gift Cards Buy Gift Cards Check Gift Card Balance Beers Brews On Tap Open Menu Close Menu Home About Contact Food at HOB Upcoming Events Private Events Barrel District Experience HOB Give Back Folder: HOB Merchandise Back Hob Merch Folder: Gift Cards Back Buy Gift Cards Check Gift Card Balance Beers Brews On Tap Welcome To  HOB Brewing Co. Beer  List Event Venue We have expanded our patio to include a two story open air pavilion and an adjacent courtyard. Located right off the Pinellas Trail in beautiful Downtown Dunedin. This space give you so much room and options to really let your creativity come out for your wedding or special event. The second floor loft contains a bar and can be accessed from two separate staircases.Ample downtown parking with a free parking garage located right next door. Book It Beers We update our beer list often. Be sure to check out whats on tap. Whats on tap Upcoming Public Events Its never a dull moment here at HOB. From Craft Beer Festivals to Silent Disco, we know how to throw a proper party. Check out our upcoming event schedule so you don’t miss it! Click Here Subscribe to Our Newsletter Sign up with your email address to receive news and updates. Email Address Sign Up Thank you! Must be 21 to be served Artists scheduled to appear are subject to change without notice"
    },
    {
      "url": "https://mthoodbrewing.com/about-us/",
      "text": "About Us - Mt. Hood Brewing Co. Home About Us Beer Menus Govy Menu Rainbow Tavern Menu PDX Menu Tilikum Private Events MT. HOOD BREWING CO. EST. 1991 ABOUT MT. HOOD BREWING CO. The Mt. Hood Brewing Co. opened in January 1991 in the alpine village of Government Camp, Oregon, serving locally-produced beers and hearty pub fare in a family-friendly atmosphere. It is owned by R.L.K. and Company, the same folks who have been operating historic Timberline Lodge since 1955. In October 1992, the newly constructed ten barrel brewery rolled out its first barrel under the watchful eye of Brewmaster Jon B. Graber. The Mt. Hood Brewing Co. is named for a brewery that originally operated in Portland, Oregon from 1905 to 1913 during the pre-prohibition heyday of American brewers. In 2018, construction began on a brewery expansion, adjacent to the existing brewery and brewpub in Government Camp. With the addition of two fermentation tanks, brite beer tanks, dry and cold storage, Mt. Hood Brewing Co. has doubled production. Cold and packaged beer storage plus a new packaging area has enabled us to offer a greater variety of seasonal ales in bottle, including barrel-aged beers, and more canned craft beers utilizing a new canning line. The Mt. Hood Brewing Co. was founded upon the notion that beer is best produced in small, handcrafted batches utilizing the finest ingredients. The brewery’s commitment to this standard demands that each keg arrives at its destination while in its prime – fresh and wholesome. Thus, none of the beer leaves the State of Oregon. Our beers can be enjoyed at our brewpub in Government Camp and throughout Timberline Lodge on Mt. Hood. With the additions of Mt. Hood Brewing Co. Tilikum Station (Portland) in 2018 and Mt. Hood Brewing Co. Rainbow Tavern (Maupin) in 2022, you can find our craft ales farther afield. Draft and packaged beers are also available in several local restaurants and shops. OUR BREWER R.L.K. and Company, operators of Mt. Hood Brewing Co. and Timberline Lodge , appointed Bryan Borgmeier as Head Brewer of the Mt. Hood Brewing Co. in fall 2016. Bryan grew up in Oregon City, and completed his Bachelor of Science Degree in Economics from Linfield College in McMinnville, OR. It was at a Linfield class on homebrewing that he was introduced to the magic of brewing beer. He earned an Associate Degree in Brewing Technology from Siebel Institute of Technology in 2014. Over the course of the last several years, Bryan has traveled through Oregon and the Lake Tahoe area of California, gaining valuable experience at several reputable breweries. “Mt. Hood is an icon, as is Timberline, and to be able to represent this icon as a brewer is an amazing opportunity,” states Bryan, “In addition to updating the core lineup of beers, I’d like to develop special projects, maybe 3-4 caged bottles that we release every year. And of course I’d like to make a fresh hop beer and continue to work on the barrel-aged beer program that Timberline Chef Jason Stoller Smith helped start. I think that Mt. Hood, the brand, being an icon, has a ton of potential that most don’t have. A rare opportunity. In the NW we’re blessed with really fresh hop yards, malting facilities, a world-class yeast lab. And of course we have a glacier-fed well of pure, pristine and plentiful water.” ~Brewer Bryan Borgmeier MT. HOOD BREWING CO. Govy 87304 E Gov. Camp Loop Government Camp, OR 97028 503-272-3172 Email Lost and found OPEN DAILY 11:00am to 9:00pm FOLLOW US! Oregon law prohibits all animals except for service animals in restaurants. Mt. Hood Brewing Co. is part of R.L.K. and Company, which includes Timberline and Chevron in Government Camp SEARCH JOBS PRIVACY POLICY SUBSCRIBE TO OUR EMAIL LIST MT. HOOD BREWING CO. Tilikum Station 401 SE Caruthers St. Portland, OR 97214 971-302-7296 Email OPEN DAILY 11:00am to 8:00pm MT. HOOD BREWING CO. Rainbow Tavern 411 Deschutes Ave. Maupin, OR 97037 541-395-2497 Email OPEN DAILY 11:00am to 11:00pm til midnight Fridays & Saturdays Copyright © 2018 Mt. Hood Brewing Co. All rights reserved."
    },
    {
      "url": "https://hobbsbeer.com/terms-of-use/",
      "text": "Terms of Use - Hobbs Brewing Company Story Visit Us Hobbs Tavern The Hayloft Hobbs Brewing Tap Room Hobbs Belize Beer Shop Events Menu Close June 19, 2024 Terms of Use Agreement to Our Legal Terms We are Hobbs Brewing Co. (“ Company ,” “ we ,” “ us ,” “ our “), a company registered in New Hampshire. We operate the website hobbsbeer.com (the “ Site “), as well as any other related products and services that refer or link to these legal terms (the “ Legal Terms “) (collectively, the “ Services “). You can contact us by email at info@hobbsbeer.com or by mail to New Hampshire. These Legal Terms constitute a legally binding agreement made between you, whether personally or on behalf of an entity (“ you “), and Hobbs Brewing Co., concerning your access to and use of the Services. You agree that by accessing the Services, you have read, understood, and agreed to be bound by all of these Legal Terms. If you do not agree with all of these Legal Terms, then you are expressly prohibited from using the Services and you must discontinue use immediately. Supplemental terms and conditions or documents that may be posted on the Services from time to time are hereby expressly incorporated herein by reference. We reserve the right, in our sole discretion, to make changes or modifications to these Legal Terms at any time and for any reason. We will alert you about any changes by updating the “Last updated” date of these Legal Terms, and you waive any right to receive specific notice of each such change. It is your responsibility to periodically review these Legal Terms to stay informed of updates. You will be subject to, and will be deemed to have been made aware of and to have accepted, the changes in any revised Legal Terms by your continued use of the Services after the date such revised Legal Terms are posted. The Services are intended for users who are at least 18 years old. Persons under the age of 18 are not permitted to use or register for the Services. 1. Our Services The information provided when using the Services is not intended for distribution to or use by any person or entity in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject us to any registration requirement within such jurisdiction or country. Accordingly, those persons who choose to access the Services from other locations do so on their own initiative and are solely responsible for compliance with local laws, if and to the extent local laws are applicable. The Services are not tailored to comply with industry-specific regulations (Health Insurance Portability and Accountability Act (HIPAA), Federal Information Security Management Act (FISMA), etc.), so if your interactions would be subjected to such laws, you may not use the Services. You may not use the Services in a way that would violate the Gramm-Leach-Bliley Act (GLBA). 2. Intellectual Property Rights Our Intellectual Property We are the owner or the licensee of all intellectual property rights in our Services, including all source code, databases, functionality, software, website designs, audio, video, text, photographs, and graphics in the Services (collectively, the “ Content “), as well as the trademarks, service marks, and logos contained therein (the “ Marks “). Our Content and Marks are protected by copyright and trademark laws (and various other intellectual property rights and unfair competition laws) and treaties in the United States and around the world. The Content and Marks are provided in or through the Services “AS IS” for your personal, non-commercial use or internal business purpose only. Your Use of Our Services Subject to your compliance with these Legal Terms, including the “Prohibited Activities” section below, we grant you a non-exclusive, non-transferable, revocable license to: Access the Services; and Download or print a copy of any portion of the Content to which you have properly gained access. solely for your personal, non-commercial use or internal business purpose. Except as set out in this section or elsewhere in our Legal Terms, no part of the Services and no Content or Marks may be copied, reproduced, aggregated, republished, uploaded, posted, publicly displayed, encoded, translated, transmitted, distributed, sold, licensed, or otherwise exploited for any commercial purpose whatsoever, without our express prior written permission. If you wish to make any use of the Services, Content, or Marks other than as set out in this section or elsewhere in our Legal Terms, please address your request to: info@hobbsbeer.com . If we ever grant you the permission to post, reproduce, or publicly display any part of our Services or Content, you must identify us as the owners or licensors of the Services, Content, or Marks and ensure that any copyright or proprietary notice appears or is visible on posting, reproducing, or displaying our Content. We reserve all rights not expressly granted to you in and to the Services, Content, and Marks. Any breach of these Intellectual Property Rights will constitute a material breach of our Legal Terms and your right to use our Services will terminate immediately. Your Submissions Please review this section and the “Prohibited Activities” section carefully prior to using our Services to understand the (a) rights you give us and (b) obligations you have when you post or upload any content through the Services. Submissions: By directly sending us any question, comment, suggestion, idea, feedback, or other information about the Services (“Submissions”), you agree to assign to us all intellectual property rights in such Submission. You agree that we shall own this Submission and be entitled to its unrestricted use and dissemination for any lawful purpose, commercial or otherwise, without acknowledgment or compensation to you. You are responsible for what you post or upload: By sending us Submissions through any part of the Services you: Confirm that you have read and agree with our “Prohibited Activities” and will not post, send, publish, upload, or transmit through the Services any Submission that is illegal, harassing, hateful, harmful, defamatory, obscene, bullying, abusive, discriminatory, threatening to any person or group, sexually explicit, false, inaccurate, deceitful, or misleading; To the extent permissible by applicable law, waive any and all moral rights to any such Submission; Warrant that any such Submission is original to you or that you have the necessary rights and licenses to submit such Submissions and that you have full authority to grant us the above-mentioned rights in relation to your Submissions; and Warrant and represent that your Submissions do not constitute confidential information. You are solely responsible for your Submissions and you expressly agree to reimburse us for any and all losses that we may suffer because of your breach of (a) this section, (b) any third party’s intellectual property rights, or (c) applicable law. 3. User Representations By using the Services, you represent and warrant that: You have the legal capacity and you agree to comply with these Legal Terms; You are not a minor in the jurisdiction in which you reside; You will not access the Services through automated or non-human means, whether through a bot, script or otherwise; You will not use the Services for any illegal or unauthorized purpose; and Your use of the Services will not violate any applicable law or regulation. If you provide any information that is untrue, inaccurate, not current, or incomplete, we have the right to suspend or terminate your account and refuse any and all current or future use of the Services (or any portion thereof). 4. Prohibited Activities You may not access or use the Services for any purpose other than that for which we make the Services available. The Services may not be used in connection with any commercial endeavors except those that are specifically endorsed or approved by us. As a user of the Services, you agree not to: Systematically retrieve data or other content from the Services to create or compile, directly or indirectly, a collection, compilation, database, or directory without written permission from us. Trick, defraud, or mislead us and other users, especially in any attempt to learn sensitive account information such as user passwords. Circumvent, disable, or otherwise interfere with security-related features of the Services, including features that prevent or restrict the use or copying of any Content or enforce limitations on the use of the Services and/or the Content contained therein. Disparage, tarnish, or otherwise harm, in our opinion, us and/or the Services. Use any information obtained from the Services in order to harass, abuse, or harm another person. Make improper use of our support services or submit false reports of abuse or misconduct. Use the Services in a manner inconsistent with any applicable laws or regulations. Engage in unauthorized framing of or linking to the Services. Upload or transmit (or attempt to upload or to transmit) viruses, Trojan horses, or other material, including excessive use of capital letters and spamming (continuous posting of repetitive text), that interferes with any party’s uninterrupted use and enjoyment of the Services or modifies, impairs, disrupts, alters, or interferes with the use, features, functions, operation, or maintenance of the Services. Engage in any automated use of the system, such as using scripts to send comments or messages, or using any data mining, robots, or similar data gathering and extraction tools. Delete the copyright or other proprietary rights notice from any Content. Attempt to impersonate another user or person or use the username of another user. Upload or transmit (or attempt to upload or to transmit) any material that acts as a passive or active information collection or transmission mechanism, including without limitation, clear graphics interchange formats (“ gifs “), 1×1 pixels, web bugs, cookies, or other similar devices (sometimes referred to as “spyware” or “passive collection mechanisms” or “ pcms “). Interfere with, disrupt, or create an undue burden on the Services or the networks or services connected to the Services. Harass, annoy, intimidate, or threaten any of our employees or agents engaged in providing any portion of the Services to you. Attempt to bypass any measures of the Services designed to prevent or restrict access to the Services, or any portion of the Services. Copy or adapt the Services’ software, including but not limited to Flash, PHP, HTML, JavaScript, or other code. Decipher, decompile, disassemble, or reverse engineer any of the software comprising or in any way making up a part of the Services. Except as may be the result of standard search engine or Internet browser usage, use, launch, develop, or distribute any automated system, including without limitation, any spider, robot, cheat utility, scraper, or offline reader that accesses the Services, or using or launching any unauthorized script or other software. Use a buying agent or purchasing agent to make purchases on the Services. Make any unauthorized use of the Services, including collecting usernames and/or email addresses of users by electronic or other means for the purpose of sending unsolicited email, or creating user accounts by automated means or under false pretenses. Use the Services as part of any effort to compete with us or otherwise use the Services and/or the Content for any revenue-generating endeavor or commercial enterprise. Use the Services to advertise or offer to sell goods and services. Sell or otherwise transfer your profile. 5. User Generated Contributions The Services may invite you to chat, contribute to, or participate in blogs, message boards, online forums, and other functionality, and may provide you with the opportunity to create, submit, post, display, transmit, perform, publish, distribute, or broadcast content and materials to us or on the Services, including but not limited to text, writings, video, audio, photographs, graphics, comments, suggestions, or personal information or other material (collectively, “ Contributions “). Contributions may be viewable by other users of the Services and through third-party websites. As such, any Contributions you transmit may be treated as non-confidential and non-proprietary. When you create or make available any Contributions, you thereby represent and warrant that: The creation, distribution, transmission, public display, or performance, and the accessing, downloading, or copying of your Contributions do not and will not infringe the proprietary rights, including but not limited to the copyright, patent, trademark, trade secret, or moral rights of any third party. You are the creator and owner of or have the necessary licenses, rights, consents, releases, and permissions to use and to authorize us, the Services, and other users of the Services to use your Contributions in any manner contemplated by the Services and these Legal Terms. You have the written consent, release, and/or permission of each and every identifiable individual person in your Contributions to use the name or likeness of each and every such identifiable individual person to enable inclusion and use of your Contributions in any manner contemplated by the Services and these Legal Terms. Your Contributions are not false, inaccurate, or misleading. Your Contributions are not unsolicited or unauthorized advertising, promotional materials, pyramid schemes, chain letters, spam, mass mailings, or other forms of solicitation. Your Contributions are not obscene, lewd, lascivious, filthy, violent, harassing, libelous, slanderous, or otherwise objectionable (as determined by us). Your Contributions do not ridicule, mock, disparage, intimidate, or abuse anyone. Your Contributions are not used to harass or threaten (in the legal sense of those terms) any other person and to promote violence against a specific person or class of people. Your Contributions do not violate any applicable law, regulation, or rule. Your Contributions do not violate the privacy or publicity rights of any third party. Your Contributions do not contain any material that solicits personal information from anyone under the age of 18 or exploits people under the age of 18 in a sexual or violent manner. Your Contributions do not violate any federal or state law concerning child pornography, or otherwise intended to protect the health or well-being of minors. Your Contributions do not include any offensive comments that are connected to race, national origin, gender, sexual preference, or physical handicap. Your Contributions do not otherwise violate, or link to material that violates, any provision of these Legal Terms, or any applicable law or regulation. Any use of the Services in violation of the foregoing violates these Legal Terms and may result in, among other things, termination or suspension of your rights to use the Services. 6. Contribution License By posting your Contributions to any part of the Services or making Contributions accessible to the Services by linking your account from the Services to any of your social networking accounts, you automatically grant, and you represent and warrant that you have the right to grant, to us an unrestricted, unlimited, irrevocable, perpetual, non-exclusive, transferable, royalty-free, fully-paid, worldwide right, and license to host, use, copy, reproduce, disclose, sell, resell, publish, broadcast, retitle, archive, store, cache, publicly perform, publicly display, reformat, translate, transmit, excerpt (in whole or in part), and distribute such Contributions (including, without limitation, your image and voice) for any purpose, commercial, advertising, or otherwise, and to prepare derivative works of, or incorporate into other works, such Contributions, and grant and authorize sublicenses of the foregoing. The use and distribution may occur in any media formats and through any media channels. This license will apply to any form, media, or technology now known or hereafter developed, and includes our use of your name, company name, and franchise name, as applicable, and any of the trademarks, service marks, trade names, logos, and personal and commercial images you provide. You waive all moral rights in your Contributions, and you warrant that moral rights have not otherwise been asserted in your Contributions. We do not assert any ownership over your Contributions. You retain full ownership of all of your Contributions and any intellectual property rights or other proprietary rights associated with your Contributions. We are not liable for any statements or representations in your Contributions provided by you in any area on the Services. You are solely responsible for your Contributions to the Services and you expressly agree to exonerate us from any and all responsibility and to refrain from any legal action against us regarding your Contributions. We have the right, in our sole and absolute discretion, (1) to edit, redact, or otherwise change any Contributions; (2) to re-categorize any Contributions to place them in more appropriate locations on the Services; and (3) to pre-screen or delete any Contributions at any time and for any reason, without notice. We have no obligation to monitor your Contributions. 7. Third-Party Websites and Content The Services may contain (or you may be sent via the Site) links to other websites (“ Third-Party Websites “) as well as articles, photographs, text, graphics, pictures, designs, music, sound, video, information, applications, software, and other content or items belonging to or originating from third parties (“ Third-Party Content “). Such Third-Party Websites and Third-Party Content are not investigated, monitored, or checked for accuracy, appropriateness, or completeness by us, and we are not responsible for any Third-Party Websites accessed through the Services or any Third-Party Content posted on, available through, or installed from the Services, including the content, accuracy, offensiveness, opinions, reliability, privacy practices, or other policies of or contained in the Third-Party Websites or the Third-Party Content. Inclusion of, linking to, or permitting the use or installation of any Third-Party Websites or any Third-Party Content does not imply approval or endorsement thereof by us. If you decide to leave the Services and access the Third-Party Websites or to use or install any Third-Party Content, you do so at your own risk, and you should be aware that these Legal Terms no longer govern. You should review the applicable terms and policies, including privacy and data gathering practices, of any website to which you navigate from the Services or relating to any applications you use or install from the Services. Any purchases you make through Third-Party Websites will be through other websites and from other companies, and we take no responsibility whatsoever in relation to such purchases which are exclusively between you and the applicable third party. You agree and acknowledge that we do not endorse the products or services offered on Third-Party Websites and you shall hold us harmless from any harm caused by your purchase of such products or services. Additionally, you shall hold us harmless from any losses sustained by you or harm caused to you relating to or resulting in any way from any Third-Party Content or any contact with Third-Party Websites. 8. Services Management We reserve the right, but not the obligation, to: Monitor the Services for violations of these Legal Terms; Take appropriate legal action against anyone who, in our sole discretion, violates the law or these Legal Terms, including without limitation, reporting such user to law enforcement authorities; In our sole discretion and without limitation, refuse, restrict access to, limit the availability of, or disable (to the extent technologically feasible) any of your Contributions or any portion thereof; In our sole discretion and without limitation, notice, or liability, to remove from the Services or otherwise disable all files and content that are excessive in size or are in any way burdensome to our systems; and Otherwise manage the Services in a manner designed to protect our rights and property and to facilitate the proper functioning of the Services. 9. Privacy Policy We care about data privacy and security. Please review our Privacy Policy: https://hobbsbeer.com/legal/privacy-policy . By using the Services, you agree to be bound by our Privacy Policy, which is incorporated into these Legal Terms. Please be advised the Services are hosted in the United States. If you access the Services from any other region of the world with laws or other requirements governing personal data collection, use, or disclosure that differ from applicable laws in the United States, then through your continued use of the Services, you are transferring your data to the United States, and you agree to have your data transferred to and processed in the United States. Further, we do not knowingly accept, request, or solicit information from children or knowingly market to children. Therefore, in accordance with the U.S. Children’s Online Privacy Protection Act, if we receive actual knowledge that anyone under the age of 13 has provided personal information to us without the requisite and verifiable parental consent, we will delete that information from the Services as quickly as is reasonably practical. 10. Term and Termination These Legal Terms shall remain in full force and effect while you use the Services. Without limiting any other provision of these Legal Terms, we reserve the right to, in our sole discretion and without notice or liability, deny access to and use of the Services (including blocking certain IP addresses), to any person for any reason or for no reason, including without limitation for breach of any representation, warranty, or covenant contained in these Legal Terms or of any applicable law or regulation. We may terminate your use or participation in the Services or delete any content or information that you posted at any time, without warning, in our sole discretion. If we terminate or suspend your account for any reason, you are prohibited from registering and creating a new account under your name, a fake or borrowed name, or the name of any third party, even if you may be acting on behalf of the third party. In addition to terminating or suspending your account, we reserve the right to take appropriate legal action, including without limitation pursuing civil, criminal, and injunctive redress. 11. Modifications and Interruptions We reserve the right to change, modify, or remove the contents of the Services at any time or for any reason at our sole discretion without notice. However, we have no obligation to update any information on our Services. We also reserve the right to modify or discontinue all or part of the Services without notice at any time. We will not be liable to you or any third party for any modification, price change, suspension, or discontinuance of the Services. We cannot guarantee the Services will be available at all times. We may experience hardware, software, or other problems or need to perform maintenance related to the Services, resulting in interruptions, delays, or errors. We reserve the right to change, revise, update, suspend, discontinue, or otherwise modify the Services at any time or for any reason without notice to you. You agree that we have no liability whatsoever for any loss, damage, or inconvenience caused by your inability to access or use the Services during any downtime or discontinuance of the Services. Nothing in these Legal Terms will be construed to obligate us to maintain and support the Services or to supply any corrections, updates, or releases in connection therewith. 12. Governing Law These Legal Terms and your use of the Services are governed by and construed in accordance with the laws of the State of New Hampshire applicable to agreements made and to be entirely performed within the State of New Hampshire, without regard to its conflict of law principles. 13. Corrections There may be information on the Services that contains typographical errors, inaccuracies, or omissions, including descriptions, pricing, availability, and various other information. We reserve the right to correct any errors, inaccuracies, or omissions and to change or update the information on the Services at any time, without prior notice. 14. Disclaimer THE SERVICES ARE PROVIDED ON AN AS-IS AND AS-AVAILABLE BASIS. YOU AGREE THAT YOUR USE OF THE SERVICES WILL BE AT YOUR SOLE RISK. TO THE FULLEST EXTENT PERMITTED BY LAW, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, IN CONNECTION WITH THE SERVICES AND YOUR USE THEREOF, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, AND NON-INFRINGEMENT. WE MAKE NO WARRANTIES OR REPRESENTATIONS ABOUT THE ACCURACY OR COMPLETENESS OF THE SERVICES’ CONTENT OR THE CONTENT OF ANY WEBSITES LINKED TO THE SERVICES AND WE WILL ASSUME NO LIABILITY OR RESPONSIBILITY FOR ANY (1) ERRORS, MISTAKES, OR INACCURACIES OF CONTENT AND MATERIALS, (2) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, RESULTING FROM YOUR ACCESS TO AND USE OF THE SERVICES, (3) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN, (4) ANY INTERRUPTION OR CESSATION OF TRANSMISSION TO OR FROM THE SERVICES, (5) ANY BUGS, VIRUSES, TROJAN HORSES, OR THE LIKE WHICH MAY BE TRANSMITTED TO OR THROUGH THE SERVICES BY ANY THIRD PARTY, AND/OR (6) ANY ERRORS OR OMISSIONS IN ANY CONTENT AND MATERIALS OR FOR ANY LOSS OR DAMAGE OF ANY KIND INCURRED AS A RESULT OF THE USE OF ANY CONTENT POSTED, TRANSMITTED, OR OTHERWISE MADE AVAILABLE VIA THE SERVICES. WE DO NOT WARRANT, ENDORSE, GUARANTEE, OR ASSUME RESPONSIBILITY FOR ANY PRODUCT OR SERVICE ADVERTISED OR OFFERED BY A THIRD PARTY THROUGH THE SERVICES, ANY HYPERLINKED WEBSITE, OR ANY WEBSITE OR MOBILE APPLICATION FEATURED IN ANY BANNER OR OTHER ADVERTISING, AND WE WILL NOT BE A PARTY TO OR IN ANY WAY BE RESPONSIBLE FOR MONITORING ANY TRANSACTION BETWEEN YOU AND ANY THIRD-PARTY PROVIDERS OF PRODUCTS OR SERVICES. AS WITH THE PURCHASE OF A PRODUCT OR SERVICE THROUGH ANY MEDIUM OR IN ANY ENVIRONMENT, YOU SHOULD USE YOUR BEST JUDGMENT AND EXERCISE CAUTION WHERE APPROPRIATE. 15. Limitations of Liability IN NO EVENT WILL WE OR OUR DIRECTORS, EMPLOYEES, OR AGENTS BE LIABLE TO YOU OR ANY THIRD PARTY FOR ANY DIRECT, INDIRECT, CONSEQUENTIAL, EXEMPLARY, INCIDENTAL, SPECIAL, OR PUNITIVE DAMAGES, INCLUDING LOST PROFIT, LOST REVENUE, LOSS OF DATA, OR OTHER DAMAGES ARISING FROM YOUR USE OF THE SERVICES, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. NOTWITHSTANDING ANYTHING TO THE CONTRARY CONTAINED HEREIN, OUR LIABILITY TO YOU FOR ANY CAUSE WHATSOEVER AND REGARDLESS OF THE FORM OF THE ACTION, WILL AT ALL TIMES BE LIMITED TO THE AMOUNT PAID, IF ANY, BY YOU TO US DURING THE SIX (6) MONTH PERIOD PRIOR TO ANY CAUSE OF ACTION ARISING. CERTAIN STATE LAWS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OR LIMITATION OF CERTAIN DAMAGES. IF THESE LAWS APPLY TO YOU, SOME OR ALL OF THE ABOVE DISCLAIMERS OR LIMITATIONS MAY NOT APPLY TO YOU, AND YOU MAY HAVE ADDITIONAL RIGHTS. 16. Indemnification You agree to defend, indemnify, and hold us harmless, including our subsidiaries, affiliates, and all of our respective officers, agents, partners, and employees, from and against any loss, damage, liability, claim, or demand, including reasonable attorneys’ fees and expenses, made by any third party due to or arising out of: (1) your Contributions; (2) use of the Services; (3) breach of these Legal Terms; (4) any breach of your representations and warranties set forth in these Legal Terms; (5) your violation of the rights of a third party, including but not limited to intellectual property rights; or (6) any overt harmful act toward any other user of the Services with whom you connected via the Services. Notwithstanding the foregoing, we reserve the right, at your expense, to assume the exclusive defense and control of any matter for which you are required to indemnify us, and you agree to cooperate, at your expense, with our defense of such claims. We will use reasonable efforts to notify you of any such claim, action, or proceeding which is subject to this indemnification upon becoming aware of it. 17. User Data We will maintain certain data that you transmit to the Services for the purpose of managing the performance of the Services, as well as data relating to your use of the Services. Although we perform regular routine backups of data, you are solely responsible for all data that you transmit or that relates to any activity you have undertaken using the Services. You agree that we shall have no liability to you for any loss or corruption of any such data, and you hereby waive any right of action against us arising from any such loss or corruption of such data. 18. Electronic Communications, Transactions, and Signatures Visiting the Services, sending us emails, and completing online forms constitute electronic communications. You consent to receive electronic communications, and you agree that all agreements, notices, disclosures, and other communications we provide to you electronically, via email and on the Services, satisfy any legal requirement that such communication be in writing. YOU HEREBY AGREE TO THE USE OF ELECTRONIC SIGNATURES, CONTRACTS, ORDERS, AND OTHER RECORDS, AND TO ELECTRONIC DELIVERY OF NOTICES, POLICIES, AND RECORDS OF TRANSACTIONS INITIATED OR COMPLETED BY US OR VIA THE SERVICES. You hereby waive any rights or requirements under any statutes, regulations, rules, ordinances, or other laws in any jurisdiction which require an original signature or delivery or retention of non-electronic records, or to payments or the granting of credits by any means other than electronic means. 19. California Users and Residents If any complaint with us is not satisfactorily resolved, you can contact the Complaint Assistance Unit of the Division of Consumer Services of the California Department of Consumer Affairs in writing at 1625 North Market Blvd., Suite N 112, Sacramento, California 95834 or by telephone at (800) 952-5210 or (916) 445-1254. 20. Miscellaneous These Legal Terms and any policies or operating rules posted by us on the Services or in respect to the Services constitute the entire agreement and understanding between you and us. Our failure to exercise or enforce any right or provision of these Legal Terms shall not operate as a waiver of such right or provision. These Legal Terms operate to the fullest extent permissible by law. We may assign any or all of our rights and obligations to others at any time. We shall not be responsible or liable for any loss, damage, delay, or failure to act caused by any cause beyond our reasonable control. If any provision or part of a provision of these Legal Terms is determined to be unlawful, void, or unenforceable, that provision or part of the provision is deemed severable from these Legal Terms and does not affect the validity and enforceability of any remaining provisions. There is no joint venture, partnership, employment, or agency relationship created between you and us as a result of these Legal Terms or use of the Services. You agree that these Legal Terms will not be construed against us by virtue of having drafted them. You hereby waive any and all defenses you may have based on the electronic form of these Legal Terms and the lack of signing by the parties hereto to execute these Legal Terms. 21. Contact Us In order to resolve a complaint regarding the Services or to receive further information regarding use of the Services, please contact us at: Hobbs Tavern & Brewing Co. Address: 2415 White Mountain Hwy, West Ossipee, NH 03890 Email: info@hobbsbeer.com Phone: (603) 539-2000 A new frontier for craft beer. Write to Us Careers News Beers Events Hobbs Tavern 2415 White Mountain Hwy West Ossipee, NH 03890 Mon - Sun 11:30am - 9pm Phone: 603.539.2000 The Hayloft 2415 White Mountain Hwy West Ossipee, NH 03890 Fri-Sun 11:30am - 9:00pm Mon & Tue Closed Wed & Thu 5:00 - 9:00pm Phone: 603.539.2000 Hobbs Brewing Tap Room 765 Route 16 Ossipee, NH 03864 Thu 12pm - 9pm Fri & Sat 12pm - 8pm Sun 12pm - 5pm Phone: 603.539.3795 Hobbs Belize Mile 21 Placencia Rd Punta Placencia, Belize Phone: +501 662-0766 Privacy Policy Terms of Use 2025 ®Hobbs Brewing Co."
    },
    {
      "url": "https://hobbsbeer.com/",
      "text": "Home - Hobbs Brewing Company Story Visit Us Hobbs Tavern The Hayloft Hobbs Brewing Tap Room Hobbs Belize Beer Shop Events Menu Close A New Frontier for Craft Beer Tap to play Hobbs Tavern The Hayloft at Hobbs Tavern Hobbs Brewing Tap Room Hobbs Brew Barge in Belize Hobbs Tavern An idyllic countryside brewpub offering warmth, history, classic comfort food and handcrafted beer at the foot of the White Mountains. Learn More 2415 White Mountain Hwy West Ossipee, NH 03890 Monday - Sunday 11:30am - 9pm Tap List Food Menu The Hayloft at Hobbs Tavern Signature wings, specialty pizza, Hobbs beer, house wines, and well cocktails in our 1890's barn's second floor hayloft Learn More 2415 White Mountain Hwy West Ossipee, NH 03890 Friday-Sunday 11:30am - 9:00pm Monday & Tuesday Closed Wednesday & Thursday 5:00 - 9:00pm Food Menu Hobbs Brewing Tap Room Our full-service Tap Room featuring daily food trucks, Friday night markets, live music, cornhole, and more! Learn More 765 Route 16 Ossipee, NH 03864 Thursday 12pm - 9pm Friday & Saturday 12pm - 8pm Sunday 12pm - 5pm Tap List Hobbs Brew Barge in Belize Full-service floating restaurant serving American comfort classics, tropical cocktails, and Hobbs Brewing Company, Belize beers - The Craft Beer of Belize! Learn More Mile 21 Placencia Rd Punta Placencia, Belize About us Just making better beer every day Award-winning beer, and immersive experiences, since 2014. The modern yet rustic Hobbs Tavern opened in April 2014, with three business partners driving the complete renovation of the building and the creation of a new restaurant. On-site beer production for the brewpub also began in 2014, with Hobbs procuring a canning line and starting packaging and self-distribution in 2016. That same year, the Hobbs Team won a Bronze medal at the Great International Beer Festival for their “One Arm Farmhouse Ale.” In 2017, that same beer won silver. Continuing the tradition of “just making better beer every day,” the brewery began to outgrow its humble beginnings and made plans to expand. In the fall of 2018, building and equipment installation for the relocation of the production and canning operations to a new 9,000 sq./ft production facility began, located 11.1 miles down RT 16. The new space features a 15 BBL brewhouse and the capacity to produce 15,000 barrels of beer. On October 31, 2020, the Tap Room opened to the public, marking a significant milestone in Hobbs Tavern's journey. There’s no gift like Hobbs Full Shop All Accessories Beer Clothing Drinkware HBCo Pullover Hoodie $45.00 League x Hobbs Old Favorite Trucker Hat $25.00 Jacked Up Tee, Unisex $25.00 League Hopback 7-Panel Flat Brim $25.00 Lodge Life Poster $6.00 Wild Tribute Caravan Moose Tee, Unisex $30.00 Hayloft Willi Becher, 16 oz. $8.00 Hayloft Logo Pint Glass, 16 oz. $8.00 Tavern Onesie, 12 month $15.00 League Tri-Flex Short Sleeve Crew, Ladies, Light Blue $25.00 Hayloft Baseball Tee, Unisex $25.00 HBCo Mid-Pro Snapback $25.00 HBCo Logo Hugo Stemmed Glass, 14 oz. $8.00 Lake Life Beer Poster $6.00 Virgil Beer Poster $6.00 Hobbs Belize Retro Wild Cat, Unisex $25.00 Hobbs Mystery Sticker Pack $10.00 HBCo Logo Can Glass, 16 oz. $8.00 HBCo Logo Tulip, 16 oz. $8.00 HBCo Classic Logo Tee, Unisex, Charcoal $25.00 HBCo Logo Pint Glass, 16 oz. $8.00 Hi, Jack! Tee, Unisex $27.00 League x Hobbs Old Favorite Tap Room Trucker $25.00 Lake Life Can Koolie $5.00 HBCo Sunglasses $5.00 Miir Flip Travel Mug, 16 oz. $32.00 HBCo Tin Tacker $30.00 3 Year “Trippie” Rastal Teku, 14.5 oz $10.00 Tavern Logo Pint Glass, 16 oz. $8.00 2024 Bourbon Barrel-Aged Chocorua’s Curse Barleywine- Style Ale, 500ml $15.00 HBCo Soft Cooler Bag $32.00 Upcycled Malt Tote Bag $20.00 League Lake Life Caddy Adjustable Hat $25.00 A new frontier for craft beer. Write to Us Careers News Beers Events Hobbs Tavern 2415 White Mountain Hwy West Ossipee, NH 03890 Mon - Sun 11:30am - 9pm Phone: 603.539.2000 The Hayloft 2415 White Mountain Hwy West Ossipee, NH 03890 Fri-Sun 11:30am - 9:00pm Mon & Tue Closed Wed & Thu 5:00 - 9:00pm Phone: 603.539.2000 Hobbs Brewing Tap Room 765 Route 16 Ossipee, NH 03864 Thu 12pm - 9pm Fri & Sat 12pm - 8pm Sun 12pm - 5pm Phone: 603.539.3795 Hobbs Belize Mile 21 Placencia Rd Punta Placencia, Belize Phone: +501 662-0766 Privacy Policy Terms of Use 2025 ®Hobbs Brewing Co."
    },
    {
      "url": "https://cm.dunedinfl.com/list/member/hob-brewing-co-8320",
      "text": "HOB Brewing Co. | Breweries, Bars & Clubs Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login/Sign-Up info@dunedinfl.com 301 Main Street, Dunedin, FL 34698 Facebook Ovaicon-instagram Youtube Yelp Linkedin Menu Home About Board of Directors Chamber Staff Volunteers Get Involved Events Calendar Pride Member Benefits & Sign-Up Member Spotlights Committees Chamber Champions Services Advertising Members Directory Ads Advocacy Business Consulting Member Job Posting Ribbon Cutting Classes The Hub (Co-Work) Resources Member Directory Member Resources Business Blogs Why Florida? Pinellas Economic Dashboard City Metrics City Development Guide Development Incentives Foundation Visitors Visitor Center Eat & Drink Shop Stay Play Contact Login / Sign-Up HOB Brewing Co. Home HOB Brewing Co. Categories Breweries, Bars & Clubs 931 Huntley Ave. Dunedin FL 34698 (727) 474-5584 Visit Website Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Email us info@dunedinfl.com Make a call (727) 733 – 3197 About The Dunedin Chamber of Commerce supports initiatives that make our community a better place to live in and do business. Become a Member Facebook-f Instagram Youtube Linkedin Explore About Us Our Team Latest News Contact Request Ribbon Cutting Request Member Spotlight Upcoming Events Video Credit: Maas Media Photo Credit: Dorky Daisy Photography Website Design/Development: Mirror Marketing © Copyright 2024 – Dunedin Chamber of Commerce"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://hob.beer/upcoming-events",
      "text": "Upcoming Events — HOB Brewing Co 0 Skip to Content Home About Contact Food at HOB Upcoming Events Private Events Barrel District Experience HOB Give Back HOB Merchandise Hob Merch Gift Cards Buy Gift Cards Check Gift Card Balance Beers Brews On Tap Open Menu Close Menu Home About Contact Food at HOB Upcoming Events Private Events Barrel District Experience HOB Give Back HOB Merchandise Hob Merch Gift Cards Buy Gift Cards Check Gift Card Balance Beers Brews On Tap Open Menu Close Menu Home About Contact Food at HOB Upcoming Events Private Events Barrel District Experience HOB Give Back Folder: HOB Merchandise Back Hob Merch Folder: Gift Cards Back Buy Gift Cards Check Gift Card Balance Beers Brews On Tap Upcoming Events Sep 19 to Sep 21 HOBTOBERFEST Fri, Sep 19, 2025 4:00 PM Sun, Sep 21, 2025 5:00 PM Google Calendar ICS Join us for a fun-filled weekend of live music, delectable dishes, games, and an overflow of our in-house brewed Oktoberfest beer! View Event → Sep 22 Paint Your Pal - Paint Pawty Monday, September 22, 2025 6:00 PM 10:30 PM Google Calendar ICS Join us at HOB Brewing Co. on Monday, September 22nd at 6 PM for a fun-filled night of painting and celebrating your beloved companion! Whether you’re a seasoned artist or just want to try something new, this event is all about creativity, community, and giving back. What to Expect: Paint a portrait of your beloved companion in a relaxed, supportive atmosphere on a pre-sketched 11”x14” canvas. Connect with fellow animal lovers over drinks and creativity. Add an extra special touch with an enhanced ticket—I’ll pre-paint your pal’s eyes and nose for an additional $15! 30% of each ticket supports Humane Social of Pinellas and Compassion Kind, helping animals in need. Take home a special treat for your pup from Marcy’s Pet Kitchen. Ticket Info: Standard Tickets : $50 per person, Enhanced Tickets : $65 per person Tickets must be purchased by August 2nd to secure your spot. Tickets can be purchased HERE ! Attendees must be 21 or older. Ready to honor your furry friend with a one-of-a-kind painting? Grab your spot now, invite your friends, and let’s create something special together! ** Cancellation Policy : Full refund if canceled 48 hours in advance; partial refund after that. After you purchase your ticket, I’ll send you an email from hello@sketchbookbykristen.com to request your fur baby’s photo and name, and your background color selection. View Event → Sep 23 Wine & Canvas Tuesday, September 23, 2025 6:00 PM 9:00 PM Google Calendar ICS 🎨 Join us as we explore the vibrant world of the colorful California Dreaming .  Sip your way to an evening filled with creativity and good vibes at our Dunedin Paint n’ Sip – California Dreaming event! ✨ Paint and Sip Highlights: All painting supplies included Drinks and delicious food available for purchase from HOB Brewing All ages welcome, suggest ages 12+ Seats are limited , so reserve your spot today and let California Dreaming inspire your next artistic adventure! The canvas size is 16×20. We provide all the art materials, so you simply register online and then show up with an open mind ready for some creative fun. The artist will guide you step-by-step through the process to create a beautiful masterpiece that you can take home. Purchase tickets here ! View Event → Nov 15 Cornhole For A Cause Saturday, November 15, 2025 2:00 PM 6:00 PM Google Calendar ICS Get ready to toss some bags and raise money for a good cause at Cornhole for a Cause - it's all about having fun while making a difference! Purchase tickets here ! View Event → Sep 7 Saltwater Giggles Live Podcast & Tailgate - Bucs vs Falcons Sunday, September 7, 2025 12:00 PM 1:30 PM Google Calendar ICS A live PODCAST mixing football talk, fan stories, and tailgate laughs recorded right at the HOB Brewing parking lot in Dunedin before kickoff! Meet us at the Main Stage! Come and get your FREE swag! Raffle Giveaways Cornhole Games Questions from the Crowd Live Interview with a Surprise Guest Touchdowns taste better with a craft beer in hand! Over 30 different drafts on tap 16oz Bud Light Aluminum Bottles $5 HOB's Burgers and Snack Shack Kiosk We fumble our words more than quarterbacks fumble the ball… so get ready to laugh, cheer, and have a blast! Can't wait to see you there! View Event → Aug 4 Paint Your Pal Paint Pawty - Humane Society Pinellas Fundraiser Monday, August 4, 2025 6:00 PM 9:00 PM Google Calendar ICS Join us at HOB Brewing Co. on Monday, August 4th, at 6 PM for a fun-filled night of painting and celebrating your beloved companion! Whether you’re a seasoned artist or just want to try something new, this event is all about creativity, community, and giving back. What to Expect: Paint a portrait of your beloved companion in a relaxed, supportive atmosphere on a pre-sketched 11”x14” canvas. Connect with fellow animal lovers over drinks and creativity. Add an extra special touch with an enhanced ticket—I’ll pre-paint your pal’s eyes and nose for an additional $15! 30% of each ticket supports Humane Social of Pinellas and Compassion Kind, helping animals in need. Take home a special treat for your pup from Marcy’s Pet Kitchen. Ticket Info: Standard Tickets : $50 per person, Enhanced Tickets : $65 per person Tickets must be purchased by August 2nd to secure your spot. Tickets can be purchased HERE ! Attendees must be 21 or older. Ready to honor your furry friend with a one-of-a-kind painting? Grab your spot now, invite your friends, and let’s create something special together! ** Cancellation Policy : Full refund if canceled 48 hours in advance; partial refund after that. After you purchase your ticket, I’ll send you an email from hello@sketchbookbykristen.com to request your fur baby’s photo and name, and your background color selection. View Event → Jul 18 Zazu Social App Launch Party Friday, July 18, 2025 6:00 PM 8:30 PM Google Calendar ICS The Good Life, Gamified — and it all starts HERE in Dunedin! Get ready to dance, play, and vibe — because ZAZU app is officially launching, and YOU'RE invited to the party that kicks it all off! WHAT TO EXPECT: - Live DJ spinning feel-good beats - Dancing + interactive challenges - Free ZAZU swag giveaways - Photo ops + memory-making moments - Live demos of the app that's changing how we connect - Activities for kids AND grown-ups - Meet the team behind the app and be part of something BIG This isn’t just a party — it’s the start of a grassroots movement built on fun, connection, and living life to the fullest. And it all begins right here in Dunedin, ZAZU’s hometown. Whether you're a gamer, a dreamer, a dancer, or just down for a good time — come be part of the good life, gamified. Don’t miss your chance to say “I was there when it all began.\" Zazu provides the funna and free stuff.  HOB says... 'Come thirsty.' View Event → Jun 28 Sangria Festival - Hosted by Aspirations Winery Saturday, June 28, 2025 2:00 PM 7:00 PM Google Calendar ICS Join us for a relaxed and flavorful afternoon at our Summer Sangria Festival, featuring four unique sangria blends from Aspirations Winery . From bright and citrusy to bold and berry-packed, there's something for every palate. Enjoy great drinks, good company, and live music from Christian Gabriel (2-5 PM) throughout the day — the perfect way to kick back and enjoy the season. No tickets needed — just come thirsty! FREE RSVP View Event → Jun 21 Steady Hobbin' Summer Music Festival Saturday, June 21, 2025 2:00 PM 10:00 PM Google Calendar ICS FREE music fest in Florida?! 🦩⚡🏖️ Steady Hobbin’ Summer Fest is about to make a splash…literally. We felt like something was missing out here in the streets of Dunedin, FL. So we’re turning up the heat Saturday, June 21st! Grab your best buds and gear up for a full day of HOUSE music, custom sound, splash zones, live art, mouthwatering eats, crafty vendors, interactive installations, and a FREE elevated lounge experience to catch it all from above! All fueled by award-winning craft brews and a high vibe crew at HOB Brewing Co. 🍻 RSVP today to secure your spot. Let’s build something incredible together. BIG lineup drop coming soon 🌴🥥 Brands, wanna dive in? Shoot an email to stef@hob.beer for sponsorship info! See you on the dance floor 😎 FREE Ticket RSVP Sponsored by Long Drink, Higher Education, Surfside, GES Pest and Fumigation, Achieva Credit Union, Pasco Camera Inc, & Jeannie’s EZ Out Bail Bonds. View Event → Jun 1 Live Music - Sean DeLong Sunday, June 1, 2025 2:00 PM 5:00 PM Google Calendar ICS View Event → May 25 Live Music - Christian Gabriel Sunday, May 25, 2025 2:00 PM 5:00 PM Google Calendar ICS View Event → May 24 Live Music - Sean DeLong Saturday, May 24, 2025 2:00 PM 5:00 PM Google Calendar ICS View Event → May 17 Live Music - Full Fledged Unit Saturday, May 17, 2025 7:30 PM 10:30 PM Google Calendar ICS \"FULL FLEDGED UNIT\" Plays an array of music from Abba to Zappa with a focus on Ska/Reggae/Punk/Country as well as originals. Our regular Sean DeLong (Front-man/Guitar) leads the band with a little fun for all ages! View Event → May 15 LOST IN Series Filming - With DJ BBQ Thursday, May 15, 2025 4:30 PM 7:30 PM Google Calendar ICS “LOST IN” is a 30-minute television and digital series that puts host Christian Stevenson aka “DJ BBQ” on great adventures at some of the most unique and up-and-coming locations in country. Our series is all about getting completely immersed or “LOST IN” a new place, through awesome adventures, great food, and good times. Each installment takes DJ BBQ to a cool location around America full of fun activities and local FLAVOR just waiting to be discovered. This week - LOST IN brings DJ BBQ to HOB Brewing Co. to feature some of our most popular beer and food items. Come hang around while they get to know our family. Don't forget to wear your favorite HOB merch! See you Thursday! View Event → May 14 Blooms & Brews - Flower Arrangement Workshop Wednesday, May 14, 2025 6:30 PM 8:00 PM Google Calendar ICS Join us for our second Blooms & Brews Flower Arrangement Workshop! The Roaming Petal will be here with their beautiful cart of florals ready to educate you on the best way to create a bouquet and keep your flowers lasting for weeks at a time! A perfect Mother’s Day gift for the special women in your life! Tickets can be purchased here . View Event → May 10 Live Music - Saganaki Bomb Squad Saturday, May 10, 2025 6:15 PM 7:30 PM Google Calendar ICS SAGANAKI BOMB SQUAD is a 6 piece SKA/PUNK/GOOD TIME band from the Tampa Bay Area. Featuring one of HOB’s own, Mani Mezquite, on the saxophone. View Event → May 10 Reggae Vibes by Tim Schletter Saturday, May 10, 2025 5:00 PM 6:00 PM Google Calendar ICS DJ Timmy-T and his reggae sound system bring you vinyl-only selections of classic reggae, rocksteady, rub-a-dub, and ska music. Come enjoy tunes from the turntable and catch the irie vibe of Jamaica’s golden era of music. DJ Timmy-T will also nice up the place by playing jazz-dub saxophone over select reggae versions. Dance on your feet or groove in your seat as you take in the sounds of the reggae beat. View Event → May 9 Night Market Friday, May 9, 2025 6:00 PM 10:00 PM Google Calendar ICS View Event → May 4 Live Music - Sean DeLong Sunday, May 4, 2025 2:00 PM 5:00 PM Google Calendar ICS View Event → Apr 27 Live Music - Sean DeLong Sunday, April 27, 2025 2:00 PM 5:00 PM Google Calendar ICS North Side tunes! View Event → Apr 26 Live Music - Hot Rod Hornets & Pin Up Girls Saturday, April 26, 2025 4:00 PM 7:00 PM Google Calendar ICS Come boogie with us on our South Side Stage! View Event → Apr 24 Franca's Pizza Pop-Up Thursday, April 24, 2025 4:00 PM 8:00 PM Google Calendar ICS View Event → Apr 21 Painting with Heather Monday, April 21, 2025 6:00 PM 7:00 PM Google Calendar ICS View Event → Apr 20 Greyhound Meet & Greet Sunday, April 20, 2025 12:00 PM 2:00 PM Google Calendar ICS Gold Coast Adoptions will be hanging from noon - 2 pm with some beautiful Greyhounds in need of a home! View Event → Apr 19 Live Music - Hold A Grunge Saturday, April 19, 2025 4:00 PM 7:00 PM Google Calendar ICS View Event → Apr 13 Live Music - Sean DeLong Sunday, April 13, 2025 2:00 PM 5:00 PM Google Calendar ICS View Event → Apr 12 Raleigh Roo Foundation Saturday, April 12, 2025 2:30 PM 6:30 PM Google Calendar ICS Come support Raleigh Roo - a 501(c)(3) non-profit helping the families & rescue organizations of imperfectly perfect specially-abled animals - while enjoying a crisp cold beverage and a couple of vendors! View Event → Apr 11 Night Market & Live Music Friday, April 11, 2025 6:00 PM 10:00 PM Google Calendar ICS Come enjoy a plethora of local vendors and delectable food trucks while listening to local legend Sean DeLong. View Event → Apr 10 Bloodmobile Thursday, April 10, 2025 2:00 PM 5:00 PM Google Calendar ICS View Event → Apr 6 Live Music - Sean DeLong Sunday, April 6, 2025 2:00 PM 5:00 PM Google Calendar ICS North Side Tunes! View Event → Apr 5 Live Music - 8 Ball Aitken Saturday, April 5, 2025 7:30 PM 10:30 PM Google Calendar ICS 8 Ball Aitken has toured the world for more than a decade performing his swampy-blues-rock across twenty countries to date. He’s earned a loyal fanbase from his live shows and internet videos, while paying his dues as a singer, songwriter, slide-guitarist, and producer. 8 Ball moved to Nashville, Tennessee, USA in 2012 and worked for nine years with many of the best in the blues business today. He won second place in the 2021 International New Orleans Cigar Box Guitar Festival hosted by blues woman Samantha Fish. 8 Ball is back with a brand-new blues rock album ‘ICE CREAM MAN 2’ that hit #1 in the Australian Blues & Roots Charts in June 2023 and had 4 number #1 AMRAP Chart hits. This new 12-song recording was mostly completed in Nashville right before he re-located back to Australia. It’s a highly anticipated follow up to the first ‘ICE CREAM MAN’ album that also hit #1 on the Australian Blues & Roots Charts in March 2021. 8 Ball Aitken produced ‘ICE CREAM MAN 2’ himself. The cast of musicians include Grammy winning drummer Tom Hambridge (Buddy Guy), saxophone legend Buddy Leach (George Thorogood & The Destroyers), Sydney soul singer Taya Chani and 8 Ball’s younger brother Dillion James Aitken on Hammond organ and piano. 8 Ball’s partner Jessy Lynch also sang backup vocals. Jessy & 8 Ball welcomed their new baby boy ‘Sonny Miles Aitken’ into their musical family earlier this year. View Event → Apr 2 Blooms & Brews - Flower Arrangement Workshop Wednesday, April 2, 2025 6:30 PM 8:00 PM HoB Brewing Co. (map) Google Calendar ICS Join us for a fun and creative Spring Bouquet workshop. Immerse yourself in the beauty of fresh flowers while enjoying a delicious craft beer! Come relax, ground, and reconnect with nature this Spring. $45 - includes flowers and 1 drink View Event → Mar 23 Live Music - Sean DeLong Sunday, March 23, 2025 2:00 PM 5:00 PM Google Calendar ICS View Event → Must be 21 to be served Artists scheduled to appear are subject to change without notice"
    }
  ]
}