{
  "fuentes": [
    {
      "url": "https://hole19scratchkitchen.com/",
      "email": "yannick@hrsmgmt.org"
    },
    {
      "url": "https://proofva.com/contact",
      "email": "proof@villagiogroup.com"
    },
    {
      "url": "https://hole19scratchkitchen.com/miami-springs-miami-hole-19-scratch-kitchen-bar-about",
      "email": "yannick@hrsmgmt.org"
    },
    {
      "url": "https://hole19scratchkitchen.com/miami-springs-miami-hole-19-scratch-kitchen-bar-drink-menu",
      "email": "yannick@hrsmgmt.org"
    }
  ],
  "mails": [
    "proof@villagiogroup.com",
    "yannick@hrsmgmt.org"
  ],
  "nombre_sitio": "hole19scratchkitchen.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://hole19scratchkitchen.com/",
      "text": "Hole 19 - Scratch Kitchen + Bar - Miami, Miami Springs, FL × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! View our menu Parties & Groups - Host your next party or get together View our specials Parties & Groups - Host your next party or get together Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Book Table Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Skip to Main Content (305)-381-5594 yannick@hrsmgmt.org 650 Curtiss Parkway                                                          , Miami Springs RESERVE RESERVATIONS PRIVATE PARTIES MENU DRINKS SPECIALS EVENTS BANQUET HALL ORDER DIRECTLY FROM US UBEREATS GIFT CARDS JOIN OUR COMMUNITY JOBS Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page RESERVE MENU DRINKS SPECIALS EVENTS BANQUET HALL ORDER GIFT CARDS JOIN OUR COMMUNITY JOBS DIRECTLY FROM US UBEREATS RESERVATIONS PRIVATE PARTIES Flavorful Food Our Menu Memory You Won’t Forget Night Bands & Karaoke Events Promos & Specials See All Specials Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 slideshow start stop playing map marker pin 650 Curtiss Parkway, Miami Springs, FL 33166 About Us It's simple...fresh ingredients, delicious food, refreshing cocktails, and a damn good time. Read more about us Parties Welcome! We thank you for your interest in choosing our Banquet Hall for your event! Book a Party book now Reservations Book your table online. Click the button below. Book Now Order Online Your favorite food just a click away. Order online and enjoy. Order Ubereats Reviews review by - Yelp Jason A: This was our third time there and every time the food was phenomenal and tonight we met the owner and his son who is the manager of the bar. We sang karaoke, had a great dinner, and tried phenomenal new drinks they are introducing. Everyone was very fun and inclusive and you will have a wonderful experience in every way! review by - Yelp Christopher M: Love this place.  Simple but deliberately considered and freshly prepared cuisine. Very far above the average fare for 'bar food' which this place is in name and appearance only.  Familiar items that definitely are not served the way one might expect at a municipal golf course bar. 'Sports bars' could take notes on the value of really good food. review by - Yelp Romeo M: Great for Friday night-Saturday night sports bar/ live band music. You cannot help but have fun. The food is high quality,upscale bar food. My absolute favorite is the Mahi Reuben. I treat myself to one every chance I get. Laid back ambiance. Clean, lively, and mouthwatering. review by - Yelp Dan I: Not your typical golf course country club food. Actually very good food. It still has the feel that the golf course treats it as 2nd to the course. One bartender that doubles as a waitress for bar, dining room and outdoor seating.  This equals slow service. I would definitely go back, the onion rings are very good. review by - Yelp Oliver G: As a person that eats out a ton visiting hole 19 was such a refreshing take on sports bar food at a golf course. Not only for its amazing atmosphere such as the views and an intuitive way to watch the formidable amount of tv's but most importantly the food! The food absolutely blew me away with a farm to table style.. Stop reviews carousel Play reviews carousel Newsletter Location 650 Curtiss Parkway Miami Springs, FL 33166 Hours Mon, Tue 11:30 AM - 10:00 PM Wed, Thur 11:30 AM - 11:00 PM Fri 11:30 AM - 1:00 AM Sat 11:00 AM - 12:00 AM Sun 11:00 AM - 9:00 PM Find us on... Facebook page Instagram page Yelp page Contact us (305)-381-5594 yannick@hrsmgmt.org Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. Order Reserve Parties Catering Jobs × Newsletter We strive to make our website accessible to everybody. Learn More."
    },
    {
      "url": "https://proofva.com/contact",
      "text": "Contact Us | Proof Kitchen + Bar | Manassas, VA About About Proof Our Team Visit MurLarkey Careers Gift Cards Contact Us Menu Menu Lunch Dinner Brunch Kids Dessert MurLarkey Cocktails Happenings Private Dining Order Online Gift Cards Reserve Contact Us Get in touch with us – We’re here to help! Whether you have questions about our menu, events, or private dining, our team is ready to assist. Reach out today! Join us in Manassas Address: 9861 Discovery Blvd. Suite 115 Manassas, VA 20109 Phone: (703) 789-2655 Email: proof@villagiogroup.com Hours Monday - Thursday: 11:00 AM - 10:00 PM Friday: 11:00 AM - 11:00 PM Saturday: 10:00 AM - 11:00 PM Sunday: 10:00 AM - 9:00 PM Email us Fill out the form below and we'll get back to you as soon as we can. First Name: Last Name: Email: Phone: Message: What is the nature of your message? General Inquiry Private Event & Catering Employment Gift Cards Other Send Your Message! Visit Proof Kitchen + Bar 9861 Discovery Blvd. Suite 115 Manassas, VA 20109 (703) 789-2655 Hours Monday - Thursday: 11:00 AM - 10:00 PM Friday: 11:00 AM - 11:00 PM Saturday: 10:00 AM - 11:00 PM Sunday: 10:00 AM - 9:00 PM Quick Links Reservations Gift Cards Careers Private Dining & Catering Contact Subscribe to our email list Stay informed on all the latest news, events, and happenings at PROOF. Indulge in our other Villagio Hospitality Group Experiences: © 2025 Proof Kitchen + Bar. All rights reserved. Website Design & Development by Taps + Tables Give Us the Details! Your Contact Information First Name * Last Name * Email Address * Phone Number Ext. Company Your Event Details Nature of this Event (e.g., Birthday Party or Business Dinner) Event Date Start Time End Time Number of People (approx.) * Is there any additional information you would like to add? How did you hear about us? Select an option EventUp Instagram Facebook Venues by Tripleseat Search Engine Email Other Please specify Close Private Event Inquiry Please give us a little information about your event. We'll reach out to you to discuss the details within 2 business days. Email the Manager Please email the manager of the location at which you'd like to play: Close"
    },
    {
      "url": "https://hole19scratchkitchen.com/miami-springs-miami-hole-19-scratch-kitchen-bar-about",
      "text": "Hole 19 - Scratch Kitchen + Bar - About Skip to Main Content (305)-381-5594 yannick@hrsmgmt.org 650 Curtiss Parkway                                                          , Miami Springs RESERVE RESERVATIONS PRIVATE PARTIES MENU DRINKS SPECIALS EVENTS BANQUET HALL ORDER DIRECTLY FROM US UBEREATS GIFT CARDS JOIN OUR COMMUNITY JOBS Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page RESERVE MENU DRINKS SPECIALS EVENTS BANQUET HALL ORDER GIFT CARDS JOIN OUR COMMUNITY JOBS DIRECTLY FROM US UBEREATS RESERVATIONS PRIVATE PARTIES Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing About us Who we are & What we're about What is \"Hole 19\"? We at Hole 19 strive and prioritize executing and succeeding in giving you the best experience and service. Without reinventing the wheel, we let the ingredients shine and speak for themselves, while implementing the proper techniques.\n    We pride ourselves in having very little waste; using anything leftover to create something mouthwatering & flavorful!\n    We want to give you a memory you won’t forget, and make you want to come back to relive it!\n    As you continue on down, you’ll get to learn and understand our core team that has made what Hole 19 is today! Our Team Patrick Kemmache President Patrick has been on an extraordinary culinary journey spanning over 35 years, where he has traversed the globe, taking his incredible talent and passion for high-end cuisine to international gastronomy destinations all over Europe, Asia, Africa, North America, and South America.\n        Earning a degree from the storied “Le Cordon Bleu” Paris, France, Hole 19 President Patrick Kemmache provides us with an almost unlimited wealth of talent, experience, and knowledge about the intricate food and hospitality field.\n        With his vast experience and know-how, Mr. Kemmache specializes in taking struggling properties and transforming them into profitable and self-sustainable ventures. Yannick Kemmache General Manager Yannick combines his love of great-tasting, scratch kitchen food with his passion for business, here at Hole 19.\n        With over 11 years of tremendously successful experience in the very competitive and crowded hospitality field, Yannick Kemmache has earned a reputation as the go-to problem solver and solutions provider for multiple well-established restaurant companies in the highly demanding, international Miami-dade food scene.\n        Mr. Kemmache holds a Business Management degree with a minor in entrepreneurship from the Florida International University school of business. He has leveraged all that extraordinary knowledge and experience into a very successful career journey which has brought him here to Hole 19.\n        Yannick has the amazing ability to create systems that make a restaurant run like a fine-tuned machine. As a manager, he specializes in the concept of efficiency, enabling all parts of the organization to function as one cohesive unit.\n        As a leader and influencer, Yannick creates a positive working environment for his staff to enjoy coming to work, without forgetting the “whatever it takes” mentality. This creates a happy, positive, and loyal team atmosphere. Mark Grigsby Executive Chef Mark has the unmatched skill of creating systematic procedures and driving standards of execution that takes the kitchen performance and dining experience to the highest levels.\n        As a graduate of “Le Cordon Bleu” Miami, Florida, and an experienced chef with more than 15 years of multiple successes in well-established restaurants in the international culinary hub that is Miami-dade County, Executive Chef Mark Grigsby brings his extraordinary ability to create and bring to life custom menus of wonderfully diverse cooking styles and his passion for preparing American Fusion and seafood dishes that have wowed discriminating dining guests for well over a decade.\n        Hole 19 is extremely proud to have Executive Chef Mark Grigsby at the helm of our creative culinary team. His experience and passion for preparing the most decadent dishes make for an unforgettable dining experience. Contact us: by phone (305)-381-5594, by email yannick@hrsmgmt.org Order Reserve Parties Catering Jobs"
    },
    {
      "url": "https://hole19scratchkitchen.com/miami-springs-miami-hole-19-scratch-kitchen-bar-drink-menu",
      "text": "Hole 19 - Scratch Kitchen + Bar - Drink Menu Skip to Main Content (305)-381-5594 yannick@hrsmgmt.org 650 Curtiss Parkway                                                          , Miami Springs RESERVE RESERVATIONS PRIVATE PARTIES MENU DRINKS SPECIALS EVENTS BANQUET HALL ORDER DIRECTLY FROM US UBEREATS GIFT CARDS JOIN OUR COMMUNITY JOBS Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page RESERVE MENU DRINKS SPECIALS EVENTS BANQUET HALL ORDER GIFT CARDS JOIN OUR COMMUNITY JOBS DIRECTLY FROM US UBEREATS RESERVATIONS PRIVATE PARTIES Our Drinks Cocktails Coffee & Tea Beer Wine Craft Cocktails Green Tonic $13.00 Sapphire | St. Germain | Scratch Kiwi Puree | Lime | Tonic | Toasted Rosemary Old Timer $14.00 Jefferson's Bourbon | Cherry | Orange | Cane Sugar | Bitters Absolut-ly Coconuts $14.00 Absolut | Amaretto | Cream of Coconut | Pineapple Juice | Toasted Coconut The Perfect Smash $13.00 Jefferson's Bourbon | Amaretto | Cane Sugar | Scratch Sour | Mint | Lemon Refresher $13.00 Titos | Scratch Watermelon Puree | Sour | Mint Blackberry Sunset $15.00 Jefferson's Bourbon | Frangelico | Cane Sugar | Cherry | Blackberry | Lemon | Bitters Café Martini $16.00 Absolut | Kahlua | Bailey's | Lavazza Espresso | Sugar European Escape $15.00 Limoncello | Triple Sec | Honey | Aperol | Gin | Rosemary Choose YOUR Mule $13.00/ea Irish - Miami - Kentucky - Russian - Mexican - London La Fresca $15.00 Absolut | Watermelon | Mint | Lychee | Cranberry | Aperol Rain or Shine $15.00 Gin | Amaretto | Mezcal | Lavender | Blackberry | Lemon | Pineapple | Amaro Melon Negroni $14.00 Campari | Gin | Watermelon Puree | Orange Orange Mojito $14.00 Don Q Orange Rum | Bacardi | Cane Sugar | Orane | Mint Smokin' $14.00 Kahlua | 400 Conejos Mezcal | Frangelico | Walnut Bitters Spicy Watermelon Rita $16.00 Altos Plata | Triple Sec | Watermelon Puree | Scratch Sour | Jalapeño Vecchio $16.00 Woodford Reserve | Frangelico | Limoncello | Cane Sugar | Aromatic Bitters Coffee Café Martini $16.00 Vodka | Kahlua | Lavazza Espresso | Bailey’s Irish Coffee $13.00 Bailey’s | Jameson | Americano | Whipped Cream Cappuccino $4.00 Lavazza Espresso | Whole Milk | Cinnamon Espresso $3.00 Lavazza Our Beers Bottled Domestics $5.50 Budweiser | Bud Light | Coors Light | Miller Lite | Miller High Life |Yuengling Bottled IPA $8.25 Wynwood Laces All Draft Rotators $8.25 Light | Dark | IPA - Inquire for brews of the week Bottled Imports $6.50 Corona Extra | Corona Light | Heineken | Stella Artois | Guiness Extra Stout | Modelo Especial High Noon Seltzers $7.00 Pineapple | Black Cherry | Watermelon | Grapefruit From The Taps $5.50 $6.50 $8.25 Miller Lite | Yuengling | Stella Artois | IPA | Dark | Light Wine Selection Santa Margherita $13.00 $50.00 Pino Grigio | Alto Adige, Italy Benvolio $9.00 $34.00 Pinot Grigio | Friuli, Italy Silverado $13.00 $60.00 Sauvignon Blanc | Friuli, Italy Chateau Ste. Michelle $10.50 $40.00 Chardonnay | Colombia Valley, WA Benvolio $10.00 $42.00 Prosecco | Friuli, Italy Decoy $13.00 $50.00 Cabernet Sauvignon | Sonoma County, CA Josh Cellars $9.75 $38.00 Cabernet Sauvignon | Paso Robles, CA Decoy $13.00 $50.00 Merlot | Sonoma County, CA Vive $9.00 $34.00 Malbec | Argentina Murphy Goode $10.00 $38.00 Pinot Noir | Sonoma County, CA Rosé All Day $10.00 $38.00 Rosé | France Order Reserve Parties Catering Jobs"
    }
  ]
}