{
  "fuentes": [
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "bus@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "camravoucherscheme@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "caskmarque@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "disabledaccess@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "dogfriendly@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "eveningmeals@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "events@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "familyfriendly@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "functionroom@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "games@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "garden@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "livemusic@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "locale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "lunchtimemeals@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "memberdiscountscheme@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "newspapers@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "norealale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "realale@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "realfire@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "restaurant@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "smoking@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "sportstv@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "telephone@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "underground@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "wifi@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "camra@camra.org.uk"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "close_button@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "down_arrow_divider@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "logo-new-header@2x.png"
    },
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "email": "overlay_close_button@2x.png"
    },
    {
      "url": "https://foursquare.com/v/holloways-irish-pub/4b49677ef964a520376f26e3",
      "email": "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png"
    },
    {
      "url": "https://www.hollowayinsurance.co.uk/contact-us",
      "email": "info@hollowayinsurance.co.uk"
    },
    {
      "url": "https://hooleys.com/",
      "email": "erin@hooleys.com"
    },
    {
      "url": "https://hooleys.com/",
      "email": "katherine@hooleys.com"
    },
    {
      "url": "https://holloway.co.uk/member/contact-us/",
      "email": "memberservices@holloway.co.uk"
    },
    {
      "url": "https://www.royalholloway.ac.uk/about-us/more/local-community/royal-holloway-sport/contact-us/",
      "email": "sportscentre@royalholloway.ac.uk"
    }
  ],
  "mails": [
    "bus@2x.png",
    "camra@camra.org.uk",
    "camravoucherscheme@2x.png",
    "caskmarque@2x.png",
    "close_button@2x.png",
    "disabledaccess@2x.png",
    "dogfriendly@2x.png",
    "down_arrow_divider@2x.png",
    "erin@hooleys.com",
    "eveningmeals@2x.png",
    "events@2x.png",
    "familyfriendly@2x.png",
    "functionroom@2x.png",
    "games@2x.png",
    "garden@2x.png",
    "icon-go_foursquare8@2x-8104e4d03ad47b81f079c1f043220e75.png",
    "info@hollowayinsurance.co.uk",
    "katherine@hooleys.com",
    "livemusic@2x.png",
    "locale@2x.png",
    "logo-new-header@2x.png",
    "lunchtimemeals@2x.png",
    "memberdiscountscheme@2x.png",
    "memberservices@holloway.co.uk",
    "newspapers@2x.png",
    "norealale@2x.png",
    "overlay_close_button@2x.png",
    "realale@2x.png",
    "realfire@2x.png",
    "restaurant@2x.png",
    "smoking@2x.png",
    "sportscentre@royalholloway.ac.uk",
    "sportstv@2x.png",
    "telephone@2x.png",
    "underground@2x.png",
    "wifi@2x.png"
  ],
  "nombre_sitio": "hollowaysirishpub.me",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://whatpub.com/pubs/NLD/5876/mother-red-cap-upper-holloway",
      "text": "Mother Red Cap, Upper Holloway • whatpub.com WhatPub will be shut down from 1st October 2025. You don’t have to do anything,\n                but after this date whatpub.com will automatically redirect you to the CAMRA website. Try the new CAMRA website WhatPub will be shut down from 1st October 2025 We’ve brought all our data and pub-going tools together, so you can get the best of everything CAMRA has to offer in one convenient place. You don’t have to do anything, but after this date whatpub.com will automatically redirect you to the CAMRA website. Try the CAMRA website Prefer to stay on this page? No problem! Click here to remain on the current site. Join CAMRA | Member Login Home About Search FAQs Cookies Service Announcement Search > Mother Red Cap New Search About Location Submit Updates Nearby Recently Viewed (1) NOTICE :Opening hours and services may be different from those displayed here. Before visiting, we advise that you check ahead by phone or via social media to avoid disappointment. If you see any details here that need updating, please let us know by submitting updates on the pub . Mother Red Cap (formerly Red Cap) 665 Holloway Road Upper Holloway N19 5SE View on Map Real Ale is NOT Available (020) 7263 7082 Premises Status This\n                                                pub\n                        \n                        is\n\n                                                    long-term closed. Opening Times Regular Monday 9.00 am - Midnight Tuesday 9.00 am - Midnight Wednesday 9.00 am - Midnight Thursday 9.00 am - 1.00 am Friday 9.00 am - 2.00 am Saturday 9.00 am - 2.00 am Sunday 9.00 am - Midnight Operator Phelan Inns About\n                         the Pub Noted as closed after St Patrick’s Day on 18th March 2024 (on Facebook). Landlord retired. Future uncertain. A traditional irish pub with some nice tiling in the vestibule. Historic Interest Local Listing:- Dual granite frontage. Holloway Road: Two stallrisers, five pilasters, two clear glass windows, one timber panelled/smoked glass double door, clear glass fanlight and extract. Regular ales No beers listed Add regular beers Add changing beers Updated on 27/03/2024 Last surveyed on 27/03/2024 Branch responsible is North London Seen some incorrect or missing details? Send an email to the CAMRA branch with your updates. Email this pub to a friend Facilities Traditional Pub Games Pool & darts. Live Music Sports TV TNT. View on Larger Map Mother Red Cap 665 Holloway Road Upper Holloway N19 5SE Sat Nav Reference 51.56482, -0.13325 Transport Close to Bus Routes Close to London Underground / Overground / DLR Nearby Bus Routes (< ½ mile) Closest\n                                                        Station (1750m) Kentish Town Nearby London Underground/Overground/DLR (150m) Archway Submit Pub Updates to CAMRA We welcome the help of all users to contribute to this important campaigning project. Please use the form below to submit feedback or updates directly to the  CAMRA branch for consideration. Please note that any changes mentioned WILL NOT have an immediate effect on whatpub.com but will instead be emailed directly to the  CAMRA branch Pubs Officer for consideration. If you provide your name and/or email address this information will also be visible to the Pubs Officer, who may use this information to follow up your feedback. IF YOU WISH TO CONTACT THE PUB DIRECT, PLEASE DO NOT USE THIS FORM. Logged in CAMRA members do not need to enter their name, email or pass the captcha. Go to Login page Your Name:* Your Email Address:* Message:* Send to CAMRA Results are based on your filters selected. View or change them on the search page here St John's Tavern 0.2 miles (0.3km) 91 Junction Road Upper Holloway London N19 5QU Pub Features Whittington Stone 0.2 miles (0.3km) 53 Highgate Hill Upper Holloway N19 5NE Pub Features Oak & Pastor 0.2 miles (0.3km) 86 Junction Road Upper Holloway London N19 5QZ Pub Features Charlotte Despard 0.3 miles (0.5km) 17-19 Archway Road Upper Holloway London N19 3TX Pub Features Landseer Arms 0.4 miles (0.7km) 37 Landseer Road Upper Holloway London N19 4JU Pub Features Brendan the Navigator 0.5 miles (0.7km) 90 Highgate Hill Highgate N19 5NQ Pub Features See all pubs Closed Mother Red Cap 665 Holloway Road Upper Holloway LONDON N19 5SE Pub Features Submit Beer Scores The National Beer Scoring System has been upgraded and is now fully integrated with whatpub.com, making finding a pub and scoring your beers much easier. Beer scoring is only available to CAMRA members. To start scoring please login below or join CAMRA on the national website. Join CAMRA | Member Login Campaign for your local We campaign on a number of issues to help keep pubs open and pints affordable. If you love beer and pubs, get involved today! Find out more Nearby Pubs See All St John's Tavern London Read More Whittington Stone Upper Holloway Read More Oak & Pastor London Read More Charlotte Despard London Read More Landseer Arms London Read More Brendan the Navigator Highgate Read More Features Real Ale Available Real Fire Garden Lunchtime Meals Evening Meals Traditional Pub Games Smoking Area Restaurant Area Live Music Newspapers Wifi Events Close to London Underground / Overground / DLR Close to Bus Routes Features Real Ale Available Cask Marque Accredited Family Friendly Garden Lunchtime Meals Evening Meals Traditional Pub Games Smoking Area Live Music Sports TV Wifi Close to London Underground / Overground / DLR Close to Bus Routes CAMRA Voucher Scheme Features Real Ale Available Real Fire Garden Lunchtime Meals Evening Meals Smoking Area Function Room Live Music Sports TV Wifi Events Close to London Underground / Overground / DLR Features Real Ale Available Evening Meals Traditional Pub Games Live Music Newspapers Wifi LocAle Accredited Events Close to London Underground / Overground / DLR Close to Bus Routes Features Real Ale Available Real Fire Family Friendly Garden Lunchtime Meals Evening Meals Disabled Access Traditional Pub Games Smoking Area Restaurant Area Dog Friendly Live Music Wifi LocAle Accredited Member Discount Scheme Close to London Underground / Overground / DLR Close to Bus Routes Features Real Ale Available Garden Lunchtime Meals Evening Meals Live Music Close to London Underground / Overground / DLR Close to Bus Routes Features Home | About | Search | FAQs | Cookies | Service Announcement | Join CAMRA Campaign for Real Ale, 230 Hatfield Road, St Albans, Hertfordshire, AL1 4LW ( Map ) www.camra.org.uk | Email: camra@camra.org.uk | Tel: 01727 867201 | Fax: 01727 867670 This Web site is produced by the Campaign for Real Ale (CAMRA). All pages, their contents and related items are provided \"as is\". Thus no liability, consequential or otherwise, arising from them is accepted. Where not already belonging or assigned to others, all material remains our copyright."
    },
    {
      "url": "https://foursquare.com/v/holloways-irish-pub/4b49677ef964a520376f26e3",
      "text": "Log in Foursquare City Guide Sign Up Nearby: Get inspired: Top Picks Trending Food Coffee Nightlife Fun Shopping Log in to Foursquare Email or Phone Number: Password: (Forgot password?) Sign up for Foursquare Log in with Facebook You must enable JavaScript to use foursquare.com We use the latest and greatest technology available to provide the best possible web experience. Please enable JavaScript in your browser settings to continue. Download Foursquare for your smart phone and start exploring the world around you!"
    },
    {
      "url": "https://www.hollowayinsurance.co.uk/contact-us",
      "text": "Contact | Holloway Insurance Services 01460 206588 [email protected] START A QUOTE Menu Home About Us Meet The Team Testimonials Sectors Care Food & Drink Hospitality Landlords Manufacturing & Engineering Professional Services Retail Trades Services Contractors Insurance Business Insurance Cyber Insurance Directors And Officers Insurance Employee Benefits Business Motor Insurance Professional Indemnity Property Owners Insurance Risk Management Our Blog Case Studies Contact Request a callback Get In Touch 01460 206588 [email protected] Whether you are an existing customer or not we are happy to offer our expertise to you, please feel free to drop us a line or pick up the phone and see how we can help. If you are an existing customer and need to make a claim please call or email our dedicated claims team on [email protected] Please correct the errors and try again. Details Name : * Your Telephone Number : * Email Address : * Services Interested In : -- Please Select -- Property Owner Insurance Business Insurance Business Motor/Fleet Insurance Contractors Insurance Cyber Insurance Professional Indemnity Insurance Risk Management Employee Benefits Directors and Officers Insurance High Net Worth * Message Details : * Verification Enter the code shown : Submit About Us Registered Address 1 Church Terrace Yeovil, Somerset, BA20 1HX Sectors Care Food & Drink Hospitality Landlords Manufacturing & Engineering Professional & Financial Services Retail Trades Let Us Help Privacy Statement Contact Us Our Case Studies Our Blog Posts About Us Contact Us Call Us On: 01460 206588 Email Us At: [email protected] Registered in England & Wales No 11295159 Registered Office: 1 Church Terrace, Yeovil, Somerset, BA20 1HX. Holloway Insurances Services is an Appointed Representative of Momentum Broker Solutions Limited, which is authorised and regulated by the Financial Conduct Authority. You may check this on the Financial Services Register by visiting the FCA website, www.fca.gov.uk/register/ or by contacting the FCA on 0800 111 6768. The views expressed herein are not necessarily those of Holloway Insurance Services Ltd, Momentum Broker Solutions Limited or its affiliates or subsidiaries. © 2025 Holloway Insurance Services Ltd | Website by Kontrolit"
    },
    {
      "url": "https://hooleys.com/",
      "text": "Hooleys Public House - Rancho San Diego - San Diego, CA × Order your favorite Hooleys dishes for Delivery! Or call in and pick them up for Takeout! Visit our Order Now page, and get Hooleys delivered straight to your door! Or call the Pub and order from one of our Hooligans directly! Order Online Parties & Groups - Host your next Party or Holiday Gathering at Hooleys! Contact us now! Book your party here! Parties & Groups - Host your next Party or Holiday Gathering at Hooleys! Contact us now! Job Listings - Want to work with us Hooligans! Apply online now! Click the Link to be directed to our Hiring Page! Hooleys Hiring Page! Job Listings - Want to work with us Hooligans! Apply online now! Click the Link to be directed to our Hiring Page! Skip to Main Content katherine@hooleys.com 2955 Jamacha Road - El Cajon                                                          , San Diego MENU DRINKS Drinks - Rancho Drinks - La Mesa SPECIALS EVENTS Events - Rancho Events - La Mesa ORDER PICKUP OR DELIVERY PARTIES Parties - Rancho Parties - La Mesa Parties - Banquet Menu JOBS Twitter page Facebook page Instagram page Yelp page Toggle navigation Twitter page Facebook page Instagram page Yelp page MENU DRINKS SPECIALS EVENTS ORDER PICKUP OR DELIVERY PARTIES JOBS Drinks - Rancho Drinks - La Mesa Events - Rancho Events - La Mesa Parties - Rancho Parties - La Mesa Parties - Banquet Menu map marker pin 5500 Grossmont Center Dr - La Mesa, CA 91942 map marker pin 2955 Jamacha Road - El Cajon, CA 92019 About us About us Hooley [.poss Hidust. Hoolie - a hindu festival, brought back by Irish soldiers]. In the mid-1980s while touring Europe, Craig MacDonald, owner and founder of Hooleys, made his first visit to Ireland. So taken was he by the Pub Culture of the Emerald Isle he decided there and then that he would one day import the warmth and charm of an old Irish Pub to his hometown in San Diego, California. With the help of two great friends (now partners), Craig realized his dream, and on Saint Patrick's Day of 1999, the doors to Hooleys Irish Pub & Grill first opened in Rancho San Diego. Our menu Restaurant menu Specials Do you love Wing, Wine & Whiskey Wednesday as much as we do?! Enjoy 4 for $3 Wings, 1/2 OFF Wine Bottles and 1/2 OFF all of our Whiskeys! BOTH PUBS OPEN @ 11AM! Wednesday Specials are for Dine-In only. 11:00 AM - 10:00 PM ALL SPECIALS Events Check out our upcoming events Events rancho Events La Mesa Order Pickup or Delivery Order Pickup or Delivery Birthday Club Find out more and join our club here join our club ! Reviews review by - Yelp Chris C: ...Last weekend, the wifey and I had dinner and drinks at the Rancho San Diego location.  Service was excellent...drinks were excellent...food was excellent!  I wasn't too hungry so I ordered something that I would not normally order.  I had the turkey melt with fries. Like I said, I normally would not have ordered that, but after devouring the turkey melt, I will say...I will probably order it again in the future... review by - Yelp Lily A: I always have a great time at Hooleys, I would definitely recommend going for Taco Tuesday and taking advantage of their tacos and for a good price. The mood is soft and lively and the servers are excellent. I would recommend all tacos, but one in particular is the corned beef, was just amazing... review by - Yelp Siavash H: Just love this Cousy , clean bar and restaurant. You feel relaxed and well taken care of by the staff. I love their Alpine beer and fish tacos. My daughter when she visited totally loved the Irish stew. Very very busy on Friday nights. review by - Yelp Antonio Q: Hi I'm Autumn, the 7 month old daughter of Antonio.  I love this place, so does my mom and dad!  I went for the first time on Monday.  My mom got the half prime rib sandwich and soup.  And she was angry she didn't get the whole sandwich and bowl of soup instead because it was so good... review by - Yelp Mary B: This place is amazing! We always come here, often when they are busy. They always provide excellent service. The food comes out quick.. And always fresh. This is easily one of our favorite date spots. The bar area has cute little cut out booths with dimmed lighting. We love it. review by - Yelp Anne E: We've been coming to Hooley's for years and we are never disappointed. The staff is friendly, service is fast, but not rushed and the food is always delicious. I usually get the corned beef tacos, but I branched out tonight and tried a few new dishes. Every last one was amazing! Still crazy about Hooley's after all these years. :-) Newsletter Location Rancho San Diego: 2955 Jamacha Road El Cajon, CA 92019 Information: 619-670-PINT (7468) La Mesa/Grossmont Center: 5500 Grossmont Center Dr. La Mesa, CA 91942 Information: 619-713-6900 Hours Rancho San Diego: Tuesday-Thursday 11:00AM-10:00PM Friday 11:00AM-11:00PM Saturday 10:00AM-11:00PM Sunday 10:00AM-8:00PM La Mesa/Grossmont Center: Monday 4:00PM-9:00PM Tuesday-Thursday 11:00AM-10:00PM Friday 11:00AM-11:00PM Saturday 10:00AM-11:00PM Sunday 10:00AM-8:00PM Find us on... Twitter page Facebook page Instagram page Yelp page Contact us Rancho San Diego: Katherine Buckles katherine@hooleys.com La Mesa/Grossmont Center: Erin Turner erin@hooleys.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. Order Call Rancho Call La Mesa Jobs × Newsletter We strive to make our website accessible to everybody. Learn More."
    },
    {
      "url": "https://holloway.co.uk/member/contact-us/",
      "text": "Holloway Friendly | Contact Us Members My Sick Pay Update your details Make a claim GP consultations Extra help Testimonials Make a complaint About us & jobs How we're run & Reports Rate us on Trustpilot AGM Advisers Adviser Hub My Sick Pay Content & learning Underwriting Claims GP consultations Medical second opinion Business Development Team Suitability letter builder Testimonials About us & jobs How we're run & Reports Rate us on Trustpilot Login Contact Us Login Contact Us Contact us We’re here to help you, 9am – 5pm, Monday – Friday. 0800 0931 535 [email protected] Holloway House, 71 Eastgate Street, Gloucester, GL1 1PW Follow our fa-youtube page Follow our fa-linkedin page Holloway Friendly is the trading name of The Original Holloway Friendly Society Ltd. Holloway Friendly is registered and incorporated under the Friendly Societies Act 1992, registered No. 145F. Registered office: Holloway Friendly, Holloway House, 71 Eastgate Street, Gloucester, GL1 1PW. Authorised by the Prudential Regulation Authority and regulated by the Financial Conduct Authority and the  Prudential Regulation Authority. FRN 109986. © 2025 Holloway Friendly Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.royalholloway.ac.uk/about-us/more/local-community/royal-holloway-sport/contact-us/",
      "text": "Contact us Skip to main content Menu Toggle Royal Holloway University of London Studying Here Student Life Research & Education About us Search Royal Holloway Site search Studying Here Find your course Applying Fees and funding International students Undergraduate prospectus Postgraduate prospectus Your future career Central London campus For parents and supporters Schools and colleges Sign up for more information Student Life Overview Accommodation Visit Royal Holloway Our campus Being a student Chat with our students Support and wellbeing Virtual experience Research & Education Overview Departments and schools Research Education Collaborate with us Access our facilities Technicians About us Overview Contact us Events The library Our history Art Collections and Archives Equality, Diversity and Inclusion Our alumni Recruiting our students Environmental Sustainability Global Engagement and Partnerships University of Sanctuary More Overview Media Jobs Facts and figures Senior Leadership Team and governance Our strategy Online shops How to find us Financial information Local community Legal Advice Centre Student intranet Staff intranet In this section Find your course Applying Fees and funding International students Undergraduate prospectus Postgraduate prospectus Your future career Central London campus For parents and supporters Schools and colleges Sign up for more information Open Days Prospectuses and brochures Foundation Year In this section Student life Accommodation Visit Royal Holloway Our campus Being a student Chat with our students Support and wellbeing Virtual experience The Students' Union Sport The local area In this section Research and education Departments and schools Research Education Collaborate with us Access our facilities Technicians Research impact Research culture Research integrity In this section About us Contact us Events The library Our history Art Collections and Archives Equality, Diversity and Inclusion Our alumni Recruiting our students Environmental Sustainability Global Engagement and Partnerships University of Sanctuary More Media Jobs Facts and figures Senior Leadership Team and governance Our strategy Online shops How to find us Financial information Local community Legal Advice Centre Student intranet Staff intranet Contact us Contact us About us More Local community Royal Holloway Sport Contact us Opening Hours Our opening hours are as follows: Out of term time Monday to Friday | 7am - 9pm Saturdays | 9am - 4pm Sundays | 10am - 4pm Term time Monday to Friday | 7am - 10pm Saturdays | 9am - 6pm Sundays | 9.30am -10pm Click here to see the University's term dates . How to find us The Sports Centre is located off Prune Hill at the bottom of the University's Egham campus behind Gowar and Runnymede Halls. It is accessible by foot, bicycle and vehicle. Click here to see campus maps . Address Royal Holloway Sports Centre Prune Hill Egham Surrey TW20 0EX Travelling by car Royal Holloway is located just two miles from junction 13 of the M25. Exit at junction 13 and join the A30 towards Egham. Continue straight across the first roundabout and follow signs for the University. Pass the University’s entrance on your left and continue. At the crossroads, turn left onto Bakeham Lane and then take the first left onto Prune Hill. Continue down Prune Hill until you reach the entrance to the Sports Centre car park on your left. For sat navs Use postcode TW20 9TR when setting your destination. Car parking There are 61 parking spaces at the front of the Sports Centre with 5 of these reserved for blue badge users. There is also a further gravel car park at the far end of the centre, with the capacity for another 40 cars. Visitors to the Sports Centre not in possession of a parking permit may park in the Sports Centre car park for up to three hours for free, after which they should register their car at the Sports Centre reception. Travelling by train The nearest train station is Egham, which is located less than one mile away, with regular trains to and from London Waterloo station. From here, you can get a bus or taxi to the University campus. If travelling by foot or bicycle, there is step-free access to the back gate of the University campus (from Spring Rise), where our Sports Centre is located. Travelling by bus A number of bus routes pass through Egham High Street and Egham Hill, which then require a short walk onto campus. There is also a bus stop in front of the entrance to the University, along the A30. Contact Us For any enquiries and feedback connected with the Sports Centre and Royal Holloway Sport, the Active Lifestyle & Sport team would be more than happy to help. Give us a call on +44 (0)1784 443892. Email us sportscentre@royalholloway.ac.uk Pop into the Sports Centre and speak to one of the team at reception. You can also reach us on our Royal Holloway Sport social media channels. Instagram | Facebook Block Booking enquiry form Membership cancellation form Feedback form Explore Royal Holloway Student life Research and education About us Your future career We'll help you boost your employability with one-to-one support, interview practice, employer events and more. 1.0.0.19 1.0.0.19 Clubs and societies There are lots of exciting ways to get involved at Royal Holloway. Discover new interests and enjoy existing ones. 1.0.0.19 1.0.0.19 1.0.0.19 Accommodation Heading to university is exciting. Finding the right place to live will get you off to a good start. 1.0.0.19 1.0.0.19 1.0.0.19 1.0.0.19 Support and wellbeing Whether you need support with your health or practical advice on budgeting or finding part-time work, we can help. 1.0.0.19 1.0.0.19 1.0.0.19 Departments and schools Discover more about our academic departments and schools. 1.0.0.19 1.0.0.19 1.0.0.19 Research Excellence Framework Find out why Royal Holloway is in the top 25% of UK universities for research rated ‘world-leading’ or ‘internationally excellent’. 1.0.0.19 1.0.0.19 Inclusive learning and education We believe our students are entitled to a world-class learning experience that helps them to thrive and respects diversity. Research institutes and centres Discover world-class research at Royal Holloway. 1.0.0.19 1.0.0.19 1.0.0.19 Royal Holloway today Discover more about who we are today, and our vision for the future. 1.0.0.19 1.0.0.19 1.0.0.19 Our history Royal Holloway began as two pioneering colleges for the education of women in the 19th century, and their spirit lives on today. 1.0.0.19 1.0.0.19 Our alumni We’ve played a role in thousands of careers, some of them particularly remarkable. 1.0.0.19 1.0.0.19 Senior Leadership Team and governance Find about our decision-making processes and the people who lead and manage Royal Holloway today. 1.0.0.19 1.0.0.19 Groundbreaking from the beginning. Essential now. Call us on +44 (0)1784 434 455 Contact us Visit Royal Holloway, University of London Egham, Surrey TW20 0EX Come to an open day Find the right course Donate Apply for a job Applicant Portal Online shop Alumni Conferences and events For parents and supporters For schools and colleges For business For international agents Local community Media enquiries Privacy & cookies Disclaimer Terms & conditions Accessibility Modern slavery twitter facebook snapchat tiktok youtube LinkedIn instagram unichat"
    }
  ]
}