{
  "fuentes": [
    {
      "url": "https://www.homesteadview.co.uk/get-in-touch/",
      "email": "info@southwestrugby.co.uk"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/battle-of-the-bands-rocktoberfest",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/battle-of-the-bands-rocktoberfest",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.metroparks.net/parks-and-trails/homestead/",
      "email": "hst-parkmap@2x.gif"
    },
    {
      "url": "https://www.metroparks.net/parks-and-trails/homestead/",
      "email": "hst-parkmap@2x.pdf"
    },
    {
      "url": "https://www.metroparks.net/parks-and-trails/homestead/",
      "email": "info@metroparks.net"
    },
    {
      "url": "https://www.metroparks.net/parks-and-trails/homestead/",
      "email": "reservations@metroparks.net"
    },
    {
      "url": "https://www.homesteadparks.com/staff",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/staff",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.jrht.org.uk/location/homestead-park",
      "email": "homestead.park@jrf.org.uk"
    },
    {
      "url": "https://www.homesteadparks.com/wmhs-volleyball",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/wmhs-volleyball",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://homesteadbuilt.com/about-us/",
      "email": "ryanbohr@homesteadbuilt.com"
    },
    {
      "url": "https://www.homesteadcapital.com/team",
      "email": "info@homesteadcapital.com"
    },
    {
      "url": "https://www.partyslate.com/venues/homestead-park",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/florida-gator-game-day-pass-1",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/florida-gator-game-day-pass-1",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.humblehearthomestead.com/contact-us",
      "email": "info@humblehearthomestead.com"
    },
    {
      "url": "https://www.homesteadparks.com/what-to-do",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/what-to-do",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.homesteadvillage.org/leadership-and-governance/",
      "email": "info@hvillage.org"
    },
    {
      "url": "https://www.homestead.ca/contact",
      "email": "media@homestead.ca"
    },
    {
      "url": "https://www.homestead.ca/contact",
      "email": "splash@2x.png"
    },
    {
      "url": "https://www.homesteadparks.com/private-events",
      "email": "heidi@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.homesteadparks.com/private-events",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/private-events",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.homesteadparks.com/private-events",
      "email": "sami@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/line-dancing-competition",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/line-dancing-competition",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.nps.gov/home/contacts.htm",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://www.homesteadlake.co.uk/get-in-touch/",
      "email": "lakepark@homesteadcaravans.co.uk"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/cliff-dorsey",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/cliff-dorsey",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.homesteadtinyhomes.com/contact",
      "email": "chase@homesteadtinyhouse.com"
    },
    {
      "url": "https://homesteadpark.com/about-us/",
      "email": "camping@homesteadpark.com"
    },
    {
      "url": "https://homesteadpark.com/about-us/",
      "email": "info@homesteadpark.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/homesteads-2nd-annual-fall-festival",
      "email": "info@homesteadparks.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/homesteads-2nd-annual-fall-festival",
      "email": "info@homesteadtinyenterprises.com"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/homesteads-2nd-annual-fall-festival",
      "email": "stephanie@homesteadtinyenterprises.com"
    }
  ],
  "mails": [
    "app-promo-phones@2x.png",
    "camping@homesteadpark.com",
    "chase@homesteadtinyhouse.com",
    "contact@partyslate.com",
    "heidi@homesteadtinyenterprises.com",
    "homestead.park@jrf.org.uk",
    "hst-parkmap@2x.gif",
    "hst-parkmap@2x.pdf",
    "info@homesteadcapital.com",
    "info@homesteadpark.com",
    "info@homesteadparks.com",
    "info@homesteadtinyenterprises.com",
    "info@humblehearthomestead.com",
    "info@hvillage.org",
    "info@metroparks.net",
    "info@southwestrugby.co.uk",
    "lakepark@homesteadcaravans.co.uk",
    "media@homestead.ca",
    "reservations@metroparks.net",
    "ryanbohr@homesteadbuilt.com",
    "sami@homesteadtinyenterprises.com",
    "splash@2x.png",
    "stephanie@homesteadtinyenterprises.com"
  ],
  "nombre_sitio": "homesteadparks.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.homesteadview.co.uk/get-in-touch/",
      "text": "Contact the team on Homestead View - Homestead View Skip to page content Return to homepage Open Mobile Navigation Close Mobile Navigation Navigation Home About Applications Engagement Partners News FAQs Get in touch Have your say Have your say Stay Informed Get in touch If you would like to receive more information about plans for Homestead Link or if you have queries about the plans, please get in touch! Email Contact the team by emailing info@southwestrugby.co.uk (This inbox is managed by the Homes England project team, we will endeavour to respond within 20 working days) Media enquiries should be sent to lisa@pillorybarn.co.uk . Feedback Please use the contact from provided. Please see our Privacy Policy to find out how we use your data. We value accessibility if you have any questions please contact our team. Your name* Your email* Your message By completing this form you are consenting for Homestead View to use your personal data to contact you to respond to your query. Submit Stay informed For the latest news on the project, sign up to our newsletter. Email address Sign up Share your views As we deliver our plans for Homestead View, we want to ensure that we continue to engage with local people and are aware of their views and any issues raised. Get in touch Return to homepage Return to homepage    Copyright © 2025. Homestead View.  All rights reserved. Website by Pillory Barn Privacy Notice Cookies Sitemap Accessibility"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/battle-of-the-bands-rocktoberfest",
      "text": "Battle of the Bands Rocktoberfest top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members Battle of the Bands Rocktoberfest Sat, Oct 12 | Homestead Park Premier Events presents Rocktoberfest Battle of the Bands at Homestead Park! Join us for a ROCKING event. From 11am to 7pm, bands will battle it out to see who takes home the $1000 prize. Admission and parking are free! See below for more details. Time & Location Oct 12, 2024, 11:00 AM – 7:00 PM Homestead Park, 1050 NE 6th Blvd, Williston, FL 32696, USA About the event 🎸Calling All Bands! 🎸\n\nGet ready to rock the stage at the North Central Florida Rocktoberfest on Saturday, October 12, at Homestead Park in Williston! Think you have what it takes to outshine the competition and claim the title? 🌟\n\n🏆Grand Prize: $1000! 🏆\n\nBring your A-game and show us what you’ve got! For rules and registration, email Premier Events NCF at or call 954-854-2364, 941-586-7258. Don’t miss your chance to be part of the biggest Battle of the Bands in the area.\n\nLet’s make this Rocktoberfest unforgettable! premiereventsncf@gmail.com Show More Share this event © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://www.metroparks.net/parks-and-trails/homestead/",
      "text": "Homestead - Metro Parks - Central Ohio Park System DISMISS Choose your language: #facebook #twitter #instagram #youtube #blog Parks & Trails MAPS & DIRECTIONS Parks Overviews & Directions Individual Park Maps View Mobile Parks App ADA Accessible Trails GREENWAY TRAILS Overview & Maps Northwest Glacier Ridge Heritage Trail Highbanks Homestead Northeast Blendon Woods Inniswood Rocky Fork Sharon Woods Central Quarry Trails Scioto Audubon Southwest Battelle Darby Creek Prairie Oaks Scioto Grove Southeast Blacklick Woods Blacklick Woods Golf Course Chestnut Ridge Clear Creek Pickerington Ponds Slate Run Park Slate Run Living Historical Farm Three Creeks Walnut Woods About Us General Information Board Meetings Careers Contract Bidding Finance Resource Management Park Projects The Plan Rules & Regulations Surplus Equipment Wander & Wonder: Photo Gallery Policy Page Get Involved Friends of Metro Parks Guide to Giving Volunteer Stay Informed The Metro Parks Blog Newsletter Signup FAQs Contact Us Reservations Reservations Make a Reservation Reservation Info Programs Program Search Special Events Summer Camps Farm School Tours Outdoor Adventure Scout Programs Hikes Homeschoolers Preschool Seniors Plan Your Visit Interests & Activities All Activities Biking Educators Events Family & Kids Fishing Fitness & Recreation Geocaching at Metro Parks Nature New Visitors Outdoor Adventure Pets Play Areas Seniors Wildlife Winter Hikes Programs Program Search Farm School Tours Field Trips Homeschoolers Scioto Fest 2025 Scout Programs Summer Camps Tram 2025 FAQs Homestead Photo Sarah Hunter Hours and Info April 1-September 30: 6:30am-10pm October 1-March 31: 6:30am-8pm Phone: 614-216-8859 Nature Center: 614-971-5211 Reservations: reservations@metroparks.net Programs at Homestead About This 43-acre park offers a quiet, country atmosphere with a covered bridge, train station replica and two barns. Other features include shelters, a 2.5-acre fishing pond, play equipment, and courts for sand volleyball and basketball. A three-quarter mile paved trail, great for hiking, biking, running, or walking your leashed pet, winds through the park and connects to the 6.1-mile Heritage Rail Trail. Directions Park Map Trails Shelters & Lodges Programs Activities Photo: Dianne Clay Map & Directions 4675 Cosgray Road, Hilliard OH 43026 Photo: Mike Heisey Park Map Click the map below for a zoomed/enlarged version Click Here for a Printable Map Trails Multiuse Trail 0.8 miles Easy – Hike, Bike, Inline skate, Pets – Paved – ADA Encircles the main activities area and connects to the 6.1-mile Heritage Trail. Photo: Bryan Knowles Shelters Reservable Shelters Lakeside Pavilion This is an open air shelter with two walls and is located at the north end of the park. It is immediately adjacent to the south edge of Homestead Lake. There are 16 fiberglass 6-foot picnic tables inside of the pavilion. It has two fireplaces and wood is provided upon request. Full-view overhead garage doors can be pulled down to enclose the shelter (staff must open or close the doors). There are electrical outlets, overhead lighting, two large grills, a balcony overlooking the pond, a drinking fountain (seasonal), and a playground nearby. The nearest restrooms are on the north side of the Barn Shelter, approximately 500 feet southeast. Parking spaces are also used by general visitors and are not guaranteed. Available for all day and half-day reservations. Click here for more information, photos or to reserve. Non-Reservable Shelters Pine Pavilion This is an open air shelter with one wall located in the center of the park. The closest restroom is next to the Park Office, approximately 350 feet to the east. There are two 2-plug electrical outlets, six 6-foot tables, one charcoal grill, fireplace, nearby drinking fountain (seasonal), and nearby shared basketball courts. Parking lot 3 is the closest, with a capacity of 36 and two handicap parking spaces. These spaces are also used by general visitors and are not guaranteed. Available on a first-come, first-served basis. Activities Photo: Sarah Hunter Fishing Photo: Cheryl Alfrey Visitors can fish on the 2.5-acre pond. Pets PET TRAILS Multiuse Loop Trail: 0.75 miles Domesticated dogs and cats are also permitted in picnic areas, parking lots and on roadways. Pets shall be on a leash no longer than 6 feet. More for Pets Picnicking Photo: Leslie Dybiec In addition to reservable areas, there are numerous picnic areas with grills available on a first-come first-serve basis. Two of these picnic areas are covered, the gazebo by the lake and the rail platform in the south end of the park. There are six more picnic areas with tables and grills, and two additional areas with tables only. Play Areas Photo: Susan Boggs The park features two play areas, plus basketball and sand volleyball courts. Get Outside, It’s Your Nature! MAPS & DIRECTIONS LET'S KEEP IN TOUCH. Sign up for our Newsletter Park Info Park Overviews Directions Reservations FAQs About Friends of Metro Parks Guide to Giving Newsletter Signup Contact Us Accessibility Policy Rules & Regulations Policy Page Plan Your Visit Park Activities Program Search Family & Kids Fitness & Recreation Pets Seniors Educators Columbus and Franklin County Metro Parks 1069 West Main Street Westerville, OH 43081 Questions? Contact us at info@metroparks.net #facebook #twitter #instagram #youtube #blog © Copyright 2025 Columbus Metro Parks Site Crafted by Robintek: Columbus Website Design"
    },
    {
      "url": "https://www.homesteadparks.com/staff",
      "text": "Staff | Homestead Park top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members MEET THE TEAM Matt Crandell CHIEF OPERATIONS OFFICER Sami Crandell GENERAL MANAGER Stephanie Smith RETAIL MANAGER Chuck Perrigoy SECURITY & MAINTENANCE MANAGER © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://www.jrht.org.uk/location/homestead-park",
      "text": "Homestead Park Skip to main content Skip to main content Menu Find a home Back Find a home Homes for sale Rent a home from JRHT Shared and leasehold schemes Swap a home Find a home Homes for sale Rent a home from JRHT Shared and leasehold schemes Swap a home Find care News and updates About us Back About us What we do Our heritage Our board Our people Get involved Careers at JRHT Providing new affordable homes Corporate information Performance information Equity, diversity and inclusion About us What we do Our heritage Our board Our people Get involved Careers at JRHT Providing new affordable homes Corporate information Performance information Equity, diversity and inclusion My JRHT Contact us Search Home Locations and communities Homestead Park Back to Home Search (required) (optional) Search Homestead Park Frontify Asset Url Homestead Park is a beautiful 14-acre garden in Clifton, York. It is owned, managed and maintained by our parent organisation the Joseph Rowntree Foundation for visitors to enjoy. Frontify Asset Url About Homestead Park Location Homestead Park is located 1.5 miles west of York City Centre at 40 Water End, Clifton, York YO30 6WP. There is pedestrian access from Water End and Shipton Road. Vehicular access is via Shipton Road only (use postcode YO30 5RE for satnavs). There are cycle racks at both entrances to the Park. We can also be accessed by a number of bus routes, including the Rawcliffe Park and Ride. These can stop at Ouse Lea, opposite the entrance to our car park on Shipton Road, or at Water End which is opposite the pedestrian access gate. History The park was opened in 1904 by English social reformer Benjamin Seebohm Rowntree, son of Joseph Rowntree. He was owner of Rowntree’s Chocolate Factory. Homestead House was the home of Seebohm and his family from 1904 until 1936. As soon as the house was inhabited, he made an announcement in the Yorkshire Gazette. The fields behind his house would be made available to children attending York Elementary Schools for outdoor activities. The house was greatly extended in the late 1970s and converted into offices. It is now the head office of the Joseph Rowntree Foundation. Visiting Homestead Park Everyone is welcome here. The park is free to all and open every day from 8.30am - 7.30pm, including Christmas Day, Boxing Day and New Years Day. Park facilities Known for its glorious seasonal floral displays, the park’s main features include: Herbaceous borders. Prairie border. Circle garden. Main lawn. Extensive shrub borders. A cherry tree-lined avenue. The Backhouse Pond and rock garden. Wildflower meadow. Woodland and an extensive range of native and ornamental trees. There is also: A popular children’s play area, A pop-up café run by Explore York from spring to autumn. Plenty of seating. Picnic area. Seasonal plant sales run by the Blueberry Academy. Notice boards. Toilet facilities. Homestead Park is a fantastic place to view a wide variety of wildlife. There is a leaflet suggesting some wildlife you may see on your visit. We also offer various tree-trail walks around the park. Awards The park enters the annual Yorkshire In Bloom Awards in summer. In 2011 and 2013 it was awarded a Silver-Gilt and in 2012, and 2016 a Gold award. In 2014 Homestead Park was awarded Gold and a Special Certificate of Achievement. This was for a floral bedding display commemorating the centenary of World War 1. In 2015 the park was awarded Gold and Best in Category for Country Houses, Estates and Parks and Gardens. Discover Homestead Park Downloads 01-01-16-Public-homestead-park-JRHT-01.pdf (1.95 MB) 01-01-16-homestead-park-tree-trail-JRHT-01.pdf (2.72 MB) 01-11-22-homestead-park-creatures-JRHT-01.pdf (712 KB) 01-01-2021-Homestead Park-memorial_brochure-JRHT-01.pdf (2.27 MB) 01-01-21-Homestead-Park volunteer role details leaflet-JRHT-01.pdf (503 KB) Frequently asked questions Is cycling allowed in the park? Cycling is permitted through the park (except the Backhouse Pond footpath). Please note pedestrians have priority at all times. Can we have a BBQ in the park? Fires and barbecues are not permitted in the park. They damage the ground and can too easily spread when the vegetation is dry. Are dogs allowed in the park? For everyone’s health and safety, dogs must be kept on a lead at all times. No dogs are allowed in the children’s play area except for assistance dogs. Dog water bowls are provided near the toilets and café area. Please plan your visit and do not leave dogs in hot cars. Can I have a memorial for my parents in the park? Yes, we are able to help you choose a suitable bench or tree that will provide a lasting memory of your connection with the Homestead Park. There is a leaflet in the download section below - have a read and get in touch if we can help you. Feedback To share feedback and suggestions about the park, email homestead.park@jrf.org.uk , or speak to a member of the Homestead Park team. For urgent security concerns, or if you need to report a serious or dangerous problem involving a tree or a building outside office hours, please call 07858 902 337 . Need to say something to us? Contact us What we do Locations and communities Support for residents Legal Follow us Facebook social media icon RSS icon Copyright Joseph Rowntree Housing Trust 2025. A charitable housing association registered under the Co-operative and Community Benefit Societies Act 2014. Community Benefit Society Registration number: 8209. Correspondence address: The Garth, White Rose Avenue, New Earswick, York, YO32 4TZ. Registered address: The Homestead, 40 Water End, York, YO30 6WP."
    },
    {
      "url": "https://www.homesteadparks.com/wmhs-volleyball",
      "text": "WMHS Volleyball | Homestead Park top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members CO-ED BEACH VOLLEYBALL TOURNAMENT TEAM REGISTRATION WMHS Volleyball Boosters will be hosting a CO-ED Beach Volleyball Tournament at Homestead Park on Saturday, April 6th starting at 11AM. ​ Double elimination, 4 member teams with at least one female and one male per team . ​ This tournament will be limited to 20 teams, so register online early to secure your spot.  On site registration will be available if all 20 team slots are not filled through online pre-registration by tournament morning. There will be a $10 per team fee for on site registration. ​ Outside food and drinks are not permitted at Homestead Park.  Tournament players may bring water bottles and small snacks.  A water refill station will be provided.  No coolers allowed.  No exceptions. Spectators are not allowed to bring food or drink into Homestead Park.  Food and beverages will be available throughout the day in the Homestead Park Market Area.  Spectators will be asked to donate $3 to the WMHS girls volleyball program. ​ Pre-register your team here ! Enter the name, email, and phone number for whoever is filling out this application, or whoever you would like to serve as the point-of-contact for your team. First name * Last name * Email * Phone * Team Member #1 – Name * Team Member #1 – Age * Team Member #2 – Name * Team Member #2 – Age * Team Member #3 – Name * Team Member #3 – Age * Team Member #4 – Name * Team Member #4 – Age * Register © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://homesteadbuilt.com/about-us/",
      "text": "About Us | Custom Home Builders In Raleigh Area, NC Skip to content Facebook Youtube Instagram Linkedin Pinterest Contact Us Meet the team Who we are Awards 2025 Best Digital Video MAME 2024 Best Custom Home Builder Wake Living Readers’ Choice Awards 2024 #5 Custom Home Builder Triangle Business Journal 2024 Silver Winner DOC Parade of Homes 2024 Fast 50 Award Winner #41 Triangle Business Journal 2024 Bronze Winner Triangle Parade of Homes 2023 #5 Custom Home Builder Triangle Business Journal 2023 Fast 50 Award Winner #15 Triangle Business Journal 2022 Fast 50 Award Winner #26 Triangle Business Journal 2022 Silver Winner Triangle Parade of Homes John Heidel Founder Dean Sackett Linkedin President Bob Latvala Linkedin Chief Operating Officer Ryan Burkes Linkedin Director of Sales Melanie Priestley Linkedin Senior Project Manager Jacob Coleman Linkedin Project Manager Michael Bailey Linkedin Project Manager Laura Burnett Linkedin Lead Designer Paige Cashwell Linkedin Customer Care Manager Kevin Ruffcorn Linkedin Warranty & Quality Control Manager Andy Hurst Linkedin Production Manager Ryan Bohr Linkedin Social Media Manager Stay in the know. Are you dreaming of building your perfect home in Raleigh, NC? Stay connected with the latest trends, tips, and updates in custom homebuilding by subscribing to our exclusive newsletter. 919.556.8472 900 Ridgefield Drive, Suite 50, Raleigh, NC 27609 Facebook Instagram Youtube Linkedin Pinterest © 2025 Homestead Building Company. All Rights Reserved. Site developed by Apex by Design . Home Available Custom Homes Communities Brixley Hamptons North Hills North Ridge Country Club Shinleaf Estates Inspirational Plans Inspiration Gallery Partners Blog Homestead Gives Back Who We Are Contact Us Phone Instagram Youtube"
    },
    {
      "url": "https://www.homesteadcapital.com/team",
      "text": "Team | Homestead Capital 0 Skip to Content Team Investment Platform Portfolio Insights & News Contact Us Open Menu Close Menu Team Investment Platform Portfolio Insights & News Contact Us Open Menu Close Menu Team Investment Platform Portfolio Insights & News Contact Us Our Team Homestead’s investment platform is led by a team of professionals with deep experience in investing, farm management, farm acquisition, portfolio construction, and risk management. Leadership | Investment Team | Professional Team | Regional Farm & Credit Managers Leadership DANIEL LITTLE Co-Founder & Co-CEO Read Bio 19+ years of investment management and agriculture experience Former Fund Manager at J.P. Morgan M.A. Columbia University, B.A. Hamilton College GABE SANTOS Co-Founder & Co-CEO Read Bio 20+ years of investment management and agriculture experience Former Executive Director at Goldman Sachs, Global Natural Resources Group Investment Banking Division J.D. Georgetown University Law Center, B.A. University of California, Los Angeles Investment Team PATRICK TRAINOR President Read Bio 15+ years of experience in the acquisition, disposition, and management of agricultural assets Former Executive Vice President and Head of Portfolio Management at Westchester, a TIAA subsidiary B.S. University of Illinois at Urbana-Champaign JUSTIN BURNS Managing Director Read Bio 20+ years of experience in the acquisition, management, disposition, leasing, and financing of agricultural assets Former private attorney and credit fund founder J.D. Willamette University College of Law, B.A. Oregon State University JEREMY MENKHAUS COO & CCO Read Bio 7+ years of direct investing experience in farmland and lower middle market businesses Previously held roles at Agriculture Capital, Brockway Moran & Partners, and Wells Fargo Securities M.B.A. & Master of Forestry, Yale University; B.S.B.A., Georgetown University KYLE JACOBS Director Read Bio 15+ years of experience in production agriculture in the Mountain West Region Formerly a second-generation farmer at Silver K Farms in Idaho and Board Member of Potatoes USA B.S. Brigham Young University, Idaho JACOB BIEZE Director Read Bio 10+ years of investment banking and direct investment experience in farmland and lower middle-market businesses Previously held roles at Agriculture Capital, Saw Mill Capital, and Piper Jaffray & Co. B.A. Duke University DANIEL RIEWERTS Director Read Bio 15+ years of experience in farmland acquisitions and asset management Former Professional Farm Manager and Broker at Hertz Farm Management and Deputy Portfolio Manager within TIAA’s farmland investment platform B.S. University of Illinois at Urbana-Champaign TONY WINDHAM, PH.D. Vice President Read Bio 30+ years of experience in agricultural finance, crop budgeting, commodity marketing, and farm management Former Director of the Arkansas Cooperative Extension Service at the University of Arkansas Division of Agriculture Ph.D., M.S., and B.S. Mississippi State University FRANKLIN BROMBERG Associate Read Bio 5+ years of experience in real assets finance Former FP&A Associate at Mahi Pono and Investment Banking Analyst at Macquarie Capital B.B.A University of Michigan, Ann Arbor DRAKE DELOREFICE Senior Associate Read Bio 5+ years of sales & trading and investment management experience Former Associate at Goldman Sachs, Structured Products Group B.A. University of California, Los Angeles NICOLE FORINGER Associate Read Bio 4+ years of experience in mergers and acquisitions Former Investment Banking Analyst at Cain Brothers, a division of KeyBank Capital Markets B.A. Boston University GRANT POWERS Associate Read Bio 5+ years of experience in agriculture/financial analysis Former Analyst at Wonderful Pistachios B.S. California Polytechnic State University, San Luis Obispo CAROL KIDO Senior Analyst Read Bio 25+ years of experience in agriculture credit / financial analysis Former Sr. Financial Analyst at large financial institutions, including American Ag Credit, Rabo AgriFinance, and Bank of America M.B.A. University of Notre Dame, B.A. University of Hawaii CRAIG BUTLER Analyst Read Bio 12+ years experience in start-up and manufacturing businesses Former account management, sales, and operations leader B.S. Miami University of Ohio Professional Team DAVID CHAN Head of Investor Relations Read Bio 10+ years of direct investment and operational experience across agtech, farmland, and agribusiness Previously held roles at FarmTogether, AMERRA Capital Management, PGIM, & Barclays Investment Bank M.B.A. Harvard Business School (Toigo Fellow), B.S. Cornell University & LeadNY Class 19 Graduate ALEX MASCIA VP of Finance Read Bio 10+ years of experience in property operations, financial accounting and reporting, performance analytics and tax compliance Former Assistant Controller of Investments at Mosser Companies and Assistant Controller at LaSalle Investment Management M.S. Roosevelt University, B.S. Purdue University; Certified Public Accountant ANNIE LUONG Property Controller Read Bio 14+ years of corporate accounting experience in public, private, and start-up companies as well as property operations Former Accounting Manager at Attivo Partners and Live Nation Entertainment B.S. San Francisco State University KRISTINA POWELL Assistant Fund Controller Read Bio 7+ years of experience in alternative investment accounting, financial reporting, and tax compliance Fund Controller at FPR Partners; Associate Fund Controller at Carta; Senior Associate at Andersen B.S. Northeastern University; California Certified Public Accountant JAKE RODGERS Property Accountant Read Bio 4+ years of experience in property accounting and financial reporting Former Staff Accountant at Distinctive Resorts B.S. University of Oregon ANA BROCHER Senior Executive Assistant Read Bio 8+ years in Office Management and 4+ years as Executive Assistant to the CEO Former Executive Assistant at CircleUp and Former Office Manager to Indiegogo B.A. University of California, Berkeley Regional Farm & Credit Managers* DELTA STEVE BRUNSON ARDITH MORGAN DANIEL SPENCER MICHAEL ANDREWS SARAH COTTLE MIDWEST LUKE WORRELL ALLISON WORRELL AUSTIN HORNSTEIN DAVID THIEN ADAM THIEN GRETCHEN EBERLY MOUNTAIN WEST SKYE ROOT BRADLEY CALAWAY ARNAV VIRMANI JIM REDMOND PACIFIC NORTHWEST SONORA ZAUGG MARYELLEN ZEISE JEFF FAGG KARI RICKENBACH PACIFIC SCOTT BOZZO TODD COMBS CHARLES MCELLIGOTT TATUM KELL *The Regional Farm and Credit Managers are independent contractors retained to assist in the identification, management and disposition of Fund assets in their respective regions and are not affiliates of Homestead Capital. Farmland investments rooted in excellence. Subscribe for updates Email Address Sign Up Thank you! Home Our Team Investment Platform Portfolio Insights & News Contact Sustainability Terms of Use & Disclaimer LinkedIn © 2025 Homestead Capital. All rights reserved. Site by Knapsack ."
    },
    {
      "url": "https://www.partyslate.com/venues/homestead-park",
      "text": "Homestead Park | Williston Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Homestead Park Find Venues / Florida / Williston / Homestead Park Homestead Park 1050 NE 6th Blvd, Williston, FL 32696, USA Max Seated 125 Max Standing 300 Request info Favorite Overview Gallery 1 About Homestead Park Rent our tent for your wedding rehearsal, birthday party, corporate meetings, and any other private event at our brand new events tent! A 1500 square-foot open air tent with electricity. We also provide tons of amenities such as a speaker system, bar setup, catering, tables, chairs, and more! Event Spaces 1 125 max seated • 300 max standing 4 Homestead Park Private Events 125 Seated 300 Standing Tent Pricing Packages Homestead Park hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Amenities A/V Equipment Coat Check Handicap Accessible Kosher Kitchen Media Room Pet Friendly Pool Street Parking Valet Parking WiFi Windows Dance Floor Breakout Rooms In-house caterer only In-house suppliers only Map 1050 NE 6th Blvd, Williston, FL 32696, USA Follow Us Visit Website Call Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/florida-gator-game-day-pass-1",
      "text": "Costume Party & Contest top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members Costume Party & Contest Tue, Sep 23 | Williston The most fun night of the year is just around the corner, and you're invited! Get ready for a night filled with great music, delicious food and drinks, and a costume contest that promises to be a blast. RSVP Time & Location Sep 23, 2025, 7:00 PM – 11:00 PM Williston, 1050 NE 6th Blvd, Williston, FL 32696, USA About the event Our Annual Costume Party & Contest! The most fun night of the year is just around the corner, and you're invited! Get ready for a night filled with great music, delicious food and drinks, and a costume contest that promises to be a blast. Whether you're competing for a prize or just here to hang out, it's going to be a night to remember. Think you have what it takes? Sign-ups start at 6 PM, but make sure you get there early! Each division’s sign-up period ends right before the contest begins. Divisions & Prizes Pet Division Starts at 7 PM Show More RSVP Share this event © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://www.humblehearthomestead.com/contact-us",
      "text": "Contact Us | Get in Touch — Humble Heart Homestead 0 Skip to Content About Us Who We Are Our Team Contact Us Farm Stays Kids Camps Happenings Raw Milk + Eggs Community Fridge Open Menu Close Menu About Us Who We Are Our Team Contact Us Farm Stays Kids Camps Happenings Raw Milk + Eggs Community Fridge Open Menu Close Menu Folder: About Us Back Who We Are Our Team Contact Us Farm Stays Kids Camps Happenings Raw Milk + Eggs Community Fridge Contact Us Thank you for reaching out. We would love to connect with you! info@humblehearthomestead.com Name * First Name Last Name Email * Message * Thank you for contacting us. We will be in touch soon! HUMBLE HEART HOMESTEAD                                                                                                                             Farm. Art. Community.                                                                                                                                        799 Washington Hwy Morrisville, VT 05661 info@humblehearthomestead.com"
    },
    {
      "url": "https://www.homesteadparks.com/what-to-do",
      "text": "What To Do | Homestead Park top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members Entertainment Fitness Food & Drink Shop Sports Wellness Hover over the images to learn more about them, and find what you're looking for by adding filters with the buttons below. WHAT TO DO AXE THROWING Learn to throw axes and knives at Got Wood Williston inside of Homestead Park Williston. AXE THROWING LEARN MORE CORNHOLE Home of the 352 Baggers and Florida Crossroads Cornhole! These two leagues host tournaments and open cornhole events on a weekly basis! Please see our events calendar for dates. CORNHOLE LEARN MORE YOGA Got Limber? Yogafit classes are held on Tuesdays from 6:15pm to 6:45pm, and Saturdays from 9:15am to 10am. Animal yoga with a variety of animals is held on special occasions. YOGA CHECK EVENTS VOLLEYBALL Two Beach Volleyball courts with lights for evening play are available. Tournaments are held on weekends and nights, so check the calendar for the schedule. Pickup games and practices are welcome whenever the courts are free. VOLLEYBALL LEARN MORE LIVE MUSIC Homestead Park Williston hosts live musicians on Friday and Saturday evenings. Homestead Park Williston hosts special event concerts with full bands in our Concert Series. Check the calendar for details. LIVE MUSIC CHECK EVENTS KIDS PLAY AREA Rambunctious kids? Turn them loose in our fenced in play area while you relax at The Park. Let them enjoy the Tiny Club Houses or play a Giant Connect Four. KIDS PLAY AREA CALL FOR QUESTIONS SANDBOX BOOTCAMP Get fit with our Sandbox Bootcamps on Tuesdays from 5:30pm to 6pm, and Saturdays from 8:30am to 9am. Out of shape? They’ll go easy on you and build you up at your speed. SANDBOX BOOTCAMP CHECK EVENTS TRIVIA Bring your crew and join us for Trivia on select Thursdays. Don’t have a crew? We’ll pair you up, or play solo, your call. TRIVIA CHECK EVENTS LINE DANCING Boot scooting line dancing is held regularly at Homestead Park Williston. Check our calendar or sign up for our newsletter to see the days. LINE DANCING CHECK EVENTS POOL What is a bar without a pool table? We have one. Join us for a beer and a round of pool. POOL CHECK EVENTS CK SWEET SHOP When you're finished with the tacos or burger, stop by CK Sweet Shop and grab a slice of cheesecake or a rice crispy treat. There are sweets of all kinds for the kids or for your someone special. CK SWEET SHOP LEARN MORE OUTDOOR BAR The Market Bar is a great place to meet friends, watch the game, or just hang out. We carry a selection of local draft beers, canned beers, frozen wine margaritas, and a selection of cocktails. It is a great place to see and be seen. OUTDOOR BAR LEARN MORE PRIVATE EVENTS Homestead Park Williston has a 1500 square foot tent available for wedding receptions, birthday parties, corporate events, or family reunions. We have electricity, a speaker system, catering, bar setup, tables, chairs, and more. PRIVATE EVENTS LEARN MORE BRYNN'S BYTES Please welcome Brynn Harness to Homestead Park!  She brings a brand new menu chocked full of wonderful surprises including some late night quick snacks that will keep you going late into the evening. BRYNN'S BYTES LEARN MORE TINY GOLF Nine holes of fun for kiddos and adults! It's only $5 for a round of Tiny Golf! Open during Homestead Park's regular hours of operation. TINY GOLF CALL FOR QUESTIONS HUCK'S CREAMERY Huck loves it, and so will you! Get delicious ice cream at Huck's Creamery, located within Homestead Park's Market. HUCK'S CREAMERY LEARN MORE A NUTRITIOUS VIBE Try an energy-boosting tea or a delicious protein shake from A Nutritious Vibe! A NUTRITIOUS VIBE LEARN MORE SUNDAY FARMERS MARKET Sundays starting in September, join us for a Farmers Market featuring local vendors! SUNDAY FARMERS MARKET LEARN MORE © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://www.homesteadvillage.org/leadership-and-governance/",
      "text": "Leadership & Governance | Homestead Village Blog Events Careers Values Ways to Contribute Financial Contributions Homestead Village Auxiliary Volunteer Opportunities Login Contact 717-397-4831 About About Us Leadership Values Heritage FAQs Villager Newsletter Videos from the Village Campus Tour CCRC Near Philadelphia CCRC Near York Community Life Enrichment Village Services Dining Senior Lifestyle Arts & Culture The Bachman Center News Homestead Village Seminars and Events Senior Transportation Services Living Options Residences Personal Care Skilled Nursing Memory Support Health/Wellness Fitness Opportunities Home Care Voices of the Village Resident Testimonials Resident Stories Blog Events Careers Values Ways to Contribute Financial Contributions Homestead Village Auxiliary Volunteer Opportunities Login Contact 717-397-4831 ✕ Leadership and Governance An often-overlooked aspect of choosing a retirement community is the residents’ role in governance. How do the residents as a whole or individually have a voice in communicating their concerns and opinions to the governing body? At Homestead Village, we have worked diligently to create a governing model that gives our residents—our most important stakeholders—a strong voice in the governance of the organization. Our by-laws allow four residents to serve on our 15-member volunteer board. Homestead Village began allowing residents to serve on the board in 2001 and has now increased the number of resident board members from two to four. Our residents are encouraged to nominate new board members; consequently, most new board members are nominated by our residents. The Homestead Village board holds an annual meeting that all residents are invited to attend. The board reports on the performance of the organization and seeks feedback from residents. As an official representative of the board, Homestead Village’s president attends Resident Council and Resident Association meetings in order to understand current issues and address them if possible. All residents of Homestead Village are members of the Resident Association, which meets quarterly. The Resident Council meets monthly and is the governing body of the Resident Association. The president of Homestead Village holds coffees with the residents on a monthly basis as an informal communication tool to improve the quality of services and address issues in a timely manner. The board holds periodic resident-board liaison meetings to improve communications and share budgeting information with residents. The board of directors sanctions a bi-annual resident satisfaction survey to receive clear, direct feedback from a large percentage of residents. Non-profit boards are charged with three critical duties: Provide professional and impartial oversight of a fiscal and ethical nature Ensure that the organization has a strategic direction for future success Hire and hold accountable the professional management team charged with effectively executing the mission of the organization With so many governance initiatives in place, Homestead Village is at the forefront of providing our residents, both individually and collectively, a clear voice in the governance of the organization. For a list of current board members and leaders, do not hesitate to contact us. About About Us Leadership Values Heritage FAQs Villager Newsletter Videos from the Village Campus Tour CCRC Near Philadelphia CCRC Near York Community Life Enrichment Village Services Dining Senior Lifestyle Arts & Culture The Bachman Center News Homestead Village Seminars and Events Senior Transportation Services Living Options Residences Personal Care Skilled Nursing Memory Support Health/Wellness Fitness Opportunities Home Care Voices of the Village Resident Testimonials Resident Stories Learn More Form Connect With Us to Learn More Want to explore an extraordinary way of retirement living? Fill out the form and begin your journey. Name * First Last Email * Phone * CAPTCHA How would you prefer us to contact you? Select All Phone Email Text This field is hidden when viewing the form How would you prefer us to contact you? Phone Email Text Sign-Up I would like to subscribe to your email mailing list. Comments This field is for validation purposes and should be left unchanged. Visit Our Campus 1800 Village Cir Lancaster, PA 17603 Contact Us P: 717-397-4831 E: info@hvillage.org Connect on Social © 2025 All Rights Reserved | Privacy Policy/HIPAA About Community Living Options Health/Wellness Contact Careers Ways to Contribute Blog Events Careers Values Ways to Contribute Financial Contributions Homestead Village Auxiliary Volunteer Opportunities Login Contact 717-397-4831"
    },
    {
      "url": "https://www.homestead.ca/contact",
      "text": "Contact Us | Homestead Land Holdings Menu Applicant Login Resident Login Home Apartments Ajax Brantford Burlington Calgary Cambridge Guelph Hamilton Kingston Kitchener London Mississauga Newmarket Oakville Ottawa Sarnia St. Catharines Thornhill Toronto Waterloo About Us Careers MY FAVOURITES 0 Mobile menu Home Apartments Ajax Brantford Burlington Calgary Cambridge Guelph Hamilton Kingston Kitchener London Mississauga Newmarket Oakville Ottawa Sarnia St. Catharines Thornhill Toronto Waterloo About Us Careers Applicant Login Resident Login Online Application My Favourites Find an office in your area Ajax Brantford Burlington Cambridge Kingston Calgary Guelph Hamilton Kitchener Mississauga / Etobicoke London Newmarket Oakville Ottawa Sarnia St. Catharines Thornhill Toronto Contact Us Please provide us with some information so that we can assist you better. If you are inquiring about renting an apartment with us, please visit the specific building page for information about availability, or call our on-site staff at the phone number listed on each page. For all media inquiries, please contact us at media@homestead.ca Contact Form Full Name Email Address Phone Number Select a City Select a City Ajax Brantford Burlington Calgary Cambridge Gloucester Guelph Hamilton Kingston Kitchener London Mississauga Newmarket Oakville Ottawa Sarnia St. Catharines Thornhill Toronto Waterloo Select a Property Select a Property Lord Sydenham Caravel 1000 Mount Pleasant Shipyards Locomotive Works Barrett Place I Bowling Green I Bowling Green II Bowling Green III Bowling Green IV Brock Towers Carlton Carruthers Wharf Apartments Cumberland Elgin Forsythe The Frontenac Glengarry Green Park Mayfair Newcourt Fields I & II Victoria Normandy Portsmouth Place East Portsmouth Place Centre Portsmouth Place West The Waterside Richardson Wharf Parkway Court Pier 100 Apartments Woodstone Apartments Nottingham Towers Regency Queen Margaret I Queen Margaret II MacDonald Queen Mary Selkirk Simcoe Skyline West Park I Apartments West Park I Townhouses West Park II The Ascot Bay 200 Richmond Park Square William Mosgrove Tower The Lamplighter Edgeworth Waterford Champlain Towers Windfields Bromley Square 225 Van Horne Apartments 440 Eglinton 890 Mount Pleasant Apartments Balfour Square Brock Tower Esterbrooke Apartments The Fairlea Fontainebleu Barrett Place II Godstone Place Lakewood Apartments I Landmark Apartments Pharmacy Place Promenade Apartments Richview Villa Royale Towers Shaughnessy Place Upper Canada Apartments 165 Upper Canada Court, West Upper Canada Court, Centre Upper Canada Court, East Valleyview Towers Villa Nova Centennial Towers Park Terrace I Premier Court Apartments Dornia Manor North Park Tower The Westgate Arlington Apartments Colonel By Towers Driveway Place Park Ridge Place I-III Lord Richmond Riviera Gate Roxborough Apartments Sandringham Saratoga Place Bradley Court I/II Highland Park Apartments I/II Parkdale Place Ridout Towers Roseland Place Trillium Towers I/II Blinkbonnie Concord Apartments Eldorado Haldimand Apartments Robinson Place Apartments Bryden Apartments Phoenix Mill Apartments Silvercreek Terrace Trafalgar Square Caledon Sandpiper Apartments Surrey Lane Apartments Windfields III The Highlander Elm Grove Uptown Towers I & II Laurel Grove Poplar Grove Park Terrace II Wentworth Arms Forest Suites Cresswell Court Apartments Aldershot Apartments The Gartshore The Herkimer Beech Grove Suites The Brock Lakeview Place The Wellington The Woodbine South Grand Apartments Cambridge Park Apartments The Birkenshaw Apartments White Oaks Gate The Balmoral Sussex House Phoenix Apartments 212 Davis Apartments Crown Tower Apartments Old Mill Apartments I Cedar Grove Glenridge Avenue Apartments Lakewood Apartments II Windjammer Apartments I & II Grosvenor Estates The Shipman Apartments I Willowbrook Apartments Grandview Tower Royal Court The Sprucedales Royal Towne Briarwood Talisman Square Linden Crossing Gresham Place Metropolitan Towers Old Mill Apartments II The Devonshire Ridge Hill Towers Island Park Towers The Duchess Old Mill Apartments III The Shipman Apartments II The Madeleine Rockwell Place I 40 Delisle Apartments Auburn Towers 50 Laurier Sophia Apartments The Diplomats Rockwell Place II Inquiring about an apartment? Yes No Number of Bedrooms Move-in Date Comments Leave This Blank Captcha: Submit Rental Request Interested in an apartment? Fill out an online application today. RENTAL INQUIRY Tax Receipts To request a tax receipt, please click the button below and enter your personal information GET YOUR\n                        TAX RECEIPT Home Apartments Careers About Us Contact Sitemap Employees Policies Sitemap View Our Virtual Tours YouTube Visit Our Partners Rogers Cogeco © 2025 Homestead Land Holdings Ltd. Website by Rentsync ."
    },
    {
      "url": "https://www.homesteadparks.com/private-events",
      "text": "Private Events | Homestead Park top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members PRIVATE EVENTS Private Outdoor Tent Rent our tent for your wedding rehearsal, birthday party, corporate meetings, and any other private event at our events tent! A 1500 square-foot open air tent with electricity. We also provide tons of amenities such as a speaker system, bar setup, catering, tables, chairs, and more! For more information, email us at sami@homesteadtinyenterprises.com GALLERY BOOKING BOOKING Catering Reach out to our private events manager for current information regarding catering! ​ Private Events Manager: sami@homesteadtinyenterprises.com MORE INFO Tent Rental Rates & Bar Pricing Monday-Wednesday: Full Park Rental; $2000/4 hours ($900 bar minimum required) Thursday: $500/4 hours ($300 bar minimum required) Friday & Saturday: $900/4 hours ($600 bar minimum required) Sunday: $800/4 hours ($500 bar minimum required) Speaker System with Bluetooth: $150 Axe Throwing Group Rate (16 people): $250/hour (to accommodate larger parties, more hours must be reserved) ​ Bar Setup in tent: $200 for bar setup Requires at least 1 Bartender – $50/hour per bartender PRICING PDF BOOK NOW © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/line-dancing-competition",
      "text": "Costume Party & Contest top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members Costume Party & Contest Tue, Sep 23 | Williston The most fun night of the year is just around the corner, and you're invited! Get ready for a night filled with great music, delicious food and drinks, and a costume contest that promises to be a blast. RSVP Time & Location Sep 23, 2025, 7:00 PM – 11:00 PM Williston, 1050 NE 6th Blvd, Williston, FL 32696, USA About the event Our Annual Costume Party & Contest! The most fun night of the year is just around the corner, and you're invited! Get ready for a night filled with great music, delicious food and drinks, and a costume contest that promises to be a blast. Whether you're competing for a prize or just here to hang out, it's going to be a night to remember. Think you have what it takes? Sign-ups start at 6 PM, but make sure you get there early! Each division’s sign-up period ends right before the contest begins. Divisions & Prizes Pet Division Starts at 7 PM Show More RSVP Share this event © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.nps.gov/home/contacts.htm",
      "text": "Contact Us - Homestead National Historical Park (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to this park navigation Skip to the main content Skip to this park information section Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel Homestead National Historical Park Nebraska Info Alerts Maps Calendar Fees Loading alerts Alerts In Effect Dismiss more information on current conditions... Dismiss View all alerts Contact Us Contact Us Superintendent Homestead National Historical Park 8523 West State Hwy 4 Beatrice, NE 68310 Phone: 402-223-3514 Email Us Find Homestead on Facebook! Follow Homestead on @HomesteadNHP Sign Up for our Electronic Newsletter! Request a field trip by email. To report an error on this website, please contact the Webmaster through email. Last updated: January 7, 2025 Park footer Contact Info Mailing Address: 8523 West State Highway 4 Beatrice, NE 68310 Phone: 402 223-3514 Contact Us Tools FAQ Site Index Español Stay Connected This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://www.homesteadlake.co.uk/get-in-touch/",
      "text": "Contact Us | Get In Touch | Homestead Lake Park, Weeley, Essex Contact Us | Get In Touch | Homestead Lake Park, Weeley, Essex Subscribe lakepark@homesteadcaravans.co.uk 01255 833492 Holiday With Us Our Park Fishing Local Information Contact Us Check Prices Get in touch Have you got a question or query about Homestead Lake Park? Why not drop us a line? Simply fill in the form below and a member of our team will get back to you as soon as possible Title * Mr Mrs Miss Ms Name * First name Surname Email * Enter Email Confirm Email Phone number If you would like us to call you back about your enquiry, please supply a valid phone number Query or question Subscribe for offers? Please check the box if you would you like to receive latest offers and promotions Yes, please subscribe me By submitting this form, you are agreeing to receive marketing communications via email based on your preferences provided above from Homestead Lake Park. To find out more about our privacy policy and information about what we will send you, please click here LinkedIn This field is for validation purposes and should be left unchanged. Δ Call Us On 01255 833 492 Check Prices Subscribe to our newsletter for exclusive offers and news Email Phone This field is for validation purposes and should be left unchanged. Subscribe Δ By submitting this form, you are agreeing to receive marketing communications via email from Homestead Lake Park. To find out more about what we will send you, please see our Privacy Policy here . Homestead Lake Park Homestead Lake Park, Thorpe Road, Weeley, Essex, CO16 9JN 01255 833492 lakepark@homesteadcaravans.co.uk Quick Links Check Prices and Book Request a brochure Touring & Camping Dog friendly holidays Fishing holidays Local Area Latest Offers & Events Important Info Latest News Get in touch FAQs Homestead Caravan Centre Privacy Policy Booking Terms and Conditions © 2018. All rights reserved. Site designed by"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/cliff-dorsey",
      "text": "Costume Party & Contest top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members Costume Party & Contest Tue, Sep 23 | Williston The most fun night of the year is just around the corner, and you're invited! Get ready for a night filled with great music, delicious food and drinks, and a costume contest that promises to be a blast. RSVP Time & Location Sep 23, 2025, 7:00 PM – 11:00 PM Williston, 1050 NE 6th Blvd, Williston, FL 32696, USA About the event Our Annual Costume Party & Contest! The most fun night of the year is just around the corner, and you're invited! Get ready for a night filled with great music, delicious food and drinks, and a costume contest that promises to be a blast. Whether you're competing for a prize or just here to hang out, it's going to be a night to remember. Think you have what it takes? Sign-ups start at 6 PM, but make sure you get there early! Each division’s sign-up period ends right before the contest begins. Divisions & Prizes Pet Division Starts at 7 PM Show More RSVP Share this event © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    },
    {
      "url": "https://www.homesteadtinyhomes.com/contact",
      "text": "CONTACT | Homestead Tiny House Co. top of page BUY NOW MODELS Aspen Durango Montrose The HomeShed FINANCING Liberty Bank Hearth MEDIA Testimonials Blog Instagram Feed Video Press LEARNING CENTER CONTACT Homestead Tiny House Co. HEADQUARTERS 1050 NE 6th Blvd., Williston, FL 32696 470-448-3480‬ Monday - Friday » 9:00am - 4:00pm By Appointment Only Book Appointment Here Homestead Tiny Enterprises FLORIDA SALES OFFICE 1050 NE 6th Blvd., Williston, FL 32696 470-704-7713 Monday - Saturday » 11:00am - 8:00pm Homestead Tiny Resort Homestead Park - Williston Quick Message Use this form to send us a quick message. I want to subscribe to the newsletter. Message Send Tiny House Questionnaire Let's get to know you and your dreams of a tiny house. Answer the questions below. All fields are required. When do you want to purchase a tiny house? * required Number of tiny homes? Choose best option... What is the primary use? Choose best option... Do you have property for a tiny house? Choose best option... Where will the tiny house initially reside? Choose best option... Have you contacted the city/county? Choose best option... Which model are you interested in? Choose a model... How do you plan to purchase? Choose best option... Would you need it delivered? Choose best option... Message Communication Preference Choose best option... I want to subscribe to the newsletter. Send Quick Message Questionnaire COMPANY Press Jobs & Careers Meet the Team Charitable Affiliations Terms and Conditions Privacy Policy ​ SUPPORT BLOG Resources Financing Contact Us Thanks FAQ OUR HOMES View Listings Tiny Home Resorts NOAH - RDI Testimonials Business Inquires Join Thanks for submitting! JOIN OUR EMAIL LIST Log In Homestead Tiny House Co. HQ | 1050 NE 6th Blvd, Williston, FL 32696 ©2023 Homestead Tiny House Company, LLC. All Rights Reserved. Website managed by Homestead Tiny House Co. Do Not Sell My Personal Information bottom of page"
    },
    {
      "url": "https://homesteadpark.com/about-us/",
      "text": "About us – Homestead Trailer Park Skip to content 1123 Homestead Rd. Bancroft, ON K0L 1C0 (613) 339-2500 camping@homesteadpark.com MENU Home Cottage & Trailer Rentals Trailer Sales Rates E-Forms Campsite Info Campsite Map Photo Gallery Local Activities About Contact About us About us rsqaa 2023-06-07T15:08:46+00:00 A Quiet & Relaxing Atmosphere explore beautiful bancroft – book your campsite now! The Homestead Trailer Park offers for your camping enjoyment 150 spacious sites both beautifully treed and open. Our facilities include both full hookup and water and 30amp electrical sites, all with firepits, firegrates and picnic tables on the banks of beautiful Eels Lake. The whole family will enjoy exploring Eels Lake, swimming, or just relaxing on our natural sand beach. Eels Lake is 11 kms long and has over 56 kms of picturesque shoreline with many peaceful secluded inlets and bays to be enjoyed. Paddle craft rentals are available to explore the Lake or enjoy a peaceful day of fishing. For the fishing enthusiast there is excellent Lake Trout, Small & Large Mouth Bass, and Pickerel (Walleye) fishing, as well as an abundant supply of pan fish. Enjoy your catch over your firepit back at the Homestead Trailer Park! Family Camping Specialists Rent, Buy, or Seasonally Stay with Us! Join the Homestead Park Family Today! Seasonal & Nightly/Weekly Rates We offer Seasonal, Nightly and Weekly Rates. Prices per 2 Adults. Additional Occupants/Pets +$15/ night view Trailer Sales We have New and Gently Used Trailers for Sale within our Campground. Please Contact Us to Inquire about any of these Great Trailers! view Trailer Rentals We offer 2 unique properties with modern facilities for rental but remember to BRING YOUR OWN LINENS! Please Call Us to Book Today! view are you not sure which campsite to choose? call us (613) 339-2500 or get in touch trailers for sale 2017 Forest River Trailers For Sale $ 30,000.00 2020 Forest River Trailers For Sale $ 49,500.00 2016 Keystone Trailers For Sale $ 36,000.00 2011 Gulfstream Trailers For Sale $ 28,000.00 join the many happy homestead family Campers today! 1123 Homestead Rd., Bancroft, ON K0L 1C0 camping@homesteadpark.com (613) 339-2500 Site Navigation Homestead Trailer Park Home Trailer Sales Cottage & Trailer Rentals Rates Campsite Map & Info Local Activities Photo Gallery About us Contact featured 2018  Zinger Trailers For Sale View Cart $ 39,900.00 Add to cart Details © 2023 - 2023 | Website by World Wide Webdesign |   All Rights Reserved   |   Powered by World Wide Webhosting Page load link Welcome to Homestead Trailer Park! Located on Eels Lake, near Bancroft and Apsley Ontario, we offer Overnight and Seasonal 30amp full hook-up waterfront sites, Natural Sand Beach, Organized Activities, and much more! read more photo gallery get in touch (613) 339-2500 1123 Homestead Rd., Bancroft, Ont. K0L 1C0 info@homesteadpark.com Go to Top"
    },
    {
      "url": "https://www.homesteadparks.com/event-details/homesteads-2nd-annual-fall-festival",
      "text": "Homestead's 2nd Annual Fall Festival top of page Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers More.. Use tab to navigate through the menu items. Members Homestead's 2nd Annual Fall Festival Sat, Oct 26 | Homestead Park Join us at Homestead Park for Fall Fun! We'll have 20+ vendors, featuring fall-related products, a pumpkin patch, hay rides, and more! Time & Location Oct 26, 2024, 2:00 PM – 6:00 PM Homestead Park, 1050 NE 6th Blvd, Williston, FL 32696, USA About the event Are you a vendor? See our event listing specifically for vendors, OR go ahead and email stephanie@homesteadtinyenterprises.com, letting us know what kind of product(s) you sell! Show More Share this event © 2023 Homestead Tiny Enterprises, LLC | Designed & Developed by VBM Interactive LLC Subscribe to Our Mailing List Thanks for subscribing! Enter Your Email Join Contact Us info@homesteadtinyenterprises.com Tel: (352) 449-4544 1050 NE 6th Blvd. Williston, FL 32696 A completely unique take on a community gathering place! Shop, eat, drink, play, compete, & more! Home What To Do Events Play Cornhole Axe Throwing Volleyball Food & Drink Retail Private Events More Farmers Market Staff Contact Careers bottom of page"
    }
  ]
}