{
  "fuentes": [
    {
      "url": "https://www.hoplife.com/contact",
      "email": "hoplife2013@yahoo.com"
    },
    {
      "url": "https://www.hoplife.com/contact",
      "email": "melanied@hoplifebrewing.com"
    },
    {
      "url": "https://www.hop.uk.com/about-us/people/",
      "email": "ask@hop.uk.com"
    },
    {
      "url": "https://www.hopandstuff.com/pages/contact-us",
      "email": "copy_of_hs-primary-camel_160x@2x.png"
    },
    {
      "url": "https://www.hopandstuff.com/pages/contact-us",
      "email": "copy_of_hs-primary-camel_300x@2x.png"
    },
    {
      "url": "https://www.hopandstuff.com/pages/contact-us",
      "email": "copy_of_hs-primary-white_160x@2x.png"
    },
    {
      "url": "https://www.hopandstuff.com/pages/contact-us",
      "email": "copy_of_hs-primary-white_300x@2x.png"
    },
    {
      "url": "https://www.hopandstuff.com/pages/contact-us",
      "email": "info@hopandstuff.com"
    },
    {
      "url": "https://www.hopback.co.uk/contact-us/",
      "email": "info@hopback.co.uk"
    },
    {
      "url": "https://www.hopback.co.uk/contact-us/",
      "email": "sales@hopback.co.uk"
    },
    {
      "url": "https://www.hopback.co.uk/contact-us/",
      "email": "sultan@hopback.co.uk"
    },
    {
      "url": "https://www.hopback.co.uk/contact-us/",
      "email": "thewaterlooarms@outlook.com"
    },
    {
      "url": "https://sipandscript.com/venue/hop-life-brewing/",
      "email": "events@sipandscript.com"
    }
  ],
  "mails": [
    "ask@hop.uk.com",
    "copy_of_hs-primary-camel_160x@2x.png",
    "copy_of_hs-primary-camel_300x@2x.png",
    "copy_of_hs-primary-white_160x@2x.png",
    "copy_of_hs-primary-white_300x@2x.png",
    "events@sipandscript.com",
    "hoplife2013@yahoo.com",
    "info@hopandstuff.com",
    "info@hopback.co.uk",
    "melanied@hoplifebrewing.com",
    "sales@hopback.co.uk",
    "sultan@hopback.co.uk",
    "thewaterlooarms@outlook.com"
  ],
  "nombre_sitio": "hoplife.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hoplife.com/contact",
      "text": "Contact | Hop Life Brewing Co. | Hop Life Brewing Company Home About Our Beer Draft Menu Growlers and Crowlers Cans & Bottles Specialty Drinks Coupons & Specials Scratch Kitchen Lunch Specials Hoppy Hour Menu Brunch at the Brewery Events Monthly Calendar Photo Gallery Merch Mug Club Gift Cards Distribution & Sales Contact Select Page Call 772-249-5055 | ✉ Contact Us Follow Follow Follow Follow Home About Our Beer Draft Menu Growlers and Crowlers Cans & Bottles Specialty Drinks Coupons & Specials Scratch Kitchen Lunch Specials Hoppy Hour Menu Brunch at the Brewery Events Monthly Calendar Photo Gallery Merch Mug Club Gift Cards Distribution & Sales Contact Hop Life Contact Us Contact Us Hop Life Brewing Company 679 NW Enterprise Drive, Suite 101 Port St Lucie, FL 34986 Phone: (772) 249-5055 Email: hoplife2013@yahoo.com Event Contacts Taproom Events: melanied@hoplifebrewing.com Name Address Email Phone Message Submit Visit Hop Life Brewing Company Brewery & Taproom: 679 NW Enterprise Drive, Suite 101 Port St Lucie, FL 34986 Phone: (772) 249-5055 Contact Hop Life Brewery Hours of Operation: Monday: Closed Tuesday - Thursday: Noon-10pm Friday - Saturday: Noon-12am Sunday: Noon-8pm Private Events: Beer Garden Rental Live Music Options Catering Options ( Menu ) (Reservation Required 2 weeks in advance) Brewery Tours: Monday: Closed Tuesday - Friday: 10am-4pm Individual or Groups up to 10 (Reservation Required 48 hours in advance)  Home About Our Beer Scratch Kitchen Events  Quick Nav Merch Mug Club Gift Cards Contact Us Name Email Address Message 2 + 1 = Submit © 2025 Hop Life Brewing Company – All Rights Reserved. Follow Follow Follow Follow"
    },
    {
      "url": "https://www.hop.uk.com/about-us/people/",
      "text": "People – HOP Consulting Home Projects About us Services People News Awards Accreditations BIM HOP Policies Careers Practical Skills in Construction Current Opportunities Training and Development Graduates, Undergraduates and School Leavers Innovation Community Contact About us Services People News Awards Accreditations BIM HOP Policies People HOP Consulting Limited is a Structural, Civil & Marine Engineering Consultancy with over 50 employees. The HOP Senior Leadership Team is led by our Managing Director, John Spearman, alongside five Directors and four Associates. Each team member is considered as important as the next and our staff are committed to realising the visions of HOP. Directors John Spearman Managing Director John Spearman Personal Profile John Spearman brings with him more than 20 years of high-level leadership experience and technical engineering knowledge to his new role as Managing Director. From his previous position as Finance Director at HOP, John also brings a wealth of commercial experience enabling the successful financial management of the firm, alongside his role in proactively developing strong technical teams through a training and mentoring culture. Prior to working at HOP, John worked for a couple of large national contractors on major roads, bridges, airports and other building structures. The site-based start to his career has enabled HOP’s strong focus on buildability and contractor-friendly designs to be realised, generally to the benefit of the end client as a whole. The company has embraced modern BIM techniques since 2006 enabling greater levels of coordination and technical complexities to be achieved in delivering projects such as the award-winning Amex Stadium. Skills and strengths Design and Build project procurement from feasibility, planning, through to final construction stages, achieving high levels of sustainability in the process. Sports stadiums and facilities. Power stations and major commercial projects. Conversion & refurbishment/repair of historic structures. Principal Designer Waterside developments. Chartered Engineer and a member of ICE. Keen hockey player and mountain biker blazing trails across the South Downs and further afield. Key responsibilities High level practice and major project management across the business. Specialist design of all building forms, high and low rise in various materials, including temporary works. Management and cost control of design and contract stages of construction. Promotion of modern methods in design and construction to achieve optimised valued solutions. A local School Governor. Jon Orrell Director Jon Orrell Personal Profile Jon was a founding partner of HOP and our Managing Director until 2018. His initial experience was ‘hands-on’, on site with major contractors (reinforced concrete oil rigs in the North Sea; major town center and river diversion in Kent; coastal power station in Scotland and a military airfield overseas). Although he studied building initially, when he returned to the UK after six years’ of site work, he did a largely self-funded Degree in Civil Engineering at the University of Brighton. He then worked as a Resident Engineer on a seawall project. After a short spell in a Design Office; he set up Hemsley Orrell Partnership in 1985. Jon likes to find practical, often different, solutions to both Permanent and Temporary Works. He regularly draws on his early, hands-on, Building and Heavy Civil Engineering experience. He’s a self-confessed ‘reinforced concrete nerd’, but has done a great deal of work on both buildings and maritime structures. Skills and strengths Jon is instrumental in supporting initiatives that help young, often disadvantaged individuals, get in to employment in the construction industry. Jon remains active, playing the blues on his vintage ‘Telecaster’, competing in Tough Mudder and continuing his involvement with British Military Fitness. Key responsibilities Chartered Engineer & Fellow of the Institution of ICE/IStructE and institute of Building Qualified commercial diver Principal Designer Delivering Principle papers and seminars to learned societies Acting as an expert witness Passionate about installing a strong Training Ethos at HOP and supporting the local community Chair of Industrial Advisory Board, University Of Brighton & Paddle Round the Pier Trust Previously Chair of the Institution of Civil Engineers (South of England), Brighton Round Table & Whoopsadaisy children’s charity Honorary Fellow of the University of Brighton Alan Taylor HR Director Alan Taylor Personal Profile Whilst maintaining an active Team leadership role, Alan manages HR and has more recently been responsible for championing and coordinating HOP’s involvement in local educational institutions. HOP is passionate about growing talent from within and particular emphasis can be seen in our work to recruit Apprentices and A level leavers via our Sponsored Degree Programme.  This is driven by Alan’s experience, working and studying part-time to degree level, alongside a natural apprentice route through the Draughting Office and into engineering design. Alan’s work in the construction industry started early, on site with his father, labouring and developing his construction awareness. Assisting senior engineers and running small works projects, Alan developed keen communication skills with site and fellow professionals, with the distinct advantage of site-based experience and awareness. Skills and strengths Structural monitoring and remedial works specification. Major refurbishment projects. Report writing and building forensics. 20 years of practical housing developer experience and innovation. Key responsibilities Acting as Expert Witness. Project Management; Principal Designer. PPC2000 Partnered Contracts (Core Group Member). HR Director looking after our staff, recruitment and training. Adam Humphrey IT Director Adam Humphrey Personal Profile Adam is a Director at HOP which he joined in 1998.  He has worked up through the company from a Graduate Structural Engineer, becoming a Director in 2008.  Adam has over 21 years’ experience, is a Chartered Structural Engineer, manages a large design Team and is responsible for IT and BIM at HOP. Adam’s design experience is extremely varied and he has successfully delivered projects with values from a few hundred to a few hundred million pounds.  Historically Adam has worked for Contractors which has provided him with a good understanding of site activities, which in turn provides further insight to his design knowledge. He is passionate about building positive lasting relationships with those he works with, by delivering what he promises and adding value to projects. Skills and strengths Extensive Education, Community and Residential Development design experience having managed Projects with over £1M of fees in the last 5 years BIM Certified Professional Collaboration of Construction Production Information using IT and 3D modelling Complex computer analysis and design for concrete and steelwork structures Good communicator and can explain in simple terms the benefits of a solution Passion for solving complex Structural design problems Innovation – Adam uses historic lessons learnt and successes, on today’s Project Focus on meeting customer requirements, building trust and long term relationships Key responsibilities Managing a large Structural Team Heads HOP IT and BIM progression Day to day management of Projects ensuring our Civil and Structural design team over-delivers Manages the HOP team to maximise collaboration and coordination with other team members and designers See that HOP designs economic, practical and buildable structures To challenge our decisions and designs by exploring alternatives To overcome and unlock difficult design problems Communicate honestly with the design team Nigel Hosker Director Nigel Hosker Personal Profile Nigel is a Director at HOP, a Chartered Civil Engineer and heads the Maritime Team in his role as a Civil / Coastal Engineer.  Nigel has a good grounding in large scale Civil Engineering works, having experience of the whole construction process from initial client contact, scheme design, feasibility and detailing, as well as managing engineering projects, including approvals and licensing, procurement procedures and contract administration. Nigel is used to managing multi-disciplinary projects including collaborating with experts in fields such as: Hydraulic Modelling, Cathodic Protection, Mechanical and Electrical Engineers, Engineering Geologists, and Commercial Diving operations.  Nigel frequently works with contractors and is often engaged to design temporary works or to act as the designer in ‘Design and Build’ projects. Skills and strengths Delivery of civil and structural engineering works through the full project cycle Mentoring Civil Engineers (ICE Supervising Civil Engineer) Design and maintenance of seaside pier structures including preparing refurbishment proposals and inspections Scheme planning and detailed design for residential waterside developments Design of large scale temporary works both on land and in water Contract administration and attendance of construction works including NEC and ICC conditions of contract. Experienced in flood defences, breakwater maintenance, port facilities, land reclamation, RNLI boathouses and slipways, Planning, listed Building MMO, PLA and other licencing Key responsibilities Leading and Developing the Maritime Team Project Management of Civil Engineering works Principal Designer on numerous projects. Civil Engineering, quality and financial risk management Tristan Banks Director Tristan Banks Personal Profile Tristan joined HOP in 2014 and has over 11 years of experience in the maritime, ports and heavy civils sectors. Since joining HOP and achieving Chartership, Tristan has operated as Project Engineer on Pendennis Wet Dock, Brighton, Cromer and Worthing Piers together with managing long-term maintenance strategies for various assets, such as the breakwaters at Brighton Marina. Tristan was appointed as an Associate in May 2019. Under HOP’s social value initiative, Tristan volunteers his time at the University of Brighton; presenting and undertaking practice interviews for final year undergraduates. This assists them to develop their technical knowledge, presentation skills and construction awareness in order to prepare them for working in the industry. Tristan is also a keen cyclist, sailor and kitesurfer and has enjoyed raising funds for charity at local events, including taking part in the Guinness World Record for the ‘longest parade of kitesurfers’. Tristan is active in club level motorsport in his Classic Mini and is a marshal at various national rally events with Motorsport UK. Skills and strengths Chartered Engineer with the ICE, CEng MICE. BEng (Hons) and Post Graduate Certificate in Civil Engineering. APM-IC Project Management Certificate. Construction Skills Certification Scheme (Manager & Professional). First Aid at Sea, Work at Height and Confined Space trained. Principal Designer duties under the CDM Regulations 2015. Key responsibilities Providing leadership, guidance and technical support in the HOP Marine Team. Carrying out conceptual scheme input and defining the basis of design. Ensuring that only quality calculations, reports and drawings are produced. Reviewing projects, detailing and specifications. Leading inspections, reporting and advising on maintenance and monitoring strategies for our clients. Associates Adam Ellis Associate Adam Ellis Personal Profile Adam has over 17 years’ experience in Structural Design and Analysis in all materials from concept to detailed design stage. Adam graduated in 2000 after completing a MEng and a sandwich year in the water industry.  He has worked at several companies on projects including extensive school development work for local authorities, industrial & commercial developments and housing projects from 4 to 500 units. In addition, he has provided engineering for domestic work of all types. Adam reached Chartership in 2008 and rose to Associate in 2015. Skills and strengths Working closely with Clients, Architects, M&E and Contractors. Understanding the Construction process and buildability. Commercial awareness of design decisions. Developing and Maintaining Relationships. Providing site support. Key responsibilities Running projects and liaising directly with all parties during the construction process. Managing teams of CAD Technicians and Engineers on a variety of projects. Producing structural information for early scheme designs through to construction. Training and developing Undergraduate & Graduate Engineers. Andrew Keen Associate Andrew Keen Personal Profile Andrew is a Chartered Civil Engineer with over 15 years’ experience in road and drainage design. He heads up the company’s Civils & Infrastructure team tasked with all aspects of roads, drainage and external works design. From feasibility assessments to construction stage specifications, the Civils & Infrastructure team works on a wide variety of briefs on large housing schemes, commercial developments, hotels and schools through to individual properties. This contributes to Andrew and his team’s broad skills set and understanding of practical Civil Engineering with a strong focus on sustainability. Sustainable Drainage Systems (SuDS) are particular passion of the team. We endeavour to combine a practical and efficient approach to drainage design while maintaining the highest standards in the management of water quantity, water quality, amenity and biodiversity. Skills and strengths Sustainable Drainage Systems (SuDS) design & implementation. Roads, Drainage & External Works Design. Flood Risk Assessments & Drainage Strategies. SuDS Assessments & Verification reports. S278 & S38 adoptable Highways works. S104, S106 & S185 adoptable drainage design, sewer connections and diversions to the Design & Construction Guidance ( Sewers for Adoption ) standards. Phase 1 Contamination Assessments – Desk Studies. AutoCAD / Civils 3D / Microdrainage / InfoDrainage suite of Civil Engineering software tools. BIM coordination with 3D drainage modelling for importing to Revit. Retrofitting of SuDS features for existing and brownfield developments. Well-established and long-standing professional relationships with a wide range of stakeholders, statutory bodies and developers. Key responsibilities Day to day management of projects to effectively meet the needs of internal and external Clients. Management of HOP Civils team, maximising collaboration and communication. Keeping ahead of the field with knowledge sharing and training in the latest legislative and technological advances. Additional responsibilities for pre-planning liaison with Statutory Authorities, Clients and stakeholders, producing master-planning SuDS strategies. Jon Fox Associate Jon Fox Personal Profile Jon joined HOP in 2006. He has more than 25 years of experience in structural design and engineering in residential, commercial and industrial projects.   This experience in conceptual, detail design and construction, make him one of our leading structural engineers.  Jon has practised the design of structures for consultants and contractors in various fields, working on prestigious and interesting projects of all scales.  Jon is also keen on DIY at home, he commutes by bike in all weather, and is regularly seen running on the South Downs. Skills and strengths Concept and detail design Finite element and frame analysis Building Information Modelling (BIM) Advanced knowledge in design, fabrication and construction of steel structures Advanced knowledge in design, fabrication and construction of pre-cast concrete structures Key responsibilities Management of Structural Design Team Conceptual and detail design Associate managerial tasks Principal Designer Carlo Sabia Associate Carlo Sabia Personal Profile Having completed a degree in Economics at Southampton University, Carlo turned his attention to structural engineering in 2009 when he joined HOP. He initially started as an AutoCAD and Revit draughtsman whilst completing his HNC and MSc in Civil Engineering. Carlo has quickly progressed through to the design and detailing of a range of projects from domestic alterations to new residential, commercial and educational developments. Skills and strengths Extensive experience in Structural Analysis Design Software Multi-storey steel frames/ large portal frames Multi-storey concrete framed buildings Highly proficient in AutoCAD and Revit Understanding the construction process, taking into account ‘buildability’ within a project Providing site support during construction Delivering Projects using BIM Good Communicator Key responsibilities Manages HOP Structural Team Structural design and analysis using design software including 3D Masterseries, Tedds, FEM analysis of concrete frames, CSC FastTrack Detailed design of multi storey R.C frames, steel frames Lead project design for complex commercial schemes Complex foundation solutions Overseeing workload of Revit Technicians/Junior Engineers Running projects & liaising with the whole design team through the construction process HOP House, 41 Church Road, Hove, BN3 2BE T. +44 (0)1273 223900 ask@hop.uk.com All rights reserved HOP Consulting Ltd. Company No. 4402211. Privacy Policy Site Credits"
    },
    {
      "url": "https://www.hopandstuff.com/pages/contact-us",
      "text": "Get in Touch | Hop & Stuff Loading Skip to content Home CZECH Malt Hops Expand submenu Collapse submenu Hops All Hops US European Australian & New Zealand Organic Hops Concentrates & Purees Expand submenu Collapse submenu Concentrates & Purees Juice Concentrates Purees Aromatics & Flavors Expand submenu Collapse submenu Aromatics & Flavors Aromatics & Botanicals Liquid Natural Flavors LUKR Expand submenu Collapse submenu LUKR All Faucets, Spare Parts & Accessories Direct Sales Expand submenu Collapse submenu Direct Sales DOLIUM® Kegs Download Product List About Us Expand submenu Collapse submenu About Us Resources Log in Search Menu 0 items $0.00 Check out Search Log in Search CZECH Malt Hops All Hops US European Australian & New Zealand Organic Hops Concentrates & Purees Juice Concentrates Purees Aromatics & Flavors Aromatics & Botanicals Liquid Natural Flavors LUKR All Faucets, Spare Parts & Accessories Direct Sales DOLIUM® Kegs Download Product List About Us Resources Menu Cart 0 Search Close (esc) Get in Touch Whether you're a first time customer with a question or long time customer dying to tell us about the last brew you made, we would love to hear from you! *Mandatory field ABOUT US FAQ GET IN TOUCH CODE OF CONDUCT PRIVACY POLICY TERMS OF SERVICE Get in Touch We make brewing better. Instagram LinkedIn Email Stay in Touch Get cool news and the latest on all things brewing directly to your inbox. No spam, we promise, but we will send photos of our pets. 🍻 Enter your email © 2025 Hop & Stuff Powered by Shopify Close (esc) Loading"
    },
    {
      "url": "https://www.hopback.co.uk/contact-us/",
      "text": "Hop Back Brewery Contact Us | Get in Touch with Our Team Hop Back Brewery info@hopback.co.uk 01725 510 986 0 Menu Our Beers Our Story Our Pubs Menu Our Shop Contact Us Allergen Info Menu Our Beers Our Pubs Our Story Home Our Shop Contact Us Allergen Info Contact Us Please fill out the form below and we will get back to you as soon as possible. This is a contact form for the brewery. To contact one of our pubs please click here . For any sales enquires either give us a call on 01725 510 986 or email us at: sales@hopback.co.uk Your Name Your Email Subject Your Message *Please do not send an enquiry to make a table booking at the Sultan or Waterloo, please call or email the pub direct. Thank you. Sultan: sultan@hopback.co.uk or 020 8544 9323 Waterloo: thewaterlooarms@outlook.com or 02380 220 022 My Account Deliveries & Returns Privacy Policy Terms & Conditions S172 Statement Salsa Certificate Copyright © 2025 Hop Back Brewery"
    },
    {
      "url": "https://sipandscript.com/venue/hop-life-brewing/",
      "text": "Hop Life Brewing - Sip & Script 0 No products in the cart. Cart Total: $ 0.00 Events In-Person Events Virtual Events Corporate Events Host Private Event Become an Event Partner Host a Private Event About Script Squad FAQs Press Shop Our Essentials Free Practice Sheets Free Phone Wallpapers Free SVG/PNG files Gift Cards Blog Contact Events In-Person Events Virtual Events Corporate Events Host Private Event Become an Event Partner Host a Private Event About Script Squad FAQs Press Shop Our Essentials Free Practice Sheets Free Phone Wallpapers Free SVG/PNG files Gift Cards Blog Contact Hop Life Brewing 0 events found. Notice There were no results found. Notice There were no results found. Hop Life Brewing Events Venues Hop Life Brewing Address 679 Northwest Enterprise Drive Port St. Lucie , FL 34986 United States Get Directions Phone (772) 249-5055 Website https://www.hoplife.com/ Events at this venue Today Upcoming Upcoming Select date. Previous Events Today Next Events If you have any questions or need help signing up for a class please email us at events@sipandscript.com . Home About Events Shop Squad Practice Blog Contact Corporate Events Private Events Search By State FAQ Connect Copyright © 2025 Sip & Script, Inc. Privacy Policy & Terms of Use"
    }
  ]
}