{
  "fuentes": [
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "email": "info@blockbrewingcompany.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://www.hopsizedbrewing.com/",
      "email": "black_denim_@2x.png"
    },
    {
      "url": "https://www.conshohockenbrewing.com/contactus",
      "email": "contactus@conshohockenbrewing.com"
    },
    {
      "url": "https://www.conshohockenbrewing.com/contactus",
      "email": "contactus@conshohockenbrewing.com"
    },
    {
      "url": "https://www.conshohockenbrewing.com/contactus",
      "email": "events@conshohockenbrewing.com"
    },
    {
      "url": "https://www.bostonbeer.com/contact-us",
      "email": "media@bostonbeer.com"
    },
    {
      "url": "https://www.hopsizedbrewing.com/about-us/",
      "email": "black_denim_@2x.png"
    },
    {
      "url": "https://upslopebrewing.com/contact-us/",
      "email": "brewers_association_logo@2x.png"
    }
  ],
  "mails": [
    "accounts.payable@parkwaybrewing.com",
    "black_denim_@2x.png",
    "brewers_association_logo@2x.png",
    "contactus@conshohockenbrewing.com",
    "events@conshohockenbrewing.com",
    "events@parkwaybrewing.com",
    "grant@parkwaybrewing.com",
    "info@blockbrewingcompany.com",
    "kim@parkwaybrewing.com",
    "media@bostonbeer.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com"
  ],
  "nombre_sitio": "hopsizedbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "text": "Contact Us - Block Brewing Skip to content FACEBOOK INSTAGRAM Home About Block Brewing – Brighton Block Brewing – Howell Banquets & Catering Our Beers Mug Club Gift Cards Events News Employment Contact Contact Us Contact we would love to hear from you You can Get in touch with us by email, phone, mail or by filling out the form below how to reach us bLOCK BREWING - HOWELL, MI By Mail: 1140 S. Michigan Ave. Howell, MI 48843 Email: [email protected] Phone: (517) 540-0300 bLOCK BREWING - BRIGHTON, MI By Mail: 1840 South Old US 23 Brighton, MI 48114 Email: [email protected] Phone: (810) 206-3990 get in touch Send Brighton Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm Howell Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm catering or banquet inquiries Click for more info on catering or banquets 🚨🍻NOW   ON   TAP   AT   OUR   BRIGHTON  ... Open We're   kicking   off   American   Craft   Beer   Week  ... Open Happy   Mother's   Day   to   all   you   amazing  ... Open 🚨🍻Now   on   Tap   at   our   Brighton   Location:   TAN  ... Open Happy   Cinco   de   Mayo!! We've   got   some... Open May   The   4th   Be   With   You! Stop   into   the  ... Open Happy   Friday   Everyone,   we   made   it   to   the  ... Open Happy   Saturday!! We're   throwing   out... Open 🚨🍻NEW   BEER   ALERT   🚨🍻 ... Open It's   Flux   Friday!!!   Come   enjoy   this   beautiful... Open It's   a   beautiful   day   to   come   enjoy   a   brew   on  ... Open Hoppy   Easter!!   We're   throwing   out   some   new,  ... Open Happy   National   Beer   Day!! Come   celebrate  ... Open Something   Wicked   this   way   comes.   .   With  ... Open It's   a   slam   *Dunk*,   vote   Block   for   March  ... Open Load More This error message is only visible to WordPress admins Error: Access Token is not valid or has expired. Feed will not update. Contact us block brewing Howell Facebook 1140 S Michigan Ave Howell, MI 48843 (517) 540-0300 [email protected] block brewing Brighton Facebook 1840 South Old US 23 Brighton, MI 48114 (810) 206-3990 [email protected] Howell hours Sun-Thurs: 11am -10pm Fri & Sat: 11am - 11pm Brighton hours Sun-Thurs: 11am - 10pm Fri & Sat: 11am - 11pm quick links Our Brews Brighton Location Howell Location Mug Club Gift Cards Banquets & Catering Employment Block Brewing Company was founded on the concept of bringing together a simple love of craft beer and great food and we want to share that passion with you. Designed and powered by Brewing Sites | Privacy Policy"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://www.hopsizedbrewing.com/",
      "text": "Hopsized Brewing Co. in Bonita Springs, FL | Craft Brewery in Florida Skip to content Home About Us Our Story On Tap Weekly Happenings FAQ Visit Reservations Home About Us Our Story On Tap Weekly Happenings FAQ Visit Reservations Facebook Instagram Your hoppy third space bonita springs, fl See what's on tap Crafting A future For better communities Hopsized Brewing Co. blends the evolutionary scope of art and science to deliver high-quality and passionately crafted brews for all beer lovers to enjoy. Our warm and welcoming family-friendly third space will host many special events like our monthly ‘Night Market at The Springs’, Latin Night, and much, much more! UPCOMING EVENTS Weekly Releases We release newly curated beers every Thursday! From traditional lagers, Nebulous IPA and APAs, stouts, Kölsch’s, and fruited sours, we have something for everyone! Subscribe and follow us on Untappd and social media for weekly beer release updates. host your next private event From birthday parties, rehearsal dinners, weddings, to work and networking functions, click below to book the brewery for your next event. reservations events See What's Happening From Yoga to our Run Club to Trivia Nights we always have something happening! Check out what's coming up at Hopsized. Events About Us Meet the Team Learn more about the awesome people that make great beer and memorable experiences! ABOUT US brewery Learn More From water-to-glass, all our beers are brewed on our 3.5 bbl Ss Brewtech electric brewhouse. Each beer is curated to be made to style using our reverse-osmosis (RO) water system.  Using advanced technology like our Plaato Pro’s, to our dry-hop induction system, we strive to produce only highly quality beers for our community and out-of-State visitors to enjoy year-round! brewery 9201 COCKLESHELL CT, UNIT 13 BONITA SPRINGS 239-317-2287 reservations Facebook Instagram \"best small brewery in florida - 2023\" hours Monday: Closed Tues – Thurs: 3pm – 9pm Friday: 3pm – 10pm Saturday: 12pm – 10pm Sunday: 12pm – 5pm links on tap events about us faq don't miss out Join the list to learn about special events & beer releases! Join! powered & designed by Brewing sites | Privacy policy"
    },
    {
      "url": "https://www.conshohockenbrewing.com/contactus",
      "text": "Contact Us — Conshohocken Brewing Company Cart 0 HOME Locations BEER Events spaces Contact Us Jobs Our Partners SHOP Conshy Express Back Conshohocken Bridgeport King of Prussia Phoenixville Cart 0 HOME Locations Conshohocken Bridgeport King of Prussia Phoenixville BEER Events spaces Contact Us Jobs Go where the path takes you Our Partners SHOP Conshy Express Contact Us Events events@conshohockenbrewing.com Events spaces Let's Get started General Inquiries contactus@conshohockenbrewing.com Sign up to get the latest news from Conshohocken Brewing Co. Sign up with your email address to receive news and updates.* Email Address Sign Up *We respect your privacy and will never share your information with third parties Thank you! Conshohocken Brewing Company 739 East Elm Street, Conshohocken, PA, 19428 610-897-8962 contactus@conshohockenbrewing.com Hours Mon 4 PM - 10 PM Tue 4 PM - 10 PM Wed 4 PM - 10 PM Thu 4 PM - 11 PM Fri 3 PM - 12 AM Sat 11 AM - 12 AM Sun 11 AM - 8 PM"
    },
    {
      "url": "https://www.bostonbeer.com/contact-us",
      "text": "Contact Us | Boston Beer Co. Search Menu Close Menu About Us Back About Us About Us Our Leadership Our Story Beer and Beyond Back Beer and Beyond Beer and Beyond Samuel Adams Dogfish Head Truly Twisted Tea Angry Orchard Tap In Back Tap In Tap In Come Visit Us What's Next Our Impact Back Our Impact Our Impact Sustainability Social Impact Careers Back Careers Careers BBC Invests in Coworkers Inclusion & Belonging Early Talent Programs Investors Contact News Skip to main content ABOUT US BEER AND BEYOND TAP IN OUR IMPACT CAREERS About Us Our Leadership Our Story Beer and Beyond Samuel Adams Dogfish Head Truly Twisted Tea Angry Orchard Tap In Come Visit Us What's Next Our Impact Sustainability Social Impact Careers BBC Invests in Coworkers Inclusion & Belonging Early Talent Programs Investors Contact News Search Home Contact Us Contact Us Reach out and let's catch up over a drink (or email) The Boston Beer Company One Design Center Place, Suite 850 Boston, MA 02210 617-368-5000 Product feedback or brand inquiry? Angry Orchard Angel City Brewery Coney Island Brewing Dogfish Head Hard Mountain Dew Samuel Adams TeaPot Truly Hard Seltzer Twisted Tea Boston Beer Ethics Hotline Hosted by EthicsPoint, an independent third party: 888-261-1717 Or submit a report The Boston Beer Ethics Hotline is intended for the reporting of unethical, illegal, or improper activity. It is not generally intended for consumer concerns. For consumer-related concerns, please call us at 617-368-5000. Reporter on a deadline? media@bostonbeer.com For shareholder and investor relations, please visit our Investor site for contact information. For 40 years, our mission has remained the same: Seek long-term profitable growth by offering the highest-quality product to the U.S. beer drinker. Instagram LinkedIn X Contact Us One Design Center Place, Suite 850 Boston, MA 02210 617.368.5000 Get in touch Beer and Beyond Samuel Adams Dogfish Head Truly Twisted Tea Angry Orchard View all Beer and Beyond Quick Links About Us Careers News Our Impact Investors Terms and conditions Privacy Policy Responsibility"
    },
    {
      "url": "https://www.hopsizedbrewing.com/about-us/",
      "text": "Hopsized Brewing Co. Skip to content Home About Us Our Story On Tap Weekly Happenings FAQ Visit Reservations Home About Us Our Story On Tap Weekly Happenings FAQ Visit Reservations Facebook Instagram about us learn more our story Hopsized Brewing Co. started off like most craft-breweries: homebrewing in a garage! Originally from Miami, Florida, co-founders Ana and Darlyn (a.k.a Vic) relocated to Fort Myers in 2016. Vic began homebrewing May of 2019, following suggestions from Ana, given his growing love for craft beers at the time, especially NEIPAs. A few months later, they were off to winning awards at local homebrewing competitions. Vic continued to expand his knowledge for brewing, applying his background in science each step of the way, from learning water chemistry, recipe creation, hop utilization, blending, survivables, the importance of pH, and healthy yeast management. It wasn’t long before their entrepreneurial drive led them to formulate a business plan. A little over 2.5 years later, Hopsized Brewing Co. opened its doors in beautiful Bonita Springs, Florida. meet our crew the hopsized brew crew Michael King a.k.a Mike From: Sarasota, Florida Favorite Beers: Wild Ales and NEIPAs Favorite Beer at Hopsized: Postcard Fun Fact: I graduated from UF Hobbies: Basketball, Vinyl, Bowling, Traveling, Howard Stern Patric John a.k.a Pat From: South Fort Myers Favorite Beers: NEIPAs and Coconut Coffee Porters Favorite Beer at Hopsized: Elusive Juice w/ Phantasm Fun Fact: I love old-school classical music Hobbies: Playing guitar, everything sports related, and being a dog dad Kaitlyn Rodulph a.k.a Kait From: Port Orange, Florida Favorite Beers: Reds and NEIPAs Favorite Beer at Hopsized: Sláinte Fun Fact: I love outer space and wanted to be an astronaut when I “grew up” Hobbies: cooking, telling jokes, traveling, playing the ukulele, anything outdoors Sydney Sakalosky a.k.a Syd From: Omaha, NE Favorite Beers: Sours Favorite Beer at Hopsized: Berry Potion or Poison Ivy Fun Fact: I'm a huge true crime junkie Hobbies: Hiking, reading, writing poetry, lifting, traveling Brittany Axelson a.k.a Britt From: Clearwater, Florida Favorite Beers: Dark Lagers and Sours Favorite Beer at Hopsized: Sláinte and Poison Ivy Fun Fact: I live in a tiny house (yes like the ones you see in HGTV) Hobbies: Wood working, gardening, 3D printing, home brewing plan your visit Find out our brewery hours, get answers to frequently asked questions and discover our broad selection of beers on tap. learn more 9201 COCKLESHELL CT, UNIT 13 BONITA SPRINGS 239-317-2287 reservations Facebook Instagram \"best small brewery in florida - 2023\" hours Monday: Closed Tues – Thurs: 3pm – 9pm Friday: 3pm – 10pm Saturday: 12pm – 10pm Sunday: 12pm – 5pm links on tap events about us faq don't miss out Join the list to learn about special events & beer releases! Join! powered & designed by Brewing sites | Privacy policy"
    },
    {
      "url": "https://upslopebrewing.com/contact-us/",
      "text": "Upslope Brewing Company - Contact Us Got 21 years under that belt? YES NO Thanks for being honest, but if you're not 21 we can't let you inside. Home About Our Story PHILOSOPHY Sustainability Brews VIEW ALL Year-Round SEASONALS Spiked Snowmelt Hard Yerba Mate Non-Alcoholic Hop-Boosted IPA Tap Rooms General Info Flatiron Park Lee Hill Après Outpost Events Calendar BOOK AN EVENT THE UPSLOPE GET DOWN BACKCOUNTRY TAP ROOM Blog Store Contact Home About Our Story PHILOSOPHY Sustainability Brews VIEW ALL Year-Round SEASONALS Spiked Snowmelt Hard Yerba Mate Non-Alcoholic Hop-Boosted IPA Tap Rooms General Info Flatiron Park Lee Hill Après Outpost Upslopebrewing Events Calendar BOOK AN EVENT THE UPSLOPE GET DOWN BACKCOUNTRY TAP ROOM Blog Store Contact HOLLER AT YOUR BREWER. Close Enter your text here FILL THIS OUT. WE’LL RESPOND BETWEEN BATCHES. Name * Email * Zip Code * Type Of Inquiry * Type of Inquiry* Beer Feedback Sales Marketing Events Sponsorships/Donations Media Inquiries Tap Room Inquiries/Feedback Employment Online Store Band Booking Other Inquiries Message CAPTCHA Email This field is for validation purposes and should be left unchanged. Submit This iframe contains the logic required to handle Ajax powered Gravity Forms. FLATIRON PARK 1898 S. Flatiron Court Boulder, CO 80301 (303) 396-1898 SUNDAY-SATURDAY: 11 AM – 9 PM LEE HILL 1501 Lee Hill Dr Boulder, CO 80304 (303) 449-2911 SUNDAY-SATURDAY: 2 – 9 PM BOOK AN EVENT PARTY TIME PRESS GET THE BUZZ SPONSORSHIPS HIT US UP Press Sponsorships Jobs Contact Beer Feedback GET UPSLOPE UPDATES STRAIGHT TO YOUR INBOX Enter your email address to get periodic updates on our seasonal brews, upcoming events, special deals and more. JOIN Leave this field empty if you're human: Copyright© 2017 Upslope Brewing Company"
    }
  ]
}