{
  "fuentes": [
    {
      "url": "http://www.horsepowerpavilion.com/accommodation/",
      "email": "info@horsepowerpavilion.co.uk"
    },
    {
      "url": "http://www.horsepowerpavilion.com/accommodation/",
      "email": "info@horsepowerpavilion.com"
    },
    {
      "url": "https://hospitalitysnapshots.com/projects/30384/hamiltons-restaurant/",
      "email": "you@company.com"
    },
    {
      "url": "https://www.horsepowerpavilion.com/acitivities/car-shows/",
      "email": "info@horsepowerpavilion.co.uk"
    },
    {
      "url": "https://www.horsepowerpavilion.com/acitivities/car-shows/",
      "email": "info@horsepowerpavilion.com"
    },
    {
      "url": "http://www.horsepowerpavilion.com/",
      "email": "info@horsepowerpavilion.co.uk"
    },
    {
      "url": "http://www.horsepowerpavilion.com/",
      "email": "info@horsepowerpavilion.com"
    },
    {
      "url": "http://www.horsepowerpavilion.com/acitivities/fish-and-chips/",
      "email": "info@horsepowerpavilion.co.uk"
    },
    {
      "url": "http://www.horsepowerpavilion.com/acitivities/fish-and-chips/",
      "email": "info@horsepowerpavilion.com"
    },
    {
      "url": "http://www.horsepowerpavilion.com/our-team/",
      "email": "info@horsepowerpavilion.co.uk"
    },
    {
      "url": "http://www.horsepowerpavilion.com/our-team/",
      "email": "info@horsepowerpavilion.com"
    },
    {
      "url": "https://www.hamiltonsteak.com/",
      "email": "manager@hamiltonsteak.com"
    },
    {
      "url": "http://www.horsepowerpavilion.com/acitivities/bistro/",
      "email": "info@horsepowerpavilion.co.uk"
    },
    {
      "url": "http://www.horsepowerpavilion.com/acitivities/bistro/",
      "email": "info@horsepowerpavilion.com"
    },
    {
      "url": "https://www.hp.com/us-en/hp-information/executive-team/team.html",
      "email": "executiveleadership_1920_alex_cho@2x.jpg"
    },
    {
      "url": "https://www.hp.com/us-en/hp-information/executive-team/team.html",
      "email": "executiveleadership_1920_enrique_lores@2x.jpg"
    },
    {
      "url": "https://www.hp.com/us-en/hp-information/executive-team/team.html",
      "email": "executiveleadership_1920_tuan_tran@2x.jpg"
    }
  ],
  "mails": [
    "executiveleadership_1920_alex_cho@2x.jpg",
    "executiveleadership_1920_enrique_lores@2x.jpg",
    "executiveleadership_1920_tuan_tran@2x.jpg",
    "info@horsepowerpavilion.co.uk",
    "info@horsepowerpavilion.com",
    "manager@hamiltonsteak.com",
    "you@company.com"
  ],
  "nombre_sitio": "horsepowerpavilion.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://www.horsepowerpavilion.com/accommodation/",
      "text": "Accommodation – Horse Power Pavilion – Coffee Shop | Bistro | Weddings | Events | Accomodation 4497 State Highway 20 W, Freeport, FL 32439 +1 850 520 1737 info@horsepowerpavilion.co.uk Follow Us Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Menu Accommodation Beautiful Views Our grounds are set in the beautiful city of Freeport, Florida. Parking Space We offer secure parking for all visitors including CCTV. Breakfast Prepare your own breakfast or make use of our food & drink stalls. Coffee Barista Our expert barista are located on the ranch to relax and socialize. The Gold Horse's Ranch Holland Cottage at the Gold Horses Hide Away Retreat @ TheGoldHorses Private open plan lodge, ideal for a family or guest sharing with large bathroom and open living space. Access to pool and fire pit areas set within 55 acres of the private ‘Horse Power Pavilion” Ranch. Onsite coffee shop yet only 20 minutes to the most beautiful beaches in the world. Water access for small boat or kayak. This suite has kitchenette area with microwave and fridge freezer. Ample parking and a real feel of peace and tranquillity. Relax and unwind at our beautiful property. 1 Bedroom Sleeps 4 From $200 per night Holland Cottage at the Gold Horses Private 1 bedroom suite with large bathroom and open living space. Access to pool and fire pit areas set within 55 acres of the private ‘Horse Power Pavilion” Ranch. Onsite coffee trailer yet only 20 minutes to the most beautiful beaches on the emerald coast. Water access for small boat or kayak. This suite has kitchenette area with microwave and fridge freezer. Ample parking and a real feel of peace and tranquillity out in the countryside. Relax and unwind at our beautiful property. 1 Bedroom Sleeps 2 From $200 per night 0 Miles From the city centre 0 -Acre Outdoor activity centre 0 five star rating 0 international guests Airbnb Reviews This was a delightful cottage!  Loads of room, great AC, very accommodating and delicious food on site. We will definitely return for Kate’s hospitality! Lisa June 30, 2022 Read the reviews closely. What you see is sort of what you get. This stay felt like an April Fool’s Joke. I was Leary how Kate always has a response ... read more for every review but never acknowledges any concerns. I have requested my cleaning fee back and am still waiting. The two positives were the pool and how close it was to the beach. We woke up Uber early after very little sleep and headed out ASAP to be on the sand. The hot rub doesn’t seem to work. The WiFi code is not listed on the guest access sign in the unit and the link not work on the site. There was no way to join and no service there. Jan June 25, 2022 Loved staying in this private hideaway. The pavilion being on property made the trip fun and the food was great. Super easy drive to the beach on the side with ... read more no toll bridge. Loved this place. Parker June 24, 2022 Great location, setting and accommodations!  Close enough to activities and yet allowed us to unwind away from the hustle and bustle.  Very clean and nicely decorated.  Host ... read more is very responsive!!  Thank you and we hope to come back soon Kirk June 20, 2022 This is a nice quiet area. I was visiting my son and Kate’s place was just down the street from where he lives so the location was very convenient. There ... read more was a little mixup on the check in time but it was all resolved quickly. Unfortunately the food truck, coffee shop etc wasn’t open during our stay but I hear that it’s great. I hope to be able to return and experience it all. Kelly June 15, 2022 Lovely stay, nice facility. Kate was exceptional Sheilla June 12, 2022 Everything was great inside the cottage! The farm is beautiful and we especially loved Kate’s story about moving to the US and building this dream! Jessica June 9, 2022 This is a nice little place! Open floor plan with lots of space to move around. Kendall May 14, 2022 Perfect little cottage to get away for a little while ! Harold April 9, 2022 A delightful and comfortable cottage. Especially enjoyed sitting outside by pool in the mornings. A special treat was the Pavilion where we could enjoy delicious  fish & chips, brisket ... read more burgers and libations a couple times a week.  Good location for getting quickly to beaches without heavy traffic. Lynn April 8, 2022 Loved our stay!! On site food was amazing 🤩 Delavon March 29, 2022 Very clean Great for a couple Spacious shower Nice land Great service Vincent March 20, 2022 Great location and the perfect space for my solo beach trip! Directions could have been tricky if Kate didn't provide such clarity here  I also loved that the cottage ... read more had a vanity! Jasmine December 6, 2021 Our stay was great and the cottage was very cute and clean. It wouldn't have been absolutely amazing amazing had the coffee shop and and food court been open. Juanita November 14, 2021 I booked this cottage for my parents so they could be close to my home while they were visiting. From the beginning Kate was so accommodating and quick to answer ... read more any questions I had. My parents were impressed by how clean and comfortable it was there. My mother said it was peaceful and a nice change of scenery for them. I would recommend this place to any one visiting the area and next time my parents come to town I hope the cottage is available. Ericka November 4, 2021 Kate's place is wonderful, quiet, clean and close to everything.  Definately a great place to stay and will be back! Laura Collins - Laura October 20, 2021 We loved staying here. We had never been to the area but the location was close enough to everything that it wasn't a big deal to get out if we ... read more needed something or wanted to go anywhere. The beaches are close by as well so that was nice. The host left brochures and booklets of things to do in the area that even had coupons so there were plenty of options for activities in the area. GPA takes you straight to the location. The only part we found difficult was when we got there figuring out where to go to get to the cottage, bjt kate did a wonderful job at explaining which way to go. It was very private considering the location has a bar, coffee shop, food trucks, and a future restaurant on site. These things were really neat to have there because we could walk to the bar. They even had a band playing one night which was cool. Loved talking with Kate. Made me miss being in England. It was a great experience and stay. We loved it! Breanna October 11, 2021 Very convenient and accessible for the area I was visiting. The accommodations were very nice and comfortable. Sandra K October 1, 2021 Excellent place to stay we had a great time. Daniel September 19, 2021 Beautiful and charming location. Make sure you get the Fish and Chips from the food truck and bring water/coffee if you check in late, no store is open late. ... read more /> Great communication, clean, private, it was great! Adam September 12, 2021 Really nice place way larger and more convenient than a hotel.  it is really nice to have a pool and not have kids running everywhere.  It was peaceful ... read more and and a very good experience.  I will.say the dock pictured is in needof repair I dont know how many people plan on using it. I do wish the small refrigerator was bigger or on a having back issues it was hard to reach. All in all very nice place 30 minutes to the beach maybe 10 to supermarket and restaurants we would stay again for sure. Lawrence September 7, 2021 The service on the way is horrible. Other wise it was a great place to stay, I wish we could’ve stayed longer. Kate was very nice and allowed my bf ... read more and I to bring our 2 small dogs. It was a last minute request since we evacuated from our area due to a hurricane. Really interesting ceiling fan in bedroom that worked with a remote was the j my frustrating thing about our stay. Chrishonna September 5, 2021 I needed a place to flee from Ida. It was fine for that. However it is very basic. NO INTERNET even though it was advertised. It felt like she wasn't ... read more quite ready to host guest yet. There's very little furniture even though the space was quite large. Kate seems to have spotty cell service so communications were difficult. As long as your expectations aren't very high it was fine. Clean and neat. Betsy September 1, 2021 Horrible communication from the very start with Kate. I booked the air bnb (for a week) two days prior to check in and the day before check in messaged Kate ... read more to see if I could shorten my stay by 3 days but keep check in and everything else the same. I was down here with my one and three year old to visit their dad as he has been down here trucking the past couple weeks. He got notice the day before check in they would be sending him home early. I never heard from Kate and had to get an air bnb representative to contact her in order for her to finally text me back from her personal phone 3 hours before check in. She blamed it on the app update as to why she hadn’t contacted me back even though I called and texted her personal phone as well. Then she claimed because it wasn’t a week prior to check in she couldn’t change the dates of my stay. So I called air bnb thinking it was an issue on their end. They were very helpful and supportive and tried getting her to agree to changing the dates but she wouldn’t because she said it wasn’t what she considered to be a situation that would require the change and a partial refund. Kate was extremely rude in the whole matter and honestly just very snakey with the whole way she tried to put the blame on air bnb for the reason she wasn’t contacting me and why she couldn’t change the dates. Would not recommend booking with her. I’ve never had such a horrible experience with a host. Very disappointing. Hannah August 28, 2021 Overall great place to stay! The pool was nice, we got to go to Destin, PCB, and Santa Rosa during our stay. Not too far from the beach, just beware ... read more there’s not great cell service once you’re on HWY-20. Kate was super friendly and helpful. Will definitely be coming back to Freeport, hopefully to this same AirBNB! Only downside was the small fridge and lack of stove (but that’s not a big deal if you plan on eating out a ton anyway)! Noah August 23, 2021 This home was so beautiful and absolutely everything in the pictures!❤️ Kate was an amazing host and communicated so kindly and quickly! It’s close to anything you could possibly need ... read more and also close to the beach! I would completely recommend this Airbnb and I would absolutely stay here again! Carijn August 6, 2021 Great location and very close to the beach! Price was very reasonable for that area. Rob July 28, 2021 Great location and very close to the beach! Price was very reasonable for that area. Rob And Dawn July 28, 2021 I really enjoyed my stay at “The Holland Cottage”. It was very clean and spacious! Kate was really nice and welcoming I will not stay anywhere else when I come ... read more back to Destin! LaShonda July 26, 2021 Pools was dirty and had crabs crawling around the bottom. The courtyard needed weeding as did the area around the outside of the unit. Landscape lighting around the courtyard was ... read more all broken and falling over so it was extremely dark at night. The road going into the place was really rough and full of potholes. It needed maintenance as well. Hard to find the unit at night with no lighting or directional signs. One small sign on the front beside the door but you actually pull up to the unit on the side so its impossible to see. Lots of storage boats, RVs, and other miscellaneous \"stuff\". Looked a little junky.  It just seems like the exterior has been neglected.  Its ashamed because it could be a really cool place. Inside was nice and comfortable. Unit was clean and well stocked(pots, pans, and cooking utensils). AC worked great and bed was clean and comfortable. Living room and bedroom were very spacious and had double doors that closed off for privacy. The vaulted ceiling was a nice touch that made it seem even larger. Good water pressure and ample hot water. Shower could use a good scrubbing. Had soap scum on the trays. I never did complain or ask for anything. I just thought that the exterior maintenance items should have been addressed without someone pointing the out.  Clearly if you have a grounds keeper they would see the pool full of debris and the weeds all over. Room was fairly cheap so I guess I got what I paid for. It would have been nice to take a dip in the pool though. Marty July 23, 2021 Kate’s space is amazing. The property is perfect for walking around and relaxing. The pool was a great bonus. Loved the people we met and the stay. Kaye and the ... read more Mayor were so great as well, making sure we had what we needed and checking in! Would absolutely come back! Samantha & Devin June 19, 2021 This airbnb is wonderful! The owner kate is amazing, and the location itself is super unique, quiet, and comfortable. We will be sure to stay here again on our future ... read more trips back home to fl. Austin May 22, 2021 Kates place is shiny clean, beautiful surroundings, lovely pool and patio  Comfy bed. So quiet too! Kaysee May 18, 2021 Beautiful listing but would only revisit if communication improved with host about basic things, better cleaning and dusting done, and adequate WiFi information were provided. Daniela May 10, 2021 This is a hidden gem, quiet, spacious and clean.Great hospitality and amenities. Fred and Kate are super host. Great little coffee shop. Marvingillman May 8, 2021 The barn is a nice space to stay in Freeport. It's decor was darling and very \"Florida\" and the bed is a step up from a motel. The pool is ... read more sparkling clean, but the area around it needs some love. The weather did not permit us to enjoy the pool this trip but maybe next time. On the Friday night that they were there, there looked to be something fun going on by the coffee shop with food and I think music, however we did not know about it ahead of time so we were not able to plan accordingly... maybe we can next time. Kerry April 24, 2021 Enjoyed our stay! Would visit again! Genesis April 19, 2021 We had a great time at the Holland Cottage! The place is very spacious and close enough to all the attractions.  Kate is an amazing host!  We would ... read more definitely stay there again. Sara April 4, 2021 Great place to stay!! Valerie March 31, 2021 Kate is a fantastic host! We enjoyed visiting with her and staying in Holland Cottage. The new Horse Power Pavilion is amazing! Mary March 21, 2021 I had to make a last minute trip to the Ft Walton area and someone suggested this place. It looked great and was available so I booked it. I was ... read more scheduled to stay for 2 nights. On the day of my trip on Sunday morning , my flight left almost 2 hours late and I made sure to message Kate right away. When I arrived at my connecting city the flight had been delayed and eventually cancelled. I tried to reroute my flight through every possible airport however the soonest AA could fly me was on Tuesday night. I messaged Kate feeling everything that had happened. She showed absolutely no empathy and when I asked her if I could use the reservation at a later date or get some sort of refund she did not reply. I asked her once again and didn’t grant my request. She only offered to waive the 80 dollar cleaning fee if I booked again. I was blown away by the lack of empathy and understanding from this host. I lost $330 on this reservation because of a circumstances beyond my control. Not very nice of host to do this. She could have at least refundé me one night and the cleaning few which she also charged her following guest. I’d think twice about staying here. Ximena March 2, 2021 Kates place was very clean and close to everything I needed while traveling for work Christie February 23, 2021 Wery nice spacious  efficency type cabin that is a notch above a motel room. If the weather is nice the dock and pool would be fun. The hostess was ... read more great, very prompt to answer any questions. Caroline February 16, 2021 Privately tucked into a beautiful landscape. Leslie January 22, 2021 This is a hidden gem, quiet, spacious and clean.Great hospitality and amenities. Fred and Kate are super host. Great little coffee shop. Marvingillman May 8, 2021 The barn is a nice space to stay in Freeport. It's decor was darling and very \"Florida\" and the bed is a step up from a motel. The pool is ... read more sparkling clean, but the area around it needs some love. The weather did not permit us to enjoy the pool this trip but maybe next time. On the Friday night that they were there, there looked to be something fun going on by the coffee shop with food and I think music, however we did not know about it ahead of time so we were not able to plan accordingly... maybe we can next time. Kerry April 24, 2021 Enjoyed our stay! Would visit again! Genesis April 19, 2021 We had a great time at the Holland Cottage! The place is very spacious and close enough to all the attractions.  Kate is an amazing host!  We would ... read more definitely stay there again. Sara April 4, 2021 Great place to stay!! Valerie March 31, 2021 Kate is a fantastic host! We enjoyed visiting with her and staying in Holland Cottage. The new Horse Power Pavilion is amazing! Mary March 21, 2021 Newsletter sign up Get latest news & update Subscribe Leave this field empty if you're human: Do you have questions? Call or visit us. +1 850 520 1737 4497 State Highway 20 W, Freeport, FL 32439 info@horsepowerpavilion.com Our Ranch Location & Map Accommodation Our Blog Career Our Brands AngryAss Coffee Nana Bettie's Hungry Heifer Hamilton's Bistro Holland cottages FIND US 2024 – Horse Power Pavilion. All rights reserved. Website Designed By B2B Creative Sign in Create an Account Username or email * Password * Login Lost your password? Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Follow Us"
    },
    {
      "url": "https://hospitalitysnapshots.com/projects/30384/hamiltons-restaurant/",
      "text": "Hamilton's Restaurant - Hospitality Snapshots Advertise Submit Browse Projects Project Type Restaurant Hotel Cafe / Bistro Bar / Brewery Amenity Space Winery Public Market Year Completed 2021 2020 2019 2018 2017 2016 2015 Location United States Australia Spain China Canada United Kingdom Ukraine Browse All Projects → Explore Photos Food / Beverage Bar Dining Area Host Station / Waiting Area Order Counter Patio / Terrace Kitchen Menu Board Hotel Facilities Check-in / Concierge Desk Guest Room Guest Room Bathroom Lobby / Common Area Outdoor Common Area Spa / Swimming Pool Gym / Fitness Center General Hallway / Corridor Restroom Exteriors Stairs Elevator Plans / Drawings Lighting Linear Pendant Floor Lamp Table Lamp Perimeter/Grazer Recessed Downlight Cylinder / Round Browse All Photos → Products Brands Furniture AIS Allermuir Andreu World Buzzispace DARRAN Davis Furniture Division 12 Grand Rapids Chair Herman Miller Hightower Kettal Keilhauer KFI Studios Kimball Knoll Muuto National OFS Pedrali ROOM Source International Venue Industries Viccarbe Lighting A-N-D Eureka Fluxwerx Luxxbox Vibia Windows Winco Window Materials Login Join Tour Projects Browse Photos Save Share Share Tweet Hamilton’s Restaurant Hamilton’s restaurant in Detroit pays tribute to Hamilton Carhartt’s legacy with a design by Groundswell Design Group and Neumann/Smith Architecture featuring high ceilings and warm wood tones. Firm Groundswell Design Group , Neumann/Smith Architecture area / size 3,700 sqft Year 2024 Location Detroit , Michigan , United States , Type Restaurant , Hamilton’s, nestled within The Godfrey Detroit, stands in homage to the legacy of Hamilton Carhartt, whose factory once thrived on this historic site. Spanning nearly 3,700 square feet, the restaurant offers seating for 93 guests indoors, complemented by an outdoor patio accommodating an additional 38 patrons. The design accentuates the 14-foot ceilings, harmonizing warm wood tones with contrasting cool color palettes. Key design elements include intricate millwork, refined walnut accents, antique brass fixtures, plush tufted furniture, mosaic tile flooring, and quartzite and quartz tabletops. Details including custom statement lighting create an immersive dining experience that honors Carhartt’s legacy and celebrates the vibrant history of Corktown. Design : Groundswell Design Group and Neumann/Smith Architecture Contractor : Advanced Building Group Photography : John D’Angelo 5 Images | expand images for additional detail Hamilton’s Restaurant View Project Groundswell Design Group Neumann/Smith Architecture Save John D'Angelo Dining Area , Pendant , Sconce Jazz by Pedrali Jazz Hamilton’s Restaurant View Project Groundswell Design Group Neumann/Smith Architecture Save John D'Angelo Dining Area , Pendant Jazz by Pedrali Jazz Hamilton’s Restaurant View Project Groundswell Design Group Neumann/Smith Architecture Save John D'Angelo Bar , Pendant Hamilton’s Restaurant View Project Groundswell Design Group Neumann/Smith Architecture Save John D'Angelo Dining Area , Pendant , Sconce Jazz by Pedrali Jazz Hamilton’s Restaurant View Project Groundswell Design Group Neumann/Smith Architecture Save John D'Angelo Dining Area , Kitchen , Pendant ✕ ✓ save Hotspot Product Notes ✕ ✓ save Update Hotspot The Hospitality Snapshots Newsletter An email digest of the latest hospitality designs Email Address * Instagram This field is for validation purposes and should be left unchanged. Part magazine, part platform, part database. Hospitality Snapshots publishes and organizes the world's best hospitality design and architecture projects. Company About Contact & Feedback Browse Tour Projects Explore Photos Our Firms Partner Advertise Submit Project Request Brand Profile Connect Instagram Facebook Pinterest LinkedIn More Contract Kit Office Snapshots Home Snapshots Healthcare Snapshots Education Snapshots Hospitality Snapshots © 2025 Office Snapshots, LLC | All images are © their listed firm/photographer Privacy Policy Terms of Service × LinkedIn Instagram Now editing content for LinkedIn . Post Content"
    },
    {
      "url": "https://www.horsepowerpavilion.com/acitivities/car-shows/",
      "text": "Car Shows – Horse Power Pavilion – Coffee Shop | Bistro | Weddings | Events | Accomodation 4497 State Highway 20 W, Freeport, FL 32439 +1 850 520 1737 info@horsepowerpavilion.co.uk Follow Us Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Menu Car Shows Overview A chance to engage in where food really comes from. A treetop adventure introducing older children to a more challenging treetop trek with higher platforms and longer zips. Treetop Adventure+ is all about the ‘more’. More speed, more air, more freedom, more height and more thrills. If you are looking for a step up from our Adventure course, turn things up a notch with Adventure+. A chance to engage in where food really comes from. Through a hands-on (and tasty) tour. discover how we ensure our garden remains sustainable and organic. The group will be able to pick and eat some of our produce straight from the plants and also help with either harvesting or sewing crops as well. Looking for something even more challenging and ideal for adults? Check out Challenge.Find your nearest high ropes adventure, that's ideal for you, today. Brand New Treetop Adventure+ just launched at Go Ape Bracknell and Go Ape Leeds Castle. Quick Info Level Easy Duration 1 - 5 hours Player 25 Age 18 - 26 BOOK NOW More activities Kick Ass Coffee @ Hamilton’s AngryAss Coffee servers some of the finest coffee and refreshments in Freeport. Made from an Arabica Aroma coffee bean, we offer a great selection of coffees and a wide variety of flavours.\r\n\r\nOur customers agree, our iced café mocha are delicious! With friendly staff and a warm welcome, whether your trying to cool down, warn up or chill out, there is something for everyone's taste. Relaxing atmosphere - Best coffee - Popular with locals - Delicious pastries - Free Wi-Fi Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Bistro Hamilton's Bistro\r\n\r\nWe have created a stylish bistro within the heart of The Horse Power Pavilion.\r\n\r\nEnjoy freshly prepared English bistro inspired cuisine. Whether it’s for a casual catch up over lunch, a special occasion, relaxed family meal or Sunday lunch, Hamilton's will be the perfect place to eat.\r\n\r\nOpen 7 days a week for lunch and dinner, we have something for everyone including gluten-free, vegan and vegetarian options. Click Here To View Our Menu Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Brewery Freeport's premier craft Homebrew Club and Brewery in the making.\r\n\r\nLocated within the gates of Horse Power Pavilion of Freeport. We are open to the public and everyone is welcome to attend our meetings and enjoy some great Homebrew!\r\n\r\nCurrently brewing: Hogg Wash Golden Horse Mucky Mare Friday, Saturday 4pm-9pm at the Pavilion 18+ Holland Cottage About this space Private 1 bedroom suite with large bathroom and open living space. Access to pool and fire pit areas set within 55 acres of the private 'Horse Power Pavilion\" Ranch. Onsite coffee trailer yet only 20 minutes to the most beautiful beaches on the emerald coast. Water access for small boat or kayak. This suite has kitchenette area with microwave and fridge freezer. Ample parking and a real feel of peace and tranquility out in the countryside. Relax and unwind at our beautiful property. The space Access to the water. On site coffee shop. Further on site accommodations to really make this a family vacation.\r\nBBQ trailer and beautiful coffee shop. 1 Queen bed and 1 sofa Check-in: After 14:00 Check out: 11:00 Free parking on-site Newsletter sign up Get latest news & update Subscribe Leave this field empty if you're human: Do you have questions? Call or visit us. +1 850 520 1737 4497 State Highway 20 W, Freeport, FL 32439 info@horsepowerpavilion.com Our Ranch Location & Map Accommodation Our Blog Career Our Brands AngryAss Coffee Nana Bettie's Hungry Heifer Hamilton's Bistro Holland cottages FIND US 2024 – Horse Power Pavilion. All rights reserved. Website Designed By B2B Creative Sign in Create an Account Username or email * Password * Login Lost your password? Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Follow Us"
    },
    {
      "url": "http://www.horsepowerpavilion.com/",
      "text": "Horse Power Pavilion – Coffee Shop | Bistro | Weddings | Events | Accomodation – On of the best destinations in Florida for Weddings, Dining, Accommodation & Open Air Events 4497 State Highway 20 W, Freeport, FL 32439 +1 850 520 1737 info@horsepowerpavilion.co.uk Follow Us Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Menu Welcome to Horse Power Pavilion COFFEE SHOP • BISTRO • BREWERY • WEDDING & EVENTS VENUE • ACCOMMODATION Discover More Food & Drink Great Food, Great Atmosphere Everything From English Fish & Chip Stalls To Smoked Meats Discover More Hairy Hogg Brewery & Bar - Fully Stocked At The Horse Power Pavilion Discover More Eat Drink And Be Merry WELCOME TO HORSE POWER PAVILION Everything from Food to Live Entertainment piece of paradise at this very special estate and ranch is an exquisite main house and separate bunk house are set on nearly 39 acres of natural beauty, including irrigated pasture land, lake/pond, mature trees, and creek access leading to Alaqua Bayou and the Choctawhatchee Bay (navigable by small boat)! We have over 36 Acres of glorious land set in the beautiful Walton County. Watch video Book your next adventure +1 850 520 1737 Your browser does not support the audio element. Event Types Choose your adventure Centre view At the Horse Power Pavilion, The Possibilities Are Endless There’s always something happening at the Horse Power Pavilion. From our growing food court and our outdoor bar area to performance car shows.  Why not bring all our catering, teepee and accommodation services together, and create the best wedding day ever! Events Live Music Car Shows Family Fun Days LEARN MORE Weddings Religious Ceremonies Civil Ceremony Same Sex Weddings LEARN MORE Accommodation 1 Bedroom Cottage Swimming Pool Free Wifi LEARN MORE Food & Drink Coffee Shop Smoked Meats Brewery/Bar Fish & Chips LEARN MORE 01 Hungry Heifer Smoked Meats 02 Car Shows 03 Kickass Coffee @ Hamilton's 04 Hairy Hogg Brewery activities There is Always  Something Happening At Horse Power Pavilion Set in the beautiful City of Freeport, Horse Power Pavilion is a 39 acre ranch dedicated to fun.  From the Hairy Hogg Brewery & Bar to Hamilton’s Bistro there is all the ingredients for a fun family day out.  Check out our list of services and activities below to see whats in stor on your next visit. Kick Ass Coffee @ Hamilton’s AngryAss Coffee servers some of the finest coffee and refreshments in Freeport. Made from an Arabica Aroma coffee bean, we offer a great selection of coffees and a wide variety of flavours.\r\n\r\nOur customers agree, our iced café mocha are delicious! With friendly staff and a warm welcome, whether your trying to cool down, warn up or chill out, there is something for everyone's taste. Relaxing atmosphere - Best coffee - Popular with locals - Delicious pastries - Free Wi-Fi Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Bistro Hamilton's Bistro\r\n\r\nWe have created a stylish bistro within the heart of The Horse Power Pavilion.\r\n\r\nEnjoy freshly prepared English bistro inspired cuisine. Whether it’s for a casual catch up over lunch, a special occasion, relaxed family meal or Sunday lunch, Hamilton's will be the perfect place to eat.\r\n\r\nOpen 7 days a week for lunch and dinner, we have something for everyone including gluten-free, vegan and vegetarian options. Click Here To View Our Menu Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Brewery Freeport's premier craft Homebrew Club and Brewery in the making.\r\n\r\nLocated within the gates of Horse Power Pavilion of Freeport. We are open to the public and everyone is welcome to attend our meetings and enjoy some great Homebrew!\r\n\r\nCurrently brewing: Hogg Wash Golden Horse Mucky Mare Friday, Saturday 4pm-9pm at the Pavilion 18+ Holland Cottage About this space Private 1 bedroom suite with large bathroom and open living space. Access to pool and fire pit areas set within 55 acres of the private 'Horse Power Pavilion\" Ranch. Onsite coffee trailer yet only 20 minutes to the most beautiful beaches on the emerald coast. Water access for small boat or kayak. This suite has kitchenette area with microwave and fridge freezer. Ample parking and a real feel of peace and tranquility out in the countryside. Relax and unwind at our beautiful property. The space Access to the water. On site coffee shop. Further on site accommodations to really make this a family vacation.\r\nBBQ trailer and beautiful coffee shop. 1 Queen bed and 1 sofa Check-in: After 14:00 Check out: 11:00 Free parking on-site Weddings Find your nearest high ropes adventure, that's ideal for you, today.\r\n\r\nA treetop adventure introducing older children to a more challenging treetop trek with higher platforms and longer zips. Treetop Adventure+ is all about the ‘more’. More speed, more air, more freedom, more height and more thrills. If you are looking for a step up from our Adventure course, turn things up a notch with Adventure+. A chance to engage in where food really comes from. Through a hands-on (and tasty) tour.\r\n\r\ndiscover how we ensure our garden remains sustainable and organic. The group will be able to pick and eat some of our produce straight from the plants and also help with either harvesting or sewing crops as well.\r\n\r\nA high ropes activity designed for older children with (or without) their families in mind. Adventure+ hits the feel-good factor every time.\r\n\r\nLooking for something more challenging and ideal for adults? Treetop Challenge might just be the answer.\r\n\r\nPrefer to dial things down a level with an adventure that's ideal for younger children? Check out Treetop Adventure. Easy 5-8 hours 15 Car Shows A chance to engage in where food really comes from.\r\n\r\nA treetop adventure introducing older children to a more challenging treetop trek with higher platforms and longer zips. Treetop Adventure+ is all about the ‘more’. More speed, more air, more freedom, more height and more thrills. If you are looking for a step up from our Adventure course, turn things up a notch with Adventure+. A chance to engage in where food really comes from. Through a hands-on (and tasty) tour.\r\n\r\ndiscover how we ensure our garden remains sustainable and organic. The group will be able to pick and eat some of our produce straight from the plants and also help with either harvesting or sewing crops as well.\r\n\r\nLooking for something even more challenging and ideal for adults? Check out Challenge.Find your nearest high ropes adventure, that's ideal for you, today.\r\n\r\nBrand New Treetop Adventure+ just launched at Go Ape Bracknell and Go Ape Leeds Castle. Easy 1 - 5 hours 25 Fish & Chips Nestled within the vibrant and eclectic Horse Power Pavilion at a sprawling ranch in Destin, Florida, Nana Betties Fish and Chips trailer brings a slice of classic British cuisine to the sunny shores of the Gulf Coast. This quaint and charming food trailer, named with affection and nostalgia, evokes the comforting tastes of traditional English fish and chips, a beloved dish that has transcended borders and found fans worldwide.\r\n\r\nNana Betties is more than just a food trailer; it's a culinary experience steeped in tradition. The name itself conjures images of a beloved grandmother's kitchen, where recipes are passed down through generations and meals are prepared with love and care. The trailer's decor is quintessentially British, with Union Jack bunting and rustic wooden elements that add to its charm. The aroma of freshly fried fish and chips wafts through the air, drawing in locals and tourists alike who seek a taste of authentic British fare.\r\n\r\nThe menu at Nana Betties is simple yet meticulously crafted. The star of the show is the classic fish and chips – tender, flaky fish encased in a golden, crispy batter, served alongside thick-cut chips that are perfectly seasoned and cooked to perfection. Each serving is accompanied by a wedge of lemon and a generous portion of tartar sauce, providing the perfect balance of flavors. For those looking to explore beyond the traditional, Nana Betties also offers variations such as battered sausages, mushy peas, and pickled onions, all staples of a British chippy.\r\n\r\nWhat sets Nana Betties apart is not just its dedication to authenticity but also its commitment to quality. The fish is sourced fresh, and the batter is made using a secret family recipe that ensures a light yet crispy texture. The chips are hand-cut and double-fried to achieve the perfect crunch on the outside and a fluffy interior. This attention to detail has earned Nana Betties a loyal following and rave reviews from patrons who appreciate the genuine taste of England in the heart of Florida.\r\n\r\nLocated at the Horse Power Pavilion, a dynamic venue known for its blend of food, music, and community events, Nana Betties is a beloved fixture. The pavilion itself is a hub of activity, hosting everything from live music performances to farmers' markets, making it the perfect spot for a casual meal. Visitors can enjoy their fish and chips at picnic tables under the pavilion's shaded areas or take their meal to go and explore the beautiful ranch surroundings.\r\n\r\nIn essence, Nana Betties Fish and Chips trailer offers more than just a meal – it provides a nostalgic journey to the cobbled streets of England, where the simple pleasure of fish and chips is a cherished tradition. Whether you're a Brit longing for a taste of home or a curious foodie eager to try something new, Nana Betties at the Horse Power Pavilion in Destin promises an unforgettable culinary experience. Easy Friday, Saturday 4pm - 9pm 12 view all activites Testimonials What People Said About HPP Kate is making Freeport a place to Eat! Amazing food, excellent service, best BBQ in the south! Also homemade beer, fish and chips (British style), coffee, everything is delicious! Thank you Kate for making Freeport amazing! Mack Ream Freeport, FL I definitely recommend horse power pavilion.  The owners are incredibly kind and giving.  They treat everyone like family.  They definitely have our support.  They make a fantastic difference in our community. Cathy Hill DeAbreu Southern Illinois latest news Inside Horse Power Pavilion Categories Lifestyle July 29, 2021 July 29, 2021 by admin Traditional English Fish & Chips Available Oh my oh my OPEN FOR YOUR favourites 4-9pm Read More Categories Company News July 29, 2021 July 29, 2021 by admin Eat Local Do You Like To Wing It? Wings Burgers Fresh Salad’s And COLD BEER OR Great Coffee Read More Categories Uncategorized July 29, 2020 July 29, 2021 by admin LIVE Music with Purple Monkey LIVE Music with Purple Monkey   Event by Purple Monkey   Horse Power Pavilion   Duration: 3 hr 30 min  … Read More Caffine with kick Angry Ass Coffee Highway 20 W, Freeport Pull over for a morning cup & keep on trucking Wedding Packages Book Your Wedding Read More join us today! Ready For An Amazing Adventure? Find Out More JOIN NOW YourName* YourPhone* YourEmail* Subject Your Message Newsletter sign up Get latest news & update Subscribe Leave this field empty if you're human: Do you have questions? Call or visit us. +1 850 520 1737 4497 State Highway 20 W, Freeport, FL 32439 info@horsepowerpavilion.com Our Ranch Location & Map Accommodation Our Blog Career Our Brands AngryAss Coffee Nana Bettie's Hungry Heifer Hamilton's Bistro Holland cottages FIND US 2024 – Horse Power Pavilion. All rights reserved. Website Designed By B2B Creative Sign in Create an Account Username or email * Password * Login Lost your password? Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Follow Us"
    },
    {
      "url": "http://www.horsepowerpavilion.com/acitivities/fish-and-chips/",
      "text": "Fish & Chips – Horse Power Pavilion – Coffee Shop | Bistro | Weddings | Events | Accomodation 4497 State Highway 20 W, Freeport, FL 32439 +1 850 520 1737 info@horsepowerpavilion.co.uk Follow Us Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Menu Fish & Chips Overview Nestled within the vibrant and eclectic Horse Power Pavilion at a sprawling ranch in Destin, Florida, Nana Betties Fish and Chips trailer brings a slice of classic British cuisine to the sunny shores of the Gulf Coast. This quaint and charming food trailer, named with affection and nostalgia, evokes the comforting tastes of traditional English fish and chips, a beloved dish that has transcended borders and found fans worldwide. Nana Betties is more than just a food trailer; it's a culinary experience steeped in tradition. The name itself conjures images of a beloved grandmother's kitchen, where recipes are passed down through generations and meals are prepared with love and care. The trailer's decor is quintessentially British, with Union Jack bunting and rustic wooden elements that add to its charm. The aroma of freshly fried fish and chips wafts through the air, drawing in locals and tourists alike who seek a taste of authentic British fare. The menu at Nana Betties is simple yet meticulously crafted. The star of the show is the classic fish and chips – tender, flaky fish encased in a golden, crispy batter, served alongside thick-cut chips that are perfectly seasoned and cooked to perfection. Each serving is accompanied by a wedge of lemon and a generous portion of tartar sauce, providing the perfect balance of flavors. For those looking to explore beyond the traditional, Nana Betties also offers variations such as battered sausages, mushy peas, and pickled onions, all staples of a British chippy. What sets Nana Betties apart is not just its dedication to authenticity but also its commitment to quality. The fish is sourced fresh, and the batter is made using a secret family recipe that ensures a light yet crispy texture. The chips are hand-cut and double-fried to achieve the perfect crunch on the outside and a fluffy interior. This attention to detail has earned Nana Betties a loyal following and rave reviews from patrons who appreciate the genuine taste of England in the heart of Florida. Located at the Horse Power Pavilion, a dynamic venue known for its blend of food, music, and community events, Nana Betties is a beloved fixture. The pavilion itself is a hub of activity, hosting everything from live music performances to farmers' markets, making it the perfect spot for a casual meal. Visitors can enjoy their fish and chips at picnic tables under the pavilion's shaded areas or take their meal to go and explore the beautiful ranch surroundings. In essence, Nana Betties Fish and Chips trailer offers more than just a meal – it provides a nostalgic journey to the cobbled streets of England, where the simple pleasure of fish and chips is a cherished tradition. Whether you're a Brit longing for a taste of home or a curious foodie eager to try something new, Nana Betties at the Horse Power Pavilion in Destin promises an unforgettable culinary experience. Quick Info Level Easy Duration Friday, Saturday 4pm - 9pm Player 12 Age 10 - 18 BOOK NOW More activities Kick Ass Coffee @ Hamilton’s AngryAss Coffee servers some of the finest coffee and refreshments in Freeport. Made from an Arabica Aroma coffee bean, we offer a great selection of coffees and a wide variety of flavours.\r\n\r\nOur customers agree, our iced café mocha are delicious! With friendly staff and a warm welcome, whether your trying to cool down, warn up or chill out, there is something for everyone's taste. Relaxing atmosphere - Best coffee - Popular with locals - Delicious pastries - Free Wi-Fi Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Bistro Hamilton's Bistro\r\n\r\nWe have created a stylish bistro within the heart of The Horse Power Pavilion.\r\n\r\nEnjoy freshly prepared English bistro inspired cuisine. Whether it’s for a casual catch up over lunch, a special occasion, relaxed family meal or Sunday lunch, Hamilton's will be the perfect place to eat.\r\n\r\nOpen 7 days a week for lunch and dinner, we have something for everyone including gluten-free, vegan and vegetarian options. Click Here To View Our Menu Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Brewery Freeport's premier craft Homebrew Club and Brewery in the making.\r\n\r\nLocated within the gates of Horse Power Pavilion of Freeport. We are open to the public and everyone is welcome to attend our meetings and enjoy some great Homebrew!\r\n\r\nCurrently brewing: Hogg Wash Golden Horse Mucky Mare Friday, Saturday 4pm-9pm at the Pavilion 18+ Holland Cottage About this space Private 1 bedroom suite with large bathroom and open living space. Access to pool and fire pit areas set within 55 acres of the private 'Horse Power Pavilion\" Ranch. Onsite coffee trailer yet only 20 minutes to the most beautiful beaches on the emerald coast. Water access for small boat or kayak. This suite has kitchenette area with microwave and fridge freezer. Ample parking and a real feel of peace and tranquility out in the countryside. Relax and unwind at our beautiful property. The space Access to the water. On site coffee shop. Further on site accommodations to really make this a family vacation.\r\nBBQ trailer and beautiful coffee shop. 1 Queen bed and 1 sofa Check-in: After 14:00 Check out: 11:00 Free parking on-site Newsletter sign up Get latest news & update Subscribe Leave this field empty if you're human: Do you have questions? Call or visit us. +1 850 520 1737 4497 State Highway 20 W, Freeport, FL 32439 info@horsepowerpavilion.com Our Ranch Location & Map Accommodation Our Blog Career Our Brands AngryAss Coffee Nana Bettie's Hungry Heifer Hamilton's Bistro Holland cottages FIND US 2024 – Horse Power Pavilion. All rights reserved. Website Designed By B2B Creative Sign in Create an Account Username or email * Password * Login Lost your password? Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Follow Us"
    },
    {
      "url": "http://www.horsepowerpavilion.com/our-team/",
      "text": "Our Team – Horse Power Pavilion – Coffee Shop | Bistro | Weddings | Events | Accomodation 4497 State Highway 20 W, Freeport, FL 32439 +1 850 520 1737 info@horsepowerpavilion.co.uk Follow Us Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Menu Our Team Our Primary Focus is on Excellence in Entertainment Our family has worked to create special events and memories, for 1000’s of people over many years.  From weddings and birthdays, to unique and exciting events you could say entertainment is in our blood. Events Manager Kate Holland Grounds Keeper Fred Holland Head Engineer Hamilton Holland Lead Instructor Heston Holland Barista Diane Patton Barista Mike Banard join us today! Ready to discover amazing adventure? take the leap Newsletter sign up Get latest news & update Subscribe Leave this field empty if you're human: Do you have questions? Call or visit us. +1 850 520 1737 4497 State Highway 20 W, Freeport, FL 32439 info@horsepowerpavilion.com Our Ranch Location & Map Accommodation Our Blog Career Our Brands AngryAss Coffee Nana Bettie's Hungry Heifer Hamilton's Bistro Holland cottages FIND US 2024 – Horse Power Pavilion. All rights reserved. Website Designed By B2B Creative Sign in Create an Account Username or email * Password * Login Lost your password? Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Follow Us"
    },
    {
      "url": "https://www.hamiltonsteak.com/",
      "text": "Hamilton's Urban Steakhouse & Bourbon Bar Home Menu Dinner Desserts Drinks Private Dining Events Gift Cards Contact Reservations St. Louis' Premier Farm to Table Experience Join us for unparalleled dining Call Us View Our Menu Order Online Find a Table A COMMITMENT TO Unparalleled Dining To better deliver on our promise of a refined atmosphere, proper dress is required. Thank you for not wearing: athletic shorts, uncovered sports bras or other bra-style tops, excessively revealing clothing or exposed undergarments, or any clothing with offensive language or images. Men’s shirts must have sleeves. Athletic leggings, joggers or sweatpants are welcome in our bar area. Our Story Hamilton’s, where tradition, service, and innovation come together to create an intimate Urban Steakhouse & Bourbon Bar. Serving only 100% Heritage Breed Black Angus Midwest beef allows us to offer an unparalleled experience in the heart of Downtown St. Louis. opentable diners' choice award st. louis magazine • best edible candle nextdoor • neighborhood favorite far & wide • Ranked 39th Best Steakhouses in the U.S t op rated steakhouses in every state according to yelp  (wgn) Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Slide title Write your caption here Button Happy Hour Tuesday - Friday | 3 pm — 6 pm Bar Only $1 off bottled beer & $2 off wines by the glass New Paragraph Nightly Bar Specials 3pm — close Tuesday: 1/2 off all appetizers Wednesday: $15 Flights Thursday: 1/2 off bottles of wine under $75 Private Dining Accommodates 10-24 the perfect room for an intimate dinner or special occasion. Learn More Upcoming Events at hamilton's urban steakhouse 5/7 | 6pm : Up in Smoke Bourbon & Cigars 6/18 | 6pm: Surf and Turf Dinner 9/17 | 6pm: Spectacular Spectacular Dinner 9/24 | 6pm: History of Bourbon in Missouri Button Button Button Button Button Newsletter Signup! Sign up today to receive the latest news and event announcements! Contact Us Email* Thank you for contacting us. We will get back to you as soon as possible Oops, there was an error sending your message. Please try again later 314-241-BEEF (2333) 2101 Chouteau Ave, St. Louis, MO 63103 manager@hamiltonsteak.com Hours Closed Sun & Mon Tue - Sat 3pm - 10pm Gift Cards ©2023 Hamilton's Urban Steakhouse & Bourbon Bar | Masterfully Maintained by BYK Digital Gift Cards ©2019 Hamilton's Urban Steakhouse & Bourbon Bar | Powered by Drive Social Media Share by:"
    },
    {
      "url": "http://www.horsepowerpavilion.com/acitivities/bistro/",
      "text": "Bistro – Horse Power Pavilion – Coffee Shop | Bistro | Weddings | Events | Accomodation 4497 State Highway 20 W, Freeport, FL 32439 +1 850 520 1737 info@horsepowerpavilion.co.uk Follow Us Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Menu Bistro Overview Hamilton's Bistro We have created a stylish bistro within the heart of The Horse Power Pavilion. Enjoy freshly prepared English bistro inspired cuisine. Whether it’s for a casual catch up over lunch, a special occasion, relaxed family meal or Sunday lunch, Hamilton's will be the perfect place to eat. Open 7 days a week for lunch and dinner, we have something for everyone including gluten-free, vegan and vegetarian options. Click Here To View Our Menu Quick Info Open Times Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm BOOK NOW More activities Kick Ass Coffee @ Hamilton’s AngryAss Coffee servers some of the finest coffee and refreshments in Freeport. Made from an Arabica Aroma coffee bean, we offer a great selection of coffees and a wide variety of flavours.\r\n\r\nOur customers agree, our iced café mocha are delicious! With friendly staff and a warm welcome, whether your trying to cool down, warn up or chill out, there is something for everyone's taste. Relaxing atmosphere - Best coffee - Popular with locals - Delicious pastries - Free Wi-Fi Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Bistro Hamilton's Bistro\r\n\r\nWe have created a stylish bistro within the heart of The Horse Power Pavilion.\r\n\r\nEnjoy freshly prepared English bistro inspired cuisine. Whether it’s for a casual catch up over lunch, a special occasion, relaxed family meal or Sunday lunch, Hamilton's will be the perfect place to eat.\r\n\r\nOpen 7 days a week for lunch and dinner, we have something for everyone including gluten-free, vegan and vegetarian options. Click Here To View Our Menu Monday Tuesday - Closed\r\nWednesday Thursday Friday 11am-9pm\r\nSaturday 10am-10pm\r\nSunday 10am-7pm Brewery Freeport's premier craft Homebrew Club and Brewery in the making.\r\n\r\nLocated within the gates of Horse Power Pavilion of Freeport. We are open to the public and everyone is welcome to attend our meetings and enjoy some great Homebrew!\r\n\r\nCurrently brewing: Hogg Wash Golden Horse Mucky Mare Friday, Saturday 4pm-9pm at the Pavilion 18+ Holland Cottage About this space Private 1 bedroom suite with large bathroom and open living space. Access to pool and fire pit areas set within 55 acres of the private 'Horse Power Pavilion\" Ranch. Onsite coffee trailer yet only 20 minutes to the most beautiful beaches on the emerald coast. Water access for small boat or kayak. This suite has kitchenette area with microwave and fridge freezer. Ample parking and a real feel of peace and tranquility out in the countryside. Relax and unwind at our beautiful property. The space Access to the water. On site coffee shop. Further on site accommodations to really make this a family vacation.\r\nBBQ trailer and beautiful coffee shop. 1 Queen bed and 1 sofa Check-in: After 14:00 Check out: 11:00 Free parking on-site Newsletter sign up Get latest news & update Subscribe Leave this field empty if you're human: Do you have questions? Call or visit us. +1 850 520 1737 4497 State Highway 20 W, Freeport, FL 32439 info@horsepowerpavilion.com Our Ranch Location & Map Accommodation Our Blog Career Our Brands AngryAss Coffee Nana Bettie's Hungry Heifer Hamilton's Bistro Holland cottages FIND US 2024 – Horse Power Pavilion. All rights reserved. Website Designed By B2B Creative Sign in Create an Account Username or email * Password * Login Lost your password? Home About Accommodation Location & Map Pavilion Our Team Amenities All Activities Kick Ass Coffee Fish & Chips Hungry Heifer Smoked Meats Hamilton’s Bistro Holland Cottage Experiences Car Shows Hairy Hogg Brewery Weddings News Gallery Contact Follow Us"
    },
    {
      "url": "https://www.hp.com/us-en/hp-information/executive-team/team.html",
      "text": "Executive Team  | HP® Official Site Skip to Content Skip to Footer Skip to Country Selector Laptops Laptops Laptop Deals Featured Laptop Subscriptions AI PCs Top Rated Laptops Laptops for Home Laptops for Work Mobile Workstations Laptops for Gaming Desktops Desktops Desktop Deals Featured Monitors Top Rated Desktops Desktops for Home Desktops for Work Workstations Desktops for Gaming Printers Printers Printer Deals Featured Print Subscriptions Instant Ink Scanners Printers for Home Printers for Work Ink, Toner & Paper Large-Format Printers & Plotters Accessories Accessories Weekly Deals Featured HyperX Monitors Computer Accessories Gaming Accessories Video & Voice Accessories Care Packs & Services Subscriptions Subscriptions HP All-In Plan HP Instant Ink HP Laptop Subscriptions OMEN Gaming Subscriptions Business Solutions Business Solutions Featured Workforce Experience Platform HP Z Workstations & Solutions Video & Voice Collaboration Government & Education The Future of Work Software & Services Computers Printers & Digital Presses Support Support Featured Support by Product Parts Store Support & Troubleshooting Software & Drivers Check Warranty Contact Us Your Cart is Empty Support See all Skip to Content Skip to Footer us en false https://www.hp.com/cma/ng/lib/exceptions/privacy-banner.js Executive leadership Enrique Lores President & Chief Executive Officer Karen Parkhill Chief Financial Officer Alex Cho President, Personal Systems Anneliese Olson President of HP Inc. Imaging, Printing, and Solutions Dave Shull President, HP Solutions Dave McQuarrie Chief Commercial Officer Julie Jacobs Chief Legal Officer & General Counsel Antonio Lucio Chief Marketing & Corporate Affairs Officer Carol Surface Chief People Officer Ernest Nicolas Chief Enterprise Operations Officer Tuan Tran President, Technology & Innovation Enrique Lores President & Chief Executive Officer Enrique Lores is the President and CEO of HP Inc., a global technology leader empowering its customers to shape their own ways of working. With operations in over 170 countries, HP delivers innovative experiences that enable growth and fulfillment for individuals and businesses everywhere. Since becoming CEO in November 2019, Enrique has spearheaded a bold strategy to position HP for the future, emphasizing a growth-oriented portfolio, digital transformation, and exceptional talent development. Under Enrique’s leadership, HP has been recognized with several prestigious awards, including Fortune’s World’s Most Admired Companies, Barron's 100 Most Sustainable Companies, JUST Capital’s Just 100 List, and The Wall Street Journal’s Best-Managed Companies. With a career spanning 35 years at HP, Enrique has held senior leadership roles across the company’s Personal Systems, Print, Industrial, and Services businesses in various global, regional, and country-specific capacities. Notably, he led the Separation Management Office during the 2015 split of the Hewlett-Packard Company, one of the most complex corporate separations in history. In the leadership role, he streamlined HP’s cost structure, simplified the organization, and opened new avenues for innovation and growth. Enrique is also active in several influential organizations, serving as Chair of the PayPal Board and participating in the International Advisory Boards of the Atlantic Council, Esade Business School, and San Telmo Business School. He is also a member of the Business Roundtable, the Welcome.US CEO Council, and the World Economic Forum’s International Business Council and Alliance of CEO Climate Leaders. Enrique began his career as an HP intern after earning his degree in electrical engineering from the Polytechnic University of Valencia (UPV) and an MBA from Esade Business School. In 2024, UPV recognized Enrique as an \"honoris causa\" doctor for his commitment to lifelong learning, technical knowledge, and business success. He is based in Palo Alto, California. Anneliese Olson President of HP Inc. Imaging, Printing, and Solutions Anneliese Olson is the President of HP Inc. Imaging, Printing and Solutions, a global business that delivers services, software, and hardware for home, office, and graphics markets. As head of the global business unit, Anneliese is leading the transformation of HP’s imaging and printing business to enhance the printing experience and empower customers to thrive in the future of work. Since beginning her career at HP as an intern, Anneliese has held a variety of leadership positions across the company, spanning product development, P&L management, product marketing, and go-to-market strategy. Anneliese brings a wealth of international experience, having lived and worked in HP offices in Asia and the U.S. Most recently she served as Senior Vice President and Managing Director, North America Market, where she led go-to-market strategy, sales, execution, and multibillion-dollar P&L for the company’s largest revenue-generating region. A passionate advocate for leadership, sustainability, and inclusion initiatives, Anneliese holds a Sustainable Capitalism certificate from the Berkeley Law Executive Education Program and is a Senior Fellow of the American Leadership Forum Silicon Valley. She actively mentors emerging talent and is a sought-after speaker on unlocking human potential. Anneliese also advises several start-ups and holds Board positions with non-profit organizations, including the Board of Regents at Santa Clara University and the Board of Trustees for the Monterey Bay Aquarium. Anneliese earned a Bachelor of Science in Marketing from Santa Clara University and is based in the San Francisco Bay Area. Karen Parkhill Chief Financial Officer Karen Parkhill is Executive Vice President and Chief Financial Officer (CFO) for HP Inc. As CFO, she serves as a strategic advisor to the business and is responsible for leading HP’s global Finance organization and all aspects of financial operations including accounting and controls, financial planning and analysis, business decision support, tax, audit, treasury, mergers and acquisitions, corporate development, and investor relations. Karen is a seasoned, world class finance leader with 30 years of experience across healthcare and financial services sectors. Prior to joining HP in August 2024, she served as CFO for well-established, publicly traded companies for the past 13 years. Most recently she was CFO of Medtronic, a global healthcare technology company where she led its finance organization and key support functions. At Medtronic, Karen also served as executive sponsor of the company’s PRIDE Employee Resource Group and Women’s Vice President Network supporting senior women leadership development. Karen began her career in investment banking at JP Morgan, where she gained invaluable global experience in M&A and Capital Markets. She rose through the ranks at JP Morgan and ultimately became Chief Financial Officer for Commercial Banking where she served for five years. Following JP Morgan, Karen moved to Comerica Incorporated, where she was Vice Chairman and Chief Financial Officer. She also currently serves on the board of American Express, where she chairs the Risk Committee. Karen earned bachelor's degrees in business administration and mathematics from Southern Methodist University in Dallas and an MBA from the University of Chicago Booth School of Business. She is a 2012 recipient of the SMU Cox School of Business Distinguished Alumni Award and a 2008 recipient of the University of Chicago Booth School of Business Distinguished Young Alumna Award. Alex Cho President, Personal Systems Alex Cho is the President of Personal Systems at HP Inc. He leads a global business of $35 billion, including a technology portfolio of PCs, displays, peripherals, conference room and software solutions. Alex is responsible for delivering computing experiences and solutions that enable people to work, learn, play and connect in a hybrid world. A 28-year veteran of HP, Alex has served in multiple strategy and operational positions spanning the company’s PC, Printing and Services business in the Americas, Europe and globally. Most recently, he served as Vice President and General Manager of HP’s Commercial PC business with worldwide P&L responsibility for commercial notebooks, desktop computing, accessories and displays businesses. Over the course of his career, Alex has led HP’s LaserJet Supplies and Installed Base business globally, driving strategy, development and execution for the multi-billion-dollar printing supplies category. He has also served as Vice President for LaserJet Printers and Supplies in the Americas region and worked in Europe managing HP’s Software Management Services category. Alex holds a B.S. in Industrial Engineering and an M.S. in Engineering and Industrial Management from Stanford University. He is based in Palo Alto, California, with his wife and four children. Julie Jacobs Chief Legal Officer & General Counsel Julie Jacobs serves as Chief Legal Officer and General Counsel for HP Inc. In this role, Julie leads the worldwide Global Legal Affairs organization, including all aspects of legal and government affairs, brand security, compliance and ethics. Julie is an accomplished executive with over two decades of experience in the global technology and media industry. She is a business-focused General Counsel and a strategic and analytical thinker and problem solver with extensive experience resolving complex litigation and regulatory matters and advising boards of directors and executive teams. Julie also has extensive experience in structuring, negotiating and closing strategic transactions, most notably leading the acquisition of AOL by Verizon in 2015, orchestrating the integration of Yahoo & AOL in 2017 and negotiating the acquisition of Yahoo by Apollo Global Management in 2021. Prior to HP, Julie was Senior Executive Vice President, General Counsel and Corporate Secretary of Yahoo Inc., a global technology and media company with a dynamic house of brands, including Yahoo (Yahoo Mail, Yahoo.com, Yahoo Finance, Yahoo News and Yahoo Sports) and AOL (AOL Mail and AOL.com). In that role, she was responsible for leading the Legal, Regulatory, Government Relations, Corporate Secretary and Compliance functions for Yahoo following Apollo Global Management's acquisition of Yahoo in September 2021. Prior to this, Julie was Executive Vice President and General Counsel of Verizon Media and AOL. Julie has a Bachelor of Science degree in finance from the University of Colorado, Boulder, and a Juris Doctor from Georgetown University Law Center. Julie will split her time between Washington D.C. and Palo Alto. Antonio Lucio Chief Marketing & Corporate Affairs Officer Antonio Lucio is Chief Marketing and Corporate Affairs Officer at HP Inc. Antonio rejoined HP in 2024, having served as Chief Marketing and Communications Officer after the separation of Hewlett-Packard Company in 2015. Under his leadership, the company reframed its vision, mission, and brand while growing revenue and market share. Throughout his career, Antonio has been successful in driving growth by building businesses, brands, and marketing teams that have stood the test of time, working with some of the most recognized companies and iconic brands across multiple industries. In addition to HP, he has held Global CMO roles for Meta and Visa and the role of Chief Innovation and Portfolio Transformation Officer for PepsiCo. A prominent thought leader in marketing transformation, Antonio has earned accolades including induction into the American Advertising Federation Hall of Fame (2023), the Forbes Most Influential CMOs Hall of Fame (2022), and the American Marketing Association Hall of Fame (2022). He stands out as one of the few to receive all three prestigious honors, marking him as a leading figure in the field. Antonio is an advocate for diversity, equity, and inclusion. His efforts have been recognized by ANA/AIMM, AdColor, Adweek, and PRWeek, among others. He is the co-founder of Virtuosi LEAP, a development program designed to advance marketing practice through transformational leadership skills and DEI. He also serves as an Executive Fellow at Yale SOM and mentors some of the world's leading CMOs. Born in Spain and raised in Puerto Rico, Antonio earned his bachelor’s degree in history from Louisiana State University. He is based in Palo Alto, California. Carol Surface Chief People Officer Carol Surface is the Chief People Officer at HP. She works across the company to drive growth, innovation and organizational effectiveness, by enabling the power of HP’s people.  She leads the global talent, culture and Human Resources strategy, which includes workforce and organization effectiveness, total rewards, talent acquisition, people and leadership development, employee experience and HR operations. Carol joined HP in 2025 and brings unparalleled expertise in building high-performance, purpose-driven teams to deliver exceptional business results. Most recently, she served as Chief People Officer at Apple. Prior to that, Carol spent a decade as Chief Human Resources Officer at Medtronic, a global healthcare technology leader, where she led transformation initiatives, including the evolution of its HR operating model. Carol also served as Chief Human Resources Officer at Best Buy, and she held HR leadership roles for PepsiCo in New York, Hong Kong and Dubai. Known for her strong business acumen, Carol has a proven track record of leading operating model transformations and fostering agility in fast-moving global environments. She earned a Ph.D. in Industrial/Organizational Psychology from Central Michigan University.  Carol is also a recognized HR thought leader, having served as Vice Chair of the HR Policy Association. She currently serves as a member of Gartner’s CHRO Leadership Board, an HR Policy Association board and executive committee member and a member of the Advisory Board of the University of South Carolina Center of Executive Succession. In 2020, she was honored as a Fellow of the National Academy of Human Resources, the highest honor granted in the human resources profession. Dave McQuarrie Chief Commercial Officer Dave McQuarrie is Chief Commercial Officer at HP Inc., accountable for all aspects of sales, go-to-market and revenue and margin generation on a global scale. The Commercial Organization is structured across eight geographic markets and six global teams, spanning Global Channel, Sales Innovation & Transformation, Digital Go-to-Market, Global Services & Solutions, Global Accounts, Lead to Cash and Go-to-Market across all HP product categories. Dave brings a breadth of leadership experience to the Chief Commercial Officer role from across the IT industry. He is a strong, customer-focused and data-driven leader who has built an impressive track record of results since joining HP in 2017. A native of Australia, Dave has lived and worked in six countries and brings a diverse set of global experiences to his role. He is also a purpose-driven leader with a growth mindset and deep commitment to the HP Way, serving as the executive sponsor of the HP disAbilities Impact Network for the past three years. Prior to his current role, Dave served as the General Manager of the Personal Systems Category, with global responsibility for profit & loss management, product management, sales management, and business planning and operations for both Consumer and Commercial product categories. Previous HP executive roles include Global Head of Customer Support and Global Head of Print Business Management. Prior to HP, Dave spent nearly a decade at Lenovo where he held business leadership positions across Europe. He also served in sales, marketing and product leadership roles for Dell across Europe and Asia. He and his family are based in Palo Alto. Ernest Nicolas Chief Enterprise Operations Officer Ernest Nicolas is Chief Enterprise Operations Officer at HP Inc. He is responsible for delivering innovative technology solutions and building a future-ready supply chain that promotes social and environmental sustainability directly tied to HP's global reputation and business growth. Ernest joined HP in 2022, bringing more than 25 years of global experience in end-to-end, integrated supply chain functions. His experience includes industrial engineering, production management, and supply chain planning with General Motors, where he was awarded the General Motors Graduate Fellowship to pursue full-time graduate study. In 2006 he joined Rockwell Automation, serving in Lean Six Sigma project management, supply chain planning, manufacturing operations, strategic sourcing, logistics as well as customer service functions in North America and Asia before being named Senior Vice President and Chief Supply Chain Officer in 2019. He serves on the Board of Directors for Avient Corporation and is an Advisory Board member for Wahl Clipper Corporation. A passionate advocate for diversity and inclusion, Ernest is a member of the Executive Leadership Council (ELC), an organization focused on advancing and preparing the next generation of diverse corporate leaders. Ernest grew up in the southern suburbs of Chicago and is married with three children. He holds an MBA in Operations Management and a Master of Science in Manufacturing Systems Engineering from the University of Wisconsin – Madison, as well as a Bachelor of Science in Manufacturing Systems Engineering from Kettering University. Ernest is based in Houston, Texas. Dave Shull President, HP Solutions Dave Shull is President of HP Solutions. As head of this business, he integrates HP’s portfolio of hardware, services, and software to improve employee experiences, provide flexibility, and deliver peace of mind for global organizations. Joining HP from Poly, where he held the role as President and CEO, Dave brings to HP over 25 years of senior leadership experience in business transformation, complex business partnerships, operations, and corporate development having built, led, and reinvigorated brands including TiVo, Weather Channel and Dish. Dave serves as board member and advisor to a number of technology start-ups, and also supports a group of charities addressing ultra-poverty. He holds a bachelor’s degree in philosophy from Harvard University and an M.B.A. from Oxford University. Dave is based in Denver, Colorado. Tuan Tran President, Technology & Innovation Tuan Tran is President of Technology & Innovation at HP Inc., an organization established in November 2024 to shape the company’s technology strategy and accelerate the implementation of AI experiences across HP’s diverse portfolio. Driven by a strong commitment to HP’s vision of leading the future of work, Tuan plays a pivotal role in delivering innovative solutions that empower HP customers to thrive in a rapidly changing environment. Throughout his tenure with HP, Tuan has held a variety of senior leadership positions across the company and helped drive innovations that have reshaped the technology landscape. His extensive experience and strategic foresight position Tuan as a key architect of HP’s future, ensuring that HP remains at the forefront of industry trends. Most recently, Tuan served as President of HP Imaging, Printing, and Solutions, a $20 billion global business that delivers services, software, and hardware for home, office, and graphics markets. Under Tuan’s leadership, HP’s printing portfolio was consistently recognized for its innovation, security, and sustainability by leading industry experts including KeyPoint Intelligence, the European Digital Press Association, and CRN. Tuan has also held roles in the Office Printing Solutions Organization, Consumer Business Organization, Mobile Computing Division, and Business Printing Division in Singapore. Tuan began his career at HP in 1991 in the Calculator division in Corvallis, Oregon, and has since held senior roles across the company, spanning marketing, finance, and operations. Tuan holds bachelor’s degrees from both the University of Wisconsin-Madison and the University of Oregon. He also holds a master’s degree in business administration in marketing, finance, and operations from the University of Oregon. He is based in Vancouver, Washington. Related links Business Laptops - EliteBook, zBook, & ProBook Shop Laptops & 2-in-1 Computers All HP Printers The History of HP HP.com Cyber security leadership - HP Security Center HP Services - PC Services for Commercial Enterprise and SMB IT Small Business Inclusion at HP: Our vision HP Customer Welcome Centers Country/Region : United States Select Your Country/Region and Language Africa Afrique América Central Argentina Asia Pacific Australia Bangladesh België Belgique Bolivia Brasil Canada Canada - Français Caribbean Česká republika Chile Colombia Danmark Deutschland Ecuador Eesti España France Hong Kong SAR Hrvatska India Indonesia Ireland Italia Latvija Lietuva Magyarország Malaysia México Middle East Nederland New Zealand Nigeria Norge Österreich Pakistan Paraguay Perú Philippines Polska Portugal Puerto Rico România Saudi Arabia Singapore Slovenija Slovensko South Africa Sri Lanka Suisse Suomi Sverige Switzerland Türkiye United Kingdom United States Uruguay Venezuela Việt Nam Ελλάδα България Казахстан Србија Україна ישראל الشرق الأوسط المملكة العربية السعودية ไทย 中华人民共和国 臺灣 地區 日本 香港特別行政區 한국 About Us Contact HP Careers Investor relations Sustainable impact Inclusion at HP Newsroom Tech Takes HP Store Newsletter HP Printables Newsletter Ways to buy Ways to buy Shop online Call an HP rep Find a reseller Enterprise store Public sector purchasing Support Download drivers Support & troubleshooting Community Authorized service providers Check repair status Fraud alert Security Center HP Partners HP Partners HP Amplify Partner Program HP Partner Portal Developers Stay connected Stay connected Recalls Product recycling Accessibility CA Supply Chains Act Privacy Cookie Preferences Your privacy choices Terms of use Limited warranty statement Terms & conditions of sales & service IP Notices ©2025 HP Development Company, L.P. The information contained herein is subject to change without notice. Your browser does not support iframes. Show Next Slide Show Previous Slide Go to slide %{i} Close Clear Play?"
    }
  ]
}