{
  "fuentes": [
    {
      "url": "http://workatbric.com/board_members",
      "email": "bricevents@cpgcre.com"
    },
    {
      "url": "http://workatbric.com/board_members",
      "email": "concrete-shard.png@2x.png"
    },
    {
      "url": "http://workatbric.com/board_members",
      "email": "concrete-shard.png@3x.png"
    },
    {
      "url": "http://workatbric.com/board_members",
      "email": "yluciano@crockerpartners.com"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-february-8-9-2025/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-february-8-9-2025/",
      "email": "info@hotworks.org"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-february-8-9-2025/",
      "email": "joe@tents4events.us"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-february-8-9-2025/",
      "email": "patty@hotworks.org"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-december-14-15-2024/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-december-14-15-2024/",
      "email": "info@hotworks.org"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-december-14-15-2024/",
      "email": "joe@tents4events.us"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-december-14-15-2024/",
      "email": "patty@hotworks.org"
    },
    {
      "url": "https://www.hotworkforce.com/",
      "email": "questions@hotworkforce.com"
    },
    {
      "url": "https://www.hotworkforce.com/",
      "email": "rsvpboardmeeting@hotworkforce.com"
    },
    {
      "url": "https://hotworks.org/applications/",
      "email": "patty@hotworks.org"
    },
    {
      "url": "https://hotworks.org/events-hot-works/the-boca-raton-fine-art-show-january-2728-2024/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://hotworks.org/events-hot-works/the-boca-raton-fine-art-show-january-2728-2024/",
      "email": "info@hotworks.org"
    },
    {
      "url": "https://hotworks.org/events-hot-works/the-boca-raton-fine-art-show-january-2728-2024/",
      "email": "joe@tents4events.us"
    },
    {
      "url": "https://hotworks.org/events-hot-works/the-boca-raton-fine-art-show-january-2728-2024/",
      "email": "patty@hotworks.org"
    },
    {
      "url": "https://primeairfl.com/contact/",
      "email": "info@primeairfl.com"
    },
    {
      "url": "https://suntaxconsulting.com/contact-us/",
      "email": "info@suntaxconsulting.com"
    },
    {
      "url": "https://hotworks.org/past-shows/the-boca-raton-fine-art-show-november-2-3-2024/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://hotworks.org/past-shows/the-boca-raton-fine-art-show-november-2-3-2024/",
      "email": "info@hotworks.org"
    },
    {
      "url": "https://hotworks.org/past-shows/the-boca-raton-fine-art-show-november-2-3-2024/",
      "email": "joe@tents4events.us"
    },
    {
      "url": "https://hotworks.org/past-shows/the-boca-raton-fine-art-show-november-2-3-2024/",
      "email": "patty@hotworks.org"
    }
  ],
  "mails": [
    "bricevents@cpgcre.com",
    "chosen-sprite@2x.png",
    "concrete-shard.png@2x.png",
    "concrete-shard.png@3x.png",
    "info@hotworks.org",
    "info@primeairfl.com",
    "info@suntaxconsulting.com",
    "joe@tents4events.us",
    "patty@hotworks.org",
    "questions@hotworkforce.com",
    "rsvpboardmeeting@hotworkforce.com",
    "yluciano@crockerpartners.com"
  ],
  "nombre_sitio": "hotworks.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://workatbric.com/board_members",
      "text": "Board Members - Boca Raton Innovation Campus MAPS (current) PROPERTY Features Amenities Availability ABOUT History Meet the Board AHA Committee Community Outreach VISIT EVENTS BOOK AN EVENT Art on BR i C Walls PLAN YOUR VISIT NEWS (current) TENANTS (current) CONTACT (current) Welcome to BRIC The office park of innovation Meet our esteemed board members. BRiC is going through a rebirth and is looking to re-integrate itself into the fabric of Boca Raton as a premier destination for innovation and thought leadership. We hope to play a role in sustaining Boca Raton’s status as one of the premier intellectual capital centers in the country. To do this, we have created a Program Board consisting of community leaders to assist with thoughts and ideas for events related to science, technology, the arts, engineering and mathematics that the entire community will enjoy. Sign-up here to receive emails on upcoming programs and events Peg Anderson Community Leader Peg Anderson Community Leader With strong corporate background, Anderson is an affable and enthusiastic entrepreneur who embraces positive collaborative relationships with clients, associates and colleagues. Anderson believes in commitment and contribution to her community. As such she serves on several boards and committees including; Boca Raton Museum of Art Cultural Council of Palm Beach County Florence Fuller Early Child Development Centers City of Boca Raton’s Downtown Advisory Committee, Business Improvement District Steering Committee and Art In Public Places Boca Raton Chamber of Commerce, Trustee Member Angelo Bianco Managing Partner, CP Group Angelo Bianco Managing Partner, CP Group Angelo Bianco is the Managing Partner of CP Group. Alongside Partner Chris Eachus, he guides the firm’s strategic growth and oversees capital markets relationships and investment and asset management operations. Bianco joined the organization in 2001 as Senior Vice President and rose to Managing Partner in 2017. Before joining CP Group, he worked in New York City as a real estate attorney for Tishman Speyer Properties serving as a member of the team that redeveloped Rockefeller Center during the 1990s. Bianco holds a Juris Doctor from the University of Virginia School of Law and a Bachelor of Science in Business Administration from George Washington University. He currently serves on the Board of Directors for CPG Cares Inc., a non-profit organization administrated by volunteer employees of CP Group, the Golden Bell Foundation, and sits on the Boca Raton Bowl Executive Committee. Frank Barbieri Board Chair, PBC Schools Frank Barbieri Board Chair, PBC Schools Frank Barbieri was born and raised in Akron, Ohio and moved to Boca Raton, Florida in 1984. He was elected to the Palm Beach County School Board in 2008 to represent District 5, the district that includes all of the schools in West Boca Raton and the city of Boca Raton, as well as other parts of Palm Beach County. He previously served as School Board Chair in 2010-2011, Vice Chair in 2013-2014, and now once again holds the position of Board Chair. Since his initial appointment, he has been a strong voice and advocate for teachers and parents. He values and cares deeply about children’s well-being, and works hard to ensure that all children receive the best education and access to resources. Currently, Barbieri is an attorney with Sachs Sax Caplan, a major law firm in Boca Raton and a pioneer in the field of homeowners’ association and condo association law. He concentrates his practice in the areas of estate planning and real estate. Before earning his law degree from the University of Akron, Barbieri was a police officer for 11 years in Akron, Ohio. As a concerned and dedicated citizen of Palm Beach County, Barbieri has demonstrated a commitment to the area where he lives. His dedication to Palm Beach County is reflected in his past and current involvement with several civic, governmental, and community organizations. He served on the County’s Zoning Commission for nearly two decades, as well as the Land Use Advisory Board. He also held the position of president of the Loggers Run Homeowners Association. Additionally, he had roles on the advisory boards for First Southern Bank, Loggers’ Run Middle School, and Sandpiper Shores Elementary School. He served on the board of directors for the West Boca Community Council, Best Foot Forward, and the Business Development Board. He also served on the Value Adjustment Board, Boca Raton Chamber of Commerce, and the board of trustees for the George Snow Scholarship Fund. Barbieri has been married to Rita Barbieri for 50 years. They have three children and three grandchildren. He enjoys spending time with his family and close friends. Daniel Cane CEO and Co-Founder, Modernizing Medicine Daniel Cane CEO and Co-Founder, Modernizing Medicine Daniel Cane is CEO and co-founder of BRIC-based Modernizing Medicine, Inc., a healthcare IT company that is revolutionizing the way in which healthcare information is created, consumed and utilized to increase practice efficiency and improve patient outcomes. Known for its progressive growth as a medical technology company, Modernizing Medicine is frequently recognized both nationally and regionally for its achievements under Cane’s leadership. In 2016, 2017 and 2018 the company was named one of Fastest Growing Companies in North America on the Deloitte 2016 Technology Fast 500™ list. Consecutively starting in 2015, the company has been named to the exclusive Inc. 5000 list, a prestigious compilation of the fastest growing private companies in the country. Forbes named the company as one of America’s Most Promising Companies in 2013 and 2015. Cane has received numerous personal accolades during his tenure at Modernizing Medicine. In 2018 the Research Park at FAU honored Cane with the Distinguished Entrepreneur Award. In 2016 the South Florida Business Journal included him as a South Florida Ultimate CEO. In 2015 he was named EY Entrepreneur of the Year®. In 2014 the Sun Sentinel announced that Cane earned the title of Excalibur Awards Palm Beach Small Business Leader of the Year for 2013. He was also named a Palm Beach County Ultimate CEO by the South Florida Business Journal and a CEO of the Year by CEO World. An entrepreneur, Cane has a BS in Applied Economics from Cornell University, where, as an undergraduate, he co-founded Blackboard Inc., raised over $100M in venture capital and in 2004 helped take the company public on the NASDAQ (BBBB). In 2011, Blackboard was sold for $1.6B. Active in the local community, Mr. Cane serves as the Vice-Chairman of the Board at the South Florida Science Center and Aquarium and is on the Board of Directors of the United Way of Palm Beach County. Daniel works, lives and enjoys life with his wife and three children. Mary Csar Executive Director, Boca Raton Historical Society Mary Csar Executive Director, Boca Raton Historical Society Mary Csar became the Director of the Boca Raton Historical Society in April 1999. She oversees all operational, financial, communications, developmental, curatorial and administrative aspects of the Boca Raton Historical Society & Museum. She came to the Historical Society after having completed 18 months at the BRHS as Coordinator of the 25th Anniversary celebration. Csar spent four years at the International Museum of Cartoon Art, as Director of Community Relations. She served as President of the Junior League of Boca Raton from 1990-91. Prior to her League work, she worked for the Community Redevelopment Agency assisting in the preparation and coordination of the Downtown Development of Regional Impact, which spearheaded the redevelopment of Downtown. Csar holds an M.A.T. degree in economics from Vanderbilt University, and an A.B. in economics from Randolph-Macon Woman’s College. She is a 1990 graduate of Leadership Boca and currently serves as Chairman of the Boca Raton Downtown Advisory Committee and is a member of the Business Improvement District sub-committee. Jessica DelVecchio Economic Development Manager, City of Boca Jessica DelVecchio Economic Development Manager, City of Boca In April 2005, Jessica Del Vecchio joined the City of Boca Raton as its first economic development manager and was tasked with leading the newly established Economic Development Division. Since its inception, the Office of Economic Development has successfully facilitated a number of corporate relocation and expansion projects; including one of the largest deals in Palm Beach County – which committed to creating 838 new jobs in Boca Raton. Prior to accepting the role, Del Vecchio spent 15 years in the finance industry. Attaining FINRA Series 3, 7, 63, 65 and Florida’s Life, Health and Variable Annuity licenses, she spent 8 years at Smith Barney and 7 years at Haar Capital, both based in Boca Raton. Del Vecchio has lived in Boca since 1991 and attended Lynn University. Graduating with a bachelor’s degree in Business Management and an MBA in Finance, Jessica proudly spoke at her graduation ceremony. Jason Hagensick CEO of YMCA South Palm Beach County Jason Hagensick CEO of YMCA South Palm Beach County Jason Hagensick joined the YMCA of South Palm Beach County as President and Chief Executive Officer in July 2016. In this role, Jason is responsible for all YMCA facilities and programs including the Peter Blum Family YMCA of Boca Raton, the DeVos-Blum Family YMCA of Boynton Beach, the YMCA@901 NCCI in Boca Raton and the YMCA of South Palm Beach County’s Community Outreach efforts. As CEO, Jason is responsible supervising a team of 450+ staff, and advancing the YMCA’s vision to promote youth development, healthy living and social responsibility to over 70,000 members and program participants within the southern Palm Beach County community. YMCA programs include, but are not limited to pre-school, after school academic enrichment, summer day camp, aquatics / water safety, youth sports, teen leadership, and wellness for the entire family. Prior to joining the YMCA of South Palm Beach County, Jason was on the national YMCA staff out of Chicago. Before joining Y-USA, Jason served as President and CEO of the YMCA of Greater Long Beach (CA). Currently, Jason is serving a third year as Chief Volunteer Officer of the Florida State Alliance of YMCAs, working closely with leadership staff to support and strengthen 17 local YMCA associations in the State of Florida. He was recently elected as a member of the Small to Mid-Size YMCA CEO Network – in this role, Jason represents more than 650 YMCAs from across the country. A Texas native and graduate of Texas A&M University – Corpus Christi, Jason began his YMCA career 32 years ago at the YMCA in Corpus Christi, TX. Jason and his wife Liz, who met at the YMCA of San Antonio, have two children, Abbey and Wyatt. Dr. Joel Herbst Assistant Dean, FAU Henderson School Dr. Joel Herbst Assistant Dean, FAU Henderson School Dr. Joel Herbst is the Florida Atlantic University College of Education assistant dean, PK-12 Schools and Educational Programs. Herbst is responsible for administration, management, evaluation and budgetary concerns for A.D. Henderson University Schools, Palm Pointe Educational Research School at Tradition, Pine Jog Environmental Educational Center / Everglades Youth Conservation Camp, and Karen Slattery Educational Research Center. Herbst joined FAU from the Broward County School Board Office where he served as South Area Superintendent of Schools. He began teaching at Marjory Stoneman Douglas High School in Parkland. Leadership positions have occupied 18 of his 21 years working in Florida’s education system. He has served on numerous committees and boards of education agencies including Florida Association of School Administrators, American Association of School Administrators and the Florida Department of Education. Pete Martinez Former VP of Global Business Services, IBM/Current Chairman and CEO, SIVOTEC Analytics Pete Martinez Former VP of Global Business Services, IBM/Current Chairman and CEO, SIVOTEC Analytics Pete Martinez serves as Chairman and CEO of Game Changer Tec LLC and SIVOTEC Analytics; high innovation enterprises at the intersection of Sports, Health, Technology, and Big Data Analytics. An international entrepreneur, he has led numerous high impact initiatives in the areas of high technology, business consulting, healthcare, and education. During his 32-year tenure with IBM, Martinez, Vice President of Global Business Services and the Senior Location Executive for IBM South Florida, led a 1,700-person organization composed of consultants, hardware and software developers, industry specialists and sales leaders. He led projects in the areas of advanced research, supercomputing and information-based medicine. In 2003, Martinez led the formation of IBM’s largest Business Transformation Multi-Client Center now a multi-billion-dollar outsourcing business. Previously, he led the formation of Business Consulting and System Integration Services in Latin America a 2000 person, 17 countries, $1 billion business. He was also the founding executive of IBM’s e-business Strategy Consulting and Consulting Profession Leader for the Americas. Martinez also led the creation of the IBM University Consortium ‘LA Grid’ (Latin America Grid) and the advanced pandemic global research initiative ‘Project Checkmate’ in partnership with The Scripps Research Institute. Among other career highlights, Martinez was part of the original IBM Personal Computer team and one of the founders of IBM’s Internet Division and eBusiness Consulting. Martinez is also Research Affiliate at the Massachusetts Institute of Technology (MIT) and is a visiting professor at Florida Atlantic University and Florida International University.  Additionally, he is Chair of the University of Miami School of Engineering Advisory Board, Chair of the Florida International University School of Computer Science Advisory Board, member of Florida Atlantic University’s Engineering Advisory Board, and is Chairman Emeritus of the Florida Research Consortium Board of Directors. Martinez has over 30 patents and technical publications in the areas of: healthcare, Artificial Intelligence, computer architecture, robotics, optical disks and display technology. Martinez is a frequent key note at international conferences and has been featured by the Wall Street Journal, USA Today, ABC News, The Economist, Univision and CNN and has presented at the United Nations. Martinez holds a Bachelor of Science in Electrical Engineering from the University of Miami where he was named the Distinguished Alumnae (1998) and a Member of the Tau Beta Pi and Iron Arrow Honor Societies.  In 2002 he was awarded the “Engineer of the Year” by the Association of Cuban Engineers, and in 2004 was inducted into the Miami Dade College Hall of Fame. Troy McLellan President and CEO, Boca Chamber Troy McLellan President and CEO, Boca Chamber Troy M. McLellan is the President and Chief Executive Officer of the Boca Raton Chamber of Commerce in Boca Raton, Florida, the largest chamber in Palm Beach County. Having been promoted from the position of Executive Vice President and Chief Operations Officer in November 2005, he has held various positions at the Chamber, enjoying 21 years of service. Prior to joining the Chamber, he was a strategy specialist, developing marketing programs keyed to analysis and future planning for the high-end mail order catalog industry. McLellan is a Past Chair and current Board member of the Florida Association of Chamber Professionals (FACP). He also serves on the Board of the U.S. Chamber’s Committee of 100, and the Florida Chamber Federation. Troy is a Past-Chair and current Board member of Discover The Palm Beaches, Palm Beach County’s Destination Marketing Organization, and serves on the Board of the Young Entrepreneurs Academy, the Boca Chamber’s Golden Bell Education Foundation, and Business Leaders United for Boca Raton (BLUPAC). Other local board seats include the Research Park Foundation, the Community Academies Advisory Board (CAAB) serving the West Boca Community High School, the 100 Club, which serves the Boca Raton Police and Fire Departments, and the Palm Beach County Sheriff’s Office and the Florida Highway Patrol. He is also on the City of Boca Raton Affordable Housing Advisory Committee. Further community involvement includes the American Cancer Society and the Boca Raton Community Public Safety Task Force. Former Board service has included the Association of Chamber of Commerce Executives (ACCE), Florida Atlantic University Schools (FAUS) School Advisory Body (SAB), CareerSource Palm Beach County, and the Small Business Development Center (SBDC) Advisory Board. He received his Certified Chamber Executive (CCE) designation title ACCE in 2007 and his Florida Certified Chamber Professional designation (FCCP) from the Florida Association of Chamber Professionals in 2012. Troy is a graduate of the Aspen Institute’s Transformational Leadership Program, The Institute for Economic Development, UNC at Chapel Hill, and the Boca Raton Chamber’s Leadership Boca Program and Political Training Institute. Originally from New Hampshire, he has been a resident of Boca Raton for more than 20 years. Troy received his bachelor’s degree in Business Management from Bentley College in Waltham, MA. Lincoln Mendez CEO of Boca Raton Regional Hospital Lincoln Mendez CEO of Boca Raton Regional Hospital Lincoln Mendez is the President and Chief Executive Officer of Boca Raton Regional Hospital.  Mr. Mendez has been in this position since July 1, 2019, when Boca Regional became part of the Baptist Health South Florida system.  Prior to that, Mr. Mendez held the position of CEO at South Miami Hospital from 2010 – 2019 and the position of CEO at Doctor’s Hospital from 1995 – 2010.  During this period at Doctors Hospital, he was the CEO of HealthSouth Doctors’ Hospital, Inc. for the eight years prior to Baptist Health South Florida’s acquisition of Doctors Hospital in October 2003.  Previous to that, Mr. Mendez was the Chief Operating Officer at Kendall Regional Medical Center in Miami, Florida, from 1993 to 1995 and has also served as the Chief Operating Officer at Pembroke Pines Hospital and as Assistant Administrator for Aventura Hospital. Mr. Mendez holds a Master’s in Health Administration Degree from Florida International University, Miami, Florida, and both a Bachelor of Arts Degree in Biology and a Bachelor of Science Degree in Medical Technology from Southern Adventist University, Collegedale, Tennessee. Mr. Mendez is a member of the American College of Healthcare Executives and is licensed as a laboratory supervisor and medical technologist from the Florida Department of Professional Regulations.  Mr. Mendez served as Past Chairman of the Board of the South Florida Hospital and Healthcare Association.  He has also served as an Alternate for the American Hospital Association Regional Policy Board.  Mr. Mendez has also served as Adjunct Faculty for the Florida International University graduate program in Health Administration. Mr. Mendez is currently a member of the Orange Bowl Committee, the Boca Raton Chamber of Commerce, the South Florida Hospital and Healthcare Association, and the Consortium Board of the FAU Schmidt College of Medicine Medical School program. Contact Management Office 5000 T-Rex Avenue, Suite 160 Boca Raton FL 33431 561.807.6932 Events Manager Kisha Cools Security 561.443.3664 Tenant Services Coordinator Yaritza Luciano Join our mailing list for the latest BRiC news & events! × [[[[\"field8\",\"contains\",\"Other\"]],[[\"show_fields\",\"field17\"]],\"and\"]] 1 Step 1 Never miss a BRiC minute Join our mailing list for the latest BRiC news & events! First Name first_name no-icon Last Name last_name no-icon Email Address a valid email email SIGN UP keyboard_arrow_left Previous Next keyboard_arrow_right FormCraft - WordPress form builder × Learn more about BRiC Leasing Brochure Book an Event Boca Raton Innovation Campus is owned and managed by CP Group. Learn more about CP Group 5000 T-Rex Ave., Ste 160, Boca Raton, FL 33431 Website by PRIMARY"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-february-8-9-2025/",
      "text": "Boca Raton Fine Art Show, February 8 & 9 2025 Skip to content No results Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Username or Email Address Password Remember Me Forgot Password? Log In Username or Email Address Get New Password ← Back to login Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Search Login Shopping cart $ 0.00 0 Menu Boca Raton Fine Art Show, February 8 & 9, 2025 Dates Saturday, February 08, 2025  |  10am – 5pm Sunday, February 09, 2025  |  10am – 5pm Venue Sanborn Square Park, 72 N Federal Hwy, Boca Raton, FL 33432 Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org ARTISTS APPLY HERE ARTISTS PAY HERE Art of the Show Annie Gudis Painting Frank Hiffernan Sculpture Carrie Johnson Clay Selma Karaca Fiber Mark Kosarin Photography Ana Obermayr & Conar ‘Dreamboat’ Piermarini Glass Melissa Shuttlesworth Digital Thomas Williams Painting Sue Ye Painting Michelle Zorich & Katherine Martin Sculpture Lisa Davin Jewelry Ira and Sue Lances Fiber Sip-Tshun Ng Mixed Media Paul Willsea & Carol O’ Brien Glass Dale Rogers Sculpture Christopher Buonomo Sculpture Patrick Slagle Painting Sue Ye Painting Alfred Addo Sculpture Participating Artists Show Map About the Show Hot Works fine art and craft shows are voted as one of America’s Top 100 Art Shows in America – 18x by Sunshine Artist Magazine and Art Fair Source Book The Boca Raton Fine Art Show returns to Sanborn Square Park with high visibility off of Federal Highway in downtown Boca Raton Executive Producer Patty Narozny has 35+ years of media and event experience Featuring high quality, juried fine art and craft show with top-notch artists selling their original and personally handmade art All discipline for sale including paintings, sculpture, glass, clay, photography, wood art, fiber, mixed media, jewelry and more Criteria for jurying is based on originality, technique, execution and booth appearance There is something for everyone, in all price ranges Institute for the Arts & Education is the 501c3 non-profit organization which supports visual arts, cultural diversity, community enrichment and fostering art education among youth Our philosophy is to bring patrons specifically to the art show with the means to purchase art – they are culturally savvy with money to spend Both onsite marketing and turnkey community enrichment opportunities are available We are grateful for the continued relationships with local media – WLRN NPR, South Florida PBS, Jewish Journal, Sun Sentinel, Palm Beach Post, W J N O 1290 Newsradio and OutSFL.com Large banners, event postcards and posters are hung and distributed within the community to further target the art-buying patron which helps to make the show a success Great food and live entertainment While at the show be sure to visit the Budding Artist Competition – this unique and one-of-a-kind program invites all students in grades 6-12 to enter his/her original art that is publicly displayed within the art show duration of the event; Sunday at 3pm there is a presentation of Youth Art Awards with cash prizes – students are exposed to the rules and entrepreneurship opportunity of doing art shows for a living Tents: Lightdomes for Rent https://tents4events.us/ $240+tax for Light Dome, Pro-Panels are $150+tax. To reserve, please call Joe with Tents 4 Events at 954-675-7634 or email joe@tents4events.us . Includes set up and tear down There is free admission; optional donations are accepted at Donate Now to support arts and education Our #1 goal is to make Hot Works Boca Raton Fine Art Show a pleasant and profitable experience for all of our stakeholders, at the same time bringing a wonderful event to the community. Questions? Contact Patty at 941-755-3088 or patty@hotworks.org . Participating Artists Show Map About the Show Hot Works fine art and craft shows are voted as one of America’s Top 100 Art Shows in America – 18x by Sunshine Artist Magazine and Art Fair Source Book The Boca Raton Fine Art Show returns to Sanborn Square Park with high visibility off of Federal Highway in downtown Boca Raton Executive Producer Patty Narozny has 35+ years of media and event experience Featuring high quality, juried fine art and craft show with top-notch artists selling their original and personally handmade art All discipline for sale including paintings, sculpture, glass, clay, photography, wood art, fiber, mixed media, jewelry and more Criteria for jurying is based on originality, technique, execution and booth appearance There is something for everyone, in all price ranges Institute for the Arts & Education is the 501c3 non-profit organization which supports visual arts, cultural diversity, community enrichment and fostering art education among youth Our philosophy is to bring patrons specifically to the art show with the means to purchase art – they are culturally savvy with money to spend Both onsite marketing and turnkey community enrichment opportunities are available We are grateful for the continued relationships with local media – WLRN NPR, South Florida PBS, Jewish Journal, Sun Sentinel, Palm Beach Post, W J N O 1290 Newsradio and OutSFL.com Large banners, event postcards and posters are hung and distributed within the community to further target the art-buying patron which helps to make the show a success Great food and live entertainment While at the show be sure to visit the Budding Artist Competition – this unique and one-of-a-kind program invites all students in grades 6-12 to enter his/her original art that is publicly displayed within the art show duration of the event; Sunday at 3pm there is a presentation of Youth Art Awards with cash prizes – students are exposed to the rules and entrepreneurship opportunity of doing art shows for a living Tents: Lightdomes for Rent https://tents4events.us/ $240+tax for Light Dome, Pro-Panels are $150+tax. To reserve, please call Joe with Tents 4 Events at 954-675-7634 or email joe@tents4events.us . Includes set up and tear down There is free admission; optional donations are accepted at Donate Now to support arts and education Our #1 goal is to make Hot Works Boca Raton Fine Art Show a pleasant and profitable experience for all of our stakeholders, at the same time bringing a wonderful event to the community. Questions? Contact Patty at 941-755-3088 or patty@hotworks.org . Previous Show Our Sponsors Please Support our Sponsors Contributions and in-kind support services play a critical role in every Hot Works event. We thank our local officials, media partners, corporate sponsors and friends who make our community outreach programs possible. Thank you! SPONSORSHIP OPPORTUNITIES Upcoming Shows Dates Saturday, March 29, 2025  |  10am – 6pm Sunday, March 30, 2025  |  10am – 5pm Venue Phillippi Estate Park/Mansion/Creek 5500 S. Tamiami Trail Sarasota, FL 34231 Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org SUBSCRIBE TO OUR NEWSLETTER! Name First Last Email (Required) Are you an Artist a Potential Sponsor a Food Vendor a Patron Other Specify: How did you hear about us? (Required) Referral TV Radio Print Google Facebook Instagram Other Who Please Specify Phone This field is for validation purposes and should be left unchanged. Δ Contact Florida Satellite Office PO Box 1425, Sarasota, FL 34230 Phone: +1 941.755.3088 Michigan Office PO Box 79, Milford, MI 48381-0079 Phone: +1 248.762.2462 Email: patty@hotworks.org Quick Links Home For Artists For Kids Gallery About News Donate Contact Past Events Upcoming Art Shows Boca Raton Fine Art Shows - Sanborn Square Park, downtown Boca Raton, FL February 8 & 9, 2025 November 1 & 2, 202 5 Sarasota Fine Art Shows - Phillippi Estate Park, Sarasota, FL March 21 & 22 202 6 Orchard Lake Fine Art Show – heart of West Bloomfield, MI July 26 & 27, 2025 Copyright © 2025 - Hot Works, LLC. All Rights Reserved"
    },
    {
      "url": "https://hotworks.org/events-hot-works/boca-raton-fine-art-show-december-14-15-2024/",
      "text": "Boca Raton Fine Art Show, December 14 & 15, 2024 Skip to content No results Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Username or Email Address Password Remember Me Forgot Password? Log In Username or Email Address Get New Password ← Back to login Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Search Login Shopping cart $ 0.00 0 Menu Boca Raton Fine Art Show, December 14 & 15, 2024 Dates Saturday, December 14, 2024  |  10am – 5pm Sunday, December 15, 2024  |  10am – 5pm Venue Sanborn Square Park, 72 N Federal Hwy, Boca Raton,\nFL 33432 Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org ARTISTS APPLY HERE ARTISTS PAY HERE Art of the Show Aaron Reed Drawing Bruce Reinfeld Mixed Media Cheryl Sette Mixed Media Dallas Primavera Painting David Parise Photography Eugene Lagana Photography Jim Zhang Painting Jon Seeman Sculpture Karin & Leo Villaroma Clay Martin Karadzhov Painting Marvin \"Murf\" Murpht Painting Michaela Hoberg Painting Nancy Ney Photography Rich Fizer Glass Suzanne Bellows Mixed Media Tali Almog Painting Tolga Zipkinkurt Mixed Media Vinicio Paz Photography Alfred Addo Sculpture Participating Artists Show Map About the Show Hot Works fine art and craft shows are voted as one of America’s Top 100 Art Shows in America – 18x by Sunshine Artist Magazine and Art Fair Source Book The Sarasota Fine Art Show returns to Phillippi Estate Park with high visibility off of US-41/Tamiami Trail, just south of Siesta Key and downtown Sarasota Executive Producer Patty Narozny has 35+ years of media and event experience Featuring high quality, juried fine art and craft show with top-notch artists selling their original and personally handmade art All discipline for sale including paintings, sculpture, glass, clay, photography, wood art, fiber, mixed media, jewelry and more Criteria for jurying is based on originality, technique, execution and booth appearance There is something for everyone, in all price ranges Institute for the Arts & Education is the 501c3 non-profit organization which supports visual arts, cultural diversity, community enrichment and fostering art education among youth Our philosophy is to bring patrons specifically to the art show with the means to purchase art – they are culturally savvy with money to spend Both onsite marketing and turnkey community enrichment opportunities are available We are grateful for the continued relationships with local media – WEDU PBS, WUSF 89.7 Public Radio, Suncoast News Network, Jewish news, Longboat Key News, Sarasota City News, and Landings Eagle Large banners, event postcards and posters are hung and distributed within the community to further target the art-buying patron which helps to make the show a success Great food and live entertainment While at the show be sure to visit the Youth Art Competition – this unique and one-of-a-kind program invites all students in grades K-8 or 6-12 (depending on the show) to enter his/her original art that is publicly displayed within the art show duration of the event; Sunday at 3pm there is a presentation of Youth Art Awards with cash prizes – students are exposed to the rules and entrepreneurship opportunity of doing art shows for a living Tents: Lightdomes for Rent https://tents4events.us/ $230+tax for Light Dome, Pro-Panels are $140+tax. To reserve, please call Joe with Tents 4 Events at 954-675-7634 or email joe@tents4events.us . Includes set up and tear down There is free admission; optional donations are accepted at Donate Now to support arts and education $5 parking that is close and very convenient; good for in and out access; supports arts and education Our #1 goal is to make Hot Works Sarasota Fine Art Show a pleasant and profitable experience for all of our stakeholders, at the same time bringing a wonderful event to the community. Questions? Contact Patty at 941-755-3088 or patty@hotworks.org . Participating Artists Show Map About the Show Hot Works fine art and craft shows are voted as one of America’s Top 100 Art Shows in America – 18x by Sunshine Artist Magazine and Art Fair Source Book The Sarasota Fine Art Show returns to Phillippi Estate Park with high visibility off of US-41/Tamiami Trail, just south of Siesta Key and downtown Sarasota Executive Producer Patty Narozny has 35+ years of media and event experience Featuring high quality, juried fine art and craft show with top-notch artists selling their original and personally handmade art All discipline for sale including paintings, sculpture, glass, clay, photography, wood art, fiber, mixed media, jewelry and more Criteria for jurying is based on originality, technique, execution and booth appearance There is something for everyone, in all price ranges Institute for the Arts & Education is the 501c3 non-profit organization which supports visual arts, cultural diversity, community enrichment and fostering art education among youth Our philosophy is to bring patrons specifically to the art show with the means to purchase art – they are culturally savvy with money to spend Both onsite marketing and turnkey community enrichment opportunities are available We are grateful for the continued relationships with local media – WEDU PBS, WUSF 89.7 Public Radio, Suncoast News Network, Jewish news, Longboat Key News, Sarasota City News, and Landings Eagle Large banners, event postcards and posters are hung and distributed within the community to further target the art-buying patron which helps to make the show a success Great food and live entertainment While at the show be sure to visit the Youth Art Competition – this unique and one-of-a-kind program invites all students in grades K-8 or 6-12 (depending on the show) to enter his/her original art that is publicly displayed within the art show duration of the event; Sunday at 3pm there is a presentation of Youth Art Awards with cash prizes – students are exposed to the rules and entrepreneurship opportunity of doing art shows for a living Tents: Lightdomes for Rent https://tents4events.us/ $230+tax for Light Dome, Pro-Panels are $140+tax. To reserve, please call Joe with Tents 4 Events at 954-675-7634 or email joe@tents4events.us . Includes set up and tear down There is free admission; optional donations are accepted at Donate Now to support arts and education $5 parking that is close and very convenient; good for in and out access; supports arts and education Our #1 goal is to make Hot Works Sarasota Fine Art Show a pleasant and profitable experience for all of our stakeholders, at the same time bringing a wonderful event to the community. Questions? Contact Patty at 941-755-3088 or patty@hotworks.org . TV  Show Our Sponsors Please Support our Sponsors Contributions and in-kind support services play a critical role in every Hot Works event. We thank our local officials, media partners, corporate sponsors and friends who make our community outreach programs possible. Thank you! SPONSORSHIP OPPORTUNITIES Upcoming Show Dates Saturday, January 4, 2025 | 10am–5pm Sunday, January 5, 2025 | 10am–5pm Venue Phillippi Estate Park/Mansion/Creek 5500 S. Tamiami Trail Sarasota, FL 34231 Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org SUBSCRIBE TO OUR NEWSLETTER! Name First Last Email (Required) Are you an Artist a Potential Sponsor a Food Vendor a Patron Other Specify: How did you hear about us? (Required) Referral TV Radio Print Google Facebook Instagram Other Who Please Specify Comments This field is for validation purposes and should be left unchanged. Δ Contact Florida Satellite Office PO Box 1425, Sarasota, FL 34230 Phone: +1 941.755.3088 Michigan Office PO Box 79, Milford, MI 48381-0079 Phone: +1 248.762.2462 Email: patty@hotworks.org Quick Links Home For Artists For Kids Gallery About News Donate Contact Past Events Upcoming Art Shows Boca Raton Fine Art Shows - Sanborn Square Park, downtown Boca Raton, FL February 8 & 9, 2025 November 1 & 2, 202 5 Sarasota Fine Art Shows - Phillippi Estate Park, Sarasota, FL March 21 & 22 202 6 Orchard Lake Fine Art Show – heart of West Bloomfield, MI July 26 & 27, 2025 Copyright © 2025 - Hot Works, LLC. All Rights Reserved"
    },
    {
      "url": "https://www.hotworkforce.com/",
      "text": "Workforce Solutions for the Heart of Texas | CALL TOLL FREE 1-866-982-9226 Facebook Twitter LinkedIn Search for: MENU Individuals Individuals INDIVIDUALS CAREER EXPLORATION Training & Education GED & ESL Classes Apply for No-Cost Training Apprenticeships FIND A JOB Featured HOT Jobs Hiring Red, White & YOU Individuals w/ Disabilities Job Fairs & Hiring Events Job Readiness Workshops FINANCIAL ASSISTANCE Apply for Financial Assistance New Child Care System Unemployment Benefits Businesses Businesses BUSINESSES RECRUIT TALENT 2025 Fall Hiring Fair Business Registration Consulting Services Hiring Incentives TRAIN YOUR WORKFORCE Early Education Apprenticeship LAYOFFS & BUSINESS CLOSINGS LABOR MARKET INSIGHTS JULY 2025 LABOR MARKET NEWS RELEASE KEY INDUSTRIES RESOURCE CENTER FAQs Program Services Program Services CHILD CARE Child Care Services ChildOne Resource Map Parent Information Provider Information Texas Rising Star Providers Contact CCS VETERAN SERVICES Contact Information Employment & Education Resources Hiring Red, White & You! Military-to-Civilian Crosswalk Tools ADULT EDUCATION & LITERACY SERVICES VOCATIONAL REHABILITATION YOUTH SERVICES About Us About Us ABOUT BOARD OF DIRECTORS BUSINESS OPPORTUNITIES CONTACT US CENTER LOCATIONS EQUAL OPPORTUNITY INITIATIVES ChildOne YES! Youth Employment Solutions RECOGNITION & AWARDS PUBLICATIONS 2024 IMPACT REPORT Employer Spotlight LEARN  MORE SPOTLIGHT Employer Spotlight Chaparral Co. is hiring! Chaparral Co. provides firestop installation and insulation services on commercial and industrial projects, supporting building code compliance, safety, and energy performance. Click to learn more! May Hiring Fair CHECK IN NOW EVENTS Fall Hiring Fair The 2025 Fall Hiring Fair is happening Monday, Sept. 15, from 3-6 pm at McLennan Hall in the Waco Convention Center. Our biggest hiring fair will feature 60+ employers and over 500 job openings. Skip the line at the event, and check in online now! Slide 4 LMI Report VIEW REPORT REPORTS July 2025 Labor Market Report The unemployment rate in the Heart of Texas region inched up slightly in July, rising to 4.1% from 3.9% in June. This change reflects 7,596 residents actively seeking work, along with 1,296 continued unemployment claims filed during the month. GWAMMA Story READ THE STORY STORY Building Tomorrow's Welders In partnership with Waco ISD's Greater Waco Advanced Manufacturing Academy (GWAMA) and local businesses, students are gaining hands-on skills through our YES! High School Student Welding Internship program. Read Isaiah's story! FEATURED HOT JOBS View All HOT Jobs | Click to Subscribe CREW MEMBER Sonic | Hewitt, TX | Full-Time | Expires: 9/20/2025 APPLY NOW COOK Sonic | Bellmead, TX | Full-Time | Expires: 9/20/2025 APPLY NOW CASHIER Dairy Queen | Robinson, TX | Full-Time | Expires: 9/18/2025 APPLY NOW CHIEF ENGINEER – HOTEL MAINTENANCE Hampton Inn & Suites | Waco, TX | Full-Time | Expires: 9/17/2025 APPLY NOW SCHOOL RESOURCE OFFICER Hillsboro ISD | Hillsboro, TX | Full-Time | Expires: 10/3/2025 APPLY NOW TAX PROFESSIONAL Mid-Texas Tax Associates LLC | Waco, TX | Full-Time | Expires: 10/3/2025 APPLY NOW SOFTWARE SUPPORT SPECIALIST Centex AxisCare LLC | Waco, TX | Full-Time | Expires: 9/12/2025 APPLY NOW CONTROL ROOM OPERATOR Cinder Residuals LLC | Waco, TX | Full-Time | Expires: 9/12/2025 APPLY NOW RECEPTIONIST Placements Unlimited | Waco, TX | Full-Time | Expires: 9/18/2025 APPLY NOW CDL DRIVER Joe Neason Contracting LLC | Thornton, TX | Full-Time | Expires: 9/17/2025 APPLY NOW CNAs Homestead Nursing | Hillsboro, TX | Full-Time | Expires: 9/30/2025 APPLY NOW BILINGUAL CUSTOMER SERVICE REP G C Financial Corp | Waco, TX | Full-Time | Expires: 9/30/2025 APPLY NOW PRESSER/DRY CLEANER WORKER Clover Cleaners & Laundry | Bellmead, TX | Full-Time | Expires: 9/30/2025 APPLY NOW PROCESS MAINTENANCE ENGINEER Electrolit Manufacturing USA Inc | Waco, TX | Full-Time | Expires: 9/19/2025 APPLY NOW MERCHANDISER PepsiCo Inc | Waco, TX | Full-Time | Expires: 7/20/2025 APPLY NOW CONSTRUCTION HELPER Mazanec Construction | Waco, TX | Full-Time | Expires: 4/10/2025 APPLY NOW OVERNIGHT REMODEL TEAM ASSOCIATE Walmart | Hillsboro, TX | Full-Time | Expires: 4/10/2025 APPLY NOW GUEST EXPERIENCE LEAD McDonald's | Fairfield, TX | Full-Time | Expires: 4/2/2025 APPLY NOW FRY COOK Mary's Breakfast and Burger Bar | Groesbeck, TX | Full-Time | Expires: 4/2/2025 APPLY NOW APPLIANCE DELIVER/DROP-OFF PERSON Brazos Distributors Inc | Hewitt, TX | Full-Time | Expires: 3/30/2025 APPLY NOW GENERAL MANAGER HteaO Hewitt | Hewitt, TX | Full-Time | Expires: 4/3/2025 APPLY NOW ADJUNCT HVAC INSTRUCTOR SCI Acquisition Co Inc | Waco, TX | Full-Time | Expires: 3/28/2025 APPLY NOW UPCOMING EVENTS Sep 11 2025 September 2025 Executive Committee Meeting Sep 15 2025 2025 Fall Hiring Fair Sep 16 2025 Discover 5 Ways to Job Search in WorkinTexas.com | Tuesday McLennan County Workforce Solutions Center Sep 16 2025 Write a Resumé that Stands Out McLennan County Workforce Solutions Center No event found! SEE FULL CALENDAR Workforce Solutions WIOA program has helped me follow my dream and become an LVN by helping with my books, tuition and gas. I graduated in August, took my boards in September and had a job offer in October to work at Groesbeck LTC, so now I work there full time. – Jessica L., Workforce Solutions WIOA Program Participant We’ve become a true partner with Workforce Solutions for the Heart of Texas. We value the input they provide to our organization. They expect and appreciate the same feedback back to them, which has allowed us to create that cohesiveness to allow growth, new initiatives and partnerships. – Clint W., Hobbs Bonded Fibers Workforce Solutions for the Heart of Texas is one of 28 local workforce development boards in Texas that partners with the Texas Workforce Commission (TWC) to provide workforce solutions to employers and job seekers. The Heart of Texas region includes Bosque, Falls, Freestone, Hill, Limestone and McLennan counties. QUICK LINKS About Us WorkinTexas Child Care Map Find a Center Privacy Policy Language Assistance CONTACT US 1-866-982-9226 questions@hotworkforce.com JOIN THE NEWSLETTER First Name * Last Name * Email (required) * Select list(s) to subscribe to A Business An Individual Example: Yes, I would like to receive emails from Workforce Solutions for the Heart of Texas. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. Workforce Solutions for the Heart of Texas is one of 28 local workforce development boards in Texas that partners with the Texas Workforce Commission (TWC) to provide workforce solutions to employers and job seekers. The Heart of Texas region includes Bosque, Falls, Freestone, Hill, Limestone and McLennan counties. QUICK LINKS About Us WorkinTexas Child Care Map Find a Center CONTACT US 1-866-982-9226 questions@hotworkforce.com JOIN THE NEWSLETTER First Name * Last Name * Email (required) * Select list(s) to subscribe to A Business An Individual Example: Yes, I would like to receive emails from Workforce Solutions for the Heart of Texas. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. Workforce Solutions for the Heart of Texas is one of 28 local workforce development boards in Texas that partners with the Texas Workforce Commission (TWC) to provide workforce solutions to employers and job seekers. The Heart of Texas region includes Bosque, Falls, Freestone, Hill, Limestone and McLennan counties. QUICK LINKS About Us WorkinTexas Child Care Map Find a Center CONTACT US 1-866-982-9226 questions@hotworkforce.com JOIN THE NEWSLETTER First Name * Last Name * Email (required) * Select list(s) to subscribe to A Business An Individual Example: Yes, I would like to receive emails from Workforce Solutions for the Heart of Texas. (You can unsubscribe anytime) Constant Contact Use. Please leave this field blank. Copyright © 2020 Heart of Texas Workforce Development Board, Inc. The Heart of Texas Workforce Development Board, Inc. is an equal opportunity employer/program and auxiliary aids and services are available upon request to individuals with disabilities. TTY/TDD via RELAY Texas service at 711 or (TDD) 1-800-735-2989 / 1-800-735-2988 (voice). Copyright © 2019 Heart of Texas Workforce Development Board, Inc. The Heart of Texas Workforce Development Board, Inc. is an equal opportunity employer/program and auxiliary aids and services are available upon request to individuals with disabilities. TTY/TDD via RELAY Texas service at 711 or (TDD) 1-800-735-2989 / 1-800-735-2988 (voice). Offices & Centers Closed | Workshops & Orientations Canceled FEBRUARY 18, 2021 Our workforce centers and administrative offices are closed Thursday, Feb. 18, due to inclement weather. All events, including virtual workshops, orientations, tax preparation and other in-person appointments, have been canceled. If you have questions, please email us at questions@hotworkforce.com , and our staff will respond as soon as possible."
    },
    {
      "url": "https://hotworks.org/applications/",
      "text": "Hotworks - Artist Applications Skip to content No results Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Username or Email Address Password Remember Me Forgot Password? Log In Username or Email Address Get New Password ← Back to login Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Search Login Shopping cart $ 0.00 0 Menu Application & Payment Links Application & Payment Links Application & Payment Links Light Dome tents for rent $260; Pro-Panels $160 w/rental of Light Dome. Pay for your booth\n\nonline at Hot Works Tents for Art Shows – includes set up and tear down pay for rentals Naples Fine Art Shows Boca Raton Fine Art Shows​ West Palm Beach Fine Art Shows​ Tampa Fine Art Show​ Orchard Lake Fine Art Show​ Sarasota Fine Art Show​ Naples Fine Art Shows Zapp  here March 14 & 15, 2025 October 25 & 26, 2025 PAY HERE Boca Raton Fine Art Shows Zapp  here November 1 & 2, 2025 December 13 & 14, 2025 January 24 & 25, 2026 Pay here November 1 & 2, 2025 December 13 & 14, 2025 January 24 & 25, 2026 PAY HERE West Palm Beach Fine Art Shows Zapp  here November 29 & 30, 2025 February 7 & 8, 2026 PAY HERE Orchard Lake Fine Art Show Zapp  here July 26 & 27, 2025 PAY HERE Sarasota Fine Art Shows Zapp  here January 31 & February 1, 2026 March 21 & 22, 2026 PAY HERE Sarasota Fine Art Show Zapp  here April 11 & 12, 2026 PAY HERE Tampa Fine Art Show Zapp  here PAY HERE Fort Myers Fine Art Show October 18 & 19, 2025 APPLY HERE PAY HERE Boca Raton Fine Art Show November 1 & 2, 2025 APPLY HERE PAY HERE Boca Raton Fine Art Show December 13 & 14, 2025 APPLY HERE PAY HERE Fort Myers Fine Art Show January  3 & 4, 2026 APPLY HERE PAY HERE Boca Raton Fine Art Show January 24 & 25, 2026 APPLY HERE PAY HERE Sarasota Fine Art Show March 28 & 29 2026 APPLY HERE PAY HERE Naples Fine Art Show Spring, 2026 APPLY HERE PAY HERE Boca Raton Fine Art Show November 2 & 3, 2024 APPLY HERE PAY HERE Light Dome tents for rent $260; Pro-Panels $160 w/rental of Light Dome. Pay for your booth\n\nonline at Hot Works Tents for Art Shows – includes set up and tear down pay for rentals Naples Fine Art Shows Boca Raton Fine Art Shows​ West Palm Beach Fine Art Shows​ Tampa Fine Art Show​ Orchard Lake Fine Art Show​ Sarasota Fine Art Show​ Hot Works Fine Art and Craft Shows have earned recognition 18 times from national magazines and artist organizations as one of the “Top 100 Art Shows in America.” Artists who have worked with us often describe us as “family.” We understand how valuable your time is, so we’ve streamlined the application process to help you focus on creating art. Returning artists who have participated in five shows within the last three years can skip the jury process with just a phone call! For our Florida shows, we offer a convenient “Fly and Show” display rental option, perfect for out-of-state artists or those who prefer not to handle the setup of Light Dome tents and Pro-Panels—we’ll take care of it for you! The Hot Works Difference From the moment you arrive at a Hot Works show, the difference is clear. Our team welcomes you with a smile, chilled water, snacks, and the support needed for a successful event. We genuinely care, and our mission is to ensure your experience is both enjoyable and financially rewarding. We go above and beyond to make everything as smooth as possible! Our show locations are carefully chosen for their proximity to affluent neighborhoods, luxury homes, and five-star resorts in Florida. After two decades, our flagship event, the Orchard Lake Fine Art Show in West Bloomfield, Michigan, attracts a second generation of art patrons. At many of our shows, you’ll have the convenience of parking directly behind your booth, allowing easy access to your work throughout the weekend. For those flying in, we offer pre-order rental options for Light Dome tents, Pro-Panel walls, and jewelry cases to simplify your setup. Artist Amenities Friday move-in for a stress-free setup. Complimentary snacks and water throughout the show. Booth sitters available to give you a break when needed. Convenient parking directly behind or near your booth. Full tent and wall booth setup packages available. Pre-show marketing. support to help drive traffic to your booth. Competitive booth fees. Returning exhibitors (with 5 shows in the past 3 years) can bypass the jury process. 35+ years of event production and media expertise. Strict policies in place to prevent buy/sell/import vendors. Overnight security for your peace of mind. A professional event crew dedicated to supporting you. Advertising & Marketing When the show opens you’ll discover the benefits of a high-level marketing and advertising campaign. Every show draws the most affluent art patrons in the region. From TV commercials, radio, newspaper articles, road signage, banners, digital and social media advertising, and email blasts to our huge list of quality art patrons The Search for A Great Show How do you know a show is good for you? The answer is in the number of returning artists. Twenty years after our first show launched… we’ve learned how to promote and produce shows that keep artists returning year after year. Our History Over the past two decades, we’ve grown a large list of loyal patrons and developed successful marketing strategies and partnerships that attract a wide range of affluent, buying patrons to our shows. It’s the reason why so many of our exhibiting artists return year after year to Hot Works shows. Quality & Authenticity Artists rely on us for keeping out the buy/sell and import fraud. Our juried selection process is supplemented by interviews, references, and raw materials supplier information to assure our patrons and artists of quality. The quality and authenticity of the art presented are important to us. When there’s any question, we deal with it! National Honors & Awards Hot Works Fine Art & Craft Shows are consistently ranked as some of the best-juried art shows across the United States. Top 100 Art Shows in America – Orchard Lake Fine Art Show (Michigan) Top 100 Art Shows in America – Boca Raton Fine Art Show (Florida) Top 100 Art Shows in America – Estero Fine Art Show (Florida) Top 100 Art Fairs in America – Art Fair Sourcebook Community Outreach Our nationally acclaimed events bring people together to inspire local creativity, create a bridge of diversity and grow cultural awareness and tourism. Each show features a youth art competition to expose and educate students on how they can sell their art and earn a living from making it. Our Partners, Press & Vip Friends With a career background in media buying, we leverage every penny of your booth fee to create the strongest visibility in every community. Our media buy always includes television commercials, social media, banners, and local partner distribution of posters, postcards, and real estate signs surrounding the area. Results Cities embracing smart growth strategies recognize that art and cultural events create prosperity and build a sustainable local economy. Our fine art shows draw collectors and affluent visitors regionally and nationally. Beyond the art purchased at the fair, our out-of-town patrons spend more than $623 daily in the local economy. What Artists Say… If you want to know the quality of a show, just ask the professional artists who rely on us to provide them with a sustainable way to make a living. Here’s what one artist said… “Sarasota Fine Art Show was one of my best Florida shows last season – great turnout.” David Campbell,  Venice FL Sculpture, “Orchard Lake Fine Art Show is a wonderful show – we will do it anytime.” Julio Garcia, Orange Park, FL Painting “Thank you, Patty!! I love doing your shows! Everyone is so talented and nice. All of your artist work so well as a team.” Judy Crowell Painting Contact Florida Satellite Office PO Box 1425, Sarasota, FL 34230 Phone: +1 941.755.3088 Michigan Office PO Box 79, Milford, MI 48381-0079 Phone: +1 248.762.2462 Email: patty@hotworks.org Quick Links Home For Artists For Kids Gallery About News Donate Contact Past Events Upcoming Art Shows Boca Raton Fine Art Shows - Sanborn Square Park, downtown Boca Raton, FL February 8 & 9, 2025 November 1 & 2, 202 5 Sarasota Fine Art Shows - Phillippi Estate Park, Sarasota, FL March 21 & 22 202 6 Orchard Lake Fine Art Show – heart of West Bloomfield, MI July 26 & 27, 2025 Copyright © 2025 - Hot Works, LLC. All Rights Reserved"
    },
    {
      "url": "https://hotworks.org/events-hot-works/the-boca-raton-fine-art-show-january-2728-2024/",
      "text": "The Boca Raton Fine Art Show, January 27 & 28 2024 Skip to content No results Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Username or Email Address Password Remember Me Forgot Password? Log In Username or Email Address Get New Password ← Back to login Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Search Login Shopping cart $ 0.00 0 Menu Boca Raton Fine Art Show, January 27 & 28, 2024 Dates Saturday, January 27, 2024  |  10am – 5pm Sunday, January 28, 2024  |  10am – 5pm Venue Sanborn Square Park, 72 N Federal Hwy, Boca Raton, FL 33432 Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org ARTISTS APPLY HERE ARTISTS PAY HERE Art of the Show Participating Artists Show Map About the Show Map_BRFAS_Jan_27_28_24_as_of_01-19-24 Hot Works fine art and craft shows are voted as one of America’s Top 100 Art Shows in America – 18x by Sunshine Artist Magazine and Art Fair Source Book The Sarasota Fine Art Show returns to Phillippi Estate Park with high visibility off of US-41/Tamiami Trail, just south of Siesta Key and downtown Sarasota Executive Producer Patty Narozny has 35+ years of media and event experience Featuring high quality, juried fine art and craft show with top-notch artists selling their original and personally handmade art All discipline for sale including paintings, sculpture, glass, clay, photography, wood art, fiber, mixed media, jewelry and more Criteria for jurying is based on originality, technique, execution and booth appearance There is something for everyone, in all price ranges Institute for the Arts & Education is the 501c3 non-profit organization which supports visual arts, cultural diversity, community enrichment and fostering art education among youth Our philosophy is to bring patrons specifically to the art show with the means to purchase art – they are culturally savvy with money to spend Both onsite marketing and turnkey community enrichment opportunities are available We are grateful for the continued relationships with local media – WEDU PBS, WUSF 89.7 Public Radio, Suncoast News Network, Jewish news, Longboat Key News, Sarasota City News, and Landings Eagle Large banners, event postcards and posters are hung and distributed within the community to further target the art-buying patron which helps to make the show a success Great food and live entertainment While at the show be sure to visit the Youth Art Competition – this unique and one-of-a-kind program invites all students in grades K-8 or 6-12 (depending on the show) to enter his/her original art that is publicly displayed within the art show duration of the event; Sunday at 3pm there is a presentation of Youth Art Awards with cash prizes – students are exposed to the rules and entrepreneurship opportunity of doing art shows for a living Tents: Lightdomes for Rent https://tents4events.us/ $230+tax for Light Dome, Pro-Panels are $140+tax. To reserve, please call Joe with Tents 4 Events at 954-675-7634 or email joe@tents4events.us . Includes set up and tear down There is free admission; optional donations are accepted at Donate Now to support arts and education $5 parking that is close and very convenient; good for in and out access; supports arts and education Our #1 goal is to make Hot Works Sarasota Fine Art Show a pleasant and profitable experience for all of our stakeholders, at the same time bringing a wonderful event to the community. Questions? Contact Patty at 941-755-3088 or patty@hotworks.org . Previous Show Our Sponsors Please Support our Sponsors Contributions and in-kind support services play a critical role in every Hot Works event. We thank our local officials, media partners, corporate sponsors and friends who make our community outreach programs possible. Thank you! SPONSORSHIP OPPORTUNITIES Upcoming Shows Dates Saturday, July 26, 2024  |  10am – 6pm Sunday, July 27, 2024  |  10am – 5pm Venue West Bloomfield, MI Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org SUBSCRIBE TO OUR NEWSLETTER! Name First Last Email (Required) Are you an Artist a Potential Sponsor a Food Vendor a Patron Other Specify: How did you hear about us? (Required) Referral TV Radio Print Google Facebook Instagram Other Who Please Specify Name This field is for validation purposes and should be left unchanged. Δ Contact Florida Satellite Office PO Box 1425, Sarasota, FL 34230 Phone: +1 941.755.3088 Michigan Office PO Box 79, Milford, MI 48381-0079 Phone: +1 248.762.2462 Email: patty@hotworks.org Quick Links Home For Artists For Kids Gallery About News Donate Contact Past Events Upcoming Art Shows Boca Raton Fine Art Shows - Sanborn Square Park, downtown Boca Raton, FL February 8 & 9, 2025 November 1 & 2, 202 5 Sarasota Fine Art Shows - Phillippi Estate Park, Sarasota, FL March 21 & 22 202 6 Orchard Lake Fine Art Show – heart of West Bloomfield, MI July 26 & 27, 2025 Copyright © 2025 - Hot Works, LLC. All Rights Reserved"
    },
    {
      "url": "https://primeairfl.com/contact/",
      "text": "Contact - Prime Air Florida Prime Air Florida Open 24 hours Info@primeairfl.com Contractor license number cac1823548 Facebook-f Instagram Menu Home Our Services AC Repair AC Installation AC Maintenance AC Replacement Mini Split Installation Heat Pump Repair Heat Pump Installtion Heat Pump Replacement Heat Pump Maintenance Filter Program About Service Area Contact Menu Home Our Services AC Repair AC Installation AC Maintenance AC Replacement Mini Split Installation Heat Pump Repair Heat Pump Installtion Heat Pump Replacement Heat Pump Maintenance Filter Program About Service Area Contact (561) 855-0659 Get a Quote Facebook-f Instagram Menu Home Our Services AC Repair AC Installation AC Maintenance AC Replacement Mini Split Installation Heat Pump Repair Heat Pump Installtion Heat Pump Replacement Heat Pump Maintenance Filter Program About Service Area Contact Contact Home Contact GET IN TOUCH Connect with Prime Air FL We’re just a call or message away – reach out to our team of experts today for all your heating, air conditioning, and electrical needs. Email Address Info@primeairfl.com Office Location 150 East Palmetto Park Road STe 800, Boca Raton FL 33432 Send Massage Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Full Name * First Last Email * Comment or Message Opt-In I agree to terms & conditions provided by the company. By providing my phone number, I agree to receive text messages from the business. Submit Phone (561) 855-0659 Email Info@primeairfl.com Guaranteed Satisfaction Facebook-f Pinterest Linkedin Youtube Instagram X-twitter Menu Home About Service Contact Services New Construction/Engineering Ductwork Air Conditioning Repair AC Installation Residential & Commercial HVAC Air Purification Smart Thermostats Maintenance Agreements Contact Info 150 East Palmetto Park Road STe 800, Boca Raton FL 33432 (561) 855-0659 Open 24 hours Info@primeairfl.com © 2025 Prime Air FL. Design by Web Experts Marketing"
    },
    {
      "url": "https://suntaxconsulting.com/contact-us/",
      "text": "Contact us - SunTax Consulting About Services Resources Blog Contact us English Russian EN EN RU EN EN RU About Services Resources Blog Contact us English Russian // Let’s keep in touch! You are always welcome to reach us by any means you like! Call us directly, send an email or just complete the contact form. Upload documents to our secure portal Drop off your documents at our office for convenient pick-up within 24-48 hours  Our Address: 2200 NW Corporate Blvd. Suite 205 Boca Raton, FL 33431  Our Mailbox: info@suntaxconsulting.com  Our Office Phone: (786) 438-5510  Our Fax: (561) 250-8633  Our working hours: Mon – Fri: 9:00 am – 5:00 pm Sat: by appointment Ready to Get Started? Your Name Your Email Phone Number Message 7 + 6 = Send message About Services Resources Blog Contact Us Privacy Policy Terms of Use Sitemap Follow Follow Follow Follow © 2022 – SunTax Consulting, All Rights Reserved. !"
    },
    {
      "url": "https://hotworks.org/past-shows/the-boca-raton-fine-art-show-november-2-3-2024/",
      "text": "Boca Raton Fine Art Show, November 2 & 3, 2024 Skip to content No results Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Username or Email Address Password Remember Me Forgot Password? Log In Username or Email Address Get New Password ← Back to login Upcoming Art Shows For Artists For Kids Gallery Past Art Shows About News Donate Search Login Shopping cart $ 0.00 0 Menu Boca Raton Fine Art Show, November 2 & 3, 2024 Dates Saturday, November 2, 2024  |  10am – 5pm Sunday, November 3, 2024  |  10am – 5pm Venue Sanborn Square Park, 72 N Federal Hwy, Boca Raton,\nFL 33432 Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org Youth Art Award Winners OF THE Boca Raton 2024 SHOW ARTISTS PAY HERE Art of the Show Ariel Celestino Hernandez, Painting Erin Ashley, Painting John Denis, Sculpture Krista Flood, Glass Luis Amador, Sculpture Tali Almog, Painting Ktano John Buritica and Angelica Guzman, Mixed Media Mari Lydic, Fiber Mark Kosarin, Photography Marlene Kurland, Painting Amanda Sajous,Mixed Media Mariela Renatta Renatti, Mixed Media Nikolette Vardi, Mixed Media Steve Kummer, Painting Suhame Miralles Cantero, Painting Alanna Murphy, Painting Birttany Murphy, Painting Herb Brown, Jewelry Kelsi Murphy, Painting Marvin ‘Murf’ Murphy, Painting Paul Braun, Sculpture Tyler Murphy, Painting Andy Ballentine, Painting Julio Garcia, Painting Robert Trisko and Ian Lieberman, Jewelry Shani Solomon, Fiber Participating Artists Show Map About the Show Hot Works fine art and craft shows are voted as one of America’s Top 100 Art Shows in America – 18x by Sunshine Artist Magazine and Art Fair Source Book The Sarasota Fine Art Show returns to Phillippi Estate Park with high visibility off of US-41/Tamiami Trail, just south of Siesta Key and downtown Sarasota Executive Producer Patty Narozny has 35+ years of media and event experience Featuring high quality, juried fine art and craft show with top-notch artists selling their original and personally handmade art All discipline for sale including paintings, sculpture, glass, clay, photography, wood art, fiber, mixed media, jewelry and more Criteria for jurying is based on originality, technique, execution and booth appearance There is something for everyone, in all price ranges Institute for the Arts & Education is the 501c3 non-profit organization which supports visual arts, cultural diversity, community enrichment and fostering art education among youth Our philosophy is to bring patrons specifically to the art show with the means to purchase art – they are culturally savvy with money to spend Both onsite marketing and turnkey community enrichment opportunities are available We are grateful for the continued relationships with local media – WEDU PBS, WUSF 89.7 Public Radio, Suncoast News Network, Jewish news, Longboat Key News, Sarasota City News, and Landings Eagle Large banners, event postcards and posters are hung and distributed within the community to further target the art-buying patron which helps to make the show a success Great food and live entertainment While at the show be sure to visit the Youth Art Competition – this unique and one-of-a-kind program invites all students in grades K-8 or 6-12 (depending on the show) to enter his/her original art that is publicly displayed within the art show duration of the event; Sunday at 3pm there is a presentation of Youth Art Awards with cash prizes – students are exposed to the rules and entrepreneurship opportunity of doing art shows for a living Tents: Lightdomes for Rent https://tents4events.us/ $230+tax for Light Dome, Pro-Panels are $140+tax. To reserve, please call Joe with Tents 4 Events at 954-675-7634 or email joe@tents4events.us . Includes set up and tear down There is free admission; optional donations are accepted at Donate Now to support arts and education $5 parking that is close and very convenient; good for in and out access; supports arts and education Our #1 goal is to make Hot Works Sarasota Fine Art Show a pleasant and profitable experience for all of our stakeholders, at the same time bringing a wonderful event to the community. Questions? Contact Patty at 941-755-3088 or patty@hotworks.org . Participating Artists Show Map About the Show Hot Works fine art and craft shows are voted as one of America’s Top 100 Art Shows in America – 18x by Sunshine Artist Magazine and Art Fair Source Book The Sarasota Fine Art Show returns to Phillippi Estate Park with high visibility off of US-41/Tamiami Trail, just south of Siesta Key and downtown Sarasota Executive Producer Patty Narozny has 35+ years of media and event experience Featuring high quality, juried fine art and craft show with top-notch artists selling their original and personally handmade art All discipline for sale including paintings, sculpture, glass, clay, photography, wood art, fiber, mixed media, jewelry and more Criteria for jurying is based on originality, technique, execution and booth appearance There is something for everyone, in all price ranges Institute for the Arts & Education is the 501c3 non-profit organization which supports visual arts, cultural diversity, community enrichment and fostering art education among youth Our philosophy is to bring patrons specifically to the art show with the means to purchase art – they are culturally savvy with money to spend Both onsite marketing and turnkey community enrichment opportunities are available We are grateful for the continued relationships with local media – WEDU PBS, WUSF 89.7 Public Radio, Suncoast News Network, Jewish news, Longboat Key News, Sarasota City News, and Landings Eagle Large banners, event postcards and posters are hung and distributed within the community to further target the art-buying patron which helps to make the show a success Great food and live entertainment While at the show be sure to visit the Youth Art Competition – this unique and one-of-a-kind program invites all students in grades K-8 or 6-12 (depending on the show) to enter his/her original art that is publicly displayed within the art show duration of the event; Sunday at 3pm there is a presentation of Youth Art Awards with cash prizes – students are exposed to the rules and entrepreneurship opportunity of doing art shows for a living Tents: Lightdomes for Rent https://tents4events.us/ $230+tax for Light Dome, Pro-Panels are $140+tax. To reserve, please call Joe with Tents 4 Events at 954-675-7634 or email joe@tents4events.us . Includes set up and tear down There is free admission; optional donations are accepted at Donate Now to support arts and education $5 parking that is close and very convenient; good for in and out access; supports arts and education Our #1 goal is to make Hot Works Sarasota Fine Art Show a pleasant and profitable experience for all of our stakeholders, at the same time bringing a wonderful event to the community. Questions? Contact Patty at 941-755-3088 or patty@hotworks.org . Previous Show Our Sponsors Please Support our Sponsors Contributions and in-kind support services play a critical role in every Hot Works event. We thank our local officials, media partners, corporate sponsors and friends who make our community outreach programs possible. Thank you! SPONSORSHIP OPPORTUNITIES Upcoming Shows Dates Saturday, November 16, 2024 | 10am–5pm Sunday, November 17, 2024 | 10am–5pm Venue Phillippi Estate Park/Mansion/Creek 5500 S. Tamiami Trail Sarasota, FL 34231 Organizer Hot Works Fine Art Shows Phone: (941) 755-3088 Email: info@hotworks.org SUBSCRIBE TO OUR NEWSLETTER! Name First Last Email (Required) Are you an Artist a Potential Sponsor a Food Vendor a Patron Other Specify: How did you hear about us? (Required) Referral TV Radio Print Google Facebook Instagram Other Who Please Specify Email This field is for validation purposes and should be left unchanged. Δ Contact Florida Satellite Office PO Box 1425, Sarasota, FL 34230 Phone: +1 941.755.3088 Michigan Office PO Box 79, Milford, MI 48381-0079 Phone: +1 248.762.2462 Email: patty@hotworks.org Quick Links Home For Artists For Kids Gallery About News Donate Contact Past Events Upcoming Art Shows Boca Raton Fine Art Shows - Sanborn Square Park, downtown Boca Raton, FL February 8 & 9, 2025 November 1 & 2, 202 5 Sarasota Fine Art Shows - Phillippi Estate Park, Sarasota, FL March 21 & 22 202 6 Orchard Lake Fine Art Show – heart of West Bloomfield, MI July 26 & 27, 2025 Copyright © 2025 - Hot Works, LLC. All Rights Reserved"
    }
  ]
}