{
  "fuentes": [
    {
      "url": "https://www.howlatthemoon.com/orlando-sales-and-events-manager/",
      "email": "orlandosales@howlatthemoon.com"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale/club-info/",
      "email": "corydon.himelberger@howlatthemoon.com"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale/club-info/",
      "email": "ftlauderdale@howlatthemoon.com"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale/club-info/",
      "email": "thayer.vanburen@howlatthemoon.com"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale-press-release/",
      "email": "ftlauderdale@howlatthemoon.com"
    },
    {
      "url": "https://www.partyslate.com/venues/howl-at-the-moon-fort-lauderdale",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://lmgfl.com/howl-at-the-moon-returns-to-fort-lauderdale/",
      "email": "sfbw-logo-2023-100x50-v6-@2x.png"
    },
    {
      "url": "https://lmgfl.com/howl-at-the-moon-returns-to-fort-lauderdale/",
      "email": "info@lmgfl.com"
    },
    {
      "url": "https://sfbwmag.com/howl-at-the-moon-makes-return-to-fort-lauderdale/",
      "email": "sfbw-logo-2023-100x50-v6-@2x.png"
    },
    {
      "url": "https://sfbwmag.com/howl-at-the-moon-makes-return-to-fort-lauderdale/",
      "email": "info@sfbwmag.com"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale-media-room/",
      "email": "ftlauderdale@howlatthemoon.com"
    }
  ],
  "mails": [
    "contact@partyslate.com",
    "corydon.himelberger@howlatthemoon.com",
    "ftlauderdale@howlatthemoon.com",
    "info@lmgfl.com",
    "info@sfbwmag.com",
    "orlandosales@howlatthemoon.com",
    "sfbw-logo-2023-100x50-v6-@2x.png",
    "thayer.vanburen@howlatthemoon.com"
  ],
  "nombre_sitio": "howlatthemoon.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.howlatthemoon.com/orlando-sales-and-events-manager/",
      "text": "Orlando Sales and Events Manager | Party Venue | Events Venue | Nightlife | Live Music | Howl at the Moon Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY CONNECT WITH US Howl at the Moon Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY Orlando Sales and Events Manager Book Your Event PARTIES & EVENTS Corporate Events Holiday Parties Birthday Parties Table Reservations Bachelorette Parties Bachelor Parties PARTIES & EVENTS Corporate Events Holiday Parties Birthday Parties Table Reservations Bachelorette Parties Bachelor Parties “Just work hard and be nice to people.” -Michael Franti “Work Hard & Be Nice” Christin Bartlett Cimini, Orlando Sales and Events Manager Email: orlandosales@howlatthemoon.com Hometown: Royal Palm Beach, FL First employed at Howl at the Moon Orlando in 2006 Q. What do you love most about working at Howl at the Moon? A. I love live music and I enjoy being able to listen to our band every event I host. Q. What does life outside of Howl at the Moon look like? A. I love concerts, traveling and morning snuggles with my dogs. Q. Share a Fun Fact about yourself! A. From a young age, I knew I wanted to work in the hospitality industry. My first love was working in country clubs. Working at the Breaker’s in Palm Beach was when I really understood my calling. I attended and graduated from University of Central Florida with a Business Degree specializing in Hospitality Management. While in college, I went to Howl at the Moon every weekend when it was located downtown. It was always our first stop and last stop of the night. When a position opened up after college once Howl at the Moon relocated to International Drive, I knew that I had to take it. I have been at Howl ever since and truly love the close family that it has become. What is your go-to song request at Howl at the Moon? A. I have many songs that are “my favorite” to request while I am at Howl at the Moon. “Jack & Diane”, “Son of a Preacher Man”, “Meet Virginia” and “The Weight” have to be the ones that come to me first. I always like to throw in some old school rap though, just to see it played on the piano. It really brightens my spirits. Q. What is your favorite animal? A. My favorite animal is definitely a dog. I have 4 rescued dogs now and I realized that is my limit. Thank goodness I have a huge backyard for them to play in. Paying for them to go to the Canine Country Club while on vacation is when I realized that 4 was my max. I am told that I am not allowed to visit shelters at this point in my life. Q. What was your favorite vacation? A. My favorite vacation has to include a tropical location. It is funny when people from up north ask where does someone from Florida go for vacation and I answer “anywhere tropical”, I do get strange looks. I love Hawaii, the Caribbean, the French Riviera, Spain and Italy as my favorites! Even when we traveled to Europe, we made sure that we included the Mediterranean, so that I could enjoy the coastline. It did help that we were on a cruise ship for two of our European vacations. Q. Who is your favorite band? A. I love going to music celebrations. We have gone on the Rock Boat Cruise, Sail Across the Sun Cruise and Zac Brown Celebration in Mexico to name a few. It is so nice to enjoy a tropical vacation with your favorite music bands! My favorite bands from these have been Barenaked Ladies, Sister Hazel, Train, Zac Brown and Michael Franti & Spearhead. Q. What is your favorite hobby? A. My favorite hobby is scuba diving! I love the feeling of being so far down in the ocean and seeing creatures and fish that I have never seen before. My best scuba diving experiences has been in Oahu and Kona, both in Hawaii. With over 60 dives, I still haven’t seen any sharks yet, but I have seen many eels, octopus, sea turtles, dolphins, lobster and plenty of fish. Sharks are on my list to see, but at a distance! Orlando Live Music Bar Howl at the Moon can host birthday parties , bachelor parties , bachelorette parties , holiday parties , corporate events . Book your party today. We can also host private parties , meetings , cocktail parties , networking events , fundraisers , team building events , award ceremonies , graduation parties and more. Join Our Mailing List You Could Win A Party Sign Up First Name * Last Name * Email * Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Birth Month * - Birth Month - January February March April May June July August September October November December Sign up to win a party? Sign me up to win a party! Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap choose your howl location to view facebook page: Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea choose your howl location: Please fill out the form below and our Sales and Events Manager will contact you shortly. For same day reservations - Please call your Howl at the Moon for pricing and availability. View our locations Name * First Last Email * Phone Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Number of Guests Date * MM slash DD slash YYYY Arrival Time (approx) Flexible Don't know yet 5:00PM 6:00PM 7:00PM 8:00PM 9:00PM 10:00PM 11:00PM 12:00AM 1:00AM 2:00AM How did you hear about us? Do you have any additional info or requests? Birth Month January February March April May June July August September October November December Sign up to join our mailing list Yes No Acknowledgement * I understand that this does not confirm a table reservation and that I will be contacted by a Howl at the Moon representative regarding pricing and availability. CAPTCHA Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Comments This field is for validation purposes and should be left unchanged. X"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale/club-info/",
      "text": "Fort Lauderdale FAQ Page Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY CONNECT WITH US Howl at the Moon Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY Club Info MENU Back To Fort Lauderdale Bachelorette Parties Birthday Parties Book Online Club Info Corporate Events Drink Menu Food Menu Holiday Parties Reserve A Table Back To Fort Lauderdale Bachelorette Parties Birthday Parties Book Online Club Info Corporate Events Drink Menu Food Menu Holiday Parties Reserve A Table General Manager Corydon Himelberger Email Me Sales and Events Manager Thayer Van Buren Email Me EMPLOYMENT We are always looking for top talent at Howl at the Moon. If you are energetic, customer focused, and hard working- we want to hear from you! View Available Positions FREQUENTLY ASKED QUESTIONS When will Howl at the Moon Fort Lauderdale be open? We are now open in Las Olas! What are the hours? Sunday: 6PM-12AM Monday: Open For Events Tuesday: Open For Events Wednesday: 6PM-1AM Thursday: 6PM-1AM Friday: 5PM-2AM Saturday: 5PM-2AM What is the address? 270 SE 6th Avenue Fort Lauderdale, FL 33301. What is Howl at the Moon Fort Lauderdale's contact information? Phone number: 754.356.4695 Email address: ftlauderdale@howlatthemoon.com . Do you have an age restriction for entry? We are 21-and-over every hour, every day, no exceptions. All guests must have a valid ID for entry. What time does the show start? Do I have to reserve a table? Sunday: 7 PM Wednesday: 7 PM Thursday: 7 PM Friday: 6 PM Saturday: 6 PM You can come and go as you please during the show and you do not need reservations to come to Howl at the Moon, however, tables do go quickly on the weekends so we suggest making a reservation if you would like one. Is Howl at the Moon Fort Lauderdale on social media? Yes. Check us out on Facebook , Instagram and Twitter . Which kind of parties and events can Howl at the Moon Fort Lauderdale host? Howl at the Moon Fort Lauderdale can host birthday parties , bachelor parties , bachelorette parties , holiday parties , corporate events . Book your party today. We can also host private parties , meetings , cocktail parties , networking events , fundraisers , team building activities , award ceremonies , graduation parties and more. Is there parking available? Howl at the Moon Fort Lauderdale is a proud partner of SpotHero, a mobile app that helps you find affordable parking near our venue! Reserve your spot ahead of time and use their provided QR code to enter and exit the lot. Visit this link to ensure you have a space to park when you arrive. Can we get to Howl at the Moon Fort Lauderdale by water? Yes. Howl at the Moon Fort Lauderdale is Water Taxi, Stop #1. Join Our Mailing List You Could Win A Party Sign Up First Name * Last Name * Email * Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Birth Month * - Birth Month - January February March April May June July August September October November December Sign up to win a party? Sign me up to win a party! Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap choose your howl location to view facebook page: Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea choose your howl location: Please fill out the form below and our Sales and Events Manager will contact you shortly. For same day reservations - Please call your Howl at the Moon for pricing and availability. View our locations Name * First Last Email * Phone Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Number of Guests Date * MM slash DD slash YYYY Arrival Time (approx) Flexible Don't know yet 5:00PM 6:00PM 7:00PM 8:00PM 9:00PM 10:00PM 11:00PM 12:00AM 1:00AM 2:00AM How did you hear about us? Do you have any additional info or requests? Birth Month January February March April May June July August September October November December Sign up to join our mailing list Yes No Acknowledgement * I understand that this does not confirm a table reservation and that I will be contacted by a Howl at the Moon representative regarding pricing and availability. CAPTCHA Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Email This field is for validation purposes and should be left unchanged. X"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale-press-release/",
      "text": "Fort Lauderdale Press Release | Bars | Nightlife | Clubs | Bars | Party Venues | Event Space | Piano Bar | Howl at the Moon Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY CONNECT WITH US Howl at the Moon Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY Fort Lauderdale Press Release Grand Opening Information HOWL AT THE MOON IS BRINGING NONSTOP LIVE MUSIC TO FORT LAUDERDALE OCTOBER 2024 The live music bar is ready to bring endless entertainment to the Las Olas neighborhood, beginning with a Grand Opening Party to be announced soon. Las Olas is about to howl louder than ever! Howl at the Moon is proud to announce the grand opening of our brand-new Fort Lauderdale venue, located at 270 SE 6th Avenue. We are kicking things off with a Grand Opening celebration to be announced soon. This party will feature drink specials on our mixed drinks, beers, 86oz. buckets and of course, our unbeatable live music show all night long. Howl at the Moon’s 5,000-square-foot venue is about to rock Fort Lauderdale harder than ever! ABOUT HOWL AT THE MOON Howl at the Moon is a live music destination for travelers and locals alike, bringing a unique nightlife experience of singing and dancing! Howl at the Moon has been a leading nightlife destination for over 30 years. With 13 locations nationwide and residencies aboard 3 cruise line ships, Howl at the Moon is always in pursuit of the perfect show and creating an unforgettable night out. With a set list created by today’s hits, party classics and song requests from the audience, Howl at the Moon helps people sing louder, dance happier and so much more. Their versatile and talented musicians rotate instruments and take turns singing throughout the night creating a non-stop, high-energy show! Howl at the Moon is located in most major cities in America involving musicians who travel worldwide. Our in-house musicians take the stage from the moment our doors open until last call. There are no breaks and no intermissions; therefore guests are welcome to come and go as they please. Our musicians rotate instruments and take turns singing throughout the night which allows music to continue nonstop. Howl at the Moon features specialty cocktails, customizable party space, a lively engaging staff and the promise of an experience unlike any other. Contact Information Website: https://www.howlatthemoon.com/fort-lauderdale/ Phone number: 754-356-4695 Email address: ftlauderdale@howlatthemoon.com Address: 270 SE 6th Avenue Fort Lauderdale, FL 33301 Learn More https://www.howlatthemoon.com/fort-lauderdale/ https://www.instagram.com/howlatthemoon https://www.instagram.com/howlftl https://www.tiktok.com/@_howlatthemoon? https://www.facebook.com/howlftl https://x.com/_howlatthemoon Join Our Mailing List You Could Win A Party Sign Up First Name * Last Name * Email * Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Birth Month * - Birth Month - January February March April May June July August September October November December Sign up to win a party? Sign me up to win a party! Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap choose your howl location to view facebook page: Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea choose your howl location: Please fill out the form below and our Sales and Events Manager will contact you shortly. For same day reservations - Please call your Howl at the Moon for pricing and availability. View our locations Name * First Last Email * Phone Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Number of Guests Date * MM slash DD slash YYYY Arrival Time (approx) Flexible Don't know yet 5:00PM 6:00PM 7:00PM 8:00PM 9:00PM 10:00PM 11:00PM 12:00AM 1:00AM 2:00AM How did you hear about us? Do you have any additional info or requests? Birth Month January February March April May June July August September October November December Sign up to join our mailing list Yes No Acknowledgement * I understand that this does not confirm a table reservation and that I will be contacted by a Howl at the Moon representative regarding pricing and availability. CAPTCHA Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Email This field is for validation purposes and should be left unchanged. X"
    },
    {
      "url": "https://www.partyslate.com/venues/howl-at-the-moon-fort-lauderdale",
      "text": "Howl at the Moon Fort Lauderdale | Fort Lauderdale Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Howl at the Moon Fort Lauderdale Find Venues / Florida / Fort Lauderdale / Howl at the Moon Fort Lauderdale Howl at the Moon Fort Lauderdale 270 SE 6th Ave, Fort Lauderdale, FL 33301, USA Max Standing 400 Request info Favorite Average Response Time 1-2 hrs Overview Gallery 1 About Howl at the Moon Fort Lauderdale Howl at the Moon offers a one-of-a-kind nightlife experience filled with singing and dancing! Experience our upbeat piano bar, where talented musicians rotate instruments and take turns on vocals. Sing along to a high-energy setlist filled with today’s top hits, timeless party classics, and crowd-requested favorites.\n\nWhether you're looking for an exciting night out or the perfect event space for a celebration, our venue guarantees a night you'll never forget! Pricing Packages Howl at the Moon Fort Lauderdale hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Map 270 SE 6th Ave, Fort Lauderdale, FL 33301, USA Follow Us Visit Website Call Average Response Time 1-2 hrs Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://lmgfl.com/howl-at-the-moon-returns-to-fort-lauderdale/",
      "text": "Howl at the Moon Returns to Fort Lauderdale | Lifestyle Media Group SOUTH FLORIDA BUSINESS & WEALTH MAGAZINE Digital Magazine Skip to content Main Navigation Lifestyle Media Group Search for: Sections Arts & Culture Ask the Experts Community and Philanthropy Editor’s Choice Cover Stories Editor’s Choice Local Business Good Press Industries Industries Community & Philanthropy Fashion and Retail Fashion and Retail Health Care & Wellness Hospitality Real Estate Retail Travel & Recreation Food & Drink Featured Restaurants Food & Drink Nightlife People Profiles A&E Spotlight People Profiles Local Buzz Around Town Local Buzz Things To Do Web Extras About Lifestyle Media Advertise With Us Contact Us Digital Publications Meet The Team Subscribe Social Media Connect Our Other Brands South Florida's largest single-title brand Subscribe Header Navigation Editor’s Choice Cover Stories Industries Travel & Recreation Real Estate Community and Philanthropy Arts & Culture Fashion and Retail Health Care & Wellness Good Press Food & Drink Featured Restaurants People Profiles A&E Spotlight Events Local Buzz Things To Do Ask the Experts About Us Contact Us Meet The Team Advertise With Us Local Buzz Howl at the Moon Returns to Fort Lauderdale The music venue’s disappearance was just an interlude. October 14, 2024 | Jesse Scott Remembering those infectious crowd sing-alongs and radiating piano riffs stemming from Beach Place circa the mid-2000s? Well, the source of those seemingly endless good times on Fort Lauderdale Beach was Howl at the Moon, and by the end of October, it’s back with a new local address and vibe. Howl at the Moon will open at 270 Southeast 6th Avenue in downtown Fort Lauderdale, a block north of the super-central Cheesecake Factory on Las Olas Boulevard. It will occupy a 5,000-square-foot, multifaceted entertainment space, able to host 250 to 300 guests at a time. “The truth is that ever since we left Fort Lauderdale, we’ve been looking to come back,” says Jessica Tarsnane, national marketing manager for Howl at the Moon. “There wasn’t ever really a reason we wanted to leave aside from our lease not working out then. Now we’re back and we’ve really elevated the experience.” For Howl at the Moon newbies, the first location opened in Cincinnati in 1990, with a dueling piano bar set-up, where the musicians took on-the-spot crowd requests for songs to be played. The concept grew throughout Ohio and its first out-of-state outpost opened in Orlando in 1993. Today, the brand operates 13 locations nationwide and has entertainment residencies on three cruise ship lines. The biggest difference between yesteryear and the Howl at the Moon of today is the music set-up, Tarsnane says. “We’ve gone from two entertainers and two pianos to a full band with different instruments, performing together and rotating instruments. It really is a multifaceted and multi-talented group.” Long-time fans don’t fret – there are still two baby grand pianos front and center on the Howl at the Moon stage, but you may hear some bass, guitar, keytar, banjo, saxophone or flute woven in on a given night. The Fort Lauderdale location will feature a rotation of eight to 10 musicians, the bulk of which were recently flown up to Chicago to audition for a coveted spot. Beyond a central stage for the performers, the Fort Lauderdale venue will feature high-top tables for prime viewing and seating for four. There will be two bars — the larger of the bars will have roll-up, garage-like doors that segue to a sweeping patio making for quite the indoor-outdoor ambiance. As for what to enjoy at those bars, Tarsnane says that Howl at the Moon’s novelty bucket drinks – coming in 86-ounce and 32-ounce sizes – are a national favorite. Concoctions span the traditional (e.g. a rum-loaded hurricane) to the “Hot Girl Summer,” which is a mixture of Three Olives citrus vodka, Malibu rum, lime juice, simple syrup and two types of Red Bull. Unique to the Fort Lauderdale location will be décor touches paying homage to “the Venice of America” as well as its hours. Whereas most Howl at the Moon locations are open solely Thursday through Saturday, this one will be open seven days a week. Count on a cover fee in the $5 to $10 range, but there will be ways to get free admission, Tarsnane says, by either making a table reservation or booking a happy hour party. Beyond its opening phase, Howl at the Moon hopes to be a haven for special occasions aplenty, spanning bachelor and bachelorette parties, birthday events and corporate functions. The brand is working on implementing some of its most popular music-themed nights twice a month, including the likes of ’90s night, country night and emo night. “The way we’ve stayed top-of-mind through the years has been by bringing a truly unique show to our customers,” says Tarsnane. “You could go to any other live performance out there and see the same singer sticking to the same instrument and songs night after night. The versatility of our entertainers and how they interact with an audience is like no other. With our shows and the songs our audiences request, you will never experience the same night twice.” Print Share Share on Facebook Share on Twitter Share on LinkedIn Share on Pinterest Tags: featured You May Also Like Guy Harvey Foundation August 27, 2025 The Real: Harbor Beach July 2, 2025 PAMM Hosts “One Year Out” Celebration for FIFA World Cup 2026 June 7, 2025 Oscar Piastri Wins the Formula 1 Trophy, Presented in Louis Vuitton Custom Trunk May 6, 2025 featured Sixteen Years of Style, Strength & Support Sep 9, 2025 Next Stop, Flavor town Sep 4, 2025 The Rise of the Cool-cation Sep 4, 2025 Keep up with Lifestyle's top headlines Subscribe to our free eNewsletter Email Address (Required) Phone This field is for validation purposes and should be left unchanged. Latest Issue READ LATEST ISSUE MAGAZINE ARCHIVE More Local Buzz Posts Women-Led Driven Artists Racing Team (DART Car) Hits Miami with Car and Gear Designed by Artist Mickalene Thomas April 28, 2025 | Lifestyle Staff These collaborations anchor DART Car’s advocacy program, which strives to elevate women’s accomplishments in motorsports. Read More LiS: Latinos in Sports Returns to Miami for F1 Weekend on May 2 April 24, 2025 | Lifestyle Staff This year’s program will recognize Emilio Estefan with the Latinos in Sports Pionero Award. Read More Join the Hot Moms, Cool Moms Mother’s Day Celebration at CURIO at Faena Bazaar April 22, 2025 | Lifestyle Staff Shop your heart out for a good cause at CURIO at Faena Bazaar. Read More Off to the Races: Where to Dine, Stay, and Be Seen During Formula One Weekend April 16, 2025 | Lifestyle Staff From Michelin-starred hotspots to rooftop escapes, these are the reservations that matter May 2–4. Read More Other Posts Panthers Begin New Chapter as CEO Steps Down September 2, 2025 | Lifestyle Staff As Matt Caldwell leaves for the NBA, the Panthers promote from within to sustain their championship culture Read More Fish, Chips & Sips August 27, 2025 | Lifestyle Staff Dear Olivia Bar & Kitchen Brings Big City Energy to Parkland’s Dining Scene Read More Raising the Bar August 20, 2025 | Lifestyle Staff So You Can Drink Up and Chill Out. Read More Island Reset August 20, 2025 | Angela Caraway-Carlton Wellness retreats are trending, and Florida’s Amelia Island sets the scene for a getaway saturated in natural beauty. Read More Editor’s Choice Ask the Experts Industries Food & Drink People Profiles Local Buzz ABOUT US Lifestyle remains the largest single-title brand—with the broadest geographical reach—in South Florida, encompassing seven different readership markets from Miami to Fort Lauderdale to Boca Raton. This powerful suburban network strategy—one that includes dynamic multimedia and event offerings— positions Lifestyle as a difference-maker for its advertising and community partners. Our affluent readership includes business executives, community leaders, entrepreneurs, influencers, household decision-makers and young professionals. Read More... 3200 N. Federal Highway Suite 228, Boca Raton, FL 33431 954-601-3979 info@lmgfl.com About LMG Contact LMG Advertise with LMG Latest Digital Edition View All Editions Email Address Email This field is for validation purposes and should be left unchanged. Social Connect"
    },
    {
      "url": "https://sfbwmag.com/howl-at-the-moon-makes-return-to-fort-lauderdale/",
      "text": "Howl at the Moon Nears Return to Fort Lauderdale - S. Florida Business & Wealth Lifestyle Magazine Digital Magazine Skip to content Main Navigation S. Florida Business & Wealth Search for: Sections Calendar Community Event Calendar Submit an event Cruise Corner Editor’s Choice Editor’s Choice Profiles Great Places and Spaces Events Event Recap Apogee Awards CEO Connect CEO Connect: Women of Influence Diversity & Inclusion Awards HR Awards Prestigious Women Awards Industries Aviation Banking & Financial Advice Cars, Boats & Toys Dining Education & Philanthropy Entrepreneurs & Business Strategy Health Care & Wellness Industry Superstars Interior Design, Art & Architecture Law/Professional Services Marine Real Estate Retail Technology Travel & Recreation Local Buzz One Liners Broward Miami Dade Palm Beach Signature Events ALL EVENTS S. Florida Legal Guide Browse the Legal Guide Listing Update Your Listing Sponsored Content Sponsored Content The Good Life Thought Leadership Commercial Real Estate Tips From Marcus & Millichap Financial Insights | First American Bank Webinars Web Extras About SFBW Advertising With Us Contact Us Digital Magazines Meet The Team Subscribe Social Media Connect Our Other Brands South Florida Business & Wealth Subscribe Header Navigation Editor’s Choice Signature Events Upcoming Events Event Highlights Excellence in Human Resources 2025 Apogee Awards Diversity & Inclusion Awards Prestigious Women Awards Up & Comer Awards Industries Dining Travel & Recreation Real Estate Entrepreneurs & Business Strategy Industry Superstars Banking & Financial Advice Health Care & Wellness Interior Design, Art & Architecture Cars, Boats & Toys Retail Education & Philanthropy Law & Professional Services Technology Thought Leadership Financial Insights | First American Bank Commercial Real Estate Tips From Marcus & Millichap Calendar Community Event Calendar Submit an Event Webinars About Us Contact Us Meet The Team Advertise with SFBW Stocks Ticker Travel & Hospitality Howl at the Moon Nears Return to Fort Lauderdale The music venue’s disappearance was just an interlude. November 8, 2024 | Jesse Scott Remembering those infectious crowd sing-alongs and radiating piano riffs stemming from Beach Place circa the mid-2000s? Well, the source of those seemingly endless good times on Fort Lauderdale Beach was Howl at the Moon, and this month, it’s back with a new local address and vibe. Howl at the Moon will open at 270 Southeast 6th Avenue in downtown Fort Lauderdale, a block north of the super-central Cheesecake Factory on Las Olas Boulevard. It will occupy a 5,000-square-foot, multifaceted entertainment space, able to host 250 to 300 guests at a time. “The truth is that ever since we left Fort Lauderdale, we’ve been looking to come back,” says Jessica Tarsnane, national marketing manager for Howl at the Moon. “There wasn’t ever really a reason we wanted to leave aside from our lease not working out then. Now we’re back and we’ve really elevated the experience.” For Howl at the Moon newbies, the first location opened in Cincinnati in 1990, with a dueling piano bar set-up, where the musicians took on-the-spot crowd requests for songs to be played. The concept grew throughout Ohio and its first out-of-state outpost opened in Orlando in 1993. Today, the brand operates 13 locations nationwide and has entertainment residencies on three cruise ship lines. The biggest difference between yesteryear and the Howl at the Moon of today is the music set-up, Tarsnane says. “We’ve gone from two entertainers and two pianos to a full band with different instruments, performing together and rotating instruments. It really is a multifaceted and multi-talented group.” Long-time fans don’t fret – there are still two baby grand pianos front and center on the Howl at the Moon stage, but you may hear some bass, guitar, keytar, banjo, saxophone or flute woven in on a given night. The Fort Lauderdale location will feature a rotation of eight to 10 musicians, the bulk of which were recently flown up to Chicago to audition for a coveted spot. Beyond a central stage for the performers, the Fort Lauderdale venue will feature high-top tables for prime viewing and seating for four. There will be two bars — the larger of the bars will have roll-up, garage-like doors that segue to a sweeping patio making for quite the indoor-outdoor ambiance. As for what to enjoy at those bars, Tarsnane says that Howl at the Moon’s novelty bucket drinks – coming in 86-ounce and 32-ounce sizes – are a national favorite. Concoctions span the traditional (e.g. a rum-loaded hurricane) to the “Hot Girl Summer,” which is a mixture of Three Olives citrus vodka, Malibu rum, lime juice, simple syrup and two types of Red Bull. Unique to the Fort Lauderdale location will be décor touches paying homage to “the Venice of America” as well as its hours. Whereas most Howl at the Moon locations are open solely Thursday through Saturday, this one will be open seven days a week. Count on a cover fee in the $5 to $10 range, but there will be ways to get free admission, Tarsnane says, by either making a table reservation or booking a happy hour party. Beyond its opening phase, Howl at the Moon hopes to be a haven for special occasions aplenty, spanning bachelor and bachelorette parties, birthday events and corporate functions. The brand is working on implementing some of its most popular music-themed nights twice a month, including the likes of ’90s night, country night and emo night. “The way we’ve stayed top-of-mind through the years has been by bringing a truly unique show to our customers,” says Tarsnane. “You could go to any other live performance out there and see the same singer sticking to the same instrument and songs night after night. The versatility of our entertainers and how they interact with an audience is like no other. With our shows and the songs our audiences request, you will never experience the same night twice.” To learn more, visit www.howlatthemoon.com/fort-lauderdale/ . Print Share Share on Facebook Share on Twitter Share on LinkedIn Share on Pinterest Tags: featured You May Also Like Check Out Summer, Styled by the Sea, at The Diplomat Beach Resort June 22, 2025 Miami Continues to lead the World When it Comes to Cruising June 1, 2025 New Survey: 45% of Americans Say Tariffs are Affecting Their Travel Plans May 31, 2025 How This CEO’s Response to a Demand for Unique Travel Experiences Shook Up the Market May 27, 2025 Latest Blancpain Shrinks an Icon Sep 9, 2025 Broward County Finally Goes Virtual Sep 9, 2025 Beyond the Role Sep 9, 2025 Awards & Events Celebrating Powerhouses in Heels: SFBW’s 2025 Prestigious Women Awards Jun 15, 2025 Latest Issue READ LATEST ISSUE MAGAZINE ARCHIVE More Travel & Hospitality Posts Flight Options Expand for Travelers Flying Out of FLL May 18, 2025 | SFBW Staff Las Vegas-based budget airline Allegiant added two nonstop flight options in May. Read More Visitor Spending in Greater Fort Lauderdale Continues to Drive Broward Economy May 11, 2025 | SFBW Staff Visit Fort Lauderdale drove him the importance of tourism during National Travel and Tourism Week May 4-10. Read More Fort Lauderdale Ranked as 5th-Cheapest U.S. City to Fly Into this Summer May 8, 2025 | SFBW Staff Memorial Day and July 4th flight prices to the 954 are down, with average airfare prices down 7% overall. Read More Bring your attendees and your wish list: Visit Lauderdale will take your meeting to the next level. April 28, 2025 | SFBW Staff The newly expanded Greater Fort Lauderdale/Broward County Convention Center is expected to open in late 2025 Read More Other Posts The Hospital Doctor February 18, 2016 | SFBW Staff CEO Connect Powered By Greenspoon Marder Jerry Fedele transitions from lawyer to turning around distressed hospitals Boca Raton Regional Hospital President and CEO Jerry J. Fedele has more than 25 years of Read More Economic Flight Path February 18, 2016 | SFBW Staff Pharmaceutical hub, service to Asia and a free trade zone could fuel further growth at MIA By Kevin Gale | photo by Steven Brooke Miami International Airport is positioning itself Read More Season Finale February 18, 2016 | SFBW Staff Palm Beach International Boat Show provides a different vibe By Martin Lenkowsky  |  Photos by Forest Johnson If you missed this season’s boat shows in Fort Lauderdale and Miami, there’s Read More The Restaurant Person March 10, 2016 | SFBW Staff Tim Petrillo plans further growth for his restaurant empire By Julie Kay • Photography by Larry Wood Tim Petrillo fell in love with the restaurant business at the age of 13, Read More Editor’s Choice Sponsored Advertising with SFBW Company South Florida Business & Wealth (SFBW) is South Florida’s premier business and lifestyle magazine serving Miami-Dade, Broward and Palm Beach counties. From the corner suite, to the worlds of wealth management and philanthropy, to the finer things (real estate, travel, auto, yachts, design), SFBW is your curated guide to aiming higher and living well. Read More… 3200 N. Federal Highway Suite 228 Boca Raton, FL 33431 (954) 601-3979 info@sfbwmag.com About SFBW Contact SFBW Advertise with SFBW Latest Digital Edition View All Editions Subscribe Email Address Email This field is for validation purposes and should be left unchanged. Social Connect"
    },
    {
      "url": "https://www.howlatthemoon.com/fort-lauderdale-media-room/",
      "text": "Fort Lauderdale Media Room | Party Venue | Event Venue | Nightlife | Dance Bars | Live Music Bars | Howl at the Moon Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY CONNECT WITH US Howl at the Moon Locations Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea The Show The Drinks Book A Party Blog Howl2GO Upcoming Events 2000S PARTY TAYLOR TAKEOVER PINK PARTY Fort Lauderdale Media Room Book Your Party PARTIES & EVENTS Corporate Events Holiday Parties Birthday Parties Table Reservations Bachelorette Parties Bachelor Parties PARTIES & EVENTS Corporate Events Holiday Parties Birthday Parties Table Reservations Bachelorette Parties Bachelor Parties Contact Information Website: https://www.howlatthemoon.com/fort-lauderdale/ Email address: ftlauderdale@howlatthemoon.com Address: 600 SE 2nd Court, Fort Lauderdale, FL 33301 Social Media Facebook: @howlftl X: @_howlatthemoon Instagram: @howlftl TikTok: @_howlatthemoon Parties and Events Bachelor Parties Bachelorette Parties Birthday Parties Corporate Events Holiday Parties Table Reservations Happy Hour Parties Articles WPTV Sun Sentinel Lifestyle Media Group Join Our Mailing List You Could Win A Party Sign Up First Name * Last Name * Email * Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Birth Month * - Birth Month - January February March April May June July August September October November December Sign up to win a party? Sign me up to win a party! Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap Locations The Drinks Book A Party Employment Contact Gift Cards CONNECT ©\n\t\t\t\t\t\t2025 Howl at the Moon | Privacy Policy | Sitemap choose your howl location to view facebook page: Boston Chicago Fort Lauderdale Foxborough Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Howl at Sea choose your howl location: Please fill out the form below and our Sales and Events Manager will contact you shortly. For same day reservations - Please call your Howl at the Moon for pricing and availability. View our locations Name * First Last Email * Phone Location * - Choose a Location - Boston Chicago Fort Lauderdale Indianapolis Kansas City Louisville Orlando Pittsburgh San Antonio Number of Guests Date * MM slash DD slash YYYY Arrival Time (approx) Flexible Don't know yet 5:00PM 6:00PM 7:00PM 8:00PM 9:00PM 10:00PM 11:00PM 12:00AM 1:00AM 2:00AM How did you hear about us? Do you have any additional info or requests? Birth Month January February March April May June July August September October November December Sign up to join our mailing list Yes No Acknowledgement * I understand that this does not confirm a table reservation and that I will be contacted by a Howl at the Moon representative regarding pricing and availability. CAPTCHA Howl at the Moon needs the contact information you provide to us to contact you about our products and services. You may unsubscribe from these communications at anytime. For information on how to unsubscribe, as well as our privacy practices and commitment to protecting your privacy, check out our Privacy Policy. Phone This field is for validation purposes and should be left unchanged. X"
    }
  ]
}