{
  "fuentes": [
    {
      "url": "https://chicago.goarch.org/leadership/",
      "email": "contactus@chicago.goarch.org"
    },
    {
      "url": "https://www.htclearwater.com/sacraments/weddings",
      "email": "office@htclearwater.com"
    },
    {
      "url": "https://www.holytrinitygoch.com/membership/email",
      "email": "office@holytrinitygoch.com"
    },
    {
      "url": "https://www.holytrinitynr.org/",
      "email": "frdemetrios@holytrinitynr.org"
    },
    {
      "url": "https://www.holytrinitynr.org/",
      "email": "info@holytrinitynr.org"
    },
    {
      "url": "https://www.holytrinitynr.org/",
      "email": "nancy@holytrinitynr.org"
    },
    {
      "url": "https://holytrinitydallas.org/",
      "email": "htgoc@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/",
      "email": "htgoc@holytrinitydallas.org"
    },
    {
      "url": "https://www.goholytrinity.org/about/staff",
      "email": "dndavid@goholytrinity.org"
    },
    {
      "url": "https://www.goholytrinity.org/about/staff",
      "email": "frchristos@goholytrinity.org"
    },
    {
      "url": "https://www.goholytrinity.org/about/staff",
      "email": "frpaul@goholytrinity.org"
    },
    {
      "url": "https://www.goholytrinity.org/about/staff",
      "email": "photini@goholytrinity.org"
    },
    {
      "url": "https://www.watergen.com/about-us/executive-team-board/",
      "email": "group-3467@3x.png"
    },
    {
      "url": "https://www.htclearwater.com/ministries/council-of-ministries",
      "email": "office@htclearwater.com"
    },
    {
      "url": "https://www.htclearwater.com/ministries/hope-joy",
      "email": "office@htclearwater.com"
    },
    {
      "url": "https://holytrinitywilmington.org/",
      "email": "office@holytrinitywilmington.org"
    },
    {
      "url": "https://www.holytrinitynr.org/about-history",
      "email": "info@holytrinitynr.org"
    },
    {
      "url": "https://www.holytrinitynr.org/about-history",
      "email": "nancy@holytrinitynr.org"
    },
    {
      "url": "https://www.holytrinitygoch.com/contact/contact-us",
      "email": "office@holytrinitygoch.com"
    },
    {
      "url": "https://www.goholytrinity.org/",
      "email": "frchristos@goholytrinity.org"
    },
    {
      "url": "https://www.goholytrinity.org/",
      "email": "frpaul@goholytrinity.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "office@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "board@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "office@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "president@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "secretary@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "treasurer@clearwater.org"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "email": "vicepresident@clearwater.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "20ht-bookstore@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "bxeros@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "franargyros@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "frmark@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "frwilliam@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "ht-bookstore@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "htgoc@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "jsimerson@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "lgroome@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "parishcouncil@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "pcfeedback@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "tclark@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "tmorris@holytrinitydallas.org"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "email": "youthministry@holytrinitydallas.org"
    },
    {
      "url": "https://www.htclearwater.com/sacraments/phanouropita",
      "email": "office@htclearwater.com"
    }
  ],
  "mails": [
    "20ht-bookstore@holytrinitydallas.org",
    "board@clearwater.org",
    "bxeros@holytrinitydallas.org",
    "contactus@chicago.goarch.org",
    "dndavid@goholytrinity.org",
    "franargyros@holytrinitydallas.org",
    "frchristos@goholytrinity.org",
    "frdemetrios@holytrinitynr.org",
    "frmark@holytrinitydallas.org",
    "frpaul@goholytrinity.org",
    "frwilliam@holytrinitydallas.org",
    "group-3467@3x.png",
    "ht-bookstore@holytrinitydallas.org",
    "htgoc@holytrinitydallas.org",
    "info@holytrinitynr.org",
    "jsimerson@holytrinitydallas.org",
    "lgroome@holytrinitydallas.org",
    "nancy@holytrinitynr.org",
    "office@clearwater.org",
    "office@holytrinitygoch.com",
    "office@holytrinitywilmington.org",
    "office@htclearwater.com",
    "parishcouncil@holytrinitydallas.org",
    "pcfeedback@holytrinitydallas.org",
    "photini@goholytrinity.org",
    "president@clearwater.org",
    "secretary@clearwater.org",
    "tclark@holytrinitydallas.org",
    "tmorris@holytrinitydallas.org",
    "treasurer@clearwater.org",
    "vicepresident@clearwater.org",
    "youthministry@holytrinitydallas.org"
  ],
  "nombre_sitio": "htclearwater.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://chicago.goarch.org/leadership/",
      "text": "Leadership - The Greek Orthodox Metropolis of Chicago About The Metropolis History and Mission Why Orthodox Christianity Finances & Governance Strategic Growth Job Opportunities Metropolis of Chicago Foundation Our 5-Year Vision Who We Are Metropolitan of Chicago Leadership Administration Office of the Registrar Volunteers Contact Us News & Events News & Events Metropolis News Calendar of Events 2025 Clergy-Laity Assembly Schedules: Great Lent & Holy Week 2025 Submit an Event Photo Galleries Submit your Photos Upcoming Events “Met on the Move” In his new blog series, Met on the Move, Metropolitan Nathanael shares reflections, stories, and encounters from across our Holy Metropolis as he visits all 58 parishes and their surrounding communities. Parishes Parishes Parish News Parish Festival Calendar 2025 Parish Events Strengthen Stewardship Now & Forever Parish Social Media Guidelines Parish Directory Ministries Ministries Ministry Directory Ministry News Ministry Events Mustard Seed Fund Request Form for Ministry Needs Youth & Young Adults Ministry Directory Resources Resources SIRC Discernment Process 2024 Annual Impact Report Buildings, Projects and Architecture Committee Called to Serve: Journeys To Ordained Ministry Called to Lead – Podcast Series Live Services Development/Tuition Assistance Directory of Mental Health Providers Living Water Productions Social Media Guidelines Stewardship Resources Clergy & Parish Portal Donate Leadership The Metropolis Council is the advisory and consultative body to the Metropolitan on issues concerning the life and growth of the Metropolis, its ministries, institutions and financial condition. The Council is comprised of the Metropolitan, the Chancellor, eight (8) Clergy of the Metropolis and eight (8) Laity elected by the Metropolis Clergy-Laity Assembly, and eight (8) appointees by the Metropolitan. His Eminence Metropolitan Nathanael Metropolitan of Chicago His Eminence Metropolitan Nathanael of Chicago is the second metropolitan to preside over the Greek Orthodox Metropolis of Chicago, consisting of 58 parishes and two monastic communities in Illinois, Iowa, Minnesota, and Wisconsin as well as… Read full bio His Grace Bishop Timothy  of Hexamilion Chancellor His Grace Bishop Timothy (Bakakos) of Hexamilion, son of the late Demosthenes and late Antonia Bakakos, was born in Chicago, Illinois in October of 1952, and is the second of four sons. Along with his siblings, His Grace was raised and spent his childhood… Read full bio George Lattas First Vice Chair George Lattas is an experienced transactional attorney who represents clients on all facets of their business legal needs. His experience with firms such as Deloitte and GE, and his JD/MBA provide a depth to his experience that makes him a formidable advocate for his clients. George represents his clients on purchase/sale agreements for every kind of commercial property, title examination and closing; loan documentation, negotiation, and review; retail, office and industrial leasing; corporate law; and loss mitigation. George also has extensive expertise in forming new business organizations, drafting shareholder/operating agreements, negotiating share/unit purchase and sale agreements, and advising on land use matters. George has been named a Rising Star by Superlawyers in 2016-2021, a “Top 100 Attorney”, and Outstanding Young Alumnus by the DePaul University College of Law. He teaches various collegiate courses, serves as the President of the DePaul University College of Law Alumni Engagement Board, a member of the DePaul University College of Law Dean’s Advisory Council, and director of the Hellenic Bar Association. George is a life-long steward of Sts. Constantine & Helen Greek Orthodox Church where he serves on the Executive Committee of the Parish Council and a proud alum of the Koraes School. George lives in Clarendon Hills with is wife Tina and daughters Colette and Vickie. Dean Avdalas Second Vice Chair Dean Avdalas was born and raised in Sacramento, California and finishing his first term on the Metropolis Council serving as the First Vice President. In addition to serving on the Metropolis Council, he also is on the Archdiocesan Council and serves on the Finance Committee and Youth & Young Adult Ministries Committees. He obtained a Bachelor’s degree in Communications and Political Science from the University of California, Davis. Prior to moving to Chicago, he was a small business owner, managed various real estate investments and was involved with numerous political campaigns and organizations. In 2006, he moved to Chicago to pursue a new career opportunity in commercial banking. Most importantly, that is where he met his wife, Marina. Dean became involved with real estate and business lending which ultimately shaped his career. In 2014, he accepted a new challenge and was hired as a business lender at Byline Bank, a publicly traded Chicago-based bank specializing in business banking. During his years at Annunciation in Sacramento, Dean served on the Parish Council, coached youth basketball, supported various church and cultural organizations and served as an altar boy for fourteen years. In addition to Greek American organizations, Dean was an active member of the Pi Kappa Alpha fraternity at UC Davis, Big Brothers and Big Sisters of Sacramento and represented Sacramento County as a Delegate at the 2004 National Presidential Convention. In Chicagoland, Dean is a board member for SomerCor, one of the largest SBA lenders in the Midwest. He’s a proud member of the Hellenic American Leadership Council (HALC), AH EPA, a past board member of Neo Kyma Messinias and a strong supporter of various philanthropic organizations. He lives in Glenview, Illinois with his wife Marina and their three children: Ambri, Gia and Teddy. They are members of Saints Peter & Paul. Peter Coules Co-Treasurer I have been practicing law since 1986. After graduating, with honors, from the University of Illinois Urbana/Champaign in 1983 with a B.S. in Economics and a B.A. in Political Science, I then received my law degree from DePaul University in 1986. In 1995 I established Donatelli & Coules, Ltd. with Mark Donatelli. I have extensive corporate, municipal, land use, real estate and not-for-profit experience as a result of his tenure with this law firm. Also an advisory Board Member of Busey Bank (Previously was on the Holding Company of First Community Bank with 15 locations), a member of Pelican Bay’s Policies and Relations Committee, a member of the Board of Directors of the Donald J. Doody Foundation, a Director and Co-Founder of Project Infinite Green, founding member of the Lemont High School Educational Board, a former elected Trustee of the Village of Lemont and past President of St. Nicholas Greek Orthodox Church in Oak Lawn (Present Council Member). I am a lifelong steward of St. Nicholas. I live in Lemont, Illinois with my wife Denise and his two grown daughters. Helen Alexander Secretary Helen Alexander has for decades served the Greek American community and Greek Orthodox Church in a variety of roles. She served many years as the Director and Administrator of the United Hellenic American Congress(UHAC), where she was particularly known for her fundraising skills and accomplishments.  Helen has had the opportunity to meet and work with religious leaders, presidents of foreign countries, foreign ministers, U.S. congressmen and senators, members of parliament and celebrities from all over the world.  Her work with UHAC led to roles in the World Council of Hellenes Abroad (SAE) and with Hellenicare where she assisted in the establishment of health care clinics for underserved communities in the former Soviet Union and other communist bloc countries.  Helen was also instrumental in working with leadership of UHAC in securing the grant opportunities for International Orthodox Christian Charities (IOCC).  She has directly worked with dignitaries, community leaders and volunteers in organizing, directing and planning special events and fundraisers.  These include, but are not limited to, the Archbishop Iakovos Leadership 100 Endowment Fund, the Coordinated Efforts of Hellenes (CEH), UHAC Greek Parade and Heritage Week, the Hellenic Medical Society, the Hellenic American Academy, Clergy Laity Congresses and more.  She is honored to have organized events surrounding the arrival of two Ecumenical Patriarchs: His All Holiness Patriarch Demetrios of blessed memory and His All Holiness Patriarch Bartholomew.  Helen is a well-respected “ambassador of good will”, forming lasting friendships with world and religious leaders. Helen has also served as Director of Development at the National Hellenic Museum and as His Eminence Metropolitan Nathanael’s initial Chief of Staff at the Greek Orthodox Metropolis of Chicago. She was born in Vorios Epirus and immigrated to the United Sates (Chicago, IL) with her parents Nick and Fotini and her brother Peter during the height of Greece’s civil war. She was honored in 2009 by the Hellenic Bar Association with their Lifetime Service Award and also honored in 2013 by the Pan Epirotic Federation’s Daughters of Epirus for her devotion to her Hellenic and American heritages, as well as for her outstanding achievements in public affairs, Hellenic education and philanthropy.  Helen is now devoting much of her volunteer energy encouraging the emergence of a new generation of active Hellenes serving in advisory roles for the Hellenic American Leadership Council. She lives in Northbrook, Illinois with her husband Stergios.  They are members of Saints Peter and Paul. Paul Rentzelos Treasurer A Chicago local, baptized at Holy Trinity but attending St. Demetrios-Chicago as an adolescent and St. Haralambos-Niles as a teen and young adult. Paul is a steward at St. George-Chicago since 2008 and serving as the Parish Council president since 2018. Having received a Bachelor of Science degree in Industrial Technology with an emphasis in Construction Management from Illinois State University in 1995, Paul joined Leopardo Companies, one of the nation’s largest commercial builders, as a construction project manager. Serving clients such as The Metropolitan Bank Group, Miglin-Beitler Management, The Hilton Hotels, Chicago Public Schools, Kinko’s, and City of Chicago, Paul has extensive experience in all aspects of the building design and construction process. Today, as the Vice-President of Information Systems and Technology for Leopardo Paul leads the digital transformation, business alignment, strategic planning, implementation, and security of all IT systems. Fr. Tilemahos Alikakos Fr. Tilemahos Alikakos serves as the parish priest of Saint Spyridon in Palos Heights, IL. He has also served as a missionary at the Orthodox Metropolis of Hong Kong and Southeast Asia, as the associate pastor of the Assumption Greek Orthodox Church in Chicago, and as the parish priest of the Holy Trinity Greek Orthodox Church in Sioux City, Iowa. Fr. Tilemahos graduated Loyola University Chicago majoring in Mathematics and Statistics before earning his Master of Divinity at Holy Cross Greek Orthodox School of Theology. Along with his parish ministry, Fr. Tilemahos has served as the OCF advisor at the University of Chicago, as the advisor to the Midwest Hellenic Dance Festival and as a member of the Greek Education Committee. Fr. Tilemahos lives in Orland Park with Presvytera Georgia and their four children, Konstantine, Demetra, Marina, and Katerina. Fr. Chris Avramopoulos Fr. Chris was born and raised in Rockford IL. As a youth he was a member of Sts. Constantine and Helen Greek Orthodox Church, Rockford. He graduated from Rockford Guilford High School and attended the University of Wisconsin, Madison, graduating with a Bachelor of Science in History. He then attended Holy Cross Greek Orthodox School of Theology in Brookline Massachusetts and graduated with honors with a Masters of Divinity in 1998. Upon graduation, Fr. Chris was hired as the Youth Pastoral Assistant at the parish of Sts. Constantine and Helen in Palos Hills for 5 years, until His Eminence Metropolitan Iakovos, of blessed memory, asked him to fill the position of the Metropolis Of Chicago Youth and Young Adult Ministries Director, which he continued to do for the next 15 years. In 2012, Fr. Chris and Presvytera Nicole were married at All Saints Greek Orthodox Church in Joliet, the home parish of Presvytera. With the blessings of His Eminence Metropolitan Iakovos, he was ordained to the Holy Diaconate on November 22, 2014 and continued to serve as Youth and Young Adult ministries Director and the assistant and Deacon to Metropolitan Iakovos. On December 15, 2018, His Eminence Metropolitan Nathanael of Chicago ordained him to the Holy Priesthood at the parish of SS. Constantine and Helen in Palos Hills, where he was assigned as the associate Pastor. On March 8, 2020 Fr. Chris was assigned to the parish of All Saints Greek Orthodox Church in Joliet where he happily served at the home parish of Presvytera for over 3 years. On June 1st, 2023, His Eminence Metropolitan Nathanial assigned Fr. Chris to the role of Proistamenos at Sts. Constantine and Helen in Palos Hills. Fr. Panagiotis Boznos Fr. Panagiotis Boznos grew up in the suburbs of Chicago attending the Greek Orthodox parishes of St. Nectarios in Palatine and St. Athanasios in Aurora.He earned his BA (2008) from the University of Oklahoma with a double major in Religious Studies and Classical Greek. From there he proceeded to Holy Cross Greek Orthodox School of Theology, where he received his MDiv (2013). While at seminary, Fr. Panagiotis met and married Presbytera Nichole, who also graduated from Holy Cross the same year with an MTS. Together they have four children. Fr. Panagiotis was ordained to the Diaconate on June 29th, 2013 and to the Priesthood on July 28th, 2013. Following his ordination to the Priesthood, he served the parish of Saints Peter and Paul Greek Orthodox Church in Glenview, IL from 2013-2019 and currently serves as the priest of his home parish of St. Athanasios Greek Orthodox Church in Aurora, IL. Fr. Chrysanthos Kerkeres Fr. Chrysanthos Kerkeres is the parish priest of Saint George Greek Orthodox church in the Lincoln Park neighborhood of Chicago, Illinois, and has served in that capacity since February 1, 2014. In addition to his parish responsibilities, Fr. Chrysanthos serves as a member of the Board of Directors of the Greek Orthodox Metropolis of Chicago Fanari Camp. He is the spiritual advisor to the Orthodox Christian Fellowship program of DePaul University, the spiritual advisor to the Hellenic American Veterans of the Metropolis of Chicago, the spiritual advisor to the Hellenic American Police Association, and a Chaplain for both the Chicago and Park Ridge Police Departments. Fr. Chrysanthos also sits on the Metropolis of Chicago Spiritual Court, serves as the Vice President of the Hellenic College and Holy Cross Greek Orthodox School of Theology Alumni Association, as the Vice President of the Orthodox Christian Clergy Association of Chicago, serves on the Metropolis of Chicago Greek Education Committee, and is the Coordinator of the Archons of the Greek Orthodox Metropolis of Chicago. Fr. Chrysanthos is married to Vasiliki Kerkeres and they live in Park Ridge, Illinois. Fr. Sotirios Malamis Fr. Sotirios Malamis has been the Proistamenos at the Ascension of Our Lord Greek Orthodox Church in Lincolnshire, IL since September 1, 2014. In that capacity, he provided leadership and spiritual guidance during a $9 million, 21-month construction project culminating in the opening of a new church and community center on June 5, 2019. Concurrently, he has been teaching Byzantine Music area students for several years. He attended DePaul University where he earned a Bachelor of Arts degree in Psychology. Fr. Sotirios then graduated with distinction in 2001 from Holy Cross School of Theology with a Master of Divinity. He continued his theological studies at the University of Athens in the field of Pastoral Theology and Religious Education. Along with serving on the Metropolis Council, he is currently serving on the Archdiocesan Council as well. Fr. Sotirios and Presvytera Stefanie have three children, Maria, Nikolas, and Aimilianos. Fr. Chris Mihalopoulos Father Chris was raised in Palos Hills, Illinois and attended St. Spyridon Greek Orthodox Church and Assumption Greek Orthodox Church of Olympia Fields now Homer Glen. He graduated from Amos Alonzo Stagg High School and received a degree from the University of Illinois at Chicago with a double major in psychology. Father Chris’ love was to always work with children and to serve the Church. He began his studies at Holy Cross Greek Orthodox School of Theology thanks in part to his spiritual father and other priestly mentors who guided and helped him follow in our Lord’s footsteps. Father Chris graduated our Holy Cross Seminary in 2013 and married the love of his life, Presvytera Toni (Poteres) Mihalopoulos on October 6, 2013. He began his ministry as the lay assistant of Saint Nectarios Greek Orthodox Church in August 2013. Father Chris was ordained to the Holy Diaconate on Sunday, March 16 2014- 2nd Sunday of Great Lent- Sunday of Saint Gregory Palamas. He was then transferred to the community of Saint Demetrios of Chicago on June 1st, 2014. Father Chris was ordained to the Holy Priesthood on Sunday, September 26th, 2014. He and Presvytera Toni have three children, Luke, Theodore (Theo) and Apostolos Nektarios. Fr. Douglas Papulis Fr. Douglas Papulis has served in the Metropolis of Chicago since 1986. Kimissis in Racine, Wisconsin was home for 11 years and then in 1997 he moved to serve St. Nicholas in St. Louis, Missouri. He has been appointed as Vicar of the Missouri/Southern Illinois parishes. Fr. Doug graduated from Hellenic College and Holy Cross School of Theology in 1983. He is married to Presvytera Christina (Dedes) and has three sons and three grandsons. Fr. Dimitri Tobias Fr. Dimitri Tobias is a Member of the IT/Operations Committee of the Metropolis Council. He is a priest of the Metropolis of Chicago for 7 years, serving the community of SS. Peter & Paul in Glenview, IL as an Associate Pastor; and the communities Holy Trinity in Sioux City, IA; and St. Basil in Chicago, IL as a Proistamenos. Prior to this, he has served in the Department of Internet Ministries for the Greek Orthodox Archdiocese, the Department of Registry for the Metropolis of Chicago, and the Pastoral Lay Assistant of St. Nectarios in Palatine, IL. He has a Bachelor’s Degree in Religious Studies from Hellenic College and a Master’s Degree in Divinity from Holy Cross Greek Orthodox School of Theology. Dr. George K. Bovis George K Bovis, MD is a neurosurgeon practicing in Chicago for the last 23 years. He completed his college and medical school education at Northwestern University, his neurosurgery training at Mayo Clinic in Rochester, Minnesota, and his fellowship training in cerebrovascular and skull base at the Mayfield Clinic in Cincinnati, Ohio. Dr Bovis presently serves as the Vice Chairman of Neurosurgery at AMITA Health, the Medical Director of the Illinois Gamma Knife Center and AMITA Neuroscience Institute, and Assistant Professor of Neurosurgery at Rush University Medical School. He is the author of 57 peer reviewed journal articles, book chapters, and academic presentations. Dr Bovis is a very active member of the Greek American community both regionally and nationally. He was elected to the Greek Orthodox Metropolis Council of Chicago, sits on the Board of the National Hellenic Museum and serves as a medical advisor at the Hippocratic Cancer Research Foundation and the Greek American Rehabilitation Centre. Finally, both he and his wife Raffaella are Founding Members of the Ecumenical Patriarch Bartholomew Foundation. Stephanie Dremonas Stephanie Dremonas is a second-generation owner of the 17-store local grocery chain Pete’s Market and the real estate development company JD Real Estate. She has served her family-owned and operated business for over a decade, and during her tenure has effectively doubled the company. Bringing a female touch to a male dominated industry, Stephanie utilized both hard and soft skills to morph Pete’s from a mom and pop shop to a sustainable enterprise, now equipped for future growth and development. While Stephanie holds a Bachelor’s Degree in Business Administration (Double Major in Finance and Real Estate) from Marquette University, most of her relevant schooling came from being selftaught on the job, working and learning every department from the bottom up. She is affectionately referred to as “Junior” at the company, because she has adopted the relentless work ethic of her immigrant father and founder. Stephanie is best known for being in “vest mode” pretty much always, which includes her sneakers, black pants, Pete’s vest with a pen clipped on the zipper, and, of course, her winning attitude. Stephanie is the middle child of 5 siblings in a Greek household, so she’s a natural mediator, and is also the mother of 1.5 year-old Stella, so, is now also a multi-tasker. Owen Field Owen Field is a retired attorney. During his career with the State of Illinois, he served as an Assistant Attorney General representing public welfare agencies in complex state and federal litigation, General Counsel of the Department of Mental Health and Development Disabilities, and General Counsel of the Department of Healthcare and Family Services (HCFS), focusing in both agencies on Medicaid policy. He has taught film appreciation classes through the Chicago City Colleges for the past eleven years. Owen, raised in the Baptist church, came to the Orthodox faith and was chrismated in 1998. He and his spouse of 39 years, Myra Karegianes, have been stewards at Saint George (Chicago) since 2014. They have co-chaired the Stewardship Committee there since then. He is currently vice president of the Parish Council, having previously served as recording secretary. Owen also is currently a member of the Metropolis Council. He is on the Metropolis’ Strengthen Stewardship Now & Forever team that developed the Stewardship component of the Metropolis Strategic Plan and that hosts monthly Metropolis-wide stewardship meetings. Prior to being stewards at Saint George, Owen and Myra were stewards at Saint Basil (Chicago). Owen served on the Parish Council, was president (2002-05) and vice president (2006-09), and on the Stewardship Committee (2003-11). Owen also served on the interim Parish Council at Holy Trinity (Schiller Park) and as chair of the Stewardship Committee in 2019-21. Owen and Myra have two daughters and three granddaughters. Dr. Alexandria Kalina Diakonissa Dr. Alexandria Kalina has been a member of the Metropolis Council (MC) since 2021. She has served on the Metropolis’ Strengthen Stewardship Now and Forever Committee for over three years, helping to form best practices for Stewardship, aiding parishes around the Metropolis to become independent of outside sources of income, and help increase engagement and vibrancy of their communities. On the MC, she has also worked to increase engagement of parishioners across the Metropolis with one another, and recently co-chaired a Metropolis wide virtual discussion of the book For the Life of the World. Dr. Alexandria is a member of St. Mary’s Greek Orthodox Church in Minneapolis, where she serves as co-chair of Stewardship, and is a Church School teacher for 11th and 12th grade. She was raised in NYC and Boston, received her undergraduate degree from Harvard College, her medical degree from Baylor College of Medicine and did her pediatric residency at the Mayo Clinic. She is currently in a pediatric practice in rural Minnesota with a large mental health component and is a panelist at the 2023 Chicago CLA in a session dedicated to Adolescent Mental Health. Dr. Alexandria and her husband Fr. Deacon Dr. Paul have three children: Andrew, a graduate of Holy Cross Seminary and current ophthalmology resident at KU, Maria, an MBA graduate who resides in Atlanta and works for Delta, and Stephen, a recent MDiv graduate from Holy Cross and first-year medical student at George Washington University. Presvytera Evangelia March, Ph.D. Presvytera Evangelia March grew up in Cyprus. She received her Bachelor’s degree in Elementary Education and, while working in the public schools, she discovered her eagerness to support students with disabilities in their learning. A Fulbright Scholarship, in 1998, allowed her to complete a Master’s degree in Special Education at the University of Virginia. She continued her studies at the University of Illinois in Urbana-Champaign and received her Ph.D. in Special Education. Over the course of her graduate studies, she received multiple honors and scholarships, including the Makarios Scholarship/Lappas Award, the Hellenic Link-Midwest Scholarship for Excellence, multiple William Chandler Bagley Scholarships, the European Union Center at UIUC Travel Grant, the Gerald H. Read Laureate Scholarship, multiple Educational Grants from the A.G. Leventis Foundation (France), and the Illinois International Graduate Achievement Award. In 2004, she accompanied her husband, Fr. Nichalas March, to Holy Cross School of Theology, where she studied Byzantine Music. In 2009, they returned to Cyprus and she resumed her career in public education. While in Cyprus, they welcomed their four children and they travelled extensively to Orthodox sites in the Holy Land, Egypt, Greece, Romania and Turkey. She has over 25 years of accumulated experience as an educator: a public school teacher, a Sunday school director/teacher, an adult book-study leader, a camp counselor, a Greek-language teacher and a vacationchurch-school director. She continues to practice Byzantine music and she offers her talents to her parish, her family and to anyone who might participate in the programs she organizes. She currently lives in Mason City IA, where she and her husband serve the Holy Transfiguration Greek Orthodox Church. Yanni Sianis Yanni Sianis is the Chief of Staff of Calamos Investments. Prior to his current position, Yanni served as Vice President of Global Business Development and was responsible for managing both domestic and international relationships for the private and institutional channels. He joined the firm in 2010 as a Wealth Adviser with Calamos Wealth Management. Prior to joining Calamos, Yanni was a senior derivatives broker and trader at LaSalle Global. He previously served as Vice President of Business Development and Director of the GCC (Cooperation Council for the Arab States of the Gulf) and the Middle East at America 2030 Equity, a private equity firm outside of Chicago. Yanni earned a B.A. from Boston University, an M.A. in Industrial Psychology from National Louis University and an AMP from the University of Chicago, Booth School of Business. Yanni is active in the Greek American community and is currently serving his second term on the Metropolis Council of the Greek Orthodox Metropolis of Chicago, is Chairman of Project Hope – a Humanitarian Ministry, a Board Member of the American Hellenic Institute, an Executive Committee Member of the Board of the National Hellenic Museum, a member of Leadership 100 and the National Hellenic Society, and an Archon of the Ecumenical Patriarchate in the Order of St. Andrew. George Tarlas George co-manages ACG and oversees its Institutional business. As a Senior Managing Director, he helps to set the strategic direction of the firm. George is a member of ACG’s Investment Committee, which is comprised of senior members of the organization and whose primary task is to ensure continuity and consistency in its investment recommendations to clients. George works with a broad array of client relationships and brings value to clients through his strategic advisory, portfolio modeling and evaluation, and ongoing education. Prior to joining ACG in 1996, George was a Vice President for Gershman Investment Corp. in St. Louis. He brings a background in finance and real estate and earned his finance degree from the University of Colorado. George is a holder of the Chartered Financial Analyst designation and is a member of the CFA Society of St. Louis and the CFA Institute. Outside of the firm, George is a member of the City of Town & Country Ways & Means Commission and a Board member of the Burridge Center for Finance at the Leeds School of Business at the University of Colorado. George also serves on the Grant Committee of Social Venture Partners in St. Louis, which provides financial and hands-on resources to nonprofit organizations that provide educational programs for disadvantaged youth. George is a lifelong active member of St. Nicholas Greek Orthodox Church in St. Louis. Dean G. Tortorelis, M.D. Dr. Dean Tortorelis is a private practice Urologist and partner of Minnesota Urology. He is a Board Certified Urologist and Fellow of the American College of Surgeons. He is a managing partner and a board member of the practice. He also has leadership roles as surgery section chief at North Memorial Health, and as a board member at the Allina Surgery Center. Notwithstanding his busy practice, Dr. Tortorelis lives his Orthodox faith as a dedicated Greek Orthodox Christian and is engaged in parish life and sacraments. He has been involved in many activities of parish life including parish board vice president, Church School teacher, GOYA basketball coach, and helping to plan and implement church school activities. Dr. Tortorelis has made a pilgrimage to Mount Athos and has visited many monasteries in Greece, often ministering to the health care and needs of the monks. Dr. Tortorelis has led discussions on Men’s Health to men of his parish and provides information and care to clergy and laity who call on him throughout the Metropolis and Archdiocese. Legal Advisors Joan Tolios Berg, Esq. Joan Tolios Berg is a partner with Schoenberg Finkel Newman & Rosenberg LLC, where she is the Transaction Department Chair. Her practice is focused upon commercial real estate, lending and corporate matters. She and her family are stewards of Holy Apostles Greek Orthodox Church in Westchester, Illinois, where she remains active with the choir. Joan is a member of the peer-reviewed network, Leading Lawyers, and is actively involved with the boards of directors of other philanthropic organizations. Georgia Loukas Demeros, Esq. Georgia Loukas Demeros is a legal advisor to the Metropolis Council. She is a partner at the law firm of Thompson Coburn LLP. Georgia advises multigenerational families on wealth transfer and business succession planning and serves as personal general counsel to closely held businesses, business leaders and other individuals. She is the First Vice-President of the Hellenic Bar Association, a founding member of Hellenic American Leadership Council (HALC) and serves as a board member for other nonprofit organizations. Georgia holds a BBA in Accounting from Loyola University of Chicago, a JD and LLM in Taxation from Chicago-Kent College of Law and is a certified public accountant. Georgia and her family are stewards at Holy Taxiarhai and Saint Haralambos Greek Orthodox Church and St. John the Baptist Greek Orthodox Church. Harry J. Secaras, Esq. Harry J. Secaras serves as legal counsel to the Metropolis and the Metropolis Council. He is a Shareholder of the law firm Ogletree, Deakins, Nash, Smoak & Stewart, P.C. concentrating in traditional labor and employment law. Mr. Secaras has more than 30 years’ experience advising, counseling and representing employers in collective bargaining, arbitration and personnel matters and in claims brought before federal and state agencies and in federal and state courts. He is a Fellow of the College of Labor and Employment Lawyers and has been recognized as an Illinois Super Lawyer for more than 10 years. He is a Past President of the Hellenic Bar Association of Illinois and has served on the Board of Directors of the Hellenic Bar Association Foundation. He has served on the Parish Councils of the Three Hierarchs Church in Champaign, Illinois and the St. Nectarios Greek Orthodox Church is Palatine, Illinois. He holds BA, MBA and JD degrees from the University of Illinois in Champaign-Urbana where he was a founding member of the Eastern Orthodox Christian Fellowship. He, his wife Maria, and their three children reside in Wilmette, Illinois and are stewards of St. Andrew’s Greek Orthodox Church in Chicago. Audit Committee Gus Harris Gus Harris is a Resident Auditor (RA) for the Defense Contract Audit Agency (DCAA) managing an office of 32 personnel responsible for auditing a major defense company located in St. Louis, MO. Gus’ professional goals include taking on new tasks that will help him grow personally and professional in mentoring and managing people and inspiring others to take on new challenges no matter how difficult to help become better auditors and leaders. Gus is a licensed CPA in Missouri and has over 35 years of auditing of performing contract audits in accordance with Generally Accepted Government Auditing Standards (GAGAS). Gus was also the Treasurer for the Assumption Greek Orthodox Church in Town and Country, MO and has experience in preparing church financial statements and federal/state payroll taxes, W2s and 941s using Quick Books Pro. Gus’ 35 years at DCAA include holding various roles such as auditor, technical specialist – financial capability/pensions, supervisory auditor, Sr Financial Liaison Assistant, Special Assistant and RA. Gus’ achievements and experiences including auditing companies from mom and pops to Fortune 500s across the US that include Boeing, General Dynamics, KBR, McDermott Int, Magellan Health, Cerberus Inv, Ball Aerospace, Enron, Afghan National Trust Fund, etc. saving the taxpayer money and supporting the warfighter. Gus holds a Bachelor of Science in Accounting from the University of Missouri – St. Louis and he also attended the Aristotle University of Thessaloniki for the Greek language. In his spare time Gus enjoys going to church, reading history, particularly about the church, the lives of the saints, playing golf and swimming. Steve Koulogeorge I am a lifelong member of Saint Peter & Paul parish in Glenview, Illinois. Professionally, I am a C.P.A., M.B.A., with 25+ years of Accounting experience, including Internal controls, accounting policies and procedures, cash management practices. Corporate Compliance Officer (5 years); with training in information security, data integrity, “arms-length” business transactions, as well as protocol in accepting gifts, cash, meals and other perks. An experienced C.P.A./M.B.A. In my professional life, I have served as a Controller for 17 years, and Chief Financial Officer for 5 years. In that capacity, I have been the key contact for both Internal and External Audits for over 20 years. My current and past service at my Home Church (SS. Peter & Paul) includes the following : Saints Peter & Paul Parish Council member, Council Assistant Treasurer, Council Treasurer, and Audit Committee Member. I am intimately familiar with not-for-profit accounting and aided in our Churches transition to the Financial Reporting requirements of ASU 2016-14. Was also involved in our Payroll Protection Program Loan applications #1 and #2. Archdiocesan Council His Grace Bishop Timothy  of Hexamilion Chancellor His Grace Bishop Timothy (Bakakos) of Hexamilion, son of the late Demosthenes and late Antonia Bakakos, was born in Chicago, Illinois in October of 1952, and is the second of four sons. Along with his siblings, His Grace was raised and spent his childhood… Read full bio George Lattas First Vice Chair George Lattas is an experienced transactional attorney who represents clients on all facets of their business legal needs. His experience with firms such as Deloitte and GE, and his JD/MBA provide a depth to his experience that makes him a formidable advocate for his clients. George represents his clients on purchase/sale agreements for every kind of commercial property, title examination and closing; loan documentation, negotiation, and review; retail, office and industrial leasing; corporate law; and loss mitigation. George also has extensive expertise in forming new business organizations, drafting shareholder/operating agreements, negotiating share/unit purchase and sale agreements, and advising on land use matters. George has been named a Rising Star by Superlawyers in 2016-2021, a “Top 100 Attorney”, and Outstanding Young Alumnus by the DePaul University College of Law. He teaches various collegiate courses, serves as the President of the DePaul University College of Law Alumni Engagement Board, a member of the DePaul University College of Law Dean’s Advisory Council, and director of the Hellenic Bar Association. George is a life-long steward of Sts. Constantine & Helen Greek Orthodox Church where he serves on the Executive Committee of the Parish Council and a proud alum of the Koraes School. George lives in Clarendon Hills with is wife Tina and daughters Colette and Vickie. Dean Avdalas Dean Avdalas was born and raised in Sacramento, California and finishing his first term on the Metropolis Council serving as the First Vice President. In addition to serving on the Metropolis Council, he also is on the Archdiocesan Council and serves on the Finance Committee and Youth & Young Adult Ministries Committees. He obtained a Bachelor’s degree in Communications and Political Science from the University of California, Davis. Prior to moving to Chicago, he was a small business owner, managed various real estate investments and was involved with numerous political campaigns and organizations. In 2006, he moved to Chicago to pursue a new career opportunity in commercial banking. Most importantly, that is where he met his wife, Marina. Dean became involved with real estate and business lending which ultimately shaped his career. In 2014, he accepted a new challenge and was hired as a business lender at Byline Bank, a publicly traded Chicago-based bank specializing in business banking. During his years at Annunciation in Sacramento, Dean served on the Parish Council, coached youth basketball, supported various church and cultural organizations and served as an altar boy for fourteen years. In addition to Greek American organizations, Dean was an active member of the Pi Kappa Alpha fraternity at UC Davis, Big Brothers and Big Sisters of Sacramento and represented Sacramento County as a Delegate at the 2004 National Presidential Convention. In Chicagoland, Dean is a board member for SomerCor, one of the largest SBA lenders in the Midwest. He’s a proud member of the Hellenic American Leadership Council (HALC), AH EPA, a past board member of Neo Kyma Messinias and a strong supporter of various philanthropic organizations. He lives in Glenview, Illinois with his wife Marina and their three children: Ambri, Gia and Teddy. They are members of Saints Peter & Paul. Tom Sikoral Tom is currently the Sr Vice President of Corporate Real Estate at U.S. Bank – a seasoned leader and accomplished asset management professional who creates a highly productive team of over 200 employees and delivers winning strategies to achieve cost effectiveness and growth. With over 27 years of management experience, Tom has a broad scope of industry knowledge in the management of all aspects of leasing activities including contract negotiations, financial analysis, budget control, customer satisfaction and employee development. Tom and his family are very active members of the Greek American community. He currently is Co-Treasurer for the Chicago Metropolis Council, and the Parish Council President and Assistant Athletic Director for Holy Taxiarchai & Saint Haralambos Greek Orthodox Church in Niles, Illinois. He lives in Morton Grove, Illinois with his wife Anastasia and their three children: Stavros, Alexandra, and Nikolas. Fr. Dimitri Tobias Fr. Dimitri Tobias is a Member of the IT/Operations Committee of the Metropolis Council. He is a priest of the Metropolis of Chicago for 7 years, serving the community of SS. Peter & Paul in Glenview, IL as an Associate Pastor; and the communities Holy Trinity in Sioux City, IA; and St. Basil in Chicago, IL as a Proistamenos. Prior to this, he has served in the Department of Internet Ministries for the Greek Orthodox Archdiocese, the Department of Registry for the Metropolis of Chicago, and the Pastoral Lay Assistant of St. Nectarios in Palatine, IL. He has a Bachelor’s Degree in Religious Studies from Hellenic College and a Master’s Degree in Divinity from Holy Cross Greek Orthodox School of Theology. Metropolis Junior Board Formed in June 2019, the Metropolis of Chicago Junior board is composed of 24 young adult leaders from throughout the Metropolis. Originally conceived by His Eminence Metropolitan Nathanael, the Board’s primary charge is to recommend, develop, and implement policies and programs to encourage greater participation among young adults in the life of the Church, including among lapsed or unengaged Orthodox Christians. Beyond advising His Eminence, the Junior Board also interacts with the Metropolis Council to help shape Metropolis policy and programs to meet the needs and concerns of youth and young adults. View Junior Board Member Bios RELATED RESOURCES A Thank You Letter to the Faithful from His Eminence Metropolitan Nathanael 2020-2021 Budget – Metropolis of Chicago WHY WE EXIST To share unconditionally Christ’s love and mercy with the world. OUR MISSION We seek to bring all people to Christ through our people, parishes, and programs. OUR VISION Unity in Christ has deepened our relationships with family, friends, and neighbors. We are a growing Church that bears fruit in the world. OUR CORE VALUES Christ-Centered, Humility, Love, Service, Candor, Adaptability SUBSCRIBE Donate Now 555 E. Butterfield Road, Suite 201 Lombard, IL, 60148 t (312) 736-2280 f (312) 284-2380 contactus@chicago.goarch.org Follow the Metropolis © COPYRIGHT 2024, GREEK ORTHODOX METROPOLIS OF CHICAGO PRIVACY POLICY VISITOR POLICY DIGITAL MEDIA CONSENT TERMS OF USE LOG IN"
    },
    {
      "url": "https://www.htclearwater.com/sacraments/weddings",
      "text": "Weddings – Holy Trinity Greek Orthodox Church Skip to content Skip to sidebar Skip to footer Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Stewardship Form Stewardship Form Close Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Our Faith Weddings By christian April 26, 2024 Being Crowned If you are engaged and want to be married at Holy Trinity let us greet you with our warmest congratulations!  If you are just looking for more information about marriages at Holy Trinity you have also come to the right place. Every person made in the image and likeness of God and is unique, and unrepeatable.  How much more unique and unrepeatable are two people coming together into one flesh?  Your first step after being engaged should be to call the parish office to schedule a meeting with our clergy to learn more about the sacramental blessing of marriage in the Orthodox Church.  If the office isn’t open, we hope that the following information will help you in preparing for your wedding. Follow these easy steps for a smooth wedding planning process at Holy Trinity Pray Call the Office Complete the Journey of Marriage Seminar Click Here for More Information Show up (on time) To meet with our clergy about getting married at Holy Trinity contact the parish office Monday-Friday 10:00am-4:00pm at (727)-799-4605 or e-mail us at office@htclearwater.com . God is active in our lives. It is He who joins a man and a woman in a relationship of mutual love. The Sacrament of Marriage bears witness to His action. Through this Sacrament, a man and a woman are publicly joined as husband and wife. They enter into a new relationship with each other, God, and the Church. Since Marriage is not viewed as a legal contract, there are no vows in the Sacrament. According to Orthodox teachings, Marriage is not simply a social institution, it is an eternal vocation of the kingdom. A husband and a wife are called by the holy Spirit not only to live together but also to share their Christian life together so that each, with the aid of the other, may grow closer to God and become the persons they are meant to be. In the Orthodox Marriage Service, after the couple have been betrothed and exchanged rings, they are crowned with “crowns of glory and honor” signifying the establishment of a new family under God. Near the conclusion of the Service, the husband and wife drink from a common cup which is reminiscent of the wedding of Cana and which symbolized the sharing of the burdens and joys of their new life together. (source: goarch.org) Additional Wedding resources Tags: Sacraments 0 Likes Post navigation Previous Funerals, Memorials, and Trisagions April 25, 2024 Next Baptism and Chrismation April 26, 2024 You May Also Like Our Faith Artoklasia – Blessing of the 5 Loaves Our Faith Phanouropita – Bread in Honor of the Saint Search Search for: Category Ministries News Our Faith Recent Posts News July 30, 2025 Altar Boy Outing News July 8, 2025 Scholarship Recipients 2025 Tags 50th Anniversary Video Construction of New Church Videos Goya Local News Coverage Ministries Sacraments Testimonial Videos Please Join Us For Divine Liturgy! Address 409 S. Old Coachman Road Clearwater, FL 33765 Facebook Instagram X-twitter Youtube Flickr Say Hello office@htclearwater.com (727) 799-4605 Holy Trinity Greek Orthodox Church © 2025. All Rights Reserved."
    },
    {
      "url": "https://www.holytrinitygoch.com/membership/email",
      "text": "Join Our Email List | Holy Trinity Greek Orthodox Church Holy Trinity Greek Orthodox Church Hicksville, NY About Us Parish History Parish Council Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Spiritual Resource Links History The Church Schedule Calendar PDF Calendar Mailings from Holy Trinity News Latest News Donate Now Ministries Greek School Preschool Program Adult Greek Language Classes Hellenic Dancers Sunday School Junior Choir P.T.A. GOYA JOY  - gr 6 & 7 Jr. Joy  - gr 3-5 HOPE - gr K-2 Little Angels Young Adult League (YAL) Choir Philoptochos Senior Citizens Fellowship Friends of Hellenic Music HT Parea Camp Stewardship Stewardship Letter 2024 English Commitment Form Join Our Email List Contact Contact Us Forms Festival Raffle Greek Orthodox Direct Archdiocesan District Holy Trinity Greek Orthodox Church Hicksville, NY About Us Parish History Parish Council Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Spiritual Resource Links History The Church Schedule Calendar PDF Calendar Mailings from Holy Trinity News Latest News Donate Now Ministries Greek School Preschool Program Adult Greek Language Classes Hellenic Dancers Sunday School Junior Choir P.T.A. GOYA JOY  - gr 6 & 7 Jr. Joy  - gr 3-5 HOPE - gr K-2 Little Angels Young Adult League (YAL) Choir Philoptochos Senior Citizens Fellowship Friends of Hellenic Music HT Parea Camp Stewardship Stewardship Letter 2024 English Commitment Form Join Our Email List Contact Contact Us Forms Festival Raffle Join Our Email List Stewardship Join Our Email List Receive the latest news and updates about Holy Trinity by subscribing to our email list. After filling out this form, you will receive a confirmation link to confirm your identity and prevent third parties from subscribing you to a list against your will. Simply wait for this message to arrive, then follow the instructions to confirm the subscription. Name: Email Address: Stewardship Stewardship Letter 2024 English Commitment Form Join Our Email List Holy Trinity Greek Orthodox Church 20 Field Avenue Hicksville, NY 11801 Phone: (516) 433-4522 | Email Us: office@holytrinitygoch.com About Us Our Faith Join Us in Worship Calendar Our Ministries Join Our Email List Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://www.holytrinitynr.org/",
      "text": "Holy Trinity Greek Orthodox Church About Overview News & Announcements Ministries Organizations Clergy Parish Council Library AHEPA Graduates Luncheon 2025- Gallery Our Virtual Gala - Nov 22, 2020 Email Sign Up Digital Archive Calendar Annual Gala Give Stewardship Donate Light a candle Brick Recognition Program Learn Search Holy Trinity Greek Orthodox Church About Overview News & Announcements Ministries Organizations Clergy Parish Council Library AHEPA Graduates Luncheon 2025- Gallery Our Virtual Gala - Nov 22, 2020 Email Sign Up Digital Archive Calendar Annual Gala Give Stewardship Donate Light a candle Brick Recognition Program Learn Search Holy Trinity Greek Orthodox Church Light a candle and say prayer News & Announcements SAVE THE DATE FOR OUR UPCOMING FESTIVAL! Read the August-September 2025 edition of the Trinitarian Holy Trinity merchandise store now open! Recent Aug 24, 2025 Community Food Drive Aug 24, 2025 Donations are greatly appreciated Read More → Aug 24, 2025 Aug 24, 2025 MINGO NIGHT Aug 24, 2025 Come Join the Fun! Read More → Aug 24, 2025 Aug 24, 2025 Making Strides Against Breast Cancer Walk Aug 24, 2025 Join Team “Holy Trinity Go New Ro”! Read More → Aug 24, 2025 Mar 21, 2025 Mar 21, 2025 Don’t forget to place your order ….by March 23rd! Read More → Mar 21, 2025 Mar 20, 2025 Presanctified Divine Liturgy Dedicated to Philoptochos Mar 20, 2025 Join us! Read More → Mar 20, 2025 Mar 20, 2025 Ladies Philoptochos Membership Drive Mar 20, 2025 Come join the fun! Read More → Mar 20, 2025 Mar 20, 2025 Ladies Philoptochos Go Red! Mar 20, 2025 Don’t forget to wear red! Read More → Mar 20, 2025 Mar 20, 2025 Ladies Philoptochos St. Michael's Home Visit Mar 20, 2025 Oopa! Read More → Mar 20, 2025 Dec 30, 2024 Hats & Gloves for the Homeless Dec 30, 2024 Thank you for supporting our Homeless Outreach Ministries Read More → Dec 30, 2024 Nov 16, 2024 Philoptochos Annual Candlelight Dinner Nov 16, 2024 Come join the Holiday fun! Read More → Nov 16, 2024 Nov 10, 2024 Philoptochos Decoration Day Nov 10, 2024 It’s time to decorate! Read More → Nov 10, 2024 Nov 9, 2024 Annual Candlelight Dinner - Save the date! Nov 9, 2024 Join us! Read More → Nov 9, 2024 Oct 7, 2024 Philoptochos General Membership Meeting Oct 7, 2024 Join us on Tuesday, October 15th Read More → Oct 7, 2024 Oct 7, 2024 Prosforo Baking Workshop Oct 7, 2024 Join us on Saturday, October 19th Read More → Oct 7, 2024 Sep 23, 2024 Making Strides Against Breast Cancer Walk Sep 23, 2024 Come join us and walk on October 20th! Read More → Sep 23, 2024 Jun 16, 2024 Philoptochos Prison Ministry                                                                                               Soap Drive Jun 16, 2024 Donations of Dove soap are greatly appreciated Read More → Jun 16, 2024 Jun 16, 2024 Philoptochos Thank You Dinner Jun 16, 2024 Come join the end of year fun! Read More → Jun 16, 2024 Mar 26, 2024 Philoptochos Easter Market Mar 26, 2024 Don’t forget to order your Easter goodies! Read More → Mar 26, 2024 Nov 11, 2023 Ladies Philoptochos Annual Candlelight Dinner - December 7th Nov 11, 2023 Come join the holiday fun! Read More → Nov 11, 2023 Nov 11, 2023 Hats and Gloves for the Homeless Nov 11, 2023 When & Where? December 17th in our Social Hall…join us! Read More → Nov 11, 2023 Oct 28, 2023 Celebrating OHI Day 2023 Oct 28, 2023 OHI DAY CELEBRATION SCHOOL Read More → Oct 28, 2023 Sep 25, 2023 Making Strides Against              Breast Cancer Sep 25, 2023 Philoptochos Read More → Sep 25, 2023 Sep 23, 2023 GREEK SCHOOL OPENING Sep 23, 2023 HT Greek School Read More → Sep 23, 2023 Jun 3, 2023 END-OF-YEAR CELEBRATION & GRADUATION Jun 3, 2023 HT Greek School Read More → Jun 3, 2023 Apr 29, 2023 ALL AROUND GREECE & CYPRUS Apr 29, 2023 HT Greek School Read More → Apr 29, 2023 Apr 6, 2023 Philoptochos Easter Market Apr 6, 2023 Hop on over to pick up your order! Read More → Apr 6, 2023 Mar 25, 2023 GREEK INDEPENDENCE DAY 2023 Mar 25, 2023 Greek Independence Day 2023 Read More → Mar 25, 2023 Mar 15, 2023 Easter Lambades Mar 15, 2023 Easter Market April 7th, 8th & 9th Read More → Mar 15, 2023 Mar 15, 2023 Presanctified Divine Liturgy Dedicated to Philoptochos Mar 15, 2023 Join us Wednesday, March 29th Read More → Mar 15, 2023 Feb 9, 2023 GREEK LANGUAGE DAY Feb 9, 2023 GREEK SCHOOL - GREEK LANGUAGE DAY Read More → Feb 9, 2023 View the Full News Archive » No Social Media? No problem! You can scroll through recent posts here. For those connected, be sure to follow us on instagram! @holytrinitynr and facebook at Holy Trinity Greek Orthodox Church. Archbishop Elpidophoros Contact the Clergy Want to schedule confession or have your home blessed? Perhaps you have just been asked to baptize a baby, and you're not sure what your next steps should be. Contact the clergy! They can help you with these and other requests and questions you may have. Contact Fr. Nick Contact Fr. Nick Name * First Name Last Name Phone Number * (###) ### #### Email Address Subject * Message * Thank you! Fr. Nick will be in touch with you soon. Contact fr. demetrios We have a heritage steeped in tradition: the faith of the Holy Orthodox Church and the ideals and culture of the Greek people. Through the centuries, much of the greatness of Western civilization has evolved from this proud heritage. When our parents, grandparents or great grandparents came to find a new life in America, their faith, ideals and culture gave them strength. Contribute to the Community Digital Archive Share a Memory Home Overview Ministries Organizations Library Calendar Stewardship Learn Email Sign Up Back To Top Holy Trinity Greek Orthodox Church, 10 Mill Road, New Rochelle, NY, 10804, United States (914) 235-6100 info@holytrinitynr.org Holy Trinity Greek Orthodox Church is a parish under the spiritual and ecclesiastical shepherding of His Eminence Archbishop Elpidophoros of the Greek Orthodox Archdiocese of America, under the jurisdiction of the Ecumenical Patriarch of Constantinople Address 10 Mill Road New Rochelle, NY 10804 Get Directions » Contact Telephone: (914) 235-6100 Emergency Line: (914) 505-6099 Office Manager: nancy@holytrinitynr.org / info@holytrinitynr.org Schedule of Services Weekday Services When scheduled - see calendar Orthros - 9:30 a.m. Divine Liturgy - 10:00 a.m. Sundays Orthros - 9:00 a.m. Divine Liturgy - 10:00 a.m. Fellowship and coffee in the Social Hall immediately following the Divine Services. Request an update to the Website Web Request Your Name * First Name Last Name Your Email Address * What Needs to be Updated? * Organization or Ministry Event Listing Organization or Ministry Page Please add my Ministry or Organization Please provide some details: * Thank you! We have received your request."
    },
    {
      "url": "https://holytrinitydallas.org/",
      "text": "Welcome to Our Parish Website | Holy Trinity Greek Orthodox Church Holy Trinity Greek Orthodox Church Dallas, Texas 75240-5412 Home About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Links History Holy Week The Church Orthodoxy in Texas Webcast Giving Stewardship General Donation Community Outreach Candles/Diskos Single Candles Votive Candles Diskos Donation Names For Services Organizations Organizations Adult/Senior Fellowship AHEPA/Sons of Pericles Daughters of Penelope/Maids of Athena Hellenic Cultural Society of Dallas Ministries Ministries Agape Visitations Altar Guild Bookstore Caregivers Choir College Ministries (OCF) COVID 19 Resource Center Men's Ministry Sisterhood of St. Ksenia St. Barbara's Philoptochos Welcome Ministry Austin Street Shelter North Dallas Shared Ministries North Texas Orthodox Missions IOCC Calendar News Greek School Greek School Mission & Vision Youth Program & Curriculum Adult Program Scholarship Program Ellinomatheia Certification News & Announcements Upcoming Events PTA & Job Opportunities Photo Gallery Contact Us Holy Trinity Academy Youth Ministries Sunday Church School Hope JOY GOYA Hellenic Dancers (HTHD) Young Adult Ministry Youth Choir Greek Food Festival Adult Education Adult Sunday School Weekly Bible Study Orthodoxy 101 Orthodox Life Bookstore Greek Orthodox Metropolis of Denver Holy Trinity Greek Orthodox Church Dallas, Texas 75240-5412 Home About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Links History Holy Week The Church Orthodoxy in Texas Webcast Giving Stewardship General Donation Community Outreach Candles/Diskos Single Candles Votive Candles Diskos Donation Names For Services Organizations Organizations Adult/Senior Fellowship AHEPA/Sons of Pericles Daughters of Penelope/Maids of Athena Hellenic Cultural Society of Dallas Ministries Ministries Agape Visitations Altar Guild Bookstore Caregivers Choir College Ministries (OCF) COVID 19 Resource Center Men's Ministry Sisterhood of St. Ksenia St. Barbara's Philoptochos Welcome Ministry Austin Street Shelter North Dallas Shared Ministries North Texas Orthodox Missions IOCC Calendar News Greek School Greek School Mission & Vision Youth Program & Curriculum Adult Program Scholarship Program Ellinomatheia Certification News & Announcements Upcoming Events PTA & Job Opportunities Photo Gallery Contact Us Holy Trinity Academy Youth Ministries Sunday Church School Hope JOY GOYA Hellenic Dancers (HTHD) Young Adult Ministry Youth Choir Greek Food Festival Adult Education Adult Sunday School Weekly Bible Study Orthodoxy 101 Orthodox Life Bookstore Welcome to Holy Trinity! We look forward to having you join us in prayer and fellowship. Stewardship 2025 Our 2025 campaign is underway! Learn   More Click the QR code or go to the App Store App   Store Previous Next Home Greek Food Festival 2025 is coming, Oct. 31 - Nov. 2! Join us for our 70th annual GFF! Info / Tickets Be a part of our 2025 Stewardship campaign Learn more, make a commitment, or donate to stewardship today. Give Want to know more about Orthodoxy? Find resources to help you learn more. Learn more Parish News Holy Trinity Roof Campaign Please prayerfully consider donating to this project to ensure the safety, integrity and beauty of our church building for years to come. View earlier News items. Sunday bulletin September 7, 2025 Monthly Ekfonesis September 2025 Printed copies of the Ekfonesis are available on Sundays in the church narthex. Online Community Login Username Password Keep me logged in for 30 days Forgot Password? Sign Up Worship Schedule (C) – Chapel    (S) – Sanctuary (ALS) – Arthur L. Sarris Community Center View our live streaming services on YouTube . Texts for all services are available online at the Archdiocese Digital Chant Stand . Christ is in our midst. He was, is and always shall be. Monday, September 8 —Nativity of Our Most Holy Lady the Theotokos and Ever-Virgin Mary 8:30 a.m.    Orthros (C) 9:30 a.m.    Divine Liturgy (C) Wednesday, September 10 6:00 p.m.    Paraklesis (C) Saturday, September 13 —Forefeast of the Elevation of the Holy Cross 5:00 p.m.    Great Vespers (C) Sunday, September 14 —The Elevation of the Venerable and Life-Giving Cross 8:00 a.m.    Orthros (S) 9:15 a.m.    Divine Liturgy (S) Sunday Church School immediately following Holy Communion (ALS). Adult Sunday Class following Divine Liturgy (ALS). Coffee Hour hosted by St. Barbara's Philoptochos following Divine Liturgy (ALS). Wednesday, September 17 6:00 p.m.    Paraklesis (C) Sunday, September 21 8:00 a.m.    Orthros (S) 9:15 a.m.    Divine Liturgy (S) Sunday Church School immediately following Holy Communion (ALS). Adult Sunday Class following Divine Liturgy (ALS). Coffee Hour hosted by AHEPA following Divine Liturgy (ALS). See our complete parish calendar here . Sermon Podcasts Church Office Hours Monday through Thursday: 9:00 a.m. –5:00 p.m. Friday: 9:00 a.m. –4:30 p.m. Closed Saturday & Sunday Online Chapel Saints, Feasts, and Readings for 09/11/2025 Theodora of Alexandria Today's Readings St. Paul's Letter to the Galatians 1:1-3, 20-24; 2:1-5 John 12:19-36 Saints and Feasts Commemorated Theodora of Alexandria; Euphrosynos the Cook; Demetrios & Evanthea the Martyrs & their son Demetrianos; Sergius and Herman of Valaam, Finland; Afterfeast of the Nativity of the Theotokos; Deinol the First Bishop of Bangor Visit the Online Chapel for more daily readings, hymns, a monthly calendar of saints and feasts, and more. Holy Trinity Greek Orthodox Church 13555 Hillcrest Rd, Dallas, TX 75240 Phone: (972) 991-1166 | Email Us Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/",
      "text": "About Us | Holy Trinity Greek Orthodox Church Holy Trinity Greek Orthodox Church Dallas, Texas 75240-5412 Home About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Links History Holy Week The Church Orthodoxy in Texas Webcast Giving Stewardship General Donation Community Outreach Candles/Diskos Single Candles Votive Candles Diskos Donation Names For Services Organizations Organizations Adult/Senior Fellowship AHEPA/Sons of Pericles Daughters of Penelope/Maids of Athena Hellenic Cultural Society of Dallas Ministries Ministries Agape Visitations Altar Guild Bookstore Caregivers Choir College Ministries (OCF) COVID 19 Resource Center Men's Ministry Sisterhood of St. Ksenia St. Barbara's Philoptochos Welcome Ministry Austin Street Shelter North Dallas Shared Ministries North Texas Orthodox Missions IOCC Calendar News Greek School Greek School Mission & Vision Youth Program & Curriculum Adult Program Scholarship Program Ellinomatheia Certification News & Announcements Upcoming Events PTA & Job Opportunities Photo Gallery Contact Us Holy Trinity Academy Youth Ministries Sunday Church School Hope JOY GOYA Hellenic Dancers (HTHD) Young Adult Ministry Youth Choir Greek Food Festival Adult Education Adult Sunday School Weekly Bible Study Orthodoxy 101 Orthodox Life Bookstore Greek Orthodox Metropolis of Denver Holy Trinity Greek Orthodox Church Dallas, Texas 75240-5412 Home About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Links History Holy Week The Church Orthodoxy in Texas Webcast Giving Stewardship General Donation Community Outreach Candles/Diskos Single Candles Votive Candles Diskos Donation Names For Services Organizations Organizations Adult/Senior Fellowship AHEPA/Sons of Pericles Daughters of Penelope/Maids of Athena Hellenic Cultural Society of Dallas Ministries Ministries Agape Visitations Altar Guild Bookstore Caregivers Choir College Ministries (OCF) COVID 19 Resource Center Men's Ministry Sisterhood of St. Ksenia St. Barbara's Philoptochos Welcome Ministry Austin Street Shelter North Dallas Shared Ministries North Texas Orthodox Missions IOCC Calendar News Greek School Greek School Mission & Vision Youth Program & Curriculum Adult Program Scholarship Program Ellinomatheia Certification News & Announcements Upcoming Events PTA & Job Opportunities Photo Gallery Contact Us Holy Trinity Academy Youth Ministries Sunday Church School Hope JOY GOYA Hellenic Dancers (HTHD) Young Adult Ministry Youth Choir Greek Food Festival Adult Education Adult Sunday School Weekly Bible Study Orthodoxy 101 Orthodox Life Bookstore About Our Parish Home About Us Welcome to Holy Trinity! The Holy Trinity Greek Orthodox Church, Dallas, was founded in 1915 by immigrants from Orthodox countries, predominantly Greece. Our first church home was in South Dallas at Riggs and Sanger. In the early 1950’s, the parish relocated to Swiss and Apple, where it remained until 1992. The beautiful Byzantine Church of Holy Trinity is presently located at the southwest corner of Hillcrest and Alpha in North Dallas. We are part of the Metropolis Of Denver , a metropolis of the Greek Orthodox Archdiocese of America , which is an eparchy of the Ecumenical Patriarchate of Constantinople . About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Holy Trinity Greek Orthodox Church 13555 Hillcrest Rd, Dallas, TX 75240 Phone: (972) 991-1166 | Email Us Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://www.goholytrinity.org/about/staff",
      "text": "Clergy, Staff & Parish Council | Holy Trinity Greek Orthodox Cathedral Holy Trinity Greek Orthodox Cathedral Portland, Oregon Home About Us Who We Are Feast Day Clergy, Staff & Parish Council Schedule of Services Bulletins & Newsletters Our Faith The Sacraments The Orthodox Church FAQ House of God Worship Liturgy Special Services Teachings Fasting Prayer Almsgiving Spirituality History of Orthodoxy Important Links Fathers' Articles Our Ministries Outreach Adult Education Defeat Human Trafficking Endowment Fund Ethos Bookstore Family Promise Fr Elias Stephanopoulos Memorial Fund Greek Festival Greek School I Choose Love Koukouzelis Institute Men's Ministry Mission Tanzania Water Project Music Ministry Parish Properties Development Project Philoptochos Seniors Stewardship YAL Youth Ministries General & Contact Info Altar Servers Sunday School & Little Angels GOYA - HOPE - JOY Greek School Oratorical Festival Greek Folk Dance Scholarships Vacation Church School (VCS) Calendar Orthodox Liturgical Calendar Parish Calendar ZOOM Meeting Calendar Photos Contact Donate Metropolis of San Francisco Holy Trinity Greek Orthodox Cathedral Portland, Oregon Home About Us Who We Are Feast Day Clergy, Staff & Parish Council Schedule of Services Bulletins & Newsletters Our Faith The Sacraments The Orthodox Church FAQ House of God Worship Liturgy Special Services Teachings Fasting Prayer Almsgiving Spirituality History of Orthodoxy Important Links Fathers' Articles Our Ministries Outreach Adult Education Defeat Human Trafficking Endowment Fund Ethos Bookstore Family Promise Fr Elias Stephanopoulos Memorial Fund Greek Festival Greek School I Choose Love Koukouzelis Institute Men's Ministry Mission Tanzania Water Project Music Ministry Parish Properties Development Project Philoptochos Seniors Stewardship YAL Youth Ministries General & Contact Info Altar Servers Sunday School & Little Angels GOYA - HOPE - JOY Greek School Oratorical Festival Greek Folk Dance Scholarships Vacation Church School (VCS) Calendar Orthodox Liturgical Calendar Parish Calendar ZOOM Meeting Calendar Photos Contact Donate Clergy, Staff & Parish Council About Us Clergy, Staff & Parish Council Clergy The Rev. Father Paul Paris, Presiding Priest ( Email ) Fr. Paul Thomas Paris has been the Proistamenos of the Holy Trinity Cathedral since December 1, 2014. He holds a BA from Hellenic College, an M.Div. from Holy Cross Greek Orthodox School of Theology and a Master of Arts in Youth Ministry from Gordon-Conwell Theological Seminary. Fr. Paul and his family served parishes in California and Minnesota before returning to Portland where his wife (Presbytera) Stephanie grew up and where they were married in 1995. The Rev. Father Christos Kalaitzis, Assistant Priest ( Email ) Father Christos was born and raised in the city of Serres, in central Macedonia, Greece. He received two undergraduate degrees, one in law and one in theology, as well as a Master of Arts in Mass Media and the Church at the Aristotle University of Thessaloniki. In June 2000, he was ordained to the Holy Diaconate, and in March 2001, he was ordained to the Holy Priesthood. Since then, he has served as priest of the Holy Church of the True Cross in Serres. He has been very active in his community; among other outreach, he founded and directed a church radio station, served on the board of a drug prevention center, counseled for Sunday school, and planned and coordinated charity programs. The Rev. Father Deacon David Cole, Deacon ( Email ) Father Deacon David received a BA in Slavic Languages and Social Sciences, plus a Certificate of Central-East European Studies, with minor emphasis on Byzantium and Early Church History, in 1969 from PSU. He studied his junior year at the Univ. of Zagreb, Croatia. He received an MA in Russian and Chinese History in 1976 from PSU. He holds Teaching Certificates in Social Science, English, and Russian, and taught all three subjects for 31 years at Parkrose High School. He was tonsured to the Sub-diaconate in the Russian Orthodox Church in 1978. In 1999 he was ordained a deacon in the Greek Orthodox Church and currently serves as the Cathedral Cathechist. He is married to Diakonissa Barbara and they have three grown children. The Rev. Father Deacon George Ketrenos, Deacon Music Staff Photini Downie Robinson – Protopsaltria ( Email ) Photini directs the chant program at Holy Trinity Cathedral. Tonsured by Metropolitan Gerasimos of San Francisco, she is in national demand as a cantor, ensemble artist, teacher, writer, speaker, and workshop leader. Photini is one of the core artists in the internationally acclaimed vocal ensemble Cappella Romana. She holds bachelor’s degrees in Vocal Performance and Computer Science from DePauw University (Greencastle, IN) and a Certificate in Byzantine Music from Hellenic College Holy Cross Greek Orthodox School of Theology (Brookline, MA). Photini is the Founding Director of Yphos Studio and has served on the faculty of the Liturgical Arts Academy, the Trisagion School of Byzantine Music, the Synaxis of Orthodox Women Byzantine Cantors, the Koukouzelis Institute, and the Artefact Institute. Her work has been featured by Axia Women, Ancient Faith Radio, and the GOA Metropolis of San Francisco. Photini is passionate about the intersection of liturgical music and pastoral theology, and she strives to incorporate spiritual care and theological education into her music ministry. She especially loves working with older adults and families affected by memory loss. To that end, Photini is currently pursuing a Master of Divinity at Holy Cross Seminary in Boston with the goal of becoming a Board Certified Chaplain. Jonas Williams – Choir Director Jonas Williams is the choir director at Holy Trinity Greek Orthodox Cathedral. (More to come) Parish Council - 2025 2025 Officers: President: Michael Rouches 1 st Vice President (Human Resources) : Lynn Stavrakis 2 nd Vice President (Maintenance) : Jim Lampus Treasurer: Anthony John Recording Secretary: John Maletis Corresponding Secretary: Stefanie Stavrakas Michael Freeman Michael Gianopoulos Alex Lomvardias Peter Psihogios Vasiliki Stoumbos John Young Many thanks to all of our parish council members mentioned above for their service and commitment to our Holy Trinity Cathedral! About Us Who We Are Feast Day Clergy, Staff & Parish Council Schedule of Services Bulletins & Newsletters Holy Trinity Greek Orthodox Cathedral 3131 NE Glisan Street, Portland, Oregon 97232 Phone: (503) 234-0468 | Email Us Parish Calendar Our Clergy Our Ministries Who We Are Our Faith Frequently Asked Questions Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://www.watergen.com/about-us/executive-team-board/",
      "text": "Executive Team & Board | Watergen Skip to main content area Skip to content New! Register NOW for GENNY Pre-Order > Pre-Order Home & Office GENNY High quality drinking water Know Your GENNY Better Commercial GEN-M PRO GEN-M1 GEN-L Case Studies Mobility Watergen Mobile Box Watergen ON Board – Coming Soon Technology About Us Our Vision Executive Team & Board Awards GET IN TOUCH Home › About Us › Executive Team & Board Executive Team & Board Dr. Michael Mirilashvili President It is the birthright of every person in this world to enjoy the most basic human necessity of clean and pure drinking water, regardless of geographical location, skin color, or religious belief. Mr. Mirilashvili, who serves as the president of Watergen, is a philanthropist who supports donatings to many worthy causes, improving and saving the lives of many around the world. Mr. Mirilashvili is the visionary behind Watergen’s mission to provide clean and safe drinking water to every corner of the globe. He is actively involved in the development of Watergen towards spreading its revolutionary technology all over the world. For more than 30 years, Mr. Mirilashvili has been leading and directing numerous business ventures all over the world in various fields ranging from real estate, healthcare, information technology, management, entrepreneurship, to media, agro-tech, innovation social entrepreneurship, sports, hi-tech, infrastructure and green technologies. Mr. Mirilashvili devotes his time and resources to a broad spectrum of philanthropic activities, and has been chairing several renowned organizations around the world, including chairing the positions of the President of the Euro-Asian Jewish Congress and of the Vice President of the World Jewish Congress. In October 2017, he awarded former President George Bush the Isaiah Award on behalf of Keren Hayesod-United Israel Appeal for his economic, diplomatic and security cooperation with Israel while president. Dr. Mirilashvili himself received the same award in 2015. In years past, other recipients of the Isaiah Award also included former U.S. President Bill Clinton, late Israeli Prime Minister Yitzchak Rabin, and actress and producer Sharon Stone. Dr. Michael Mirilashvili President Steve Elbaz Chief Executive Officer Over 12 years of experience in International Business Development, Innovation Units, Venture Capital and Technology Integration in Corporate and Startups (Sectors: Automotive, Energy & Bio-Technology; Companies: Schneider Electric, Alstom, Solvay, Aster Capital and SKODA AUTO part of the VW Group) Vast experience in executive general and operational management, including strategic partnerships set-up and running Investments portfolios through Corporate VCs. Holds Executive MBA from Northwestern University – Kellogg School of Management Steve Elbaz Chief Executive Officer Sharon Dulberg Chief Technology Officer and VP Innovation Leads the scientific researches, the inventions and the initiations of new technologies in the company’s industrial fields, for more than a decade. Mr. Dulberg has a vast experience in several R&D industrial companies both in practical and scientific fields. M.Sc. in Electrical Systems Engineering and B.Sc. in Mechanical Engineering. Sharon Dulberg Chief Technology Officer and VP Innovation Yarden Gonen Chief Financial Officer Yarden Gonen joined Watergen in 2022 as Chief Financial Officer responsible for accounting and controllership, financial planning and analysis, tax, internal audit, investor relations, corporate development, and treasury. Prior to Watergen, Mr. Gonen held finance leadership positions at Elbit Systems, where he served as VP Finance & Control, responsible for covering all strategic and operational financial management. Mr. Gonen brings over 20 years of experience in corporate finance for global public organizations, including shareholder value creation, corporate governance, business partnering, mergers and acquisitions, treasury and funding, investor relations, taxation, and management consulting. Mr. Gonen is a Certified Public Accountant and holds a bachelor’s degree in accounting and economics from the Hebrew University of Jerusalem. Yarden Gonen Chief Financial Officer Roni Litinetsky VP Sales Roni Litinetsky leads Watergen’s sales around the world, bringing Watergen’s drinking water from the air to people everywhere. As the VP Sales, Mr. Litinetsky manages Watergen’s Sales team and a global distribution network with clients in diverse sectors such as business, government, defense, infrastructure, beverage, etc. Mr. Litinetsky represents Watergen in complex negotiations and has brought Watergen into new markets such as Golf, Asia, LATAM and more. Prior to his current role, Mr. Litinetsky served as Chief of Staff to Watergen’s controlling stakeholder & President, and as Chief of Staff to the previous VP of Sales and Marketing with his deep knowledge of Watergen’s technology and products and rich experience in the company. Before joining Watergen, Mr. Litinetsky served in various executive leadership roles in an Israeli leading lobbying firm, representing prominent Israeli and global firms in fields of hi-tech, finance, medical and media. Mr. Litinetsky holds a B.A. in Communications, specializing in Political Marketing, from IDC, Herzliya. Roni Litinetsky VP Sales Chen Nechemia VP R&D Chen Nechemia leads the technological research and development of consumer, commercial and automotive products at Watergen. Mr. Nechemia has led the Research and Development department for over a decade, and has been responsible for most of Watergen’s product launches in recent years. Mr, Nechemia oversees the company’s team of talented engineers and developers who create the high-quality breakthrough products, using Watergen’s patented and award-winning technology. Before joining Watergen, Mr. Nechemia held various key positions in companies from the water production technology industry. He was also employed in the R&D field in the industrial, automotive, and medical industries. Chen Nechemia VP R&D Board Members Interested to learn more? Contact Us Bring Watergen’s solutions to your business or community. Connect with our team today. Book a Call Contact Us Terms of Use Privacy Policy Sitemap Technical support Standard Warranty Locations: Americas Global © Watergen . All Rights Reserved. Website by Volle' | design by clutch Close Close Accessibility by WAH Pre-Order Home & Office GENNY High quality drinking water Know Your GENNY Better Commercial GEN-M PRO GEN-M1 GEN-L Case Studies Mobility Watergen Mobile Box Watergen ON Board – Coming Soon Technology About Us Our Vision Executive Team & Board Awards GET IN TOUCH"
    },
    {
      "url": "https://www.htclearwater.com/ministries/council-of-ministries",
      "text": "Council of Ministries – Holy Trinity Greek Orthodox Church Skip to content Skip to sidebar Skip to footer Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Stewardship Form Stewardship Form Close Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Ministries Council of Ministries By christian July 10, 2024 Council of Ministries Council of Ministries Vision Our vision is to be an invaluable team of ministries that aligns all parishioners to the mission of our church. Council of Ministries Mission The continuation of our Lord and Savior Jesus Christ’ s ministry of salvation through the proclamation and teaching of the Gospel; through Baptism in the name of the Father, Son, and Holy Spirit; and through loving service to God and to mankind. The Way We Work The Council of Ministries is a team of teams, comprised of a representative from each church ministry. The Council of Ministries meets quarterly to synchronize and collaborate. The Council of Ministries has a servant leader, who facilitates Council of Ministries meetings, works to achieve the vision and mission, and is the glue that bonds the ministries. Our current leader is Adam Ulery. The Council of Ministries meets quarterly on the 3rd Thursday of February, May, August, and December. Each ministry and sub-ministry should send one representative. If someone cannot come, please send someone to represent your group. https://www.goarch.org/dormition All Ministries Sign Up Tags: Ministries 1 Like Post navigation Previous Greek School July 10, 2024 Next GOYA February 17, 2025 You May Also Like Ministries Young Adult Ministry Ministries Greek School Search Search for: Category Ministries News Our Faith Recent Posts News July 30, 2025 Altar Boy Outing News July 8, 2025 Scholarship Recipients 2025 Tags 50th Anniversary Video Construction of New Church Videos Goya Local News Coverage Ministries Sacraments Testimonial Videos Please Join Us For Divine Liturgy! Address 409 S. Old Coachman Road Clearwater, FL 33765 Facebook Instagram X-twitter Youtube Flickr Say Hello office@htclearwater.com (727) 799-4605 Holy Trinity Greek Orthodox Church © 2025. All Rights Reserved."
    },
    {
      "url": "https://www.htclearwater.com/ministries/hope-joy",
      "text": "Hope & Joy – Holy Trinity Greek Orthodox Church Skip to content Skip to sidebar Skip to footer Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Stewardship Form Stewardship Form Close Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Hope & Joy By christian August 14, 2024 0 Comments Hope & Joy Post navigation Published in Previous post: Hope & Joy July 10, 2024 Leave a comment Cancel reply Name E-mail Save my name, email, and website in this browser for the next time I comment. Comment I agree that my submitted data is being collected and stored. Search Search for: Category Ministries News Our Faith Recent Posts News July 30, 2025 Altar Boy Outing News July 8, 2025 Scholarship Recipients 2025 Tags 50th Anniversary Video Construction of New Church Videos Goya Local News Coverage Ministries Sacraments Testimonial Videos Please Join Us For Divine Liturgy! Address 409 S. Old Coachman Road Clearwater, FL 33765 Facebook Instagram X-twitter Youtube Flickr Say Hello office@htclearwater.com (727) 799-4605 Holy Trinity Greek Orthodox Church © 2025. All Rights Reserved."
    },
    {
      "url": "https://holytrinitywilmington.org/",
      "text": "Welcome - Holy Trinity Greek Othodox Cathedral Skip to content Holy Trinity Greek Othodox Cathedral Greek Orthodox Cathedral of Wilmington DE Welcome Donation About us Clergy Our Church Monthly Bulletins Father Christoforos’ Messages Metropolis of New Jersey Greek Orthodox Archdiocese of America Ecumenical Patriarchate of Constantinople Ministries Greek School Sunday School Stewardship Boines Scholarship Program Bible Study Ministry GOYA Ministry JOY & Hope Ministry St. Agape Philoptochos Society Young at Heart Festival Welcome Donation About us Clergy Our Church Monthly Bulletins Father Christoforos’ Messages Metropolis of New Jersey Greek Orthodox Archdiocese of America Ecumenical Patriarchate of Constantinople Ministries Greek School Sunday School Stewardship Boines Scholarship Program Bible Study Ministry GOYA Ministry JOY & Hope Ministry St. Agape Philoptochos Society Young at Heart Festival Heating and Air Conditioning Campaign We are reaching out to seek your generous support for a critical maintenance and repair project at our Community Center. Our current air conditioning unit, which has served us for nearly 50 years, is in urgent need of replacement. To ensure comfort for all, especially in time for our Festival in June, we must install a new system as soon as possible. The new HVAC system will consist of two rooftop units dedicated to cooling the Hall, along with three smaller units to provide heating and air conditioning for the classrooms. The total cost of this essential upgrade, including structural reinforcements and installation, is approximately $250,000 . To make this project a reality, we are asking each of our 365 parish families to consider contributing at least $500 , in addition to their annual pledge. The new units have been ordered and installation has already started. To stay on schedule, we kindly ask for your generous donation. Make A Pledge Now STEWARDSHIP Stewardship is believing in Church and wanting to support and keep her mission alive by donating your time, talents and financial support. Stewardship is a simple, equitable, and Christian way by which each parishioner (individual or family) determines their contributions for the support of the Church, proportionate to their abilities. We currently have 400 families as stewards, but the actual number of families and potential parishioners is much higher. If all our stewards gave $40 per week, our operational needs would be met. Based on our 2025 Budget, we need the amount of $2,000 a day to operate and keep our doors open. We give parishioners the opportunity to “Sponsor a Day” @ $2,000 per day. Anyone who sponsors one or more days will be listed in the bulletin as a Cathedral Day Sponsor. All other stewards are listed as Cathedral Stewards. We are grateful for any manner of giving. MAKE A DONATION Updates Father Christoforos’ Monthly Message Monthly Bulletins More News on our Facebook Our News Jul 19 2025 Supplication To The Theotokos Service Please find below the Supplication to Theotokos Service Schedule Read more Jul 19 2025 Father Christoforos’ Messages “Now everything, heaven and the earth and the nethermost regions, have all been filled with light. Let the entire creation,… Read more Jul 19 2025 Monthly Bulletins Monthly bulletins serve as a vital tool for communication, connection, and ministry within the church community, helping to facilitate worship,… Read more May 23 2025 Greek Festival 2025 June 2 to June 7, 2024 Greek Festival 2025 Our Festival is right around the corner and, as always, we… Read more May 23 2025 Archpastoral Visit of His Eminence Metropolitan Apostolos of New Jersey His Eminence Metropolitan Apostolos of New Jersey will be visiting our parish for the Monday… Read more May 22 2025 Saturday of Souls On Saturday, June 7th, we will offer special prayers for our beloved deceased of our Parish and elsewhere. It is… Read more Apr 9 2025 Our Journey to Pascha Holy Week Schedule English Προγραμμα της Μεγάλης Εβδομάδας Read more Dec 15 2024 10th Anniversary Gala All parishioners are invited to the upcoming 10th Anniversary Gala in Honor of the Ten-Year Anniversary of the Episcopal Ordination of… Read more Dec 13 2024 Metropolis of New Jersey Byzantine Music Christmas Concert His Eminence Metropolitan Apostolos of New Jersey, invites you for the upcoming Byzantine Music Christmas Concert, which will take place… Read more Dec 13 2024 Metropolis of New Jersey Vasilopita Cutting His Eminence Metropolitan Apostolos of New Jersey invites all our parishioners for the Annual Metropolis of New Jersey Vasilopita Cutting… Read more Dec 13 2024 Christmas Letter 2024 Father Christoforos greets each of you with the words of the angelic chorus, which resonate throughout our hearts during this… Read more Dec 13 2024 Christmas Tree Lighting and Open House His Eminence Metropolitan Apostolos of New Jersey invites all our parishioners for the Annual Metropolis of New Jersey Christmas Tree… Read more Sep 20 2024 90th Anniversary Gala Saturday, November 2nd, 2024Cocktails 6pmDinner and dance to follow The WaterfallThe Grand Ballroom3416 Philadelphia Pike, Claymont, DE Black Tie Invited… Read more Greek School News Upcoming school year 2024-2025 It is never too late or too early to start learning our Greek Language, culture and… Read more Sep 13 2024 GOYA News GOYA Fall Retreat Save the date! November 8-10, 2024 at Innabah Camp & Retreat Center Key Dates As our new… Read more May 1 2024 Encyclical of His Eminence Archbishop Elpidophoros of America 2024 Paschal Encyclical In English and in Greek Read more May 1 2024 Encyclical of His All-Holiness Ecumenical Patriarch Bartholomew 2024 Paschal Encyclical of His All-Holiness Ecumenical Patriarch Bartholomew  In English And in Greek Read more Feb 13 2024 A History of the Wilmington Greek Community With the 90th Anniversary of the Greek Community in Wilmington at hand, it’s a great time to reflect on our… Read more Load more Upcoming Events Flyers from our Community for Upcoming Events. Events Events DAILY READINGS, FEASTS & SAINTS View the Archdiocese’s Online Chapel , featuring daily Saints and Feasts, Gospel and Epistle readings, as well as other useful information pertaining to the day. SERVICE HOURS Sunday Orthros: 9 am Sunday Divine Liturgy: 10 am Office Hours M-F: 10 am – 3pm Metropolis of New Jersey Greek Orthodox Archdiocese of America News Ecumenical Patriarchate of Constantinople Contact Email: office@holytrinitywilmington.org Address: 808 N. Broom St. Wilmington, DE. 19806 Phone: (302) 654-4446 Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Mission Quote \"Therefore go and make disciples of all nations, baptizing them in the name of the Father and of the Son and of the Holy Spirit, and teaching them to obey everything I have commanded you. And surely I am with you always, to the very end of the age.” Matthew 28:19-20 Subscribe Sign up with your email address to receive news and updates. Name * E-mail * Submit Copyright 2024 Holy Trinity Greek Orthodox Church of Wilmington DE Metropolis of New Jersey Greek Orthodox Archdiocese of America Ecumenical Patriarchate of Constantinople Go to Top"
    },
    {
      "url": "https://www.holytrinitynr.org/about-history",
      "text": "About | Holy Trinity Greek Orthodox Church About Overview News & Announcements Ministries Organizations Clergy Parish Council Library AHEPA Graduates Luncheon 2025- Gallery Our Virtual Gala - Nov 22, 2020 Email Sign Up Digital Archive Calendar Annual Gala Give Stewardship Donate Light a candle Brick Recognition Program Learn Search Holy Trinity Greek Orthodox Church About Overview News & Announcements Ministries Organizations Clergy Parish Council Library AHEPA Graduates Luncheon 2025- Gallery Our Virtual Gala - Nov 22, 2020 Email Sign Up Digital Archive Calendar Annual Gala Give Stewardship Donate Light a candle Brick Recognition Program Learn Search About Our History We have received from our ancestors a legacy of sacred traditions: the faith of the Holy Orthodox Church and the values and culture of the Greek people. Much of the greatness of Western civilization comes from this proud heritage. When our parents or grandparents left Greece for a new life in America, their faith, ideals, and culture helped them adjust quickly. They learned a new language and found their place in a challenging world. Though mostly poor and uneducated, they took pride in their roots and were determined to succeed. Their hard work is reflected in the vitality of Holy Trinity today, which is a legacy of those who built a better future for their families. Our Clergy Featured Rev. Fr. Demetrios Balidis Assistant Priest Read More → Very Reverend Father Nicholas Anctil Proaistamenos - Presiding Priest Read More → Timeline Timeline 1922 Contilia Lazarus organizes the first group of approximately 30 families from Mt. Vernon, New Rochelle, Yonkers, and White Plains in her Mt. Vernon home to discuss the formation of a Greek Orthodox community. 1924 First group rents a storefront in Genung's Department Store and assigns the name of Holy Trinity. 1928 The \"Hellenic Orthodox Community of Westchester County, Inc.\" is incorporated. Congregation moves to the top of a garage on 5th Avenue between 2nd and 3rd Streets. Purchase of property on N. 7th Avenue as sight of future Church. It was never built on and was sold. Presumably, the proceeds were used for the purchase of the \"Wooden\" church in 1940. The precursor of today's Philoptochos Society is started. 1934 Holy Trinity moves to another rented space on 119 S. 4th Avenue. 1940 First Church building of significance is purchased: \"Wooden\" Church on N. High and Oak Street. 1942 Fire destroys \"Wooden\" Church before Easter. Holy Week services were held in the basement of the Masonic Temple in Mt. Vernon. 1942 - 1948 Congregation rents a house on Second Avenue, Services were conducted in the living room; the entryway served as the Narthex; and Sunday School and Greek School classes took place in the dining room, Fr. Papachristou lived upstairs. 1948 Holy Trinity purchased the \"White\" Church from a Protestant community. This building was considered by many to be Holy Trinity's dream facility. 1958 Building fund is organized and property is purchased on Mill Road and North Avenue in New Rochelle. 1961 AHEPA Evzone Chapter 405 is founded 1962 Ground is broken in New Rochelle for the new Community Center which also served as the Church until 1973. 1964 Doors open at the new Church and Community Center. 1971 Cornerstone is laid for the present day Church building. 1973 Archbishop lakovos blesses the new Church and the doors are opened. 1978 Holy Trinity's present Church building is consecrated. 1979 Fire severely damages the Church shortly before Christmas. Services are held in the Social Hall until repairs are completed. 1986 Approval for the expansion, remodeling and redecorating of the Social Hall is given as well as approval for the construction of a gym. 1987 Ground is broken for the new gym and renovated community center. 1990 The new, expanded, and redecorated facilities are officially opened and dedicated. 1996 Father Peter N. Kyriakos retired in June after twenty-three years of service. Father Nickolas Anctil officiated as our new pastor in July of 1996. 2001 All profits from our 2001 Festival (over $50,000) are donated to the 9/11 Fund. 2003 Holy Trinity Senior Basketball Team wins championship of COEBL. Holy Trinity celebrates its 75th \"Diamond Anniversary.\" 2008 25th Anniversary of the Holy Orders of Rev. Father Nicholas Anctil and the 80th Anniversary of the Holy Trinity Parish. Community Overview Church Office OFFICE MANAGER: Nancy Savaides CARETAKER: Claudia Perez COMMITTEES Archdiocese Liaison: Executive Board Audit: A. Prifti, J. Kohilakis Adult Religious Education:  Dn. P Baumgarth Choir Liaison: H. Morik Compensation: A. Prifti, M. Russon, G. Williams, D. Yotides Insurance: D. Kartson, H. Fotiadis, G. Hatjygeorge Dinner/Dance: H. Morik, C. Herzegovitch, M. Scaros, N. Kinas Agape: T. Dushas, M. Louros Easter Feast: S. Karagis, P. Koutsis, M. Louros Elections: N. Kinas, S. Madouros, E. Zoulis Board of Elections: TBD at General Assembly Greek School Liason: R. Nicholas, E. Zoulis Gym: C. Papademetriou, J. Resvanis Journal: A. Soukas, G. Longo-Gurr Office: G. Kondos, D. Yotides Rentals: R. Nicholas, G. Kondos Young at Heart: T. Dushas, G. Curtis Stewardship: D. Yotides, A. Soukas Youth: J. Kohilakis, T. Primis Technology: A. Prifti, M. Russon, J. Kohilakis Festival: G. Kondos, A. Benekos, D. Ventresca, T. Primis, J. Dos Santos, C. Papademetriou G. Papademetrios, M. Sirras, H. Fotiades, G. Kourakos, J. Copulos Landscaping/Maintenance: J. Karagandis, G. Williams, D. Yotides, R. Nicholas Name Day: D. Yotides, M. Scaros, D. Kartson Shed Committee: H. Fotiadis, N. Kinas, M. Sirras Kitchen: D. Yotides, E. Zoulis, S. Madouros, M. Sirras Security: G. Papademetriou, S. Madouros, E. Zoulis SCHOOLS Greek School Director: G. Konstantinou Sunday School Directors: T. Kusulas, C. Mavrovitis ORGANIZATIONS Philoptochos: A. Gerkis AHEPA: H. Fotiadis Sr. Choir: TBD Sr. Organist: TBD Jr. Choir: G. Mavrovitis Psaltis: J. Pantginis Mommy & Me: S. Rentoulis GOYA: A. Cossifos, S. Resvanis, A. Modroukas JOY: B. Kotsamanidis HOPE: R. Potiris Mr. & Mrs. Club: R. Kousteris, P. Costakos Greek Dance Troupe: E. Metaxas, N. Gregory Greek School PTA: C. Kotsamanidis Young at Heart: Lori & George Curtis Library: D. Graff, A. Eng Cub Scouts: A. Yiannakos Boy Scouts: A. Yiannakos Girl Scouts: M. Kartanos Girls Volleyball: TBD Youth Divisions Basketball A & B: K. White, G. Hritcko, S. Allen, A. Lambrakos Varsity Division Basketball: J. Resvanis JV Division Basketball: C. Papademetriou, J. Curtis, J. Resvanis                                          Loukoumi: N. Katsoris Home Overview Ministries Organizations Library Calendar Stewardship Learn Email Sign Up Back To Top Holy Trinity Greek Orthodox Church, 10 Mill Road, New Rochelle, NY, 10804, United States (914) 235-6100 info@holytrinitynr.org Holy Trinity Greek Orthodox Church is a parish under the spiritual and ecclesiastical shepherding of His Eminence Archbishop Elpidophoros of the Greek Orthodox Archdiocese of America, under the jurisdiction of the Ecumenical Patriarch of Constantinople Address 10 Mill Road New Rochelle, NY 10804 Get Directions » Contact Telephone: (914) 235-6100 Emergency Line: (914) 505-6099 Office Manager: nancy@holytrinitynr.org / info@holytrinitynr.org Schedule of Services Weekday Services When scheduled - see calendar Orthros - 9:30 a.m. Divine Liturgy - 10:00 a.m. Sundays Orthros - 9:00 a.m. Divine Liturgy - 10:00 a.m. Fellowship and coffee in the Social Hall immediately following the Divine Services. Request an update to the Website Web Request Your Name * First Name Last Name Your Email Address * What Needs to be Updated? * Organization or Ministry Event Listing Organization or Ministry Page Please add my Ministry or Organization Please provide some details: * Thank you! We have received your request."
    },
    {
      "url": "https://www.holytrinitygoch.com/contact/contact-us",
      "text": "Contact Us | Holy Trinity Greek Orthodox Church Holy Trinity Greek Orthodox Church Hicksville, NY About Us Parish History Parish Council Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Spiritual Resource Links History The Church Schedule Calendar PDF Calendar Mailings from Holy Trinity News Latest News Donate Now Ministries Greek School Preschool Program Adult Greek Language Classes Hellenic Dancers Sunday School Junior Choir P.T.A. GOYA JOY  - gr 6 & 7 Jr. Joy  - gr 3-5 HOPE - gr K-2 Little Angels Young Adult League (YAL) Choir Philoptochos Senior Citizens Fellowship Friends of Hellenic Music HT Parea Camp Stewardship Stewardship Letter 2024 English Commitment Form Join Our Email List Contact Contact Us Forms Festival Raffle Greek Orthodox Direct Archdiocesan District Holy Trinity Greek Orthodox Church Hicksville, NY About Us Parish History Parish Council Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Spiritual Resource Links History The Church Schedule Calendar PDF Calendar Mailings from Holy Trinity News Latest News Donate Now Ministries Greek School Preschool Program Adult Greek Language Classes Hellenic Dancers Sunday School Junior Choir P.T.A. GOYA JOY  - gr 6 & 7 Jr. Joy  - gr 3-5 HOPE - gr K-2 Little Angels Young Adult League (YAL) Choir Philoptochos Senior Citizens Fellowship Friends of Hellenic Music HT Parea Camp Stewardship Stewardship Letter 2024 English Commitment Form Join Our Email List Contact Contact Us Forms Festival Raffle Contact Us Contact Contact Us Priest Presbyter Father Theofanis Papantonis Address & Phone Holy Trinity Greek Orthodox Church 20 Field Avenue Hicksville, NY 11801 phone: 516.433.4522 fax: 516.433.0571 email: office@holytrinitygoch.com Driving Directions Download Map LONG ISLAND EXPRESSWAY (ROUTE 495) Exit 43S to South Oyster Bay Road. Turn Right onto Field Avenue. NORTHERN STATE PARKWAY Exit 36S to South Oyster Bay Road. Turn Right onto field Avenue. SOUTHERN STATE PARKWAY Exit 28A N towards Syosset. Merge onto Seaford Oyster Bay Expressway(Rout 135). Get off the Old Country Road exit (Exit 10). Make a left onto Old Country Road. Take Old Country Road to South Oyster Bay Road. Turn Left onto south Oyster Bay Road. Turn Right onto Field Avenue. Holy Trinity Greek Orthodox Church 20 Field Avenue Hicksville, NY 11801 Phone: (516) 433-4522 | Email Us: office@holytrinitygoch.com About Us Our Faith Join Us in Worship Calendar Our Ministries Join Our Email List Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://www.goholytrinity.org/",
      "text": "Home | Holy Trinity Greek Orthodox Cathedral Holy Trinity Greek Orthodox Cathedral Portland, Oregon Home About Us Who We Are Feast Day Clergy, Staff & Parish Council Schedule of Services Bulletins & Newsletters Our Faith The Sacraments The Orthodox Church FAQ House of God Worship Liturgy Special Services Teachings Fasting Prayer Almsgiving Spirituality History of Orthodoxy Important Links Fathers' Articles Our Ministries Outreach Adult Education Defeat Human Trafficking Endowment Fund Ethos Bookstore Family Promise Fr Elias Stephanopoulos Memorial Fund Greek Festival Greek School I Choose Love Koukouzelis Institute Men's Ministry Mission Tanzania Water Project Music Ministry Parish Properties Development Project Philoptochos Seniors Stewardship YAL Youth Ministries General & Contact Info Altar Servers Sunday School & Little Angels GOYA - HOPE - JOY Greek School Oratorical Festival Greek Folk Dance Scholarships Vacation Church School (VCS) Calendar Orthodox Liturgical Calendar Parish Calendar ZOOM Meeting Calendar Photos Contact Donate Metropolis of San Francisco Holy Trinity Greek Orthodox Cathedral Portland, Oregon Home About Us Who We Are Feast Day Clergy, Staff & Parish Council Schedule of Services Bulletins & Newsletters Our Faith The Sacraments The Orthodox Church FAQ House of God Worship Liturgy Special Services Teachings Fasting Prayer Almsgiving Spirituality History of Orthodoxy Important Links Fathers' Articles Our Ministries Outreach Adult Education Defeat Human Trafficking Endowment Fund Ethos Bookstore Family Promise Fr Elias Stephanopoulos Memorial Fund Greek Festival Greek School I Choose Love Koukouzelis Institute Men's Ministry Mission Tanzania Water Project Music Ministry Parish Properties Development Project Philoptochos Seniors Stewardship YAL Youth Ministries General & Contact Info Altar Servers Sunday School & Little Angels GOYA - HOPE - JOY Greek School Oratorical Festival Greek Folk Dance Scholarships Vacation Church School (VCS) Calendar Orthodox Liturgical Calendar Parish Calendar ZOOM Meeting Calendar Photos Contact Donate Mark your Calendar! Get ready to Dine, Dance and Celebrate! Click HERE for the latest information! HACCM presents: A Night at Athens West Step back in time to Athens West, Portland’s first Greek nightclub. In the 1960s and 1970s, the establishment was one of many Greek owned businesses in Portland’s Old Town, where it drew crowds to its live performances and energetic atmosphere. Click HERE for more information and tickets!! Previous Next Live Streaming Services YouTube Version Watch our services online! Check the Calendar for the schedule. Watch via YouTube Live Streaming Services Facebook Version Watch our services online! Check the Calendar for the schedule. Watch via Facebook! Light a Vigil Candle Get a Vigil Candle lit and prayers for loved ones at the next service. Purchase a Vigil Candle Online Giving \"Charity is indeed, a great thing, and a gift from God.\" - St. John Chrysostom Donate! New to the faith? Have questions? Learn more about Orthodox Christianity and our Faith Click here to learn more Get the recent issues of our Monthly Newsletter for all the latest news! Click here Greek Festival 2025 October 3, 4, 5, 2025 Click here for the latest info! Fathers' Articles Dormition of the Theotokos - 8/15/2025 Click here to read more Welcome to our Holy Trinity Greek Orthodox Cathedral Website! We hope this site will help you learn more about the Orthodox Christian faith and give you a glimpse into what is happening in the life of our community in worship, service, witness and education.  Holy Trinity is a vibrant parish, and we welcome you to join us whether you are a life-long member or simply interested in learning something about Orthodox Christianity. Thank you for visiting our website and we hope to welcome you to our parish as well! Please note our office hours are 9:00 am - 3:30 pm M-F. If you need to reach us, please call within those hours. Thank you. Zoom Meeting Calendar: Holy Trinity Ministries Contact the office at 503-234-0468 for the Zoom Link information ** PLEASE NOTE: ALL MEETINGS WILL REQUIRE A PASSWORD FOR ENTRY. These details will be provided accordingly.** Day & Time Ministry Group Description Day & Time Classes will resume in October 2025 Μαθήματα για την Ορθόδοξη πίστη (στα ελληνικά) Lectures on various religious matters such as holidays and church architecture, etc. All lectures are in Greek Fr. Christos Koula Fkiaras Classes will resume in October 2025 Lectures on Orthodoxy (In English) Lectures on various religious matters such as holidays and church architecture, etc. All lectures are in English Fr. Christos Koula Fkiaras Every Wednesday 1:00 pm (Zoom only) Studies in the Faith Father covers various topics of Christianity for adults. Fr. Paul Classes will resume in October 2025 Ask the Fathers / Adult Sunday School A discussion about each Sunday's Apostolic readings and any questions about the Orthodox Christian faith are answered. Fr. Christos Classes will resume in October 2025 Orthodox Catechism Class Our class is for anyone who would like to learn more about Orthodoxy whether they are already Orthodox, a catechumen or just inquiring. Fr. Christos Click here for the Sunday School Schedule and other Youth events Please note: There is plenty of space to join us in person. The statewide mask mandate has been lifted, so masks are now optional. We appreciate your understanding, cooperation and consideration of others. In the Narthex, we also have masks and hand sanitizer available if you would like to use them. Upcoming Services are listed below. Note: ALL Services are Livestreamed! Online Chapel Saints, Feasts, and Readings for 09/11/2025 Theodora of Alexandria Today's Readings St. Paul's Letter to the Galatians 1:1-3, 20-24; 2:1-5 John 12:19-36 Saints and Feasts Commemorated Theodora of Alexandria; Euphrosynos the Cook; Demetrios & Evanthea the Martyrs & their son Demetrianos; Sergius and Herman of Valaam, Finland; Afterfeast of the Nativity of the Theotokos; Deinol the First Bishop of Bangor Visit the Online Chapel for more daily readings, hymns, a monthly calendar of saints and feasts, and more. Shop the Orthodox Marketplace Share the Orthodox Christian Faith with an Iconogram Holy Trinity Greek Orthodox Cathedral 3131 NE Glisan Street, Portland, Oregon 97232 Phone: (503) 234-0468 | Email Us Parish Calendar Our Clergy Our Ministries Who We Are Our Faith Frequently Asked Questions Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://www.clearwater.org/board-of-directors/",
      "text": "Board of Directors - Hudson River Sloop Clearwater Skip to content BOOK A SAIL NOW! Subscribe to Our Newsletter JOIN or DONATE SHOP Clearwater Online Store Official Clearwater Etsy Store Clearwater Bonfire Shirts Search for: About Our Team Board of Directors Business Model Planning Job Opportunities Crew Jobs Volunteer Opportunities Latest News Clearwater Blog Generations Archive Publications & Financials Webinar Recordings Press Releases Local Sloop Clubs Press Resources Support Clearwater Join or Donate Donor Portal Planned Giving Private Charters Corporate Charters & Partnerships Sponsor a Community Sail The Sloop History & Specifications Restoring the Clearwater Virtual Sloop Tour Work/Volunteer Onboard Crew Jobs Kingston Home Port Come Sailing Public Sails Education Sails (Sailing Classroom) Private Charters Corporate Charters & Partnerships Community Sail Sponsorship Opportunities Dock Directions Volunteer Onboard Frequently Asked Questions Education The Sailing Classroom Youth Empowerment Onboard Volunteer Climate Change at Clearwater Tideline Programs In-School Programs Community Resources Fish Key Eating Hudson River Fish Digital Learning Library Activities for Students at Home Lil’ Clearwater Our River Connects Us Voices of the Valley: One Year Later Advocacy Hudson River PCB Contamination Indian Point Closure + Decommissioning Newburgh PFAS Drinking Water Contamination + Cleanup Invasive Species in the Hudson River Past Work Events Calendar Annual Folk Picnic City of Kingston Earth Fair Hike and Learn Program Spirit of the Hudson Gala Paddle For Our Hudson Search for: About Our Team Board of Directors Business Model Planning Job Opportunities Crew Jobs Volunteer Opportunities Latest News Clearwater Blog Generations Archive Publications & Financials Webinar Recordings Press Releases Local Sloop Clubs Press Resources Support Clearwater Join or Donate Donor Portal Planned Giving Private Charters Corporate Charters & Partnerships Sponsor a Community Sail The Sloop History & Specifications Restoring the Clearwater Virtual Sloop Tour Work/Volunteer Onboard Crew Jobs Kingston Home Port Come Sailing Public Sails Education Sails (Sailing Classroom) Private Charters Corporate Charters & Partnerships Community Sail Sponsorship Opportunities Dock Directions Volunteer Onboard Frequently Asked Questions Education The Sailing Classroom Youth Empowerment Onboard Volunteer Climate Change at Clearwater Tideline Programs In-School Programs Community Resources Fish Key Eating Hudson River Fish Digital Learning Library Activities for Students at Home Lil’ Clearwater Our River Connects Us Voices of the Valley: One Year Later Advocacy Hudson River PCB Contamination Indian Point Closure + Decommissioning Newburgh PFAS Drinking Water Contamination + Cleanup Invasive Species in the Hudson River Past Work Events Calendar Annual Folk Picnic City of Kingston Earth Fair Hike and Learn Program Spirit of the Hudson Gala Paddle For Our Hudson Search for: Board of Directors Board of Directors Jen Benson 2025-09-09T14:20:24-04:00 Board Meeting Schedule 2024-2025 Clearwater Board of Directors meetings are currently virtual on Zoom, and are held from 7:00 PM to 9:00 PM with the exception of the Annual Meeting unless otherwise indicated. All board meetings are open to Clearwater members. Clearwater’s Fiscal Year starts December 1 and ends November 30. Downloadable List of Board Meetings for 2024-2025 Thursday, November 14, 2024 Agenda for Nov. Meeting Wednesday, December 18, 2024 Tuesday, January 14, 2025 Agenda for January meeting Thursday, March 6, 2025 View Meeting Notes April 2025 – No meeting Spirit of the Hudson Gala at The Garrison, Sunday, April 6, 2025 Thursday, May 8, 2025 Tuesday, July 15, 2025 Tuesday, September 9, 2025 View agenda Zoom Link: https://us06web.zoom.us/j/87314075717?pwd=JIx1sQ5Kq13IlljMy0Wa99wLi565wG.1 Meeting ID: 873 1407 5717 Passcode: 258157 Sunday, October 5, 2025 – 10:00 AM-5:00 PM Annual Meeting & Board Retreat (in-person) Click to view the board meeting minutes archive Clearwater’s Board Manual (includes Charter, Bylaws, Policies, and Statement of Values) Clearwater board members play key creative roles in fundraising, event planning, program development, financial management, public relations, and project management, and serve as spokespersons and ambassadors for Clearwater. The Clearwater Annual Meeting provides members with the opportunity to participate in the vital function of electing board candidates into office. Clearwater members and the public may communicate with the Board at any time: board@clearwater.org . Communications will be acknowledged and responded to, when appropriate. Strategic Plan In spring 2020, an ad hoc advisory committee of staff, board, members, and en vironmental leaders set out to gather feedback regarding Clearwater’s role i n Hudson River environmentalism, clarify and update the organization’s vision for the 21st century and lay out a strategic plan to achieve that vision and promote our evolution into a more sustainable organization. With help from the Hudson River Foundation and the Support Center for Nonprofit Management, the planning effort identified strengths, weaknesses, opportunities, and threats to be considered in working toward that outcome. The committee solicited input via a community survey, a carefully curated roster of interviews, retreats, and an organizational assessment tool. Data gathered were both quantitative and qualitative, including information on member demographics, entry points, and ongoing participation. Findings confirmed the sloop as the organization’s core strength, education and advocacy as the most important and successful of our programs, and music as a unique and central means of promoting our mission and engaging our members and Hudson Valley communities. Based on the findings, the committee identified seven priorities necessary to bring Clearwater stability, maintain its relevancy, and fulfill its mission to the highest potential. Each priority includes goals aimed at fulfilling the priorities and specific action items needed to achieve them over three years. These priorities, goals, and actions constitute a strategic plan intended to establish a path to stability and sustainability for Clearwater over the next three years. The plan, approved by Clearwater’s board of directors in December 2021, calls for the organization to focus and then act, all the while operating in adherence to the goals and management practices we have set for ourselves. Otherwise, we risk maintaining the status quo of being spread too thin, and doing many things shoddily instead of a few things with excellence. If we can do this, Clearwater will not only survive but prosper in years to come. Read Clearwater’s strategic plan Clearwater Board Members Samantha Hicks, President Third term, expires October 2027 Email Samantha: president@clearwater.org Samantha, AKA Captain Sam, started working on the sloop as an apprentice in 1994 at the very beginning of what would become a 17-year career in sail education. She worked her way up through the ranks on numerous vessels, including the Schooner Ernestina out of New Bedford, sailing as chief mate for the maiden voyage of the brigantine Irving Johnson, and sailing to both Europe and Asia aboard the Pride of Baltimore II. After sailing as captain of the Sloop from 2000 to 2005, she signed on as chief mate for the Barque Picton Castle’s fourth World Voyage, circumnavigating the globe. Arthur Jones, Vice-President Third term, expires October 2027 Email Arthur: vicepresident@clearwater.org A lifelong resident of the Hudson Valley, Arthur Jones has been a Clearwater member and perennial sloop volunteer for 22 years. Arthur is a dedicated environmentalist, an avid sailor and an award-winning filmmaker who has made several short films in support of Clearwater, The NY Democracy Project and other local non-profits. Arthur is serving his second term as a board member but has been involved with Clearwater most of his life. He currently lives in Jersey City and works in New York as a full-time television professional, specializing in the management of large and complex projects. As a board member, Arthur offers a unique blend of digital media expertise, love of the Hudson River and a passionate commitment to Social and Environmental Justice. Tom Murphy, Treasurer First term, expires October 2025 Email Tom: treasurer@clearwater.org Tom Murphy is a Hudson Valley native – he grew up in Newburgh, attended Newburgh schools and Orange County Community College. He has been a banker since the early 1980s when he got his start at a small bank in Newburgh. He is currently a Senior Vice President at M&T Bank, running their Government Banking Division here in the Hudson Valley and Long Island. Tom serves on M&T Bank’s local Charitable Foundation Board, providing funding to over 100 non-profit organizations in Dutchess, Ulster, Sullivan, and Orange counties. He is currently on the Board of the Community Foundations of the Hudson Valley and Chair of their Ulster Board and previously served on the boards of the Bardavon Opera House, Mohonk Preserve, and many other community organizations. While on the Mohonk Preserve Board, Tom was Treasurer and a member of the Executive Committee for many years and also spent time on their Environmental Education and Finance and Development Committees. Tom lives in Kingston, NY with his wife Ellen, their two college-age boys, two dogs, two cats, and five chickens. He is an avid reader, skier, hiker and fisherman. Adenike Bamgboye First Term, expires October 2026 Email Adenike: secretary@clearwater.org A seasoned administrator and expert in public procurement, small business, and vendor management, as well as process reengineering. In her career of over 20 years, Adenike has served in various capacities for over a decade at the City of New York, including contracting, environmental health and safety, and quality assurance. She pioneered a number of initiatives for small business contracting opportunities, not limited to MWBE participation and outreach. Adenike is passionate about environmental conservation through policy-making. In one of her past projects, she unraveled the impact of single-use plastic carry-out bags on environmental footprints, as a contribution to a NYC legislation for its ban. Adenike developed health and safety programs for four bureaus at the NYC Department of Environmental Protection. She currently lives in Elmont and consults for the NYC DOE and serves as Assistant Deputy Comptroller for Nassau County. At-Large Board Members Joan Gaylord Third term, expires October 2026 Joan Gaylord currently serves on Clearwater’s Executive Committee and Chairs its Communications Committee. A correspondent for “The Christian Science Monitor,” she previously headed press relations at Pace Law School, the country’s leading environmental law program. A photographer and graphic designer, as well, Joan has had credits in “The Wall Street Journal” and the “CS Monitor” and served as calligrapher for the United Nations. She is an Associate Fellow at Yale University where she is the advisor to the Undergraduate Jazz Collective. Neil Gordon Third term, expires October 2025 Neil is starting his third three-year term on Clearwater’s board. He has also served for the last five years as Clearwater’s treasurer and Chair of the Finance Committee. Neil is a longtime onboard Clearwater volunteer and has great passion and regard for the Sloop and its crew. Neil is politically active in local government and has served on a number of not-for-profit boards, including the Andover (MA) Historical Society, where he also served as Treasurer. Neil was raised in the Bronx and Yonkers and currently lives in Brookline, MA. His mother, children, and grandchildren live in New York City. Steve Stanne Second term, expires October 2026 Steve Stanne has been teaching about the Hudson since 1980 when he stepped aboard Clearwater as education director, a position he held for 19 years. His time with the organization also included two stints as acting executive director. From 1999 until retirement in 2017 he was employed by Cornell University in partnership with NYSDEC to direct education efforts of the agency’s Hudson River Estuary Program. Over his career Steve designed signature river education programs including Clearwater’s Classroom of the Waves and the Estuary Program’s Day in the Life of the Hudson, as well as coordinating placement of the familiar blue and white sturgeon signs at highway crossings of Hudson River tributaries. He is the principal author of The Hudson: An Illustrated Guide to the Living River, published by the Rutgers University Press, and the Estuary Program’s State of the Hudson reports in 2009 and 2015. Steve is also a musician, performing with the Hudson River Sloop Singers while at Clearwater, and with the folk quintet Betty and the Baby Boomers, which earned the Hudson River Environmental Society’s 2016 “Outstanding Environmental Communicator” award. Directors Sarah Armour Second term, expires October 2027 Born and raised in the Hudson Valley, Sarah has been lucky enough to be part of the Clearwater community since before she was born. She grew up volunteering at the festival, singing with Clearwater’s Power of Song Program, and working on the Sloop in a number of capacities, including as a volunteer, educator, and first mate. Sarah has spent the last ten years working in environmental education, sail training, and experiential learning and she credits Clearwater with sending her along that path. Sarah works at Mystic Seaport Museum as the Captain of the classic Schooner Brilliant , running one of the oldest Youth Sail Training programs in the country. Sarah has a degree in Earth Systems Science from Cornell University where she focused on applied ecology, sustainable agriculture, and environmental education. Peter Capek Third term, expires October 2026 Peter has been concerned with environmental issues for most of his life but has taken a more active role since his retirement from IBM Research.  The increasing awareness and seriousness of the climate change issue has led him to increase his involvement with Clearwater with the goal of increasing public awareness and response to the crisis. He has been active as a volunteer at Revival for more than 35 years, where he has managed (jointly with his wife) the T-shirt sales, a substantial fund-raiser for the event,  and been active on the Revival Planning Committee.  Peter first met Pete Seeger at the 1964 Newport Folk Festival and has admired Pete’s music and life accomplishments for many years. Peter’s work experience involved research in Computer Science.  He has experience serving on a public library board for 14 years, including several as its President, and on a local tax assessment review board. Josh Clyburn First Term, expires October 2026 As an accomplished utility professional, Josh brings extensive expertise in digital transformation, product development, and data analytics. He found his love of the sea and naval engineering during his eight-year enlistment in the U.S. Navy, while a part of the Nuclear Program. During his time at NYSERDA, he successfully designed, launched, and managed the $75M Real-Time Energy Management program. As Manager at the New York Power Authority, he orchestrated energy solution projects and strategic marketing initiatives in clean energy technologies. His educational portfolio includes an MBA in Finance, an MS in Information Systems, an MS in Environmental Management, and a BS in Nuclear Engineering. Josh served as a voluntary crew on the Clearwater Sloop and was quickly reminded of his love of the water, and passion for environmental education through community engagement. Josh lives in Brooklyn, NY, with his wonderful wife of 10 years and two fantastic kids. Dr. Stuart Findlay First Term, expires October 2027 Dr. Stuart Findlay has worked on the Hudson River for over 30 years, researching sensitive wetlands, shoreline restoration, and conducting environmental monitoring critical to helping guide the river’s recovery. He aims to identify impending problems and devise suitable solutions in streams, wetlands, and the Hudson River, and is committed to carrying science from discovery to dissemination and is actively engaged with a wide array of management, outreach, and educational programs. Peter Gregory First Term, expires October 2027 Peter is a financial advisor at RBC Wealth Management in Albany and Saratoga, NY, where he has worked since 2007. Peter leads a team of financial Advisors who provide comprehensive management services to families, business owners, professionals, and non-profit organizations. Peter is currently a board member and the Treasurer of the SUNY Schenectady Foundation and was previously a board member of The Estate Planning Council of Eastern NY, Make-A-Wish Foundation of the Capital Region, Better Neighborhoods, Inc., and the Sunnyview Hospital Foundation. He was also President of the Sunnyview Hospital Foundation board for four years. He is a native of Schenectady, and for the past 25 years has lived in Halfmoon, NY, with his wife Kimberly, and two children. Gareth Hougham, Ph.D (Chemistry) Second term, expires October 2026 Gareth is president of Hudson Valley Arts and Science, a 501(c)(3) nonprofit dedicated to improving the water quality, fish migration, recreation potential and public access to the Hudson River, the Long Island Sound, and their small, neglected tributaries. He is also an adjunct professor of environmental science at SUNY Purchase and a member of the Town of Ossining Planning Board. When not working, Gareth can be found canoeing and biking or as pictured here, helping with eel counts. Aaron Mair Third term, expires October 2026 Aaron Mair of Schenectady, New York, is an epidemiological-spatial analyst with the New York State Department of Health and is President of the Sierra Club’s Board of Directors. Aaron’s experience includes more than three decades of environmental activism and over 25 years as a Sierra Club volunteer leader, where he has worked diligently for environmental justice. Jennifer McMillan Second term, expires October 2027 Jennifer is a lifelong, passionate advocate for environmental issues, and has lived in Wappingers Falls for 20 years. She is an adjunct professor at Marist College and Dutchess Community College, works as a freelance editor, including for Clearwater, has volunteered in the Clearwater office, and, with her two children, volunteers at Revivals and other Clearwater events. She is an artist and herbalist, teaches herbalism, art classes, meditation, Reiki, and has led meditation classes and held Reiki sessions for Clearwater employees. As a current board member with East Fishkill Historical Society, she helps organize events and fundraisers and holds classes specifically directed towards public education and fundraising for the organization. Liam Purvis First term, expires October 2027 Liam is a lifelong resident and recreator in the Hudson Valley. He has fond memories of learning about river life aboard the Clearwater as a child and performed at the Clearwater festival multiple times with the Vanaver Caravan Dance Company. Liam has over a decade of professional experience teaching outdoor education and facilitating experiences that connect individuals with the environment immediately around them: including stints at The Riekes Center, Wild Earth, and Vermont Wilderness School. Liam is an avid whitewater kayaker who loves fishing in the Hudson. This passion for clean water has inspired him to volunteer with Riverkeeper’s water sampling program for the last 4 years. Jeremy Rainer Third term, expires October 2026 Jeremy Rainer is a sound engineer and producer at WFUV FM in New York. His family fostered in him a deep love and respect for Pete Seeger and the principles he stood for. He’s been going to the Revival all his life and has been a Festival volunteer for twenty years. When he was seventeen years old, Jeremy invited Pete to his high school to play a concert, and since that time, he saw Pete whenever and wherever he performed. In his work at WFUV, Jeremy produces “Woody’s Children” with Bob Sherman, and once was able to set up an interview with Pete for a birthday special. In addition to maintaining a relationship with Pete himself, Jeremy has fostered friendships with many of Pete’s own friends and fellow Clearwater artists, including David Amram, Tom Chapin, and Noel Paul Stookey. When Toshi Seeger passed away in 2013, Jeremy was honored to mix sound for her memorial concert in NYC. Performers not only included Pete, but also Judy Collins, Arlo Guthrie, Guy Davis, Fred Hellerman, and Peter Yarrow. After Pete himself passed in 2014, Jeremy co-produced “Seeger Fest,” a five-day festival in memory of Pete and Toshi. Jeremy was the technical manager for the festival, which encompassed making stage plots for numerous artists, formulating soundcheck and run-of-show schedules, and stage-managing the five concerts. Jeremy’s commitment and devotion both to Pete’s legacy and to Clearwater run deep and wide, and he has enjoyed bringing that passion to the Clearwater board of directors. Daniel Riesel Second term, expires October 2027 Daniel Riesel was raised in Croton on Hudson, but presently resides in Manhattan and Arlington, Vermont. His love of the outdoors and the Hudson Valley led him to be a Clearwater Board member for over a decade during the 70s and 80s–and also served on the boat crew. Daniel has been practicing law for 60 years, and since 1970, his practice has focused on environmental litigation. He is a founder of the first Environmental Protection Unit in the Department of Justice. During the period 1970 to 1973, the Unit successfully prosecuted over 30 Hudson River polluters. In 1973, he entered private practice and joined the country’s oldest environmental law firm, (now) Sive, Paget & Riesel, P.C. He has taught environmental law and litigation at Cardozo and Columbia Law Schools for over a decade, and chairs the American Law Institute annual courses on environmental law and environmental litigation. Daniel is a Fellow of the American College of Environmental Lawyers. Gabriella Spielberg First Term, Expires October 2026 Gabbie Spielberg is a native New Yorker, lifelong Clearwater kid, and recent graduate of Oberlin College, where she studied theater, politics, and film. She has experience as a board member of the Oberlin Student Cooperative Association, a fully student-led multimillion-dollar 501(c)3 dedicated to cooperatively providing housing and dining for students. Clearwater was always the highlight of her summer and an inspiration to her activism, which now informs her goals of breathing new life into the in-person aspects of the organization to create stronger networks of community organizing and open avenues to new forms of activism. She understands the needs of young activists who came of age in overlapping global crises and believes that the Clearwater organization has the tools to build intergenerational coalitions among advocates for environmental and social justice. Larry Rothbart Second term, expires October 2027 Lawrence (Larry) Rothbart has lived in Brooklyn for over 40 years but is a lifelong New Yorker. He is a lawyer-mediator-collaborative Professional focused on Family Law issues. His first memory of the Clearwater was soon after it first sailed into New York harbor going to the old, gritty South Street as a child. He had to go through a hole in the fence for the sail. Fast forward a bit. Larry became a member of Clearwater in his own right as a young adult when he returned to New York after college in Boston (where he worked on environmental issues including Seabrook). Once Larry had children, they came with him on Clearwater sails from the time they were babes in arms. They all were volunteers together on the boat for years. Eventually, they became “spare parts” especially when the boat was near New York Harbor or Pumpkin Sails. Larry’s hope is to keep the focus on the boat as a vehicle to encourage environmental education, environment action, cultural and historical education, sailing experiences, music, and a little fun; throughout the length of the Hudson. Sarah Underhill Second term, expires October 2025 Sarah Underhill’s love of the Hudson Valley began in the 1980s when she worked on the “Clearwater” as an environmental educator, activist, and sailor. A singer and song collector, her love of music and the arts combines with her dedication to community building. Sarah serves on the Town of Wawarsing’s Environmental Commission and on the boards of Mohonk Consultations, the SeedSong Farm Center, the Rondout Creek Watershed Alliance, Ulster County Environmental Management Council, and Slow Food Hudson Valley. She has worked as an RN since 1998 and is a member of the Ethics Committee for Health Alliance Hospitals. Her Quaker heritage, with its emphasis on justice and mercy, informs her work. Julia Wilson First term, expires October 2025 Julia became involved in Clearwater as a high school boat and office intern in 1991. During college at Cornell, where she majored in premed studies and environmental science, Julia continued to intern on the sloop, and after graduating, decided to spend a year or two sailing on Clearwater and other boats before grad school. By the time she started graduate study four years later, she had been the sloop’s engineer, deckhand, bosun, second mate, and educator. After earning a doctorate of chiropractic in Portland, OR, Julia returned to the Hudson Valley and Clearwater as mate and relief captain. That led to her becoming captain, a position she held until a week before the birth of her first child in 2008. Since then, Julia has done occasional relief work, but mostly has been working hard at raising two kids and running a thriving chiropractic office and business in Kingston and Hudson. She is looking forward to bringing her in-depth knowledge of the many facets of Clearwater together with her business knowledge to help bring Clearwater to the next level. Hudson River Sloop Clearwater 724 Wolcott Ave. - Beacon, NY 12508 (845) 265 8080 - Office@Clearwater.org Posts Feed || Privacy Policy Join Our Email List Email: Search for: Copyright © Hudson River Sloop Clearwater - All Rights Reserved Page load link Go to Top"
    },
    {
      "url": "https://holytrinitydallas.org/about-us/contact-us",
      "text": "Contact Us | Holy Trinity Greek Orthodox Church Holy Trinity Greek Orthodox Church Dallas, Texas 75240-5412 Home About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Links History Holy Week The Church Orthodoxy in Texas Webcast Giving Stewardship General Donation Community Outreach Candles/Diskos Single Candles Votive Candles Diskos Donation Names For Services Organizations Organizations Adult/Senior Fellowship AHEPA/Sons of Pericles Daughters of Penelope/Maids of Athena Hellenic Cultural Society of Dallas Ministries Ministries Agape Visitations Altar Guild Bookstore Caregivers Choir College Ministries (OCF) COVID 19 Resource Center Men's Ministry Sisterhood of St. Ksenia St. Barbara's Philoptochos Welcome Ministry Austin Street Shelter North Dallas Shared Ministries North Texas Orthodox Missions IOCC Calendar News Greek School Greek School Mission & Vision Youth Program & Curriculum Adult Program Scholarship Program Ellinomatheia Certification News & Announcements Upcoming Events PTA & Job Opportunities Photo Gallery Contact Us Holy Trinity Academy Youth Ministries Sunday Church School Hope JOY GOYA Hellenic Dancers (HTHD) Young Adult Ministry Youth Choir Greek Food Festival Adult Education Adult Sunday School Weekly Bible Study Orthodoxy 101 Orthodox Life Bookstore Greek Orthodox Metropolis of Denver Holy Trinity Greek Orthodox Church Dallas, Texas 75240-5412 Home About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Our Faith The Orthodox Church House of God Worship Liturgy The Sacraments Special Services Teachings Spirituality Links History Holy Week The Church Orthodoxy in Texas Webcast Giving Stewardship General Donation Community Outreach Candles/Diskos Single Candles Votive Candles Diskos Donation Names For Services Organizations Organizations Adult/Senior Fellowship AHEPA/Sons of Pericles Daughters of Penelope/Maids of Athena Hellenic Cultural Society of Dallas Ministries Ministries Agape Visitations Altar Guild Bookstore Caregivers Choir College Ministries (OCF) COVID 19 Resource Center Men's Ministry Sisterhood of St. Ksenia St. Barbara's Philoptochos Welcome Ministry Austin Street Shelter North Dallas Shared Ministries North Texas Orthodox Missions IOCC Calendar News Greek School Greek School Mission & Vision Youth Program & Curriculum Adult Program Scholarship Program Ellinomatheia Certification News & Announcements Upcoming Events PTA & Job Opportunities Photo Gallery Contact Us Holy Trinity Academy Youth Ministries Sunday Church School Hope JOY GOYA Hellenic Dancers (HTHD) Young Adult Ministry Youth Choir Greek Food Festival Adult Education Adult Sunday School Weekly Bible Study Orthodoxy 101 Orthodox Life Bookstore Contact Us Home About Us Contact Us Holy Trinity Greek Orthodox Church 13555 Hillcrest Road Dallas, TX 75240-5412 Driving Directions» Phone: (972) 991-1166 htgoc@holytrinitydallas.org Reverend Protopresbyter Mark Pakes - Presiding Priest frmark@holytrinitydallas.org Assistant Priest - Rev. Fr. William Damaskos frwilliam@holytrinitydallas.org Assistant Priest - Rev. Fr. Anargyros Stakias franargyros@holytrinitydallas.org Reverend Deacon Athanasios Sharpley deaconclint11@gmail.com Basil P. Xeros, Neokoros bxeros@holytrinitydallas.org Parish Council parishcouncil@holytrinitydallas.org Tom Clark, Interim Church Administrator tclark@holytrinitydallas. org Presbytera Katie Stakias, Youth Director youthministry@holytrinitydallas.org Torye Morris, Facilities Manager tmorris@holytrinitydallas.org Jen Simerson, Financial Assistant jsimerson@holytrinitydallas. org Laura Groome, Administrative Assistant lgroome@holytrinitydallas.org Holy Trinity Bookstore ht-bookstore@holytrinitydallas.org About Us About Us Patron Saint Clergy Parish Council Contact Us Member Search Iconography Project Orthodox Christian Mental Health Providers Photo Gallery Mission and Vision Holy Trinity Greek Orthodox Church 13555 Hillcrest Rd, Dallas, TX 75240 Phone: (972) 991-1166 | Email Us Powered by the Department of Internet Ministries of the Greek Orthodox Archdiocese of America"
    },
    {
      "url": "https://www.htclearwater.com/sacraments/phanouropita",
      "text": "Phanouropita – Bread in Honor of the Saint – Holy Trinity Greek Orthodox Church Skip to content Skip to sidebar Skip to footer Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Stewardship Form Stewardship Form Close Home Explore Our Church in 3D Calendar About Us Our Faith Donations Stewardship Light a Candle GOYA In Memory Of Endowment Fund Leave a Legacy Donate Appreciated Securities Hospitality of Abraham Fund Tommy P. Memorial Golf Tournament Matheos Hall Media Galleries News Videos Ministries FAQs GreekFest Iconography Website Contact Our Faith Phanouropita – Bread in Honor of the Saint By christian April 25, 2024 Orthodox faithful have a variety of traditions when it comes to thanking a saint who has interceded or taken action in answering a prayer. Some faithful offer monetary donation to churches named after the saint. Some make journeys across the globe to venerate the relics of the saint. Others will name their children after the saint. But when they’ve lost something and prayed to St. Phanourios for intercession and prayed for his mother, they make a cake and share it among their friends as a testimony or thanks for the answered prayer. Source and Recipe from Orthodox Christian Network . To make arrangements for Phanouropita to be offered during one of the divine services contact the parish office Monday-Friday 10:00am-4:00pm at (727)-799-4605 or e-mail us at office@htclearwater.com . Tags: Sacraments 0 Likes Post navigation Previous Wednesday Night Basketball July 10, 2023 Next Artoklasia – Blessing of the 5 Loaves April 25, 2024 You May Also Like Our Faith Weddings Our Faith Funerals, Memorials, and Trisagions Search Search for: Category Ministries News Our Faith Recent Posts News July 30, 2025 Altar Boy Outing News July 8, 2025 Scholarship Recipients 2025 Tags 50th Anniversary Video Construction of New Church Videos Goya Local News Coverage Ministries Sacraments Testimonial Videos Please Join Us For Divine Liturgy! Address 409 S. Old Coachman Road Clearwater, FL 33765 Facebook Instagram X-twitter Youtube Flickr Say Hello office@htclearwater.com (727) 799-4605 Holy Trinity Greek Orthodox Church © 2025. All Rights Reserved."
    }
  ]
}