{
  "fuentes": [
    {
      "url": "https://www.cvent.com/venues/orlando/hotel/hyatt-regency-orlando/venue-37cf584e-a90e-4348-b0d7-9291046c0b78",
      "email": "hro-sales@hyatt.com"
    },
    {
      "url": "https://www.biography.com/actors/dwayne-johnson",
      "email": "editor@biography.com"
    },
    {
      "url": "https://www.orlandorockgravelanddirt.com/",
      "email": "info@orlandorockgravelanddirt.com"
    },
    {
      "url": "https://in.linkedin.com/company/hospice-rocks",
      "email": "contact@nursingrocksconcerts.com"
    },
    {
      "url": "https://in.linkedin.com/company/hospice-rocks",
      "email": "ncontact@nursingrocksconcerts.com"
    },
    {
      "url": "https://lawrocks.org/2023",
      "email": "info@lawrocks.org"
    },
    {
      "url": "https://www.rockofftrade.com/category/99/Contact-Us.html",
      "email": "sales@rockofftrade.com"
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "email": "asset.logo-horz@1x.png"
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "email": "asset.logo-horz@2x.png"
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "email": "media@schoolofrock.com"
    },
    {
      "url": "https://adventurerocks.in/contact-us",
      "email": "info@adventurerocks.in"
    },
    {
      "url": "https://www.biography.com/actors/chris-rock",
      "email": "colin.mcevoy@hearst.com"
    },
    {
      "url": "https://www.biography.com/actors/chris-rock",
      "email": "editor@biography.com"
    },
    {
      "url": "https://www.therocks.com/contact-us",
      "email": "contactustherocks@property.nsw.gov.au"
    },
    {
      "url": "https://www.therocks.com/contact-us",
      "email": "media@dpie.nsw.gov.au"
    },
    {
      "url": "https://www.therocks.com/contact-us",
      "email": "pag.therocksmarket@property.nsw.gov.au"
    }
  ],
  "mails": [
    "asset.logo-horz@1x.png",
    "asset.logo-horz@2x.png",
    "colin.mcevoy@hearst.com",
    "contact@nursingrocksconcerts.com",
    "contactustherocks@property.nsw.gov.au",
    "editor@biography.com",
    "hro-sales@hyatt.com",
    "info@adventurerocks.in",
    "info@lawrocks.org",
    "info@orlandorockgravelanddirt.com",
    "media@dpie.nsw.gov.au",
    "media@schoolofrock.com",
    "ncontact@nursingrocksconcerts.com",
    "pag.therocksmarket@property.nsw.gov.au",
    "sales@rockofftrade.com"
  ],
  "nombre_sitio": "hyatt.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cvent.com/venues/orlando/hotel/hyatt-regency-orlando/venue-37cf584e-a90e-4348-b0d7-9291046c0b78",
      "text": "Hyatt Regency Orlando | Cvent Venues Promotions Destinations Discover Luxury New Venue list Venue list Venue list Venue list Settings Settings Sign up Log in Cvent Venues Hyatt Regency Orlando Welcome to the Cvent Supplier Network (CSN)! Here’s how to get started: Search Tell us about your event, find venues, and add them to your venue list. Send request Review your selected venues and send request Booking Compare proposals and book your ideal event space Learn more Find venues Hyatt Regency Orlando 9801 International Drive, Orlando, FL, USA, 32819 | Contact us | Sustainability certified Videos Videos Videos Videos Videos View gallery (50) Videos View gallery (53) Overview Meeting Space Guest Rooms Location More FAQs Promotions View all (1) More Rooms, More Rewards Multiple dates available Promotional rates Claim promotion About us Hyatt Regency Orlando offers an ideal location in the heart of the city's entertainment district, just 15 minutes from Orlando International Airport. Make yourself at home in our spacious guestrooms, experience exciting local attractions, or unwind at one of our spectacular pools between meetings. Enjoy both productivity and relaxation in our sophisticated oasis.\r\n\r\nFor inquiries, please contact our sales team at \r\nT +1 407 345 4446\r\nF +1 407 351 3501\r\nE HRO-Sales@hyatt.com Venue Details Chain Hyatt Hotels Brand Hyatt Regency Built 1986 Renovated 2019 Total meeting space 335,000 sq. ft. Guest Rooms 1,641 Venue type Hotel Industry Ratings AAA Northstar Awards Cvent awards Industry awards 2024 CVENT TOP 25 HOTELS IN THE U.S. AND #2 MEETINGS HOTEL IN FLORIDA\r\nAAA Four Diamond Award\r\nTripAdvisor Travelers' Choice Award 2024 Venue Highlights Cvent's 2025 Top Meeting Hotels See Cvent's full list of 2025 Top Meeting Hotels Learn more Cvent's 2024 Top Meeting Hotels See Cvent's full list of 2024 Top Meeting Hotels Learn more Cvent's 2023 Top Meeting Hotels See Cvent's full list of 2023 Top Meeting Hotels Learn more Amenities Room features and guest services Calls (local) Calls (toll-free) Concierge services Internet access Laundry service Luggage storage Room service View (urban) Voicemail box Facilities Onsite catering Onsite gift shop Onsite restaurant Onsite security Pet friendly Rental car service Space (outdoor) Wheelchair accessible Business services AV capabilities Business center Video conference VIP services Recreational activities Health club Outdoor pool Spa or salon Tennis courts Whirlpool Transportation Airport shuttle Bus Taxi Equipment Dance floor Loading dock Piano Portable heaters Portable walls Staging area Room features and guest services Calls (local) Calls (toll-free) Concierge services Internet access Laundry service Luggage storage Room service View (urban) Voicemail box Facilities Onsite catering Onsite gift shop Onsite restaurant Onsite security Pet friendly Rental car service Space (outdoor) Wheelchair accessible View all (6) Sustainability This venue holds verified sustainability certifications, based on certification data provided by BeCause in collaboration with Cvent. Learn more Certifications (1) Green Key Global Eco-Rating Sustainability level: 4 Green Keys Sustainability level: 4 Green Keys Certification body: Green Key Global Issued: 5/6/2024 • Expires: 5/1/2026 View details Need dates Priority windows that venues prefer for hosting events Oct 5, 2025 - Oct 16, 2025 Oct 26, 2025 - Oct 30, 2025 Nov 2, 2025 - Nov 6, 2025 Nov 12, 2025 - Nov 20, 2025 Jan 30, 2026 - Feb 4, 2026 Feb 26, 2026 - Mar 1, 2026 Mar 12, 2026 - Mar 15, 2026 Mar 29, 2026 - Apr 4, 2026 Apr 15, 2026 - Apr 19, 2026 Jun 1, 2026 - Jun 6, 2026 Jun 21, 2026 - Jun 27, 2026 Jul 19, 2026 - Jul 22, 2026 Aug 2, 2026 - Aug 15, 2026 Aug 24, 2026 - Aug 27, 2026 Sep 3, 2026 - Sep 8, 2026 Sep 10, 2026 - Sep 20, 2026 Oct 1, 2026 - Oct 4, 2026 Oct 8, 2026 - Oct 11, 2026 Oct 22, 2026 - Oct 25, 2026 Nov 11, 2026 - Nov 20, 2026 Nov 30, 2026 - Dec 5, 2026 Dec 10, 2026 - Dec 13, 2026 Oct 5, 2025 - Oct 16, 2025 Oct 26, 2025 - Oct 30, 2025 Nov 2, 2025 - Nov 6, 2025 Nov 12, 2025 - Nov 20, 2025 Jan 30, 2026 - Feb 4, 2026 Feb 26, 2026 - Mar 1, 2026 Mar 12, 2026 - Mar 15, 2026 Mar 29, 2026 - Apr 4, 2026 Apr 15, 2026 - Apr 19, 2026 Jun 1, 2026 - Jun 6, 2026 Jun 21, 2026 - Jun 27, 2026 Jul 19, 2026 - Jul 22, 2026 Aug 2, 2026 - Aug 15, 2026 Aug 24, 2026 - Aug 27, 2026 Sep 3, 2026 - Sep 8, 2026 Sep 10, 2026 - Sep 20, 2026 Oct 1, 2026 - Oct 4, 2026 Oct 8, 2026 - Oct 11, 2026 Oct 22, 2026 - Oct 25, 2026 Nov 11, 2026 - Nov 20, 2026 Nov 30, 2026 - Dec 5, 2026 Dec 10, 2026 - Dec 13, 2026 Oct 5, 2025 - Oct 16, 2025 Oct 26, 2025 - Oct 30, 2025 Nov 2, 2025 - Nov 6, 2025 Nov 12, 2025 - Nov 20, 2025 Jan 30, 2026 - Feb 4, 2026 Feb 26, 2026 - Mar 1, 2026 Mar 12, 2026 - Mar 15, 2026 Mar 29, 2026 - Apr 4, 2026 Apr 15, 2026 - Apr 19, 2026 Jun 1, 2026 - Jun 6, 2026 Jun 21, 2026 - Jun 27, 2026 Jul 19, 2026 - Jul 22, 2026 Aug 2, 2026 - Aug 15, 2026 Aug 24, 2026 - Aug 27, 2026 Sep 3, 2026 - Sep 8, 2026 Sep 10, 2026 - Sep 20, 2026 Oct 1, 2026 - Oct 4, 2026 Oct 8, 2026 - Oct 11, 2026 Oct 5, 2025 - Oct 16, 2025 Oct 26, 2025 - Oct 30, 2025 Nov 2, 2025 - Nov 6, 2025 Nov 12, 2025 - Nov 20, 2025 Jan 30, 2026 - Feb 4, 2026 Feb 26, 2026 - Mar 1, 2026 Mar 12, 2026 - Mar 15, 2026 Mar 29, 2026 - Apr 4, 2026 Apr 15, 2026 - Apr 19, 2026 Jun 1, 2026 - Jun 6, 2026 Jun 21, 2026 - Jun 27, 2026 Jul 19, 2026 - Jul 22, 2026 Show more Show more View calendar Seasonal Availability Do you want to know if your event is during the high or low season? Check the season availability for this hotel. Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec High season Oct 01 - Nov 21 Jan 01 - May 31 Shoulder season Jun 01 - Jun 30 Dec 01 - Dec 31 Low season Jul 01 - Sep 30 Meeting rooms Total meeting space 335,000 sq. ft. Largest room 54,638 sq. ft. Meeting rooms 105 Second largest room 38,594 sq. ft. Exhibit space 110,000 sq. ft. Space (outdoor) 52,000 sq. ft. Meeting rooms Total meeting space 335,000 sq. ft. Largest room 54,638 sq. ft. Meeting rooms 105 Second largest room 38,594 sq. ft. Exhibit space 110,000 sq. ft. Space (outdoor) 52,000 sq. ft. Floor Plans Download floor plans for this venue. Hyatt Regency Orlando - Space Tour Explore Meeting Rooms Find the perfect room with setup charts and interactive 3D floor plans. Meeting space Attendees Set up Feature Filters Name Room size Ceiling height Maximum capacity U-Shape Banquet rounds Cocktail rounds Boardroom Crescent rounds (Cabaret) Hollow square Florida Ballroom 8,975 sq. ft. 75 x 119.7 sq. ft. 14 ft. 1000 - 770 1000 - 600 - Florida Ballroom A 3,300 sq. ft. 75 x 44.3 sq. ft. 14 ft. 360 - 280 360 - 195 - Florida Ballroom B 2,963 sq. ft. 75 x 39.5 sq. ft. 14 ft. 340 - 210 340 - 195 - Florida Ballroom C 2,713 sq. ft. 75 x 36.2 sq. ft. 14 ft. 300 - 210 300 - 156 - Florida A-B 6,263 sq. ft. - 14 ft. - - - - - - - Florida B-C 5,676 sq. ft. - 14 ft. - - - - - - - Florida Foyer 2,888 sq. ft. - 14 ft. - - - - - - - Plaza International Ballroom 26,921 sq. ft. 115.7 x 232.8 sq. ft. 21 ft. 3050 - 150 3050 - 1596 - Plaza International Ballroom D 2,435 sq. ft. 39.9 x 61 sq. ft. 21 ft. 275 - 150 275 - 120 - View all rooms (189) Guest rooms Total guest rooms 1,641 Single (1 bed) 541 Single (1 bed) rate $129.00 - $429.00 Double (2 beds) 958 Double (2 beds) rate $129.00 - $439.00 Suites 142 Tax rate 6.5% Occupancy rate 13.625% Total guest rooms 1,641 Single (1 bed) 541 Single (1 bed) rate $129.00 - $429.00 Double (2 beds) 958 Double (2 beds) rate $129.00 - $439.00 Suites 142 Tax rate 6.5% Occupancy rate 13.625% Location Getting Here Address: 9801 International Drive, Orlando, FL 32819\r\n\r\n- Orlando International Airport: 12 miles/15 mins  \r\n\r\n- MEARS: Non-Exclusive Airport Super Shuttle to and from the airport\r\n\r\n- Uber/Lyft to and from the airport\r\n\r\n- Taxis are available to and from the airport Address: 9801 International Drive, Orlando, FL 32819\r\n\r\n- Orlando International Airport: 12 miles/15 mins  \r\n\r\n- MEARS: Non-Exclusive Airport Super Shuttle to and from the airport\r\n\r\n- Uber/Lyft to and from the airport\r\n\r\n- Taxis are available to and from the airport Distance from airport 12 mi Distance from airport 12 mi Parking in the area Parking in the area Paid parking ( $38.00 / day ) Valet parking ( $53.00 / day ) Bus parking Local Attractions Andretti Indoor Karting & Games Recreation 1 mi Indoor fun center featuring go karts, racing simulators, VR games, laser tag, bowling & dining. 9299 Universal Blvd Orlando,  FL,  US 32819 Visit website TopGolf Recreation 1 mi This sprawling entertainment venue features 100+ climate-controlled hitting bays, over 200 HDTVs, a swanky lounge with drinks & games and more. 9295 Universal Blvd Orlando,  FL,  US 32819 Visit website ICON Park Recreation 1 mi The Wheel at ICON Park, an iconic, 400-foot observation wheel, is the centerpiece of this metro-chic themed complex featuring attractions, restaurants, clubs and shops. Joining The Wheel is a dynamic line-up of attractions including Madame Tussauds and Sea Life Aquarium. ICON Park is located in the heart of Orlando’s world-famous International Drive and admission is always free. Free valet and self-parking are available in a 1,600 space multi-story parking garage. For more information, call (321) 888-2690. 8375 International Drive Orlando,  FL,  US 32819 Visit website Walt Disney World Recreation 15 mi Join Mickey, Minnie, and the rest of the crew at Magic Kingdom, Epcot, Animal Kingdom, Hollywood Studios, or experience the resort’s famous water parks—Blizzard Beach and Typhoon Lagoon. Come face-to-face with your favorite Disney® characters by day and witness the impressive fireworks show each night. Orlando,  FL Visit website Universal Orlando Recreation 4 mi At this real, working film and TV production facility you’ll find an amazing array of rides, shows, movie sets and attractions that put you right in the picture. You’ll enjoy themed dining and shopping, a variety of exciting special events throughout the year, and you might even catch a real film crew at work on the backlot. From entertaining shows that take you behind the scenes of the movie-making process to state-of-the-art rides that make you part of the action, nobody brings the magic of the movies… television… and music to life like Universal Studios. 1000 Universal Studios Plaza Orlando,  FL,  US 32819 Visit website SeaWorld Orlando Recreation 3 mi SeaWorld® is a world-class attraction with spectacular shows, marine displays and thrilling rides. 7007 SeaWorld Drive Orlando,  FL,  US 32821 Visit website Pointe Orlando Nightlife 1 mi This open-air, pedestrian-friendly mall on International Drive offers 18 dining options as well as name-brand shops and entertainment including bowling, arcade games and a 20-screen cinema. 9101 International Drive Orlando,  FL,  US 32819 Visit website Notable Golf Courses Recreation 5 mi Discover over 20 premier courses located within 5 to 20 minutes from our hotel, including Bayhill, Legends, Orange County National and Falcon's Fire. Orlando,  FL The Wheel at ICON Park Recreation 1 mi Enjoy breathtaking 360° views of Orlando as you have never seen it before! Buy your tickets online and skip the line when you get here! International Drive Orlando,  FL 32819 Visit website Downtown Orlando Business district 14 mi Beyond the theme parks and attractions, Orlando’s neighborhoods and nearby cities offer endless adventures with dining, nightlife, arts & culture, outdoor recreation, shopping, and other surprises that locals love — and that you deserve to experience during your next visit. Orlando Premium Outlets Shopping 5 mi Take the complimentary I-Ride Trolley to Orlando Premium Outlets on International Drive. With 180 luxury stores, you are sure to find exactly what you are looking for. 8200 Vineland Avenue Orlando,  FL Visit website Mall at Millenia Shopping 7 mi Step into a shopper's paradise when you walk into Orlando's premier luxury mall. Enjoy marquis stores such as Neiman Marcus, Chanel, Gucci, Saint Laurent, Prada, Versace, Athleta, Louis Vuitton, and Jimmy Choo. 4200 Conroy Road Orlando,  FL 32839 Visit website Kia Center Nightlife 14 mi Indoor arena hosting concerts, sporting events and more. Home of the Orlando Magic, Orlando Predators and Orlando Solar Bears; Ice shows; Hockey championships; Arena football; Indoor soccer; NCAA basketball tournaments; NBA All-Star game;  Ultimate Fighting and Professional Wrestling; Professional Bull Riding and Rodeo; Extreme sports/motorsports exhibitions and more. 400 West Church Street #200 Orlando,  FL 32801 Visit website Dr. Phillips Center for the Performing Arts Theater 14 mi Orlando's premier performing arts venue features Broadway shows, live entertainment, educational programs and more. 445 South Magnolia Avenue Orlando,  FL 32801 Visit website Camping World Stadium Recreation 11 mi Located in the West Lakes neighborhood of Downtown Orlando, Camping World Stadium is Orlando's home for world class events like the NFL Pro Bowl, Citrus Bowl, Camping World Bowl, Cure Bowl, NFL pre-season match-ups and concerts. 1 Citrus Bowl Place Orlando,  FL 32805 Visit website University of Central Florida University 28 mi The University of Central Florida and its 12 colleges provide opportunities to 60,000 students from all 50 states and 140 countries. Located in Orlando, Florida, UCF is the nation’s second-largest university. UCF ranks in the top 100 of public universities nationwide, according to\r\nU.S. News & World Report. 21 of its graduate degree programs rank in the top 100 of their fields. 4000 Central Florida Blvd Orlando,  FL 32816 Visit website Discovery Cove Recreation 3 mi Discovery Cove is a one-of-a kind experience where you can interact with bottlenose dolphins, feed tropical birds, play inches from a family of otters and even walk on the Grand Reef floor--all in one day. Between adventures, recharge with unlimited island fare and refreshments. 6000 Discovery Cove Way Orlando,  FL 32821 Visit website Legoland Florida Recreation 40 mi Enjoy more than 50 rides, shows and attractions inspired by LEGO® brands and characters, plus LEGOLAND Water Park. It also features the brand-new Peppa Pig Theme Park, designed to be the ultimate day for little ones. 1 Legoland Way Winter Haven,  FL 33884 Visit website Gatorland Recreation 9 mi Florida’s leader in alligator safety and education since 1949®, Gatorland is the place to see alligators and crocodiles of all sizes. The park's free-flight aviary, petting zoo, one-of-a-kind animal shows, thrilling Screamin’ Gator Zip Line and new Stompin’ Gator Off-Road Adventure ensure your day will be chock-full of fun. 14501 S Orange Blossom Trail Orlando,  FL Visit website Kennedy Space Center Historical landmark 60 mi Located at NASA's Kennedy Space Center on Merritt Island, the Kennedy Space Center features exhibits and displays, historic spacecraft and memorabilia, shows, two IMAX theaters, and a range of bus tours of the spaceport. FL 32899 Visit website ESPN Wide World of Sports Complex Recreation 11 mi Located in the middle of Walt Disney World® Resort, the ESPN Wide World of Sports Complex is a 220-acre multi-purpose sports complex. It includes nine venues and hosts numerous professional and amateur sporting events throughout the year. 700 South Victory Way Kissimmee,  FL 34747 Visit website Explore the Cvent Vendor Marketplace powered by Reposite Find trusted vendors for A/V, activities, transportation, and other event needs in one place. Learn more Additional Information Additional details AAA Four Diamond\r\n\r\nAccommodations: 1,641 guestrooms, including 142 suites, 541 kings and 958 double queens. \r\n\r\nMeetings made easier: 315K sq. ft. of flexible, recently- renovated indoor and outdoor meeting space with unique venues and a dedicated staff you can depend on with our Event Concierge App. Highlights include 5 pillar-free ballrooms on the same level, 52K sq. ft. of outdoor event space, a 56K sq. ft. Grand Rotunda for registration and networking, 68K sq. ft. of foyer space with lots of natural light and 105 breakout rooms.\r\n\r\nLocation: 15 minutes from Orlando International Airport, in the heart of Orlando’s entertainment district. Theme parks, shopping & dining are steps away on International Drive. We are also connected to the Orange County Convention Center via three pedestrian walkway bridges.\r\n\r\nOn-site dining: 6 dining options including 5 full-service restaurants, 24-hr Market for grab-and-go items, 2 bars, and in-room dining options.  Fare includes Italian steakhouse cuisine, elevated light bites, comfort food, poolside snacks, and much more.\r\n\r\nPools: Two sparkling pools including the expansive Grotto Pool with zero entry, waterslide, waterfalls, splash pad, a separate kiddie pool area and cabanas available for rental daily. Plus, relax at the Terrace Pool, a near Olympic-sized lap-style pool on our 4th floor upper deck.\r\n\r\nOn-site Business Amenities: Event Concierge App creates a hassle-free event for planners, 11th Hour Business Center, ATM's and laundry and dry-cleaning services. \r\n\r\nResort amenities: full-service spa & salon, 24-hour StayFit Gym and tennis courts.\r\n\r\nRoom Upgrades: Regency Club provides exclusive access to a private lounge that includes complimentary continental breakfast, beverages, light afternoon snacks, evening hors d’oeuvres and dessert. Located on the 26th floor and offers  concierge service. You can also upgrade your room to have additional space, a suite or a room with a view!\r\n\r\n**Hyatt Regency Orlando is a key player within the Hyatt Convention Alliance.  Juggling multiple meetings is easier with an extra set of hands.  That's where Hyatt Convention Alliance comes in.  For more details, refer to the attachment within the 'Additional Materials' section. Weblinks Virtual tour Follow us Venue resources 2025 Key Dates and Special Incentives Capacity Charts & Floor Plans Hyatt Convention Alliance Hyatt Regency Orlando Property Map Sales Kit Hyatt Regency Orlando Frequently Asked Questions Explore frequently asked questions from the Hyatt Regency Orlando regarding Health and Safety, Sustainability, and Diversity and Inclusion Sustainable Practices Please provide comments or a link to any publicly communicated Hyatt Regency Orlando's sustainability or social impact goals/strategy. No response. Does Hyatt Regency Orlando have a strategy that focuses on the elimination and diversion of waste (i.e. plastics, papers, cardboard, etc.)? If yes, please elaborate on your strategy of elimination and diversion of waste. No response. Diversity and Inclusion For US hotels only, is Hyatt Regency Orlando and/or parent company certified as a 51% diverse owned business enterprise (BE)? If yes, please indicate which one of the following you are certified as: No response. If applicable, could you please provide a link to Hyatt Regency Orlando's public report on their commitments and initiatives related to diversity, equity, and inclusion? No response. Health and Safety Were practices at Hyatt Regency Orlando developed based on health service recommendations from public governmental entities or private organizations? If Yes, please list which organizations were used to develop these practices. Yes, GBAC STAR Accreditation (Global Biorisk Advisory Council) Does Hyatt Regency Orlando clean and sanitize public areas and publicly accessible facilities (i.e. meeting rooms, restaurants, elevator banks, etc.)? If yes, describe any new measures that are taken. Yes, All public areas are disinfected at least every two hours. Grequently touched surfaces are sanitized on an ongoing basis depending upon frequency of use. View all FAQs Please explain, if applicable, the carbon offsetting options you offer to corporations. Please provide, if applicable, an e-mail address for a contact who can address any follow up questions relating to sustainability and social impact goals and initiatives. Has your hotel taken steps to reduce single-use plastics, such as removing plastic straws (except upon request for guests with disabilities), stirrers and cotton buds? If yes, please provide detail as to the steps you have taken to reduce single use plastics? Does your hotel generate (onsite) or purchase (offsite) renewable energy (beyond your utility's standard offerings)? If yes, please describe your practices for generating or purchasing renewable energy. Does your hotel engage in activities to protect & restore the natural environment in which it is located (i.e. trees planted, coral reef restored, etc.)? Yes Will your hotel be imposing any additional fees for cleaning services? If yes, please specify those fees. No Are specific cleaning/disinfection routines in place for pillows, duvets and their covers, headboard, bathrobe etc.? If yes, please describe. Yes, Changed and disinfected after each check out Please include a link to your public report on community impact if applicable. Please provide any other comments you wish to make regarding your efforts/initiatives to obtain certification in these programs. Please provide, if applicable, an e-mail address for a contact who can address any follow up questions relating to diversity, equity, and inclusion. Ready to send your inquiry? Ready to send your inquiry? Select venue Report an issue with this venue profile to the Cvent Supplier Network. Ready to send your inquiry? Select venue Promotions More Rooms, More Rewards Multiple dates available Promotional rates Claim promotion Cvent Supplier Network Search Event Venues Find Venue Promotions Explore City Guides Onsite Solutions Event Management Software Event Registration Software Mobile Event Apps Strategic Meetings Management Web Survey Software Webinar Platform Cvent Home Contact Us Customer Support Your Privacy Choices Privacy Policy Product Terms of Use Website Terms of Use Advertise with us Copyright © 2000-2025 Cvent, Inc. All rights reserved."
    },
    {
      "url": "https://www.biography.com/actors/dwayne-johnson",
      "text": "Dwayne Johnson: Biography, Actor, Family, Movies & Facts Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Bad Bunny Charlie Sheen’s Addiction Kathy Bates Almost Quit Shohei Ohtani Everyday Heroes of 9/11 Famous Actors Dwayne Johnson Dwayne Johnson Dwayne Johnson first rose to fame as \"The Rock,\" a popular wrestling personality. He then became a box-office star, appearing in films including 'The Scorpion King,' 'Hercules' and 'The Fast and the Furious' franchise. By Biography.com Editors Updated: Mar 05, 2024 5:14 PM EST Photo: Art Streiber/NBCU Photo Bank/NBCUniversal via Getty Images via Getty Images // Getty Images (1972-) Jump to: Who Is Dwayne Johnson? Quick Facts Early Life and Career Becoming 'The Rock' Movies and TV XFL Co-Owner Personal Life Who Is Dwayne Johnson? Dwayne \"The Rock\" Johnson was born into a professional wrestling family in 1972. An injury ended his college football career, so he entered the ring with the WWE. As \"The Rock,\" he famously feuded with wrestler Steve Austin and won the WWE Heavyweight title numerous times. Johnson then parlayed his wrestling fame into a film career, appearing in projects like 2001's The Mummy Returns and 2010's Tooth Fairy . Later projects include the HBO series Ballers and leading roles in The Fast and the Furious and Jumanji franchises and the voice as demigod Maui in Moana . READ MORE: 10 Things You May Not Know About Dwayne 'The Rock' Johnson Quick Facts FULL NAME: Dwayne Douglas Johnson BORN: May 2, 1972 BIRTHPLACE: Hayward, CA SPOUSE: Lauren Hashian (m. 2019), Dany Garcia (m. 1997-2008) CHILDREN: Ava Raine ASTROLOGICAL SIGN: Taurus Early Life and Career Johnson was born on May 2, 1972, in Hayward, California. The grandson of professional wrestler Peter \"High Chief\" Fanene Maivia and son of wrestler Rocky Johnson, the young Johnson grew up watching his father perform in the ring. With no plans to follow in his footsteps, Johnson played college football at the University of Miami, showing promise with his size and athleticism until being slowed by injuries. Becoming 'The Rock' With few prospects in professional football, Johnson turned to wrestling, debuting in the WWE against the Brooklyn Brawler in Texas. After a couple more matches, including a tag team win with Bart Sawyer, the WWE signed him under the name Flex Kavana. A year later, he joined The Nation of Domination, eventually taking over its leadership and calling himself The Rock. He later joined another band of elite wrestlers known as The Corporation and began a notorious feud with Steve Austin. Also known as \"The People's Champ,\" The Rock went on to win a combined 17 WWE titles over his acclaimed career. Movies and TV 'Scorpion King' Outside the wrestling ring, The Rock launched a successful acting career, dropping the stage name and simply going by Dwayne Johnson. He first made a big splash as the Scorpion King, a supernatural bad guy, in 2001's The Mummy Returns . Johnson returned to this role the following year for The Scorpion King. Trying his hand at comedy, he appeared in 2005's Be Cool with John Travolta and Uma Thurman and 2007's The Game Plan. 'Driver,' 'Fast & Furious' Franchise Johnson's acting career to continued to thrive through his appearances in such films as Driver (2010) and Fast & Furious 6 (2013). In 2014, he starred as the titular strong man in Hercules . Johnson also returned to wrestling from time to time, including a 2014 appearance with Hulk Hogan and Stone Cold Steve Austin at WrestleMania 30. HBO's 'Ballers' In 2015, Johnson dominated the big screen with two big action films. He appeared in Furious Seven and starred in San Andreas . Johnson also debuted his first dramatic comedy series that same year, playing Spencer Strasmore, a retired pro footballer turned financial planner, on Ballers . 'Central Intelligence,' 'Moana,' 'Baywatch,' 'Jumanji' In 2016, after teaming up with Kevin Hart for the action-comedy Central Intelligence , Johnson voiced the demigod Maui for the Disney animated hit Moana . He was a busy man in 2017, taking on starring roles in The Fate of the Furious , a big-screen adaptation of the 1990s lifeguard series Baywatch and Jumanji: Welcome to the Jungle. 'Skyscraper,' 'Rampage,' 'Hobbs & Shaw' The good vibes continued into 2018, with Jumanji racking up the ticket sales en route to becoming the actor's highest-grossing film to date. He also managed to stand out during the blitz of advertising accompanying the Super Bowl in February, debuting a trailer for the movie Skyscraper , in which he partakes in death-defying stunts with a prosthetic leg. That same day, Johnson announced he would be hosting a 10-episode unscripted competition show, The Titan Games , to \"create a platform that gave everyday people the opportunity to change their lives and do something extraordinary.\" Next up for the action star was Rampage , based on the popular 1980s arcade game, which hit theaters a few months before the July release of Skyscraper . Johnson returned to his wrestling roots by appearing as himself in Fighting with My Family (2019), based on the true story of female wrestling champion Saraya \"Paige\" Bevis. Later that year, he was back in action mode with the Fast & Furious spinoff Hobbs & Shaw , alongside Jason Statham . 'Young Rock' In 2021, Young Rock , a television series about the life of Johson, premiered. The show stars Johnson and other actors playing younger versions of the actor. XFL Co-Owner In August 2020, Johnson announced that he teamed up with his wife and a sports management company to buy the XFL, which went bankrupt earlier in the year, for $15 million. \"The acquisition of the XFL with my talented partners, Dany Garcia and Gerry Cardinale, is an investment for me that's rooted deeply in two things—my passion for the game and my desire to always take care of the fans,\" Johnson said in a statement. \"With pride and gratitude for all that I've built with my own two hands, I plan to apply these callouses to the XFL, and look forward to creating something special for the players, fans, and everyone involved for the love of football.\" Personal Life In August 2019, Johnson tied the knot with his longtime girlfriend, singer/music producer Lauren Hashian. The two are parents to daughters Jasmine Lia (b. December 2015) and Tiana Gia (b. April 2018). Johnson also has a daughter, Simone Alexandra, from his first marriage. He and his high school sweetheart, Dany Garcia, wed in 1997 and split up a decade later, though she continues to serve as his manager. Fact Check: We strive for accuracy and fairness. If you see something that doesn't look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Watch Next Advertisement - Continue Reading Below Famous Actors Seth Rogen ‘The Pitt’s Noah Wyle Wants to Change Healthcare Adam Scott Who Inspired Owen Cooper to Start Acting? Advertisement - Continue Reading Below Inside Charlie Sheen’s Addiction Struggles Charlie Sheen Kathy Bates Almost Retired. Then Came ‘Matlock.’ Steve Martin’s Life and Career in Photos Judy Garland Bruce Willis Did Shirley Temple Almost Play Dorothy? Aubrey Plaza Opens Up About Grief in New Interview Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://www.orlandorockgravelanddirt.com/",
      "text": "Landscaping Rock, Gravel and Fill Dirt Delivery Orlando FL Skip to content Orlando Rock, Gravel and Dirt Home Email Us Call or Text 407-470-3180 SAND, GRAVEL, FILL DIRT, TOPSOIL, CRUSHED STONE AND ROCK WE DELIVER TO YOUR LOCATION Orlando Rock, Gravel and Dirt 1-407-470-3180 A Premier Supplier Orlando Sand & Gravel Company has been a leader in the Aggregate Industry throughout the East Coast of Florida for many years. We pride ourselves on providing a quality product and excellent service for any size residential need up to the most demanding of commercial or construction projects throughout the area. With our well maintained fleet Orlando Sand & Gravel has the flexibility to service jobs of any size. The Companyâs network of pits and wide variety of rocks, all shapes and sizes , allows us to coordinate truck dispatch, arrival, and discharge under the most difficult job conditions. Commitment to the Environment Awareness of safety and environmental excellence are very important to the Companyâs performance. Compliance with environmental and safety regulations is actively monitored by our experienced staff. Call of Text 407-470-3180 Gravel Delivering high quality gravel rocks for usage in both commercial and residential projects. Our team delivers on-demand to your location, gravel and stones for any size project and any size job. Gravel can be utilized for drainage, construction, erosion control, and for aesthetic landscaping needs and much much more. Call of Text 407-470-3180 Sand On-demand delivery of beach sand, yellow top dressing sand, mason sand, and A-3 Certified septic sand.  High quality sand to be used for residential, commercial, and industrial projects. Why go to the beach when Orlando Gravel, Sand and Dirt brings the beach to you. Call of Text 407-470-3180 High Grade Topsoil We provide high-quality topsoil and dirt to the Orlando market and surrounding area. Don't be fooled by low quality topsoil. Low quality soil can be inundated with weed seeds, which will cause years and years of weed fighting. Vines and even trees can grow out due to poor quality top soils. Rocks and roots are another example of poor quality top soil, causing years and years of extra work not to mention the occasional 'ouch' when stepped on by a bare foot! Another issue would be too much sand and too little black compost which won't support healthy yard growth and development. DON'T USE LOW GRADE SOIL! Call of Text 407-470-3180 Lime Rock Designed for driveways, drive pads, walkways and more. Lime Rock gravel mix comes in three different sizes from 3/4 to smaller. Mixed with round up lime rock base, this gravel spreads easy, packs down well and allows for excellent drainage. When compared to crushcrete or millings you'll find a far more aesthetically pleasing and cleaner look. Also available Lime Rock driveway gravel, #57, #89, drainage graveland granite gravel and landscape decorative gravels. Call of Text 407-470-3180 Rip Rap Boulders RIP RAP Boulders in a bag â Construction Grade material to be used in areas with concentrated runoff, helping to protect and prevent erosion. These specialty stones have nooks and crannies that help divert and control water while preventing erosion. These rocks come in 2,000 pound bags varying in size and are delivered to your job site. Common uses include Gabion Walls (similar to retaining walls that direct water) V-Ditch Lining (typical for long/steep driveways, allows for water run-off in a way that will not erode the surrounding earth) Erosion Control (offering protection to the surrounding soil) Driveway Lining (offering erosion control while also being aesthetically pleasing) Landscaping (attractive rock that beautifies the surrounding area) Delivered in 2,000 pound bags they are easily installed by one person. Call of Text 407-470-3180 Fill Dirt Our select fill dirt can be used as a pad material and has been used on commercial, residential projects and building sites. Our fill dirt falls well within most engineer specs. Fill dirt is used to fill in large areas such as large or small holes, ditches or deep low spots found on the ground. Affordable and dense, it's best utilized within those areas. Typically fill dirt is a mixture of clay, small rocks, sand, and root material, making it ideal for holes and muddy spots. Call of Text 407-470-3180 Move It Select your order list, provide us a time and location and we'll do the rest! Call of Text 407-470-3180 We Deliver! On call and ready to deliver to your residential or commercial location. Serving the Greater Orlando Area with rock, sand, gravel and specialty rocks. Call, text or email for quick quotes. Call of Text 407-470-3180 Mulch Always affordable and always on time! Contact our team for quick delivery of mulch, soil, landscape rocks, and aggregates. Available for residential and commercial delivery, anytime, anywhere, quick delivery at an affordable price. Ideal for yards, flower-beds, municipal parks and buildings along with commercial properties. Mulch is an environmentally friendly product that not only offers aesthetically appealing colors but also special protection for soil and plants. Reducing weed growth, helps maintain soil moisture and erosion. Learn More About Mulch Delivery Call of Text 407-470-3180 If you don't see it here, and it's produced anywhere in the world, we can find it and deliver it! Commercial pricing on Number 57 and Number 89 and 1/4 inch Lime Rock and Limestone. Other aggregate available includes, Granite Number 57 and Number 89.  Granite in small and large sizes or Lime Rock riprap.  Coral sand, concrete screening and paver base, brown and white River Rock, Salt and Pepper Granite as well as Chattahoochee River Rock. All loads of Gravel, Sand and Topsoil are only estimated. Loads can be up to 25% less or more depending upon, loaders, mass, moisture, truck capacity, volume, and type of product. We cannot guarantee accurate coverage. You may need more or less product. We cannot be responsible for overage or shortage. We use a standardized measurement where 1 ton equals 1 yard, or equivalently, 1 scoop equals 1 yard or 1 ton. 6401 Times Square Avenue CU - 20 #1049, Orlando, Florida 32835 | 407-470-3180 Â© 2025 Orlando Rock, Gravel and Dirt, This company is owned and operated by Old Florida Rock and Dirt Inc. All Rights Reserved. | Privacy Policy | Design byÂ Regency"
    },
    {
      "url": "https://in.linkedin.com/company/hospice-rocks",
      "text": "Nursing Rocks! Concert Series | LinkedIn Skip to main content LinkedIn Articles People Learning Jobs Games Join now Sign in Nursing Rocks! Concert Series Entertainment Providers “Honoring Nurses One City At A Time!” Follow View all 28 employees Report this company About us Empowering and honoring nurses through the uplifting power of live music, our mission is to foster a positive impact within the nursing community at nationwide events. We strive to elevate awareness of the nursing profession and\nsupport its advancement through scholarship opportunities for further education.\n\nThe Nursing Rocks! Concert Series is a sponsored live music event dedicated to nationwide nurse appreciation, showcasing top touring bands. Founded to unite local communities and businesses in honoring their dedicated nurses. Through initiatives , we raise scholarship funds to support ongoing education, partnering with nationally accredited and local nursing schools to empower aspiring nurses in each community.\n\n Attendees Contact\n▪ Nurses Nursing Rocks! \n▪ General Public\n▪ Healthcare Professionals \n▪ Aspiring Nurse Professionals \n▪ Sponsors\nwww.nursingrocksconcerts.com\n\nGet Involved! \ncontact@nursingrocksconcerts.com\n(602) 796-4187 Website https://linktr.ee/nursingrocksconcertseries External link for Nursing Rocks! Concert Series Industry Entertainment Providers Company size 2-10 employees Headquarters Scottsdale Type Privately Held Founded 2022 Specialties Nursing, Nurse, Music, Promotion, Rock Bands, Honoring, Concert, Sponsored , and Event Locations Primary Scottsdale, US Get directions Las Vegas, NV, US Get directions Employees at Nursing Rocks! Concert Series Benjamin Beberness Bernd Haber Keep Bringing People Together Through The Power Of Music (c) Spencer Coon NATIONAL EXECUTIVE TALENT SCOUT - Serving Music & Health Care Since 2005 (27,000+ ) Connections Jim Nelson Board Member and Retired Human Capital Consultant See all employees Updates Nursing Rocks! Concert Series 1,120 followers 1d Report this post It’s a wrap! Nursing Rocks! Concert Series at TXADONA sharing our mission and values with the great Directors of Nurses of the Lone Star State at the TXADONA conference in Dallas. #nursingrocks #txadona #dallas 3 1 Comment Like Comment Share Nursing Rocks! Concert Series 1,120 followers 1w Report this post Nursing changes evolve over time. We must be thoughtful of the impact change can bring good and bad. #nursingrocks #nurselife #qualitycare American Nurses Association 567,959 followers 1w Interconnection between Public Health, the Economy and National Security should not be ignored. Read the full statement from American Nurses Association here: https://ow.ly/1rx050WOlLv #ThePowerOfNurses #RNAction 2 Like Comment Share Nursing Rocks! Concert Series 1,120 followers 1w Report this post Can’t replace the human touch. #nursingrocks #thepowerofnurses #nurselife Jennifer Shepherd, DNP, MHA, RN, NEA-BC, NPD-BC Nurse Executive | Innovation | Workforce and Well-Being Solutions | AI Champion | Nursing Education | Product Management 2w Robots in Healthcare: Augmentation, Not Replacement—and Why Nurses Must Lead the Way Jennifer Shepherd, DNP, MHA, RN, NEA-BC, NPD-BC on LinkedIn 2 Like Comment Share Nursing Rocks! Concert Series 1,120 followers 2w Report this post Are you a Healthcare Association or Provider looking to add a “Wow!” Factor to your event or convention? Bring Nursing Rocks! Concert Series to honor, celebrate and recognize your nurses! Serving crowds from 500 to 5,000 we bring the show to you! #nursingrocks #thepowerofnurses #nurselife 5 1 Comment Like Comment Share Nursing Rocks! Concert Series 1,120 followers 1mo Report this post Amazing work being done out there! Are you a member of the American Nurses Association ? If not, we at Nursing Rocks! Concert Series highly recommend you join. The more nurses we have involved, greater the amplification of the message. #nursingrocks #thepowerofnurses #nurselife American Nurses Association 567,959 followers 1mo Chief Executive Officer Angela Beddoe delivered the closing keynote address this morning during the National Black Nurses Association ’s 53rd Annual Institute. \n\n“Nurses are advocates, healers, and bridge builders. We believe in creating the conditions for everyone to thrive — and we will not waiver in that belief.” #ThePowerOfNurses #NurseLeadership 5 Like Comment Share Nursing Rocks! Concert Series 1,120 followers 1mo Report this post May 2026…Where will you be? Can we get 1 million there? We love a good challenge… #nursingrocks #thepowerofnursed #millionnursemarch Taylor-Paige Bourque MSN,RN, NC-BC I guide nurses & all humans to “unbecome” generational cycles of silence & self-abandonment, awakening wholeness & empowering authentic living. Rise to the occasion & Restore the life that’s yours. 1mo Nurses… I heard a stat tonight that hit me hard: 60% of our profession the most trusted profession are not voting.\n\nI get it. We’re exhausted. Disillusioned. Burnt out.\nAnd when you’re constantly dismissed, it’s easy to believe your voice doesn’t matter.\n\nBut let me offer you this:\nWhen a student asks me, “Should I call a rapid?”\nI ask them, “Could it be wrong not to?”\nIf the answer is yes, then the choice is clear: You act. You speak. You lead.\n\nIt could be wrong not to use your voice right now.\nThe state of healthcare tells us exactly that.\n\nHalf of new nurses are leaving the profession within two years.\nAnd 60% of us aren’t voting.\nDo the math. That silence has a cost.\n\nSo I’m asking you, what if we all showed up?\nWhat if we all used our voice?\n\nWe’re stronger together.\nAnd I want you beside me on May 7th in Washington for the Million Nurse March.\n\nGet curious about the power you hold.\nYour voice matters.\nAnd it could be wrong not to! \n\nStay tuned Nurses Shift Change Danielle K. McCamey, DNP, ACNP-BC, FAAN, FAANP, FCCP, FADLN Sharon Goldfarb Roberto Roman, PhD, DNP, RN, CMSRN 🇵🇷 Terri Schmitt PhD, APRN, FNP-BC, FAANP and all of the Nurses Shift Change Crew! \n\n✌🏼 TayTay! View C2PA information 3 Like Comment Share Nursing Rocks! Concert Series 1,120 followers 1mo Edited Report this post NURSING ROCKS! – Empower & Celebrate the Angels on the Bedside\n\n* Nursing Rocks! Concert Series is soon coming to town across the country curating nationwide music events to empower and honor nurses through the uplifting power of live music, to foster a positive impact within the nursing community sponsored and supported by local, regional, and national institutions.\n\n* Angels at the Bedside – Their selfless service, often unseen and underappreciated, elevates nurses as the true angels of mercy, walking beside us in our most vulnerable times with strength, kindness, and grace because they:\n\n* Embody the purest form of compassion and resilience in healthcare, tirelessly providing comfort and healing beyond physical care.\n\n* Are the unwavering presence in moments of pain, fear, and uncertainty, offering not only expert clinical treatment but also emotional support, empathy, and human connection.\n\n* Are gifted caregivers who inspire hope and calm through their gentle touch, patient listening, and relentless dedication, making a profound difference in our lives.\n\n* Join & reach out to us as we, through initiatives, raise scholarship funds to support ongoing education, partnering with nationally accredited and local nursing schools to empower aspiring nurses in each community. https://lnkd.in/guCPA2bj Jeanine \"Nini\" Martin, FACHE/FHIMSS Gates Fellow Olympic athlete #nursingrocks #thepowerofnurses #nurselife #AngelsAtTheBedside 14 Like Comment Share Nursing Rocks! Concert Series 1,120 followers 1mo Report this post Passing along! Have a great weekend everyone! #nursingrocks #thepowerofnurses #nurselife Nurse.org 52,623 followers 1mo There’s big news for those following The Pitt: the hit medical drama inspired by Pittsburgh’s Allegheny General Hospital has received a stunning 13 nominations for the 2025 Emmy Awards. \n\nThis achievement highlights the show’s power to shine a national spotlight on the real-life challenges, triumphs, and resilience of healthcare professionals—especially nurses.\n\n(..continued below) #nurse #nursesonlinkedin #nursenews #healthcarenews 6 Like Comment Share Join now to see what you are missing Find people you know at Nursing Rocks! Concert Series Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Nurses Shift Change Health and Human Services Avir Health Group Hospitals and Health Care Hinge Health Software Development San Francisco, California Deerfield Bakery Food Production Schaumburg, Illinois Nursing America Hospitals and Health Care Arizona Friends of Chamber Music - AFCM Performing Arts Tucson, Arizona Brian Jones Enterprises, LLC. Real Estate Nursing Beyond Borders Philanthropy Santa Monica, California Astoria Park Senior Living Health and Human Services Pasadena, California Los Alamos Summer Concert Series Los Alamos, New Mexico Show more similar pages Show fewer similar pages Browse jobs Board Member jobs 153 open jobs Director jobs 83,789 open jobs Vice President jobs 5,783 open jobs Vice President Operations jobs 281 open jobs President jobs 2,130 open jobs Director Revenue Cycle jobs 76 open jobs Chief Executive Officer jobs 5,312 open jobs Sales Director jobs 5,698 open jobs Regional Vice President jobs 343 open jobs Chief Operating Officer jobs 1,844 open jobs Chief Officer jobs 3,214 open jobs Director Clinical Operations jobs 60 open jobs Director of Quality jobs 695 open jobs Director of Financial Reporting jobs 137 open jobs Director of Collections jobs 30 open jobs Revenue Accountant jobs 1,888 open jobs Financial Reporting Manager jobs 2,312 open jobs Director of Accounting jobs 210 open jobs Revenue Officer jobs 1,032 open jobs Assistant Controller jobs 2,917 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Board Member jobs Legal Advisor jobs Director jobs Legal Counsel jobs Attorney jobs Chief Executive Officer jobs Vice President jobs Technology Officer jobs Supply Chain Officer jobs Professor jobs Teacher jobs Adjunct Professor jobs Executive Vice President jobs President jobs Marketing Officer jobs Chief Officer jobs Regional Director jobs Retail Director jobs Leadership Coach jobs Head of Human Resources jobs Senior Director Human Resources jobs Vice President Human Resources jobs Human Resources Director jobs Investment Banker jobs Strategy Manager jobs Portfolio Manager jobs Chief Quality Officer jobs Finance Officer jobs Senior Software Engineer jobs Engineer jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Nursing Rocks! Concert Series Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://lawrocks.org/2023",
      "text": "2023 — Law Rocks About Mission History Music Matters Grant Nonprofits People Legal Community Sponsors Tour 2025 Tour Dates March 6, 2025 - Dallas April 8 - Paris at PAW March 20, 21, & 22, 2025 - Los Angeles April 10 - Houston April 24 - San Francisco May 8 - Chicago June 3 - London September 11 - Washington DC September 18 - Istanbul September 25 - Seattle October 23 - Hong Kong November 6 - Toronto November 12 & 13 - New York City November 16 - Dubai November 20 - Miami December 4 - Phoenix 2026 Tour 2026 Band Interest List Learn FAQ News Press Annual Report Concert Recaps Get the Newsletter Contact Sponsorship Donate About Mission History Music Matters Grant Nonprofits People Legal Community Sponsors Tour 2025 Tour Dates March 6, 2025 - Dallas April 8 - Paris at PAW March 20, 21, & 22, 2025 - Los Angeles April 10 - Houston April 24 - San Francisco May 8 - Chicago June 3 - London September 11 - Washington DC September 18 - Istanbul September 25 - Seattle October 23 - Hong Kong November 6 - Toronto November 12 & 13 - New York City November 16 - Dubai November 20 - Miami December 4 - Phoenix 2026 Tour 2026 Band Interest List Learn FAQ News Press Annual Report Concert Recaps Get the Newsletter Contact Sponsorship Donate The Big Wheels Featuring legal talent from Wheeler Bio, Allen Matkins, Stealth Bio Rocking Friday for Operation Birthday The Big Wheels’ members have been raising money with Law Rocks for nearly a decade and have amassed over 11 Law Rocks appearances in New York City and Los Angeles since 2014.  This year, the band is teaming up with the amazing folks at Operation Birthday at the world-famous Whisky a Go Go on Hollywood’s Sunset Strip on Friday March 10, 2023.  Operation Birthday was founded on the simple principle that all children deserve a birthday celebration. Its mission is to ensure each child feels special on his or her birthday by providing parents in need with Birthday Kits they are not otherwise able to afford.   Please support The Big Wheels’ fundraiser by making a donation today! Confidential Featuring legal talent from Buchalter; Travelers Rocking Friday for Music Will Confidential is a rock band straight out of Irvine with a splash from south of the border.  What started as a four man \"Dad\" band is now a five piece rock n' roll all night good time show comprised of: Jason Goldstein (Bass Guitar, Shareholder, Buchalter), Bob Dato (Lead Guitar/Mandolin, Of-Counsel, Buchalter), Abram Rodriguez (Lead Singer, Teacher, Mayfair High), Patty \"Snaps\" Oceguera (Drums, Legal Interpreter) and Matty West (Rhythm Guitar, Teacher, Coach, Author).  There always remains a chance of one or more \"special guests.\" The Confidential set list offers a broad range of appeal for music aficionados - from the novice to rock diehards like us.  And remember, no matter what happens before, at or after a  Confidential show: \"Your Secret Is Safe With Us.\" The Doughboys Featuring legal talent from Pillsbury Winthrop Shaw Pittman; Cloud Kitchens; TikTok Rocking Friday for Slave 2 Nothing Foundation Don’t let the name fool you. The Doughboys rock it hard. Mashing millennial pop and spitting OG lyrics, they are as deft with a mic as they are with a memo. The Doughboys are nine strong, and ready to rock with quality you can taste for In-N-Out Burger’s Slave 2 Nothing Foundation. Down By Law Featuring legal talent from Reed Smith; Constangy, Brooks, Smith & Prophete; Seals Phillips Rocking Saturday for Counsel for Justice Down By Law has been rockin' since 2016. Though the lineup has changed from time to time, the core that was formed out of desperation to convince their kids that they are cool remains. Inspired by Jim Jarmusch, SNL's \"More Cowbell\" sketch, Iggy Pop, and Karen Carpenter, DBL rocks to benefit Counsel for Justice (www.counselforjustice.org), and to answer the eternal question: \"Is she really going out with him? Gaba Groove Featuring legal talent from Gaba Law Rocking Friday for Music Movement Gaba Groove is a Reggae Punk Rock band from Orange County, California, spreading the messages of love and life through music. The Grind Featuring legal talent from Grindr; Domb Rauchwerger; Law Offices of John Given Rocking Friday for Transgender Law Center The Grind is committed to the full expression of our most authentic selves, including all sexual orientations, gender identities, and genres of music.  The Grind is Bill Shafton (General Counsel, Grindr), Zack Domb (Partner, Domb & Rauchwerger Employment Law Group), and John Given (environmental law solo practitioner), Gary Binford (Grindr's VP of Finance), Sean Henry (Grindr's Director of Product) and AJ Balance (Grindr's Chief Product Officer) and featuring special guests The Trans Chorus of Los Angeles.  The Grind proudly supports the Trans Law Center, the national trans-led organization advocating self-determination for all peoples. The JDRF Troubadours Featuring legal talent from Stealth Biotech; Wheeler Bio Rocking Saturday for Juvenile Diabetes Research Foundation (JDRF) The JDRF Troubadours have been raising money with Law Rocks for nearly a decade and have amassed over 11 Law Rocks appearances in New York City and Los Angeles since 2014. This year, the band is proud to be again raising money for JDRF at the world-famous Whisky a Go Go on Hollywood’s Sunset Strip on March 11, 2023.  The group has evolved over its years with the Law Rocks organization, with many friends and colleagues joining the group over time and playing under the names of Doc McCool and the Fools, the Rocke Lords, the Wolfpack, and CellarSonic.  The JDRF Troubadours bands together friends and family from Connecticut, Oklahoma, and Kansas to try make a difference for JDRF! With T1D, a person’s pancreas stops producing insulin—a hormone essential to turning food into energy. The daily life of someone with T1D brings a multitude of challenges, including insulin injections that need to be carefully balanced with eating and activity, disruptive glucose monitoring, sleepless nights—and wishing for a tomorrow where the struggle doesn’t exist.  Living with T1D means there are no days off and there is no cure. But there is hope. Your generosity will help JDRF fund life-changing breakthroughs to remove the incredible daily burden of this disease—until it no longer exists.  Please support The JDRF Troubadours’ fundraiser by making a donation today! Lodestar Featuring legal talent from Glancy Prongay & Murray Rocking Friday for Kids in Need of Defense (KIND) This is Lodestar’s 5th year playing a Law Rocks’ event supporting Kids in Need of Defense (KIND.) Lodestar focuses on delivering high energy Rock and Roll. Lodestar’s members promise that their 2023 performance will be the most fun, high energy set ever. Lodestar is: Guitarist and lawyer, Marc Godino; lead singer and lawyer, Gary Younes; vocals, percussionist and lawyer, Michael Ackerman; badass bassist, Dan Cubert; and Tom (the madman) Zevin on drums. The Nuisance Featuring legal talent from Latham & Watkins; Buchalter; Doll Amir & Eley; Allen Matkins Rocking Saturday for Heart of Los Angeles (HOLA) The Nuisance has participated in Law Rocks since 2014 and this year takes the stage with numerous Law Rocks veterans and long-time supporters of the Law Rocks mission. The Nuisance puts a new gritty spin on rock classics, from Neil Diamond to U2. Instagram Ocean Park Sound System Featuring legal talent from Raines Feldman; Kaiser Permanente Rocking Saturday for Communities in Schools Los Angeles Ocean Park Sound System creates analog, organic groove music.  Think retro-funk, reggae and dance rock for your head and your body. A decade ago, OPSS came together out the surf lineup at Ocean Park to create a true community vibe.  With members from Raines Feldman LLP, OPSS plays out all year at events, dive bars, festivals, and parties. OPSS loves taking it to the stage at Law Rocks www.oceanparksoundsystem.com Privileged Communications Featuring legal talent from Perkins Coie Rocking Saturday for The Access Project Privileged Communications comprises partner Michael Wise on lead vocals, partner Joe Hamilton on guitar, partner Lara Dueppen on keyboard and partner Oliver Gold on drums, with firm friends Niall Fordyce on bass and Steve Smith on guitar. While Privileged Communications does not have any available recordings currently, the group is in contract discussions with several large record labels and expects to perform at the Super Bowl Halftime Show within the next few years. Click below to follow or learn more: LinkedIn Twitter Facebook Whisky Kick Featuring legal talent from Michael Sullivan & Associates Rocking Saturday for Olive Crest Born in a suburban garage during the grueling boredom of the Covid pandemic, Whisky Kick features legal pros and close friends of Michael Sullivan & associates. We draw inspiration from our rock heroes of the 70s, 80s, and 90s... Although we may not look as good in tight leather pants. We're stoked to be pursuing the rock star dreams of our youth under psychologically favorable and financially stable conditions. Host - Paul Costabile Paul Costabile is an Emmy award winning host, comedian, writer, and producer. He hosted the iconic revival of Beat The Clock on Peacock, appears daily on NBC's New York and CA Live and can be seen on his travel series and podcast, Pop Up with Paul. Paul also recently wrote and starred in ClickUp’s “Declaration” Super Bowl Ad. Paul has hosted for Netflix, iHeartRadio, E!, Animal Planet, CBS, ABC, The CW, The Grammys, The Oscars, The Hollywood Reporter & Billboard. When he's not telling dad jokes to his two daughters, you can catch him hosting live events and performing stand-up comedy in clubs across NY and LA. Rock Judge - Elli Moore Elli Moore is an LA-based singer, songwriter, and recording artist. Responsible for co-founding LYRE Music Group, a female led songwriting and production development team, Elli has been working professionally in the music industry for over a decade. Her writing style spans many genres of music, but Elli is known for her success in the K-Pop space. Elli has been a part of several #1 Billboard charting albums and has worked with artists such as ITZY, Red Velvet, Kenzie Ziegler, Lexi Jayde, Fall Out Boy, Jo Yuri and more. Elli is signed as an artist to an independent label and is focusing on releasing music all throughout 2023. While her infectious pop tracks will have you hitting the replay button, it's Elli's raw vulnerability that makes listeners feel as though she's not only their best friend, but also that she's telling their stories just as much as her own. Listen to her on Spotify . Rock Judge - Patrick Alan Stone PATRICK ALAN STONE formed BUDDERSIDE following stints fronting Adler’s Appetite and working as a roadie for Lemmy/Motörhead. The band was supported by Lemmy who personally signed BUDDERSIDE to Motörhead Music and kickstarted their career. BUDDERSIDE bridge the gap between the sexy swagger of the Sunset Strip and the soulful depths of Seattle. The Hollywood, CA-based quintet conjure high-energy alt-rock anthems. Armed with the best elements of every vital decade of hard rock history, BUDDERSIDE excels in sonic storytelling- with Songs built for relatability, to empower listeners to endure and thrive. Their sophomore album Spiritual Violence was released in 2021 via Motörhead Music/ Silver Lining Music and was recorded by legendary producer Jay Baumgardner (Bush, Godsmack, Papa Roach) while being mastered by Grammy Award-winning engineer Howie Weinberg (Nirvana, The Smashing Pumpkins, Garbage) with guest appearances from Motörhead guitarist Phil Campbell and Butcher Babies vocalist Carla Harvey. BUDDERSIDE have since announced plans for a fourth album due via oneRPM in summer of 2022 which was recorded with producer Matt Good (Asking Alexandria, Hollywood Undead). The group have released multiple singles off the album including the track “Too Far” which marked their first-ever appearance in the Billboard Mainstream Rock charts at #81. BUDDERSIDE has toured extensively in the U.S. supporting acts including Motörhead, Slayer, Anthrax and L.A. Guns as well as being featured on international festivals including Rocklahoma, Wacken Open Air, Motörboat, Malmö Festival and the Monsters Of Rock cruise. Listen to BUDDERSIDE here: Spotify | Apple Music | YouTube For more information on BUDDERSIDE, please visit: FACEBOOK | INSTAGRAM | WEBSITE Rock Judge - Britt Lightning Britt Lightning is the lead guitarist for the legendary all female 80's rock band Vixen and is featured on the 2018 live album \"Live Fire\". Britt is also the Musical Director for Rock 'n' Roll Fantasy Camp, an immersive and life changing musical experience that allows people to live out their fantasies of jamming with their musical heroes such as Roger Daltrey (The Who), Paul Stanley (KISS), Slash (Guns N' Roses) and Alice Cooper, among other iconic figures. Britt has toured with 22-time Grammy Award winning artist Alejandro Sanz in his stadium-level world tour. Lightning is featured in Sanz’s \"La Musica No Se Toca – En Vivo\" CD/DVD and joined Sanz at the 2013 Latin Grammy Awards. Britt has performed with top pop artists Jason Derulo and Rachel Platten, promoting Rachel’s single \"Fight Song\" which charted at #6 on the Billboard Hot 100 chart and performed on national TV shows including Good Morning America, the Today Show, Live with Kelly and Michael, VH1, the Teen Choice Awards, Nickelodeon, America's Got Talent and more. Britt performed and recorded with Alejandra Guzman, an iconic Latin artist who has sold over 30 million records, and is featured on her latest live album and DVD, \"Live at the Roxy\". Britt graduated Summa Cum Laude from Northeastern University with a degree in Music Business and has a guitar performance degree from Berklee School of Music Rock Judge - Matthew Umhofer Matthew Umhofer has embarrassed himself repeatedly as a ten-time LawRocks “performer” and is best known for an acoustic rendition of Despacito that nobody ever asked for. To everyone’s great relief, Matthew will not be taking the stage this year to fill fans’ ears with feedback, and instead will be getting his Simon Cowell on, which is the closest he’ll ever come to being a judge.  He’s a former federal prosecutor and Skadden survivor who recently secured a $3 billion settlement requiring the City of Los Angeles to increase the amount of shelter and housing available to those experiencing homelessness.  He also once sprinkled several Taylor Swift puns into a civil complaint against Calvin Harris. Rock Judge - Anthony Bozza Anthony Bozza is a New York City-based author and journalist. He was a staff writer at Rolling Stone for 8 years. In 2002 he left the magazine to write Whatever You Say I Am: The Life and Times of Eminem, which was born of the unparalleled access and hours he had spent with Eminem while working on his Rolling Stone features and beyond. The book was a New York Times bestseller and an international bestseller, topping lists in England, Germany, France and South America. He then co-authored numerous autobiographies of artists including Slash, INXS, and Tommy Lee. He’s since written 7 additional NYT Bestsellers, including books on AC/DC and Artie Lange. His latest book, “Not Afraid” is a follow up to his first book on Eminem and will be released Nov 5. Rock Judge - Kathleen Wirt Kathleen Wirt has worked with hundreds of bands in the 33 years she has owned and operated 4th Street Recording, a boutique studio in downtown Santa Monica. In the early years, her tireless scouting and well- placed spec deals helped to launch major careers including Fiona Apple, Incubus, Hoobastank, and The Neighbourhood. In all, over 40 bands have scored record deals out of the studio, which continues to draw artists with its vintage analog gear and creative vibe. Some of her studio’s gold and platinum record awards include The Beach Boys’ “Kokomo,” No Doubt’s Tragic Kingdom, Fiona Apple’s “Shadowboxer,” Nelly Furtado’s Folklore, Weird Al Yankovic’s Straight Outta Lynwood, Hoobastank’s self-titled first album. Incubus’s S.C.I.E.N.C.E., Jack’s Mannequin’s Everything In Transit, and The Neighbourhood’s I Love You, which features the 5 x Platinum “Sweater Weather.” Most recently, the studio celebrated a #1 Billboard Album with Weezer’s Van Weezer. Kathleen often speaks on Industry event panels and shares with the community through Women In Music, mentorships, sponsorship of homeless artists, hosting recording programs for at-risk and incarcerated youth, and by promoting young women’s careers in music production through workshops and the studio’s internship program. Rock Judge - Mark “Kaz” Kasprzyk Formed in Hamilton, ON by Mark “Kaz” Kasprzyk, REDLIGHT KING made waves in 2011 with the release of their debut album SOMETHING FOR THE PAIN on Hollywood Records which included the #3 Billboard Mainstream Rock single “Bullet In My Hand” and a reimagined version of Neil Young’s “Old Man” of which Young approved the band to use a sample from his original song.  Their second album, IRONS IN THE FIRE, followed in 2013 and featured the single “Born To Rise” which is heard in the end title credits for the Lionsgate sports drama blockbuster Draft Day. Additional music from the band has been featured in movies and tv shows such as The Avengers, Iron Man 3, The Italian Job, FOX’s ‘Malcolm In The Middle’ and CBS’ ‘Person of Interest’ in addition to being licensed across sports networks including ESPN, Nascar, NFL, CFL, NHL, NBA and MLB. For their third album MOONSHINE, REDLIGHT KING went back to basics and recorded a very analog traditional rock sound with songwriter and producer Jimmy Messer (Foreigner, AWOLNATION) who released it on via his independent label, Parts & Labor Records. The Canadian-American rock outfit REDLIGHT KING signed to German rock/metal label AFM RECORDS in 2022 who will release the band’s fourth full-length album IN OUR BLOOD on March 3. Find REDLIGHT KING online at: FACEBOOK | INSTAGRAM | TWITTER Rock Judge - Chris Laffoon Chris Laffoon is a securities lawyer with over 20 years of experience in the music and entertainment industries and in private practice. He currently serves as Senior Vice President and Chief Counsel, Corporate & Securities, for Live Nation Entertainment, Inc., the world’s leading live entertainment company. A graduate of the University of Southern California School of Law, he began his career doing mergers and acquisitions and securities work in the Century City office of Gibson, Dunn & Crutcher LLP. Chris lives in Manhattan Beach, California with his wife, Liz, and their two sons, Elliott and Collin. Special Guests, The Recusals Special guests starring legal talent from The Northern District of California Federal Court The only band in the country featuring 7 federal judges (along some other real musicians). 12th Root of Two Starring legal talent from Hanson Bridgett; Peter Logan Law Offices Rocking for Blue Bear School of Music and St. Anthony’s We love to get people up and dancing. We cover some classic rock tunes, and a bit more. Brothers and Sisters of Invention Starring legal talent from Latham & Watkins; Levine Plotkin & Menin; Counsel LLP; Law Offices of Greg Anton Rocking for San Geronimo Valley Community Center The Brothers of Invention are both highly inventive - and brothers (with very essential sisters). Hailing from law firms ranging from a large international corporate firm to a solo practitioner in Sonoma, the Brothers (and sisters) will enthusiastically perform great music from the sixties and the seventies and have a fabulous time doing so. Cov'r Band Featuring legal talent from Covington & Burling LLP Rocking for The LGBT Asylum Project Cov'R Band is the house band of Covington & Burling LLP, and is comprised of attorneys and staff from the firm's San Francisco office. The band was formed in 2018 and plays an eclectic mix of rock, pop, and R&B songs, spanning across the past six decades. Cov’R Band consists of Nitin Subhedar on drums, Yurij Melnyk on bass, Sean Dongre on guitar and percussion, Stephen Green on guitar and vocals, Rik Jeffery on keyboards and vocals, Sabrina McGraw on saxophone, and Udit Sood, Bre Jones, and Khala James on vocals. This is Cov'R Band's second appearance at Law Rocks SF, and we are pleased to be supporting The LGBT Asylum Project. Facebook Jimmy's Brother Featuring legal talent from Winston & Strawn Rocking for The Gary Sinise Foundation (R.I.S.E. Program) JIMMY'S BROTHER is an LA-based rock n’ roll band. No gimmicks, no nonsense. Just vocals, guitars, and attitude. Formed in 2009 after a chance meeting around an old hotel piano in downtown LA, the band is known for its high energy mix of originals and cover songs, late night impromptu concerts at the Omni, and their legendary 2019 show at the Viper Room on Sunset Strip. Some boldly claim that Jimmy's Brother is one of the best acts to emerge from Winston & Strawn's Los Angeles office in recent years. Instagram The Latent Defects Featuring legal talent from Greenberg Traurig; Baker Botts; K&L Gates; Perkins Coie Rocking for Family Violence Appellate Project Formed in 2017, The Latent Defects (f.k.a. Attractive Nuisance) are proud to return at Law Rocks for the fourth time! The band, which managed to win “Judges Choice” in three of their last four performances, was formed as Greenberg Traurig’s house band and now includes a Verein of weekend warriors from four different law firms all flying a united banner of rock. This band goes to 11 and they are psyched to be with the people again. Morgan Lewis & ROCKius Featuring legal talent from Morgan Lewis & Bockius Rocking for Child Advocates of Silicon Valley Morgan Lewis & ROCKius brings together musical talent from Morgan Lewis’s Northern California offices, with amazing vocals, guitar, keys, and rhythm with a wicked horn section to lay down a '70s R&B/Motown/funk vibe, with current hits and classic chart-toppers in the mix. At Law Rocks, we’re honored to be rocking for Child Advocates of Silicon Valley to support children in the foster care system. We love playing together, and believe that music makes the world a better place. Join us for a great show—for an even greater cause! The R-23s Featuring legal talent from Lieff Cabraser Heimann & Bernstein Rocking for AABA Law Foundation Lieff Cabraser's The R-23s are veterans of the California legal rock scene who are celebrating their 10th year of musical collaboration -- which makes us one year older than overachiever younger sister Law Rocks-SF! Recent set lists from the band include songs by the Cranberries, the Who, the O’Jays, Sam & Dave, Amy Winehouse, and Chuck Berry. The R-23s features Anthony McDaniel and Liana Harris on vocals, Melissa Gardner on vocals and flute, Phong Nguyen on guitar, Charles Gonzalez on rhythm guitar and vocals, Djuna Gray on bass, Elizabeth Cabraser on drums, and Mark Chalos on piano/organ. We are delighted to be back at Law Rocks-SF, and can't wait to shake the Chapel to the roof and rafters! The Contract Killers Featuring legal talent from Latham & Watkins LLP Rocking for Belong Kitchen The Contract Killers are back for Law Rocks 2023, and are again representing Latham & Watkins LLP and Belong Kitchen, a neighborhood grab-n-go kitchen that employs adults with intellectual and developmental differences. The Contract Killers’ 2022 world tour sold out venues from White Oak Music Hall to The Cowboy Surfer and their fans simply cannot get enough of their intriguing sound, dynamic stage presence and boyishly handsome good looks. The Contract Killers are Tim Fenn (guitar, bass, vocals), Craig Kornreich (drums), Bryan Ryan (guitar, bass, vocals), Ben Marek (vocals, keys), Jordan Hudson (bass, guitar) and Michael King (guitar, vocals). DeSoto Rose Featuring legal talent from Godzina Law Firm, PLLC and Gibbs & Bruns, LLP Rocking for Baker Ripley Since 2020, DeSoto Rose has become one of Houston's favorite cover bands performing Americana, Indie, Folk Rock, Alt Country and a few 90s throw-backs for good measure. Fans enjoy rocking out to their unique versions of songs we all know and love. DeSoto Rose is: Heidi Kaim (lead vocals), Nick Karam (vocals, guitar, mandolin), Andy Bost (bass), Cameron Clark (keyboard, banjo), Bruce Godzina (drums), Frans Sluiter (guitar), and Mead Turner (vocals, fiddle). Featuring Ayesha Najam as a guest vocalist. www.desotorose.com Instagram Good Dolly Featuring legal talent from McGuireWoods Rocking for Crime Stoppers of Houston Good Dolly is an alt-rock band from Houston, Texas formed in 2021, composed of working professionals who fantasize about quitting their day jobs and chasing rock stardom on the open road. Instagram JarFly Featuring legal talent from Godzina Law Firm PLLC and Thomas Craig Construction Rocking for Houston Food Bank JarFly is a band that seeks to deliver the ultimate classic rock experience; they have delivered on their promise through over decade on the Houston scene; with influences ranging from The Rolling Stones to Led Zeppelin and David Bowie, they strive to tap into the zeitgeist of bygone days where heavy guitar, thundering bass, booming drums, and screaming vocals ruled the concert landscape; They come from the business world, but when rock o'clock comes around, they are all about the business of rocking the world. During the day, they toil at the behest of RockStar Realty, Thomas Craig Construction, Godzina Law Firm, PLLC, and TriCon Construction, but at night, the darkness unfolds to find them ready for battle, able and willing to take on all challengers; armed with an arsenal of heavy riffs and a never-say-die attitude, a performance from JarFly transcends a polite listening experience and, instead, becomes a multi-sensory pilgrimage; a journey if you will, through the various iterations of rock from a time when rock ruled the world; never failing to deliver, JarFly looks forward to bringing their unique brand of music to the White Oak stage; in cooperation with the Houston Food Bank, the night will be electrified and no one will leave the same as when they came to the venue. JarFly consists of Paul Gomberg on vocals, Tristan Berlanga on guitar, Elliot Alfred on bass, and Bruce Godzina on drums; with a plethora of legal and business acumen, JarFly seeks to shed themselves of the strictures of the work-a-day world and fly amongst the starts in the pursuit of rock glory. Will they be successful? Only you can answer that question. And whatever the question, the answer is rock'n'roll.... Soundcloud Pro Hac Vice Featuring legal talent from Akin; Locke Lord; The Law Office of Travis W. Earp; Enterprise Products Partners; The Friedkin Group; and Orrick Rocking for Chance for Hope Foundation Winners of both the overall event and the Judge’s Choice Award at the First and Second Annual Law Rocks Houston, Pro Hac Vice is reuniting to bring the hits from the most totally awesome era of music. It’s gonna be rad! For this year’s event, the band will once again be raising money for the Chance for Hope Foundation, a local charity providing support services for children with cancer and their families, and grant funding for pediatric cancer research. Featuring legal professionals from SIX separate organizations, Pro Hac Vice is: Charlie San Miguel (drums/percussion), Scott Davidson (lead vocals, synth, guitar), John Goodgame (guitar, vocals), Travis Earp (guitar, vocals), Mario Barrientos (bass, vocals), and special guest MCs Kurt Krolikowski and Andre Davison. Check out the band’s YouTube channel HERE ! Chance for Hope Foundation Fauxly Featuring legal talent from Foley & Lardner Rocking for Dr. Martin Luther King, Jr. Boys And Girls Club A side project of several members of the (only nominally) renowned and repeat Chicago House of Blues headliner The Salary History Ban(d), the all-attorney, all-from-the-same-firm members of Fauxly are excited to let (what's left of) their hair down, hit the distortion pedal, and have a blast raising money for great organizations! And what a great way to advance the national partnership between Boys & Girls Clubs of America and Foley & Lardner LLP! LinkedIn Instagram Twitter Facebook Flood Bros. Featuring legal talent from Circuit Court of Cook County; Tully & Associates Rocking for Digs with Dignity The Floods: 20+ years of Classic Rock, New Wave, and many, many curveballs - from Navy Pier's Grand Ballroom to all the now-shuttered bars and clubs on the Northside - Jim - Steve - John Good Colour Featuring legal talent from Bell Kearns Rocking for Rebuilding Exchange What do you get when you combine a country vocalist, pop guitarist, funk pianist, jazz bassist, and gospel drummer? You get a creative mix of music not quite like anything you've heard before – you get Good Colour. Started in 2022 in downtown Chicago by a couple of friends, the original goal of Good Colour was to jam on street corners and play some covers. But before long we started writing some BANGERS. Once we realized our potential, we focused on becoming an original-focused band with big aspirations. Inspired by an eclectic mix of genres old and new, from Chris Stapleton to James Brown to Maroon 5, Good Colour delivers its very own brand of unique and soulful music. We want our audience to feel good vibes, dance, and enjoy life, and our music reflects those themes. We hope you get down with us! La Fete Du Funk Featuring legal talent from Lake County State’s Attorney; Confluence Orthopedic Growth Strategies; After Hours Productions Rocking for Family Focus Like most, the members of La Fete du Funk share a collective belief: that the 1970s represent the pinnacle of music. For our money, rock and roll and disco reign supreme – in sound, style, attitude, and the sheer ability to make you move. La Fete sets out to combine the singular qualities of these two unruly genres – the electric racket, feel-it-in-your-chest bass and drums, and loud and unflinching style – in a disco-rock cocktail that gets your head stirred and hips shaken. So if you want a show, hit the theater. If you want a party, welcome to La Fete du Funk. Instagram lafetedufunk.com The Thornes Featuring legal talent from The Illinois Court of Claims; Laner Muchin; Attorneys' Title Guaranty Fund Rocking for Urban Initiatives The Thornes began as a group of fathers whose children attended Hawthorne Academy, a Chicago Public Magnet School located in the shadow of Wrigley Field. The dads were all accomplished musicians. We were first approached to start a band to support fundraising at the school (at one time we had 13 kids attending the school). The shows were a success drawing crowds from the community (Our motto is \" We don't suck as bad as you think we will!\") Over time we began receiving requests to perform at other fundraising events. Over the years, The Thornes have raised well over $100,000 for local charities. We have performed with \"Big \"Head\" Todd and Nicholas Tremulis. We also performed as the opening act for Big Head Todd and the Monsters. We have we won several \"Lawyers Rock\" battle of the bands competitions over the years. Band members include: Peter Birnbaum, Chief Justice of the Illinois Court of Claims and President of Attorneys' Title Guaranty Fund. Joe Gagliardo, a judge on the Illinois Court of Claims. Sean O'Brien, a human rights lawyer. Jeff Moster, Managing Partner UBS. Louie Kritikos, Broker at Dream Town Realty and Bob Barnett, managing director of Wexford Capital. Host - Don Bleu Dynamic and exciting professional broadcaster and host, waking the people by the bay for the last 35 years. An energized, creative self-starter with years of experience creating and implementing branding images, concepts and contests. Capabilities include radio broadcasting, television and social media hosting, script writing, and on stage hosting and auctioneering. Rock Judge - Morris Knight MORRIS KNIGHT is a musician/singer/songwriter and released his solo single “Thank You” in 2019. Check out his self-directed music video on YouTube. He is also the lead singer and bassist for new Bay Area-based rock band Sugar Rush. Their first release happened late last year with a rock-n-roll cover and music video of George Michael’s holiday classic “Last Christmas.” Professionally, Morris is a 20-plus year veteran San Francisco Bay Area radio personality! He can be heard on the radio weekdays from 9am - 2pm on the South Bay’s Classic Rock 98.5 KFOX and then every weekday afternoon from 2pm - 7pm on 96.5 KOIT! Rock Judge - Jack Friel Jack Friel is the lead singer, guitarist and main songwriter for SF-local Rock & Roll band Treasures. Born and raised in San Francisco, you can catch him playing or attending local shows or sailing on the bay on weekends. www.treasures.band Band Instagram Personal Instagram Rock Judge - Trixie Rasputin Trixie Rasputin is a piano player, singer, and all-around good-time Bay Area entertainer. She has been the lead singer for four rock bands, including The MudLords, Trixie & the Skates, Blackmoon, and Tedbaby. Her powerful female vocals guide the music, and the intense live shows give audiences something they can return to time and time again. She loves to write original music and play in bands as opportunities arise. When not performing, she is actively booking and promoting shows for local and touring bands. Find Trixie's bands, events, and productions here . Rock Judge - Andrew Thomases Andrew Thomases is an Intellectual Property lawyer by day, and an independent recording artist by night.  In his day job, Andrew practices IP Litigation in the Silicon Valley office of Ropes & Gray, where he is co-chair of the firm’s Technology, Media & Telecom group.  Andrew counsels clients in all industries in areas involving patent, copyright, trade secret, and trademark law.  His clients run the gamut and include some of the biggest players in the semiconductor, networking, software, video streaming, and medical device fields.  He has tried cases all over the United States and has represented clients from around the globe. At night, he writes, performs, and records his own music.  His genre is alternative rock with meaning, which he often refers to as “conscious rock.”  His songs spur curiosity and his lyrics ask tough questions about such topics as climate change, division in our country, our impact on other species, and our unending yet harmful quest for perfection.  But he also has a humorous side and recently released a song looking back on his antics as a teenager growing up in the New York suburbs.  His music style ranges from classic rock, to 80s alternative, to chill rock, and some 90s vibes thrown in for good measure. Thousands of listeners have enjoyed his tunes on Spotify and other platforms, and his music videos have tens of thousands of views.  Check out his website at www.andrewthomases.com for links to all of his music and videos, and sign up for his newsletter while you are there.  He is also on Instagram and Facebook at @AndrewThomasesMusic, and his YouTube channel is at Andrew Thomases Music - YouTube. Rock Judge - Steve Savage Executive Director Steve Savage, Ph.D., a Blue Bear founder and current President of the Board of Trustees, is an active producer and recording engineer and has been the primary engineer on seven records that received GRAMMY nominations, including CDs for Robert Cray, John Hammond, The Gospel Hummingbirds and Elvin Bishop.  He is former Chapter President and National Trustee of the San Francisco Chapter of the Recording Academy and teaches in the Humanities Department at San Francisco State University.  Steve has a Ph.D. in musicology from The University of London and has three recently published books: Mixing and Mastering in the Box from Oxford University Press, The Art of Digital Audio Recording from Oxford University Press, and Bytes & Backbeats: Repurposing Music in the Digital Age from The University of Michigan Press.  Steve also sits on the board of Spirit Series, which is a drama-based character education curriculum that brings inspirational biographies to life. More at stevesavage.net . Host - Alexander Ansari Alexander Ansari is a first-generation American born in Houston, Texas. His father, a Muslim from Pakistan, and his mother, a Christian from Haiti raised him and his brother with a deep understanding that regardless of cultural background, humanity unites us all. Alexander learned from an early age that people have much more in common than they realize. Today, Alexander shares his message of unity through his personal “Philosophy of Diversity.” His diverse background includes sales, learning & development, marketing, executive coaching, and public speaking. He founded Stay Diverse Inc., a 501(c)(3) non-profit organization that promotes multiculturalism and diversity. He is passionate about live rock music and loves how it unites people around the world. Rock Judge - Foster Johnson Foster Johnson is a partner with Ahmad, Zavitsanos, and Mensing, PLLC.  Prior to law school, Johnson was the co-founder and principal songwriter for the San Francisco based rock band, Vegas DeMilo.  His songs have been featured in dozens of films and television shows including Clubhouse (CBS) \"Precious\"; Felicity (WB Network) \"Acid King\" and \"Precious\"; One Tree Hill (WB Network) \"Higher\" and \"All My Life\"; The Osbournes (MTV) \"Teen Age Porn Star\"; Skate (NBC) \"Chemical Girl\"; Just Deal (NBC) \"Dusted\" and \"My Brilliant Career\"; Pasadena (Fox) \"Fall\"; and the motion picture Scorched, featuring “Fall.” Between 1997 and 2002, Johnson's band released three widely praised albums, received airplay at over sixty commercial rock stations across the U.S. (including LIVE 105 in San Francisco, KROQ in Los Angeles, and WXRK in New York), and toured extensively, including multiple appearances at such prestigious festivals as SXSW, NXNW, and CMJ.  Their visibility prompted Billboard magazine to hail Vegas DeMilo as a band \"on the verge of a national breakthrough\" and Music Connection to name them one of \"California's hottest unsigned acts.\"  The band's third album, Motel California, released on LA indie Pinch Hit Records sold several thousand copies and was the most extensively licensed album in the history of the label.  Currently, Johnson continues to record for film and television as well as producing and writing songs for other artists. Vegas DeMilo’s long-awaited fourth album, “Black Sheep Lounge,” is slated for release in September 2023. Rock Judge - Michael Mikulka Engineer, producer, and studio owner, Michael Mikulka has been fortunate to be able to do what he loves as his career, and do it successfully for over 36 years.  Michael is a 30-year Grammy member/voter, has had his songs recorded by major label artists,  and has earned 1 platinum and 3 gold records. He ran his own successful music studio complex (recording, mastering, rehearsal, live sound) in the highly competitive Southern California music scene for over 20 years before relocating to Houston. He is currently the owner of LUCKY RUN STUDIO, arguably the busiest and one of most prestigious recording studio facilities in the Houston area, where they have produced recordings for more than a dozen Grammy-winning and Grammy-nominated artists, as well as countless unsigned acts, in and around Houston. Michael has been fortunate to work with such artists (in California and Texas) as Ambrosia, Beck, Berlin, BB King Band, Bill Medley, Clark Sisters, Lady Gaga (Super Bowl Show), Leon Russell, Red Hot Chili Peppers, Sting, Tiffany, Tito Jackson (Jackson 5), Toby Keith, and  Willie Nelson. Learn more at Lucky Run Studio’s website . Rock Judge - Evelyn Rubio Evelyn Rubio, blues singer and saxophonist, carries a theme in her heart and that theme relates to what she identifies with the idea that “The blues has no borders”. Born in Mexico (Neza City) and raised through her formative years in Mexico City, it may be surprising to learn that Evelyn actually began in show business at the early age of nine. Then just two short years later, at the age of eleven, Evelyn would be a regular on a children’s television show “My Little Stars”. By the age of fifteen Evelyn was now earning a nice living as a rock and pop singer with various established bands in and around Mexico City and then at the age of 19 she began learning the saxophone and writing songs as well. Then in 1999 Evelyn recorded and released her first album “Evelyn Automarginados” which is a wonderful funky blues collection of music. Next, for over a period of five years, Evelyn would devote her focus on music between a black tie orchestra and a rocking blues band named “Chivo Azul”, in Playa del Carmen. Next, in 2004, Evelyn would land the lead role in Jesus Christ Superstar, a Canadian production in Mexico, as Mary Magdalene. Shortly afterward Evelyn would emigrate to Houston, Texas and sign a multi-year album contract with the late, great Calvin Owens, a BB king band leader. Right after signing the agreement Mr. Owens would produce Evelyn’s second release, “La Mujer que Canta Blues”. Then it was right back into the studio for Evelyn’s current release, “Hombres” but unfortunately Mr. Owens passed and Evelyn continued to produce and finish the album along with Andy Bradley. In 2011 Evelyn became a member of The James Boogaloo Bolden Blues Band (the last BB king band leader) playing at festivals and went on to release an album in 2013 titled, “No News just The Blues”. Time moved forward and with the much anticipated release of “Hombres” the CD received the nomination for The Jimi Awards as International Release of the year 2015 and then on March 8th 2016 due to an overwhelming number of spins by Disc Jockeys of “Hombres” nationwide Evelyn moved to number 1, number 3, and number 6 respectively – charting on the internationally recognized Billboard Magazine. She charted at #1 Latin Pop Album – #3 Latin Album – and #6 Blues Album. In 2022, Evelyn was invited to perform at The Women Songwriters Hall of Fame in Washington DC and made her debut on the big screen with her role of Aria in the short film \"Ocean Child\".  Evelyn is recording her fifth album at Wire Road Records and planning to release it in the next couple of months. Rock Judge - Al Staehely Al Staehely is an entertainment lawyer based in Houston, Texas. He has specialized in legal matters pertaining to the music and film industries since 1979. His clients include musicians, record labels, music publishing companies, and distribution companies. He handles various matters related to recording, publishing, sub-publishing, and licensing both domestically and internationally. Al is also a musician whose roots in the Austin music scene combined with his experience writing and collaborating with artists in Los Angeles (most notably as front man in the psychedelic rock band Spirit) have allowed him to create a sound all his own. Seamlessly blending classic rock, soulful blues with a commanding stage presence, Al is just at home playing intimate solo shows with an acoustic guitar on his knee as he is taking center stage at a rock show. Al's engaging lyrics and creative melodies have peaked the interest of other artists who have recorded his songs- Keith Moon (The Who), Marty Balin (Jefferson Airplane), Peter Cox (Go West), The Nick Gravenites/John Cipollina Band, as well as performers from his own back yard, most recently Houston R&B vocalist Annika Chambers. This summer, via Quarto Valley Records, Al will be releasing new music with his first single “Something Good Is Gonna Happen”  with a full album on the way.\" Learn more about Al at alstaehely.com and music-lawyer.com. Host - Charles “Chuck” Jarrell Charles “Chuck” Jarrell is a partner at Allen Matkins. He is a trial lawyer, whose practice focuses on complex business litigation, with an emphasis on real estate and partnership disputes. Chuck also serves on the board of Law Rocks and the Ketchum-Downtown YMCA. He has emceed numerous Law Rocks event, and his band, The Nuisance, has played the LA Law Rocks event at the Whisky since 2014. Rock Judge - Barry Horwitz Barry Horwitz is a Shareholder in the Chicago office of Greenberg Traurig, where he practices intellectual property law, including a focus on copyright and trademark litigation, prosecution and counseling.  An award-winning songwriter, Barry has played piano since he was five years old, and taught himself to play guitar beginning at age twelve.  Having planned to be a lawyer from a young age, Barry’s musical endeavors included his membership in a college a cappella group, playing live shows with his band Guy Incognito at many venues in and around Chicago, and the release of several studio albums—including the band’s most recent studio EP, released in 2016, entitled The Great Unknown (available on Spotify, Apple Music, etc.) More recently, Barry has been a proud member of The Opposition, a group of trademark lawyers and professionals from all over the world who converge and collaborate twice each year at the annual and mid-year meetings of the International Trademark Association.  In fact, Barry will sing and play keyboards and guitar with The Opposition on over a dozen songs when they play the Hard Rock Café in Singapore next week. When he is not traveling, Barry is the frontman of Guy Incognito, winner of the inaugural Law Rocks Chicago back in 2018. Rock Judge - Britt Julious Britt Julious is a writer, editor and essayist for publications like The New York Times, Vogue, Bon Appetit, Esquire, ELLE, Women’s Health, and others. She currently serves as the music critic for the Chicago Tribune. As a creator, Britt’s work focuses on the intersection of art, culture, race, feminism, and politics, and she is a firm believer in the underground, the avant-garde, and the underdog. In 2019, Britt won the Studs Terkel award in journalism for her work spotlighting underserved communities. Rock Judge - Miriam Goldberg Owens Miriam Goldberg Owens is the President and Chief Executive Officer of The People's Music School. She has served on the organization’s leadership team since August 2021. Her career roots are in driving equitable outcomes in public education: she was a 5th grade science teacher in Brooklyn with Teach for America and a Program Manager at Raise Your Hand Texas, an education advocacy organization. Prior to joining The People’s Music School, Owens was a consultant at McKinsey and Company for eight years, where she was an Associate Partner. A leader in the firm’s Organization practice, Owens served clients in areas including strategic planning, large-scale reorganization, talent management transformations, and inclusion and diversity. A native Texan and proud Latina, Owens is also a lifelong musician. She studied piano from grades K-12, and at Harvard spent four years in the women’s a cappella group The Radcliffe Pitches, serving as Music Director and Stage Manager. She is currently the lead singer in the rock cover band Model-J, which proudly plays \"songs you love to remember, and songs you forgot you loved.\" She holds an AB from Harvard University, an MS in Education from Relay Graduate School of Education, and an MBA from the University of Chicago Booth School of Business. Rock Judge - Jessi Roti Jessi Roti is a music and culture journalist based in Chicago, IL. Her work has been featured in the Chicago Reader, Condé Nast Traveler, Thrillist, The Triibe, Illinois Entertainer, and Audiofemme. For 3 years, she worked at the Chicago Tribune covering music, nightlife, and pop culture. In 2019, Roti was a finalist in the Best Music Coverage category at the Peter Lisagor Awards for her coverage of K-Pop's influence across the city ahead of group BTS' sold-out concerts at Soldier Field and LGBTQ+ history and advocacy behind beloved Chicago record store and foundational industrial label, Wax Trax! Records. Before professionally working in journalism, she was part of the team behind the blog Local Loop Chicago, which highlighted rising, local artists and was voted runner-up for favorite music blog in the Chicago Reader’s citywide “Best of Chicago” poll in 2015. Roti also works in artist hospitality, concert management, and live event coordination. Elliewood Review Featuring legal talent from Crowell & Moring Rocking for Gifts for the Homeless Based in Washington, D.C., Elliewood Review is a cover band that seeks to re-create the feel of your favorite college bar bands with a diverse repertoire spanning classic rock, modern rock anthems, Motown, disco, modern pop and Top 40 hits. Originally formed in Charlottesville, VA in 2019, Elliewood Review is comprised of UVA Law graduates who enjoy bringing good tunes, inventive covers, and danceable music to friends, family, and strangers alike. Instagram Harmful Interference Featuring legal talent from Federal Communications Commission; Meta; Wireless Infrastructure Association; USTelecom; Verizon; Somos Rocking for Miriam’s Kitchen Harmful Interference is made up of telecom law and policy geeks who play in various original and cover bands around the city. While we don’t always agree with each other in our 9 to 5 jobs, we all agree that we are really excited to be back at the 9:30 Club, especially because we are rocking again for Miriam’s Kitchen, an organization dedicated to ending homelessness in Washington DC. It is almost as exciting as talking about Pole Attachments or Part 15 Waivers! Our set features an eclectic mix of rock covers and covers of covers. We may have to file an ex parte at the end of the show, but it will be worth it! Larry and the LandLawyers Featuring legal talent from Walsh, Colucci, Lubeley, & Walsh Rocking for The I.M.P. Family Fund Walsh, Colucci, Lubeley & Walsh has a little known secret weapon at its disposal: the powerful sound of Larry and the LandLawyers, a rollicking band led by three attorneys at the firm: the esteemed Mark Goetzman on lead vocals and rhythm guitar, the amazing Mike Kieffer on lead guitar, the super-cool John Rinaldi on the Bass Guitar. They are joined by the Larry Clark (of FDG) on Drums. Morgan & The Missed Opportunity Featuring legal talent from The Authors Guild; USTelecom; Verizon Rocking for Guitars 4 Vets M&TMO is a collection of legal and other DC professionals who pour their talents into turning up the volume and energy on Americana and classic rock, and pour their whiskey into tall glasses. Noise in the Basement Featuring legal talent from Venable; Gordon Rees; Steptoe Rocking for Together We Bake Once upon a time in the early 2010s, a group of friends embarked on a musical adventure to transcend time and keep the electrifying essence of alternative rock alive. Born out of their mutual love for the music’s rebellious spirit and groundbreaking tunes, Noise in the Basement emerged to pay homage to the edgy legends of yesterday and today that continue to rock the world. NITB takes audiences on a nostalgic rollercoaster ride, igniting memories of screaming along to the angsty anthems once burned on CDs and recorded on mixtapes, and turning heads by playing genre-bending curveballs of songs old and new, just to keep everyone on their toes. So, put on your Chuck Taylors, Doc Martins, Vans, or dancing shoes of your choice, and let NITB remind you why alt-rock ruled the airwaves and your soul. Facebook Instagram The Precedents Featuring legal talent from Willkie Farr & Gallagher; Interactive Brokers; DOJ; McGuire Woods Rocking for Gifts for the Homeless The Precedents have been together for 18 years. We are the band that all others must follow. The Terrifying Words Featuring legal talent from the Office of the Attorney General for the District of Columbia Rocking for Horton’s Kids “We’re from the government and we’re here to help” . . . help ROCK THE HOUSE, that is! The Terrifying Words includes lawyers from the Office of Attorney General for the District of Columbia who have come together to bring peace, love, and rock n’ roll to Law Rocks DC 2023! A Band Named Sue Featuring legal talent from Schindler Cohen & Hochman; Parker Pohl; White & Case Rocking for New York Lawyers for the Public Interest (NYLPI) The lawyers in the Band Named Sue embarked on their paths to rock stardom at the renowned incubators of rock n’ roll: big law firms White & Case, Simpson Thacher & Bartlett, and Bryan Cave. Currently, bassist Tom Macwright (restructuring partner at White & Case), Guitarist David Pohl (co-founder of the Manhattan-based litigation boutique Parker Pohl LLP), and drummer Matt Katz (partner at the Wall Street litigation and art law boutique Schindler Cohen & Hochman LLP) are all regulars in the robust dad-band scene in Maplewood, NJ. Keyboardist, Bill Ferullo, is the Deputy General Counsel at Safe Fleet and performs in a variety of Brooklyn-based rock and electronic projects. Lead singer/rhythm guitarist Charlie Pollock is a veteran of stage and screen (including starring in several Broadway musicals) and in his spare time enjoys rocking out with lawyers. Amperband Featuring legal talent from McCarter & English Rocking for The Community FoodBank of New Jersey Meet Amperband, the legal legends from McCarter & English who advocate in the office & harmonize on stage! Why are we called Amperband? It's our tribute to the mighty '&' symbol, the unsung hero that connects words & phrases, like we connect legal arguments & our fans to chart topping hits from yesteryear. Formed in 2023, our debut performance was at our Partner Retreat at the on the big stage at Johnny Cash Bar & BBQ in Nashville, where we rocked so hard, we made sure even the Man in Black himself would've demanded an encore. We're ready to take a bite out of the Big Apple next, all in the name of charity (& maybe a little bit of law firm supremacy). Because nothing says \"fighting for justice\" like righteous dance moves & a rockin' good time. Amperband boasts as much expertise in riffs & rhythms as we do in regulations & rulings. Our ensemble includes seven members from five offices & a whole lot of legal wit & musical talent. So, if you're ready to see lawyers trade their courtroom attire for ripped jeans, leather jackets & guitar picks, join us for a night of melodies & maybe even a few legal puns that are so bad, they're criminal. Instagram Dirty Scriveners Featuring legal talent from Cozen O'Connor Rocking for Access Justice Brooklyn The Dirty Scriveners is significantly less than the sum of its parts. The band is comprised of Cozen O'Connor lawyers from multiple disciplines - litigation, intellectual property, real estate, labor & employment, and a government relations professional from Cozen O'Connor Public Strategies. They have worked on the biggest deals, advised clients on their patent portfolios, worked to make change at City Hall, and have even argued and won cases at the United States Supreme Court. Yet they still have trouble with those B7 add 13 (no5) chords. Their musical taste is so vastly different that they almost didn't make it up the elevator to their first rehearsal. But they ultimately did, and even if the world is not a significantly better place for it (and it certainly is not), the Dirty Scriveners will bring some joy and may just surprise you (and the world). LinkedIn Instagram Lodestar (and the Positive Multipliers) Featuring legal talent from Glancy Prongay & Murray Rocking for Kids in Need of Defense (KIND) Lodestar focuses on delivering high energy Rock and Roll in the Los Angeles area. Lodestar promises that the band’s New York City debut performance will be the most fun, high energy, rockin’ set ever. Lodestar is: Guitarist and lawyer, Marc Godino; lead singer and lawyer, Gary Younes; vocals, percussionist and lawyer, Michael Ackerman; badass bassist, Dan Cubert; and Tom (the madman) Zevin on drums. The Meltones Featuring legal talent from Greenberg Traurig Rocking for East Harlem Tutorial Program/East Harlem Scholars Academies Look no further - global law firm Greenberg Traurig is excited to have its house band, The Meltones, back to rock out 80’s style at Gramercy Theatre. The Meltones, named after a firm founder Mel Greenberg, have been rocking in various incarnations since the mid-1980s, and are proud to be seven-time Law Rocks NYC Champions, with their sights set on number eight! The Meltones have raised hundreds of thousands of dollars for local non-profits and couldn’t be more thrilled to play for The East Harlem Tutorial Program for the second time. The Meltones are comprised of 10 bandmembers: On guitar, Co-Chair of Global Real Estate Practice, Stephen Rabinowitz, New York Real Estate Associate Jennifer Hall (also on vocals); On guitar, Miami Real Estate Shareholder, Burt Bruton; On keyboard, Albany Government Law & Policy Shareholder, Christopher A. Cernik; On vocals, New York Litigation Of Counsel Ashley LeBlanc, Las Vegas Litigation Shareholder, Michael Hogue; Chief Shareholder Recruiting and Integration Officer, Tracy Newirth and the Atlanta office Business Director, Tony Hatchett; on drums, New York IT Support Specialist, Jim Mussen; Vice President of Business & Legal Affairs, Global Digital Business at Sony Music Entertainment and former GT New York Associate Daniel Blumberg joins as our guest artist on bass. The Objections Featuring legal talent from Davis Polk & Wardwell Rocking for Advocates for Children of New York “A band whose appeal can never be denied.” REDACTED Featuring legal talent from Cowan, DeBaets, Abrahams & Sheppard Rocking for New York Stem Cell Foundation Let's go back to the days of Doc Martens and flannel, baggy jeans and floppy hats, when MTV still played music and CDs were still high-tech. These rock 'n roll legal pros will bring you there. But we can't reveal their name. It's REDACTED. Instagram Several Dudes Featuring legal talent from General Dynamics Mission Systems; Midtown Alliance; Starr, Gern, Davison and Rubin Rocking for League of American Bicyclists Several Dudes got together in the late 80's to write and play groovin' music for a loyal following in Atlanta while most of the dudes were in law school and medical school.  Now mostly lawyers and a doctor on the back ends of productive careers, the band has reformed to honor founding lead guitarist Nick Stevens after his tragic death in a cycling accident.  The band releases a new original song the first Friday of most months to keep Nick’s memory and spirit alive and to raise money for cycling safety advocacy through the Several Dudes/Nick Stevens Cycling Safety Advocacy Fund with the League of American Bicyclists in Washington, DC.  You can check the tunes out on your favorite streaming service or the band’s website: www.severaldudes.com.  Like back in the day, Several Dudes' new music will move your body and soul. Teddy and the Troubadours Featuring talent from ReNAgade Therapeutics; Allen Matkins Rocking for Operation Birthday Teddy and the Troubadours, comprised of Law Rocks veterans from both coasts, are thrilled to support the amazing team with Operation Birthday (“OpB”) at this year’s NYC Law Rocks benefit concert on October 19th at the Gramercy Theatre. OpB took home the coveted Law Rocks “Hustle and Heart” award earlier this year at the 12th annual Law Rocks LA concert enabling them to help more kids have their dream birthdays! This amazing 501(c)(3) non-profit’s mission is quite simple - to help as many kids as possible who are in economic need to be able to smile once again at the sight of a simple but significant moment: a birthday celebration their families could not otherwise afford.  In support of OpB, the band promises to bring ‘da noise to the stage, with long-time Law Rocks bandmates who collectively have played over 20 Law Rocks concerts in New York, Los Angeles, and online during the pandemic (Law Rocksapalooza), raising in sum well over $420,000 for various non-profits over the years. The band is supported by legal talent from ReNAgade Therapeutics of Boston and Allen Matkins LLP of Los Angeles together with Law Rocks rockers from the NYC area.  Prepare to rock with TATT!!! Host - Lisa Berigan Lisa Berigan has been a trusted voice in Washington, D.C. for years. Her passion for music and the DMV region are evident during every show on BIG 100, Washington’s Classic Rock. Lisa makes the workday fun for her loyal audience with games and giveaways, along with popular segments like the BIG Guitar Riff of the Day, 11 o'clock LIVE, and Lisa's Animal Tales. And, when rock stars come to town, Lisa is the first call they make. She is also the host of the nationally-syndicated radio program, ‘Live in Concert.’ Lisa is a proud mother to fur babies and is involved with many local charities. Her passions include animals, travel, concerts, sports, and wellness. Judge - Daniel Gomez Daniel \"Dan\" Alexander Gomez is an accomplished singer-songwriter and multi-instrumentalist hailing from Caracas, Venezuela, and currently based in the Washington DC area. He is also the founder and director of Distrito Music Fest, a philanthropic effort committed to supporting and showcasing the rich talent of Hispanic American artists in the DMV region. Judge - Gregory Grainger Greg Grainger is an accomplished professional musician and original founding board member of The MusicianShip. A self-proclaimed “drum junkie”, Greg is as at home with pop, soul and rhythm and blues as he is with fusion, swing, rock and hip-hop. His world debut came at the age of 19 as the youngest member of the group Pockets, the protégé band of Earth, Wind and Fire, where Greg was the percussionist. He began drumming at age seven, jamming with his musical family and neighborhood buddies. At the age of 14, Greg was awarded a scholarship to the highly respected Peabody Conservatory of Music at Johns Hopkins University. Greg also attended Morgan State University studying Music Education. Something very close to Greg’s heart is The Musicianship - a non-profit providing instruction to children who may otherwise not have the opportunity to study music and who are suffering from an underfunded school music program. The charity was inspired by Greg’s daughter Dianne - a seasoned musician and Music Educator who tragically passed at a young age. You can learn more about the charity at www.themusicianship.org. Judge - Eric Liley Eric Liley, Executive Director and CEO for The Musicianship, is a seasoned Marketing and Communications executive with over 25 years of experience in the Entertainment and Media industries, including work in the for-profit and non–profit arenas. His breadth of expertise includes TV programming, music licensing, multicultural marketing, branding, event production, talent relations, business affairs, youth advocacy, social impact, and diversity & inclusion. Over the years, Eric has held a variety of management positions in marketing at Fortune 500 media/broadcast companies as well as leading non-profit category leaders. His experience includes roles at Gannett/USA Today, Showtime Networks Inc, BMI Music, and Boys & Girls Clubs of America. In 1995, he served as the President of the NY Chapter of The National Association of Minorities in Communications (NAMIC), the organization’s largest chapter at the time. His extensive media experience included time abroad when, in 1999, he assumed the role of Senior Vice President Global Sales & Marketing for Net4Music Inc., an award-winning digital music company. Net4Music, headquartered in Paris, France, was ultimately acquired by Minnesota-based Coda Music Technology in 2001, one of the industry’s leaders of innovative digital products songwriters, composers, and producers. Judge - Evan Moses Evan is a trademark lawyer, the founder of the local community concert series \"Live in Rose Park,\" and most notably, a four-time Law Rocks veteran and former Judge’s Choice award winner with his band Rock Creek Kings. Originally from Montreal, Canada, Evan is of-counsel to the Boutique IP and litigation law firm the Concept Law Group on trademark, patent and copyright prosecution and litigation matters and holds an LL.M. in intellectual property law from the George Washington University School of Law. His band’s single More of You recently passed the 100,000 streams mark and you may just recognize him from the cover of the Washington Post’s Weekend Section. A veteran frontman of over 100 shows at venues and music festivals across the east coast, Evan's a true double-threat. Judge - Stacy Puente Stacy Puente is a musician, singer/songwriter, and front person for several DC area rock bands, including three-year Law Rocks veteran G.O.A.T. Rodeo. At an early age, Stacy began singing and playing piano to avoid outdoor sports, thus cementing a lifelong passion for music and fear of outdoor sports.  In addition to keys, Stacy plays mediocre guitar, drums, bass and ukulele - and she is working on a machine that will enable her to play them all poorly at the same time.  Her band performs in the DC area and looks forward to releasing its EP next year. Stacy is an experienced litigator, mediator, and legal counselor. She currently serves as Ombuds of the Securities and Exchange Commission. Host - Maria Milito Maria Milito has been heard on the New York radio and television airwaves for over 25 years. Whether you’re in the Tri-State area listening to Q104.3, New York’s Classic Rock Station or traveling nationwide, one might find it difficult to escape her signature voice as a host on iHeartMedia’s Classic Rock network—from Spokane WA to Allentown PA. Maria also adds author to her list of credits with the publishing of “Clarice and Friends...How They Helped Mend the Hole in My Heart,” a collection of emails from her listeners sent to her when her beloved dog Clarice passed away. A huge animal advocate, Maria can often be found at animal functions and charity events and has an animal/nature/environment podcast on the iHeartRadio app called “Maria’s Mutts & Stuff”; download the app and listen today! Blog Facebook Instagram TikTok Twitter Exit Left Featuring legal talent from Bilzin Sumberg Rocking for Alzheimer's Association Southeast Florida Exit Left has become one of Florida's hottest musical acts! Featuring both male and female lead vocalists, the band offers a dynamic and diverse sound that is perfect for any occasion. The band's members are all seasoned musicians with extensive experience performing live in various original, cover, and tribute bands. Susie Ramirez provides the band's keyboard/synth sounds and delivers euphonic and charismatic lead vocals, while Drew Ramirez, our resident guitar virtuoso, delivers electrifying lead guitar and lead vocals. Ted O'Connell brings solid and groovy bass guitar licks as well as lead vocals to the mix, and Carson Martin provides a tight and energetic drum beat and also provides lead and backing vocals. Exit Left is known for their amazing sound quality and song delivery, making them a must-see act for anyone who loves great music. They cover a wide range of rock and party hits, from classic rock to modern rock, pop rock, and everything in between. Website Facebook Instagram Twitter TikTok The Meltones Featuring legal talent from Greenberg Traurig Rocking for Big Brothers Big Sisters of Miami Global law firm Greenberg Traurig is excited to have its house band, The Meltones, gracing the stage at the Miami Beach Bandshell Thursday, Nov. 9. The Meltones, named after firm co-founder Mel Greenberg, have been rocking in various incarnations since the mid-1980s.  Now they have their sights set on defending their title as the 2022 LawRocks-Miami champions, right on the home turf of Greenberg Traurig’s founding office! The Meltones have raised hundreds of thousands of dollars for local non-profits in New York and Miami and couldn’t be more thrilled to play for Big Brothers Big Sisters of Miami. The LawRocks-Miami edition of the Meltones includes three attorneys from GT’s Miami office: Shareholders Burt Bruton on guitar and vocals and Jessica Fishfeld on vocals, and recently joined Associate Josh Tartell on guitar, with able backing from three local Miami musicians Larry Misrahi on bass and vocals, Noel Cleland on keyboards, and Joe Arencibia on drums. The Urge Featuring legal talent from Meland Budwick, P.A; Bilzin Sumberg; Clyde & Co Rocking for Young Musicians Unite The Urge — A rock cover band playing throughout South Florida.  The band has played together in various incarnations since 1996.  With hundreds of songs in their repertoire, The Urge is now focused on more guitar oriented, heavier and edgier material, but will still break out the classic oldies.  The band features Fred Fein, managing partner, Clyde & Coe, lead vocals/guitar; Mark Meland, partner, Meland Budwick, P.A., lead vocal/bass; Joe Hernandez, partner, Bilzin Sumberg Baena Price & Axelrod LLP, lead guitar/vocals; and Frank Del Campillo, drums.  The Urge is playing for Young Musicians Unite (“YMU”) which believes that every student deserves access to music education regardless of their socio-economic background.  In fact, Mark Meland is currently on the Chairman of the Board of YMU and is an alum of the Miami Beach High School Rock Ensemble which is a YMU run organization.  Notably, the stage at the North Beach Bandshell, the Law Rocks venue, is “The Clark Douglas Burris Stage” who was the original founder of the Rock Ensemble and taught music at Miami Beach Senior High School for 40 years while fighting MS. Wide Awake Featuring legal talent from GrayRobinson Rocking for Showering Love Wide Awake, the U2 tribute band hailing from Miami, Florida, is a musical powerhouse that captures the essence and electrifying energy of the iconic Irish rock band. With a passionate and meticulously crafted performance, Wide Awake manages to transport audiences back in time to experience the legendary U2 sound that have left an indelible mark on music history. From their flawless renditions of U2's most beloved hits to their attention to detail in recreating the band's signature sound, Wide Awake is a must-see for any U2 fan, guaranteeing an unforgettable night of pure rock excellence. Facebook Special Guest DJ Moto Featuring legal talent from the City of Miami Beach City Attorney’s Office Merari Motola studied film and TV production at Tel Aviv University.  She returned to Miami in 1992 when she got a job as a receptionist at a small personal injury law firm on Miami Beach called Grover, Ciment.  Within a year she was promoted to be a pre-litigation paralegal. After 10 intermittent years at Grover’s (having lived in Mexico City and Lima, Peru in between), she worked 10 yrs at Kubicki Draper and then 10 years at Akerman. She worked during the pandemic at Gunster Yoakley and after a brief stint at Gunster she landed a job as Paralegal Specialist at the City of Miami Beach City Attorney’s Office, where she has been working since May.  Merari has been DJ’ing professionally since 2013 and has DJ’d hundreds of gigs in many of Miami’s most popular clubs, bars, restaurants and hotels, as well as countless private events, including for the American Bar Association and Terra Lex's Global Conferences, to name a few.  Merari is very excited to be a part of the 2nd Annual Law Rocks Miami and looks forward to rocking out with her fellow legal eagles. Special Opening Performance by The Miami Beach Rock Ensemble The Miami Beach Rock Ensemble from Miami Beach Senior High School was founded by the late Doug Burris in 1972. The group is the first high school rock ensemble in our nation's history. The student-led musical group is a culmination of musicians, stage crew, and a sound engineering team. The Rock Ensemble comes together to play classic and modern rock and lends vocational experience to its students through engaging them in professional environments at a young age. Many professional musicians and sound engineers have passed through the ranks of the Rock Ensemble over its 52 year run. Host - Doc Reno Doc is on the radio afternoons and mornings in multiple markets. Currently, you can hear him live 3-7pm on BIG 105.9 and Nights in Washington DC 7P-12 Midnight on BIG 100. He also records a Late Night Nationally Syndicated Radio Show called \" The Red Eye Rock Lounge \" that airs nationwide from New York City to San Diego, and is also carried by iHeartRadio 5 nights a week on the Rock - Classic Rock iHeartRadio Channel. Doc also does a Saturday Afternoon Show 3-7pm for iHeartRadio. When Doc isn’t on the air, you can find him doing anything involving sports. He is an avid marathon runner, with 5 marathons and 14 half marathons under his belt – and planning on a 15th! He is a spokesman for several local and national advertisers and is involved in countless South Florida charities. He’s a huge sports fan and has both a personal and working relationship with all of the major South Florida sports franchises. The same is true with the local music scene. If there is a Big event happening (no pun intended!) there's no doubt that Doc will be there. Anthony Bozza Anthony Bozza is an author and journalist who was a staff writer at Rolling Stone for 8 years. In 2002 he left the magazine to write Whatever You Say I Am: The Life and Times of Eminem, which was born of the unparalleled access and hours he spent with Eminem while working on his Rolling Stone features. The book was a New York Times bestseller and an international bestseller, topping lists in England, Germany, France and South America. He then co-authored numerous autobiographies of artists including Slash, INXS, Tommy Lee, Mick Fleetwood, and Wyclef Jean. He’s written 7 additional NYT Bestsellers, including books on AC/DC, comedians Artie Lange and Tracy Morgan, and baseball legend Derek Jeter. His latest two books are “Not Afraid,” a follow-up to his first book on Eminem, and \"From Staircase to Stage,\" the autobiography of Raekwon of Wu-Tang Clan. Jerry Harrison Jeremiah Griffin Harrison (born February 21, 1949) is an American songwriter, musician, producer, and entrepreneur. He began his professional music career while attending Harvard as a member of the cult band the Modern Lovers before becoming a keyboardist and guitarist for Talking Heads. Harrison joined Talking Heads in 1977, after releasing their debut single, \"Love → Building on Fire\". Harrison has produced and worked on albums by bands including Foo Fighters, Fine Young Cannibals, Hockey, Violent Femmes, The BoDeans, The Von Bondies, General Public, Live, Crash Test Dummies, The Verve Pipe, Poi Dog Pondering, Rusted Root, Stroke 9, The Bogmen, Black 47, The Mayfield Four, Of A Revolution, No Doubt, Josh Joplin Group, The Black and White Years, Kenny Wayne Shepherd, Bamboo Shoots, the String Cheese Incident and The Gracious Few. In 2002, Harrison was inducted into the Rock and Roll Hall of Fame as a member of Talking Heads. In 2021, he received at Lifetime Achievement Award at the Grammys. Maria Milito Maria Milito has been heard on the New York radio and television airwaves for over 25 years. Whether you’re in the Tri-State area listening to Q104.3, New York’s Classic Rock Station or traveling nationwide, one might find it difficult to escape her signature voice as a host on iHeartMedia’s Classic Rock network—from Spokane WA to Allentown PA. Maria also adds author to her list of credits with the publishing of “Clarice and Friends...How They Helped Mend the Hole in My Heart,” a collection of emails from her listeners sent to her when her beloved dog Clarice passed away. A huge animal advocate, Maria can often be found at animal functions and charity events and has an animal/nature/environment podcast on the iHeartRadio app called “Maria’s Mutts & Stuff”; download the app and listen today! Billy Morrison Billy Morrison is an English guitarist, singer and fine artist who plays guitar with Billy Idol and performs with the Los Angeles-based cover band Royal Machines. Morrison previously fronted the hard rock act Circus Diablo and has been a member of The Cult, Stimulator, Doheny and Into a Circle. He has also enjoyed a fine art career for over a decade. Morrison currently hosts his own radio show, INFLUENCED, on Ozzy’s Boneyard Sirius XM Channel 38, as well as co-hosts his chat show with Ozzy Osbourne, OZZY SPEAKS, on the same channel. Debbie White Debbie White, partner at Loeb & Loeb, focuses her practice in the music, motion picture and entertainment industries, with particular emphasis on representing recording artists, songwriters, producers, managers, record companies, publishing companies, and digital media and technology companies in their ongoing business affairs. Recognized as a top entertainment lawyer by leading publications such as Variety, The Hollywood Reporter and Billboard, Debra is known for her work negotiating multimillion-dollar recording contracts, as well as agreements related to publishing, worldwide touring, film soundtrack and Broadway cast albums, merchandising and sponsorships. A significant portion of her music practice centers on the development of copyright strategies and implementation of licensing efforts for digital companies, major advertisers and advertising agencies, sports and television networks, and entertainment companies. Her experience representing talent, combined with her in-depth understanding of licensing and publishing rights, uniquely positions Debra to address the complex issues that arise when artists work with subscription streaming services and other new media companies and licensors of digital content. She also leverages her talent and recording relationships to negotiate entertainment-related strategic marketing partnerships, tour sponsorships, brand integration agreements and celebrity product endorsement deals on behalf of advertising agencies and Fortune 500 companies from a variety of industries. In addition, Debra represents actors, fashion designers, athletes, chefs, models and high-level industry executives in a range of traditional entertainment matters. She has been very successful at expanding her clients’ interests through ventures such as book publishing, fragrance and cosmetic licensing agreements, non-scripted television deals, and infomercials. Debra's practice is international in scope, and she is increasingly active in Asia’s expanding entertainment and media market, with clients that include China’s largest tech company and one of the most popular K-pop bands in history. Fuelit Featuring legal talent from May, Potenza, Baran & Gillespie Fuelit is a six-piece classic rock band that’s been playing together in one form or another for more than 25 years, mostly at biker venues and charity gigs. In our day jobs we are an engineer, a couple of IT professionals, a piano restorer and a lawyer. Oh and then there's Slick, our bass player. He's just professionally cool. The Hoodlums Featuring legal talent from Fennemore; My First Nest Egg The Hoodlums are a five-piece family band with four musically talented people and a momager relegated to the cow bell.  Lailah, the drummer, is 8 years old and the heartbeat of the band.  Henry, 12, is the lead singer and lead guitarist.  Ellora, 13, is on keys and the band’s stylist.  Nicolle, age not disclosed, is a business lawyer and co-founder of My First Nest Egg, a company dedicated to teaching children financial literacy.  Sean, a litigator and water lawyer at Fennemore, Arizona’s oldest law firm, has passed his musical talent and love for 80’s rock to his children.  Despite his skills of persuasion, Sean’s children vetoed his requests for self-indulgent guitar solos.  The Hoodlums are thrilled to support Alice Cooper’s Solid Rock Teen Centers with the hope that every kid will have the opportunity to learn and play music. Probustus Featuring legal talent from Evans Dukarich “A rose by any other name would smell as sweet.” Unless you called Probustus. Then it would smell exactly like a group of dads from Tempe who like to jam on weekends. We want to be rockstars but, you know, we have lives. Michael practices law and plays lead guitar. Andy is a teacher who also happens to sing and play guitar. Paul is a renaissance man who has been credited as a pilot, teacher, and drummer. Little is known of Alex’s past. Maybe he’s the result of top-secret government experiments. Or maybe he’s just a good dude with a penchant for playing bass and gardening. Retro-Active Featuring legal talent from General Dynamics Mission Systems; Fennemore; Potomac Law Group Devon Engel – bass Sean Hood – guitar Mike Rissman – keyboards Chuck Leyva – drums Christi Sartin – vocals Dave Cass - vocals Retro-Active is a high energy rock & roll cover band playing in the Valley since 2006.  Featuring dynamic male and female vocals (and three Valley lawyers!) Retro-Active set lists are full of the songs that make you jump out of your seat to dance and sing along.  From Adele to Zeppelin, Journey to Van Halen, Guns n Roses to Velvet Revolver, Boston to Kansas and Toto, Styx to Stones, the Black Crowes to the White Stripes, Aerosmith to Jet, Blue Oyster Cult to the Red Hot Chili Peppers, Heart to Paramore, Alien Ant Farm to Michael Jackson, the Cult to Kravitz, Boston to Bon Jovi, Jefferson Starship to Foreigner, Elle King to Prince, Scandal to Dramarama, Petty to Mellencamp, AC/DC to U2, The Killers to The Knack, Florence + The Machine to No Doubt, Def Leppard to Foo Fighters, Rihanna to Rage Against the Machine, Grace Potter to Greta Van Fleet, Ratt to the Doobie Brothers…you get the picture… Rock Judicata Featuring legal talent from Buchalter Rock Judicata is a band of legal experts from Buchalter, where paperwork is our bread and butter, but rocking out is our jam. Josiah Reid dominates the drums with the precision of a well-crafted contract, while Khaled Tarazi takes charge of rhythm guitar and vocals, turning legal briefs into lyrical feats. We have Chello Johnson on bass, bringing the low-end justice, and the shredding maestro Ryan Evans on lead guitar, laying down riffs sharper than a cross-examination. Rock Judicata: where the gavel meets the gravel, and the verdict is always in favor of a good time! Judge - Zach Allen Zach Allen is the vocalist for the NYC-based band TEMPT who merge classic rock with cutting-edge innovation and are poised to redefine the rock genre for a new generation. Their self-titled debut album, produced and mixed by renowned 5X Grammy Award winner Chris Lord-Alge, is out now via Better Noise Music. Judge - Amanda Charney As the Founder and CEO of Black Panda PR, Amanda brings both undeniable passion and well over a decade of experience to the world of music publicity. While attending the University of Wisconsin-Madison, Amanda became “Amanda Panda,” a radio personality on Z104’s highly popular morning show, Connie & Fish in the Mornings (Top 40 Radio). This is where her infectious personality first resonated through the airwaves and where her passion for the music business was solidified. Amanda has poured her energy into promoting indie bands and working with a wide variety of artists from high-level established acts to today’s rising stars. In her spare time, Amanda scours the New York music scene for the next big act, and spends time with her adorable dog, Reggie Jackson. Judge - Shawn Dailey Shawn Dailey is an artist manager with over 20 years in music and film. He started his career as a bassist, most notably with Courtney Love and Hole. As a manager, Shawn represents Grammy winners, Rock N Roll Hall Of Fame inductees, award winning filmmakers and best selling authors. He has also produced multiple award winning documentaries. Judge - Wendy LaManque Wendy LaManque is thrilled to be returning for her fifth year as a Law Rocks Judge!  Wendy is Director of Organizational Compliance & Eastern Counsel for the American Guild of Musical Artists (AGMA), the labor union representing the workers who create professional ballet, opera and choral music across the country. Prior to serving as counsel to AGMA, Wendy spent six years in a law firm here in New York City representing major entertainment unions and other labor organizations.  Wendy is also a proud member of The Whistles, a quirky indie folk duo performing and recording music that spans the entire universe of genres with her husband, Terrence Brennan (formerly of Cousin Earth). In 2022, Wendy was promoted to Chief Party Officer at the Party Farm in Roscoe, NY, Wendy and Terry’s boutique recording studio in the Catskills. When not lawyering, playing music, hosting recording clients, or judging battles of bands, Wendy can be found in her garden, bowling at the Party Farm's on-site bowling alley, or attempting to train her delightfully unruly dog, Pepper. Judge - LaFrae Sci LaFrae Sci is an award-winning and internationally acclaimed multi-instrumentalist, educator, composer, and electro-acoustic adventurer. Bedrock to her artistry is the roots and the fruits of the blues from spirituals to afro-diasporic futuristic soundscapes that explore time travel, prayer, meditation, and the African American ecstatic tradition. As a composer, she writes for film, theater, and large and extended jazz and classical orchestras. She writes for all instruments and her creative range spans immersive and ambisonic music, blues, various ethnomusicological traditions, rock, pop, hip-hop, and her own brand of subaquatic deconstructed techno soul. To date, LaFrae has shared her intentional creativity in 40 countries. LaFrae has played drums for The Burnt Sugar Arkestra, The Black Rock Coalition Orchestra, Valerie June, Keziah Jones, Sandra Bernhard, Kelis, Nancy Sinatra (w/ Morrissey), blues greats Jr. Mack and Pinetop Perkins, Irene Cara, Bumblefoot, Cyndi Lauper, Reuben Wilson, Rachel Z, and Dr. Lonnie Smith. LaFrae is also the Executive Director/Dir of Artistic Programming at Willie Mae Future Sounds named after Willie Mae \"Big Mama\" Thornton. W.M.F.S. is a STEAM-based, year-round empowerment through music program that includes social justice, Afro Diasporic futurism, critical thinking, and leadership, through the lens of the blues tradition for girls and gender non-conforming youth in New York City. Host - Mark Devine A Valley radio staple since 1989, Mark recently retired from the #1 rated 'Mark & NeanderPaul' show on 100.7 KSLX and also hosted the ’Tim & Mark’ show on 93.3 KDKB for 16 years. Hot Wip Featuring legal talent from Trowers & Hamlins Hot Wip are Tim Hillier and James McCormack on guitar, Will Bethune on bass, Marcus Grainger on drums and Eddie Henley the charismatic front man on lead vocals. The band play a mix of noughties rock and crowd pleasing rock belters from yesteryear. Prepare to be disintegrated by their pure rock energy and blasting tunes. Hot Wip won London Law Rocks in 2022 and are hungry for more success. Seven Seas Featuring legal talent from various law firms Seven Seas is a band comprising IBA maritime lawyers from different parts of the world - Chile, New York, Singapore, London - who play once a year at IBA annual conferences. The band has played at every Law Rocks! event at the IBA since inception in 2013 in Boston and is known for playing classic rock tunes. Track Changes Featuring legal talent from Level ft Mishcon de Reya These rockers represent an age-old tale of musical boom and bust. You might just recognise some of the band from their heyday, more than a decade ago, when they bossed the UK’s Law Rocks! scene. Back then, with performances brimming with energy and swagger, it seemed that no UK amateur professional services title was beyond their reach.   But the success, followed by a cliché of other vices, went straight to their heads and, just as quickly as their reputation blossomed, it withered and disappeared without trace.  But now they’re back, fresh from their UK festival success last summer at the Secret Garden Party, and with a new name:  Introducing \"Track Changes\", lawyers who've traded their briefcases for bass guitars, courtrooms for keyboards, and legal pads for drum sticks. With melodies as sharp as their legal arguments and a rhythm section tighter than a courtroom deadline.  From depositions to dance floors, Track Changes invites you to be their honorary client in the court of rock 'n' roll. 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233 234 235 236 237 238 239 240 241 242 243 244 245 Previous Next Back to Top PRIVACY POLICY Law Rocks Inc. (213) 259-3110 info@lawrocks.org MAILING ADDRESS: Law Rocks Inc. 18645 Sherman Way, Suite 211 Reseda, CA 91335 US HEADQUARTERS: Law Rocks Inc. 2321 Rosecrans Ave. Suite 2250 El Segundo, CA 90245 info@lawrocks.org (213) 259-3110 Law Rocks Inc. is recognized as a non-profit corporation and qualified charity under IRS 501(c) (3). The Law Rocks Foundation is a registered charity in England and Wales, number 1171131. © 2025 by Law Rocks Inc."
    },
    {
      "url": "https://www.rockofftrade.com/category/99/Contact-Us.html",
      "text": "Contact Us Wholesale Merchandise Air Fresheners Bags Bar Furniture Collectables & Novelty Drinking Items Drinks Coasters Face Masks Hangers Jewellery Lanyards Magnets Metal Items Patches Pens Pins & Badges Plectrums Posters & Textiles Stationery Steel Wall Signs Turntable Slipmats Umbrellas Wristbands T-Shirts All T-Shirts Unisex Ladies Kids Long Sleeve Short Sleeve Sleeveless Embellished Hi-Build Mesh Tops Mini Logo Ringers Sublimation Print Summer Shapes T-Shirt Dresses Wash Babywear Bathrobes Casual Shirts Gloves Headwear Hooded Tops Jackets Joggers & Trousers Polo Shirts Sleepwear Socks Sweatshirts Underwear Kid's Apparel Ladies Apparel Unisex Apparel Brands A B C D A Nightmare on Elm Street A Star Is Born Avengers, The Beetlejuice & Beetlejuice 2 BT21 Captain America Cartoon Network Che-Guevara Corpse Bride Crossroads DC Comics Deadpool Disenchantment Disney Dumb & Dumber Brands E F G H Emily The Strange Eternals Exorcist, The Falcon and the Winter Soldier, The Flintstones, The Friday the 13th Friends Generic Themes Godfather - The Goodfellas Goonies, The Gremlins Guardians of the Galaxy Brands I J K L IT James Bond 007 Looney Tunes Lost Boys, The Brands M N O P Magic Moments Magic Roundabout Marvel Matrix, The Monty Python New York City Nickelodeon Nightmare Before Christmas, The Peaky Blinders Powerpuff Girls, The Punisher, The Brands Q R S T Rick & Morty RuPaul Scooby Doo Sopranos, The Space Jam Star Wars Teenage Mutant Ninja Turtles Texas Chainsaw Massacre, The Tokyo Time Tom & Jerry Top Gun True Blood Brands U V W X Y Z WandaVision Warner Bros What If Wizard of Oz, The Arrivals Character Genres Brands & Labels Gaming Sport EuroLeague Basketball Motor Racing NFLPA One Championship MMA UFC MMA TV, Film & Print All TV, Film & Print A Star Is Born Beetlejuice Crossroads DC Comics Disenchantment Disney Emily The Strange Flintstones, The Friends Godfather - The Goodfellas James Bond 007 Magic Roundabout Marvel Matrix, The Monty Python Nickelodeon Peaky Blinders RuPaul Sopranos - The Space Jam 2 Star Wars Teenage Mutant Ninja Turtles Texas Chainsaw Massacre, The Top Gun True Blood WandaVision Warner Bros. What If Cartoon Network The Complete Range Power Puff Girls Rick & Morty DC Comics Disney The Complete Range Nightmare Before Christmas, The Marvel The Complete Range Avengers, The Captain America Deadpool Eternals Falcon & The Winter Soldier Guardians of the Galaxy Punisher, The WandaVision What If Nickelodeon Tokyo Time British Basketball League EuroLeague Basketball Japanese Culture Misfits Gaming Motor Racing NFLPA One Championship MMA Street Fighter 2 UFC MMA Base & TT Logo Only Warner Brothers A Nightmare on Elm Street Beetlejuice & Beetlejuice 2 Corpse Bride Dumb & Dumber Exorcist, The Flintstones, The Friday the 13th Friends Goonies, The Gremlins IT Looney Tunes Lost Boys, The Scooby Doo Tom & Jerry Willy Wonka Wizard of Oz, The Sale & Promotions New in September New in August New in July New in June Week 37 Arrivals Week 36 Arrivals Week 35 Arrivals Week 34 Arrivals Week 33 Arrivals Week 32 Arrivals Week 31 Arrivals Week 30 Arrivals Week 29 Arrivals Replenished PDF Brochures Beatles Accessories Billie Eilish Character Crop Tops Diamante Ghost Gifts Ladies T-Shirt Dresses Magnets Mesh Tops Metal Items Metal on Metal Premium Wash Ringer T-Shirts Sleep Token Socks Spring Fair 2025 Music Genres Classic Rock & Icons All Classic Rock & Icons AC/DC Alice Cooper Beach Boys, The Beatles, The Bee Gees Black Sabbath Bob Dylan Bob Marley Bon Scott Cher David Bowie David Gilmour Deep Purple Doors, The ELO Elvis Presley Eric Clapton Frank Sinatra Freddie Mercury George Harrison Guns N' Roses Jam, The Janis Joplin Jeff Beck Jimi Hendrix Jimmy Page John Lennon KISS Led Zeppelin Neil Diamond Ozzy Osbourne Paul McCartney Pink Floyd Prince Queen Ringo Starr Robert Plant Rod Stewart Roger Waters Rolling Stones, The Roy Orbison Rush Sonny & Cher Syd Barrett Tina Turner Traveling Wilburys, The Who, The Electronic & Dance All Electronic & Dance A-Ha Bad Boy Chiller Crew Calvin Harris Chemical Brothers, The Chvrches Deadmau5 Electric Callboy Human League, The Pendulum Folk & Country All Folk & Country Merch Chris Stapleton Hank Williams Hardy Heilung Johnny Cash Joni Mitchell Levellers Luke Combs Morgan Wallen Orville Peck Reba McEntire Shania Twain Simon & Garfunkel Thomas Rhett Willie Nelson Zac Brown Band K-Pop All K-Pop Ateez BlackPink BT21 Metal All Metal Gear A Perfect Circle Aborted Accept Airbourne Almighty, The Alter Bridge Anthrax Asking Alexandria At The Gates Avenged Sevenfold Axewound Babymetal Bad Omens Bad Wolves Bal-Sagoth Baroness Beast in Black Behemoth Black Dahlia Murder, The Black Label Society Black Veil Brides Bleed From Within Blind Guardian Bloodbath Body Count Bring Me The Horizon Bruce Dickinson Bullet For My Valentine Candlemass Carcass Children Of Bodom Chris Cornell Chthonic Cliff Burton Coal Chamber Conan Cradle Of Filth Crossfaith Cult, The Damnation's Hammer Dark Angel Dark Funeral Darkthrone Death Def Leppard Deftones Deicide DevilDriver Devin Townsend Dimmu Borgir Dio Dissection Disturbed Don Broco Down Dream Theatre Eluveitie Ensiferum Entombed Equilibrium Escape The Fate Europe Exhumed Exodus Extreme Eyehategod Faith No More Fear Factory Five Finger Death Punch Ghost Godsmack Gojira Good Charlotte Greta Van Fleet Halestorm Heathen Helloween High Parasite HIM Hollywood Vampires Ice Nine Kills Ihsahn Immortal In Flames Incubus Iron Maiden Jane's Addiction Judas Priest Katatonia Kerry King Killswitch Engage King Diamond King's X Korn Korpiklaani Kreator Lamb Of God Lemmy Linkin Park Machine Head Marduk Marilyn Manson Mastodon Mayhem Megadeth Mercyful Fate Meshuggah Metallica Ministry Miss May I Monstrosity Morbid Angel Motionless In White Motley Crue Motorhead Municipal Waste My Dying Bride Nightwish Nile Of Mice & Men Onslaught Opeth Overkill Pantera Paradise Lost Phil H. Anselmo & The Illegals Poison Polyphia Powerwolf Queens Of The Stone Age Rage Against The Machine Rise To Remain Rob Zombie Rotting Christ Royal Blood Ruim Sacred Reich Saxon Scorpions Seether Sepultura Sigh Slash Slaughter To Prevail Slayer Sleep Token Slipknot Soil Solstafir Soundgarden Staind Stone Sour Stormtroopers Of Death Suffocation Symphony X System Of A Down Tankard Terrorizer Testament Thin Lizzy Tony Iommi Tool Trivium Twisted Sister Type O Negative Van Halen Venom Vio-Lence Voivod Volbeat Warrant Watain Wednesday 13 While She Sleeps Whitesnake Within Temptation Wolf Xentrix Young Guns Pop All Pop Gear Ariana Grande Avril Lavigne Backstreet Boys Bastille Bebe Rexha Beyonce Billie Eilish Black Eyed Peas, The Bleachers Boy George & Culture Club Britney Spears Bros Conan Gray Donny Osmond Ed Sheeran George Michael HRVY iDKHow Janet Jackson JLS Justin Bieber Lady Gaga Lewis Capaldi Lionel Richie Little Mix Louis Tomlinson Madness Madonna Maroon 5 Melanie Martinez Neck Deep Nessa Barrett No Doubt NSYNC Olivia Newton-John Olivia Rodrigo Olly Murs P!nk Panic! At The Disco Pet Shop Boys Poppy Selena Gomez Shakira Spice Girls, The Stand Atlantic Take That Wanted, The Waterparks Punk Rock All Punk Gear 7 Seconds Bad Brains Bad Religion Billy Idol Biohazard Blondie Bodysnatchers, The Buzzcocks Carter USM Clash, The Cramps, The Damned - The Dead Kennedys Debbie Harry Devo Exploited, The Higher Power Idles Iggy & The Stooges Joe Strummer Johnny Ramone Misfits Murderdolls Pierce The Veil PIL (Public Image Ltd) Ramones, The Rancid Reel Big Fish Rolo Tomassi Sex Pistols, The Siouxsie and the Banshees Social Distortion Stiff Little Fingers Sublime Television Undertones, The X-Ray Spex Rock & Alternative All Rock & Alternative Gear 1975, The 5 Seconds of Summer Adolescents, The Aerosmith Alanis Morissette Alice In Chains All Time Low Allman Brothers Band - The Alt-J Anathema Angel Dust Ash At The Drive-In B52s Bad Company Band, The Barns Courtney Beck Biffy Clyro Big Brother & The Holding Company Billy Joel Black Crowes, The Black Rebel Motorcycle Club Blink-182 Bluetones - The Blur Bob Seger & The Silver Bullet Band Bon Jovi Boston Brian Jonestown Massacre, The Bruce Springsteen Bryan Adams Buckcherry Catfish & The Bottlemen Coheed and Cambria Coldplay Cranberries, The Creed Creedence Clearwater Revival Creeper Cure, The Death Cab For Cutie Depeche Mode Dirty Pretty Things Doobie Brothers - The Duran Duran Eagles Eagles of Death Metal Echo & The Bunnymen Elastica Elbow Elton John English Beat, The Evanescence Fall Out Boy Feeder Flaming Lips, The Fleetwood Mac Florence & The Machine Foals Foo Fighters Foreigner Frank Iero Frank Zappa Front Bottoms, The Genesis Goo Goo Dolls, The Gorillaz Grateful Dead Green Day Happy Mondays Hayley Williams Highly Suspect Hives, The Humble Pie Imagine Dragons Interpol INXS Jamiroquai Jefferson Airplane Joan Jett & The Blackhearts Johnny Marr Journey Joy Division Kaiser Chiefs Kasabian Killers, The Kings of Leon Kinks, The Kooks, The Kurt Cobain LA's, The Last Dinner Party, The Leon Russell Liam Gallagher Libertines, The Lindsey Buckingham Lou Reed Lynyrd Skynyrd Maneskin Manic Street Preachers Matchbox Twenty Mayday Parade MC5 Meat Loaf Monkees, The Moody Blues, The Morbid Angel Morrissey Muse My Chemical Romance Ned's Atomic Dustbin Neil Young New Found Glory New Order New York Dolls Nick Mason's Saucerful of Secrets Nickelback Nine Inch Nails Nirvana Nothing More Oasis Offspring, The Orchestral Manoeuvres in the Dark Osaka Popstar Paramore Paul Weller Pearl Jam Pixies Placebo Pogues, The Police, The Primal Scream Primus Pulp Puscifer Pvris R.E.M. Radiohead Rainbow Red Hot Chili Peppers REO Speedwagon Richard Ashcroft Roxy Music Santana Script, The Shinedown Skindred Sleeping With Sirens Small Faces Smashing Pumpkins, The Snuts, The Specials, The Status Quo Stereophonics Stone Temple Pilots Strokes, The Struts, The Style Council, The Sum 41 T-Rex Taking Back Sunday Talking Heads Tears For Fears Tom Petty & The Heartbreakers Tonight Alive TOTO Train TV On The Radio Twenty One Pilots U2 Uriah Heep Vaccines, The Velvet Revolver Violent Femmes Ween Weezer White Stripes, The Wildhearts, The Wombats, The Wonder Years, The Yes You Me At Six Yungblud Zombies, The ZZ Top Soul, Jazz, Funk & Blues All Soul, Jazz, Funk & Blues Amy Winehouse Aretha Franklin Barry White Charlie Parker Earth, Wind & Fire Etta James James Brown John Coltrane Miles Davis Motown Muddy Waters Rag'n'Bone Man Seasick Steve Stevie Ray Vaughan Whitney Houston Urban, Hip Hop & Reggae All Urban, Hip Hop & Reggae Gear 21 Savage 2Pac 50 Cent A Tribe Called Quest Aaliyah Bad Meets Evil Beastie Boys Big Daddy Kane Biggie Smalls Bone Thugs-n-Harmony Burna Boy Cardi B Cypress Hill De La Soul Def Jam Recordings Digital Underground DMX Doja Cat Doug E. Fresh Dr. Dre Dreamville Records Eazy-E Eminem EPMD Eric B. & Rakim French Montana Gucci Mane (GUWOP) House Of Pain Ice Cube Ice Spice Ice-T J. Cole Jack Harlow Jungle Kevin Gates Kodak Black Kool Moe Dee Lil Nas X Lil Skies Lil Wayne Lizzo Logic Machine Gun Kelly Malcolm X Mary J. Blige Michael Jackson Migos Myke Towers N.W.A Nas Naughty By Nature NoCap Nothing,Nowhere. OutKast Peter Tosh Pink Sweats Pooh Shiesty Pop Smoke Post Malone Public Enemy Rico Nasty Run DMC Saweetie Snoop Dogg Stormzy Sugar Hill Gang Taylor Gang Entertainment Teddy Swims TLC Tone Loc Travis Scott Tupac Ty Dolla Sign Wiz Khalifa Wu-Tang Clan Young Thug Brands & Labels All Brands & Labels Capitol Records CBGB Che Guevara Death Row Records Decca Records Def Jam Dreamville Records Fender Generic Magic Moments MTV New York City Premier Drums Priority Records Road Signs Star-Club, Hamburg Stax Records Sun Records Taylor Gang Entertainment Tokyo Time Virgin Records Woodstock Lifestyle Themes Emo All Time Low At The Drive In Fall Out Boy My Chemical Romance Panic! At The Disco Paramore Taking Back Sunday Weezer Goth Rock Cramps, The Cult, The Cure, The Depeche Mode HIM Joy Division Nine Inch Nails (NIN) Sisters of Mercy, The Type O Negative Artists 1 - 10 1975, The 21 Savage 2Pac 5 Seconds of Summer 50 Cent 5FDP 7 Seconds Artists A A Perfect Circle A Tribe Called Quest A-Ha Aaliyah Aborted ACDC 50th Anniversary FTATR 40th Power Up Bon Scott Adolescents, The Aerosmith Airbourne Alanis Morissette Alchemy Rocks Alice Cooper Alice in Chains All Time Low Allman Brothers Band - The Almighty, The Alt-J Alter Bridge Amy Winehouse Anathema Angel Dust Anthrax Aretha Franklin Ariana Grande Ash Asking Alexandria At The Drive-In At The Gates Ateez Avenged Sevenfold A7X Avril Lavigne AxeWound Artists B Beatles, The B-52s, The Babymetal Backstreet Boys Bad Boy Chiller Crew Bad Brains Bad Company Bad Meets Evil Bad Omens Bad Religion Bad Wolves Bal-Sagoth Band, The Barns Courtney Baroness Barry White Bastille Beach Boys, The Beast in Black Beastie Boys, The Beatles, The The Beatles John Lennon Paul McCartney George Harrison Ringo Starr Abbey Road Beatles 1964, The Now & Then + Red & Blue Revolver Sgt Pepper White Album & 1968 Yellow Submarine Get Back Film Meyba x Beatles Collection Bebe Rexha Beck Bee Gees Behemoth Beyoncé Biffy Clyro Big Brother & The Holding Company Big Daddy Kane Biggie Smalls Billie Eilish Billy Idol Billy Joel Biohazard Black Crowes, The Black Dahlia Murder, The Black Eyed Peas, The Black Label Society Black Rebel Motorcycle Club Black Sabbath The Complete Range The End Tour Ozzy Osbourne Tony Iommi Black Veil Brides BlackPink Bleachers Bleed From Within Blind Guardian Blink-182 Blondie The Complete Range Debbie Harry Bloodbath Blue Note Records Bluetones - The Blur Bob Dylan Bob Marley The Complete Range One Love Film Bob Seger & The Silver Bullet Band Body Count Bodysnatchers, The Bon Jovi Bon Scott Bone Thugs-n-Harmony Boston Bowie, David Boy George & Culture Club Bravado Artists 1975, The 2Pac Aerosmith Ariana Grande Avril Lavigne Beach Boys Beastie Boys Beatles, The Billie Eilish Black Crowes, The Black Sabbath Black Veil Brides BlackPink Bob Marley Bon Jovi Boyzone Britney Spears Bros Capitol Records Coheed & Cambria David Bowie Decca Records Def Leppard Doja Cat Elton John Freddie Mercury French Montana Greta Van Fleet Guns N' Roses Imagine Dragons In Flames Jam, The Jamiroquai Justin Bieber Kasabian Killers, The King Diamond KISS Kodak Black Kreator Lady Gaga Lil Wayne Machine Gun Kelly Mary J Blige Meatloaf Mercyful Fate Monty Python Motown Records MTV NAS Neil Diamond Pantera Paul Weller PiL Pogues, The Public Enemy Queens of the Stone Age Ringo Starr Rod Stewart Rolling Stones, The Ronan Keating Roxy Music Run DMC Scorpions Selena Gomez Sex Pistols Shania Twain Slipknot Social Distortion Spice Girls Stax Stormzy Style Council Take That Wanted, The Who, The Willie Nelson Yungblud Brian Jonestown Massacre, The Bring Me The Horizon The Complete Range NeX GEn More Info. Britney Spears Bros Brown, James Bruce Dickinson Bruce Springsteen Bryan Adams Buckcherry Bullet for My Valentine Burna Boy Buzzcocks Artists C Calvin Harris Camila Cabello Candlemass Capitol Records Carcass Cardi B Carter USM Cash, Johnny Cast Catfish And The Bottlemen CBGB Charlie Parker Chemical Brothers, The Cher Children of Bodom Chris Cornell Chris Stapleton Chthonic Chvrches Clapton, Eric Clash, The Cliff Burton Coal Chamber Cobain, Kurt Coheed And Cambria Coldplay Conan Conan Gray Cradle of Filth Cramps, The Cranberries, The Creed Creedence Clearwater Revival Creeper Crossfaith Cult, The Culture Club & Boy George Cure, The Cypress Hill Artists D Damnation's Hammer Damned - The Dark Angel Dark Funeral Darkthrone David Bowie David Gilmour De La Soul Dead Kennedys Deadmau5 Death Death Cab For Cutie Death Row Records Debbie Harry Decca Records Deep Purple Def Jam Recordings Def Leppard Deftones Deicide Depeche Mode DevilDriver Devin Townsend Devo Digital Underground Dimmu Borgir Dio Dirty Pretty Things Dissection Disturbed DMX Doja Cat Don Broco Donny Osmond Doobie Brothers - The Doors, The Doug E. Fresh Down Dr. Dre Dream Theater Dreamville Records Duran Duran Dylan, Bob Artists E Eagles Eagles of Death Metal Earth, Wind & Fire Eazy-E Echo & The Bunnymen Ed Sheeran Elastica Elbow Electric Callboy Electric Light Orchestra Elton John The Complete Range Rocketman Eluveitie Elvis Presley Eminem English Beat, The Ensiferum Entombed EPMD Equilibrium Eric B. & Rakim Eric Clapton Escape The Fate Etta James Europe Evanescence Exhumed Exodus Exploited, The Extreme Eyehategod Artists F Faith No More Fall Out Boy Falling In Reverse Fear Factory Feeder Fender Five Finger Death Punch Five Seconds of Summer Flaming Lips, The Fleetwood Mac Florence And The Machine Foals Fontaines D.C. Foo Fighters The Complete Collection Medicine at Midnight Kurt Cobain Nirvana Foreigner Frank Iero Frank Sinatra Frank Zappa Fratellis, The Freddie Mercury French Montana Front Bottoms, The Artists G H Generic Themes Genesis George Harrison George Michael Ghost Global Artists 5 Finger Death Punch 5 Seconds of Summer A Perfect Circle Alice Cooper Anthrax Backstreet Boys Bad Omens Bad Wolves Behemoth Biohazard Boy George & Culture Club Chemical Brothers, The Cult, The Down Eric B. & Rakim Evanescence Ghost Godsmack HIM Hollywood Vampires I Dont Know How But They Found Me Ice Nine Kills Iron Maiden Janes Addiction JLS Judas Priest Kings of Leon Lamb of God Lemmy Kilmister Lewis Capaldi Louis Tomlinson Marilyn Manson Mastodon Misfits Motley Crue Motorhead Olly Murs Ozzy Osbourne Rob Zombie Sixx.AM Slayer Sleep Token Status Quo Stone Sour Stone Temple Pilots Thin Lizzy Godsmack Gojira Goo Goo Dolls, The Good Charlotte Gorillaz Grateful Dead Green Day Greta Van Fleet Gucci Mane (GUWOP) Guns N' Roses Complete Collection Slash Velvet Revolver Halestorm Hank Williams Happy Mondays Hardy Hayley Williams Heathen Heilung Helloween Hendrix, Jimi High Parasite Higher Power Highly Suspect HIM Hives, The Hollywood Vampires House Of Pain HRVY Human League, The Humble Pie Artists I J Ice Cube Ice Nine Kills Ice Spice Ice-T iDKHOW Idles Iggy & The Stooges Ihsahn Imagine Dragons Immortal In Flames Incubus Interpol INXS Iron Maiden The Complete Collection Beast Over Hammersmith Book of Souls Dead By Daylight Fear of the Dark Legacy of the Beast Live in Mexico City Number of the Beast Piece of Mind Senjutsu Bruce Dickinson J. Cole Jack Harlow Jam, The The Complete Range Paul Weller James Brown Jamiroquai Jane's Addiction Janet Jackson Janis Joplin Jeff Beck Jefferson Airplane Jimi Hendrix Jimmy Page JLS Joan Jett & The Blackhearts Joe Strummer John Coltrane John Lennon Johnny Cash Johnny Marr Johnny Ramone Joni Mitchell Journey Joy Division Judas Priest Jungle Justin Bieber Artists K Kaiser Chiefs Kasabian Katatonia Keith Moon Kerry King Kevin Gates Killers, The Killswitch Engage King Diamond King's X Kings of Leon Kinks, The KISS The Complete Range The End of the Road World Tour KISS Apparel KISS Accessories Kodak Black Kooks, The Kool Moe Dee Korn The Complete Range Requiem Korpiklaani Kreator Kurt Cobain Artists L LA's, The Lady Gaga The Complete Range A Star Is Born Lamb of God Last Dinner Party, The Led Zeppelin The Complete Range Jimmy Page Robert Plant Lemmy Kilmister Lennon, John Leon Russell Levellers Lewis Capaldi Liam Gallagher Libertines, The Lil Nas X Lil Skies Lil Wayne Lindsey Buckingham Linkin Park Lionel Richie Little Mix Lizzo Logic Lou Reed Louis Tomlinson Luke Combs Lynyrd Skynyrd Artists M Machine Gun Kelly (MGK) Machine Head Madness Madonna Malcolm X Maneskin Manic Street Preachers Marduk Marilyn Manson Maroon 5 Mary J. Blige Mastodon Matchbox Twenty Mayday Parade Mayhem MC5 Meat Loaf Megadeth The Complete Collection Countdown to Extinction Rust In Peace Melanie Martinez Mercyful Fate Meshuggah Metallica The Complete Range Cliff Burton 40th Anniversary 72 Seasons Michael Jackson Migos Miles Davis Ministry Misfits Miss May I Monkees, The Monstrosity Moody Blues, The Morbid Angel Morgan Wallen Morrissey Motionless in White Motley Crue Motorhead The Complete Range Lemmy Kilmister Motown MTV Muddy Waters Municipal Waste Murderdolls Muse My Chemical Romance My Dying Bride Myke Towers Artists N N.W.A The Complete Range N.W.A Branded Only Dr. Dre Eazy-E Ice Cube Nas Naughty By Nature Neck Deep Ned's Atomic Dustbin Neil Diamond Neil Young Nessa Barrett New Found Glory New Order New York Dolls Nick Mason's Saucerful of Secrets Nickelback Nightwish Nile Nine Inch Nails (NIN) Nirvana The Complete Range Nirvana Only Foo Fighters Kurt Cobain No Doubt NoCap Nothing More Nothing,Nowhere. Notorious B.I.G., The NSYNC Artists O P Oasis The Complete Range Oasis Only Liam Gallagher Ocean Colour Scene Of Mice & Men Offspring, The Olivia Newton-John Olivia Rodrigo Olly Murs Onslaught Opeth Orchestral Manoeuvres in the Dark (OMD) Orville Peck Osaka Popstar OutKast Overkill Ozzy Osbourne The Complete Collection Blizzard of Ozz The Tour That Never Was Black Sabbath Panic At The Disco Pantera Paradise Lost Paramore Paul McCartney Paul Weller Pearl Jam Pendulum Pet Shop Boys Peter Tosh Philip H. Anselmo & The Illegals Pierce The Veil PIL Public Image Ltd Pink Pink Floyd The Complete Range Dark Side of the Moon Pink Floyd The Wall David Gilmour Roger Waters Syd Barrett Pink Sweats Pixies Placebo Pogues, The Poison Police, The Polyphia Pooh Shiesty Pop Smoke Poppy Post Malone Powerwolf Premier Primal Scream Primus Prince Priority Records Public Enemy Pulp Puscifer Pvris Artists Q R Queen The Complete Range Freddie Mercury Bohemian Rhapsody Film News of the World Queens of the Stone Age QOTSA R.E.M. Radiohead Rag'n'Bone Man Rage Against The Machine Rainbow Ramones The Complete Range Joey Ramone Johnny Ramone CBGB Reba McEntire Red Hot Chili Peppers Reel Big Fish REO Speedwagon Richard Ashcroft Rico Nasty Ringo Starr Rise to Remain Rob Zombie Robert Plant Rock Off Rod Stewart Roger Waters Rolling Stones, The The Complete Range Hackney Diamonds Blue & Lonesome Havana Moon Film Honk MTV Collaboration No Filter Tour Sixty Tattoo You Rolo Tomassi Rotting Christ Roxy Music Roy Orbison Royal Blood Ruim Run-DMC Rush Artists S Sabaton Sacred Reich Santana Saweetie Saxon Scorpions Script, The Seasick Steve Seether Selena Gomez Sepultura Sex Pistols, The Shakira Shania Twain Shinedown Sigh Simon & Garfunkel Siouxsie and the Banshees Skindred Slash Slaughter To Prevail Slayer Sleep Token Sleeping With Sirens Slipknot The Complete Range The End, So Far Small Faces Smashing Pumpkins, The Snoop Dogg Snuts, The Social Distortion Soil Solstafir Sonny & Cher Soundgarden Specials, The Spice Girls, The Staind Stand Atlantic Star-Club, Hamburg Status Quo Stax Records Stereophonics Stevie Nicks Stevie Ray Vaughan Stiff Little Fingers Stone Roses, The Stone Sour Stone Temple Pilots Stooges, The Stormtroopers Of Death Stormzy Strokes, The Struts, The Style Council, The Sublime Suffocation Sugar Hill Gang, The Sum 41 Sun Records The Complete Range Elvis Presley Johnny Cash Roy Orbison Syd Barrett Symphony X System of a Down (SoaD) Artists T T-Rex Take That Taking Back Sunday Talking Heads Tankard Taylor Gang Entertainment Tears For Fears Teddy Swims Television Terrorizer Testament Thin Lizzy Thomas Rhett Tina Turner TLC Tom Petty & The Heartbreakers Tone Loc Tonight Alive Tony Iommi Tool TOTO Train Traveling Wilburys, The Bob Dylan ELO Roy Orbison Tom Petty Travis Scott Trivium Tupac Shakur - 2Pac TV On The Radio Twenty One Pilots Twisted Sister Ty Dolla Sign Type O Negative Artists U V W U2 Undertones, The Uriah Heep Vaccines, The Van Halen Velvet Revolver Venom Vio-Lence Violent Femmes Virgin Records Voivod Volbeat Wanted, The War Warrant Watain Waterparks Wednesday 13 Ween Weezer While She Sleeps White Stripes, The Whitesnake Whitney Houston Who, The The Complete Range Keith Moon Accessories Only Apparel Only Wildhearts, The Willie Nelson Within Temptation Wiz Khalifa Wolf Wombats, The Wonder Years, The Woodstock Wu-Tang Clan Artists X Y Z X-Ray Spex Xentrix Yes You Me At Six Young Guns Young Thug Yungblud Zac Brown Band Zappa, Frank Zombies, The ZZ Top Sales & Promotions New Releases More Stock Soon New to the Roster News Blog Bleachers - Coming Soon Ice Spice - Coming Soon Oversized Boxy Limited Rocksax Premium Wash 999 Ex. Tour Collection Mini Logo Collection Ringer T-Shirts Sublimation T-Shirts T-Shirt Dress Collection Embellished Collection Hi-Build Collection Larger Sizes Available Mesh Tops Collection Summer Shapes Collection Wash Collection Christmas Collection Character For Christmas Bathrobes for Christmas Socks for Christmas Sleepwear for Christmas Sales & Promotions Bathrobes Headwear Socks Hoodies Kids & Babywear Jackets Polo Shirts Eco-Tees & Hoodies Bags Plectrums Slipmats Textile Posters Jewellery Metal Items Look Who's Wearing... Beatles Hat USA 1964 Blondie Tee - Olivia Rodrigo Captain America Tee - Ed Sheeran Pink Floyd Tee - Dave Gilmour Primal Scream Rush - Moving Pictures Tour AC/DC - On Tour ALANIS MORISSETTE - On Tour ATEEZ - On Tour BABYMETAL - On Tour BIFFY CLYRO - On Tour BILLIE EILISH - On Tour BILLY JOEL - On Tour BRUCE SPRINGSTEEN - On Tour BRYAN ADAMS - On Tour BULLET FOR MY VALENTINE - On Tour DEFTONES - On Tour ECHO & THE BUNNYMEN - On Tour FONTAINES D.C - On Tour GHOST - On Tour GREEN DAY - On Tour GUNS N' ROSES - On Tour IDLES - On Tour IGGY POP - On Tour JUDAS PRIEST - On Tour KAISER CHIEFS - On Tour KORN - On Tour LIMP BIZKIT - On Tour MANIC STREET PREACHERS - On Tour METALLICA - 3rd Year On their Mammoth Tour MOTIONLESS IN WHITE - On Tour MY CHEMICAL ROMANCE - On Tour OASIS - On Tour OPETH - On Tour PANTERA - On Tour PEARL JAM - On Tour POST MALONE - On Tour PRIMAL SCREAM - On Tour TWENTY ONE PILOTS - On Tour WOMBATS, THE - On Tour +44(0)151 525 0343 / sales@rockofftrade.com / Subscribe Home Products Login Register My Account Contact Shopping Cart Facts Contact Login Cart We've Launched the New Website! Discover our improved experience with easier navigation, enhanced features, and a fresh new look. Customers - go to log in, use your existing email and reset your password - no need to re-register. Check out the new site! Toggle navigation Menu Music Character Apparel Kids Accessories Activity Featured Upcoming Arrivals Product Filters... Customer Information Contact Us Home Customer Information Contact Us Contact Rock Off We're Here to Help! Do you have any questions about opening a trade account? Ask us about our products? .....Or anything else? Then, please call our friendly support team on +44(0)151 525 0343. You can also contact us on sales@rockofftrade.com New to Rock Off? Please Register... Rock Off Trade Customer Registration Enables access to our fantastic trade prices & online ordering system Postal Address Rock Off Retail Limited t/a Rockoff Trade Units 1,2 & 3 Aintree Building, Aintree Way, Liverpool, L9 5AQ Tel:  +44(0)151 525 0343 Email: sales@rockofftrade.com Normal Business Hours 9:00 hrs to 17:30 hrs (UK time GMT/BST) Monday to Friday excluding UK public holidays. Subscribe to our Newsletter Thanks for signing up! Stay ahead of the competition with our insider newsletter Sign up and get the news on entertainment & music merchandise releases, special offers and exclusive promotions from Rock Off. Designed for trade only customers, we don't share your data and you can unsubscribe any time. Email Address First Name Last Name Phone Number Company Website Email Lists . General Interest .. Classic Rock .. Metal .. Pop & Contemporary .. The Beatles .. TV, Film & Character Sign Up By submitting this form, you are granting: RockOff Retail Limited, http://www.rockofftrade.com permission to email you. You may unsubscribe via the link found at the bottom of every email.  (See our Email Privacy Policy for details.) Emails are serviced by Constant Contact. Fully Supporting Trade Buyers We supply on a trade-only basis and not directly to the public.  To order, please register or log-in . If you have any queries contact us directly . Get the latest news on arrivals, special offers & more by subscribing to our Trade-Only Newsletter and visit our Weekly Blog for even more insights to maximise your sales . Currency Conversion Calculator (Guide Only) Product Categories Artists A to Z TV & Character Apparel Accessories Featured Collections Coming Soon Arrivals Information About Us Apply for an Online Account FAQs Additional Product Information The Rock Off Weekly Blog Terms & Conditions Contact Us +44 (0)151 525 0343 E: sales@rockofftrade.com Contact us News Blog Rock Off on Facebook Rock Off on Twitter Rock Off on Instagram Rock Off on Pinterest Rock Off on Youtube Subscribe for all the latest news Copyright Info Designed, Managed & Maintained by Ferguson Web Consultants since 2009 Copyright RockOff Trade 1999 - 2025. All Rights Reserved."
    },
    {
      "url": "https://www.schoolofrock.com/franchising/leadership-team",
      "text": "Leadership | Music Franchise Team | School of Rock Franchising Owning a franchise How to start a franchise Franchise opportunities Franchise Startup Costs Franchising Process Franchise Reviews Franchise FAQs Why School of Rock About Leadership Team Careers for musicians + educators News Request Info MEET THE SCHOOL OF ROCK TEAM Contact Us Leadership Team Meet the team that combines business savvy, a passion for music, and a drive to help franchisees succeed within our network of music franchises. Our leaders are a group of experienced franchise executives who are either musicians themselves or deeply passionate about music and music education at every successful musical school location. Stacey Ryan President Stacey joined School of Rock in 2015 as an Independent Consultant and steadily advanced through her dedication and impactful leadership. After serving as Chief Operations Officer for five years, Stacey stepped into an expanded leadership role when former CEO Rob Price transitioned to a position at School of Rock’s parent company, YEB. The company then adopted a leadership structure without a formal CEO, and Stacey was elevated to President of School of Rock in 2024. As President, Stacey oversees the day-to-day administrative and operational functions of School of Rock globally, ensuring the brand’s mission and vision for this leading education business franchise are carried out at every level. A graduate of Rutgers University, Stacey began her career in education at Huntington Learning Centers, where she grew her center and region into the top-performing operation in the nation. She then joined Goddard Preschools, where she developed a new department within Operations, redefining quality standards and driving results by supporting and growing both top and underperforming locations. Stacey has always had a passion for music, which has fueled her commitment to childhood education and her success at School of Rock. Her favorite musical artists include The Beatles, The Struts, and Rodrigo y Gabriela. Sam Dresser Chief Innovation Officer Since joining School of Rock in 2013, Sam has held various roles, from overseeing technology and the help desk team to now ensuring that all of our music programs, curricula, and teaching tools are world-class as our Chief Innovation Officer. Sam plays an integral part in crafting the roadmap to School of Rock's patented curriculum and leads projects that execute on that vision. While pursuing his music degree in Jazz Studies at DePaul University in Chicago, he began working at Apple retail stores. After completing his degree, Sam spent almost 10 years at Apple focusing on customer experience, management, and training. He grew up in a musical household, has always had a passion for music, and has been able to bring all of his passions together at School of Rock. Sam's favorite musical artists include Sonny Rollins, Foo Fighters, The Beatles, and Stevie Wonder. Anthony Padulo Chief Development Officer As School of Rock's Chief Development Officer, Tony oversees School of Rock's global franchise sales and real estate efforts, growing our network of music franchises, as well as managing our New School Opening efforts, franchise renewals, and resale programs. With over 40 years of experience in Franchise Development, Tony has served in various leadership positions during his 22 years at Dunkin’ Brands, including leading international development for 10 of those years. During that period, Tony launched Dunkin’ Donuts and Baskin-Robbins in excess of 30 new countries. Tony has also served as EVP, Global Development for BrightStar Care, the premier in-home care provider, VP of Franchise Development for Goddard Systems, another education business franchise, and Senior VP of Development at AAMCO Transmissions Inc. He has also had senior development roles with BP Oil, and ReMax Realty, one of the leading real estate companies worldwide. A graduate of Loyola College in Montreal, Canada, Tony came to the US in 1987. Tony's favorite musical artists include Tina Turner, Adele, Fleetwood Mac, and Alicia Keys. Demi Iskandar Head of Marketing Demi joined School of Rock in March 2020, where she witnessed the School of Rock community come together in countless ways to overcome the challenges of a global pandemic. Before joining School of Rock, Demi graduated from the State University of New York at Geneseo and moved to Los Angeles, California, where she began building her career in marketing at the United States-based new homebuilding company, KB Home. Demi is responsible for the company's domestic and international marketing strategies and leads a dynamic, customer-centric team. Together, they provide comprehensive brand support, execute large-scale events, oversee marketing activities for all School of Rock locations, and collaborate with the Franchise Development team to grow the brand's footprint. With expertise in digital marketing, brand strategy, content creation, and franchise marketing, Demi focuses on innovative campaigns that amplify School of Rock's impact. She thrives on collaboration, creativity, and data-driven decision-making to ensure marketing efforts resonate with students, parents, and the network of franchise owners and staff. Passionate about the intersection of music, education, and marketing, she is committed to inspiring the next generation of musicians while supporting the success of the worldwide network. Some of Demi's favorite musical acts include the Yeah Yeah Yeahs, Nina Simone, Black Keys, Pretty Lights, and Amine. Eric Schmidt Vice President of Information Technology Eric currently serves as School of Rock's Vice President of Information Technology, overseeing technology and the technical support team. Prior to joining School of Rock, Eric spent over 20 years in the medical device industry, focusing on Information Technology and Business Intelligence. Most recently, he served as the Director of Information Technology and Director of Business Intelligence/IT Applications for Arjo ($870M) and Getinge ($2.5B). Eric holds a BS in Network and Communications Management and graduated summa cum laude from DeVry University. Eric’s passion for music started when he was 10 years old and grew into a love for both musical performance and luthiery. In his free time, he enjoys building exact replicas of iconic rock guitars. Eric's favorite musical artists include John Mayer, Metallica, Rival Sons, Dead Sara, and many old-school blues guitarists. Jason Barteck Vice President of International Operations Jason Barteck began his career at School of Rock in 2010, directing group programs and teaching lessons in Baltimore, MD. He later oversaw a successful school in Littleton, CO, serving as both Music Director and General Manager. Since 2019, Jason has been supporting the global School of Rock community on the corporate team, where he was instrumental in launching the GearSelect program, providing everyone in our organization with access to premier musical instrument and equipment brands. He has also played a key role in managing franchise compliance, demonstrating his unwavering commitment to student safety. As Vice President of International Operations, Jason continues to advocate for expanding School of Rock’s global presence and ensuring the highest standards in music education within each international musical school. With his music degree from the University of Colorado Denver, Jason combines passion and expertise to help drive the success of School of Rock’s performance-based programs worldwide. As a musician himself from a young age, Jason draws inspiration from a wide range of musical influences, with favorites including Prince, Jellyfish, Bernhoft, and Paramore. Jim Love Vice President of Operations Jim joined School of Rock in 2006, serving as General Manager/Music Director for one of the original Philadelphia-area locations. In 2018, he moved into the role of Director of Operations. In addition to managing the 7 company-owned schools and providing support to the 44 franchise units in the Northeast, he served as Master Franchise support to Brazil and Latin America, as well as directly supporting School of Rock’s franchisees in Australia and Canada (Ontario). Jim now oversees the administrative functions of School of Rock’s domestic operations, supporting the success of our US-based music franchises. Jim holds a degree in Music Education and has been a professional musician and educator for thirty years. His favorite music artists are Led Zeppelin, Rush, the Misfits, Ghost, and Miles Davis, plus a special nostalgic affinity for KISS. Cia Tucci Vice President of Company School Operations As the Vice President of Company School Operations, Cia is responsible for building, supporting, and strengthening relationships with Operations Managers, General Managers, and school teams/staff. Her primary focus is on ensuring the continued success of our Company Owned schools by driving excellence in music programs, operational efficiency, and team collaboration, sharing best practices applicable across our education business franchise network. Cia has over 30 years of leadership, operations, and multi-unit / function experience. She started her career as a cashier and spent many years in Operations and Merchandising, which led to her first executive role as Vice President, Store Brands & Quality Assurance, leading the company’s $5B private label portfolio. In Supply Chain, she held roles of Vice President, Inventory Management for the chain’s 10k+ outlets and Vice President, Distribution where she led over 8,000 colleagues across a multi-unit, nationwide footprint. As Vice President, Sysco Brands, Cia was responsible for managing a $18B private label portfolio. Within her first year, she developed a long-term growth strategy, built a team, and launched the strategy designed to reposition Sysco Brands for increased sales and margin as well as brand differentiation within the industry. In all of her roles, she was responsible for financial performance, market growth, creating programs to improve service and brand differentiation with a deliberate focus on building, leading, and developing people. Some of Cia’s favorite music artists are REM, Elton John, Ben Folds, and Stevie Wonder. REQUEST FRANCHISE INFORMATION You can call us at 877-556-6184 to learn more about your School of Rock franchise opportunity or fill out the form on this page to receive our Franchise Information Report , which includes more in-depth information on our business model and the franchising process. For media inquiries, please contact media@schoolofrock.com . We've Received Your Info Thank you for your interest in franchising with School of Rock! Our Franchise Development team will be in touch. Download our Franchise Information Brochure. Country* Afghanistan Aland Islands Albania Algeria Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegowina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Cook Islands Costa Rica Cote D'Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France France, Metropolitan French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guatemala Guernsey Guinea Guinea-bissau Guyana Haiti Heard and Mc Donald Islands Honduras Hong Kong Hungary Iceland India Indonesia Iran (Islamic Republic of) Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia, The Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Martinique Mauritania Mauritius Mayotte Mexico Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Norway Oman Pakistan Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Kitts and Nevis Saint Lucia Saint Martin (French part) Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten (Dutch part) Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka St. Helena St. Pierre and Miquelon Sudan Suriname Svalbard and Jan Mayen Islands Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda UK Ukraine United Arab Emirates Uruguay USA Uzbekistan Vanuatu Vatican City State (Holy See) Venezuela Viet Nam Wallis and Futuna Islands Western Sahara Yemen Yugoslavia Zaire Zambia Zimbabwe State/Province* 'Ajman 'Ali Sabih 'Amman 'Asir ?air ?aška ?u?er-Sandevo A'ali an Nil A'ana Aargau Abaiang Abakan Abemama Abengourou Aberdeen Aberdeenshire Abia Abidjan Abkhazia Aboisso Abra Abseron Abu Zaby Abuja Federal Capital Territory Abyan Acklins Açores Acoua Acquaviva Acre Ad Dakhiliyah Ad Dakhla Ad Dali Ad Daqahliyah Ad Dawhah Adamawa Adamawa (Adamaoua) Adan Adana Addis Ababa Addu Adelie Land Adiake Adiyaman Adjumani Adrar Adrar Adzope Aerodrom Afar Afyonkarahisar Agadez Agadir Agalega Islands Agboville AgcabAdi Agdam Agdas Aginskoye Agnibilekrou Agri Agrigento Agstafa Agsu Aguascalientes Agusan del Norte Agusan del Sur Ahal Welayaty Ahuachapan Ahvenanmaan Laani Aichi Aiga-i-le-Tai Aileu Ain Ain Defla Ain Temouchent Ainaro Aisen del General Carlos Ibanez Aisne Aitutaki Aiwo Aizkraukles Rajons Ajaria Ajdabiya Ajlun Akershus Akita Akkar Aklan Aksaray Akwa Ibom Al 'Aqabah Al 'Asimah Al 'Aziziyah Al Ahmadi Al Anbar Al Bahah Al Bahr al Ahmar Al Bahr al Ahmar Al Balqa' Al Basrah Al Batinah Al Bayda Al Buhayrah Al Buhayrat Al Farwaniyah Al Fatih Al Fayyum Al Fujayrah Al Gharbiyah Al Ghuwayriyah Al Hasakah Al Hoceima Al Hudaydah Al Hudud ash Shamaliyah Al Iskandariyah Al Isma'iliyah Al Jabal al Akhdar Al Jahra' Al Jawf Al Jawf Al Jazirah Al Jizah Al Jufrah Al Jumayliyah Al Karak Al Karbala Al Khartum Al Khawr Al Khums Al Kufrah Al Ladhiqiyah Al Madinah Al Mafraq Al Mahrah Al Mahwit Al Minufiyah Al Minya Al Muthanna Al Qadarif Al Qadisyah Al Qahirah Al Qalyubiyah Al Qasim Al Qunaytirah Al Wadi al Jadid Al Wahdah Al Wakrah Al Wusta Alabama Alagoas Alajuela Alaska Álava Alba Albacete Albay Alberta Alepe Alessandria Aley Alger Ali Bayramli Alibori Alicante Allier Almaty Almaty City Almeria Alo Alofi North Alofi South Alpes de Haute Provence Alpes Maritimes Alsace Alta Verapaz Alto Paraguay Alto Parana Aluksnes Rajons Alytus Amambay Amapa Amasya Amazonas Amazonas Amazonas Amazonas Ambergris Cays American Samoa Amhara Amnat Charoen Amran An Giang An Najaf An Nil al Abyad An Nil al Azraq An Nuqat al Khams Anabar Anadyr Anambra Ancash Ancona Andaman and Nicobar Islands Andhra Pradesh Andijon Andorra la Vella Anetan Ang Thong Anglesey Anguila Anguillita Angus Anhui Anibare Anjouan Ankara Annaba Anse aux Pins Anse Boileau Anse Etoile Anse Louis Anse Royale Anse-la-Raye Anseba (Keren) Antalya Antananarivo Antartida e Islas del Atlantico Antioquia Antique Antofagasta Antsiranana Antwerpen Anzoategui Aomori Aosta Apac Apatou Apayao Appenzell Ausserrhoden Appenzell Innerrhoden Apure Apurimac Aqmola Aqtobe Aquila Aquitaine Ar Raqqah Ar Rayyan Ar Riyad Ara?inovo Arad Aragatsotn Aragua Aranuka Ararat Arauca Araucania Arbil Archipel des Marquises Archipel des Tuamotu Archipel des Tubuai Ardabil Ardahan Ardèche Ardennes Arequipa Arezzo Arges Argyll and Bute Arhangay Arhus Ari Atoll Dheknu Ari Atoll Uthuru Ariana Ariège Arima Arizona Arkahangelsk Arkansas Armavir Armed Forces Africa Armed Forces Americas Armed Forces Canada Armed Forces Europe Armed Forces Middle East Armed Forces Pacific Arorae Arrondissements Of The Guadeloup Artibonite Artigas Artvin Arua Aruba Arunachal Pradesh Arusha As Sulaymaniyah As Suwayda As Suways Ascension Ascoli Piceno Ash Shamaliyah Ash Shariqah Ash Sharqiyah Ash Sharqiyah Ash Sharqiyah (Eastern) Ash Shati' Ashanti Region Assaba Assam Astana City Astara Asti Astrakhan Asturias Asuncion Aswan Asyut At Ta'mim At Tafilah Atacama Atafu Atakora Atiu Atlantico Atlantico Norte Atlantico Sur Atlantida Atlantique Attapu Attard Attica Atua Atyrau Aube Auckland Aude Aurora Aust-Agder Australian Capital Territory Austurland Auvergne Avannaa Avatele Aveiro Avellino Aveyron Ávila Awala-Yalimapo Awbari Awdal Ayacucho Aydin Ayeyarwady Ayutthaya Az Zahirah Az Zarqa' Az Zawiyah Azilal Azua Azuay Ba Ria-Vung Tau Baabda Baalbek BabAk Babil Bac Giang Bac Kan Bac Lieu Bac Ninh Bacau Bacs-Kiskun Badajoz Badakhshan Baden-Württemberg Badghis Bafata Region Baghdad Baghlan Bagmati Bago Bahia Bahr al Jabal Baie Lazare Baie Sainte Anne Baiti Baja California Norte Baja California Sur Baja Verapaz Baker Island Baki Bakool Balaka BalakAn Bale Baleares Bali Balikesir Balkan Welayaty Balkh Balochistan Balti Balvu Rajons Balzan Balzers Bam Bamako Capital District Bamian Bamingui-Bangoran Banaadir Banaba Bandraboua Bandrele Bandundu Banghazi Bangka Belitung Bangkok Bangolo Bangui Bani Suwayf Banja Luka Banjul Banskobystricky Banteay Meanchey Banten Banwa Baoruco Barahona Baranya Barbuda Barcelona BArdA Bari Bari Barima-Waini Barinas Barisal Barletta-Andria-Trani Barnaul Bartin Bas Rhin Bas-Congo Basel-Landschaft Basel-Stadt Basilan Basse Basse-Kotto Basse-Pointe Bataan Batanes Batangas Batha Batken Batman Batna Batroun Battambang Batys Qazaqstan Baucau Bauchi Bauskas Rajons Bay Bay of Plenty Bayan-Olgiy Bayanhongor Bayburt Bayelsa Bayern Bayqongyr City Bazega Be'er Sheva Beau Bassin-Rose Hill Beau Vallon Bechar Bedfordshire Beijing Beja Beja Bejaia Bekes Bekescsaba Bel Air Bel Ombre Bela Krajina Belait Belgorod Belize Bellefontaine Belluno Ben Arous Ben Slimane Ben Tre Benevento Bengkulu Bengo Benguela Benguet Beni Beni Mellal Benishangul-Gumaz Benue Beoumi Berat Berea Bergamo Berkshire Berlin Bern Berovo Berry Islands Beru Beyla Beylaqan Bheri Biankouma Bie Biella Bihar Bihor Bijeljina Bika'at Hayarden Bilasuvar Bilecik Biliran Biltine Bimini Bingol Binh Dinh Binh Duong Binh Phuoc Binh Thuan Bint Jbeil Bio-Bio Biombo Region Birgu Birkirkara Birobidzhan Birzebbuga Bishkek Biskra Bissau Region Bistrita-Nasaud Bitlis Bitola Bizerte Bjelovar-Bilogora Black Point Black River Blaenau Gwent Blagoevgrad Blagoveshchensk Blantyre Blekinge Blida Boa Vista Boaco Bobonaro Bocanda Bocas del Toro Bodden Town Boe Boffa Bogdanci Bogota D.C. Bogovinje Bohol Boke Bokeo Bolama Region Bolikhamxai Bolivar Bolivar Bolivar Bologna Bolu Bolzano Bomi Bonaire Bondoukou Bong Bongouanou Boqueron Bordj Bou Arreridj Borgo Maggiore Borgou Borkou-Ennedi-Tibesti Bormla Bornholm Borno Borsod-Abauj-Zemplen Bosanskopodrinjski Kanton Bosilovo Botosani Bouafle Bouake Bouches du Rhône Bouéni Bouenza Bougainville Bougouriba Bouira Boujdour Boulemane Boulgou Boulkiemde Boumerdes Bouna Boundiali Boyaca Brabant Wallon Braga Bragança Braila Brakna Brandenburg Brasov Bratislavsky Brava Brazzaville Brcko district Bremen Brescia Brestskaya (Brest) Bridgend Brikama Brindisi Bristol British Columbia Brittany Brokopondo Brong-Ahafo Region Brunei and Muara Brussels Brvenica Bryansk Bsharri Buada Bubanza Buckinghamshire Bucuresti Budapest Buenos Aires Bugiri Bujumbura Bukidnon Bulacan Bulawayo Bulgan Bulqize Bumthang Bundibugyo Bur Sa'id Burdur Burgas Burgenland Burgos Burgundy Buriram Bursa Bururi Bushehr Bushenyi Busia Buskerud Butare Butaritari Butel Butha-Buthe Buxoro Buzau Byblos Byumba Ca Mau Caaguazu Caazapa Cabanas Cabinda Cabo Delgado Cabrayil Cáceres Cacheu Region Cádiz Caerphilly Cagayan Cagliari Cahul Cajamarca Calarasi Caldas Calheta de Sao Miguel California Calilabab Callao Caltanissetta Calvados Camaguey Camarines Norte Camarines Sur Cambridgeshire Camiguin Camopi Campeche Campobasso Can Tho Canakkale Cañar Canelones Canillo Canindeyu Cankiri Cankuzo Cantabria Cantal Canterbury Cantons Of The Guadeloupe Depart Cao Bang Capellen Capital Capital Federal Capiz Caprivi Caqueta Carabobo Caras-Severin Carazo Carbonia-Iglesias Carchi Cardiff Cargados Carajos Shoals (Saint B Carlow Carmarthenshire Carriacou Cartago Casablanca Casanare Cascade Case-Pilote Caserta Castellón Castelo Branco Castries Cat Island Catamarca Catanduanes Catania Catanzaro Cathedral Parish Cauca Cavan Cavite Cayenne Cayo Ceara Cebu Centar Centar Župa Center Loire Valley Central Central Central Central Central Central Central Central Central (Maekel) Central Abaco Central and Western Hong Kong Is Central Andros Central Division Central Eleuthera Central Greece Central Macedonia Central Region Central River Centrale Centre Centre Ceredigion Cerro Largo Cesar Cesinovo-Obleš Cesu Rajons Ceuta Ch'ungch'ong-bukto Ch'ungch'ong-namdo Chachoengsao Chaco Chagang-do Chaguanas Chahar Mahaal and Bakhtiari Chai Nat Chaiyaphum Chalatenango Champagne Champasak Chandigarh Chang-hua Chanthaburi Chaouen Charente Charente Maritime Chari-Baguirmi Charlotte Cheboksary Cheju-do Chelyabinsk Cher Cherkasy Cherkessk Chernihiv Chernivtsi Cheshire Chi-lung Chia-i Chia-i city Chiang Mai Chiang Rai Chiapas Chiba Chiconi Chiesanuova Chieti Chihuahua Chikwawa Chimaltenango Chimborazo Chimbu Chin State Chinandega Chiquimula Chiradzulu Chiriqui Chirongui Chisinau Chita Chitipa Chittagong Chlef Choco Choiseul Choiseul Cholla-bukto Cholla-namdo Choluteca Chon Buri Chongqing Chontales Chouf Christ Church Christ Church Nichola Town Chu Chubut Chukha Chumphon Chuquisaca Cibitoke Ciego de Avila Cienfuegos Citta di San Marino City of Freeport City of Zagreb Ciudad de La Habana Ciudad Real Clackmannanshire Clare Clarendon Parish Clervaux Cluj Coahuila de Zaragoza Coast Cochabamba Cocle Coimbra Cojedes Colima Collines Colon Colon Colonia Colorado Comayagua Commewijne Communes Of The Guadeloupe Depar Como Comoe Compostela Conakry Concepcion Connecticut Constanta Constantine Conwy Copan Copenhagen Copperbelt Coquimbo Cordillera Córdoba Cordoba Cordoba Cork Cornwall Coromandel Coronie Corozal Corrèze Corrientes Corse Corse du Sud Cortes Corum Cosenza Côte d'or Côtes d'Armor Cotopaxi County Antrim County Armagh County Down County Fermanagh County Londonderry County Tyrone Couva/Tabaquite/Talparo Cova Lima Covasna Coyah Creek Cremona Crete Creuse Crimea Crooked Island Cross River Crotone Csongrad Cuando-Cubango Cuanza Norte Cuanza Sul Cuenca Culfa Cumbria Cundinamarca Cunene Cuneo Curaçao Curepipe Cuscatlan Cusco Cuvette Cuvette-Ouest Cuyuni-Mazaruni Cyangugu Da Nang Dabakala Dabola Dabou Dadra and Nagar Haveli Dagana Dahuk Daista Aceh Daista Yogyakarta Dajabon Dak Lak Dak Nong Dakar Dakhlet Nouadhibou Dalaba Dalama Daloa Daman and Diu Danane Danger Island Daoukro Dar es Salaam Dara Darhan uul Darien Darnah Dashhowuz Welayaty Daskasan Daugavpils Daugavpils Rajons Dauphin Davaci Davao del Norte Davao del Sur Davao Oriental Dayr az Zawr Debar Debarca Debrecen Dedza Del?evo Delaware Delhi Dellis Cay Delta Delta Amacuro Delvine Dembeni Demerara-Mahaica Demir Hisar Demir Kapija Denbighshire Denigomodu Denizli Dennery Dependencias Federales Derbyshire Deux Sèvres Devoll Devon Devonshire Dhaka Dhamar Dhawalagiri Dhi Qar Diber Diego Garcia Diego Martin Diekirch Dien Bien Diffa Dikhil Dili Dimashq Dimbokro Dimbovita Dingli Dinguiraye Diourbel Dire Dawa Direction Island District of Columbia Distrito Federal Distrito Federal Distrito Federal Distrito Nacional Divo Diyala Diyarbakir Djelfa Djibouti Dki Jakarta Dnipropetrovs'k Dobeles Rajons Doboj Dobrich Dodoma Dog Dolenjska Dolj Dolneni Dolnoslaskie Domagnano Donegal Donets'k Dong Nai Dong Thap Donga Dordogne Dornod Dornogov Dorset Dosso Doubs Dowa Drenthe Drôme Drugovo Druif Beach Duarte Dubayy Dublin Dubreka Dubrovnik-Neretva Ducos Dudinka Duekoue Dumfries and Galloway Dumyat Dunaujvaros Dundee DundgovL Durango Durazno Durham Durres Duzce Dzaoudzi Dzavhan Eagle Islands East (Est) East Ayrshire East Azarbaijan East Berbice-Corentyne East Caicos East Dunbartonshire East Grand Bahama East Lothian East Macedonia and Thrace East New Britain East Renfrewshire East Riding of Yorkshire East Sepik East Side East Sussex Eastern Eastern Eastern Eastern Eastern Eastern Cape Eastern Division Eastern Highlands Eastern Hong Kong Island Eastern Region Eastern Samar Ebonyi Echternach Edinburgh Edinet Edirne Edo Eger Egmont Islands Ehime Eilat and Arava Eiði Ekiti El Bayadh El Jadida El Kelaa des Sraghna El Oro El Oued El Paraiso El Peten El Progreso El Quiche El Seybo El Tarf Elazig Elbasan Elias Pina Elista Encamp Enga Enna Entre Rios Enugu Epirus Equateur Er Rachidia Ermera Erongo Erzincan Erzurum Es Smara Escaldes-Engordany Esch-sur-Alzette Eschen Escuintla Esfahan Eskisehir Esmeraldas Espaillat Espirito Santo Essaouira Essequibo Islands-West Demerara Essex Essonne Esteli Estuaire Etela-Suomen Laani Etranger Eure Eure et Loir Évora Ewa ExtrÃªme-Nord Exuma Fa'asaleleaga Faadhippolhu Faetano Fakaofo Falcon Falkirk Famagusta Fámjin Farah Faranah Farg'ona Faro Faroe Islands Fars Faryab Fatick Federally Administered Tribal Ar Federated States Of Micronesia Fejer Felidhe Atoll Ferkessedougou Fermo Ferrara Fes Fgura Fianarantsoa Fier Fife Figuig Finistère Finnmark Fiordland Fiorentino Firenze Flacq Flat Island Flevoland Flintshire Flores Floriana Florida Florida Foca Foggia Fonds-Saint-Denis Fontana Fontvieille Forecariah ForlÃ¬ Formosa Fort-De-France France Comte Francisco Morazan Frederiksborg Free State French Cay Fria Fribourg Friesland Frosinone Fua Mulaku Fuglafjørður Fugloy Fujian Fukui Fukuoka Fukushima Funafuti Funningur Fuzuli Fyn Gabes Gabrovo Gabu Region Gadabay Gafsa Gaga'emauga Gagaifomauga Gagauzia Gagnoa Galápagos Galati Galguduud Galil Galway Gambela Gamprin Ganca Gandaki Gansu Ganzourgou Gao Gaoual Gard Gargur Gasa Gash-Barka (Barentu) Gauteng Gävleborg Gaxaq Gaza Gazi Baba Gaziantep Gedo Geghark'unik' Gelderland Genève Genova George Town Georgia Gerona Gers Gevgelija Ghadamis Ghajnsielem Ghanzi Gharb Gharb al Istiwa'iyah Gharb Bahr al Ghazal Gharb Darfur Gharb Kurdufan Ghardaia Gharyan Ghasri Ghazni Ghowr Gia Lai Gifu Gikongoro Gilan Giresun Gironde Gisborne Gisenyi Gitarama Gitega Giurgiu Gjirokaster Gjorče Petrov Glacis Glarus Glasgow Gloucestershire Gnagna Goa Goias Golestan Gombe Gomo-Altaysk Goranboy Gorenjska Gorgol Gorizia Gorj Gorno-Altaysk Gorno-Badakhstan Gorontalo Gostivar Gotland Gourma Govi-Altay Govi-Sumber Goycay Gracias a Dios Gradsko Gramsh Granada Granada Grand Bassa Grand Cape Mount Grand Cay Grand Gedeh Grand Kru Grand Port Grand Turk Grand' Anse (on Mahe) Grand' Anse (on Praslin) Grand'Anse Grand'Rivière Grand-Bassam Grand-Lahou Grand-Santi Grande Comore Granma Graubünden Greater Accra Region Greater London Greater Manchester Grenadines Grevenmacher Groningen Gros-Islet Gros-Morne Grosseto Groznyy Guadalajara Guadalcanal Guainia Guaira Guajira Guam Guanacaste Guanajuato Guangdong Guangxi Guantanamo Guarda Guarico Guatemala Guaviare Guayas Gudja Gueckedou Guelma Guelmim Guera Guerrero Guidimaka Guiglo Guimaras Guipúzcoa Guizhou Gujarat Gulbenes Rajons Gulf Gulu Gumma Gumushane Guria Gwynedd Gyor Gyor-Moson-Sopron Gzira Gøtu Kommuna Ha Giang Ha Nam Ha Noi Ha Tay Ha Tinh Ha'apai Ha'il Haa Haciqabul Hadhdhunmathi Hadramawt Hai Duong Hai Phong Haifa Hainan Hainaut Hajdu-Bihar Hajjah Hakkari Hakupu Halab Halland Hamadan Hamah Hamburg Hamgyong-bukto Hamgyong-namdo Hamilton Hamilton City Hampshire Hamrun Hanover Parish Harare Harbour Island Hardap Harghita Hariai Harjumaa (Tallinn) Haryana Has Hasbaya Haskovo Hatay Hato Mayor Hau Giang Haut Rhin Haut-Mbomou Haut-Ogooue Haute Corse Haute Garonne Haute Loire Haute Marne Haute Saône Haute Savoie Haute Vienne Haute-Kotto Hautes Pyrénées Hautes-Alpes Hauts de Seine Hawaii Hawalli Hawke's Bay Heard Island Hebei Hedmark Heilongjiang Helmand Henan Hentiy Herat Hérault Hercegovacko-neretvanski Kanton Heredia Herefordshire Hermel Herrera Hertfordshire Hessen Heves Hhohho Hidalgo Highlands Hiiraan Hiiumaa (Kardla) Hikutavake Himachal Pradesh Hims Hiroshima Hlavní město Praha Ho Chin Minh Hoa Binh Hodh Ech Chargui Hodh El Gharbi Hodmezovasarhely Hofuoborgarsvaeoi Hoima Hokkaido Holguin Home Island Homyel'skaya (Homyel') Hong Kong Honiara Hope Town Horad Minsk Hordaland Hormozgan Horsburgh Island Houaphan Houet Hov Hovd Hovsgol Howland Island Hrodzyenskaya (Hrodna) Hsin-chu Hsin-chu Hua-lien Huambo Huancavelica Huanuco Hubei Huehuetenango Huelva Huesca Huila Huila Hunan Hunedoara Hung Yen Húsar Húsavík Huvadhu Atoll Dhekunu Huvadhu Atoll Uthuru Hvalba Hvannasund Hwanghae-bukto Hwanghae-namdo Hyogo I-lan Ialomita Iasi Ibaraki Ibb Ica Ida-Virumaa (Johvi) Idaho Idlib Ifrane Ifugao Iganga Igdir Ijuw Iklin Ilam Ile Amsterdam Ile Saint-Paul Iles Crozet Iles du Vent Iles Kerguelen Iles Loyaute Iles Sous-le-Vent Ilfov Ilinden Ille et Vilaine Illinois Illizi Ilocos Norte Ilocos Sur Iloilo Imbabura Imereti Imisli Imo Imperia Inagua Inch'on-gwangyoksi Inchiri Independencia Indiana Indre Indre et Loire Inhambane Inner Mongolia Intibuca Inverclyde Ioba Ionian Islands Iowa Iracoubo Irbid Irian Jawa Barat Irian Jaya Tengah Irian Jaya Timur Iringa Irkutsk Isabel Isabela Isére Isernia Ishikawa Isla Isla de la Juventud Islamabad Capital Territory Islands New Territories Islas de la Bahia (Bay Islands) Isle of Man Isle of Wight Ismayilli Isparta Issia Istanbul Istra Ita-Suomen Laani Itapua Ivano-Frankivs'k Ivanovo Iwate Izabal Izhevsk Izmir Jacqueville Jaén Jalal-Abad Jalapa Jalisco Jambi Jammu and Kashmir Jämtland Janakpur Janjangbure Janub Darfur Janub Kurdufan Janub Sina' Jarash Jarayan al Batinah Jarvamaa (Paide) Jarvis Island Jasz-Nagykun-Szolnok Jawa Barat Jawa Tengah Jawa Timur Jegunovce Jehuda Mountains Jekabpils Rajons Jelgava Jelgavas Rajons Jendouba Jerusalem Jezzine Jiangsu Jiangxi Jigawa Jihočeský Jihomoravský Jijel Jilin Jinja Jinotega Jizan Jizzax Jogevamaa (Jogeva) Johnston Atoll Johor Jönköping Jowzjan Jubbada Dhexe Jubbada Hoose Jujuy Junin Junqali Jura Jura Jurmala Jutiapa Kabale Kabarole Kaberamaido Kabul Kachin State Kadiogo Kaduna Kafr ash Shaykh Kagawa Kagera Kagoshima Kahramanmaras Kairouan Kakheti Kalangala Kalasin Kalbacar Kalimantan Barat Kalimantan Selatan Kalimantan Tengah Kalimantan Timur Kalinga Kalinigrad Kalkara Kalmar Kaluga Kampala Kamphaeng Phet Kampong Cham Kampong Chhnang Kampong Som Kampong Speu Kampong Thom Kampot Kamuli Kamwenge Kanagawa Kanchanaburi Kandahar Kandal Kanem Kangwon-do Kangwon-do Kani-Kéli Kanifeng Kankan Kano Kansas Kanton Kanton Sarajevo Kanungu Kao-hsiung city Kao-hsiung county Kaoh Kong Kaolack Kapchorwa Kapisa Kaposvar KAR Kärnten Kara Karabuk Karaman Karas Karbinci Kardjali Karlovac Karlovarský Karnali Karnataka Karonga Karpoš Kars Karuzi Kasai-Occidental Kasai-Oriental Kasese Kasnodar Kassala Kasserine Kastamonu Kasungu Katakwi Katanga Katiola Katsina Kaunas Kavadarci Kavaje Kavango Kayah State Kayanza Kayes Kayin State Kayseri Kayunga Kazan Keb Kebbi Kebili Kecskemet Kedah Kef Kelantan Kemerovo Kemo Kenedougou Kenitra Kent Kentucky Kerala Kercem Kerewan Kerman Kermanshah Kerouane Kerry Kesrwan Kgalagadi Kgatleng Khabarovsk Khammouan Khanty-Mansiysk Kharkiv Kherson Khatlon Khemisset Khenchela Khenifra Khmel'nyts'kyy Khomas Khon Kaen Khost Khouribga Khulna Khuzestan Ki?evo Kibaale Kiboga Kibungo Kibuye Kidal Kiev Kigali Rurale Kigali-ville Kigoma Kildare Kilimanjaro Kilis Kilkenny Kin-men Kindia Kingman Reef Kingston Parish Kinshasa Kirikkale Kiritimati Kirklareli Kirkop Kirovohrad Kirsehir Kirundo Kisela Voda Kisoro Kissidougou Kitaa Kitgum Klaipeda Klaksvík Ko?ani Kobenhavn Kocaeli Kochi Kogi Kohkiluyeh and Buyer Ahmad Kolda Kolhumadulu Kolonje Komarom-Esztergom Komondjari Kompienga Kon?e Konar Kondoz Konya Koprivnica-Krizevci Korce Korhogo Koroška Kosi Kosicky Kosovo Kossi Kostroma Kotayk' Kotido Koubia Kouffo Kouilou Koulikoro Koulpelogo Koundara Koungou Koura Kouritenga Kourou Kouroussa Kourweogo Kowloon City Kowloon Krabi Královéhradeck Krapina-Zagorje Kraslavas Rajons Krasnodar Krasnoyarsk Kratie Kratovo Kriva Palanka Krivogaštani Kronoberg Kruje Kruševo Kuala Lumpur Kucove Kudymkar Kujawsko-Pomorskie Kukes Kuldigas Rajons Kumamoto Kumanovo Kumi Kunene Kunoy Kuntaur Kurbin Kurdamir Kurdistan Kurgan Kuria Kursk Kutahya Kvemo Kartli Kvívík Kwai Tsing New Territories Kwangju-gwangyoksi Kwara KwaZulu-Natal Kweneng Kwun Tong Kowloon Kyenjojo Kyonggi-do Kyongsang-bukto Kyongsang-namdo Kyoto Kyrenia Kyustendil Kyyiv Kyzyl L'Ajoupa-Bouillon L'viv La Altagracia La Condamine La Coruña La Digue La Habana La Libertad La Libertad La Massana La Pampa La Paz La Paz La Paz La Rioja La Rioja La Riviere Anglaise La Romana La Spezia La Trinité La Union La Union La Vega Laane-Virumaa (Rakvere) Laanemaa (Haapsalu) Laayoune Labe Laborie Labuan Lac Lacin Laghman Laghouat Lagos Laguna Lahij Lakepa Lakota Lakshadweep Islands Lambayeque Lampang Lamphun Lampung Lanao del Norte Lanao del Sur Lancashire Landes Languedoc Roussillon Lankaran Lankaran Lansi-Suomen Laani Laois Lapin Lanani Lapusna Lara Larache Larnaca Las Palmas Las Tunas Latina Lautem Lavalleja Le Carbet Le Diamant Le François Le Lamentin Le Lorrain Le Marigot Le Marin Le Morne-Rouge Le Morne-Vert Le Prêcheur Le Robert Le Vauclin Lebap Welayaty Lecce Lecco Leicestershire Leiria Leirvík Leitrim Lekoumou Lelouma Lempira Leon León Leraba Leribe Lérida Lerik Les Anses-d'Arlet Les Trois-Îlets Leyte Lezhe Lhuntse Liaoning Liberecký Libertador General Bernardo O'Hi Librazhd Liege Lien-chiang Liepaja Liepajas Rajons Lija Lika-Senj Likoma Likouala Liku Lilongwe Lima Limassol Limbazu Rajons Limburg Limburg Limerick Limon Limousin Limpopo Lincolnshire Lindi Lipetsk Lipkovo Liquica Lira Lisboa Little Scrub Little Water Cay Littoral Littoral Livorno Lobaye Lodi Lodzkie Loei Lofa Logone Occidental Logone Oriental Loir et Cher Loire Loire Atlantique Loiret Loja Lola Long Island Longford Lop Buri Lorestan Loreto Loroum Lorraine Lorri Los Lagos Los RÃ­os Los Santos Lot Lot et Garonne Louang Namtha Louangphabang Louga Louisiana Louth Lovech Lower River Lowgar Lozère Lozovo Luanda Luapula Lubelskie Lubombo Lubuskie Lucca Lucerne Ludzas Rajons Lugo Luhans'k Lumbini Lunda Norte Lunda Sul Luqa Lusaka Lushnje Luwero Luxembourg Luxembourg M'Sila M'Tsangamouji Ma'an Ma'rib Maalhosmadulu Dhekunu Maalhosmadulu Uthuru Macau Macenta Macerata Machinga Macouba Macouria Madaba Madang Madeira Madhya Pradesh Madinat ash Shamal Madonas Rajons Madre de Dios Madrid Madriz Mae Hong Son Mafeteng Magadan Magallanes y de la Antartica Chi Magdalena Maguindanao Magway Maha Sarakham Mahaica-Berbice Mahajanga Mahakali Maharashtra Mahdia Mahilyowskaya (Mahilyow) Maiana Maine Maine et Loire Maio Makamba Makedonska Kamenica Makedonski Brod Makefu Makhachkala Makin Makira Makkah Málaga Malaita Malampa Malange Malatya Maldonado Male Atoll Malesi e Madhe Mali Mallakaster Malopolskie Maluku Maluku Utara Mambéré-Kadéï Mamou Mamoudzou Man Mana Manabí Managua Manatuto Manawatu-Wanganui Manche Manchebo Beach Manchester Parish Mandalay Mandiana Mangaia Mangghystau Mangochi Mangrove Cay Manica Manicaland Maniema Manihiki Manipur Manisa Manitoba Mankono Manouba Mansakonko Mantova Manuae Manufahi Manus Manyara Manzini Maputo Maputo (city) Mara Maradi Marakei Maramures Maranhao Mardin Margibi Maria Trinidad Sanchez Marijampole Marinduque Maripasoula Maritime Marjeyoun Markazi Marlborough Marne Marowijne Marrakech Marsa Marsaskala Marsaxlokk Marshall Islands Mary Welayaty Maryland Maryland Masaka Masalli Masaya Masbate Maseru Mashonaland Central Mashonaland East Mashonaland West Masindi Masqat Massa-Carrara Massachusetts Masvingo Mat Matabeleland North Matabeleland South Matagalpa Matam Matanzas Matera Matn Mato Grosso Mato Grosso do Sul Matoury Matruh Mauke Maule Mauren Mavrovo and Rostuša Mayaguana Mayaro/Rio Claro Mayenne Maykop Mayo Mayo-Kebbi Maysan Mayuge Mazandaran Mazowieckie Mbahiakro Mbale Mbarara Mbeya Mbomou McDonald Island Mchinji Mdina Meath Mechi Mecklenburg-Vorpommern Medea Medenine Medimurje Medio Campidano Meghalaya Mehedinti Meknes Melaka Melilla Melliea Mendoza Meneng Merida Mersch Merseyside Mersin Merthyr Tydfil Messina Meta Metro Manila Meurthe et Moselle Meuse Mexico Mgarr Miao-li Michigan Michoacan de Ocampo Micoud Middle Caicos Midi Pyrenees Midland Midlands Midlothian Midway Atoll Mie Mila Miladhunmadulu Dhekunu Miladhunmadulu Uthuru Milano Milne Bay Minas Gerais Mindoro Occidental Mindoro Oriental Mingacevir Miniyeh-Danniyeh Minnesota Minskaya Miquelon Miranda Mirdite Misamis Occidental Misamis Oriental Misiones Misiones Miskolc Misratah Mississippi Missouri Mitiaro Miyagi Miyazaki Mizoram Miðvágur Modena Mogila Mohale's Hoek Moheli Moka Mokhotlong Mon State Monaco-Ville Monagas Monaghan Monastir Mondul Kiri Mongar Monmouthshire Mono Monsenor Nouel Mont Buxton Mont Fleuri Montana Montana Monte Cristi Monte Plata Monte-Carlo Montegiardino Montenegro Montevideo Montserrado Montsinéry-Tonnegrande Monza e Brianza Moore's Island Mopti Moquegua Moravskoslezský Moray Morazan Morbihan Morelos Morobe Morogoro Morona Santiago Moroto Moscow Moselle Mosta Mostaganem Mosteiros Mouhoun Mountain Moxico Moyen-Chari Moyen-Ogooue Moyo Mpigi Mpumalanga Mqabba Msida Mt Cook-Mackenzie Mtarfa Mtsamboro Mtskheta-Mtianeti Mtwara Muaskar Mubende Mudug Mugla Muharraq Mukdahan Mukono Mulaku Atoll Mulanje Munxar Muramvya Murcia Mures Murmansk Murzuq Mus Musandam Mutalau Muyinga Mwanza Mwanza Mwaro Mykolayiv Mzimba Møre og Romsdal Naama Nabatieh Nabeul Nador Nadur Naftalan Nagaland Nagano Nagasaki Nagykanizsa Nahouri Nahr an Nil Nairobi Area Najran Nakapiripirit Nakasongola Nakhon Nayok Nakhon Pathom Nakhon Phanom Nakhon Ratchasima Nakhon Sawan Nakhon Si Thammarat Nalchik Namangan Namentenga Namibe Nampula Namukulu Namur Nan Nan-t'ou Nana-Grebizi Nana-Mambere Nangrahar Nanumanga Nanumea Napo Napoli Nara Narathiwat Narayani Narino Naryan Mar Naryn Nassarawa Nassau Island National Capital Navarra Navassa Island Navoiy Naxcivan Naxxar Nayala Nayarit Nazran Neamt Neath Port Talbot Nebbi Nebraska Neembucu Neftcala Negeri Sembilan Negev Negotino Negros Occidental Negros Oriental Nelson Nelsons Island Nes Neuchâtel Neuquen Nevada Nevsehir New Brunswick New Hampshire New Ireland New Jersey New Mexico New South Wales New York Newfoundland and Labrador Newport Ngamiland Ngounie Ngozi Niamey Niari Niassa Nibok Nickerie Nicosia Nidwalden Niederöesterreich Niedersachsen Nièvre Nigde Niger Niigata Nikunau Nilandhe Atoll Dhekunu Nilandhe Atoll Uthuru Nimba Nimruz Ninawa Ningxia Nitriansky Niulakita Niutao Nizhniy Novgorod Nkhata Bay Nkhotakota Nograd Nong Bua Lamphu Nong Khai Nonouti Nonthaburi Noord Noord Brabant Noord Holland Nord Nord Nord Nord Pas de Calais Nord-Est Nord-Kivu Nord-Ouest Nord-Trøndelag Nordjylland Nordland Nordrhein-Westfalen Norfolk Norfolk Island Normandy Norourland eystra Norourland vestra Norrbotten Norte de Santander North (Nord) North Abaco North Aegean North Andros North Ayrshire North Bank North Caicos North Carolina North Central North Cotabato North Dakota North District North East North Eastern North Eleuthera North Khorasan North Lanarkshire North New Territories North Side North West North West North Western North Yorkshire North-West Frontier North-Western Northamptonshire Northern Northern Northern Northern Northern Northern Cape Northern Division Northern Mariana Islands Northern Red Sea (Semien-Keih-Ba Northern Region Northern Samar Northern Territory Northland Northumberland Northwest (Nord-Ouest) Northwest Territories Notranjska Nottinghamshire Nouakchott Noumbiel Nova Scotia Novaci Novara Novgorod Novo Selo Novosibirsk Nsanje Ntcheu Ntchisi Ntungamo Nueva Ecija Nueva Esparta Nueva Vizcaya Nuevo Leon Nuevo Segovia Nugaal Nui Nukufetau Nukulaelae Nukunonu Nunavut Nuoro Nurestan Nusa Tenggara Barat Nusa Tenggara Timur Nyanga Nyanza Nyiregyhaza Nzerekore Oaxaca Obock Obwalden Ocotepeque Oddar Meancheay Odesa Odienne Oecussi Offaly Ogliastra Ogooue-Ivindo Ogooue-Lolo Ogooue-Maritime Ogres Rajons Ogun Oguz Ohangwena Ohio Ohrid Oio Region Oise Oita Okayama Okinawa Oklahoma Olancho Olbia-Tempio Olomoucký Olt Omaheke Ombella-M'Poko Omnogovi Omsk Omusati Ondo Ongtustik Qazaqstan Onotoa Ontario OOS Oberöesterreich Oost-Vlaanderen Opolskie Oppland Oran Orange Walk Oranjestad Ordino Ordu Ordubad Örebro Oregon Orel Orellana Orenburg Orhei Orhon Orientale Orissa Oristano Orkney Islands Orne Oromia Oruro Oruzgan Osaka Osh Oshana Oshikoto Osijek-Baranja Oslo Oslomej Osmaniye Östergötland Osun Otago Other Otjozondjupa Ouaddai Ouaka Ouanary Ouangani Ouargla Ouarzazate Oubritenga Oudalan Oudomxai Oueme Ouest Ouham Ouham-Pende Oujda Oulun Laani Oum el-Bouaghi Oume Our Lady Fatima Parish Ourense Overijssel Ovorhangay Oxfordshire Oyo P'eng-hu P'ing-tung P'yongan-bukto P'yongan-namdo P'yongyang Special City Pader Padova Paget Pahang Pailin Paktia Paktika Palana Palau Palauli Palawan Palencia Palermo Pallisa Palm Beach Palmerston Palmyra Atoll Pamandzi Pampanga Pamplemousses Panama Pando Panevezys Pangasinan Paola Papaïchton Paphos Para Para Paraguari Paraiba Paramaribo Paraná Pardubický Paris Paris / Ill de France Parma Parnumaa (Parnu) Paro Parrot Cay Parwan Pas de Calais Pasco Passore Pastaza Pathum Thani Pattani Paul Pavia Pavlodar Paysandu Pazardjik Pecs Pedernales Peh?evo Peloponnesos Pemagatshel Pemba North Pemba South Pembroke Pembroke Pembrokeshire Penal/Debe Penama Pennsylvania Penrhyn Penza Peqin Perak Peravia (Bani) Perlis Perm Permet Pernambuco Pernik Peros Banhos Perth and Kinross Perugia Pesaro Urbino Pescara Pest Petit Martinique Petropavlovsk-Kamchatskiy Petrovec Petrozavodsk Phalombe Phangnga Phatthalung Phayao Phetchabun Phetchaburi Phichit Phitsanulok Phnom Penh Phongsali Phrae Phuket Piacenza Piaui Picardie Pichincha Pieta Pinar del Rio Pine Cay Pisa Pistoia Pita Pitcairn Island Piura Plaines Wilhems Plaisance Planken Plasnica Plateau Plateau Plateaux Plateaux Pleven Plovdiv Plzeňský Podkarpackie Podlaskie Pogradec Point Fortin Pointe La Rue Poitou Charente Poltava Polvamaa (Polva) Pomeroon-Supenaam Pomorskie Pondicherry Poni Pontevedra Pool Pordenone Porkeri Port Glaud Port Louis Port Louis Port of Spain Portalegre Portland Parish Porto Porto Novo Portuguesa Posavski Kanton Potaro-Siparuni Potenza Potosi Powys Pozega-Slavonia Prachin Buri Prachuap Khiri Khan Prahova Praia Praslin Prato Preah Seihanu (Kompong Som or Si Preah Vihear Preilu Rajons Prekmurje Presidente Hayes Presovsky Prey Veng Prickly Pear Prilep Primorje-Gorski Kotar Primorska Prince Edward Island Princes Town Principe Probištip Provence Providenciales Provincia Annobon Provincia Bioko Norte Provincia Bioko Sur Provincia Centro Sur Provincia Kie-Ntem Provincia Litoral Provincia Wele-Nzas Pskov Puebla Puerto Plata Puerto Rico Pukapuka Puke Pulau Pinang Punakha Punjab Punjab Puno Puntarenas Pursat Pusan-gwangyoksi Putumayo Puy de Dôme Pwani Pyrénées Atlantiqu Pyrénées Orientale Qabala Qacha's Nek Qala Qaraghandy Qashqadaryo Qax Qazax Qazvin Qina Qobustan Qom Qoraqalpog'iston Republikasi Qormi Qostanay Qrendi Quatre Bornes Quba Qubadli Québec Queensland Queretaro de Arteaga Quetzaltenango Quezon Quinara Region Quindio Quintana Roo Quirino Qusar Quthing Qyzylorda R'as al Khaymah Rabat Rabat-Sale Racha Lechkhumi and Kvemo Svanet Radoviš Ragged Island Ragusa Rajasthan Rajshahi Rakahanga Rakai Rakhine State Rankovce Ranong Raplamaa (Rapla) Rapti Rarotonga Rashaya Rason Directly Governed City Ratanak Kiri Ratchaburi Ravenna Rayong Razavi Khorasan Razgrad Reclamation Areas Redange Redonda Reggio Calabria Reggio Emilia Régina Region Metropolitana Relizane Remich Remire-Montjoly Renfrewshire Rennell and Bellona Resen Retalhuleu Rezekne Rezeknes Rajons Rheinland-Pfalz Rhode Island Rhondda Cynon Taff Rhône Rhone Alps Riau Ribe Ribeira Grande Rieti Rif Dimashq Rift Valley Riga Rigas Rajons Rimini Ringkobing Rio de Janeiro Rio Grande do Norte Rio Grande do Sul Rio Negro Rio Negro Rio San Juan Risaralda Rivas River Cess Rivera Rivers Riviera Riviere du Rempart Rivière-Pilote Rivière-Salée Rivne Rizal Rize Rocha Rodrigues Rogaland Roi Et Roma Romblon Rondônia Rooi Thomas Roraima Roscommon Roskilde Rosoman Rostov-na-Donu Rotuma Roura Rovigo Ruggell Ruhengeri Rukungiri Rukwa Rum Cay Rumphi Runavík Rutana Rutland Ruvuma Ruyigi Ryanggang-do (Yanggang-do) Ryazan Sa Kaeo Sa'dah Saaremaa (Kuessaare) Saarland Saatli Saba Sabah Sabaragamuwa Sabha Sabirabad Sacatepequez Sachsen Sachsen-Anhalt Sada Sadarak Safi Safi Saga Sagaing Sagarmatha Sahbuz Sai Kung New Territories Saida Saint Andrew Saint Andrew Saint Andrew Saint Andrew Parish Saint Andrew Parish Saint Ann Parish Saint Anne Sandy Point Saint Anthony Saint Catherine Parish Saint David Saint David Saint David Parish Saint Elizabeth Parish Saint George Saint George Saint George Saint George Saint George Basseterre Saint George City Saint George Gingerland Saint George Parish Saint George's Saint Georges Saint Helena Saint James Saint James Parish Saint James Windward Saint John Saint John Saint John Saint John Capesterre Saint John Figtree Saint John Parish Saint Joseph Saint Joseph Parish Saint Louis Saint Lucy Saint Luke Parish Saint Mark Saint Mark Parish Saint Mary Saint Mary Cayon Saint Mary Parish Saint Michael Saint Patrick Saint Patrick Saint Patrick Parish Saint Paul Saint Paul Capesterre Saint Paul Charlestown Saint Paul Parish Saint Peter Saint Peter Saint Peter Saint Peter Basseterre Saint Peter Parish Saint Philip Saint Philip Saint Pierre Saint Thomas Saint Thomas Lowland Saint Thomas Middle Island Saint Thomas Parish Saint-Élie Saint-Esprit Saint-Georges Saint-Joseph Saint-Laurent-Du-Maroni Saint-Louis Saint-Pierre Sainte-Anne Sainte-Luce Sainte-Marie Saitama Sakarya Sakassou Saki Saki Sakon Nakhon Sal Salah ad Din Salaj Salamanca Salamat Salavan Salcedo Saldus Rajons Salekhard Salerno Salima Salomon Islands Salt Cay Salta Salto Salyan Salzburg Samana Samangan Samar Samara Samarqand Samaxi Samdrup Jongkhar Samegrelo-Zemo Svaneti Samkir Samsun Samtse Samtskhe-Javakheti Samut Prakan Samut Sakhon Samut Songkhram Samux San Andres y Providencia San Blas San Cristobal San Fernando San Giljan San Gwann San Jose San Jose San Jose de Ocoa San Juan San Juan San Juan/Laventille San Lawrenz San Luis San Luis Potosi San Marcos San Martin San Miguel San Pawl il-Bahar San Pedro San Pedro de Macoris San Salvador San Salvador San Vicente San'a San-Pedro Sanaag Sanchez Ramirez Sancti Spiritus Sandaun Sandavágur Sandpits Area Sandur Sandy Sandys Sangha Sangha-Mbaere Sangre Grande Sanguie Sanliurfa Sanma Sanmatenga Sannat Sant Julià de Lòria Santa Ana Santa Barbara Santa Catarina Santa Catarina Santa Cruz Santa Cruz Santa Cruz Santa Cruz de Tenerife Santa Fe Santa Lucija Santa Rosa Santa Venera Santander Santarém Santiago Santiago de Cuba Santiago del Estero Santiago Rodriguez Santo Domingo Sao Domingos Sao Filipe Sao Nicolau São Paulo Sao Tome Sao Vicente Saône et Loire Sar-e Pol Sara Buri Saraj Sarajevo-Romanija or Sokolac Saramacca Sarande Sarangani Saransk Saratov Sarawak Sarpang Sarthe Sarur Saskatchewan Sassandra Sassari Satu-Mare Satun Satupa'itea Saül Savanes Savannakhet Savanne Savoie Savona Sawfajjin Schaan Schaffhausen Schellenberg Schleswig-Holstein Schwyz Schœlcher Scottish Borders Scrub Seal Segou Segovia Seguela Seine et Marne Seine Maritime Seine St-Denis Selangor Selenge Semaria Sembabule Semnan Seno Serbia Sergipe Serravalle Seti Setif Settat Setúbal Sevastopol Sevilla Sfax Sha Tin New Territories Shaanxi Shabeellaha Dhexe Shabeellaha Hoose Shabwah Shag Island Sham Shui Po Kowloon Shamal Bahr al Ghazal Shamal Darfur Shamal Kurdufan Shamal Sina' Shan State Shandong Shanghai Shanxi Sharon Sharq al Istiwa'iyah Shefa Shetland Islands Shida Kartli Shiga Shimane Shinyanga Shirak Shishelweni Shizuoka Shkoder Shropshire Shumen Shyghys Qazaqstan Siauliai Sibenik Sibiu Sichuan Sidi Sidi Bel Abbes Sidi Kacem Sidon Siemreap Siena Sigave Siggiewi Siguiri Siirt Sikasso Sikkim Siliana Silistra Sinaloa Sindh Sinfra Sing Buri Singida Sinnamary Sinnar Sinoe Sinop Sint Eustatius Sint Maarten Sint Nicolaas Sint Nicolas Sipaliwini Siparia Siquijor Siracusa Sirdaryo Sirnak Sironko Sisak-Moslavina Sisaket Sissili Sistan and Baluchistan Sivas Siyazan Sjûvar Kommuna Skálavík Skåne Skikda Skopun Skrapar Skúvoy Slaskie Slavonski Brod-Posavina Sliema Sligo Sliven Smith's Smolensk Smolyan Södermanland Sofala Sofia Sofia - town Sogn og Fjordane Sokoto Solola Solothurn Soltustik Qazaqstan Somali Sombrero Somerset Somme Somogy Sonderjylland Sondrio Songkhla Sonora Sonsonate Sool Sopište Sopron Soria Soriano Soroca Soroti Sorsogon Soubre Soufriere Souk Ahras Soul-t'ukpyolsi Soum Sourou Sousse South (Sud) South Abaco South Aegean South Andros South Australia South Ayrshire South Caicos South Carolina South Cotabato South Dakota South District South East South Eleuthera South Island South Khorasan South Lanarkshire South Yorkshire Southampton Southern Southern Southern Southern Southern Southern (Debub) Southern Highlands Southern Hong Kong Island Southern Leyte Southern Nations - Nationalities Southern Red Sea (Debub-Keih-Bah Southland Southwest (Sud-Ouest). Spanish Wells Split-Dalmatia Spot Bay Srednjebosanski Kanton St. Anthony Parish St. Gallen St. Lawrence Parish St. Lazarus Parish St. Petersburg Staffordshire Štajerska Stake Bay Stann Creek Star Dojran Stara Zagora Staro Nagoričane Stavropol StÃ¢nga Nistrului Steiermark Štip Stirling Stockholm Storstrom Středočeský Struga Strumica Studeničani Stung Treng Suceava Suchitepequez Sucre Sucre Sucumbíos Sud Sud Sud-Est Sud-Kivu Suffolk Sughd Suhaj Suhbaatar Sukhothai Sulawesi Selatan Sulawesi Tengah Sulawesi Tenggara Sulawesi Utara Sultan Kudarat Sulu Sumatera Barat Sumatera Selatan Sumatera Utara Sumba Sumqayit Sumy Sunda Kommuna Suourland Suournes Suphan Buri Surat Thani Surigao del Norte Surigao del Sur Surin Surrey Surt Surwarrow Surxondaryo Susa Susa Šuto Orizari Svalbard Svay Rieng Sveti Nikole Svínoy Swansea Swieqi Swietokrzyskie Syktyvkar Sylhet Syunik' Szabolcs-Szatmar-Bereg Szeged Szekesfehervar Szolnok Szombathely Sør-Trøndelag Sørvágur T'ai-nan T'ai-nan T'ai-pei city T'ai-pei county T'ai-tung T'ao-yuan Ta Xbiex Ta'izz Tabasco Tabiteuea Tabora Tabou Tabuaeran Tabuk Tachira Tacna Tacuarembo Tadjoura Taegu-gwangyoksi Taejon-gwangyoksi Tafea Tagant Tahoua Tai Po New Territories Taichung Taichung Tak Takamaka Takeo Takhar Takutea Talas Talsu Rajons Tamakautoga Tamana Tamanghasset Tamaulipas Tambacounda Tambov Tamil Nadu Tan-Tan Tanda Tandjile Tanga Tangier Tanintharyi Taounate Tapoa Taraba Tarabulus (Tripoli) Taranaki Taranto Tarapaca Tarawa Targovishte Tarhunah Tarija Tarlac Tarn Tarn et Garonne Taroudannt Tarrafal Tarragona Tartar Tartumaa (Tartu) Tartus Tarxien Tasmania Tata Tatabanya Tataouine Taurage Tavush Tawi-Tawi Taza Tbilisi Tearce Tebessa Tehran Tekirdag Tel Aviv (Gosh Dan) Telemark Teleorman Telimele Telsiai Temburong Temotu Tennessee Tepelene Teraina Teramo Terengganu Terni Ternopil' Territoire de Belfort Teruel Tete Tetouan Tetovo Texas Thaba-Tseka Thessaly Thies Thiladhunmathi Dhekunu Thiladhunmathi Uthuru Thimphu Three Brothers Thurgau Thüringen Thyolo Tianjin Tiaret Tiassale Ticino Tiebissou Tierra del Fuego Tighina Tigray Tillaberi Timis Tindouf Tingrela Tipaza Tipperary Tirane Tiris Zemmour Tirol Tissemsilt Tizi Ouzou Tiznit Tlaxcala Tlemcen Toamasina Tobago Tocantins Tochigi Togdheer Toi Tokat Tokushima Tokyo Toledo Toledo Toliara Tolima Tolna Tombali Region Tombouctou Tomsk Tongatapu Torba Torfaen Torino Tororo Toshkent City Toshkent Region Totonicapan Tottori Touba Tougue Toulepleu Toumodi Tov Tovuz Town Area Toyama Tozeur Trabzon Trang Trapani Trarza Trashigang Trashiyangste Trat Trebinje Treinta y Tres Trelawny Parish Trenciansky Trento Treviso Triesen Triesenberg Trieste Trinity Palmetto Point Tripoli Tripura Tristan da Cunha Trnavsky Troms Trongsa Tropoje Trujillo Tsingoni Tsirang Tsuen Wan New Territories Tuamasaga Tuapa Tubruq Tucuman Tuen Mun New Territories Tukuma Rajons Tula Tulcea Tumbes Tunapuna/Piarco Tunceli Tungurahua Tunis Tunu Tura Tûrshavnar Kommuna Tutong Tuy Tuzlanski Kanton Tver Tvøroyri Tyne and Wear Tyre Tyumen Uaboe Ubon Ratchathani Ucar Ucayali Udine Udon Thani Ufa Uige Ul'yanovsk Ulan-Ude Ulanbaatar Umm al Qaywayn Umm Sa'id Umm Salal Umutara Ungheni Unsko-Sanski Kanton Upper Demerara-Berbice Upper East Region Upper River Upper Takutu-Upper Essequibo Upper Town Upper West Region Uppsala Uri Usak Ust'-Ordynskiy Ústecký Usulutan Utah Utena Uthai Thani Utrecht Uttar Pradesh Uttaradit Uva Uvs Va'a-o-Fonoti Vacoas-Phoenix Vaduz Vágur Vaiea Vaisigano Vaitupu Vakaga Val d'Oise Val de Marne Valais Valandovo Valcea Vale of Glamorgan Valencia Valgamaa (Valga) Valkas Rajons Valladolid Valle Valle del Cauca Valletta Valmieras Rajons Valparaiso Valverde Van Var Varazdin Varese Vargas Värmland Varna Vas Vasilevo Vaslui Västerbotten Västernorrland Västmanland Västra Götaland Vaucluse Vaud Vaupes Vava'u Vavoua Vayots' Dzor Vejle Veles Veliko Tarnovo Vendée Venezia Ventspils Ventspils Rajons Veracruz-Llave Veraguas Verbania Vercelli Vermont Verona Vest-Agder Vestfiroir Vestfold Vestjælland Vestmanna Vesturland Veszprem Vev?ani Viana do Castelo Vianden Vibo Valentia Viborg Vicenza Vichada Victoria Victoria Vidin Vienne Vientiane Vientiane Vieux-Fort Vila Real Viljandimaa (Viljandi) Villa Clara Vilnius Vinica Vinnytsya Viqueque Virgin Islands Virginia Virovitica-Podravina Viseu Viterbo Vitsyebskaya (Vitsyebsk) Vizcaya Viðareiði Vlaams Brabant Vladikavkaz Vladimir Vladivostok Vlasenica Vlore Vojvodina Volgograd Vologda Volta Region Volyn' Vorarlberg Voronezh Vorumaa (Voru) Vosges Vrancea Vraneštica Vrap?ište Vratza Vukovar-Srijem Vyatka Vysočina Waikato Wairprarapa Wakayama Wake Island Wakiso Wallis Wan Chai Hong Kong Island Wangdue Phodrang Wanica Warab Wardak Warminsko-Mazurskie Warwick Warwickshire Washington Wasit Waterford Wayaca Wellington West (Ouest) West Azarbaijan West Bengal West Caicos West Coast West Dunbartonshire West End West Grand Bahama West Greece West Island West Lothian West Macedonia West Midlands West New Britain West Sussex West Virginia West Yorkshire West-Vlaanderen Western Western Western Western Western Western Western Western Australia Western Beqaa Western Cape Western Division Western Highlands Western Isles Western Loire Valley Western Region Westmeath Westmoreland Parish Wexford Wicklow Wielkopolskie Wien Wiltshire Wiltz Wisconsin Woleu-Ntem Wong Tai Sin Kowloon Woqooyi Galbeed Worcestershire Wrexham Wyoming Xacmaz Xagra Xaignabouli Xaisomboun Xankandi Xanlar Xekong Xewkija Xgajra Xiangkhoang Xinjiang Xizi Xocali Xocavand Xorazm Yafran Yagha Yakutsk Yala Yalova Yamagata Yamaguchi Yamanashi Yambol Yamoussoukro Yangon Yaracuy Yardimli Yaren Yaroslavl Yasothon Yatenga Yau Tsim Mong Kowloon Yazd Yekaterinburg Yerevan Yevlax Yobe Yomou Yonne Yoro Yoshkar-Ola Yozgat Ysyk-Kol Yucatan Yuen Long New Territories Yukon Territory Yumbe Yun-lin Yunnan Yvelines Zabbar Zabol Zacapa Zacatecas Zachodniopomorskie Zadar-Knin Zaghouan Zagreb Zahle Zaire Zajas Zakarpattya Zala Zalaegerszeg Zambales Zambezia Zamboanga del Norte Zamboanga del Sur Zamboanga Sibugay Zamfara Zamora Zamora Chinchipe Zangilan Zanjan Zanzibar Central/South Zanzibar North Zanzibar Urban/West Zapadnobosanska Zapadnohercegovacka Zupanija Zaporizhzhya Zaqatala Zaragoza Zardab Zebbug Zebbug Zeeland Zejtun Zelenikovo Želino Zenicko-Dobojski Kanton Zgharta Zhambyl Zhejiang Zhemgang Zhytomyr Ziguinchor Zilinsky Zinder Ziro Zlínský Zlitan Zomba Zondoma Zonguldak Zou Zoundweogo Zrnovci Zuenoula Zufar Zug Zuid Holland Zulia Zürich Zurrieq Østfold How did you hear about us? (Choose one)* I am an Existing Franchisee I am a SoR Parent Online Print Audio Referral Tradeshow/Live Event Where online? (Choose one)* SchoolofRock.com Franchise.org Online Ad Please choose one (Choose one)* College Magazine Franchising Magazine Guitar World Music Magazine Other Which audio platform? (Choose one)* SiriusXM Podcast Other How were you referred? (Choose one)* Referred by a Friend Parent of SOR Student Adult SOR Student School Owner Saw a School Employee Other What event? (Choose one)* NAMM IFE DC International Franchise Association I Attended a SOR Performance Progressive Motor Show I consent to being contacted by School of Rock and/or its franchisees with telemarketing calls/texts, irrespective of whether my number appears on federal or state “Do Not Call” lists. See our Privacy Policy . Submit SCHOOL OF ROCK CORE VALUES We are a growing, passionate community dedicated to enriching lives through performance-based music education. We develop music creativity and proficiency within a culture of belonging, collaboration and optimism, all the while maintaining the highest ideals of safety and integrity. Learn More SCHOOL OF ROCK OUTREACH Our commitment to enriching lives goes beyond the walls of our schools via partnerships with a variety of organizations around the world supporting music education, music artists and venues, and our neighborhoods. We're passionate about making a positive impact not only in the lives of our students but also in our communities. Learn More SCHOOL OF ROCK PARTNERSHIPS We have formed relationships with some of the top entertainment and music industry and gear brands in the world - leveraging each other's offerings to deliver a truly unique and rewarding experience to our students. Learn More School of Rock is a part of Youth Enrichment Brands (YEB), the nation’s leading youth activities platform, offering camps, leagues, classes, schools and other programs. YEB companies provide fun, enriching experiences to over 950,000 children each year around the world. Learn more Home Franchising Meet the School of Rock Team Franchising (877) 556-6184 International South Africa United Kingdom Brazil Japan Owning a franchise Starting a franchise Available opportunities Franchise Costs Next Steps Franchise FAQs Why School of Rock? About Leadership Team Careers for musicians + educators (877) 556-6184 Back to school of rock © 2025 School of Rock LLC.  All Rights Reserved. The U.S. Federal Trade Commission, certain states within the U.S.A., and certain other countries have laws governing the offer and sale of franchises. If you reside in a jurisdiction where one of these laws is in effect, we may have an obligation to register our franchise offering, to provide you with specified information, and/or to meet other conditions before offering you a franchise. We intend to fulfill the applicable requirements wherever we offer franchises. The information presented here is not intended as the offer of a franchise; if nevertheless deemed to constitute an offer, we do not intend it to be made in any jurisdiction where it would be improper. Within the U.S.A., we offer franchises solely by means of our Franchise Disclosure Document."
    },
    {
      "url": "https://adventurerocks.in/contact-us",
      "text": "Get in Touch: Adventure Rocks Contact Information India’s leading Adventure Activity Manufacturer. Login Admin Panel Support for Repair And Maintenance Home About Us Our Products Blog Contact Us Enquiry Now Contact Us Home Contact Us CONTACT INFORMATION Sagittis posuere id nam quis vestibulum vestibulum a facilisi at elit hendrerit scelerisque sodales nam dis orci. Office Location No B-100, KH NO-10/5/1, Laxmi Vihar, B-Block, Nangloi Road, Najafgarh Behind, D.K Depot MDI (DTC), New Delhi - 110043. Phone Number +91 88030 09900 +91 88030 40500 Email Address info@adventurerocks.in Fill the Contact Form! Fill the Contact Form! First Name Last Name Email Phone Company Location of Installation Select Indoor or Outdoor Indoor Outdoor Services you seek! Climbing Wall Climbing Holds Zorbing Ball Rope Course Zip Line Kids Climbing Wall Zip Cycling Inflatable Games/Motor Games Swimming Pool Trampoline 360° Cycle Table Game Please select a valid state. -- Select One -- About Adventure Rocks Adventure Rocks - Your Gateway to Adventure. We offer a diverse range of adventure gear and expert guidance to elevate your outdoor experiences. Contact us for inquiries and stay connected with the adventure world. Mobile Number: +91 8803009900 Mobile Number: +91 8803040500 Email: info@adventurerocks.in Location: No B-100, KH NO-10/5/1, Laxmi Vihar, B-Block, Nangloi Road, Najafgarh Behind, D.K Depot MDI (DTC), New Delhi - 110043. Important Links About Us Our Products Market Area Blog Contact Us Categories Climbing Wall Climbing Holds Rope Course Zip Line Zorbing Ball 360 Cycling Trampoline Security Details 100% Secure transaction Secure SSL encryption Follow Us © Copyright 2023 Adventure Rocks Pvt. Ltd . All rights reserved. Designed & Developed By Bhogolic Climbing Wall Climbing Wall Manufacturers Kids Climbing Wall Manufacturers Indoor Climbing Wall Outdoor Climbing Wall GYM Climbing Wall Climbing Wall Equipment Kids Room Climbing Wall Climbing Holds Climbing Holds Manufacturers Climbing stones Climbing Holds Suppliers Climbing Holds for kids Rope Course Rope course manufacturer Adventure park set ups Adventure park manufacturer Burma bridge manufacturer Adventure park repair & maintenance Low cost adventure park set up Zipline Zip line manufacturer Zip line installation Zipline Setups Zip line equipment Zip line set up Zip Cycling Zip cycling manufacturer Zip cycling installation zip cycling set ups zip cycling equipment zip cycling repair Zorbing ball Zorbing ball manufacturer Best zorbing ball Water zorbing ball manufacturer Best water zorbing ball zorbing wall repair & maintenance Water roller manufacturer Best water roller manufacturer water roller repair & maintenance Best body zorbing manufacturers body zorbing for kids body zorbing for adults body zorbing repair & maintenance Other Activites 360 cycles manufacture Gravity cycles manufacturer Human poos ball human poos ball manufacture Artificial swimming pool manufacturer Giant swing manufacturer giant swing setups Human Gyroscope manufacture Bull ride Commando net manufacture commando net spider net × Search"
    },
    {
      "url": "https://www.biography.com/actors/chris-rock",
      "text": "Chris Rock: Biography, Stand-Up Comedian, Actor Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Bad Bunny Charlie Sheen’s Addiction Kathy Bates Almost Quit Shohei Ohtani Everyday Heroes of 9/11 Famous Actors Comedians Chris Rock Chris Rock Widely considered one of the best stand-up comedians of all time, Chris Rock is known for his sometimes controversial comedy specials, his television show Everybody Hates Chris , and his movie roles. By Biography.com Editors and Colin McEvoy Updated: Mar 03, 2023 5:36 PM EST Getty Images We may earn commission from links on this page, but we only recommend products we back. Jump to: Who Is Chris Rock? Quick Facts Early Life Early Career 'Saturday Night Live' Stand-Up Specials and Breakthrough Movie Career Television Career Recent Work Oscar Hosting and Controversy \"The Slap\" Personal Life 1965– Who Is Chris Rock? Chris Rock is a comedian and actor who is widely considered one of the best stand-up comedians of all time . He is most noted for his raw humor and covers a wide range of sometimes controversial subjects in his stand-up, including race relations, family dynamics, relationships, celebrities, and wealth disparity. After appearing on Saturday Night Live , Rock achieved breakthrough success with his stand-up comedy specials and went on to star in and produce a large number of films and television series. He has won four Emmy Awards and three Grammys for his comedy specials and albums, created the popular sitcom Everybody Hates Chris , and has hosted the Academy Awards twice. Quick Facts FULL NAME: Christopher Julius Rock BORN: February 7, 1965 BIRTHPLACE: Andrews, South Carolina SPOUSE: Malaak Compton (1996–2016) CHILDREN: Lola and Zahara ASTROLOGICAL SIGN: Aquarius Early Life Chris Rock was born on February 7, 1965, in Andrews, South Carolina. Rock is the eldest of seven children born to Julius Rock, a truck driver, and Rose Rock, a teacher. When Chris was a toddler, his family relocated to Brooklyn, New York. He spent the remainder of his childhood in Brooklyn’s Bedford-Stuyvesant neighborhood. He was bused to a nearly all-white public school, where he was subjected to discrimination and bullying at an early age. Rock later wrote about this in his autobiography, Rock This : “My parents assumed I’d get a better education in a better neighborhood. What I actually got was a worse education in a worse neighborhood. And a whole bunch of a–-whippings.” These early bouts with racism greatly influenced his comedic material. Early Career Getty Images Chris Rock and Eddie Murphy attended the SNL 40th anniversary special in 2015. Murphy discovered Rock while he was performing stand-up comedy in 1984. After dropping out of high school, Rock began working various minimum wage restaurant jobs and started performing stand-up comedy in 1984, at the Catch a Rising Star comedy clubs in New York City. At age 18, Rock was discovered by one of his comedy idols, Eddie Murphy , who befriended Rock and took him under his wing. Murphy gave Rock his first film role: a small part as a parking valet in Beverly Hills Cop II (1987). Rock continued to perform stand-up comedy, while other film and television opportunities began coming his way. He appeared in Keenan Ivory Wayans’ I’m Gonna Get You Sucka (1988) and had a small role on the television series Miami Vice , before undertaking the more dramatic role of Pookie, a drug-addicted informant, in Mario Van Peebles’ New Jack City (1991). 'Saturday Night Live' Getty Images Chris Rock performs his monologue while hosting an episode of Saturday Night Live in 2014. He had previously been a cast member on the sketch comedy television series. In 1990, Rock followed in Murphy’s footsteps by joining the cast of Saturday Night Live , where he enjoyed some success with his creation of the Black power character Nat X. Rock was part of what became known as the “Bad Boys of SNL” along with fellow comedians Chris Farley , David Spade , Rob Schneider, and Adam Sandler , many of whom Rock would continue to collaborate with in the future. Rock got less screen time than his fellow Bad Boys and found himself occasionally frustrated with the show, especially when he was often asked to play parts that emphasized his race . These creative differences led to his departure from SNL in 1993 to appear on the competing sketch comedy series In Living Color , which was canceled one month after he joined the show. Stand-Up Specials and Breakthrough Rock continued performing stand-up during his time on Saturday Night Live . He released his first comedy album, Born Suspect, in 1991, followed by his first HBO comedy special, Big A** Jokes , in 1994. But it was his second HBO special, Bring the Pain (1996), that truly marked a turning point in Rock’s career. Bring the Pain touched on many subjects, including dating and marriage, the O.J. Simpson murder case, and race relations in America. A controversial bit when Rock extensively used the N word drew particular attention. Bring the Pain received critical acclaim, and for it, Rock won his first two Emmy Awards. Variety called it “ one of the truly remarkable hours of comedy ever to air on television,” and said it turned Rock “from a respected but largely unmarketed standup to the front burner of comedy’s future.” The special helped Rock develop a successful career in film and comedy, but he continued performing stand-up and releasing comedy albums during this time. Rock produced several more comedy specials for HBO and won Grammy Awards for his albums Roll With the New (1997), Bigger and Blacker (1999), and Never Scared (2004). Movie Career Getty Images Chris Rock appeared on Jimmy Kimmel Live! in 2010 with his Grown Ups co-stars Kevin James, Rob Schneider, David Spade, and Adam Sandler. Rock appeared in a handful of small film roles during the 1990s, including the Eddie Murphy comedy Boomerang (1992), the Steve Martin movie Sgt. Bilko (1996), and the Chris Farley film Beverly Hills Ninja (1997). But his breakthrough stand-up comedy specials led to bigger and more frequent movie roles, such as supporting roles on Lethal Weapon 4 (1998), Dogma (1999), and Nurse Betty (2000). By the 2000s, Rock began appearing in lead roles while also increasingly working as a writer and producer on films. His first starring role was in Down to Earth (2001), a remake of the 1978 Warren Beatty film Heaven Can Wait . Rock co-wrote Down to Earth along with fellow comedian Louis C.K. The two also co-wrote the 2001 comedy Pootie Tang . Rock has continued to make consistent film appearances over the decades, directing and starring in the political comedy Head of State (2003) with Bernie Mac , and making films with Adam Sandler like The Longest Yard (2005), Grown Ups (2010), and Grown Ups 2 (2013). He delivered voice-acting performances in the Madagascar films and Jerry Seinfeld ’s The Bee Movie (2007) and branched into the horror genre with a starring role in Spiral (2021), a spinoff from the Saw film series. Television Career In 1997, Rock began hosting his own late-night television series, The Chris Rock Show , featuring guest interviews such as Johnnie Cochran , Arsenio Hall , Conan O’Brien , George Carlin , and Jesse Jackson . Running for five seasons on HBO, the series won a Primetime Emmy Award for Outstanding Writing for a Variety or Music Program in 1999, as well as earned Rock a CableACE Award for Best Entertainment Host. In 2005, Rock debuted a sitcom called Everybody Hates Chris , the title of which spoofed the perennially popular Everybody Loves Raymond . Set in the mid-1980s, Everybody Hates Chris was inspired by Rock’s teenage years growing up in the Bedford-Stuyvesant neighborhood of New York City. Everybody Hates Chris quickly became the second most-watched comedy on UPN and drew critical acclaim. The American Film Institute named it one of the best 10 television shows of 2007 , saying it “provides a very real look at growing up in America—a challenge that demands a discussion of race and class often absent from television today.” Recent Work Rock has appeared in several of Adam Sandler’s films for the Netflix streaming service, including Sandy Wexler (2017) and The Week Of (2018). He also reunited with Eddie Murphy during an appearance in the movie Dolemite Is My Name (2019). Rock made his Broadway theater debut in 2011 in the Stephen Adly Guirgis play The Mother—er with the Hat , which earned him a nomination for the Drama League Award for Most Distinguished Performance. Rock had a starring role in the fourth season of the acclaimed FX anthology television series Fargo . Set in the 1950s, Rock portrayed Loy Cannon, the lead of a criminal syndicate called The Cannon Limited, which was described as “a different sort of refugee community fleeing the Deep South and Jim Crow as part of the Great Migration.” Rock has also continued performing stand-up comedy, releasing his sixth comedy special, Tamborine , on Netflix in 2018. On March 4, 2023, Rock released the live comedy special Chris Rock: Selective Outrage on Netflix, marking the streaming service’s first live event. Oscar Hosting and Controversy Getty Images Chris Rock hosted the 88th Academy Awards ceremony in 2016. It was his second time hosting the awards show. Rock hosted the 77th Academy Awards ceremony in 2005, a performance that drew mixed reviews. Some took offense at his jokes mocking actors like Jude Law , as well as his remarks mocking award shows in general. Before the Oscars ceremony, Rock said : “What straight Black man sits there and watches the Oscars? Show me one. And they don’t recognize comedy, and you don’t see a lot of Black people nominated, so why should I watch it?” Nevertheless, Rock was invited back to host the 88th Academy Awards ceremony in 2016, a year in which the Oscars were widely criticized with the hashtag #OscarsSoWhite due to the lack of racial diversity among the nominees. Rock received positive reviews for his hosting performance, during which he directly addressed the controversy and Hollywood’s hiring practices. “Is Hollywood racist? You’re damn right Hollywood is racist. But it ain’t that racist that you’ve grown accustomed to,” Rock said during the monologue . “Hollywood is sorority racist. It’s like, ‘We like you Rhonda, but you’re not a Kappa.’ That’s how Hollywood is. But things are changing. Things are changing.” \"The Slap\" Getty Images Will Smith slapped Chris Rock during the 94th Academy Awards on March 27, 2022, in what has been described as one of the most infamous moments in television history. In 2022, Rock was involved with what has been described as one of the most infamous moments in pop culture history when he was slapped by actor Will Smith during the 94th Academy Awards ceremony. Rock was presenting the award for Best Documentary Feature when he saw Smith and his wife, Jada Pinkett Smith , in the audience and ad-libbed a joke about Jada starring in a sequel G.I. Jane , due to her shaved head. Jada, who shaves her head due to alopecia areata, was visibly annoyed by the joke. Despite initially laughing at the joke himself, Smith walked onto the stage, slapped Rock across the face, then sat back down and yelled at Rock from his seat. Rock appeared stunned, jokingly calling it the “greatest night in the history of television,” before continuing his presentation. The moment, which became known as “The Slap” and “Slapgate,” largely overshadowed the rest of the ceremony, during which Smith later won Best Actor for his role in King Richard . Smith later resigned from the Academy, which condemned his actions and banned him from future ceremonies for 10 years. Smith and Rock were both praised and defended from varying parties, with some criticizing Rock for mocking Jada Pinkett Smith’s medical condition. Personal Life Rock married Malaak Compton on November 23, 1996. The pair welcomed daughter Lola Simone in 2002 and daughter Zahra Savannah in 2004. In 2014, Rock filed for divorce from Compton, admitting to infidelity and porn addiction. Their divorce was finalized on August 22, 2016. Citation Information Article Title:                                 Chris Rock Biography Author:                             Biography.com Editors Website Name:                                 The Biography.com website Url:                             https://www.biography.com/actors/chris-rock Access Date: Publisher:                             A&E; Television Networks Last Updated:                                 March 4, 2023 Original Published Date:                                 April                             2,                                 2014 Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! .. Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Colin McEvoy Senior News Editor, Biography.com Colin McEvoy joined the Biography.com staff in 2023, and before that had spent 16 years as a journalist, writer, and communications professional. He is the author of two true crime books: Love Me or Else and Fatal Jealousy . He is also an avid film buff, reader, and lover of great stories. Watch Next Advertisement - Continue Reading Below Comedians Seth Rogen Adam Scott Steve Martin’s Life and Career in Photos Nate Bargatze Advertisement - Continue Reading Below Malcolm Jamal-Warner’s Legacy as a Director Stephen Colbert Shane Gillis Inside The Moment That Saved Paul Reubens’ Career The 18 Richest Actors in the World Conan O’Brien 10 Comedians Who Never Made the ‘SNL’ Cast Joe Rogan Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://www.therocks.com/contact-us",
      "text": "Contact us | The Rocks Due to weather, Comedy Showdown is postponed until Wednesday 24 September. Find out more Skip Links Skip to Content Skip to Navigation Skip to Search Page Skip to Sitemap Page Skip to Footer The Rocks What's On Eat & Drink See, do & stay Shopping Markets Our story Local's Guide Venue hire Getting here The Rocks What's On Eat & Drink See, do & stay Shopping Markets What's On Eat & Drink See, do & stay Shopping Markets Our story Local's Guide Venue hire Getting here Contact us Get in touch with The Rocks team. GENERAL ENQUIRIES T (02) 9240 8500 E contactustherocks@property.nsw.gov.au Office Hours 8.30am - 5pm Mon - Fri Street Address Place Management NSW Level 2, 66 Harrington Street The Rocks Postal Address PO Box N408 Grosvenor Place NSW 1220 THE ROCKS MARKETS ENQUIRIES T 0412 271 725 E pag.therocksmarket@property.nsw.gov.au MEDIA ENQUIRIES The Media Unit is the primary point of contact for news organisations. Contact us for interviews, speakers and special requests. E media@dpie.nsw.gov.au Subscribe for events, guides & offers Subscribe No Thanks Search We acknowledge Gadi Country, her lands, sea and sky, we acknowledge her custodians, the people of the Grass tree, their kin the Wangal, Bidjigal, Cabrogal and Cammeraygal who often visited this Country to connect and share. We offer our respect to their Elders both past and present. Stay up to date Venue Hire and Commercial Opportunities Reconciliation Action Plan Strategy School excursions Leasing Contact Us Developments Copyright Disclaimer Privacy Sitemap Instagram Facebook Youtube We acknowledge Gadi Country, her lands, sea and sky, we acknowledge her custodians, the people of the Grass tree, their kin the Wangal, Bidjigal, Cabrogal and Cammeraygal who often visited this Country to connect and share. We offer our respect to their Elders both past and present. Continue to site"
    }
  ]
}