{
  "fuentes": [
    {
      "url": "https://zff.com/en/about-us/who-we-are",
      "email": "info@zff.com"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "20membership@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "accessibility@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "accommodations@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "aswerdfager@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "charitytickets@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "cschindler@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "events@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "groups@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "guestservices@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "membership@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "orders@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "resumes@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "sbutler@stratfordfestival.ca"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "email": "store@stratfordfestival.ca"
    },
    {
      "url": "https://downloadfestival.co.uk/info-category/contact-us/",
      "email": "ukprteam@livenation.co.uk"
    },
    {
      "url": "https://downloadfestival.co.uk/info-category/contact-us/",
      "email": "accessibility@downloadfestival.co.uk"
    },
    {
      "url": "https://downloadfestival.co.uk/info-category/contact-us/",
      "email": "info@downloadfestival.co.uk"
    },
    {
      "url": "https://www.discoverycube.org/contactus/",
      "email": "nly@discoverycube.org"
    },
    {
      "url": "https://www.discoverycube.org/contactus/",
      "email": "nnly@discoverycube.org"
    },
    {
      "url": "https://www.forbes.com/sites/ogdenpayne/2018/05/09/inside-the-business-of-rolling-loud-music-festival-and-cofounder-matt-zingler/",
      "email": "corrections@forbes.com"
    },
    {
      "url": "https://www.forbes.com/sites/ogdenpayne/2018/05/09/inside-the-business-of-rolling-loud-music-festival-and-cofounder-matt-zingler/",
      "email": "feedback@forbes.com"
    },
    {
      "url": "https://www.festivalpro.com/festival-management/2050/news/2022/8/24/Managing-Music-Festival-Artists-Load-in-and-Load-out.html",
      "email": "info@festivalpro.com"
    },
    {
      "url": "https://www.managementcenter.org/staff-board/",
      "email": "info@managementcenter.org"
    },
    {
      "url": "https://www.montpelierfallfestival.com/about-us",
      "email": "festival@mrpspie.org"
    },
    {
      "url": "https://www.dubaifestivalcity.com/contactus/",
      "email": "residential@alfuttaim.ae"
    },
    {
      "url": "https://www.dubaifestivalcity.com/contactus/",
      "email": "residential@dubaifestivalcity.com"
    },
    {
      "url": "https://gts.us.com/About-Global-Technical-Systems_Who-We-Are",
      "email": "info@gts.us.com"
    },
    {
      "url": "https://www.iidasfc.org/",
      "email": "ccaiazzo@phillipjeffries.com"
    },
    {
      "url": "https://www.iidasfc.org/",
      "email": "info@iidasfc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "alee@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "alondono@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "amalik@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "cfraim@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "cnix@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "cteufert@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "dmayhew@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "dstegall@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "fdyson@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "jbrown@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "jgarcia@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "kbaasansukh@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "kthompson@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "liversen@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "mbrown@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "mlembke@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "mmoreno-alcala@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "mtinong@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "npringle@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "poberman@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "pweissman@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "rcarver@ncbfdc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "email": "reiko@happi-events.com"
    }
  ],
  "mails": [
    "20membership@stratfordfestival.ca",
    "accessibility@downloadfestival.co.uk",
    "accessibility@stratfordfestival.ca",
    "accommodations@stratfordfestival.ca",
    "alee@ncbfdc.org",
    "alondono@ncbfdc.org",
    "amalik@ncbfdc.org",
    "aswerdfager@stratfordfestival.ca",
    "ccaiazzo@phillipjeffries.com",
    "cfraim@ncbfdc.org",
    "charitytickets@stratfordfestival.ca",
    "cnix@ncbfdc.org",
    "corrections@forbes.com",
    "cschindler@stratfordfestival.ca",
    "cteufert@ncbfdc.org",
    "dmayhew@ncbfdc.org",
    "dstegall@ncbfdc.org",
    "events@stratfordfestival.ca",
    "fdyson@ncbfdc.org",
    "feedback@forbes.com",
    "festival@mrpspie.org",
    "groups@stratfordfestival.ca",
    "guestservices@stratfordfestival.ca",
    "info@downloadfestival.co.uk",
    "info@festivalpro.com",
    "info@gts.us.com",
    "info@iidasfc.org",
    "info@managementcenter.org",
    "info@zff.com",
    "jbrown@ncbfdc.org",
    "jgarcia@ncbfdc.org",
    "kbaasansukh@ncbfdc.org",
    "kthompson@ncbfdc.org",
    "liversen@ncbfdc.org",
    "mbrown@ncbfdc.org",
    "membership@stratfordfestival.ca",
    "mlembke@ncbfdc.org",
    "mmoreno-alcala@ncbfdc.org",
    "mtinong@ncbfdc.org",
    "nly@discoverycube.org",
    "nnly@discoverycube.org",
    "npringle@ncbfdc.org",
    "orders@stratfordfestival.ca",
    "poberman@ncbfdc.org",
    "pweissman@ncbfdc.org",
    "rcarver@ncbfdc.org",
    "reiko@happi-events.com",
    "residential@alfuttaim.ae",
    "residential@dubaifestivalcity.com",
    "resumes@stratfordfestival.ca",
    "sbutler@stratfordfestival.ca",
    "store@stratfordfestival.ca",
    "ukprteam@livenation.co.uk"
  ],
  "nombre_sitio": "idamiami.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://zff.com/en/about-us/who-we-are",
      "text": "About Us: Discover more about the Zurich Film Festival Passes & Vouchers Accreditations Who we are Who we are Great Cinema Once a year, the ZFF brings Hollywood to Zurich. Then, the curtain rises on around 100 curated films, inspiring discoveries as well as World and European premieres. For eleven days, audiences have the unique opportunity to experience today's and tomorrow's big cinema stars up close and personal. A special highlight: with the ZFF taking place in autumn, you can see the films that will win Oscars six months later. Home of Talent The ZFF is committed to promoting young filmmakers and offers up-and-coming filmmakers the opportunity to network with established stars of the international film industry. Our goal: to bring top-class cinema experiences even closer to the audience, to inspire even more people - and to become the home of talent for the stars of tomorrow's stars. The History of ZFF The Zurich Film Festival was held for the first time in October 2005. Until 2019, the founders Karl Spoerri and Nadja Schildknecht acted as co-directors. Today, the Zurich Film Festival is headed by Festival Director Christian Jungen and Deputy Director Reta Guetg. Spoundation Picture AG's management team includes Managing Director Alessandro Monsurrò and Operations Director Marco Misuraca. The relatively young festival is now the second largest in the German-speaking world and was named one of the ten coolest film festivals in Europe by «The Guardian». 21st ZFF: September 25 – October 5, 2025 22nd ZFF: September 24 – October 4, 2026 23rd ZFF: September 23 – October 3, 2027 Festival entdecken ZFF in a nutshell Jobs Team Sustainability News Don't miss anything Newsletter Sign up now for the ZFF Newsletter and receive exciting insights and news directly to your inbox. Relevant ZFF-News Upfront information Exclusive competitions Subscribe now Kontakt Fragen, Feedback oder Anregungen? Dann nehmen Sie mit uns Kontakt auf. [email protected] +41 44 286 60 00 (9-12 Uhr & 14-17 Uhr) Quick Links Film Program ZFF in a Nutshell Passes and Vouchers ZFF Shop Sprache Deutsch English Newsletter Subscribe now Rechtliches Impressum Data Protection AGB Cookie Policy Website & Ticketing by Sally & Friends"
    },
    {
      "url": "https://www.stratfordfestival.ca/AboutUs/ContactUs",
      "text": "Contact Us | Stratford Festival Official Website | Stratford Festival Skip to main content LOGIN | SIGN UP | FOR MEMBERS | STORE | CART | GIFT CERTIFICATES Toggle navigation WHAT’S ON WHAT’S ON CALENDAR TICKETS THE MEIGHEN FORUM WAYS TO SAVE Visitors Guide Member Events Tours & Exhibits Stratford Direct Bus PLAYS & EVENTS Calendar Tickets The Meighen Forum Ways to Save Member Events Tours & Exhibits Stratford Direct Bus PLAYBILL » As You Like It » Annie » Sense and Sensibility » Dangerous Liaisons » Macbeth » Dirty Rotten Scoundrels » Anne of Green Gables » The Winter's Tale » Forgiveness » Ransacking Troy » The Art of War STRATFEST@HOME STRATFEST@HOME VISIT VISIT WHERE TO STAY Visit Hub WHERE TO STAY Accommodation List TRIP PLANNING Getting Here Theatre Maps & Guides U.S. Visitors Travel Packages Itineraries AT THE FESTIVAL On-Site Amenities Accessibility StratFest OnSite Visit FAQs MORE THINGS TO DO Dining Shopping & Leisure LEARN LEARN Learn Hub PROGRAMS & EVENTS Plan Your Trip Chats, Workshops & InterACTive Preshows Youth Programs Teacher Programs Post-Secondary Programs Education Week RESOURCES Study Guides PerformancePlus StratFest+ COLLABORATIONS Partnerships Associations SUPPORT US SUPPORT US BECOME A MEMBER OR RENEW Support Us Hub BECOME A MEMBER OR RENEW MEMBERSHIP General Membership Playwrights' Circle Membership For Members Our Donors Renew Membership GIVING Make A Gift Leadership Giving Tom Patterson Theatre Project Endowment Legacy Giving US Member Groups Stratford Festival Gala CORPORATE SUPPORT Corporate Partnerships Corporate Packages Corporate Supporters ABOUT US ABOUT US About Us Hub OUR WORK Land Acknowledgement Equity, Diversity and Inclusion About The Season New Play Development The Lab The Langham Directors’ Workshop The Birmingham Conservatory THE COMPANY Cast and Creatives The Board Senior Management and Staff OUR HISTORY Timeline Past Artistic Directors Archives Past Productions JOIN US Careers Auditions Volunteer Opportunities RENTALS Venue Costumes and Props LOGIN SIGN UP FOR MEMBERS STORE CART GIFT CERTIFICATES BUY TICKETS BECOME A MEMBER CONTACT US Move to the previous carousel slide Move to the next carousel slide × Close NEED HELP? HELP TICKETING FAQS Purchasing and ordering tickets HELP HELP MEMBERSHIP FAQS Membership and donations HELP HELP VISIT FAQS About Stratford, events and venues HELP SEND US A MESSAGE OR CALL US Have a specific question, issue or suggestion? We'd love to hear from you All fields are required unless marked optional. Send a message Your Full Name Your Email Address Subject Choose an Inquiry Type Ticket Information and General Inquiries Gift Certificate Inquiries Donor and Member Information Archives and Archival Photos Media Resumes Theatre Store Website Comments and Questions Your Message Visit our Box Office 55 Queen Street Stratford, ON N5A 4M9 Mailing Address PO Box 520 Stratford, ON N5A 6V2 (For couriers, please use Box Office address) Toll Free 1.800.567.1600 Local (in Stratford) 519.273.1600 Box Office Hours Telephone Sales: Monday–Saturday, 9 a.m.–5 p.m. Sunday, 9 a.m.–12 p.m. On-site Box Office – Festival Theatre: Tuesday–Saturday, 9 a.m.–5 p.m.* Sunday, 9 a.m.–2 p.m. Monday, Closed * Stays open until 8 p.m. when there is an evening performance On-site Box Office – Avon, Tom Patterson, and Studio Theatres: Open 2 hours before main stage performances and 1 hour before Meighen Forum Events DEPARTMENT CONTACTS Accessibility: Contact our accessibility team via email. Archives and Archival Photos: Contact our Archives team via email . Catering & Events: Contact our events team via email . Company Accommodations: For property rental inquiries, contact us via email . Donor and Member Information: Contact our membership team via email . For Playwrights' Circle Members contact Sharon Butler . You can also reach the team via phone at 519.271.4040. Groups and Schools: Contact our Groups and Schools Department via email or reach them directly at 1.800.567.1600 Media: Contact Ann Swerdfager via email . Patron Services: For production inquiries, contact us via email . Resumes: To submit resumes, send us an email . Theatre Store: Contact the store via email . CHARITY TICKETS Each year we receive many requests from organizations wanting ticket donations as fundraising items for auctions and raffles. We’re happy to help. Please follow these guidelines when submitting your request: Who can apply: We have a limited number of tickets available each year, so we give priority to - Arts organizations Registered charitable organizations in Southwestern Ontario What you can request: You may request two tickets each season to a performance* of our choice. Sorry, we do not donate cash or merchandise. OR: You may request a complimentary subscription to StratFest@Home for a pre-determined timeframe. Please submit a written request on your organization’s letterhead, and include: Your organization’s mission Your charitable registration number Description of the event, including the date, expected attendance and how the Stratford Festival will be featured at your event Full contact information including name, full mailing address and telephone number, and e-mail address Please send your requests by email to our Charitable Tickets Coordinator. *We do not offer charity tickets to our musical performances. QUICK LINKS What’s On Stratfest@Home Visit Learn Support Us About Us CONTACT & HELP Toll-free: 1 800 567 1600 Contact Us Ticketing FAQs Stratfest@Home FAQ On Demand FAQs Membership FAQs Visit FAQs MORE LINKS Accessibility Equity, Diversity and Inclusion Media SceneNotes Terms & Conditions Privacy Policy Gift Certificates SUBSCRIBE TO RECEIVE OFFERS, NEWS AND UPDATES FROM US Enter your email address Submit your email address © Copyright 2025. Stratford Festival 55 Queen Street, N5A 6V2, Stratford, ON The Stratford Festival is a registered charity in Canada (119200103 RR0002) and a 501 (c)(3) registered charity in the United States (BN#38-2420887). Go to top of page"
    },
    {
      "url": "https://downloadfestival.co.uk/info-category/contact-us/",
      "text": "Download Festival | Information - Contact Us - Download Festival Skip to main content Download Festival - Home Open main navigation menu Close mobile navigation menu The UK's Premier Rock Festival Wed 10 — Sun 14 June, 2026 Tickets Info & FAQs Download Family Your DLXXII Humans Of Download Accessibility The Download Experience Merch (opens in new window) Find us on facebook (opens in new window) Follow us on TikTok (opens in new window) Watch on Youtube (opens in new window) Follow us on instagram (opens in new window) Follow us on X(twitter) (opens in new window) Join us on WhatsApp (opens in new window) Join the mailing list Contact Us Back to: Information Info navigation Toggle all open Contact our accessibility team Please contact accessibility@downloadfestival.co.uk Copy link to clipboard Contact our customer service team Got a question? Get in touch with our Customer Services Team by emailing info@downloadfestival.co.uk . Copy link to clipboard Contact our PR team Our PR Team can be contacted by emailing UKPRTEAM@LiveNation.co.uk . Copy link to clipboard Lost property Lost something at Download Festival? Please fill out this form to record any lost property Copy link to clipboard Performing at Download Festival Email us at info@downloadfestival.co.uk . Please include your contact details, Spotify link and links to any other relevant social media profiles. We look forward to hearing from you! Copy link to clipboard Applications for food traders Thank you for your interest in trading at Download Festival 2026. Applications are not open yet – please check back soon for updates. Copy link to clipboard Applications for volunteers There are lots of opportunities to get involved as a volunteer at Download! We’ll share more information including how to apply in early 2026. Copy link to clipboard Search all our info or browse by category Search all information The Essentials Ticket Info FAQs Where to Stay Accessibility Things You Can / Can’t Bring Travel Info Families & Mini Moshers Health, help and wellbeing at Download Sustainability at Download Download Family Follow us on socials Find us on facebook (opens in new window) Follow us on TikTok (opens in new window) Watch on Youtube (opens in new window) Follow us on instagram (opens in new window) Follow us on X(twitter) (opens in new window) Join us on WhatsApp (opens in new window) Join the mailing list Partners Media Partners Tickets News History Privacy Cookies Terms + Conditions Contact Us Accessibility Statement (opens in new window) Download Festival is a mammoth rock event, based at the spiritual home of rock Donington Park. The UK's Premier Rock Festival Wed 10 — Sun 14 June, 2026 Donington Park Subject to licence, bill subject to change — © Download 2025 Website Compatibility It looks like Javscript is currently disabled. Please enable it to use all the features of this site"
    },
    {
      "url": "https://www.discoverycube.org/contactus/",
      "text": "Contact Us - Discovery Cube Skip to main content Choose a campus: Click to select Orange County Los Angeles Educator login Visit Pumpkin Palooza Member presale from September 12 - September 21! Locations & info Orange County Los Angeles FAQ Contact Us Ways to visit Buy Tickets Memberships Promotions Fun for the kids Field Trips Birthday Parties Summer Camp Sleepovers Science Activities Dining Bean Sprouts Cafe Cube Café Exhibits Scooby-Doo™! Mansion Mayhem Opens September 20 in Los Angeles! Orange County - featured exhibits Dino Quest Artemis Adventures Discovery Cube Sea Lab Bed of Nails The Raceway Helicopter Tours Organic Waste Lab You Be The Goalie Rainforest Adventure Explore all OC exhibits Los Angeles - featured exhibits Scooby-Doo!™ Mansion Mayhem Eco-Adventure Carousel Cube Studios Climbing Wall Coaches Corner Suit Yourself Lift Yourself Race to Zero Waste Explore all LA exhibits Events Be Like Blippi Pop Up! Happening August 29 - September 28 in LA! Orange County - featured events Pumpkin Palooza Pumpkin Palooza Member Preview OC Members Only Mornings OC Sensory Friendly Mornings OC Events Calendar Los Angeles - featured events Be Like Blippi Scooby-Doo™! Mansion Mayhem Member Preview Enchanted Halloweekends Enchanted Halloweekends Member Event Night Out at the Cube LA Members Only Mornings LA Sensory Friendly Mornings LA Events Calendar For Educators Scholarships Apply Now! Visit the Cube OC Field Trips LA Field Trips Know Before You Go Learn More Cube Comes to You Science To Go After School Free Eco Adventures Greener Pathways OC Water Wise Explorers OC Greener Pathways LA Water Wise Explorers LA Join & Give Donate to Educate Inspire the Next Generation Join Become a Member Volunteer Support The Cube Adopt a Train Give to the Cube Corporate Donations Become a Multiplier Partners and Support Community Outreach Resources Our Organizational Donors Our Individual Donors LA Fires Resources Our Story Who We Are Our Mission Who We Are Who We Are Leadership Team Orange County Board of Directors Los Angeles Board of Directors Discovery Cube Happenings Accreditations & Affiliations Accreditations & Affiliations Buy Tickets Membership Donate Contact Us Home / Contact Us Contact Information By Department General Information Answer: Discovery Cube Orange County 714-542-2823 Discovery Cube Los Angeles 818-686-2823 Member Relations Answer: Click here to visit the member’s page for an FAQ and contact form. Marketing & Media Inquiries Answer: Discovery Cube Orange County and Los Angeles Director of Marketing, Nam Ly nly@discoverycube.org Media Inquiries For Media Inquiries, click here . Community Outreach LA Answer: Interested in partnering with us? Check out this resource page to help you get started. Group Bookings ( Field Trips , Sleepovers, Etc..) Answer: To Book a field trip online click here To Book a Sleepover online click here Discovery Cube Orange County 714-913-5030 Discovery Cube Los Angeles 714-913-5030 Birthday Party Reservations Answer: To reserve your Birthday Party click here Discovery Cube Orange County 714-263-3864 Discovery Cube Los Angeles 818-686-2864 Volunteers Answer: Discovery Cube Orange County 714-913-5028 Discovery Cube Los Angeles 818-686-2808 Discounts Answer: Questions about Bank of America, Santa Ana Waste Day or other discounts? All our discounts are listed on our Discounts page . If you have questions, contact our call center at 714-542-2823 / 818-686-2823. For all other questions, use the form below, and we will route your question to the relevant department. An asterisk (*) indicates required information. Submit Your Inquiry Below \" * \" indicates required fields First Name * Last Name * Email * Phone * Purpose * Purpose Ticket Date/Time Change General Information ( Tickets , Events, etc..) Membership Group Reservations (Field Trips, After School,etc.) Lost & Found Marketing / Public Relations Campus * Campus Discovery Cube OC Discovery Cube LA Current Ticket Date MM slash DD slash YYYY Requested Ticket Date MM slash DD slash YYYY New Showtime Request * Payment Authorization I authorize Discovery Cube to charge payment on file for any price changes. Questions/Comments Order Number (Type N/A if not applicable) * This field is hidden when viewing the form Origin Web This field is hidden when viewing the form RecordType CAPTCHA URL This field is for validation purposes and should be left unchanged. Our Mission is to INSPIRE and EDUCATE young minds through engaging science-based programs and exhibits therefore creating a meaningful IMPACT on the communities we serve. Explore more: Educator Profile Who We Are Volunteer Career Opportunities Donate Terms & Conditions Privacy Policy Locations & hours: Orange County 2500 N Main Street Santa Ana, CA 92705 Every day from 10:00 am - 5:00 pm Closed Saturday, September 27th Los Angeles 11800 Foothill Blvd Sylmar, CA 91342 Every day from 10:00 am - 5:00 pm We are closed on select dates, click here to see a list of dates we are closed. Follow us: Keep up with the freshest news: Subscribe to our newsletter and become part of our community! Footer Newsletter Email address Campus Select campus Orange County Los Angeles Thank you. Your information has been received. © 2025 All Rights Reserved."
    },
    {
      "url": "https://www.forbes.com/sites/ogdenpayne/2018/05/09/inside-the-business-of-rolling-loud-music-festival-and-cofounder-matt-zingler/",
      "text": "Inside The Business Of Rolling Loud Music Festival And Cofounder Matt Zingler Newsletters Games Share a News Tip Featured Featured America's Top Next-Gen Wealth Advisors | Paid Program Student Visionaries: Celebrating Teen Leaders Raising Money To End Blood Cancers | Paid Program Best-In-State Top Next-Gen Wealth Advisors 2025 Breaking News White House Watch Daily Cover Stories AI’s Nuanced Impact And A Quest To Quantify It DNA of Success Embracing And Bracing For AI Facing A Volatile Market, C-Suites Look To The CFO For Strategic Guidance Your Four-Part Blueprint To Unlock AI Value In 2025 | Paid Program By The Numbers: Meet The Forbes 30 Under 30 Europe Class Of 2025 Dell Technologies BrandVoice | Paid Program Scaling AI Get Your Data AI-Ready | Paid Program QUIZ: Are You Making The Most Of Your Retirement Plan? | Paid Program Shaping The Future-Ready Mobility: In Conversation With JLR And TCS | Paid Program The Pacesetter Playbook: An Executive’s Guide To  Advancing Enterprise AI | Paid Program Next Billion-Dollar Startups 2025 CXO Spotlight: The Executive's Guide to AI Video Series Billionaires Billionaires See All World's Billionaires Forbes 400 America's Richest Self-Made Women China's Richest India's Richest Indonesia's Richest Korea's Richest Thailand's Richest Japan's Richest Australia's Richest Taiwan's Richest Singapore's Richest Philippines' Richest Hong Kong's Richest Malaysia's Richest Money & Politics Innovation Innovation See All Workflow Collaboration Enterprise AI AI Agentic AI Big Data Cloud Cloud 100 Consumer Tech Creator Economy Cybersecurity Digital Transformation Enterprise Tech Future Of Work Gaming Healthcare Innovation Rules Retail Industry SAP BrandVoice | Paid Program Science Social Media Sustainability & Climate Transportation Venture Capital Technology TikTok BrandVoice | Paid Program Metronome BrandVoice | Paid Program Leadership Leadership See All Under 30 C-Suite CEO Network CFO Network CHRO Network CIO Network CMO Network Leadership Strategies Careers Education Featured Partners Deloitte BrandVoice SAP BrandVoice Stand Together BrandVoice First Tee BrandVoice Dell Technologies BrandVoice Forbes EQ | Paid Program ForbesBLK Forbes Research ForbesWomen Money Money See All Banking & Insurance ETFs & Mutual Funds Fintech Hedge Funds & Private Equity Investing Investor Hub Markets Personal Finance Retirement Taxes Top Advisor | SHOOK Wealth Management Forbes Digital Assets Forbes Digital Assets See All News Crypto Prices NFT Prices Research Learn Crypto Basics BTC DeFi Web3 Education NFTs Crypto Investments Events Crypto Portfolios Business Business See All Aerospace & Defense Energy Food & Drink Hollywood & Entertainment Law Manufacturing Media Policy Retail SportsMoney Entertainment Digest Small Business Small Business See All Entrepreneurs Franchises Small Business Strategy Lifestyle Lifestyle See All Arts Boats & Planes Cars & Bikes Dining ForbesLife Forbes Travel Guide Spirits Style & Beauty Travel Vices Watches Real Estate Real Estate See All Commercial Real Estate Forbes Global Properties Residential Real Estate Forbes Vetted Forbes Vetted See All Mattress & Sleep Bed Frames Mattresses Mattress Toppers Pillows Sheets & Bedding Sleep Products Home Bathroom Cleaning & Laundry Decor Furniture Heating & Cooling Hobbies Home Office Kitchen & Dining Outdoor Pets Storage & Organization Tools Wine & Bar Fashion Accessories Clothing Eyewear Footwear Jewelry Handbags & Purses Lingerie & Sleepwear Outdoor & Fitness Apparel Outerwear Watches Kids & Baby Gear Baby Gear Kids Clothes & Accessories Nursery Pregnancy & Postpartum Toys & Books Gear Apparel & Accessories Bikes Camping & Hiking Climbing Fishing & Hunting Fitness Golf Running Tennis & Racket Sports Tools & Tech Training & Recovery Water Sports Wellness Winter Sports Beauty & Grooming Haircare Makeup Nailcare Shaving Skincare Personal Products Wellness & Self Care Tech & Electronics Audio Cameras Computers, Tablets & Accessories Gaming Home Office Online Tools Smart Home Devices Smartphones, Smartwatches & Accessories Streaming TVs Travel Cruises Hotels & Lodging Luggage Travel Products Gifts Father's Day Holiday Mother's Day Valentine's Day Wedding Deals Coupons Black Friday Cyber Monday Amazon Prime Day Beauty & Grooming Big Sales Fashion Gear Home Tech & Electronics Travel Deals Mattress & Sleep Coupons Coupons See All Most Popular Macy's Zappos Vivid Seats SeatGeek Groupon DoorDash Stubhub Shutterfly Fashion H&M Nordstrom Zenni Optical Neiman Marcus Shopbop Ulta Beauty Zales Jos. A. Bank Software & VPNs NordVPN ExpressVPN Surfshark Squarespace Norton QuickBooks VistaPrint TurboTax Electronics Samsung Verizon Sonos Newegg Lenovo B&H eBay HP Sportswear & Gear adidas Nike Dick's Sporting Goods HOKA New Balance Athleta Alo Yoga RTIC Mattress & Sleep Mattress Firm Purple Mattress Bear Mattress Brooklinen Nectar Avocado Mattress Nolah Brooklyn Bedding Travel Booking.com Hotels.com Emirates Expedia Away Hilton Priceline Great Wolf Lounge Home & Garden Walmart Wayfair Edible Arrangements Instacart The Home Depot Lowe's Frontgate Total Wine View All Stores Lists Lists See All 30 Under 30 50 Over 50 Top Colleges Advisor Advisor See All Credit Cards Best Credit Cards Travel Credit Cards 0% APR Credit Cards Balance Transfer Credit Cards Business Credit Cards Best First Credit Card Mortgages & Loans Best Mortgage Lenders Mortgage Refinance Lenders Personal Loans Business Loans Bad Credit Loans Debt Consolidation Loans Debt Relief Companies Student Loans Refinance Private Student Loans Banking Best CD Rates High Yield Savings Accounts Money Market Accounts Checking Accounts Business Checking Accounts Budgeting Apps Best Online Banks Insurance Health Insurance Companies Medicare Life Insurance Companies Best Car Insurance Companies Cheapest Car Insurance Companies Pet Insurance Companies Travel Insurance Companies Homeowners Insurance Companies Business Services How to Start a Business LLC Services Payroll Services HR Software HRIS Systems PEO Services Applicant tracking Systems Domain Registrars Hosting Services Website Builders Ecomm Platforms Landing Page Builders VOIP Services Answering Services Project Management Software Task Management Software Gantt Chart Software VPNs Anti Virus Software Password Managers Home Services Moving Companies Long Distance Moving Companies Car Shipping Companies Home Warranty Companies Solar Companies Solar Panels Home Security Companies Home Security Systems Internet Providers Cheapest Internet Providers Fastest High Speed Internet Providers Pest Control Companies Education Forbes Advisor UK Forbes Advisor CA Forbes Advisor AU Health Health See All Mental Health Best Online Therapy Online Therapy that Takes Insurance Online Psychiatrists Best Online Dating Sites & Apps Best Senior Dating Sites Best LGBTQ Dating Sites CBD CBD Gummies CBD Oil CBD Creams CBD for Anxiety CBD for Pain Supplements Protein Powder Preworkout Collagen Powders Creatine Supplements CoQ10 Supplements Hearing Health Best Hearing Aids OTC Hearing Aids Affordable Hearing Aids Medical Devices Best Medical Alert Systems Best Medical Alert Systems with Fall Detection Diet & Weight Loss Best Weight Loss Plans Newsletters Newsletters See All Forbes Daily Editorial Newsletters Forbes Games Forbes Games See All Frase by Forbes Pinpoint by LinkedIn Queens by LinkedIn Crossclimb by LinkedIn More From Forbes More From Forbes Forbes Video Forbes 101 Forbes Magazine Forbes Asia Free Issue of Forbes © 2025 Forbes Media LLC. All Rights Reserved. Advertise with Forbes Forbes Licensing & Syndication Report a Security Issue Editorial Values and Standards Site Feedback Contact Us Careers at Forbes Tips Corrections Privacy Do Not Sell My Personal Information Terms AdChoices Reprints & Permissions Business Hollywood & Entertainment Inside The Business Of Rolling Loud Music Festival And Cofounder Matt Zingler By Ogden Payne , Former Contributor. Forbes contributors publish independent expert analyses and insights. I write for, and about, the up-and-coming musician. May 09, 2018, 10:00am EDT Jul 04, 2018, 10:58pm EDT Share Save This article is more than 7 years old. Rolling Loud co-founder Matt Zingler Matias Vasquez A quick scroll through Matt Zingler’s Instagram profile reveals a heavily tattooed twenty-something year old living like a modern day rock star. His photos, most of them professionally taken, exude an anti-establishment, unapologetic energy. Nearly all of them are colorful glimpses into the life of a millennial who rubs shoulders with rappers - and could possibly be mistaken for one himself. But Zingler's bio tells a different story: “Owner/Co-Founder Rolling Loud Festival.” Rolling Loud’s flyer promotes a healthy blend of hip-hop acts, including J. Cole, Future, Lil Wayne, Migos, Wiz Khalifa and 115 of rap’s in-demand performers. The extensive bill justifies the $300-plus general admission price tag, as well as the need to host the festival in the Miami Dolphins’ Hard Rock Stadium, which will hold 40,000 fans over the May 11-13 weekend. “It’s really just a nightclub, just a little bit bigger,” says Zingler, a former nightclub manager. Since its 2015 inception in Miami, Rolling Loud has established its property in Los Angeles and San Francisco, with plans to expand in New York, London, Japan, China, Mexico, Australia and Croatia. “I’m trying to create [a] Starbucks,” he says, explaining his goal of franchising the Rolling Loud festival brand. It’s a tall expectation from a biological science major turned businessman. But Zingler's clout as a concert promoter and festival owner have steadily grown since the birth of his touring company, Dope Entertainment, in 2010. The company’s first at-bat came in the form of an after party for Rick Ross in a Tallahassee nightclub. Though the event lost $30,000, Zingler realized the untapped hip-hop market in the area. He soon switched the business model to promoting concerts with hard ticket sales, and routed a revenue-generating Florida run with New Orleans rapper Curren$y. Zingler, alongside co-founder Tariq Cherif, debuted Rolling Loud in February 2015. Technical difficulties with ticket scanners, 10 inches of rain causing four-hour delays and a mandatory shut down from the fire department yielded a loss financially. Still, fans concluded it was an event worth attending again. Since then, each year has increased in occupancy and turned a profit, largely due to Zingler's ability to assess potential ROI: “Realistically if you have money, you could just leave your money in a bank or put it in a stock market, getting anywhere between 2-8%. So generally speaking, if you were going to do a high-risk investment, you would need to receive more than you would receive in something that’s [low-risk] - such as S&P or leaving your money in a bank. It’s just about scaling, price elasticity and supply and demand. For us as a festival, our ROI ranges between 10-50%. There’s a reason we’re growing at the rate we are.” As well as his ambitious vision of franchising his festival: \"When you’re franchising your brand, you obviously want to limit your liabilities but at the same time, it’s the long play. Every company is built to sell, so not necessarily are you looking at a return. You say, hey if I can get this thing going and I lose a little bit, break even, make a little bit, whatever, the value increases because of your data. It’s hard to create new brands. Every brand is just a name initially. After you develop a name and you put value to it with data and a following, any [outside company or brand] can utilize that. When I’m expanding a brand I look at it from the perspective as I’m increasing knowledge of my brand.\" And his calculated decisions regarding which industries the Rolling Loud brand will dabble in: \"Management, label, merchandising, all under the Rolling Loud brand. The future in my opinion is digital. Digital marketing and data and media content. You see everybody fighting over live stream rights. Imagine being able to have a music festival where there’s no such thing as an occupancy anymore because anybody can tune in around the world and pay $20 to watch it.\" Though the 29-year-old's acumen to process data, assess risk and plan for the future bodes well for the festival's growth, he insists that hospitality shown to artists, managers and booking agents is the signature ingredient for success. When asked if his appearance - tattoos visible from his hands to his neck - has stifled potential business, he claims, “I don’t ever dress up for anybody. I don’t believe in the suit-and-tie method. I believe that the real value is what you have in your head.” He's also hyper-aware that his desires are lofty, but revels in the possibilities. “It’s about how big can we go without sinking the ship.” Editorial Standards Reprints & Permissions LOADING VIDEO PLAYER... FORBES’ FEATURED Video © 2025 Forbes Media LLC. All Rights Reserved. AdChoices Privacy Statement Your Privacy Choices Cookie Preferences Digital Terms of Sale Terms of Service Contact Us Send Us Feedback Report a Security Issue Jobs At Forbes Reprints & Permissions Forbes Press Room Advertise"
    },
    {
      "url": "https://www.festivalpro.com/festival-management/2050/news/2022/8/24/Managing-Music-Festival-Artists-Load-in-and-Load-out.html",
      "text": "Managing Music Festival Artists Load-in and Load-out. Toggle navigation Festival Pro ® Features Ticketing SCHEDULING APP Clients Pricing FAQs More SITE PLANNER Tutorials News Articles Updates WORK IN PROGRESS Demo Sign up << Back to articles Artists Managing Music Festival Artists Load-in and Load-out. Andy Robertson When hundreds of musicians and artists are booked for a multi-day music festival the efficiency of their load-in and load-out can impact on numerous operational elements. How can music festival organisers plan and mange this to eliminate any potential issues and ensure the smooth running of the event. Any large-scale multi-day music festival with numerous stages may typically have up to 15 acts scheduled to appear each day. The logistical management for each stage is critical to the seamless artist changeovers and the efficiency will largely depend on how well planned and managed each stage is. What is the Artist’s Load-in and Load-out. Whilst load-in and load-out can refer to an event’s site construction and infrastructure build up and breakdown post event it is commonly also used to specifically refer to artists and musicians. Artists are often travelling from one event to another during festival season and the load-in at each event is critical, it’s the time allocated for their arrival and equipment set up. The load-out period is the time allocated after their performance when all their equipment is packed up ready for transportation to their next event. Scheduling (Advance and Riders). W ith so many artists booked for a music festival it is critical that each one completes and submits their advance and riders in good time. This indicates what equipment will be delivered and what elements of the installed backline will be used (drum kits, amplifiers and speakers etc). The festival organising team will use the information submitted on each advance to build their detailed schedules which are sent to each artist and confirmed. These schedules and set times will specify the time allowed for load-in and load-out along with instructions for delivery drivers. Staffing. The stage production team and support crews work to the schedules produced by the organising team which indicates specific times and staffing requirements. The support crew will be prepared for the arrival of an artist and their equipment so it is crucial to know exactly how much needs to be unloaded and set up. Any inaccurate information about deliveries can mean a shortage of crews to carry out the load-in and load-out phases which will impact on the schedules and timing for other artists too. The efficiency of the musician's load-in and load-out is dependent on the information submitted on the artist's advance as this is used to predict staff requirements and prevent site congestion by delivery vehicles. Inaccurate information can lead to staff shortages and late running set times which in turn can affect an artist’s performance. The stage production and festival management team should have contingency plans in place to allow for any disruption occurring with artist’s load-in and load-out scheduling. For festival organisers planning their events using a software management platform like Festival Pro gives them all the functionality they need manage every aspect of their event logistics. The guys who are responsible for this software have been in the front line of event management for many years and the features are built from that experience and are performance artists themselves. The Festival Pro platform is easy to use and has comprehensive features with specific modules for managing artists, contractors, venues/stages, vendors, volunteers, sponsors, guestlists, ticketing, cashless payments and contactless ordering. Photo by F. Muhammad from Pixabay Andy Robertson Share To: << Back to articles Contact us Get in touch to discuss your requirements. info@festivalpro.com US: +1 424 485 0220 (USA) UK: +44 207 060 2666 (United Kingdom) AU: +61 (2) 8357 0793 (Australia) NZ: +64 (0)9887 8005 (New Zealand) Or use our contact form here. Festival Pro ® Privacy Policy | Tutorials | FAQs"
    },
    {
      "url": "https://www.managementcenter.org/staff-board/",
      "text": "Team Members Archive - The Management Center Skip to content Instagram Instagram About Our Approach Our Clients Our Team Work With Us News & Updates Trainings For Managers For Staff In-House Training for Teams Management Workouts Training FAQ Coaching Success Stories￼ Resources Check-ins Culture & Relationships Delegation Equity & Inclusion Hiring Investing in People Managing Managers Managing Up & Sideways Performance Problems Roles & Goals Recursos en Español Other Topics Newsletter Archive Educational Equity Newsletter Archive Book Search for... Hi friends! We use cookies to improve your experience of our site. In certain instances, we ask for personal info so we can be unusually helpful in delivering services (like trainings!). If you continue browsing, we assume you accept our Privacy Policy . TL;DR we take data privacy seriously. Accept Home // // About // Our Team Our Team Filter By Pick Team to filter by All Teams Admin CEO Coaching Content Education Sector Leadership Progressive Sector Public Sector Training Residents The Management Center Staff Jakada Imani Pronouns he/him Position Chief Executive Officer Jessica Anderson Pronouns she/her Position Managing Partner, Trainer Jamilyn Bailey Pronouns she/her Position Partner, Trainer Adriana Barboza Pronouns she/her Position Partner, Trainer Taylor Broome Pronouns She/Her Position Training Operations Coordinator R. Burke Pronouns she/her Position Manager, Client Support Hanna Campbell Pronouns she/her Position Partner, Trainer Diana Cerda Pronouns she/her Position Director, Finance Jackson Darling-Palacios Pronouns he/him Position Senior Partner, Progressive Sector Head, Partnerships, and Planning Qasim Davis Pronouns he/him Position Partner, Trainer Chloe Davis-Carden Pronouns they/them Position Vice President, Trainer Kendan Elliott Pronouns he/they Position Director, Client Support Valerie Evans Pronouns she/her Position Chief Operating Officer Johari Farrar Pronouns she/her Position Communications Coordinator Amy Faulring Pronouns she/her Position Partner, Coach Cosmo Fujiyama Ghaznavi Pronouns she/her Position Partner, Progressive Sector Engagement and Partnerships Reilly Furellis Pronouns she/her Position Managing Partner, Finance & Data Brian Gómez Pronouns He/Him Position Finance Manager Marissa Graciosa Pronouns she/her Position Partner, Coach Jenny Griggs Pronouns she/her Position Vice President, Progressive Partnerships Wendy Guyton Pronouns she/her Position Managing Partner, Client Support Nancy Hanks Pronouns she/her Position Senior Partner, Education Sector Head Megan Hanson Pronouns she/her Position Senior Partner, Trainer Cedric Harmon Pronouns he/him Position Partner, Coach Sarah Hodgdon Pronouns she/her Position Partner, Coach Cicely Horsham-Brathwaite Pronouns she/her Position Managing Partner, Coach Valerie Jiggetts Pronouns she/her Position Vice President, Client Support Cindy Kang Pronouns she/her Position Senior Partner, Coach Stacy McAuliffe Pronouns she/her Position Managing Partner, Coach Stephen McClain Pronouns he/him Position Partner, Education Sector Engagements and Partnerships 1 2 In Residence Bex Ahuja Pronouns they/them Position Adjunct Trainer Jumoke Balogun Pronouns she/her Position Adjunct Coach Cheyenne E. Batista Pronouns she/her Position Adjunct Trainer Megan Bellamy Pronouns she/her Position Adjunct Trainer Meredith Bliss Pronouns she/her Position Adjunct Trainer, Hotline Coach Briana  Brown Pronouns she/her Position Administrative Director of Talent & HR Consultant Betsy Buckley Pronouns she/her Position Interim Chief Financial Officer Jen Chau Fontán Pronouns she/her Position Adjunct Coach Linara Davidson Greenidge Pronouns she/her Position Adjunct Coach De-Lea Deane-Allen Pronouns she/her Position Adjunct Coach Jennifer Epps-Addison Pronouns she/her Position Adjunct Trainer Michelle Hallerdin Pronouns she/her Position Hotline Coach Eva Hernandez Pronouns she/her Position Adjunct Coach José Luis Marantes Pronouns he/him Position Adjunct Trainer Lenny Noisette Pronouns he/him Position Adjunct Coach Kimberly Osagie Pronouns she/her Position Adjunct Trainer Julien Ross Pronouns he/him/él Position Progressive Partnerships and Strategy Contractor Melinda Spooner Pronouns she/her Position Adjunct Trainer Sujata Tejwani Pronouns she/her Position Adjunct Trainer Shannon Wheatley Pronouns he/him Position Adjunct Trainer Yamani Yansa Hernandez Pronouns she/they Position Adjunct Coach Contact Us Call Us Send contact email About Trainings Coaching Resources Book Tax Exemption Copyright Privacy Policy Site Credits Back to top"
    },
    {
      "url": "https://www.montpelierfallfestival.com/about-us",
      "text": "Who We Are — Montpelier Fall Festival Who We Are Sponsors HOME Who We Are Sponsors HOME WE’RE BUSY PLANNING OUR 2025 FESTIVAL (OCT.4th)– STAY TUNED! The Montpelier Fall Festival is a free, city-wide event on the beautiful Vermont State House lawn, celebrating community spirit and commitment to the Montpelier Roxbury Public Schools. 2024 included the Onion River Outdoor 1-mile Fun Run, live music and performances, games on the lawn including the Celebrity Dunk Tank, local crafts, local food and more! This annual event has become a favorite activity for students, staff and families in Montpelier and Roxbury. Each year, attendance grows – we expect approximately 1,500 participants from around central Vermont. Since its inception in 2016, the MFF has raised over $70,000 for the Montpelier Roxbury Public School Partners in Education ( MRPS PIE ), which supports our local public schools' many initiatives and is fueled by family and community volunteers. Thank you to our fantastic volunteers, loyal sponsors and generous community! About MRPS PIE MRPS Partners in Education Corporation is a 501(c)(3) non-profit charitable organization founded in January 2019. Our mission is to serve the communities of Montpelier Roxbury Public Schools, Vermont. We provide opportunities for enrichment, build community, and serve as a vehicle for information and advocacy for parents and the community. MRPS PIE helps to organize, support, and increase fundraising potential for each of our schools’ parent and caregiver groups. About Onion River Outdoors Onion River Outdoors is a locally owned, community-minded outdoor gear and apparel shop in Montpelier. They are outdoor recreation experts and an eclectic and fun group of active, outdoor- loving folks seeking healthier, happier, and more eco-friendly ways to live. They believe that when consumers support local business and local business supports the community, we all win. About Montpelier Alive Montpelier Alive celebrates the City of Montpelier through partnerships that sustain and build upon Montpelier’s vibrant downtown community. They offer and support special events and activities by promoting City businesses, working to ensure Montpelier’s thriving local economy and to preserve the City’s historic character and unique sense of place. Contact Us Name * First Name Last Name Email * Subject * Message * Thank you for your interest! Someone will get back to you soon! Back to Top Photography provided by John Lazenby, Ted Dawson, and Montpelier Alive Powered by Squarespace"
    },
    {
      "url": "https://www.dubaifestivalcity.com/contactus/",
      "text": "Contact us - We're here! | Dubai Festival City Contact Us About Dubai Festival City Events Offers & Promotions News Blog Virtual Meeting Contact Us Menu About Dubai Festival City Events Offers & Promotions News Blog Virtual Meeting Contact Us Live Live at DFC Al Badia Hillside Al Badia Living Al Badia Residences Marsa Plaza Rent Property Al Badia Living Al Badia Residences Buy property Marsa Plaza Live at DFC Al Badia Hillside Al Badia Living Al Badia Residences Marsa Plaza Rent Property Al Badia Living Al Badia Residences Buy property Marsa Plaza Enjoy Enjoy at DFC IMAGINE Dhow Rides VOX Cinemas Al Areesh Club Champs Outdoors Shop Shop at DFC In the Spotlight Everything You Need Choose Your Ride Dine Dine at DFC In the Spotlight Everything You Need Hotel Dining Stay Stay at DFC Crowne Plaza Holiday Inn InterContinental InterContinental Residence Suites Work Work at DFC Festival Tower Learn Learn at DFC Deira International School Universal American School Live Live at DFC Rent Property Al Badia Residences Buy Property Marsa Plaza Al Badia Hillside Al Badia Residences Enjoy Enjoy at DFC IMAGINE Dhow Rides VOX Cinemas Al Areesh Club Champs Outdoors Shop Shop at DFC In the Spotlight Everything You Need Choose Your Ride Dine Dine at DFC In the Spotlight Everything You Need Hotel Dining Stay Stay at DFC Crowne Plaza Holiday Inn InterContinental InterContinental Residence Suites Work Work at DFC Festival Tower Learn Learn at DFC Deira International School Universal American School About Dubai Festival City Events Offers & Promotions News Blog Virtual Meeting Contact Us Menu Live Live at DFC Rent Property Al Badia Residences Buy Property Marsa Plaza Al Badia Hillside Al Badia Residences Enjoy Enjoy at DFC IMAGINE Dhow Rides VOX Cinemas Al Areesh Club Champs Outdoors Shop Shop at DFC In the Spotlight Everything You Need Choose Your Ride Dine Dine at DFC In the Spotlight Everything You Need Hotel Dining Stay Stay at DFC Crowne Plaza Holiday Inn InterContinental InterContinental Residence Suites Work Work at DFC Festival Tower Learn Learn at DFC Deira International School Universal American School About Dubai Festival City Events Offers & Promotions News Blog Virtual Meeting Contact Us Contact Us - Dubai Festival City Get In Touch With Us Ask Us Anything Thank you for registering your interest, a member of our sales team will get in touch with you shortly. Send us an Email First name is required Second name is required Email is required Mobile number is required Fill your enquiry I have read and accepted the Privacy Policy Please check this box if you want to proceed. SEND DOWNLOAD A HANDY DUBAI FESTIVAL CITY DIRECTIONS GUIDE NOW Get In Touch How to get here: Al Futtaim Group Real Estate Write us: Residential@alfuttaim.ae Give us a call: 800 332 Timings: Monday to Friday 8:30AM to 5:30PM Live Live at DFC Rent property Buy Property Live at DFC Rent property Buy Property Enjoy Enjoy at DFC IMAGINE Dhow Rides VOX Cinemas Al Areesh Club Champs Outdoors Enjoy at DFC IMAGINE Dhow Rides VOX Cinemas Al Areesh Club Champs Outdoors Shop Shop at DFC In the Spotlight Everything You Need Choose Your Ride Shop at DFC In the Spotlight Everything You Need Choose Your Ride Dine Dine at DFC In the Spotlight Everything You Need Hotel Dining Dine at DFC In the Spotlight Everything You Need Hotel Dining Stay Stay at DFC Crowne Plaza Holiday Inn InterContinental InterContinental Residence Suites Stay at DFC Crowne Plaza Holiday Inn InterContinental InterContinental Residence Suites Work Work at DFC Festival Tower Work at DFC Festival Tower Learn Learn at DFC Deira International School Universal American School Learn at DFC Deira International School Universal American School About Al-Futtaim Group Real Estate Privacy Policy Contact Us FAQ Careers Sitemap Call : 800 DFC(332) Follow Us Live Live at DFC Rent Property Buy Property Enjoy Enjoy at DFC IMAGINE Dhow Rides Vox cinemas Al Areesh Club Champs Outdoors Shop Shop at DFC In the Spotlight Everything You Need Choose Your Ride Dine Dine at DFC In the Spotlight Everything You Need Hotel Dining Stay Stay at DFC Crowne Plaza Holiday Inn InterContinental InterContinental Residence Suites Work Work at DFC Festival Tower Learn Learn at DFC Deira International School Universal American School Live Live at DFC Rent Property Buy Property Enjoy Enjoy at DFC IMAGINE Dhow Rides Vox cinemas Al Areesh Club Champs Outdoors Shop Shop at DFC In the Spotlight Everything You Need Choose Your Ride Dine Dine at DFC In the Spotlight Everything You Need Hotel Dining Stay Stay at DFC Crowne Plaza Holiday Inn InterContinental InterContinental Residence Suites Work Work at DFC Festival Tower Learn Learn at DFC Deira International School Universal American School About Al-Futtaim Group Real Estate Privacy Policy Contact Us FAQ Careers Sitemap call me back call us whatsapp How can we help you ? Share 800 332"
    },
    {
      "url": "https://gts.us.com/About-Global-Technical-Systems_Who-We-Are",
      "text": "Who We Are info@gts.us.com (757) 468-8751 Follow us on LinkedIn Toggle navigation Our Company Locations Who We Are Who We Serve News Capabilities Avionic Systems C4ISR Advanced COTS Enclosure Common Processing System FusionCommand AgentCommand AgentMobile Android Security Mission Capabilities Border Systems Infrastructure Systems Maritime Systems Advanced Composite Technology Composite Munitions Flywheel Energy Storage Radars AN/APS-151 Radar L-Band Amplifier Mobile Sensor System TriCore Signal Processor High Performance Computing (HPC) Commercial Solutions for Classified (CSfC) EAGLE X GTS Trusted Computers NXGEN Services Information Technology Systems Engineering Logistics Services Depot Repair GSA PSS GS-00F-285DA Quality Program Careers Benefits Job Postings Who We Are Who We Are Since its founding in\r\n1997, Global Technical Systems (GTS) has been a leading innovator in technology. We embrace creativity and teamwork.  At GTS we don't have employees, we\r\nhave experts who pride themselves in their work and field of study. We empower our employees in their ingenuity and vision. The culture at GTS is\r\nbased upon its founders’ patriotism: “GTS’s mission is directed towards\r\nexcellence. \"If we are asking people to die for our country, then it’s our\r\njob to provide them with the best technology possible.\" Our mission drives us to\r\ndo everything possible to create and harness emerging leading edge\r\ntechnologies, in the pursuit of excellence and innovation. Our business philosophy\r\ncenters on assembling a cohesive, ethical and talented team. GTS is motivated\r\nby a culture of service. The products and services we provide, are critical to\r\nour nation's defense and homeland security. We take these responsibilities\r\nseriously and deliver accordingly. Quality Statement GTS provides innovative, cost-effective, high-tech engineering\r\nproducts and product-based services encompassing latest generation software and\r\nhardware solutions and engineering services for defense, homeland security, and\r\nother critical government interests. Products and services span a spectrum that includes: mission-critical combat\r\nsystems processors; Command, Control, Communications, Computer, Intelligence,\r\nSurveillance and Reconnaissance (C4ISR) systems; military combat systems\r\nhardware production; radar and sensor systems; avionics test sets; threat\r\ndetection; biometric identification systems; composite materials for advanced\r\nmunitions, armor, and energy; and depot repair and logistics Our Quality Management\r\nSystem (QMS) is certified ISO 9001:2015 compliant in design, manufacture,\r\ninstallation, and repair of electronic components. Originally certified to ISO\r\n9001:2000 in 2004, GTS recertified to ISO 9001:2008 Standards in October 2009,\r\nand ISO 9001:2015 Standards in July 2016, successfully completing our\r\nrecertification assessment on June 3, 2022. Our QA Program Metrics and\r\nperformance monitoring processes are established and play a vital role in GTS' success. Mission Statement \"Our mission at GTS is to solve our customers' most critical challenges with advanced engineering solutions delivered rapidly and cost-effectively.\" Our Team Terry Spitzer President & Chief Executive Officer Tom Kaupas Chief Financial Officer Craig Black Senior Vice President of Operations Kevin McTigue Chief Growth Officer Ben Davenport Vice President of Strategic Development Dawn Posch Controller Kirk Clinkenbeard Senior VP Government Relations Tony Rauch Director of Manufacturing Dawn Chapman Human Resources Director Mike Danjczek Director of Engineering Ed Miller Executive Vice President Noel Mitchell Cybersecurity Manager / ISSM Scott E. Groves, Ph.D. Director for Advanced Composite Applications Jerry Smith Director of Munitions Tom S. Morgan VP Intelligence, Mobility and Embedded Technologies (IMET) Serhii Ivanov VP for Government Relations, EU & UA Contact Info Phone: (757) 468-8751 421 S. Birdneck Rd. Virginia Beach, VA 23451 info@gts.us.com Global Technical Systems (GTS) provides innovative, cost-effective, high-tech engineering products and product-based services encompassing latest generation software and hardware solutions and engineering services for defense, homeland security, and other critical government interests. SUBMIT Site Development Copyright ©2025 Internet Marketing and Design |  Site Contents Copyright ©2025 Global Technical Systems (GTS)"
    },
    {
      "url": "https://www.iidasfc.org/",
      "text": "IIDA SFC HOME ABOUT US MEMBERSHIP SPONSORSHIP Design Mix '25 NYNY '25 ADVOCACY - RISE UP Students Design Your World ADVANCEYOU Back BOARD OF DIRECTORS WHY IIDA CONTACT US Back Save the Date Sponsorship Package DM 2025 Submissions What to Wear Hotel info MEET THE EMCEES Meet the Judges Event Album Back NYNY '25 About Keynote & Panelist Event Details Tickets & Sponsorships Event Album Back ABOUT LEGISLATIVE ADVOCACY SOCIAL ADVOCACY RISE UP EVENTS Back Scholarships Student Tours Scholarships 2025 HOME ABOUT US BOARD OF DIRECTORS WHY IIDA CONTACT US MEMBERSHIP SPONSORSHIP Design Mix '25 Save the Date Sponsorship Package DM 2025 Submissions What to Wear Hotel info MEET THE EMCEES Meet the Judges Event Album NYNY '25 NYNY '25 About Keynote & Panelist Event Details Tickets & Sponsorships Event Album ADVOCACY - RISE UP ABOUT LEGISLATIVE ADVOCACY SOCIAL ADVOCACY RISE UP EVENTS Students Scholarships Student Tours Scholarships 2025 Design Your World ADVANCEYOU Scroll Welcome to IIDA                                                                                         South Florida Chapter It’s always sunny in the Sunshine State. Except for at night. - Jarod Kintz *Backed by the latest science, the Climate Clock tells us what we must do, by when. The Deadline and Lifelines on the Climate Clock make explicit the speed and scope of action that political leaders must take in order to limit the worst climate impacts. - The Clock’s Deadline tells us that, at current rates of greenhouse gas emissions, we have less than eight years left in our global “carbon budget” that gives two-thirds chance of staying under the critical threshold of 1.5°C of global warming* Interior Design or Interior Decoration? If you’ve ever struggled with clients, family, and friends over the differences between \"interior design\" and \"interior decoration,\" here is a great video by CIDQ just for those moments. Hands up if you've had to explain the difference between ”interior design” and “interior decoration” to your clients, family, and friends 🙋🏽‍♀️ You're not alone! This video from CIDQ breaks down the key differences to help you navigate conversations and finally clear up the confusion for good. watch full video here Honored and proud! On June 6, the IIDA South Florida team accepted the 2025 Chapter Leadership Council Award for our Diversity by Design program, presented by IIDA HQ. This recognition reflects our continued commitment to celebrating diverse voices and inclusive design within our community. A heartfelt thank you to our sponsors for helping make this vision a reality—we couldn’t have done it without your support! On June 30th, IIDA HQ honored us with a chapter award for the Virtual BRAGG Awards Gala we had last year! This is what they had to say about us: “IIDA South Florida didn’t let a global pandemic stand in the way of honoring colleagues and members at their annual BRAGG gala. Utilizing a professional production company, the chapter filmed presentations in showrooms across their chapter, commercials for membership, and a live portion for member participation. The chapter auctioned off free tickets, pulled together swag bags, and provided 25 firms with a catered meal and bottle of wine thanking them for their continued support. They streamlined the submissions process, and had more engagement than ever from student members—with doubled entries from students, the chapter was able to double the scholarships they awarded. Sponsorships were provided commercial time, product spotlights, and the opportunity to present awards. By taking their gala virtual, IIDA South Florida embodied their theme, “Design is resilient and bold,” and were able to celebrate design excellence virtually while engaging members and sponsors.” Big shout out to everyone who made this event possible, and a big THANK YOU to IIDA HQ for the award! IIDA SFC on Advocacy: Diversity in the design profession. Interior design offers incredible diversity. Hear from design professionals in this short video on the interior design profession. The design community has many successful professions and a variety of large companies throughout the country. Interior Designers are everywhere. They influence all aspects of the built environment and the individuals who inhabit those spaces. Learn more by watching Advocacy: Diversity in the design profession Upcoming Events Event Spotlights Check out this industry event! Event Highlights: Check back for more highlights! Wellness Wednesday soaps, socks & sandcastles synergy summit student tours Sponsor Spotlight Savor the warm glow of summer nights, where natural beauty and sophistication meet. This collection blends artisanal craftsmanship and architectural influences with natural textures, metallic accents, and subtle fringe details. We invite you to our Summer Soiree. Phillip Jeffries offers a vast array of inspiring Type II vinyl, PVC Free and digital wallcoverings for commercial environments, while meeting the need for long-term performance. We understand the factors important to designers, specifiers, and purchasers. Custom Made Easy Inspired by a collection in our line and want to make it just right for your project? If you have a unique idea or inspiration with technical attributes and pricing to fit your project…tell us about your project. Pure Imagination our custom digital program allows designers to create unique designs to realize their project concepts. Phillip Jeffries Contract custom capabilities and delivery timelines distinguishes us against other wallcovering brands. We offer custom color options on 500 yards, as well custom designs available on 1000 yards. Tell me about your project! Claudia Caiazzo. Direct: 305-753-8151 Email:  ccaiazzo@phillipjeffries.com This Year’s Annual Sponsors We could not be more thankful to our sponsors who are the reason why we are able to do everything we do for our community, our students, and the profession. Without them, none of it would be possible. Emerald JC White Architectural Interior Products + Haworth Thank you for being an Emerald Sponsor! OFS Thank you for being an Emerald Sponsor! Power & Lighting Systems, Inc. Thank you for being an Emerald Sponsor! Sapphire Architectural Design Collaborative Thank you for being a Sapphire Sponsor! Compass Office Solutions Thank you for being a Sapphire Sponsor! FCI Thank you for being a Sapphire Sponsor! Keilhauer Thank you for being a Sapphire Sponsor! Allsteel Thank you for being a Sapphire Sponsor! CI Group Thank you for being a Sapphire Sponsor! Autex Acoustics Thank you for being a Sapphire Sponsor! Empire Office + Steelcase Thank you for being a Sapphire Sponsor! Gensler Thank you for being a Sapphire Sponsor! Interface Thank you for being a Sapphire Sponsor! McGowen Builders Thank you for being a Sapphire Sponsor! Origin Construction Thank you for being a Sapphire Sponsor! Sherwin-Williams Thank you for being a Sapphire Sponsor! The Bierman Group Thank you for being a Sapphire Sponsor! Bronze Bentley Mills Thank you for being a Bronze Sponsor! Infinity Architectural Lighting Thank you for being a Bronze Sponsor! Richloom Contract Thank you for being a Bronze Sponsor! Mannington Thank you for being a Bronze Sponsor! Design Works Thank you for being a Bronze Sponsor! MechoShades Thank you for being a Bronze Sponsor! Pradere Designer Workspaces Thank you for being a Bronze Sponsor! Curated Co. Thank you for being a Bronze Sponsor! Phillip Jeffries Contract Thank you for being a Bronze Sponsor! The Padron Group Thank you for being a Bronze Sponsor! HOK Thank you for being a Bronze Sponsor! HOME DESIGN MANIFESTO EVENTS Want to Become a Sponsor? Ready to Join? Join Sponsor ©International Interior Design Association | South Florida Chapter | info@iidasfc.org"
    },
    {
      "url": "https://nationalcherryblossomfestival.org/our-team/",
      "text": "Our Team - National Cherry Blossom Festival 2026 FESTIVAL: MARCH 20 – APRIL 12 WASHINGTON, DC Instagram Twitter Facebook-f Youtube Linkedin ABOUT US Mission & History Official Artist & Artwork FAQs Contact Events Archive NCBF, INC. Awards Board of Directors Our Team Job Opportunities Annual Review MEDIA GET OUR EMAILS Search DONATE 2025 FESTIVAL: MARCH 20 – APRIL 13 Facebook-f Twitter Instagram Linkedin Youtube Envelope Search DONATE About Us FAQs Highlights Events Archive Contact NCBF, INC. Awards Board of Directors Our Team Job Opportunities Annual Review Media BLOOM WATCH EVENTS TIDAL BASIN WELCOME AREA & ANA STAGE PINK TIE PARTY BLOSSOM KITE FESTIVAL OPENING CEREMONY PETALPALOOZA PARADE ALL EVENTS STAY & PLAY HOTELS RESTAURANTS CITY IN BLOOM ART IN BLOOM PAWS & PETALS THINGS TO DO COMMUNITY STUDENT ART SHOWCASE BLOSSOM KICKS BLOSSOM TEA PARTY GIRL SCOUTS PATCH PROGRAM TREE PLANTING OXON RUN PINKNIC GET INVOLVED GIFT SHOP SPONSORS 2025 Sponsors Become a Sponsor Supporters Get Our Emails OUR TEAM EXECUTIVE OFFICE PRESIDENT Diana Mayhew dmayhew@ncbfdc.org 202.661.7596 Vice President Lillian Iversen liversen@ncbfdc.org 202.661.7584 Business Development & Sponsorship Senior Sponsorship and Development Manager Melissa Lembke mlembke@ncbfdc.org 202.638.8374 Sponsorship & development manager Christina Teufert cteufert@ncbfdc.org 202.661.7592 Business development & sponsorship manager Jessica Brown jbrown@ncbfdc.org 202.638.8364 Sponsorship & development manager Christina Teufert cteufert@ncbfdc.org 202.661.7592 Sponsorship Coordinator Reiko Hirai reiko@happi-events.com 202.638.8363 COMMUNITY OUTREACH AND EVENTS COORDINATOR Miriam Moreno - Alcala mmoreno-alcala@ncbfdc.org DEVELOPMENT & COMMUNITY PARTNERSHIPS CONTRACTOR Maya Brown mbrown@ncbfdc.org development Intern Andrea Londono alondono@ncbfdc.org MARKETING & COMMUNICATIONS design manager Jacqueline Garcia jgarcia@ncbfdc.org 202.626.1133 Sponsorship & Communications Liaison Ramona Carver rcarver@ncbfdc.org 202.638.8376 Marketing manager Kristin Baasansukh kbaasansukh@ncbfdc.org design manager Jacqueline Garcia jgarcia@ncbfdc.org 202.626.1133 integrated Marketing coordinator Martina Tinong mtinong@ncbfdc.org EVENTS & PROGRAMS DIRECTOR OF PROGRAMMING Neptune Pringle III npringle@ncbfdc.org 202.455.8954 OPERATIONS MANAGER Patrick Oberman poberman@ncbfdc.org PROGRAMMING COORDINATOR Miriam Moreno - Alcala mmoreno-alcala@ncbfdc.org OPERATIONS MANAGER Patrick Oberman poberman@ncbfdc.org FOOD AND BEVERAGE COORDINATOR Antoine Lee alee@ncbfdc.org ACTIVITIES AND ACTIVATIONS COORDINATOR Dey Stegall dstegall@ncbfdc.org OPERATIONS COORDINATOR Caitlin Nix cnix@ncbfdc.org ACTIVITIES AND ACTIVATIONS COORDINATOR Dey Stegall dstegall@ncbfdc.org COMMUNITY PROGRAMMING COORDINATOR Aysha Malik amalik@ncbfdc.org TALENT MANAGER Kristopher Thompson kthompson@ncbfdc.org Business operations DIRECTOR OF BUSINESS OPERATIONS Caryn Fraim cfraim@ncbfdc.org FINANCE MANAGER Paris Weissman pweissman@ncbfdc.org 202.626.7567 EXECUTIVE ASSISTANT TO THE PRESIDENT Francise Dyson fdyson@ncbfdc.org 202.661.7585 2024 SPRING INTERNS GRAPHIC DESIGN Alexandra Oquendo                                                                                      Christina Xue MEDIA PARNER Jessica Diaram MARKETING & COMMUNICATIONS Isabelle Frangakis PROGRAMMING Nia Harris Olivia Johnson Ancheng (Mike) Shi Festival Associates JOIN OUR TEAM EMPLOYMENT OPPORTUNITIES & INTERNSHIPS FULL TIME & Part time roles No positions available at this time. Event Operations Manager National Cherry Blossom Festival, Inc. , a 501(c)(3) not-for-profit organization based in Washington, DC, is currently seeking an Event Operations Manager. Company Description The National Cherry Blossom Festival produces and promotes the nation’s greatest springtime celebration and is dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational and entertainment initiatives that enhance our environment, showcase arts and culture, and build community spirit. The Event Operations Manager is responsible for managing the production and logistical plans and timelines for all National Cherry Blossom Festival events. The Event Operations Manager manages vendors, supplies, and equipment for all events, and oversees load-in, load-out, and all on-site logistics. Reporting to the Director of Programming, the Event Operations Manager will collaborate with all teams to develop and implement production plans and curate programmatic elements of each event. They will also plan and implement all health, safety, transportation and traffic management plans. Responsibilities Provide primary support for the programming and operations functions of the National Cherry Blossom Festival. Communicate with management staff, board members, clients and vendors using a high degree of tact, professionalism and discretion. Carry out directives and established policies and complete assignments with moderate supervision. Organize daily work within parameters set by the National Cherry Blossom Festival. This position reports to the Director of Programming and works in conjunction with the Vice President. The Event Operations Manager is responsible for: Event Production Develop and execute all production and logistical plans and timelines including programmatic elements, food and beverage, sponsorship activations, benefit fulfillment and event logistics. Manage vendors, supplies, and equipment including site/venue management, contingency planning, parking, health and safety, signage and collateral, sound, lighting and staging, staffing, traffic and waste management. Maintain inventory of equipment and supplies in storage Manage site plans and asset management documents Assist Festival staff in liaising with venue representatives and the local community Keep the Festival apprised of all financial, production and logistical issues Event Management Work with event managers to curate the programmatic elements of events Be the liaison between the programming and business operations teams to process necessary paperwork including agreements, contracts, purchase orders, expense vouchers and COIs. Event Operations Implement Health & Safety and Transportation & Traffic Management plans at events via coordination with vendors Acquire documentation and approvals for all required permits and applications via District of Columbia agencies and the National Park Service Make copies and hang permits and proper signage (parking, directional, health & safety) Communicate and work collaboratively across departments with responsibilities including, but not limited to: Submitting and reviewing assets (Marketing) Ensuring fulfillment of sponsorship deliverables (Sponsorship) Submitting invoices (Business Operations) Identify event volunteer needs (Volunteer Management) On-Site Logistics and Management Oversee load-in and load out of each event, managing vendors, equipment and supplies Oversee the Operations crew to ensure production plans are implemented accurately. Establish and manage Event Operations Center in cooperation with Festival staff and volunteers Monitor and resolve any production and logistical issues that may arise Manage inventory pre- and post- for all festival events Manage the collection and distribution of event materials and supplies Qualifications Bachelor’s degree or other equivalent experience Minimum of three years of demonstrated experience working in event management and operations Strong experience in permit acquisition within the District of Columbia Excellent project coordination, time management, and organizational skills with the ability to juggle and prioritize multiple projects in a fast-paced environment Strong creative, strategic and analytical skills Strong leadership skills Superior communication and writing skills Attention to detail, high productivity and concern for accuracy and excellence Proficiency in Microsoft Office; experience with Monday.com or Slack is a plus Must be a self-starter, proactive and driven with a strong work ethic, a high level of motivation, a strong sense of urgency when needed, with the ability to work without direct supervision and consistently meet deadlines Commitment to working with shared leadership and in cross-functional teams Ability to work non-traditional hours Ability to foster positive, productive relationships, collaboration and teamwork, internally and externally, among staff, board members, volunteers, partners and other Festival stakeholders As an integral part of the National Cherry Blossom Festival team, this salaried exempt position participates fully in the production and execution of all Festival events. This requires flexibility to be available evenings and weekends and to work additional hours during peak periods. TARGET START DATE: August 25 – September 3, 2025 COMPENSATION/BENEFITS Salary range: $60,000 – $65,000/year. Benefits package includes health insurance with prescription drug, dental, and eye plans (substantially underwritten by NCBF); annual and sick leave; short-term and long-term disability; life insurance; flexible spending account; 401K plan with safe harbor contributions eligible 6 months after hire; parking/transit subsidy. The National Cherry Blossom Festival is an Equal Opportunity Employer. Apply Here INTERNSHIPS Graphic Design Intern National Cherry Blossom Festival, Inc ., a 501(c)(3) not-for-profit organization based in Washington, DC, seeks two energetic, creative, and passionate Marketing & Communications Graphic Design Interns to assist the team in executing the 2026 Festival. Who We Are The National Cherry Blossom Festival, Inc. is dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts, culture, and build community spirit. Internship Description The Marketing & Communications Graphic Design Intern will contribute to the communication, marketing, and branding strategy of various National Cherry Blossom Festival programs and events for the 2026 Festival. Duties may include, but are not limited to the following: Work closely with the Marketing and Communications team and other departments to understand project objectives, gather requirements, and deliver high-quality designs within established deadlines. Assist in concept creation for a variety of campaigns using the Festival’s unique branding Apply principles of design to create and implement visual assets, including advertisements, event signage and collateral, digital invitations, and banners, etc. Develop PowerPoint presentations for special campaigns, events, and initiatives within project timelines Support and update essential production boards via Monday.com, a project management platform Organize and maintain the Festival’s photo gallery Assist with onsite team-related roles at in-person events as needed Other design requirements and responsibilities as necessary The Festival welcomes interns who wish to focus on a particular specialty (e.g., photography, design, video, social media, website, media monitoring, and campaign tracking). Depending on the area(s) of interest and level of expertise, the work can be structured to offer a valuable hands-on learning experience. Time Requirements: The Festival seeks interns who are available for both Fall AND Spring semesters to get the most value and experience during this internship. Interns who can commit to only one semester, either Fall or Spring, are also welcome to apply. Event execution support is subject to the intern’s availability and discretion. Interns are asked to commit to at least one full semester supporting the Festival. Schedule: Fall Semester targeted start date: Monday, September 8, 2025 Fall Semester end date: December 2025, depending upon the intern’s schedule Spring Semester targeted start date: Monday, January 12, 2026 Spring Semester end date: June 2026, depending upon the intern’s schedule. The 2026 National Cherry Blossom Festival runs from March 20 – April 12, 2026. September – December 2025: 10 to 15 hours per week between the hours of 10 AM and 5:30 PM – Monday, Wednesday, and Thursday (Tuesday and Friday remote as needed). Evening availability to execute the Festival Launch event (November 2025). Start and end dates are flexible to align with semester schedules and internship academic credit requirements. Hours, schedule, and work format (must be primarily onsite with minimal remote option) are determined in consultation with the Marketing and Communications team and based on student availability. January – June 2026: 10 to 15 hours per week between the hours of 10 AM and 5:30 PM – Monday, Wednesday, and Thursday (Tuesday and Friday remote as needed). Start and end dates are flexible to align with semester schedules and internship academic credit requirements. Hours, schedule, and work format (must be primarily onsite with minimal remote options) are determined in consultation with the Marketing and Communications team and based on student availability. Evening and weekend availability to execute key Festival weekly programs and events during peak months (March 2026 – April 2026). Qualifications Currently enrolled in an accredited university or college as a full-time undergraduate or graduate student. Recent graduates may also be considered. Candidates must be studying graphic design or a similar degree and provide a portfolio showcasing creativity through brand design, layout, typography, and current trends Proficiency in Adobe Creative Suite, including Photoshop, Illustrator, and InDesign; Microsoft Office applications including Word, Excel, PowerPoint Passion for community engagement, the arts, and/or international friendship Strong attention to detail and organized with the ability to multi-task Excellent written and verbal communications skills (knowledge of AP Style preferred) Able to work independently and complete multiple projects in a timely manner Ability to collaborate with a variety of people in an exciting, fast-paced environment Preferred, but not required: Prior experience in photography/videography plus Adobe Premiere Pro editing, and experience in Canva Compensation National Cherry Blossom Festival, Inc. internships are unpaid, but college credit may be offered depending upon the educational institution’s guidelines and requirements. A monthly stipend is available for interns to defray the cost of commuting to the office. Please include a PDF file of your portfolio using the application form and/or include a link to your website portfolio on your CV/resume. Apply Here Marketing & Social Media Intern National Cherry Blossom Festival, Inc ., a 501(c)(3) not-for-profit organization based in Washington, DC, is currently seeking an energetic, creative, and passionate Marketing & Social Media Student Intern to assist the Marketing and Communications team in executing the 2026 Festival. Organization Description The National Cherry Blossom Festival, Inc. is dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts and culture, and build community spirit. Internship Description The Marketing & Social Media Intern will contribute to the communications, marketing, digital content creation, and branding strategies of various National Cherry Blossom Festival programs and events for the 2026 Festival. Duties may include, but are not limited to the following: Drafting and scheduling content (written, graphic, and video) for social media and email campaigns Assisting with creation of photo/video content for social media Tracking post-performance/engagement metrics, pulling analytics reports, and clipping for social media platforms (Instagram, Facebook, LinkedIn, X, and YouTube) and website (Google Analytics) Updating and managing content calendars across all communication touchpoints (website, emails, social media, and on-site) Assisting with capturing live content from Festival events through phone and digital camera Creating PowerPoint presentations for internal and external use Assisting with execution of Festival events via on-site support Monitoring inbound questions submitted via website contact form and respond directly or routing messages appropriately The Festival welcomes Marketing and Communications interns who wish to focus on a particular specialty (e.g., photography, design, video, social media, website, media monitoring, campaign tracking). Depending on the area(s) of interest and level of expertise, the work can be structured to offer a valuable hands-on learning experience tailored to the intern’s skills and focus. Time Requirements The Festival seeks interns who are available for both Fall and Spring semesters to get the most value and experience during this internship. Interns who can commit to only one semester, either Fall or Spring, are also welcome to apply. Event execution support is subject to the intern’s availability and discretion. Interns are asked to commit to at least one full semester supporting the Festival. Schedule: Fall Semester targeted start date: Monday, September 8, 2025 Fall Semester end date: December 2025, depending upon the intern’s schedule Spring Semester targeted start date: Monday, January 12, 2026 Spring Semester end date: Late April through early May 2026, depending upon the intern’s schedule. The 2026 National Cherry Blossom Festival runs from March 20 – April 12, 2026. September – December 2025: 10 to 15 hours per week between the hours of 10 AM and 5:30 PM, Monday through Friday. Start and end dates are flexible to align with semester schedules and internship academic credit requirements. Hours, schedule, and work format (must be available in-person) are determined in consultation with the Marketing and Communications team and based on student availability. January – June 2026: 10 to 15 hours per week between the hours of 10 AM and 5:30 PM Monday through Friday. Start and end dates are flexible to align with semester schedules and internship academic credit requirements. Hours, schedule, and work format (must be available in-person) are determined in consultation with the Marketing and Communications team and based on student availability. Evening and weekend availability to follow through on executing key Festival programs and events during peak months (March and April). Qualifications: Currently enrolled in an accredited university or college as a full-time undergraduate or graduate student, ideally with a PR/Marketing focus, though not required Passion for strategy, brand, storytelling, content creation, and events Detail oriented and organized with the ability to multi-task Excellent written and verbal communications skills (knowledge of AP Style preferred) Able to work independently and complete projects in a timely manner Ability to collaborate with a variety of people in an exciting, fast-paced environment Canva, Monday.com, social media monitoring software knowledge preferred (e.g. Brandwatch) but not required Photography and videography skills are a plus Compensation National Cherry Blossom Festival, Inc. internships are unpaid, but college credit may be offered depending upon the educational institution’s guidelines and requirements. A monthly stipend is available for interns to defray the cost of commuting to the office. Apply Here Programming & Operations Intern National Cherry Blossom Festival, Inc. is currently seeking Programming and Operations Interns to assist the events team during the Fall 2025 semester with preparations for the upcoming 2026 National Cherry Blossom Festival. Company Description The National Cherry Blossom Festival, Inc., a 501(c)(3) not-for-profit organization based in Washington, DC, is dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts and culture, and build community spirit. Job Description The Programming & Operations Intern(s) contribute to the programmatic development of a variety of National Cherry Blossom Festival signature events including Launch Event & Artwork Reveal, Opening Ceremony, Blossom Kite Festival, Petalpalooza®, National Cherry Blossom Festival Parade®, and the Tidal Basin Welcome Area and Stage. Duties may include: Learn and understand the event management process by participating in programming team meetings, site visits, and other planning meetings with vendors and partners Assist with coordination process and provide onsite assistance for the National Cherry Blossom Festival Launch Event (November 2025) Assist with collecting vendor estimates and related administrative tasks Assist with vetting process of talent for National Cherry Blossom Festival Parade and Petalpalooza Assist with creating production rundown and documents Organize performer and VIP hospitality (e.g. gifts, catering) for a variety of events Research opportunities and execution costs for event entertainment, production, and sponsorship activations for all events Create and manage performer/participant applications Assist with coordinating operations, logistics and engagement with venue representatives Assist with permit tracking, revisions and communicate with local agencies as needed Inventory existing event supplies and develop cost estimates for replenishing items as needed for all events Schedule Fall Semester targeted start date: Monday, September 8, 2025 Fall Semester end date: December 2025, depending upon the intern’s schedule, with potential for extension into the Spring semester 15-20 hours per week between 9:00AM and 5:30PM; 3-4 days per week. Hours and schedule to be determined in consultation with Director of Programming. Qualifications Currently enrolled in an accredited university or college as a full-time undergraduate or graduate student Experience with operations, activity and event management Detail oriented and organized with the ability to multi-task Ability to work with a variety of people and build teamwork Ability to take initiative Capable of doing physical labor (lifting boxes, various event set-up duties, etc.) Comfortable working in both office and outdoor settings (rain, cold, mud, sun, wind, etc.) Computer proficiency in Microsoft Office and GoogleDocs required; familiarity with Slack and Monday.com preferred Compensation National Cherry Blossom Festival, Inc. internships are unpaid, but college credit may be offered depending upon the educational institution’s guidelines and requirements. A monthly stipend is available for interns to defray the cost of commuting to the office. Apply Here Sponsorship Support & Client Experience Intern National Cherry Blossom Festival, Inc ., a 501(c)(3) not-for-profit organization based in Washington, DC, is currently seeking an intern to assist the Business Development & Sponsorship team. Who We Are The National Cherry Blossom Festival, Inc. is a 501(c)(3) not-for-profit organization dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts and culture and build community spirit. Internship Description Fundraising and sponsorships are integral aspects of the National Cherry Blossom Festival, and we are looking for candidates that are interested in learning and gaining experience in corporate sponsorships and experiential marketing for the National Cherry Blossom Festival. This position requires attention to detail, strong communication and organizational skills, and solid computer knowledge. The ideal candidate will be able to work well in a fast-paced, flexible, and energetic environment while maintaining a positive attitude and customer service to external partners. Tasks can include but are not limited to: Administrative support and database management for the Business Development Department Prospecting research and drafting sponsorship proposals, building sponsor recap reports Collaborate with Marketing and Event Operations Departments to execute on-site sponsorship activations Attending and supporting fundraising/stakeholder meetings and events as well as Festival events as it pertains to sponsorship service, activation, and execution Auction solicitation, procurement, and support Support on key Business Development Department projects Time Requirements The Festival seeks interns who are available for both Fall AND Spring semesters to get the most value and experience during this internship. Interns who can commit to only one semester, either Fall or Spring, are also welcome to apply. Event execution support is subject to the intern’s availability and discretion. Interns are asked to commit to at least one full semester supporting the Festival. Schedule Fall Semester targeted start date: Monday, September 8, 2025 Fall Semester end date: December 2025, depending upon the intern’s schedule Spring Semester targeted start date: Monday, January 12, 2026 Spring Semester end date: May 2026, depending upon the intern’s schedule. The 2026 National Cherry Blossom Festival runs from March 20 – April 12, 2026. 15-20 hours per week between 9:00AM and 5:00PM. Hours and schedule to be determined in consultation with the Business Development & Sponsorship Team. Attendance and participation onsite at Festival events; some nights and weekends during the Festival While some of the functions can be performed remotely, interns must be available to meet and work from the NCBF office located in Downtown DC Qualifications Currently enrolled in an accredited university or college as a full-time undergraduate or graduate student Tech Savvy – knowledge of Microsoft Office Suite, Slack and Monday.com Detail oriented and organized with the ability to multi-task Ability to work with a variety of people and build teamwork Ability to work with sensitive and confidential information Effective in-person and remote communication skills Excellent time management and organizational skills Compensation National Cherry Blossom Festival, Inc. internships are unpaid, but college credit may be offered depending upon the educational institution’s guidelines and requirements. A monthly stipend is available for interns to defray the cost of commuting to the office. Apply Here Marketing and Communications Intern National Cherry Blossom Festival, Inc ., a 501(c)(3) not-for-profit organization based in Washington, DC, seeks an energetic, creative, and passionate Marketing & Communications Intern to assist the MarComm team in handling operational aspects such as data tracking, media partner management, and customer service for the 2026 Festival. Who We Are The National Cherry Blossom Festival, Inc. is dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts and culture, and build community spirit. Internship duties may include: Catalogue Festival event collateral Track media partner benefits and ensure fulfillment Monitor and report on e-newsletter performance metrics Tag and organize assets in Monday.com Input media asset values and estimated impressions in Monday.com Serve as a customer service liaison by responding to general inquiries Create recap reports for each media partner Depending on the area(s) of interest and level of expertise, additional opportunities around specialties (photography, design, video, social media, website, media monitoring, campaign tracking) can be structured to offer a valuable hands-on learning experience. Time Requirements The Festival is seeking a Marketing and Communications intern who is available for both Fall AND Spring semester to get the most value and experience during this internship. An intern who wishes to work just one semester, either Fall or Spring, are also welcome to apply. Event execution support is subject to the intern’s availability and discretion. Interns are asked to commit to at least one full semester supporting the Festival. On or about September 8, 2025 – December 19, 2025: 10 to 15 hours per week between the hours of 10 AM and 5:30 PM, – Monday, Wednesday, and Thursday (Tuesday and Friday remote as needed). Evening availability to execute the Festival Launch event (November 2025). Start and end dates are flexible to align with semester schedules and internship academic credit requirements. Hours, schedule, and work format (must be primarily onsite with minimal remote option) are determined in consultation with the Marketing and Communications team and based on student availability. On or about January 5, 2026 – June 30, 2026: 10 to 15 hours per week between the hours of 10 AM and 5:30 PM – Monday, Wednesday, and Thursday (Tuesday and Friday remote as needed). Start and end dates are flexible to align with semester schedules and internship academic credit requirements. Hours, schedule, and work format (virtual and/or onsite) are determined in consultation with the Marketing and Communications team and based on student availability. Evening and weekend availability to execute key Festival weekly programs and events during peak months (March 2026 – April 2026). Qualifications Currently enrolled in an accredited university or college as a full-time undergraduate or graduate student. Recent graduates may also be considered. Passion for strategy, content creation, and events Detail oriented and organized with the ability to multi-task Proficiency in Adobe Acrobat, Microsoft Office applications including Word, Excel and PowerPoint Excellent written and verbal communications skills (knowledge of AP Style preferred) Able to work independently and complete projects in a timely manner Ability to collaborate with a variety of people in an exciting, fast-paced environment Monday.com software knowledge preferred but not required Photography and videography skills are a plus Compensation National Cherry Blossom Festival, Inc. internships are unpaid, but college credit may be offered depending upon the educational institution’s guidelines and requirements. A monthly stipend is available for interns to defray the cost of commuting to the office. Apply Here Community Outreach and Events Intern National Cherry Blossom Festival, Inc ., a 501(c)(3) not-for-profit organization based in Washington, DC, is currently seeking an intern to assist the Business Development & Sponsorship team. Company Description The National Cherry Blossom Festival, Inc. is a 501(c)(3) not-for-profit organization dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts and culture, and build community spirit. Internship Description The Community Outreach & Events intern will contribute to the community-based programmatic development of various National Cherry Blossom Festival activities, including City in Bloom, the Cherry Picks restaurant program, the Hotel Program, Tree Plantings, and other projects as assigned. Duties may include, but are not limited to: Assist with City in Bloom, Cherry Picks, and Hotel Program initiatives, including program execution, research, outreach, distribution of collateral, and supporting materials Assist with Community Program planning and execution Assist with the execution of the Tree Planting program and attend plantings with the Community Partnerships Manager Manage Community Programs inventory and track distribution General Administrative support for the Community Programs department Time Requirements On or before September 8, 2025 through May 2026, with the option to extend into June. 15-20 hours per week between 9:00 AM and 5:00 PM (hours and schedule to be determined in consultation with the Community Partnerships Manager) Attendance and participation onsite at Festival events in September – May; some nights and weekends during the Festival While some of the functions can be performed remotely, the intern candidate must be available to meet and work from the NCBF office located in downtown DC Qualifications Currently enrolled in an accredited university or college as a full-time undergraduate or graduate student Tech Savvy – knowledge of Microsoft Office Suite, Slack, and Monday.com Detail-oriented and organized with the ability to multitask Ability to work with a variety of people and build teamwork Ability to work with sensitive and confidential information Effective in-person and remote communication skills Excellent time management and organizational skills Compensation National Cherry Blossom Festival, Inc. internships are unpaid, but college credit may be offered depending upon the educational institution’s guidelines and requirements. A monthly stipend is available for interns to defray the cost of commuting to the office. Apply Here WE WANT TO HEAR FROM YOU! Do you share our vision of creating diverse and creative programming promoting arts and culture, natural beauty and community spirit? We want to hear from you! CONTACT US TODAY LEADERSHIP CIRCLE SPONSORS The National Cherry Blossom Festival, Inc. is a 501(c)(3) not-for-profit organization dedicated to promoting the beauty of nature and international friendship through year-round programs, events, and educational initiatives that enhance our environment, showcase arts and culture, and build community spirit. ﻿ GET EMAILS FAQ MEDIA PRIVACY POLICY TERMS OF USE JOB OPPORTUNITIES CONTACT US When you use our Website, we or our service providers will assign your browser a unique identification number stored in a file on your computer (“Cookie”) unless you have disabled Cookies on your computer. Cookies identify your browser, but not you personally, to our computers whenever you interact on our Website. We also gather and archive basic Website logging statistics including the daily number of visitors to our Website, originating server locations and server or browser domain names.  You consent to our cookies if you continue to use our website. Accept Privacy Policy Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    }
  ]
}