{
  "fuentes": [
    {
      "url": "https://www.doglegbrewingco.com/",
      "email": "info@doglegbrewingco.com"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    }
  ],
  "mails": [
    "info@communityaccessnaperville.org",
    "info@doglegbrewingco.com"
  ],
  "nombre_sitio": "idyllhoundsbrewingcompany.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.doglegbrewingco.com/",
      "text": "Beer & Golf With Us! Dogleg Brewing Co. BEERS ON TAP BEER CLUB ABOUT ABOUT THE BREWERY WHO WE ARE MEET THE TEAM CAREERS DOGLEG HAPPENINGS EVENTS FOOD TRUCKS & EVENTS GOLFTOBER FEST 9/27 Golf Industry Night Beer Club Exclusive Member Night Customer Appreciation 9/6 GL Collab Beer & Can Release Party BOOK AN EVENT SIMULATOR Book Simulator Ales & Aces Simulator League MERCH Shop Merch GIFT CARDS Get in touch 760-295-0402 info@doglegbrewingco.com WHERE TO FIND DOGLEG BEER VISIT THE TASTING ROOM BEERS ON TAP BEER CLUB ABOUT ABOUT THE BREWERY WHO WE ARE MEET THE TEAM CAREERS DOGLEG HAPPENINGS EVENTS FOOD TRUCKS & EVENTS GOLFTOBER FEST 9/27 Golf Industry Night Beer Club Exclusive Member Night Customer Appreciation 9/6 GL Collab Beer & Can Release Party BOOK AN EVENT SIMULATOR Book Simulator Ales & Aces Simulator League MERCH Shop Merch GIFT CARDS San Diego's First Golf-Inspired Brewery 20 craft beers on tap, seltzers, and na options! More details ﻿ BEERS ON TAP FOOD TRUCKS & EVENTS SPECIAL UPCOMING EVENTS: 8/28 - GRASS LEAGUE COLLAB BEER RELEASE NIGHT 9/27 - GOLFTOBER FEST Pairing up our two favorite pastimes THE BEER & GOLF CONNECTION At the core of it all, we’re passionate craft beer lovers who met through the game of golf. Dogleg Brewing Company celebrates the game that brought us together through exceptional craft beer served up with a fun, engaging tasting room experience. We can’t wait for you to join the fun! LEARN MORE ABOUT US Book The Simulator → Photo By: John Doe Button SHOP DOGLEG GEAR → Photo By: John Doe Button Upcoming Events→ Photo By: John Doe Button Button Button Button Driven by passion. Steeped in tradition. beer st yles for every taste Driven by passion. Steeped in tradition. We brew beer with passion and precision in the pursuit of excellence. Dogleg celebrates the game that united us and the craft that ignited our creative brewing spirit. We offer a diverse and wonderful range of beer styles that cater to a variety of tastes and preferences. From the hoppy and tropical notes of our Dogleg Pale to the roast malt flavors of our Origins Scotch Ale, there is something for everyone to enjoy at Dogleg Brewing Co. BEERS ON TAP Calling craft beer enthusiasts and golf fanatics alike! join the DOGLEG BEER CLUB! Members get access to R&D beer tastings, special events, outings & more. JOIN THE CLUB create your own memorable experience HOST YOUR EVENT AT DOGLEG Whether you’re celebrating a milestone event, planning a holiday party for your staff, hosting a corporate hoppy hour or looking to wow your clients, Dogleg Brewing Company offers a wide variety of private events packages both large and small. PLAN YOUR EVENT follow Us! Visit The Tasting Room ﻿ 1347 Keystone Way, Suite A Vista, CA 92081 760-295-0402 Tasting Room Hours ﻿ Sunday 12:00 pm - 7:00 pm Monday 3:00 pm - 8:00 pm Tue - Wed 3:00 pm - 9:00 pm Thu - Sat 12:00 pm - 9:00 pm *Tasting room hours vary during holidays - check events page © 2025 All Rights Reserved | Dog Leg Brewing Company | Website Design by GoBeRewarded Share by:"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join us at our Annual Fall Fundraiser! Click here for details. Click here to make an online donation Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Brenda Hasler, Operations Director Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Gia Hanrahan, Intern Coordinator & Program Leader Sarah VanStedum, Program Leader Dawn Callahan, Program Leader Andrew Zelasko, Program Leader Diana Chrostowski, Community Relations Coordinator Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Delani Kosner, Program Assistant Joseph Kim, Program Assistant Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    }
  ]
}