{
  "fuentes": [
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "email": "info@rivervillegrill.com"
    },
    {
      "url": "https://kaneffgolf.com/golf/courses/lionhead/iggys/",
      "email": "fbservice@golflionhead.com"
    },
    {
      "url": "https://kaneffgolf.com/golf/courses/lionhead/iggys/",
      "email": "iggysmanager@golflionhead.com"
    },
    {
      "url": "https://kaneffgolf.com/golf/courses/lionhead/iggys/",
      "email": "sales@kaneffgolf.com"
    }
  ],
  "mails": [
    "fbservice@golflionhead.com",
    "iggysmanager@golflionhead.com",
    "info@rivervillegrill.com",
    "sales@kaneffgolf.com"
  ],
  "nombre_sitio": "iggysgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://rivervillegrill.com/contact-us/",
      "text": "Contact Us - Riverville Bar & Grill Skip to content Our location (608) 424-0020 Menu Menu Our location (608) 424-0020 Get in touch We’d love to hear from you. Here’s how you can reach us! Call us! Want to make a reservation or have a question? (608) 424-0020 Have a question? Fill out my online form . Copyright 2025 © Riverville Bar & Grill Design & Development: Accent Graphix Design Studio Home Browse our Menu Mexican Specials Menu Gallery Contact Us #image_title ×"
    },
    {
      "url": "https://kaneffgolf.com/golf/courses/lionhead/iggys/",
      "text": "Iggy's – KaneffGolf Skip to content Home Contact KANEFF KLUB Buy Gift Cards Home Contact KANEFF KLUB Buy Gift Cards Golf Weddings Social Events Meetings & Conferences Golf Weddings Social Events Meetings & Conferences Home Golf Courses Book a Tee Time Green Fees Special Offers Buy Gift Cards Tournaments Memberships Kaneff Klub Weddings Venues Menus Rates FAQs Plan an Event Social Events Venues Menus Rates FAQs Plan an Event Meetings & Conferences Contact Courses Book a Tee Time Green Fees Special Offers Tournaments Memberships Courses Book a Tee Time Green Fees Special Offers Tournaments Memberships Book your Tee Time today and save! Learn More BOOK NOW A Refreshingly Modern Take on the Traditional Golf Menu Iggy’s is a 184 seat restaurant designed to focus on comfort, style, and culinary craft. Our team is always working on new and interesting ways to impress our guests. Innovation, teamwork, and hospitality are all part of the DNA here at Iggy’s – the key ingredients to our success! View Menu Connect with Us Have questions? The Iggy’s team is here to answer them. Sue Saad Iggy’s Manager iggysmanager@golflionhead.com 905-455-9095 8525 Mississauga Road Brampton L6Y 0C1 Hours of operation vary based on daily golf traffic. Please call ahead for most accurate daily hours. *Open during golf season only. Our Menu The perfect ending to any round: Iggy’s Grill Bar Patio Download Menu Menu Coming Soon Let’s Get Social @IggysLionhead iggyslionhead View Instagram post by iggyslionhead Jun 27 Open post by iggyslionhead with ID 18085091230706292 iggyslionhead View Instagram post by iggyslionhead Jun 13 Open post by iggyslionhead with ID 17975340908891176 iggyslionhead View Instagram post by iggyslionhead Apr 23 Open post by iggyslionhead with ID 17911516974067381 Facebook Instagram Join our Mailing List Special promotions, insider info, and stuff you need to know. Δ Email (Required) LinkedIn This field is for validation purposes and should be left unchanged. Instagram Facebook Youtube Linkedin Discover Kaneff Golf Book a Tee Time Gift Cards Kaneff Klub Gold Corporate Membership Kaneff Rewards Golf Academy Leagues Golf Etiquette Learn More Our Story Ignat Kaneff Charitable Foundation Iggy’s Grill Bar Patio Careers Contact Us The Courses Lionhead Golf Club & Conference Centre Brampton  | 905-455-4900 Carlisle Golf & Country Club Carlisle  | 1-800-661-4343 Royal Ontario Golf Club Milton  | 905-693-9966 Royal Niagara Golf Club Niagara-on-the-Lake  | 1-866-769-2518 Century Pines Golf Club Troy  | 1-866-388-5688 KANEFF GOLF 8525 Mississauga Road Brampton, Ontario L6Y 0C1 905-455-8700 sales@kaneffgolf.com Discover Kaneff Golf Book a Tee Time Gift Cards Kaneff Klub Gold Corporate Membership Kaneff Rewards Golf Academy Leagues Golf Etiquette Learn More Our Story Ignat Kaneff Charitable Foundation Iggy’s Grill Bar Patio Careers Contact Us The Courses Lionhead Golf Club & Conference Centre Brampton  | 905-455-4900 Royal Ontario Golf Club Milton  | 905-693-9966 Carlisle Golf & Country Club Carlisle  | 1-800-661-4343 Century Pines Golf Club Troy  | 1-866-388-5688 Royal Niagara Golf Club Niagara-on-the-Lake  | 1-866-769-2518 © 2025 Kaneff Golf. All rights reserved. Privacy | Accessibility One day only at Lionhead Free S2G Adidas Shoes August 5, 2025 With Round of Golf Book Now Lionhead Pickleball is HERE! Call the Pro Shop to book your time! 905.455.4900 COMING \nSOON! Pickleball Court\nat Lionhead SPECIAL OFFER Father's Day Weekend 25% Off All Soft Goods in our Pro Shops Valid Weekend of June 14th to 15th only. Items will vary from each Pro Shop. Some exclusions may apply. THE PERFECT Father's Day Gift A ROUND OF GOLF & A PAIR OF ADIDAS S2G SHOES! Get it now! SOLD OUT! Lionhead Spring\nInvitational Tournament April 27th, 2025 Open to the Public • 36 Teams available View Details"
    }
  ]
}