{
  "fuentes": [
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "bloomingdale@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "bradenton@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "brandon@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "clearwater@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "gulfport@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "largo@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "pinellasbeaches@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "sarasota@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "seminoleheights@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "southtampa@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "stpete@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "tiffany.razzano@patch.com"
    },
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "email": "u003edaniel@westcoastflowplumbing.com"
    },
    {
      "url": "https://focuslab.agency/work/cahoots",
      "email": "cahoots-process-04@1x.jpg"
    },
    {
      "url": "https://focuslab.agency/work/cahoots",
      "email": "cahoots-process-12@1x.jpg"
    },
    {
      "url": "https://members.cahoots.com/about",
      "email": "in@cahoots.com"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "email": "cafe@cahoots.com"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "email": "in@cahoots.be"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "email": "in@cahoots.com"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "email": "members@cahoots.com"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "email": "michelle@cahoots.com"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "email": "quin@cahoots.com"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "email": "tyler@cahoots.com"
    },
    {
      "url": "https://www.inncahoots.com/contact",
      "email": "mischief@inncahoots.com"
    },
    {
      "url": "https://www.inncahoots.com/contact",
      "email": "stay@inncahoots.com"
    }
  ],
  "mails": [
    "bloomingdale@patch.com",
    "bradenton@patch.com",
    "brandon@patch.com",
    "cafe@cahoots.com",
    "cahoots-process-04@1x.jpg",
    "cahoots-process-12@1x.jpg",
    "clearwater@patch.com",
    "gulfport@patch.com",
    "in@cahoots.be",
    "in@cahoots.com",
    "largo@patch.com",
    "members@cahoots.com",
    "michelle@cahoots.com",
    "mischief@inncahoots.com",
    "pinellasbeaches@patch.com",
    "quin@cahoots.com",
    "sarasota@patch.com",
    "seminoleheights@patch.com",
    "southtampa@patch.com",
    "stay@inncahoots.com",
    "stpete@patch.com",
    "tiffany.razzano@patch.com",
    "tyler@cahoots.com",
    "u003edaniel@westcoastflowplumbing.com"
  ],
  "nombre_sitio": "incahootspub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://patch.com/florida/bradenton/in-cahoots-has-a-bit-of-everything",
      "text": "In Cahoots Has a Bit of Everything | Bradenton, FL Patch Skip to main content Bradenton, FL Subscribe News Feed Events Local Businesses Classifieds Post Advertise Nearby Sarasota News Gulfport News St. Pete News Bloomingdale-Riverview News Tampa News Pinellas Beaches News Largo News Brandon News Clearwater News Seminole Heights News Local News Community Corner Crime & Safety Politics & Government Schools Traffic & Transit Obituaries Personal Finance Neighbor News Best Of Seasonal & Holidays Weather Arts & Entertainment Business & Tech Health & Wellness Home & Garden Sports Travel Kids & Family Pets Restaurants & Bars Real Estate Events Local Businesses Classifieds See all communities Advertise Promote on Patch In partnership with Nearby Communities Sarasota, FL Gulfport, FL St. Pete, FL Bloomingdale-Riverview, FL Tampa, FL Pinellas Beaches, FL Largo, FL Brandon, FL Clearwater, FL Seminole Heights, FL State Edition Florida National Edition Top National News See All Communities Thank you to our Local Business Sponsor: West Coast Flow In partnership with This post was contributed by a community member. The views expressed here are the author's own. Business & Tech In Cahoots Has a Bit of Everything NFL Sunday Ticket, pool, and an awesome beer selection. But karaoke is its thing at night. Tim W. McCann , Neighbor Posted Tue, Aug  23, 2011 at 10:07 pm ET | Updated Wed, Aug  24, 2011 at 3:11 pm ET On the outside, nothing seemed all that special about , 5917 Manatee Ave. W. #509. It’s not a stand-alone bar in a distinct building but one of about a dozen tenants in Pebble Springs Plaza on Manatee Avenue West. Its bright red sign glows enticingly at night, but from the parking lot on a recent Saturday evening, all appeared quiet. Inside it was different. For a small bar, In Cahoots packs in a little bit of everything in a way that isn’t overdoing it. Find out what's happening in Bradenton for free with the latest updates from Patch. Subscribe At the karaoke/DJ booth, Mike Bliss was just taking his post in front of an already lively crowd. He handled the first couple songs, but it didn't take long before the microphone was handed off to the first in a steady string of wannabe rock stars belting out their renditions of “Babby Got Back,” “Cupid Shuffle” and other songs that tend to get stuck in your head for days. “It’s a hole in the wall with a lot in it,” said Bliss, who’s a regular barfly when he’s not running karaoke. Find out what's happening in Bradenton for free with the latest updates from Patch. Subscribe Karaoke is the main attraction at In Cahoots. It starts around 10 p.m. every Tuesday and Thursday through Saturday nights. But karaoke isn't the only feature In Cahoots has to offer. Other entertainment options include video games, a couple of pool tables and a dozen flat screen televisions anchored throughout the place. In Cahoots has the NFL Sunday Ticket, so, football fans, this is the place to be for this season's games. If all the entertainment you require on a weekend night is a seat at the bar with plenty of options, In Cahoots won't disappoint. It's a full liquor bar, serves wine and has plenty of beer in stock including the popular domestics and about 20 imports, crafts and ciders. Killians is the house beer: $1.25 all day everyday. Paulie Kochanowski, another In Cahoots regular known as Uncle Paulie, said he first visited about a decade ago when the new owners took over and changed it from “just a beer bar” to a vibrant little joint that appeals to everyone. “It’s a younger crowd but older people like me like the atmosphere,” Kochanowski said. “It seems like a good mix of people. There are never any fights.” Bliss, who's known as \"Hopper\" at In Cahoots, said that’s why he’s a regular. “There is never a bouncer here and that can mean one of two things about a bar,” he said. “Either the owners don’t care or the bar is a place where there are never any fights and the people take care of their own. And, here, it’s the latter.” In Cahoots makes good use of the space it has. One corner of the bar called the “Wing Barn” with faux bricks and wooden posts took on an Old West style while, in the opposite corner, club lighting bounced off photos of rock stars like AC/DC and Aerosmith. And, somehow, it blends together wonderfully like Captain with Coke. Happy hour starts as soon as the bar opens and runs until 7 p.m. on weekdays. On Saturday and Sunday happy hour is from noon until 5 p.m. Thursday night specials include $2.50 margaritas and $3 tequila shots and hospitality nights ($4 pitchers and $2 wells) are 10 p.m. Sunday through Tuesday. The bar has a kitchen and a light menu. To go orders are also available. It’s not a restaurant, though, so smoking is permitted. IF YOU GO In Cahoots is open Monday through Saturday from noon until 2:30 a.m. and the kitchen is open from noon until 1 a.m. On Sunday In Cahoots is open from noon until midnight. Call them at (941) 794-1141. Share The views expressed in this post are the author's own. Want to post on Patch? Register for a user account. More from Bradenton Schools | 2d SCF’s 9/11 Memorial Ceremony to Pay Tribute to the Lives Lost Crime & Safety | 2d Man Charged With Murder After Argument Leads To Fatal Stabbing In Bradenton: Manatee County Sheriff Schools | 4d Local cheerleaders win All-American status Featured Events Sep 27, 2025 Earlybird Registration Open for Sunshine Music Camp in September + Add your event Featured Businesses West Coast Flow Top Lakewood Ranch Plumber - 10% Off New Customers! CC STYLING STUDIO $200 off Permanent Makeup and scalp micro pigmentation DryPro, Inc. Lakewood Ranch's Most Trusted Restoration Company! + Promote your business Featured Classifieds + Add your classified Latest News Nearby Tampa, FL News Peak Hurricane Season In FL: See Latest Forecast For Potential Storms Sarasota, FL News Man Gets 8 Life Sentences For Rape, Kidnapping Charges: FL Officials Tampa, FL News Tampa Bay Rays' Wander Franco Has Been Detained And Admitted To Mental Health Clinic Tampa, FL News First FL Sales Tax Holiday On Guns, Ammunition Under Way Miami, FL News Major Home Retailer To Shutter 2 FL Stores This Month Find out what’s happening in your community on the Patch app Corporate Info About Patch Careers Partnerships Advertise on Patch Support FAQs Contact Patch Community Guidelines Posting Instructions Terms of Use Privacy Policy © 2025 Patch Media. All Rights Reserved."
    },
    {
      "url": "https://focuslab.agency/work/cahoots",
      "text": "Cahoots Brand Strategy & Web Design | Focus Lab® Work Services Testimonials Blog Categories All Brand Strategy Culture Leadership Mergers & Acquisitions Monthly Retainer News and Updates Processes Verbal Identity Visual Identity Web Design Videos 10 Minutes On Brand In Conversation The Debrief About Contact Work Services Testimonials Blog About Contact Cahoots Services Provided Brand Strategy Visual Identity Web Design Cahoots nestled right into our wheelhouse. A dynamic co-working space attracting entrepreneurs, tinkerers, and creatives in the tech hub of Ann Arbor, Michigan. They wanted a lifestyle brand—a complete ecosystem of brand visuals and assets that could be worn, posted, shared, and nodded at by others in the know. The challenge was capturing their collaborative ethos by creating these individual touchpoints in a way that felt and behaved like a cohesive system. We worked with Cahoots to design a website to accommodate the virtual community, welcoming both new and established members with the same energy and agility as the physical spaces. Our Approach We wanted to show that Cahoots is far more than a desk set-up and a water cooler: it’s a movement. To capture that exclusive feeling, we designed brand elements that feel like secret handshakes to the target audience. The “++” mark, for instance, echoes C++ programming language. And Ann Arborites recognize the “A2” design we created as a mark of their own tribe. Steeped in history and a sense of place, the brand system and website grew around a modern industrial vibe that feels familiar to locals. Visual Identity With concepting rounds and strategy blessed by the client, the brand architecting and visual refinement could begin. We chose the typeface Knockout, for its nine-width, four-weight, situational type approach. Using the Knockout family afforded the functional benefits of a unified system and the visual appeal of individually designed styles. In designing collateral and marketing materials, we strayed far and wide—imagining all the interactive elements for the site and the physical applications: buttons, hats, shirts, pennants. Cahoots even had a massive, branded flag made, which we borrowed to supplement their custom photography, videography, and motion for the website. I have hired more consultants and outside partners than I can count and expectations are rarely met. Focus Lab exceeded in every conceivable way. They functioned as an extension of our team and took the time to really get to know us. Joe Malcoun, Co-founder, Cahoots Web Design We chose minimalism in site structure, as it needed to come across like more of a branded journey than an information heap. While the look and feel mirrored elements created during the branding phase, the use of motion and transitions helped to focus the user on exploration, directing them ultimately towards a clear call to action. The site leverages interactive elements as backdrops to bring primary content to the forefront. Not only did we have a ton of fun with the Focus Lab team, they also took great care with our brand needs. They were so open to our feedback that I always felt completely comfortable voicing concerns. Oh… and the designs they delivered were insanely kick-ass! Joe Malcoun, Co-founder, Cahoots Post-Project Success In the news Tech-Enabling a Software-Focused Coworking Space: Cahoots Case Study Read the next case study StoryBots We’d love to hear about your brand and business challenges, even if you’re not sure what your next step is. No pitch, no strings attached. Let's talk Work Salesloft Fabricators & Manufacturers Association Zuora See all Company About Contact Careers Early-Stage Blog The Future of Brand and User Experience How to Build Brand and Product in Tandem See all Clients Press Testimonials Client List Is your brand holding you back? Take our 2 minute brand assessment quiz. Sign up for our (Occasional) newsletter Brand First. Brand Forever. © 2010–2025 Focus Lab Privacy Policy"
    },
    {
      "url": "https://members.cahoots.com/about",
      "text": "Okay, got it! No Yes"
    },
    {
      "url": "https://cahoots.com/field-guide",
      "text": "Field Guide — Cahoots 0 Skip to Content About Our Story Gallery Location Blog Coworking Pricing and Plans Day Pass Health Club For Students For Remote Workers For Entrepreneurs & Teams Events Calendar of Events Event Venue Events Gallery Programming Cafe Book a Tour Contact Open Menu Close Menu About Our Story Gallery Location Blog Coworking Pricing and Plans Day Pass Health Club For Students For Remote Workers For Entrepreneurs & Teams Events Calendar of Events Event Venue Events Gallery Programming Cafe Book a Tour Contact Open Menu Close Menu Folder: About Back Our Story Gallery Location Blog Folder: Coworking Back Pricing and Plans Day Pass Health Club For Students For Remote Workers For Entrepreneurs & Teams Folder: Events Back Calendar of Events Event Venue Events Gallery Programming Cafe Book a Tour Contact Field Guide WELCOME, you are now in Cahoots Cahoots is a uniquely inspiring tech hub designed to help our members and community thrive. We are founders, builders, creators, fixers, investors, and neighborly folks. Cahoots started in 2015 when our founders Guy Suter, Lindsay Snider, Ian Berry and Joe Malcoun came across these three historic buildings in downtown Ann Arbor. They then crafted a mission to create a central location for Michigan’s tech scene, and to give our community an affordable downtown option for tech entrepreneurs to work and grow their business. Demolition began in 2016, with a strong focus on retaining the unique features of these historic buildings while also modernizing them. We officially opened in October 2019. We believe in the intangibles: A supportive work environment that encourages diversity and encourages innovation You can be yourself here We aim to foster genuine friendships and connections We are here to support you doing hard things - in business, work and life This is your place, too Using the Space Cahoots Building Hours Our building is 24/7. You can cowork anytime day or night within your membership level. The building is always accessible to you using a physical keycard or phone app. Monday-Friday: The front door unlocks with the Cafe Hours. Use your keycard after hours. Saturday/Sunday: The front door is unlocked during cafe hours on Saturday (8am-4pm) and Sunday (9am-3pm). Be In Cahoots App This is our membership management tool that you have been invited to download. You can download the ‘Be In Cahoots’ app, or use members.cahoots.com . You can do the following things by logging into the app: Book Conference Rooms: book a conference room, see the conference room calendar, & edit bookings. Register Guests: When you know a guest is coming, please register them in the Cahoots app. View and Pay Invoices: You can see membership options and access billing through the app. Kitchen Cohabitation Clean up after yourself. Occasionally, be a good neighbor and clean up someone else’s mess, too. Put dirty dishes in the dishwasher, and look for the clean/dirty magnet to note the dishwasher’s status. If the dishwasher is clean and you have a minute, unload it and help out your fellow coworkers. Label your refrigerated food or it becomes community property, and don’t leave food lingering there for more than a week. We empty the fridges the last Friday of the month. Share with your friends. Add to the stash. Bring snacks to share. Be the doughnut fairy on occasion. Please be respectful about your conference and phone room bookings. Do not use rooms as your private office, and if you book a room, make sure you use it. Remember that we share the space with 200+ people! Conference Rooms & Phone Rooms We have several conference rooms and phone rooms for you to use. They are all bookable in the Be In Cahoots app, and we have five phone rooms that are non-bookable and first come first serve. Please leave conference/phone rooms ready for the next group to come in and get to work. This means: Wiping down the whiteboard before you leave Putting pens, markers, remotes back in the caddy Taking all trash with you when you leave If you move furniture, plants, etc, put them back where they were when you came into the room Phone Etiquette For phone and Zoom calls where you are heavily involved, find a phone room or conference room to take calls. If you are able to monitor your volume you are welcome to take calls from your desk. Phone rooms, breakout spaces and small conference rooms all work well for calls. Guests When you invite guests to the space, you are expected to greet them in the lobby. If you are not present, a member of the cafe will send you a Slack message to let you know someone is here for you. We do not let guests into the workspace for security reasons. Guests are people coming to meet with you in the space, not those coming to work independently of you - the latter needs to book a day pass . Dog Policy Cahoots is dog-friendly for polite, clean, well-behaved pups. Before bringing in your dog, please check with your neighbors to make sure no one is allergic or would prefer a dog free work zone. Please make sure that your dog: Uses its indoor voice and outdoor bathroom. Is gentle and loving to both humans and other dogs. Brings a bed, pillow or blanket to lie on. Makes every effort to not wander while their owner is coworking. Says hello to Team Cahoots! If any dog growls at, nips, bites, or lunges at any other dog or human member they will be asked to stay at home. If any member has severe allergies to dogs, all canine memberships will be suspended. You are entirely and completely responsible for anything your dog does while at Cahoots. This may include directly or indirectly injuring someone or destroying or soiling Cahoots property. Remember, dogs are visitors, not daily commuters, and they should not distract from members’ ability to work. GETTING AROUND THE SPACE Cahoots is made up of three historic buildings renovated together and representing 24,000sqft. The office building closest to Fourth St is called 202, and building furthest from Fourth St is 210. The building in the middle serves as the connector and place for people to meet in the middle, through the cafe and event space on the first floor, and the main kitchen on the second floor. You can download and reference our map at any time to orient yourself to the space and find the room you are looking for. Printing & Scanning Printing and scanning is included with your Cahoots membership. To use the network printers, first make sure you are connected to the Cahoots wifi. If you are connected to Cahoots Cafe & Events wifi, printing will not work. Then, connect to the printer of your choice (see our map to locate a printing station). 1st Floor, near the back of the part time space: Xerox VersaLink C405 (64:cc:16) (10993) 2nd Floor in the upstairs printing station in the back corner to the far right of the kitchen: Xerox VersaLink C405 (64:cb:d3) (43366) 2nd Floor next to Ad Adapted: HP OfficeJet Pro 8020 series [7DD5DA] To connect with a Mac: Go to Settings > Printers & Scanners Click “Add Printer, Scanner, or Fax” Select one of the two printers above and click “Add” To Connect with a PC: Select Start > Go to settings Select bluetooth & devices > printers & scanners Go to Add Device, select one of the two printers above, and add If you experience an error adding the printer, you may need to manually install the driver for the printer. This happens with some devices like the Microsoft Surface. First, install the Xerox Smart Start Driver Installer at this link here , and select the appropriate download for your device. If you cannot locate the printer, select the general driver for the Xerox C405 printer, and then go back and try adding it again under your printer settings. To Scan: The Xerox C405 printers include the option to scan your documents and send them as a PDF to your email. Go to Home > Scan To > Email > Enter your email > Select the appropriate settings. Be sure to scroll down and select “2-sided Scanning” if your document is double sided. Then you should be able to load your documents at the top of the printer and push “Scan” in the top right corner. Social Events We host a variety of member events that are often free and open to anyone, with the intention of bringing people together to socialize, learn and grow. These events are generally held in our event space or lobby, and we announce them in Slack, in our newsletter, and around the space. The Community Member Hosted Events Members are  encouraged to host events! Want to sponsor a ping pong tournament, or host lunch? Get in touch with a member of Team Cahoots and we will help you make it happen. Coworking spaces are unique in the way that they enable you to work closely to others without working necessarily on the same team as them. Cahoots attracts a diverse crowd of people, many of which come here specifically to engage with the tech and entrepreneur community. Community is built when one person bridges the gap - be the first one to say hello in the kitchen. Compliment someone's shoes. Pet someone's dog. When you need help - ask. There is a large group of people who are here because they want these interactions. Slack network Much of our communication, important announcements and jokes alike, happens in our Cahoots Slack workplace. This is the best place to get questions answered, get in touch with Team Cahoots quickly, and even find a lunch buddy. Meet the Team Tyler Sharette General Manager Ty has a background in creative and operational leadership, thriving at the intersection of strategic vision setting and building actionable gameplans that move the business forward. He’s passionate about bringing people together, simplifying the complex, and providing an exceptional service to the community. When he’s not steering the ship at Cahoots, you’ll find him consulting with local entrepreneu rs , exploring the town with his wife and two daughters, flipping through vinyl records, cheering on the Lions, or relaxing around a campfire. Email Me Quin Mentzer Community Coordinator Quin's background is in customer service, with a natural ability to make people feel supported and connected. An Enneagram 9, she thrives on helping others and creating a welcoming environment. At Cahoots, Quin loves taking on new challenges and finding creative ways to elevate the coworking experience. Outside of work, you’ll find her hiking with her dog, renovating her home with her husband, or getting lost in the latest psychological thriller at the library. Email Me Grace Higgins Cafe Manager Grace is a former pastry chef with a long career in the restaurant industry. She is passionate about supporting local businesses and sourcing the best ingredients available. She dreams of one day opening her own coffee and pastry shop. When Grace isn’t working you might find her at the farmer’s market, the lake, or working on developing her own recipes at home. Email Me Michelle Brittain Michelle brings a background in purchasing, project management, and operations. With a strong passion for customer success, systems, and organization, she is delighted to join the Cahoots team. During her free time, she enjoys adventuring outside, traveling, exploring museums, and painting. email me Kevin Bonner Mr. Fix-it Kevin is our tech guru and problem-solving extraordinaire. With extensive experience in IT, he's the go-to person for all things technical. From troubleshooting software issues to setting up networks, Kevin is our go-to guy when there's something to be fixed. When he's not being the most helpful guy around, he's playing Mario Kart in the diag, having a beer on a patio, or riding his bike around town. Reach out to Team Cahoots Not sure who to reach out to? Send an email to [email protected] to reach all our admin team and we will handle it from there! Email Us Partners | Conference Room Rental | Health Club | Cafe | Field Guide | Privacy Policy ©2025 Cahoots - All rights reserved"
    },
    {
      "url": "https://www.inncahoots.com/contact",
      "text": "Contact Us | Inn Cahoots Home Hotel Suites Event Spaces Rooftop Event Space Austin Garden Event Space Bar Mischief Event Space The Secret Garden Studio Event Space Units 1-3 Atrium Public Bars Austin Garden & Studio IYKYK Bar Mischief Specialty Groups Bachelor & Bachelorette Parties Marketing Activations Corporate Parties & Retreats Family & Retreats Private Dining Film &Â Music Weddings mischief@inncahoots.com 512.943.2175 Hotel Suites Public Bars Event Spaces Link One Link Two Link Three Link Four Link Four Link Four Link Four Link Close Book BookÂ Stay Book Event Book Tour Home Hotel Suites EVENTÂ SPACES Unit 1 - 3 Event Space Bar Mischief The Secret Garden Atrium Austin Garden The Rooftop Event Space Studio Event Space Public Bars The Rooftop Austin Garden &Â Studio Bar Mischief Specialty Groups Bachelor & Bachelorette Parties Film &Â Music Corporate Parties &Â Retreats Marketing Activations Family &Â Religious Retreats Weddings Private Dining BOOKÂ STAY BOOKÂ EVENT Contact us Get in touch with us by reaching out via email, phone, or using the contact form below. Get in touch stay@inncahoots.com 512 943 2175 1221 E 6th St, Austin, TX 78702, United States Name Email Message Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. ONCE YOUâRE IN, YOUâRE INN ;) Sign up for secret codes, special events, and more. Subscribe Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. MAINÂ MENU Home Hotel Suites Contact Event Spaces Studio Rooftop Austin Garden Bar Mischief Public Bars Austin Garden & Studio IYKYK Bar Mischief Specialty Groups Bachelor & Bachelorette Parties Corporate Parties & Retreats Marketing Activations Social & Family Retreats Private Dining Film & Music Weddings Other Refund Policy Privacy Policy Terms of Service Event terms Contact mischief@inncahoots.com 512.943.2175 512.943.2175 1221 E 6th St, Austin, TX 78702, United States"
    }
  ]
}