{
  "fuentes": [
    {
      "url": "https://www.sos.state.tx.us/corp/nonprofitfaqs.shtml",
      "email": "corpcert@sos.texas.gov"
    },
    {
      "url": "https://www.sos.state.tx.us/corp/nonprofitfaqs.shtml",
      "email": "exempt.orgs@cpa.texas.gov"
    },
    {
      "url": "https://www.irffb.com/contact-us",
      "email": "info@irffb.com"
    },
    {
      "url": "https://fiha.us/contact/",
      "email": "info@fiha.us"
    },
    {
      "url": "https://www.501c3.org/who-really-owns-a-nonprofit/",
      "email": "gkctheatre@yahoo.com"
    },
    {
      "url": "https://www.amerilawyer.com/fl_501c3corporation.htm",
      "email": "info@amerilawyer.com"
    }
  ],
  "mails": [
    "corpcert@sos.texas.gov",
    "exempt.orgs@cpa.texas.gov",
    "gkctheatre@yahoo.com",
    "info@amerilawyer.com",
    "info@fiha.us",
    "info@irffb.com"
  ],
  "nombre_sitio": "indianhorizonfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.sos.state.tx.us/corp/nonprofitfaqs.shtml",
      "text": "Nonprofit Organizations FAQs Skip to Main Content Apostille/Authentication services available by appointment on Tuesdays and Fridays starting August 5. EFFECTIVE SEPTEMBER 1, 2023, OUR LOBBY WALK-IN HOURS WILL BE 9 A.M. - 4 P.M. (CENTRAL), MONDAY - FRIDAY. Media | Site Map | Help | Contact | Website Survey | En Español Search for this: Menu About SOS About the Office Secretary of State Biography Deputy Secretary of State Biography Press Releases History of the Office Constitutional Duties Employment Opportunities SOS Modernization Program Procurement Opportunities Publications Contact Us Elections & Voting VoteTexas.gov - Voter Information Voter Registration Resources Conducting Elections Candidate Information Officials and Officeholders Election Results Audit Program Training and Educational Resources Election Funds Management Forms, Resources and Legal Library Voting Systems Frequently Asked Questions (FAQS) Contact Us Business Services SOSDirect: Business Searches & Formations Business Forms Filing Options Fee Schedule Copies and Certificates Registered Agents Uniform Commercial Code Trademarks Service of Process Texas Business Law Frequently Asked Questions (FAQs) Contact Us Notary & Apostilles Notary Public Apostilles/Authentication of Documents Notary Complaints Frequently Asked Questions (FAQS) Contact Us Rules & Meetings Texas Register Texas Administrative Code Open Meetings Subscription Services Rule Transfers and Agency Name Changes Liaison General Info Liaison Login Other Resources Frequently Asked Questions (FAQs) Contact Us International Relations International Affairs Foreign  Consulates in Texas Texas Border & Mexican Affairs Border Governor's Conference Work Groups & Reports Notario Publico? Apostilles/Authentication of Documents Links of Interest Contact Us Forms & Other Services Forms Legislative Bills NEW : Data Brokers Credit Services Organizations State Seal of Texas Athlete Agents Health Spas FAQs For Other Services Contact Us Nonprofit Organizations FAQs Other FAQs Formation of Texas Entities Amendments and Corrections Name Filings Mergers and Conversions Terminations and Reinstatements Foreign or Out-of-State Entities Nonprofit Organizations Management and Ownership Registered Agents Home or Property Owners' Assns. Business Organizations Code Filing & Other General Questions SOSDirect Trademarks Service of Process Information The answers to our Frequently Asked Questions are provided for informational purposes and are not intended to provide legal advice or to substitute for the advice of an attorney. If you have specific legal questions, consult your attorney. You may also wish to review our other FAQs for answers to frequently asked questions related to filing issues such as amending or correcting a filing, assumed name and name registration and reservation filings, name changes, and withdrawal and termination. FAQs for Nonprofit Corporations FAQs for Unincorporated Nonprofit Associations FAQs for Nonprofit Corporation Periodic Reports FAQs for Nonprofit Corporations What is a nonprofit corporation? Is a nonprofit corporation a tax-exempt entity?  If not, how do I become tax-exempt? How do I form a “501(c)(3)” corporation? I’m filing a certificate of formation for a nonprofit corporation, and I have to decide whether the corporation will have members.  What is a member? Can one person be the sole director and officer of a nonprofit corporation? Can a nonprofit corporation pay a salary to its officers, directors and/or employees? Can a nonprofit corporation give political contributions? Who has authority to investigate the activities of a nonprofit corporation? Are the books and records of a nonprofit corporation available for inspection? Can I obtain a copy of a nonprofit corporation’s IRS Form 990 from the secretary of state? Does a foreign nonprofit corporation have to register to transact business in Texas if its only contact with the state is solicitation of funds or donations? How can I obtain a copy of the bylaws, tax exempt filings or other documents for a nonprofit organization? What is a nonprofit corporation? A “nonprofit corporation” is a corporation no part of the income of  which is distributable to members, directors, or officers. A nonprofit  corporation is created by filing a certificate of formation with the secretary  of state. See Form 202  ( Word 152kb , PDF 142kb ). A  nonprofit corporation may be created for any lawful purpose, which purpose must  be stated in its certificate of formation. Is a nonprofit corporation a tax-exempt entity?  If not, how do I become tax-exempt? A Texas nonprofit organization—whether a corporation or an unincorporated association—is not automatically exempt from federal or state taxes. To become exempt, the organization must meet certain   requirements and apply with both the IRS and the Texas Comptroller of Public Accounts. To learn more about the rules and procedures for obtaining federal tax-exempt status, read IRS Publication 557 ,   “ Tax-Exempt Status for Your Organization .”  Questions about federal tax-exempt status can be directed to: IRS Exempt Organizations Section (877) 829-5500 To learn more about the rules and procedures for obtaining state tax-exempt status, read the FAQs published by the Texas Comptroller of Public Accounts.  Exemption from Texas state taxes is determined by the Texas Comptroller of Public Accounts. Questions about state tax-exempt status can be directed to: Texas Comptroller of Public Accounts Exempt Organizations Section (800) 252-5555 or (512) 463-4600 email How do I form a “501(c)(3)” corporation? The designation “501(c)(3)” refers to a specific federal tax provision  only. If you need information regarding a federal tax provision or a tax  provision impacts your certificate of formation, you should contact your own  tax counsel, attorney, or the IRS . The secretary of state’s Form 202 meets minimum state law requirements but does not include any additional statements  that the IRS might require for tax-exempt status. I’m filing a certificate of formation for a nonprofit corporation, and I have to decide whether the corporation will have members.  What is a member? Many nonprofits use the term “member”  synonymously with “supporter” or “donor.”  Separate from this fundraising use, however, the Texas Business  Organizations Code provides for a nonprofit corporation with a formal  membership structure.  Pursuant to  section 1.002(53) of the Texas Business Organizations Code, a “member” of a nonprofit corporation  is “a person who has membership rights in the nonprofit corporation under its  governing documents.”  Members of a  nonprofit corporation are similar to shareholders of a for-profit corporation  in that both members and shareholders may have significant rights with respect  to internal corporate governance.  Unlike  shareholders, however, members of a nonprofit corporation are typically not  owners and are not issued stock.  When  forming a nonprofit corporation, you must determine whether the corporation  will have members, and if so, who will govern the corporation—the members, a  board of directors, or both. A nonprofit corporation is presumed to  have members.  If you are forming a nonprofit corporation without members, the certificate of formation must include a statement to that effect. Can one person be the sole director and officer of a nonprofit corporation? No. The Texas Business Organizations Code requires a nonprofit corporation to have at least three directors, one president, and one secretary. The same person cannot be both the president and secretary. Officers and  directors must be natural persons, but may be known by other titles. Can a nonprofit corporation pay a salary to its officers, directors and/or employees? Yes. Any corporation may pay reasonable compensation for services  rendered to the corporation.  Note that the Secretary of State does not determine what is considered reasonable compensation.  A paper presented in 1993 at the IRS Continuing Education Program for Exempt Organization Specialists   discusses reasonable compensation.  This paper is available on the IRS web site (PDF, 116kb). Can a nonprofit corporation give political contributions? There are restrictions on political contributions by nonprofit  corporations.  For information, on this  topic, you may wish to contact your private attorney, the Texas Ethics Commission , (512)  463-5800, the Federal Election Commission ,  and the IRS .   You may also wish to review Title 15 of the Texas Election Code . Who has authority to investigate the activities of a nonprofit corporation? The Texas Attorney General has statutory authority to (1) investigate charities that operate as nonprofit corporations, and (2) inspect the books and records of all corporations,  including nonprofit corporations. The secretary of state has no such authority.  Additionally, the IRS can revoke a nonprofit corporation’s tax  exemption for violations of federal tax laws. Are the books and records of a nonprofit corporation available for inspection? Section 22.351 of the Texas Business Organizations Code gives a member of a nonprofit  corporation, on written demand, the right to examine and copy the corporation’s  books and records.  The member, or the member’s agent, accountant, or attorney,  may examine and copy these records at any reasonable time and for a proper purpose.  Section 22.352 also requires a nonprofit corporation to maintain financial records in  accordance with generally accepted accounting principles; the board of directors  is required to prepare or approve an annual financial report for the preceding  year. Additionally, section 22.353 requires certain nonprofit corporations to make all records, books, and annual  reports of financial activity available to the general public for inspection  and copying. However, section 22.353 does not apply to (1) corporations that solicit funds only from their members;  (2) corporations that do not intend to solicit and do not actually receive  contributions in excess of $10,000 during a fiscal year from sources other than  their members; (3) proprietary schools; (4) religious institutions; (5) trade  associations or professional associations whose principal income is from dues  and member sales and services; (6) insurers; or (7) alumni associations of  public or private institutions of higher education. Under certain circumstances, a nonprofit corporation’s books  and records are also available to the public under the Texas  Public Information Act (chapter 552 of the Government Code). Section 552.003(1)(A) of the Public Information Act defines “governmental body” to include the “part,  section, or portion of an organization, corporation, commission, committee,  institution, or agency that spends or that is supported in whole or in part by  public funds.” For more information on the Public Information Act, please  contact the Attorney General ;  the secretary of state cannot provide advice regarding the application of the  Public Information Act to a particular nonprofit  corporation. Can I obtain a copy of a nonprofit corporation’s IRS Form 990 from the secretary of state? No. Although organizations filing Form 990-PF must submit a copy to certain state attorneys general, nonprofit corporations are generally not required to file Form 990 with the Texas attorney general or the secretary of state. The IRS provides information about how to obtain copies of Forms 990, exemption applications, and related tax filings on its Form 990 Resources and Tools page. For more information about registrations and filings with the Texas attorney general, please visit the Charitable Trusts section of the attorney general's website. Does a foreign nonprofit corporation have to register to transact business in Texas if its only contact with the state is solicitation of funds or donations? A nonprofit corporation that actively solicits funds in Texas may be  “transacting business” in Texas and should file an Application for Registration  (See Form 302 ( Word  190kb , PDF  99kb ); however, if the corporation’s contacts with Texas are only through  interstate commerce (for example, by mail or by telephone) or independent  contractors, then the corporation is probably not “transacting business” in  Texas. However, regardless of the manner of solicitation, an out-of-state  nonprofit corporation may be required to register with the secretary of state in order to participate in a state employee charitable campaign under subchapter  I, chapter 659 of the Government Code. How can I obtain a copy of the bylaws, tax exempt filings or other documents for a nonprofit organization? If the entity is organized as a Texas nonprofit corporation, you may obtain a copy of the certificate of formation or other filing documents maintained by the secretary of state by contacting our records team at corpcert@sos.texas.gov or 512-463-5555. The documents may also be viewed and copies ordered through SOSDirect . The secretary of state does not maintain the bylaws or tax exempt filings of any nonprofit organization. Some organizations that have obtained tax-exempt status from the Internal Revenue Service are required to make certain documents available to the public. Bylaws may be available if included as part of the organization's application for exemption. For more information, please visit the IRS website . The secretary of state's office cannot assist you in obtaining these documents. FAQs for Unincorporated Nonprofit Associations What is an unincorporated nonprofit association? Does an unincorporated nonprofit association have to file anything with the secretary of state? Is an unincorporated nonprofit association a tax-exempt entity? If not, how do I become tax-exempt? What is an unincorporated nonprofit association? An unincorporated nonprofit association is an unincorporated  organization consisting of three or more members joined by mutual consent for a  common nonprofit purpose. Unlike nonprofit corporations, unincorporated  nonprofit associations do not file certificates of formation with the secretary  of state. For more information, see Form 208 ( Word 32kb , PDF 21kb ). Does an unincorporated nonprofit association have to file anything with the secretary of state? No. An unincorporated nonprofit association may, but is not required to, file an appointment of an agent for service of process.  See Form 706  ( Word 88kb , PDF 58kb ). In  addition, the association may, but is not required to, file a statement of authorization as to real property with the county clerk. Is an unincorporated nonprofit association a tax-exempt entity?  If not, how do I become tax-exempt? A Texas nonprofit organization—whether a corporation or an unincorporated association—is not automatically exempt from federal or state taxes. To become exempt, the organization must meet certain requirements and apply with both the IRS and the Texas Comptroller of Public Accounts. To learn more about the rules and procedures for obtaining federal tax-exempt status, read IRS Publication 557 , “Tax-Exempt Status for Your Organization.”  Questions about federal tax-exempt status can be directed to: IRS Exempt Organizations Section (877) 829-5500 To learn more about the rules and procedures for obtaining state tax-exempt status, read the FAQs published by the Texas Comptroller of Public Accounts.  Exemption from Texas state taxes is determined by the Texas Comptroller of Public Accounts. Questions about state tax-exempt status can be directed to: Texas Comptroller of Public Accounts Exempt Organizations Section (800) 252-5555 or (512) 463-4600 email FAQs for Nonprofit Corporation Periodic Reports I received a notice from the secretary of state  about filing a “periodic report.” What is this report? Is this required  annually? Why am I receiving notices about filing a periodic  report?  I am no longer affiliated with  this corporation. The report I received contains inaccurate  pre-printed information.  How can I  change it? Can I file a periodic report even if the secretary  of state has not requested one? What happens if I don’t file the periodic report? If  a nonprofit corporation has been involuntarily terminated or had its  registration revoked for failure to file its periodic report, can it be  reinstated? Is a  nonprofit entity formed under a special statute—such as an electric cooperative  formed under the Texas Utilities Code—required to file a periodic report? I received a notice from the secretary of state about filing a “periodic report.” What is this report? Is this required annually? A nonprofit  corporation is required by law to file an informational report not more than  once every four years upon request by the secretary of state.  The report provides information regarding the  corporation’s registered agent and registered office, and the names and  addresses of its current officers and directors, and is required regardless of  the corporation’s tax status.  BOC §  22.357 . Once  requested, the report must be completed and filed with the secretary of state  to avoid involuntary termination of a domestic corporation or revocation of the  registration of a foreign corporation.  BOC § 22.364 . Why am I receiving notices about filing a periodic report?  I am no longer affiliated with this corporation. The  secretary of state sends official notices to the corporation through the  current registered agent and registered office address.  If a periodic report notice was addressed to  you, it is because your name and  address appear as the corporation’s registered agent and registered office and the corporation has not designated or appointed a new registered agent. The report I received contains inaccurate pre-printed information.  How can I change it? Although you cannot change the entity’s name, file number, or jurisdiction of formation, you can change or update the following pre-printed information on the report by simply crossing it out and filling in the correct information: The  registered agent name; The  registered office address; and The  names, addresses, and titles of persons named as officers and directors of the  corporation. To change its legal name, the corporation must file a certificate  of amendment with the secretary of state or an amendment to its registration.  See Form 424 ( Word 135kb , PDF 129kb ) or Form  406 ( Word 100kb , PDF 306kb ),  as applicable. Can I file a periodic report even if the secretary of state has not requested one? Yes.  Although a nonprofit corporation is not required to notify the secretary of  state of changes to officer or director information at the time of the change, a nonprofit corporation may file a periodic report even if the secretary of state has not asked for one.  However, filing a voluntary report does not affect your duty to timely file a report when one is requested by the secretary of state. What happens if I don’t file the periodic report? A nonprofit  corporation that fails to file the periodic report within 30 days from the date  that the report is sent by the secretary of state forfeits its right to  transact business in Texas.  BOC § 22.360 .  A nonprofit corporation that has forfeited  its right to transact business cannot maintain any action, suit, or proceeding  in any Texas  court; however, the corporation may still defend any action or suit. The  forfeiture does not impair the validity of any contract. The corporation may  relieve itself of the forfeiture by simply filing the periodic report within  120 days of the date of mailing of the notice of forfeiture. If the corporation  fails to file the report within this 120-day period, the secretary of state  will involuntarily terminate the existence of the Texas  nonprofit corporation or revoke the foreign nonprofit corporation’s  registration to transact business in Texas,  as applicable.  BOC §  22.364 . If a nonprofit corporation has been involuntarily terminated or had its registration revoked for failure to file its periodic report, can it be reinstated? Yes. So long  as the entity would otherwise continue to exist, the entity can reinstate at  any time by filing the required report together with the maximum filing fee of  $25.  See Form 802 ( Word 146kb , PDF 119kb ). Please  note, however, that the secretary of state must determine whether the  corporation’s name is still available before the required periodic report can  be filed and the entity reinstated. Consequently, additional filings and fees  may need to be submitted together with the periodic report when the name of the  corporation is not distinguishable in the records from the name of any existing  domestic or foreign filing entity, or any name reservation or registration on  file with the secretary of state. Is a nonprofit entity formed under a special statute—such as an electric cooperative formed under the Texas Utilities Code—required to file a periodic report? Yes.  The Texas Business Organizations Code (the  “Code”) provides that a nonprofit corporation created under a special statute is  subject to Title 1 and Chapter 22 of the Code, to the extent not inconsistent  with the special statute. NEW: SOS Modernization Program SOSDirect -Business Filings Business Copies and Certificates Uniform Commercial Code Texas Businesses Against Trafficking VoteTexas.gov - Voter Information Website Policies Open Records Texas.gov Contacts Texas State Library & Archives Texas Homeland Security Where the Money Goes Fraud Reporting Texas Veterans Portal"
    },
    {
      "url": "https://www.irffb.com/contact-us",
      "text": "Contact | IRFFB | Indian River County, Florida top of page Indian River Firefighters Benevolent Association Home Our Events Golf Tournament Fishing Tournament Fire Conference Raffles About Us Our Sponsors Contact Us Donate Here Shop More Use tab to navigate through the menu items. Contact Us Want to get involved? Contact us today. Submit Thanks for submitting! Board Members Brad Eskew President (772) 643-1361 Brian Guanch Vice President (772) 473-4431 Carlo Marques Secretary/Treasurer (772) 633-1155 Will Willmot Trustee (772) 321-5033 John O'Connor Trustee (772) 473-7741 Email Us: info@irffb.com Home Our Events Golf Tournament Fishing Tournament Fire Conference Raffles About Us Our Sponsors Contact Us Donate Here Shop The Indian River Firefighters Benevolent Association is a Non-Profit 501 [C] 3 charitable organization. 2022 by Indian River Fire Fighters Benevolent Association. Website Proudly built by Vero Beach Social Media bottom of page"
    },
    {
      "url": "https://fiha.us/contact/",
      "text": "Contact Us – Welcome to the Florida Indian Heritage Association Skip to content Welcome to the Florida Indian Heritage Association FIHA Menu Search Home About Us FIHA News Contact Us Board of Directors 59th Annual FIHA ANNIVERSARY POWWOW in March FIHA March Powwow Layout 59th Annual FIHA Anniversary Powwow Vendors FIHA March Camping FIHA March Powwow Advanced Tickets FIHA March Powwow Schedule of Events FIHA March Anniversary Powwow Tentative Dates Thunder on the Beach  POWWOW Future Thunder on the Beach Powwow Tentative Dates Thunder on the Beach Layout Thunder on the Beach Vendors 2024 Thunder on the Beach Schedule of Events Thunder Advanced Tickets Camping Vendors Vendor Application Vendor Payment Calendar of Events Store FIHA Powwow- March 28 – 30, 2025 at the St Lucie County Fairgrounds FIHA Past President’s and Powwow Chairmen FIHA Princesses Princess Rules FIHA Past Senior Princesses FIHA Past Junior Princesses COVID-19 Safety Plan Vendor, Dancer, and Singer Protocols Buy Tickets/Reserve Camping Search for: Search Contact Us There are many way to reach us. Facebook: FIHAPowwows Twitter: @FIHA50 Email: info@fiha.us Call Us: (772)519-7888 Like this: Like Loading... Archive December 2020 March 2020 January 2019 November 2017 September 2017 April 2017 February 2017 December 2016 August 2016 March 2016 Search for: Search Powered by WordPress.com . %d"
    },
    {
      "url": "https://www.501c3.org/who-really-owns-a-nonprofit/",
      "text": "Who Really Owns a Nonprofit Skip to content Call Us - 1 (888) 361-9445 Sign Up for Our Email Newsletter Start a Nonprofit SureStart™ – Start a 501(c)(3) Nonprofit Sole-Member Nonprofit Formation Service Start a Private Foundation – SureStart PF™ 501(c)(3) Recovery – For Revoked 501(c)(3) Status Fiscal Sponsorship – Compass Charitable Partners Compliance Services Form 990 Preparation Charitable Solicitations (Fundraising) Registration Assurance™ Membership Plan – Bundle Annual Compliance Services Bookkeeping Services Learn CEO’s Blog FAQs What is a 501(c)(3)? A Guide to Nonprofit Tax-Exempt Status How to Start a 501(c)(3): Benefits, Steps, and FAQs Fundraising TV – New! Videos – 501(c)(3) University Why Foundation Group? Contact Search Open mobile menu Close mobile menu Search CEO's Blog Home » CEO’s Blog » Board of Directors/Governance » Who Really Owns a Nonprofit? Who Really Owns a Nonprofit? July 8, 2024 Greg McRay, EA Board of Directors/Governance The concept of who owns a nonprofit organization can be hard for some to grasp, especially given that the answer is, “No one!” We encounter this confusion with new clients on a fairly regular basis.  And, given people’s understanding of how basic business operates, it is understandable.  In order to fully appreciate the concept of “non-ownership”, it is helpful to first talk about the various types of business entities.  Then, we’ll look at organizational purpose.  By the end of the article, it should make a lot more sense. The Way It Works In a For-Profit Business Structure There are several different types of business entities.  For-profit companies make up most of them.  Here are a few that all have an owner or owners: Sole Proprietorship: One person who conducts business for profit.  Though a sole proprietorship may have to secure things like a business license, it is a fairly informal structure.  Legally, there is no distinction between the person and business.  The sole owner assumes complete responsibility for all liabilities and debts of the business, and reports income and expenses on their personal tax return. General Partnership: Two or more individuals as co-owners of a for-profit business.  This is more formal than the sole proprietorship, but even with this structure, there is no legal distinction between the individual partners and the business itself.  A partnership files a separate tax return, but profits are taxed at the partner level, not the business level. (For-profit) Corporation : Now we’re getting much more formal.  A corporation is a legal person in the eyes of the law, with ownership vested in the shareholders.  When a corporation is formed, an initial number of shares of stock must be declared.  These shares of stock are the mechanism for ownership.  How many shares to declare is up to those forming the corporation.  Usually, more shareholders means a higher number of shares declared. Those shares are divvied up between the owners, usually corresponding to the percentage of initial capital invested by that owner. The corporation itself assumes all liabilities and debts of the Corporation, not the shareholders, providing a significant level of asset protection for the individual owners. Limited Liability Company (LLC): An LLC is a formal association which combines the advantage of a corporation’s limited liability and the flexibility and single taxation of a general partnership.  An LLC has members rather than shareholders, but the principle is similar.  The percentage ownership any one individual has usually corresponds to their relative investment percentage made into the business. With the exception of the LLC, none of the business structures listed above can be used for nonprofit organizations.  Even the use of an LLC is extremely rare, because all nonprofit LLC members must be other, existing 501(c)(3) organizations, not individuals or other entity types. The Reality of a Non-Profit Business Structure The most popular business entity for nonprofits is the nonprofit corporation , making up well over 90% of all tax-exempt organizations.  This type of corporation is very different from the above-mentioned for-profit corporation.  A nonprofit corporation has no owners (shareholders) whatsoever.  Nonprofit corporations do not declare shares of stock when established.  In fact, some states refer to nonprofit corporations as non-stock corporations. A nonprofit corporation is formed to carry out a non-commercial purpose , whether that be religious, educational, charitable, scientific or other qualifying purpose.  It is prohibited from acting in a manner that results in private inurement (profit) to individuals. It is also possible, though not advisable, to operate a nonprofit as an unincorporated association.  A trust structure can also be used.  Lastly, an LLC can be used in specific situations (see above). No matter which entity type is chosen, none have a mechanism for ownership.  Governance responsibility is vested in the board of directors or trustees.  These individuals are accountable to state and federal authorities to ensure the organization operates in a legally compliant manner and for the purposes outlined at formation. Also, a nonprofit cannot be sold.  Again, without an ownership mechanism, it simply isn’t possible.  If a charitable nonprofit winds down operations, the board of directors must distribute all of the nonprofit’s assets to another 501(c)(3) after all debts have been settled.  Some other non-charitable nonprofit types, like 501(c)(7) social clubs, distribute residual assets proportionately to the existing membership. Final Thoughts It is difficult for some people to wrap their head around this idea of non-ownership.  That’s completely understandable.  We’re programmed to think of business in terms of entrepreneurs, owners, and shareholders.  A nonprofit organization is not “owned” by the people who start it, nor their successors in leadership.  These individuals operate in a position of trust and accountability for the public at large, who, via government, allow nonprofits to operate exempt from the taxes that for-profit businesses must pay. Join more than 45,000 others who subscribe to our free, email newsletter.  It’s information that will empower your nonprofit! Greg McRay, EA Greg McRay is the founder and CEO of The Foundation Group. He is registered with the IRS as an Enrolled Agent and specializes in 501(c)(3) and other tax exemption issues. Twitter LinkedIn Comments (93) Peter Zigmond says: January 27, 2023 at 4:03 pm Would you please give me your take on a non-profit business proposition I am trying to put together. My business I would like to start is a total non profit fishing charter where proceeds would go to taking  disabled people fishing that would otherwise be unable to ever enjoy this.  I plan on two boats to start.  One specially developed for accommodate wheelchair bound, and other types of disabled people, one normal charter to generate funds to operate the other.  Priority would be given to disabled veterans and disabled civilians who have never been fishing (developed an injury or illness after already previously enjoyed fishing). I know this venture would be extremely expensive, from the modified dock are to the modified fishing vessel, specialty prosthetics,  specialty safety devices, licenses, etc, etc .   I believe that the idea of this company, even though it would be more of a donation than an investment, if properly advertised and administered could raise alot of money. Also the employees would be made primarily of physical disability persons, from Captain and deck hand, to office administration.  I want the recipient of the trip to never feel like we are taking pity, rather, give them  sense that they can do anything they put their mind to. I would love your thoughts on this. Greg McRay, EA says: February 2, 2023 at 8:15 pm Sounds like a lot of joy to be had by all.  If done well, I think this would resonate with people and might just be a big success.  The part about the 2nd boat for normal charters is the difficult part.  While the revenue would be used to help underwrite the costs of entire operation that benefits the disabled, that’s not enough to keep it from being a commercial business equivalent.  That means it would be taxable income that would have to be tracked separately from the disabled charters.  That’s really a gang-plank you don’t want to walk.  It’s not that two streams of revenue…one non-taxable and the other taxable…is illegal.  It’s not.  It’s just called unrelated business income and can be a real headache to track, report, and pay taxes on.  Plus, it cannot generate more than about 20% of your nonprofit’s total revenue, meaning you would need to cover the other 80% at a minimum through donations.  I recommend searching our site for our articles on types of income, especially unrelated business income.  We have videos about those topics on our YouTube channel, as well: https://youtube.com/@foundationgroup David says: December 25, 2022 at 10:55 am Hello Greg–  I am a lawyer, and can do the incorporation myself.  Is there any church corporation that you can point me to for a sample set of forms?  I want the church corporation to have 501c3 tax exempt status but don’t want to apply for documented exemption from IRS.  Thanks for your help. Greg McRay, EA says: January 10, 2023 at 7:44 pm You can probably use your state’s articles template for nonprofits and accomplish what you’re after.  Churches are recognized as already 501(c)(3) tax-exempt, so the choice to apply for official recognition is, while recommended, completely optional. Russell Bernstein says: September 26, 2022 at 9:40 am Hi Greg, 10 years ago, I came back to the USA to start a nonprofit. I spent about a month taking all the courses you offered at the Foundation Center. Since then, I have started 10 different nonprofits including several 501c3’s as well as a 501c4, 501c6, 501c7, 501c12, 501c25, and a 527 and one 501c3-PF. None of them were very successful, most never applied for 501c determination within the first 2 years, and all but 1 no longer exist. But I learned a lot. For the last 5 years, I’ve been a business broker. I sell businesses like a Realtor sells houses. For the benefit of both industries, I would like to contest you interpretation of 2 things. Explicitly, you stated in this article that it’s impossible to sell a nonprofit. Implicitly, you stated that running a nonprofit cannot benefit an individual. Regarding the latter, I think it’s really important that you as the CEO and as an organization place a greater emphasis on the fact that 99% of nonprofits not only fail to operate but also fall short of achieving the purpose of their mission because nonprofits are not commonly operated like any other business when they SHOULD be run like a business. I think it’s irresponsible on the Foundation to place so much emphasis on a binary interpretation of operating a nonprofit. My opinion is that this binary interpretation of what “benefiting an individual” means is perpetuating the cycle of fruitless endeavors of most nonprofits. There are also SO MANY rules that are not that different than for profits other than the language that is used to describe the same things merely because it’s important to differentiate those things for nonprofits. For example, “surplus” rather than “profit”. In my experience, the vast majority think that operating nonprofits is a zero sum game where 100% of the funds raised need to be spent on program expenses. However, that places way to much responsibility on the founders to sacrifice a living wage and other life activities and to do so in perpetuity, which is impossible. In fact, the highest rating on Charity Navigator is partly achieved through the Financial Health ratio of Total Functional Expenses with only 7.5% coming from Administrative Expenses and more than 72.5% going up Program Expenses. I realize you’re not directly affiliated with Charity Navigator, but how many nonprofits know that having a low rating from Charity Navigator does not mean you’ll get your tax exempt status revoked? If more nonprofits knew that they could technically spend 90% on Administrative Expenses, there might be more founders willing and ABLE to sustain their endeavors for more than the 7 years Charity Navigator requires before they even consider reviewing a nonprofit. A greater emphasis should be placed on not only that someone can make a living wage from a nonprofit but that they should if that is their passion. By doing so, we create the ability for passionate founders to give up their “normal” jobs to free up their capacity to do more with their charitable purpose. Isn’t the goal of the Foundation Group to facilitate that? I know the answer is yes. I’m just saying that the Foundation is not doing enough to encourage that and is instead doing too much to create a wall between for profit and nonprofit with binary interpretations. Regarding selling nonprofits, I haven’t sold one, but I disagree with that interpretation as well. I think that statement is binary as well and that is damaging to the nonprofit world in a similar way as I have already stated. To illustrate this, I have 2 points to make. First, the ability to sell businesses varies significantly by market area. Second, selling businesses is not binary whatsoever. A market area affects the ability for it to be possible to sell a business significantly. In markets like Florida, New York, and Colorado, there are more than 700 business brokers per state and this reflects that ability for businesses to transact frequently, in short periods of time, and for close to or more than the valuation. In markets like Louisiana, there are only 20-100 business brokers per state and this reflects the inability for businesses to transact frequently, in less than 8-18 months, and for 20-60% less than the valuation (lack of marketibility Treasury Regulation § 20.2031-1(b)). Part of the reason for this is that real estate laws favor landlords who also have strict leases preventing the ability for businesses to transact without permission or at all. But my argument to the real estate commission is that there would be far lower vacancy rates and greater benefit to the community and economy if a business was allowed to be sold more easily. Similarly, there would be a greater benefit to the nonprofit community if nonprofits were told that they could be sold more easily. I say more easily because your interpretation of the ability to sell a nonprofit is binary. However, my interpretation of the ability for a nonprofit to sell is not that different than businesses to be sold. Selling a business is not binary. There are multiple definitions of selling a business, starting with stock sale versus asset sale. A stock sale is when you sell the entity that owns the assets. An asset sale is when another entity buys the assets of an entity. But the definition of “selling a business” doesn’t stop there. On Form 8594, there’s a list of different classes of assets, and selling a business doesn’t have to have $1 or more of every class in order to qualify for the definition of selling a business. It can be a very different composition of assets from sale to sale. There are also different ways of accounting for value, and I think this is where nonprofits can be sold, particularly in the form of long term consulting agreements or 501c2 or 501c25’s. But the methods of doing this don’t have to align with a binary interpretation of what’s compliant or legal. As long as people are compliant and legal about the way they transfer value, they shouldn’t be chastised for conceiving of those methods because it doesn’t meet your binary interpretation of the inability for a nonprofit to be sold. Like many low rated nonprofits on Charity Navigator who still maintain their tax exempt status, there are a lot of “loop holes” or interpretations of compliance with 501c rules regarding benefiting an individual to allow these organizations to continue to exist. But these should be featured by the Foundation Group so that more nonprofits can survive into perpetuity without having to reach the unrealistic expectations placed upon them with a binary interpretations of compliance and the law. Greg McRay, EA says: September 30, 2022 at 3:55 pm You might be surprised to hear that I agree with much of what you are saying, Russell.  However, I think in some cases you have us confused with Foundation Center, a large nonprofit that provides educational services and assists charities in finding grant funding. Regardless, lots of “binary” talk being thrown around, but the gist of what you’re saying is that nonprofits SHOULD operate more like businesses if they wish to thrive.  No argument from me on that.  In fact, we have often said essentially that in our articles and videos.  We have long argued against the arbitrary ratios promoted by Charity Navigator and others.  For most smaller nonprofits, it’s virtually meaningless.  The industry has come to call that stuff “The Overhead Myth”, and we’ve written about the topic.  A great book on the subject is called “Uncharitable” by Dan Pallotta.  And yes, people should be paid fairly for work they devote to charity, same as they would in the commercial space. As to our “binary” view of selling a nonprofit, I think you’re missing a key point.  Even if a nonprofit board “sold” their nonprofit to someone else, either by asset sale or some similar mechanism, there is no owner to reap the sales proceeds.  The board doing the selling can’t take it home.  That’s why most nonprofits that hit end-of-life wind down and distribute their remaining assets to other charities, as required by law.  That’s not binary; that’s required. Ru says: September 21, 2022 at 6:04 am Hi Greg! I would like to start a non-profit that would focus on nature conservation (e.g. cleaning up the lakes, river, lands, neighborhoods, etc.). I was thinking it would be a donations only model for my time spent for the volunteer work and anyone else who is helping. Are my intentions accurate and sound in setting up a 501c3 to do this? Much thanks! Greg McRay, EA says: September 22, 2022 at 3:39 pm You might be surprised to learn that most conservation-oriented nonprofits are 501(c)(4), not 501(c)(3).  Conservation organizations are generally considered public benefit, not charitable benefit…still tax-exempt, but not a charity.  The primary exception to this are nonprofits dedicated exclusively to animal welfare, such as habitat preservation for endangered animals.  See our article and video on What Is a 501(c)(4) for better understanding of this distinction. Anthony says: August 25, 2022 at 2:09 pm My non profit was setup as an LLC. I am the founder. This article confused me a bit in regards to this .it says “all nonprofit LLC members must be other, existing 501(c)(3) organizations, not individuals or other entity types.” So my board members need to have a 501c3? I appreciate further clarification. I didn’t set it up but the professional that did said they do this all the time and the IRS seemed fine with it as they approved it. I am small and have made many mistakes so I’m just trying to figure all this out. Greg McRay, EA says: August 26, 2022 at 2:23 pm If you are set up as an LLC, and your members are individuals, then you were set up incorrectly and the “professional” who did it has no clue what they’re doing.  It’s not that your board members need their own 501(c)(3).  An LLC is only appropriate for a 501(c)(3) when each LLC member is another 501(c)(3) organization, not a person.  That means the only use case for a 501(c)(3) LLC is when it is a joint venture of two or more existing 501(c)(3)s.  These are exceptionally rare, and it doesn’t sound like your situation.  We’ve seen cases where the IRS approved an applicant without paying attention to the LLC structure, either because they were more focused on what your program and purpose was, or, it was rubber-stamped without an actual person at the IRS reviewing it.  Sorry to say that your setup sounds totally incorrect. james says: September 27, 2019 at 8:32 pm when assuming a senior pastor role of an existing church who’s pastor is retiring, is it possible or necessary to transfer the 501c3 in order to assume responsibility for the existing loan on the property? Greg McRay, EA says: October 3, 2019 at 5:30 pm I can’t imagine a scenario where you would do that.  If a new pastor is coming into an existing church, that’s an employment issue, not a 501c3 issue.  The church’s 501c3 status shouldn’t have any bearing on who’s employed by the organization.  One should not affect the other. Julie says: September 26, 2019 at 7:43 am Looking to start a nonprofit that provides vacations to special needs families. The long term vision is to employ caregivers that can come along side the families.  We personally own two properties which we can use. Probably will place in separate LLCs  How should things be structured so that costs of the property are off set by “rent”    We are not looking to make money off of the “rent” but to cover the mortgage, HOA fees, taxes and other fees associated with owning.  If your answer is going to be it’s a legal matter can ya point us to a knowledge counsel Greg McRay, EA says: September 26, 2019 at 3:46 pm Unfortunately, there are too many variables with this to give you a straight answer.  You probably need to invest in a consulting block with one of our Exemption Specialists to unpack this idea.  What you’re talking about is borderline commercial, so it’s not a given that you can do this as a charity.  Almost certainly, you wouldn’t use LLCs in a nonprofit structure…more likely a combination of a 501c3 and one or more 501c2s.  Call our office at 615-361-9445 and ask to speak with one of our Sales Team members.  They won’t hard-sell you, I promise.  But you’re going to need expert help on something like this, for sure. Donald V says: September 13, 2019 at 1:53 pm Hi there, I have a general question. For at least 15 years I have wanted to start a non-profit for animal rescues. Over they past year that has morphed into wanting to help just about anyone/charity that might need it. I have what I feel is a new concept for a thrift/resale store and I have been selling online for many years successfully. We have a big homeless problem, animal problem, growing drug problem, etc just like a lot of places. I have never come across a non-profit that supports multiple causes. There may be but I missed it. Usually its a Animal , Humanity, Addition, Vet, etc cause. In my case would it be best to start the Store and then form a Foundation That the store can fund,  that can then disperse to multiple charities? I have a friend who has a non profit and he said a foundation most likely would be the way to do . Thanks Donald Greg McRay, EA says: September 26, 2019 at 5:09 pm I doubt you would want to go the foundation route.  It sounds like a public charity 501c3 makes more sense.  Charities with a primary mission to fund other charities often support multiple causes.  And while you see that with foundations, including the thrift store idea points toward a charity being a better choice.  Just make sure substantially all that the thrift store is selling are donated goods, otherwise your activity would be considered taxable. Luce St Louis says: August 27, 2019 at 2:59 pm Hi Greg: I want to create a non profit organization, but based on what i read after putting all the effort, time and sweat i won’t have any ownership right whatsoever. Which mean the board can fire me at any time. Is there’s a way i can protect myself as a founder? Greg McRay, EA says: August 27, 2019 at 4:27 pm It’s true that you cannot own the nonprofit, but most states will allow you to create a “sole member” structure where the founder is the sole member and is able to select the board members.  This structure must still pass the conflict-of-interest and private benefit test, but it is a structure that provides a good measure of protection to those social entrepreneurs who are risking much for no ownership. We can help you put together such a structure.  I’ll email you privately about this, Luce. Elaine says: August 31, 2019 at 8:08 pm Is this true in Texas? Greg McRay, EA says: September 26, 2019 at 5:22 pm I believe so.  Texas requires nonprofits to have at least 3 board members, but does not specify a limit for governing members.  So, even if you have a sole member org, you would still need a 3 person (minimum) board of directors. Tina Minkoff says: September 26, 2019 at 1:05 pm Greg, When referring to the “sole member” structure where the founder is the sole member and is able to select board members, is this legal in Pennsylvania?  Also, if a current non profit org. dissolves and would like to donate to another non profit are they able to specify whom they would like to donate it to or do the courts decide that? Greg McRay, EA says: September 26, 2019 at 3:25 pm I expect it is a legal structure in PA, but I have not verified prior to answering this.  One of the pioneering attorney architects of this structure is based out of PA (Don Kramer).  He’s considered one of the best nonprofit governance experts around.  As to the second question, yes, you can pick the recipient charity when distributing assets at dissolution. Mary Lou says: September 26, 2019 at 3:15 pm Luce St. Louis, Not so!  When you start a 501(c)(3) organization you as the owner will dictate which right you’ll have.  You can decide who can do what in your organization and you can also choose to have a permanent status which nobody can take away from you.  It’s better to have a lawyer do it for you as the law can be very tricky to do it on your own. Greg McRay, EA says: September 26, 2019 at 3:32 pm Respectfully, Mary Lou, I don’t know who’s advising you, but most of what you said is not accurate.  You cannot “own” a nonprofit.  There are ways to structure single-member organizations that provide a higher level of protection and control, but nothing is absolute with a nonprofit.  Even as a single-member, you cannot “dictate” anything.  You still have to have an independent board of directors who are functionally responsible and accountable.  If you want absolute control, you need to stick with a for-profit business model.  Any lawyer or self-appointed expert who says you can be a dictator of your own nonprofit is steering you toward trouble. Missy Greene says: August 21, 2019 at 5:46 pm Hi Greg! Thank you in advance for you help. We have a pool in our neighborhood that is not part of an HOA. It was built later and it was established as a nonprofit corporation and they do file a 501(c). I join our pool every year and we recently asked for a copy of the bylaws and were refused. We were told that only full equity members are allowed a copy (we have never been given the ability to join as “full equity” members.). We were sent the below response about membership types: “as I have explained there are three types of memberships – equity (these folks who own the property), annual members and non-voting members (not non-voting equity members).  Annual and non-voting members do not have any equity in the pool (that is, they do not own shares of the pool).  There are 9, not 8 board members, which I listed in a prior email.  Board members are selected by a vote of the equity members.  Only equity members may serve as board members.” Would this be possible for a nonprofit corporation? As from my research no one can “own” the nonprofit. Thanks again for any info you can provide. Greg McRay, EA says: August 23, 2019 at 5:01 pm This sounds messy.  You are correct that no one can own the nonprofit.  There are rare situations where a nonprofit corporation can issue shares of stock, but it does not create an equity stake.  And, in most states, this is disallowed anyway.  I also question whether this group actually has 501c status.  It would not qualify as a 501c3 based on its purpose.  At best, maybe a 501c4 public benefit corporation.  My guess is they filed Articles of Incorporation with the state and nothing else.  The IRS certainly would not have green-lighted this method of operation if it were honestly disclosed.  Any member of a legit 501c has a right to see the bylaws.  The org leadership cannot refuse it legally.  First, look up the corporation on the state’s corporations website. Then, go to IRS.gov and click on the charities button at the top of the page.  You can search there for nonprofits with IRS status.  My guess is they are not IRS approved. If you continue to get the runaround, contact the state AG’s office.  Good luck! Missy Greene says: August 23, 2019 at 5:22 pm Thank you! Andrew Taylor says: August 15, 2019 at 11:37 am Hello. Your article is very informative but, I would still like some clarification, if possible. I am a member of an organization based in California and the Office of the Attorney General’s website lists us as a ‘Public Benefit Charity’. From my research, it is my understanding that description is interchangeable with the term ‘Non-profit Corporation’. Our Articles of Incorporation state the organization was “organized under the ‘Non-profit Public Benefit Corporation’ for charitable purposes”. The organization has 501(c)(3) status. One of the original members (founders) who signed the Articles of Incorporation states that he has full control and ownership of the organization and pretty much rules with an iron fist. His name and signature are on everything and it’s my understanding that all of our financial accounts (checking account & credit cards) are based on his Social Security number and creditworthiness, not the organizations. His title is Executive Founding Director. We operate with an Executive Board made up of three members, himself and two that he appoints. The other two Executive Directors have very little access or say on anything. For example, one of the Executive Directors also carries the title of CFO but does not have access to any financial accounts. Next down is “the members of the Board of Directors shall be those persons elected by the Founders of the Corporation and shall be known as the Elected Board of Directors”. The Executive Board discusses who they feel would make good Directors and the Founding Director makes the final decision on who is appointed. The organization has a set of Bylaws that only cover certain members and aspects of the organization and there are ‘Rules & Regulations’ that cover pretty much everything else.  The Rules and Regulations have statements such as: “It is unlawful for Elected (Board) Directors to attempt to undermine or try to cause the removal of the Founding/Executive Directors. Any such attempts shall be immediate grounds for removal. If there should be a time when there are no Founding Directors, all duties shall pass to the current Executive Directors. There is also a statement which states that when the last Founding Director passes away the two Executive Directors must pick someone to take the Founding Directors place and “shall represent legal ownership of the organization. This designation is not amendable nor subject to repeal.” Is any of this legal. I read one article that said a founder of a non-profit cannot hold a director position. In addition to this Founding Director controlling every aspect of the organization he has been on Leave of Absence for at least seven years. He still oversees things and rules like a dictator through his second in command who is overworked and in poor health himself. I feel that over the years members have simply taken his word that he owns the organization and did not question it. New, younger members are more informed and have been questioning it and would like to see him removed although it is well known that any attempt at removing him would bring the wrath of his second in command who is set to inherit the organization upon his death. Any advice? Greg McRay, EA says: September 26, 2019 at 5:27 pm Your instinct is correct…this is not remotely legal.  It is OK for a founder to also be a director and/or officer.  There’s no legal prohibition on that.  But, no one owns anything and you certainly cannot be a dictator legally.  The entire voting board has fiduciary accountability, so they better exercise their authority or quit.  It’s not worth the risk being a puppet to this kind of nonsense.  Get out. Alvin G. Grugbaye says: August 15, 2019 at 1:54 am I am planing to establish a non- profit scientific research organization that is initially being sponsor by only me  that will be operated by me. Iam thinking about the leadership structure that would not cause me problem in the future. could you please suggest any possible way for me? Greg McRay, EA says: September 26, 2019 at 5:35 pm Sorry for the response delay.  It sounds like you may be a good candidate for a sole member structure that provides more entrepreneurial protection to the founder of a nonprofit.  It doesn’t give you total control, but it is a great structure for those who have elevated risk exposure in starting a nonprofit.  I suggest calling our office and speaking with a member of our Sales team.  They won’t hard sell you, but they can help you understand how to get where you’re wanting to go.  Sole member orgs are tricky to structure correctly, so you will need experienced help with this. Richard says: August 5, 2019 at 3:26 pm Thank you Greg for all this information! I’m starting a nonprofit and I’ll have to personally donate funds to cover rent for the facility. Would this type of donation be considered deductible for my personal taxes? Greg McRay, EA says: August 6, 2019 at 9:57 am Donations from you are just as tax deductible as they would be from anyone.  If you are able to itemize your deductions, your donation should qualify to be tax deductible. Matt says: July 24, 2019 at 2:45 pm We set up a tax-exempt 527 political organization and want to incorporate purely for liability purposes.  Would incorporating as a non-profit corp without pursing 501(c)(3) status be a viable option for limiting our liability? Greg McRay, EA says: August 1, 2019 at 6:36 pm My opinion is that it probably would be beneficial.  Yours is really a legal question, not a compliance one, so I recommend seeking a legal opinion if you are really concerned about personal liability. Serina Ortiz says: August 16, 2019 at 2:53 pm Im the founder of a 501(c)3 animal rescue. I drive thousands of miles every year for my charity. Since the non-profit is not considered a business, because it isn’t a money making venture, i would only be able to deduct 14 cents per mile versus 58 cents?  Is that correct? A cpa briefly mentioned to me that i could choose to take the deduction or the non-profit can take deduction depending on which is most profitable. ??😣 Greg McRay, EA says: August 23, 2019 at 5:24 pm It’s not really about being a business or not, but rather the nature of the transaction.  If you were a paid employee of the nonprofit, then standard mileage rates and potential deductibility apply.  But, if you are a nonprofit volunteer, those miles are considered a charitable contribution, subject to the reduced rate.  Even as the founder, if you are not paid, your still a volunteer.  But, if you ARE paid wages, you may be able to consider them business miles. Sandra says: July 18, 2019 at 6:11 pm Hello, similar to the church situation above, our Ohio non-profit has always been very small, run by founders a husband and wife. Have by-laws but due to actual amount of members no meetings everything was verbal between this couple. Both are now deceased. Last one died recently but prior had turned over leadership (verbally) to myself along with access to all websites, and other items someone of authority would have. She was active until her death in that we could consult with her, so was functioning still in that capacity along with me doing the day-to-day. We assigned someone to do our accounting also.  Remaining family (who have never been part of this group) states unless we produce something in writing saying I was given authority they will shut us down. Cannot the remaining active members look to by laws and (formally, now) vote on leadership? Our by-laws state minimum of 3 leaders. Help! Greg McRay, EA says: August 1, 2019 at 6:49 pm The “family” has no say-so in this at all.  The remaining members should fully seat an active board and continue operations if that’s the choice that is made.  If it’s a nonprofit corporation, especially with 501c3 status, it can’t be owned and family has to stand down.  Sounds potentially ugly…good luck with it. Jennifer says: July 15, 2019 at 4:56 pm Currently I am working with a for-profit healthcare entity that has a non-profit Foundation.  The by-laws submitted state that the The Corporation shall have and continuously maintain in this State a registered office and a registered agent whose office is identical with such registered office, and may have other offices within or without the State of Illinois as the Board of Directors may from time to time determine. The initial registered agent of the Corporation shall be the CEO of the healthcare facility and the initial registered office of the Corporation shall be the address of the healthcare organization ARTICLE III Members The Corporation shall have one member. The member shall be the healthcare facility,or its successor. The member shall elect the Directors at the annual meeting of the member to be held in December of each year on such date and at such time and place as determined by the Board of Directors. This was given a public charity status as a 501c3, but as you can see from the by-laws the for-profit controls the not-for profit.  The for-profit votes on the board members based on the way the by-laws read above.   Does this sound right to you?  it seems like a conflict of interest but legally we are being told it is fine.  Just concerned. Greg McRay, EA says: July 18, 2019 at 2:05 pm Obviously, I don’t know the entire legal setup, but it probably works.  This is known as a single member 501(c)(3), and most states allow it.  So does the IRS.  Since the IRS expects governing accountability to rest with the officers and directors, they don’t put much focus on the membership.  As long as the “member” allows the board to do its job per the bylaws, these setups are usually OK. Joseph Warren says: July 12, 2019 at 7:30 pm Greg, here’s a question for you if you’re still following this string: Here in our town is a small, now derelict church in which my wife and I were married many years ago. The church is owned by the 501 and all of the officers of record, including the minister who performed our service are, sadly, dead. The county assessor doesn’t care because, although the entity has been suspended for six years by the state of Arizona, there are no taxes due since it was exempt under our statutes. So the property just sits there further eroding. Given the nebulous nature of this situation, and the lack of sentient owners, who has legal authority to convey the property? Thanks, Joe Greg McRay, EA says: July 18, 2019 at 1:54 pm I understand you to be saying that there is no longer a church congregation, nor an active legal structure, nor a governing board.  The real question is who holds title to the property.  I’m guessing it’s the suspended entity. If there are still living members, that membership could appoint new officers and the legal entity reinstated with the state.  The new board would have to decide what to do with the property, keeping in mind that 501(c)(3) assets are permanently dedicated to a charitable purpose.  It couldn’t be sold and the money pocketed by anyone.  If sold, the proceeds would have to used charitably. This is a situation where the property could very well become a ward of the state AG’s office if there is no membership that could reconstitute the entity.  501(c)(3)s that wind up abandoned with no stakeholders generally relinquish their assets to the jurisdiction of the AG or possibly the local or state court system.  You may wish to seek competent legal counsel or call the AG’s office for advice. Jen C says: July 12, 2019 at 1:38 pm My husband has been working for a non-profit for the last 9-10 years and is considering taking the reigns as the president of the organization. The current president is financially tied to it (having used some of her personal money over the years to cover expenses and payroll during leaner business times). She believes there’s a monetary value to the org and has offered that for a “buyout” number. Considering the org is service-based with minimal tangible property, how could we possibly figure out a true value to the org and/or “buy her out” per se? Greg McRay, EA says: July 18, 2019 at 1:42 pm There really isn’t a “buy out” valuation that’s possible.  In a for-profit small business, infusions of capital by an owner increases the value of the company and, additionally, that owner’s equity stake. It is also possible to structure it as a loan to the company that would be paid back to the owner with interest.  In a nonprofit, infusions of cash are either a charitable donation or it is a loan.  There are no other choices.  A nonprofit has no valuation measurement, therefore contributions by an insider cannot create a valuation stake for that individual.  Attempting to monetize that is highly illegal and could result in civil or even criminal charges. In this situation, one way for this person to be made whole is for her contributions to be considered a loan.  The problem there, though, is one of contemporaneous documentation.  Any loan by her to the nonprofit must have been approved in advance by the board and documented tightly with regard to amount, payback timing, and any applicable interest.  I know from your question that this isn’t what happened.  As such, her infusions of cash are almost assuredly restricted to being charitable donations. Taxable salary or bonus is really the only other possibility, but you have to very careful even with that.  Any compensation to her must be board approved without her board participation (conflict-of-interest), and must be defendable to the IRS as being reasonable for services rendered and CANNOT be tied in any way to prior cash donations by her. This is a longer answer than usual, but it’s a tough situation that we see frequently.  There is no good fix for this and real risk to her and the board if done incorrectly.  This is another great example of why every small nonprofit needs competent counsel before they made irreversible mistakes.  What you don’t know CAN hurt you! Charles says: July 7, 2019 at 8:33 am We are a 501c3 non-profit amateur theatre group.   Can we transfer our non-profit to another group of people who want to start a theatre? Charles Greg McRay, EA says: July 8, 2019 at 8:39 pm I presume from the question that your organization is shutting down, maybe?  You can’t simply transfer your 501(c)(3) status to another group.  There are many factors, but the primary one is the fact that the status is tied to your corporation, not theirs.  You can’t detach it from one and attach it to another.  Theoretically, they could “take over” your existing corporation if your group is winding down, but there’s a lot to that legally, AND, it’s something we never recommend.  There’s too much liability for all involved.  The other group would be far better served to set up their own nonprofit and secure 501(c)(3) status for it. Bonnie says: June 28, 2019 at 1:14 pm An existing non-profit 501(c) 3 with some similarities in purpose to a new non-profit we wish to establish is closing its doors because the founder is elderly.  A member of their board has proposed that we assume their 501(c) 3 status, continue the work they are doing, add on our own new initiatives, and file to rename it and make it our own. Is it permissible to transfer a 501(c) 3 organization authorization in this way?  I am not sure whether this is a great opportunity, clearly not allowed, or allowed but unwise.  I’ll appreciate your perspective.  Thank you Greg McRay, EA says: September 26, 2019 at 5:49 pm I am really sorry about the response delay, but hopefully this still helps.  It’s doable legally, but has risk.  Unless you know for certain that there are zero skeletons in their closet, legally, behaviorly, and/or with regard to state and federal compliance, you may wish to start your own org.  If you feel confident the older organization is in good shape, new leadership can step in and rebrand, so long as the general purpose remains similar. Kaylee says: June 21, 2019 at 11:28 pm This is probably a silly question.. but is a college degree or certification of any sort required to create a non profit organization? Greg McRay, EA says: June 22, 2019 at 6:26 pm Not at all…most anyone can start a nonprofit.  Most states will require someone who is incorporating a nonprofit to be 18 or over.  Some states even allow minors to serve on a board.  Education or certification is never a consideration legally. Travis says: June 12, 2019 at 6:58 pm There is a local church that a pastor has taken over and sold all the assets. He is using church funds to rehab his personal residence. The house was owned by the church However he did a quick claim deed and transferred it to himself. Is this legal? Thank you. Greg McRay, EA says: June 13, 2019 at 11:29 am Is there no board of directors/trustees/elders?  If there is, maybe there is more detail you’re not aware of and they have this board-approved and documented.  If things are as you describe, however, it is a massive violation of private benefit and inurement rules and VERY illegal.  If you’re correct about this being a one-man takeover, the state AG’s office (or Division of Charities) should be advised of the situation. Also, even if this was board-approved, it is still likely an illegal private benefit transaction.  It’s hard to imagine how any version of this is OK. Elba says: June 1, 2019 at 5:28 am A friend started a non-profit to help those battling cancer. She is also someone who is currently battling. Her family and friends would like to use the funds from the next charity event to help her but because she founded the organization they weren’t sure if they could use the funds for her instead.  They want to make her the recipient of the funds.  They think it may be an llc not sure. I understand based on your article that there is no true owner but if she is the one that normally runs it for other recipients and she founded it they weren’t sure how to proceed to help her. I believe she is not aware of this and they may want to surprise her but they want to do it the right way without jeopardizing the organization. Greg McRay, EA says: June 3, 2019 at 8:57 pm This is a potentially sticky issue.  If the organization is, in fact, an IRS-approved 501c3 nonprofit, and your friend is a board member or key employee (or both), she can’t readily be a beneficiary of funds raised by that organization.  It IS possible, but it would have to be completely at arms-length without her involvement…the rest of the board (not including any persons related to her by blood or marriage) would have to make the decision. Another solution could be to set up a “Go Fund Me” type account for people to give to, rather than funneling it through the nonprofit.  That way, you avoid the whole conflict of interest problem.  Donors wouldn’t get tax deductibility for giving to such a fund, but most people don’t itemize their expenses anyway. Ade says: May 30, 2019 at 11:35 am Please, what happens to shares and debts of limited liability company that converts to a non profit organizations Greg McRay, EA says: May 30, 2019 at 11:08 pm That’s really a trick question, of sorts.  Technically, a for-profit LLC cannot convert to a charitable nonprofit.  The only way that happens is indirectly.  A new nonprofit organization would be formed that would take over substantially all of the activities of the existing LLC.  The question of whether or not to transfer the LLC assets into the new charity structure would have to be determined.  The debts, in most circumstances, could not be transferred without providing prohibited private benefit to the LLC owners.  Finally, once everything that can be transferred has been transferred, the LLC could dissolve. All of this presumes the activity of the LLC is already charitable in nature and the original choice to be a for-profit entity is being reconsidered. Frank says: May 28, 2019 at 7:10 pm I have a non-profit client that purchased a restaurant’s assets to help fund their non-profit purpose, It was previously owned by another non-profit. They now want to sell to another non-profit and get out of the restaurant business. It appears to me that they can sell the assets but cannot sell based on a revenue model. Is that correct? If there is a gain, will they pay taxes on the 990T for that? Greg McRay, EA says: May 30, 2019 at 11:22 pm Tough question to answer without more background.  In general, an equity sale is really difficult, because there is no separate entity.  By the nature of the setup, an asset sale is about the only way to go here.  Most gains on sale of property can be exempt from capital gains taxes on 990T, but this equipment may not be.  Gains on the sale of both debt-financed property and Section 1245 property, which I think this would be, can be subject to capital gains taxes on 990T. Karen Dexter says: May 27, 2019 at 9:26 pm Hi,  I am a tenant in common owner with my two sisters.  The properties are commercial and residential rentals.  One sister tells us, that she just got approved for a non profit ministry for children.  She claims she will be putting all of her 1/3 ownership of the properties in a trust.  Her name will come off of the deed and the foundations name will go on the deed.  Can she do this legally?  Where does this leave me and my other sister?  We want to sell. Greg McRay, EA says: May 28, 2019 at 2:01 pm From your description, it sounds like your sister if perfectly within her legal rights to do this.  It’s not really a nonprofit-specific question, however.  You would have the same dilemma if she still owned her portion personally and didn’t agree with selling the property.  I think you probably need to consult an attorney about this if your goals are indeed this misaligned with each other.  Good luck with it. K T H says: May 24, 2019 at 12:58 pm Can a person that owns an llc start a non-profit as well? Greg McRay, EA says: May 24, 2019 at 2:41 pm Absolutely.  You have to be careful in how the two entities interact with one another.  The nonprofit cannot directly steer business to or promote the commercial interest of the LLC.  But in general, yes, the same person can be involved in multiple organizations. Erica M DeLeon says: May 12, 2019 at 1:11 pm Knowing what it takes to be successful can reveal excitement to both profit and non profit, it’s not all about competing its about loving and caring for people who are trying to start a business. Edward Bruns says: May 10, 2019 at 5:22 pm RE: ownership of a non-profit.  At least in the State of Missouri, the state owns the assets if those assets are not transferred to another charitable entity.  In the 1995s, Wellpoint, a for profit health insurance conglomerate, approached Blue Cross and Blue Shield of Missouri.  The “ask” the Board to convert the organization to a stock company and then to “sell” it to Wellpoint.  The then Missouri State Attorney General, Jay Nixon, challenged that transaction and filed a law suit.  The case was settled out of court for stock in Wellpoint and other considerations, cash, etc.  That money founded the Missouri Foundation for Health in 2000.  In my memory, the settlement amounted to over $450,000.  And Wellpoint is still making money, as far as I know. Isaac says: May 10, 2019 at 3:50 pm Good job you are doing here Greg. Let’s say a not for profit entity was started with three individuals with various amounts of contributions made in terms of the money to start with. Since shareholding is not encouraged at this kind of entity, how will their contributions and percentages of contribution be captured ? How will prosperity know that such initial funds with were raised at the inception and by whom, and how much each? Should all these details  be part of the bylaws? What is your answer to this, Greg. Thank you. Greg McRay, EA says: May 13, 2019 at 9:43 pm Great question, Isaac.  Initial “investments” in a nonprofit startup really only have two legitimate characterizations:  either it is a tax-deductible donation or it can be set up as a loan to be paid back.  It can never be used as a measure of ownership…it simply isn’t legal.  Most startups we work with usually take the donation route, but not all of them.  And, if you put in $5,000 and I put in $10,000, that just means I gave a bigger donation or loaned a greater amount.  Percentages are really irrelevant in this setting. wayne says: October 21, 2015 at 3:22 pm Greg, if a not for profit corporation bought penny stocks and made a profit, where should the money go when the corporation is dissolved?    thanks Greg McRay, EA says: October 26, 2015 at 12:27 pm We’ll leave for another day the fact that no nonprofit should be investing in “penny” stocks.  If the organization is shutting down and has any assets, regardless of how they were acquired, those assets are permanently dedicated by law to a charitable purpose.  In other words, the assets must be given to one or more other charities at dissolution. Christopher Knightsbridge says: May 10, 2019 at 11:49 pm Yup, which is why I was a year from my doctorate in clinical Psychology and my university was bought by a “non profit” took 50 million in financial aid and GI bill funds, stole or invested it, left many of us homeless and unable to treat our patients and closed with 2 days notice., diagnosing us as F’d 🙁  For more information please google search Satan, or Federal Reciever Mark Dottore and Argosy University. Both searches likely lead to the same page. wes mane says: October 17, 2015 at 12:44 pm Please disregard my question. I found that they cannot Greg McRay, EA says: October 19, 2015 at 5:34 pm You are correct.  I’ll publish both of your posts so they can help others! Wes Mane says: October 16, 2015 at 6:46 pm Can a partnership become a 501(c)(3) status? Bruce Sartwell says: October 9, 2015 at 3:07 pm Our community privately owned swimming pool was initially operated as a for-profit corporation.  People wanting to join the pool would pay a one-time “membership fee” and would receive a certificate stating that they were a shareholder in the corporation which conveyed a share of ownership to the person joining.  In addition, members would have to pay annual dues.  A few years ago the corporation changed to a non-profit corporation and there was no longer a membership fee nor did new members receive a certificate but they still had to pay the annual dues.  Because of that change, what happens to the equity share that all of the previous members (“owners”) had purchased? Greg McRay, EA says: October 11, 2015 at 5:54 pm This sounds like a legally complicated situation. At the simplest level, the equity no longer exists given that a nonprofit corporation has no mechanism of ownership (stock). But, the devil is in the details.  Did the fractional owners (members) approve the creation of the nonprofit and dissolution of the for-profit? And if they did, were they aware that their ownership would go away?  What formal steps were taken to transfer ownership of real property from one entity to another? These are really somewhat rhetorical questions, Bruce.  Frankly, I would consult an attorney familiar with corporate matters to make sure everything is buttoned down. lois says: March 25, 2012 at 4:15 pm In my opinion, i (being part of the board) would suggest that the president appoint a committee chairman to gather a committee to deal with the issue… I also feel your By-Laws holds the answer, or should… if it doesnt, better speak to the by laws committee chair.. I have been the by laws committee chair for our non profit for over 10 yrs.  a very important position to hold (in my opinion) Randall says: January 26, 2012 at 4:29 pm Does a Volunteer Fire Department with 501(c)(3) designation and getting a majority of funding through a local government entity meet the definition of “public charity”? Or is another term more appropriate? Some claim to be a “private” organization but that is an ambiguous term. Any thoughts on that? Greg McRay, EA says: January 26, 2012 at 11:31 pm I agree that calling a VFD a public charity sounds a bit strange.  But, by technical definition, that is correct. Randall says: January 27, 2012 at 9:59 am There is a dispute between a local government and a volunteer fire department over the “ownership” issue. State law says nonprofits can’t issue stock. Local government claims “taxpayers” own it. The board of directors claim they own it. I say they’re both wrong and it seems you do, too. The directors control and run the operation. Government provides funding for that operation for the public benefit. Unless that funding is “earmarked” – as in some government grants – it goes toward the general fund and applied within the discretion of the board and management. So long as they’re meeting their general goals, they’ve met their obligation as to application of funds. While it plays to the public in a philosophical sense to claim taxpayers own it, it makes no sense at all in actual practice. Taxpayers fund many things over which they have no direct say.  An independent corporation of any description is just that. While the hand that feeds you implies a close relationship, there is still that dividing line over who controls what. In this case, a local politician wants to have a line-item veto over how funds are applied in day-to-day operations, claiming he can “save the taxpayers money”. In effect, he wants to manage the corporation. Naturally, the directors dispute his authority to that. I believe funding has been severly curtailed as a result. Just like to hear your comments and perhaps get some reference to authoritative sources that might clarify the situation. Greg McRay, EA says: January 27, 2012 at 5:08 pm Your comments are dead-on, Randall.  Saying “the taxpayers own it” is a great turn-of-phrase, but it is essentially meaningless.  Local government doesn’t own it, either.  If it exists as an IRS recognized, 501c3, charitable entity, then it is an independent corporation governed by a board of directors and accountable to the state under corporate law and to the federal government under IRC 501c3.  Any “control” ceded to another body or agency would have to be approved by the board in accordance with the bylaws.  Any such agreement should necessarily be contractual in nature and revokable by the board.  Reference IRS Publication 557 for all the nitty-gritty. Sounds politically messy… Randall says: January 27, 2012 at 6:56 pm Would there also be some legal concerns to allowing a “proxy” to assert substantial authority over the nonprofit? Seems like by failing to maintain an arms-length independent status could risk losing either corporate status or 501(c)(3) status. And might that proxy be held liable for actions of the nonprofit if there was de facto control by the proxy? I’ll look into that publication for more detail. I have some ideas how this ought to be resolved to the satisfaction of both parties but I’d appreciate just an outline of what you feel would be reasonable. Bear in mind, the funder has legitimate concerns as to where the money is going. The corporation has concerns over someone effectively taking over the business. Randall says: January 30, 2012 at 3:39 pm Another question. Given the scope of an organization being limited to one county with population about 30,000, what would you recommend in terms of satisfying “accountability” to the public at large? Is Form 990 usually sufficient? As a matter of public relations, what more could be done to demonstrate to the public what they get for their dollar? Thanks for any help. J Hasten says: December 25, 2010 at 1:02 am I am wondering what the difference is between a foundation and a non-profit corporation. I want to file for a non-profit and I will be calling ya’ll for some help. I have some money that I would like to use to get started in a Ministry of Helps. I know this is probably a dumb question but I was just wondering the difference. Thanks for your time. Greg McRay, EA says: December 27, 2010 at 8:59 pm Not a dumb question at all.  In fact, we answer similar questions almost daily.  Many nonprofits call themselves a “foundation” when in fact they are not…at least not technically.  In IRS terminology, a foundation is a specific type of 501c3 nonprofit, one that usually has no active programs.  True foundations typically raise money to fund the work of 501c3 “charities” that conduct actual programs.  And to further confuse the matter, a nonprofit corporation is the business entity type that most foundations and charities choose to adopt.  You will learn much more about how this all works once you get started with us. Ellis Carter says: November 12, 2010 at 1:39 am Nice post. This is a poorly understood concept that really needs more attention. Thanks for highlighting it. Have also blogged about this topic at https://bit.ly/a377mo John says: March 23, 2010 at 2:43 pm I am a member of a board that runs a 501c3 housing project.  It has been in existance for 35 years.  The board wants to sell it.  Where do the proceeds go?  Can we take a consulting fee?  We have never been compensated. Greg McRay, EA says: March 23, 2010 at 9:18 pm n all candor, there is no way to answer a question of this complexity in a few sentences.  I highly recommend that you contact us and reserve some consulting time to discuss your plans.  You have way too much at stake. Linda L says: August 30, 2009 at 5:55 pm My Dad and I have invested our lives savings and are working to start a non-profit Adult Daycare Facility.  Dad owns the building and the land outright, and I was wondering if it would be smart to keep that in his name and have the business rent from him?  That way, since we’re putting everything we have into this, he will still have something left.  What are the pro’s and con’s about this, besides saving on property taxes?  If we end up disolving some day and the building was part of the non-profit, would they also sell that and give it to another charity? Thanks for the help! Greg McRay, EA says: September 1, 2009 at 12:32 pm Hi, Linda… It is interesting that you use the term invested .  This is a tricky thing you are suggesting.  If you go forward with making the facility nonprofit (presumably 501(c)(3)), then neither you nor your father will “own” it.  It is technically possible to have the nonprofit rent the physical facility, but then you have potential conflict of interest problems if you all are running the program and owning the property.  I guess I’m failing to see what you are investing in.  It certainly isn’t the program, because you cannot profit from that.  If it is rental income, the lack of arms-length dealing will be a problem. I strongly counsel you to get some professional help before you go much further.  There are some serious landmines where you are headed.  Given the amount of personal money you are talking about, I would hate to see you all get in over your heads.  Our office offers time-based consultation for just this type of situation.  Just give our office a ring. Good luck to you! Cheryl says: July 22, 2009 at 2:59 pm So is it possible to start a non profit to help create jobs and do a service to the community. Greg McRay, EA says: July 29, 2009 at 11:24 am That’s a really broad question, but, in principle, yes.  There are lots of 501(c)(3) nonprofits which have as their purpose economic development, job training, etc.  The key is making sure that the organization’s activities do not directly benefit for-profit companies, but rather job seekers and/or the community at large. Elder Max Simmons says: July 22, 2009 at 1:23 pm {Organization Name Hidden} is a  non profit 501(c)(3) Public Charity , we have two years of successful operation behind us. My question is when we apply for credit the grantors almost always look past the corporation entity legal status and requires personal liability  from a officer of the Corporation. Is this legal in the state of Georgia? Greg McRay, EA says: July 29, 2009 at 11:28 am Most likely, yes.  It is very common for lenders to require principals of for-profits and nonprofits to “co-sign” for a loan.  This is done because the organization itself either is under-collateralized or has insufficient credit history…or both.  Given the current lending climate, expect those demands to increase, not decrease. Comments are closed. previous post: How to File a Form 990: Best Practices for Easy Preparation next post: Are You Misappropriating Your Nonprofit’s Funds? A Look At Restricted Donations Looking to start a nonprofit?  Foundation Group is your go-to resource for getting it done. Find out what 25,000 other nonprofits already know! Let's Get Started Our Services SureStart™ – Start a 501(c)(3) Start a Private Foundation Revoked 501(c)(3) Status Form 990 Preparation Charity Fundraising Registration Nonprofit Bookkeeping Services Assurance™ Compliance Membership Outsourcing Services for Professionals Recognized by Inc. 5000 as one of the fastest growing companies in America for 2023 & 2024! Learn CEO’s Blog FAQs Videos – 501(c)(3) University State-by-State Nonprofit Guidebook What is a 501(c)(3)? A Guide to Nonprofit Tax-Exempt Status How to Start a 501(c)(3) Private Foundation Education Fundraising TV Call Us Toll-Free 888-361-9445 About Us Our Company Our Team Members Our Mission and Commitments We’re Hiring! Follow Us on Social Media Twitter (deprecated) Facebook LinkedIn YouTube Sign Up for Our Newsletter! © Copyright 1995-2024, Foundation Group, Inc. Legal Disclaimer Privacy Policy Fulfillment Policy Contact Us Back To Top Search"
    },
    {
      "url": "https://www.amerilawyer.com/fl_501c3corporation.htm",
      "text": "501 C 3 Tax Exemption for Florida Non-Profit Corporation $209.95 501(c)(3) Tax Exemption Compliant for Florida Non-Profit Corporation $209.95 Price Includes State Filing Fee ! (INCLUDES FLORIDA STATE FILING FEES, ATTORNEY'S FEES, CORPORATE OR COMPANY SEAL AND BOOK, CERTIFICATE OR ARTICLES OF INCORPORATION OR ORGANIZATION, CORPORATE OR COMPANY MINUTES, BY LAWS, STATE AND 501(C)(3) CORPORATE RECORDS COMPLIANCE, MEMBERSHIP OR STOCK CERTIFICATE AND PRELIMINARY NAME SEARCH) For one low fee of $209.95, your Florida Non Profit 501(c)(3) Corporation is COMPLETE and INCLUDES Florida State Filing Fees. INCLUDES Preliminary Name Search. INCLUDES Company or Corporate Minutes. INCLUDES By Laws. INCLUDES Membership or Stock Certificate. INCLUDES Corporate or Company Seal and Book. INCLUDES State and 501(c)(3) Corporate Records Compliance. INCLUDES Certificate or Articles of Incorporation or Organization. Yes, even Includes Attorney's Fee (No Hidden Attorney Fees). What's the secret to such great prices? More great prices? Visit our Special Offers Page. Get Started Today ! INCORPORATE IN FLORIDA Click Here ! FORM YOUR 501C3 NON PROFIT ONLINE NOW! In order to qualify for possible 501(c)(3) status, you must first comply with the Internal Revenue Service Regulations. Spiegel & Utrera, P.A. will prepare your Articles of Incorporation, Corporate By-laws and other corporate documents with the proper information to comply with Internal Revenue Service Regulations. Getting Started: Information and Services for the success of your business from Spiegel and Utrera, P.A.: Starting a business is hard work. Creating a successful business is even harder. Donât let your business fail before it even gets off the ground. Let Spiegel & Utrera, P.A. help jump start your new enterprise and put you on the road to success. Scroll down to see valuable business information and all of the start-up services that Spiegel & Utrera, P.A. provide. Click on any of the links below to jump to that section. What is 501(c)(3) Tax Exemption? How to Build Your Business: Service Agreement â A MUST for any Service Business Spiegel and Utrera, P.A. General Counsel Club Veteran Owned Small Business (VOSB) certification Service Disabled Veteran Owned Small Business (SDVOB) Certification SBA (8a) Business Certification Florida Disadvantaged Business Enterprise (DBE) Certification Start-Up Essentials: Choosing a Name for Your Corporation Federal Tax ID Number State and 501(c)(3) Corporate Records Compliance 501(c)(3) Application for Exemption with Internal Revenue Service Convenient Installment Payments for Regular Processing Service Expedited Tax Exempt Status Application Convenient Installment Payments for Expedited Processing Service Exempt Your Non Profit Corporation from Florida Sales Tax Solicitation of Contributions Florida Sales Tax Number Anonymity Business License Bank Letter Florida Fictitious Name Mail Forwarding Service Premium Mail Forwarding Service Add-on Taxpayer Identification Number for Foreigners System for Award Management (SAM) Number D & B Number USDOT Number Certificate of Good Standing For Your Website Federal Copyright Your Website Your Website's Terms and Conditions Your Website's Privacy Policy E.U. Save Harbor Website Privacy Policy How to Save Money on Taxes: Tax Saving Lease Agreements: Home Office Motor Vehicle Office Equipment Spiegel and Utrera, P.A. General Counsel Club Effectively Controlling Your Business Non-Voting Members Voting Trust Stock Options Asset Protection / How to Protect Your Business: Indemnification Agreement Avoid Probate â Maintain Control, Provide for Anonymity, Privacy and the Disposition of the Ownership of your Corporation Upon Your Death Avoid Probate - Transfer on Death State Trademark or Servicemark What You Need if You are Hiring Workers: Florida Unemployment Tax Account Number Employment Agreement Employee Manual Employee Benefits & Policies Employee Warning Notice Florida New Hire Reporting Independent Contractor Agreement Sexual Harassment Prevention Policy Labor Law Notices â Florida Employers Obligation to Maintain and Report Records Daily/Weekly Time Record Notice of Acknowledgment of Pay Rate and Payday Authorization for Release of Information for Employment Screening Start-Up Money for Your Business: Lenderâs Agreement & Promissory Note Security Agreement for Corporation Perfecting the Lien Created by the Security Agreement Your Success Starts with Knowledge: Spiegel and Utrera, P.A. General Counsel Club Detours & Contradictions by Lawrence J. Spiegel Charlieâs Entrepreneurial Journey by Lawrence J. Spiegel Lease / Agreement Review Lease / Agreement Review Business Purchase Review Assets Corporate Stock Franchise Agreement Review Shipping and Speed of Service OUR GOALâYOUR Complete Satisfaction and Understanding Our goal is to provide each of our clients with as much information as possible about starting a 501(c)(3) Non-profit Corporation. As you will see as you review the following material, there is a lot of information to digest and consider. Many legal aspects may be complex and confusing. We want you to know we are available to speak with you about any legal aspects of the formation of your 501(c)(3) Non-profit Corporation at your convenience either over the telephone or in person at the Spiegel and Utrera, P.A., office nearest you. FORM YOUR 501C3 NON PROFIT CORPORATION ONLINE NOW! Donât become Another Business Statistic! SUCCESS STARTS WITH PLANNING! LET SPIEGEL & UTRERA, P.A. HELP YOU GROW YOUR BUSINESS. Many businesses fail to complete their initial year. Usually this is because the owners of the business simply lacked the knowledge necessary to run a successful enterprise. When you incorporate with Spiegel & Utrera, P.A. you become part of our family. As part of our family we are dedicated to see you and your business grow into a thriving enterprise. Below you will find valuable information and services to help you start your business. Many pitfalls that cause start-up businesses to fail are discussed and ways to avoid these pitfalls are recommended. Please take a minute to look over the information below. It just may save your business. WHAT IS 501(c)(3) TAX EXEMPTION? Return to Menu A 501(c)(3) organization is a non-profit corporation formed to carry out a charitable, religious, literary, educational or scientific purpose that is recognized by the Internal Revenue Service as tax exempt. Such a 501(c)(3) non-profit corporation doesnât pay federal or state corporate income tax on profits it makes from events carried out in furtherance of its exempt function . In essence, this is because both state and federal taxing authorities believe that the benefits the public receives from these organizations entitle them to this advantageous tax exempt status. These corporations are known as 501(c)(3) non-profit corporations because they are granted tax exempt status from Section 501(c)(3) of the Internal revenue Code. PUBLIC CHARITY OR PRIVATE FOUNDATION? â² Tax exempt 501(c)(3) non-profit corporations are classified as either a public charity or a private foundation . Generally, organizations that are classified as public charities are those that are churches, hospitals, qualified medical research organizations affiliated with hospitals, schools, colleges and universities; have an active program of fundraising and receive contributions from many sources, including the general public, governmental agencies, corporations, private foundations or other public charities; receive income from the conduct of activities in furtherance of the organizationâs exempt purposes; or actively function in a supporting relationship to one or more existing public charities. Private foundations, in contrast, typically have a single major source of funding (usually gifts from one family or corporation rather than funding from many sources) and most have as their primary activity the making of grants to other charitable organizations and to individuals, rather than the direct operation of charitable programs. Public charities are favored because the organization will not be a taxable entity as long as its activities are in furtherance and related to its specific tax exempt purposes , such as charitable, scientific, religious or educational or a combination thereof. Additionally, with 501(c)(3) tax exemption as a public charity, the organization will be allowed to receive tax free contributions and contributors will be permitted to deduct the contribution on their income tax returns. Section 501(c)(3) status would provide your non profit corporation with the benefits of public recognition of tax exempt status, which is particularly helpful for obtaining grants; advance assurance to potential donors of the deductibility of contributions; exemption from certain Federal excise taxes; and even non profit mailing privileges. The application process to obtain this tax-exempt status can be a very complex and tedious one. Therefore, we strongly recommend you seek the assistance of Spiegel & Utrera, P.A. in order to avoid any likely problems or undue delays in obtaining this status. Allow our office to take care of the whole process for you. Since our inception, Spiegel & Utrera, P.A., has assisted many clients in obtaining the tax exempt status from the IRS. How To Build Your Business Return to Menu Believe it or not, starting a business is more than just complying with regulations, at some point you have to go find customers! Building your business often gets lost when you are confronted with all of the other matters which must be taken care of. This should not be the case. Without customers you will not have a business for long! Two powerful business builders worthy of your consideration are below. Service Agreement - The Foundation for a Successful Service Business â You are LOSING $$$ without it! â² You are LOSING MONEY if you do not have a Service Agreement. Without a service agreement you are watching dollars walk away every day. Obtaining a first time customer is very expensive. Yet so many entrepreneurs let that customer walk away after the initial sale. This is a sure fire way to make your business fail. Successful entrepreneurs know that the key to starting a thriving enterprise is repeat business. It is far too costly and time consuming to build your business on first time customers alone. You MUST turn these first time customers into repeat customers. A service agreement is a solid investment in the future of your business and is a fast, easy, and cost effective way to make your business succeed. A service agreement works as a tool not only to secure repeat customers but also to market your business. The Service Agreement is a customized written agreement entered into with its customers and is the bedrock foundation of many service businesses . Many franchises sold for tens of thousands of dollars are business formats revolving around a successful Service Agreement. The key with a Service Agreement is to make it work as a marketing tool offering the business services in the widest variety of formats to your customers. For example, a one-time use customer needs to be converted to a monthly, quarterly or annual type repeat customer. At Spiegel & Utrera we want to help you get, and keep, your customers while looking professional and at the same time maximizing each sale with a friendly service agreement. A Service Agreement starts at $367.95 up to $897.95 depending upon its complexity if ordered at the time of forming your corporation. We will prepare a draft of your Service Agreement and deliver the draft by fax or email to you for your review. Once you have had an opportunity to review the Service Agreement we will meet over the telephone to discuss the various aspects of the draft Service Agreement. Thereafter, Spiegel & Utrera will make changes to the Service Agreement to finalize it. Once the Service agreement has been finalized and delivered to you, you should take it to your printer to be printed and padded so it will always look professional and non-negotiable. Spiegel & Utrera, P.A. General Counsel Club & Registered Agent Service with Attorney Client Privilege â² Experienced Legal Advice to Help You Save Money with Added Confidentiality Protection. Let Spiegel & Utrera, P.A. help you grow your business. Our firm has what we call the âGeneral Counsel Clubâ. Select this valuable service at the time of ordering your corporation and receive an additional one month Bonus â so that your first year of service will cover 13 months PLUS take a $50 discount, so you pay only $89.95 for the first 13 months of service. You get: Unlimited telephone consultations all year long on matters relating to legal and strategic business advice; Our firm will prepare the Notice and Minutes of your corporationâs Annual Meeting of Shareholders and Directors; Our firm will act as your corporationâs General Counsel; Our firm will comply with all statutes and applicable laws relating to your corporationâs Registered Agent & Registered Office. Be aware that when Spiegel & Utrera, P.A. serves as your General Counsel, Registered Agent and Registered Office, the Attorney-Client Privilege is in effect. What does this mean? For example, letâs say Spiegel & Utrera, P.A. receives a subpoena to produce information about the formation of your Corporation, LLC, Partnership or Trust because of alimony, child support, bankruptcy, debt collection, foreclosure, IRS, tax collection, government enforcement action, criminal matter or anything else, Spiegel & Utrera, P.A. is duty bound not to disclose any information contained in any client communications whether oral or written. That includes any order for a Corporation, LLC, Partnership or Trust and any communications, whether from you or Spiegel & Utrera, P.A. Communications between an attorney and client are privileged from disclosures and such attorney-client privileged information will not be disclosed. See Upjohn Co. v. United States, 449 U.S. 383 (1981). The attorney-client privilege recognizes that sound legal advice or advocacy serves public ends and that such advice or advocacy depends upon the lawyer being fully informed by the client. Trammel v. United States, 445 U.S. 40, 51, 100 S.Ct. 906,913, 63 L.Ed.2d 186 (1980). Further, the attorney-client privilege applies indefinitely and termination of attorney-client relationship does not terminate the attorney-client privilege. Swidler & Berlin v. United States, 524 U.S. 399 (1998). This is powerful legal precedent to have working for you and you can only obtain it from a lawyer. A non-lawyer Registered Agent or Registered Office service does not offer this valuable confidentiality protection; Our firm will review all mandatory State corporation filing documents as required by the Secretary of State; You will receive our firmâs newsletter, âEntrepreneurâs AlertÂ®â, which is published six times a year and provides valuable insight into running your business from a legal and business point of view. Veteran Owned Small Business (VOSB) Certification â² The Veteran Owned Small Business Certification is available for small businesses that are majority owned and managed by a veteran who is directly involved in the day-to-day operations. With this certification, veterans gain a competitive edge for winning government contracts and attracting customers. As a business group that is considered âdisadvantagedâ in the U.S., certifying your business can help in your present and future operations. Once your business is certified, you can join ConnXusâ database of diverse suppliers. This searchable platform makes it easy for large companies to find and select your business for their product and service needs. The next time a Fortune 2000 company is looking for a certified-diverse business, youâll be in the best position to meet their needs. The fee for the Veteran Owned Small Business Certification if ordered at the time of formation of the company is $750. Service Disabled Veteran Owned Small Business (SDVOB) Certification â² The purpose of the Service Disabled Veteran Owned Small Business Certification is to provide procuring agencies with the authority to set acquisitions aside for exclusive competition among service disabled veteran owned small business concerns, as well as the authority to make sole source awards to service disabled veteran owned small business concerns. In order to be eligible for the Service Disabled Veteran Owned Small Business Certification, you and your business must meet the following criteria: the Service Disabled Veteran must have a service-connected disability that has been determined by the Department of Veterans Affairs or Department of Defense; the Service Disabled Veteran Owned Small Business must be small under the North American Industry Classification System code assigned to the procurement; the Service Disabled Veteran must unconditionally own 51% of the Service Disabled Veteran Owned Small Business; the Service Disabled Veteran must control the management and daily operations of the Service Disabled Veteran Owned Small Business; and the Service Disabled Veteran must hold the highest officer position in the Service Disabled Veteran Owned Small Business. Once your business is certified, you can join ConnXusâ database of diverse suppliers. This searchable platform makes it easy for large companies to find and select your business for their product and service needs. The next time a Fortune 2000 company is looking for a certified-diverse business, youâll be in the best position to meet their needs. The fee for the Service Disabled Veteran Owned Small Business Certification if ordered at the time of formation of the company is $750. SBA (8a) Business Certification â² SBA (8a) is an ownership/diversity certification sponsored by the Small Business Association (SBA) of the United States government. This certification is intended for organizations that are owned and controlled at least 51% by socially and economically disadvantaged individuals. You must be an economically disadvantaged person. For the 8(a) program this means all applicant individuals must have a net worth of $250,000 or less, excluding the value of the business and personal residence. You must be in business for at least two years or apply for a waiver of the two-year requirement. SBA may waive the two years in business requirement if each of the following five conditions are met: The individual or individuals upon whom eligibility is based have substantial business management experience; The applicant has demonstrated technical experience to carry out its business plan with a substantial likelihood for success if admitted to the 8(a) BC program; The applicant has adequate capital to sustain its operations and carry out its business plan as a Participant; The applicant has a record of successful performance on contracts from governmental or nongovernmental sources in its primary industry category; and The applicant has, or can demonstrate its ability to timely obtain, the personnel, facilities, equipment, and any other requirements needed to perform contracts as a Participant. The fee for the SBA (8a) Certification if ordered at the time of formation of the company is $750. Florida Disadvantaged Business Enterprise (DBE) Certification â² The Florida DBE Program, is intended to remedy past and current discrimination against disadvantaged business enterprises, ensure a level playing field and foster equal opportunity and non-discrimination in State assisted contracts, improve the flexibility and efficiency of the DBE program, and reduce burdens on small businesses. Your business can qualify for this certification if: The owner is a member of a socially and economically disadvantaged presumptive group (Black Americans, Hispanics, Native Americans, Asian-Pacific and Subcontinent Asian Americans, or women, and Your business is a for-profit business at least 51%-owned by a socially and economically disadvantaged individual(s) who also controls the firm, and, The disadvantaged owner a U.S. citizen or lawfully admitted permanent resident of the U.S., and, Your firm is a small business that meets the Small Business Administration's (SBA's) size standard and does not exceed $23.98 million in gross annual receipts, and, Your personal net worth is less than $1.32 million. The fee for the Florida Disadvantaged Business Enterprise Certification if ordered at the time of formation of the company is $750. Start-Up Essentials Return to Menu Many new business owners donât realize what is required to legally conduct business in Florida. The last thing you want is to lose your business because you didnât know that you needed register a fictitious name. Below are some of the most common items that new businesses need in order to be compliant with the state of Florida and other services that you may find advantageous for your business. Choosing a Name for Your Corporation Choosing a name for your Corporation should be a well thought our process. Generally, a Corporation name may be adopted if there is not the same as or too similar to an existing name on the state Corporation records. When determining name availability, Spiegel & Utrera, P.A. checks names only against names of corporations registered in the state you are attempting to form your Corporation (e.g., a proposed corporation name is checked for availability only against other like corporation names) and only with the state agency responsible for corporate formations. Names are not checked against state or federal trademark or service mark registrations nor against state or local fictitious, assumed or alternate business name registrations. Bank accounts, uniforms, menus, vehicle signage and other business signage, a website, business cards, stationery, etc. should not be ordered and no financial commitments should be made until you know the name is available from the State and Federal, State and Common Law Trademark searches you have completed. Avoid the ramifications of selecting a corporate name that is already in use by another and possibly prevent: A lawsuit being filed against you and your business for federal or state trademark infringement; Loss of business due to a subsequent change of name; The embarrassment of being served legal papers during business hours in front of employees and customers; The cost of changing the corporate name through the process of an amendment; The cost of changing all marketing materials that are utilized when operating a business such as bank accounts, uniforms, menus, vehicle signage and other business signage, a website, business cards, stationery, etc. Overwhelming stress upon you and the business denies your business the focus, energy and financial resources that are necessary to see that your business succeeds. Selecting someone elseâs corporate name can be a very expensive business lesson that can be avoided. Avoid the problem of having you and your Corporation accused of Trademark Infringement and the possible litigation stemming from State and/or Trademark Infringement by allowing Spiegel & Utrera, P.A. to do the appropriate state and federal trademark searches as follows: Federal Trademark or Servicemark Search and Attorney Opinion A search of the United States Government's records including Marks that have been registered and are currently pending registration and an opinion as to the results of the search. Up to 3 words - $275. More than 3 words would be $50 per additional word. State Trademark or Servicemark Search and Attorney Opinion The state search includes a thorough examination of Trademarks registered in a particular state and an opinion as to the results of the search. The price for a Trademark search is $99.95 per State for up to three words. More than 3 words would be $50 per additional word per state. Common Law Trademark Search and Attorney Opinion Search includes Marks that are in use but may not be registered with the United States Government or a State and an opinion as to the results of the search. The results of a Common Law Search can be very important because whoever uses a Mark first generally has a superior right to the name - $250. Combo Search and Attorney Opinion Combo search includes the U.S. Government, one State and Common Law search and an opinion as to the results of the search. This assures the most comprehensive investigation. The Mark must only consist of up to three words - $524.95. You receive a savings of $100 by ordering these searches now. More than 3 words would be $50 per additional word per state. Additional states are $50 per state. Federal Tax ID Number â Required for a Business Bank Account â² The equivalent of a social security number for a Corporation. You will need it to operate your business and open a bank account for the Corporation. We can obtain this number for you and the advantage of allowing us to get it for your Corporation, is that we will deliver it with your Corporation for only $35 so you may Open your bank account immediately! State and 501(c)(3) Corporate Records Compliance [MANDATORY AND INCLUDED AT NO ADDITIONAL COST] â² Your Articles of Incorporation, Corporate By-laws and other corporate documents must include the proper information to comply with Internal Revenue Service Regulations. Also, typically states have statutes that address specific types of entities, such as credit unions and other financial organizations. Spiegel & Utrera, P.A. will draft your Articles of Incorporation, Corporate By-laws and other corporate documents for compliance with the requirements needed to meet the definition of a tax exempt organization at the federal level as well as for the specific type of entity at the state level. Or, if you have an existing non profit corporation where the Articles of Incorporation and other documents do not meet the requirements, we can amend your Articles and draft the appropriate corporate documents. The fee to prepare a Florida Non Profit Corporation with the required provisions for federal tax exemption as well as state compliance is normally $100 for one half hour of legal research and analysis at the Firmâs standard billing rate. Further research and analysis may be required, but it has been the Firmâs experience that extra fees may not be needed. 501(c)(3) Application for Exemption with Internal Revenue Service â² Once your corporation is registered with the State of Florida, the next step in obtaining 501(c)(3) qualification is to file the IRSâ Application for Recognition of Exemption under Section 501(c)(3) of the Internal Revenue Code. Section 501(c)(3) status would provide your non profit corporation with the benefits of public recognition of tax exempt status, which is particularly beneficial for obtaining tax deductible contributions and grants; exemption from certain Federal excise taxes; and even non profit mailing privileges. The application process to obtain this tax-exempt status can be a very complex and tedious one. Therefore, we strongly recommend you seek the assistance of Spiegel & Utrera, P.A. in order to avoid any likely problems or undue delays in obtaining this status. We, at Spiegel & Utrera, P.A., are prepared to assist you in this application process in order to ensure you that all of the necessary documents are completed and submitted in compliance with IRSâ requirements. The typical application process may take 6 to 9 months . The fee to represent you in applying for formal recognition with the Internal Revenue Service is $1,500 (not inclusive of the IRS tax exempt application processing fee ) if selected at the time of formation of your corporation, $1750 thereafter. Our services include assisting you in completing the documentation necessary for submission to the IRS as well reasonable assistance in responding to requests for additional information. If other services are needed, additional fees will apply. It has been our experience that in most cases additional fees are not needed. Convenient Installment Payments for Regular Processing Service â² The typical application process may take 6 to 9 months. We offer the option that you pay the fee for our services in installments. The regular $1500 fee to represent you in applying for formal recognition with the Internal Revenue Service when selected at the time of formation of your corporation can be paid in four installments of $425 (includes a $50 service and processing charge per installment) for a total of $1700. If the installment method is selected, final submission of application documents to the IRS will not take place until payment in full is made and received. There will be no installment payment methods for the IRS tax exempt application processing fee. The typical application process may take 6 to 9 months. The regular $1750 fee to represent you in applying for formal recognition with the Internal Revenue Service when selected after formation of your corporation can be paid in four installments of $487.50 (includes $50 service and processing charge per installment) for a total of $1950. If the installment method is selected, final submission of application documents to the IRS will not take place until payment in full is made and received. There will be no installment payment methods for the IRS tax exempt application processing fee. Expedited Tax Exempt Status Application â² In anticipation of contributions, grants or other funding sources, many of our clients are eager to expedite the tax exemption application, as the typical application process may take 6 to 9 months. In order to request that the application be expedited, there has to be a compelling reason for such expedited treatment, such as a pending grant where the failure to secure the grant may have an adverse impact on the organization's ability to continue operations; the organizationâs purpose is to provide disaster relief to victims of flood and hurricane; undue delay because of IRS workflow scheduling; or any other situation where the IRS deems expedited service to be warranted. Our Firm can assist you in expediting the process so that it may take half the normal processing time or less for a fee of $2750. Convenient Installment Payments for Expedited Processing Service â² We offer the option that you pay the fee for our services in installments. If you select the installment payment method, two payments of $1425 (includes $50 service and processing charge per installment) may be made for a total of $2850. There will be no installment payment methods for the IRS tax exempt application processing fee. The expediting process is subject to IRS approval. Exempt Your Non Profit Corporation from Florida Sales Tax â² Non Profit Organizations such as religious, charitable, scientific, educational or veteran organizations, as defined in Florida Statutes, do not have to pay sales tax on certain purchases. Additionally, qualified religious institutions are not required to collect and remit sales tax on the sale or lease of tangible personal property. Let Spiegel & Utrera, P.A. prepare the required documentation for your 501(c)(3) or religious organization to obtain this valuable tax status. The fee to prepare the documents is $35 when included as part of your incorporation package. Solicitation of Contributions â² If your corporation will engage in the solicitation of contributions from the general public, the non-profit corporation must register with the State of Florida. The fee to prepare the registration documents in conjunction with the corporation is $250. Florida Sales Tax Number - Avoid State of Florida Sales Tax â² This account number allows you to buy goods for resale or export and not pay \n\tany State of Florida sales tax. We can initiate the documentation for you to \n\tobtain this number. The fee to prepare the documents is $267.95 when included as part of your incorporation package. Anonymity â Retain Your Personal Privacy â² For privacy reasons, many clients prefer not to disclose their identity when filing a company. This can be accomplished with our anonymous company filing. This service is only available at the time of filing your company. The additional fee for this service is a one time charge of $50. Please note that in Florida many banks, Florida Department of Revenue - Sales Tax Division and the Florida Bureau of Worker's Compensation require the Officers of a Corporation not be anonymous. However, you may still take advantage of this anonymity by insuring that the Corporation Director(s) will remain anonymous along with the Shareholder(s)/Owner(s). Business License â² The Business License package will give you the license, permit & tax registration information as well as the actual applications for your business. The package is complete and will provide you with an overview of the licenses, permits and tax registration required for your business. Licensing authority, contact information, including name, address, telephone number, etc. Detailed information on how much money to send with each application and where to send it.The actual license, permit and tax registration applications and associated documents. The charge for this service if ordered at the time of forming your Corporation is $99.95. Bank Letter â Facilitate the opening of your Corporation's Initial Bank Account â² This is an attorney opinion letter prepared by Spiegel & Utrera, P.A. to assist and facilitate the opening of your Corporationâs initial bank account. Due to heighten security, identify theft and fraud, many Banks require substantiation from the Corporationâs attorney as to the identities of the Corporationâs Shareholders, Directors and Officers. Spiegel & Utrera, P.A. will prepare and execute an Attorney Opinion Letter identifying your Corporationâs Shareholders, Directors and Officers. This Bank Letter will then be presented by you at any Bank you chose to open your Corporationâs initial Bank Account. You should be aware that this Attorney Opinion Letter is time sensitive and should be presented at a Bank within a reasonable period of time after you receive your Corporate Book and Records from Spiegel and Utrera, P.A., otherwise a Bank may not accept the letter. The charge for the Bank Letter, if ordered at the time of forming your Corporation, is $149.95. It is very important to understand that if you do not order the Attorney Opinion Letter at the time of forming your Corporation but order it after the delivery of your Corporate Records and Book, the charge for the Attorney Opinion Letter will be $499.95. Please understand this increased charge is necessitated because of the additional work which must be undertaken by Spiegel & Utrera, P.A. including public records examination, the return by you of the Corporate Records and Book to Spiegel & Utrera, P.A. for review and examination and the preparation of statements and/or affidavits which must be prepared by Spiegel & Utrera, P.A. for execution by you so as to enable Spiegel & Utrera, P.A. to prepare the Attorney Opinion Letter. Florida Fictitious Name â Required if Conducting Business in a Name other than the Full and Complete Corporate Name â² If your company will hold itself out to the public, operate a website, engage in marketing or operate its business under any name other than its full and complete legal name, it is required by law, to register what is known as a Fictitious or Assumed Name. This name is commonly called a dba or doing business as. Our service is complete and includes a name search of your fictitious name, preparation of all company resolutions, a publication kit and affidavit along with the filing of all documents and payment of all filing fees to the State of Florida. If ordered at the time of forming your company, we offer this service for an additional $149.95 for two week service; $224.95 for 3 day service and $299.95 for next day service. Please bear in mind that the service completion time begins with the formation of your new company and relates to the preparation of the documentation by Spiegel & Utrera, P.A. Mail Forwarding Service â Get Your Business Up and Running, Even without a Physical Location â² If you have not set up your company office or you want your attorney to receive your company mail, you may use any Spiegel & Utrera, P.A. office address as your mailing address. Our mail forwarding service is only $15 per month. There is a six month minimum order. However, the mail forwarding service may only be cancelled in writing. There is also an initial postage deposit of $25, additional postage/shipping, if any, will be billed separately. In order to participate in Spiegel & Utrera, P.A.'s Mail Forwarding Service, your company must complete an Application for Spiegel & Utrera, P.A.'s Mail Forwarding Service. The application will be emailed to you after the formation of your entity. For our mail forwarding service terms and conditions, click here Premium Mail Forwarding Service Add-on â (Username and Password Protected, Uploaded to a Secure Internet Folder) â² Once you have ordered our Mail Forwarding Service, you may also select our Premium Mail Forwarding Service add-on. When you have the Spiegel & Utrera, P.A. Premium Mail Forwarding Service add-on, we will open your Certified, Registered and First Class Mail and upload it to a secure Internet folder for you to review or download. You will be assigned a Username and Password to access your secure Internet folder. The charge for the Spiegel & Utrera, P.A. Premium Mail Service is $40 per month with a six month minimum order and you must maintain an active mail forwarding service. The mail forwarding service add-on includes up to 20 mail pieces or up to 100 scans per week. There after additional charges shall apply. Taxpayer Identification Number for Foreigners - For Resident and Non-Resident Aliens â² An Individual Taxpayer Identification Number is a tax processing number only available for certain nonresident and resident aliens, their spouses and dependants who cannot get a Social Security Number. It is a 9-digit number, beginning with the number â9â, formatted like a Social Security Number (NNN-NN-NNNN). Spiegel & Utrera, P.A. will prepare all the documentation necessary for you in order to obtain your Individual Taxpayer Identification Number. At AmeriLawyer, we have been approved as a Certifying Acceptance Agent by the United States Department of the Treasury , Internal Revenue Service. As such, we are authorized to expedite the processing of your Individual Taxpayer Identification Number. The charge for this service is $299.95. USDOT Number â² Companies that operate commercial vehicles transporting passengers or hauling cargo in interstate commerce must be registered and must have a USDOT Number. A USDOT Number is generally for vehicles involved in interstate commerce that have a gross combination weight of 10,0001 pounds or more or designed or used to transport more than 8 passengers (including the driver) for compensation or designed or used to transport more than 15 passengers (including the driver) and is not used to transport passengers for compensation. Also, commercial intrastate hazardous materials carriers who haul quantities requiring a safety permit must register for a USDOT Number. If ordered at the time of forming your Corporation, the fee for a USDOT Number is $367.95 plus applicable government application fee depending upon your particular activities. Certificate of Good Standing â² A Certificate of Good Standing is a document issued by the state that shows that your Corporation has met its statutory requirements and is authorized to do business in that state. Among other things, a Certificate of Good Standing confirms that your Corporation is up to date on its state fee payments, has filed its annual report and has paid its franchise taxes. Certificates of Good Standing are frequently requested by state governments if you are applying for a foreign qualification in that state, lenders when you are trying to obtain financing, banks for certain transactions, and evidence in order to obtain or renew licenses or permits. If ordered at the time of forming your Corporation, the fee for a Certificate of Good Standing is $67.95 for regular service of approximately 3 to 5 business days or $142.95 for expedited service of 1 to 2 business days. For Your Website Return to Menu Federal Copyright Your Website â This shows everyone that your website is copyrighted and that it is protected under federal law â² A Federal Copyright is a form of protection provided by the laws of the United States for certain intellectual works. There are many reasons why you should copyright your website. One is because you wish to have the federal copyright in the public record and because before an infringement suit may be filed in court, registration is necessary for works originating in the United States. Also, your copyrighted and registered material may be eligible for statutory damages and attorneyâs fees during litigation. If you register your website, that registration is in and of itself enough evidence to prove your ownership of the website. Once you have registered your website as a federal copyright, you may place the federal copyright symbol &copy; your website. This shows everyone that your website is copyrighted and that it is protected under federal law. The charge for the Federal Copyright registration, if done at the time of incorporating, is $239.95, plus any government filing fee which will be paid at the time of the filing of the copyright registration. Your Website's Terms and Conditions â Legally binding and helpful to maintain a high level of community trust â² Establishing a website can create a myriad of issues regarding potential liabilities for both user and the owner of the website. By using your website, the user must agree to abide by your Terms and Conditions. When prepared properly, your Terms and Conditions are legally binding and helpful to maintain a high level of community trust because of transactions and/or interactions taking place. The goal of providing Terms and Conditions is to disclose to users your policies on a number of different issues. The Terms and Conditions Spiegel & Utrera, P.A. will prepare for your website will include: Basic Terms; Content of the Services; User Obligations; Company Rights; Restrictions on Content and Use of Services; Copyright Policy; Special Provisions required by your business model; Advertisers; Links; Cookies; Limitation of Liability; Disclaimer; Waiver and Severability; Dispute Resolution; Notices and Service of Process; Complaints; Controlling Law and Jurisdiction; Amendments and Notice of Changes and Entire Agreement Provisions. The preparation of Terms and Conditions for your website costs only an additional $349.95 when ordered with the formation of your Corporation and initially comes to you for review so you may have an opportunity to make any revisions thereto before being finalized by Spiegel & Utrera, P.A. and delivered to you electronically so you may easily post it on your website. Your Website's Privacy Policy â Legally binding and helpful to maintain a high level of community trust â² Establishing a website can create a myriad of issues regarding potential liabilities for the owner of the website. During the use of your website, the user must understand the Privacy Policy of your website. When prepared properly, the Privacy Policy is legally binding and helpful to maintain a high level of community trust because of transactions and/or interactions taking place. The goal of providing the Privacy Policy is to disclose all of the ways your website will respect the dignity of the userâs privacy. The Privacy Policy prepared by Spiegel & Utrera, P.A. for your website will include: Statement of Rights and Responsibilities; Sharing your Content and Information; Collection and Use of Information; Public Information; Registration and Account Security; Profile Content; Safety; Amendments; Limitation of Liability; Disclaimer; Waiver and Severability; Dispute Resolutions; Notices and Service of Process; Complaints; Controlling Law and Jurisdiction; Amendments and Notice of Changes and Entire Agreement Provisions. The preparation of Privacy Policy for your website costs only an additional $349.95 when ordered with the formation of your Corporation and initially comes to you for review so you may have an opportunity to make any revisions before being finalized by Spiegel & Utrera, P.A. and delivered to you electronically so you may easily post it on your website. E.U. Safe Harbor Website Privacy Policy â² The European Commissionâs Directive on Data Protection went into effect in October of 1998, and would prohibit the transfer of personal data to non-European Union countries that do not meet the European Union (E.U.) âadequacyâ standard for privacy protection. While the United States and the E.U. share the goal of enhancing privacy protection for their citizens, the United States takes a different approach to privacy from that taken by the E.U. In order to bridge these differences in approach and provide a streamlined means for U.S. organizations to comply with the Directive, the U.S. Department of Commerce in consultation with the European Commission developed a âsafe harborâ framework. If your corporation will be doing business with customers in the European Union, the privacy policy with the U.S.-E.U. Safe Harbor compliance, a number of important benefits will flow to your corporation including: All 28 Member States of the European Union will be bound by the European Commissionâs finding of âadequacyâ; Participating organizations will be deemed to provide âadequateâ privacy protection; Members State requirements for prior approval of data transfers either will be waived or approval will be automatically granted; Claims brought by E.U. citizens against U.S. organizations will be heard, subject to limited exceptions, in the U.S. and; Compliance requirements are streamlined and cost-effective, which should particularly benefit small and medium enterprises. The preparation of the initial documentation to have your corporation websiteâs privacy policy compliant with U.S.-E.U. Safe Harbor provisions cost only an additional $449.95 when ordered with the formation of your corporation and will be electronically delivered to you so you may easily post it on your corporation's website. How To Save Money On Taxes Return to Menu One of the most misunderstood and least used benefits to new entrepreneurs are the tax savings offered to them. Although there are many ways that you can save money on taxes, you must be in compliance with all regulations and laws; otherwise you may find yourself losing your business instead of saving money. Below are some of the ways that you can save money on Taxes: TAX SAVING LEASE AGREEMENTS Return to Menu Home Office Lease - Turn your home office into a Tax Deduction â² Agreement detailing the leasing of office space by a homeowner or tenant with a corporation for use as the Corporation's principal place of business. The typical tax savings under this agreement can exceed $1,200. â per year. The Home Office Lease is only $150. when ordered with your Corporation, and as an added bonus to our clients, we draft the Lease in such a manner that it is automatically renewable. We do not recommend a home office lease for a single owner corporation or single owner limited liability company or a where husband and wife file a joint tax return and are the only owners of the corporation or limited liability company. Motor Vehicle Lease â Turn Your Personal Car into a Tax Deduction â² If you use your vehicle for business purposes, it is usually much more advantageous to keep the vehicle in your name and lease the vehicle to the Corporation The typical tax savings under this type of arrangement ranges between $1,500. and $3,000. per tax year. We can prepare the lease for only $150. when ordered with your Corporation. We do not recommend a motor vehicle lease for a single owner corporation or single owner limited liability company or where a where husband and wife file a joint tax return and are the only owners of the corporation or limited liability company. Office Equipment Lease â More Tax Savings â² A lease which details the leasing of office equipment by a business. Once again, by leasing equipment to the Corporation, you create a legitimate business expense for the Corporation and a Tax Deduction. Typically, the tax savings under this type of arrangement can exceed $1,000 per tax year. The cost for an Office Equipment Lease is only $150. when ordered with your Corporation. We do not recommend an office equipment lease for a single owner corporation or single owner limited liability company or a where husband and wife file a joint tax return and are the only owners of the corporation or limited liability company. Spiegel & Utrera, P.A. General Counsel Club & Registered Agent Service with Attorney Client Privilege â² Experienced Legal Advice to Help You Save Money with Added Confidentiality Protection. Let Spiegel & Utrera, P.A. help you grow your business. Our firm has what we call the âGeneral Counsel Clubâ. Select this valuable service at the time of ordering your corporation and receive an additional one month Bonus â so that your first year of service will cover 13 months PLUS take a $50 discount, so you pay only $89.95 for the first 13 months of service. You get: Unlimited telephone consultations all year long on matters relating to legal and strategic business advice; Our firm will prepare the Notice and Minutes of your corporationâs Annual Meeting of Shareholders and Directors; Our firm will act as your corporationâs General Counsel; Our firm will comply with all statutes and applicable laws relating to your corporationâs Registered Agent & Registered Office. Be aware that when Spiegel & Utrera, P.A. serves as your General Counsel, Registered Agent and Registered Office, the Attorney-Client Privilege is in effect. What does this mean? For example, letâs say Spiegel & Utrera, P.A. receives a subpoena to produce information about the formation of your Corporation, LLC, Partnership or Trust because of alimony, child support, bankruptcy, debt collection, foreclosure, IRS, tax collection, government enforcement action, criminal matter or anything else, Spiegel & Utrera, P.A. is duty bound not to disclose any information contained in any client communications whether oral or written. That includes any order for a Corporation, LLC, Partnership or Trust and any communications, whether from you or Spiegel & Utrera, P.A. Communications between an attorney and client are privileged from disclosures and such attorney-client privileged information will not be disclosed. See Upjohn Co. v. United States, 449 U.S. 383 (1981). The attorney-client privilege recognizes that sound legal advice or advocacy serves public ends and that such advice or advocacy depends upon the lawyer being fully informed by the client. Trammel v. United States, 445 U.S. 40, 51, 100 S.Ct. 906,913, 63 L.Ed.2d 186 (1980). Further, the attorney-client privilege applies indefinitely and termination of attorney-client relationship does not terminate the attorney-client privilege. Swidler & Berlin v. United States, 524 U.S. 399 (1998). This is powerful legal precedent to have working for you and you can only obtain it from a lawyer. A non-lawyer Registered Agent or Registered Office service does not offer this valuable confidentiality protection; Our firm will review all mandatory State corporation filing documents as required by the Secretary of State; You will receive our firmâs newsletter, âEntrepreneurâs AlertÂ®â, which is published six times a year and provides valuable insight into running your business from a legal and business point of view. Effectively Controlling Your Business Return to Menu Non-Voting Members â² Depending on the level of participation of the organizers of the non-profit corporation, you may wish to have non-profit corporation members that participate but refrain from voting. Weâll draft a special provision for your Articles of Incorporation. This item costs only an additional $74.95 if ordered at the time of Incorporation. Voting Trust â Keeping Control of Your Corporation when there are Multiple Shareholders â² A voting trust is a device for combining the voting power of shareholders. It is not unlawful for shareholders to combine their voting stock for the election of directors so as to obtain or continue the control or management of a corporation. Florida Statutes limit the duration of voting trusts to a period of ten years. In order to avoid the invalidation of a voting trust, the applicable statutes should be strictly complied with. There are various situations in which a voting trust agreement may be used. It may be used when several shareholders wish to vote their respective stock as a unit. It also may be used for the special purpose of protecting corporate creditors. The general plan of a voting trust is controlled by the voting trust agreement; then the shareholders endorse their stock certificates to the voting trustee. The voting trustee surrenders these certificates to the corporation and the voting trustee receives in return new certificates issued in the name of the voting trustee, and the voting trustee votes the shares as principal, rather than as agent as in the case of proxies. For tax purposes, the voting trust certificate takes the place of the stock it represents. Tax transactions with respect to voting trust certificates are treated as transaction affecting the stock. A voting trust is not an association taxable as a corporation, because in itself it is not an enterprise for the carrying on of business for profit. Used correctly, the Voting Trust could be a useful tool for your corporation. The charge for Spiegel and Utrera, P.A. to form a Voting Trust for your company is only $767.95 if ordered at the time of incorporation. Stock Options â Control Your Corporation while Raising Money â² An option to buy stock gives the holder the exclusive right for a specified period of time to purchase stock at the price and under the terms and conditions specified in the agreement. Although the option grantor is bound by the option and generally cannot revoke it, the option holder is not bound unless he exercises the option. Options are regarded as capital assets if the underlying property constitutes, or if acquired would constitute, a capital asset in the hands of the holder. The receipt of consideration for the option is not taxable until the option either is exercised or has lapsed. If the option is exercised, the consideration is treated as part of the selling price and included in computing the gain or loss in the sale of the stock. Since stock is generally a capital asset, gain or loss on the sale would be entitled to capital treatment, either long-term or short-term. The holding period for qualification for long-term capital treatment is more than one year. The sellerâs holding period for the stock sold includes the period during which the option is outstanding. Upon the failure of the option holder to exercise the option, if the consideration is forfeited, the option grantor generally realizes short-term capital gain, but income is not realized until the time of forfeiture. An option holderâs gain or loss upon a sale of the option, or loss upon a failure to exercise the option, would be entitled to capital gain treatment. The holding period of the option will determine whether long-term or short-term capital gain or loss is realized. For this purpose, if the loss is attributable to a failure to exercise the option, the option is deemed to have been sold on the day it expired. If the option is exercised, the consideration for the option is treated as part of the purchase price and is included in the option holderâs basis for the stock purchased. The purchaserâs holding period does not include the period curing which the option is outstanding. Stock options can be utilized very effectively by an entrepreneur, for example: Stock is given to an employee, but if he leaves the employ, the corporation has the option to repurchase the employees stock at fixed or variable price. Stock in the corporation is sold to raise needed capital, but the corporation has the right to repurchase the stock in the future. For whatever reason a person would like to be a shareholder in the corporation but not now, an option to purchase stock is purchased from the corporation. The stock option can be an on-target management incentive or control device. Stock options can be used in employment agreements, consultants agreements, incentive agreements, as means of raising equity capital or borrowing funds. Spiegel and Utrera, P.A. will provide the Stock Option service for your business for only $367.95 if ordered at the time of incorporation. Asset Protection / How to Protect Your Business Return to Menu As a new entrepreneur, you are going to invest a lot of time and money into your business. It is imperative that you protect yourself and your business from anything that could go wrong. One of the keys to being a successful entrepreneur is proactively planning for the worst situation, not reacting to the situation after it has happened. Below are items imperative for the protection of you and your business. Indemnification Agreement and Covenant Not to Sue â Donât Take Chances: Protect Yourself from Personal Liability â² We strongly recommend that you include special provisions in your Articles of Incorporation, which would provide vital protection requiring the Non-Profit Corporation to indemnify and hold harmless it's Directors and Officers from any actions they take on behalf of the organization. If a Director or Officer is ever sued for such actions, these provisions would require that the Non-Profit Corporation be held responsible and not that particular Director or Officer individually. This protection is especially important considering that without it a newly elected Director or Officer could be held liable for the decisions and actions carried out by the predecessors who once held the very same position. These important provisions and agreements cost only an additional $75 if ordered at the time of Incorporation. Avoid Probate â Maintain Control, Provide for Anonymity, Privacy and the Disposition of the Ownership of your Corporation Upon Your Death â² Let Spiegel & Utrera, P.A. create an Ownership Trust while your Corporation is in the process of being formed. The Ownership Trust will own your Corporation, you will own the Ownership Trust. The benefits are many: (1) the ownership of your Corporation is held anonymously by the Ownership Trust; (2) the Ownership Trust is private and not filed in the public records; (3) your Ownership Trust may be modified, amended to revoked at any time during your lifetime so you may change the beneficiary of the Ownership Trust as many times as you like and, thereby, the ownership of your Corporation; (4) PROBATE IS AVOIDED and the ownership of the Corporation will be transferred immediately according to your wishes upon your death. The Ownership Trust is relatively inexpensive to form, $350 if ordered at the time of establishing your Corporation. The price includes one Trustee, one Successor Trustee and two Beneficiaries. Additional Trustees, Successor Trustees or Beneficiaries are $50 each. If not ordered at the time of establishing your Corporation, the Ownership Trust is $749.95 Avoid Probate - Transfer on Death â² The Transfer on Death designation is an agreement entered into between a \n\tShareholder of the Corporation and the Corporation so that upon the death of \n\tthe Shareholder, a transfer of the shares owned by the Shareholder would \n\ttake place without going through probate. The Transfer on Death designation \n\tis possible because of the Florida Uniform Transfer on Death Security \n\tRegistration Act. The charge for the Transfer on Death Registration \n\tdocumentation, minutes, resolutions and stock certificates is $350.00 if \n\tordered at the time of formation of the Corporation. State Trademark or Servicemark â Prevent copycats from confusing your customers and damaging your reputation. â² A distinctive mark that customers associate with your products, services or website is very valuable. Registering your State of Florida Trademark or Servicemark will prevent copycats from confusing customers and damaging your reputation. The State of Florida Trademark or Servicemark registration process generally takes less than 4 weeks to complete. There are many reasons to register a State Trademark or Servicemark: A name or logo in many cases overtime becomes a company' s most valuable asset. The registering a State Trademark or Servicemark prevents others from adopting your name or design and gives you very favorable enforcement powers throughout the State, allows you to put everyone on notice with the Trademark symbol âTMâ or Servicemark symbol âSMâ, allows you to advertise and promote your mark and build name recognition and goodwill for your business with out fear of losing the mark to another, and may subject the copycat to injunction, profit disgorgement and attorney's fees if litigation is necessary to prevent such a copycat from using your mark. The charge for the State of Florida Trademark or Servicemark registration, if done at the time of incorporating, is $205.95. This charge includes all government filing fees. What You Need if You are Hiring Workers Return to Menu If you are planning to have anyone work for your company, whether as an employee or independent contractor, you must make sure that you are in compliance with all Federal and Florida laws. Below are the most common items that you will require when hiring workers for your company. Florida Unemployment Tax Account Number â Required By Law if you are Hiring Employees â² This number is used to withhold Florida Unemployment Taxes from your Corporation's payroll. If you have any employees on the payroll, including yourself, you will need this account number. We can initiate the documentation for this account number for you and deliver it with the corporation. The cost at the time of incorporating is only $35. Employment Agreement - Get the Most Out of Your Employees â² If you are using employees in your business, it is important to have a written Employment Agreement to document the conditions of Employment. An Employment Agreement can be very advantageous for a business and should be required for all employees, whether new or existing. It creates a clear understanding of the arrangement between the employee and the Corporation and provides protection for the business. The Employment Agreement also contains other important provisions: It spells out the terms of employment, such as the duties, responsibilities and compensation of the employee. It states that the employee will not compete against the Corporation for a specific period of time after leaving its employment. It prohibits the employee from disclosing any of the Corporation's business records, computer data, trade secrets, methods of operation, et cetera. It prevents the employee from soliciting customers or clients of the Corporation. It prevents an employee, after leaving the Corporation's employment, from soliciting the Corporation's employees to work elsewhere. The Employment Agreement is prepared in such a way that you can use it over and over again to avoid additional costs in the future. By having this Employment Agreement, the Corporation is given substantial clout in preventing an employee from joining a competitor, or competing against the Corporation and disclosing business secrets to anyone. The Agreement may be re-used by the Corporation as it hires additional employees, the cost of the Employment Agreement is just $150. Employee Manual When you hire employees in your business, it is important to have an Employee Manual to comprehensively spell out the policies of your business. Included within the Employee Manual are such topics as âEmployment at Willâ, Disability, Harassment and Discrimination, Standards of Conduct and the various rules relating thereto, Corrective Action and Termination, Wage and Salary Policies and Employee Communications. For a list of the Table of Contents of the Employee Manual, click here . The Employee Manual is intended to be a source document used at the business and would be updated by the business from time to time based upon its experiences with various situations. The preparation of the Employee Manual for your business costs only an additional $349.95 when ordered with the formation of your corporation and initially comes to you for review so you may have an opportunity to make any revisions before the Employee Manual is finalized by Spiegel & Utrera, P.A. and delivered to you electronically so you may print it as needed from time to time. Employee Benefits and Policies â Protect Yourself From Employee Disputes with a Comprehensive Policy â² If you are using employees in your business, it is important to have written Benefits and Policies. Let us prepare your Employee Benefits and Policies. Unlike the Employment Agreement, the Employee Benefits and Policies creates an understanding of the entitlements of the employee relative to the policies of the business and provides protection for the business. The Employee Benefits and Policies will be customized for your business and are designed to cover: Vacation Absences, including vacation, sick time, time off for injury, death in family, jury duty, excused absence, military leave and emergency situations Holidays Equal Employment Opportunity Drug and Alcohol Abuse Policy Payday and Pay Period Overtime Internet and Email Policy Sexual Harassment 90-Day Training/Probation Period Forfeiture of Commission, Incentive Compensation and Bonuses relating to failure to complete the initial employment period Business Hours Moonlighting Restrictions Honesty Pornography at Work Medical Insurance COBRA Timecards Departure from Employment with Notice or Without Notice Dress at Work Business Cards Parking Keys Alterations or Modifications Other benefits and/or policies which may be of special interest to your business By having the customized Employee Benefits and Policies, the business has clearly communicated to its employees the Employee Benefits and Policies in effect at the business and how the Employee Benefits and Policies are to be followed so that there are no surprises. For example, relating to an employee who leaves the business without giving adequate notice who then would only be entitled to be paid at the minimum wage for any time due and owing and forfeiting any vacation days, sick days, commissions, incentive compensation and/or bonuses. The Employee Benefits and Policies may be re-used by the business as it hires additional employees. The cost of the Employee Benefits and Policies is just $167.95 if ordered now with the formation of your company. Employee Warning Notice â² Using an Employee Warning Notice can be a very effective management tool. Usually it is cumbersome to discipline an employee, situations do not always resolve themselves and frequently result in a verbal warning, however, if the situation repeats itself, this may call for a written Employee Warning Notice. The notice is designed to give a clear explanation of the issues involved which may cover a multitude of situations such as: Attendance Carelessness Fighting Language Insubordination Lateness/leaving early Refusal to work overtime Failure to follow instructions Failure to follow procedures Failure to meet quota Rudeness to employees/customers Willful damage to material/equipment Violation of company policies Violation of safety rules Working on personal matters Unsatisfactory work quality or procedures Quality of work produced Quantity of work produced The Employee Warning Notice form is customized with the name of your business and, if ordered at the time of formation of your corporation, is just $49.95. Florida New Hire Reporting â Required by Law â² Federal law requires all Florida employers to report basic information about employees, who are newly hired, rehired, or who return to work after a separation of employment. You must submit a report for each newly hired employee. Failure to report new hires within 20 days of their hire date may result in civil penalties . There may be a $25 fine per each newly hired employee or, if the State determines there is a conspiracy between employer and employee not to report the penalty can be up to $500 per newly hired employee . We can provide you with a package of 6 New Hire Registration Forms for $35. The forms are customized with your Corporationâs information, and you may re-use them for each person you employ. Independent Contractor Agreement - What Your Business Must Have if Using Independent Contractors â² There are many reasons for using Independent Contractors, however, simply verbally stating that a worker is an Independent Contractor is not enough according to the IRS. Certain criteria must be met. The IRS considers 11 factors in three specified areas: Behavioral Control, Financial Control and Type of Relationship. So, before you engage the services of an Independent Contractor, it is essential that you document that relationship with a written Independent Contractor's Agreement, otherwise the IRS could hold your Company and you personally liable for the Independent Contractor's Income Tax, Social Security, Medicare Tax and Federal Unemployment Tax, which should have been withheld. As a signatory on the check used to pay the Independent Contractor, you could be held personally liable for these taxes. The Independent Contractorâs Agreement also contains other important provisions: It spells out the duties, responsibilities and compensation of the Contractor. It states that the Contractor will not compete against the Company for a specific period of time after the project is completed. It prohibits the Contractor from disclosing any of the Company's business records, computer data, trade secrets, methods of operation, et cetera. It prevents the Contractor from soliciting customers or clients of the Company. It prevents the Contractor, after leaving the Company, from stealing the Company's employees. We can provide an Independent Contractor's Agreement that covers all the legal requirements and many business advantages for your Company for only $150. Sexual Harassment Prevention Policy â² If you are using employees in your business or if your business has customers it is important to have written Sexual Harassment Prevention Policy. In order to protect your business from liability for such sexual harassment claims, Spiegel & Utrera, P.A. recommends that your business adopt a written sexual-harassment prevention policy and distribute it to employees. The policy will include: A statement prohibiting sexual harassment and providing examples of what constitutes sexual harassment; Information about sexual-harassment laws and the remedies that are available to victims; A sexual harassment complaint form; Procedures for a timely and confidential investigation of complaints; An explanation of employees' rights of redress and the methods of bringing complaints by employees and customers; A statement that sexual harassment is a form of misconduct and that employees engaging in harassment and who knowingly allow it to continue will be punished; and, A statement that it is unlawful to retaliate against employees who report sexual harassment or who testify or assist in related investigations and/or proceedings. By having a customized Sexual Harassment Prevention Policy, your business has clearly communicated to its employees that your business will not tolerate Sexual Harassment by employees to other employees and your customers. The cost of your customized Sexual Harassment Prevention Policy is just $349.95 if ordered now with the formation of your company. Labor Law Notices â Florida Employers Obligation to Maintain and Report Records â² Every business is required to post Florida and Federal Labor Law Notice posters. Failure to comply could result in fines totaling as much as $17,000. Your Florida Labor Law Notice poster package is complete and includes: State Minimum Wage Notice Polygraph Protection OSHA Job Safety and Health Notice Equal Employment Opportunity Notice E-Verify Notice Unemployment Compensation and Temporary Disability Benefits Notice United States Department of Labor Notice of Employee Rights and Responsibilities under the Family and Medical Leave Act United States Department of Labor Notice of Military Family Leave Act Uniform Services Employment and Reemployment Rights Notice United States Department of Labor Notice of Employee Rights for Workers with Disabilities Paid at Special Minimum Wage Right to Work Notice Workersâ Compensation Notice Discrimination Notice Notice Relating to Employers Holding Federal Contracts or Subcontracts Child Labor Laws Notice Federal Minimum Wage Notice If ordered at the time of forming your Corporation, your Florida Labor Law Notice poster package would be $74.95. Daily/Weekly Time Record â² It is imperative for every business to maintain accurate payroll records. Accurate payroll record keeping begins with a Daily/Weekly Time Record which is authenticated daily by the employee and signed for certification weekly. This timecard also spells out the Corporationâs policy relating to unauthorized absences and how they can be grounds for immediate termination. Avoid the possibility of any claims under the Fair Labor Standards Act and any applicable state statutes, utilize Daily/Weekly Time Records. If ordered at the time of forming your Corporation, the fee for a pack of 6 the Daily/Weekly Time Records, which may be duplicated for continuous use, is $49.95. Notice of Acknowledgment of Pay Rate and Payday â² Businesses that hire employees but do not utilize employment contracts, should utilize a Notice of Acknowledgment of Pay Rate and Payday because it makes it very clear the amount of pay the employee is to receive and when the employee will be paid. The Notice of Acknowledgment of Pay Rate and Payday is designed to delineate the employees pay rate, regular payday, how pay is calculated, whether weekly, bi-weekly or other and overtime pay rate, if any. If ordered at the time of forming your Corporation, the fee for a pack 6 of the Notice of Acknowledgment of Pay Rate and Payday, which may be duplicated for continuous use, is $49.95. Authorization for Release of Information for Employment Screening â² Every business should do background screenings of potential employees. Background screenings may include, but are not limited to, employment references, information about character, general reputation, personal characteristics, mode of living, previous and current employment, work experience, Workers Compensation claims, criminal history records, sexual offenders lists, civil cases, education verification, license verification, credit history, FBI finger printing, Internet searches, social media information and drug testing. If ordered at the time of forming your Corporation, the fee for a pack 6 of the Authorization for Release of Information for Employment Screening, which may be duplicated for continuous use, is $49.95. Start-Up Money for Your Business Return to Menu Finding the money necessary to start your business is challenging. Unfortunately many new entrepreneurs donât know how to find this money. Even worse, when they find money they donât know how to properly document the transaction. Donât let this happen to you. Review the options below on How To properly secure and document money for your business. Lenders Agreement & Promissory Note for Non Profit Corporation - Properly Document Money Lent to the Business â² Initially a non profit corporation needs a cash infusion. Additionally, the non profit corporation may require a continuing advance of funds for some time. How to get the money? A non profit corporation generally has two choices for obtaining additional money; (1) members of the non profit organization or others make cash donations or contributions to the non profit corporation or (2) members or others lend money to the non profit corporation. Lending money to the non profit corporation is the preferred method to advance money to the non profit corporation because the lender is seen as a creditor of the non profit corporation. The lending of money to the non profit corporation is accomplished with a Lenders Agreement and a Promissory Note. Both of these instruments together provide an initial amount of a loan to the non profit corporation and also provide for future advances of money the lender may make to the non profit corporation. In the event of failure of the non profit corporation, the loan will be fully tax deductible by the lender as a bad debt. The fee for a Lenders Agreement & Promissory Note for your non profit corporation, if ordered at the time of incorporating, is $75. Security Agreement for Non Profit Corporation - Protect Yourself if you Personally Funded the Loan for the Business â² Once you have decided to use the Spiegel & Utrera, P.A. Lenders Agreement and Promissory Note, the next step is to collateralize the personal property assets of the company in favor of you, the lender with a Security Agreement. A Security Agreement is a contract between a lender and borrower. The Security Agreement gives the lender a security interest and the right to repossess personal property that a borrower has offered as collateral if a note is not paid per its agreed terms. This right is superior to all subsequent creditors provided the lien given by the Security Agreement is perfected. The Security Agreement available from Spiegel & Utrera, P.A. is complete and includes provisions relating to type of collateral being secured, address where collateral will be kept, executing further documents, events that shall constitute a default, assignment of secured collateral by holder, a listing of events that would constitute default by the borrower and the rights of the lender should the borrower default. Provided you have ordered the Spiegel & Utrera, P.A. Lenders Agreement and Promissory Note, the fee for the Security Agreement, if ordered at the time of incorporation, is an additional $75. Perfecting the Lien Created by the Security Agreement - Uniform Commercial Code â² Liens against personal property are perfected differently than liens on real property. The use of the phrase âpersonal propertyâ does not mean property owned personally by the owner of a business. Instead, the term refers to all property used inside or outside of a business (with the exception of real property) including equipment, furniture, inventory, etc. To perfect a lien against personal property used in a business, strict adherence must be followed pursuant to the Uniform Commercial Code, documentation must be created, executed and filed with the appropriate government agencies. Once recorded, the Uniform Commercial Code makes a lien valid and serves as notice that the lien exists. Usually, the first recorded lien takes priority. Provided you have ordered the Spiegel & Utrera, P.A. Lenders Agreement and Promissory Note and the Spiegel & Utrera, P.A. Security Agreement, the documentation required to perfect the lien under the Uniform Commercial Code is $75, if ordered at the time of incorporation. How To Build Credit and Credibility for Your Business Return to Menu As a new business two items vital to your survival are credit and credibility. Customers feel secure dealing with a credible business. Potential investors and other lenders are more comfortable providing capital to a business with good credit. But how do you build credit and credibility for a business? Even more importantly, how can you build credit for your business if your personal credit is not spotless? Two of the easiest ways are discussed below. System for Award Management (SAM) Number â² SAM is web-based, US government-wide application that collects, validates and disseminates business information about the federal governmentâs private providers in support of the contract awards, grants and electronic payment processes. You must complete your System for Award Management (SAM) Registration in order to work as a federal contractor or to be able to apply for federal grants. At Spiegel & Utrera, P.A. we can help you register to do business with the US government. To complete your SAM Registration, you must first have a D&B Number and a Federal Tax Identification Number. If ordered at the time of forming your Corporation, the fee for your System for Award Management (SAM) Registration is $249.95. D & B Number - Start Building Your Business Credit Immediately â² According to Dun & Bradstreet, the D & B number is widely used by both commercial and federal entities and was adopted as the standard business identifier for federal electronic commerce as early as October 1994. The D & B number was also incorporated in the Federal Acquisition Regulation (FAR) in April 1998 as the United States Federal Governmentâs contractor identification code for all procurement-related activities. The D & B number is also known as the D-U-N-SÂ® number and remains with the corporation location to which is has been assigned even if it closes or goes out of business. With that in mind, it is important to have a physical location for your business when obtaining the D & B number. D & B also states that the D-U-N-SÂ® number also âunlocksâ a wealth of valued-added data associated with that entity, including the business name, physical and mailing addresses, trade styles (fictitious name, assumed name, alternate name or DBA), principal names, financial, payment experiences, industry classifications (SICs [Standard Industry Classification] and NAICS [North American Industry Classification System]), socio-economic status, government data and more. The D-U-N-SÂ® number also links members of corporate family trees worldwide. If ordered at the time of forming your corporation, Spiegel & Utrera, P.A. will obtain your D & B number, also known as your D-U-N-SÂ® number, for $50. If ordered later, the charge to obtain the D & B number, also known as your D-U-N-SÂ® number, is $75. Business Checking, Investment Account and Delayed Debit Gold MasterCard â Let us help You Establish a Business Banking Account â² Let Spiegel & Utrera, P.A. help you set up your new business checking account. In addition to a business checking account, the account also comes with an investment account and a delayed debit Gold MasterCard. Depending upon the day in the billing cycle when a charge is made, your account will continue to earn interest for up to 30 days from the date of purchase or until the balance of the debit card for that period is charged to your account. In addition, with this account you have the ability to make deposits and withdraw funds from over 800 bank locations and other financial institutions in the United States. Multiple delayed debit Gold MasterCard's are available for use by your employees. Internet bill payments are free. No minimum balance is required to maintain your business checking account, however, there is an initial deposit of $100,000 which is required to open the Business Checking, Investment Account and Delayed Debit Gold MasterCard. If you order your business checking, investment account and/or delayed debit Gold MasterCard from Spiegel & Utrera, P.A. at the time of forming your Corporation, the fee is $249.95 to prepare all the necessary documentation and follow up until such time as your business checking, investment account and/or delayed debit Gold MasterCard has been established. If ordered after forming your Corporation, the fee is $449.95. Your Success Starts With Knowledge Return to Menu As a new entrepreneur it is important that you surround yourself with the tools you need to be successful. However, it is also important that you donât drain your bank account looking for these tools. Three items with vast amounts of business knowledge and guidance can be found below. You will return to these items again and again, not only during the start-up process but over the entire life of your business. Spiegel & Utrera, P.A. General Counsel Club & Registered Agent Service with Attorney Client Privilege â² Experienced Legal Advice to Help You Save Money with Added Confidentiality Protection. Let Spiegel & Utrera, P.A. help you grow your business. Our firm has what we call the âGeneral Counsel Clubâ. Select this valuable service at the time of ordering your corporation and receive an additional one month Bonus â so that your first year of service will cover 13 months PLUS take a $50 discount, so you pay only $89.95 for the first 13 months of service. You get: Unlimited telephone consultations all year long on matters relating to legal and strategic business advice; Our firm will prepare the Notice and Minutes of your corporationâs Annual Meeting of Shareholders and Directors; Our firm will act as your corporationâs General Counsel; Our firm will comply with all statutes and applicable laws relating to your corporationâs Registered Agent & Registered Office. Be aware that when Spiegel & Utrera, P.A. serves as your General Counsel, Registered Agent and Registered Office, the Attorney-Client Privilege is in effect. What does this mean? For example, letâs say Spiegel & Utrera, P.A. receives a subpoena to produce information about the formation of your Corporation, LLC, Partnership or Trust because of alimony, child support, bankruptcy, debt collection, foreclosure, IRS, tax collection, government enforcement action, criminal matter or anything else, Spiegel & Utrera, P.A. is duty bound not to disclose any information contained in any client communications whether oral or written. That includes any order for a Corporation, LLC, Partnership or Trust and any communications, whether from you or Spiegel & Utrera, P.A. Communications between an attorney and client are privileged from disclosures and such attorney-client privileged information will not be disclosed. See Upjohn Co. v. United States, 449 U.S. 383 (1981). The attorney-client privilege recognizes that sound legal advice or advocacy serves public ends and that such advice or advocacy depends upon the lawyer being fully informed by the client. Trammel v. United States, 445 U.S. 40, 51, 100 S.Ct. 906,913, 63 L.Ed.2d 186 (1980). Further, the attorney-client privilege applies indefinitely and termination of attorney-client relationship does not terminate the attorney-client privilege. Swidler & Berlin v. United States, 524 U.S. 399 (1998). This is powerful legal precedent to have working for you and you can only obtain it from a lawyer. A non-lawyer Registered Agent or Registered Office service does not offer this valuable confidentiality protection; Our firm will review all mandatory State corporation filing documents as required by the Secretary of State; You will receive our firmâs newsletter, âEntrepreneurâs AlertÂ®â, which is published six times a year and provides valuable insight into running your business from a legal and business point of view. Detours and Contradictions â² Want more out of your corporation? Then donât miss Lawrence Spiegelâs, 223 page Detours and Contradictions. Use this book, and all your available resources, to begin the challenging yet fulfilling journey of entrepreneurship. As weâll see... having a marketable idea is only the first step in a lengthy process. Along the way youâll encounter numerous detours and contradictions, risks and rewards. The price of Detours and Contradictions is just $13.50 if you order when forming your corporation. PLUS there is no extra charge for shipping, handling and processing as your book will be shipped with your corporation. Also, as an added bonus, your copy of Detours and Contradictions will be personally autographed by Lawrence J. Spiegel. Charlie's Entrepreneurial Journey â² Building your business, or selecting the type of business to start, is easy when using Charlieâs Entrepreneurial Journey as a guide and applying Lawrence J. Spiegelâs thirty eight \"Principles of Entrepreneurship\" to your business. Spiegelâs latest book provides 416 pages of insight into the world of an aspiring entrepreneur named Charlie. Charlieâs journey leads him through topics never discussed in business books but essential to success. Topics include: costs associated with Acquiring a Customer, Urgency to Purchase, Saturation Advertising, Success Leaves Tracks and Repetitive Business. Spiegelâs \"Principles of Entrepreneurship\" cannot be found anywhere else. In fact, no one has ever exposed the business secrets Spiegel discloses. If you are seeking to spark your business you will find an EXPLOSION in this book. Order this book at the time of forming your corporation and you will get Charlieâs Entrepreneurial Journey for $19.50 which includes shipping, handling and processing, when ordered with the formation of your company. PLUS Lawrence J. Spiegel will personally autograph your copy of Charlieâs Entrepreneurial Journey . Lease / Agreement Review Return to Menu Lease/Agreement Review â Protect Yourself BEFORE You Sign â² Avoid costly mistakes, always , always , always have any type of Contract/Lease or otherwise legally binding agreement reviewed by a qualified lawyer BEFORE you sign it. Spiegel and Utrera, P.A. offers Consultations at all of our offices and over the phone For your convenience, and at no obligation to you, you can fax us the documents that need to be reviewed at (800) 520-7800 and an attorney can advise you over the phone. Our staff has many years of experience representing Tenants. Having your lease reviewed BEFORE you sign on the dotted line can save you thousands of dollars. In our review we address issues such as: Rentable vs. Usable Space Reasonable Rental Rates Free Rent Best Length of Lease Options to Extend the Lease & Purchase the Premises Leasing contiguous space for expansion Assignment and Subletting Caps on Rent increases and expenses demanded by Landlords Repair Responsibilities Exclusivity of Tenant's Business Early Termination Rights Personal Guarantees, should you or should you not Renewal Terms Zoning Issues Landlord build out costs Change of Control of Tenant Signage Protection Business Purchase Review: â² One thing is very clear - the acquisition of a business can provide the gateway to substantial wealth. At Spiegel & Utrera, P.A. , we have represented buyers in many business acquisitions and are ready to help you. For small to medium businesses, purchases are usually structured in one of two ways: Asset Purchase or Corporate Stock Purchase. Asset Purchase â Generally Liabilities are NOT Assumed â² When assets are acquired, the purchaser buys all or specified assets of the selling entity and may assume none, some, or all of the liabilities of the business. An asset purchase may be more attractive to you since you may be able to pick and choose the specific items desired and can attempt to avoid assuming debts and liabilities of the selling entity. An asset acquisition is also designed to reduce your exposure to possible unknown or contingent liabilities. When assets are acquired, appropriate documents must be prepared in order to effectuate the transfer of title to each particular asset which is being transferred. This can involve a great deal of paper work and may require approvals and consents from various other parties, depending on the entity which is being purchased. We recommend faxing any agreement BEFORE you sign to (800) 520-7800 , at no obligation to you, and an attorney can advise you over the phone. Corporate Stock Purchase â When the longevity and corporate status of the entity are Valuable â² You can acquire control of another company through the acquisition of the shares of stock owned by the seller's shareholders. In this type of acquisition control of the acquired entity is obtained through stock ownership rather than a direct acquisition of the assets. With a corporate stock purchase corporate liabilities are assumed by the buyer. The legal and corporate status of the acquired entity remains the same following the acquisition. If possible, an Asset Purchase is usually preferable for a buyer due to the assumed liability. However some purchases may benefit from the acquisition of corporate stock. For example, where beneficial carryover tax attributes are available, a stock transaction may be desirable for you. When favorable insurance and employment ratings can be retained, they may also be a consideration for a stock transaction. Although one of the main nontax considerations for you in desiring an asset purchase is the risk of being saddled with unknown and contingent liabilities, the impact of this problem can sometimes be ameliorated by the establishment of holdback arrangements. Such arrangements typically involve escrowing of funds, rights to offset payments on seller financed promissory notes, execution of nonnegotiable promissory notes to evidence seller financing, and provisions in the sale agreement in delaying the payment of the full purchase price until certain contingencies have been satisfied. In a typical stock acquisition the purchaser acquires the stock from the corporate shareholders in exchange for cash, notes, stock, other property, or a combination of these items. In most cases you will want to purchase the entire outstanding stock of the seller; however, there may be situations where it would be advantageous to have a minority shareholder retain an interest in the corporation being sold. For example, if a key management figure has an ownership interest in the corporation, it may be beneficial for the corporation for him to retain that interest in order to maintain continuity of management and the value of a key employee. The psychological and economic advantages of having an important employee continue to own a stake of the business, even after new ownership of the majority of stock, should be carefully weighed. Simplicity is perhaps the key nontax feature of a stock acquisition. Since nothing other than corporate stock of the corporation is transferred, the often cumbersome preparation and execution of documents of transfer are not necessary. Although the selling shareholders must agree to sell their corporate stock, no shareholder votes are necessary, nor are there any shareholders' dissenters' or appraisal rights. The sale of corporate stock will normally avoid sales taxes, although Florida does impose a tax on the transfer of stock. It must be emphasized that the mechanical ease of accomplishing the actual corporate stock transfer should not lull you into believing that an investigation into the corporation is not necessary. To the contrary, the investigation should be at least as, if not more, comprehensive than one undertaken in the course of an asset transaction. It is perhaps most crucial in regard to liabilities, since you face the risk imposed by disclosed, undisclosed, fixed, contingent, and unknown liabilities. Although you do not assume such liabilities personally, they nonetheless run with the corporation and will affect the assets of the business. The degree and extent of the risk associated with the transaction, and the likelihood of liabilities which have not surfaced, should have a direct bearing on the negotiated purchase price. We strongly recommend that you fax your purchase agreement, at no obligation to you, to (800) 520-7800 BEFORE you sign it and one of Spiegel And Utrera, P.A.âs experienced attorneys will be able to advise you over the phone. Franchise Agreement Review â Is That Franchise Too Good to be True? â² A franchise is a method of distributing goods and services by licensing a business idea or concept to another. The \"franchisor\" is the legal owner of the franchised business' concepts and ideas, including names and logos. The \"franchisee\" is the individual or entity that purchases the right to use these concepts and ideas from the Franchisor. Studies reveal that franchised businesses experience lower default rates than independent businesses and generally have a somewhat easier time securing financing because the Franchisor typically has an established trademark and goodwill, as well as marketplace experience. But is a franchise worth the cost and restrictions? Many new entrepreneurs incorrectly believe that purchasing a franchise will lead to immediate success and profits with little to no risk. This is rarely the case. When considering a franchise there are many aspects that you need to examine. One good indicator of the potential success of a franchise is to compare your start-up cost with the past advertising and promotional expenditures of the franchisor. For example, a fast food franchise that has a start-up cost of $50,000 where the franchisor has invested $500 million in advertising and promotion would probably be a better purchase than another fast food franchise that has a lower start-up cost but the franchisor has only invested $10 million in advertising and promotion. Likewise, remember that higher price does not necessarily mean less risk and lower price does not mean greater potential reward. You must review all materials and disclosures carefully and seek legal advice. Although franchises usually require up-front fees and are heavily regulated by Federal and state agencies because of their inherent risks, a franchisee operating under one trademark can achieve levels of brand awareness, market penetration and purchasing power that business people operating individually could not ordinarily achieve. Generally, a franchise agreement grants to the franchisee a limited license and right to use and operate a recognizable outlet within a defined territory by utilizing a pre-existing business system and proprietary marks. The franchise agreement allows the franchisor to carefully control the obligations and responsibilities of the franchisee. It is imperative to have the agreement reviewed by an attorney BEFORE you sign it. The attorneys of Spiegel and Utrera, P.A. have extensive experience in Franchise Agreements and will review your Franchise Agreement. Just fax your agreement to (800) 520-7800 , at no obligation to you, and an attorney can advise you over the phone. In our review we address issues such as: Engagement Franchise Fee Royalty & Percentage Fees Proprietary Marks Training And Assistance Advertising Confidential Operating Manuals Confidential Information Maintenance Accounting and Records Standards of Quality Modification of System Warranties and Representations of Franchisor Warranties and Representations of Franchisee Rights of First Refusal Indemnification A franchise is an excellent way to get started as a new entrepreneur, but it does not guarantee success. You must have a Franchise Agreement that works to your advantage. Let Spiegel and Utrera, P.A. review your agreement and get your franchise started on the path to success! Shipping Information Return to Menu Shipment of your Entity Records Book and Seal Corporate Packages generally weigh approximately 4 pounds and are available for Pick up at our office in the state in which the entity is formed or may be shipped to you via Ground (2-3 business day) Service for a charge of $22.95 or via Overnight Delivery for a charge of $44.95. Please note, shipping and handling charges outside Florida will vary. Worldwide electronic transfer of documents - delivered to you the same day your entity documents are due. Electronic transfer of entity records in PDF format, depending on your order, includes approximately 20 to 30 plus pages (excludes entity binder and seal) for a charge of $25.95. Electronic transfer of entity records in PDF format, depending on your order, includes approximately 20 to 30 plus pages with 16 facsimile seals (excludes entity binder) for a charge of $32.95. Shipping to Canada or North America Regular Service to Canada or North America (approximately 3-5 business days for delivery) - $43.95 Expedited Shipping to Canada or North America (Next Day Service) - $205.95 Shipping to Mexico or South America Regular Service to Mexico or South America (approximately 7 business days for delivery) - $105.95 Expedited Shipping to Mexico or South America (approximately 2 business days for delivery) - $213.95 Shipping to countries in Europe Regular Service to Europe (approximately 4 business days for delivery) - $282.95 Expedited Shipping to Europe (approximately 2 business days for delivery) - $304.95 Shipping to Asia Regular Service to Asia (approximately 4 business days for delivery) - $254.95 Expedited Shipping to Asia (approximately 3 business days for delivery) - $283.95 Shipping to Africa Regular Service to Africa (approximately 4 business days for delivery) - $392.95 Expedited Shipping to Africa (approximately 3 business days for delivery) - $487.95 Shipping to Australia Regular Service to Australia (approximately 7 business days for delivery) - $278.95 Expedited Shipping to Africa (approximately 3 business days for delivery) - $314.95 SPEED OF SERVICE OPTIONS REDDI CORP â² If you need a corporation immediately, we have corporations, which are ready for immediate delivery. For more information and a complete list of  all our Reddi or Shelf corporations CLICK HERE or call our office at (888) 641-3800 for details. NEXT BUSINESS DAY NON-PROFIT CORP â² If you need your Non-Profit Corporation formed urgently, for an additional $160. We will expedite the registration of the Non Profit Corporation and preparation of the Corporate Records and the Corporate Package will be ready the next business day , after receipt of payment. 3 BUSINESS DAY NON-PROFIT CORP â² If you need to incorporate fast, we offer a 3 Business Day Incorporation Service for an additional $85. We will expedite the registration of the Corporation and preparation of the Corporate Records and the Corporate Package will be ready in 3 business days , after receipt of payment. REGULAR SERVICE â² The regular processing time for a Non-Profit Corporation is approximately two weeks . The Non-Profit Corporate Package includes all the documents and the Corporate Seal. An Important Note about our RUSH SERVICES â² We offer two levels of rush service. When you opt for one of our rush services, we guarantee to promptly deliver your Corporation to the State for processing, however, if the State is backlogged, you may experience a delay in receiving your documents. We strive to have all rush orders ready as soon as humanly possible, however if time is of the essence you may opt for one of our Reddi Corps which are ready for immediate delivery. FORM YOUR 501C3 NON PROFIT ONLINE NOW!"
    }
  ]
}