{
  "fuentes": [
    {
      "url": "https://www.indianriverpreservegolfclub.com/contact/",
      "email": "paul.martino@bobbyjoneslinks.com"
    },
    {
      "url": "https://www.indianriverpreservegolfclub.com/membership-programs/",
      "email": "marsha.gault@bobbyjoneslinks.com"
    },
    {
      "url": "http://floridagolfmagazine.com/FGMwinter2015/Indian-River-Club-2015.html",
      "email": "joestine@floridagolfmagazine.com"
    }
  ],
  "mails": [
    "joestine@floridagolfmagazine.com",
    "marsha.gault@bobbyjoneslinks.com",
    "paul.martino@bobbyjoneslinks.com"
  ],
  "nombre_sitio": "indianriverpreservegolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.indianriverpreservegolfclub.com/contact/",
      "text": "CONTACT - Indian River Preserve Golf Club Skip to primary navigation Skip to main content Indian River Preserve Golf Club HOME GOLF BOOK A TEE TIME THE COURSE GOLF LEAGUES PRACTICE FACILITY DOWNLOAD OUR APP EVENTS OUTINGS & TOURNAMENTS UPCOMING EVENTS WEDDINGS & CELEBRATIONS JOIN MEMBERSHIP PROGRAMS ANDREI’S RESTAURANT HOME MENU CELEBRATIONS & WEDDINGS CONTACT  & HOURS GIFT CERTIFICATES CONTACT CONTACT US CAREERS CONTACT Contact Us Please use the form below to contact us. We will get back to you as soon as we can! Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Contact Info Address : 3950 Clubhouse Drive Mims, FL 32754 Email : Paul.Martino@bobbyjoneslinks.com Phone : 321-385-2099 Pro Shop Hours : Monday – Sunday — 7:00 a.m. – 6:00 p.m. Get Social Facebook Instagram Page Footer About Us Originally opened in 2003, Indian River Preserve Golf Club is an 18-hole golf course, co-designed by renowned golf course architect Perry Dye and LPGA champion Jan Stephenson. The course features lush fairways across a rolling landscape, surrounded by serene lakes, nature preserves, and wildlife. Indian River Preserve is home to Andrei’s Restaurant serving chef-driven menus to the public. Facebook Instagram Contact Address: 3950 Clubhouse Drive Mims, FL 32754 Phone: 321-385-2099 Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Indian River Preserve Golf Club | 3950 Clubhouse Drive Mims, FL 32754 | 321-385-2099 Copyright © 2025 Indian River Preserve Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.indianriverpreservegolfclub.com/membership-programs/",
      "text": "MEMBERSHIP PROGRAMS - Indian River Preserve Golf Club Skip to primary navigation Skip to main content Indian River Preserve Golf Club HOME GOLF BOOK A TEE TIME THE COURSE GOLF LEAGUES PRACTICE FACILITY DOWNLOAD OUR APP EVENTS OUTINGS & TOURNAMENTS UPCOMING EVENTS WEDDINGS & CELEBRATIONS JOIN MEMBERSHIP PROGRAMS ANDREI’S RESTAURANT HOME MENU CELEBRATIONS & WEDDINGS CONTACT  & HOURS GIFT CERTIFICATES CONTACT CONTACT US CAREERS MEMBERSHIP PROGRAMS Experience the best of golf with an Indian River golf membership. Enjoy fun rounds, exceptional service, and our stunning course surrounded by nature. Tee off to memorable moments – join us today! Membership benefits include: Unlimited golf and carts Unlimited range and practice facility access Up to 10% off full-price merchandise 10% off at Andrei’s Annual Membership MEMBERSHIP RATES $3600 Single | $5500 Couple RESIDENT RATES $3300 Single | $5100 Couple Seasonal Membership SEASONAL MEMBERSHIP RATES $400 Per Month For Single (three month minimum) $650 Per Month For Couple (three month minimum) Other Golf Program Options Indian River Preserve Winter Player’s Card: November – April | $89 Indian River Preserve Summer Player’s Card: May – October | $69 Benefits: Play for free on the day you sign up! Reduced rates for daily tee times Morning $10 discount Afternoon $5 discount Complimentary small bucket of balls prior to your tee times 25% off coupon at Andrei’s Range Membership $400 annually $40 monthly (three minimum months) Unlimited range and $27 golf after 2 p.m. IRP Residents Card Welcome IRP Residents! Did you know residents of our community receive a $5 discount on every greens free? To learn more and register for programs and memberships, contact Marsha Gault, Director of Sales and Marketing, Marsha.Gault@bobbyjoneslinks.com or (321) 385-2099. All programs and Membership require appropriate application and management approval. Eligibility requirements must be met including proof of residency. Pricing and discounts are subject to change. Cards and memberships are non-transferable and non-refundable. See the club for full details and registration information. Information Request Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Annual Membership Seasonal Membership Range Membership Players Card Residents Card Additional Information Submit Page Footer About Us Originally opened in 2003, Indian River Preserve Golf Club is an 18-hole golf course, co-designed by renowned golf course architect Perry Dye and LPGA champion Jan Stephenson. The course features lush fairways across a rolling landscape, surrounded by serene lakes, nature preserves, and wildlife. Indian River Preserve is home to Andrei’s Restaurant serving chef-driven menus to the public. Facebook Instagram Contact Address: 3950 Clubhouse Drive Mims, FL 32754 Phone: 321-385-2099 Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy Indian River Preserve Golf Club | 3950 Clubhouse Drive Mims, FL 32754 | 321-385-2099 Copyright © 2025 Indian River Preserve Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "http://floridagolfmagazine.com/FGMwinter2015/Indian-River-Club-2015.html",
      "text": "Indian River Club celebrates 20 years of Signature Sanctuary certification by Audubon International in 2015 Florida Golf Magazine The Golf Magazine of America's Premier Golf State - Winter 2015 Issue Facebook YouTube Indian River Club In Vero Beach, FL Written by Joe Stine, Editor, Florida Golf Magazine Watch video in \"Full Screen\" Mode. The view from the tee of the 326 yard 2nd hole Named âIntimidation,â at the beautiful Indian River Club in Vero Beah, Florida. Ken May Photo Indian River Club 800 Carolina Circle SW, Vero Beach, FL 32962 772-770-0757, indianriverclub.com Indian River Club - Architect: Ron Garl 18 Holes, Par 72, Year Opened - 1995 Tees: Black Blue White-M Red-M White-L Red-L Yards: 7013 6573 6273 5768 5189 4897 Rating / Slope 73.7 / 143 71.9 / 138 70.6 / 132 67.8 / 123 70.9 / 133 69.4 / 124 The Florida Golf Course Architecture of Ron Garl In Vero Beach; at Indian River Club Over twenty years ago in beautiful Vero Beach, Florida, golf course architect, Ron Garl designed and built an extraordinary championship caliber golf course at Indian River Club. Indian River County's southernmost golf course, Indian River Club is close enough to the Atlantic Ocean to enjoy soft ocean breezes, yet far enough to take advantage of the natural high rolling terrain of an ancient coastal sand ridge with elevations up to 50 feet above the nearby seashore. Garl, a native Floridian who knows as much about the great coastal ridge as anyone told us that it is actually known as the \"Atlantic Coastal Ridge,\" and dates back around 100,000 years to the Pleistocene Era. World renowned Golf Course Architect, Ron Garl is a Florida native. rongarl.com \"The way I understand it,\" said Garl, âwater levels were much higher back then because there was less ice at the earth's poles. At one time the sand ridge we see today was most likely an ancient barrier island.\" Another strong feature of this golf course is the excellent drainage. When many other area clubs need to close as a result of heavy rains and standing water, Indian River Club rarely closes. More often than not, the day following a heavy rain the course has recovered and is ready for play. Bearing silent witness to the ancient nature of the land, Garl's unique golf course design took full advantage of its high rolling terrain. Embracing the natural beauty of the site, the 18-hole, 7,013 yard, par 72 course is rich in breathtaking views, but ever so sensitive and respectful of the natural environment. Indian River Clubâs Golf Course Architecture Because of its unique proximity to the great Atlantic Coastal Ridge the golf course at Indian River Club's 120 acre Certified Signature Sanctuary also offers a truly rare cross-section of four distinct and natural environments. The western quarter of the golf course features beautiful stands of old-growth pines; the mid-section has a very genuine 'Old Florida' look and feel with white sugar sand, large clear lakes and marshes; the eastern quarter has hammocks of old oaks and towering sand pines; and holes #5 and #6 play along the ancient coastal sand ridge dunes with elevations up to 48 feet. 416 yards, par four, 5th Hole - Indian River Club Pictured here, the 416 yard par four, 5th hole at Indian River Club takes advantage of the natural high rolling terrain of an ancient coastal sand ridge known as the \"Atlantic Coastal Ridge, with elevations up to 50 feet above the nearby seashore. Photo by Ken E. May Indian River Club celebrates 20 years of Audubon International Signature Sanctuary Certification In 2015 Indian River Club celebrates 20 years of certification status by Audubon International, only the second certified Signature Sanctuary in the world to reach that goal. Indian River Club maintains its Signature status through an environmentally focused management program that measures efforts in five categories: Habitat Enhancement, Waste Management, Water Conservation, Energy Conservation and Wildlife Conservation. The goal of that management program is to provide a community of lasting value and beauty for its residents and club members in a healthy and sustainable natural environment. As part of their continuing involvement in the Audubon International Signature Sanctuary Program at Indian River Club the golf course superintendent and his crew continue to maintain many projects including: Using reclaimed water from Indian River County and St. Johns River Water Management to irrigate all of Indian River Club's golf course and residential properties. Performing regular silt and soil testing for monthly and annual reports; recycle all machine oil and all water used to clean equipment. Conserving water by hand treating dry areas as needed. Proper water management also reduces the opportunity for disease development. Using only slow-release organic fertilizer on the golf course turfgrass. Following an Integrated Pest Management program (IPM), which is the reduction (not elimination) of chemical usage on the golf course. Planting and maintaining aquatic plants in the lakes and native grasses that act as buffers around the water perimeters. These provide fish and waterfowl food and nesting cover and act as a filtering buffer system for storm water runoff. Maintenance of Indian River Club's 13 acre preserve of Scrub Oak and Hickory that was set aside for the Florida Scrub Jay and resident Gopher Tortoises. This area is maintained with regular trimming regulated by Lake Masters and by using signage and fence to prevent golfers from entering. This special fence has also been designed to allow rabbits and foxes to pass underneath. Significant emphasis is placed on allowing for or retaining naturally occurring standing dead trees as an important habitat component within the golf course environment. These standing dead trees provide nesting habitat for primary cavity nesters, such as woodpeckers, which in turn provide nesting and shelter habitats for secondary cavity nesters, such as bluebirds, wood ducks and owls. The Pelican Island Audubon Society also conducts a monthly \"Bird Walk\" at Indian River Club and has done so since the start of construction. Members and residents are encouraged to participate. A spotting guide based on birds actually seen on site, is distributed to participants. \"The members appreciate the steps necessary to maintain Indian River Club's Signature certification status,\" said superintendent Bobby Wallace. \"We're stewards of the environment. We have more than 3,000 species of plants and animals that live at Indian River Club and our membership is proud of what we do.\" 394-yard, par four, 6th hole - Scrub Jay While playing this hole with Florida Golf Magazine, Architect, Ron Garl stopped to identify a Gopher Tortoise in front of the tee-box. Also built on the ancient coastal sand ridge known as the \"Atlantic Coastal Ridge, the natural setting of the back tees of the 394-yard, par 4, sixth hole, named âScrub Jay,â is surrounded by Indian River Club's 13 acre preserve of Scrub Oak and Hickory that was set aside for the Florida Scrub Jay and resident Gopher Tortoises. Scrub Jays and Gopher Tortoises are both endangered species. Photo by Ken E. May. Audubon International Since 1991, Audubon International has worked with properties and businesses to provide third party verification that those businesses have taken measures to reduce their impact on the environment. When golf course managers agree to and adhere to specific guidelines governing water conservation and quality control, wildlife and habitat management, outreach and education, and chemical use reduction, courses become eligible for designation as certified facilities. Sandhill Crane parents teaching their young what critters are good to eat at Indian River Club in Vero Beach Two Audubon International programs guide golf course management: the Signature Program and the Audubon Cooperative Sanctuary Program. The Signature Program began in 1993 as a way for Audubon International to assume a leadership role in working with developers on new construction projects for the purpose of promoting sound land management practices and appropriate land use changes based on scientific research. Golf courses like Indian River Club that are designed, constructed and operated in accordance with Signature Program guidelines are eligible for Signature certification. According to Nancy Richardson, Audubon International's Signature Program Director, \"Landowners and managers develop their projects according to a set of Principles for Sustainable Resource Management which guides the program process. Each member produces a site-specific natural resource management plan, a framework for management outlining the long term management of the course.\" Indian River Club is the only Certified Signature Sanctuary in Indian River County. Grey Fox Kits keeping an eye out for mom. Photo taken at Indian River Club in Vero Beach. In regard to Indian River Club, Nancy Richardson, Audubon Internationalâs Signature Sanctuary Program Director, âEarly on, folks involved with Indian River Club recognized the importance of protecting its most valuable asset-- its natural environment. Entire ecosystems were preserved, habitats were enhanced, thousands of native trees including huge specimen oaks, were transplanted out of the way of development, acres of exotic/invasive plant species were removed, and native drought-tolerant plants were introduced into community landscaping.â Indian River Clubâs development philosophy has always been \"Good environmental planning makes good economic sense.\" \"Audubon International believes that as well and sees environmental planning and protection as a priority when assessing a site for development.â said Richardson. âNow because of that planning, residents living within Indian River Club, enjoy a protected place where seeing Sandhill crane adults and their little 'colts' is a frequent occurrence, where seeing a swallow-tailed kite is an exciting event, and where a quiet, social and natural lifestyle remains the path that the community has chosen.â Community Overview Located at the very southern end of Vero Beach and less than a mile from the spectacular Indian River Lagoon, the Indian River Club is a beautiful community noted for its friendly, outgoing atmosphere and challenging golf. The community sits on an exceptional 300 acres which is home to well preserved old growth pines, a rare coastal scrub jay habitat and pristine lakes. Into that environment has been inserted a world class eighteen hole golf course and 243 home sites, all done with enough care to maintain the special designation of an Audubon International Signature Sanctuary. Of the 211 total single family lots in the community, all but 40 have been completed and have occupied homes on them. Three of four possible eight unit condominium buildings are built and occupied. The community is in a healthy real estate market and provides good opportunities to acquire attractive, existing homes or to buy new. The Indian River Club residential community is managed by a professional property management company and has a well established and proactive Homeowners Association. An aerial photo of the green of the 18th hole at Indian River Club which is aptly named, âOn the Rocksâ. Membership at Indian River Club Indian River Club is a private golf club. Membership Director, Stu Burk said, \"Our mission is to provide a superior golf experience to golfers of all skill levels by protecting the beauty and condition of our Audubon International Signature Sanctuary golf course while preserving the uniquely friendly atmosphere that has set this private golf club apart since its inception.\" \"We have the best Members anywhere, fun events planned for the new season, and Indian River Club's golf course is second to none in Vero,\" says Stu. âOur executive chef continues to wow us and our golf operations staff makes each memberâs visit a pleasurable one. And, for the benefit of our members & guests we have onsite lodging accommodations at our charming lodge located on number 9 fairway.â To learn more or to visit Indian River Club, call the Membership Director at (772)770-0757. \"If you are a serious Florida golfer looking for the perfect private club, Indian River Club in Vero Beach is a must see\" Indian River Club 800 Carolina Circle SW, Vero Beach, FL 32962 772-770-0757, indianriverclub.com Florida Golf Magazine The Golf Magazine of America's Premier Golf State - Winter 2015 Issue Facebook YouTube Menu FGM Homepage • FGM Winter 2017 Issue FGM Winter 2017 Issue Submenu The Florida Golf Architecture of Arthur Hills Vista Plantation GC Jonathan's Landing GC Collierâs Reserve CC Heron Creek G&CC Miami Beach GC Normandy Shores GC Golf Tips By Gary Wiren Iron Man of Saint Andrews • FGM Winter 2016 Issue FGM Winter 2016 Issue Submenu Golf Course Designer Pete Dye honored with Don A. Rossi Award by the Golf Course Builders Association of America (GCBAA) Golf Tips By Gary Wiren Golfâs Ironman Gary Wiren: At 80 still drives a golfball 300 yards Developing A Golf Course Maintenance Budget Krista Puistie Captures NWGA Championship at Remington GC 2016 Florida's Best 5-Star Golf Real Estate Communities Golden Ocala Golf & Equestrian Club Willoughby Golf Club Rotonda G&CC, 99 Holes - \"Open to the public for daily-fee golf\" The 2015 Florida Open for Golfers with Disabilities • FGM Winter 2015 Issue FGM Winter 2015 Issue Submenu In Vero Beach; The Florida Golf Course Architecture of Ron Garl at Indian River Club The Florida Golf Architecture of Jack Nicklaus at Trump National Golf Club, Jupiter 2014 Florida Open for Golfers with Disabilities and/or Mobility Challenges Golf Instruction: By Gary Wiren, PhD Using Learning-Training Aids To Enhance Golf PERFORMANCE Readersâ Choice Survey Results; Floridaâs Favorite Golf Courses For 2015 Golf Course Designer, Pete Dye Unveils Redesign of His 30-Year Old Original Design at The Ford Plantation New 18-Hole Championship Golf Course To Be Designed By Tiger Woods At âTrump World Golf Club Dubaiâ Florida Golf Real Estate Memoirs Of The Legendary Iron Man Of Saint Andrews More Florida Golf Magazine Winter 2017 issue of Florida Golf Magazine features \"The Florida Golf Architecture of Arthur Hills\" Click here to read it. Pete Dye is on the cover of the Winter 2016 issue of Florida Golf Magazine. Click here to read it. Golf Architect Ron Garl & Indian River Club, and Trump National Jupiter are showcased in the Winter 2016 issue of Florida Golf Magazine. Click here to read it. 200 Years in the making: The Memoirs Of The Legendary Iron Man Of Saint Andrews Florida's Finest 5-Star Real Estate Golf Course Communities with Golf Homes For Sale Read More Get in touch FLORIDA GOLF MAGAZINE, is printed quarterly and delivered to 50,000 serious golfers, including the General Managers of over 1,100 Florida golf course facilities. FLORIDA GOLF MAGAZINE features a unique blend of Florida golf course photography, course reviews and real estate showcases mixed with Florida golf resort and travel feature stories. Plus our celebrity interviews, golf articles and tips by nationally known contributing editors will always interest serious golf readers throughout America's premier golf state. To advertise in Florida Golf Magazine call the Editor: Joe Stine, at 863-227-2751 or 863-294-2621. Joe Stine, Editor Publisher 604 Country Lane NE Winter Haven, Florida 33881 863-227-2751 or 863-294-2621 joestine@floridagolfmagazine.com © 2018 Joseph A. Stine, All rights reserved. Florida Golf Magazine"
    }
  ]
}