{
  "fuentes": [
    {
      "url": "https://www.iwgcc.com/",
      "email": "20info@iwgcc.com"
    },
    {
      "url": "https://www.iwgcc.com/",
      "email": "info@iwgcc.com"
    },
    {
      "url": "https://indianwoodgolfclub.com/event-hosting/",
      "email": "admin@indianwoodgolfclub.com"
    },
    {
      "url": "https://indianwoodgolfclub.com/event-hosting/",
      "email": "admin@indianwoodgolfclub.com"
    },
    {
      "url": "https://indianwoodgolfclub.com/",
      "email": "admin@indianwoodgolfclub.com"
    },
    {
      "url": "https://www.indianwoodmhc.com/contact/",
      "email": "indianwood@legacymhc.com"
    },
    {
      "url": "https://www.iwgcc.com/contact-us/",
      "email": "20info@iwgcc.com"
    },
    {
      "url": "https://www.iwgcc.com/contact-us/",
      "email": "info@iwgcc.com"
    },
    {
      "url": "https://indianwoodgolfclub.com/contact/",
      "email": "admin@indianwoodgolfclub.com"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/8f60f330-86ac-11e4-8c28-020000005b00/indianwood-golf-country-club",
      "email": "info@indianwoodgolfclub.com"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/b2f89550-86ac-11e4-8c28-020000005b00/indianwood-golf-country-club",
      "email": "info@indianwoodgolfandcountryclub.com"
    },
    {
      "url": "https://indianwoodgolfclub.com/about-us/",
      "email": "admin@indianwoodgolfclub.com"
    },
    {
      "url": "https://www.iwgcc.com/weddings-corporate-events/",
      "email": "20info@iwgcc.com"
    },
    {
      "url": "https://www.iwgcc.com/weddings-corporate-events/",
      "email": "emily@iwgcc.com"
    },
    {
      "url": "https://www.iwgcc.com/weddings-corporate-events/",
      "email": "info@iwgcc.com"
    },
    {
      "url": "https://www.iwgcc.com/about/",
      "email": "20info@iwgcc.com"
    },
    {
      "url": "https://www.iwgcc.com/about/",
      "email": "info@iwgcc.com"
    },
    {
      "url": "https://www.indianwoodgolfclub.com/membership/",
      "email": "admin@indianwoodgolfclub.com"
    },
    {
      "url": "https://www.iwgcc.com/about-us/",
      "email": "20info@iwgcc.com"
    },
    {
      "url": "https://www.iwgcc.com/about-us/",
      "email": "info@iwgcc.com"
    }
  ],
  "mails": [
    "20info@iwgcc.com",
    "admin@indianwoodgolfclub.com",
    "emily@iwgcc.com",
    "indianwood@legacymhc.com",
    "info@indianwoodgolfandcountryclub.com",
    "info@indianwoodgolfclub.com",
    "info@iwgcc.com"
  ],
  "nombre_sitio": "indianwoodgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.iwgcc.com/",
      "text": "Indianwood Golf & Country Club Skip to content 248.693.9100 info@iwgcc.com 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 Facebook Membership Login Indianwood - Golf & Country Club - Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Become A Member Home Established In 1925 Our “Old” Course is annually ranked in America’s top 100 classic golf courses. Learn More Voted One of America's great country clubs. Indianwood is a historic treasure dating back to the 1920s, and the “Old” course is annually ranked in America’s top 100 classic golf courses. Indianwood has a proud history in which four major championships have been played on the “Old” course; 1930 Western Open Gene Sarazen, 1989 Women’s US Open Betsy King, 1994 Women’s US Open Patty Sheehan, and 2012 US Senior Open Roger Chapman. History & Tradition View Our History Weddings & Events Reserve Your Event Was lucky enough to win a round for 4 on the Old Course. The course was a great challenge and fun layout that makes you focus on accuracy over length. The staff was extremely friendly especially for us not being members. It was a great experience and hope to have the chance to come back one day. Michael Mitchell Google We attended a wedding at this exclusive club and we're amazed by the architecture and catering service.  The food was very good and the staff friendly and helpful.  The golf course near the club house was also very impressive, well kept, and surrounded by 100+ year old pine trees.  What a fabulous place ! Mike Moore Google Remarkable, Attended my cousins wedding and, we thought we went back in time. The architectural detail to the inside and out has a viking Castel feel. If you love the renasissance look and feel as I do, then this is the place for you. Stacy Harrison Google Previous Next A Message From The Aldridge Family “We became caretakers of a unique and unrecognized piece of history. We wanted to make Indianwood more appealing so people could see it for what it was originally and is now again. There is a great pride for my family and the membership to be part of history like this. We are all proud of this grand old club.” Golf Memberships Join Our Golf Club Family & Social Memberships Become A Member Indianwood Golf & Country Club prides itself on it's members. We pledge to make Indianwood the best country club for our members. We now offer four great levels of membership to choose from. default Subscribe To Indianwood News Be the first to know about special offers, events, and more. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Subscribe What our attendees are saying! Book Your Trip \"I really enjoyed the Revive Re-treat in Destin recently! The house and Location were amazing! The food that Carrie made every day was fantastic! I loved learning about healthy alternatives to every day dishes. What a treat to be served such delicious meals! Workouts were hard but very doable and for all fitness levels. It was a nice balance between strength, yoga, stretching and cardio. I loved the walks and bike ride! So much fun biking in a group like that. I can’t say enough about the trainers Terry and Omari. Always kind and encouraging. And really made the workouts fun! If you’re on the fence about joining a retreat like this don’t be! The group atmosphere was amazing and there were all age and fitness levels. I really enjoyed the group meals and the discussions during dinner and of course the game nights! Looking forward to the next one!\" Terri Anderson Nashville, Tn. \"This was my first Re-Treat. And it certainly won’t be my last. I had many emotions about attending a Retreat where I was totally immersed in learning about improving my health, both physically and mentally. Would I fit in? Could I keep up? Was I too old to keep up with younger attendees? How will I look? I discovered quickly how those fears were so unnecessary. Each of us were unique, had different goals, and different fears to conquer. And with the expert guidance of our trainers, we were all guided in positive ways to overcome them. This was a “retreat”, not a boot-camp. I loved that the schedule allowed for down time, reflection time, group fun time and sharing our goals. We all helped train each other through our own experiences.\nI learned so much more than expected. Mostly that I am stronger than I thought; and that a well-rounded exercise plan is essential that includes a focus on functional movement and flexibility. And from our chef, Carrie Barga, I learned so much about healthy ways to improve the quality of the foods I prepare and what to look for when shopping. Thank you so much, Carrie!\nAll-in-all, the trainers are exceptional! We all had personal guidance, respect, and positive encouragement. Terry Barga and Omari Bernard have many years of combined experience and genuinely want to help each person achieve their goals, physically and mentally, and they do it with heart. Jean MacTarnahan Portland, Oregon Meet Your Trainers / Educators Omari Bernard Omari Bernard  is a Certified Exercise Physiologist specializing in corrective exercise and postural alignment. He started his career working with Cris Carter at his sports performance and training facility in Boca Raton, Florida, where he coached athletes to increase their speed, power, and strength. Terry Barga Terry Barga Is a Certified Master Trainer & Nutrition Specialist. He has been a trainer for 16 years owning gyms across the Middle Tennessee area. Specialties include, HIIT training, corrective movement, mobility, strength & conditioning and yoga. Carissa Barga Carrie is a mother of 4 and co-owner of TrainOD alongside Terry she has worked with clients for over 15 years teaching nutrition tricks and hacks. She has taught numerous cooking classes for hundreds of clients. Read More Why Should I go to a Revive Retreat? Because YOU Matter! Let’s be honest, there are a lot of options when it comes to self improvement. From books to coaching, mentorships, memberships, and everything in between. Revive Retreats was founded by a team of life coaches who learned over the years that in order to experience true transformation, you need to physically get away from your comfort zone. You literally need to escape and in order to escape you have to make the time and space for it. Well, that time is now and the space is at any of our amazing retreats! Book Your Trip Latest From Instagram This error message is only visible to WordPress admins Error: No connected account. Please go to the Instagram Feed settings page to connect an account. No posts found! Indianwood - Golf & Country Club - Facebook About Us Indianwood is a historic treasure dating back to the 1920s, and the “Old” course is annually ranked in the top 100 classic golf courses in America. Indianwood has a proud history of four major championships on the “Old” course. Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Location 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 248.693.9100 info@iwgcc.com Account / Login © 2023 Indianwood Golf & Country Club. All Rights Reserved. Terms & Conditions."
    },
    {
      "url": "https://indianwoodgolfclub.com/event-hosting/",
      "text": "Event Hosting | Indianwood Golf Course Bar and Grille Florida (772) 597-3794 Admin@IndianwoodGolfClub.com Facebook Instagram Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Select Page EVENT BOOKING We strive to ensure that your events are memorable and enjoyable. Contact Us for your wedding hosting, anniversary/retirement or birthday parties, corporate events, fundraising / charity events abd golf tournaments. Our banquet areas are available for both private and corporate events. From the moment your guests drive up to our beautiful and spacious 5,000 square-foot clubhouse, they will revel in the lovely golf course surroundings. If you have questions or would like to book and event at our club; Contact our Event Hosting Department at admin@indianwoodgolfclub.com or Phone:  (772) 597-3794 Owned and Operated by: Tom Floberg, PGA Professional Jeff Sweet, Greens Superintendent Map to Location Our Address Address : Pro Shop 14007 SW Golf Club Drive Indiantown, FL 34956 Phone: (772) 597-3794 Email: Admin@IndianwoodGolfClub.com Restaurant: (772) 597-3790 Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Copyright 2024 Indianwood Golf Club .  All Rights Reserved"
    },
    {
      "url": "https://indianwoodgolfclub.com/",
      "text": "Indianwood Golf Club and Restaurant FL (772) 597-3794 Admin@IndianwoodGolfClub.com Facebook Instagram Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Select Page Indianwood Golf Course Make a Tee Time Event Hosting Info Great Golf - Great Food Experience The Outpost Bar and Grille at Indianwood Golf Club and enjoy the best deals in the area on golf and dining.  We also offer a fantastic venue to host your next event - retirement or birthday parties, proms, charity golf tournaments, weddings or corporate outings. Indianwood Golf Club has is a great layout for beginners but can also challenge low handicap players with the different tees we have on our championship course.   After your round enjoy the wonderful fun ambience of our dining room and lounge.  Our outdoor patio is a fantastic place to go over the scorecards, enjoy the view of the 9th and 18th holes and have some refreshments! CLICK HERE to see our Full Menu Those who love golf, love Indianwood. Our course was designed by Mr. Ted McAnlis, architect for such courses as St. Andrews in Boca Raton, and Wellington Golf Club in Palm Beach County. This beautiful, par-70, 18-hole championship course features a layout that is both challenging and fun for today’s golfer. Membership Opportunities We invite you to visit our course and find out first hand about our Club! Our Membership Director will be happy to introduce you to our fine golf course, outline the benefits you can enjoy as Members and fully acquaint you with the Club’s membership options. Please call (772) 597-3794 to schedule your visit. Membership Types and Pricing Facebook Feed For all the latest news, events and specials, follow us on our Facebook Page at http://Facebook.com/IndianwoodGolf Reviews & Testimonials Read or Leave Google Reviews Here! Owned and Operated by: Tom Floberg, PGA Professional Jeff Sweet, Greens Superintendent Map to Location Our Address Address : Pro Shop 14007 SW Golf Club Drive Indiantown, FL 34956 Phone: (772) 597-3794 Email: Admin@IndianwoodGolfClub.com Restaurant: (772) 597-3790 Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Copyright 2024 Indianwood Golf Club .  All Rights Reserved"
    },
    {
      "url": "https://www.indianwoodmhc.com/contact/",
      "text": "Contact Us | Indianwood 55+ Community in Indiantown, FL Toggle Navigation Homes for sale Directions (772) 597-3792 Schedule A Tour Apply For Residency ABOUT US Gallery Amenities Our Community Map Contact Us Resident Portal Directions (772) 597-3792 Homes for sale Schedule A Tour Option-1: Option-2: Contact Thank You for Your Interest For more information, please call, email or fill out the form below and we will be in touch shortly. Option-1: Option-2: Stop By and Visit Us Indianwood Golf & Country Club 16336 SW Indianwood Circle Indiantown, FL 34956 Get Directions > Give Us a Call (772) 597-3792 Drop Us a Line indianwood@legacymhc.com Office Hours Monday – Friday: 9:00am – 4:00pm Saturday & Sunday: By Appointment Fill out this form Option-1: Option-2: Office Hours Monday – Friday 9AM – 4PM community raves Our Address Indianwood Golf & Country Club 16336 SW Indianwood Circle Indiantown,\n                                FL  34956 Get Directions Phone Number (772) 597-3792 Email Us indianwood@legacymhc.com Office Hours: Monday – Friday 9AM – 4PM About Us Homes For Sale Contact Us Careers Resident Portal Facebook Instagram © 2025\n                        Indianwood Golf & Country Club \n                        | Privacy Policy | ADA Compliance | Website by Big Rig Media LLC ® Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.iwgcc.com/contact-us/",
      "text": "Contact – Indianwood Golf & Country Club Skip to content 248.693.9100 info@iwgcc.com 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 Facebook Membership Login Indianwood - Golf & Country Club - Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Become A Member Contact Have a Question? We are very interested in hearing from you. Please fill out the form, and we will get back to you. 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 Phone: 248.693.9100 Fax: 248.693.3369 info@iwgcc.com Follow Indianwood On Social Media: Facebook Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Subject * -- Select One -- Golf Course Question Membership Question Weddings and Events Question Media Question General Question Comment or Message Send Message Indianwood - Golf & Country Club - Facebook About Us Indianwood is a historic treasure dating back to the 1920s, and the “Old” course is annually ranked in the top 100 classic golf courses in America. Indianwood has a proud history of four major championships on the “Old” course. Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Location 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 248.693.9100 info@iwgcc.com Account / Login © 2023 Indianwood Golf & Country Club. All Rights Reserved. Terms & Conditions."
    },
    {
      "url": "https://indianwoodgolfclub.com/contact/",
      "text": "Contact | Indianwood Golf Course Bar and Grille Florida (772) 597-3794 Admin@IndianwoodGolfClub.com Facebook Instagram Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Select Page Contact Contact Form We look forward to your comments questions or suggestions. Your Name Your Email Phone # Subject Message 7 + 1 = Send Message Address : 14007 SW Golf Club Drive Indiantown, FL 34956 Phone: (772) 597-3794 Email: Admin@IndianwoodGolfClub.com Restaurant: (772) 597-3790 Owned and Operated by: Tom Floberg, PGA Professional Jeff Sweet, Greens Superintendent Map to Location Our Address Address : Pro Shop 14007 SW Golf Club Drive Indiantown, FL 34956 Phone: (772) 597-3794 Email: Admin@IndianwoodGolfClub.com Restaurant: (772) 597-3790 Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Copyright 2024 Indianwood Golf Club .  All Rights Reserved"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/8f60f330-86ac-11e4-8c28-020000005b00/indianwood-golf-country-club",
      "text": "Indianwood Golf & Country Club - Scorecards, Reviews | 18Birdies Best Golf App 190k Ratings star star star star star 4.9 Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Follow Us Navigations Indianwood Golf & Country Club Length 6008 yds Rating 69.1 Slope 129 3.8 star star star star-o star star-o 131 Reviews 79 Followers Indianwood Golf & Country Club is an 18-hole par-70 course in Indianwood, FL along the Treasure Coast. It is close to urban conveniences without typical south Florida congestion. Where pine forests, palm trees and lakes provide the perfect setting. Address: 14007 Golf Club Drive, Indiantown, FL 34956 Phone: 1 (772) 597-3794 Email: info@indianwoodgolfclub.com Website: https://www.indianwoodgolfclub.com/ Available Services Driving Range(Mat) Putting Green Practice Bunker Motor Cart Pull Cart Golf Club Rental Club Fitting Pro Shop Golf Lessons Restaurant Receptions Changing Room Locker Room Lodging Share to: Scorecard Indianwood Blue 6008 yds (129/69.1) for Men Blue 6008 yds for Women White 5616 yds (120/67.3) for Men White 5616 yds (124/72.2) for Women Green 5151 yds (112/64.7) for Men Green 5151 yds (118/69.5) for Women Red 4750 yds for Men Red 4750 yds (112/66.9) for Women Hole Par Handicap Blue 1 4 11 346 2 4 3 388 3 3 15 197 4 5 5 506 5 4 13 325 6 3 17 164 7 4 9 365 8 5 1 518 9 4 0 394 OUT 36 3203 TOT Hole Par Handicap Blue 10 4 8 360 11 3 14 183 12 4 6 337 13 3 16 166 14 5 2 526 15 3 10 193 16 5 12 486 17 3 18 140 18 4 4 414 IN 34 2805 TOT 70 6008 View Scorecards for Courses Worldwide Course Reviews 3.8 out of 5 star star star star-o star star-o 131 Reviews Value 4.2 star Course Condition 3.6 star Course Difficulty Medium Green Speed Medium Pace of Play Fast Jake summey star star-o star-o star-o star-o Mar 23, 2025 Paul Michael Calvani star star star star star Mar 2, 2025 This course is pretty hard, it’s long… you need to get perfect drives and perfect 3 wood shots , the par 4s are what par 5s are normally, there aren’t even many bunkers and there’s barely water it’s just long. Can’t wait to come back and get better. Logan Loyola star star star star star-o Jan 8, 2025 William Snyder star star star star star-o Dec 14, 2024 The staff in the pro shop was genuinely friendly. We grabbed a hotdog in the clubhouse that was excellent. Extremely relaxed. Kevin Tvenstrup star star star star star-o Sep 23, 2024 View More Course Reviews Download 18Birdies to View Course Insights Including Hole-by-Hole Stats & More · Golf GPS · Stats · Scorecards · Courses Worldwide google-play Followers(79) Leaderboards Indianwood - Best Gross (All times) 1 B. Verni -8 (62) 2 M. Santiago -7 (63) 3 H. Hipp -5 (65) 4 M. Coluccio -1 (69) 5 C. O'Loughlin +1 (71) View Complete Leaderboard Company About Us Our Mission Featured In Shop Features Digital Caddy School AI Swing Analyzer Community Tournaments Golf Courses Resources Contact Us Become an Ambassador FAQs Premium Membership Follow Us © 18Birdies, LLC.All Rights Reserved. Legal Information Terms of Service Privacy Policy"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/b2f89550-86ac-11e4-8c28-020000005b00/indianwood-golf-country-club",
      "text": "Indianwood Golf & Country Club - Scorecards, Reviews | 18Birdies Best Golf App 190k Ratings star star star star star 4.9 Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Follow Us Navigations Indianwood Golf & Country Club Length 6904 yds Rating 73.6 Slope 140 4.9 star star star star star-o star 151 Reviews 102 Followers Address: 1081 Indianwood Rd, Lake Orion, MI Phone: 1 (248) 693-8049 Email: info@indianwoodgolfandcountryclub.com Website: http://iwgcc.com/ Available Services Putting Green Motor Cart Pull Cart Golf Club Rental Club Fitting Pro Shop Golf Lessons Restaurant Receptions Changing Room Share to: Scorecard New Course Old Course Modified Gold 6904 yds (140/73.6) for Men Modified Gold 6904 yds for Women Back 6308 yds (133/71.8) for Men Back 6308 yds for Women Middle 5568 yds (123/68.8) for Men Middle 5568 yds (138/73.9) for Women Forward 5013 yds for Men Forward 5013 yds (128/71.1) for Women Championship (146/74.4) for Men Championship for Women Hybrid Blue/White (127/70.4) for Men Hybrid Blue/White for Women Hole Par Handicap Modified Gold 1 4 16 381 2 4 6 406 3 3 12 201 4 5 2 551 5 4 4 438 6 3 14 210 7 4 8 442 8 4 18 291 9 5 10 576 OUT 36 3496 TOT Hole Par Handicap Modified Gold 10 3 17 135 11 4 3 440 12 4 7 393 13 3 15 175 14 5 9 549 15 4 1 456 16 4 11 364 17 4 13 371 18 5 5 525 IN 36 3408 TOT 72 6904 View Scorecards for Courses Worldwide Course Reviews 4.9 out of 5 star star star star star-o star 151 Reviews Value 4.6 star Course Condition 4.7 star Course Difficulty Hard Green Speed Fast Pace of Play Fast Griffin Harper star star star star star Jul 9, 2025 Matthew Reitmyer star star star star star Jun 14, 2025 Dian Xu star star star star star Jul 23, 2024 Erik Phillips star star star star star Jul 13, 2024 Aidan Devito star star star star star Jun 22, 2024 View More Course Reviews Download 18Birdies to View Course Insights Including Hole-by-Hole Stats & More · Golf GPS · Stats · Scorecards · Courses Worldwide google-play Followers(102) Leaderboards New Course - Best Gross (All times) T1 A. Montgomery -11 (61) T1 P. Lopez -11 (61) T1 D. staczek -11 (61) 4 K. Lundquist -10 (62) T5 A. Murai -9 (63) View Complete Leaderboard Company About Us Our Mission Featured In Shop Features Digital Caddy School AI Swing Analyzer Community Tournaments Golf Courses Resources Contact Us Become an Ambassador FAQs Premium Membership Follow Us © 18Birdies, LLC.All Rights Reserved. Legal Information Terms of Service Privacy Policy"
    },
    {
      "url": "https://indianwoodgolfclub.com/about-us/",
      "text": "About Us | Indianwood Golf Course Bar and Grille Florida (772) 597-3794 Admin@IndianwoodGolfClub.com Facebook Instagram Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Select Page About Us Home / About Us Great Golf - Great Food Experience The Outpost Bar and Grille at Indianwood Golf Club and enjoy the best deals in the area on golf and dining.  We also offer a fantastic venue to host your next event - retirement or birthday parties, proms, charity golf tournaments, weddings or corporate outings. Indianwood Golf Club has is a great layout for beginners but can also challenge low handicap players with the different tees we have on our championship course.   After your round enjoy the wonderful fun ambience of our dining room and lounge.  Our outdoor patio is a fantastic place to go over the scorecards, enjoy the view of the 9th and 18th holes and have some refreshments! CLICK HERE to see our Full Menu Those who love golf, love Indianwood. Our course was designed by Mr. Ted McAnlis, architect for such courses as St. Andrews in Boca Raton, and Wellington Golf Club in Palm Beach County. This beautiful, par-70, 18-hole championship course features a layout that is both challenging and fun for today’s golfer. Our Team Member Luciana Mogi CEO Jonathan Tristan Support Staff Jessica Lindor Support Staff Ryan Morris Support Staff Subscribe To our newsletter Success! Email Subscribe Now Owned and Operated by: Tom Floberg, PGA Professional Jeff Sweet, Greens Superintendent Map to Location Our Address Address : Pro Shop 14007 SW Golf Club Drive Indiantown, FL 34956 Phone: (772) 597-3794 Email: Admin@IndianwoodGolfClub.com Restaurant: (772) 597-3790 Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Copyright 2024 Indianwood Golf Club .  All Rights Reserved"
    },
    {
      "url": "https://www.iwgcc.com/weddings-corporate-events/",
      "text": "Weddings / Corporate Events – Indianwood Golf & Country Club Skip to content 248.693.9100 info@iwgcc.com 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 Facebook Membership Login Indianwood - Golf & Country Club - Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Become A Member Weddings / Corporate Events Weddings / Corporate Events Home > Weddings / Corporate Events Contact Us For Wedding / Corporate Event Packages View Photobook Allow Indianwood Golf and Country Club to host your Wedding! With several beautiful spaces to host any event, from corporate meetings to wedding receptions, Indianwood creates an atmosphere your guests will love. In addition to the unique ambiance of our clubhouse, our staff is known for its culinary excellence, friendly service, and ability to work within any budget. Contact us today for more information: Emily Morlan 248.693.9100 Ext. 49 emily@iwgcc.com A Perfect Location For Corporate Meetings Previous image Next image Boardroom We can accommodate up to 24 guests for private meetings or private luncheons. St. Andrews Which is one of our ceremony sites and is also used for golf outing registrations or small events and meetings. The Mixed Grill The Mixed Grill can accommodate up to 120 or 150 for an event. the fireplace The Mixed Grill is a popular site for wedding ceremonies as well. the Great Hall This location can accommodate up to 190 for a wedding. Golf Outings & Event Hosting Allow Indianwood Golf and Country Club to host your next golf event! A golf outing at Indianwood is a great way to reward the hard work of your employees, the loyalty of customers, or to contribute to charity within the community. Was lucky enough to win a round for 4 on the Old Course. The course was a great challenge and fun layout that makes you focus on accuracy over length. The staff was extremely friendly especially for us not being members. It was a great experience and hope to have the chance to come back one day. Michael Mitchell Google We attended a wedding at this exclusive club and we're amazed by the architecture and catering service.  The food was very good and the staff friendly and helpful.  The golf course near the club house was also very impressive, well kept, and surrounded by 100+ year old pine trees.  What a fabulous place ! Mike Moore Google Remarkable, Attended my cousins wedding and, we thought we went back in time. The architectural detail to the inside and out has a viking Castel feel. If you love the renasissance look and feel as I do, then this is the place for you. Stacy Harrison Google Great, all encompassing venue. I would highly recommend this venue. We had our ceremony and reception here and everything went off without a hitch. Emily was extremely helpful and accommodating before our wedding day, but especially all throughout our wedding. I would highly recommend this gorgeous venue; and the food was delicious too. Emma Our Indianwood Wedding!\n\nIndianwood gave us the wedding of our dreams! We could not have asked for a more picturesque place within our budget! Emily was very patient and accommodating with our requests, the banquet staff service was phenomenal, the golf course is beautifully maintained offering stunning photo opportunities, and of course the food was fabulous! We would recommend Indianwood to any couple! Kelly Elizabeth and Michael August Wedding\n\nIndianwood Golf and Country Club was the perfect venue for our wedding. From the moment we met Emily, their Director of Special Events, we were sold - she was so down to earth and kind, making the entire planning process a breeze. Answering every question and allowing us to come see the space as often as needed. The venue itself is absolutely breathtaking, with a beautiful mix of elegant indoor space and gorgeous outdoor area. Every detail of the decor and design had a special story behind it, creating such a warm and welcoming atmosphere. The team at Indianwood truly went above and beyond to ensure our day was absolutely perfect, and we are so grateful for their hard work and professionalism. We couldn't have asked for a more beautiful, grand, and memorable wedding venue. Liz M Previous Next Ready To Host Your Event? Contact Us Wedding photobook Indianwood - Golf & Country Club - Facebook About Us Indianwood is a historic treasure dating back to the 1920s, and the “Old” course is annually ranked in the top 100 classic golf courses in America. Indianwood has a proud history of four major championships on the “Old” course. Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Location 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 248.693.9100 info@iwgcc.com Account / Login © 2023 Indianwood Golf & Country Club. All Rights Reserved. Terms & Conditions."
    },
    {
      "url": "https://www.iwgcc.com/about/",
      "text": "Our History – Indianwood Golf & Country Club Skip to content 248.693.9100 info@iwgcc.com 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 Facebook Membership Login Indianwood - Golf & Country Club - Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Become A Member Our History Previous image Next image Indianwood Golf and Country Club – Truly a Golfers Golf Club Wilfred Reid – player, administrator, and golf course designer Indianwood is the mastermind of Mr. Frank Blair. Mr. Blair was president of Union Trust and was responsible for the creation of what was originally the Union Trust Building and is now the Guardian Building, one of Detroit’s greatest architectural gems. In the roaring 1920s, Mr. Blair and his cronies at the St. Clair Country Club decided to turn his country farm in Lake Orion into an 18-hole championship golf club with a housing development across the street on Indianwood Lake. Given Mr. Blair’s stature in Detroit society, Indianwood would be one of the best golf clubs in the country, and the residential development would be very exclusively reserved for Detroit’s elite. He even went as far as building a landing strip so the movers and shakers of the auto world could arrive quickly and avoid the train ride that was the standard means of transport to Lake Orion at the time (remember Lake Orion was considered “Up North” in the 1920s). Mr. Blair hired golf professional and architect Wilfred Reid to design this championship course, and Mr. Reid partnered with his associate William Connellan to handle the construction duties. Mr. Blair was clear on the intent of this new club – it is to be one of the best in the country no matter the cost. Mr. Reid set out to design an 18-hole course that would be a challenge for all the top professional golfers of the time. Indianwood opened rave reviews from the golfing world in 1925. The master creation of golf course architect Wilfried Reed is still, to this day, one of the best golf courses in the United States. The original barns at Indianwood Indianwood did not have to look far for a clubhouse as the original barns on the property were well suited for this purpose; remember, we are talking about Frank Blair. The barns are not just normal wooden farm buildings. They were all cinderblock over built rock-solid buildings that are still present today. The upstairs of the horse barn and the then-new addition to the cattle barn was even turned into boarding rooms to accommodate overnight stays. The chicken coup was, of course, the new “Men’s” locker room. Indianwood did not have to wait long to be the center of the golf world, as the 1930 Western Open was slated to come to Lake Orion. All the top professional golfers in the world would make the trek to compete in what was the 4th major at the time. The reviews did not disappoint, and Indianwood’s prominence as a top golf club was cemented. Gene Sarazen won the $500 prize for first place over Tommy Armour, Walter Hagen, Al Watrous, and runner-up Al Espinosa. The Club House in 1930s The dark days of the Depression were hard on Indianwood as Mr. Blair lost Indianwood to creditors. In the 1940’s Carl Ruebelman, a local Lake Orion businessman, purchased the club and brought it back to prosperity. Mr. Ruebelman spent a considerable amount of money renovating the clubhouse and even refurbished the boarding rooms to make Indianwood a year-round country club. The Michigan PGA returned to Indianwood in 1948 and 1949, with Horton Smith (Michigan Golf Hall of Fame inductee) winning in ’48 and Ed Furgol taking top billing in ’49. Previous image Next image The Club House in 1940s In 1981 Stan Aldridge purchased Indianwood and proceeded to take on a huge restoration of not only the clubhouse but the course as well. The clubhouse got a complete renovation with new oak paneling, a tower, antique stained-glass windows, and a new brick vernier. The original pro shop was converted into the cart barn, the then pro shop was converted into a banquet room, and the maintenance building that was the original maintenance barn for the Blair farm was now the pro shop. Mr. Aldridge did not stop there, a new 30,000sf addition was designed and included historic rooms from the Horse Barracks at Windsor Castle and a 16th-century Belgian Chateau. Interestingly the architect that was hired to design the clubhouse addition, Bill Zmistowski, is the grandson of Wilfred Reid. Work continued on the golf course, and a new irrigation system was installed, bunkers were completely renovated, and some new tees were added. Famed golfer Jerry Pate and golf course architect Bob Cupp were hired to construct the New Course across the street on land that Mr. Aldridge assembled. The New Course opened in 1988 and was Golf Digest runner-up in the Best New Privet Course of the Year Award. Indianwood now has two great golf courses. The 18th Green When Mr. Aldridge purchased the club, he aspired to take Indianwood back to the original intent of Mr. Blair. Mr. Aldridge secured the 1989 US Women’s Open, and major professional golf was back at Indianwood. The Championship set a new attendance record for women’s golf, and the club was praised by all the players and gained national notoriety. The Championship was won by Betsy King, who shot 4 strokes below runner-up Nancy Lopez. Given the success of the Championship, Indianwood was awarded the 1994 US Women’s Open. This time the winner was Patty Sheehan, winning her second Open. Betsy Kind ended up tied for 6th place. Most recently, Indianwood played host to the US Senior Open in 2012, won by Roger Chapman in dramatic down-the-stretch fashion winning by two strokes over Fred Funk, Bernhard Langer, Tom Lehman, and Cory Pavin. Today the Aldridge family is still dedicated to ensuring Indainwood is one of the top golf clubs in the country. Other Tournaments of Note: 1927 Michigan PGA 1928 Michigan Open 1948 Michigan PGA 1949 Michigan PGA 1951 Michigan PGA 1952 Michigan Open 1956 Michigan Open 1982-1991 Michigan PGA 1987 US Open Qualifier 1990 US Women’s Open Qualifier Many European artifacts adorn the Club “We have a clipping from the 1930’s that stated Indianwood had been ranked as one of the top 10 clubs in America. We’re not sure who ranked them, but the greatness has always been at Indianwood. We became caretakers with the job of restoring the club to its original state and bringing back its prestige.” Most golf course owners would sit back and bring in others to do the job. Aldridge, however, is a man who puts himself into a job with everything he has. After turning around a number of companies, Indianwood became the center of his attention. Ironically, the architect that Aldridge hired for the renovation was Bill Zmistowski, the great grandson of Wilfred Reid (Indianwood’s original architect). The club renovation became an Aldridge family project. Sue, Stan’s wife, who is an interior decorator was very involved in the renovation. Much of the exterior beauty of Indianwood comes from the eye of Sue Aldridge. Daughter Kelley also played a major role in the development and progress of Indianwood. This graduate from Michigan State in Construction Management was the construction superintendent of the 30,000 square foot clubhouse and locker room addition completed in early 1989. The clubhouse was truly Kelley’s project. Her work with the beautiful stained glass (brought to Lake Orion from Europe) and the intricacies of each segment of the addition only brightens the spotlight shining on the club. Sons Kirk and Kevin have also been involved at Indianwood. Both have spent time on bulldozers on the new course and have helped manage the day-to-day operations of the club. Kimberly the middle child has been actively involved at Canterbury Village, another of Aldridge’s projects. The two youngest members of the family also have spent time at the club. Katie worked on the U.S. Women’s Open in 1994 and son Keith spent many summers helping at the club while away from playing collegiate hockey at Lake Superior State University in Northern Michigan. The tradition at Indianwood will be carried on by the Aldridge family in the 20th century. Keith has taken over the day to day operations, Kelly will be the 2012 US Senior Open Tournament Director and Kevin with his golf course construction background will be updating the “OLD” course, changes that the USGA has recommended for the championship. “We became caretakers of a unique and unrecognized piece of history. We wanted to make Indianwood more appealing so people could see it for what it was originally and is now again. There is a great pride for my family and the membership to be part of history like this. We are all proud of this grand old club.” Indianwood - Golf & Country Club - Facebook About Us Indianwood is a historic treasure dating back to the 1920s, and the “Old” course is annually ranked in the top 100 classic golf courses in America. Indianwood has a proud history of four major championships on the “Old” course. Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Location 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 248.693.9100 info@iwgcc.com Account / Login © 2023 Indianwood Golf & Country Club. All Rights Reserved. Terms & Conditions."
    },
    {
      "url": "https://www.indianwoodgolfclub.com/membership/",
      "text": "Membership | Indianwood Golf Course Bar and Grille Florida (772) 597-3794 Admin@IndianwoodGolfClub.com Facebook Instagram Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Select Page Membership by admin | Dec 4, 2024 About Our Blog Indianwood Golf Club Categories Latest News Uncategorized Owned and Operated by: Tom Floberg, PGA Professional Jeff Sweet, Greens Superintendent Map to Location Our Address Address : Pro Shop 14007 SW Golf Club Drive Indiantown, FL 34956 Phone: (772) 597-3794 Email: Admin@IndianwoodGolfClub.com Restaurant: (772) 597-3790 Facebook Instagram Home Book Tee Time Golf Course Restaurant / Menu Event Hosting Memberships Reviews Contact Copyright 2024 Indianwood Golf Club .  All Rights Reserved"
    },
    {
      "url": "https://www.iwgcc.com/about-us/",
      "text": "About Us – Indianwood Golf & Country Club Skip to content 248.693.9100 info@iwgcc.com 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 Facebook Membership Login Indianwood - Golf & Country Club - Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Become A Member About Us Family Tradition Since 1925 A historic treasure dating back to the 1920s Indianwood opened to rave reviews from the golfing world in 1925. The maser creation of golf course architect Wilfried Reed is still to this day one of the best golf courses in the United States. Join Our Golf Club Photo Gallery Was lucky enough to win a round for 4 on the Old Course. The course was a great challenge and fun layout that makes you focus on accuracy over length. The staff was extremely friendly especially for us not being members. It was a great experience and hope to have the chance to come back one day. Michael Mitchell Google We attended a wedding at this exclusive club and we're amazed by the architecture and catering service.  The food was very good and the staff friendly and helpful.  The golf course near the club house was also very impressive, well kept, and surrounded by 100+ year old pine trees.  What a fabulous place ! Mike Moore Google Remarkable, Attended my cousins wedding and, we thought we went back in time. The architectural detail to the inside and out has a viking Castel feel. If you love the renasissance look and feel as I do, then this is the place for you. Stacy Harrison Google Previous Next A Message From The Aldridge Family “We became caretakers of a unique and unrecognized piece of history. We wanted to make Indianwood more appealing so people could see it for what it was originally and is now again. There is a great pride for my family and the membership to be part of history like this. We are all proud of this grand old club.” Indianwood - Golf & Country Club - Facebook About Us Indianwood is a historic treasure dating back to the 1920s, and the “Old” course is annually ranked in the top 100 classic golf courses in America. Indianwood has a proud history of four major championships on the “Old” course. Menu Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Home About Us Our History Memberships Class “A” Membership Class “B” Membership Family Fitness Membership Social / Pool Membership Weddings / Events Wedding Photobook Contact Location 1081 Indianwood Road, P.O. Box 5 Lake Orion, Michigan 48361 248.693.9100 info@iwgcc.com Account / Login © 2023 Indianwood Golf & Country Club. All Rights Reserved. Terms & Conditions."
    }
  ]
}