{
  "fuentes": [
    {
      "url": "https://www.indianspringcc.com/login",
      "email": "jlytle@concertgolfclubs.com"
    },
    {
      "url": "https://argylecountryclub.com/contact-us/",
      "email": "catering@argylecountryclub.com"
    },
    {
      "url": "https://argylecountryclub.com/contact-us/",
      "email": "communications@argylecountryclub.com"
    },
    {
      "url": "https://argylecountryclub.com/contact-us/",
      "email": "membership@argylecountryclub.com"
    },
    {
      "url": "https://www.indianspringcc.com/careers",
      "email": "jlytle@concertgolfclubs.com"
    },
    {
      "url": "https://www.indiansprings-golf.com/aboutus/rates/",
      "email": "info@indiansprings-golf.com"
    },
    {
      "url": "https://www.marcosbanquet.com/indian-spring-country-club-photo-gallery/",
      "email": "events@marcosrestaurant.comcastbiz.net"
    },
    {
      "url": "https://www.indianspringcc.com/blog/-/blogs/april-s-showers-may-s-flowers-your-step-by-step-guide-to-planning-your-dream-wedding-",
      "email": "jlytle@concertgolfclubs.com"
    },
    {
      "url": "https://www.indiansprings-golf.com/contactus/",
      "email": "info@indiansprings-golf.com"
    },
    {
      "url": "https://www.walkaroo.in/pages/contact-us",
      "email": "customercare@walkaroo.in"
    },
    {
      "url": "https://concertgolfpartners.com/locations/indian-spring-country-club/",
      "email": "jpeace@concertgolfclubs.com"
    },
    {
      "url": "https://concertgolfpartners.com/locations/indian-spring-country-club/",
      "email": "membership@indianspringcc.com"
    },
    {
      "url": "https://concertgolfpartners.com/locations/indian-spring-country-club/",
      "email": "pnanula@concertgolfpartners.com"
    },
    {
      "url": "https://www.indianspringcc.com/weddings",
      "email": "jlytle@concertgolfclubs.com"
    },
    {
      "url": "https://www.indianspringcc.com/web/pages/contact-us",
      "email": "mvaughan@concertgolfclubs.com"
    },
    {
      "url": "https://www.indianspringcc.com/web/pages/contact-us",
      "email": "jlytle@concertgolfclubs.com"
    },
    {
      "url": "https://www.indianspringcc.com/web/pages/contact-us",
      "email": "mavery@fountainscc.com"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://concertgolfpartners.com/2024/02/19/concert-golf-partners-has-invested-over-4-million-of-capital-improvements-into-south-floridasindian-spring-c-c-and-fountains-c-c/",
      "email": "jpeace@concertgolfclubs.com"
    },
    {
      "url": "https://concertgolfpartners.com/2024/02/19/concert-golf-partners-has-invested-over-4-million-of-capital-improvements-into-south-floridasindian-spring-c-c-and-fountains-c-c/",
      "email": "mpadden@concertgolfclubs.com"
    },
    {
      "url": "https://concertgolfpartners.com/2024/02/19/concert-golf-partners-has-invested-over-4-million-of-capital-improvements-into-south-floridasindian-spring-c-c-and-fountains-c-c/",
      "email": "pnanula@concertgolfpartners.com"
    },
    {
      "url": "https://www.indianspringcc.com/contact-us",
      "email": "mvaughan@concertgolfclubs.com"
    },
    {
      "url": "https://www.indianspringcc.com/contact-us",
      "email": "jlytle@concertgolfclubs.com"
    },
    {
      "url": "https://www.indianspringcc.com/contact-us",
      "email": "mavery@fountainscc.com"
    },
    {
      "url": "https://www.palmbeachpost.com/story/business/2017/07/10/just-in-how-boynton-beach/7004087007/",
      "email": "aclough@pbpost.com"
    },
    {
      "url": "https://www.indianspringcc.com/about",
      "email": "jlytle@concertgolfclubs.com"
    },
    {
      "url": "https://www.indianspringcc.com/meetings-and-special-events",
      "email": "jlytle@concertgolfclubs.com"
    }
  ],
  "mails": [
    "aclough@pbpost.com",
    "catering@argylecountryclub.com",
    "communications@argylecountryclub.com",
    "contact@clubcarwash.com",
    "customercare@walkaroo.in",
    "events@marcosrestaurant.comcastbiz.net",
    "info@indiansprings-golf.com",
    "jlytle@concertgolfclubs.com",
    "jpeace@concertgolfclubs.com",
    "mavery@fountainscc.com",
    "membership@argylecountryclub.com",
    "membership@indianspringcc.com",
    "mpadden@concertgolfclubs.com",
    "mvaughan@concertgolfclubs.com",
    "pnanula@concertgolfpartners.com"
  ],
  "nombre_sitio": "indianspringcc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.indianspringcc.com/login",
      "text": "Login - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility Login Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu Sign In Member Login Member Number Required Password Required Remember Me Caps Lock is on. Show Password Sign In Forgot Password Login Instruction First Login Instructions Please enter your member number into the MEMBER NUMBER (username) field. For example, if your membership number is 12345, you will type 12345 in the \"MEMBER NUMBER\" box on the login screen. Your temporary password will be your last name lowercase. After you click \"SIGN IN\" you will be taken to a new screen where you will be required to update your temporary password to a secure password of your choosing. If you are the spouse of the primary member, please add ‘-S' after your member number as your login. (Ex:12345-S) Forgot Your Password? Have your member number ready. Click the Forgot Password link and enter your member number. You will receive an email with your password. If you would like additional assistance, please contact Us. 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    },
    {
      "url": "https://argylecountryclub.com/contact-us/",
      "text": "Contact Us - Argyle Country Club Skip to content About Us Golf Menu Toggle Course Elite Golfers Instruction & Tournaments Racquet Sports Membership Events Amenities Contact Us Log In Log In Main Menu About Us Golf Menu Toggle Course Elite Golfers Instruction & Tournaments Racquet Sports Membership Events Amenities Contact Us Log In Log In Get in Touch with Argyle Country Club Have questions about membership, events, or amenities? We’re here to help! Reach out to the appropriate department, and our team will be happy to assist you. Contact Us Argyle Country Club 14600 Argyle Club Rd,  Silver Spring, Maryland 20906 Phone Numbers Clubhouse: 301-598-5500 Golf Pro Shop: 301598-6949 Tennis Pro Shop: 301-598-0316 (April – October) Pool: 301-598-2290 (Memorial Day – Labor Day) Contact by Email General Inquiries: communications@argylecountryclub.com Membership Inquiries: membership@argylecountryclub.com Catering & Event Inquiries: catering@argylecountryclub.com To apply for a job position, please stop by the Clubhouse Front Desk to fill out an application. About Us Golf Membership Events Contact Us About Us Golf Membership Events Contact Us Address 14600 Argyle Club Rd, Silver Spring, Maryland 20906 Phone +1 301-598-5500 Copyright © 2025 Privacy Policy"
    },
    {
      "url": "https://www.indianspringcc.com/careers",
      "text": "Careers - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility Careers Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu HTML Generator Untitled Basic Web Content Join The Indian Spring & FountainsTeam! Thank you for your interest in Indian Spring Country Club. We offer a friendly, fast-paced professional environment where employees are developed for success. We have a full range of employment opportunities in a variety of fields at this prestigious Club. Many times we have opportunities available in food and beverage, maintenance, housekeeping, and landscaping. We are always accepting applications from qualified individuals that take pride in their work, love what they do, and look forward to being part of a great team. For more information about our open positions, please click on the link below. VIEW INDIAN SPRING & FOUNTAINS ON BETTERTEAM Indian Spring Country Club & Fountains Country Club are Equal Opportunity Employers. This company does not and will not discriminate in employment and personnel practices on the basis of race, sex, age, handicap, religion, national origin or any other basis prohibited by applicable law. Hiring, transferring and promotion practices are performed without regard to the above-listed terms. 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    },
    {
      "url": "https://www.indiansprings-golf.com/aboutus/rates/",
      "text": "Rates - Indian Springs Golf Club Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Indian Springs Golf Club Middlefield, CT Join our E-Club Book Tee Times Home Tee Times Member Tee Times E-Club About Us Rates Scorecard Course Photos Memberships Leagues Hosting an Event Youth Programs Instruction 2025 Driving Range Cafe Contact Us Online Store Shop Checkout Cart My account Book Tee Times Online Rates Memberships Instruction Rates Please review our rates for the 2025 golf season. If you have any questions, call the clubhouse and we will gladly answer them. You can reach us at (860) 349-8109. 2025 Rates Green Fees               Mon -Th Fri Weekends/Holidays 9 Holes Walking             $24 $25 $26 9 Holes Riding                $35 $36 $37 18 Holes Walking          $44 $48 $48 18 Holes Riding             $62 $69 $69 9 Holes 18 Holes Club Rental $10 $20 Pull Carts $5 $10 Small (30 Balls) Medium (70 Balls) Large (105 Balls) Driving  Range $5 $10 $15 Zany Janie Tournament Foursome $ 220.00 Add to cart Zany Janie Twosome $ 110.00 Add to cart 1 Night Eagle Multicolored Led Golf Ball $ 7.52 Add to cart Moonlight Madness Foursome $ 200.00 Read more $200 Gift Card $ 200.00 Add to cart Primary Sidebar Tee Time Online Store Footer Contact Us 1-860-349-8109 info@indiansprings-golf.com Follow Us Find Us 123 Mack Road Middlefield, CT 06455 Copyright © 2025 Indian Springs Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcosbanquet.com/indian-spring-country-club-photo-gallery/",
      "text": "Indian Spring Country Club - Photo Gallery - Marco's Restaurant & Events Indian Spring Pennsauken Home Weddings Wedding Venues Wedding Packages Restaurants Indian Spring Restaurant Pennsauken Restaurant Catering & Events Indian Spring Events Pennsauken Events Gift Certificates Photos About About Us Contact Indian Spring Country Club – Photo Gallery View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger View Larger Our Affiliates Golf at Indian Spring Country Club Golf at Pennsauken Pennsauken Township Join Our Mailing List Email address: Preferred Location: Pennsauken List Indian Spring List Leave this field empty if you're human: Navigation Home Wedding Venues & Reception Events at Indian Spring Events at Pennsauken Gift Certificates Photos Contact About Testimonials Follow Us Pennsauken Indian Spring Hours of Operation Indian Spring Location Mon – Sat 10:00AM – 9:00PM Sun 10:00AM – 7:00PM Pennsauken Location Mon – Tue 10:00AM – 6:00PM Wed – Thu 10:00AM – 8:00PM Fri 9:00AM – 9:00PM Sat 8:00AM – 9:00PM Sun 8:00AM – 7:00PM Contact Marco’s At Indian Spring Country Club 115 South Elmwood Road Marlton, NJ 08053 (856) 596-1106 [email protected] Marco’s At Pennsauken Country Club 3800 Haddonfield Road Pennsauken, NJ 08109 (856) 438-5283 [email protected] © 2025 Marco's Restaurant & Events. Local SEO & Marketing by Everymerchant.com Home Weddings Wedding Venues Wedding Packages Restaurants Indian Spring Restaurant Pennsauken Restaurant Catering & Events Indian Spring Events Pennsauken Events Gift Certificates Photos About About Us Contact"
    },
    {
      "url": "https://www.indianspringcc.com/blog/-/blogs/april-s-showers-may-s-flowers-your-step-by-step-guide-to-planning-your-dream-wedding-",
      "text": "April's Showers & May's Flowers: Your Step-by-Step Guide to Planning Your Dream Wedding! - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility April's Showers & May's Flowers: Your Step-by-Step Guide to Planning Your Dream Wedding! Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu HTML Generator Our Blog Our Blog Our blog is full of ideas for your events, fun facts, and more. We encourage you to read through each post at your leisure and contact our Catering Director to begin planning your next event. null Blogs April's Showers & May's Flowers: Your Step-by-Step Guide to Planning Your Dream Wedding! Nadia Sharp Published Date 1 Year Ago As April’s showers give way to May’s flowers, the season of love is in full bloom, making it the perfect time to plan your dream wedding. If you’ve ever dreamed of a timeless and elegant affair, a country club wedding could be just the ticket. With sprawling landscapes, refined amenities, and impeccable service, country clubs offer a picturesque backdrop for your special day. In this step-by-step guide, we’ll walk you through the process of planning your country club wedding, from selecting the perfect venue to saying “I do” in style. STEP 1: CHOOSE YOUR VENUE The first step in planning your country club wedding is to choose the perfect venue. Start by researching out to our Catering team and schedule tour to visit our beautiful country club. Consider factors such as the size of the club, the layout of the grounds, and the available amenities, such as indoor and outdoor ceremony spaces, banquet halls, and bridal suites. Don’t forget to inquire about pricing and any exclusive services offered by our country club to make your wedding truly unforgettable. STEP 2: SET A DATE & BUDGET It’s time to set a date and establish a budget for your wedding. Consider factors such as the season, availability of the club, and any special dates that hold significance for you and your partner. Work with the clubs Sales Director to determine pricing options that fit within your budget while still allowing you to create the wedding of your dreams. STEP 3: CUSTOMIZE YOUR WEDDING Work closely with the venue’s event coordinator to choose the perfect combination of services, from catering and bar options to decor and entertainment. Whether you envision a formal sit-down dinner or a casual buffet-style reception, our experienced staff at the club will work with you to bring your vision to life. STEP 4: SELECT YOUR VENDORS With the major details of your wedding package in place, it’s time to assemble your team of vendors to help bring your vision to life. Start by booking essential services such as a photographer, florist, and entertainment. Consider preferred vendors who have experience working with the country club venue to ensure a seamless and stress-free experience on your wedding day. Don’t forget to read reviews, ask for recommendations, and schedule meetings or consultations to ensure that you feel confident in your choices. STEP 5: ATTEND TO THE DETAILS As the big day approaches, it’s time to attend to the countless details that will make your country club wedding truly unforgettable. Finalize your guest list and RSVPs, create a timeline for the day’s events, and confirm arrangements with all of your vendors. Consider additional touches such as personalized signage, wedding favors, and decorative accents to add a personal touch to your celebration. Most importantly, take time to relax and enjoy this special time with your partner, knowing that your country club wedding is sure to be a day to remember. Planning a country club wedding is an exciting and rewarding experience, filled with endless possibilities for creating the wedding of your dreams. From selecting the perfect venue to customizing your wedding and attending to the smallest details, each step of the journey brings you closer to the wedding day you’ve always imagined. So, embrace the beauty of April’s showers and May’s flowers and let the elegance and charm of a country club wedding set the stage for a lifetime of love and happiness. Cheers to a day filled with joy, laughter, and cherished memories that will last a lifetime! planning wedding 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    },
    {
      "url": "https://www.indiansprings-golf.com/contactus/",
      "text": "Contact Us - Indian Springs Golf Club Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Indian Springs Golf Club Middlefield, CT Join our E-Club Book Tee Times Home Tee Times Member Tee Times E-Club About Us Rates Scorecard Course Photos Memberships Leagues Hosting an Event Youth Programs Instruction 2025 Driving Range Cafe Contact Us Online Store Shop Checkout Cart My account Book Tee Times Online Rates Memberships Instruction Contact Us Contact us to schedule a tee time and for information on leagues, or for inquiries about having a tournament at our course or hosting your upcoming event in our Fairweather Cafe. Club House : 123 Mack Road Middlefield, CT 06455 Tel.: (860)349-8109 E-mail: info@indiansprings-golf.com Interested in joining a great team? Fill out an Application for Employment ! Directions From I-691 east, to Route 66 east, turn right on Route 147, then left onto Way Road and follow signs to course on Mack Road. Sorry - your browser does not support iframes. Primary Sidebar Tee Time Online Store Footer Contact Us 1-860-349-8109 info@indiansprings-golf.com Follow Us Find Us 123 Mack Road Middlefield, CT 06455 Copyright © 2025 Indian Springs Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.walkaroo.in/pages/contact-us",
      "text": "Walkaroo Help Desk | Contact Us for Product or Order Support – Walkaroo Footwear Skip to content Men Men Women Women Boys, Girls and Kids Boys, Girls and Kids Bags Bags About About Log in Facebook X (Twitter) Instagram YouTube LinkedIn Search Site navigation Men Men Women Women Boys, Girls and Kids Boys, Girls and Kids Shoes Kids Shoes Boys Shoes Girls Shoes Sandals Kids Sandals Boys Sandals Girls Sandals School Shoes Kids Boys Girls Bags Bags Backpacks Duffle Bags Trekking Bags Bike Bags About About My Orders Return/Exchange About Us Contact Us Walkaroo Loyalty Plus Search Login Cart 0 Site navigation Cart 0 Recently viewed Cart Your cart is currently empty. Not sure where to start? Try these collections: Continue shopping Spend ₹ 500.00 more to reach free shipping! Tax included and shipping calculated at checkout Subtotal ₹ 0.00 Checkout Loading.. View cart Recently viewed Search Search Clear Men Shoes Sandals New & Trending Brands Women Shoes Sandals New & Trending Boys, Girls and Kids Shoes Sandals School Shoes Bags Backpacks Duffle Bags Trekking Bags Bike Bags About My Orders Return/Exchange About Us Contact Us Walkaroo Loyalty Plus Contact Us We'd love to hear from you. Our team is here to help. Please interact with our AI chatbot WalkBuddy for immediate replies. If your query was not resolved by the bot, you may use the contact form below: Name Email Phone number Order ID State District Product Order Press Distribution Services Other Subject Message Send message Send message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Address Walkaroo International Pvt Ltd. Plot No 10-12, SIDCO Industrial Estate Malumichampatti Coimbatore - 641 050 Email customercare@walkaroo.in Phone +91 011-6119-7311 mon – sat: 09:00 – 18:00 Follow us Facebook X (Twitter) Instagram YouTube LinkedIn Customer service Reach out to us via email or whatsapp for quick resolution. Fast Free Shipping Get free shipping on orders of ₹500 or more Free Returns Return or exchange your product for free within 7 days Secure payment Your payment information is processed securely 🇮🇳\n Homegrown Indian Brand Walkaroo Footwear About About us Careers Walkaroo Foundation Blogs Sitemap FAQ's Useful Links Track your order Return Return and Refund Policy Privacy Policy Terms and Conditions Contact Us Stay in the loop with our weekly newsletter Enter your email Facebook X (Twitter) Instagram YouTube LinkedIn Shop by Category Shoes | Sneaker | Slippers | Men's Footwear | Women's Footwear | Kid's Footwear Shop by Season Summer Footwear | Monsoon Footwear | Winter Footwear | Spring Footwear Shop by Style Sports shoes | Formal shoes | Walking shoes | Best running shoes | Flats for women | Trending shoes | Fancy sandals | Leather shoes Flip Flops collection Flip Flops | Flip flops for women | Flip flops for men Slippers collection Slippers | Chappal | Mens slippers | Women slippers | Black slippers | White slippers Sandals collection Sandals | Sandals for men | Sandals for women | Dailywear sandals for men Slip Ons collection Slip Ons | Formal slip ons for men | Slip ons for men | Casual slip ons for women | Walking slip ons for men Popular Searches Women's Shoes | Walking Shoes for Women | Walking Shoes for Men | Men's Shoes | Running Shoes for Women | Running Shoes for Men | Women's Slippers | Men's Slippers | Kids Shoes | Running Shoes | Walking Shoes | Trail-Hiking | Black Shoes | White Shoes | Blue Shoes © 2025 Walkaroo Footwear. Powered by Shopify Refund policy Privacy policy Terms of service Contact information Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://concertgolfpartners.com/locations/indian-spring-country-club/",
      "text": "Indian Spring Country Club | Concert Golf Partners Skip to main content Concert Golf Partners (Go to home) Toggle Menu What We Do Toggle sub menu Back Why Concert Golf Leadership Concert Cares Testimonials FAQs Vendors Careers Club Success Toggle sub menu Back Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Our Clubs Solutions Toggle sub menu Back Golf Management Financing Capital Improvements Club Consulting News & Education Contact Back Let’s Talk \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. Close Let's Talk Leadership Careers Concert Cares Privacy Policy Boynton Beach, FL Indian Spring Country Club Indian Spring Country Club is a leading 36-hole formerly member-owned private club in the relaxed seaside town of Boynton Beach, Florida. The club features two championship golf courses, 26 Har-Tru™ tennis courts, a modern 52,000-square-foot Clubhouse with a 450-person dining room, a state-of-the-art spa and a fitness center. Contact 11501 El Clair Ranch Road Boynton Beach, FL 33437 (561) 737-5544 membership@indianspringcc.com Links View Website Download Press Release Indian Spring Country Club’s Partnership with Concert Golf Indian Spring Country Club in Boynton Beach faced a common problem for club housing communities: residents were aging, club membership was dwindling, but maintenance costs and debt payments remained ongoing. Some communities, such as the Fountains Country Club near Lake Worth, the President Country Club in West Palm Beach, and Polo Trace near Delray Beach, recently have courted real estate developers willing to buy some or all of their golf courses, as a solution to their club money problems. But sometimes clubs make deals at the 11th hour with little leverage. In other cases, members spend years fighting among themselves over whether to sell their club or its golf course — or hold out for a miracle that can preserve the status quo. At Indian Spring, the club’s leaders and its members did something different. They decided to be proactive. In 2017, club members voted 221-2 to sell the country club for an undisclosed price to Concert Golf Partners. It’s a satisfying end to a long-troubling problem, and Indian Spring resident and former club president Bill Aronson, who for years has wanted a long-term club plan, is proud of the result. Explore Case Studies Elevate Your Club’s Future with Concert Golf Partners Raise your club’s overall experience by injecting capital into new amenities and restoring existing facilities. To start your recapitalization journey, contact us today. GET IN TOUCH Get in Touch \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. 300 International Parkway Suite 150 Lake Mary, FL 32746 What We Do Why Concert Golf Testimonials FAQs Vendors Club Success Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Solutions Golf Management Financing Capital Improvements Club Consulting Our Clubs News Contact Leadership Careers Concert Cares Privacy Policy © 2025 Concert Golf Partners. All Rights Reserved. Web Design & Development by"
    },
    {
      "url": "https://www.indianspringcc.com/weddings",
      "text": "Weddings - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility Weddings Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu HTML Generator Weddings at Northgate Country Club Weddings at the Club With eight event spaces on our property and flexible floor plans to suit any event, there is no doubt that Indian Spring Country Club has the venue you have always dreamed of for your big day! Say “I do!” under swaying palm trees in front of the gazebo, enjoy cocktail hour in the indoor-outdoor lounge, and dance the night away at your reception inside of the show-stopping Grand Ballroom. Gorgeous views of the courses and water features are abundant in almost all locations, natural lighting blankets every corner of our property, and hospitable staff await you and your guests around every corner. Whether you are hosting an intimate elopement for 25 guests or an extravagant soirée of 400 guests, our professional event staff will be there to help you plan every detail. The Indian Spring Country Club wedding packages include everything you need for hosting: catering, bar packages, tables, silver Chiavari chairs, linens, dinnerware, utensils, and more! Contact our Catering Director to peruse our wedding packages guide and enjoy a complimentary wedding consultation today! Consider us for your... Bridal Shower Groom's Golf Event Rehearsal Dinner Wedding Ceremony Wedding Reception Send Off Brunch Complete the form or contact us at [email protected] to begin planning! Scroll down to see our wedding gallery! Form Designer DummyValue Inquire Form for ISCC First Name * Last Name * Phone * Email * What is your event type? * --Select-- Baby Shower Birthday Party Bridal Shower Celebration of Life Corporate Meeting/Event Graduation Golf Outing Holiday Party Rehearsal Dinner Wedding Other --Select-- Baby Shower Birthday Party Bridal Shower Celebration of Life Corporate Meeting/Event Graduation Golf Outing Holiday Party Rehearsal Dinner Wedding Other Requested Date Join our mailing list to receive news and promotions. Please check if your date is flexible Guest Count Comments or Additional Information Submit Gallery 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    },
    {
      "url": "https://www.indianspringcc.com/web/pages/contact-us",
      "text": "Contact Us - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility Contact Us Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu HTML Generator Staff Directory Staff Directory Staff Directory Catering Letecia Ryan Catering Sales, Fountains [email protected] (561) 642-2706 Lily Mu Director of Catering, Indian Spring [email protected] 561-737-5544 x106 Membership Lauren Regan Dual Director of Membership [email protected] [email protected] (561) 642-2733 Administration David Jasmin General Manager, Fountains [email protected] (561)642-2700 x2101 Lily Mu Assistant General Manager, Indian Spring [email protected] 561-737-5544 x106 Mark Avery Assistant General Manager, Indian Spring [email protected] 561-642-2700 x2173 Vania Penta Dual Lifestyle Director [email protected] Lilly Rodriguez Concierge, Fountains [email protected] (561) 642-2700 Marisol Rodriguez Concierge, Indian Spring [email protected] 561-737-5544 Celeste Preston Dual Accounting Manager [email protected] 561-737-5544 x143 - Indian Spring 561-642-2700 x2231 - Fountains Golf Sean Sanders Head Golf Professional, Indian Spring [email protected] (561)737-5510 Kyle Krause Golf Course Superintendent, Fountains [email protected] Brooks Chodnicki Golf Course Superintendent, Indian Spring [email protected] Food and Beverage Maureen Vaughan Dual Clubhouse Manager [email protected] CJ Louis Food & Beverage Director, Fountains [email protected] 561-642-2704 Brett Mashore Executive Chef, Indian Spring [email protected] Heather Mashore Executive Chef, Fountains [email protected] Sports & Fitness Bobby Nozzolillo Dual Director of Sports Operations [email protected] Frank Perino Dual Director of Clubhouse Maintenance [email protected] 561-642-2737 Contact Us Map Section Contact Us Map Section Fountain Country Club Indian Springs Country Club 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://concertgolfpartners.com/2024/02/19/concert-golf-partners-has-invested-over-4-million-of-capital-improvements-into-south-floridasindian-spring-c-c-and-fountains-c-c/",
      "text": "Concert Golf Partners Has Invested Over $4 Million of Capital Improvements into South Florida’s Indian Spring C.C. and Fountains C.C. | Concert Golf Partners Skip to main content Concert Golf Partners (Go to home) Toggle Menu What We Do Toggle sub menu Back Why Concert Golf Leadership Concert Cares Testimonials FAQs Vendors Careers Club Success Toggle sub menu Back Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Our Clubs Solutions Toggle sub menu Back Golf Management Financing Capital Improvements Club Consulting News & Education Contact Back Let’s Talk \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. Close Let's Talk Leadership Careers Concert Cares Privacy Policy Concert Golf Partners Has Invested Over $4 Million of Capital Improvements into South Florida’s Indian Spring C.C. and Fountains C.C. < Back Concert Golf Partners Has Invested Over $4 Million of Capital Improvements into South Florida’s Indian Spring C.C. and Fountains C.C. Dual Memberships provide special access into two of the most amenitized private clubs in the area for the next generation of residents and non-residents alike Exciting, fun vibe that features 54 holes of championship golf, the Fountains Sports Complex, Pickleball, Tennis, Fitness and much more available for both families and active resort lifestyles WEST PALM BEACH, Fla. and LAKE MARY, Fla. (Feb. 19, 2024) – Emphasizing a fun, fit and creatively dynamic South Florida vibe, Concert Golf Partners has invested more than a combined $4 million of strategic capital into Indian Spring Country Club in Boynton Beach, Florida, and its sister club, Fountains Country Club, in nearby Lake Worth Beach. Concert Golf Partners, headquartered near Orlando in Lake Mary, is a boutique club hospitality company that invests its own capital to fund projects, build new amenities, pay off all club debt and ensure that member assessments are a thing of the past through a recapitalization program that Concert pioneered. With decades of experience owning and operating private clubs, Concert’s expertise lies in providing exceptional member experiences and building vibrant club communities. Concert offers coordinated expansion efforts with seamless transitions, relieving owners and board members of the stress and financial burden a third-party club management company would impose. The acquisitions by Concert of both Indian Spring in 2017 and Fountains in 2018 have helped spur increases in home values in the surrounding area. Uncertainty about the future of the clubs was alleviated, as Concert paid off all outstanding debt and injected substantial capital improvements. In just the past six months alone, Concert Golf has driven $640,000 of innovative upgrades to these two iconic Palm Beach County facilities to further make them the most amenitized private clubs in the area. A well-maintained, well-funded country club in a neighborhood is better for a community member’s largest financial investment, their home, as opposed to member-owned clubs that might struggle to pass assessments or stick to a business plan for decades with a revolving board of members with differing agendas. The result is a special opportunity for the next generation of members to enjoy the two clubs—located just eight miles apart—which uniquely appeal to both families and retirees alike through a dual membership that provides special access to both clubs and an incredible lifestyle dedicated to recreation, family, fitness, entertainment and more. It’s all part of the Concert personal touch. One of Palm Beach County’s premier private clubs, Indian Spring C.C. is visually stunning but it also offers amenities that every golfer wants, highlighted by a state-of-the-art, short game practice facility with PGA Professional instruction and dual-sided driving range. The club is renowned for its active resort lifestyle, set within a beautiful surrounding residential neighborhood that is meticulously maintained. Nestled in this picturesque South Florida landscape are two championship golf courses designed by Kipp Schulties, along with a modern, 52,000-sq. ft. clubhouse that features a 450-person dining room, entertainment and a newly designed fitness center. Indian Spring is dedicated solely to the preservation of a relaxing and enjoyable lifestyle. Just a few miles to the north along Jog Road, Fountains C.C. is located on 865 beautiful acres that was once a sprawling orange grove, with 36 holes of championship golf designed to test all aspects of your golf game by regarded golf architects Robert Van Hagge and Bruce Devlin. Through the years, Fountains has hosted the Allianz Championship, Honda Classic Pre-Qualifier Tournaments and FAU Golf Championship. The club also features superior recreation facilities, casual and fine dining, a resort-style pool and a social calendar that can cater to the entire family. Led by Director of Sports Operations David Jasmin, the separate 17,000-sq. ft. Fountains Sports Complex offers personal fitness and instruction, a sprawling tennis facility with 12 Har-Tru courts, Pickleball, a Beach Entry Pool, Fitness Center with Physical Therapy, Bocce and the Aqua Bar & Grill. With several USTA teaching pros on staff who have competed in Grand Slam tournaments, the tennis instruction and clinics are truly world-class. The onsite Junior Tennis Academies have produced world-ranked players. The Sports Complex provides fun exercise opportunities for everyone, including classes in Pilates, Yoga, Zumba and more. As part of your Home Club membership, your benefits extend beyond your Club and give you “Home Away From Home” access to 33 Concert Golf owned and operated properties across America, including nine prestigious clubs across Florida. This enables members to explore beyond their Club when you are traveling for business or pleasure. Take in a round of golf, a tennis match, a swim or enjoy dining at private clubs nationwide. In addition, Club members have access to over 600 properties worldwide through Concert’s partnerships with The Executive Golfer and Links2Golf. All memberships to Indian Spring Country Club and Fountains Country Club include primary, spouse, and children under the age of 26. Each membership will have a one-time, non-refundable Initiation Fee and monthly dues according to their category. There are also new Reinstatement Programs designed specifically for prior members interested in rejoining the clubs, as well as entry level social memberships available. Memberships to each individual club are also available. For Membership information and pricing for Indian Spring C.C. and Fountains C.C. contact: Michael Padden at mpadden@concertgolfclubs.com or 561-302-6344. Visit IndianSpringCC.com and Fountainscc.com for details. About Indian Spring Country Club Indian Spring is a gated, meticulously landscaped, private membership country club community, where you can live the life you’ve always dreamed about, surrounded by friends who make you feel right at home. Located in the relaxed seaside town of Boynton Beach, this lush, 800-acre community showcases unrivaled recreational and social venues, as well as two championship golf courses with rolling fairways and brush-cut greens, a state-of-the-art fitness facility, and casual and elegant dining establishments to satisfy every taste. There is also a world-class clubhouse and active social calendar, where every day brings something new. Whether it’s a round of golf, an elegant dinner dance, or an afternoon of cards, Indian Spring Country Club has something for everyone. About Fountains Country Club Fountains Country Club is a private country club established in 1972 in Palm Beach County, Florida. The Club is located on 865 beautifully landscaped acres within a prestigious and superbly maintained gated golf community in Lake Worth, with its championship golf course designed by world renowned Golf Architects Robert Von Hagge and Bruce Devlin. The Fountains Sports Complex offers 12 Har-Tru surfaced courts, pickleball, bocce ball, and more for our Members to stay active. When not busy playing golf or tennis, enjoy the 8,000 square foot state-of-the-art fitness center, complete with the latest in cardio and weight equipment, massage rooms, sauna, steam room, and locker rooms. Aerobics classes, Pilates, and individual training sessions, with a staff of licensed personal trainers, are perfect for our Members looking for an active and healthy lifestyle. Lounge at our resort-style pool and enjoy lunch or happy hour at the Aqua Pool Bar & Grill. About Concert Golf Partners Concert Golf Partners is a boutique owner-operator of top private golf and country clubs. Formed in 2011 by Peter Nanula, Founder and CEO of Arnold Palmer Golf Management in the 1990s, and Co-Founder and COO, Susan Dunnavant, Concert Golf has amassed $250 million of patient, long-term equity capital to invest in private clubs. Concert Golf is unique for its track record of preserving the identity and traditions of historic clubs. Concert Golf’s boutique collection of upscale clubs now numbers 33 nationally, including both formerly developer-owned clubs, such as The Club at Longview in Charlotte, N.C. and The Club at Renaissance in Ft. Myers, Fla., as well as longtime member-owned clubs such as White Manor Country Club in Philadelphia, Pa., The Muttontown Club on Long Island, N.Y., and The Club at Pasadera in Monterey, Calif. GET IN TOUCH Get in Touch \" * \" indicates required fields Send Us A Note About Your Club First Name * Last Name * Email * Phone Reason for Inquiry * Member Relations Careers New Membership Inquiry Strategic Planning & Club Partnerships Vendor Relations Private Events Where would you like to hold your event? What property are you interested in? Questions/Comments Join Newsletter Join our email newsletter to receive the latest news and updates. 300 International Parkway Suite 150 Lake Mary, FL 32746 What We Do Why Concert Golf Testimonials FAQs Vendors Club Success Case Studies Signs Your Club May Want To Recapitalize Maintaining Club Culture Club Members Solutions Golf Management Financing Capital Improvements Club Consulting Our Clubs News Contact Leadership Careers Concert Cares Privacy Policy © 2025 Concert Golf Partners. All Rights Reserved. Web Design & Development by"
    },
    {
      "url": "https://www.indianspringcc.com/contact-us",
      "text": "Contact Us - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility Contact Us Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu HTML Generator Staff Directory Staff Directory Staff Directory Catering Letecia Ryan Catering Sales, Fountains [email protected] (561) 642-2706 Lily Mu Director of Catering, Indian Spring [email protected] 561-737-5544 x106 Membership Lauren Regan Dual Director of Membership [email protected] [email protected] (561) 642-2733 Administration David Jasmin General Manager, Fountains [email protected] (561)642-2700 x2101 Lily Mu Assistant General Manager, Indian Spring [email protected] 561-737-5544 x106 Mark Avery Assistant General Manager, Indian Spring [email protected] 561-642-2700 x2173 Vania Penta Dual Lifestyle Director [email protected] Lilly Rodriguez Concierge, Fountains [email protected] (561) 642-2700 Marisol Rodriguez Concierge, Indian Spring [email protected] 561-737-5544 Celeste Preston Dual Accounting Manager [email protected] 561-737-5544 x143 - Indian Spring 561-642-2700 x2231 - Fountains Golf Sean Sanders Head Golf Professional, Indian Spring [email protected] (561)737-5510 Kyle Krause Golf Course Superintendent, Fountains [email protected] Brooks Chodnicki Golf Course Superintendent, Indian Spring [email protected] Food and Beverage Maureen Vaughan Dual Clubhouse Manager [email protected] CJ Louis Food & Beverage Director, Fountains [email protected] 561-642-2704 Brett Mashore Executive Chef, Indian Spring [email protected] Heather Mashore Executive Chef, Fountains [email protected] Sports & Fitness Bobby Nozzolillo Dual Director of Sports Operations [email protected] Frank Perino Dual Director of Clubhouse Maintenance [email protected] 561-642-2737 Contact Us Map Section Contact Us Map Section Fountain Country Club Indian Springs Country Club 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    },
    {
      "url": "https://www.palmbeachpost.com/story/business/2017/07/10/just-in-how-boynton-beach/7004087007/",
      "text": "JUST IN: How Boynton Beach’s Indian Spring safeguarded its country club News Sports Restaurants Real Estate Opinion Advertise Obituaries eNewspaper Legals BUSINESS JUST IN: How Boynton Beach’s Indian Spring safeguarded its country club Alexandra Clough aclough@pbpost.com Indian Spring Country Club in Boynton Beach faced a common problem for club housing communities: Residents were aging, club membership was dwindling but maintenance costs and debt payments remained ongoing. Some communities, such as the Fountains Country Club near Lake Worth, the President Country Club in West Palm Beach and Polo Trace near Delray Beach, recently have courted real estate developers willing to buy some or all of their golf courses, as a solution to their club money problems. But sometimes clubs make deals at the 11th hour with little leverage. In other cases, members spend years fighting among themselves over whether to sell their club or its golf course — or hold out for a miracle that can preserve the status quo. At Indian Spring, the club’s leaders and its members did something different. They decided to be proactive. This year, club members voted 221-2 to sell the country club for an undisclosed price to Concert Golf Partners, a Newport Beach, Calif.-based owner of boutique, private golf clubs. Concert Golf took over club operation last month. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. It’s a satisfying end to a long-troubling problem, and Indian Spring resident and former club president Bill Aronson, who for years has wanted a long-term club plan, is proud of the result. The alternative, such as selling off pieces of the golf courses like other communities, was a non-starter. “It doesn’t solve all the problems,” Aronson said. “You’re just putting off the inevitable for some cash. In a couple of years, you’ll still have the same issue.” Indian Spring is a 1,900-home community on Woolbright Road at El Clair Ranch Road that features mostly single-family homes. The community, built in 1988, has two 18-hole golf courses, 26 tennis courts and a 52,000-square-foot clubhouse that can accommodate 450 diners. Like clubs scattered throughout the county, Indian Spring once had a booming business in equity club membership, particularly among residents who enjoyed playing golf. Indian Spring is an age 55-and-up community. But retirees who bought homes in the 1980s now are at or over age 90, and some are unable to play golf. Other homeowners who bought decades ago have died and a spouse still may live in the home but not play sports. Indian Spring is a non-mandatory membership, meaning residents who live in the community do not have to “buy in” to the club in order to live there. During the last five years, signs became clear the club’s future was uncertain. The club gained 31 equity members but lost 299 equity members, either from death, health problems or inability to pay dues, said club general manager Dennis Griffin. Equity club membership fell to 300, down from a high of more than 1,000 members. (The club also has non-equity club members, bringing total membership to 749.) Under the direction of club president Ron Schulman , Griffin said the club “decided not to wait until disaster hit. We still had a lot of leverage in negotiation.” Aronson said the club sifted through offers made by real estate developers and golf course operators. Members who scouted Concert Golf’s other clubs liked what they saw. Michael Padden , Concert Golf’s director of member sales, said Concert Golf was impressed with Indian Spring because the facilities are in “fantastic” condition and the membership is down-to-earth. The golf club world “isn’t all doom and gloom,” Padden said. “You can still find the stars out there. Our intention is to run (Indian Spring) as a private club and make money doing it.” There’s still room for improvement, though, and Concert Golf intends to expand and renovate the fitness center, upgrade the reception area and upgrade outdoor dining. About $1 million in improvements are planned. Concert Golf concessions helped close the deal. The company pledged to keep the club private for 12 years, not levy assessments for equity members and drop dues for equity members by 10-15 percent over a two-year period. Concert Golf also agreed not to sell off the golf courses. “They intend to maintain it is a 36-hole course,” Griffin said. Concert Golf has 15 private clubs, including four others in Florida. Concert Golf allows members of one club to play at its other clubs. So these days, Indian Spring homeowner Howard Needleman , who is spending the summer in Boston, is happy playing golf at Concert Golf’s Boston course, he said. Word of Concert Golf’s ownership quietly is spreading to nearby communities. Padden said Indian Spring has sold 40 memberships in the past 30 days alone. Golf memberships sell for about $10,000 a year. Meanwhile, other clubs in Palm Beach County struggle for a resolution. The Fountains Country Club last year struck a deal to sell parts of one of three golf courses to GL Homes for new homes, but the deal has been delayed by technical issues. In the interim, the sprawling community between Lake Worth Road to the north and Lantana Road to the south remains divided . Only residents living in The Fountain’s southern communities are required to have mandatory club membership. (Residents in northern subdivisions won a legal battle to undo mandatory membership.) In recent years, some Fountains residents have quit the club because they can’t pay the dues or are too old to play golf. But the Fountains Country Club isn’t letting them off the hook. In fact, the country club has sued numerous Fountains residents for failing to pay club dues. As a result, instead of spending money tending to the greens, the club spends money on lawyers. With membership dwindling and bad blood growing, not enough money is rolling in to maintain the club. On June 22, equity club members were notified that monthly assessments for the next seven months will jump from $120 a month to $320 a month. Also, the north golf course, one of three Fountains courses, was closed. Club President Jeff Hamburger blamed lower membership, reserve requirements by the club’s lender, Wells Fargo , and the club’s failure to reverse court decisions that allowed the northern portion of the community to opt-out of mandatory membership. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Palm Beach Post Store Subscriber Guide Manage Account Give Feedback Newspapers In Education Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.palmbeachpost.com. All rights reserved."
    },
    {
      "url": "https://www.indianspringcc.com/about",
      "text": "About - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility About Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu HTML Generator Discover a Resort Lifestyle Second to None at Two Premier Clubs Discover a Resort Lifestyle Second to None at Two Premier Clubs Indian Spring Country Club and Fountains Country Club offer something for everyone — from 18-hole golf courses designed to thrill avid golfers to year-round social events perfect for families with busy schedules, and even mouth-watering cuisine that will satisfy any foodie! Indian Spring is a gated, meticulously landscaped, private membership country club community, where you can live the life you’ve always dreamed about, surrounded by friends who make you feel right at home. Located in the relaxed seaside town of Boynton Beach, this lush, 800-acre community showcases unrivaled recreational and social venues. With two championship golf courses with rolling fairways and brush-cut greens, a state-of-the-art fitness facility, and casual and elegant dining establishments to satisfy every taste. Fountains Country Club is a private country club established in 1972 in Palm Beach County, Florida. The Club is located on 865 beautifully landscaped acres within a prestigious and superbly maintained gated golf community in Lake Worth. The Sports Complex offers 12 Har-Tru surfaced courts, pickleball, bocce ball, 8,000 square foot state-of-the-art fitness center, and more for our Members to stay active. Lounge at our resort-style pool and enjoy lunch or happy hour at the Aqua Pool Bar & Grill. Click here to inquire about membership today. 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    },
    {
      "url": "https://www.indianspringcc.com/meetings-and-special-events",
      "text": "Meetings and Special Events - Indian Springs CC & Fountains CC Please ensure Javascript is enabled for purposes of website accessibility Meetings and Special Events Navigation Skip to Content Loading Member Login Drop Down Navigation Close Home About Contact Us Real Estate Affiliated Clubs Charity of Choice Careers Membership Plan an Event at ISCC Weddings Meetings and Special Events Golf Outings Blog Plan an Event at FCC Weddings Meetings and Special Events Golf Outings Blogs Golf Golf Experience Indian Spring Course Tour Fountains Course Tour Dining and Social Events Tennis and Pickleball Pool Menu HTML Generator Meetings and Special Events in the Houston Area Meetings and Special Events From meetings to mitzvahs, Indian Spring Country Club has spaces both intimate and extravagant to fit your vision. With private boardrooms and several semi-private spaces available, Indian Spring Country Club has a space for any type of event. HTML Generator If you are looking for a place where professionalism meet with perfection in everything this is the place. And again the food was so delicious. Thank you to the staff. -Sandra I would highly recommend Indian Springs Country Club for your wedding or any big event as they will execute your vision!! - Jenny Form Designer DummyValue Inquire Form for ISCC First Name * Last Name * Phone * Email * What is your event type? * --Select-- Baby Shower Birthday Party Bridal Shower Celebration of Life Corporate Meeting/Event Graduation Golf Outing Holiday Party Rehearsal Dinner Wedding Other --Select-- Baby Shower Birthday Party Bridal Shower Celebration of Life Corporate Meeting/Event Graduation Golf Outing Holiday Party Rehearsal Dinner Wedding Other Requested Date Join our mailing list to receive news and promotions. Please check if your date is flexible Guest Count Comments or Additional Information Submit 11501 El Clair Ranch Rd. Boynton Beach, FL 33437 561.737.5544 [email protected] 4476 Fountains Drive Lake Worth, Florida 33467 561.642.2700 [email protected] Privacy Policy Copyright © Indian Springs CC & Fountains CC. All Rights Reserved. Powered by Northstar Technologies . Affiliate of Concert Golf Partners Member Login"
    }
  ]
}