{
  "fuentes": [
    {
      "url": "https://www.innisbrookgolfresort.com/gatherings/meetings/meet-the-team",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://golfinnisbrook.com/contact/",
      "email": "cmembery@golfinnisbrook.com"
    },
    {
      "url": "https://golfinnisbrook.com/contact/",
      "email": "info@golfinnisbrook.com"
    },
    {
      "url": "https://golfinnisbrook.com/contact/",
      "email": "jmorris@golfinnisbrook.com"
    },
    {
      "url": "https://golfinnisbrook.com/contact/",
      "email": "rpaddison@golfinnisbrook.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/welcome/arrival",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/code-of-regulations",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/covid-safety",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/activities/activities/",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/contact-us",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://innsbrook-resort.com/property-owners/contact-and-hours",
      "email": "information@innsbrook-resort.com"
    },
    {
      "url": "https://innsbrook-resort.com/property-owners/contact-and-hours",
      "email": "utilities@innsbrook-resort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/real-estate/",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/careers",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://alamkulkul.com/contact-us/",
      "email": "info@alamkulkul.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/golf/overview?NCK=inn_nonbrnd",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/about-us",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://innsbrook-resort.com/contact/",
      "email": "information@innsbrook-resort.com"
    },
    {
      "url": "https://innsbrook-resort.com/contact/",
      "email": "property@innsbrook-resort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/resort-map",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.salamanderhotels.com/contact-us",
      "email": "development@salamanderhotels.com"
    },
    {
      "url": "https://www.salamanderhotels.com/contact-us",
      "email": "reservation@salamanderhotels.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/meet/meeting-package",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/stay/overview",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/gatherings/meetings/overview",
      "email": "reservations@innisbrookgolfresort.com"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/spa/appointments",
      "email": "reservations@innisbrookgolfresort.com"
    }
  ],
  "mails": [
    "cmembery@golfinnisbrook.com",
    "development@salamanderhotels.com",
    "info@alamkulkul.com",
    "info@golfinnisbrook.com",
    "information@innsbrook-resort.com",
    "jmorris@golfinnisbrook.com",
    "property@innsbrook-resort.com",
    "reservation@salamanderhotels.com",
    "reservations@innisbrookgolfresort.com",
    "rpaddison@golfinnisbrook.com",
    "utilities@innsbrook-resort.com"
  ],
  "nombre_sitio": "innisbrookgolfresort.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.innisbrookgolfresort.com/gatherings/meetings/meet-the-team",
      "text": "Meet the Meeting Planning Team - Your Event Experts Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Meet the Team Patrick House DIRECTOR OF SALES & MARKETING Patrick brings more than two decades of hospitality experience to Innisbrook with a proven track record in driving revenues, elevating brand presence, and delivering exceptional guest experiences. His career includes key leadership roles with the Westin brand under Marriott and nearly eight years with Pearl River Resort, home to the nationally ranked Dancing Rabbit Golf Club, where he led successful sales and marketing initiatives that contributed to the property's national acclaim. Now a proud resident of Florida, Patrick is excited to join the Innisbrook team and help shape the future of this iconic Florida golf resort through innovative strategy and strong industry partnerships. Outside of work, Patrick enjoys attending sporting events, golfing, family trips to Disney World, exploring his new home state and spending quality time with his wife, Katie, and their three children. view profile + Rachel Bridger-Tomlinson Assistant Director of Sales Rachel Bridger-Tomlinson brings nearly two decades of global hospitality experience to her role as Assistant Director of Sales at Innisbrook Resort. With a strong background spanning luxury city properties, resorts, and destination hotels, Rachel has built a proven track record of driving revenue growth, building lasting client partnerships, and creating exceptional guest experiences. Her career includes leadership positions with some of the world’s most recognized hotel brands, where she specialized in group sales, leisure, and international markets. At Innisbrook, Rachel is passionate about showcasing the resort’s unique offerings, from championship golf and meeting venues to its renowned guest hospitality, while fostering meaningful relationships with clients and partners to position Innisbrook as a premier destination for meetings and events. When she’s not working, Rachel embraces Florida’s coastal lifestyle, enjoying time on the water, boating with her family, and exploring the region’s beautiful barrier islands. view profile + Craig Cochran REGIONAL SALES DIRECTOR Craig joined the Innisbrook team in September of 2021. With over 20 years of experience in the hospitality industry, Craig brings a wealth of knowledge to the resort. He graduated from James Madison University in 1999 with a BS in Recreation & Leisure Studies. After graduating, he worked for 2 internationally renowned tradeshow production companies, Discover the Palm Beaches, the Boca Raton Resort & Club, and most recently, PGA National Resort & Spa. Craig’s attributes his success to anticipating his client’s needs and providing a seamless experience for his clients. Craig enjoys spending time with his 4 children and discovering Florida’s hidden gems. view profile + Brigid Acrey National Sales Manager With over 14 years of multi-brand experience in the hospitality industry, Brigid has a proven track record in developing and executing successful sales and marketing plans, increasing market share, and driving revenue growth. Her portfolio experience includes Hilton, Marriott, and Boutique Hotels. Brigid enjoys spending time with her family, trying new restaurants in the area and working on projects around the house. view profile + Billy Oosting DIRECTOR, SALAMANDER COLLECTION GOLF SALES Billy serves as a Senior Golf Sales Manager at Innisbrook Resort specializing in Golf Tournaments and Day Golf Groups. With 10 years of experience in the golf industry, Billy brings plenty of knowledge and passion to the Innisbrook team. Before joining Innisbrook, he spent time working at some notable facilities including Medinah Country Club in IL. Most recently, Billy served as the assistant golf professional of Innisbrook’s Copperhead Course; He took on his new role in 2017. Billy enjoys playing golf with friends and clients, kayaking, and rooting for his Detroit sports teams. view profile + Tim Thompson SENIOR GOLF SALES MANAGER With a focus on customer service, Mr. Thompson joined the Salamander family in February 2007. Tim has been in the golf industry for over 30 years and in Hospitality for nearly 17 years. Tim's focus is on ensuring the success of each and every group's program. Tim has the proven ability to create unique member, junior and guest experiences using innovative and dynamic programs. Tim enjoys spending time with his kids swimming, traveling, and attending local sporting events. view profile + Eric Carlson SENIOR GOLF SALES MANAGER As an experienced National Sales Manager with a demonstrated history of working in the hospitality industry, Eric is here to handle the Midwest, Southeast, and European markets. With over 20 years of experience in the hospitality industry, this native of Rockport, MA is ready to create a memorable experience for your group golf outing, charity/celebrity tournament, or incentive trip. Prior to joining the Innisbrook team, Eric was a National Golf Sales Manager for Reunion Resort and Hammock Beach Golf Resort. He was also part of the opening team for the Omni Orlando Resort at ChampionsGate, serving as their Golf and Corporate Sales Manager. view profile + Trevor Pedersen Golf Sales Manager Trevor joined the Innisbrook team in July of 2025.  With over 10 years of experience in the hospitality and golf industries, Trevor's focus on client relations helps to ensure a memorable and seamless experience for every group's program. A native of Charleston, SC, he joins us from Hotel Bennett within the Salamander Collection. He also brings experience from Wild Dunes Resort and Golfbreaks, an international golf wholesaler. Outside of work he enjoys outdoor activities, hanging out with his dog & family/friends, and watching sports. view profile + Alana Owens DIRECTOR OF CATERING & CONFERENCE SERVICES A born-and-raised Floridian, Alana brings 20 years of resort hospitality experience to the team. After spending time living in Seattle and traveling the world, she’s developed a deep appreciation for different cultures, great service, and creating memorable experiences. When she’s not enjoying the beauty of Innisbrook Resort, Alana is off on an outdoor adventure or planning her next travel destination. view profile + Annie Waltz Catering Sales Manager With over 8 years of experience in the Hospitality Industry from Restaurant Management to Conference Services, Annie joined us as our Catering and Conference Services Coordinator in March of 2022, moving her way up to Catering Sales Manager. Annie received her Bachelor’s Degree in Hospitality Management from The University of South Florida and her Certification in Wedding and Event Planning through Pasco/Hernando State College. Annie expresses great joy in planning special events, taking someone’s vision, and bringing it to life. In addition to planning events, Annie enjoys spending quality time with her three children, hiking, and going to Zumba. view profile + Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://golfinnisbrook.com/contact/",
      "text": "Contact - Innisbrook Golf Course Skip to content Shop Now Search booking policies / help Book Your Tee Time Home Golf The Course Golf Tournaments Rates Public Rates Membership Options Leagues Upcoming Events Contact Home Golf The Course Golf Tournaments Rates Public Rates Membership Options Leagues Upcoming Events Contact Directions To Innisbrook Golf Course FROM BARRIE Highway 400 South to Mapleview Dr., East 2 km. to Huronia Rd, South 2 km. to Lockhart Rd, Turn West (right), Entrance is on left. FROM TORONTO Highway 400 North to Innisfil Beach Rd, East 2 km. to #10 Side Road (Huronia Rd), North 3 km. to Lockhart Rd, Turn West (left), Entrance is on left. For more information you can reach us at: 705.721.9210. Accessible Feedback and alternate formats are available upon request. Innisbrook Golf Course 211 Lockhart Road, Barrie, Ontario, L9J 0B4 Phone: 705.721.9210 Email: info@golfinnisbrook.com Contact us Craig Membery General Manager 705.721.9210 Contact Craig Jessica Morris Event Coordinator 705.721.9210 Contact Jessica Rod Paddison Food and Beverage Manager 705.721.9210 Contact Rod Golf Leagues We have a Golf League for Everyone! Learn More and Register Now Instagram Golf Fall Colours in Effect!\n.\n.\n.\n.\n#golfinnisbrook #f Superhero’s and Villains ⛳️ \n.\n.\n.\n#golfinni Beautiful Day For Our Spring Scramble! ☀️\n.\n. What A Great Day!\n.\n.\n.\n.\n#golfinnisbrook #innisbr We’re OPEN for the 2023 Season ⛳️ \n.\n.\n.\n.\n# It’s a Beautiful Weekend at Innisbrook!\n.\n.\n.\n. Load More Follow on Instagram What's New? Golf Packages – Summer Sale May 25, 2025 SUMMER SALE – Limited Quantities Available Our Golf Packages are fully transferable and are valid for 1 year from the date of purchase. A maximum Read More » Our Spring Tournaments are Back! March 14, 2025 We are now accepting ONLINE registrations for our Spring Kick-Off and our Spring Scramble. Tournament #1Sunday April 27th 2025ANNUAL SPRING KICK-OFF 2 Person Ryder Cup Read More » Download Our App 705.721.9210 211 Lockhart Road, Barrie, Ontario L9J 0B4 Facebook-f Instagram Innisbrook Golf Course © Copyright, 2020. All Rights Reserved. Designed by Enticity"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/welcome/arrival",
      "text": "Arrival - Enjoy Luxurious Offerings Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Arrival Questions Reservations 800.492.6899 Guest Services 888.794.8627 Email [email protected] Address 36750 U.S. Highway 19 North, Palm Harbor, FL 34683 Check-In Begins at 4 PM | Check-Out Prior to 11 AM Is there an age requirement to reserve an overnight stay at Innisbrook Resort? We welcome guests with a legally verified age of at least 21 years old. Guests under the age of 21 must be accompanied by an adult. Where can I park my oversized vehicle? All oversized vehicles will need to park near the main entrance at the Belcher Gate. Can I charge my electric vehicle? Yes, we have EV charging stations available in the Edinburgh parking lot. Please visit the Front Desk for more information. Do you have to be staying at the hotel to use the pool? Yes, you must be an overnight guest of Innisbrook Resort to access the pools and other amenities. Is the pool open year-round? Yes, all six heated pools, including the Loch Ness Pool, are open year-round for our overnight guests. Is Innisbrook Resort dog-friendly? We’re thrilled to welcome one dog or cat (35lb or less) to stay at a pet-friendly accommodation for a non-refundable fee of $150. For not all units allow pets, please call to inquire about pet-friendly accommodations to ensure everyone has a comfortable and delightful stay. Remember that dogs must be leashed at all times and aren’t allowed in public areas. Please view our pet policy and pet agreement . How may I purchase a gift card? You may purchase a gift card of any value online at innisbrookgolfresort.com/gift-cards or in person at the Salamander Spa, Front Desk or one of our three Pro Shops. May children dine at your restaurants? Yes, children are welcome to dine at all outlets. Are reservations required at your restaurants? While our restaurants are open to the public, we recommend dinner reservations at Market Salamander Grille and Packard's Steakhouse. For reservations, please call 727.942.5222 . Do you have a fitness center? Innisbrook Resort features an on-site Fitness Center for guests located next to the Salamander Spa. The Fitness Center is accessible daily from 5:00 am to 10:00 pm with exercise machines (ellipticals, bikes, treadmills), free weights, and personal training and now features some newly arrived Life Fitness equipment, including state-of-the-art treadmills, ellipticals, recumbent bikes, an ARC Trainer, Powermill Stair Stepper, and an Indoor Cycle. Group Fitness classes are also available. Please view our Group Fitness schedule . What is Innisbrook Resort’s cancellation policy? Our cancellation policy varies depending on the package booked and will be outlined both within the booking engine and your confirmation email. Please call 888.794.8627 to cancel or modify a reservation. Do you offer rollaway beds? No, we do not have rollaway beds available. All Suites have a pullout sofa bed. The only room accommodations without a pullout sofa bed are our Deluxe Guestrooms. How long is the drive from the airport? Tampa International Airport (TPA) is located just 25 miles from Innisbrook Resort, approximately a 35–45-minute drive. St. Pete-Clearwater International Airport (PIE) is 17 miles and approximately a 30–40-minute drive. Do you have a business center? Guests have 24-7 access to our guest computer and printer located in the Osprey Clubhouse. Do you offer transportation services? We offer complimentary on-site transportation for our overnight guests.  The Front Desk is available to assist with any off-site transportation needs. Can I take Uber or Lyft to/from the resort? Uber and Lyft are allowed to enter our property; however, they are not readily available in the area, and we do not recommend relying on them for transportation. If you would like to arrange transportation, our Front Desk is happy to assist. What suite categories have connecting options? We do not guarantee a connection of two guest suites. Only some of our One Bedroom Suites and Deluxe Guestrooms have connecting doors. We try our best to accommodate requests but are unable to guarantee. Please call 888.794.8627 to inquire about connecting rooms. How many floors does your hotel have? Each of our buildings with guest accommodations have two, three, or four floors. Please note that we do not have elevators, but some buildings are wheelchair accessible. Do you allow smoking? All accommodations are non-smoking. A cleaning fee (minimum of $250, based on accommodation size) will be assessed in the event of a violation. Do you have a resort fee? Yes, our $40/night Resort Fee covers essential amenities to elevate your stay and includes unlimited in-room wireless internet access and local and toll-free calls. Benefit from self-parking, on-property transportation, 24-hour gated security, and access to amenities such as non-motorized bicycles, swimming pools, fitness center, miniature golf, the Osprey Driving Range with complimentary bucket of golf balls per person, per day, and tennis court access for one hour per stay, per room. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/code-of-regulations",
      "text": "Code of Regulations - Resort Guidelines Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Innisbrook Resort and Golf Club Code of Regulations Effective: July 24, 2023 ARTICLE I:  ORGANIZATION Salamander Innisbrook, LLC, d/b/a Innisbrook Resort and Golf Club (the Club) agrees to operate its clubhouses, golf courses, tennis courts, swimming pools and related existing recreational facilities (the Club facilities) to the best of its ability for the use and pleasure of the members and guests of the Club. The governing body of the Innisbrook Resort and Golf Club will be known as the Board of Governors, which will consist of seven persons. Such Board will define membership classifications, establish initiation fees and dues and promulgate rules and regulations for the conduct of members and guests relative to the use of the facilities and other related matters of the Innisbrook Resort and Golf Club. The Board of Governors will be comprised of four individuals designated by Salamander Innisbrook, LLC, d/b/a Innisbrook Resort and Golf Club plus one designated by the Innisbrook Condominium Association Board of Directors, who shall be either the President, member or past member of said Board, plus one designated by the Innisbrook Lessors’ Advisory Committee, who shall be either the Chairperson, member or past member of said Committee, and one member-at-large. The member-at-large must be the President of, or his/her designated representative, from either the Innisbrook Women’s Golf Association or the Innisbrook Men’s Golf Association, on an alternating year basis.  The members designated by the Condominium Association and the Lessors’ Advisory Committee must be a condominium owner and be a member of the Club.  The terms of the members not designated by Salamander Innisbrook, LLC, d/b/a Innisbrook Resort and Golf Club will begin at the start of that organization’s new year and continue until such time as their successors are named by their respective organizations. The Chairman and Vice Chairman are elected by the members of the Board. Once selected, these officers will serve until successors are named. The Vice-Chairman will act in the absence of the Chairman. The Chairman or Vice Chairman may be removed without cause by a majority vote of the Board of Governors at any regular or special meeting at which a quorum is present. Any Board member not designated by Salamander Innisbrook, LLC, d/b/a Innisbrook Resort and Golf Club who does not or is unable to attend three consecutive meetings, or four meetings in a six-month period, may be removed at the discretion of the Board.  The Chairman will select a committee to nominate a replacement to fill the remaining term of the displaced member.  If the committee is able to, the replacement should come from the same organization as the removed person. ARTICLE II: MEMBERSHIP Membership in the Club entitles the member to such use of the Club facilities as may be set forth in this Code of Regulations, as the same may be amended from time to time, for the particular class of membership.  Such membership does not give the member any rights of ownership in any of the real or personal property of the Club or any equity interest in the Club or the entity or entities that own the assets comprising portions of the Club and does not entitle the member to participate in the governance of or vote in connection with the operation of the Club. A. The membership of this Club consists of the following classes: Full Golf Memberships a. Golf Member (Innisbrook condominium owner) (1) Except as provided herein, there will be only one Golf Member for each condominium and the number will be limited to 938 condominium owners, each of whom will be at least 21 years of age, subject to the initiation fees, dues and discounts set forth in Article II, Section B, and will have use of the golf courses (subject to the restrictions set forth herein and payment of a golf cart rental fee) and the tennis courts without the payment of court fees.  In addition, the Golf Member will have the use of the other Club facilities including Loch Ness pool on an unlimited basis and those privileges set forth in Article II, Section C. (2) During the Resort’s “in-season”, the Club may impose supplemental dues for golf course access.  Participants in the Rental Pool Operation, governed by the Master Lease Agreement, as amended, will not be charged Supplemental dues unless authorized by the ALA/MLA. (3) Proof of ownership by recorded deed shall be required for Innisbrook, Highlands and Promontory. (4) Guests of Innisbrook Rental Pool Owners - A Guest of an Owner staying in an Owner’s in pool unit reserved for Owner Occupancy is entitled to play golf at the applicable guest of member rates, plus enjoy all other owner privileges and discounts, even if the owner is not present. b. Golf Member (non-Innisbrook condominium owner) - Limited to 50 members composed of persons at least 21 years of age, whose rights, privileges, and restrictions are the same as in Section A.1.a. (1) above. c. Golf Member - Highlands Golf Member - Limited to 54 property owners designated by the Wall Springs Conservatory, Inc. composed of persons at least 21 years of age, whose rights, privileges, and restrictions are the same as in Section A .1. a. (1) above. Notwithstanding the above, at the discretion of the Board of Governors, 20 of the 54 can be restricted from access to the Golf Member specified tee times as defined in Article IV, Section G 1. d. Golf Member Honorary – Limited to 30 members approved, reviewed and renewed by both the Board of   Governors and Salamander Innisbrook, LLC, d/b/a Innisbrook Resort and Golf Club on a calendar year basis, for business and promotional purposes composed of persons at least 21 years of age who have achieved celebrity, business or political status, whose rights, privileges and restrictions are the same as Article II, Section A.1.a. (1).  Notwithstanding the above, at the discretion of the Board of Governors, members of this membership category may be restricted from access to the Golf Member specified tee times and may be terminated without cause at any time. e. Golf Member – Promontory – Limited to 110 property owners – composed of persons at least 21 years of age, whose rights, privileges and restrictions are the same as in Section A.1.a. (1) above. An owner of a Promontory residential unit is required to have at least a Social membership from the date of closing.  This required membership is not “tied” to the Promontory units, so any current member can purchase a unit and only be required to maintain their existing membership pursuant to the Code of Regulations. The first retail purchaser of a Promontory residential unit is entitled to receive their initial membership with no initiation fee per the Development Agreement.   In addition, the first retail purchaser of a residential unit may upgrade their membership to another class of membership with greater privileges pursuant to the Code within two years after such retail purchaser’s initial closing date provided that the Golf Course Owner shall receive at the time of such upgrade the difference between the dues that would have been paid for such upgraded membership less the dues actually paid.  Subsequent retail purchasers of a residential unit in Promontory must have a membership in the Club from the date of closing, pursuant to the terms of the Code, and will be subject to the current initiation fees and dues structure in place at the time of such purchase. Owners with memberships tied to the Highlands of Innisbrook development who sell their Highlands property and purchase a residential unit in Promontory are subject to the above requirements. If by September 30, 2018, the lot has not been sold for the first time, all future purchasers as of this date are subject to paying the prevailing Initiation Fee and dues. (5) NIP 20 Year Class Requirements to enter into the NIP 20 Year Class are as follows: Candidate will have maintained a Full Golf Membership for 20 continuous years, and Candidate will have been an Innisbrook Condominium Owner for 20 consecutive years. Candidate will have had a condo that participated in the rental pool for 20 consecutive years to have the benefit of being a 20-year Alumni member. Benefits of NIP 20 Year Class Membership: The Board of Governors agrees that each annual increase in Full Golf Member club dues payable by a NIP 20 Year Class Member shall not exceed the increase in the Consumers Price Index – All Urban Consumers (CPI-U) (1982-1984 = 100) between August 31st of the previous year to the August 31st preceding the following Annual scheduling of the dues to which said increase shall apply, multiplied by 1.5; provided however, that the increase shall not exceed 6.5% annually. Said dues are to be rounded to the nearest one dollar ($1) increments. (6)  Legacy Golf Membership - Legacy Golf Membership will be extended to children of existing Full Golf Members who are at least 25 years old.  The Legacy Golf Membership would allow Members the same privileges as a Full Golf Member.  This Membership will be limited to 100 Memberships. (7)  Young Executive Golf Membership - will be extended to people between the ages of 25 to 39.  The Young Executive Golf Membership would allow Members the same privileges as a Full Golf Member.  This Membership will be limited to 100 Memberships. 2. Resort Golf & Executive Golf Members - Limited to 350 members composed of persons at least 21 years of age, subject to the initiation fees, dues and discounts set forth in Article II, Section B, and granted the following privileges in addition to those set forth in Article II, Section C: a. Upon payment of prevailing golf fees set for Resort Golf Members, use of the golf courses four times each month during November, December, January, February, March and April, subject to tee time availability Thursday through Sunday. Unlimited golf is available Monday through Wednesday at the prevailing accompanied guest of member rate.  During the months of May, June, July, August, September and October may play unlimited golf upon payment of golf cart rental fees, subject to tee time availability.  Practice range and club storage use will be at member rates. b. Unlimited tennis court time in blocks of no more than two hours at no charge. c. Access to Loch Ness pool by Resort Golf members will be announced from time to time by the Club. 2. Executive Golf Member acquired after January 1, 2003 and Corporate Member acquired before January 1, 1998 - Will have the same rights, privileges and restrictions as in Article II, Section A.3. above, except with respect to Transferability of Membership (Article II, Section D.3). With respect to the Executive Golf Member, the following restrictions apply: a. Limited in number to membership availability under Resort Golf Membership category. b. Each membership is limited to four designees who are Board members, Partners, Principals or employees of the Executive membership applicant (the applicant being in active business).  Said membership applicants are subject to verification of the business relationship. c. Each membership is required to name a primary designee and must maintain the dues on that designee continually, regardless of the status of the additional individual designees up to the four-designee maximum. d. Each individual designee must meet all qualifications of membership set forth in Article II, Section A.3.above, including all rights, privileges and restrictions set forth in this Code of Regulations.  Necessary disciplinary action of an individual designee could result in the loss of a designee for said membership applicant. e. Notwithstanding this paragraph 4 regarding the limitation of four designees, said limitation could be increased and such initiation fees will be determined by the Board of Governors from time to time. 4. Resort Member - No longer offered. Memberships as of December 31, 2000 will continue to be honored, subject to the dues and discounts set forth in Article II, Section B, and granted the following privileges in addition to those set forth in Article II, Section C: a. Upon payment of prevailing resort guest golf fees discounted 40%, use of the golf courses during the months of May, June, July, August, September and October, subject to tee time availability. Practice range and club storage use will be at member rates.  Saturday golf clinics are at no charge during the above period. b. Access to Loch Ness Pool Monday through Friday and other designated times, as announced by the Club. 5. Tennis Memberships a. Tennis Member – No longer offered. Memberships as of September 20, 2007 will continue to be honored subject to the dues and discounts set forth in Article II, Section B, and granted the following privileges in addition to those set forth in Article II, Section C: (1) Unlimited tennis court times in blocks of no more than two hours. (2) Use of the golf courses from May 1 through October 31 at a 40% discount on prevailing resort guest golf fees for Members, subject to tee time availability. (3) Practice range at resort rates; no club storage available. (4) Access to Loch Ness pool by Tennis members will be announced from time to time by the Club. b. Tennis Member – An annual membership limited to 150 members (Family or Single) to include memberships defined in Article II, Section A 6 a and b, composed of persons at least 21 years of age, subject to an annual fee, dues and discounts set forth in Article II, Section B, and granted the following privileges in addition to those set forth in Article II, Section C: (1) Unlimited tennis court times in blocks of no more than two hours. (2) Unlimited use of racquetball courts and fitness center located in the Tennis Center. (3) Practice range at resort rates. (4) Access to Loch Ness pool by Tennis members will be announced from time to time by the Club. c. Single Tennis - Single Tennis memberships will be extended to tennis players that do not wish to include family Members. This membership does not include use of any resort amenities other than unlimited use of the tennis courts. d. Single and Family Tennis Memberships have a commitment of 12 full calendar months for the first year and will automatically continue with monthly dues and subsequent annual fees, billed in advance, each year prior to the anniversary date. 6. Clubhouse-Highlands Member - Limited to 156 members, composed of persons at least 21 years of age, subject to the fees, dues and discounts set forth in Article II, Section B and granted the following privileges in addition to those set forth in Article II, Section C: a. Practice range at resort rates; no club storage available. b. Access to Loch Ness pool by Clubhouse members will be announced from time to time by the Club. 7. Social Member – An annual membership limited to 600 members (Family or Single), composed of persons at least 21 years of age, subject to an annual fee, dues and discounts set forth in Article II, Section B and granted the following privileges in addition to those set forth in Article II, Section C: a. Practice range and tennis court rental at resort rates. b. Access to Loch Ness pool by Social members may be restricted / prohibited from time to time by the Club. c. Use of Fitness Center included. d. Social Memberships have a commitment of 12 full calendar months for the first year and will automatically continue with monthly dues and subsequent annual fees, billed in advance, each year prior to the anniversary date. 8. Partners Membership - Limited to 50 memberships available only to a limited liability company with an acceptable operating agreement that purchases through Golf Host Securities, Inc. an Innisbrook condominium that will continuously participate in the MLA. Each membership will be composed of no more than four persons (Program A) or six persons (Program B) at least 21 years of age, owning at least one share of the limited liability company, (proof of ownership required), subject to the initiation fees, dues and discounts set forth in Article II, Section B, and granted the following privileges: a. During periods of owner occupancy, members will have the same rights, privileges and restrictions of a Golf Member as set forth in Section A.1.a. (1) above. Owner occupancy by the individual members will not exceed four weeks in the aggregate during the in-season. For example, should all Program A members occupy the unit during the same week; the four weeks available for owner occupancy during the in-season would be utilized.  For the Program B members, owner occupancy shall not exceed thirty days by each individual member, said thirty days being restricted to the months of May through December. b. During periods of the units’ rental pool availability, the Partners Membership will have the same rights, privileges and restrictions of a Resort Golf Member as set forth in Section A 3 above. c. Partners members will have the use of the Loch Ness pool on an unlimited basis. B. Initiation Fees, Dues and Discounts: There is a schedule of initiation fees, annual fees and dues appended hereto. This schedule is subject to change from time to time by the Board of Governors, without notice.  Initiation fees and annual fees are nonrefundable. Dues for Golf, Resort Golf and Executive Golf, Resort, Tennis with Golf, and Partners memberships are due and payable on the first day of each calendar quarter. The first annual fee for Tennis and Social memberships are payable in full on the date of application and dues are payable on the first day of each calendar month.  The first annual dues for Clubhouse-Highlands memberships are payable in full at time of application and are billed annually as defined by the Walls Springs Conservatory, Inc. agreement. The supplemental dues provided in Section A.1.a. (2) above, are paid in two installments. Seventy-five percent of the amount is due January 1 annually and twenty-five percent is due April 1 annually.  Members not electing to pay the supplemental dues will be excluded from golf course access only during the resort’s “in-season”, as defined in the Annual Lease Agreement. All members and their accompanied guests, totaling no more than a party of twenty-four per member, will receive a 20% discount on food and beverage paid for by the member. These discounts are not applicable to more than a party of twenty-four, for pre-planned functions, conference center events or other retail purchases.  These discounts will be given only upon presentation of the membership card and must be charged to the member account. A 25% discount off the best available rate for room accommodations for all Members and their accompanied guests. This discount applies only when room accommodations are booked and paid for by the member. Golf and tennis instruction, youth programs and fitness center use will be at discounted rates unless otherwise noted in the membership description. C. Rights & Privileges of Immediate Family: The immediate family of a Member (regardless of classification) shall consist of the Member’s spouse or domestic partner (as defined herein), and children supported by the Member under 25 years of age residing in the principal home of the Member (including time in school). The domestic partner of a Member shall be a companion living with the Member on a continuous basis, legally eligible to be married to the Member, and approved by the Board of Governors. The Member and the Domestic Partner will sign an agreement satisfactory to the Board evidencing the relationship and agreeing to the financial obligations incident thereto.  Thereafter, the Member may terminate this membership privilege at any time by giving written notice to the Board.  Also, the Board may terminate this membership privilege at any time by giving written notice to the Member, upon the finding that the relationship does not continue to meet the requirements of this provision.  Said decision is not subject to review by the Member. Each member of the immediate family shall have the same rights and privileges of use of the Club facilities as the Member and each shall be issued a membership card.  The Member shall return all  membership cards to the Club upon the termination of the immediate family status. D. Transferability of Membership, Subject to the Approval of the Board of Governors- Membership may be transferred only as follows: In the event of the death of a Golf Member (or of a shareholder of a limited liability company holding a Partner membership), said member’s surviving spouse or domestic partner shall be entitled to continue the membership of said deceased member without the payment of an additional initiation fee or a transfer fee. The surviving spouse or domestic partner shall then be designated the Golf Member.  Thereafter, said Golf Member shall be entitled to transfer said membership to his or her child or a child of the deceased member without the payment of an additional initiation fee or transfer fee.  If there is no surviving spouse or domestic partner, one surviving child of said deceased member may continue said membership upon the same terms.  In either case, said surviving child may subsequently transfer said membership to his or her child with the payment of a transfer fee, and thereafter all subsequent transfers shall be subject to the transfer fee then in effect. Transfers by a Golf Member to Highlands Golf Member and transfers by a Highlands Golf Member to Golf Member shall not be deemed a transfer as addressed in this paragraph.  Notwithstanding this provision and other provisions of this Code, participants in the Master Lease Agreement then in effect shall be entitled at any time to make a one-time transfer of his or her golf membership to a child who continues said condominium in the lease operation without incurring an additional initiation fee or transfer fee.  In all cases, proof of ownership by recorded deed, held individually or by trust, shall be required. A Resort Golf Membership may be transferred to the surviving spouse or domestic partner one time only without further initiation fee. A Corporate or Executive Golf Membership may change member designees without payment of a transfer fee in cases where such member designee dies, is transferred to a distant locale or leaves the employ of the company, subject to individual designee application and Board of Governors approval. The Golf Membership of a condominium titled in a limited liability company, partnership or corporate name may be transferred to another limited liability company, partnership or corporate designee upon payment of a transfer fee, except no transfer fee will be required where the designated Golf Member either dies or leaves the business entity, so long as the application for transfer occurs within one year of the qualifying event. In any case, no more than one transfer without an initiation fee will be permitted within a five-year period. Transfer of a condominium title from a Golf Member to one of the above referenced business entities involves no transfer fee if the designated Golf Member remains the same.  Also, transfer of a condominium title from one of these entities to the existing corporate designated Golf Member will require no transfer fee. An above referenced business entity may remove its designated Golf Member upon notification to the Board of Governors and surrender of all membership cards.  Should such entity re-designate a Golf Member, a transfer fee will be payable. The Golf Membership associated with a condominium owned by a single individual may be transferred from one condominium to another without penalty, by the original holder of the membership. For those condominium units in which there are two or more owners with one Golf Membership, a transfer to another condominium unit will permit the same ownership to be transferred by the existing Golf Member, provided that the ownership of the new unit is identical to the ownership of the previous unit. Transfer of a condominium title from a Golf Member to a trust, which the Golf Member establishes for their benefit, will not require a transfer fee if the Golf Member remains the same. Also, transfer of a condominium title from a trust established by a Golf Member to said Golf Member will not require a transfer fee so long as the Golf Member remains the same. When condominium ownership is by a trust, the Trustee will designate the original Golf Member and any transfer of membership will require an initiation fee, except as provided below in Article II, Section D 8. A member may give a unit to one of their children who will become the Golf Member upon receipt by the Rental Pool Accounting Department of a recorded deed and upon payment of a transfer fee, except as provided in Article II, Section D.1. The membership of a shareholder participating in a Partners membership may be transferred to a new shareholder replacing the previous shareholder upon the payment of a fee equal to the related pro-rata portion of the Partners membership times the initiation fee currently in effect. If an Executive Golf member transfers the value of his membership to a higher classification, a new Executive Golf member may replace the previous member upon payment of a fee equal to the related pro-rata portion of the Executive membership times the initiation fee currently in effect. E. Reclassification of Membership, Subject to Board of Governors Approval: If a member wishes to change to a lower membership classification, such change may be made without payment of an initiation fee, provided that the currently existing level of such fee for the new classification is less than or equal to the currently existing level of initiation fee for the member’s existing membership and that all other qualifications for membership to which the change is being made are met. Should a member drop down in membership classification and subsequently request to come back up to the previous membership classification, such member will be required to pay the difference between the amount originally paid for the higher classification and the currently existing initiation fee for the higher classification. A payment of an initiation fee to change to a higher classification will be required if the currently existing level of initiation fee for the new classification is greater than the amount actually paid for the initiation fee for the member’s existing membership.  Said payment will be the difference in the initiation fees at the time of the change.    A “Golf Member participating in the rental pool” who had this membership classification prior to January 1, 2000, and is changing membership classification to “Golf Member not participating in the rental pool” will not be bound by this restriction.  Subject to availability under Article II, A.1.b, a change in classification from a “Golf Member-Innisbrook condominium owner” (Article II, A.1.a) or from a “Golf Member-Highlands property owner” (Article II, A.1. c) to a “Golf Member non-Innisbrook condominium owner” (Article II, A.1.b) will require the payment of an initiation fee equal to the lesser of the difference between the currently existing initiation fee for the non-owner classification and the initiation fee originally paid by the owner; or the difference between the currently existing non-owner classification fee and the present rental pool participant fee. F. Termination of Membership: All classifications of membership, and/or individuals that comprise such memberships are subject to disciplinary action by the Board, up to and including membership termination, without refund of initiation fees, if dues or other payments are not paid in accordance with the payment schedules set forth elsewhere herein. Any membership may be terminated voluntarily at any time upon submitting written notice to the Club, with the exception of the annual memberships, which must be held 12 months before an option to cancel. The date of such termination will be the last day of the month such written notice is received by the Club. The Board of Governors may terminate any membership pursuant to Article VII, Section B.  In either case, initiation fees will not be refunded.  Owners of Innisbrook, Highlands of Innisbrook, and Promontory may cancel upon date of closing due to sale of property. A Golf Member owning more than one condominium is not required to maintain more than one Golf Membership, however, a separate Golf Membership is required for each condominium participating in any rental pool lease operation. Once a membership has been terminated, any requests for reinstatement must be accompanied by the then prevailing initiation fee for the particular classification, except that a Golf Member who has continuously maintained another Golf Membership during the entire period of termination may have the terminated membership reinstated upon payment of a transfer fee, provided such member has continually owned the terminated membership condominium. The Partners membership of a shareholder in a limited liability company owning an Innisbrook condominium will terminate upon the sale of the shareholder’s interest in the limited liability company or the sale of that condominium by the limited liability company.  The Partners membership will not be considered as terminated if a shareholder/member sells his/her shares in the limited liability company condominium and, at or prior to the closing of such sale, gives notice to the Club of his/her intention to purchase a new shareholder interest in another limited liability company owning an Innisbrook condominium.  Within 120 days of the closing of such sale, the shareholder/member must complete the purchase of a share in another limited liability company owning a different Innisbrook condominium.  This non-ownership grace period is conditional upon timely payment of full membership dues during the 120-day period and is subject to the provisions concerning transferability set forth in Article II, Section D. Golf Member (condominium owner) and Golf Member (Highlands of Innisbrook residents / Promontory residents / or any future development requiring a resort membership) shall terminate upon the sale of the member’s condominium or property provided, however, that such membership shall not be considered as terminated if a member sells the condominium or property and, at or prior to closing of such sale, gives notice to the Club of member’s intention to purchase a replacement Innisbrook condominium or replacement Highlands, Promontory or future development property and within 120 days of closing of such sale, closes the purchase of the condominium or property. This non-ownership grace period is conditional upon full membership dues being paid timely during said 120-day period, subject to the provisions concerning transferability set forth in Article II, Section D. ARTICLE III: HOUSE RULES A. At no time does a membership allow the member, the member’s family or guests access or entrance to any lodge.Violation of this restriction will be cause for immediate termination of membership. B.Member identification and charge privileges are as follows: The clubhouses and common grounds are intended primarily for the use of the Club members, their guests, and the persons renting condominiums at Innisbrook Resort under Innisbrook’s short-term rental arrangements where Salamander Innisbrook, LLC, d/b/a Innisbrook Resort and Golf Club is the lessee of the condominium. The use of the clubhouses and common grounds will not be extended to others except as authorized by this Code of Regulations.  Persons occupying a condominium at Innisbrook on any other basis may not use the clubhouses, golf courses, tennis and pickleball courts, swimming pools, fitness center, practice facilities, resort shuttles/trams and related recreational facilities. A membership card with account number, membership type, expiration date and photo identification will be issued to every member. Presentation of the membership card is required for use of the Club facilities and charge purposes.  Membership cards are to be used only by the persons to whom they are issued.  A membership card used by someone other than the member will be confiscated and the member will be subject to disciplinary action as set forth in Article VII, Section B. Guests of members cannot be extended the right to use a member’s card under any circumstances. Children of members who meet the requirements of Article II, Section C.1 will be issued cards at the written request of the member, stating the date such child will be 25 years of age. This child’s card will have such date embossed, at which date said card will expire. Members may sign for all purchases using their approved signature and membership card. No charges will be made to the member’s account without presentation of the membership card.  Should the membership card be lost or stolen, the Innisbrook Accounting Department must be notified promptly with subsequent confirmation in writing to prevent unauthorized charges on the member’s account. C. Guest identification, privileges, and restrictions are as follows: A guest of member not occupying a member’s condominium must be accompanied by the member when using the Club facilities. A guest of member occupying a member’s condominium is a person residing in a condominium without remuneration for the use of the condominium being made to the owner of that, or any other, condominium, or the Resort.  Arrangements may be made by the member for the issuance of guest of member cards to guests of members occupying the member’s condominium.  Such guest of member cards will be issued by the Resort only when requested in writing by the member and the member is responsible for the payment of all charges incurred by the guest.  Unless a guest of member card is issued, the member will accompany their residing guests when such guests are using the Club facilities. Guest of member cards will not be issued by the Resort for a period greater than fourteen consecutive days. This does not apply to guests of members staying in units that are in the rental pool. The number of guest of member cards issued for any one time period will not be greater than the normal occupancy of the respective condominium. Guests of members will not be permitted to use the member’s card at any time. Violations thereof will subject the member to the penalties specified under Article VII hereafter. Resort guest cards will be issued to parties renting condominiums under Innisbrook’s MLA rental arrangements for the use of the Club facilities upon payment of all published charges, but the member who owns the condominium will not be responsible for any of said charges by such tenant.  The Declaration of Condominium, the Master Lease Agreement, set forth various prohibitions with respect to individual condominium rental directly by the condominium owner.  Violations of such prohibitions will subject such member to a one-year suspension of membership. Guests of Owner staying in a Rental Pool Unit that has been reserved for Owner Occupancy as provided in the MLA, shall pay Guest of Member rates for golf even if unaccompanied by the Owner or other Member. Guests of Rental Pool Owners shall also receive the Golf Member’s privileges and discounts at all Resort facilities and amenities, even if unaccompanied by Owner or other Member, in accordance with the Code of Regulations. The ability of members to have guests utilize the Club facilities is governed by their membership classification and other restrictions which are set forth elsewhere in the Code of Regulations. Guests of members are permitted to enjoy all of the Club facilities to which the member is entitled so long as they are accompanied by their member host, except as set forth in Article III, Section B.  Use of the facilities by guests will not interfere with member and resort guest usage.  Guests may be subject to charges for the use of, and/or limited access to, certain facilities, which are covered by the members’ privileges.  Members are responsible for the conduct of their guests. No non-member of the Club will play golf at the Club more than eight times or tennis at the Club more than eight times in any calendar year as an accompanied guest of one or more members. For the purpose of this provision, during periods in which the non-member resides in a condominium as a guest of member as set forth in Article III, Section C 1, the non-member will be permitted to play golf and tennis, or both, up to fourteen times per calendar year as an accompanied guest of member. No member may utilize Club facilities or play golf at reduced rates as a guest of another member. The Board of Governors may authorize that the Club facilities be made available for limited use to members or associates of other golf clubs and tennis clubs in good standing, provided, however, that such use will in no way interfere with member and resort guest usage of such Club facilities. These guests will be known as Day Guests. D. 1. Notwithstanding any provisions to the contrary herein, the Chairman of the Board of Governors may from time to time, in his sole discretion, authorize limited non-member use of the Club facilities, so as to more efficiently utilize the Club facilities, provided, however, that such use will not interfere with member and resort guest usage of the Club facilities. 2. Notwithstanding any provisions to the contrary herein, the Club may, in its sole discretion, enter into reciprocal use privilege and access agreements with other clubs managed by Salamander or its affiliates. The Club and owners of the other clubs may determine, in their sole discretion, the privileges and access to be provided to the members of the reciprocating clubs and the fees and charges for such use. E. No club-related notices will be posted unless first approved by the Board of Governors. F. Members and their guests will be liable for misuse and damage to Club premises. Willful or careless damage to property will also subject the member to disciplinary action as set forth in Article VII, Section B. G. Animals are only permitted while on a leash. However, animals are not allowed in the clubhouses, on the golf courses, at the swimming pools or at the tennis facility.  No person at any time shall maintain or keep any animals or pets on the club premises in a manner which shall create an annoyance or nuisance to other owners or other persons.  Any complaints by owners or other people in regards to such annoyance shall be directed, in writing, to the Innisbrook Resort and Golf Club Board of Governors. Service Animals must have official vests and present proper documentation when asked. Paws must be on the ground. H. No games, which may be considered prejudicial to the good order and interest of the Club, will be permitted on any part of the Club premises. I. No reprimand will be given by members to employees of the Club. Complaints will be made in writing to the Board of Governors giving the name of the employee, the date, the subject matter of the complaint and the name of the   complaining member. J. Requests and suggestions should be made in writing and addressed to the Board of Governors. K. The wearing of bathing suits will not be permitted in the interior of the clubhouses, other than the locker rooms. Bathers must wear appropriate coverups when entering the clubhouses. Shoes or sandals also must be worn. L. No members or guests will be permitted to bring food or beverages into the Club facilities or Loch Ness Pool for consumption therein. M. The use or operation of private motorized bicycles, scooters, golf carts, mopeds or motorcycles on the Club premises is prohibited to anyone not possessing a valid driver’s license. However, Club employees using such motorized vehicles for transportation to and from work may come upon the Club property in said vehicles solely for that purpose. Privately owned golf carts must be parked in a designated parking spot at all times. N. Harming, or harassment in any fashion, or feeding of the natural wildlife present on the club premises is strictly prohibited. Any member found responsible for harming or harassing the wildlife, subsequent to a Board of Governors review and if necessary, a formal governmental examination of the alleged event, shall be subject to the full disciplinary authority of the Board up to and including termination of said membership. O. Members are responsible for their own conduct and for the conduct of their family members and guests. Any Member whose conduct or whose family's or guest's conduct shall be deemed by the Board of Governors to be likely to endanger the welfare, safety, harmony or good reputation of the Club or its Members or is otherwise improper, may be reprimanded, suspended or terminated from the Club and have all privileges associated with the Membership suspended or terminated by the Board of Governors. The Board of Governors shall be the sole judge of what constitutes improper conduct, but improper conduct will include, without limitation: (i) submitting false information on the Membership Agreement, (ii) failing to abide by the rules and regulations as set forth herein and as established by the Board of Governors from time to time, (iii) abusing, harassing or intimidating Service Professionals, Resort Guests or Members using physical force, un-sportsmanlike conduct, profanity, unwanted advances, denigration or acting in a manner incompatible with the standard of conduct of the existing Membership or which would likely injure the reputation of the Members, the Club or the Resort. ARTICLE IV: GOLF COURSE GROUND RULES A. The Rules of Golf of the United States Golf Association, together with the Rules of Etiquette of Golf as adopted by the U.S.G.A., will be the rules of the Club for governing play, except when in conflict with local rules or with any of the rules hereinafter stated. B. The Board of Governors recognizes the Men’s and Women’s Golf Associations as the only Board approved golf organizations conducting members’ golf events. C. All members and guests are required to register at the Golf Shop prior to commencement of their play. Starting times are required for all play.  The Director of Golf and the Head Golf Professional are in complete charge of each course and are responsible for enforcing the golf course rules and regulations. Players will start from such tee as directed by the Head Golf Professional or the player assistant and at the assigned starting time. Players in more than a foursome are not permitted on the course unless authorized by the Director of Golf. Members and guests will respect the directions and decision of the Head Golf Professional and the player assistant. All golfers are to maintain a reasonable rate of play (18 holes should be played in 4 ½ hours). When unable to do so for any reason, they must give way to faster players and not resume play until these players are out of reach.  Foursomes always have the right-of-way.  Groups of lesser numbers should not request or expect to be invited to play through. If player, guest or member, is not conforming to the Innisbrook Resort and Golf Club golf course rules, the operational procedure is as follows: a.First Offense – the Golf Professional, Golf Course Player Assistant or Golf Associate is to advise the player of the violation and request that there be no further occurrence of the violation. b. Second Offense of the same violation – the Golf Professional in charge will inform the player that he is again in violation and that a third occurrence will result in that player being escorted from the course and his/her golf privileges will be suspended for the balance of the day. c. Third Offense of the same violation – the Golf Professional in charge will notify the Director of Golf and the player will be escorted from the golf course by resort security.  Said players’ golf privileges will be suspended for the balance of the day. d. Habitual/repeat offenders, who are found in violation of the golf course rules and have received the first and second warnings on differing days, shall be handled in the same fashion as above in paragraph 5 c for the third offense, irrespective of the number of days elapsing between offenses. For all members, a second suspension will result in the member being immediately notified by the Director of Golf of a two-week suspension of all golf privileges and a written report will be submitted to the Board of Governors for further disciplinary action. D. Usage of golf carts is mandatory and they will be operated only according to the following procedures: Anyone operating a golf cart must have either a valid restricted or unrestricted operator’s license. No more than two persons and two golf bags will be allowed in a golf cart. Cart lessees must abide by the directions of the Head Golf Professional and player assistant. Carts will follow established paths or marked routes around the course. Carts should never be driven on tees or slopes of greens or closer than ten yards from the tees and greens.  The club encourages the use of the ninety-degree cart rule.  Any exception to this Section D 4 (e.g., physical impairment) must be submitted in writing to the Board of Governors. No private golf carts may be operated at the club. The Director of Golf will determine when the course is unfit for golf carts and play. E. On the practice putting greens at the clubhouses, chipping is permitted but pitching is not allowed. The Island Practice Facility should be used for all pitching.  Hitting of golf balls for practice is prohibited on all courses and is restricted to the Practice Facilities. The Copperhead Practice Facility is a designated warm-up facility. Practice Facility golf balls are prohibited on the golf courses. F. “Ball-hawking” is not permitted during normal playing hours as determined by the Director of Golf. The use of any and all types of raking devices is prohibited. G. Tee time procedures and restrictions are as follows: Golf Members will have specified tee times subject to the Resort’s reasonable right to re-schedule those times based on past practices and current Resort tee time inventory needs.  The Golf Member specified tee times will total 52 tee times daily, based on the availability of four courses and allocated over the open courses on each day of the week.  Golf Members will have access to all available tee times on an as available basis with tee times secured as defined in Section G 3 below. A Golf Member must play in any foursome, within the Golf Member specified tee times, that includes the member’s accompanied guests.  No member may have more than seven accompanied guests on any given day unless the Director of Golf has approved such guest play and such play occurs outside the members specified tee times. Full Golf Members may make two tee times in or out of Golf Member specified tee times up to 14 days in advance. Full Golf Members that have a condo in the rental pool may make specified tee times up to 365 days in advance. Golf Members may make multiple tee times for greater than two foursomes, in or out of the Golf Member specified tee times up to six days in advance, provided all of the appropriate fees are guaranteed by the Golf Member requesting the multiple tee times (see Article IV, Section G.8 below). Subject to Article II, Resort Golf, Executive Golf and Corporate members may make tee times outside of the Golf Member specified tee times up to 7 days in advance and within the Golf Member specified tee times two days in advance, except during the time period of May 1 through October 31, when Resort Golf and Executive Golf Members may make tee times 10 days in advance, both in and out of Golf Member specified tee times.  These membership classifications are subject to restrictions in Section G 2, as defined above and are restricted to two tee times daily in all periods. Subject to Article II, Resort and Tennis with Golf members may make tee times excluding the Golf Member specified tee times up to four days in advance beginning at 12 p.m. The number of tee times in addition to the Golf Member specified tee times for the recognized Men’s and Women’s Golf Association weekly events are as follows: November 1 st – April 30 th May 1 st – October 31 st Additional Tee Times Additional Tee Times Tue IWGA (PM) 6 tee times Tue IWGA (PM) 0 tee times Wed IMGA (PM) 10 tee times Wed IMGA (PM) 2 tee times Thu IWGA (AM) 4 tee times Thu IWGA (AM) 0 tee times Fri IMGA (PM) 6 tee times Fri IMGA (AM/PM) 2 tee times Sun SOB (PM) 12 tee times Sun SOB (PM) 0 tee times 7. All unused Golf Member specified tee times are to be released for Resort and other membership classification use, two days in advance, as well as the above IMGA and IWGA times. 8. Members making tee time reservations are responsible for and may be subject to the appropriate fees for no show tee times and duplicate booking of tee times that are not canceled at least before the end of business the prior day.  For purposes of this paragraph, a no-show tee time is defined as the failure of any participant within the tee time to show for that tee time. Club Members will be responsible for guest attendance as well. H. Club dress code for golf courses and practice areas are as follows: All Members and their Guests must be dressed in the appropriate golf attire. Gentlemen's shirts are to have a collar, turtleneck, or mock turtle (no less than one inch in height), with no less than quarter length sleeves. Proper decorum dictates that shirts must be tucked in at all times. Golf slacks or Bermuda length shorts are permitted. The bill of hats, caps and visors must be worn in the direction you are walking. Women may wear appropriate tops, dresses, skirts, skorts, slacks, Capri-style pants, and Bermuda walking shorts. Appropriate tops do not include halter tops, bathing suits or tank tops. The following clothing items are considered inappropriate attire and will not be permitted on the golf courses, practice putting greens or the practice ranges: anything made from denim, jeans, cut-off shorts, short shorts, bathing suits, tank tops, t-shirts, jogging attire, flip-flops, crocs and leather sandals. Golf shoes or approved shoes are required on all courses and practice areas. Non-metal spikes are a requirement in all clubhouses, golf courses and practice areas. I. Minor children of members having golf course access between the ages of ten and fifteen will be permitted to tee off unaccompanied by an adult only after 3 p.m. or at the discretion of the Head Golf Professional or player assistant. All minor play in the Golf Member specified tee times must be accompanied by an adult Golf Member. J. The use of the golf courses for tournament play that alters members’ tee time availability in the Golf Member specified tee times will be restricted to events approved by the Director of Golf and reported to the Board of Governors. ARTICLE V:  OTHER RECREATION REGULATIONS A. General: Jogging and bicycling are not permitted on the golf courses or golf cart paths. Jogging is permitted along the main thoroughfare of the property. Joggers are required to wear appropriate attire.  Shirts are required to be worn. B. Swimming Pools and Jacuzzis: The Resort Operations Department will have the authority at all times to maintain order in the pools and pool areas and to make decisions regarding safe periods. All posted pool and Jacuzzi rules must be followed. No lifeguards are on duty at the pools. Swimming will be at your own risk. Children must be 48” or taller to ride slides. Children 42-48” may ride slides with a waiver on file. Resort staff may deny slide privileges to any swimmers deemed unsafe in any way. The pools and pool areas will be cleared of all persons during inclement weather, such as lightning and thunderstorms. No drinking glasses, glass containers or glass bottles of any sort are allowed in the pool areas. Balls, rubber rafts, snorkels, pool floats and other play equipment are permitted in the pools only at the discretion of the Resort Operations Department. A responsible adult must accompany children under 14. All persons must wear normal bathing attire while swimming or sunning. Cut-off jeans and similar attire are not considered bathing suits.  Hairpins, barrettes, or metal hair ornaments may not be worn in the pool. Swim attire must be deemed appropriate.  Revealing swimwear will not be allowed. Children under 3 years of age and those wearing diapers are not allowed in the pools without appropriate protective wear and must wear swim diapers. No one who has an open sore or skin disease may enter the pools. Bicycles, skateboards, roller skates or other wheel devices (except wheelchairs) are prohibited. From time to time, supplementary rules will be posted in the pool and Jacuzzi areas. Each family membership is limited to between two and four accompanied guests, as designated by the Resort Manager, with the exception of Full Golf Members which may be allowed additional guests at resort discretion. Guests may be restricted entirely on holiday weekends. Resort may change guest policy at any time without notification. C. Tennis Courts: Court reservations are required for all play. Eligible members may make reservations seven (7) days in advance. As a matter of courtesy and practicality, reserved play (in one’s name or as a partner to another who has reserved a court) is limited to two hours per person per day unless there are open courts. In any event, anyone who has played for two hours must yield to others who have not played for two hours. Any member not canceling their reserved court time(s) the day prior to play, may be responsible for applicable fee(s) at the existing resort guest rate. Players will wear clothing appropriate for the tennis courts. Men must wear shirts with sleeves. Bathing suits will not be permitted on the courts.  Only smooth-soled tennis shoes will be worn on the courts. Food and beverage consumption will be confined to the designated areas. Members may bring no more than three guests at a time and may bring the same guest up to 8 times a year in total, regardless of who playing with. All members and guests are required to register at the tennis reception desk prior to commencement of play. Presentation of the membership card is required for use of the tennis facility and charge purposes. Players will use the court number assigned by the tennis reception desk. The Tennis Professional and staff are responsible for enforcing these rules and regulations. No pets allowed on tennis courts at any time. All guests will pay the appropriate guest rate according to their member or guest status. Lessons or instruction by a non-Innisbrook professional is prohibited without prior approval of the Director of Tennis. ARTICLE VI:  SECURITY, PARKING AND SAFETY REGULATIONS A. Members in all categories will be permitted to receive as many decals for their cars as they can personally provide registrations or title vehicle numbers in their names along with proof of automobile insurance. All members must display a current decal for admission to the property.  In addition, a member may be required to show a current membership card to gain access to the property and the club facilities.  Resident condominium owners will be called when their guests or family arrive, securing approval before admittance. B. Members not displaying a current vehicle decal are required to present their membership card and obtain a visitor’s pass at the security gate. C. Members intending to walk, jog, or bicycle onto property must show their membership cards to security staff at the resort entrance. D. The riding of bicycles and other vehicles on the golf courses or in tennis court or pool areas is prohibited. Golf carts are permitted on golf courses only. E. Any person not holding a valid driver’s license is prohibited from driving motorized vehicles on the Club premises. F. For safety purposes, no fishing is permitted in lake areas adjoining open golf courses during hours of play. G. Discharging of firearms, BB or pellet guns on Club premises are strictly prohibited. H. Private golf carts will be permitted on Innisbrook roadways and must be parked in appropriate marked parking spots for cart or automobile use. All carts must follow all general rules for automobiles. Drivers must possess a valid drivers license. I. Vehicle speed limit on the Club premises is 20 miles per hour and will be strictly enforced by the security officers. J. Parking of trucks, boat trailers and recreational vehicles upon Club premises is limited to designated areas on a space-available basis. K. Parking in public building driveways is prohibited. L. Parking is permitted only in and on hard-surfaced authorized parking areas. M. All vehicular traffic signage will be complied with and such compliance will be strictly enforced. N. Members in violation of any protective covenant described within this Code of Regulations will be subject to citations and assessments, in addition to any and all other remedies available pursuant to this Code of Regulations, as follows: The first violation will result in a warning with sticker placed on vehicle. The second violation within one year will result in an assessment of $25. The third violation within one year will result in an assessment of $100. The fourth violation within one year may result in a hearing before the Board of Governors, with possible suspension of parking privileges on Club premises or a more severe penalty as the Board of Governors deems justifiable. ARTICLE VII:  MEMBER ACCOUNTS, TERMINATIONS AND SUSPENSIONS A. A late payment charge will be assessed on account balances that are delinquent. The late payment charges use a monthly periodic rate of 1.5% on the previous balance, less payments and credits.  To avoid late payment charges, please pay by the last day of the current billing month.  The annual percentage rate (APR) is 18%.  The due date is the last day of the billing month. A statement of account will be provided to each member when their account is unpaid for one month from the billing date. a. When a member’s account is delinquent for 15 days from the due date, as defined above, a letter will be mailed by the Accounting Department advising the member that automatic suspension of charge privileges will result unless the account is fully paid by the end of the month. When a member’s account is delinquent one month from the due date, as defined above, a letter will be mailed certified return receipt requested from the Board of Governors, demanding payment of the balance in full and advising the member that if the account is not paid in full within 10 days from the date of the letter, automatic suspension of use of Club privileges and facilities will occur as of the first of the following month. Membership privileges will be restored only upon bringing the member’s account to a current status. Chronic delinquency of a member’s account will subject the member to any disciplinary action, which the Board deems appropriate. “Chronic” will mean any unpaid account balance reaching 60 days of age, three times in a 12-month period. b.Subject to the requirements of Article VII, Section C as to a formal hearing, the Board of Governors will have full power and authority to reprimand, place on probation, suspend, fine or terminate any member of the Club. The Board of Governors may take any other appropriate action for any conduct, which in the sole discretion and judgment of the Board of Governors is detrimental to the operation or management of the Club or the membership as a whole, The Board of Governors may take any other appropriate action for any conduct, which in the sole discretion and judgment of the Board of Governors is detrimental to the operation or management of the Club or the membership as a whole, such as short term rentals by members, including but, not limited to VRBO, Home Away, and AirB&B. A majority vote of the Board, either in person, email or by conference call, is required to reprimand a member for misconduct. A vote to place on probation, suspend, fine or terminate will require a vote of all Board members, either in person or by conference call. An affirmative vote of at least five to two is required for such action. C. No member will be fined, terminated or placed on probation for misconduct without first being given the privilege of a hearing before the Board of Governors. The Board of Governors will give the member at least ten days advance notice of the time and place of the hearing.  The Chairman of the Board of Governors may suspend a member, for up to 30 days, pending a hearing. D. The Board of Governors will not consider any complaint against a member of the Club for violation of any of the rules and regulations of the Club unless such complaint will be in writing and signed by the complainant. E. The implementation of suspension, probation or fine as noted above does not abate the member’s responsibility to make full payment of dues during the suspension, probation or period of a fine. ARTICLE VIII:  GENERAL A. The Board of Governors may, from time to time, appoint from the qualified members of the Club such committees, as it may deem advisable, to assist in the Club activities. B. The Board of Governors will approve or reject all applications for membership and the same will be indicated in the minutes of the Board of Governors. All applications and related information submitted to the Club are confidential. C. All members will be furnished a copy of this Code of Regulations upon being accepted for membership and thereafter will be notified of subsequent amendments as provided for in paragraph E of this Article. D. The provisions of this Club’s Code of Regulations for use of the Club facilities will apply to members, guests of members, each person privileged to use the Club facilities by virtue of the rental of a condominium unit, as a guest under the Rental Pool Operation of the Resort during the period of rental occupancy, and all other persons who may be accorded use from time to time by this Code. E. This Code of Regulations may be amended by the Board of Governors at any time and from time to time by following the provisions of this paragraph. Amendments shall include additions, deletions, and modifications.  Each amendment shall require the affirmative vote of four members of the Board.  A copy of each amendment shall be sent to each member within a reasonable time thereafter.  In addition to the foregoing, the board shall have the authority to make exceptions to the Code, without amending the Code, for special situations in which the Board determines such action is in the best interest of the Club and the member involved. F. Under the authority of the Board of Governors, this Code of Regulations as amended, is effective July 21, 2023 and supersedes all Codes of Regulations previously adopted. G. The Code of Regulations must be reviewed biannually, if not sooner, by Resort Management and approved by the Board. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/covid-safety",
      "text": "Membership at Innisbrook Golf Resort - Unlock Exclusive Benefits Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Innisbrook Membership Become a Member of the Club by contacting us at [email protected] or 727.370.4678 . Discover a place where every day feels like a getaway. Innisbrook’s Memberships invite you to embrace a lifestyle of leisure, connection, and spirited recreation. With five thoughtfully designed membership options, you’ll enjoy year-round access to championship golf, rejuvenating spa treatments, family-friendly amenities, and the warmth of a private club community. Whether you're seeking active adventures or serene moments, Innisbrook offers the freedom to live well—your way. Membership Types Membership Inquiry Membership Application Tee Off in Style: Exclusive Access to Championship Golf Golf enthusiasts, rejoice! As a member, you gain privileged access to 63 holes of golf, each distinct course renowned for its unique challenges and stunning landscapes. Elevate your game, connect with fellow golfers, and relish the privilege of teeing off on meticulously designed fairways. Rally on the Courts: Tennis Experiences Tailored to You For those who thrive on the court, our membership offers access to tennis experiences that cater to all skill levels. Serve up sunshine and enjoy friendly matches, personalized coaching, and social events that bring the tennis community together in an atmosphere of camaraderie. Dive into Indulgence: Heated Pools for Year-Round Enjoyment With your Innisbrook membership, a world of relaxation unfolds. Immerse yourself in a collection of heated pools that cater to every mood. Whether you seek a tranquil soak, a refreshing swim, or a rush down the Loch Ness waterslides, our poolside oasis is the perfect place to unwind in any season. Culinary Excellence: Fine Dining Experiences Beyond Compare Tantalize your taste buds with our culinary offerings that promise a symphony of flavors. As an Innisbrook member, you're invited to savor exclusive savings and gourmet creations - from casual bites and crafted cocktails to exquisite dinners and holiday specials. Plus, get invited to special dinner gatherings and chef demonstrations for members only. Serenity Awaits: Wellness for Mind and Body Escape and awaken your senses at our serene Salamander Spa. Membership opens the door to exclusive savings on a range of treatments designed to pamper and restore. Indulge in massages, facials, and wellness rituals that guide you toward a state of blissful relaxation. Elevate Your Fitness Journey: Dynamic Classes & Advanced Equipment Elevate your well-being with access to a well-equipped fitness center that caters to your every exercise need. From cardiovascular training to strength building, our state-of-the-art facility empowers your fitness journey. Immerse yourself in our dynamic range of fitness classes, catering to all levels. Engage in invigorating yoga for mindfulness or high-energy group sessions for endurance. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/activities/activities/",
      "text": "Resort Activities at Innisbrook Golf Resort Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Unwind, Explore and Make Memories Activities There’s something for everyone at Innisbrook. Whether you stay on property or explore Tampa Bay, each day brings a new adventure. Stay active at our tennis facility featuring 10 courts and 4,800-square-foot fitness center. Release your inner child at one of our six pools, including the famed Loch Ness pool and water slide. Explore and learn at kids camps, family-friendly events and local excursions. Filter All Resort Local Cars & Coffee May 10 | 9:00 AM - 12:00 PM Calling all automotive enthusiasts to Innisbrook Resort, home of the PGA TOUR's Valspar Championship. This event is complimentary for ALL to attend and ALL cars are welcome. Explore our dedicated page with more details here. Join the conversation and follow the Facebook event here. If you have any questions or are interested in sponsorship levels, please contact John Schroeder at [email protected] This event is complimentary and open to the public, resort guests, and Innisbrook members. Limited space is available for displaying cars, so please make sure to register as soon as possible. read more + Learn more About Cars & Coffee Live Music Imagine live music, delicious food and drinks under the sky — it doesn’t get much better than an evening on the Osprey Patio at Market Salamander Grille. Enjoy a live set every Saturday from 7:00 pm - 10:00 pm. Learn More read more + Complimentary Bikes Resort Guests can enhance their stay with complimentary use of our non-motorized bicycles. Explore Innisbrook's scenic landscape at your leisure or adventure down the picturesque Pinellas Trail. Bikes are available on a first-come, first-served basis. Available at the Loch Ness Monster Pool. Complimentary use for one hour. Please call 727.942.5987 for availability. *Helmets available upon request. read more + Dress Like a Pro Look and shop like a pro when you visit one of our three golf pro shops! Check out the top-brand golf apparel for men and women: Peter Millar FootJoy Adidas Travis Matthew Fairway & Green Donald Ross Zero Restriction Belyn Key EP Pro GG Blue read more + E-Bikes at Loch Ness Go farther, faster with electronic bikes rented by the hour from Loch Ness Monster Pool. Explore Innisbrook’s 900 rolling acres, venture beyond the property to Pinellas Trail or perhaps to downtown Palm Harbor. Please call for availability and pricing at 727.942.2000 x 5987. read more + Loch Ness Pool Summer Activities The famed Loch Ness pool and slide is a family favorite. It’s more than just swimming — water balloon tosses and pool tug of war are just a sneak peek at the organized games that make your stay endlessly entertaining. read more + Daily Golf Clinics Practice makes perfect, so we invite you to join one of our many golf clinics. Our golf pros will help you take your game to the next level. Osprey Practice Facility Adult | Daily, 10 am-11 am Members $20 | Non-Members $30 Rental Clubs: Complimentary Monday - Bunker Tuesday - Full Swing Wednesday - Putting and Chipping Thursday - Full Swing Friday - Pitching Saturday - Full Swing Sunday - Putting and Chipping Junior Full Swing Saturday, 9:00 am-9:45 am, Complimentary For more information or to reserve a spot, please contact the Director of Instruction Dawn Mercer at 727.942.5383 or [email protected] . read more + Pool Parties Parties are always more fun at Loch Ness Monster Pool. Our expert planners and attendants oversee every detail, leaving you free to partake in the festivities. Loch Ness Pizza Party Three hours | Members 25.00 per attendee | Guests 35.00 per attendee This fun pizza party includes pizza, snow cones, three drink dispensers, a setup in the gazebo area, and fun activities for attendees. Loch Ness Pool Party Three hours | Members 20.00 per attendee | Guests 30.00 per attendee This fun pool party includes three drink dispensers, a setup in the gazebo area, and fun activities for attendees. REGISTER For more information or to book your Loch Ness Pool Party, please contact John Schroeder at 727.942.55183 or email [email protected] Innisbrook Loch Ness Pool parties are reserved for resort guests and members only. Price does not reflect 24% service charge. Accommodates up to 150 guests. read more + Play Four Signature Courses Innisbrook is one of the only resorts with four exclusive courses — — Copperhead, Island, North, and South — each as unique, challenging and stunning as the next. Join the world’s greatest golfers taking on championship courses with pristine fairways, water features, spanish moss and cypress trees. *Courses are open to resort guests and members only Learn More read more + Practice & Instructional Facilities Whether you’re looking to warm-up before the round or fix that nagging hook, the practice area will meet your every need. Located near the Osprey Clubhouse, this 10-acre practice and instruction facility is open to guests prior to playing at the Island, North, or South courses; and for players without a tee time. read more + Golf Instruction Learn from the golf pros at our award-winning Innisbrook Golf Institute. It’s led by Dawn Mercer — a Class-A PGA Professional with over 30 years of teaching experience — and ranked Top 25 in Golf Magazine’s best golf schools. Whether a private lesson or a four-day program, golfers of all levels will hone their skills and learn from the experts. Offering private lessons, four day golf institutes, ladies only golf institutes, and customized instruction. Explore Instruction read more + Picture Perfect Locations Known for its stunning natural beauty and luxurious facilities, Innisbrook has multiple photo-worthy places to capture your moments: • The Snake Pit on Copperhead • Around the fire pits on the Osprey Patio • Poolside at Loch Ness Pool • Teeing off on the Island Course • Girls day at Salamander Spa • Fishing by Lake Innisbrook • Dinner at Packard's Steakhouse • Sunsets on the golf course When sharing your moments, tag us for a chance to be featured on our social media pages! #InnisbrookLife  |  #SnakePitSelfie read more + Yoga on the Spa Terrace Join us every Saturday from 9 am - 10 am for yoga on the spa terrace! Please call 727.942.5258 to reserve a spot, or check-in at the Salamander Spa front desk. Yoga is $15 per guest and is open to the public. read more + Fishing Find serenity while casting a line lakeside. Innisbrook’s vast acres of lakes are a favorite among fishers looking to unwind, teach their kids and observe wildlife in their natural habitat. Please note that fishing is only allowed lakeside. Fishing on the parking lot side of Lake Innisbrook is always open. Golf courses must be closed in order to fish lakes located on a course. read more + Team Building One of Tampa Bay’s most group-friendly destinations, Innisbrook is the perfect place for team bonding. The resort offers ample space and expert programming. Teams strengthen relationships, communication skills, creativity and problem-solving abilities by tackling a variety of games and challenges. For more information, please contact the Sales Department at 727.942.5288 . read more + Tennis Center Practice your game on Innisbrook’s 11 Har-Tru tennis courts, three racquetball courts and three pickleball. Led by Hall of Famer, Gigi Fernandez, our tennis facility has programming for all ages and skill levels. Our professional tennis staff is USPTA certified and available for private tennis lessons and custom programs. R eservations required. Please call the Tennis Center at 727.942.5241 . Tennis Touring Professional: Gigi Fernandez Director of Racquet Sports: Bryan Fox Learn More read more + Junior Tennis Programs At the Tennis Center, young players walk away with confidence and a better knowledge of tennis fundamentals. Children programs are made for a range of ages and levels. Each class will guide your kids as they learn and improve their tennis game. Tots Tennis Ages 3-5 years An introduction to tennis. Helping kids to improve their balance, agility, and coordination. Tuesday and Thursday | 4:00 pm - 4:30 pm Individual | Members $13 | Guests $16 12 Sessions | Members $132 | Guests $162 Red 1 Champions Ages 5-7 years Train the basics: Working on balance, agility, and coordination while introducing more racquet and ball skills Monday and Wednesday | 4:00 pm - 4:45 pm Individual | Members $20 | Guests $24 12 Sessions | Members $204 | Guests $249 Red 2 Champions Ages 5-7 years Serve, rally, and score: Introducing more rally (sending and receiving) skills while further developing their coordination, agility, and speed. Overarm serve and learning to score will also be introduced. Monday and Wednesday | 4:00 pm - 5:30 pm Individual | Members $20 | Guests $24 12 Sessions | Members $204 | Guests $249 Orange Hot Shots Ages 7-10 years Develop a rounded game: Some basic tactics shall be introduced along with learning to problem solve and a guide to sportsmanship. Tuesday and Thursday | 4:30 pm - 5:30 pm Individual | Members $24 | Guests $28 12 Sessions | Members $249 | Guests $294 Green Grand Slammers Ages 8-10 years Test your skills: It's time for kids to play on full-size courts! Grow their game by fine-tuning and refining techniques they have learned. Monday and Wednesday | 5:30 pm - 7:00 pm Individual | Members $28 | Guests $34 12 Sessions | Members $294 | Guests $336 Jr. Satellite Ages 11+ years Take your skills further: Kids will continue to work on their technique while exploring different styles on the court and start to choose their own. Monday and Wednesday | 5:30 pm - 7:00 pm Individual | Members $28 | Guests $34 12 Sessions | Members $294 | Guests $336 Jr. Challengers Ages 12+ years Reach your utmost potential: Progression towards high school, USTA Tournaments, and college tennis. Tuesday, Wednesday, Thursday | 4:00 pm - 6:00 pm Individual | Members $30 | Guests $36 12 Sessions | Members $324 | Guests $375 *To receive the 12 session price, you must attend two clinics a week. For more information, please contact the Tennis Center at 727.942.5241 or Judi Alford at [email protected] . read more + Spa and Salon Services Serenity awaits at the award-winning Salamander Spa. Unwind with our full-service offerings including massage, hair, nails, facials, and more. Complete with an outdoor terrace and private relaxation area, 12 treatment rooms, and expertly trained staff, our beautifully renovated spa is the illydic place to decompress and recharge. Learn More read more + Fitness Classes Stay physically and mentally balanced on vacation. No matter your preferred form of exercise, our 4,800 sq ft fitness center has an activity for you. Atate of the art equipment (ellipticals, free weights, treadmills, etc.) and a variety of classes are offered daily for resort guests and members. Fitness Center Hours Open Monday-Friday 6:00 - 7:00 pm Saturday and Sunday 7:00 am - 5:00 pm Please call the Fitness Center at 727.942.5272 to reserve your spot in a class. Learn More read more + Empower Adventure Tampa Bay Get ready for an adventure like no other! Just a short drive away from Innisbrook Resort, Empower Adventures offers the ultimate 5-star zip lining experience in Tampa Bay. With fully guided tours and breathtaking views, you're in for an unforgettable time. Whether you are looking for a thrilling excursion or a scenic getaway, Empower Adventure has you covered. Book Now read more + The Fred Marquis Pinellas Trail Venture among the locals on this unique and beloved recreation trail and linear park. Spanning from St. Petersburg to Tarpon Spring, it’s been transformed from an abandoned railroad corridor into a protected green space for walking, jogging, skating and biking. Book Now read more + Busch Gardens G et excited for a day at Busch Gardens® Tampa Bay. The theme park is a favorite among families, blending thrilling roller coasters, family friend rides, live shows and animal attractions (featuring more than 12,000 species). Busch Garden's large collection of roller coasters make them Florida’s thrill ride leader and their world-class shows provide entertainment for all ages. Learn More read more + Ybor City This historic neighborhood was once the epicenter of cigar manufacturers. Today it’s known for its food, social and shopping scene as much as its cigar past. Founded by Vincente Martinez-Ybor in the 1880s, the community consisted of Cuban, Spanish and Italian immigrants who flocked to the cigar mecca. While it’s evolved, this rich culture carries on for visitors to enjoy today. Learn More read more + Downtown Dunedin Find a bit of everything in Downtown Dunedin: shops, art galleries, events, dining and more. Meander along Scottish-inspired Main Street or explore one of the many art & crafts festivals, parades, concerts and farmers market. Keep in mind that parking can be a challenge so might require payment. Learn More read more + Clearwater Beach There’s a reason Clearwater is a top destination all year — its natural beauty, outdoor activities and entertaining events keep visitors coming back for more of this West Coast wonder. Learn More read more + Clearwater Marine Aquarium Families love to explore this special marine animal sanctuary. It’s dedicated to the rescue, rehabilitation, and release of sick and injured marine animals, public education, and animal-assisted therapy and research. Located on Clearwater Beach, it’s the permanent home to numerous forms of marine life with serious injuries that prevent their return to the wild. Learn More read more + Local Breweries Hop from one brewery to the next in Tampa Bay. Craft beer drinkers delight in Tampa’s 40+ small breweries located that welcome all visitors with open arms, and full pints. The resort is happy to help arrange transportation to ensure you enjoy responsibly. Learn More read more + Lowry Park Zoo Get ready to see species native to Florida and beyond at Tampa's Lowry Park Zoo. It proudly boasts over a million visitors each year — one of the most popular zoos in the southeast. Learn More read more + Florida Aquarium Located channelside in Downtown Tampa, this adventure has something for everyone. After discovering and learning marine life at the Florida Aquarium, take a waterfront stroll throughout the Channel District. Here you’ll find shops, restaurants, concerts, hockey games and more. Learn More read more + Tampa Bay Downs Spend a day at the races at Tampa Bay Downs. Whether you’re looking to bet on Thoroughbred racing, high-stakes play in The Silks Poker Room or continue your golf vacation at Downs Golf Practice Facility, this place has it all. The facility offers breakfast, lunch and dinner; and families are welcome in a picnic area during races. Learn More read more + Straz Center Welcome to the largest performing arts center in the southeast. What started as an idealistic vision on an abandoned gravel lot has blossomed into the city’s cultural epicenter. Learn More read more + Ruth Eckerd Hall Come enjoy broadway shows, dance performance, unforgettable concerts and more at this special arts venue. Located in nearby Clearwater, Ruth Eckerd Hall has 73,000 sq ft of space for visitors to celebrate local and visiting performers. Learn More read more + Salvador Dali Museum Immerse yourself in surrealism at the renowned museum dedicated to iconic artist Salvador Dali. Experience the people, places and events that transformed the Spanish legend — which often requires about a half day. Based in the St. Petersburg area, you’ll be able to explore food, art, beaches and more. Learn More read more + Premium Outlets Tampa Shoppers flock to the Premium Outlets in Tampa, which boast over 100 designer and brand outlet stores. Conveniently located off I-75, shoppers enjoy delicious dining options, beautiful setting, wildlife, local communities, and more. Learn More read more + Shopping at International Plaza Known as the most unique shopping and dining destination of Florida's West Coast, the International Plaza has three fashionable department stores, over 200 specialty shops and Bay Street: open-air village of fine restaurants and small boutiques. Located near Tampa International Airport, stop on your way to or from Innisbrook. Learn More read more + Historical Greek Village of Tarpon Springs Historic charm meets modern culture in Tarpon Springs. Conveniently located a few miles from Innisbrook, visitors adore the fishing village’s brick streets, antique stores, art exhibits, specialty shops and more. Learn More read more + Load more + Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/contact-us",
      "text": "Contact Innisbrook Golf Resort - Get in Touch Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Contact Us Phone Reservation Hours Monday - Friday | 8:30 am - 4:30 pm Saturday | 9:30 am - 3:30 pm Sunday | 10:30 am - 2:30 pm Please use the form below to leave us a message, or call us at 888.794.8627 . * indicates required field Reason for Contact* Reason for Contact* Please make a selection Reservation Inquiries Guest Service Request Donation/Sponsorships Tee Time Request Tennis Inquiries Request for Copy of Receipt First Name* First Name* Last Name* Last Name* Email* Email* Phone* Phone* Organization/Company Organization/Company Address Address Zip Code Zip Code Country Country Please make a selection Afghanistan Aland Islands Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Congo, Democratic Republic of the Congo Cook Islands Costa Rica Cote D'Ivoire Croatia Cuba Curacao Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and Mcdonald Islands Holy See (Vatican City State) Honduras Hong Kong Hungary Iceland India Indonesia Iran, Islamic Republic of Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kosovo Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macao Macedonia, the Former Yugoslav Republic of Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island Northern Mariana Islands Norway Oman Pakistan Palau Palestinian Territory, Occupied Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Barthelemy Saint Helena Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Serbia and Montenegro Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Swaziland Sweden Switzerland Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States United States Minor Outlying Islands Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.s. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe City City State Please make a selection Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Marianas Islands Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Virgin Islands Washington West Virginia Wisconsin Wyoming State Comments* Comments* Preferred Method of Contact? Phone Email Please notify me of Innisbrook Resort's latest news and announcements This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://innsbrook-resort.com/property-owners/contact-and-hours",
      "text": "Innsbrook Resort | Live | Property Owners Skip to content Location & Map View Our Listings Contact Property Owner Login Property Owner Login Menu Menu Discover Golf Our Course Book a Tee Time Golf Events and Specials Groups & Tournaments Stay & Play Pro Shop Dining Clubhouse Bar & Grille Par Bar Summerhaus Poolside Eatery & Bar The Market Cafe & Creamery The Library Speakeasy Dining Events Shop Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Booking Specials Gallery Live About Location & Map Listings Our Agents Open Houses View Listings FAQs Utilities IBK Services Build Home Types Listings Building Your Home Remodeling & Additions Explore Activities Event Calendar Equipment Rentals Games Hiking at Innsbrook Trails Amenity Complex Live Music Charrette Creek Commons Lakes Beaches Stables Connect Our History Our Team Employment Blog IBK Explorer Newsletter Subscribe Property Owner Portal Menu Discover Golf Our Course Book a Tee Time Golf Events and Specials Groups & Tournaments Stay & Play Pro Shop Dining Clubhouse Bar & Grille Par Bar Summerhaus Poolside Eatery & Bar The Market Cafe & Creamery The Library Speakeasy Dining Events Shop Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Booking Specials Gallery Live About Location & Map Listings Our Agents Open Houses View Listings FAQs Utilities IBK Services Build Home Types Listings Building Your Home Remodeling & Additions Explore Activities Event Calendar Equipment Rentals Games Hiking at Innsbrook Trails Amenity Complex Live Music Charrette Creek Commons Lakes Beaches Stables Connect Our History Our Team Employment Blog IBK Explorer Newsletter Subscribe Property Owner Portal Property Owners Portal Innsbrook property owners' one-stop shop. Have questions about what events are coming up or where you can dock your boat? What about adding that new deck you've been thinking of? Here you can find all the information you need about being a property owner at Innsbrook-- from assessments to rules and regulations. Property Owner Guide Resources Guest Registration New to IBK Directory IBK Services Clubs & Groups Reservations & Sign Ups Charrette Creek Commons Hours of Operation Fireworks Information Property Owner Guide Click here to browse our updated Property Owner Guide. Innsbrook Corporation Online Payment Click HERE to view and pay your monthly Innsbrook Corporation statement via credit card or electronic payment (ACH) from your bank account. Car Stickers All property owner vehicles are required to have car stickers. These stickers are for owners and immediate family only. They are not intended for friends or employees. These stickers never expire and will only be deactivated if you sell your Innsbrook property or they are misused. Please note: Stickers must permanently adhere to the lower-left corner of the driver's side of the windshield. Stickers found to be affixed with temporary adhesive, such as tape, may be deactivated. Car stickers can be purchased for $15 each. Stop by our office at the Charrette Creek Commons or fill out this form: Property Owner Car Sticker Form . Send the form to 596 Aspen Way Drive, Innsbrook, MO, 63390 or email it to information@innsbrook-resort.com . In the office we accept cash, card, or checks. If $20 or more, you can charge it to your lot. Recreational Vehicles and Boat Registration All property-owner recreational vehicles and boats are required to have stickers. Stop by the Charrette Creek Commons to purchase recreation stickers for $5 each. They do not expire as long as the number is legible. A car sticker will also need to be purchased for golf carts/UTVs if they are to be driven through Innsbrook gates. Per the new rules, UTVs require recreation and car stickers. Car stickers are still optional for golf carts. ** New UTV Rules at Innsbrook - As of 12/1/23** *Please check the Property Owner Guide to see what vehicles and boats are permitted at Innsbrook. Fishing Regulations All of the lakes at Innsbrook are well stocked and a lake restoration program is in effect. Please abide by the following regulations on all lakes: Bass - harvest less than 12\", return 12\"-18\", daily limit of two larger than 18\" Bluegill - daily limit of four larger than 8\" Catfish - daily limit of six larger than 12\" Crappie - daily limit of four larger than 10\" Green Sunfish - harvest all Paddlefish - return all Beach Etiquette We all share the beaches at Innsbrook so please be a good neighbor and follow these guidelines: POP-UP TENTS should be 20’ from the water to leave space for sunbathers. Please do not use a tent to reserve a beach spot, and take tents down at the end of the day. NO BOATS OR FISHING allowed in the swimming area, including between the beach and floating dock. DO NOT TIE YOUR BOATS up to the swimming/floating docks. This is dangerous for swimmers. The swimming/floating docks are for swimmers to enjoy. NO CHAIRS OR COOLERS on the docks, please. NO DIVING from the floating docks. Those who are not toilet-trained must wear SWIM DIAPERS — no one wants a repeat of the Caddy Shack pool scene (it’s really hard to drain and scrub a lake). Children in FLOTATION DEVICES should be supervised by an adult. Beach-goers AGES 15 & UNDER should be accompanied by an adult. NO LITTERING. As to cigarette butts, no one wants to sunbathe in an ashtray. NO PETS permitted in the beach area (there is one thing worse than sunbathing in an ashtray). MUSIC should be for your listening pleasure only (not everyone appreciates Barry Manilow). NO LARGE GROUPS. How would you feel if an office party parked next to you on the beach? NO CAMPFIRES. Hibachi grills work great, but watch your ashes. BOATS in the common areas are not common property…please respect the boats’ owners and do not use private boats.  Violators shall be forced to walk the plank! Most importantly — HAVE FUN! Annual Dues & Assessment Each year in early December, every property at Innsbrook, whether seasonal or permanent will be subject to an annual assessment. This bill will be sent by DNI Properties. This assessment includes funding for all of the owner association owned assets and staffing including the Charrette Creek Commons, Property Management, Maintenance, Roads and Trails, Common Ground beautification, Security staff and gate operations, billing and more. 2024 Year-End Assessment/Dues 24-25 All Home Types 24-25 Year End Condos 24-25 IBK Trustee Letter - coming soon 2024 Assessment Info IBK Nation email PDF 12.1.23 2023-24 Budget and Footnotes FINAL 12.1.23 2023-24 Assessment Itemized CONDOS YE 2023-24 Assessment Itemized All Home Types 2023 State of the IBK Nation Trustee Letter 2023 Annual Report 2025 Innsbrook Community Report Click here to watch and listen to the 2025 Annual Homeowner's and Trustee's Community Report. Click here to view the questions asked by homeowners during the meeting, and the responses from the trustees. Annual Property Owner Survey Our annual property owner survey is conducted during assessment time and will close on January 10. The survey takes about 20 minutes to complete, and asks about your satisfaction levels with various topics including activities, real estate, restaurants, and amenities. We use this survey as part of our decision making process as we move forward on new additions and maintenance priorities. Last year we had over 600 homeowners take this survey and we are hoping for even more for this year. Take the Survey here. Innsbrook Resort Trust Indenture Click here to read. Innsbrook Condominium Trust Indenture Click here to read. Innsbrook Villa Suite Trust Indenture Click here to read. Architectural Guidelines - Homes Click here to read. Architectural Guidelines - Chalets Click here to read. Alarm System Information Alarm System Information – What’s Happening with Innsbrook Home Alarm Systems in 2025 Login to the resident portal: https://ibkapps.innsbrook-resort.com/IBK-Resident/resident_login.asp Click on Services Click on Alarm Systems Contact Utilities at utilities@innsbrook-resort.com for further information. Vacation Rental Application Click here to access the vacation rental application. For More Information Contact us at 636.928.3366 x9180 or email information@innsbrook-resort.com . Facebook Twitter LinkedIn Instagram Pinterest YouTube Contact Us Phone From St. Louis: 636.928.3366 From Warren County: 636.745.3000 Email information@innsbrook-resort.com Address 596 Aspen Way Dr. Innsbrook, Missouri 63390 Copyright © 2025 Innsbrook Resort All rights reserved. Discover Activities Amenity Complex Golf Trails Lakes Beaches Stables Dining & Shopping Clubhouse Bar and Grill Par Bar Summerhaus Poolside Eatery & Bar The Market Cafe & Creamery The Library Speakeasy Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Live Listings Our Agents Open Houses FAQs Utilities Property Owners Build Building Your Home Home Types Expertise/Team Maintaining Connect About Our History Blog Subscribe Working Here Property Owner Portal Entry Close Discover Golf Our Course Book A Tee Time Golf Events and Specials Groups & Tournaments Stay & Play Pro Shop Dining Dining Events Clubhouse Bar & Grille The Market Cafe & Creamery The Library Speakeasy Par Bar Summerhaus Poolside Eatery & Bar Shop Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Booking Specials Gallery Live About Location & Map Listings Our Agents Open Houses View Listings FAQs IBK Services Utilities Build Home Types Listings Building Your Home Explore Activities Event Calendar Equipment Rentals Games Hiking at Innsbrook Trails Amenity Complex Charrette Creek Commons Live Music Lakes Beaches Stables Connect Our History Our Team Employment Subscribe IBK Explorer Newsletter Blog Search for:"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/real-estate/",
      "text": "Innisbrook Golf Resort Real Estate - Florida Properties Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Become an Innisbrook Owner Condominiums at Innisbrook offer an opportunity to own a desirable Florida vacation retreat and an outstanding real estate asset. Whether you m ake Innisbrook your vacation destination or permanent residence, enjoy a home with resort amenities at your doorstep. Reside in a spacious lodge set in peaceful woodland glen, in an executive suite, or in a one-, two-, or three-bedroom suite. Salamander Collection provides full resort services for resort rental guests and owner-members and offers an optional rental program for owners. For more information, please contact us: 727.942.5210 | [email protected] View Condo Price List Invest in Paradise As a condominium owner, you have the unique opportunity to transform your golf and vacation retreat into an income source by submitting your property to the Resort Rental Pool. When you plan to stay, enjoy the comfort and convenience of staying at your own condo for vacation, for less than a typical rental fee. Club Membership Unlimited use of golf courses, no greens fees. Become a golf member with preferred access to the resort’s four golf courses including Copperhead, home of the PGA TOUR's Valspar Championship. As a golf member indulge in waived golf greens and tennis court fees; substantial discounts on golf cart fees, dining at resort clubhouse restaurants, and on purchases of golf merchandise or equipment in our three golf shops. Look forward to member-only social events and golf tournaments — the perfect excuse to meet fellow members, relax and enjoy your condominium throughout the year. Unique Rental Program Receive income, even when your condominium is not occupied. When you’re not partaking in golf and vacation fun, you have the option of participating in the Resort Rental Pool Program to receive a portion of the resort’s total room revenue. You’ll receive income from your condominium, regardless of whether it was utilized by the resort. And as part of the rental program, you’ll have access to supervision, maintenance and repairs making ownership a worry-free, hassle-free, and an opportunity to offset expenses. resort amenities included with your golf membership: More than 600 acres of private, wooded, and lush rolling hills and lakes Five spacious condominium floor plans Sixty-three holes of world-class golf including Copperhead, host of the PGA TOUR’s Valspar Championship A top-rated tennis/pickleball facility and instructional programs Six swimming pools including the Loch Ness Pool (with waterslides) Endless biking, nature, and jogging trails Five outstanding restaurants The Salamander Spa, 12,000 sq ft of full-service serenity Innisbrook Real Estate Services Sales Recap Association Fees Customer Relationship Summary Business Continuity Plan View Available Condominiums Please note: prices and availability are subject to change without notice. Due to the inherent dynamics of real estate, status and price changes are frequent.  Although this spreadsheet is updated regularly, prices and availability are subject to change without notice. Listings - Site Owner does not guarantee the availability of the listings. Site Owner does not make guarantees as to the time it takes for a listing to sell, the likelihood, or duration for a listing to sell. Market Volatility - Site owner is not liable for changes in the market that change buyer/seller conditions. Activity Restriction - Site use is restricted to buyer/seller activities only. Innisbrook condo owners have the option to participate in the Resort's optional Rental Pool program (condos in lodges 1-24 only). Condos coupled with this option are classified as a security by State & Federal Security Laws; listing agents are dually licensed with real estate and securities licensing. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/careers",
      "text": "Careers at Innisbrook Golf Resort - Join Our Team Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Careers Innisbrook, where people make the difference. If you enjoy creating exciting experiences and delivering quality service with a passion, we are interested in you. We encourage our staff of Service Professionals to use imagination and innovation to create positive memories for our guests and members. We look for people who exemplify good character, have respect for others and who demonstrate ownership. At Innisbrook, we want to create an environment that allows our staff to grow with the Company. Does this sound good to you? Then, please apply. We look forward to meeting you. Benefits Innisbrook offers competitive wages and benefits. Benefits vary and may include: Aggressive Paid Time Off – Three weeks of PTO in your first year 8 Paid holidays Free golf for all employees Free meals each day you work Paid leave for new parents Great group health insurance options Free, on-site fitness center for employees $125 standard rate at all Salamander properties Spa & Food and Beverage discounts Generous 401(k) matching Great property access privileges so you and your family can enjoy Innisbrook About Innisbrook Resort is situated on 600 beautifully wooded acres of rolling hills in Palm Harbor on Florida’s beautiful Gulf Coast. It is conveniently located just 25 minutes from the award winning Tampa International Airport. The resort features four championship golf courses designed by legend Larry Packard, 300 spacious guest accommodations, four restaurants, three bars, the Innisbrook Golf Academy, 11 har-tru clay tennis courts, the luxurious Salamander Spa with 12 treatment rooms, a state-of-the-art fitness center, and six heated swimming pools. Innisbrook hosts the PGA TOUR’s nationally televised VALSPAR Championship each April on its famed Copperhead Course. Search Job Openings Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://alamkulkul.com/contact-us/",
      "text": "Contact Us - AlamKulKul Boutique Beach Resort Rooms Villas Promotion Facilities Cafe & Restaurant Gallery Contact Us Book Now Contact Us Reservation +62 361 752 520 Whatsapp +62 811 3900 6900 Email Info info@alamkulkul.com Address Jl. Pantai Kuta, Legian Bali – Indonesia 80361 Get In Touch Our Address Jl. Pantai Kuta, Legian Bali – Indonesia 80361 Phone: +62 361 752 520 WhatsApp: +62 811 3900 6900 E-mail: info@alamkulkul.com ALL INDONESIA Arrival Card Please scan the QR code or click the link below to complete the new ALL Indonesia Arrival Card: https://allindonesia.imigrasi.go.id/ This is a mandatory digital entry declaration required for entry into Bali/Indonesia, covering immigration, customs, and health.\nNote: This does not replace any visa requirements.\nThe form can be completed up to 3 days before your arrival in Bali. International Tourism Levy Starting 14th February 2024, all international tourist arrivals to bali will be charged IDR 150.000 per person. Please click the link below to complete : https://lovebali.baliprov.go.id © 2025 AlamKulKul Boutique Resort. All Rights Reserved | Website by Bali Web Design Book Whatsapp Phone Location WhatsApp us"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/golf/overview?NCK=inn_nonbrnd",
      "text": "Golf at Innisbrook Golf Resort - Premier Golfing Experience Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille HOME TO THE PGA TOUR'S VALSPAR CHAMPIONSHIP A Florida Golf Haven Our Florida golf resort is the home of four outstanding courses, including the top-rated Copperhead Course — the host of the PGA TOUR's Valspar Championship and favorite among golf pros. Designed by the innovative and imaginative architect Lawrence \"Larry\" Packard, each course has its own unique essence, layout and breathtaking scenery. Learn More LEARN MORE Learn More Learn More / The King's Club Club Memberships Join The Club at Innisbrook to live the Florida Golf lifestyle year-round. Copperhead Course Discover the third toughest course on the PGA TOUR. Ship your Clubs Make travel as easy as possible by shipping your clubs directly to the resort. We’ll have your clubs ready at each course while you’re here and then ship them back home after your trip. Specials & Packages Explore our best selling golf packages. Learn more The Snake Pit Copperhead is home to the PGA TOUR's Valspar Championship. Golf Instruction 10-acre practice and instruction facility. Learn More Course Updates For weekly updates on the course closure dates, visit our amenities page here. Spa Offers / Offers Classic Golf Package Tee off with the Classic Golf Package, featuring unlimited use of practice facilities, spacious accomodations, daily breakfast, merchandise credit, and more. Learn more Offers Platinum Golf Package A favorite among dedicated golfers, experience four courses — including Copperhead, home of the PGA TOUR's Valspar Championship — daily breakfast, unlimited use of practice facilities, merchandise credit, and more. Learn more Offers July Golf Offer Book your next golf getaway for July 7 - 31 and receive one complimentary certificate to return to the famed Copperhead Course before the end of the year and bring up to three guests at a discounted rate. Learn more Dress Code Men must wear slacks or shorts excluding denim jeans, bathing suits, or trunks. Shirts must be worn at all times, must have sleeves, and be tucked in. No cutoffs, tank-top shirts, muscle shirts, or commercial tee shirts will be allowed. Appropriate mock turtleneck and turtleneck shirts are allowed. Women must wear appropriate tops, skirts, culottes, or shorts excluding cut-off jeans, and swimwear. Appropriate tops do not include halter tops or tank tops. Innisbrook is a “non-metal” spike facility. All hats must be worn forward. No personal coolers or any food or beverage products not supplied by the resort are not allowed on the course. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/about-us",
      "text": "About Innisbrook Golf Resort - Our Legacy and Values Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille About Us Please be advised that the Klosterman gate is undergoing enhancements. Guests and visitors are requested to use the Belcher gate entrance . Innisbrook Resort is nestled on 600 acres of rolling hills and 70 acres of lakes on the west coast of Central Florida Only 20 miles from Tampa International Airport, the Resort appeals to visitors seeking the ultimate golf resort experience in a locale that is easily accessible and is within minutes of the beaches on the Gulf of Mexico. Innisbrook's collection of four championship golf courses is among the finest in America and is proud to host the PGA TOUR's Valspar Championship every March. With 300 spacious guest rooms and suites, 35,000 square feet of conference facilities and the luxurious Salamander Spa, Innisbrook is the perfect place for leisurely getaways and group meetings. CHECK-IN: 4 PM |  CHECK-OUT: 11 AM RESORT FEE | $40 Our $40 Resort Fee covers essential amenities to elevate your stay. Enjoy unlimited in-room wireless internet access, local and toll-free calls, and daily coffee service both in-room and at Fairways. Benefit from self-parking, on-property transportation, 24-hour gated security, and access to amenities such as non-motorized bicycles, swimming pools, fitness center, miniature golf, the Osprey Driving Range with complimentary bucket of golf balls per person, per day, and tennis court access for one hour per stay, per room. RESORT MAP Golf Golf Courses | Open Daily Copperhead Course | Open Monday - Sunday Island Course | Open Monday, Wednesday - Sunday North Course | Open Monday - Sunday South Course | Open Monday, Tuesday, Thursday - Sunday Practice Ranges Copperhead | Open Monday - Sunday 7:00 am - 3:00 pm Osprey North | Open Monday - Sunday 7:00 am - 6:30 pm Osprey South | Open Monday, Wednesday - Sunday 7:00 am - 3:00 pm Golf Shops Island | Open Monday, Wednesday - Sunday 7:00 am - 6:00 pm Copperhead | Open Monday - Sunday 7:00 am - 6:00 pm Osprey | Open Monday - Sunday 7:00 am - 7:00 pm Facilities Salamander Spa M onday - Wednesday | 9:00 am - 5:00 pm Thursday - Saturday | 9:00 am - 7:00 pm Sunday | 9:00 am - 4:00 pm *Yoga on the terrace Saturdays 9:00 am - 10:00 am | yoga canceled for Saturday 10/5 Pools Loch Ness Pool | Monday - Sunday 10:00 am - 7:00 pm Loch Ness Pool Slides | Monday - Sunday 11:00 am - 6:00 pm Copperhead, Cypress, Island, Peacock, Fairway | Dawn - Dusk *Copperhead Pool - 18+ and older | Now serving Food & Beverage from the Grill at Loch Ness Tennis Center M onday - Wednesday | 7:30 am - 7:00 pm Friday - Sunday | 7:30 am - 2:00 pm Fitness Center Daily | 5:00 am - 10:00 pm Membership Office Monday – Friday | 9:00 am – 5:00 pm Appointments suggested. Dining Market Salamander Grille All-Day Dining | Open Monday - Sunday 6:00 am - 10:00 pm Osprey Bar | Open Monday - Sunday 11:00 am - 11:00 pm *Breakfast Buffet Monday - Sunday 6:00 am - 11:00 am *Trivia Night Wednesday Night 7:00 pm - 9:00 pm *Live Music Saturday 7:00 pm - 10:00 pm Fairways Open Monday - Sunday 6:00 am - 11:00 am Packard's Steakhouse Monday | Closed Tuesday - Saturday | 11:00 am - 9:00 pm Sunday | Sunday Brunch - 11:00 am - 4:00 pm *Grab & Go Items at Patio Daily 7:00 am - 9:00 am *Grab & Go Items at Bar Daily 9:00 am - 3:30 pm The Grill at Loch Ness Dining Service | Monday - Sunday 11:00 am - 6:30 pm Bar Service | Monday - Sunday 11:00 am - 7:00 pm Turnberry Pub | Window Service Only Friday - Sunday 11:00 am - 4:00 pm *Window Service Monday, Wednesday - Sunday 7:00 am - 7:00 pm *Innisbrook Resort is a cashless facility, transactions may be settled to your Innisbrook member account, guest room, or credit card. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://innsbrook-resort.com/contact/",
      "text": "Innsbrook Resort | Contact Skip to content Location & Map View Our Listings Contact Property Owner Login Property Owner Login Menu Menu Discover Golf Our Course Book a Tee Time Golf Events and Specials Groups & Tournaments Stay & Play Pro Shop Dining Clubhouse Bar & Grille Par Bar Summerhaus Poolside Eatery & Bar The Market Cafe & Creamery The Library Speakeasy Dining Events Shop Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Booking Specials Gallery Live About Location & Map Listings Our Agents Open Houses View Listings FAQs Utilities IBK Services Build Home Types Listings Building Your Home Remodeling & Additions Explore Activities Event Calendar Equipment Rentals Games Hiking at Innsbrook Trails Amenity Complex Live Music Charrette Creek Commons Lakes Beaches Stables Connect Our History Our Team Employment Blog IBK Explorer Newsletter Subscribe Property Owner Portal Menu Discover Golf Our Course Book a Tee Time Golf Events and Specials Groups & Tournaments Stay & Play Pro Shop Dining Clubhouse Bar & Grille Par Bar Summerhaus Poolside Eatery & Bar The Market Cafe & Creamery The Library Speakeasy Dining Events Shop Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Booking Specials Gallery Live About Location & Map Listings Our Agents Open Houses View Listings FAQs Utilities IBK Services Build Home Types Listings Building Your Home Remodeling & Additions Explore Activities Event Calendar Equipment Rentals Games Hiking at Innsbrook Trails Amenity Complex Live Music Charrette Creek Commons Lakes Beaches Stables Connect Our History Our Team Employment Blog IBK Explorer Newsletter Subscribe Property Owner Portal Contact Contact Us Mailing Address Innsbrook Resort: 596 Aspen Way Drive, Innsbrook, Missouri 63390 Get Directions Phone Numbers 636.928.3366 (toll-free from St. Louis) 636.745.3000 (from Warren County) Property Owner Information: ext. 9180 Guest Services: ext. 0 Security: ext. 9400 Full Employee Directory Fax Numbers 636.745.2300 (Corporate/Accounting) 636.745.8855 (Innsbrook Real Estate/Vacations) Full Employee Directory Important Email Addresses General Information: information@innsbrook-resort.com Real Estate: property@innsbrook-resort.com Full Employee Directory For More Information Reach out to us for more information or to schedule a visit: Phone: 636.928.3366 Email: information@innsbrook-resort.com Address: 596 Aspen Way Dr., Innsbrook, Missouri 63390 Facebook Twitter LinkedIn Instagram Pinterest YouTube Contact Us Phone From St. Louis: 636.928.3366 From Warren County: 636.745.3000 Email information@innsbrook-resort.com Address 596 Aspen Way Dr. Innsbrook, Missouri 63390 Copyright © 2025 Innsbrook Resort All rights reserved. Discover Activities Amenity Complex Golf Trails Lakes Beaches Stables Dining & Shopping Clubhouse Bar and Grill Par Bar Summerhaus Poolside Eatery & Bar The Market Cafe & Creamery The Library Speakeasy Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Live Listings Our Agents Open Houses FAQs Utilities Property Owners Build Building Your Home Home Types Expertise/Team Maintaining Connect About Our History Blog Subscribe Working Here Property Owner Portal Entry Close Discover Golf Our Course Book A Tee Time Golf Events and Specials Groups & Tournaments Stay & Play Pro Shop Dining Dining Events Clubhouse Bar & Grille The Market Cafe & Creamery The Library Speakeasy Par Bar Summerhaus Poolside Eatery & Bar Shop Innsbrook Boutique Weddings & Events Our Venues Catering Meetings & Events Booking Specials Gallery Live About Location & Map Listings Our Agents Open Houses View Listings FAQs IBK Services Utilities Build Home Types Listings Building Your Home Explore Activities Event Calendar Equipment Rentals Games Hiking at Innsbrook Trails Amenity Complex Charrette Creek Commons Live Music Lakes Beaches Stables Connect Our History Our Team Employment Subscribe IBK Explorer Newsletter Blog Search for:"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/resort-map",
      "text": "Resort Map - Navigate Innisbrook with Ease Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Resort Map Only 20 miles from Tampa International Airport, Innisbrook Resort is a haven for guests seeking the ultimate golf resort experience in a sunny, Florida locale that is easily accessible and is within minutes of pristine beaches. View Resort Map Area Map View Area Map Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/",
      "text": "Innisbrook Golf Resort - Luxury Golf Retreat in Florida Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Cookies help us improve your experience on our site. By using our site, you consent to the use of cookies. For more details, please review our privacy policy . Close and Continue to Browse Sharpen Your Game Improve your swing and master the course with these five golf tips from our Director of Instruction, Dawn Mercer. DISCOVER Curated Itineraries Plan the ultimate buddy golf getaway with our curated itineraries to make the most of your stay at Innisbrook. EXPLORE Calling All Golfers Plan your next golf trip where the pro's play. Home to the PGA TOUR's Valspar Championship. Book Stay Connected Unlock exclusive offers and stay in the know about special promotions, events, and more. Sign Up Innisbrook resort Where Champions Come to Play This golf haven is home to four championship courses including Copperhead, host of the PGA TOUR’s Valspar Championship. Driving through Innisbrook Resort’s welcome gates, you’ll get carried away by rolling hills and peaceful lakes set across the spacious property. Ideal for group trips with endless activities for all — unwind at six pools, indulge at our restaurants, practice tennis, and pamper yourself at the luxurious Salamander Spa. Find joy and solace in your private getaway. Innisbrook’s condo-style accommodations give guests a flexible stay to make your vacation comfortable and easy. Our 600 acres of natural beauty and activities make for a memorable experience for families, golf friends, and large groups alike. Indoor and outdoor event spaces can be customized to fulfill your every need; and with airports nearby, it’s as accessible as it is delightful. Explore Accommodations / Central Florida's Premier Golf Destination Bring Your Group to the Snake Pit Practice Your Skills Learn more Home to the PGA TOUR’s Valspar Championship More than 23,000 yards of golf Learn More A secluded golf destination Spacious Accommodations Perfect for Golf Getaways Learn More Sharpen your game at the Innisbrook Golf Institute Personalized Instruction Learn More Activities Explore & Play When you visit Innisbrook, there’s something for everyone — stay on property or explore the Tampa Bay area’s famous attractions. Learn more Loch Ness Pool Wednesday Night Trivia at the Market Salamander Grille Yoga on the Spa Terrace Bike Rentals Live Music Saturday Evening at Market Salamander Grille CLEARWATER MARINE AQUARIUM & Florida Aquarium Daily Golf Clinics at Osprey Practice Facility Cars & Coffee Activities Tennis Practice your game on Innisbrook’s 10 Har-Tru tennis courts, three racquetball courts and three pickleball. Led by Hall of Famer, Gigi Fernandez, our tennis facility has programming for all ages and skill levels. Learn more Juniors Tennis Training Group Instruction and Clinics, Private Lessons, Competitive Adult Leagues Lesson & Rental Rates / The King's Club Packard's Steakhouse Market Salamander Grille & Bar Fairways Coffee Shop Turnberry Pub Grill at Loch Ness Learn more A modernized classic menu Dining Learn More Local Gathering Spot for Dining & Drinks Dining Learn More perfect pairings of coffee and grab-and-go bites Dining Learn More Casual Meals with a View Dining Learn More Poolside Dining Dining Learn More Suites Rooms Junior Suite One Bedroom Suite Two Bedroom Suite Presidential Suite Deluxe Double Queen Guestroom Junior Suite Learn More One Bedroom Suite Learn More Two Bedroom Suite Learn More Presidential Suite Learn More Deluxe Double Queen Guestroom Learn More Gatherings Weddings & Special Events Learn More Learn More Gatherings Meetings, Incentives & Retreats Learn More Learn More Special Offers / Offers Classic Golf Package Tee off the summer with the Classic Golf Package and spacious accommodations, daily breakfast, merchandise credit, and more. Learn more Offers Platinum Golf Package A favorite among golfers, enjoy 18 holes of golf on your arrival and departure days, and 36 holes on all other days of your stay, including one round on Copperhead, home of the PGA TOUR's Valspar Championship. Learn more Offers Stay More, Save More Escape to Florida and extend your stay at Innisbrook Resort with savings of up to 35%. Stay longer and experience more. Learn more Salamander Spa Specials Experience pure relaxation at Salamander Spa with our rejuvenating specials, from the Detoxifying Lemongrass Mint Massage to the Sun-Kissed Recovery Package. Pamper yourself and embrace your inner glow today. DISCOVER Treatments Rejuvenate at the Salamander Spa, a luxurious oasis and full-service beauty salon. The serene spa is home to expert therapists, 12 pristine treatment rooms and a spacious terrace with a firepit, leaving you feeling renewed and inspired. Learn More Fitness Maintain your personal health and wellness journey with group classes on the terrace, exercise bikes, free weights and more. Innisbrook’s Fitness Center has it all to keep you centered and energized. Learn More Follow Us Join the Conversation @innisbrookResort Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.salamanderhotels.com/contact-us",
      "text": "Hospitality Management Company | Salamander Hotels & Resorts - Contact Skip to main content Salamander Collection SA L AMANDE R ® C OLL E C TION Book Now Menu Our Story Sheila C. Johnson Our Team Awards & Recognition Stories by Salamander Services Hotels & Resorts Salamander Middleburg Salamander DC Hotel Bennett Half Moon Aspen Meadows Innisbrook PGA National Resort Real Estate Press Corporate Information Overview News Releases In the News Image Gallery Salamander Middleburg Overview News Releases In the News Image Gallery Salamander DC Overview News Releases In the News Media Gallery Hotel Bennett Overview News Releases In the News Image Gallery Half Moon Overview News Releases In the News Image Gallery Aspen Meadows Overview News Releases In The News Image Gallery Innisbrook Resort Overview News Releases In the News Image Gallery PGA National Resort Overview News Releases In The News Media Gallery Experiences Experience Family Reunion Holiday Salamander Magazine Gift Cards Memberships Salamander Contact Us Corporate Office 10 N. Pendleton St. P.O. Box 0769 Middleburg, VA 20118 540.687.3710 (phone) 540.687.3117 (fax) Sales & Marketing Inquiries [email protected] Development Inquiries [email protected] Submit Inquiry Aspen Meadows Resort 970.925.4240 General Manager: Carrie Williams Media Inquiries [email protected] Salamander Middleburg 540.326.4000 Managing Director: Scott Little Director of Sales & Marketing: Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Email Doug Camp Hotel Bennett, Charleston, SC 843.990.5400 Managing Director: Marty Wall Director of Sales & Marketing: Rachel Frost Innisbrook, Tampa Bay, FL 727.942.2000 General Manager: Bobby Barnes DEmail Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Email Michael Williams Director of Sales & Marketing: Patrick House Half Moon, Montego Bay, Jamaica 800.626.0592 General Manager: Shernette Crichton Director of Sales: Sharon Logan Director of Communications: Laura Redpath PGA National Resort, Palm Beach Gardens, FL 800.863.2819 Director of Sales & Marketing: Philippe Thevenet Salamander Washington DC 202.554.8588 Make a Reservation Select a property Select a property ASPEN MEADOWS AURORA ANGUILLA HALF MOON HOTEL BENNETT INNISBROOK GOLF RESORT SALAMANDER DC SALAMANDER RESORT & SPA Arrival Departure Rooms Rooms 1 2 3 4 Adults Adults 1 2 3 4 Children Children 0 1 2 3 4 Promo code Salamander Collection C OLL E C TION SA L AMANDE R Â® Reach Us 10 North Pendleton St. Middleburg, VA 20117 Facebook YouTube Instagram Salamander Collection About Salamander Press Contact Us Careers Gift Cards Privacy Terms of Use ADA Compliance Site Map Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Hotel Bennett Charleston, SC Half Moon Montego Bay, Jamaica Innisbrook Tampa Bay, FL Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/meet/meeting-package",
      "text": "Group Offer for Meetings - Special Rates at Innisbrook Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Group Offer With a reputation built upon thoughtful, unexpected amenities, impeccable service, and truly creative approach to the guest experience, Innisbrook Resort continues to provide innovative and personalized hospitality experiences that are equal parts comfortable, kind, respectful, and welcoming. Inspired Meetings Package Details We invite you to reserve your next group event at Innisbrook and enjoy the following enhancements: Book 10-50 Rooms on Peak Night and Pick Three (3), or Book 51+ Rooms on Peak Night and Pick Five (5)* 10% Savings on Banquet Menus 20% Savings on Audio Visuals 25% Allowable Attrition 20% Savings on Golf & Spa Up to Five (5) Suite Upgrades at a Group Rate One (1) Complimentary Room Per 30 Paid Guest Rooms Book Two Years and Receive the Same Room Rate One (1) Complimentary Coffee Break One (1) Complimentary One Hour Beer and Wine Reception Exclusive Perks for 2025 Meetings Book your 2025 event by September 30, 2025, and receive the following: $500 credit to your bill, with a minimum $10,000 spend AND $100 gift card to the planner For more information, please contact [email protected] . Submit RFP View Meeting Venues *Minimum two-night stay with 10+ rooms per night. Not applicable to already contracted groups. Subject to availability and certain restrictions may apply. Promotion is not combinable with other offers. Exclusive Perks for 2025 Meetings apply for events that will actualize by December 31, 2025. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/stay/overview",
      "text": "Tampa Fl Hotel Suites | Innisbrook Golf Resort – Accommodations | Florida Hotel Accommodations Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Rooms Your Home Away from Home Our condo-style accommodations offer guests a flexible stay to make your vacation comfortable and easy. Explore elegantly designed suites and rooms of varying sizes, and amenities including kitchens, patios and more. Check-In: 4:00 pm | Check-Out: 11:00 am Phone Reservation Hours Monday – Friday 8:00 a.m. -  6:30 p.m. Saturday 9:00 a.m. – 5:00 p.m. Sunday – 9:00 a.m. – 3:00 p.m. RESORT FEE *Innisbrook Resort is a cashless facility, transactions may be settled to your Innisbrook member account, guest room, or credit card. Suites One Bedroom Suite Learn More Book Now Two Bedroom Suite Learn More Book Now Junior Suite Learn More Book Now Presidential Suite View Suite Book Now / Rooms Deluxe Double Queen Guestroom Learn More Book Now / / Amenities Hospitality at its Finest Pet Friendly Here at Innisbrook, we do allow pets. Our policy is one small dog or cat (35lbs or less) allowed for a fee of $150, service dogs are an exception. Some unit owners will not accept pets in their units which will be notated. Pet Policy Resort Enhancements Included in your stay: Daily coffee service both in-room and at Fairways Access to Osprey driving range and practice facilities including one bucket of golf balls One hour of tennis court access Six pools including Loch Ness Fitness Center Miniature Golf Resort Fee Your Room Features Wifi & High-Speed Internet Access Flat Screen TVs Writing Desk Zense Toiletries Hypo-allergenic bedding available Laundry and valet same day service Iron/Ironing Board Hair Dryer Non-smoking Wake-up call service Air conditioning with individual climate controls Coffee Machine BOOK Special Offers / Offers Florida Resident Treat yourself without the hassle of a long distance trip. Residents of the sunshine state receive up to 15% off a stay at Innisbrook Resort. Learn more about Florida Resident Offers AAA Savings AAA Members take advantage of special savings enjoying 10% off our Best Available Rates at any time. Learn more about AAA Savings Offers Modern Heroes To show our appreciation to service personnel who keep us safe and healthy, we are proud to offer active military, doctors, nurses, police, and firefighters a 25% discount on our Best Available Rates. Learn more about Modern Heroes Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/gatherings/meetings/overview",
      "text": "Meetings and Events at Innisbrook Golf Resort - Ideal Venue Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Meeting & Event Venues Memorable Events Inspire your attendees at this one-of-a-kind destination. Located on 600 rolling acres, Innisbrook provides an idyllic venue to host conferences, board meetings, fundraisers, and team bonding excursions. Simply put, Innisbrook's over 70,000 square feet of unique indoor and outdoor event space set in its private location near Tampa, Florida, provides the perfect place for your next event. Learn More Request for Proposal View Virtual Tour Stirling Hall Meeting Venues / Meeting Venues Stirling Hall Stirling Hall features a ballroom boasting over 8,000 sq. feet of space with sparkling chandeliers and a permanent stage. View All Venues Amenities & Services 280 guestrooms and suites 32 breakout rooms Over 70,000 sq. ft. of event space Two 8,280 sq. ft. ballrooms Team building Audio/visual technology TAKE A VIRTUAL TOUR REQUEST PROPOSAL Unique Experiences Our 600-acre resort features miles of jogging and cycling trails, six pools, an award-winning tennis facility, and four challenging golf courses. Located near Busch Gardens, Tampa Bay Downs, the Florida Aquarium, and other attractions, there's plenty for your attendees to explore. EXPLORE Weekly Happenings Enhance your experience with a variety of engaging weekly events, featuring holiday specials, music bingo nights, live entertainment, and more. DISCOVER / Meeting Packages Inspired Meetings Package We invite you to reserve your next group event at Innisbrook and enjoy the following enhancements: Book 10-50 Rooms on Peak Night and Pick Three (3) or Book 51+ Rooms on Peak Night and Pick Five (5)* Learn More Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    },
    {
      "url": "https://www.innisbrookgolfresort.com/spa/appointments",
      "text": "Spa Appointments - Book Your Relaxation at Innisbrook Skip to main content Innisbrook Salamander Collection Welcome Gallery Arrival Resort Map Amenities & Hours Happenings Holiday Activities Event Calendar Membership Offers BOOK Menu Accommodations Overview Suites rooms Pet Friendly Resort Amenities Fee Activities Activities Resort Pools Tennis & Pickleball Camps & Programs Fitness Holiday Activities Cars and Coffee Itineraries Golf Overview Courses Copperhead Course Island Course North Course South Course Golf Groups Instruction Valspar Championship Golf Packages Golf Tips Copperhead Cup Our New Golf Package Dining Overview Packard's Steakhouse Market Salamander Grille & Bar Turnberry Pub Loch Ness Grill Fairways Packard's Reimagined Spa Overview Appointments Arrival Treatments Specials and Promotions Gatherings Meetings Overview Meeting Venues Request for Proposal Group Offer Meet the Team Virtual Tour Weddings & Special Events Overview Venues Request for Proposal Social Events Packages Photo Tour Honoring Your Traditions Membership Overview Membership Types Membership Inquiry Membership Application Discover Our Membership Options Real Estate Overview Find A Property Meet Our Agents GIFT CARDS Room Dining Book Reserve My Stay Book Dining Restaurants Restaurants Packard's Steakhouse Market Salamander Grille Spa Appointments For appointments, please call 727.942.5258. Online booking is now available. Online booking is available only for appointments Monday - Sunday. book here You may also fill out the appointment request inquiry form below. Please note this is an inquiry form, not an appointment confirmation. Our team will contact you to confirm your appointment. Thank you for choosing Salamander Spa. First Name* First Name* Last Name* Last Name* Email* Email* Phone* Phone* Number of Guests Number of Guests Treatment(s) Requested* Treatment(s) Requested* Preference of Therapist Preference of Therapist Please make a selection Female Male Preferred Time of Day Preferred Time of Day Please make a selection AM PM Preferred Date for Appointment (mm/dd/yyyy) * Preferred Date for Appointment (mm/dd/yyyy) * Special Requests/Comments Special Requests/Comments This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Reach Us 36750 U.S. Highway 19 North Palm Harbor, FL 34684 888.794.8627 Facebook YouTube Instagram Innisbrook About Us ADA Compliance Press Room Contact Careers Gift Cards Privacy Terms of Use Code of Regulations Awards Real Estate Membership Join Our E-club Enter your email Sign Up Find your Salamander Hotel Salamander Middleburg Middleburg, VA Half Moon Montego Bay, Jamaica Hotel Bennett Charleston, SC Aspen Meadows Aspen, CO Salamander DC Washington, DC PGA National Resort Palm Beach Gardens, FL"
    }
  ]
}