{
  "fuentes": [
    {
      "url": "https://impossibrew.co.uk/pages/contact-us",
      "email": "steve.jobs@apple.com"
    },
    {
      "url": "https://impossibrew.co.uk/pages/contact-us",
      "email": "mark@impossibrew.co.uk"
    },
    {
      "url": "https://impossibrew.co.uk/pages/contact-us",
      "email": "matt@impossibrew.co.uk"
    },
    {
      "url": "https://impossibrew.co.uk/pages/contact-us",
      "email": "tom@impossibrew.co.uk"
    },
    {
      "url": "https://www.intracoastalbrewingcompany.com/contact",
      "email": "info@intracoastalbrewingcompany.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/melbourne/bars-breweries/intracoastal-brewing-company/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://ffcfc.com/First-Capital-Client-Corner-Inner-Compass-Brewing-Company",
      "email": "info@ffcfc.com"
    },
    {
      "url": "https://ffcfc.com/First-Capital-Client-Corner-Inner-Compass-Brewing-Company",
      "email": "william@ffcfc.com"
    }
  ],
  "mails": [
    "chosen-sprite@2x.png",
    "info@ffcfc.com",
    "info@intracoastalbrewingcompany.com",
    "mark@impossibrew.co.uk",
    "matt@impossibrew.co.uk",
    "steve.jobs@apple.com",
    "tom@impossibrew.co.uk",
    "william@ffcfc.com"
  ],
  "nombre_sitio": "intracoastalbrewingcompany.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://impossibrew.co.uk/pages/contact-us",
      "text": "IMPOSSIBREW® | Contact Us Skip to content Rated 4.8/5 with over 1,000+ reviews 🥭 NEW! Limited Edition Triple-Hopped IPA. Over 1 Million IMPOSSIBREW®s sold! Give £5 to a friend and get £5! Open navigation menu Open search Shop Now Get Started Bundles Lager Pale Ale Limited Edition Coming Soon TIPA LABS Edition (Loyalty) LABS #001 - Fruit Pastille Lager Accessories Discover Social Blend™ (Patent-Pending) Our Story Research LABS Loyalty Reviews Refer a Friend Savings Calculator Journal Got Questions? Frequently Asked Questions Support Trade Trade Store Invest Careers How It Works FAQs IMPOSSIBREW® GBP £ Country Isle of Man (GBP £) United Kingdom (GBP £) Open search Open account page Open cart 0 Shop Now Discover How It Works FAQs GBP £ Country Isle of Man (GBP £) United Kingdom (GBP £) Account Shop Now Get Started Bundles Lager Pale Ale Limited Edition LABS Edition (Loyalty) Accessories Discover Social Blend™ (Patent-Pending) Our Story Research LABS Loyalty Reviews Refer a Friend Savings Calculator Journal Got Questions? Trade Invest Careers Limited Edition Coming Soon TIPA LABS Edition (Loyalty) LABS #001 - Fruit Pastille Lager Got Questions? Frequently Asked Questions Support Trade Trade Store 0 Your cart is empty Continue shopping Access Denied IMPORTANT! If you’re a store owner, please make sure you have Customer accounts enabled in your Store Admin , as you have customer based locks set up with EasyLockdown app. Enable Customer Accounts Get in touch with us! Just let our AI Brewer know! Contact Us {formbuilder:MTAyMjMz} Zoom Go to item 1 Go to item 2 Go to item 3 Go to item 4 Go to item 5 Go to item 6 Go to item 7 Go to item 8 Go to item 9 Most Popular. Free Glass. IMPOSSIBREW® Bestseller Bundle 438 reviews UK's Best Tasting Alcohol-Free Lager & Pale - World Beer Awards 2023 Enhanced with Social Blend™ Our proprietary alcohol alternative formula for the perfect, natural, unwinding experience. PATENT-PENDING TECHNOLOGY* Alcohol Free Less than 0.5% ABV Up to 17 Calories Per 100ml serving Low Carb Keto-friendly formula 100% Vegan Plant-based ingredients Choose: What's included? 16x IMPOSSIBREW® Beers 8x Enhanced Lager (0.5%) - 440ml 8x Enhanced Hazy Pale (0.5%) - 440ml FREE Bespoke Glass 1x Official IMPOSSIBREW® Glass (330ml) FREE 2x For Friends (18 Total) 1x Enhanced Lager (0.5%) - 440ml 1x Enhanced Hazy Pale (0.5%) - 440ml FREE UK Express Delivery Worth £5.50 FREE Experience Manual 1x Experience & Tasting Guide Save £17 with this bundle 100% satisfaction 30-day refund guarantee View all details ✔ 30-Day Refund Guarantee Invalid password Enter Got Questions? Find our most commonly asked questions below or ask our AI Brewer for instant answers. What is IMPOSSIBREW®? IMPOSSIBREW® is a pioneering non-alcoholic beer brand based in the UK that aims to create the world's most complete alcohol alternative using patent-pending technology. Founded by Mark Wong in 2021 and working with some of the world's best professors, scientists and expert brewers, IMPOSSIBREW® specialises in expertly crafted non-alcoholic beers designed to match full ABV beers in both taste and feeling. Product Range IMPOSSIBREW® offers a range of enhanced non-alcoholic beers, including: Enhanced Lager (0.5% ABV) Enhanced Pale Ale (0.5% ABV) Limited Editions (Seasonal) Key Benefits The key feature that sets IMPOSSIBREW® apart is its proprietary \" Social Blend™ \" - a combination of active botanical ingredients and nootropics using patent-pending technology* designed to recreate the relaxing effects of alcohol without the negative side effects. Along with record-breaking quality flavour that comes from a unique process without removing alcohol. Social Blend™ Ingredients Developed with leading scientists in top UK universities, Social Blend™ includes: L-Theanine Ashwaghanda Soluble Plant Fibres Vitamin B1 Various Plant Extracts. These ingredients are chosen for their potential to boost serotonin, promote relaxation, and create a calming effect similar to the \"one or two pint feeling\" without hangovers. See more details on our very own research paper , with over 1,000 participants: More than 70% said they felt relaxed after consuming IMPOSSIBREW®. 88% have reduced alcohol consumption since discovering IMPOSSIBREW®. 95% have told a friend about IMPOSSIBREW® after trying. 3/4 say that IMPOSSIBREW® is \"the most complete alcohol alternative currently available on the market today\". Recognition IMPOSSIBREW® has received several notable achievements: Featured on BBC's Dragons' Den Awarded the first and only Gold Medal in the No/Low beer category from the London Beer Competition Received multiple industry Gold awards in categories against Full-ABV beers Most followed No/Low Alcohol brand on TikTok globally. Mission and Vision IMPOSSIBREW® is on a mission to redefine non-alcoholic drinking by creating better-than-alcohol alternatives for those who love beer but want to avoid the health risks associated with alcohol consumption. The company aims to become the global leading alcohol alternative brand, focusing on helping people transition to a healthier mode of relaxation without the traditional issues and side effects of alcohol. Production and Ingredients IMPOSSIBREW® combines traditional brewing methods with their proprietary Social Blend™ along with patent-pending technology* The beers are made with traditional brewing ingredients such as water, malted barley, wheat, hops, and yeast, in addition to the Social Blend™ components - leveraging their unique cryogenic fermentation process, which means no alcohol is ever removed from the product - ensuring the most authentic quality taste you've come to expect. Who is it for? IMPOSSIBREW® caters to consumers who: Are busy professionals and parents who would like to unwind with a drink but don't want the hangovers. Enjoy the taste and relaxing experience of beer Are looking for healthier alternatives to alcohol, with lower calories, carbs and sugar Want to avoid hangovers and other negative effects of alcohol consumption Are interested in functional beverages with potential mood-enhancing properties By offering a unique product that aims to replicate both the taste and feeling of alcoholic beer, IMPOSSIBREW® is positioning itself at the forefront of the growing non-alcoholic beverage market. Get Started Today Give it a try today with our Welcome Bundle and get 2 Free Beers with your first purchase. Get it delivered straight to your door, risk-free with our 30-day money-back guarantee. We hope you enjoy them as much as we do and we can't wait for you to try. *Patent pending in the UK under application number GB2415685.3 How does 'Social Blend™' work? Social Blend™ is our proprietary alcohol alternative made from a blend of science-backed ingredients using patent-pending technology *. Designed to replicate the sensory and social relaxing experience of drinking, minus the headaches (and bad decisions). Developed with Dr Paul Chazot , Bioscience Professor and Chair of Pharmacology at Durham University. Key Components and Mechanisms L-Theanine : Ashwagandha Root : Vitamin B1 (Thiamine) : Various nootropic herbs: Benefits Relaxation : The blend promotes a state of relaxation without the sedative effects typically associated with alcohol. Mental Calm : By boosting alpha brain waves and serotonin levels, it helps maintain a calm and focused mental state. Stress Relief : The combination of L-Theanine, Ashwagandha, and Vitamin B1 helps mitigate stress and anxiety. Mood Enhancement : The inclusion these ingredients and other botanicals supports mood regulation and overall positive outlook. IMPOSSIBREW®'s Social Blend™ is a carefully crafted combination of nootropic and adaptogenic ingredients designed to offer a relaxing and mood-enhancing experience without the drawbacks of alcohol. It leverages the natural properties of its components to promote relaxation, reduce stress, and enhance mood, making it a unique alternative to traditional alcoholic beverages. ( Read our latest research paper here ) *Patent pending in the UK under application number GB2415685.3 Do you ship overseas? We ship to the UK Mainland for free when you spend over £35 We aim to expand internationally soon - stay tuned! If you have any queries, feel free to email: hello(@)impossibrew.co.uk How long will it take to get my orders? For UK mainland deliveries, normal orders processed here will take 1-3 business days to arrive, with an optional upgrade to Next Day Delivery available (12pm cut-off). Delivery details will be provided in your confirmation email. How is 0.5% ABV alcohol-free? Yes, we know it's confusing. Isn't 0.5% ABV still alcoholic? Officially, 0.5% ABV is classified as Dealcoholised . In fact, most things we consume daily have more than 0.5% ABV Burger Rolls - 1.2% ABV Orange Juice - 0.5% ABV Ripe Banana - 0.5% ABV After more than 2 years of research, we've found that the 0.5% ABV from our natural brewing process significantly increases both flavour and mouthfeel - without spiking your blood alcohol level (BAC). Is it really gluten-free? Yes, IMPOSSIBREW® Enhanced Lager is gluten-free. Even though it contains wheat and barley, our beers have been third-party tested to contain less than 10 parts per million (PPM) of gluten, which meets the criteria to be listed as, and labeled gluten-free. Does it have alcohol tax? No. While it is true that our beers don't contain alcohol, and thus don't incur UK alcohol duty, we'd like to highlight some factors here that might be helpful in reflecting the value we provide. One-to-One Brewing Process : At IMPOSSIBREW, we take pride in our unique brewing techniques. Unlike other non-alcoholic beers, our products are never diluted, watered-down, or have their alcohol content removed - and some even dilute their alcoholic beers up to 5x. This means that our brewing process involves the same level of craftsmanship, time, and resources as a traditional craft beer, resulting in comparable production costs. Effective Nootropics : In our commitment to creating the most relaxing non-alcoholic beers, we utilise only the highest quality nootropics as our active ingredients, in safe and effectives dosages. At current alcohol tax rates for a 5% ABV beer , the cost of our nootropics more than double that. Instead of contributing the amounts as tax, why not have it contribute to the product quality itself? Small Scale Brewing : Currently, we operate on a smaller scale, which makes us less competitive than large, commercial brewers (often +10,000x our brewing size). As a growing business, we are passionate about our mission to create unique, high-quality non-alcoholic experiences, and we truly appreciate your support. As we continue to grow and expand our production capabilities, we look forward to passing on even more savings to our valued community! At IMPOSSIBREW, we prioritise offering our customers an enhanced, premium, non-alcoholic beer experience by combining innovative brewing techniques, quality active nootropic ingredients, and award-winning taste. While our pricing may differ from other non-alcoholic competitors, we believe that the value proposition and unique experience our beers provide are well worth it. At the end of the day, tasting is believing. So give it a try and let us know what you think - risk-free with our IMPOSSIBREW® Guarantee. Who shouldn't drink IMPOSSIBREW®? It is not recommended for pregnant or breastfeeding women , those with certain medical conditions like GI disorders or hypertension , or individuals taking specific medications such as antidepressants or blood thinners . If you fall into any of these categories, it's best to consult with your doctor first. Ashwagandha can lead to overstimulation (i.e. restlessness) if taken alongside thyroid medication. What is your philosophy? For thousands of years, we had only one way to unwind together. One way to let our guards down. One way to bridge the gap between who we are and who we are with others. Not because it was perfect. But because it was all we had. We decided that wasn't good enough. We exist because we believe in a world where social connection doesn't demand compromise. Where being present with others doesn't mean being absent from yourself. Where letting go doesn't mean losing control.This isn't about removing alcohol. This is about something better. Our Social Blend™ technology isn't an accident. It's the result of questioning everything we thought we knew about social drinking. About working with scientists to understand what we're really seeking in these moments of connection. About daring to imagine something that wasn't possible before. We believe the greatest innovations don't just solve problems - they change how we live. They make us question why we ever settled for less. That's what we're building. Not just a drink, but a new way forward. A future where social connection comes without compromise. Where tradition meets innovation. Where science meets ritual. This is the future of social drinking. Got more questions? Speak to our AI Brewer here for instant answers. Or email us at hello@impossibrew.co.uk Our customer support is available Monday to Friday: 9am - 5:30pm. Contact Us Join 100,000+ others enjoying a new way to unwind. Sign up to get exclusive deals, limited edition beers and much more. E-mail Sign me up! Shop Now + Get Started Lager Hazy Pale"
    },
    {
      "url": "https://www.intracoastalbrewingcompany.com/contact",
      "text": "Contact — Intracoastal 0 Skip to Content Home Taproom On Tap Food Events Contact Open Menu Close Menu Home Taproom On Tap Food Events Contact Open Menu Close Menu Home Taproom On Tap Food Events Contact Contact Us. General Inquiries / Musician Booking Intracoastal Gives Back. Intracoastal Brewing Company takes pride in supporting the community’s local causes, and we try to help as much as possible. However, we must adhere to a specific philanthropic budget. Due to the high volume of inquiries we receive, we are unable to grant every request for donation. How We Operate We ONLY review non-profit organizations that can provide proof of documentation and registration. All donation and sponsorship requests must be submitted no later than 45 calendar days before your organization’s event or requested date of contribution. All requests must be submitted through the form below. We will respectfully decline requests via mailed documents, social media or phone call. Organizations selected for donation will only receive one donation per calendar year. We Respectfully Decline Requests for personal or corporate profit Sports teams, bands and/or independent musicians Any school functions or events involving children – even if the children are not present during the event. Thank you for your interest in Intracoastal Brewing Company. If your request is selected, you will be notified by phone call or email. Please click to download our form for donation consideration. Completed forms should be scanned or saved as a PDF document, and emailed back to us at info@IntracoastalBrewingCompany.com Our Location Intracoastal Brewing Company 652 West Eau Gallie Boulevard Melbourne, FL 32935 Hours Monday — Thursday 2:00pm — 10:00pm Friday — Saturday 11:00am — 11:00pm Sunday 12:00pm—8:00pm Contact (321) 872-7395 NEWSLETTER Sign up with your email address to receive news and updates on what’s hop-pening at Intracoastal. Email Address Sign Up We respect your privacy. Thank you!"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/melbourne/bars-breweries/intracoastal-brewing-company/",
      "text": "Intracoastal Brewing Company - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Intracoastal Brewing Company Add to Wishlist Intracoastal Brewing Company Intracoastal Brewing Company is a premier microbrewery on the Space Coast. Located in the heart of Eau Gallie’s Art District, creativity extends to this brewery where you are offered a continuous rotating cycle of original handcrafted and calculated recipes, the flavors are unique and unlike anything you’ve ever tasted. You will be greeted and served by the friendly staff while you sit back and relax in the cozy and coastal environment. Add to Trip Visit Website Direction 652 W Eau Gallie Blvd, Melbourne, FL 32935 Contact (321) 872-7395 Discover More nearMelbourne and the Beaches All Hotels Restaurants Events Add to Wishlist Drews Brews and Grille Melbourne and the Beaches We have just update our menu and want to promote our “Burger of the Month” along with our new menu that includes TONS of homemade foodie items! We are now hosting NFL Game nights and have special pricing and happy offerings to go along with that. Add to Trip Add to Wishlist Longboards Oceanfront Grille Melbourne and the Beaches Celebrate the tastes of the season with every ocean breeze and sizzling sunset! This fall, Longboards Oceanfront Grille invites food lovers to indulge in our newest dinner menu—and earn a complimentary treat to share. When you purchase two entrees from the new dinner lineup, choose from a free appetizer or… Add to Trip Add to Wishlist Hell ’n Blazes Brewing Company Melbourne and the Beaches Hell ’n Blazes is known for our smoked meats, juicy burgers, and elevated entrées—plus award-winning craft brews that earned us Best Medium Brewery in Florida. Our Ringer Burger, a fan-favorite 75/25 steak burger $21, is a must-try, and you’ll want to pair it with our decadent Brownie Skillet (shareable for… Add to Trip Add to Wishlist Jacqueline’s Bakery Melbourne and the Beaches Jacqueline’s Bakery brings the flavors of France to Melbourne, FL. Founded by Jacqueline & Christophe, Paris-trained chefs, the bakery is known for authentic croissants, éclairs, macarons, quiches, and baguette sandwiches. With locations in Historic Downtown Melbourne (906 E New Haven Ave, 32901 – (7:30am-8:30pm) & Suntree (6977 N. Wickham Rd,… Add to Trip Add to Wishlist Bistro Melbourne and the Beaches Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera Melbourne and the Beaches A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your… Add to Trip Add to Wishlist Rustic (Hilton Melbourne) Melbourne and the Beaches Celebrate the flavors of fall with a $49 prix fixe feast. Begin with comforting bites. For the main event, enjoy hearty seasonal dishes that balance savory richness with autumn’s warm, comforting notes. End on a sweet note with decadent chocolate cake or warm apple crumb cobbler à la mode. Each… Add to Trip Add to Wishlist Meg O’Malley’s Irish Pub & Restaurant Melbourne and the Beaches Lovely Beginning: SCOTCH EGG – Soft-boiled egg wrapped in ground sausage, breaded, fried, served with Dubliner cheese, pickled red onions, and Irish mustard horseradish sauce. Main: SMOKED SALMON & DUMPLINGS – Tender potato dumplings tossed in an Irish smoked salmon, rasher, bacon, and spinach cream sauce. Topped with imported parmesan… Add to Trip Add to Wishlist Osuki Sushi Melbourne and the Beaches Mon-Fri Lunch: $22.95 Dinner and Saturday,Sunday: $31.95 For All You Can Eat! Add to Trip Add to Wishlist The Mansion Melbourne and the Beaches At The Mansion, guests are invited to enjoy an unforgettable dining experience in one of Melbourne’s most unique and historic venues. For a limited time, we are offering a prix fixe menu that showcases some of our most popular items. Begin with your choice of a Mansion classic  Tavern Salad or… Add to Trip Add to Wishlist Hemingway’s Tavern Melbourne and the Beaches 3 for $50. No substitutions. Smoked Tavern Wings: Chicken wings seasoned, smoked, fried crispy, and tossed in your choice of guava BBQ, hot honey, buffalo jerk, Tuscan parmesan, or pineapple cilantro chili. Snapper Hemingway: Pan-fried panko-crusted snapper fillet topped with lump crab meat beurre blanc and served with rice caribe… Add to Trip Add to Wishlist Cedars Cafe Melbourne and the Beaches At Cedars Cafe, you can always expect the unexpected. Stop in this fall for a revolving Prix Fixe menu prepared from scratch with fresh, seasonal, local foods. Enjoy a new, artful 3-course menu for $45 that changes bi-weekly. Check out our Facebook page for updated menu offerings! Add to Trip Add to Wishlist American Cab Co Cocoa Beach American Cab is the trusted transportation partner for airports, train stations, bus stations, theme parks, or cruise terminals. Reliable and secure cab services are offered to all destinations in Brevard County and beyond. Enjoy door-to-door service, flat rates to local airports and attractions, and the peace of mind of traveling… Add to Trip Add to Wishlist The Glitz & Glam of Art Melbourne and the Beaches The Glitz & Glam of Art is a new glitter paint studio located in Melbourne Florida off US1. We offer glitter canvas painting, wine glass painting workshops & rock painting. These services are offered to families & customers of all ages. No Experience necessary as there will be a guided… Add to Trip Add to Wishlist Aves’ Place Melbourne and the Beaches Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A… Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Name This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://ffcfc.com/First-Capital-Client-Corner-Inner-Compass-Brewing-Company",
      "text": "First Capital Client Corner: Inner Compass Brewing Co. {meta_title} Increase Font Decrease Font Greyscale Highlight Links Regular Font Reset SBA 504 Loan Interest Rates August 2025 25-Year Fixed Rate Standard: 6.237% 25-Year Fixed Rate Refinance: 6.266% 20-Year Fixed Rate Standard: 6.255% 20-Year Fixed Rate Refinance: 6.285% 10-Year Fixed Rate Standard: 6.174% 10-Year Fixed Rate Refinance: 6.210% Official monthly SBA 504 effective interest rate tables can be found at Eagle\n        Compliance LLC . 25- and 20-year term loans fund every month; 10-year term loans fund every other month. Effective interest rates are inclusive of servicing fees, which are subject to\n        credit risk of the applicant. Search facebook twitter linkedin instagram Looking for some help? Call 800.504.LOAN or Email Us Loan Programs SBA 504 Loan Program for Borrowers 504 Overview & Eligibility 504 Commercial Real Estate Loans 504 Machinery & Equipment Loans 504 Green Loan Program 504 Commercial Debt Refinancing SBA 504 Loan Program for Lenders & Credit Unions SBA 504 Loan Program for Realtors & Brokers SBA 504 Loan Program for Economic Developers 504 Bridge Loan Program Overview Frequently Asked Questions Rebuild Florida Business Loan Fund Florida Recycling Loan Program Florida Finance Network News & Media FCF News Alabama News Florida News Georgia News Our Story About Florida First Capital Board of Directors Contact Us Talk to a Loan Expert Company Directory Interest Rates Menu Servicing the States of Alabama, Florida, and Georgia. Lending News Archives Lending News Archives Back to News First Capital Client Corner: Inner Compass Brewing Co. Jul 2024 It’s been quite a journey from Inner Compass Brewing Company’s early days in a former gas station in Sanford, Florida to its newly constructed 7,500 square foot brewery and taproom in Bradenton. How it All Began It began in 2014, when two business colleagues created the brewery concept from a love for craft beer. Robert Turner joined the team as head brewer in 2018 and Robert’s mom, Susan Carrubba, provided the financial backing for the brewing equipment -- Inner Compass Brewing was officially born. By the time COVID shut down business operations in March 2020, Robert and Susan had bought out his partners and were full owners of Inner Compass. Wanting to move closer to his mom and family, Robert permanently closed the Sanford brewery and moved to Bradenton. With the brewing equipment, machinery, and fixtures in storage, he and Susan began the process of identifying a new location for an expanded brewery. A Step in the Right Direction Susan knew leases were too restrictive and would eat into profits. While it took some time to locate just the right spot to build and secure a construction loan, it made good business sense. Following the pandemic, banks were wary of lending to breweries. With an MBA under her belt, Susan had the business acumen to research other options available and discovered the Small Business Administration (SBA) 504 Loan Program. She contacted the Small Business Development Center (SBDC) of Seminole State College to begin creating a business plan and educate herself on the benefits of the 504 loan. Exploring 504 financing brought Susan to First Capital Finance/Florida First Capital (FCF/FFC) and Southwest Florida Business Development Officer and Vice-President, William Wilson. Susan said, \"I chose to finance through the SBA knowing the ease and benefits of this type of loan…and the decision was a great one. [The transaction] was smooth and easy to accomplish.  William was extremely knowledgeable.\" “Using a 504 loan to fund ground-up construction is ideal for both the borrower and the lender,” said Wilson.  “With as little as 10% down, the borrower preserves vital working capital and gets a long term below-market fixed interest rate with predictable payments. The lending institution mitigates its loan-to-value exposure due to the program’s unique distributed credit structure making it a win-win.” The SBA 504 Loan Program provides up to 90% financing at below-market, fixed interest rates and long amortization terms up to 25 years for the purchase of major fixed assets, such as owner-occupied commercial real estate, energy efficient “green” initiatives and/or fixed heavy-duty machinery and equipment. Setting Sights on the Future The $2.8MM SBA 504 ground-up construction project includes 2,500 sq. ft. of brewhouse space, 2,500 sq. ft. of taproom space, a full restaurant, and 500 sq. ft. of private event space. In addition to the SBA 504 loan, William helped Susan secure $300,000 in working capital through the Rebuild Florida Business Loan Fund. The brewery is a true family business with Robert brewing beer; Susan’s husband, Robert, running the kitchen, Susan’s step-daughter, Brittany, managing the taproom; and Susan keeping the books. \"As a woman business owner, the SBA opportunity through Florida First Capital Finance Corporation presented a way for us to create a future for our family,” said Susan. With hard work, perseverance, and financing through FCF/FFC and the SBA 504 Loan Program, Susan’s family is building generational wealth and Inner Compass Brewing Company has charted a course for success. Connect with William: william@ffcfc.com | 239.691.4249 First Capital Finance/Florida First Capital has an expert team of Business Development Officers working with small businesses throughout Florida, Georgia, and Alabama. To get in touch with a BDO in your area, visit ffcfc.com/talk-to-a-loan-expert . Archived 2025 - June 2025 - April 2025 - March 2025 - February 2024 - October 2024 - August 2024 - June 2024 - May 2024 - April 2024 - January 2023 - November 2023 - October 2023 - September 2023 - August 2023 - July 2023 - June 2023 - April 2023 - March 2023 - February 2022 - November 2022 - October 2022 - August 2022 - July 2022 - June 2022 - May 2022 - April 2022 - March 2022 - February 2022 - January 2021 - December 2021 - November 2021 - October 2021 - September 2021 - August 2021 - July 2021 - June 2021 - May 2021 - April 2021 - March 2021 - February 2021 - January 2020 - December 2020 - November 2020 - October 2020 - September 2020 - August Contact Us facebook twitter linkedin instagram First Capital Finance/Florida First Capital First Capital Finance/Florida First Capital (FCF/FFC) is a non-profit certified development company promoting economic development and job creation.\n        Under the SBA 504 Loan Program , FCF/FFC works with private-sector lenders to provide eligible small\n        business owners in Alabama, Florida, and Georgia with below-market, fixed interest rate long-term financing to buy or build commercial property and/or purchase fixed heavy duty machinery and\n        equipment. Florida First Capital also lends under the Rebuild Florida Business Loan\n        Fund as well as the Florida Recycling Loan Program and other small business\n        assistance programs. Corporate Headquarters: 1351 N. Gadsden Street, Tallahassee, FL 32303.  Ph: 800.504.LOAN or 850.681.3601. © 2023 First Capital Finance/Florida First Capital Finance.  All Rights Reserved."
    }
  ]
}