{
  "fuentes": [
    {
      "url": "https://www.cotswoldwildlifepark.co.uk/contact-us/",
      "email": "enquiries@cotswoldwildlifepark.co.uk"
    },
    {
      "url": "https://www.cotswoldwildlifepark.co.uk/contact-us/",
      "email": "feedback@cotswoldwildlifepark.co.uk"
    },
    {
      "url": "https://www.inverness-fl.gov/575/City-Manager",
      "email": "ewilliams@inverness.gov"
    },
    {
      "url": "https://prattvilleal.gov/departments/parks-and-recreation/",
      "email": "david.morgan@prattvilleal.gov"
    },
    {
      "url": "https://prattvilleal.gov/departments/parks-and-recreation/",
      "email": "kellie.carter@prattvilleal.gov"
    },
    {
      "url": "https://prattvilleal.gov/departments/parks-and-recreation/",
      "email": "mayor@prattvilleal.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/517/Rentals",
      "email": "bmalke@inverness.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/517/Rentals",
      "email": "hspittlehouse@inverness.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/517/Rentals",
      "email": "kbrown@inverness.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/517/Rentals",
      "email": "parks@inverness.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/517/Rentals",
      "email": "sbechtel@inverness.gov"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/cooter-pond-park/",
      "email": "info@discovercrystalriverfl.com"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/cooter-pond-park/",
      "email": "info@visitcitrus.com"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/cooter-pond-park/",
      "email": "parks@inverness.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/586/Permitting",
      "email": "cshoemaker@inverness.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/515/Park-Rules",
      "email": "sbechtel@inverness.gov"
    },
    {
      "url": "https://www.inverness-fl.gov/515/Park-Rules",
      "email": "wworley@inverness.gov"
    }
  ],
  "mails": [
    "bmalke@inverness.gov",
    "cshoemaker@inverness.gov",
    "david.morgan@prattvilleal.gov",
    "enquiries@cotswoldwildlifepark.co.uk",
    "ewilliams@inverness.gov",
    "feedback@cotswoldwildlifepark.co.uk",
    "hspittlehouse@inverness.gov",
    "info@discovercrystalriverfl.com",
    "info@visitcitrus.com",
    "kbrown@inverness.gov",
    "kellie.carter@prattvilleal.gov",
    "mayor@prattvilleal.gov",
    "parks@inverness.gov",
    "sbechtel@inverness.gov",
    "wworley@inverness.gov"
  ],
  "nombre_sitio": "inverness-fl.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.cotswoldwildlifepark.co.uk/contact-us/",
      "text": "Contact Us : Cotswold Wildlife Park and Gardens Home Plan Your Visit Travel & Directions Ticket Prices Opening Times Park Map Visiting the Park Accessibility Groups & Societies Facilities Frequently Asked Questions Animals & Gardens Birds Mammals Primates & Small Mammals Reptiles & Amphibians Gardens Web Cams What’s On Daily Activities Park News Wild Talk Magazine 2025 Get Involved Keeper for A Day Zoo Keeper Academy Trainee Keeper Day Junior Keeper Experience Animal Encounters Adoptions Interactive Zone Education Early Years Foundation Stage Primary Secondary Further & Higher Education SEN School Groups Uniformed Groups Home Education Shop Online Conservation Contact Us Home : Contact Us Get in Touch with the Cotswold Wildlife Park To request information on specific areas of the Park or to be added to one of our mailing lists please complete the form below. If you would like to get in touch with the Park for any other reason, please email us on feedback@cotswoldwildlifepark.co.uk . We will respond to your enquiry as quickly as possible. If your enquiry is more urgent, please ring the office on 01993 823 006. Name of organisation: Contact name*: Your email*: Address: Postcode: Day time telephone number: * Required Tick information required: Information leaflets General Park Information Education Conference Groups To be added to mailing list Conference Groups Useful Info About Us Media Centre Contact Us Vacancies Work Experience Cookies Privacy Policy Terms & Conditions Shop online Shop online for Day E-tickets, Annual membership, Adoptions and much more. Get involved Go behind the scenes and be a keeper for a day or experience an animal encounter. Adopt an animal Provide a helpful contribution towards the costs of keeping and feeding the animals. About Us Media Centre Contact Us Vacancies Work Experience Cookies Privacy Policy Terms & Conditions Cotswold Wildlife Park and Gardens, Bradwell Grove, Burford, Oxfordshire OX18 4JP T: +44 (0) 1993 823 006 E: enquiries@cotswoldwildlifepark.co.uk Facebook Instagram Pinterest Twitter YouTube Registered office: Bradwell Grove, Burford Oxfordshire OX18 4JP | Registered in England No. 1005032. © 2025 Copyright Cotswold Wildlife Park and Gardens. Cotswold Wildlife Park and Gardens Home Plan Your Visit Travel & Directions Ticket Prices Opening Times Park Map Visiting the Park Accessibility Groups & Societies Facilities Frequently Asked Questions Back Animals & Gardens Birds Mammals Primates & Small Mammals Reptiles & Amphibians Gardens Web Cams Back What’s On Daily Activities Park News Wild Talk Magazine 2024 Back Get Involved Keeper for A Day Junior Keeper Experience Trainee Keeper Day Animal Encounters Adoptions Interactive Zone Back Education Early Years Foundation Stage Primary Secondary Further & Higher Education SEN School Groups Uniformed Groups Back Shop Online Conservation × Close Panel"
    },
    {
      "url": "https://www.inverness-fl.gov/575/City-Manager",
      "text": "City Manager | Inverness, FL - Official Website Skip to Main Content Join our Email List Sign up to receive the latest updates on your Small Town Done Right! Click here to sign up! Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Departments Government Parks & Recreation Services How Do I... Search Home Departments Administration City Manager City Manager Staff Directory Eric Williams City Manager Email Phone: (352) 726-2611 ext 1002 Eric hails from southern Alabama and graduated from Mississippi State University earning a B.S. in Forestry and Land Management and Economics and a master’s degree in Biometrics & GIS. He began his work career in private land management in Jackson, MS. After working for five years in Mississippi and Alabama, he moved to Citrus County initially working for the Florida Division of Forestry as a Senior Forester managing a Geographic Information System (GIS), focusing on land management and wildland fire/disaster response. Eric was hired by Citrus County to be part of a development team to build a new Enterprise GIS system. He was promoted to the Director of Geographic Resources in Community Planning charged with directing and maintaining the county's long-range planning and GIS programs. In April 2013, he joined the City of Inverness as Assistant City Manager. Eric was promoted to City Manager on January 7, 2020. His experience in land management and planning have bolstered an environment desirous to increased investment and development. His deep involvement in the expansion of the Inverness Community Redevelopment Area, focus on streamlining the City’s development review process, and management and modernization of the City’s utilities has set the stage for many years of smart growth. This can be seen by many new and re-kindled developments such as Wyld Palms which had been idle for a number of years. He is a City resident and a former Rotarian but continues to enhance youth development programs within our city. Eric is Board Member of the Boys and Girls Club. He has brought forth art and cultural events for the community with a high focus on youth participation, bringing full utilization of the Valerie Theatre. To add to the many accomplishments, on January 21, 2025, the Mayor and Council proclaimed Eric the \" City Manager of Distinction\", celebrating his many achievements in serving the City of Inverness. Eric looks forward to the continued success of the community and is pleased to be part of its future. More Information City News Flash City of Inverness Celebrates Opening of New Parks & Recreation Department Office The City of Inverness proudly held a ribbon-cutting ceremony to commemorate the grand opening of the Parks & Recreation Department’s new office... Read on... Cootertober Lamp Post Decorating Contest Get Ready for the First-Ever Cootertober Lamp Post Decorating Contest! Read on... 9/11 Ceremony & Exhibit Join Us for a Day of Remembrance: Honoring the 24th Anniversary of 9/11\r\nGather with the community on September 11th at the Depot Pavilion for a morning ceremony and a powerful exhibit at the Valerie Theatre, honoring the lives lost and the heroes of 9/11. Read on... View All /CivicAlerts.aspx City Manager City Clerk Employment Council Meetings & Agendas Notify Me Employment Bill Pay Business Directory Forms & Permits City Council & Mayor Learn More... City Events Learn More... Volunteer Opportunities Learn More... Valerie Theatre Discover a cultural experience in Downtown Inverness. City Budget See your tax dollars in action with the latest information. Contact Us City of Inverness 212 W Main Street Inverness, FL 34450 Social Media Facebook Instagram YouTube Quick Links Citrus County Historical Society Visit Florida Visit Citrus County Chamber of Commerce Citrus County Board of Commissioners Citrus County Schools Florida State Government /QuickLinks.aspx Government Websites by CivicPlus® Accessibility Copyright Notices Privacy Policy & Terms of Use Site Map /QuickLinks.aspx Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://prattvilleal.gov/departments/parks-and-recreation/",
      "text": "Parks and Recreation - City of Prattville Upcoming Closures: City offices will be closed on Monday, September 1, 2025  in observance of Labor Day. The City on the Move 334.595.0100 mayor@prattvilleal.gov Residents Autauga Bluebird Trail City Cemeteries City Directory Classes and Programs Code Enforcement Cultural Art Children’s Programs Historic Walking Tours Military Recognition Banner Program Pay a Ticket Recycling Center Safe Haven Baby Box Sanitation Schedules Sports Registration Submit a Crime Tip Upcoming Event Tickets Business Bid A Project Bid Proposals Business License City Tax Code of Ordinances Economic Development GIS Permits and Forms Government Mayor City Council Comprehensive Plan Boards, Commissions & Committees Departments City Clerk Cultural Arts Economic Development Engineering Finance Fire Department Human Resources Information Technology Municipal Court Parks and Recreation Planning and Development Police Department Public Works Sanitation Department Special Events Economic Development Services Apply for: Building Permit Burn Permit Business License Marking Permit Job Openings Special Event Permit Pay: Business License Pay a Ticket Sale Taxes WOBT Tickets Report: Submit a Crime Tip Submit a Work Order Suggestion to the Mayor Request: Accident and Police Report Public Record Request Smoke Alarm Replacement Police House Check Register: Firearms Safety Course Sports Registration Classes and Programs Cultural Arts Programs News Calendar City News Press Releases Proclamations Public Notices No results See all results ✕ No results See all results Home Departments Parks and Recreation PARKS AND RECREATION Get active, have fun, and make memories with us! The Parks and Recreation Department enhances the quality of life for our community by providing safe, accessible, and inclusive parks, recreational facilities, and programs that promote physical, social, and mental well-being. We strive to preserve and protect our natural resources, promote environmental sustainability, and foster community engagement and social connections through recreational opportunities for all ages and abilities. Parks & Facilities Sports Facilities Rentals Classes & Programs Pool & Splash Pad Fitness Court Contact: Kellie Carter Director kellie.carter@prattvilleal.gov David Morgan Assistant Director david.morgan@prattvilleal.gov Doster Community Center 424 S. Northington St. \nPrattville, AL 36067 Mailing Address: 101 West Main Street Prattville, AL 36067 334-595-0800 Hours: Monday - Friday 8:00 a.m. - 5:00 p.m. Experience Prattville Fall 2025 Quick Links: Experience Summer 2025 Spring 2025 Newsletter Winter  2025 Newsletter SJS Clear Bag Policy Park Rules Historic Walking Tours Walking Tour Map Discover three exciting walking trails in historic downtown Prattville. PARKS AND RECREATION NEWS August 26, 2025 Experience Prattville Fall 2025 Newsletter Read more June 13, 2025 Prattville Announces 2025 Independence Day Parade Grand Marshal Read more May 14, 2025 Autauga Creek Improvement Committee Selected as 2025 Grant Recipient of Alabama Scenic River Trail’s Waterway Enhancement Program Read more February 5, 2025 City of Prattville Parks and Recreation announces new event series “Beats & Eats” Read more January 28, 2025 Newton Park Phase 3 Construction is Starting Soon! Read more Contact Us: Prattville City Hall 101 West Main Street Prattville, AL 36067 334.595.0100 Site Links City Directory Report an Issue ADA Accessibility Employee Intranet Disclaimer & Private Policy Archives Stay Connected: Calendar of Events Sign up for Meeting Notifications Sign up for City Newsletter Social Media Directory © 2025 City of Prattville | All Rights Reserved No results See all results ✕ Election Information Disclaimer Disclaimer: Each user by using any information on this website certifies that it is understood that the information and materials received have been provided as a service and that it is not intended to take the place of independent legal advice relating to the responsibilities as a candidate pursuant to Alabama Law. Each user further certifies that it is understood that it is the candidate’s responsibility to independently verify any information received herein. Any use or reliance on the information contained in this document and these materials is at the sole risk of the user.  The City of Prattville, its officers, employees and agents hereby disclaim any responsibility or liability which may arise or result from the use or implementation of all or any portion of the advice or materials thereof included in this website, document, hyperlinks, message, and/or attachments. ✕ Cooters Pond Pavilion 1844 Cooters Pond Rd Prattville, AL 36067 ✕ Child's Place Playground Pavilion 460 Doster Road Prattville, AL 36067 ✕ Pratt Park Pavilion 460 Doster Road Prattville, AL 36067 ✕ Station 1- Archie Plyler Station one was renamed in honor of the late Fire Chief Archie Plyler. Chief Plyler began his career with the Prattville Fire Department in 1972 after retiring form a 20 year fire service career with the military. Chief Plyler progressed through the ranks and became the City’s Fire Marshal in 1979. In 1993 chief Plyler became the Fire chief and served in that capacity until he retired in 1996. The department made significant progress under his leadership and guidance and during his tenure the department acquired a new ladder truck and a new pumper. Chief Plyler also laid the ground work for a new fire station in Prattville East at 1904 Briarwood. ✕ Station 2- Herman Scott Station Two was renamed in honor of former Fire Chief Hermon Scott. Chief Scott began his career with the Prattville Fire Department in 1923 as a volunteer. He progressed through the ranks to chief in 1965 and became the first paid Chief of the Fire Department. The Fire Department made significant progress under Chief Scott’s leadership and guidance and during his tenure became a fully paid department and moved from the rear of the old City Hall to the Fire Station located at 942 East Main Street. Chief Scott served a total of forty-nine (49) years with the Prattville Fire Department ✕ Station 3 - George Donald McGough Station Three was named in honor of former Fire Chief Donald McGough who spent 38-1/2 years of dedicated service for the city of Prattville in the Fire Department; and 20 of those years were as Fire Chief. The department made significant progress and became renown for its progress state under his leadership, guidance and forethought including starting the first Medic transport service in the State and initiating the requirements necessary for lowering the city’s insurance rating from a class 7 to a class 4. Chief McGough was active and respected in numerous fire organizations including as President of the Alabama Association of Fire Chiefs and as State Director of the Southeast Fire Chiefs Association. ✕ Station 4 On March 19, 2021, the City of Prattville officially cut the ribbon to unveil the new Fire Station No. 4 and Police Annex. This $3.7 million Public Safety Facility is located on Old Ridge Road and will further enhance response times on the east side of Prattville. The Laney family generously donated the property for this site. Webb Builders, Inc. served as the general contractor on this project to construct the modern architectural design engineered by Civil Southeast Engineering Group. This station features state-of-the-art equipment, technology, living areas, a fueling station, and a workout room. James Hardie generously donated the fiber cement siding on the outside to provide an aesthetically pleasing finish that complements the surrounding area. This 12,814 square feet facility also houses Fire Engine 4 and the Police Mobile Command. ✕ Training Facility - Stanley E. Gann The Training Facility was named in honor of former Fire Chief Stanley Gann. Fire Chief Stanley Gann began his career with the Prattville Fire Department in 1981. Chief Gann spent 30 years of dedicated service to the City of Prattville with the last 14 years as Fire Chief. Under the command of Chief Gann the department made significant progress under his leadership and guidance. Chief Gann was instrumental in securing the land and relocating the Training Facility to where it is located today. Chief Gann continued to make training firefighters a priority with the purchase of a new 6 story drill tower. The building of a 2 story rope rescue tower and a new classroom. Chief Gann was dedicated to the training of firefighters and EMT's and with this dedication the Prattville Fire Department became the first Regional Training Center for the Alabama Fire College. The Training Facility now trains firefighters from across the United States. Chief Gann retired in 2011 and the Training Facility was renamed in his honor in 2012 to the Fire Chief Stanley Gann Training Facility ✕ Overlook Park Pavilion 299 Jay Street Prattville, AL 36067"
    },
    {
      "url": "https://www.inverness-fl.gov/517/Rentals",
      "text": "Rentals | Inverness, FL - Official Website Skip to Main Content Join our Email List Sign up to receive the latest updates on your Small Town Done Right! Click here to sign up! Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Departments Government Parks & Recreation Services How Do I... Search Home Parks & Recreation City Parks Rentals Rentals The City of Inverness has many great locations to host your next event. Any and all organized events such as parties, reunions, weddings must obtain an event permit from the City of Inverness prior to the event. Venues within Liberty Park Depot Pavilion Downtown Valerie Theatre Valerie Plaza & Fountain Whispering Pines Park Pool Large Pavilion Recreation Building Green Shade Structure (located between the playground and Splash Pad) Yellow Shade Structure (located right outside the Splash Pad) To check availability on rentals & reserve, call (352) 726-3913. Whispering Pines Park Pavilion Located in the Family Center of the park close to the Splash pad, the playground, ballfields and trails. The rental fee is $75  for either time slot, 9 am to 1 pm or 2 pm – 6 pm. Capacity is approximately 50 people.  Contact Park Administration at (352) 726-3913 for more information. Whispering Pines Recreation Building Located in the front section of the park and is air conditioned/heated for convenience.  The facility does not have a full kitchen however counter, sink and several electrical units can do the job.  Tables and chairs are part of the rental facility. The rental fee is $25 per hour.   Capacity is approximately 50 people. Contact Park Administration at (352) 726-3913 for more information. Whispering Pines Aquatic Facility Located in the back section of the park and boast a 25-meter Junior Olympic size pool. Private pool rentals at Whispering Pines Park are available only during June, July, and August. Rentals are limited to a 2-hour period, with a $150 fee for up to 25 people on the deck. Reservations are available on Sundays from 3:00 PM to 5:00 PM. Parties over 25 people require an extra Lifeguard and is an additional $25 fee. Contact the Park Administration at (352) 726-3913 for more information. Private Pool Rental Rules Only Coast Guard approved life vests are allowed at the pool, no swimmies, snorkles or floats are allowed.  You may bring food, drinks and a cake for your party.  A covered area is provided for serving food.  No food or drinks (except bottled water) are allowed on the pool deck or in the pool at any time. Depot Pavilion Located in the Depot District beside Liberty Park.  The pavilion is available for large events and has the capacity for approximately 200 guests.  There is a flat fee of $250.  Contact Sherry Bechtel at (352) 726-2611 extension 1303 for details. Due to the popularity of these facilities, it is recommended you call first for availability and then complete the reservation form below, to secure your request. There are fees associated with reserving the facility of your choice. The more advanced notice, the better we can serve you. Facility Reservation Form Requests to reserve the facilities can be done online or via paper. If the paper method is preferred, you can mail the form to the City of Inverness. Attn: Parks Department, 212 W. Main Street Inverness, FL 34450 , or email . After review of your request, staff will contact you regarding the status of your reservation and any applicable fees that may apply. Staff Directory Sherry Bechtel Assistant Director of Parks and Recreation Email Phone: (352)-726-2611 ext 1303 More Information Kristi Brown Programs Coordinator Email Phone: (352) 726-2611 ext 1312 More Information Hannah Spittlehouse Events & Social Media Specialist Email Phone: (352) 726-2611 ext 1304 More Information Bobby  Malke Valerie Theatre Coordinator Email Phone: 352-726-2611 ext. 1601 More Information Bike Inverness Cycling Etiquette Cycling Groups Cycling Itineraries Inverness Biking Resources Inverness Depot District Inverness Trailhead and Connectors Withlacoochee State Trail Cooter Pond Park The Depot District Liberty Park & Depot District Liberty Trail Market at the Depot Neighborhood Parks Bryant Park Hillcrest Park Mossy Oak Park White Lake Park Park Rules Park Events Rentals Hold an Event in Inverness Wallace Brooks Park Whispering Pines Park Whispering Pines Pool Whispering Pines Splash Park Whispering Pines Park Trails Recreation Building - User Groups Council Meetings & Agendas Notify Me Employment Bill Pay Business Directory Forms & Permits City Council & Mayor Learn More... City Events Learn More... Volunteer Opportunities Learn More... Valerie Theatre Discover a cultural experience in Downtown Inverness. City Budget See your tax dollars in action with the latest information. Contact Us City of Inverness 212 W Main Street Inverness, FL 34450 Social Media Facebook Instagram YouTube Quick Links Citrus County Historical Society Visit Florida Visit Citrus County Chamber of Commerce Citrus County Board of Commissioners Citrus County Schools Florida State Government /QuickLinks.aspx Government Websites by CivicPlus® Accessibility Copyright Notices Privacy Policy & Terms of Use Site Map /QuickLinks.aspx Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.discovercrystalriverfl.com/directory/cooter-pond-park/",
      "text": "Cooter Pond Park | Discover Crystal River Skip to content CRYSTAL RIVER HOMOSASSA INVERNESS FLORAL CITY 76 ° MENU Search Term Search CRYSTAL RIVER HOMOSASSA INVERNESS FLORAL CITY Things to Do Events Where to Stay Dining Cities & Neighborhoods Plan Your Visit AR Experience Meeting Planners Citrus County Partners In Tourism Media Contact Us Visitors Guide Blog Email Signup Deals Facebook Instagram Twitter YouTube Pinterest Save Cooter Pond Park Cooter Pond is named for the Florida Cooter Pond Turtles that are abundant in this scenic City of Inverness Park with an amazing network of boardwalks that take you right over the water. Below Limpkins feast on apple snails and Gallinules fledge their young. The foot path that leads around the pond to the Withacoochee State Trail and Lake Henderson is full of suprises for the attentive birder. Reviews Cooter Pond Park Gallery 181 Hwy 41 S Inverness, \n                                Florida\n                                34450 (352) 726-3913 Website Email Home Tourist Information Center 915\n\t\t\t\t\t\tNorth Suncoast Boulevard Crystal River,\n\t\t\t\t\t\tFlorida\n\t\t\t\t\t\t34429 800.587.6667 | 352.794.5506 info@discovercrystalriverfl.com Things to Do Events Where to Stay Dining Cities & Neighborhoods Plan Your Visit AR Experience Meeting Planners Citrus County Partners In Tourism Blog Media Video Gallery Live River Cams Contact Us COVID-19 Privacy Policy Sitemap Facebook Instagram Twitter YouTube Pinterest Ⓒ 2025 Discover Crystal River Florida.  All Rights Reserved."
    },
    {
      "url": "https://www.inverness-fl.gov/586/Permitting",
      "text": "Permitting | Inverness, FL - Official Website Skip to Main Content Join our Email List Sign up to receive the latest updates on your Small Town Done Right! Click here to sign up! Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Departments Government Parks & Recreation Services How Do I... Search Home Departments Community Development Permitting Permitting PERMITTING PROCESS CHANGE Effective October 1, 2022 IN PERSON BUILDING PERMIT APPLICATIONS: Both the property owner and the contractor must sign the application. ONLINE PORTAL BUILDING PERMIT APPLICATIONS: The Building permit application must be submitted with the property owner and contractor signatures when using the portal. For any questions, please call or email Chris Shoemaker at (352)726-3401 or CShoemaker@inverness.gov Forms Building Permit Application (PDF) Sub-Contractors form to sign onto building permit (PDF) Contractor Registration Application (PDF) Notice of Commencement (PDF) Owner/Builder Disclosure (PDF) Product Approval Specification Sheet (PDF) Lien Research Request (PDF) HVAC Change out Form (PDF) Building Permit Fee Schedule (PDF) Community Development Fee Schedule (PDF) Roofing Affidavit (PDF) Building Permit Checklists Inspection Checklists Online Permitting Portal Council Meetings & Agendas Notify Me Employment Bill Pay Business Directory Forms & Permits City Council & Mayor Learn More... City Events Learn More... Volunteer Opportunities Learn More... Valerie Theatre Discover a cultural experience in Downtown Inverness. City Budget See your tax dollars in action with the latest information. Contact Us City of Inverness 212 W Main Street Inverness, FL 34450 Social Media Facebook Instagram YouTube Quick Links Citrus County Historical Society Visit Florida Visit Citrus County Chamber of Commerce Citrus County Board of Commissioners Citrus County Schools Florida State Government /QuickLinks.aspx Government Websites by CivicPlus® Accessibility Copyright Notices Privacy Policy & Terms of Use Site Map /QuickLinks.aspx Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.inverness-fl.gov/515/Park-Rules",
      "text": "Park Rules | Inverness, FL - Official Website Skip to Main Content Join our Email List Sign up to receive the latest updates on your Small Town Done Right! Click here to sign up! Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Departments Government Parks & Recreation Services How Do I... Search Home Parks & Recreation City Parks Park Rules Park Rules City of Inverness Park Rules Park hours of operation are Sunrise to Sunset No alcoholic beverages No tents, tables, or grills allowed in park unless permitted by the City for an event Organized gatherings such as parties, reunions, etc. must obtain an event permit from the City prior to event No solicitation or handbill distribution Dogs must always be kept on a leash and under the owner’s effective control. Owners are responsible to pick up after their pet Children must be supervised by adults No overnight parking, RV parking, or camping No barbecues or fires allowed unless in designated areas No glass containers No metal detecting No motorized vehicles unless authorized Do not feed the alligators No sleeping on benches, tables, or other park amenities Use park amenities for their intended purposes Fighting, cursing, and other behaviors deemed inappropriate are prohibited and are grounds for removal from the parks. Please report any vandalism or incidents to Park Staff at 352-726-3913 Pursuant to City Ordinance 14.5 Park Use Permit may be obtained by calling City of Inverness 352-726-3913 All city, state and federal ordinances, rules and laws apply Staff Directory Woody Worley Director of Parks and Recreation Email More Information Sherry Bechtel Assistant Director of Parks and Recreation Email More Information Bike Inverness Cycling Etiquette Cycling Groups Cycling Itineraries Inverness Biking Resources Inverness Depot District Inverness Trailhead and Connectors Withlacoochee State Trail Cooter Pond Park The Depot District Liberty Park & Depot District Liberty Trail Market at the Depot Neighborhood Parks Bryant Park Hillcrest Park Mossy Oak Park White Lake Park Park Rules Park Events Rentals Hold an Event in Inverness Wallace Brooks Park Whispering Pines Park Whispering Pines Pool Whispering Pines Splash Park Whispering Pines Park Trails Recreation Building - User Groups Council Meetings & Agendas Notify Me Employment Bill Pay Business Directory Forms & Permits City Council & Mayor Learn More... City Events Learn More... Volunteer Opportunities Learn More... Valerie Theatre Discover a cultural experience in Downtown Inverness. City Budget See your tax dollars in action with the latest information. Contact Us City of Inverness 212 W Main Street Inverness, FL 34450 Social Media Facebook Instagram YouTube Quick Links Citrus County Historical Society Visit Florida Visit Citrus County Chamber of Commerce Citrus County Board of Commissioners Citrus County Schools Florida State Government /QuickLinks.aspx Government Websites by CivicPlus® Accessibility Copyright Notices Privacy Policy & Terms of Use Site Map /QuickLinks.aspx Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}