{
  "fuentes": [
    {
      "url": "https://pensacolaopera.com/get-in-touch/",
      "email": "brooke@pensacolaopera.com"
    },
    {
      "url": "https://pensacolaopera.com/get-in-touch/",
      "email": "info@pensacolaopera.com"
    },
    {
      "url": "https://pensacolaopera.com/get-in-touch/",
      "email": "info@penscolaopera.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "ahendrickson@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "bhowerton@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "dschaefer@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "ecooper@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "enews@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "hpinson@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "jsaba@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "kman@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "lmalaise@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "lorvis@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "lsteck@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "mbailey@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "nstacey@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "sbrown@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "trobbins@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "email": "wsamuel@visitpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "egoss@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "jreese@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "kbrown@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "kchristman@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "mcoverdale@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "mozburn@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "sthompson@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "afox@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "cwillhite@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "jfillingim@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "mwood@cityofpensacola.com"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "email": "pbradley@cityofpensacola.com"
    },
    {
      "url": "https://www.pensacolacountryclub.com/meet-the-staff",
      "email": "aboston@pensacolacountryclub.com"
    },
    {
      "url": "https://www.pnj.com/story/news/2020/02/26/visit-pensacola-taps-pamela-johnson-fort-myers-visitor-bureau-ceo/4879122002/",
      "email": "marnold@pnj.com"
    },
    {
      "url": "https://lithub.com/we-play-ourselves/",
      "email": "ads@lithub.com"
    },
    {
      "url": "https://www.visitpensacola.com/media/press-releases/visit-pensacola-welcomes-president-and-ceo-darien-schaefer/",
      "email": "enews@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/media/press-releases/visit-pensacola-welcomes-president-and-ceo-darien-schaefer/",
      "email": "nstacey@visitpensacola.com"
    },
    {
      "url": "https://printersofpensacola.com/contactus.html",
      "email": "rayh@printersofpensacola.com"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "email": "jeni@getvows.com"
    },
    {
      "url": "https://ecua.fl.gov/contact-ecua",
      "email": "amanda.miller@ecua.fl.gov"
    },
    {
      "url": "https://ecua.fl.gov/contact-ecua",
      "email": "customer.service@ecua.fl.gov"
    }
  ],
  "mails": [
    "aboston@pensacolacountryclub.com",
    "ads@lithub.com",
    "afox@cityofpensacola.com",
    "ahendrickson@visitpensacola.com",
    "amanda.miller@ecua.fl.gov",
    "bhowerton@visitpensacola.com",
    "brooke@pensacolaopera.com",
    "customer.service@ecua.fl.gov",
    "cwillhite@cityofpensacola.com",
    "dschaefer@visitpensacola.com",
    "ecooper@visitpensacola.com",
    "egoss@cityofpensacola.com",
    "enews@visitpensacola.com",
    "hpinson@visitpensacola.com",
    "info@pensacolaopera.com",
    "info@penscolaopera.com",
    "jeni@getvows.com",
    "jfillingim@cityofpensacola.com",
    "jreese@cityofpensacola.com",
    "jsaba@visitpensacola.com",
    "kbrown@cityofpensacola.com",
    "kchristman@cityofpensacola.com",
    "kman@visitpensacola.com",
    "lmalaise@visitpensacola.com",
    "lorvis@visitpensacola.com",
    "lsteck@visitpensacola.com",
    "marnold@pnj.com",
    "mbailey@visitpensacola.com",
    "mcoverdale@cityofpensacola.com",
    "mozburn@cityofpensacola.com",
    "mwood@cityofpensacola.com",
    "nstacey@visitpensacola.com",
    "pbradley@cityofpensacola.com",
    "rayh@printersofpensacola.com",
    "sbrown@visitpensacola.com",
    "sthompson@cityofpensacola.com",
    "trobbins@visitpensacola.com",
    "wsamuel@visitpensacola.com"
  ],
  "nombre_sitio": "iplaypensacola.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://pensacolaopera.com/get-in-touch/",
      "text": "Get In Touch - Pensacola Opera Skip to content love opera. 850.433.6737 Events Donate Tickets Shop Menu Close Menu Open Menu Operas & Events 2026 Season Three Decembers La traviata Oklahoma! Event Calendar Tickets & Pricing FAQs Education & Community Jan Miller Studio Artists Children's Opera Tour Opera Up Close Student Dress Rehearsals Overture Summer Camp Community Programs Opera 101 Giving & Support Donate Friends of the Opera Event Sponsorship Voices For Change Host An Artist Advertise with Pensacola Opera Mission & About Mission & History Board & Staff Bravi! Volunteers Pensacola Opera Chorus Auditions & Employment Facility Rentals Get In Touch Search love opera. Operas & Events 43rd Season Three Decembers La traviata Oklahoma! Events Calendar Tickets & Pricing Frequently Asked Questions Education & Community Jan Miller Studio Artists Opera In Schools Student Dress Rehearsals Overture – Opera Summer Camp Community Programs Opera 101 Giving & Support Give to Pensacola Opera Friends of the Opera Our Sponsors Voices For Change Host an Artist Advertise with Pensacola Opera Mission & About Mission & History Board and Staff Bravi Opera Chorus Auditions and Employment Facility Rentals Get In Touch Operas & Events 43rd Season Three Decembers La traviata Oklahoma! Events Calendar Tickets & Pricing Frequently Asked Questions Education & Community Jan Miller Studio Artists Opera In Schools Student Dress Rehearsals Overture – Opera Summer Camp Community Programs Opera 101 Giving & Support Give to Pensacola Opera Friends of the Opera Our Sponsors Voices For Change Host an Artist Advertise with Pensacola Opera Mission & About Mission & History Board and Staff Bravi Opera Chorus Auditions and Employment Facility Rentals Get In Touch Contact Us we would love to hear from you Whether you want to inquire about an event, or tell us how we are doing, we would love to hear from you! Marketing & PR Alex Hilkey | alex@pensacolaopera Patron Services / Community Engagement / Facility Rentals info@pensacolaopera Fundraising & Planned Giving / Sponsorships / Special Events Brooke Fleming | brooke@pensacolaopera.com Music Director / Auditions / Studio Artists Cody Martin | cody@pensacolaopera Artistic Director Corey McKern | corey@pensacolaopera General Director Chandra McKern | chandra@pensacolaopera General Inquiries info@pensacolaopera Get in Touch 850.433.6737 info@pensacolaopera.com M - F, 9 AM - 5 PM 75 S. Tarragona St. Sign Up for Our Mailing List 75 S. Tarragona St. Pensacola, FL 32502 850.433.6737 info@pensacolaopera.com Facebook Youtube Instagram Love Opera. Proud Member of Copyright Pensacola Opera, INC     @2024"
    },
    {
      "url": "https://www.visitpensacola.com/who-we-are/meet-the-staff/",
      "text": "Meet The Staff | Visit Pensacola Skip to content logo 0 Saved 87 ° F Plan Your Way to Beach™ Navigation logo Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Home About Visit Pensacola Meet The Staff Meet The Staff Meet the Visit Pensacola team. Darien Schaefer President/​CEO Hometown: Milwaukee, Wisconsin Born in Milwaukee, WI and growing up in the resort community of Wisconsin Dells, Darien has been involved in the hospitality and tourism industry for over 40 years. Send An Email Read Bio Hometown: Milwaukee, Wisconsin Born in Milwaukee, WI and growing up in the resort community of Wisconsin Dells, Darien has been involved in the hospitality and tourism industry for over 40 years. A graduate from the University of Wisconsin-Stout with a degree in Hotel/Restaurant Management, Darien has worked for Holiday Inn Corporation, Marriott Hotels, and Tharaldson Lodging. It was with Tharaldson Lodging, as an Area Director responsible for 13 hotels in 8 different markets, that Darien began working closely with destination marketing organizations. Darien eventually left Tharaldson Lodging to become the Executive Director for the Janesville Area Convention & Visitors Bureau in 1998. In April of 2000, Darien joined the Wausau/Central Wisconsin Convention & Visitors Bureau. During his 13 years as the Executive Director, Marathon County rose from 17th to 9th out of 72 counties in Wisconsin for Economic Impact from traveler spending. Darien expanded the role of the CVB by creating a Sports Authority function that was responsible for developing new sporting events. Darien joined the Lake Geneva Chamber of Commerce and Convention & Visitors Bureau in November 2013. Under Darien’s leadership, the two organizations were merged into Visit Lake Geneva in 2016. Darien joined Visit Big Bear in 2017 as President & CEO to promote the resort community of Big Bear Lake, CA. In addition to growing tourism receipts by 83% in three years, Darien directed the purchase and renovation of a 5,000 sq. ft. building for a new Visitor Center and offices. Darien and his wife, Karen, moved to Pensacola in April of 2020 when he accepted the position of President & CEO for Visit Pensacola. Nicole Stacey Vice President of Destination Development Hometown: Fort Walton Beach, Florida Trendsetter. Coffee addict. Travel enthusiast Born and raised on the beaches of Northwest Florida, Nicole has an innate love for the Sunshine State, its pristine beaches, and the thrill of travel. Cultivating over 15 years of marketing and communications expertise, Stacey has over 20 years in the tourism and hospitality industry..... Send An Email Read Bio Born and raised on the beaches of Northwest Florida, Nicole has an innate love for the Sunshine State, its pristine beaches, and the thrill of travel. Cultivating over 15 years of marketing and communications expertise, Stacey has over 20 years in the tourism and hospitality industry. As Visit Pensacola's Vice President of Destination Development, Stacey leads the marketing and sales departments. She is responsible for identifying market opportunities, developing short- and long-term marketing and sales plans and strategies, directing all communications and public relations functions, and ensuring community-wide destination development investments increase and travel-related strategies are connected and aligned. Throughout her career, she has spearheaded numerous successful initiatives, marking significant achievements in the industry. Notable highlights include transforming Visit Pensacola's public relations efforts with out-of-market activations at prestigious events like the Country Music Awards in Nashville, Chicago Air and Water Show, several in-market television productions, and media-related opportunities in New York, Canada, and London, UK. Stacey has played a pivotal role in several multi-rebranding campaigns, including the development of Visit Pensacola's latest brand, \"The Way to Beach.\" Additionally, she has been an integral part of the evolved Tourism Works for Pensacola campaign—an initiative to communicate tourism's invaluable impact in Escambia County. Actively engaging with professional and travel industry associations and dedicated to the Pensacola community, Stacey serves as a Board Member for Destinations Florida and contributes to the Destinations International PR Task Force. Additionally, she is a part of the NWFL Beaches Coalition Brand Team. She has assumed several leadership roles over her tenure, such as Chairing the 2023 Leadership Pensacola Class, being Past President of the University of West Florida Alumni Association, Fiesta Pensacola Board of Governors, Florida Public Relations Assoc past president and state board member, and the Foo Foo Festival Curator to name a few. Recognized as a rising star by InWeekly in 2013 and honored with the 2022 Florida Public Relations Association Communicator of the Year award. Stacey was recently named the 2023 Emerging Leader for the Greater Pensacola Chamber PACE Awards. She takes pride in representing her community worldwide and showcasing Pensacola as a premier travel destination. The proud graduate of her master's degree in strategic communications and leadership and a B.A. in public relations and marketing from the University of West Florida – Go Argos! In her spare time, Nicole finds joy in her role as \"Auntie Coco,\" cherishing moments spent with family and friends, indulging in her community like a local should and booking her next plane ticket to fulfill her love and passion for travel and experiencing new places and cultures around the world. Wandy Samuel Director of Finance and Administration Hometown: Addis Ababa, Ethiopia Numbers guy. Super dad. Wandy entered the tourism industry in 2013 as a staff accountant for Premier Island Management Group... Send An Email Read Bio Wandy entered the tourism industry in 2013 as a staff accountant for Premier Island Management Group before joining the Visit Pensacola team in 2016. Previously, he served as the operations manager for Dollar Rent a Car of which he was responsible for effective and successful management of labor, productivity, quality control, safety measures and standard business operating procedures. He holds a degree in accounting from Pensacola Christian College.Outside of work, he enjoys spending time with his daughter. The two enjoy riding bikes, going shopping and Skyzone. He is an active member of Big Brothers Big Sisters of Northwest Florida. Kaya Man Director of Sales & Services Hometown: Kailua-Kona, Hawaii Fishin’ chick. Chef. Beach bum Kaya Man joined Visit Pensacola in 2018 as the Partner Relations Manager... Send An Email Read Bio Kaya Man joined Visit Pensacola in 2018 as the Partner Relations Manager. She was responsible for partnership development and maintenance for the organization. In 2021 promoted to Destination Sales Manager, serving as the sales representative to the group and leisure market to generate a positive economic impact for Escambia County. In 2023 promoted to Director of Sales and Service, overseeing all sales efforts in group, trade and leisure markets, partner relations and the visitor centers. She has also taken on the role as the Northwest Florida Beaches Sales Representative to the Council. Kaya brings over 20 years of hospitality experience to the Visit Pensacola team. Man spent the last eight years prior to joining the team, serving, managing, and the head trainer at The Grand Marlin on Pensacola Beach. Previously, she owned an event planning company and Elephant Seasoning, a catering and seasoning business started by her father. She holds a bachelor’s degree in restaurant and hospitality management from the Pensacola Junior College and University of West Florida. Man is actively involved in the community, serving as UWF Women in Leadership Conference hospitality co-chair, Sun Belt Conference Team host committee, Sea Grant Advisory Team, donating time to the Children’s hospital, served as the Greater Pensacola Tennis Ladies League captain for 8 years, and a part owner/ operations manager to Tighten up Tennis. Outside of the office, she enjoys cooking, playing tennis, fishing, traveling, and spending time at the beach with her family. Ashley Hendrickson Administration Assistant Hometown: Pace, FL Book connoisseur. Athletics enthusiast. Bonding aficionado Ashley joined Visit Pensacola in 2023 as the Administration Assistant... Send An Email Read Bio Ashley joined Visit Pensacola in 2023 as the Administration Assistant. She is responsible for coordinating calendars between Darien, Staff and the Board, various office projects, and all things related to board meetings. Bottomline, Ashley will ensure the office runs smoothly and cohesively. She has spent the last seven years in New York City, most recently as the Executive Assistant to the owners of Team Epiphany, a marketing and creative agency. Her strengths include project support, process improvement, relationship development, and strategic communication. A Pensacola native, Ashley is a graduate of The University of West Florida with a bachelor's degree in Organizational Communication and a minor in Hospitality. While she is not in the office, she finds joy in various hobbies such as reading, attending theatre performances, engaging in sports, and relishing the great outdoors. Lana Malaise Staff Accountant Hometown: Pensacola, FL Devoted and passionate Mom. Numbers gal. Concert lover. Lana Malaise joined Visit Pensacola in April of 2024 as the Staff Accountant. She is responsible for assisting the Director of Finance in the processing of all things accounting related to Visit Pensacola. Send An Email Read Bio Prior to joining our team, Lana worked in the private sector as a Bookkeeper and Accounting Manager in various businesses in various locations to include Kentucky, Illinois and Florida. Lana originally moved to Pensacola in 1978 when her family moved here as a duty station of her father’s at USN Saufley Field Base, Pensacola. Upon graduating from UWF in 1988 as one of the school’s first class of freshman in 1983, she began her career in accounting at various local CPA firms. She left the area in 1993 to move to central Kentucky and finally returned ‘home’ to Pensacola/Pace area in 2016 after expanding her family with four beautiful daughters. Lana considers her greatest accomplishment to being a Mom. In her spare time, she enjoys playing tennis, playing cards with her family, and enjoying listening to live music along the Gulf Coast as much as she has time to do. Marketing and Communications Shawn Brown Digital Marketing Manager Hometown: Gulf Breeze, Florida IT Guy. Outdoor Aficionado. Family Guy. As the digital marketing manager, Shawn Brown joined the Visit Pensacola team in 2013... Send An Email Read Bio Shawn Brown joined the Visit Pensacola team as the digital marketing manager in 2013. He is responsible for managing the website, assisting partners with listings and supporting internal team members. He is experienced in search engine optimization, creative design and data analysis. Before Visit Pensacola, Brown served as a webmaster for Cox Communications for 13 years. There, he developed applications for internal communications and focused on web design. After college, he was self-taught in web design, coding, and information technology. Shawn earned a bachelor’s in biblical studies from Calvary Chapel Bible College. A true outdoorsman, Shawn and his wife Lindy own Outdoor Gulf Coast, an adventure equipment rental company. In his spare time, he enjoys windsurfing, paddling, hiking and more. The two have two children, Sarah and Sam. Lindsey Steck Marketing & Communications Manager Hometown: Pensacola, Florida Experience chaser. Content curator. NFL buff Lindsey Steck joined the Visit Pensacola team in 2017 and is responsible for copywriting, writing for press, public relations... Send An Email Read Bio Lindsey Steck joined the Visit Pensacola team in 2017 and is responsible for copywriting, writing for press, public relations, integrated marketing, content curation and social media management. Prior to Visit Pensacola, Steck served as a corporate communications assistant for the Kansas City Chiefs where she served as a public relations contact for community outreach events. She was responsible for writing for press and publication, press conference facilitation, public relations, football communications support, assisting club executives and game day support. Throughout her time in college, she served in athletic communications as the public relations contact for men and women’s cross country and additionally assisted with 13 other sports. Steck began her journey in the tourism industry working for Florida House on Capitol Hill, the country’s only state embassy in Washington, D.C. There, she supported events, assisted administration and welcomed guests from across the globe. She holds a bachelor’s degree in communications with an emphasis in public relations from the University of West Florida. Outside of the office, Steck is actively involved in the community. She currently volunteers with Big Brothers Big Sisters of Northwest Florida, Junior League of Pensacola and serves on the Board of Directors for the Florida Public Relations Association. In her free time, you can find her scouring farmer’s markets, watching NFL football and working on her East Hill cottage. Elliott Cooper Digital and Creative Manager Hometown: Pensacola, Florida Gamer. Drone Flier. Digital Guy. Elliott Cooper joined Visit Pensacola in 2021 as the Digital & Creative Manager and is responsible for inhouse graphic and video creation... Send An Email Read Bio Elliott Cooper joined Visit Pensacola in 2021 as the Digital & Creative Manager and is responsible for inhouse graphic and video creation. Prior to Visit Pensacola, Elliott worked as a Digital Marketing Coordinator for Innisfree Hotels and Keep Pensacola Beautiful. Raised in Gulf Breeze, Elliott is a true local and spent most of his time growing up on Pensacola Beach. Elliott earned a bachelor's degree in communications from the University of West Florida. Elliott enjoys technology and loves tinkering with electronics and computers in his free time. He has two cats and two dogs and he loves taking the dogs on long walks on the nature trails around UWF. Blake Howerton Social Media & Content Associate Hometown: Pensacola, Florida Pensa-local. Creative being. Old soul. Blake Howerton joined Visit Pensacola in 2022 as the social media and content associate and is responsible for planning... Send An Email Read Bio Blake Howerton joined Visit Pensacola in 2022 as the social media and content associate and is responsible for planning, creating, and implementing social media content across eight platforms. Blake is a Pensacola native. After receiving a bachelor’s degree in communications with a focus in advertising from the University of North Florida in Jacksonville in 2018, Blake moved back home to begin his marketing career. Before joining the Visit Pensacola team, he served as the communications coordinator at Studer Family Entertainment & Retail for 3 years, and as the marketing and communications coordinator at Big Brothers Big Sisters of Northwest Florida for over a year. Blake has a passion for sharing Pensacola’s story with others. Off the clock, Blake enjoys photography, cooking, watching the sunset on the beach with his friends, and dining at Pensacola’s many restaurants. He is actively involved with Big Brothers Big Sisters of Northwest Florida serving on the Big Gala Committee. Hannah Pinson Website Associate Hometown: Navarre, Florida Sunset Lover. Ocean Enthusiast. Cat Mom. Hannah Pinson joined the Visit Pensacola team in 2023 as the Website Associate. She is responsible for creating and maintaining website content... Send An Email Read Bio Hannah Pinson joined the Visit Pensacola team in 2023 as the Website Associate. She is responsible for creating and maintaining website content, writing email newsletters, creating/editing blog posts, and more. Prior to Visit Pensacola, Pinson worked as an IT recruiter. She earned a Bachelor of Science in Information Technology and a minor in Marketing Applications from the University of West Florida. She has experience in software development, digital marketing, public relations, and content creation. Outside of work, she enjoys creating videos and taking photos. She also loves to shop, go to Disney World, hang out with family, and play with her two cats. A proud UWF Alum, Hannah serves on the UWF IT Alumni Advisory Board. Growing up in the Florida panhandle, she has a huge appreciation for the beach and will never pass up an opportunity to catch a good sunset or go for a swim in the Gulf. Sales & Services Melissa Bailey Partner Relations Manager Hometown: Pensacola, Florida Foodie. Optimist. Baseball Mom. Melissa Bailey joins the Visit Pensacola team with over 20 years of industry experience.... Send An Email Read Bio Melissa Bailey joins the Visit Pensacola team with over 20 years of industry experience. For the past 17 years, she has served Great Southern Restaurants as the director of catering and private events. With experience in both the front and back of house operations, she thrives in making connections with community partners and stakeholders. A native of Pensacola — and planning to stay that way by continuing to build roots with friends, family, and loyal customers, she is the perfect person to trust with your business needs. Tia Robbins Destination Sales Manager Hometown: Omaha, Nebraska Visionary. Connector. Boy Mom Tia Robbins joined the Visit Pensacola team as the Destination Sales Manager in February 2023.... Send An Email Read Bio Tia Robbins joined the Visit Pensacola team as the Destination Sales Manager in February 2023. In her role, she is responsible for facilitating leads and inquiries for group sales, attending trade shows, developing relationships with clients promoting Escambia County, and more. Prior to joining Visit Pensacola, Tia began her career in public relations and marketing in the music and entertainment industry in New York City. After relocating to the Pensacola area in 2012 she became deeply committed to, and passionate about serving the Pensacola community. In 2014, Robbins and her husband co-founded Mr. Robbins’ Neighborhood, a 501(c) 3 non-profit organization that serves underserved student athletes in Escambia and Santa Rosa Counties in Florida, by positioning, preparing and developing program participants for success beyond high school sports. In addition to working in the non-profit sector, Tia found a passion in entrepreneurship and supporting small businesses and in 2020 founded, Taste of Pensacola, LLC., a unique online gifting service that partners with local area makers and artisans to feature in a selection of curated and themed gift boxes. In her free time, Robbins enjoys traveling, being a sports mom, and making memories with her husband, Fred and two sons, Tre’ and Troi. Larry Orvis Facilities Manager Hometown: Pensacola, Florida Building gate keeper. Veteran. Bookworm Larry Orvis currently serves as the facilities manager for Visit Pensacola. He is responsible for building maintenance, beautification... Send An Email Read Bio Larry Orvis currently serves as the facilities manager for Visit Pensacola. He is responsible for building maintenance, beautification, and office management. Orvis joined the team in 1998 as a tourism ambassador and served for two years before moving into his current role. Prior to Visit Pensacola, Larry was a member of the U.S. Army for 28 years working in logistics. He retired to Pensacola in 1992 because he enjoys all of the activities. Outside of work, he enjoys reading. Jennifer Saba Sales and Services Associate Hometown : Hattiesburg, MS Boy Supermom. Holiday Extraordinaire. Steel Magnolia. Jennifer joined the team in December of 2024 as the Sales and Services Associate. Jennifer’s role is... Send An Email Read Bio Jennifer joined the team in December of 2024 as the Sales and Services Associate. Jennifer’s role is directly involved with destination sales, partner relations, organizing community tourism events, and more. Prior to joining Visit Pensacola, Jennifer served as the Executive Director of the Pensacola Mardi Gras Foundation, where she created impactful community experiences through PMG events. Before joining Pensacola Mardi Gras, Jennifer served as the Annual Giving Coordinator at the Ascension Sacred Heart Foundation, where she organized Pensacola's largest Mardi Gras Ball, the Cordova Mall Ball, successfully raising funds to benefit the Studer Family Children's Hospital. She also worked closely with Children’s Miracle Network Hospital initiatives, partners, and events. Before moving to Pensacola in 2015, Jennifer worked as a Marketing and Communication Specialist for Spirit of Women, coordinating events, marketing programs, and outreach campaigns. She mentored hundreds of teenage women, leading enrichment programs and creating community service opportunities. She was honored as the 2013 Junior Professional of the Year by the Mississippi Hospital Association’s Society for Health Care Marketing and Public Relations. Jennifer’s career has been centered around what she calls 'fun' work! She worked at Walt Disney World, gaining expertise in Resort Operations at Disney Vacation Club Resorts. She also served as a Program Leader, worked in Convention Services, became a Certified Disney Trainer, and was awarded the 'Cricket of the Quarter' Cast Member Excellence Award, along with numerous 'Great Service Fanatic' awards for outstanding guest service. During her time in Central Florida, Jennifer also worked with the Orlando Magic NBA Team, ensuring a top-tier experience for VIP season ticket holders. Jennifer is passionate about creating memorable experiences, fostering relationships, and having fun while doing so. With a minor in Tourism Management, she is excited to be fully immersed in the world of tourism and help showcase Pensacola. In her free time, Jennifer loves being with her family and embracing all the fun 'boy mom' adventures! Whether it's hanging out with loved ones and friends, enjoying our beautiful beaches, sipping a bushwhacker, traveling, or cheering from the T-ball field, she’s all about embracing the fun and joy life brings! She also treasures simple moments, like staying home, snuggling up, and watching movies with her boys. Visitor Services Debbie Keegan Tourism Ambassador Hometown: Atlanta, Georgia Estate Sale Guru. Dog Mom. Brunch-a-holic. Anita Spicer Tourism Ambassador Hometown: Montevallo, Alabama Rock painter. Flower lady. Sandcastle Builder. Michelle Schwaiger Tourism Ambassador Hometown : Pensacola, Florida Coffee Geek. Sea Life Painter. Avid Boater. Terri Hansell Tourism Ambassador Hometown: Dania Beach, Florida Foodie. Shell Collector. Gardening Buff. Adine Roberts Tourism Ambassador Hometown : Pensacola, Florida Grammie. Wordle Gamer. Crocheter. Paula Huntzinger Tourism Ambassador Hometown: Morristown, New Jersey Beach Lover. Dog Mom. Pensacola Explorer. Michelle Zwiers Tourism Ambassador Hometown: Big Rapids, Michigan KC Chiefs Fan. Retired Pre-K teacher. Thalassophile. Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Visit Pensacola 1401 E. Gregory Street Pensacola, Florida 32502 Visitor Center Locations Contact Us (800) 874-1234 enews@visitpensacola.com logo Request Guide Email Signup Blog Get the App Become A Partner Advertising Opportunities Partner Login Privacy Policy ©2025 Visit Pensacola Florida. All Rights Reserved. This website uses cookies to enhance your user experience on the website. Learn more. Accept Experience Builder Quick Search logo Expanded Search Location Map"
    },
    {
      "url": "https://www.cityofpensacola.com/2314/Contact-Us",
      "text": "Contact Us | City of Pensacola, Florida Official Website Skip to Main Content NATURAL GAS CUSTOMER IMPORTANT NOTICE OF SETTLEMENT: If you were a Natural Gas Customer after Aug. 5, 2011, you may be entitled to a refund of portions of your payments. CLICK HERE FOR MORE INFO ABOUT THE SETTLEMENT Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Search About Us Divisions Programs Records, Reports & Permits Press Releases Contact Us Home City Government Departments & Divisions Pensacola Police Department Contact Us Contact Us If you have an emergency, call 911. Location: 711 North Hayne Street Pensacola, Florida 32501 Departments: Desk Sergeant / Information 850-435-1900 Administration 850-435-1855 Investigations 850-435-1965 Uniform Patrol 850-435-1950 Internal Affairs 850-435-1865 Training and Accreditation 850-435-1960 Recruiting 850-436-5405 Communications / Dispatch 850-435-1845 Records 850-435-1915 Traffic Investigations and Funeral Escorts 850-435-1945 Evidence and Property Management 850-435-1935 Public Information Officer 850-393-1633 Crime Scene 850-435-1940 Crime Data Analyst 850-435-1997 Technology Resources 850-436-5407 Personnel: Kristin Brown Acting Chief of Police Kevin Christman Deputy Chief of Police James Reese Captain, Criminal Investigations Division Matt Coverdale Captain, Uniform Patrol Division Erik Goss Captain, Community Outreach Division Alex Fox Lieutenant, Criminal Investigations Division Jud Fillingim Lieutenant, Training and Accreditation Chad Willhite Lieutenant, Internal Affairs Pat Bradley Lieutenant, Community Outreach Division Shawn Thompson Lieutenant, Special Investigations Unit Mike Wood Public Information Officer Michael Ozburn Technology Resources City of Pensacola Webmaster About Us Careers FAQ Photo Gallery History of the Pensacola Police Department Officer Memorial Mission, Vision, and Core Values Divisions Administration Deputy Police Chief Kevin Christman Captain Matthew Coverdale Budget, Finance and Payroll Code Enforcement City Code Code Enforcement Beat Map Code Enforcement Case Map Case Map (with gateway streets highlighted) Code Enforcement Staff Report a Code Enforcement Issue Internal Affairs Operational Support Captain Kristin Brown Communications/ Dispatch Property Management Records Public Information Office Accreditation / Personnel Training Criminal Investigations Captain James Reese Crime Scene Detective Bureau Special Investigations Unit Uniform Patrol Division Crisis Negotiation Team SWAT Team Uniform Patrol Unmanned Aircraft Systems Community Outreach Division Captain Erik Goss K-9 Unit Neighborhood Services Unit Pensacola International Airport School Resource Officers Traffic Unit Community Response Team Community Response Data Commendation Form Programs Anonymous Tips Citizen Complaint Form Business Emergency Contact Form Citizens Police Academy Crime Reports Law Enforcement Trust Funds Obtain Crash Report Online Report Underage Drinking Road Incident Map Take Me Home Program Useful Links Victim / Witness Services Chaplin Program Project ChildSafe Gulf Coast Crime Stoppers Crime Prevention Through Environmental Design Neighborhood Watch Program Records, Reports & Permits File Report Records Record’s Service Fees Background Checks Police Public Records Requests Submit a Police Public Records Request Reports Crash Reports Self-Reporting Obtain a Crash Report in Person Obtain Crash Report Online Offense Reports Online Police Reports PPD General Orders / Rules and Regulations Pensacola Police Dept. General Orders/Rules and Regulations Victim / Witness Services Public Crime Data Crime Data Press Releases Archived Press Releases Contact Us Pay Your Bill Pensacola 311 Jobs Permitting Parks & Rec Events Sunshine Center Live Video Park Pensacola Contact Us 222 W Main Street Pensacola, FL 32502 Main: 850-435-1603 Phone: 311 or 850-436-5555 Fax: 850-435-1611 TTY/D: 850-435-1666 Staff Directory Quick Links Home Office of the Mayor City Council Departments & Divisions Employment Opportunities Capital Improvements Dashboard /QuickLinks.aspx Stay Connected Calendar of Events Newsroom Sign up for notifications Sign up for the city newsletter Join us on social media Employee Online Services /QuickLinks.aspx Site Links Site Map Flooding & Hurricane Preparedness ADA Accessibility Information Employee Portal Title VI and Nondiscrimination Information Webmaster Info My Dashboard /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.pensacolacountryclub.com/meet-the-staff",
      "text": "Meet Our Team - Pensacola Country Club Drop Down Navigation Home About Our Club Club History Meet Our Team Contact Club Amenities Golf Golf Course Golf Instruction Meet Our Team Annual Calendar LGA Tennis Tennis Facility Meet Our Team Dining Menus Youth Aquatics Fitness Membership Wedding & Events Guest Information Menu Home About Our Club Club History Meet Our Team Contact Club Amenities Golf Golf Course Golf Instruction Meet Our Team Annual Calendar LGA Tennis Tennis Facility Meet Our Team Dining Menus Youth Aquatics Fitness Membership Wedding & Events Guest Information Member Login HTML Generator Meet Our Team Side Navigation Our Club Club History Meet Our Team Contact Our Club Club History Meet Our Team Contact Meet Our Team Meet Your Team Maggie Bleau, Director of Membership & Marketing Maggie Bleau joined Pensacola Country Club as the Director of Membership & Marketing in December 2024. From Maggie: \"I started my career in hospitality and the Marriott brand, from there I moved into private clubs at the Union League Club of Chicago as a Business Development Manager just about a decade ago.  It was in this role that I began to craft my skill set. The General Manager trained me to understand what it is to belong to a private club to sell memberships. For ninety days he had me mirror members, have conversations with every department head and many members, learn the storytelling, and know the history of the ULCC. I did regular tours of the clubhouse with the Director of the Art Collection to learn the artists and works we had. I could speak to every corner of the clubhouse. It was in this position that I knew I wanted to be more than a manager. I am a passionate leader that thrives on connecting people. I have successfully reopened an athletic club after a three-year delay in renovations; I have learned how to gracefully sell a club with two campuses and golf at two different country clubs. I am eager to meet you all and grow and engage the membership.\" Contact Maggie at [email protected] . Chris McCullar, Director of Racquets Chris McCullar is currently serving in his 20th year as the Director of Tennis at Pensacola Country Club. He has great passion for all of the programs offered at Pensacola Country Club, with Junior programming always being extremely active. Before his time in Pensacola, Chris was the Director of Tennis at The Club at Rock Creek in Fairhope, AL, where he developed the junior program into one of the best in the state. Chris attended Rhodes College in Memphis, TN, where he received his Bachelor of Arts and played #1 singles and doubles for three of his four collegiate years. He is also a formerly nationally ranked junior player, and formerly ranked #1 in the state of Alabama. Chris has a wife, Wendy and three children, Will, Max and Jackson. Contact Chris at [email protected] . Jennifer Naar, Events Coordinator Jennifer Naar is a Pensacola native and has served our Membership on our F&B Team since 2019. Having owned her own wedding planning and event details business since 2010, Jennifer has used her creativity and drive to help make each event memorable for all in attendance and has been a part of thousands of events locally over the last decade. She is excited to be the Events Coordinator at PCC and looks forward to putting on many beautiful and successful events. Contact Jennifer at [email protected] . Andrew Boston, Director of Golf Andrew joined the Pensacola Country Club staff in April of 2023 as the Director of Golf. Andrew attended high school in State College, Pennsylvania before graduating from the Professional Golf Management Program at Coastal Carolina University. Since graduating, he has spent time working at facilities such as Cherry Hills Country Club, Sea Island Golf Club, Ocean Forest Golf Club and, most recently, as the Head Golf Professional at the Old Town Club in Winston-Salem, North Carolina. He and his wife, Danielle, a former golf professional herself, have a son, Archer. They enjoy spending time exploring new restaurants, visiting the beach and playing golf together. Contact Andrew at [email protected] . Alex Marshall, Director of Greens & Grounds Alex joined the Pensacola Country Club team in December of 2023 as the Director of Greens & Grounds. Alex is a native of the Mississippi coast where he graduated high school. After a junior college baseball stint, Alex received his Bachelor of Science degree with a concentration in Golf and Sports Turf Management from Mississippi State University. Alex interned at facilities such as Fallen Oak, Old Waverly, and The Preserve Golf Club while getting his degree. Upon graduating, Alex spent 2016-2022 as an assistant superintendent at Old Overton Club. Alex and his wife, Taylor, moved to Gulf Breeze in January of 2022 for Alex to pursue the Superintendent role at Tiger Point Golf Club. Alex and Taylor have a daughter, Holly, who enjoys time at the beach, zoo, and long walks with her spaniels. Contact Alex at [email protected] . Bill Hewett, Executive Chef Chef Bill Hewett joined the Pensacola Country Club team in June 2024 relocating from Naples, Florida where he worked as Chef de Cuisine at Grey Oaks Country Club and Executive Chef at Cedar Hammock Golf and Country Club. He is a member of the American Culinary Federation and has over 25 years of culinary experience. After graduating from Johnson and Wales with a Degree in Culinary arts, he moved to Atlanta, Georgia where his past work experience included Cherokee Town and Country Club, Executive Chef at Augusta Country Club, Chef/Owner of Atlanta Culinary Concepts and Chef Instructor at Art Institute of Atlanta and Le Cordon Bleu, where he taught a variety of classes including cooking fundamentals, garde manger, international cuisines, American regional, catering and buffet courses. Bill is excited about joining the PCC team and looks forward to having a positive impact on the Culinary Program. Contact Chef Bill at [email protected] . Audrey Davida Thompson, Youth Director | Pool & Cabana Manager Audrey began working at Pensacola Country Club as the Assistant Pool & Cabana Manager in Spring of 2013, taking on the role of Youth Director in the fall of 2015. With more than 30 years of experience in the service industry and an equal number of years' experience working with children on a personal and a volunteer level, Audrey has involved herself with programs including the Junior Chamber of Commerce, CASA, Underprivileged Children's Christmas Charities, Farley Community Church VBS, and the Ronald McDonald House Charities. Audrey makes it a personal commitment to ensure that every child that comes to the Club has an enjoyable and memorable experience, and she takes great pride in watching our Club’s youth grow and flourish through these experiences. Audrey has four grown boys aged 36, 34, 32 and 25, and has one grandson whom she adores. For enjoyment, Audrey spends time on the water kayaking and sailing, learning to speak French, as well as exploring Pensacola on her bicycle. Contact Audrey at [email protected] . Jennifer Jens, BeachLIFE Fitness Coordinator Jennifer Jens is the owner and coordinator of BeachLIFE Fitness. Jennifer and her BeachLIFE Fitness team have tought fitness classes at Pensacola Country Club for almost a year with programs tailored to an array of interests and age groups. Jennifer received her BS in Exercise Science from Gonzaga University. She has recieved certifications in the following: ACSM Certified Personal Trainer; AFAA & NASM Group Fitness; YogaFit Hatha Yoga Instructor; Spinning Certified; Certified Children’s Coach; Registered DoD Contractor. Jennifer is now a Mom of 2 and US Airforce Wife with18 Years of Experience in Health and Fitness Industry. Contact Jenn at [email protected] . Josie Ynfante, Communications Director Josie is a Pensacola native who began working at Pensacola Country Club in 2018 on the Food & Beverage team while attending the University of West Florida for Marketing & Communications. She has since worked in various departments around the club from the pool, to the tennis center, to the front desk and more, gaining an understanding of all aspects of the club. Before coming back full time to serve as Communications Director in 2022, Josie also worked with the Studer Family of Companies. Josie is passionate about solving problems and developing creative and informative content to keep members and staff well-informed. In her free time, Josie enjoys spending time with her pets and husband, doing outdoor activities, and making art. Contact Josie at [email protected] . Mark Cooper, Building Superintendent Mark Cooper joined the Pensacola Country Club team in 2014 and has over 50 years of experience in the maintenance field, with a background in Electrical and AC maintenance. He worked in the building maintenance department at The Veranda of Pensacola and as a maintenance supervisor for local property managers. Mark retired from General Motors with 34 years of seniority in 2009 as a Job Setter/ Team Leader. He moved from the Ann Arbor / Detroit area to Pensacola in 2011 and resides in Milton with his wife, Teresa, and their spoiled pets. Contact Mark at [email protected] . Chance Caylor, Lead Assistant Superintendent ﻿Chance joined PCC as the Lead Assistant Superintendent in 2024 after starting his career at Ross Bridge of the Robert Trent Jones Golf Trail. He is an Auburn, Alabama native and supports anything involving the Auburn Tigers. Chance graduated from the University of West Alabama, and was a four-year letterman on the golf team. When he’s not on the golf course, whether working or playing, Chance and his wife, Devin, enjoy spending time with their dogs, cooking new foods, and being with friends. Lucas Pedrotti, Assistant Tennis Pro Lucas is originally from Caxias do Sul, Brazil where he was ranked the #1 player in his state and a top 20 player nationally. He came to the United States to play at Bloomberg University in Pennsylvania where he played 2 years at #1 singles and doubles and earned first team PSAC Conference Honors. He finished his playing career at the University of West Florida where he earned his degree in Finance in 2021. Lucas began his coaching career in 2016 in Brazil where he worked with low-income children teaching the game of tennis. He has worked locally at both the RG Tennis Academy in Pensacola and most recently at Shoreline Tennis Center in Gulf Breeze. Lucas brings an infectious positivity to his tennis instruction, and we are very excited about him being a member of our team. PENSACOLA COUNTRY CLUB 1500 Bayshore Drive,\r\n\t\t\t\t\t\t\t\t\t\t\t\tPensacola, Florida 32507 Contact (850) 455-7364 [email protected] Follow Us Copyright © Pensacola Country Club All Rights Reserved. Powered by Northstar Technologies Member Login"
    },
    {
      "url": "https://www.pnj.com/story/news/2020/02/26/visit-pensacola-taps-pamela-johnson-fort-myers-visitor-bureau-ceo/4879122002/",
      "text": "Visit Pensacola taps Pamela Johnson with Fort Myers visitor bureau for CEO News Sports Play Opinion Advertise Obituaries eNewspaper Legals NEWS Visit Pensacola taps Pamela Johnson with Fort Myers visitor bureau as next CEO Madison Arnold Pensacola News Journal The new leader of Visit Pensacola will likely be one with 25 years of beach tourism experience. The tourism organization's board of directors voted Wednesday to accept the recommendation of a search committee to hire Pamela Johnson, the deputy director of the Lee County Visitor and Convention Bureau in Fort Myers, as its new president and CEO. Visit Pensacola will now begin contract negotiations with Johnson, and the contract will have to ultimately come back before the board for final approval. If eventually hired, Johnson will be at the helm of an organization with a fiscal year 2020 budget of $6,937,151 and will be tasked with promoting tourism, one of the area's biggest economic drivers that brings more than 16,000 jobs to the area. The other finalist for the position was Darien Schaefer, CEO of Visit Big Bear in Big Bear Lake, California. Both he and Johnson had final interviews at the beginning of the week. Search committee members pointed to Johnson's experience in beach communities, the state's public records laws and knowledge of Florida tourism among the reasons for their selection. She helped manage a budget of $14 million and has plenty of experience in a community with airport travel. Other stakeholders, including elected officials and staff with the Pensacola International Airport and with Visit Pensacola, also supported the choice of Johnson, said DC Reeves, chair of the search committee, during the search committee selection meeting. \"Pamela (Johnson) comes from a larger market that's within the state of Florida,\" Reeves said. \"Certainly her familiarity with the state of Florida, both in (tourism development tax) and when it gets technical, but also just what her name recognition and reputation is within the state of Florida ... .\" Johnson started as deputy director for her current organization in 2014. She's also worked as the director of sales and marketing as well as a sales and marketing manager for the same organization, first starting in 1995. Her other role has been as the interim director and deputy director of Lee County Economic Development since 2017. The Visit Pensacola position opened after Steve Hayes, the previous president and CEO, left for a similar position at Visit St. Pete/Clearwater in Pinellas County. Since then, Jack Brown, former Escambia County administrator, has been serving as interim president. More tourism coverage ► More taxes: Should Escambia County raise its hotel tax? Commissioners say yes, but with a caveat ► New reef: New artificial snorkeling reef coming to Pensacola Beach this summer ► Big honors: Tripadvisor places Pensacola Beach in top 25 U.S. beaches of 2020 list During its meeting immediately before the board's, the search committee recommended the board move forward with the negotiation process with Johnson. If the board ultimately is unsuccessful in hiring Johnson, the committee recommended the board attempt to negotiate to hire Schaefer. \"The thing that started any feedback — whether it was a committee member, somebody in the community, somebody on staff — it almost always started with, 'Man, these are two really good candidates,' or 'I could see us having either one,' and anybody who's ever hired anybody, that's not always the case,\" Reeves said. During her interview Tuesday, Johnson told the News Journal that her experience helps her understand the environmental concerns of a coastal community and how to navigate between resident and visitor needs. \"The issues with our coastline — for example, we've experienced in our area red tide and algal blooms — make a beach community vulnerable, too,\" Johnson said. \"If you're having problems, challenges, any issues with water, then obviously that's going to be in the spotlight. You kind of go into a crisis management mode on that.\" Madison Arnold can be reached at marnold@pnj.com and 850-435-8522. About Us Staff Directory Corrections Careers Accessibility Support Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Businesses Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Mobile Apps Facebook X eNewspaper Archives Jobs Real Estate Classifieds Education Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.pnj.com. All rights reserved."
    },
    {
      "url": "https://lithub.com/we-play-ourselves/",
      "text": "We Play Ourselves ‹ Literary  Hub Craft and Criticism Fiction and Poetry News and Culture Lit Hub Radio Reading Lists Book Marks CrimeReads About Log In Literary Hub Craft and Criticism Literary Criticism Craft and Advice In Conversation On Translation Fiction and Poetry Short Story From the Novel Poem News and Culture History Science Politics Biography Memoir Food Technology Bookstores and Libraries Film and TV Travel Music Art and Photography The Hub Style Design Sports Freeman’s The Virtual Book Channel Lit Hub Radio The Lit Hub Podcast The Critic and Her Publics Awakeners Fiction/Non/Fiction I’m a Writer But Windham-Campbell Prizes Podcast Memoir Nation First Draft: A Dialogue on Writing Behind the Mic Lit Century Tor Presents: Voyage Into Genre Beyond the Page The Cosmic Library Emergence Magazine Talk Easy Reading Lists The Best of the Decade Book Marks Best Reviewed Books CrimeReads True Crime The Daily Thrill Log In Excerpt We Play Ourselves Jen Silverman February 5, 2021 Share: Share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Google+ (Opens in new window) More Click to share on LinkedIn (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on Tumblr (Opens in new window) Click to share on Pinterest (Opens in new window) Click to share on Pocket (Opens in new window) The following is excerpted from Jen Silverman's debut novel, We Play Ourselves , about a young writer who flees to the West Coast, where she is drawn into the morally ambiguous orbit of a charismatic filmmaker and the teenage girls who are her next subjects. Silverman is the author of the story collection The Island Dwellers , which was longlisted for a PEN/Robert W. Bingham Prize for debut fiction. Her plays have been produced across the U.S. and internationally, and she also writes for television and film. My first week in L.A. is long and strange—simultaneously a repeat of certain basic activities (wake up, make coffee, drink it on the patio, check email, shower in the light-filled downstairs bathroom) and a barrage of smells and shapes that I have no context for. Fruit trees so overburdened with fruit that the sidewalks are littered with it; big squashy-blossomed shrubs; armor-plated cacti; homeless encampments comprised of dust-encrusted outdoor tents, shopping carts piled high with garbage bags. Article continues after advertisement Remove Ads In New York it gets too cold to be outside all the time, you can’t build yourself a city of tents and shopping carts. In L.A., whole private lives are happening in public spaces: cooking, sleeping, laughing, talking, hanging out laundry, reading battered paperbacks. The homeless people ignore me and I try to ignore them, but part of me feels like they’re ignoring me because they’ve all heard about me, and they’re signaling to each other: Don’t look at her, failure like that is contagious. Daniel isn’t around in the daytime. I learn from Dylan that he works a regular nine-to-five for a company doing something called “risk management.” I don’t know what risk management is, other than a tidy summation of everything I’m bad at. Dylan was an English major in college, which means that he works at a restaurant in Los Feliz. But the thing that Dylan really devotes himself to, with the determination that other people bring to their jobs, is lounging. He’s always in the sun on the patio with his shirt off, throwing his surfboard into the back of the van, returning from the beach with his wetsuit peeled down to his hip bones and his shaggy hair damp and salt crusted. I gather that this—like the cigarettes—is a subject of contention between the two of them. It seems that there are a number of these, but I have entered at a time of tenuous détente, so I try not to ask questions that they will then have to try not to answer. This is a state of affairs with which I’m well acquainted. On the afternoon of my third day, I call my agent. Before I left New York, Marisa had said, “Don’t call me again,” in the same conversation in which she’d used the phrase “appalling and unprofessional.” I think it was also the conversation in which she said something about me being lucky I wasn’t getting sued, and also something about this sort of bad-boy behavior not being cute anymore post–Sam Shepard. I don’t remember the conversation entirely, because I was drunk at the time—I hadn’t planned to be, I had only happened to be drinking heavily when Marisa decided to call me back. And now that it’s already sort of fuzzy, I try to maintain as much fuzziness as possible, because I can’t be responsible for knowing I don’t remember. Maybe in the light of day, in the light of L.A., we can have a new conversation. America loves a comeback story. Think of Britney. I know I’ve only been gone a few days, but who says how long you have to be gone before you’re ready to come back? Article continues after advertisement Remove Ads So I call Marisa. Her assistant picks up immediately: “Creative Content Associates, how may I help you?” “Hey,” I say, trying to sound very casual. “Uh, is Marisa in?” “Who’s calling, please?” “It’s Cass.” In New York it gets too cold to be outside all the time, you can’t build yourself a city of tents and shopping carts. And: a beat, wherein the assistant tries to figure out what to do. Here is what you need to know about this assistant: Jocelyn / twenty-two / ironic polka dots / parents on the UWS / scarlet lipstick / first job out of Barnard. Article continues after advertisement Remove Ads After a moment, Jocelyn says, her tone slightly cooler: “One moment, please, let me see if I have her.” This means: She’s here, but which will she kill me for: hanging up on you, or transferring you over? Silence, and then Jocelyn returns. “I’m so sorry, I don’t have her at the moment. Can we return?” “Yeah, please . . . uh, return.” “Okay, thank you so much for calling.” Jocelyn is about to hang up when I hear myself blurt: “I moved to L.A., will you let her know that I moved to L.A.?” Article continues after advertisement Remove Ads Jocelyn draws breath, but before she can answer, I amend my request: “Actually don’t say I moved, just tell her I’m in L.A.” “Okay,” Jocelyn says. “Well, thank you—” “—and tell her I don’t remember what she—on the phone, what she said? What we said? So if she thinks I remember all of it, maybe tell her that actually isn’t the case, so I’d love to sort of . . . reconnect and reexamine . . . Hello?” Click. Jocelyn and her scarlet lipstick have hung up. * Article continues after advertisement Remove Ads The Lansing Award was what put me on the radar. And it went like this. Pre-Lansing, I was nobody. I grew up in small-town New Hampshire, went to a college that was affordable instead of fancy, and moved to New York, where I was immediately broke as balls. I paid my bills by grant writing, dog walking, and cater-waitering, in various combinations. I made weird downtown plays and got my friends to put them up in black-box theatres, basements, or found spaces. I had an unshakable conviction that someday I would hit the “tipping point” (this was something a psychic on West Fourth once told me), after which my career would take off. Everything up to the tipping point would be the story I could tell once things had worked out. My unshakable conviction could be seen as either ambition or delusion, depending who you were (the psychic referred to it as a calling), but either way, it made it easier to work three jobs and self-produce experimental plays. And then one day, in my tenth year of this New York life, a man called and told me I’d won fifty thousand dollars and I had to show up to the Harvard Club for a ceremony, after which I could collect it. At first I thought this was a scam, but the man kept going. He told me that it was an inaugural award for emerging playwrights. Two others had also won, and he named them, so I googled them. Tara-Jean Slater was finishing her last year of undergrad at Yale, and she seemed to have already won most of the awards that Yale itself had to offer. In the pictures, she looked very young and blank, and pretty in a prepubescent way. Carter Maxwell was straight out of grad school at Juilliard (he’d done his undergrad at Yale), and his mother was an accomplished interior designer on the Upper East Side. He had recently attended his sister’s wedding in Hyannis Port, and he looked dashing in a suit—both in the wedding pictures and in a recent New York Times profile that called him “possibly the next Arthur Miller.” The Lansing Award was what put me on the radar. And it went like this. Pre-Lansing, I was nobody. I called my roommate at work and asked if I could borrow his suit. Nico was taller than me, but equally skinny. We’d lived together for the last four years, and neither of us were ever home, which made our situation work well. Nico was a choreographer. His dad was from El Salvador, his mom was a New York Jew, and both were musicians. Although they’d divorced while he was young, they still lived down the street from each other in Berkeley, and regularly reconvened for family Thanksgiving. Nico was well-adjusted in a way that defied belief; he did his laundry weekly, he saved money, he paid his taxes on time, and he was always lending me clothes. The day of the ceremony, I borrowed Nico’s blue suit jacket and I put it over skinny black jeans and black Chucks, and I took the subway from 168th Street down to Forty-fourth, then walked east toward Fifth Avenue. I walked around the block three or four times before I got up the courage to go in. After the final lap, I took a deep breath, held it until I felt a little high, and then marched over to the entrance. A woman with a clipboard got my name: “Oh! You’re one of the honorees! There’s a table over there, please get your name tag and then, if you wouldn’t mind, there’s a step-and-repeat by the—” I didn’t make it to either the name tag table or the step-and-repeat. There were crowds. There were cocktails. Open bar. Small glasses of wine circulating on trays. I’d fallen into a blur of dark wood and elegant fabric and chardonnay. I realized that nobody was wearing what I was wearing. I realized that everyone had a plus-one, and I should have brought Nico as well as his suit. I caught a glimpse of Carter Maxwell, who had a girl in a silk dress on his arm. Carter was shaking hands with a series of older men, also in suits, and saying things like “Such a pleasure” and “You know, that’s a good question” and “Well, thank you sir, I appreciate that” and “Very recently, but it’s nice to be out of school.” He held his drink effortlessly, and when the time came to put the empty glasses on a tray and receive another drink, he did that effortlessly as well. I was having trouble just standing in the room. It seemed that either everybody was staring at me or I was completely invisible. I had wanted this forever, to be in a room like this, and now that I was here, I felt light-headed and nauseous. Eventually I stumbled down a series of hallways and a woman pointed me to the ladies’ room, where I hid in a stall and texted Nico. I said: This is awful, I’m gonna puke. Nico said: Get that monayyy. Nico in person is innate elegance, but Nico over text is a whole different story. I said: Nobody is talking to me I think maybe I’m dead and/ or dreaming this I dunno how to get the food off the trays like, with your fingers? or like also nobody is wearing jeans Carter’s girlfriend looks expensive Can I go home early do you think? Nico said: This is your TIME to SHINE. I said: I’m gonna puke on your suit. Nico said: Get my money get my cash get my math everything’s funny til that ass gettin trashed—which I stared at for a few minutes, trying to decipher, until I realized it was Nicki Minaj lyrics. I exited the bathroom stall, flagged down a caterer, and drank two glasses of wine in the span of ten minutes, and a relaxed curiosity unspooled itself inside me. I bobbed along, now just a pair of eyes. If people glanced at me, I looked back, friendly but noncommittal. Carter was near the bar now. He was laughing as a middle-aged man slapped him jocularly on the back—I couldn’t hear them, but I could tell that he was deflecting a compliment with expertise. His girlfriend had clearly gotten tired of this; her mouth was fixed in a smile, but her eyes had traveled over their heads, across the crowd, out and away. Her heels were hurting and the room was hot, and Carter was no longer introducing her to people, because they were happening to him so fast he didn’t even know their names. He didn’t seem overwhelmed or nervous, though. Maybe he’d always expected to be in a situation where he was being rewarded for his promise, and so he was prepared. I had imagined a Big Break for so long but hadn’t known that it would have the power to undo me when it arrived. I didn’t make it to either the name tag table or the step-and-repeat. There were crowds. There were cocktails. Open bar. Small glasses of wine circulating on trays. I drifted over to the bar. Carter glanced up, took me in. “You must be Cass,” he said. I glanced down at the front of Nico’s jacket, found it blank, and then remembered I’d never visited the name tag table. “How’d you know?” “You look like a Cass,” Carter deadpanned, and then he grinned. “I googled you.” “You did?” “Yeah, I’d never heard of you.” He said it like it could be either an insult or a compliment. “I’d never heard of you either,” I said. Carter grinned again. “Congrats are in order for all of us,” he said. “We’re emerging.” He lifted his glass, then saw I didn’t have one. The bartender was at the other end of the bar, a situation that had baffled me—does one wave a hand in an establishment like this? Do you shout louder than the ambient noise?—but Carter reached out languidly and snagged a glass of white wine off a passing tray that I hadn’t even clocked. He sniffed it, shrugged, handed it to me. “Bad pinot, I think? Cheers.” We toasted, we drank. I studied Carter over my wineglass. The room had gotten overfilled, and you had to lean in and yell to be heard. He was scanning the crowd with mild interest, but he included me in it—“Oh, Playbill is here.” And then a moment later, “Oh, Tony Kushner is here.” And then: “Oh, Marsha Norman is here.” I risked a glance at the room, but it threatened to become a blurred mass again, so I focused on my glass. “Have you met Tara-Jean Slater yet?” Carter asked. “No,” I said. “Me neither, but I’m looking forward to it. I keep hearing about her.” “You do?” “Yeah, she’s like—a big deal in New Haven.” Carter laughed. “The Yale network, you know.” I didn’t know. Instead, I asked: “How does this kind of thing go?” Carter glanced at me. “You mean like big picture? You should talk to your agent about that.” “No, I mean, like—right now. Like, what’s gonna happen?” Carter shrugged. “There’ll be a bunch of speeches, then we go up and say some words, and they give us a check.” He turned to scout out the far corner for more people of note, then turned back to me: “You’ve done this before, it’s like all of them.” “I haven’t,” I said. “Actually.” We toasted, we drank. I studied Carter over my wineglass. The room had gotten overfilled, and you had to lean in and yell to be heard. “Done this before?” “Yeah.” “Oh.” Carter seemed surprised. “I just figured . . . you know, people usually win things because they won other things.” “I’ve never won anything in my life,” I said. “Oh.” Carter gave me his attention in a real way now. “Who’s your agent?” “I don’t have one.” Now Carter was really staring. “Like, you’re between agencies?” “I never got one.” I shrugged. “I’ve been—you know, doing stuff downtown.” Carter opened his mouth, but then his girlfriend appeared, smelling floral, and I let the crowd swallow me back up. I wasn’t sure whether I felt ashamed for not having and knowing the things Carter seemed to have and know, or whether I felt floaty and warm and like I didn’t give a fuck. The fourth glass of wine was nudging me much closer to floaty and warm, and I was contemplating a fifth when the crowd started moving en masse toward the hall and into a different room, as if they’d all heard a whistle that I couldn’t hear. The ceremony itself was what Carter had predicted. I don’t remember much of it, because floaty and warm turned into definitively drunk. I didn’t absorb what was said about us in the speeches either, but later I looked it up. Carter had won because of his raw and authentic dissection of male-female relationships and his insights into how masculinity functions within shifting power dynamics. I was selected as a promising female voice, a young woman telling comedic and timely stories about young women. And Tara-Jean Slater . . . I’m not ready to talk about Tara-Jean Slater. We were called to the front one by one. Carter talked for a while. I remember watching his girlfriend unobtrusively check her phone a few times, before he walked offstage to thunderous applause. When he reached his seat beside her, she was beaming at him as if she’d been hanging on every word. My memory of seeing Tara-Jean Slater for the first time is blurry. She was wearing velvet overalls and yellow shoes, and her hair was in two tight pigtails the color of rust. She had a very tiny, very clear voice, like a thimbleful of water. Sometimes I wish I could remember what she’d said, but I was drunk, and I didn’t know she mattered. The ceremony itself was what Carter had predicted. I don’t remember much of it, because floaty and warm turned into definitively drunk. Someone told me later that when my name was called, I walked to the front of the room, blinked at them all owlishly, said, “Thank you,” and then walked back to my seat, completely forgetting to collect the check. One of the facilitators had to chase me down the aisle and hand it to me. I don’t remember this, but I do remember that I passed Carter after the ceremony ended, and he gave me a thumbs-up and said, “Short and sweet.” I went home and fell into bed. Woke up hungover and couldn’t remember why for a few minutes, until I found Nico’s suit jacket on my floor with a check for fifty thousand dollars in the pocket. I went to the bank, deposited it, paid my rent, and then after brief thought, paid the next month in advance. Brought Nico’s jacket to the cleaners, met him for burritos to soak up the remaining toxins. By the time I’d made it back to our apartment, my hangover was fading and the Lansing Award ceremony seemed like it had happened years ago. The next day there were pictures of me on Playbill and on TheaterMania and in the Times. I googled myself and there I was: fragmented into frame after frame, intoxicatingly real, rendered tangible by public success. In all the photos, I looked startled, like an animal on the highway at night; Nico’s jacket was big on me, and the powder blue stood out oddly against everyone else’s sleek grays and elegant blacks. I’d never won anything like that before. I hadn’t even won spelling bees in middle school. I had assumed that someday I might win something and it would be nice, but this sensation was to “nice” as “amphetamine-fueled bender” is to “party.” I started to read all the good things being said about me online, and I felt that they must be true, and I was dazzled by how talented I had been this whole time. Despite the many years of uncertainty, despite all the dog walking and downtown-low-budget-play making, I had actually been the insightfully comedic voice of my generation. I read about myself for hours, long into the afternoon, and when I thought to check my phone, I saw that Dylan had texted me Whoa fancy , and my mother had texted me What is a Lansing Award? and Nico had texted me, from the next room, Nice suit jacket where’d you get it , and the next day Marisa called me, asking me to meet with her, and then the day after that I had an agent and a reputation and a career. __________________________________ Excerpted from We Play Ourselves by Jen Silverman. Excerpted with the permission of Random House. Copyright © 2021 by Jen Silverman. Previous Article On the Unconventional 19th-Century Women Who Ventured to Write Novels Next Article Lit Hub Daily: February 5, 2021 Daily Fiction Jen Silverman lit hub daily excerpts lit hub excerpts Random House We Play Ourselves Share: Share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Google+ (Opens in new window) More Click to share on LinkedIn (Opens in new window) Click to share on Reddit (Opens in new window) Click to share on Tumblr (Opens in new window) Click to share on Pinterest (Opens in new window) Click to share on Pocket (Opens in new window) More Story On the Unconventional 19th-Century Women Who Ventured to Write Novels Women make progress in times of change, when the old certainties break down and create cracks and fissures in the monoliths... RSS RSS - Posts Literary Hub Created by Grove Atlantic and Electric Literature Masthead About Sign Up For Our Newsletters How to Pitch Lit Hub Advertisers: Contact Us Privacy Policy Support Lit Hub - Become A Member © LitHub Back to top ✕ We Need Your Help: Become a Lit Hub Supporting Member Lit Hub has always brought you the best of the book world for free—no paywall. But our future relies on you. In return for your contribution, you'll get an ad-free site experience, editors' picks, and our Joan Didion tote bag. Most importantly, you'll keep independent book coverage alive and thriving. Become a member for as low as $5/month Dismiss without supporting Lit Hub"
    },
    {
      "url": "https://www.visitpensacola.com/media/press-releases/visit-pensacola-welcomes-president-and-ceo-darien-schaefer/",
      "text": "Visit Pensacola Welcomes President and CEO Darien Schaefer | Visit Pensacola Skip to content logo 0 Saved 87 ° F Plan Your Way to Beach™ Navigation logo Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Home Visit Pensacola Welcomes President and CEO Darien Schaefer Share Media Contact: Nicole Stacey Visit Pensacola (850) 434-2142 nstacey@visitpensacola.com Pensacola, Fla. (April 20, 2020) – Visit Pensacola is pleased to welcome its President and CEO, Darien Schaefer. Schaefer joins the team from Visit Big Bear in Big Bear Lake, Calif. where he served as CEO for the past three years. He brings to the team over 20 years of destination marketing experience, including his most recent roles as CEO of VISIT Lake Geneva and Executive Director of the Wausau/Central Wisconsin CVB and Sports Authority. “I'm very excited to join Visit Pensacola and work with its excellent staff to promote one of the best beach destinations in the nation, Darien Schaefer said. “This is a challenging time for the Pensacola area, and our focus will be to help our tourism industry recover from the COVID-19 pandemic as quickly as possible.” “One thing I’ve already come to appreciate about Pensacola and Escambia County is the quality of the people I've met and how proud they are of their community. Promoting the history, culture, and sports of Pensacola will be a focus to extend our visitor's experience beyond the beach.” Schaefer will work with Interim President and CEO, Jack Brown, while he settles into his new role. Visit Pensacola invites the community to attend the April board meeting via zoom on April 29, 2020, at 3 p.m. to meet Darien virtually. For those interested in contacting Darien Schaefer, please email dschaefer@visitpensacola.com. About Visit Pensacola Visit Pensacola is the destination management organization for Escambia County which includes Pensacola, Pensacola Beach and Perdido Key. With over 450 years of rich history and 18 miles of sugar-white sand beaches bordered by the emerald-green waters of the Gulf of Mexico, visitors from all over the world are lured to our pristine shores every year. Visit Pensacola supports the community vision of tourism by serving as the central body responsible for building tourism as an economic engine for our community through leadership, connection, collaboration and communication. Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Visit Pensacola 1401 E. Gregory Street Pensacola, Florida 32502 Visitor Center Locations Contact Us (800) 874-1234 enews@visitpensacola.com logo Request Guide Email Signup Blog Get the App Become A Partner Advertising Opportunities Partner Login Privacy Policy ©2025 Visit Pensacola Florida. All Rights Reserved. This website uses cookies to enhance your user experience on the website. Learn more. Accept Experience Builder Quick Search logo Expanded Search Location Map"
    },
    {
      "url": "https://printersofpensacola.com/contactus.html",
      "text": "Printers of Pensacola contact Printers of Pensacola Homepage All Products Business Cards Envelopes Brochures Color Copies B&W Copies Signs & Banners Calendars Catalogs Flyers Folders Letterhead Postcards Multi-forms Invitations Promotional Large Format Direct Mail Our location Web Design & SEO Design Services About Us Contact Check out our new location. 1207 west garden st, Pensacola, FL New state of the art equipment. New Showroom. Same Great Service. 850-434-2588 Read More Monthly Specials & Events Ramping up for summer time business and getting your business POP Tuned Up !. Read More Products Brochures BnW Copies Business Cards Calendars Catalogs Color Copies Direct Mail Envelopes Flyers Folders Invitations Letterhead Forms Postcards & Services Promotional Signs Banners Graphics Web Design Location About Us Contact Us Newsletter Specials Upload Art Contact Us: Ph: 850-434-2588 rayh@printersofpensacola.com (owner) www.printersofpensacola.com 1207 west garden street * Pensacola,FL 32502 Twitter Facebook Instagram Tumblr Dribbble © Untitled. All Rights Reserved."
    },
    {
      "url": "https://getvows.com/contact-us/",
      "text": "Contact Us - Get Vows Skip to content Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar New Jersey/New York Area (732) 763-2730 jeni@getvows.com Facebook Twitter Pinterest Flipboard Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar CONTACT US Send Message GET IN TOUCH If you’re interested in our services or have any questions, please reach out to us thru the contact information below or fill out our form on the right. jeni@getvows.com (732) 763-2730 New Jersey/New York Area CONTACT INFO jeni@getvows.com (732) 763-2730 New Jersey/New York Area SOCIAL Facebook Twitter Pinterest Flipboard NEED TO MAKE A PAYMENT? Payment Options Copyright © All Rights Reserved"
    },
    {
      "url": "https://ecua.fl.gov/contact-ecua",
      "text": "Contact Us/FAQs ECUA My Bill View/Pay Bill Now Advisories Meetings Map Gallery Contact Us/FAQs My Bill View/Pay Bill Now Advisories Meetings Map Gallery Contact Us/FAQs Who Is ECUA ECUA Board Citizens' Advisory Committee ECUA Administrative Code Giving Back Project EUAP Services Residential Customers Commercial Customers Commercial Sanitation Services Composting Pretreatment Program Sanitation Services Water Services Water Reclamation Doing Business with ECUA Vendors/Purchasing Formal Solicitations Surplus Property Engineering Manuals & Contacts Live Green Line Verification Project Bayou Marcus Water Reclamation Facility Boardwalk Composting Fats, Oils & Grease Inflow & Infiltration Our Water Supply Private Sewer Lateral Program Proper Disposal of Surplus Medications Protector of the Environment Award Recycle Star Recycling News / Reports Reports Customer Pipeline Newsletter Careers Careers Benefits Who Is ECUA ECUA Board Citizens' Advisory Committee ECUA Administrative Code Giving Back Project EUAP Services Residential Customers Commercial Customers Commercial Sanitation Services Composting Pretreatment Program Sanitation Services Water Services Water Reclamation Doing Business with ECUA Vendors/Purchasing Formal Solicitations Surplus Property Engineering Manuals & Contacts Live Green Line Verification Project Bayou Marcus Water Reclamation Facility Boardwalk Composting Fats, Oils & Grease Inflow & Infiltration Our Water Supply Private Sewer Lateral Program Proper Disposal of Surplus Medications Protector of the Environment Award Recycle Star Recycling News / Reports Reports Customer Pipeline Newsletter Careers Careers Benefits ECUA ECUA Contact Us/FAQs Contact Us/FAQs How Can We Help You Today? ECUA General Customer Service (850) 476-0480 Our Customer Service phone lines and Ellyson office are open Monday through Friday, 8:30 a.m. - 5:00 p.m. If you are in need of assistance outside of normal business hours, please call our Emergency After Hours phone line: (850) 476-5110. ECUA Customer Service Office 9255 Sturdevant St Pensacola, FL 32522 When calling Customer Service the wait time to reach a Customer Service Representative may be shorter during off-peak times. Mondays, especially after holiday weekends, are extremely busy. If the nature of your call is not a pressing matter and can possibly be addressed later in the week, we recommend waiting a day or two for faster service. ECUA Live Call Center Stats Email Customer Service* Use the form below to contact us by email. Please include your service address and a daytime contact phone number. * Under Florida law, e-mail addresses are public records. If you do not want your e-mail address released in response to a public records request, do not send electronic mail to this entity. Instead, contact this office by phone or in writing. Municipal Lien Search (MLS) Direct access to municipal lien information for closing requirements. MLS Records Frequently Asked Questions Water & Sewer Services Why is my water bill higher than usual? A sudden increase could be due to increased usage, seasonal changes, or leaks. Check for running toilets, dripping faucets, or underground leaks. How do I check for leaks at home? Turn off all water sources and check your meter. If it’s still moving, you may have a leak. Is ECUA water safe to drink? Yes! ECUA water meets and exceeds all state and federal drinking water standards. View our latest Water Quality Report here . Why does my water sometimes look cloudy? This is usually caused by air bubbles and should clear up in a few minutes. If it persists, contact ECUA. How do I set up new water service? To start service, contact ECUA by phone at (850) 476-0480, Monday–Friday from 8:30 a.m. to 5:00 p.m., or visit us in person at our office located at 9255 Sturdevant St., Pensacola, FL 32514. Beforehand, please review the information in the \"Setting Up Your New Residential Account\" dropdown box here . Recycling & Sanitation What should I do if my trash, recycling, or yard waste wasn’t picked up? If your cans or yard trash was placed at the curb by 5:30 a.m. on your scheduled collection day and was still missed, we're here to help. Please contact ECUA Customer Service by phone: (850) 476-0480 or email: customer.service@ecua.fl.gov. We'll work to resolve the issue as quickly as possible—often the same day or the next. What can I recycle with ECUA? The “Core Four”: 1. Mixed paper and cardboard 2. Plastic containers labeled #1 and #2 3. Metal food and beverage cans 4. Glass jars and bottles There's no need to rinse or remove labels, but containers should be mostly empty—like a peanut butter jar that is “spoon clean.” Does ECUA collect yard waste? Yes! Place it in compostable paper bags, non ECUA trash cans, or in a separate pile for collection on your regular collection day. No scheduling is required. For more details about proper disposal, view the \"Yard Trash Collection\" dropdown box here . Since launching our composting program in 2016, we’ve been working to reduce plastic in yard waste. Help us keep it clean by switching to compostable paper yard waste bags—available at home improvement stores or online. Does ECUA have an app I can use to manage my services? Yes! Download the ECUA Waste Wise app to stay connected and in control of your services. With the app, you can: Get real-time notifications about schedule changes and service updates, set reminders so you never miss a pickup, use the “What Goes Where” guide to recycle smarter, pay your bill, report damaged carts, and manage other service requests. Google Play Store: https://bit.ly/4bkokpw Apple App Store: https://apple.co/4kcbhe1 Can I put bulk items like furniture or appliances out for pickup? Yes. You can schedule a bulk item pickup by calling Customer Service at (850) 476-0480. Requests must be made by 2:00 p.m. the day before your regular collection day. There is no additional cost for this service—it’s included in your bill. For a list of accepted items, please view the \"Bulk Waste Pick-Up Information\" dropdown box here . Billing and Payments How can I pay my bill? Online , by phone, by mail, or in person at an ECUA office. Auto-pay is also available! What happens if I miss a payment? Service could be disconnected as soon as the next business day after your bill’s due date. For assistance, please contact ECUA. Boil Water Notices & Water Outages How do I know if there’s a Boil Water Notice in my area? If your service address is under a boil water notice, you will receive a notification through ECUA’s notification system. You can sign up here . Additional information is also available on the Advisories tab of our website and, in some cases, on our social media channels . What should I do if my water pressure is low? The issue may be due to scheduled maintenance or a possible leak in your area. To report it, please contact ECUA: Customer Service (850) 476-0480 or customer.service@ecua.fl.gov, Monday–Friday, 8:30 a.m. – 5:00 p.m. For emergencies after business hours or on holidays, please call our 24/7 line at (850) 476-5110. Custodian of Public Records Ms. Amanda Miller Administrative Coordinator 9255 Sturdevant Street Pensacola, FL 32522-7089 amanda.miller@ecua.fl.gov Opt In for SMS Notifications About Your Service Requests ECUA (850) 476-0480 Monday - Friday 8:30am - 5pm (850) 476-5110 Emergency After Hours Stay In Touch Facebook YouTube Twitter Instagram customer.service@ecua.fl.gov or by writing to the ECUA at 9255 Sturdevant Street Pensacola, FL 32514 Site Links Contact Board Public Meetings Careers Call Before You Dig Privacy & Disclaimer My Bill Employee Resources- Webmail Employee Resources - MUNIS SelfService"
    }
  ]
}