{
  "fuentes": [
    {
      "url": "https://irishpubcompany.com/contact-us/",
      "email": "amcnally@irishpubcompany.com"
    },
    {
      "url": "https://irishpubcompany.com/contact-us/",
      "email": "dfagan@irishpubcompany.com"
    },
    {
      "url": "https://irishpubcompany.com/contact-us/",
      "email": "info@irishpubcompany.com"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/titusville/bars-breweries/the-irish-pub-eatery/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://www.irishtimes.com/life-and-style/food-and-drink/most-influential-irish-people-on-the-london-food-scene-revealed-1.3819429",
      "email": "mediasolutions@irishtimes.com"
    },
    {
      "url": "https://www.irishtimes.com/life-and-style/food-and-drink/most-influential-irish-people-on-the-london-food-scene-revealed-1.3819429",
      "email": "newsdesk@irishtimes.com"
    },
    {
      "url": "https://www.irishtimes.com/life-and-style/food-and-drink/most-influential-irish-people-on-the-london-food-scene-revealed-1.3819429",
      "email": "services@irishtimes.com"
    },
    {
      "url": "https://www.harrisonsfish.co.uk/contact-us",
      "email": "ryan@harrisonsfish.co.uk"
    }
  ],
  "mails": [
    "amcnally@irishpubcompany.com",
    "chosen-sprite@2x.png",
    "dfagan@irishpubcompany.com",
    "info@irishpubcompany.com",
    "mediasolutions@irishtimes.com",
    "newsdesk@irishtimes.com",
    "ryan@harrisonsfish.co.uk",
    "services@irishtimes.com"
  ],
  "nombre_sitio": "irishpubtitusville.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://irishpubcompany.com/contact-us/",
      "text": "Contact Us – The Irish Pub +353 (0)1 293 4300 info@irishpubcompany.com Home Our Work Our Process Cost & Benefits Insights All Projects Blog Posts & Articles About Us Contact Us Select Page Contact Us Get in touch Fill the form below to contact us Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Number * Please include country code Comment or Message Submit Where to find us Ireland Head Office info@irishpubcompany.com +353 (0)1 293 4300 Skype: mcnally.office1 USA Darren Fagan dfagan@irishpubcompany.com 404 636 5659 404 229 9971 Middle East Simon McNally info@irishpubcompany.com +971 4609 1506 Media & Press Enquiries Anna McNally amcnally@irishpubcompany.com +353 (0)1 293 4300 Creating Exceptional Hospitality Concepts Worldwide Since 1979 Follow Follow Follow Follow Follow Contact +353 (0)1 293 4300 info@irishpubcompany.com WHATS APP: 00353 85 775 3567 Location 1st Floor, The Courtyard, Carmanhall Road, Sandyford Business Park, Dublin, Ireland © The Irish Pub Company 2024. All Rights Reserved. Privacy . Sitemap . English"
    },
    {
      "url": "https://www.visitspacecoast.com/profile/titusville/bars-breweries/the-irish-pub-eatery/",
      "text": "The Irish Pub & Eatery - Visit Space Coast Skip to main content Item Added to Itinerary My Planner Share My Itinerary Added to Wishlist Copied to Clipbord Surf Cams Map Local Weather Explore Fall is for Foodies Kennedy Space Center Visitor Complex Port Canaveral Wildlife Viewing Cocoa Beach Brevard Zoo Things To Do Sea Turtle Season Attractions Beaches Communities Restaurants Tours Museums Stay Bed and Breakfast Campgrounds Hotels Vacation Rentals Events Blogs Launches My Itinerary Visitor Information Vacation Planner Accessibility on the Space Coast Beach Safety Transportation and Map Search for: Search Follow Us on Social Media facebook-f instagram youtube pinterest-p Search for: Search Home Restaurants The Irish Pub & Eatery Add to Wishlist The Irish Pub & Eatery Enjoy traditional Irish fare and over 40 drafts on tap at The Irish Pub & Eatery. Located in Titusville, you will feel like you have been transported to a traditional Irish pub when you dine here. The Irish Pub & Eatery is always up to something, and it’s likely they have a special event or specials taking place. Add to Trip Visit Website Direction 125 Harrison St, Titusville, FL 32780 Contact (321) 264-0311 Discover More nearTitusville All Hotels Restaurants Events Add to Wishlist Vine & Olive Titusville Celebrate the season with our Fall is for Foodies prix fixe menu. Begin with shareables like house meatballs, crispy mozzarella, or a fig out flatbread. Choose fresh salads, then savor Italian entrées from chicken parmesan with creamy rigatoni to mushroom bucatini, spicy rigatoni, or rich short rib bolognese. End with… Add to Trip Add to Wishlist Third Culture Kitchen Titusville Share a delicious 3-course meal for two! Start with a Mezze or Small Plate like veggie spring rolls, fried cheese, chips & queso, or a fresh ginger salad. Choose two entrées — burritos, hibachi bowls, Latin bowls, or street tacos — with your favorite proteins and sides. End on a… Add to Trip Add to Wishlist Bravo Taco Titusville Enjoy the ultimate taco trio: one Soft Taco (chicken or beef), one Hard Taco, and the star — a cheesy Bravo Taco, with two crispy shells wrapped in a warm flour tortilla with queso, loaded with your choice of protein and all the fresh toppings. Served with chips & salsa… Add to Trip Add to Wishlist Zero Gravity Wine Bar Titusville More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all…. Add to Trip Add to Wishlist Humpavelli’s Pizza Titusville Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously… Add to Trip Add to Wishlist Past and Presence, Titusville’s Historic Ghost Tour Titusville Step into the mysterious and haunting history of Titusville, Florida, with our immersive ghost tours. Our guided tours offer a unique blend of history, folklore, and spine-chilling tales that will leave you captivated and intrigued. Whether you’re a skeptic or a believer, our tours provide an unforgettable experience that will… Add to Trip Add to Wishlist In the Dog House Art Studio Titusville In the Dog House Art Studio and Tiny House Art Village is a vision made reality by artist Maxine Trainer. Located on 4 acres on Florida’s Space Coast, the studio and art village comprise a venue for art classes and special events; a gallery feature work by Maxine and other… Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Titusville Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs… Add to Trip Add to Wishlist Vine & Olive Titusville Vine & Olive is inspired by local fresh ingredients to make elevated dishes served in an inviting casual setting. You will see dishes on our menu that have Italian and Mediterranean influences served with a modern twist. We also have a large selection of Gluten free and vegan options. We… Add to Trip Add to Wishlist Chain of Lakes Park – Sports Venue Titusville Chain of Lakes Park is located just north of downtown Titusville and hosts playgrounds, trails, relaxing waterfront seating and: Two (2) lighted 200’ softball fields Five (5) lighted 300’ softball fields Eight (8) soccer fields ﻿ ﻿﻿ Add to Trip Add to Wishlist Space Coast Ceramics Titusville A walk in paint your own pottery studio, fun for the whole family, couples, and large groups! Come by any time to paint your own pottery in a relaxed, fun environment suitable for all ages. Groups of 6+, reservations recommended. Give us a call, we would love to tell you… Add to Trip Add to Wishlist Black Cat Coffee Titusville Black Cat Coffee is a small batch coffee roaster and coffee shop. We specialize in single origin coffee. Add to Trip Add to Wishlist The Café Paradiso Bistro and Social Club Titusville Café Paradiso Bistro and Social Club is where the vibrant flavors of the Caribbean, the soulful essence of Cajun and Creole, and the rich tastes of Cuban cuisine come together in perfect harmony. We are proud to offer you an authentic New Orleans dining experience that you will fall in… Add to Trip Add to Wishlist Springs to Sea Old Florida Eco Tours Titusville Want to get lost in the moment without getting lost in the crowd? Springs to Sea Old Florida Eco Tours provides kayak tours, paddle board tours, guided hikes, and outdoor fitness to visitors and locals! Springs to Sea Old Florida Eco Tours is permitted with USFWS to operate commercial tours… Add to Trip Add to Wishlist Blue Heron Restaurant Titusville Open to the public in The Great Outdoors. Beautiful views, delicious food and comfortable atmosphere. Add to Trip Add to Wishlist Home2 Suites by Hilton Melbourne Viera A relaxing stay near Avenue Viera shopping. We’re off I-95, five minutes from The Avenue Viera mall for shopping, dining, and entertainment. The USSA Space Coast Stadium and Duran Golf Club are within two miles. Cocoa Village is a 20-minute drive, home to boutique shopping and weekend markets. Enjoy your... Add to Trip Add to Wishlist Hilton Garden Inn Cape Canaveral near Cocoa Beach Experience the perfect blend of comfort, convenience, and coastal charm at the Hilton Garden Inn Cape Canaveral. Our brand-new hotel features 156 spacious, modern guest rooms and welcomes all travelers. Planning an event? Our 775-square-foot meeting room is ideal for gatherings, and our professional culinary team is ready to make... Add to Trip Add to Wishlist Homewood Suites by Hilton Viera Melbourne Brand‑new, 4‑story, all-suite hotel with 131 spacious suites providing separate living and sleeping areas—ideal for families, business travelers, and extended stays. Nestled off Interstate 95 in the vibrant Viera/Borrows West district, it offers convenient access to the USSSA Space Coast Sports Complex, Brevard Zoo, The Avenue Viera shopping & dining, and... Add to Trip Add to Wishlist Springhill Suites by Marriott West Melbourne Palm Bay Kick back and feel your worries melt away as you settle in for a rewarding stay at SpringHill Suites West Melbourne. Our spacious hotel suites and vibrant spaces are perfect for working, playing or relaxing. Take the stress out of travel with perks like free WiFi, outdoor pool and a... Add to Trip Add to Wishlist Fairfield Inn & Suites Melbourne West/Palm Bay Get comfortable at Fairfield Inn and Suites Melbourne West Palm Bay. Our Melbourne Florida hotel has everything you need to recharge on the road. Refresh in our suites with signature plush Marriott bedding, ergonomic workspaces, and free WiFi. Start your morning with selections from our complimentary breakfast served daily. Maintain... Add to Trip Add to Wishlist Hyatt Place Cape Canaveral Explore the Space Coast from our modern rooms at Hyatt Place Cape Canaveral, from rooftop views of live rocket launches from Kennedy Space Center and the Cape Canaveral Space Force Station. Relax at our outdoor pool, enjoy a meal at The Placery or grab to-go snacks at The Market after... Add to Trip Add to Wishlist Comfort Suites Titusville Near Kennedy Space Center Exciting news! We’ve just launched the brand new Comfort Suites Titusville near Kennedy Space Center, offering the perfect blend of comfort, convenience, and value for your next business trip to the heart of Florida’s Space Coast. Stay in Style, Work with Ease: Spacious guest rooms featuring plush bedding, flat-screen TVs... Add to Trip Add to Wishlist Hotel Melby Hotel Melby celebrates the raw and the refined, where artistry dances with science and the process of discovery itself is on display. From evocative artworks and cultural diversity to alluring explorations of space and time – Hotel Melby stands as a doorway to the vibrant and distinctive essence of Melbourne.... Add to Trip Add to Wishlist Element Melbourne Oceanfront Inspired by Westin Hotels & Resorts, the Element Melbourne Oceanfront believes in providing travelers, whether on the road for work or leisure, not just a great place to stay, but a place to stay connected, feel alive, balanced and maintain their rituals and lifestyles. With stunning views of the Atlantic... Add to Trip Add to Wishlist Comfort Inn & Suites Melbourne-Viera We are family owned/operated hotel since 2007 . We treat our guests like family and offer both King and Double Room types. We offer free amenities such a fully hot breakfast, swimming pool and laundry facilities. We love to host families, sports teams, business travels and leisure guest. Add to Trip Add to Wishlist Holiday Inn Express Cape Canaveral Holiday Inn Express Cape Canaveral is ideally located next to Terminal 3 at Port Canaveral and the Jetty Park Beach & Pier. We are just minutes from a variety of restaurants, shopping destinations, and popular attractions like the Kennedy Space Center Visitor Complex. As the first choice for the increasing... Add to Trip Add to Wishlist Seascape Motels Modern amenities meet Old Florida style in this hidden oceanfront treasure — with southern charm and hospitality! Quaint and affordable, the Sea Scape has character. We take pride in our cleanliness, service and repeat business. Every day is perfect at the Sea Scape Motel & Apartments. You’ll awake to magnificent... Add to Trip Add to Wishlist Americas Best Value Inn Satellite Beach Melbourne Come and enjoy an out-of-this-world atmosphere at the America’s Best Value Inn Satellite Beach. A short walk from the beach, this pet friendly hotel is conveniently located less than 15 minutes from the Melbourne Orlando International Airport and less than 16 miles from Port Canaveral. America’s Best Value Inn Satellite Beach invites you... Add to Trip Add to Wishlist TownePlace Suites by Marriott – Cape Canaveral / Cocoa Beach Designed for longer stays, our property features fully equipped kitchens, lobby bar, poolside beverage service with covered seating. Hydro-stations throughout the hotel. 24-hr fitness and business center. Meeting space to accommodate groups up to 30. Balconies in select suites offering fantastic views of port, rocket launches and the Banana River. Add to Trip Add to Wishlist The Pineapple Estate EGAD A Beautiful Private Estate Vacation home nestled in the wonderful Eau Gallie Arts District. The Estate Sleeps 22, has direct river access, minutes to the Atlantic Ocean and boasts the best distant, unobstructed views of the Florida Sunrises, Sunsets and Rocket Launches. Walking distance to Restaurants, shopping, night life venues... Add to Trip Add to Wishlist Hola! Cuban Kitchen Experience the vibrant flavors of Cuba at Hola! Cuban Kitchen, a casual fine dining destination where authenticity meets elegance. Savor traditional Cuban favorites like ropa vieja, picadillo, and palomilla steak, as well as house specialties like our signature Paella—all crafted with our unique Cuban flair. Enjoy hand-crafted cocktails including refreshing... Add to Trip Add to Wishlist Cuba Bistro At Cuba Bistro, we bring the heart of Cuba to every cup of coffee, plate of food and freshly baked pastelito. Family-owned and proudly rooted in tradition, we serve up flavors that feel like home. Stop by for a Cafecito and stay for the love. Add to Trip Add to Wishlist Pacha Kava Lounge Pacha Kava Lounge in Rockledge, FL, is a unique, family-friendly kava bar and social hub known for its enchanting, whimsical decor, diverse menu of house-made kava and herbal teas, and commitment to community with regular events like Bingo and open mic nights. Patrons praise the welcoming atmosphere, knowledgeable and friendly... Add to Trip Add to Wishlist Zero Gravity Wine Bar More than just a wine bar, Zero Gravity Wine Bar offers a tasting experience for everyone, whether you’re just getting started or already love wine. You don’t need to be an expert here. Our founders are passionate wine lovers who believe tasting should be fun, relaxed, and open to all.... Add to Trip Add to Wishlist Forgotten Block Butcher and Market Nestled in the heart of Historic Cocoa Village, Forgotten Block is the Space Coast’s neighborhood butcher and market with a passion for sustainability, quality, and community. We specialize in locally sourced meats, house-made charcuterie, artisanal deli offerings, and provisions. From dry-aged beef, charcuterie, and handcrafted sausages to our tallow-based soaps... Add to Trip Add to Wishlist J. Bird’s Island Eatery Nestled just steps from Port Canaveral and the Kennedy Space Center, J. Bird’s Island Eatery serves up good vibes from sunrise to tiki time. Whether you’re fueling up before a cruise, taking a midday poolside break, or winding down after a space center visit, J. Bird’s is your tropical nest.... Add to Trip Add to Wishlist Aves’ Place Located in the heart of Brevard County, Aves’ Place is a destination for families across the Space Coast, offering a variety of freshly made lunch options, hand-scooped ice cream, treats and fresh bakery items and is home to Treasures Boutique, an upscale resale boutique featuring clothing, furniture and more. A... Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach North Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Ice Cream Hut Cocoa Beach South Best Ice Cream Around! Delicious Soft Serve and Over 40 Flavors Of Creamy Hard Dipped Ice Cream, Along With Dairy Free and Sugar Free Options. Home of The Xtreme Milkshake! Add to Trip Add to Wishlist Toasty Coconut Toasty Coconut is Merritt Island’s Newest stop for quick, Savory Bites, Boba, Coffee, and BLUE BELL ICE CREAM! Add to Trip Add to Wishlist Ice Cream Hut Merritt Island Located just minutes from the beach, The Ice Cream Hut of Merritt Island is your go-to destination for handcrafted ice cream, nostalgic treats, and unforgettable family fun. We offer an exciting variety of premium flavors, dairy-free options, and signature items like cookie sandwiches, waffle tacos, and banana split boats—all made... Add to Trip Add to Wishlist Evo Catering, LLC “EVO”lving with the way you eat with our dine in or take out restaurant, custom off-site catering and our meal prep service that allows you to have a taste of home or to try something exotic without needing a kitchen or sink. The restaurant has daily specials with great food... Add to Trip Add to Wishlist Kabob-a-licious Escape to Kabob-a-licious, your delicious getaway just steps from Cocoa Beach! Savor the taste of homemade Mediterranean and Latin cuisine with vibrant flavors that will transport you. Indulge in mouthwatering kabobs, savory empanadas, flavorful shawarma, authentic Cuban sandwiches, and refreshing shave ice. Every dish is crafted from scratch, offering a... Add to Trip Add to Wishlist 2 georges oceanside bar & grill 2georges oceanside bar & grill (formerly Sage Bistro) was purchased by Jeff and Jeannine George in August 2023. The married couple have an extensive background in the Food and Beverage Industry along with Hospitality, Marketing and Social Media. 2georges oceanside bar & grill was part of the rebranding which reflects... Add to Trip Add to Wishlist Humpavelli’s Pizza Family-owned since 2013 to serve you the best food with the always freshest ingredients. We pride ourselves on having the friendliest customer service around as we make your food to order in an open kitchen to show you what we’re all about. We make everything in-house every morning to continuously... Add to Trip Add to Wishlist Southern Kingfish Nationals The Southern Kingfish Association (SKA) will be hosting its SKA Nationals Kingfish Championships November 19 – 22, 2025 in Port Canaveral, Florida. The SKA Nationals will feature elite teams from across the Southeast and Gulf competing for the coveted SKA Nationals Championship. The event is free and open to the... Add to Trip Add to Wishlist Rock & Roll Revue: Autumn Boogie It’s Autumn? Maybe somewhere else but it’s late summer here. We have a fab lineup of the dance music that you love – from the fabulous 12-piece Rock & Roll Revue. $15.00 Add to Trip Add to Wishlist Autumn Market Join us for the Nancy Higgs Community Center’s Autumn Market! This event will take place on two separate days, so if you miss the first one, don’t be discouraged! When: October 7 and November 4 Come enjoy food trucks, fresh baked goods, local produce, and crafts made by local artisans.... Add to Trip Add to Wishlist Creatures Fest Join us at the Barrier Island Center for a free, fun, family event to celebrate animal diversity, ecology and conservation with a Halloween theme. Enjoy critteriffic games, touch tank, live animal encounters, conservation booths, scavenger hunt, eco-arts and crafts, black light not-so-scary experience, food truck, and more! Costumes encouraged and... Add to Trip Add to Wishlist St. Vincent de Paul Friends of the Poor 5K Run Walk Cocoa Beach 2nd Annual Friends of the Poor 5K Run Walk – fun for all ages. To raise awareness of the needs of our local neighbors who are working poor, homeless, disabled and veterans in the Cocoa Beach – Cape Canaveral Community. Race starts at 8:00 am. Same day registration starting at... Add to Trip Add to Wishlist Harvest Festival Harvest Fest at The Enchanted Forest is BACK! Dress up in costume or your favorite fall clothes and enjoy a day full of family fun! Dive into exciting games, hands-on crafts, and delicious bites from local food trucks. Get creative with pumpkin painting and scarecrow making. Explore the creepy-crawly building... Add to Trip Add to Wishlist 11th Annual Kidtoberfest Brevard County Parks and Recreation is proud to present Tim Burton’s The Nightmare Before Christmas at the FREE Cars Under the Stars Movie in the Park happening in Wickham Park! Audio will be available through car stereo and external speakers . The movie will begin once the sun goes down.... Add to Trip Add to Wishlist 4th Friday Starry Nights Join Brevard parks and Recreation Department and the Max K. Rodes Community Center for an artisan market under the stars! Meet talented local artisans and find one-of-a-kind gifts. Enjoy live D.J. music and peruse food from a variety of local onsite food trucks. Add to Trip Add to Wishlist 14th Annual North Brevard Fall festival and Trunk-or-Treat Join Brevard Parks and Recreation for the 14th Annual North Brevard Fall Festival and Trunk-or-Treat! This exciting three-hour event is the ultimate way to celebrate the season! Come dressed in your best costume and connect with local groups and organizations while diving into all our thrilling activities. Don’t miss out... Add to Trip Add to Wishlist Haunted Trail at Rotary Park October 17 & 18, 24 & 25 (Fridays and Saturdays) Cost: $5 for ages 12 & under | $10 for ages 13 & up Get ready for a frightful night filled with thrills and chills! Explore multiple scare zones packed with eerie creatures, jump scares, and bone-chilling surprises around every... Add to Trip Add to Wishlist Free Concert Featuring The Bella Donna Project Join the Brevard Parks and Recreation Department and experience the greatest hits of Stevie Nicks with a live music performance by the Bella Donna Project! Feel free to bring lawn chairs or peruse a variety of local on site food trucks during the show. Add to Trip Add to Wishlist Cocoa Village Sidewalk Sale “Leave it to Bargains” at the Cocoa Village Sidewalk Sale! Cocoa Village boutiques, art galleries, jewelry stores, and consignment shops are bringing their sale racks to the sidewalks at this yard-sale-style shopping event! Pick up a map at one of 3 starting locations: Bobbi’s at Parkside, Lucia Jewelry, or Village... Add to Trip Add to Wishlist North Brevard Art League Holiday Artisan Market The North Brevard Art League will hold a Holiday Artisan Market on Saturday and Sunday, November 1st and 2nd, 2025 from 10 am – 3 pm. The Market will be held in the NBAL Studio located at 1421 Draa Rd., Titusville, FL. Admission and parking are free. The show will... Add to Trip Add to Wishlist Sensory Boo at the Zoo Families of children with exceptionalities are invited to enjoy a magical evening of trick-or-treating, games, sensory exploration and more as you stroll through the Brevard Zoo’s Paws On area. As a come and go event, timed entry tickets are available. Costumes Encouraged! Members: $2 Non-members: $6 Add to Trip Add to Wishlist Cocoa Village Haunted History Tour Join us for the Opening Night of the Cocoa Village Haunted History Tour on September 20th at 8:00 PM—an adults-only experience that dares you to step into the shadows of one of Florida’s most historic towns. Led by our expert guide Zach, a seasoned performer with decades of acting and... Add to Trip Things to Do The Space Coast Bucket List Experience the thrill of a rocket launch, catch a wave and much more, discover the top things you NEED to do when you visit the Space Coast. View Article Stay Connected Don’t miss out on our monthly newsletter for exciting updates on attractions, local events, and personalized itineraries. Name (Required) First Last Zipcode (Required) ZIP / Postal Code Email (Required) Phone This field is for validation purposes and should be left unchanged. Subscribe Vacation Planner Dive into the Space Coast Vacation Planner then launch into an unforgettable getaway. View Digital Planner About Contact Us Visitor Center Press Room Travel Professionals Sports Commission Film Commission Submit Your Business Submit an Event Events Calendar Follow Us on Social Media facebook-f instagram youtube pinterest-p Vacation Planner Privacy Policy © 2025 Copyright Florida’s Space Coast Office of Tourism All Rights Reserved"
    },
    {
      "url": "https://www.irishtimes.com/life-and-style/food-and-drink/most-influential-irish-people-on-the-london-food-scene-revealed-1.3819429",
      "text": "Most influential Irish people on the London food scene revealed – The Irish Times Sections Subscribe Subscribe Subscribe Home Latest Subscriber Only Crosswords & Puzzles Crosaire Simplex Sudoku News Quiz Ireland Dublin Education Housing & Planning Social Affairs Stardust Politics Poll Oireachtas Common Ground Election 2024 Elections & Referendums Opinion Editorials An Irish Diary Letters Cartoon Business Economy Farming & Food Financial Services Innovation Markets Work Commercial Property World Europe UK US Canada Australia Africa Americas Asia-Pacific Middle East Sport Rugby Gaelic Games Soccer Golf Racing Athletics Boxing Cycling Hockey Tennis Your Money Pricewatch Budget 2026 Crime & Law Courts Property Residential Commercial Property Interiors Food Drink Recipes Restaurants Health Your Family Your Fitness Your Wellness Get Running Life & Style Fashion Beauty Fine Art & Antiques Gardening People Travel Culture Art Books Film Music Stage TV & Radio Environment Climate Crisis Technology Big Tech Consumer Tech Data & Security Gaming Science Space Media Abroad Obituaries Transport Motors Car Reviews Listen Podcasts In the News Podcast The Women's Podcast Inside Politics Podcast Inside Business Podcast The Counter Ruck Podcast Ross O'Carroll-Kelly Better with Money Podcast Conversations with Parents Podcast Video Photography Gaeilge Scéal Tuarascáil History Century Student Hub Offbeat Family Notices Opens in new window Sponsored Advertising Feature Special Reports Subscriber Rewards Competitions Newsletters Weather Forecast Food Most influential Irish people on the London food scene revealed Annual Murphia List includes 13 new names among its 50-strong cohort of industry leaders Anna Haugh, whose Myrtle restaurant, named in honour of the late Myrtle Allen, will open in Chelsea next month. Marie Claire Digby Mon Mar 11 2019 - 07:00 A street food trader who secured a £350,000 investment on the BBC TV show My Million Pound Menu, and two sons of the late broadcaster Terry Wogan who run a pizza restaurant chain, are among 13 new entries in the fifth Murphia List, released today. The list, which is published annually just before St Patrick’s Day, identifies Irish people working in London who have made significant contributions to the hospitality and food and drink sectors. There are 50 people included this year, up from 45 last year. The Murphia List is compiled by siblings Catherine and Gavin Hanly. The pair co-founded the eating out guide and restaurant review website Hot Dinners in 2009. It is being launched at a party at Number Six at the Marylebone hotel in London on Monday evening. Alan (left) and Mark Wogan, directors of Homeslice pizza restaurants Restaurateurs, chefs, front of house staff, drinks industry personnel, food and drink producers, media, behind the scenes workers and “ones to watch”, are among those included. Sinead Campbell, originally from Co Mayo, is among five new additions in the restaurateur category. Campbell and her partner Lee Johnson secured £350,000 funding from Charlie McVeigh of the Draft House pub group, to expand their BBQ Dreamz Filipino street food concept. Mark and Alan Wogan, together with Ry Jessup, run the Homeslice pizza group which has six London outlets. Mark was previously executive chef at The Groucho private members' club, and his brother and co-director Alan runs the business side of their joint venture. Husband and wife Simon and Cairene Whiteside, who have opened Roe, a fish restaurant at Pop Brixton, a creative space in south London, also make the restaurateurs’ list. Simon and his fellow Dubliner Barry Wallace started out with a market stall selling fish and chips, and went on to open fish restaurants in Brussels and in Camden Town. There are four new additions to the chefs’ listing, led by Anna Haugh from Tallaght, whose Myrtle restaurant, named in honour of Myrtle Allen, is due to open in Chelsea early next month. Haugh intends to import and showcase Irish produce in the restaurant – her first as an owner – and describes her cooking as “modern European, with a focus on French technique”. Another new addition is Fiona Hannon, from Bray, who is head chef at Richard Corrigan’s Bentley’s seafood restaurant. According to Hot Dinners, Hannon jokingly describes her long working relationship with Corrigan as “a life sentence”, and says he gives her “the freedom and space to get on with my job.” Colin McSherry, head chef at Gridiron. Colin McSherry, head chef at Gridiron, a grill room within the Como Metropolitan hotel, and Tom Mullin, head of operations at Pizza Pilgrims, where he looks after menu revamps and chef training, also make the chefs’ list. There are two new additions from the drinks industry. Aaron Wall and Ciarán Smith opened their Irish cocktail bar, Homeboy, in Islington last December. Wall is a former Bacardi brand ambassador and Smith is a graduate of the hotel industry, having worked at the Shelbourne in Dublin, the Waldorf Astoria in New York and the Dorchester in London. According to Hot Dinners, Gearoid Devaney is one of only 220 Master Sommeliers and the only one who is Irish. The Belfast man is a wine importer, restaurateur and recently opened Trade Soho, a members’ club for hospitality industry. Richard O’Connell, who was born in Limerick and trained as a chef in Galway, has been working in kitchens in London for almost three decades, most recently as executive chef at Tom’s Kitchen. He now operates as restaurant industry consultant. Simon and Cairene Whiteside, owners of  fish restaurant Roe. There are three people named as “ones to watch” and they are Dave Ahern, a chef now working on a line of food products called Gastro Punk; Matthew Carter-Burwell, who is senior group press manager at Caprice Holdings, and Stephen McGonigle, a mixologist working at Head & Tails bar in West Hampstead. Well-known names who retain their places on the list include chef and restaurateur Richard Corrigan, whose PR executive daughter Jessica also makes the list in the media category; food writer Diana Henry, and Great British Menu judge Oliver Peyton, who is chief executive of Peyton & Byrne. Two chefs who retain their place on the list have major restaurant openings coming later this year. Robin Gill, who owns The Dairy, Sorella and Counter Culture with his wife Sarah, will open Darby’s on the 10th floor of Embassy Gardens, a Ballymore Group development in Nine Elms. Darby was the nickname of Gill’s late father, the musician Earl Gill. The restaurant will have a bakery onsite, an in-house butchery and charcuterie space, and a grill for cooking over-fire. Patrick Powell, formerly head chef at the Chiltern Firehouse, will open Allegra in the Stratford Hotel, which is housed within the Manhattan Loft Gardens skyscraper. Sky gardens at the restaurant will feature vegetable and herb beds, outdoor seating and views over Olympic Park. The Murphia List 2019 Chefs Kevin Burke – Head chef, The Ninth Kenneth Culhane – Head chef, The Dysart Shauna Froydenlund – Chef patron, Marcus NEW: Fiona Hannon – Head chef, Bentley's NEW: Anna Haugh – Chef patron, Myrtle Marguerite Keogh – Head chef, The Five Fields Dave McCarthy – Head chef, Scott's Aidan McGee – Head chef, Corrigan's Mayfair NEW: Colin McSherry – Head chef, Gridiron NEW: Tom Mullin – BOH Operations, Pizza Pilgirms Patrick Powell – Head chef, Allegra Rory Shannon – Head chef, Duke of Richmond Public House & Dining Room Clare Smyth MBE – Chef patron, Core by Clare Smyth Clare Smyth, chef patron  Core by Clare Smyth Restaurateurs NEW: Sinead Campbell – Street food trader, BBQ Dreamz Richard Corrigan – Chef patron, Corrigan Collection John Devitt – Owner, Koya Soho, Koya City and Koya Ko Garrett Fitzgerald – Restaurateur, Butchies Robin and Sarah Gill – Restaurateurs and chef, The Dairy, Counter Culture, Sorella Brian Hannon – Restaurateur, Super 8 Restaurants – Smoking Goat, Kiln, Brat Colin Kelly – Chef/co-owner, Picture, Portland Street and Marylebone John King – Restaurateur, Bowling Bird David Moore – Founding director, Pied à Terre John Nugent – CEO, Green & Fortune Oliver Peyton – CEO, Peyton & Byrne NEW: Simon and Cairene Whiteside – Restaurateurs, Roe NEW: Mark and Alan Wogan – Directors, Homeslice David Moore, founding director of Pied à Terre Bars Patrick Dardis – CEO, Young & Co Brewery NEW: Gearoid Devaney – Club founder, wine importer and sommelier, Trade NEW: Aaron Wall and Ciarán Smith – Directors, Homeboy Front of House Joanna Hughes – Shop manager, Quality Chop House Darren McHugh – General manager, The Ledbury Alex Muir – Restaurant manager, Four Seasons Hotel London at Ten Trinity Square Oisin Rogers – Publican and restaurateur, The Guinea Grill Garreth Walsh – General manager, The Marylebone The producers Evin O'Riordain – Founder, The Kernel Brewery Darragh O'Shea – Owner, O'Shea's Butchers Steve Ryan – Food photographer – co-founder, Root + Bone and 40FT Brewery Media Jessica Corrigan – Senior account manager, Sauce Communications Diana Henry – Food writer and broadcaster Niamh Shields – Food and travel blogger, freelance writer and author Joe Warwick – Food writer and broadcaster, World Restaurant Awards Behind the scenes NEW: Richard O'Connell – Restaurant consultant, Seasoned Consultancy Noel Mahony – CEO, BaxterStorey Sinead Mallozzi – CEO, Sketch Charlie McCarthy – Cocktail consultant and editor, A Drop of Irish Paul McKenna – Managing director, Red Branch Hospitality Join The Irish Times on WhatsApp and stay up to date Get the Food & Drink Club newsletter for the tastiest recipes, reviews and offers Tired of sauvignon? Bored with Pinot Grigio? Try these classy whites Mint chocolate bars that are all about the filling How to cook perfect crispy duck in 30 minutes at home Rhubarb swirl buns with custard glaze Are avocados just for brunch? A Galway design duo are dyeing to reveal all What is really in jelly beans? London restaurant named for Myrtle Allen set to open Ireland’s most difficult restaurant diners? ‘I call them adult children’ Ghost estate turns into holiday village with a new restaurant Pancake Tuesday: what are the best ready-made pancakes and mixes? St Patrick Alan Wogan Sarah Gill IN THIS SECTION Irishwoman’s US restaurant named one of the best restaurants of 2025 by the New York Times Irish chef Anna Haugh part of new BBC MasterChef presenting team after sacking of Gregg Wallace and John Torode Why is wine so expensive in Ireland? For the love of bread: The couple telling the real Scéal of artisan baking Four Irish craft ciders to try with your dinner, or on their own MOST READ ICE places Irish grandmother and green card holder in US isolation cell Nurse accused of failing to give critical medication on several occasions Poland ‘closest to open conflict since World War Two’, says Tusk after drone incident ‘My lovely husband has changed . . . and I am one of the people he has pushed away’ Support for Catherine Connolly presidential campaign solidifying among Sinn Féin TDs LATEST STORIES Four presidential hopefuls set to make pitches for nomination to TDs and Senators Deep excavation in search for boy assumed dead as three diggers used by gardaí Ursula von der Leyen proposes suspending parts of EU trade deal with Israel Wright Group company buys leasehold interest in Rustic Stone’s building Almost 100 bodies in Ireland responsible for regulation and licensing, new competitiveness plan discloses Food & Drink Club Exclusive competitions and restaurant offers, plus reviews, the latest food and drink news, recipes and lots more Sign up Opens in new window Opens in new window Subscribe Why Subscribe? Subscription Bundles Subscriber Rewards Student Subscription Subscription Help Centre Opens in new window Home Delivery Opens in new window Support Contact Us Help Centre Opens in new window My Account About Us Advertise Contact Us The Irish Times Trust Careers Irish Times Products & Services ePaper Crosswords & puzzles Newspaper Archive Newsletters Article Index Opens in new window Discount Codes Opens in new window OUR PARTNERS: MyHome.ie Opens in new window The Gloss Opens in new window Recruit Ireland Opens in new window Irish Times Training Opens in new window RIP.ie Opens in new window Irish Times on WhatsApp Irish Times on Facebook Irish Times on X Irish Times on LinkedIn Irish Times on Instagram Terms & Conditions Privacy Policy Cookie Information Cookie Settings Community Standards Copyright © 2025 The Irish Times DAC"
    },
    {
      "url": "https://www.harrisonsfish.co.uk/contact-us",
      "text": "Contact 1 — Harrisons Fish & Chips 0 Skip to Content MENU TASTE GUIDE DELIVERY CLICK & COLLECT GLUTEN FREE FAQ's PHOTO CONTACT US Open Menu Close Menu MENU TASTE GUIDE DELIVERY CLICK & COLLECT GLUTEN FREE FAQ's PHOTO CONTACT US Open Menu Close Menu MENU TASTE GUIDE DELIVERY CLICK & COLLECT GLUTEN FREE FAQ's PHOTO CONTACT US Contact us. Need to get in touch? Please contact us via our contact form. If the query is related to a previous order please include an order number or date and time visited. Ryan@Harrisonsfish.co.uk Harrisons Fish & Chip Co. 6 Elms Parade, Botley, Oxford, OX2 9LG Opening Times: Monday -  4pm-9pm Tuesday - 4pm-9pm Wednesday - 4pm-9pm Thursday - 4pm-9pm Fryday - 12pm-9pm Saturday 4pm-9pm Sunday Closed - Gone Fishing Name * First Name Last Name Email * Message * Thank you!"
    }
  ]
}