{
  "fuentes": [
    {
      "url": "https://surgetechak.com/contact/",
      "email": "sgoodwin@surgetechak.com"
    },
    {
      "url": "https://www.irockyourparty.com/about",
      "email": "dani@irockyourparty.com"
    },
    {
      "url": "https://www.irockyourparty.com/about",
      "email": "santiago@irockyourparty.com"
    },
    {
      "url": "https://www.irockyourparty.com/about",
      "email": "sebastian@irockyourparty.com"
    },
    {
      "url": "https://www.irockentertainment.com/contact",
      "email": "max@irockentertainment.com"
    }
  ],
  "mails": [
    "dani@irockyourparty.com",
    "max@irockentertainment.com",
    "santiago@irockyourparty.com",
    "sebastian@irockyourparty.com",
    "sgoodwin@surgetechak.com"
  ],
  "nombre_sitio": "irockyourparty.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://surgetechak.com/contact/",
      "text": "Get in Touch with Surge Tech - Contact Us Today Skip to content HOME MANAGED SERVICES NETWORK SUPPORT AND MONITORING Monitored Security Disaster Recovery HIPAA Compliance IT SERVICES Chief Information Officer Cloud Services VoIP Phone Services Training and Consulting CONTACT Contact Us Contact SurgeTechAK 2023-08-24T10:13:42-08:00 Get In Touch! Complete the form below and a representative from Surge Technologies will be in touch to discuss your organizational needs. Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Let's talk Phone 907-947-2744 Get In Touch Email sgoodwin@surgetechak.com Get In Touch Contact Info Anchorage Mobile: 907-947-2744 Email: mailto: sgoodwin@surgetechak.com Managed Services Network Support and Monitoring Monitored Security Disaster Recovery HIPAA Compliance IT Services CIO (Chief Information Officer) Cloud Services VoIP Phone Services Training and Consulting © Copyright | Surge Technologies of Alaska | All Rights Reserved | Anchorage Alaska Web Design by Bianca Frank Design Page load link Go to Top"
    },
    {
      "url": "https://www.irockyourparty.com/about",
      "text": "About iRock Your Party DJs | Top-Rated Orlando DJs for Hire top of page ABOUT WEDDINGS THE GLAMBOT RHYTHM HOUSE OF DECADES KINETIC SPHERES EVENTS CONTACT Share The Love GALLERY Full Access Photo Booths Gallery Cold Sparks Customized Monogram CO2 Cannon LED Games Uplighting Pixel Kinetic Lighting Texture Lighting Market lighting Dance Floor Gallery Video Wall Confetti More Use tab to navigate through the menu items. iROCK YOUR PARTY ORLANDO WEDDING & EVENT DJS MEET THE TEAM BEHIND THE DREAM Hey there! We are the siblings behind iRock Your Party. We might look young to you, but we are all well seasoned in each of our event fields and make an awesome team. We have been involved in the industry for over 12 years and have always dreamed about combining our strengths and skills to create an entertainment company driven by passion, charisma, and attention to detail. SEBASTIAN Vision Director Whether on the decks, the mic, or the lights, he’s the mastermind behind unforgettable parties. When it’s time to rock, Sebastian sets the vibe and brings the vision to life. ​ Sebastian@irockyourparty.com ​ SANTIAGO Operations Manager Santiago, as our Director of Operations, keeps the finances sharp, the logistics smooth, and the team in sync, making sure every event runs seamlessly from start to finish. ​ Santiago@irockyourparty.com DANI Marketing Specialist & Designer Dani’s background in multimedia design and her photography expertise allow her to create dynamic visuals that capture the energy of our events. Whether designing, shooting, or editing, she makes sure iRock always looks as good as it feels. ​ Dani@irockyourparty.com ​ OUR ROCKSTAR TEAM DJS REY SEBASTIAN E2 LUIS BARR RAFAEL DARION SAMUEL JACOB MIKE OFFICE MANAGER WAREHOUSE & EVENT SUPERVISOR STEPHANIE JAVIER EVENT ASSISTANTS BIBIANNA DANIEL SEBASTIAN MATTEUS LENNY NOW THAT YOU'VE GOT TO KNOW US, ARE YOU READY TO ROCK WITH US? GET IN TOUCH Cell: 407-929-8877 (Text friendly) DM us at @irockyourparty hello@irockyourparty.com bottom of page"
    },
    {
      "url": "https://www.irockentertainment.com/contact",
      "text": "Contact iRock Entertainment | Get in Touch Today | iRock Entertainment Screamfest 2025 is on sale NOW! BUY TICKETS NOW! Marketing arrow_outward Events arrow_outward Contact Us Contact Information We'd love to get in touch. Give us a call or reach out via email. max@irockentertainment.com +61 481 915 042 8B/85 Bourke Rd, Alexandria NSW 2015 Contact Form Send us a message and we'll get in touch shortly! Full Name * Email Address * Message * Send Message arrow_outward Events ivy Thursdays Beresford Fridays Ruby Fridays Homemade Saturdays Major Events Tours & Event Highlights Screamfest 2025 Services Event Management Sydney Event Planning Sydney Marketing Services Other Gallery FAQs Blog/iRock TV Terms & Conditions Privacy Policy Contact Copyright Â© 2025 iRock Entertainment"
    }
  ]
}