{
  "fuentes": [
    {
      "url": "https://www.linkedin.com/company/iron-and-oak-railroad-services",
      "email": "harlee@ironandoakrail.com"
    },
    {
      "url": "https://www.ironoakpost.com/",
      "email": "derek@ironoakpost.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "alanah@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "andrew@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "chris@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "chris@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "christy@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "devon@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "jessica@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "jill@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "jill@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "keith@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "linda@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "lupita@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "rich@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "scott@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "andrew@ironoak1.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "christy@iohli.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "keith@iohli.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "lindah@iohli.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "rich@iohli.com"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "email": "scott@ironoak1.com"
    },
    {
      "url": "https://ironoakcapital.com/contact-us",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://ironoakcapital.com/contact-us",
      "email": "sonny@ironoakcapital.com"
    },
    {
      "url": "https://ironoakcapital.com/contact-us",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://landofoakandiron.org.uk/contact/",
      "email": "landofoakandiron@groundwork.org.uk"
    },
    {
      "url": "https://landofoakandiron.org.uk/contact/",
      "email": "landofoakandiron@groundworks.org.uk"
    },
    {
      "url": "https://tangyoak.com/pages/about-us",
      "email": "copy_of_copy_of_wall_2_331f1847-0b1b-4e45-af97-a8724e935b13_145x@2x.png"
    },
    {
      "url": "https://tangyoak.com/pages/about-us",
      "email": "copy_of_copy_of_wall_2_331f1847-0b1b-4e45-af97-a8724e935b13_160x@2x.png"
    },
    {
      "url": "https://tangyoak.com/pages/about-us",
      "email": "info@tangyoak.com"
    },
    {
      "url": "https://tangyoak.com/pages/about-us",
      "email": "info@tangyoak.com"
    },
    {
      "url": "https://www.ironassociates.com/contact-us",
      "email": "edwright@ironassociates.com"
    },
    {
      "url": "https://www.ironassociates.com/contact-us",
      "email": "info@ironassociates.com"
    },
    {
      "url": "https://artistandfan.com/venues/venues/view/iron-oak-post",
      "email": "mike@ironoakpost.us"
    },
    {
      "url": "https://thirdiron.com/contactus/",
      "email": "info@thirdiron.com"
    },
    {
      "url": "https://thirdiron.com/contactus/",
      "email": "sales@thirdiron.com"
    }
  ],
  "mails": [
    "alanah@ironoak1.com",
    "andrew@ironoak1.com",
    "chris@ironoak1.com",
    "christy@iohli.com",
    "christy@ironoak1.com",
    "copy_of_copy_of_wall_2_331f1847-0b1b-4e45-af97-a8724e935b13_145x@2x.png",
    "copy_of_copy_of_wall_2_331f1847-0b1b-4e45-af97-a8724e935b13_160x@2x.png",
    "derek@ironoakpost.com",
    "devon@ironoak1.com",
    "edwright@ironassociates.com",
    "filler@godaddy.com",
    "harlee@ironandoakrail.com",
    "info@ironassociates.com",
    "info@tangyoak.com",
    "info@thirdiron.com",
    "jessica@ironoak1.com",
    "jill@ironoak1.com",
    "keith@iohli.com",
    "keith@ironoak1.com",
    "landofoakandiron@groundwork.org.uk",
    "landofoakandiron@groundworks.org.uk",
    "linda@ironoak1.com",
    "lindah@iohli.com",
    "lupita@ironoak1.com",
    "mike@ironoakpost.us",
    "rich@iohli.com",
    "rich@ironoak1.com",
    "sales@thirdiron.com",
    "scott@ironoak1.com",
    "sonny@ironoakcapital.com",
    "team@latofonts.com"
  ],
  "nombre_sitio": "ironoakpost.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.linkedin.com/company/iron-and-oak-railroad-services",
      "text": "Iron and Oak Railroad Services | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Join now Sign in Iron and Oak Railroad Services Construction Iron and Oak Railroad Services, Ensuring Your Business Never Goes Off Track Follow Discover all 8 employees Report this company About us At Iron and Oak Railroad Services our team greatly emphasizes strong relationships at every point of contact. We utilize our communication, project management, and construction knowledge to assist customers in meeting the requirement of their tracks. \n\nIron and Oak Railroad Services differ from other Rail Contractors as we strive to build a long-term maintenance plan for our customers. A plan based on customers budgets, shut down schedules, long-term logistics goals, consistent track safety improvements and more.\n\nIn order to assess your track and provide pricing for track maintenance and construction we offer complimentary site visits to meet and provide our recommendations. Please contact harlee@ironandoakrail.com to book anytime or call 905-979-5387. \n\nWe look forward to the opportunity to quote your business and working together in the future. \n\nVisit www.ironandoakrail.com to learn more. Website www.ironandoakrail.com External link for Iron and Oak Railroad Services Industry Construction Company size 11-50 employees Type Privately Held Founded 2022 Specialties Rail Industry , Track Maintenance , Track Inspections, Track Safety , Track Standards , Track Construction , Emergency Services , Industrial Track, Business Development , Customer Service , and Project Management Employees at Iron and Oak Railroad Services Nigel Murdza -- Harlee Barfknecht-zuber Director of Business Development Alexander Edmondson Welder/Trackman at Iron and Oak railroad services Nigel Murdza Director of Operations at Iron and Oak Railroad Services See all employees Updates Iron and Oak Railroad Services 784 followers 6mo Report this post NEW WEBSITE! Harlee Barfknecht-zuber Director of Business Development 6mo Iron and oak railroad services has updated our website for 2025! \n\nThank you to Maggie McTavish of Mango Media for producing exactly what we wanted to convey. \n\nI hope you have a chance to visit www.ironandoakrail.com to see for yourself. We look forward to working together in the future and thank you to all of our valued customers! #railroadcontractor #canadiancompany #supportlocal #diversityandinclusion #essentialworkers 9 1 Comment Like Comment Share Iron and Oak Railroad Services reposted this Harlee Barfknecht-zuber Director of Business Development 9mo Report this post I am beyond grateful that my work in building Iron and Oak Railroad Services has earned the emerging business award for the WIBA’s presented by the @the_gncc  and sponsored by the Niagara Economic Development. \n\nThe rain this week affected production on a track maintenance job for one of our customers and every one of my crew is here on a Saturday to complete the job without hesitation. \n\nI’m surrounded by harder workers and it inspires me to stand tall and confident in my role as owner and operator. \n\nThank you to my crew, my customers, and my suppliers, for the opportunity to start my own company. I look forward to doing business with all of you for years to come. #wiba2024 #emergingbusiness #railroadcontractor #essentialworkers #diversityandinclusion #teamwork #grateful 114 16 Comments Like Comment Share Iron and Oak Railroad Services 784 followers 10mo Report this post Congratulations to our Director and CEO Harlee Barfknecht-zuber on being nominated for the Emerging business award by the Women In Niagara council of the Greater Niagara Chamber of Commerce for all her work here at Iron and Oak Railroad Services ! \n\nIf you would like to attend the awards follow the link https://lnkd.in/g7MhcNz5 and we look forward to seeing you there! #WIBA2024 #railroaders #diversityandinclusion #emergingbusiness #growthanddevelopment Harlee Barfknecht-zuber Director of Business Development 10mo I’m thrilled to announce I have been named a finalist for Women In Niagara emerging business award for Iron and Oak Railroad Services ! \n\nI’m so proud of the work we do and a heartfelt thank you to everyone that championed my nomination. Submitting those letters made me feel like I already won. \n\nI look forward to attending this event and cheering on my fellow finalist. If you too would like attend tickets are available https://lnkd.in/giZxuJPQ . \n\nHope to see you there! #WIBA2024 #railroaders #teamwork #grit 26 3 Comments Like Comment Share Join now to see what you are missing Find people you know at Iron and Oak Railroad Services Browse recommended jobs for you View all updates, news, and articles Join now Similar pages PGM Rail Services Construction Niagara Falls, Ontario Chemin de Fer Touristique du Sud des Ardennes Sightseeing Transportation The Fifth Wall Construction GIO Rail Holdings Corporation Rail Transportation Welland, Ontario Keystone Rail Recovery Railroad Equipment Manufacturing Jersey Shore, Pennsylvania Psagot Inc Construction Kostuch Media Ltd. Media Production Toronto, Ontario Tracks Unlimited LLC Construction Mountainside, NJ VORST PAVING INC Construction CLOVERDALE, Ohio Camino Construction Construction Vaughan, Ontario Show more similar pages Show fewer similar pages LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Iron and Oak Railroad Services Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.ironoakpost.com/",
      "text": "Iron Oak Post × Home Events Tickets Our Menu Contact 2023 Melbourne Ct.  Melbourne, FL 32901 NEW HOURS: Sun/Mon/Tue/Wed 4:30pm-12am | Thu/Fri/Sat 4:30pm-*2am (Close) Call Us: (321) 327-8356 Home Events Tickets Our Menu Contact Welcome to Iron Oak Post Bar & Bistro Whether you're craving some delicious food and a cold craft beer to wash it down, a band playing your favorite covers, or need an event space... We have it all! see menu book your event The Iron Oak Post building was Melbourne's 5th post office from the 1920's until the 1950's. The original owner wanted to keep as much of the original feel as possible; The old wood floors are original and the bar is built entirely of reclaimed wood from the old post office building. PO box doors dating back to the 1800's line the walls in hopes of bringing a sense of nostalgia for our guests. The original post office safe is still in the building,  unopened.... Event Space Learn More Live Music Book your band! 52 Taps & Signature Drinks Explore the Bar ENJOY AN UNFORGETTABLE EXPIRIENCE Weekly Events: MONDAY - Muggy MonDaze - 9pm to *12am TUESDAY -  Special Evening Events WEDNESDAY - Trivia Night hosted by SCEE - 8pm to 11PM THURSDAY - Karaoke hosted by SCEE - 8pm to 11PM FRI / SAT - Music, Comedy, & Private Events - 6pm to 2am SUNDAY - NFL (During Season) - 1pm to 11pm ... more event info ... Welcome to Iron Oak Post Iron Oak Post is a full liquor and craft beer tavern located in downtown Melbourne, Florida.\r\nWe offer a combination of 52 craft beers, house made cocktails, ciders, and meads on tap. We look forward to *SERVING* your needs! Visit 2023 Melbourne Court Melbourne, FL  32901 (321) 327-8356 derek@ironoakpost.com Hours SUN/MON/TUES/WED: 4:30pm - 12am THU/FRI / SAT: 4:30pm - *2am (Close) About Reservation Policy Privacy Policy Health & Safety FAQ"
    },
    {
      "url": "https://ironoak1.com/contact/",
      "text": "Contact – Iron Oak Skip to content Menu Logo Borrowers Guidelines & Info Payments Why, What, Who Borrowers Forms Loan Application Borrowers Authorization ACH Withdrawal Form Basic Needs List Borrower Investors Invest With Us Become a Trust Deed Investor Become a Fund Partner Investor Login Fund Partner Login Brokers Business Purpose Broker Package Consumer Broker Package Submission Form Apply Now Avoid Foreclosure Contact Contact 925-803-2460 About Contact Contact Us Rich Mendoza Rich@IronOak1.com 925-803-2465 OFFICE 925-281-2809 FAX Connect with Rich on LinkedIn Christy Mathers Christy@IronOak1.com 925-803-2461 OFFICE 925-281-2809 FAX Connect with Christy on LinkedIn Keith Videtto Keith@IronOak1.com 925-803-2467 OFFICE 925-281-2809 FAX Connect with Keith on LinkedIn Linda Maes Linda@IronOak1.com 925-803-2463 OFFICE 925-281-2809 FAX Jill Jepson Jill@IronOak1.com 925-200-1741 OFFICE 925-281-2809 FAX Alanah Forrest Alanah@IronOak1.com 925-400-9022 OFFICE 925-281-2809 FAX Lupita Sedano Lupita@IronOak1.com 925-803-2462 OFFICE 925-281-2809 FAX Chris Mathers Chris@IronOak1.com 925-803-2474 OFFICE 925-281-2809 FAX Scott Liming Scott@IronOak1.com 925-803-2475 OFFICE 925-281-2809 FAX Devon Mendoza Devon@IronOak1.com 925-400-9670 OFFICE 925-281-2809 FAX Andrew Butler Andrew@IronOak1.com 925-400-9671 OFFICE 925-281-2809 FAX Jessica Johnson Jessica@IronOak1.com 949-632-9549 OFFICE 925-281-2809 FAX 5627 Stoneridge Dr, Suite #314 Pleasanton, CA 94588 Go to top CLICK HERE TO SIGN-UP FOR EMAIL UPDATES Call Today for a FREE Consultation! Name (required) Email (required) Phone Comments Real Estate Broker –  CA Dept of Real Estate – DRE #01299684 - NMLS #356760 Copyright © 2024 Iron Oak Home Loans, Inc.  All Rights Reserved. Terms | Privacy | Sitemap | \nBoomcycle Digital Marketing"
    },
    {
      "url": "https://ironoakcapital.com/contact-us",
      "text": "Contact Us | Iron Oak Capital Management Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Signed in as: filler@godaddy.com Home Contact Us Insights Account My Account Sign out Sign In My Account Contact Us Contact Us We Look Forward to Hearing from You! Get in touch with us by email or phone. We value your business and look forward to speaking with you soon. Iron Oak Capital Management El Paso, Texas, United States 210.836.9971 sonny@ironoakcapital.com Hours Open today 08:00 am – 05:00 pm Copyright © 2013-2024 Iron Oak Capital Management - All Rights Reserved. Powered by GoDaddy Contact Us Compliance This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://landofoakandiron.org.uk/contact/",
      "text": "Find Us and get in touch – The Land of Oak & Iron Skip to content Explore, Heritage, Events & Cafe 01207 524898 Google Map Café & Shop Cafe Enjoy a delicious meal inspired by the North East’s incredible produce Shop Browse products from our talented local artists and makers Meet the Maker Our monthly showcase for local artists Gallery Visit the Inside Out Gallery, our local art exhibition Events Visit Hire Space Explore Our Heritage Industry Explore the Industrial heritage of The Land of Oak & Iron Landscape Find out more about the landscape of The Land of Oak & Iron Culture & People Get to know the culture and people who built The Land of Oak & Iron The Land of Oak & Iron Trust Promoting the conservation, protection and enhancement of the natural, industrial and cultural heritage of the Land of Oak & Iron News About Contact 01207 524898 Google Map Cafe & Shop Cafe Shop Meet the Maker Inside Out Gallery Events Visit Hire Space Explore our Heritage Industry Landscape Culture & People The Land of Oak & Iron Trust News About Us Contact Us Google Maps Find Us and get in touch How to find us By Car We are located on the A694 in Winlaton Mill, at the traffic lights opposite Winlaton Mill Garage From the A1 take the A694 exit towards Consett. Parking We have on site parking to the front and the side of the carpark. You can also park further away and enjoy a nice walk through Derwenthaugh Park to the Heritage Centre with additional parking to be found at Spa Well and Dam Head carparks. By Foot We are situated on the Derwent Walk Country Park at Winlaton Mill, near Blaydon-on-Tyne. Why not stop off at café shrub with your four legged friend as we’re dog friendly! By Cycle Conveniently located on the C2C route 14 at Winlaton Mill. We have visible bikes racks from inside the café and also handy spares and puncture repair kits! By Public Transport There are frequent Red Kite 45/46/47 bus link from Eldon Square/ Newcastle Central Station/ Metrocentre/ Consett to Winlaton Mill Garage. Contact Details T: 01207 524898 E: landofoakandiron@groundwork.org.uk The Land of Oak & Iron Heritage Centre Spa Well Road Winlaton Mill Blaydon upon Tyne NE21 6RU Home Cafe, Exhibitions & Shop Book Events Hire space About News Our Trust Contact & Directions Opening Times 9:00am to 4:00pm 7 Days a week Our socials Facebook Instagram landofoakandiron@groundworks.org.uk 01207 524898 Winlaton Mill near Blaydon. NE21 6RU The Land of Oak & Iron, hosted by Groundwork NE & Cumbria has delivered over £5million+ investment in local communities; their natural, cultural and industrial heritage. Thanks to National Lottery players and funding from the National Lottery Heritage Fund along with other matched funders: see Our Supporters page Charity Registration Number Groundwork NE & Cumbria 1017706 © 2025 The Land of Oak & Iron · Privacy Policy · Site Map We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Scroll to top Scroll to top Close GDPR Cookie Settings Privacy Overview Strictly Necessary Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Enable All Save Settings"
    },
    {
      "url": "https://tangyoak.com/pages/about-us",
      "text": "About Us – TangyOak Skip to content X One-Stop For Home Décor Lovers DECOR SALE LIVE X New Decor Styles ! Shop Now 🎉 FLAT 10% OFF 🎉 Use Code Tangy10 at checkout 🛒 INR EUR USD GBP SEK Wall Clocks Wall Decor World Maps Paintings Photo Frames Lamps & Mirrors Name Plates Giftings Chairs & Sofa Temples Carpets Shelves 0 0 ABOUT TANGYOAK “Decor enables us to find ourselves and lose ourselves at the same time.”- Thomas Merton WHY TANGYOAK? We’re the Jarvis to your Iron Man, the Chandler to your Joey, the Luke to your Leia, the Bam-Bam to your Pebbles… we could go on. We’re here to give shape to your ideas.  \nWe started Tangy Oak with a vision - to make a million homes beautiful.\nBack then, our catalog featured just 35 designs. Yet, when our customers shared\nphotographs of their homes, we saw they were remarkably distinct. The same Decors, The same Gifts were used differently by different people. This told us something. People want their homes to be unique. We also realised that people are a lot happier creating things than they are buying things. We are a creative, imaginative, expressive species. And our homes are just one of the many canvases we have at our disposal. Today, we understand that we’re here not just to sell well-designed products. We’re here to help you with products that connect with your personality & that mirror who you are. - Team TangyOak Bringing Happiness to Homes. TangyOak.com Mumbai Maharashtra India Info@Tangyoak.com (+91) 9326462077 Follow on Facebook Follow on Instagram Information About Us Privacy Policy Terms of Service Return/Refund Policy Contact Us Corporate/Bulk Orders Reviews Categories Home Paintings Frame Sets Wall Clocks Wall Art Name Plates Lamps Lights & Chandeliers Gifts Wall Shelves Decor Gifts Birthday Gifts Anniversary Gifts Wedding Gifts Customised - Picture Frame Coasters Earrings Mugs CellPhone Stands Journals Key Holders Keychains Wall Art Premium Wooden WallArt Acrylic Wall Art Religious Wall Art Paintings Frame Sets Maps Affordable Decor Minimum 15% OFF Under ₹1799 Copyright © 2025| All Rights Reserved - TangyOak.com - Made with 🧡 by AdScalar Sunday,Monday,Tuesday,Wednesday,Thursday,Friday,Saturday January,February,March,April,May,June,July,August,September,October,November,December Not enough items available. Only [max] left. Add to Wishlist Browse Wishlist Remove Wishlist Shopping cart Your cart is empty. Return To Shop Enable cookies to use the shopping cart Add Order Note Edit Order Note Subtotal: ₹ 0 Tax included and shipping calculated at checkout View cart Check Out Add Order Note Edit Order Note New Art Filter 0 Cart Search"
    },
    {
      "url": "https://www.ironassociates.com/contact-us",
      "text": "Get in Touch with Iron Associates | Contact Us Today top of page info@ironassociates.com 877-751-7893 ABOUT SERVICE AREA INDUSTRIES OIL & GAS POWER GENERATION CHEMICAL FACILITIES MANUFACTURING FOOD PROCESSING SMALL BUSINESSES SERVICES LEAK DETECTION LASER ALIGNMENT METAL FABRICATION PIPE FITTING WELDING MAINTENANCE MILLWRIGHTING CONDITION MONITORING CONTACT BLOG More Use tab to navigate through the menu items. CONTACT IRON ASSOCIATES, INC. Contact Us If you have any comments, questions, and/or concerns, please use the contact information below to reach us. You can also utilize our convenient online quote form to request pricing for the many services offered. ​ Address : Iron Associates, Inc. 3010 Lycoming Creek Road Williamsport, PA 17701 Telephone : 877-751-7893 E-mail: info@ironassociates.com Drop us a message! Submit Iron Associates Iron Associates, Inc., is a full-service mechanical contractor specializing in steel construction, welding, and fabrication. Contact Us 877-751-7893 Follow Us On Social info@ironassociates.com Iron Associates, Inc. 3010 Lycoming Creek Road Williamsport, PA 17701 ​© 2025 All Rights Reserved By Iron Associates, Inc. | Privacy Policy Website design by LeaseMyMarketing (570) 487-3760 bottom of page"
    },
    {
      "url": "https://artistandfan.com/venues/venues/view/iron-oak-post",
      "text": "Venue Iron Oak Post, Melbourne Florida USA onArtistAndFan ArtistAndFan home Home Articles Features Shows Videos Newsletter Press Releases Sponsors Advertise check_circle_outline Sign Up check_circle_outline Sign In home Home Articles Features Shows Videos Newsletter Press Releases Sponsors Advertise check_circle_outline Sign Up check_circle_outline Sign In Account search I AM SEARCH SOCIAL WIDGET Home Features Venues Iron Oak Post Iron Oak Post Share Become a Member check_circle_outline Sign Up Become a member and claim this Profile or create your own! Venue Contacts Promoter Photos Iron Oak Post Venue Type Club Melbourne Florida USA Marketplace Melbourne Styles All Styles Region Southeast Primary Contact Mike Fears Email mike@ironoakpost.us Alternate Contact Promoter Buyer External links Website https://ironoakpost.us/ Facebook https://facebook.com/IronOakPost/ Instagram https://instagram.com/ironoakpost/ Twitter YouTube Linkedin Mailing Address Iron Oak Post 2023 Melbourne Court Melbourne FL 32901 Phone (321) 327-8479 Promoter Buyer Capacity Seats 300 Venues They Book Dates When To Contact Age Limit 21+ Notes About \"A unique overgrown industrial post office themed pizza kitchen and tavern with 77 craft beer, cider, and handmade cocktail taps, full liquor bar, wine, live music, located in downtown Melbourne. We are the perfect place for private events.\" All Styles Iron Oak Post Staff Name Mike Fears Iron Oak Post Promoter Name Company Mike Fears Iron Oak Post Photos Venues Newsletter Signup × Sign up forArtistAndFan Newsletters Keep in touch with everything onArtistAndFan. Sign up for our newsletter! Sign up Close Newsletter Signup × Sign up forArtistAndFan Newsletters Keep in touch with everything onArtistAndFan. Sign up for our newsletter! Sign up Close Stats Elapsed time: 0.1329 seconds Memory useage: 3.03MB V2.geronimo ArtistAndFan News Articles Features News, Assets and Resources for Music Business Professionals About ArtistAndFan Terms of Service Privacy Policy Customer Service Contact Us Get In Touch Send a message We welcome your inquiries ©\r\n          2019-2025 ArtistAndFan All Rights Reserved."
    },
    {
      "url": "https://thirdiron.com/contactus/",
      "text": "Contact Us - Third Iron BrowZine LibKey Get Started Try BrowZine Now Subscribe to Third Iron Request an Evaluation Schedule Training Success Guide API News & Articles LibKey Nomad++ Support Contact Us Home | Contact Us Contact Us We want to hear from you We’re here to answer any questions you have. We’ll get back to you as soon as we possibly can, usually within a day. Your name * Your email * Institution or library name Reason for contacting us Choose One Product Support Sales Inquiry Other (explain in message below) What's on your mind? * captcha * Required field Comments This field is for validation purposes and should be left unchanged. Send your message  Email sales@thirdiron.com  Telephone 855-649-7607  Address PO Box 270400 St. Paul, MN 55127 Sign up for the Third Iron Newsletter: Email * CAPTCHA Phone This field is for validation purposes and should be left unchanged. Sign Up Company About Us News Patent Products BrowZine LibKey Resources Success Guide Download BrowZine Download Nomad Support Get support Knowledge Base Accessibility Website Privacy Policy Application Privacy Policy Schedule Training Upload Holdings Contact Us 1-855-649-7607 info@thirdiron.com Copyright © 2024 · Third Iron LLC Follow Follow"
    }
  ]
}