{
  "fuentes": [
    {
      "url": "https://fusiongcm.com/contact/",
      "email": "theoffice@fusiongcm.com"
    },
    {
      "url": "https://www.mainstreetdailynews.com/govt-politics/gnv-study-ironwood-plan",
      "email": "seth.johnson@mainstreetdailynews.com"
    },
    {
      "url": "https://www.mainstreetdailynews.com/govt-politics/gnv-study-ironwood-plan",
      "email": "editor@mainstreetdailynews.com"
    },
    {
      "url": "https://www.ironwoodgolfcourse.org/facility-rentals/",
      "email": "ironwood@cityofgainesville.org"
    },
    {
      "url": "https://www.ironwoodgc.com/leadership-team/",
      "email": "jan@jankleimangolf.com"
    },
    {
      "url": "https://www.ironwoodgc.com/leadership-team/",
      "email": "jason@indygolfpro.com"
    },
    {
      "url": "https://www.golfwisconsin.com/articles/course-profile-interview-3-ironwood-golf-course",
      "email": "ironwoodmike@yahoo.com"
    },
    {
      "url": "https://ironwoodgolfcenter.com/",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.ironwoodgolfcourse.org/contactus/",
      "email": "ironwood@cityofgainesville.org"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "email": "info@clubcaddie.com"
    },
    {
      "url": "https://www.mint-valley.com/contactus/",
      "email": "golfproshop@ci.longview.wa.us"
    },
    {
      "url": "https://www.mint-valley.com/contactus/",
      "email": "golfproshop@mylongview.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/ironwood-golf-course/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/ironwood-golf-course/",
      "email": "ironwood@cityofgainesville.org"
    },
    {
      "url": "https://www.1golf.eu/en/club/ironwood-golf-course/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://www.golfironwood.com/contactus/",
      "email": "golfironwood@yahoo.com"
    },
    {
      "url": "https://www.mainstreetdailynews.com/govt-politics/housing-developer-meadowbrook-golf",
      "email": "seth.johnson@mainstreetdailynews.com"
    },
    {
      "url": "https://www.mainstreetdailynews.com/govt-politics/housing-developer-meadowbrook-golf",
      "email": "editor@mainstreetdailynews.com"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "amy.krishka@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "diane.rader@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "gina.cariaga@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "info@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "ironwood-country-club-favicon-medium_1@1.5x.png"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "ironwood-country-club-logo@2x.png"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "josh.tanner@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "krista.simmons@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "laura.stotts@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "marc.dubois@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "mark.sickenberger@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "mike.oberlander@icc.club"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "email": "nate.glaser@icc.club"
    }
  ],
  "mails": [
    "amy.krishka@icc.club",
    "diane.rader@icc.club",
    "editor@mainstreetdailynews.com",
    "gina.cariaga@icc.club",
    "golf-club-detail@2x.png",
    "golfironwood@yahoo.com",
    "golfproshop@ci.longview.wa.us",
    "golfproshop@mylongview.com",
    "info@belfairsgolfclub.co.uk",
    "info@clubcaddie.com",
    "info@icc.club",
    "ironwood-country-club-favicon-medium_1@1.5x.png",
    "ironwood-country-club-logo@2x.png",
    "ironwood@cityofgainesville.org",
    "ironwoodmike@yahoo.com",
    "jan@jankleimangolf.com",
    "jason@indygolfpro.com",
    "josh.tanner@icc.club",
    "krista.simmons@icc.club",
    "laura.stotts@icc.club",
    "marc.dubois@icc.club",
    "mark.sickenberger@icc.club",
    "mike.oberlander@icc.club",
    "nate.glaser@icc.club",
    "seth.johnson@mainstreetdailynews.com",
    "team@latofonts.com",
    "theoffice@fusiongcm.com",
    "travel@albrecht.de"
  ],
  "nombre_sitio": "ironwoodgolfcourse.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://fusiongcm.com/contact/",
      "text": "Contact - Fusion Golf Call Us On 1-281-845-7117 Home About Services Contact Call us :  281-845-7117 Contact Home Contact Contact Details Texas: 19901 Southwest Freeway Sugarland, Texas 77479 Office: 1-832-995-0203 Fax: 1-281-305-4617 Resume submittal: theoffice@fusiongcm.com Send Us A Message Feel free to ask any golf course construction questions over the phone, or get in touch via our contact form below. Your message will be dispatched directly to our TEAM who will answer as soon as they can. Your Name * Your Email Address * The Subject Your Phone Number * Message * Fields marked with a * are required 2+2=? Home About Services Contact Call us :  281-845-7117 19901 Southwest Freeway Sugarland, Texas 77479 Office: 1-281-845-7117 Fax : 1-281-845-7118 Click here Copyright © 2025 Fusion Golf. All rights reserved"
    },
    {
      "url": "https://www.mainstreetdailynews.com/govt-politics/gnv-study-ironwood-plan",
      "text": "GNV to study Ironwood, present plan next year Skip to content Become a Member Become a Member Home Jobs 27 News All News Local News Business Government + Politics Elections Covid-19 Education Health Crime National News Sports All Sports News All Area Teams Athlete of the Week Local Sports Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month All Local Living Events Outdoors History Florida Finds Faith + Inspiration Obituaries Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print edition locations Newspaper Delivery Search Jobs 27 News Local News Business Government + Politics Elections Education Covid-19 Health Crime National News Sports All Area Teams Athlete of the Week Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month Events Outdoors Health Faith + Inspiration History Florida Finds Obits Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print Edition Locations Newspaper Delivery Menu Jobs 27 Events News Sports Obits Cars close Get Our Free Newsletter Government + Politics GNV to study Ironwood, present plan next year Seth Johnson Jun 20, 2023 9:14 pm Ironwood Golf Course Courtesy city of Gainesville After initially removing Ironwood Golf Course from the proposed budget, the city of Gainesville has placed the municipally owned course onto a watch list, giving a year to solve issues. City Manager Cynthia Curry told the commission at its regular meeting on Thursday that the golf course will be under a management watch. By the first of the year, she said the city hopes to present recommendations to the commissioners. Curry said city staff and experts in the field will come up with a list of problems that the city needs to address about the golf course and then find solutions. Become A Member Mainstreet does not have a paywall, but pavement-pounding journalism is not free. Join your neighbors who make this vital work possible. See Member Benefits The City Commission can then give directions based on staff recommendations for the 2025 fiscal budget. Courtesy city of Gainesville Cynthia Curry Mayor Harvey Ward said cities operate golf courses in a variety of ways and many have opened and closed over the years. “It’s important that we think critically, as the board for our community, of exactly how we’re doing it,” Ward said. He added that the city should review its operation of the course periodically. When staff returns, Ward said he wants data on who uses the golf course and its operations to inform votes. City staff will also present information on the impact of increasing fees. The potential of losing the Ironwood Golf Course prompted community concern, and several public commentors spoke on the importance of the city amenity. Some said players would support moderate fee increases to help sustain the course. After hearing the news, Bev Caley and around 15 other residents met to discuss Ironwood. They formed an informal Help Save Ironwood group and started to advocate for the course, gathering more than 1,000 signatures in a week. “I would prefer to have a golf course here, but for me, it’s more of an inconvenience,” Caley said in a phone interview. She said she can drive to Ocala to play and make do. But, many in community may not have that option—especially for youth. The group points out that four local high schools use the course to practice and at-risk youth programs also operate there. It’s also one of two public courses in Alachua County—compared to 18 in Marion County. Caley said the city should promote the golf course and all the programs that run from the site. She also pointed to the impact on organizations that use Ironwood to hold fundraisers and events, with around 50 tournaments each year. One tournament, “The Bob,” raised more than $30,000 last year for Stop Children’s Cancer, Caley said. Courtesy City of Gainesville Desmon Duncan-Walker Caley supports raising the price. In a press release, Help Save Ironwood noted that a $5 increase per round would generate $220,000 in additional revenue while remaining competitively priced. In 2023, the city of Gainesville operated over a $750,000 budget for Ironwood. Commissioner Desmon Duncan-Walker said she would like to see information on price increases, but she said management needs to balance that increase with keeping the course an option for at-risk youth and other services. “I am concerned about how this increase in fees can happen but also keeping it affordable to some of the populations that would want to be introduced to this,” Duncan-Walker said at Thursday’s meeting.” There are already some amazing programs that I know are already coming out of Ironwood that serve at-risk youth.” She said that concern comes as the city has already cut millions from its parks and recreation budget. In the past several years, the public has lost access to two Alachua County courses. West End Golf Course was closed in 2019 and Meadowbrook closed its doors because of flooding issues in 2021. Since closing, the Meadowbrook owner proposed a two-story driving range to increase the viability of his course. The West End owner proposed building a 70-unit neighborhood on the site , but the Alachua County Board of County Commissioners denied the application. Share this post: Share on X (Twitter) Share on Facebook Share on Email Tags: Alachua County Board of County Commissioners Bev Caley Budget City of Gainesville Cynthia Curry Desmon Duncan-Walker Gainesville City Commission Harvey Ward Help Save Ironwood Ironwood Golf Course Meadowbrook Golf Course Stop Children’s Cancer golf tournament West End Golf Club Seth Johnson Seth Johnson is a Mainstreet Daily News associate editor based in Gainesville. He earned a degree in journalism and mass communication and served as editor-in-chief of his school newspaper. Seth is a bookworm and chess nerd, but he tempers these activities by playing sports and biking. View all posts Subscribe Notify of new follow-up comments new replies to my comments Label Name* Email* Website Label Name* Email* Website 0 Comments Oldest Newest Most Voted Inline Feedbacks View all comments Featured Local Savings Sign Up Local news in your inbox. Newsletter Form (#3) Subscribe Email Join Free Got a news tip or story? Let us know Recent Job Openings Senior Environmental Specialist (Land Conservation) Alachua County Board of County Commissioners Part-time Police Officer Santa Fe College Sustainability Manager Alachua County Board of County Commissioners Conestogas – Night Grill Cook Conestogas Restaurant Pretrial Officer – Pretrial Services Alachua County Board of County Commissioners Post A Job | View All Jobs Events Most Read High Springs teenager dies after motorcycle collides with car UF/IFAS to aid Florida farmers switching to bamboo crops Certain, Democrats criticize antisemite ‘on pedestal’ High Springs withdraws criticism of Alachua County Fire Rescue, cites misinformation Gainesville votes to demolish Thelma Boltin Center after price spike Chiefland teen dies in collision with semi Alachua County has 6 official scenic roads, Newnans Lake residents want another High Springs man sentenced to 10 years for child pornography distribution Motor Marketplace 2024 Volkswagen Jetta SEL Automatic $ 24,885 15K Miles Tomlinson Motor Company View Vehicle 2023 Nissan Altima 2.5 SV Sedan $ 19,985 56K Miles Tomlinson Motor Company View Vehicle 2023 Hyundai IONIQ 5 SEL RWD $ 25,985 23K Miles Tomlinson Motor Company View Vehicle 1 2 3 … 69 Next » View All Inventory Member-supported Mainstreet Daily News keeps you informed about news, sports and events, so you can stay safe, cast informed votes, and be a better neighbor in Alachua County and the surrounding area mainstreetdailynews.com 100 NW 76th Drive #2 Gainesville, FL 32607 Phone: 352-313-3150 Email: editor@mainstreetdailynews.com Discussion and Submission Guidelines Terms of Use Privacy Policy Contest Rules Cookie Notice 2024 Community Impact Report Public Notice Certification X Get Our Daily Newsletter Local news delivered right to your inbox Mobil Modal Newsletter Form Notify Email Submit Become a Member! Mainstreet does not have a paywall, but journalism is not free. Join your neighbors who make this work possible. See Member Benefits close arrow-circle-o-down chevron-left chevron-right facebook-square angle-down ellipsis-v instagram square-x-twitter cross menu wpDiscuz Insert"
    },
    {
      "url": "https://www.ironwoodgolfcourse.org/facility-rentals/",
      "text": "Facility Rentals - Ironwood Golf Course Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Ironwood Golf Course Book Tee Times Home Tee Times About Us Rates Scorecard Course Photos Leagues Golf Lessons Junior Programs Flyover Email Club Events Upcoming Events Facility Rentals Audubon Sanctuary Contact Us GPS PRCA Home Page Facility Rentals Facility Rentals This spacious clubhouse is the perfect place for your next event! Whether it be a wedding reception, birthday party, office meeting, or an intimate place to meet with friends, Ironwood’s clubhouse has seen it all. For more info or to book your event, please call 352-393-8502 or email ironwood@cityofgainesville.org Meeting/Birthday/Party Room Rental Rates Half Room (60 people max) Full Room (175 people max) Monday – Thursday (DAYTIME) -$99.25/hour Monday – Thursday (DAYTIME) – $110.25/hour Monday – Thursday (EVENING) – $77.25/hour Monday – Thursday (EVENING) – $132.25/hour Friday (DAYTIME) – $99.25/hour Friday (DAYTIME) – $110.25/hour Friday (EVENING) – $132.25/hour Friday (EVENING) – $154.25/hour Saturday (DAYTIME) – $121.25/hour Saturday (DAYTIME) – $143.25/hour Saturday (EVENING) – $132.25/hour Saturday (EVENING) – $165.5/hour Sunday (DAYTIME) – $88.25/hour Sunday (DAYTIME) – $110.25/hour Sunday (EVENING) – $121.25/hour Sunday (EVENING) – $143.25/hour *Room Rental Rates Do Not Include Sales Tax* Evening hours begin at 6 p.m. All food and beverage must be provided by Classy Chics due to our license requirements. NO OUTSIDE FOOD OR DRINKS! All Ironwood rentals require a nonrefundable 20% reservation fee. Rental fee includes setup/cleanup of room, access to tables and chairs. You may bring in outside decorators for an event and they can use linens, banners, etc… but must take with them upon the conclusion of the event.  If hiring a decorating company, an additional rental agreement must be turned in prior to the date of the event. Holiday Parties Holiday Parties Holiday Parties Holiday Parties Alice in Wonderland-Themed Dance (with round tables) Alice in Wonderland-Themed Dance (with round tables) Alice in Wonderland-Themed Dance (with round tables) Alice in Wonderland-Themed Dance (with round tables) Alice in Wonderland-Themed Dance (with round tables) Alice in Wonderland-Themed Dance (with round tables) Alice in Wonderland-Themed Dance (with round tables) Primary Sidebar Weather ironwood's weather Course News Call 352-393-8500 to make a tee time! Looking for a venue for your next event? Call 352-393-8501 for availability of our beautiful banquet room! Ironwood is perfect for all events, from intimate celebrations to large corporate meetings. Footer Ironwood Golf Course | 2100 NE 39th Ave, Gainesville, FL 32609 | (352) 393-8505 Copyright © 2025 Ironwood Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.ironwoodgc.com/leadership-team/",
      "text": "Leadership Team - Ironwood Golf Club Skip to primary navigation Skip to main content Facebook Twitter Rates Online Store Ironwood Golf Club Home Course Ironwood Scorecard Leadership Team Facilities Handicap Login Shop Rates Rates Book Online 2026 Memberships Lessons/Juniors Lessons Junior Golf Events Fantasy Golf Challenge Room Rental Golf Outings Golf Outing Packages Golf Outing Form Leagues Men’s League Information Men’s League Login Ladies Leagues Ladies Leagues Login 2025 Wednesday Night Ladies League Contact Contact Us Employment Opportunities Leadership Team Scott Heger Director of Golf , Class A PGA Professional 317-413-8866, heger.scott@gmail.com Scott Heger is the Director of Golf at Ironwood Golf Club. Scott Heger brings his golf expertise from Minnesota where he graduated from Minnesota State University. A PGA Member since 1996, Scott was the Wood Wind Golf Club Director of Golf from 2007 – 2015. Scott was recently named the 2013 PGA Merchandiser of the Year by the Indiana Golf Association. Jason Armstrong Head Golf Professional, Class A PGA Professional jason@indygolfpro.com Jason is the Head Golf Professional at Ironwood Golf Club. Previously, Jason was the Wood Wind Golf Club Head Golf Professional from 2012 – 2015 and an Assistant Golf Professional since 2009. He is originally from Washington State where he received a bachelor’s degree from the University of Washington. Jason also received a MBA from Baker College. His specialty is in club repair, club fitting, and lessons. Brian Readout GCSAA Class A Superintendent ironwoodsuper@gmail.com Brian is the Golf Course Superintendent at Ironwood golf Club. He is a graduate of The Ohio State University with a bachelor’s degree in Turfgrass Management. Originally from Grove City, Ohio, Brian has worked at various private clubs throughout the central Ohio area. He is currently working toward becoming a Certified Golf Course Superintendent and it is his goal to bring prestigious playing conditions to Ironwood Golf Club. Follow Brian and what’s going on at the golf course on Twitter! Click here to follow . Jan Kleiman LPGA Teaching Professional, Top 50 in the World US Kids Instructor jan@jankleimangolf.com Jan returned to Indiana in 2012 after spending over 25 years in Florida teaching golf and playing competitive golf. The native of Rushville, IN moved to Florida in 1984 after graduating from Indiana University with a BS in Business Management. She played on the LPGA Tour for three years, competed in seven U.S. Women’s Opens and won twice on the Future’s Tour. She was also the low qualifier for the Legends Tour in 1996. In 1994 she began teaching at the Ben Sutton Golf School outside of Tampa. During sixteen years there, Jan taught golfers of all abilities that came to the school from all over the world. She was the Director of Instruction there her last two years. She has also been a teaching professional with Advantage Golf Schools in Orlando. Jan started her own golf instruction business in 2010 and continues that in Indiana. She gives private lessons, group lessons, playing lessons and clinics at Ironwood. Jan is the 2015 Indiana PGA Open Champion and in 2019 was recognized as a TOP 50 Kids Coach in the World! Page Footer Contact Info Address : 10955 Fall Road Fishers, IN 46038 Phone : 317-842-0551 Copyright © 2025  Ironwood Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.golfwisconsin.com/articles/course-profile-interview-3-ironwood-golf-course",
      "text": "COURSE PROFILE INTERVIEW 3: Ironwood Golf Course By Brian Weis Golfer Login | Register MENU ✕ Home Courses Golf Course Directory Golf Course Map Top Golf Courses Most Recommended Courses Golf Resorts Directory Golf Communities Casino Golf Guide Golf Lessons/Instruction Ranges, Stores and Facilities Indoor Golf Simulators Executive and Par 3 Putting Courses Golf Course Social Media Golf Course Mobile Apps Destinations Golf Guides & Destinations Apostle Islands - Madeline Island - Bayfield Door County Fond du Lac Fox Valley Green Bay Green Lake Hayward Hudson Kohler Lake Geneva Madison Milwaukee Port Washington Racine - Kenosha River Falls Sheboygan Stevens Point - Wisconsin Rapids Golf Trails Brew City Golf Trail Central Wisconsin Golf Trail Great River Golf Trail Lake Geneva Golf Trail Wisconsin Golf Trail Wisconsin Northwoods Golf Trail Other Golf Guides Golf Course Map Casino Golf Guide Golf Resorts Directory Stay and Play Packages Golf Travel Ideas Packages Deals Golf Deals & Specials Free Birthday Golf Stay and Play Packages Gift Cards & Advanced Rounds Golf Memberships Online Tee Times Tee Times Travel Golf Stay and Play Packages Golf Package Providers Golf Travel Ideas Trips and Destinations Free Golf Travel Quote Ship My Golf Clubs Articles/Videos Featured Articles Featured Videos Course Videos 360 Virtual Reality Events View Outings and Events Post/Promote An Event Plan A Golf Outing Courses Who Host Outings Course Wedding/Banquet Hall Contact Travel Quote COURSE PROFILE INTERVIEW 3: Ironwood Golf Course COURSE PROFILE INTERVIEW 3: Ironwood Golf Course By Brian Weis Golf Course Overview: Ironwood Golf Course Insights From An Insider With  Mike Lehmann, Director of Golf ironwoodmike@yahoo.com Local and traveling golfers love to research courses before playing them, whether it is to gain some local knowledge or to set an expectation before their upcoming round. Below is an interview with Mike Lehmann who shares some valuable insight about the property, its most talked about holes and the signature dish/drink to consume at the 19th hole. Provide a brief description of the golf course/property, the terrain and best times of the year to play. Ironwood golf course, located in Sussex, WI, has three nine hole courses made up of natural rolling terrain. Each nine challenges to each aspect of your game. Our first nine, The Callow is highlighted by three heavily wooded holes; seven, eight, and nine. This may prove to be the most demanding 3 hole stretch you will play. The Meath, our second nine, has a short par 4 and dogleg par 5s, allowing you multiple ways to position yourself with either safe bailouts or gut-wrenching risks! Our final nine, The Birr is one of the most intriguing courses you will play. With numerous blind shots, sloping fairways, and water factoring in on 7 of the 9 holes, the Birr demands shot-placement. The best time to play at ironwood, is all the time! Share with golfers, your most recent awards and golf course improvements. Monday through Sunday we host charity golf outings, along with golf leagues every week night across all 27 holes. Never a dull day! Any tips on playing and reading the greens? Hitting the driver is not needed teeing off on a majority of the holes. Shot placement is a necessity to shoot a low score. Greens do not break as one may think! Starting on hole #1, are there any tips to get your round off on the right foot? Tee it high and let if fly! What is your favorite par 5, and how would you recommend playing it? 3 Birr is the hardest and most rewarding par 5. This par 5 requires a precise drive. Water on the right forces you to play the left side. The second shot, you have more options than one. If you chose to hit the green on you second shot, you are in good shape to get an eagle! What is your favorite par 3, and how would you recommend playing it? 7 Meath is the best par 3 at Ironwood. Hitting a fade to the middle of the green will give a great opportunity for birdie! In your opinion, what is the hardest hole and do you have any tips on playing it? 7 Callow is the toughest hole on the entire golf course. This dog left right, uphill tree line par 5 is best with an iron. As a golfer plays the final three holes, is there a chance for salvation? (any tips on closing out the round?) Hunker down and battle out pars! Contact Course Ironwood Golf Course W270N6166 Moraine Drive Sussex, WI, 53089 262-538-9900 More Information » Revised: 10/18/2023 - Article Viewed      4,336 Times  \n    \t- View Course Profile About: Brian Weis Brian Weis is the mastermind behind GolfTrips.com, a vast network of golf travel and directory sites covering everything from the rolling fairways of Wisconsin to the sunbaked desert layouts of Arizona. If there’s a golf destination worth visiting, chances are, Brian has written about it, played it, or at the very least, found a way to justify a \"business trip\" there. As a card-carrying member of the Golf Writers Association of America (GWAA), International Network of Golf (ING), Golf Travel Writers of America (GTWA), International Golf Travel Writers Association (IGTWA), and The Society of Hickory Golfers (SoHG), Brian has the credentials to prove that talking about golf is his full-time job. In 2016, his peers even handed him The Shaheen Cup, a prestigious award in golf travel writing—essentially the Masters green jacket for guys who don’t hit the range but still know where the best 19th holes are. Brian’s love for golf goes way back. As a kid, he competed in junior and high school golf, only to realize that his dreams of a college golf scholarship had about the same odds as a 30-handicap making a hole-in-one. Instead, he took the more practical route—working on the West Bend Country Club grounds crew to fund his University of Wisconsin education. Little did he know that mowing greens and fixing divots would one day lead to a career writing about the best courses on the planet. In 2004, Brian turned his golf passion into a business, launching GolfWisconsin.com. Three years later, he expanded his vision, and GolfTrips.com was born—a one-stop shop for golf travel junkies looking for their next tee time. Today, his empire spans all 50 states, and 20+ international destinations. On the course, Brian is a weekend warrior who oscillates between a 5 and 9 handicap, depending on how much he's been traveling (or how generous he’s feeling with his scorecard). His signature move\" A high, soft fade that his playing partners affectionately (or not-so-affectionately) call \"The Weis Slice.\" But when he catches one clean, his 300+ yard drives remind everyone that while he may write about golf for a living, he can still send a ball into the next zip code with the best of them. Whether he’s hunting down the best public courses, digging up hidden gems, or simply outdriving his buddies, Brian Weis is living proof that golf is more than a game—it’s a way of life. Follow Brian Weis: Contact Brian Weis: GolfTrips.com - Publisher and Golf Traveler 262-255-7600 More Articles by Brian Weis Kettle Forge Golf Club to Bring Championship Caliber Experience to Ashippun, Wisconsin Fox Hills Golf Resort - Just $109 for Golf & Getaway How To Golf Sand Valley in 2025: Tee Times Are Still Available More Related Articles Interview With JT Thompson PGA/Head Golf Professional Bullseye Golf Club Interview With Jason Hoelz General Manager Western Lakes Golf Club Interview With Kyle Kunash Head PGA Golf Professional Grand Geneva Resort and Spa Share Post Get Social Free Newsletter Past Newsletters FEATURED GolfWisconsin.com is your ultimate local golf directory, bringing you the latest golf news, course reviews, and exclusive stay-and-play deals. Whether you're looking for a hidden gem, the best golf packages, or insider tips, we cover the local golf scene. About || Contact || Privacy || Terms Copyright CityCom Marketing, LLC - GolfWisconsin.com  - All Rights Reserved."
    },
    {
      "url": "https://ironwoodgolfcenter.com/",
      "text": "HOME In-store weekly specials! Save up to 50% off! HOME Weekly Specials ABOUT Our Team Events Our Services Practice Range Testimonials Contact More HOME Weekly Specials ABOUT Our Team Events Our Services Practice Range Testimonials Contact HOME Weekly Specials ABOUT Our Team Events Our Services Practice Range Testimonials Contact Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Ironwood Golf Center Click Here for Details your best game starts here! Click Here for Details your best game starts here! About Us who we are Ironwood Golf Center is a well-renowned driving range and retail shop focused on teaching the game of golf. Our passion for excellence has driven us from the beginning, and continues to drive us into the future. The team at Ironwood Golf Center knows that every player has different needs and strives to make the entire Ironwood experience as rewarding and fun as possible. results-focused teaching Ironwood offers the highest quality instruction to golfers of all ability levels.  We teach golf so you can improve your play and get more enjoyment of out of your game. Custom club fitting We believe that the right tools make learning easier and more effective.  We will not sell the wrong tool to any customer.  Period.  We stand by our product, whether it's lessons or equipment. Our Golf Professionals larry milosh Teaching Philosophy  - What makes a great game? Larry says, “it’s your swing, your mind, and your gear” As a teaching professional for over 23 years, Larry discovered that improving the golf game of others was as satisfying as winning on the course.  His approach to the game includes: -  The golf swing – fundamentals and keeping it simple. -  The right mental approach. -  Properly fitted equipment. Larry began his career as a school psychologist.  This knowledge and experience has contributed to his keen ability as a very effective teacher, coach and motivator. Larry’s patient demeanor, his attention to the finest nuances of your golf swing and the incorporation of the mental side of golf into your game will assure your best game starts here. Larry’s Story Larry’s passion for golf began as a junior golfer in Western PA.   He progressed as a collegiate player at West Virginia Wesleyan University.    Larry quickly established his playing career as a fierce competitor.   He holds over 10 Club Championships, and course record at The Club at Shadow Lakes (62) and Seven Oaks Country Club (65).  Larry has also been a winner of the Turner’s National Golf Tournament,  local qualifier for the U.S. Open, 1st alternate for the U.S. Sr. Open, winner of the Fred Brand Jr. Tournament, and 7 National Championships of the Serb National Federation National Golf Tournament. These accomplishments were a springboard to accomplished coaching career. Larry launched over 25 collegiate level golfers in the last 15 years, and has taught hundreds of men and women of all ages to achieve their best game. As a high school golf coach for 16 years, Larry’s teams’ accomplishments are untouchable.  Under his leadership, the Central Valley High School Girls golf team won 100 consecutive section matches spanning 10 years, 13 Section titles, 5 WPIAL Championships, 3 PIAA State Championships and 1 individual Pennsylvania State Champion.  He also boasts numerous competitors who achieved all state status.  In addition Larry’s girls golf teams won every Mid Atlantic Conference ( MAC) tournament contested during his tenure. Larry’s Journey Golf Professional/Owner, Golf Center at Ironwood:  1995 to Present Central Valley School District, Golf Coach, 2000 to 2016 Director Special Education, St. George School District, St. George, SC School Psychologist, Beaver Valley Intermediate Unit, Freedom, Monaca and Ambridge Area School Districts. Education: M.Ed. in School Psychology, University of GA, Athens, GA. B.S. in Pyschology West Virginia Wesleyan University, Buchannan, WV lesson info Call Larry today to make your best game! Find out more craig morris Craig’s story Craig has been the foundation of Ironwood, along side Larry since 1997, just two years after the opening of The Ironwood Golf Center in Center Township, PA. Craig’s golf passion started at Ironwood, where he borrowed an Ironwood club, hit his first golf ball, and shanked it into a light pole! With passion, discipline and practice, Craig became one of Larry’s top students, and incredibly holds a 4 handicap today.  In 2002 Craig assumed the role of Ironwood Pro Shop Manager.  One word describes Craig…. ownership . Craig owns everything he does with passion and excellence. Under Craig’s guiding hand Ironwood has hired and retained top talent to support our valued customers and business. Craig has developed a strong expertise in 3 key areas to drive the success of Ironwood. 1. The fundamentals of your golf swing. 2. Hiring, managing, and retaining the best talent for the Ironwood Golf Center staff. 3. Determining the right equipment at the right price f or every customer.  For over fifteen years, Craig has worked closely with all golf equipment manufacturers to stay current on the newest products available. Craig became a teaching professional under Larry’s tutelage in 2005. He quickly established himself as a great communicator with an excellent understanding of the fundamentals of golf. Craig knows what it takes achieve your best game. His packed teaching calendar validates the trust his students have in him. Craig has extensive Junior Golf Coaching experience in area high schools for over 16 years. Craig continued the legacy of his mentor and coach, Larry Milosh in 2016, when he added the Central Valley Girls Golf team to his coaching duties. (Craig had been the Warriors Boys coach for two years prior to assuming the Girl’s coaching position)   Under Craig’s leadership the Central Valley boys are consistent play off participants and the girl’s team boasts a PIAA state championship, as well section titles and 1 individual WPIAL champion. Craig’s journey Ironwood Golf Center, Golf Professional and ProShop Manager, 1997 to present Central Valley High School Boy’s Golf Team, Head Coach, 2016 to present Central Valley High School Girl’s Golf Team, Head Coach, 2016 to present Lincoln Park High School Head Golf Coach, 20007 to 2013 Central Valley High School Boy's Golf Team, Assistant Coach, 2003 to 2007 SSI Services, Moon Township, PA, Account Manager, 2001 to 2005 Aetna US Healthcare, Claims Analyst, 1997 to 2001 Indiana University of PA, Business Management Major Lesson info If you are interested in a lesson with Craig, call the Pro Shop to schedule today! Find out more Subscribe Email Address Sign up Contact Us Drop us a line! Name Email* Sign up for our email list for updates, promotions, and more. Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Better yet, see us in person! We love our customers, so feel free to visit during normal business hours. Ironwood Golf Center 3036 Brodhead Road, Aliquippa, PA 15001, US (724) 378-6600 Hours Open today 10:00 am – 08:00 pm Driving range hours are dependent on weather conditions for the safety of our customers. Get directions Events Copyright © 2023 Ironwood Golf Center - All Rights Reserved. Powered by GoDaddy This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.ironwoodgolfcourse.org/contactus/",
      "text": "Contact Us - Ironwood Golf Course Skip to primary navigation Skip to main content Skip to primary sidebar Skip to footer Ironwood Golf Course Book Tee Times Home Tee Times About Us Rates Scorecard Course Photos Leagues Golf Lessons Junior Programs Flyover Email Club Events Upcoming Events Facility Rentals Audubon Sanctuary Contact Us GPS PRCA Home Page Contact Us Contact Us Reserve Tee Times, Click Here Tee times taken up to 10 days in advance First tee time daily is 7:00am! Range Hours: Effective May 1st until November 1st Tuesday, Wednesday & Sunday 7:00am – 8:00pm* Thursday through Saturday 7:00am – 10:00pm* Monday: Closed *Extended hours with lights on the driving range! ( Last bucket sold 30 minutes before closing) Banquet Room Rental Hours: Events can be booked from 8:00am – 11:30 pm Tuesday through Sunday Address: 2100 NE 39th Avenue Gainesville, FL 32609 Phone: 352-393-8500 Email: ironwood@cityofgainesville.org Mailing Address: PO Box 490, Station 23 Gainesville, FL 32627-0490 Primary Sidebar Weather ironwood's weather Course News Call 352-393-8500 to make a tee time! Looking for a venue for your next event? Call 352-393-8501 for availability of our beautiful banquet room! Ironwood is perfect for all events, from intimate celebrations to large corporate meetings. Footer Ironwood Golf Course | 2100 NE 39th Ave, Gainesville, FL 32609 | (352) 393-8505 Copyright © 2025 Ironwood Golf Course All Rights Reserved. Powered by"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "text": "Contact Club Caddie: Get In Touch for Support & Demos Skip to content About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT WITH US REQUEST A DEMO About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT REQUEST A DEMO contact We are available by chat, 24 hours a day, 7 days a week. Just click on the chat message icon in the lower corner of your screen or at the top of the menu and we can answer any question, get you login credentials, provide support, or even give you a full demo of our software. Full Name Email Phone Course or Organization Name Which Best Describes Your Role? -Select- Owner General Manager Director of Golf Head Golf Professional Other Golf Staff Food and Beverage Director Message SUBMIT testimonials What Our Clients Say see more testimonials Start Growing Revenue with Club Caddie Golf Course Solutions Today With tools to streamline every aspect of your golf facility’s operation and a 24/7 support team excited to help you out, improving your course, club or golf business management software has never been easier. Golf operations software is our forte. GET STARTED today Don’t have time right now? Send us a message and we’ll get back to you right away. send us a message Award Winning, All-In-One, Golf Facility Management Software. Menu About Features Contact Privacy Policy Terms & Conditions About Features Contact Privacy Policy Terms & Conditions Resources Services Mission Testimonials About Contact Services Mission Testimonials About Contact Support Knowledge Base Submit Tickets Chat With Us Club Caddie Holdings, Inc. info@clubcaddie.com 18720 Mack Ave, Suite 210, Grosse Pointe, MI 48236 Copyright © 2025 by Club Caddie Holdings, Inc, Powered by Club Caddie Privacy Policy Terms and Conditions Facebook Footer [main Template] Linkedin Scroll to Top We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. I agree"
    },
    {
      "url": "https://www.mint-valley.com/contactus/",
      "text": "Contact Us - Mint Valley Golf Course Skip to primary navigation Skip to main content Mint Valley Golf Course Longview, WA Tee Times Book Online Rates Pass Sales Lessons/Services Instruction/Lessons The First Tee Affiliation First Tee Coaches About About Us Scorecard Club Membership Email Club Area Information Facilities Mint Valley Golf Course Longview, WA Tournaments/Events Tournament & Event Schedule Tournament Flyer Hold A Tournament Moe’s Grill Contact Contact Us Hold A Tournament Book Now Contact Us Mint Valley Golf Course 4002 Pennsylvania St, Longview, WA 98632 Phone 360.442.5442 Open seven days a week year round Summer Pro-Shop Hours: Monday-Sunday: 6am-8pm Moes Grill hours: Thursday-Saturday: 11am- 6pm Join our eClub! Mint Valley Course Email GolfProShop@ci.longview.wa.us Ron Freem and Associates Course Architect 1976 How to Find Us Traveling South on I-5 Take Kelso Exit 40 off I-5. Follow signs to Highway 4. Travel six miles west on Highway 4, turning right on 38th, then left on Pennsylvania. Traveling North on I-5 Take Longview Exit 36 off I-5. Follow signs to Highway 4 west, turning right on 38th, then left on Pennsylvania. Sorry - your browser does not support iframes. Page Footer Contact Us Address : 4002 Pennsylvania St Longview, WA 98632 Email : GolfProShop@mylongview.com Phone : (360) 442-5442 Follow Us Facebook Twitter Mint Valley Golf Course | 4002 Pennsylvania Street | 360-442-5442 Copyright © 2025 Mint Valley Golf Course All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://www.1golf.eu/en/club/ironwood-golf-course/",
      "text": "Ironwood Golf Course, Gainesville, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Ironwood Golf Course 18 Hole Public Overview Course Visitors Prices Amenities Club Reviews No image available Ironwood Golf Course 2100 NE 39th Avenue, Gainesville, FL 32609, USA Phone: +1 352-393-8500 ironwood@cityofgainesville.org www.ironwoodgolfcourse.org Map Save Share The Course 18-Hole Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Green fees $28 - 31 (24-26 €) / 18 Holes The Course 18-Hole Course Opened in 1964. Design: David Wallace . Style: Parkland. Terrain: Water hazards Technical difficulty: Moderate Scorecard Tee Par CR Slope Length Blue (Men) 72 71.3 122 6465 yards White (Men) 72 70.4 118 6088 yards Red (Women) 72 70.7 119 5234 yards Practice Facilities Driving Range Putting Green Chipping Green Practice bunker Visitors 18-Hole Course Visitors are welcome every day. Etiquette Softspikes required. Green Fees 18-Hole Course Green Fee Mon - Fri Sat, Sun, Holidays 18 Holes $28 (24 €) $31 (26 €) Amenities Club Amenities Club accepts credit cards Bar Rentals Clubs for hire Trolley for hire Electro-cart for hire The Club Personnel Title Name Pro Bill Iwinski Enlarge / get directions Nearby Courses Mark Bostick Golf Course at The University of Florida Gainesville (7.9 km) 18 Hole Gainesville G&CC Gainesville (14 km) 18 Hole Turkey Creek Golf Course Alachua (14 km) 18 Hole See all User Reviews There are no user reviews yet. Been to Ironwood Golf Course ? Share your experiences! Write a Review Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://www.golfironwood.com/contactus/",
      "text": "Contact Us - Ironwood Golf Club Skip to main content Skip to footer Ironwood Golf Club Howell, MI 6902 East Highland Rd. Howell, MI 48843 517.546.3211 Home Tee Times About Us Golf Club Rates Scorecard Memberships Instruction Ironwood Indoor Golf Course Photos Hole In One Club Course Flyover Tour Outings & Events Outing Packages & Menu Upcoming Events ALL DAY COURSE RENTAL Preferred Vendors Contact Us Gift Certificates Contact Us Phone: (517) 546-3211 Fax: (517) 546-1925 Email: golfironwood@yahoo.com Reserve Online Tee Times Email Club Footer Sign-Up for Email Offers Local Weather meteoblue Find Us Address: 6902 East Highland Rd. Howell, MI 48843 Phone: (517) 546-3211 Email: golfironwood@yahoo.com Follow Us Copyright © 2025 Ironwood Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.mainstreetdailynews.com/govt-politics/housing-developer-meadowbrook-golf",
      "text": "Housing developer eyes Meadowbrook Golf Course, residents hold meeting Skip to content Become a Member Become a Member Home Jobs 27 News All News Local News Business Government + Politics Elections Covid-19 Education Health Crime National News Sports All Sports News All Area Teams Athlete of the Week Local Sports Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month All Local Living Events Outdoors History Florida Finds Faith + Inspiration Obituaries Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print edition locations Newspaper Delivery Search Jobs 27 News Local News Business Government + Politics Elections Education Covid-19 Health Crime National News Sports All Area Teams Athlete of the Week Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month Events Outdoors Health Faith + Inspiration History Florida Finds Obits Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print Edition Locations Newspaper Delivery Menu Jobs 27 Events News Sports Obits Cars close Get Our Free Newsletter Government + Politics Housing developer eyes Meadowbrook Golf Course, residents hold meeting Seth Johnson Jan 16, 2025 11:52 am Meadowbrook Golf Course has been closed since 2021. Photo by Seth Johnson The hole-in-one days have faded at Meadowbrook Golf Course. Closed since 2021, the owner received a permit to build a two-story driving range , but the plans never reached construction. Now, Evergreen Residential is in due diligence to purchase the property and turn it into a housing development. The development plans haven’t been presented to the surrounding neighbors or Alachua County Growth Management as the work has just started. Golf course owner Christopher Marcum told Mainstreet in September that the land was under contract. Become A Member Mainstreet does not have a paywall, but pavement-pounding journalism is not free. Join your neighbors who make this vital work possible. See Member Benefits Residents of the Meadowbrook at Gainesville neighborhood worry about the coming changes. On Tuesday evening, around 70 residents gathered at the subdivision’s clubhouse to discuss the potential development and options for negotiating or stopping the needed zoning and land use changes. In a meeting with the neighborhood’s HOA, the developer gave a brief overview of what plans might look like. Linda Butcher, co-chair of the Meadowbrook community commission organizing residents, explained to attendees that the development could be 200-300 homes—compared to Meadowbrook’s 277 homes. The Meadowbrook neighborhood fits like a puzzle piece with the neighboring golf course and originally both were planned as one development. Since then, the ownership of the golf course and subdivision split. Meadowbrook is now the second golf course to be eyed for development after shuttering its doors and allowing the fairways to turn wild. West End Golf Course was considered for development for multiple years with various revisions presented. A coalition of surrounding residents—organized as WECARE—opposed the change, and the Alachua County Board of County Commissioners (BOCC) agreed with residents and refused to change the zoning and land use from recreational in a 2022 vote. WECARE’s success, and the subsequent purchase of West End by Alachua County for a public park, were brought to the forefront at Tuesday’s meeting. Residents hoped Meadowbrook Golf Course would follow a similar route to stay recreational. “We have some leverage here, people, and every one of them is sitting in these chairs because we pay taxes and we have a vote,” Butcher said. Through a show of hands, nearly all the residents at the meeting opposed a land use and zoning change for the golf course. Butcher and co-chair Debra Hodge laid out reasons for keeping the property recreational. In line with the reasoning of WECARE, Butcher said recreational space is needed in the area. From inside the meeting room, the faint beeping of a bulldozer could be heard as construction is underway for 140 homes directly across NW 98th Street. Photo by Seth Johnson Residential construction is underway on the opposite side of NW 98th Street from Meadowbrook Golf Course. Butcher also highlighted the Springhills CDD that plans to build thousands of residential units , a mix of multifamily and single-family homes along with commercial spaces, over the coming years. The BOCC has already signed off phases of the project and will be very close to Meadowbrook. She said Jonesville Park—and the future West End site—are the closest recreational sites available to the current residents around the NW 39th and I-75 exchange. Where’s the green space, Butcher asked, if Springhills gets fully developed along with the Meadowbrook Golf Course? The only open areas will be drainage sites to deal with legacy flooding in the area. “If they were leaning in that direction for West End, maybe they’ll lean in that direction for us, too,” one resident said about keeping the land recreational. Flooding formed another reason for the residents. One resident noted that the golf course closed because of ongoing flooding. How could anyone build houses there? Another resident pointed to the county’s Climate Action Plan for support. He read how the county wants to encourage more buffers between flood plains and residential areas while also increasing the protection of flood plains. Because of flooding issues, Alachua County bought two homes inside the Hills of Santa Fe neighborhood that borders Meadowbrook to the south. Since Tropical Storm Elsa in 2021, which closed NW 39th Avenue where the golf course is , Alachua County has installed pumps in the area and improved drainage. Still, residents are worried about the impact of more homes. Butcher added that a 300-unit development would be out of harmony with the Meadowbrook neighborhood. Residents discussed the option of negotiating with the developer if plans move forward. The neighborhood could ask for privacy fences and pathways and to keep housing next to NW 98th Street as conditions of the county’s approval. Evergreen Residential, which is also building an apartment complex behind Oaks Mall, has yet to submit formal plans to Alachua County. The company will also need to hold a neighborhood workshop to officially take feedback from residents—including changes like privacy fences and other potential conditions. Evergreen declined to comment on plans until due diligence has been completed. But another show of hands showed less than 10 residents considered negotiation an approach to take. The others supported the option to oppose any zoning change from the start. Butcher pointed out that if the neighborhood is successful and no change in zoning happens. Then the land will continue to sit vacant until another potential buyer takes a shot. She said that’s why a purchase by Alachua County seems the best option. Butcher said she knows Meadowbrook won’t reopen as a golf course, but she said there are options besides housing. And she and residents are getting ready for whatever proposals might come. Golf courses have made headlines as the business changes. Gainesville County Club foreclosed and was sold at auction in 2024. As of October, it sat vacant without any work. Ironwood Golf Course entered a management watch in 2023 and has since returned to normal operations. Mayor Harvey Ward told Mainstreet in December that the city isn’t ready to close the course. The Turkey Creek Golf Course reopened in 2022 after being offline for a decade. Turkey Creek and Ironwood are the only public courses still open after West End and Meadowbrook closed. UF also operates the Mark Bostik Golf Course, and Hawkstone Country Club remains open in Haile Plantation. At a meeting for the future West End park , some residents said Alachua County should keep a driving range or 9-hole course on the site. Other options ranged from a swimming center to a dog park, walking trails to a professional pétanque site. Share this post: Share on X (Twitter) Share on Facebook Share on Email Related posts: Alachua County approves rezoning near Newnans Lake, praises concessions Micanopy to stay debt-free with water filtration upgrade Alachua County seeks public input on commission district maps High Springs to raise taxes, save fire department to solve 2025-26 deficit Tags: Alachua County Alachua County Growth Management Department Christopher Marcum Climate Action Plan Debra Hodge Evergreen Residential Gainesville Gainesville Country Club Haile Plantation Hawkstone Country Club Hills of Santa Fe Ironwood Golf Course Jonesville Park Linda Butcher Mark Bostik Golf Course Meadowbrook at Gainesville Meadowbrook Golf Course Tropical Storm Elsa Turkey Creek Golf Course WECARE West End Golf Course Seth Johnson Seth Johnson is a Mainstreet Daily News associate editor based in Gainesville. He earned a degree in journalism and mass communication and served as editor-in-chief of his school newspaper. Seth is a bookworm and chess nerd, but he tempers these activities by playing sports and biking. View all posts Subscribe Notify of new follow-up comments new replies to my comments Label Name* Email* Website Label Name* Email* Website 8 Comments Oldest Newest Most Voted Inline Feedbacks View all comments JeffK 7 months ago It should stay recreational — or turned into conservation land — simply due to the flooding issues there. More pavement and rooftops would necessitate more retention ponds anyway. Will they be filled with alligators someday, something needing ugly fencing due to liability? Not very park looking. 6 Reply Real Gainesville Citizen and Voter Reply to JeffK 7 months ago Excellent idea! -1 Reply Concerned citizen 7 months ago I understand where the residents are coming from but the last thing alachua county need to be doing is buying more land . There is already to much municipality owned land in this county and that is why taxes are as high as they are . Between the county , UF and the city buying up land it is getting out of hand 5 Reply Nancy Reply to Concerned citizen 7 months ago Can you imagine the traffic? It’s already a mess. I live at Country side and sometimes it takes me forever to get onto 39th. It should be a recreational zone. -1 Reply James Reply to Nancy 7 months ago The traffic is the result of 50 plus years of our local government and citizens opposing the infrastructure necessary to make our city work. Gville is a traffic disaster with grossly inadequate east west b traffic corridors and has been for decades 1 Reply Cynthia Binder 7 months ago Maybe a gardens  waterway/ ponds or 💧 water garden  a zen garden, rosary 📿 walk,  vegetable garden ,  grill area,   putt-putt golf course  and connected  all by an electric  cho-cho🚂🚃🚂🚃🚂🚃🚊ride train. Some are self maintained  others are not. Walking trails . A   space  emptied  is nothing A space filled with multiple use for multiple ages of enjoyment. Even parking is there already. Thank you ideas are thought Empty  is nothings. 1 Reply Stan 7 months ago The County can’t bail out every resident that chose to buy a house on a Golf Course. Have some personal responsibility people! 3 Reply Bruce Kritzler 7 months ago Maybe develop the frontside along 98th(high ground). Keep the backside for greenway/passive recreation. 0 Reply Featured Local Savings Sign Up Local news in your inbox. Newsletter Form (#3) Subscribe Email Join Free Got a news tip or story? Let us know Recent Job Openings Pretrial Officer – Pretrial Services Alachua County Board of County Commissioners Sustainability Manager Alachua County Board of County Commissioners Senior Environmental Specialist (Land Conservation) Alachua County Board of County Commissioners Part-time Police Officer Santa Fe College Conestogas – Night Grill Cook Conestogas Restaurant Post A Job | View All Jobs Events Most Read High Springs teenager dies after motorcycle collides with car UF/IFAS to aid Florida farmers switching to bamboo crops Certain, Democrats criticize antisemite ‘on pedestal’ High Springs withdraws criticism of Alachua County Fire Rescue, cites misinformation Gainesville votes to demolish Thelma Boltin Center after price spike Chiefland teen dies in collision with semi Alachua County has 6 official scenic roads, Newnans Lake residents want another High Springs man sentenced to 10 years for child pornography distribution Motor Marketplace 2024 Toyota Tacoma 2WD SR5 $ 34,285 20K Miles Tomlinson Motor Company View Vehicle 2021 Jeep Cherokee 80th Anniversary FWD $ 19,985 62K Miles Tomlinson Motor Company View Vehicle 2024 Ford Edge Titanium AWD $ 28,485 35K Miles Tomlinson Motor Company View Vehicle 1 2 3 … 69 Next » View All Inventory Member-supported Mainstreet Daily News keeps you informed about news, sports and events, so you can stay safe, cast informed votes, and be a better neighbor in Alachua County and the surrounding area mainstreetdailynews.com 100 NW 76th Drive #2 Gainesville, FL 32607 Phone: 352-313-3150 Email: editor@mainstreetdailynews.com Discussion and Submission Guidelines Terms of Use Privacy Policy Contest Rules Cookie Notice 2024 Community Impact Report Public Notice Certification X Get Our Daily Newsletter Local news delivered right to your inbox Mobil Modal Newsletter Form Updates Email Submit Become a Member! Mainstreet does not have a paywall, but journalism is not free. Join your neighbors who make this work possible. See Member Benefits close arrow-circle-o-down chevron-left chevron-right facebook-square angle-down ellipsis-v instagram square-x-twitter cross menu wpDiscuz Insert"
    },
    {
      "url": "https://www.ironwoodcountryclub.com/contact/",
      "text": "Contact - Ironwood Country Club Skip to content Log In | Membership Opportunities | Contact 760.766.1000 | info@icc.club Toggle Navigation Home Member Log In Courses South Course North Course Practice Facilities Golf Membership Club Racquet Sports-Tennis Racquet Sports-Pickleball Wellness Center Spa Dining Events Clubs Within The Club Membership Opportunities Ironwood Community Association Spirit History Clubs Within The Club Look Book Real Estate Location Contact ironwoodcc 2025-05-27T08:54:05-07:00 Interested in Ironwood Country Club? Request Information First Name * Last Name * Email Address* Phone Number I am Interested In Membership Real Estate Other How can we help? This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Δ × Ironwood Country Club Address 73735 Irontree Drive, Palm Desert, CA 92260 Phone 760.766.1000 Fax 760.766.1005 Email info@icc.club Directions Ready to Become a Member Explore our membership options Membership Opportunities Management Team Administration Joshua Tanner CCM, CCE CEO|General Manager 760.766.1090 email Krista Simmons Director of Membership & Communications 760.766.1074 email Accounting Diane Rader Chief Financial Officer 760.766.1013 email Laura Stotts Director of Human Resources | IT 760.766.1011 email Golf Professionals Mike Oberlander PGA Director of Golf 760.766.1068 email Golf Course nATHAN GLASER Superintendent 760.766.1033 email Wellness & Racquet Sports Amy Krishka Director of Sports 760.766.10 23 email marc Dubois Head Tennis Professional 760.766.10 23 email Food & Beverage Mark Sickenberger Executive Chef 760.766.1047 email Gina Cariaga Clubhouse Manager 760.766.1094 email Management Team Joshua Tanner administration Joshua Tanner CCM, CCE CEO/General Manager 760.766.1090 josh.tanner@icc.club Krista Simmons administration Krista Simmons Director of Membership & Communications 760.766.1074 krista.simmons@icc.club Diane Rader Accounting Diane Rader Chief Financial Officer 760.766.1013 diane.rader@icc.club Laura Stotts Accounting Laura Stotts Director of Human Resources Web / IT 760.766.1011 laura.stotts@icc.club Mike Oberlander Golf Professionals Mike Oberlander PGA Director of Golf 760.766.1068 mike.oberlander@icc.club Marc Dubois Tennis Professionals Marc Dubois Head Tennis Professional 760.766.1023 marc.dubois@icc.club Amy Krishka Wellness Amy Krishka Dierctor of Sports 760.766.1023 amy.krishka@icc.club Mark Sickenberger Food & Beverage Mark Sickenberger Executive Chef 760.766.1047 mark.sickenberger@icc.club Mark Sickenberger Food & Beverage Gina Cariaga Clubhouse Manager 760.766.1094 gina.cariaga@icc.club Ironwood Country Club 73735 Irontree Drive, Palm Desert, CA 92260 | 760.766.1000 | info@icc.club Contact | Member Log In | Privacy Copyright © by Ironwood Country Club. All Rights Reserved. Powered by Cord Media Page load link Go to Top"
    }
  ]
}