{
  "fuentes": [
    {
      "url": "https://www.islandhospitality.com/",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.theinnsofsanibel.com/the-inns/staff/",
      "email": "the-inns-logo-color@2x.png"
    },
    {
      "url": "https://www.theinnsofsanibel.com/the-inns/staff/",
      "email": "the-inns-logo-white@2x.png"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/island-inn/41714",
      "email": "info@islandinnsanibel.com"
    },
    {
      "url": "https://islandinnmv.com/",
      "email": "info@islandinnmv.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.darienwaterfrontinn.com/contactus.html",
      "email": "darienwaterfrontinn@darientel.net"
    },
    {
      "url": "https://happyislandinn.com/contact-us/",
      "email": "8144book@happyislandinn.com"
    },
    {
      "url": "https://www.islandhospitality.com/our-company/our-history",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://islandinnmonhegan.com/contact-us/",
      "email": "info@islandinnmonhegan.com"
    },
    {
      "url": "https://www.islandhospitality.com/our-company/the-team",
      "email": "forms@tambourine.com"
    }
  ],
  "mails": [
    "8144book@happyislandinn.com",
    "darienwaterfrontinn@darientel.net",
    "forms@tambourine.com",
    "info@inzmo.com",
    "info@islandinnmonhegan.com",
    "info@islandinnmv.com",
    "info@islandinnsanibel.com",
    "the-inns-logo-color@2x.png",
    "the-inns-logo-white@2x.png"
  ],
  "nombre_sitio": "islandinnsanibel.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.islandhospitality.com/",
      "text": "Island Hospitality Management | Official Site SKIP TO CONTENT Our Company Our Team Our History Services Portfolio IHM Outdoors New Collection Properties News & Press Careers Benefits Diversity Pathways Apply Now 561-655-9001 Welcome Results Driven by People & Processes At Island Hospitality our Proprietary Technology, Hands-On Management, and Talent Development Programs are the cornerstones to our company's culture in third party management for the world’s most recognizable hotel brands. Our team works with owners to develop tailored solutions to maximize revenue while implementing proven efficiencies and aggressive cost containment tools that deliver an immediate and meaningful impact on the bottom line. What We Offer Purchasing Services Purchasing Services We leverage our strong relationships with top suppliers and brands and the power of our volume purchasing to negotiate better pricing on commodities used consistently across our properties, passing significant savings on to you. Learn More Sales & Marketing Support Sales & Marketing Support Our sales team drives business directly to our investor properties using an integrated system of sales activity data, targeted e-commerce strategies, social media management, cross-selling initiatives, and more. Learn More Revenue Management Revenue Management Our revenue managers use cutting-edge systems to anticipate and capitalize on revenue opportunities, focusing closely on market share and performance to ensure all revenue expectations are met. Learn More Human Resources Human Resources Our Pathways Human Resources program ensures that our in-house teams and investors’ properties are staffed with the industry’s top talent, creating meaningful career opportunities and advancement for hospitality professionals. Learn More Accounting & Financial Services Accounting & Financial Services We create a significant competitive advantage for investors with the use of data-driven forecasting through our use of proprietary technology. We offer a full suite of accounting and financial services to suit every owners needs. Learn More Operational Systems Operational Systems By using a multi-faceted system known as COMET Data Flow & Integration, we effectively report on analytics, sales, finances, and human capital management with a results-driven approach. Learn More A Look at Our Portfolio Island Hospitality's portfolio consists of premium brand hotels and resorts in desirable locations throughout the United States. View Outdoors Collection View Hotel Portfolio Featured Brands Our Expertise IHM Updates September 2025 'Everybody's concerned:' Revenue managers shift expectations to account for disappointing 2025 Learn More April 2025 Island Hospitality names SVP of Commercial Strategy Learn More February 2025 HB on the Scene: Island Hospitality’s Gregg Forde discusses talent retention, 2025 outlook Learn More January 2025 Island Hospitality adds San Jose TownePlace Suites Learn More January 2025 Forward ho: Hotel industry leaders size up 2025 Learn More January 2025 Lodging Magazine: Back of House Learn More December 2024 Labor, inflation challenged hotel operators in 2024, and some worry they will persist in 2025 Learn More December 2024 Merry and bright menus: Hoteliers share dishes for the holidays and winter season Learn More December 2024 Island Hospitality named operator of Syracuse Embassy Suites Learn More June 2024 Island Hospitality Management Assumes Management of 120-Room Residence Inn Boca Raton Learn More May 2024 Hotel Marketers Push Broad Messaging, Options To Attract All Generations Learn More March 2024 Island Hospitality Expands Operations to the Great Outdoors Learn More January 2024 Island Hospitality Management Successfully Launches IHM Outdoors Learn More October 2023 Extended-Stay Report: Segment still tough enough for tough times Learn More October 2023 Island Hospitality assumes management of Naples hotel Learn More September 2023 Island Hospitality Management Named Operator of 114-Room SpringHill Suites Truckee Learn More June 2023 Island Hospitality Management to manage Hampton Inn Learn More June 2023 How Hoteliers Are Balancing Procurement Challenges Learn More June 2023 Island Hospitality Management to manage 3 WaterWalk properties Learn More May 2023 Domestic Summer Travel Trends Up, but Some Florida Markets Less Popular Than in Past Years Learn More March 2023 Island Hospitality Management Expands Portfolio with 14 Additional Hotels and Opens Third Toasted Barrel During 2022 Learn More December 2022 Pair of Three-Day Weekends Could Boost Holiday Travel Learn More December 2022 Hoteliers in San Francisco Hope for More Reliable Demand in 2023 Learn More December 2022 Island Hospitality takes over Yonkers Hampton Inn Learn More sign up Contact Us facebook instagram linkedin Thank you for your interest. Hidden Field Full Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Island Hospitality 222 Lakeview Avenue Suite 200 West Palm Beach, Florida 33401 561-655-9001 Island Cares Island Keys Iris Hotel Marketing Contact Privacy Policy Accessibility © Island Hospitality 2025.All Rights Reserved Website Design by Tambourine"
    },
    {
      "url": "https://www.theinnsofsanibel.com/the-inns/staff/",
      "text": "The Inns Staff | The Inns of Sanibel Mobile Menu Close Home Sanibel Inn Experiences Close Back to main menu Experiences Learn More Tennis & Pickleball Water Activities Club Membership Beaches Biking Shelling Shopping Yard Games Cookouts & Campfires Dining The Dunes Weddings Gallery Promotions Book a Tee Time – Public (maximum five days advance) Book a Tee Time – Full Club Members Book a Tee Time – Tennis & Sports Members BeachCam Skip to main content Search for: Search [{\"text\":\"Sanibel Inn\",\"id\":0,\"selected\":false,\"title\":\"Sanibel Inn\",\"subtitle\":\"Where the Nature Meets the sea\",\"icon\":\"starfish\",\"url\":\"https:\\/\\/www.theinnsofsanibel.com\\/the-inns\\/sanibel-inn\\/\"},{\"text\":\"The Dunes Golf & Tennis Club\",\"id\":1,\"selected\":false,\"title\":\"The Dunes Golf & Tennis Club\",\"subtitle\":\"\",\"icon\":\"golf-clubs\",\"url\":\"https:\\/\\/dunesgolfsanibel.com\\/\"}] BeachCam Tel Free: (866) 717-2323 Search Menu Search Home Sanibel Inn Experiences Recreation Overview Close Tennis & Pickleball Water Activities Club Membership Beaches Biking Shelling Shopping Yard Games Cookouts & Campfires Dining The Dunes Weddings Gallery Promotions Check Availability Check Availability Close Sanibel Inn Seaside Inn Sunset Beach Inn Song of the Sea Inn Date format: mm/dd/yyyy Arrival September 9 Departure September 10 Guest Check Availability Tel Free: (866) 717-2323 Check Availability Header Item 1 The Inns Staff Home The Inns The Inns Staff Bill Wellman - General Manager A 35-year hospitality management veteran, Bill is passionate about hospitality and tourism, and he’s excited about what he and his staff do every day – create vacations of a lifetime for guests on one of the most beautiful islands in the world. Bill previously managed the Campus Inn for Dahlmann Properties and later the Graduate Madison in Wisconsin, where he served as the President of the Madison Hotel & Lodging Association and board member for the Greater Madison Convention and Visitor's Bureau. He spent the first 16 years of his career with Walt Disney Resorts in various leadership roles and property openings. He and his wife and daughter enjoy visiting new countries and traveling the world. David Lopez - Assistant General Manager David began his hospitality career in Miami Beach as a concierge while attending FIU's school of Hospitality Management. In 2014, he moved to Key West to be a part of Casa Marina and the Reach resorts, both part of the prestigious Waldorf Astoria collection. During his time there he grew to become VIP manager, Manager of Guest Experience and Front Office Manager, leading his teams not only to raise their service scores but also to become one of the top revenue generating hotels across the Hilton portfolio. In 2019, he moved to Fort Myers and accepted his role as Assistant General Manager at the Inns of Sanibel. Victor Lohmuste - Director of Engineering Victor is originally from Estonia. He emigrated to Italy in 1989 with family and a year later to Fort Myers. While in Estonia, Victor created about 50 patents in his name. He also worked for an auto repair business for 8 years, was a private estate manager in Naples for 5 years, and a real estate maintenance manager for Levitt and Sons over 5 years. Victor has been a part of the Inns of Sanibel team for more than a decade. Victor received his Diploma and Certification for HVACR Technician from Penn Foster career school. His hobbies include triathlons, photography, and red wine and his favorite band is Pink Floyd. Carol Gilmore - Director of Finance Carol is originally from Minnesota and is a University of Minnesota graduate. She started her hotel career at the Lodge at Vail in Colorado before moving to Florida. Carol worked at Sonesta Sanibel Harbor Resort, before becoming the Accounting Manager for the Mariner company back in the 90s, which owned the four Inns of Sanibel, The Dunes, South Seas, Sundial, and the Pink Shell. She started at the Inns, then 12 years later worked at South Seas as Assistant Controller. She returned to the Inns of Sanibel as Controller and added the Sundial and The Dunes to her collection totaling 25 years of service. Brad Stanze - Area Front Office Manager A Florida native, Brad kicked off his hospitality career after high school working at a Pine Island KOA campground. Later, he traveled extensively with Kimpton Hotels to Colorado, Massachusetts, West Virginia and the DMV area as a front office supervisor, and in sales and marketing. During his free time you will find him working his other \"full-time job\" - being a dad to two wonderful kids! Kayla Lawrence – Innkeeper, Sanibel Inn Before joining the team at Sanibel Inn, Kayla worked on Sanibel Island for over a decade in various retail positions from front-line sales to management. She currently attends FGCU and plans to graduate in the Fall of 2022 with a BS in Hospitality Resort Management. Kayla is committed to assisting her team in delivering exceptional guest service and to creating memorable moments that last a lifetime. In her spare time, Kayla enjoys boating and searching for shells on Sanibel Island's breathtaking beaches. Amanda Low - Innkeeper, Song of the Sea Amanda has a wealth of experience in hospitality, food & beverage and bridal consultation from her work in Washington state and sunny Florida. She is currently studying for a BA in Communications, as well as certifications in wedding planning, event planning, and event decor. Amanda prides herself on her exceptional organizational skills and passion for delivering personalized service, which makes her a perfect fit for The Inns of Sanibel! In her free time, she enjoys going to the gym, reading, and spending time with her family and boyfriend. Amber Serradimigni - Innkeeper, Seaside Inn Before relocating to Florida, Amber worked as an office manager in upstate New York. She brings with her a strong focus on customer satisfaction and a drive to promote brand confidence. Amber graduated from The Adirondack Dental Assisting School in 2019 with the distinction of Valedictorian before shifting direction into hospitality. She has been working for The Inns of Sanibel since 2020, and has a passion for helping guests create memorable experiences. Amber enjoys cooking and spending time outdoors with her fiance and her dog Yoshi. Anvar Ruziev - Innkeeper, Sunset Beach Born in Ukraine and raised in Colorado, Anvar is a former small business owner, currently working towards a BA in Economics with a minor in Spanish. In addition, he is fluent in Russian and Ukrainian. Having visited 10 different countries, and 42 of the 50 states, Anvar has a deep understanding of tourism. A consummate professional with years of hospitality experience, he strives to achieve and exceed expectations of every guest. His hobbies include open water swimming, exploring the Florida coast, and aerial photography. Testimonials “We stayed in a top floor king room suite which was beautifully laid out and comfortable. Grounds were gorgeous! We met the owners who were very friendly and meticulous in the details of the resort...Would recommend staying at this quiet, conveniently located, high scale retreat.” Betty B. — Feb 2025 “What a perfect Inn to stay at on Sanibel Island. The staff were incredible, a special shout out to Mikey and Kayla for an outstanding response to our needs. They are very caring and only want their guests to feel welcome and at home. The rooms were immaculate and the grounds were beautiful. The renovations they have done make it a perfect spot for a vacation. Our first visit to Sanibel Island, but not our last. We will be staying here again. Thank you for a wonderful trip to your island.” Judy — Feb 2025 “The wait is over. The Sanibel Inn has reopened its doors to paradise. As usual, we had an absolutely wonderful time. The rooms are very comfortable and designed with a coastal feel with many upgrades. The grounds are very tropical and will look amazing once everything is in full bloom. It was wonderful to see some familiar faces, Kayla and Tyrone and meet new ones too. Tyrone, Jorge and Mamuka at the Beach Hut had our chairs and umbrella set up on the beach every morning. The staff was super friendly and always looking to help make your stay more memorable. Kudos to the general manager, Bill Wellman for making the reopening such a success. WE have already booked our return in September. Can't wait!” Anne — Feb 2025, St. Augustine, Florida “Amazing Beautiful Resort!!! Everything is redone, remodeled and brand new!!! Pool and Tikibar area were stunning, Brand new bicycles are free to guests with brand name PRIORITY...Great Stay, Awesome Staff and Beautiful Grounds! We will be back!!!!” Msdet1529 — March 2025 “Our stay at Sanibel Inn exceeded our hopes and expectations. The new accommodations are top-notch. Two restaurants (one in a lovely outdoor setting) make it possible to stay on the property and “veg-out.” The pool is steps from the rooms, and the beautiful beachfront is right there across a new boardwalk. The heart and soul to rebuild after Ian is evident in the tasteful decor, beautifully planned grounds and new plantings, and environmentally conscious infrastructure. Highly recommend!” C6107JWsusanp — May 2025 Sign up for exclusive offers–direct to your inbox Full Name * Email Address * * By checking this box you agree to our terms and conditions . Additionally, this site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Captcha Name This field is for validation purposes and should be left unchanged. Sanibel Inn The Dunes Golf & Tennis Club Join Our Team © 2025 The Inns of Sanibel – A DAHLMANN PROPERTY Web Accessibility Privacy Policy Terms of Use Frequently Asked Questions Careers In the News Contact Us SPECIAL OFFERS THIS WEEK 15% OFF or ONE NIGHT FREE! CLICK HERE FOR DETAILS ×"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/island-inn/41714",
      "text": "Island Inn | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN 87° Now 87° Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Amenities Amenities Share Share Visit Website Island Inn The Island Inn is OPEN & Accepting Reservations - Visit IslandInnSanibel.com to Book Now or Call (239) 472-1561. Come visit our oasis in paradise at the Island Inn on Sanibel Island. Voted “Best Hotel & Inn\" on Sanibel & Captiva since 2016, the Historic Island Inn provides our valued guests with: World-class shelling Unparalleled beach proximity 10 Gulf front acres & 550 feet of private access beach... Load More The Island Inn is OPEN & Accepting Reservations - Visit IslandInnSanibel.com to Book Now or Call (239) 472-1561. Come visit our oasis in paradise at the Island Inn on Sanibel Island. Voted “Best Hotel & Inn\" on Sanibel & Captiva since 2016, the Historic Island Inn provides our valued guests with: World-class shelling Unparalleled beach proximity 10 Gulf front acres & 550 feet of private access beach No Parking, Resort, or WiFi Fees Modern Accommodations & Amenities “Old Florida” charm On-site Bicycles, Kayaks & Paddleboards Cherished Memories, Modern Comforts, Enjoy It All At the Island Inn! Load Less 26.5113688, -81.9643905 (796 Google Reviews) (239) 472-1561 3111 W. Gulf Dr. Sanibel Island , FL 33957 United States info@islandinnsanibel.com View Website Book Now Key Features Places to Stay Hotel Live Camera Gallery Amenities Location Beachfront, Island Suitable for Ages Adults (18+), All Ages, Kids (5-8), Seniors (55+), Teens (13-18), Toddlers (up to 5), Tweens (9-12) Availability Daily, Long Term, Monthly, Weekly Closest Airport RSW Disabled Traveler Information Handicapped Parking Pet Information Not Permitted Activities Beach Walks, Bicycling, Birding, Fishing, Golf Nearby, Kayaking, Snorkeling, Swimming Rentals Kayak, Watersport - Non-Motorized, Bicycles Category Bicycle Trails, Hiking/Nature Trails Room Amenities Coffee Maker, Full Kitchen, Hair Dryer, Iron/Ironing Board, Limited Kitchen, Microwave, Refrigerator Room Type 1-Bedroom Units, Efficiency, Single Rooms, Suites Number of Floors 2 Number of Units 49 Discounts Other Discount Tour Information Guided Tours Tour Duration 1.5hrs Tour Schedule Weekly Hours of Operation Open Daily 8AM - 5PM 26.5113688, -81.9643905 (796 Google Reviews) (239) 472-1561 3111 W. Gulf Dr. Sanibel Island , FL 33957 United States info@islandinnsanibel.com View Website Book Now Key Features Places to Stay Hotel Live Camera Hours of Operation Open Daily 8AM - 5PM What's Nearby Love Boat Homemade Ice Cream Serving SW Florida's finest home made ice cream since the mid 60's. 50+ flavors of the creamiest ice cream, sugar/fat... Posh Baby Equipment Rentals #1 BABY GEAR RENTAL SERVICE IN SOUTHWEST FLORIDA Everything you need on vacation delivered right to your doorstep. You... Shell Point Golf Club Located just minutes from Sanibel and Fort Myers Beach, the 18-hole championship Shell Point Golf Club features five tee... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    },
    {
      "url": "https://islandinnmv.com/",
      "text": "The Island Inn on Martha's Vineyard – Coastal Comfort, Vineyard Charm Skip to content Rooms Amenities Rental Policies Food & Beverage Events Event Center Location Things to Do Vineyard Blog Resort Map Contact Rooms Amenities Rental Policies Food & Beverage Events Event Center Location Things to Do Vineyard Blog Resort Map Contact 508.693.2002 Book Now Welcome to the Island Inn Your Island Home Away from Home on Martha's Vineyard Immerse yourself in the charm and tranquility of our inviting retreat, perfectly nestled just moments from pristine beaches and vibrant island attractions. BOOK NOW Contact Us Follow us: Facebook-f Icon-instagram-1 Youtube Tiktok Relaxation, Comfort, and Island Hospitality Enjoy the island experience Discover the perfect New England escape at The Island Inn on Martha’s Vineyard. Nestled on five acres of serene coastal charm, this year-round resort offers the ideal blend of relaxation and convenience. Whether you’re planning a family vacation, romantic retreat, or group getaway, The Island Inn provides a warm, welcoming atmosphere and exceptional vacation rentals for every traveler. Years of Experience 0 + Professional Staffs 0 + Awards & Recognitions 0 + Positive Reviews 0 % About the island inn Accommodations Tailored to Your Needs Explore 51 thoughtfully appointed vacation rentals, from cozy studios to spacious multi-room suites, all designed to make you feel at home. Enjoy popular amenities like well-equipped kitchens, comfortable living spaces, and access to on-site features such as tennis courts, an outdoor pool, and lush green grounds. Learn More Our Rooms Discover Comfort in Every Stay View More Units – 3-6, 7, 9, 11-14, 17-20, 22, 23-27 Building B, C, D, F Studio Suites Perfect for couples or small groups, our studio units provide a cozy and comfortable stay with room for up to four guests. Featuring a convenient kitchenette, cable TV, free WiFi, and shared access to resort amenities like the outdoor pool, tennis courts, and grilling area, these studios are ideal for a relaxing retreat near the beach and golf course. 4 People 2 Double Beds 1 Bathroom Book This Room Units – 8, 10, 15, 16 Building C, D One Bedroom Suites Our one-bedroom Suites offer a blend of comfort and functionality, accommodating up to four or six guests. Enjoy the privacy of a separate bedroom, a well-equipped kitchenette, and a cozy living area. Relax on the patio or deck and take advantage of on-site amenities, including the seasonal pool, Har-Tru clay tennis courts, and picnic areas. 4 People 1 Queen and 1 Sofa Bed 1 Bathroom Book This Room Unit – 1, 2 Building A Two Bedroom Suites The Two-Bedroom Suites at The Island Inn on Martha’s Vineyard provide a spacious retreat for families or groups, featuring two private bedrooms, a cozy living area, and a fully equipped kitchenette for preparing meals. These suites offer modern amenities such as free Wi-Fi, a flat-screen TV, and climate control, ensuring comfort and convenience throughout your stay. 4 People 1 Queen and 2 Single Beds 1 Bathroom Book This Room Unit – 21 Building E Cottage​ The Cottage at The Island Inn on Martha’s Vineyard offers a charming and spacious retreat perfect for families or small groups. Featuring 2 bedrooms, 2 bathrooms and accommodating up to 6 guests, this cozy cottage combines comfort and coastal style. Inside, you’ll find airy living spaces with high ceilings, a bright, welcoming décor, and thoughtfully designed rooms. 6 People 2 Kingbeds 2 Bathrooms Book This Room Units – 30-39 Building G Residential Suites Comfortable and thoughtfully appointed, these one-bedroom residential suites offer a relaxed island feel with space for up to five guests. Each suite features a private bedroom with a queen bed, a living area with two twin beds and a sleeper sofa, and one full bathroom. A fully equipped kitchen or kitchenette includes essentials like a stove, microwave, refrigerator, and dishwasher in select units. Guests also enjoy complimentary WiFi, cable TV, air conditioning, and tasteful coastal décor. Ideal for families or small groups, these suites provide the flexibility of home with the ease of a vacation stay. 4 People 1 Queen, 2 Single, and 1 Sofa Beds 1 Bathroom Book This Room Units – 40, 43, 45, 46, 51 Building G Two Bedroom & 1.5 Bath Townhouses​ These spacious, two-level townhouses are ideal for families or groups seeking comfort and flexibility. Each unit features two bedrooms—typically one with a king bed and the other with two twin beds—as well as a semi-private loft-style layout. A full bathroom is located on the lower level, while a convenient half bath is available upstairs. The open-concept living area includes a sleeper sofa, cable TV, and complimentary WiFi, creating a relaxed gathering space. 4 People 1 King and 2 Single Beds 1.5 Bathrooms Book This Room Units – 41, 42, 44, 47-50 Building G Two Bedroom & 2 Bath Townhouses These spacious and thoughtfully designed two-bedroom, two-bath townhouses offer an elevated residential stay for families and small groups. Each unit features one bedroom with a king bed and another with two twin beds, plus a double sleeper sofa in the living area. The two full bathrooms—typically one on each level—offer added convenience and privacy. With vaulted ceilings, coastal-inspired furnishings, and a functional layout, these multi-level units include a fully equipped kitchen or kitchenette, dining space, and a comfortable living area with cable TV and free WiFi. Many townhomes feature semi-private or lofted bedroom spaces, and all offer step-out balconies or decks perfect for relaxing after a day at the beach. Central or partial air conditioning ensures a comfortable indoor climate, and guests will find ample room to unpack and unwind throughout their stay 4 People 1 King and 2 Single Beds 2 Bathrooms Book This Room Amenities Enhance Your Island Escape Indulge in our thoughtful amenities designed to elevate your stay. Free Wifi Complimentary Wi-Fi\nStay connected effortlessly during your visit. Outdoor Pool Relax and refresh in our heated swimming pool Laundry On-site coin-operated laundry facilities Tennis Courts Enjoy our professionally maintained Har-Tru tennis courts. Reservations required, additional fee applies. Nomans Enjoy dining at Nomans, conveniently located next door to The Island Inn​ Full Kitchens Each unit includes a kitchen or kitchenette, ideal for extended stays or quick bites. Dedicated Parking No need to worry about parking—every unit comes with its own reserved space Pet-Friendly Tail-wagging stays start here! Select accommodations are pet-friendly. Outdoor Amenities Enjoy community BBQs, fire pits, picnic areas, and a playground—all just steps from your door. Unwind in the Heart of Martha's Vineyard Charm Dining Enjoy dining at Nomans, conveniently located next door to The Island Inn (independently owned and operated) See the menu Near Destinations Explore the Best of Martha’s Vineyard Inkwell Beach 3 min drive 20 min walking Joseph Sylvia State Beach 4 min drive 7 min biking Farm Neck Golf Club 8 min drive 12 min biking Circuit Avenue Shopping 4 min drive 15 min walking Flying Horses Carousel 4 min drive 8 min biking East Chop Lighthouse 9 min drive 15 min biking Edgartown Village 9 min drive 22 min biking The Steamship Authority Oak Bluffs Terminal 4 min drive 7 min biking Hear what people have to say Reviews View More Lisa R. Guest We have stayed here 3 times. So great to have a beautiful, clean pool on these hot days. Customer service is exceptional. Units are clean & stocked with utensils/pots & pans for cooking if you choose. Grills & fire pits on the property too. Close to OB, Edgartown & beaches. We’ll be back for sure. Luaren C. Guest A little bit of heaven What a wonderful experience from the minute we checked in until the minute we left. The grounds are beautiful our room was beautiful clean. The staff was absolutely amazing. Friendly helpful and always willing to assist. Smiles and kind words all the way around as well as the other people who were staying on grounds as well. It was just a wonderful wonderful experience and we will be back Jenna G. Guest Everything about this place is perfect. You’re close to beaches, to Oak Bluffs, to the Jaws Bridge. I would definitely revisit the Island Inn. Rooms were like little studio apartments , full kitchen and dining table. Always clean. In the building I was in, you shared a deck with the other rooms on your floor. It looked like some buildings were little cottages but mine had 5 rooms on the first floor and 5 on the second. FYI…No elevator, outside entry. There’s a pool, playground, big grassy area for other lawn games. 10/10 I would recommend Nathalie V. Guest We took bikes for the weekend to watch marathon! Perfect location – clean- and kept bikes locked in front porch which was undercover. Easy to jump on bus #13 to get groceries and head into oakbluffs for dinner. Would love to stay again! GREAT STAFF! Susan R. Guest My husband, son and i were happily surprised as soon as we arrived at the island inn office. Tony was super courteous and helpful, as was Chelsea. Unit 41g was so much nicer than we expected. The unit is decorated with care—the owner clearly has great taste and carefully thought out how to make the unit feel vacationey but homey. Danielle V. Guest Fantastic stay. Perfect lodging with hotel-like amenities. Excellent location. Clean, wonderful space with great taste, elevated condo upgrades (AC, TV and channels for adults and kids; fans; shades, easy to access) and amenities, great for family of 4. We will be back! FAQs Frequently Asked Questions General Information Check-In & Policies Amenities Pets Location & Transportation Booking & Contact Where is The Island Inn located? The Island Inn is located at 30 Island Inn Road, Oak Bluffs, MA 02557 , conveniently positioned between Oak Bluffs and Edgartown. What accommodations are available? We offer studio suites, one- and two-bedroom suites, townhouses, and a cottage, each equipped with kitchenettes or full kitchens. Is The Island Inn family-friendly? Yes! Our spacious accommodations, outdoor pool, playground, and lawn areas make us perfect for families. What are the check-in and check-out times? Check-in: 3:00 PM Check-out: 10:00 AM What is your cancellation policy? Full refund if canceled within 24 hours of booking. 50% refund if canceled 15–29 days before arrival. No refunds within 14 days of arrival. Is there an age requirement to check in? Guests must be at least 21 years old to check in. Are events or parties allowed? No, parties and events are not permitted . What are the quiet hours? Quiet hours are from 10:00 PM to 8:00 AM daily. What amenities does The Island Inn offer? Outdoor heated pool Har-Tru tennis courts (fee applies, reservations required) Playground area Landscaped grounds Coin-operated laundry Complimentary Wi-Fi Free parking Do accommodations have kitchens? Yes, every unit includes a kitchenette or a full kitchen with necessary appliances. Are pets allowed? Yes, dogs are welcome in select pet-friendly units with advance approval. Fees apply: Pet cleaning fee: $150 per stay Nightly fee: $20 per dog (up to two dogs per unit, size restrictions may apply) Cats are not permitted. Service animals are welcome free of charge. How far is The Island Inn from downtown Oak Bluffs? We’re located approximately 1 mile from downtown Oak Bluffs, offering easy access to shops, dining, and entertainment. How close is the nearest beach? Joseph Sylvia State Beach is about 0.5 miles away. Is there public transportation nearby? Yes, Martha’s Vineyard Transit Authority (VTA) buses have stops nearby, connecting you to all island attractions. How do I make a reservation? Book directly via our website: www.islandinnmv.com . Who can I contact for additional questions? Call us at 508-693-2002 or email info@islandinnmv.com . Blog & News Blog & Articles About Martha's Vineyard View More Charming Stays. Timeless Memories Home About Reservations Vineyard Blog Contact Address 30 Island Inn Rd. Oak Bluffs, MA 02557 Facebook-f Icon-instagram-1 Youtube Tiktok Contact P : 508.693.2002 E : info@islandinnmv.com Subscribe our newsletter Copyright © 2025 Gulph Creek Hotels Privacy Policy Terms & Services"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.darienwaterfrontinn.com/contactus.html",
      "text": "Contact Us - Darien, Georgia | Darien Waterfront Inn 912-437-1215 TEXT Check Availability custom header text Call Us 912-437-1215 Menu Home Accommodations Policies Attractions Sapelo Island Dining Gallery Contact Us Image may be subject to copyright Contact Us Darien Waterfront Inn is conveniently located just off Interstate 95, between Savannah to the north and Brunswick to the south, along Georgia's scenic coast and US Highway 17.  We look forward to hearing from you! ADDRESS 711 Fort King George Drive Darien, Georgia 31305 US PHONE & EMAIL 912-437-1215 darienwaterfrontinn@darientel.net SOCIAL MEDIA CHECK AVAILABILITY © 2025. All Rights Reserved. Lodging Website Design & Reservation Software by ResNexus Privacy Policy Terms of Use ADA 912-437-1215 Contact Us"
    },
    {
      "url": "https://happyislandinn.com/contact-us/",
      "text": "Contact Us - Happy Island Inn - Virac, Catanduanes, Philippines 💬 Facebook Chat 👋 ✕ +(63) 921 864 8144 186 Rizal Ave., San Vicente, Virac, Catanduanes Contact Us Happy Island Inn Catanduanes Flights to Catanduanes Bus & Ferry to Catanduanes Catanduanes Travel Guides Blog Guestrooms Gallery What Our Guests say ✍️ BOOK NOW Contact Us Get in Touch Every moment of your stay is important for us so we want to make sure you’ve enjoyed your Happy Island Adventures. +63 921 864 8144 [email protected] 186 San Vicente, Virac Catanduanes, PH 4800 Savor the ocean and mountain breeze from the comfort of your room with private balcony ✍️ Book Now Minimalist 👩🏻‍💻☕️ Work from Home -friendly home in Catanduanes  🏝️ offers panoramic views of the Pacific Ocean sunrise and sunset with the glimpse of 🌋 Mayon volcano. Happy Island Inn Guest Rooms Guest Reviews Travel Guides Go Catanduanes! Terms & Conditions Credits Contact us 📍 186 San Vicente, Virac, Catanduanes 📞 Phone : (+63) 921 864 8144 ✉️ Email : book (at) happyislandinn.com Front Desk Front desk hours: Kitchen : 09.00 AM – 20.00 PM 06.00 AM – 20.00 PM Happy Island Inn – Virac, Catanduanes. Copyright Credits © 2023. All rights reserved"
    },
    {
      "url": "https://www.islandhospitality.com/our-company/our-history",
      "text": "Our History | Island Hospitality Management SKIP TO CONTENT Our Company Our Team Our History Services Portfolio IHM Outdoors New Collection Properties News & Press Careers Benefits Diversity Pathways Apply Now 561-655-9001 Our History Our Company Our Team Our History Hands-On In the Beginning Island Hospitality grew from its first property - The Hampton Inn West Palm Beach in 1985 - to become one of the country’s most admired hotel management companies. About Jeffrey H. Fisher An accomplished hotelier and hospitality industry leader, Jeff Fisher serves as the Chief Executive Officer, Chairman of the Board, and President of Chatham Lodging Trust. Previously, Fisher served as Chairman and Chief Executive Officer of Innkeepers USA and currently serves on the Board of Marriott’s Residence Inn Association. 2024 IHM expands adding 3 branded hotels to its portfolio in Syracuse, Boca Raton, and Phoenix. 2023 IHM becomes the exclusive hotel manager for The Winslow Hotels and launches IHM Outdoors, a new division focused on outdoor and resort hospitality. 2022 IHM expands adding 14 hotels to its portfolio with a new presence in Baltimore & Phoenix. 2021 Added 8 hotels with continued growth in Austin, Los Angeles, DC and Charlotte. 2020 IHM becomes the exclusive hotel manager for the new extended stay brand WaterWalk, the 5th hotel created by Jack DeBoer. 2015 With additional portfolio acquisitions, IHM grows to manage over 170 hotels. 2014 IHM successfully onboards two major portfolio acquisitions. 2010 IHM partners with Chatham Lodging Trust. 2007 IHM manages over 80 hotels, including new full-service properties. 2003 The company manages over 70 hotels after acquiring 27 Residence Inns. 1999 JF Hotels officially changes its name to Island Hospitality Management and has 40 hotels under management. 1994 JF Hotels begins managing extended stay hotels. 1985 JF Hotels is founded and assumes management of the newly constructed Hampton Inn West Palm Beach. sign up Contact Us facebook instagram linkedin Thank you for your interest. Hidden Field Full Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Island Hospitality 222 Lakeview Avenue Suite 200 West Palm Beach, Florida 33401 561-655-9001 Island Cares Island Keys Iris Hotel Marketing Contact Privacy Policy Accessibility © Island Hospitality 2025.All Rights Reserved Website Design by Tambourine"
    },
    {
      "url": "https://islandinnmonhegan.com/contact-us/",
      "text": "Contact Us | The Island Inn | Monhegan, Maine (207) 596-0371 Facebook Instagram Facebook Instagram The Island Inn on Monhegan Island, Maine Getting to Monhegan Contact Us The Inn The Island Inn Videos Rooms & Rates Monhegan Island Gallery Things To Do Island Links Dining Dining Options Dinner Menu The Barnacle Events Events Calendar Special Events Reservations Select Page Contact Us Monhegan Island, Maine Home / Contact Us . Hours: Our Front Desk is open daily, May 23rd to October 13th, from 7:30 AM- 9:00PM. To Reserve a Room: 2025 reservations can be made by phone or, if you prefer, they can be made through our online reservation system . (207) 596-0371 To Purchase a Gift Certificate: We would be happy to send you a gift certificate. Please call us or e-mail us at info@islandinnmonhegan.com Inquiries for Employment: To inquire about job openings please call, write or email with the dates you are available to work, what position(s) you are interested in, your work experience, and how to contact you. Get in Touch Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Email or Name Comment or Message * Submit Follow Follow Follow Follow  P.O. Box 128, Monhegan Island, Maine 04852  (207) 596-0371  info@islandinnmonhegan.com The Island Inn T he Island Inn sits atop a bluff looking west over Monhegan Harbor toward the ocean and in the evening it provides a perfect location to view the dramatic sunsets and the magnificent colors that accompany them. Rooms & Rates Reservations Follow Follow Follow Follow Dining Open to Guests and Public, American Breakfast included in quoted rates, Dinner à la Carte. Reservations are required for Dinner. Reservations are not accepted for Breakfast Dining Info Resources Contact The Island Inn Getting to Monhegan Things To Do on Monhegan Monhegan Island Trail Map Events & Workshops Employment © Copyright 2025 – The Island Inn – All Rights Reserved – Privacy Policy Web Design by Maine Hosting"
    },
    {
      "url": "https://www.islandhospitality.com/our-company/the-team",
      "text": "Our Team | Island Hospitality Management SKIP TO CONTENT Our Company Our Team Our History Services Portfolio IHM Outdoors New Collection Properties News & Press Careers Benefits Diversity Pathways Apply Now 561-655-9001 Our Team Our Company Our Team Our History Team Meet Our Team Our top-tier hotel professionals are hands-on managers whose industry experiences all began with on-property positions. Devoting personal attention to each property and ownership group, combined with using independently developed proprietary technology our team delivers tailored solutions for owners and investors to achieve their management and financial goals. Who We Are Samantha Fisher Chief Investment Officer Gregg Forde President and Chief Operating Officer Drew Allison Executive Vice President of Operations John Marques Executive Vice President of Operations Mark George Senior Vice President of Commercial Strategy Michelle Marlowe Senior Vice President of Accounting Rob Auerbach Senior Vice President of Purchasing Michelle Westbrook VP of Revenue Management Marc Winer Vice President of Corporate Support & Hotel Technology Margaret Dye Senior Vice President of Operations Hayden Schlosser Divisional Vice President of Operations Wendy Blaas Vice President of Operations Susanne LoFaso Vice President of Operations Thompson Mosher Vice President of Operations Denise Rubin Vice President of Operations Kate Nicoli Regional Vice President Melody Haislip Vice President of National Sales Melissa Prince Vice President of National Sales Leigh Comis Vice President of Sales Sue Mccormick Vice President of Sales Krishelle Cruz Vice President of Sales John Lozano Regional Vice President of Sales - Outdoors Division Alicia Pascua Vice President of Human Resources, People & Culture Sandra Pena Vice President of Human Resources, Benefits & Compensation Thomas Ciszak Vice President of Food & Beverage Kiley Watkins Director of Digital Marketing & Strategy sign up Contact Us facebook instagram linkedin Thank you for your interest. Hidden Field Full Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Island Hospitality 222 Lakeview Avenue Suite 200 West Palm Beach, Florida 33401 561-655-9001 Island Cares Island Keys Iris Hotel Marketing Contact Privacy Policy Accessibility © Island Hospitality 2025.All Rights Reserved Website Design by Tambourine"
    }
  ]
}