{
  "fuentes": [
    {
      "url": "https://www.tampabay.com/archive/2000/09/15/restaurateur-to-bring-touch-of-the-tropics/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://islandwaygrill.com/about/",
      "email": "igrill@islandwaygrill.com"
    },
    {
      "url": "https://islandwaygrill.com/event/",
      "email": "igrill@islandwaygrill.com"
    },
    {
      "url": "https://islandwaygrill.com/sundaybrunch/",
      "email": "igrill@islandwaygrill.com"
    },
    {
      "url": "https://blueisland.in/pages/contact-us",
      "email": "logo_160x@2x.png"
    },
    {
      "url": "https://blueisland.in/pages/contact-us",
      "email": "orders@blueisland.in"
    },
    {
      "url": "https://www.islandgrillja.com/contact",
      "email": "proteam@mopro.com"
    },
    {
      "url": "https://iloveclearwater.com/listings/island-way-grill/",
      "email": "kellyshannonkelly@yahoo.com"
    },
    {
      "url": "https://iloveclearwater.com/listings/island-way-grill/",
      "email": "ajax-loader@2x.gif"
    },
    {
      "url": "https://islandwaygrill.com/gallery/",
      "email": "igrill@islandwaygrill.com"
    },
    {
      "url": "https://islandwaygrill.com/504-2/",
      "email": "igrill@islandwaygrill.com"
    },
    {
      "url": "https://www.islandgrillja.com/join-our-team",
      "email": "proteam@mopro.com"
    },
    {
      "url": "https://islandwaygrill.com/",
      "email": "igrill@islandwaygrill.com"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "email": "hero-contact@2x.jpg"
    },
    {
      "url": "https://baystarrestaurantgroup.com/about-us/",
      "email": "fullscreen@1x.png"
    },
    {
      "url": "https://baystarrestaurantgroup.com/about-us/",
      "email": "fullscreen@2x.png"
    }
  ],
  "mails": [
    "ajax-loader@2x.gif",
    "fullscreen@1x.png",
    "fullscreen@2x.png",
    "hero-contact@2x.jpg",
    "igrill@islandwaygrill.com",
    "kellyshannonkelly@yahoo.com",
    "licensing@zumapress.com",
    "logo_160x@2x.png",
    "orders@blueisland.in",
    "proteam@mopro.com"
  ],
  "nombre_sitio": "islandwaygrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tampabay.com/archive/2000/09/15/restaurateur-to-bring-touch-of-the-tropics/",
      "text": "Restaurateur to bring touch of the tropics Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Archive Restaurateur to bring touch of the tropics By DEBORAH O'NEIL Published | Updated MORE FOR YOU Photos: Clearwater Ferry crash • Transportation After a baby was born in a hurricane shelter, a witness is left wondering • Hurricane Advertisement Hurricane Helene to keep Tampa Bay area schools closed Friday • Hurricane More Florida faculty still looking to leave the state, survey shows • Archive Drivers could cross the new Howard Frankland in six months. Here’s what’s left. • Transportation What to expect from the Lightning at NHL trade deadline • Sports Tampa council approves $14 million to settle wrongful conviction lawsuit over 1983 murder • Tampa Florida makes it official: Universities to drop sociology as a core course • Archive Pete Alonso’s Battle for the Bay knocks giving back out of the park • Photos Tampa woman charged after 3 puppies found in dumpster, police say • Breaking News Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://islandwaygrill.com/about/",
      "text": "About Us - Island Way Grill 727-461-6617 igrill@islandwaygrill.com Reserve Gift Cards Careers Baystar Restaurant Group Home Menus Gallery Events About Us Our Team Giving Back Direct Seafoods Artwork Baystar Restaurant Group Affiliated Restaurants Location Select Page Who We Are About Us Our Team Giving Back Direct Seafoods Artwork Affiliated Restaurants Address 20 Island way Clearwater, Fl 33767 For Reservations Call: (727) 461-6617 or Online Reservations - Click Here Hours Monday -Thursday: 4 pm – 9 pm Friday: 4 pm – 10 pm Saturday: 12 PM – 10 pm Sunday Brunch: 10 am – 1:30 pm Sunday Dinner: 4 pm – 9 pm Contact Us Notice: JavaScript is required for this content. Slide Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM"
    },
    {
      "url": "https://islandwaygrill.com/event/",
      "text": "Events - Island Way Grill 727-461-6617 igrill@islandwaygrill.com Reserve Gift Cards Careers Baystar Restaurant Group Home Menus Gallery Events About Us Our Team Giving Back Direct Seafoods Artwork Baystar Restaurant Group Affiliated Restaurants Location Select Page Special Events Events Address 20 Island way Clearwater, Fl 33767 For Reservations Call: (727) 461-6617 or Online Reservations - Click Here Hours Monday -Thursday: 4 pm – 9 pm Friday: 4 pm – 10 pm Saturday: 12 PM – 10 pm Sunday Brunch: 10 am – 1:30 pm Sunday Dinner: 4 pm – 9 pm Contact Us Notice: JavaScript is required for this content. Slide Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM"
    },
    {
      "url": "https://islandwaygrill.com/sundaybrunch/",
      "text": "Sunday Brunch - Island Way Grill 727-461-6617 igrill@islandwaygrill.com Reserve Gift Cards Careers Baystar Restaurant Group Home Menus Gallery Events About Us Our Team Giving Back Direct Seafoods Artwork Baystar Restaurant Group Affiliated Restaurants Location Select Page Menus Header Menus Sunday Brunch Island Way Sunday Brunch 10:00 AM Till 2:30 PM Last Reservation at 1:30 PM $40 Adults $10 Kids 10 And Under Pastry & Coffee Station House Cappuccino Assorted Mini Muffins Assorted Danish Fresh Beignets Breakfast  Station Scrambled Eggs Bacon & Sausage Banana Foster French Toast Cheese Blintz With Fruit Compote Quiche (changes weekly) Breakfast Potatoes Sushi Display Sushi Chef’s Assorted Sushi Dessert Station Assorted Mini Cupcakes Fudge Brownies, Lemon Bars, Island Way Bars Key Lime Pie, Cheesecake, Espresso Chocolate Cake, Mini Mousse Shooters…Key Lime, Chocolate, Peanut Butter, Tiramisu, Strawberry Shortcake Assorted Cookies Island Way Sunday Brunch 10:00 AM Till 2:30 PM Last Reservation at 1:30 PM $40 Adults $10 Kids 10 And Under Shellfish Station Fresh Shucked Oysters On The ½ Shell Peel & Eat Shrimp Krab Salad Salad Station 5 Varieties Of Salads (changes weekly) Assorted Meats & Cheeses Deviled Eggs Fresh Fruit Display Lunch Station (items change weekly) Chicken Seafood Seasonal Vegetable Chef’s Pasta Carving Station Center Cut Sirloin Buffet Ham Smoked Salmon Made to Order Omelet Station Waffles Lox & Bagel with Cream Cheese & Capers, Onions One Complimentary Mimosa Or Champagne Included As Well As Coffee, Tea, and Soft Drinks Address 20 Island way Clearwater, Fl 33767 For Reservations Call: (727) 461-6617 or Online Reservations - Click Here Hours Monday -Thursday: 4 pm – 9 pm Friday: 4 pm – 10 pm Saturday: 12 PM – 10 pm Sunday Brunch: 10 am – 1:30 pm Sunday Dinner: 4 pm – 9 pm Contact Us Notice: JavaScript is required for this content. Slide Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM"
    },
    {
      "url": "https://blueisland.in/pages/contact-us",
      "text": "Contact Us\n      \n      \n       – Blue Island Skip to content Home Shop by Category Stain Proofs Shirts Stain Proof Pants Power Stretch All Mode Pants Bamboo Linen Shirts Sunblock Jackets - Men Active wear Polo Tshirts Active wear Round neck Tshirts Air lite Shirts About Track Order Return Request Contact FAQ Log in Cart Your cart is empty SEPTEMBER MONTH SALE - // 3 SHIRTS 2699 ₹ // 4 SHIRTS 3500  ( Combo offer applicable only for Stainproof shirts ) Home Home Shop by Category Stain Proofs Shirts Stain Proof Pants Power Stretch All Mode Pants Bamboo Linen Shirts Sunblock Jackets - Men Active wear Polo Tshirts Active wear Round neck Tshirts Air lite Shirts About About Track Order Track Order Return Request Return Request Contact Contact FAQ FAQ Log in Search Cart ( 0 ) Home Home Shop by Category Stain Proofs Shirts Stain Proof Pants Power Stretch All Mode Pants Bamboo Linen Shirts Sunblock Jackets - Men Active wear Polo Tshirts Active wear Round neck Tshirts Air lite Shirts About About Track Order Track Order Return Request Return Request Contact Contact FAQ FAQ Log in Search Cart ( 0 ) Contact Us HI !! Want to get in touch? We’d love to hear from you. Here’s how you can reach us… Email: orders@blueisland.in Ask a question Your name Your email Your phone (optional) Your message Send message Policy and Terms Track Order Return and Exchange Privacy Policy Shipping Policy Terms of Service Refund policy Return Request About the shop We provide the most innovative addition to your wardrobe Shop by Collection Stain Proof Shirts Stain Proof Chinos Power Stretch - All Mode Pants Bamboo Linen Shirts Sunblock Jackets Active wear Polo Tshirts Active wear Round neck Tshirts Airlite Shirts Newsletter Subscribe to receive updates, access to exclusive deals, and more. Subscribe © BLUEISLAND CLOTHING PRIVATE LIMITED"
    },
    {
      "url": "https://www.islandgrillja.com/contact",
      "text": "Contact - Island Grill Home About Press CAREERS Join Our Team Careers Menu Our Menu Catering Gallery Locations Contact Us Contact Island Grill © 2025 A Mopro Website Back to Top"
    },
    {
      "url": "https://iloveclearwater.com/listings/island-way-grill/",
      "text": "ISLAND WAY GRILL - I Love Clearwater ABOUT CONTACT ADVERTISE Florida, US 85 °F Search for: Search Button Home Things to Do Entertainment Events Family Fun Libraries Museums Parks Rec Centers Shopping Sports Transportation Water Activities Stay Beach Hotels Central Hotels PIE Airport Hotels Food & Drinks Restaurants Bakeries Healthy Food Ice Cream Pet-Friendly Wineries Community Artists Authors Business Charities Civic Groups Clubs Fraternal Organizations Neighborhoods Realtors Volunteers Blog Home Things to Do Entertainment Events Family Fun Libraries Museums Parks Rec Centers Shopping Sports Transportation Water Activities Stay Beach Hotels Central Hotels PIE Airport Hotels Food & Drinks Restaurants Bakeries Healthy Food Ice Cream Pet-Friendly Wineries Community Artists Authors Business Charities Civic Groups Clubs Fraternal Organizations Neighborhoods Realtors Volunteers Blog Home ISLAND WAY GRILL ISLAND WAY GRILL ISLAND WAY GRILL admin 2024-03-15T18:48:39+00:00 ISLAND WAY GRILL Restaurants Tags Clearwater FL Florida grill Island Way Island Way Grill restaurant restaurants seafood ABOUT Council Oak Steaks & Seafood offers sophisticated, classic-American steakhouse fare featuring U.S.D.A. prime steaks, fresh seafood, specialty dishes showcasing an open-kitchen, in-house butcher shop and dry-aging room outfitted with pink Himalayan salt walls, multi-level seating, and wine rooms highlighting the restaurant’s award-winning slection of more than 400 labels. AMENITIES DINING/NIGHTLIFE Alfreds Futterkiste Average Price of Entree: Varies Cuisine: Steakhouse Days/Hours of Operation: Sunday - Thursday: 5 PM - 10 PM, Friday & Saturday: 5 PM - Midnight Dinner Major Credit Cards Accepted Style: Fine Dining Total Restaurant Capacity: 120 360 VIEWS Contact Info 727-61-6617 islandwaygrill.com 20 Island Way, Clearwater, FL 33767 Working Hours Monday 4 PM - 9 PM Tuesday 4 PM - 9 PM Wednesday 4 PM - 9 PM Thursday 4 PM - 9 PM Friday 4 PM - 10 PM Saturday 11 AM - 10 PM Sunday 10:30 AM - 1:30 PM, 4 PM - 9 PM admin 7278310479 wd25.stpl@gmail.com Send Please follow & like us :) Facebook Twitter Youtube Instagram Linkedin I’m excited to share the adventures, places and people of Clearwater with you! Kelly Contact: Kelly@ILoveClearwater.com. New York, NY 81° Sunny 6:31 am 7:13 pm EDT Feels like: 81 °F Wind: 7 mph N Humidity: 36 % Pressure: 30.07 \"Hg UV index: 3 5 pm 6 pm 7 pm 8 pm 9 pm 79 °F 79 °F 77 °F 73 °F 72 °F Fri Sat Sun Mon Tue 79 °F / 66 °F 79 °F / 66 °F 82 °F / 66 °F 81 °F / 64 °F 81 °F / 64 °F New York, NY weather forecast for tomorrow ▸ Get new post by email Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Subscribe Topics 12 Days of Christmas 727 Day Accommodations Activities Airport Airports Amber Cam Amplify Clearwater Amplify Clearwater Business Spotlight Apartments April Fool's Day Arbor Day Art Artists Arts and Culture Attractions Authors Awards Back to School Bakeries and Cafes Bars Bay Area Renaissance Festival Beach Best Biking Biking Boating Breakfast and Brunch Buffets Business Business Spotlight Buying Candidates Forum Capitol Theatre Celebrities Chalkful of Taste Charity Christmas Christmas Under the Oaks Churches Cinco de Mayo City Council Candidates City Government Clearwater Beach Clearwater Beach Taste Fest Clearwater Celebrates America! Clearwater Comic Con Clearwater Ferry Clearwater Hispanic Farmers Market Clearwater Historical Society Clearwater Marine Aquarium Clearwater Sister Cities Clearwater Threshers Clerkship Clothes Clubs CMX Cinemas Coachman Park Community Concerts Contests Cooking Countryside Mall County Government COVID-19 Crab Fest Crafts Crime Cruises Cultural Dance Development Dia de Los Muertos Dine Out for a Difference Disc golf Dog park Dog parks Dogs Doug Kelly Downtown Downtown Gateway Earth Day Easter Easter Family Day Eco-Friendly Education Election Day Entertainment Environment Escape Room Ethnic festivals Events Family Family Fun Father's Day Festival of Trees Fireworks Fish Fry Fishing Fishing Florida Attractions Flying Food Food Truck Rally Food Trucks Fourth of July Free Gaming Gardening General Getting Around Golf Government Greek Greekfest Groups Guest Posts Halloween Hanukkah Health Healthy Food Hiking Hispanic/Latino History Hobbies Holiday Holiday Extravaganza Hotels Hotels Houses Housing Humor Hurricane Ice cream Imagine Clearwater Interviews Jazz Holiday John Lawrence Jolley Trolley Juice Bar Juneteenth Kayaking Kids Library Light it Up Clearwater! Living the Culture Local Government Look Up! Clearwater Marine Animals Martin Luther King Day Mayor Memorial Day Mental Health Miracle on Cleveland Street Moccasin Lake Nature Park Mother's Day Motorcyles Movie Theaters Moving to Clearwater Murals Museum Music Mystery Diner Nagano Japan Nature Neighborhoods Neighborhoods Day New Year's Day New Year's Eve Nightlife Non-Profit Online Events Outdoors Painting Parade Park & Ride Parking Parks Pet-Friendly Pets Philadelphia Phillies Photo Contests Photo Gallery Photography Pickleball Pier 60 Pinellas County Police Politics PSTA Public Safety Reading Real Estate Recreation Centers Red Ribbon Day Reposts Restaurant Review Restaurants Retail Rising Above! Romance Ruth Eckerd Hall Safety Santa & Suds 5K Scavenger Hunt School Sea Blues Festival Seafood Sean Shares Seniors Shopping Shopping with a Vibe Sister Cities Spa Sports Spring Break St Patrick's Day Station Square Park Stone Crab Festival Strategic Plan Stroll of Trees Sugar Sand Festival Suncoast Jazz Festival Sunsets at Pier 60 Survey Swimming Tampa Bay Buccaneers Tampa Bay Lightning Taste the Town Thanksgiving The District The Kelly Kelly Show The Market Marie The Sound Tourism Tours Transportation Travel Tribute Uncategorized Unusual Vacation Rentals Valentine's Day Veterans Veterans Day Videos Virtual Visit St. Pete/Clearwater Volunteer Walking Water Sports Watersports Weather Web Cams West Coast Players Wildlife Wildlife Winery Winter Wonderland Get In Touch SIGNUP NOW NEWSLETTER WE'LL SEND YOU OUR DESTINATION GUIDE QUICK LINKS Disclosure Policy Privacy Policy TOS ABOUT US About Partner Contact CLEARWATER WELCOME CENTERS Clearwater Welcome Centers Parks © 2025 All rights reserved ×"
    },
    {
      "url": "https://islandwaygrill.com/gallery/",
      "text": "Gallery - Island Way Grill 727-461-6617 igrill@islandwaygrill.com Reserve Gift Cards Careers Baystar Restaurant Group Home Menus Gallery Events About Us Our Team Giving Back Direct Seafoods Artwork Baystar Restaurant Group Affiliated Restaurants Location Select Page Gallery Gallery Address 20 Island way Clearwater, Fl 33767 For Reservations Call: (727) 461-6617 or Online Reservations - Click Here Hours Monday -Thursday: 4 pm – 9 pm Friday: 4 pm – 10 pm Saturday: 12 PM – 10 pm Sunday Brunch: 10 am – 1:30 pm Sunday Dinner: 4 pm – 9 pm Contact Us Notice: JavaScript is required for this content. Slide Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM"
    },
    {
      "url": "https://islandwaygrill.com/504-2/",
      "text": "Main Menu - Island Way Grill 727-461-6617 igrill@islandwaygrill.com Reserve Gift Cards Careers Baystar Restaurant Group Home Menus Gallery Events About Us Our Team Giving Back Direct Seafoods Artwork Baystar Restaurant Group Affiliated Restaurants Location Select Page Menus Header Menus Dinner Menu Download Main Menu Small Plates Lobster Bisque $9 Edamame $7 Sea Salt Crab Dip $16 House made corn chips Calamari $17 lightly fried, sweet chili, roasted cashews, crisp noodles Jumbo Coconut Shrimp $14 orange-ginger sauce Millionaire’s Bacon $12 applewood smoked, sugar spiced Mussels Provençale $14 white wine, garlic, basil, saffron broth with plum tomato, basil and lemon zest Grilled Octopus $17 red wine poached, grilled white bean pureé, romesco sauce Fresh Smoked Tuna Spread $11 saltines, lemons, hot sauce Caprese Bruschetta $12 fresh mozzarella, tomato, red onion, pesto, balsamic, warm garlic bread Baystar* $15 tempura shrimp, cream cheese, topped with avocado, baked dynamite, tempura fried, masago, eel sau Summer Moon* $20 spicy tuna, salmon, cucumber, topped with avocado, salmon, eel sauce, spicy mayo, red tobiko Sharing Sides All sides $10 Crispy Cauliflower ponzu, cashews, sesame, cilantro, pickled red onion Au Gratin Potatoes roasted jalapeño, three cheese Fire Roasted Vegetable Stack Truffle Mac & Cheese Grilled Asparagus shaved parmesan Brussels Sprouts Sherry, Maple, sesame Fire & Ice Oysters Rockefeller $16 artichokes, spinach, bacon, parmesan, hollandaise sauce Jumbo Shrimp Cocktail $14 cocktail sauce Bay Shrimp Cocktail $7 chilled, cocktail sauce York River Oysters $14 Virginia - delightful salty, mild flavors half dozen, simply raw, cocktail sauce, horseradish, sake ginger mignonette Handhelds served on Martin’s potato roll, served with parmesan fries Just Caught MKT fried, grilled or blackened, lettuce, tomato & onion Fire Grilled Chicken $14 applewood smoked bacon, swiss cheese, lettuce, tomato, and house honey mustard Steak Tenderloin $19 chimmichurri, creamy horseradish Artisan Butcher Burger $16 beef brisket, short rib, 100% USDA Prime, white cheddar, bacon jam, arugula Greens Salad of the Sea $24 lobster and jumbo shrimp, chopped cobb salad with spring mix, avocado, tomatoes, blistered corn, hard-boiled eggs, brandy dijon vinaigrette, everything bagel seasoning Wedge $9 iceberg lettuce, candied bacon, red onion, blue cheese dressing, tomato Caesar $8 romaine, caesar dressing, house-made garlic croutons, parmigiano-reggiano Shrimp Louie $11 gulf shrimp, iceberg wedge, red onions, thousand island Poke Bowl sushi rice, seaweed sala, poke sauce, masago, spicy mayo, eel sauce tuna... 19 salmon... 17 combo... 18 Catch of the Day fresh fish caught directly from our own fleet of day boats. served with wasabi mashed potatoes. Mahi-Mahi MKT Grouper MKT American Red Snapper MKT Just Caught MKT Select from one of our unique and flavorful presentations Island Way coconut milk, mild red curry spices, carrots, zucchini, bell pepper and basil stir fry, coconut rice - add 4 Wood Fire-Grilled basil, lemon, butter sauce,charred pineapple salsa Clearwater tomatoes, onion, capers, garlic, basil, finished with parmesan - add 4 Linguine Pasta edamame pods, champagne beurre blanc - add 4 Shrimp, Scallop & Crab Meat Stuffing- add 7 Other Specialties 1 lb Duroc Pork Chop $25 sous vide slow cooked. finished on charcoal pit fire, blackberry reduction Stuffed Chicken $22 charcoal-grilled, fontina cheese, prosciutto, mushrooms, citrus basil butter Volcano Island Meatloaf $18 tumbleweed onions, balsamic reduction drizzle, wasabi mashed potatoes Seafood Specialties Mahi-Mahi $29 stuffed with shrimp & scallops, roasted, finished with citrus cream, wasabi mashed potatoes Roasted Cedar Plank Salmon $21 honey-rhum glaze, wasabi mashed potatoes Jumbo Coconut Shrimp $26 rolled in coconut, orange-ginger sauce, french fries Sea Bass Scallop Crusted $33 buttered ritz crackers, champagne beurre blanc, wasabi mashed potatoes Maine Lobster Tails fire roasted, wasabi mashed potatoes single $25, twin tails $49, triple tails $72 Seared Bacon Wrapped Scallop Pasta $31 served over linguine, citrus butter cream sauce Island Style Seafood Bowl $32 salmon, shrimp & scallops, cooked in coconut milk, mild red curry spices, carrots, zucchini, bell pepper, basil stir fry, coconut rice Lobster & Shrimp Sauté $39 lobster, shrimp, broccolini, red peppers, mushrooms, penne pasta in light sherry cream sauce - with shrimp only... 25 Steaks Served with wasabi mashed potatoes or house seasoned fries ribeyes and tomahawks sold by the ounce. ask your server for details Steak Complements Chimichurri or A-1 “Our Way” • Béarnaise – add 3 Filet Mignon 1/3 pound $36 1/2 pound $43 Bone-In Ribeye, Prime Cut 1 to 2 pounds mkt New York Strip 3/4 pound $39 Tomahawk Steak 1 to 3 pounds mkt Twin Bacon Wrapped Filet Mignon $45 applewood smoked bacon wrapped petite filets Surf & Turf $59 filet mignon and roasted lobster tail - You can surf - Maine Lobster Tail - fire roasted Add $24 Address 20 Island way Clearwater, Fl 33767 For Reservations Call: (727) 461-6617 or Online Reservations - Click Here Hours Monday -Thursday: 4 pm – 9 pm Friday: 4 pm – 10 pm Saturday: 12 PM – 10 pm Sunday Brunch: 10 am – 1:30 pm Sunday Dinner: 4 pm – 9 pm Contact Us Notice: JavaScript is required for this content. Slide Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM"
    },
    {
      "url": "https://www.islandgrillja.com/join-our-team",
      "text": "Join Our Team - Island Grill Home About Press CAREERS Join Our Team Careers Menu Our Menu Catering Gallery Locations Contact Us Join Our Team TEAM MEMBER Kingston, Saint Ann, Saint James, Manchester APPLY NOW by emailing us your CV and contact information at careers@islandgrillja.com. This job creates the Island Grill experience, by providing customers with delightful food and service, and maintaining a clean and comfortable restaurant environment.  Team Members are responsible for following Island Grill’s Core Beliefs ISLAND GRILL IS SEEKING TO RECRUIT COMPETENT AND SUITABLY QUALIFIED & EXPERIENCED INDIVIDUALS TO APPLY FOR THE POSITIONS OF TEAM MEMBER -  Kingston, Saint Ann, Saint James, Manchester Job Summary: This job creates the Island Grill experience, by providing customers with delightful food and service, and maintaining a clean and comfortable restaurant environment.  Team Members are responsible for following Island Grill’s Core Beliefs. Key Responsibilities: 1.            Delights customers with great Island food and service •             Provides prompt, professional and personable customer service •             Greets every customer in a welcoming manner •             Responds to customer needs and says ‘thank you’ to every customer •             Prepares great, consistent freshly prepared food by following our recipe standards and procedures •             Achieves great QSC results and is always ‘customer ready’ 2.            Maintains quality restaurant operations •             Follows company policy and workstation procedures •             Co-operates and is supportive of co-workers, Supervisors & Managers •             Coaches others to encourage learning, positive feedback & improve performance •             Responds appropriately to coaching from others •             Keeps a clean and organized workspace •             Maintains food safety and sanitation standards •             Keeps a really clean restaurant by completing cleaning tasks to standard •             Follows inventory standards for stocking, dating, rotating and storing •             Always follows policies and procedures on safety and security •             Communicates important information to Management Team 3.            Contributes to our efficiency and profitability •             Assembles food orders promptly for great thru-put and smooth service •             Maintains correct portion control •             Follows cash handling procedures •             Follows inventory stocking and recording procedures •             Contributes to restaurant goals for increasing sales and reducing costs •             Maintains regular attendance and consistent punctuality Qualification and Skills Needed: Applicants must possess any one (1) of the following: CSEC Passes at Grade 1-3 - Food & Nutrition -          Home Management -          Human & Social Biology -          Agricultural Science HEART/NTA NCTVET Passes in - Food Preparation Level 1or 2 -          Commis Chef -          Customer Service -Display excellent written, verbal communication and listening skills -Willingness to work flexible schedules APPLY NOW Island Grill © 2025 A Mopro Website Back to Top"
    },
    {
      "url": "https://islandwaygrill.com/",
      "text": "Island Way Grill - Clearwater Beach, Florida - Island Way Grill 727-461-6617 igrill@islandwaygrill.com Reserve Gift Cards Careers Baystar Restaurant Group Home Menus Gallery Events About Us Our Team Giving Back Direct Seafoods Artwork Baystar Restaurant Group Affiliated Restaurants Location Select Page try our award winning sunday brunch! View Brunch Menu Reserve a Table Celebrate Florida Spiny Lobster season with our Florida Surf N` Turf! 🦞 Florida lobster stuffed with shrimp, crab & scallops with a 4oz bacon wrapped filet served with asparagus and mash. #islandwaygrill #floridalobsterseason #floridasurfnturf #localdining #freshseafood #waterfrontdining #baystarrestaurantgroup 18 1 Open post by island_way_grill with ID 18185322877324793 It`s the best day of the week again...Burger, Bourbon & Beer Mondays! Enjoy half off all bourbon and beer, and indulge in $15 specialty burgers, all evening long! 🍔🥃 Tonight`s specialty burgers: BLT Burger Bacon, lettuce, tomato, &  garlic aioli Caprese Burger Sliced mozzarella, tomato, arugula, & balsamic #islandwaygrill #bourbonbeerburgers #mondaydeal #waterfrontdining #bltburgers #capreseburger #clearwaterbeach #baystarrestaurantgroup 6 0 Open post by island_way_grill with ID 18094970575727907 Visit us this Saturday from noon - 3PM for our new Saturday Lunch & Brunch Menu! ☀️ We are featuring delicious handhelds, as well as some classic brunch dishes with an Island Way twist, such as Cranberry Pecan Chicken Salad, Chicken & Waffles, Avocado Toast, Quiche, and more! #islandwaygrill #saturdaylunch #cranberrychickensalad #chickenandwaffles #fishtacos #avocadotoast #quiche #waterfrontdining #clearwaterfl #baystarrestaurantgroup 11 0 Open post by island_way_grill with ID 18078299465299976 Our mocktails make the perfect weekday drink! Enjoy all the island flavor with none of the alcohol with our Venus & Blue By You zero proof drinks. View our full drink menu here: https://islandwaygrill.com/drink-menu/ #islandwaygrill #mocktails #islanddrinks #venus #bluebyyou #zeroproof #newdrinks #waterfrontdining #dinelocal #baystarrestaurantgroup 11 0 Open post by island_way_grill with ID 17871203421410283 You`ve made it 1/2 way through the week! Make the most of it with Wine Down Wednesdays at Island Way Grill!  50% off ALL bottles of wine and live entertainment from Sam on Sax. 🍷 🎶 #islandwaygrill #winedownwednesdays #halfoffbottlesofwine #wednesdayspecials #liveentertainment #waterfrontdining #baystarrestaurantgroup 6 0 Open post by island_way_grill with ID 17988265874696379 Join us today, and every Monday for Bourbon, Beer, and Burgers Mondays! Enjoy half off all bourbon and beer, and indulge in $15 specialty burgers, all evening long! 🍔🥃 Tonight`s specialty burgers: Bourbon, Bacon, and Carmalized Onion Burger Smashed Tater Burger #islandwaygrill #bourbonbeerburgers #mondaydeal #waterfrontdining #clearwaterbeach #baystarrestaurantgroup 6 0 Open post by island_way_grill with ID 18098035798617660 Join us today, and every Monday for Bourbon, Beer, and Burgers Mondays! Enjoy half off all bourbon and beer, and indulge in $15 specialty burgers, all evening long! 🍔🥃 Tonight`s specialty burgers: Caramelized Onion & Blue Cheese Burger & Mushroom Swiss Burger #islandwaygrill #bourbonbeerburgers #mondaydeal #onionbluecheeseburger #mushroomswiss #waterfrontdining #clearwaterbeach #baystarrestaurantgroup 5 0 Open post by island_way_grill with ID 18061410584587695 Visit us this Saturday from noon - 3PM for our new Saturday Lunch & Brunch Menu! ☀️ We are featuring some classic brunch dishes with an Island Way twist, such as Cranberry Pecan Chicken Salad, Chicken & Waffles, Avocado Toast, Quiche, and more! #islandwaygrill #saturdaylunch #cranberrychickensalad #chickenandwaffles #avocadotoast #quiche #waterfrontdining #clearwaterfl #baystarrestaurantgroup 14 0 Open post by island_way_grill with ID 18300339532217204 Repost from @samonsax_ Join me for 🍷Wine Down Wednesday 6-8 PM 🎷@island_way_grill 🎷🍷Hey #SamFam — Let’s make Wednesday, July 30th one for the books! I’ll be bringing the smooth saxophone vibes to Island Way Grill on Clearwater Beach from 6–8 PM. It’s the perfect night out for: ✨ Wine lovers (50% OFF bottles all night!) 🎶 Live music fans 👯‍♀️ Moms looking for a well-deserved girls night out 💑 Couples ready for a romantic date night 🥂 Anyone who loves great food, drinks, and waterfront views Come early, grab a bottle (or two), enjoy the amazing menu 👉🏾 https://islandwaygrill.com/menus/ and let’s create a night to remember. 🎷 📅 Tuesday, July 30th 📍 Island Way Grill – Clearwater Beach 🕕 6:00 PM–8:00 PM 4 0 Open post by island_way_grill with ID 18074049350508584 Join us today, and every Monday for Bourbon, Beer, and Burgers Mondays! Enjoy half off all bourbon and beer, and indulge in $15 specialty burgers, all evening long! 🍔🥃 Tonight`s specialty burgers: PB & J - Whipped Peanut Butter, Bacon Jam Cowboy - White Cheddar, Crispy Bacon, Onion Straws & BBQ Aioli #islandwaygrill #bourbonbeerburgers #mondaydeal #pbandjburger #cowboyburger #waterfrontdining #clearwaterbeach #baystarrestaurantgroup 6 0 Open post by island_way_grill with ID 18130003624453008 Celebrate your birthday (or any day!) the Island Way, with a bubbly cocktail and waterfront views! 🌴🎉 Photo by @therealhaililudlam #islandwaygrill #specialoccationdining #localdining #waterfrontviews #bubblycocktails #clearwaterbeachfl #baystarrestaurantgroup 8 0 Open post by island_way_grill with ID 18516388252048249 You`ve made it 1/2 way through the week! Make the most of it with Wine Down Wednesdays at Island Way Grill!  50% off ALL bottles of wine and live entertainment from Sam on Sax. 🍷 🎶 #islandwaygrill #winedownwednesdays #halfoffbottlesofwine #wednesdayspecials #liveentertainment #waterfrontdining #baystarrestaurantgroup 2 0 Open post by island_way_grill with ID 17883291813220811 Beat the Monday blues at Island Way Grill with our Burger, Bourbon, and Beer special! 🍔 $15 Burgers 🥃 Half-off bourbons and beer — including premium picks like Buffalo Trace Old Fashioneds and Woodford Reserve Barrel-Aged Cocktails (bar only)! Whether you’re a burger lover, bourbon fan, or just looking for the perfect start to your week, we’ve got you covered. #islandwaygrill #summerspecials #burgersbourbonandbeer #buffalotrace #woodfordreserve #mondaybarspecial #baystarrestaurantgroup 10 0 Open post by island_way_grill with ID 17865864756350575 Come for the cocktails, sushi, seafood & steak…stay for the amazing sunsets! 🌅 Photo by @crystalstastytips • #islandwaygrill #sunsetviews #waterfrontdining #localdining #clearwaterbeach #winterescape #baystarrestaurantgroup 30 0 Open post by island_way_grill with ID 18098057401599838 Join us this evening, and every Wednesday, for Wine Down Wednesdays!  50% off ALL bottles of wine and live entertainment featuring Sam Sanders. 🍷 #islandwaygrill #winedownwednesdays #halfoffbottlesofwine #wednesdayspecials #liveentertainment #waterfrontdining #samsanders #samonsax #livejazz #baystarrestaurantgroup 8 0 Open post by island_way_grill with ID 17970201851920187 Join us today, and every Monday this summer for unbeatable deals: 🍔 $15 Burgers 🥃 Half-off bourbons and beer — including premium picks like Buffalo Trace Old Fashioneds and Woodford Reserve Barrel-Aged Cocktails (bar only)! Whether you’re a burger lover, bourbon fan, or just looking for the perfect start to your week, we’ve got you covered. #islandwaygrill #summerspecials #burgersbourbonandbeer #buffalotrace #woodfordreserve #mondaybarspecial #baystarrestaurantgroup #islandwaygrill #summerspecials #burgersbourbonandbeer #buffalotrace #woodfordreserve #mondaybarspecial #baystarrestaurantgroup 4 0 Open post by island_way_grill with ID 17951804201848887 At Island Way Grill, our sushi is beautiful & delicious! 🥢 📸 by @fyremd #islandwaygrill #bestsushi #workofart #freshseafood #clearwaterbeach #waterfrontdining #dinelocal #baystarrestaurantgroup 16 1 Open post by island_way_grill with ID 17971163855760742 Try our newest special! Blackened Red Drum over Crab, Bacon, and Roasted Corn Orzo with Grilled Asparagus. #islandwaygrill #chefsspecial #blackenedreddrum #freshfish #freshcatch #waterfrontdining #baystarrestaurantgroup 7 0 Open post by island_way_grill with ID 18070094567079750 Happy 4th of July from Island Way Grill! We will be open regular hours today, 4pm - 10pm. 🎆🇺🇸 #islandwaygrill #4thofjuly2025 #waterfrontdining #freshseafood #clearwaterbeachfl #celebrateatislandway #baystarrestaurantgroup 7 0 Open post by island_way_grill with ID 18069129161014967 Treat yourself to tonight`s chef`s special, seared fresh caught tilefish,  with vibrant Vera Cruz Sauce, mixed vegetables, and crispy fingerling potatoes. 🤤 #islandwaygrill #freshfish #tilefish #chefsspecial #chefgerald #veracruzsauce #dinelocal #waterfrontdining #baystarrestaurantgroup 8 0 Open post by island_way_grill with ID 17902656642088362 Come Visit Us By land or by sea Our dock slips are available every day on a first come first serve basis Contact Us Reserve a Table What Our Guests Are Saying…. Island Way Grill 4.1 Stars - Based on 6733 User Reviews 7/30/2025 Was in family vacation to Clearwater, found this restaurant on way to Publix. You can dine in or along waterfront. Food and service was excellent, definitely going back on our next trip here! read more read less 7/24/2025 Manoli took care of us on 25th anniversary and he is a 5 star server! Curtious, attentive and knowledgeable! Fantastic food and great setting too. read more read less 6/11/2025 We ate here once for dinner and 2 times for an early dinner. I got 3 different meals and they were all delicious! The servers were amazing. I highly recommend this for dinner or early dinner. read more read less 5/10/2025 5 stars as always! Island way is the sexiest restaurant in Clearwater.  We had fantastic service from the valets to the hostess and to the server and service team.  The Caribbean snapper was special, I highly recommend it. Surf and turf was spot on as well. The kids popcorn chicken was well received from an exceptionally picky 7 year old. Always a fantastic dinner whenever we are in town, see you next time, Island Way! read more read less 4/09/2025 Wonderful meal …great price …great service …our server .Morena was exceptional…our go to place every time we visit Clearwater … read more read less 3/09/2025 Christine was fantastic! So helpful and so accommodating, she really helped us from start to finish. The buffet was delicious and she recommended the avocado toast and the eggs Benedict. 10/10 recommend.  Thank you Christine! Will definitely be returning. read more read less 3/09/2025 The restaurant checks all the boxes. Service is top notch, facilities are clean and modern, food was fresh and delicious. Menu provided options for every pallet. Our server(Justin) was helpful and very professional. The place was crowded, so I reservations are a good idea (open table).   I highly recommend this establishment and I look forward to returning. read more read less 3/06/2025 Popped in without a reservation tonight for dinner, so our only choice open was at the Sushi Bar.  That didn’t matter though, because we were instantly greeted by Maddie, our server and she provided excellent service through the evening.  The food was absolutely amazing and so was the service!  We are going back on Saturday to celebrate our Birthdays and have asked to be seated in Maddie’s section.  She’s a gem! Oh, also, best Key Lime Pie I’ve ever eaten! read more read less 2/19/2025 this fine establishment offers multiple dinner meals for $22 per person which includes a Caesar salad and a small dessert - $5 tasty house house if ordered before 5:30 PM every day,  my wife and I have tried the filet mignon last week  and tonight we tried the volcano meatloaf - both five star excellent - our server Russ far surpassed our expectations. Also, I should add , that if it rains the outside area at this place and others do not operate - therefore it was packed. Suggest a reservation if a rainy day. Cheers. read more read less Address 20 Island way Clearwater, Fl 33767 For Reservations Call: (727) 461-6617 or Online Reservations - Click Here Hours Monday -Thursday: 4 pm – 9 pm Friday: 4 pm – 10 pm Saturday: 12 PM – 10 pm Sunday Brunch: 10 am – 1:30 pm Sunday Dinner: 4 pm – 9 pm Contact Us Notice: JavaScript is required for this content. Slide Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill is proud to be part of Baystar Restaurant Group Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM Island Way Grill © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing Careers Gift Cards Baystar Restaurant Group Info 20 ISLAND WAY CLEARWATER, FL 33767 727-461-6617 HOURS: MONDAY -THURSDAY: 4 PM – 9 PM FRIDAY: 4 PM – 10 PM SATURDAY: 12 PM – 10 PM SUNDAY BRUNCH: 10 AM – 1:30 PM SUNDAY DINNER: 4 PM – 9 PM"
    },
    {
      "url": "https://www.sidebargrill.com/contact-us/",
      "text": "Contact Us - Sidebar Grill 778.298.7433 | Now Hiring View Menu Promotions Order Online Book A Table Live Music Home About Us Menu Events & News Event Venue Gift Cards Contact Us CONTACT US Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly. 778.298.7433 info@sidebargrill.com View Form Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available SUNDAY TO THURSDAY 11am  - 11pm FRIDAY & SATURDAY 11am  - 12am Get Directions Get In Touch Please leave your name, email and message and we will respond within 48 hours. If you have an urgent request, please feel free to call us directly at: 778-298-7433. First Name * Last Name * Email * Phone Message 778.298.7433 info@sidebargrill.com Unit B – 100 20018 83A Ave Langley BC, V2Y 3R4 Underground Parking Available Available to serve you seven days a week: Monday – Thursday 10:00am-11:00pm Friday and Saturday 9:00am – 12:00am Sunday 9:00am - 11:00pm Home About Us Menu Events & News Private Dining Gift Cards Contact Us"
    },
    {
      "url": "https://baystarrestaurantgroup.com/about-us/",
      "text": "About Us - Baystar Restaurant Group Careers Restaurant Locations About Us Who We Are In The News Restaurants Bar Tiki Cool Cookie Creamery Island Way Grill Marina Cantina Roundabout Pizza Rumba Island Grill Salt Cracker Fish Camp Salt Rock Grill Seaweed Steaks, Seafood & Sushi Catering Contact Gift Cards Select Page Who we are Baystar Restaurant Group 18395 Gulf Blvd #204 Ind ian Shores, FL 33785 |  Phone: (727) 593-5536 | Fax:(727) 593-2966 Contact Us Restaurant Map Careers Gift Cards Catering In The News Seaweed Grill Salt Rock Grill Rumba Island Grill Roundabout Pizza Cool Cookie Creamery Marina Cantina Salt Cracker Fish Camp Bar Tiki Island Way Grill Follow Follow © 2024 Baystar Restaurant Group. All Rights Reserved. Website Design & Development by Coastal Azul Digital Marketing"
    }
  ]
}