{
  "fuentes": [
    {
      "url": "https://traveloncapri.com.au/ContactUs.html",
      "email": "sales@tsoncapri.com.au"
    },
    {
      "url": "https://caprichristianchurch.wordpress.com/contact-us/",
      "email": "kuglerk5@yahoo.com"
    },
    {
      "url": "https://caprichristianchurch.wordpress.com/contact-us/",
      "email": "office@caprichurch.com"
    },
    {
      "url": "https://caprichristianchurch.wordpress.com/contact-us/",
      "email": "office@caprichurch.comsend"
    },
    {
      "url": "https://caprichristianchurch.wordpress.com/contact-us/",
      "email": "steven@caprichurch.com"
    }
  ],
  "mails": [
    "kuglerk5@yahoo.com",
    "office@caprichurch.com",
    "office@caprichurch.comsend",
    "sales@tsoncapri.com.au",
    "steven@caprichurch.com"
  ],
  "nombre_sitio": "isleofcaprilakeland.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://traveloncapri.com.au/ContactUs.html",
      "text": "Contact Us Email Us 07 5592 3349 Home Meet the team Holiday Offers Explore Our Partners Travel Extras 07 5592 3349 Email Us Contact Us Feel free to drop-by the store or contact us through phone or email Enquire now Address: Capri on Via Roma,\n                                            Suite 4 Level 1 , 15-21 Via Roma,\n                                        ISLE OF CAPRI,\n                                            QLD,\n                                        4217 Directions Email: sales@tsoncapri.com.au Phone: 07 5592 3349 Working hours: Open now Monday 9:00 AM - 5:00 PM Tuesday 9:00 AM - 5:00 PM Wednesday 9:00 AM - 5:00 PM Thursday 9:00 AM - 5:00 PM Friday 9:00 AM - 5:00 PM Saturday Closed Sunday Closed Address: Capri on Via Roma,\n                                            Suite 4 Level 1 , 15-21 Via Roma,\n                                        ISLE OF CAPRI,\n                                            QLD,\n                                        4217 Directions Email: sales@tsoncapri.com.au Phone: 07 5592 3349 Working hours: Open now Monday 9:00 AM - 5:00 PM Tuesday 9:00 AM - 5:00 PM Wednesday 9:00 AM - 5:00 PM Thursday 9:00 AM - 5:00 PM Friday 9:00 AM - 5:00 PM Saturday Closed Sunday Closed Never miss a limited time offer Sign up to our newsletter to stay updated with personalised deals on flights, hotels, packages and more! State NSW VIC QLD SA WA NT TAS ACT Subscribe By signing up, you agree to the Helloworld Travel online Privacy Notice and Privacy Policy - in which you choose to unsubscribe at any time. Explore Deals Flights Hotels Tours Cars Cruises Travel Brochures Quick links Our Partners Contact Us Travel Extras Amex Program Travel Insurance Awarded Winner, Best Australian Travel Agency Group 2016 and 2017. Chairman's Circle Honors Honoree 2023 Member of Payment methods accepted © 2025 Helloworld Travel Services (Australia) Pty Limited, trading as Fortress Finance Pty. Ltd. (56 011 012 221) Enquire about the deal Cancel Travel on Capri Back Adults 1 Adult 1 Adult 2 Adult 3 Adult 4 Adult 5 Adult 6 Adult 7 Adult 8 Adult 9 Adult 10 Adult Children 0 children 0 children 1 children 2 children 3 children 4 children 5 children First Name * Last name * fullName-enquire-HP Phone * Email * Message I would like to receive the latest exclusive deals, pre-sale alerts and travel inspiration from Helloworld Travel Online Please check at least one of the checkboxes By ticking this box, you confirm that you have read and agree to the Helloworld Travel Online Terms of Use , Privacy Notice , and Privacy Policy Please check at least one of the checkboxes Request a call Cancel Travel on Capri First name * Last name * Phone * Email * Date * Time * Select time Message By ticking this box, you confirm that you have read and agree to the Helloworld Travel Online Terms of Use , Privacy Notice , and Privacy Policy Please check at least one of the checkboxes Enquire with agent Cancel Travel on Capri First Name * Last name * fullName-enquire-HP Phone * Email * Postcode * Message I would like to receive the latest exclusive deals, pre-sale alerts and travel inspiration from Helloworld Travel Online Please check at least one of the checkboxes By ticking this box, you confirm that you have read and agree to the Helloworld Travel Online Terms of Use , Privacy Notice , and Privacy Policy Please check at least one of the checkboxes Book flight Cancel Travel on Capri Enter flight dates to book your flight Back Departure Date * Returning date * Adults 1 Adult 1 Adult 2 Adult 3 Adult 4 Adult 5 Adult 6 Adult 7 Adult 8 Adult 9 Adult 10 Adult Children 0 children 0 children 1 children 2 children 3 children 4 children 5 children"
    },
    {
      "url": "https://caprichristianchurch.wordpress.com/contact-us/",
      "text": "Contact Us | Capri Church Capri Church Friends and Families Growing Together Menu Skip to content Home Watch Sermon… Newsletters Activities Children’s Ministry (Nursery-5th Grade) Student Ministry (6th-12th Grade) Women’s Connections… Small Groups Music Missions Prayer Chain… Scholarship Fund We Believe… Online Store Staff / Leadership Contact Us Privacy Policy Online Giving Search Search for: Contact Us Contact Information Telephone 239-642-6233 FAX 239-642-1388 Address 111 East Hilo Street, Isles of Capri, Naples, FL 34113 Electronic Mail Pastor, Curt Ayers: office@caprichurch.com Music Minister, Steven Dawes: steven@caprichurch.com General Information & Webmaster: office@caprichurch.com Send mail to office@caprichurch.com with questions or comments about this web site. How to Find Us We are located at the beautiful Isles of Capri in Naples, FL. Our address is: 111 East Hilo Street Naples, FL 34113-8662 Directions: Start on COLLIER BLVD/ CR-951 S Turn RIGHT onto CAPRI BLVD/ CR-952 If coming from Naples, if coming from Marco Island, turn LEFT Keep on CAPRI BLVD (0.67 miles) Turn LEFT onto HILO DR Share this: Tweet Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Like Loading... Leave a comment Cancel reply Δ Follow Capri Church on WordPress.com Prayer Chain If you have a prayer request or know of someone who wants to submit a prayer request please have them send it directly to kuglerk5@yahoo.com Capri Instagram No Instagram images were found. Social View Capri Chistian Church’s profile on Facebook View CapriChurch’s profile on Twitter View caprichurch’s profile on Instagram Service Times & Info 111 E Hilo St Naples Fl 34113 239.642.6233 CONTEMPORARY SERVICES Saturday at 5pm (January - Easter) Sunday at 9am SUNDAY SCHOOL FOR ALL AGES Sunday at 10:15am BLENDED SERVICE Sunday at 11:15am Blog Stats 72,842 hits Administrators Create account Log in Entries feed Comments feed WordPress.com Blog at WordPress.com. Subscribe Subscribed Capri Church Sign me up Already have a WordPress.com account? Log in now. Capri Church Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    }
  ]
}