{
  "fuentes": [
    {
      "url": "https://www.ithinkfi.org/about/board-of-directors",
      "email": "house@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/about/board-of-directors",
      "email": "ncua@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/about/board-of-directors",
      "email": "serviceplus@ithinkfi.org"
    },
    {
      "url": "https://www.ithinkfiamp.com/visit",
      "email": "ithinkampinquiry@livenation.com"
    },
    {
      "url": "https://www.ithinkfi.org/community/amphitheatre",
      "email": "decoration-big@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/community/amphitheatre",
      "email": "decoration@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/community/amphitheatre",
      "email": "house@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/community/amphitheatre",
      "email": "ncua@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/community/amphitheatre",
      "email": "serviceplus@ithinkfi.org"
    },
    {
      "url": "https://specialevents.livenation.com/venues/ithink-financial-amphitheatre",
      "email": "specialevents@livenation.com"
    },
    {
      "url": "https://specialevents.livenation.com/venues/ithink-financial-amphitheatre",
      "email": "ithinkampevents@livenation.com"
    },
    {
      "url": "https://specialevents.livenation.com/venues/ithink-financial-amphitheatre",
      "email": "specialevents@livenation.com"
    },
    {
      "url": "https://www.infrafida.com/contact-us",
      "email": "hi@infrafida.com"
    },
    {
      "url": "https://www.infrafida.com/contact-us",
      "email": "info@infrafida.com"
    },
    {
      "url": "https://am.ticketmaster.com/lnsfl2/",
      "email": "premiumtickets@livenation.com"
    },
    {
      "url": "https://ithinkfinance.com/about-us/",
      "email": "info@ithinkfinance.com"
    },
    {
      "url": "https://www.ithinkfiamp.com/shows",
      "email": "ithinkampinquiry@livenation.com"
    },
    {
      "url": "https://www.ithinkfiamp.com/accessibility",
      "email": "ithinkampinquiry@livenation.com"
    },
    {
      "url": "https://www.ithinkfiamp.com/accessibility",
      "email": "ithinkampinquiry@livenation.com"
    },
    {
      "url": "https://www.ithinkfiamp.com/accessibility",
      "email": "u003eithinkampinquiry@livenation.com"
    },
    {
      "url": "https://www.ithinkfiamp.com/season-tickets",
      "email": "ithinkampinquiry@livenation.com"
    },
    {
      "url": "https://am.ticketmaster.com/lnsfl2/terms",
      "email": "premiumtickets@livenation.com"
    },
    {
      "url": "https://am.ticketmaster.com/lnsfl2/terms",
      "email": "ticketexchange@ticketmaster.com"
    },
    {
      "url": "https://www.ticketmaster.com/ithink-financial-amphitheatre-tickets-west-palm-beach/venue/106578",
      "email": "claimsinquiry@allianzassistance.com"
    },
    {
      "url": "https://www.ticketmaster.com/ithink-financial-amphitheatre-tickets-west-palm-beach/venue/106578",
      "email": "ithinkampinquiry@livenation.com"
    },
    {
      "url": "https://www.ithinkfi.org/about",
      "email": "decoration-big@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/about",
      "email": "house@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/about",
      "email": "ncua@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/about",
      "email": "serviceplus@ithinkfi.org"
    },
    {
      "url": "https://www.ithinkfiamp.com/private-events",
      "email": "ithinkampevents@livenation.com"
    },
    {
      "url": "https://www.ithinkfiamp.com/private-events",
      "email": "ithinkampinquiry@livenation.com"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "decoration-big@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "house@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "loans@ithinkfi.org"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "mortgage@ithinkfi.org"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "mortgageservicing@ithinkfi.org"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "ncua@2x.png"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "serviceplus@ithinkfi.org"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "email": "visa@ithinkfi.org"
    },
    {
      "url": "https://www.ithinkfiamp.com/",
      "email": "ithinkampinquiry@livenation.com"
    }
  ],
  "mails": [
    "claimsinquiry@allianzassistance.com",
    "decoration-big@2x.png",
    "decoration@2x.png",
    "hi@infrafida.com",
    "house@2x.png",
    "info@infrafida.com",
    "info@ithinkfinance.com",
    "ithinkampevents@livenation.com",
    "ithinkampinquiry@livenation.com",
    "loans@ithinkfi.org",
    "mortgage@ithinkfi.org",
    "mortgageservicing@ithinkfi.org",
    "ncua@2x.png",
    "premiumtickets@livenation.com",
    "serviceplus@ithinkfi.org",
    "specialevents@livenation.com",
    "ticketexchange@ticketmaster.com",
    "u003eithinkampinquiry@livenation.com",
    "visa@ithinkfi.org"
  ],
  "nombre_sitio": "ithinkfiamp.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.ithinkfi.org/about/board-of-directors",
      "text": "Board of Directors | Meet Our Board Members | iTHINK Financial 🎉 This September, Get 2x The Points With myRewards Use your myRewards Visa® Signature Credit Card or myRewards Business Visa® Credit Card for everyday retail purchases like gas, groceries, dining, and shopping—and earn 2X the points all month long. 👉 Learn More & Apply Today Skip to content Join Us Contact Us Locations About Personal Banking Checking Savings Rewards Program Digital Banking Payments Member Alerts Loans Vehicle Loans Personal Loans Student Loans Check Loan Status Recreational Vehicle Rates Submit Proof Of Auto Insurance Registration and Title Information Credit Cards Card Control Visa Click to Pay Chip Technology Check Loan Status myRewards Signature Credit Card Visa Credit Card Balance Transfer Contactless Cards Visa Platinum Credit Card Card Management Mortgages First Mortgages Home Equity Lines of Credit Fixed Rate Second Mortgages Reverse Mortgages Contact a Mortgage Advisor Helpful Information Proof of Insurance Meet The Team Services Insurance Wire Transfers Credit Monitoring and Identity Theft Protection Overdraft Options Dental Benefits Max Digital Banking Member Discounts Other Services Free Shred Days Zelle Auto Buying Service Home Finder Early Direct Deposit Education Webinars & Seminars FAQs Student Center Financial Wellness Center Calculators Tax Information Forms Security & Fraud Center My Money Financial Literacy Program Monthly Promotions Business Banking Business Checking Savings Money Market Account Lawyer Trust IOTA/IOLTA Business Digital Banking Business Payments Loans Small Business Administration Loans Commercial Real Estate Loans Lines of Credit Term Loans Business Vehicle Loans Letters of Credit myRewards Business Visa Credit Card Check Loan Status Services Business eDeposits Cash Management Payroll Merchant Solutions SCORE Dental Benefits Max Digital Banking Education Wealth Personal Planning Transition to Retirement Financial Management and Investing Strategic Financial Guidance Risk Management and Insurance Estate Planning Guided Wealth Portfolios Business Planning Contact an Advisor Education Community iTHINK Community Foundation School Ready Days Jingle Bells at the Branches Scholarship Program 5K Building Up Business Spotlight Business Directory iTHINK Financial Amphitheatre Events Testimonials search close login close menu close Search Text Submit Search Login Show Username Remember me Username Password Log In Register Forgot Password? Forgot Username? Mobile Banking Login REGISTER Homepage About Board of Directors Board of Directors Our Board of Directors, Audit Committee, and Advisory Council are made up of Members like you! Read our Annual Reports below as well. ANNUAL REPORTS 2024 Annual Report 2023 Annual Report 2022 Annual Report 2021 Annual Report 2020 Annual Report 2019 Annual Report 2018 Annual Report 2017 Annual Report 2016 Annual Report Board of Directors Title Name Chairman Michael W. Townsend, CCD Vice Chairperson Brad J. DeBauche Secretary Stephanie M. Forster Treasurer Johnny Bennett, CCD Directors: Peter L. Blacklock Thomas E. Brawley Juana T. Krause Marie I. Mascaro Shawn M. Limerick Audit Committee Title Name Chairperson Hilary Hunter Donald L. Lee, CCD Frank Mays Randee Abramson Shawn M. Limerick CEO Monthly Message Learn more Contact the CEO Learn more SHARE Routing (ABA) Number: 267077627 800.873.5100 serviceplus@ithinkfi.org Contact Us Blog Stay Connected Equal Housing Lender Federally Insured By NCUA ©2025 iTHINK Financial Credit Union Privacy & Security Accessibility Disclosures Are You Sure You Want To Leave Our Site? iTHINK Financial does not provide, and is not responsible for, the product, service, overall website content, security, or privacy policies on any external third-party sites. These sites may not be conformant with current ADA requirements. If you continue, an external website that is owned and operated by a third-party will be opened in a new browser window. YES, CONTINUE NO, STAY HERE"
    },
    {
      "url": "https://www.ithinkfiamp.com/visit",
      "text": "Visiting iTHINK Financial Amphitheatre: Parking, Amenities, Frequently Asked Questions Skip to content Shows Upgrades Visit Get Here Purchase Your Parking Bites and Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Where The Music's At Get Here iTHINK Financial Amphitheatre is located at 601-7 Sansburys Way, West Palm Beach, FL 33411. Directions Purchase Your Parking If you plan to park at the iTHINK Financial Amphitheatre, you will need to purchase one parking pass per vehicle. Parking options start at $20 per vehicle for general parking and may be purchased online in advance. Pick Your Parking Bites and Drinks Skip the preshow rush and dine with us! This season we’ve added even more food and drink options with every fan in mind. Learn More Accessibility Whatever your needs, let us know how we can help. Whether that's with your arrival, exploring the venue, the show itself - or all of the above. We are here to help and accommodate at iTHINK Financial Amphitheatre. Learn More The Need-To-Know Before You Go From bag policy to parking, get to grips with everything you need to know here at iTHINK Financial Amphitheatre for your show. Learn More Venue Map Get lost in the music. Not the venue. So, here’s a map to help you get around. Download FAQ How do I enter iTHINK Financial Amphitheatre? There are a total of two entrance to the facility. North and South Gates are available for use regardless of the ticket type. The Fast Lane gate is located on the north side adjacent to the box office. You must have your Fast Lane pass to utilize this gate. The VIP Club has a separate entry gate located next to the box office. All guests using this gate must be VIP clients and have the appropriate ticket. What items do you allow in iTHINK Financial Amphitheatre? We allow: Clear plastic, vinyl or PVC tote bags no larger than 12” x 6” x 12” and/or small clutch bags (6”x 9”). Blankets Cameras – nonprofessional only, no detachable lenses Food – in a clear, 1-gallon ziplock bag Water – up to 1 gallon in a factory sealed or empty bottle Umbrellas – Small/personal only. (No large golf umbrellas) What items do you NOT allowed in iTHINK Financial Amphitheatre? Drones, outside lawn chairs and the following are not permitted into the venue: What happens in the event of an emergency? In the event of an emergency while on-site - iTHINK Financial Amphitheatre has trained paramedics to assist with any medical issues. First aid is located at the South entry gate, but any staff member with a radio can dispatch First Aid to the location needed. Local law enforcement officers are also on site for every event and can assist if needed or requested. Venue management works closely with all appropriate emergency agencies and services to ensure that we are up to date on any dangerous weather or potential crowd related issues. In the event of a weather emergency - we will communicate with guests that are inside of the facility as well as guests on their way to the venue. Please follow us on social media for the latest developments on event days: Facebook: https://www.facebook.com/iTHINKFiAmp/ Twitter: https://twitter.com/ithinkfiamp Instagram: https://www.instagram.com/ithinkfiamp/ When do the parking lots and gates open? Parking lots will generally open two hours prior to our scheduled gate time. Gate times vary, but are usually one hour prior to show time. Please check the specific event page as these dates are subject to change. Please do not attempt to enter the venue any earlier than the designated times as you will be turned around and told to return when the parking lots open. Can I rent a lawn chair? Lawn chairs are available for rent for most shows and must be turned in at the end of the event. Our rental chairs are 27.6” wide X 27.6” deep X 30.5” tall. No other chairs are permitted inside the venue. To rent a lawn chair in advance, click on the \"UPGRADES AVAILABLE\" dropdown on our upgrade page and select \"Lawn Chair Rental\". Lawn chairs are available for rent in advance or when you arrive at the lawn. Prices vary per show. Subject to availability. Is smoking permitted? Smoking is not permitted in the amphitheatre (e-cigarettes and vaping included). Guests may smoke on the lawn or in the plazas. If another guest complains about the smoke, we may ask you to refrain from smoking or move to another location. We appreciate your cooperation. Who should I go to if I need assistance? If you need assistance while at an event please visit our guest services area located in the north plaza or text us at 561-536-3822 with your seat location. Do you have a lost and found? If you lose an item while you are at an event- you can visit our Guest Services booth located in the North Plaza to see if it has been turned in. If the item is not found the night of the show, please call us at 561-795-8883 or email us at iThinkAmpInquiry@LiveNation.com. Do you offer accommodations for those who may need hearing assistance? Guests that require assisted listening devices can contact our venue office prior to the event to arrange for a device. Please give us at least 2 days notice. We can be reached by phone at 561-795-8883 or by email at iThinkAmpInquiry@LiveNation.com. Do you offer overnight RV camping and parking at iTHINK Financial Amphitheatre? We offer overnight RV Camping/Parking here . This includes 50 AMP electric, water, and sewage. Check-in is at 3:00 PM on show day and check-out is 12:00 PM the following day. Do you have food & beverage available? The venue has a variety of delicious food and beverage options available for purchase .  Please note that items and pricing are subject to change from event to event. Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch iTHINK Financial Amphitheatre 601-7 Sansburys Way West Palm Beach, FL 33411 ithinkampinquiry@livenation.com 561.795.8883 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.ithinkfi.org/community/amphitheatre",
      "text": "iTHINK Financial Amphitheatre | South Florida Fairgrounds| iTHINK Financial 🎉 This September, Get 2x The Points With myRewards Use your myRewards Visa® Signature Credit Card or myRewards Business Visa® Credit Card for everyday retail purchases like gas, groceries, dining, and shopping—and earn 2X the points all month long. 👉 Learn More & Apply Today Skip to content Join Us Contact Us Locations About Personal Banking Checking Savings Rewards Program Digital Banking Payments Member Alerts Loans Vehicle Loans Personal Loans Student Loans Check Loan Status Recreational Vehicle Rates Submit Proof Of Auto Insurance Registration and Title Information Credit Cards Card Control Visa Click to Pay Chip Technology Check Loan Status myRewards Signature Credit Card Visa Credit Card Balance Transfer Contactless Cards Visa Platinum Credit Card Card Management Mortgages First Mortgages Home Equity Lines of Credit Fixed Rate Second Mortgages Reverse Mortgages Contact a Mortgage Advisor Helpful Information Proof of Insurance Meet The Team Services Insurance Wire Transfers Credit Monitoring and Identity Theft Protection Overdraft Options Dental Benefits Max Digital Banking Member Discounts Other Services Free Shred Days Zelle Auto Buying Service Home Finder Early Direct Deposit Education Webinars & Seminars FAQs Student Center Financial Wellness Center Calculators Tax Information Forms Security & Fraud Center My Money Financial Literacy Program Monthly Promotions Business Banking Business Checking Savings Money Market Account Lawyer Trust IOTA/IOLTA Business Digital Banking Business Payments Loans Small Business Administration Loans Commercial Real Estate Loans Lines of Credit Term Loans Business Vehicle Loans Letters of Credit myRewards Business Visa Credit Card Check Loan Status Services Business eDeposits Cash Management Payroll Merchant Solutions SCORE Dental Benefits Max Digital Banking Education Wealth Personal Planning Transition to Retirement Financial Management and Investing Strategic Financial Guidance Risk Management and Insurance Estate Planning Guided Wealth Portfolios Business Planning Contact an Advisor Education Community iTHINK Community Foundation School Ready Days Jingle Bells at the Branches Scholarship Program 5K Building Up Business Spotlight Business Directory iTHINK Financial Amphitheatre Events Testimonials search close login close menu close Search Text Submit Search Login Show Username Remember me Username Password Log In Register Forgot Password? Forgot Username? Mobile Banking Login REGISTER Homepage Community iTHINK Financial Amphitheatre iTHINK Financial Amphitheatre Grooving You Forward SHARE Purchase Tickets Join Us Only $5 is needed to open a savings account and begin your lifetime Membership with iTHINK Financial. Join Today! iTHINK Financial Amphitheatre at the South Florida Fairgrounds 601-7 Sansburys Way West Palm Beach, FL 33411 Get Directions Members of iTHINK Financial are eligible for pre-sale tickets. Enter the offer passcode \"MEMBER\" to unlock access to purchase tickets before the general public. View the list below for qualifying concerts. Upcoming Events Purchase Tickets About iTHINK Financial Did you know that iTHINK Financial is one of the nation's largest credit unions? We move our members' money with products like our low interest rate auto loans and mortgages , and the best checking accounts around. Join us today--you'll be surprised by the money you'll save! Become a Member Upcoming Events Go to Event Calendar Go to Event Calendar Routing (ABA) Number: 267077627 800.873.5100 serviceplus@ithinkfi.org Contact Us Blog Stay Connected Equal Housing Lender Federally Insured By NCUA ©2025 iTHINK Financial Credit Union Privacy & Security Accessibility Disclosures Are You Sure You Want To Leave Our Site? iTHINK Financial does not provide, and is not responsible for, the product, service, overall website content, security, or privacy policies on any external third-party sites. These sites may not be conformant with current ADA requirements. If you continue, an external website that is owned and operated by a third-party will be opened in a new browser window. YES, CONTINUE NO, STAY HERE"
    },
    {
      "url": "https://specialevents.livenation.com/venues/ithink-financial-amphitheatre",
      "text": "iTHINK Financial Amphitheatre — Venues in West Palm Beach FL | Live Nation Special Events Javascript must be enabled for the correct page display Skip to Content menu home venues events services about press blog Privacy Policy Terms & Conditions search search opener Submit LiveNation special events p l a n y o u r e v e n t p l a n y o u r e v e n t Work (310) 360-3077 Fax (310) 360-3077 Contact Us national sales icon mail plan your event background image Menu Details Gallery Spaces Exclusives Services FAQs Contact iTHINK Financial Amphitheatre LEGENDARY VENUES, EPIC EVENTS! Featuring outdoor setting and soaring views, iTHINK Financial Amphitheatre is the perfect location for your next conference, corporate event, fundraiser, private concert or graduation. With access to the world’s greatest musical entertainment, state-of-the-art lighting and sound, custom menus and mixology, our talented staff handles every detail, so you don’t have to. Accommodating up to 18,400 guests, and located 10 miles from Palm Beach County Convention Center, 10 miles from Downtown, and 8 miles Palm Beach International Airport this unique venue will exceed expectations. view venue one sheet Venue Space Overview Amphitheatre Lawn VIP Club Venue Space Overview Venue Space Overview Featuring flexible event space and accommodating up to 18,400 guests, iTHINK Financial Amphitheatre features an open-air amphitheater and lawn, as well as an intimate VIP Club, making this venue the perfect atmosphere that celebrates extraordinary hospitality and service. View Venue Capacities Amphitheatre Amphitheatre The flexible Amphitheatre is ideal for event of every description that features state-of-the-art lighting and sound system and large bars that are sure to wow every guest. Take your event center stage on the elaborate stage or utilize the lower seating that repurposes it to open floor plan, perfect for a private dinner, award ceremony or business meeting. View Venue Capacities Lawn Lawn iTHINK Financial Amphitheatre's spacious lawn offers endless possibilities for planning the perfect outdoor event. Accommodating up to 12,000 guests and close-up views of the stage, this versatile space is perfect for events of all occasions including conference, corporate event and company picnics. View Venue Capacities VIP Club VIP Club The exclusive VIP Club creates the ultimate VIP experience for your guests. Perfect for intimate gatherings or private dinners. This intimate space allows clients to use exclusively or include for a full venue buy-out. View Venue Capacities × venue capacities location reception banquet theater Amphitheatre - - 6,400 Lawn 12,000 - - VIP Club 500 - - Full Venue 18,400 - 6,400 event types url corporate events Make your corporate event the talk of the town. Host an exclusive roundtable meeting or company reception in a unique setting that offers custom culinary experiences and mixology with unparalleled event services. Learn More Learn More url Company Picnics Bring your team together at one of our outdoor event venues and spacious amphitheaters. Elevate your company events, company picnics, employee gatherings or daytime meetings to the next level with an outdoor setting. Learn More Learn More url FILMING & PHOTOSHOOTS Make your vision a reality! Plan your next photoshoot with Live Nation Special Events. Our versatile venues and photoshoot locations curate a unique setting. Our venues offer sound and lighting to enhance your next filming location. Learn More Learn More url private concerts Amplify your event experience at our venue with a private concert featuring world-renowned artists, full-service event production and state-of-the-art lighting and sound. Learn More Learn More url FUNDRAISERS & GALAS Live Nation Special Events is ready to amplify your next fundraiser, gala, charity concert or non-profit event at our private event venues. Our experienced event team can assist with producing large-scale fundraisers allowing you to focus on your cause. Learn More Learn More url Social Gatherings Celebrate your social events in style! Whether you are gathering guests for a stylish dinner or hosting a celebratory function – our talented staff is here to handle every detail from custom menus, hand-crafted cocktails, décor, themes and entertainment that fits any occasion. Learn More Learn More url Convention Receptions Whether you're planning a welcome party, closing reception, VIP luncheon or conference after-party, our reception halls, conference spaces, and our full-service event production will elevate your guests’ experience. Learn More Learn More url Holiday Parties Rock out during the holidays with Live Nation Special Events! From lively company parties to festive private gatherings and themed events, let us create holiday memories that last a lifetime. Host the most iconic party of the season at the best locations and event venues. Learn More Learn More url UNIQUE WEDDINGS Celebrate your love story with us! Our one-of-a-kind event spaces offer a memorable backdrop from custom floral centerpieces and gorgeous accents to the post-wedding champagne brunch with decadent sweets. Let our wedding specialists make your special occasion one to remember. Learn More Learn More world-renowned artist packages From headlining artists to local talent and keynote speakers, Live Nation Special Events provides unlimited access to entertainment and our in-house team can assist you with producing large-scale events, including booking local bands, DJs headlining artists, or keynote speakers. learn more amenities Food & Beverage Custom Menus & Offerings Craft Beer Bars & Mixology Traditional & Unique Presentations Exclusive Culinary Partners Entertainment & Production Personalized Event Planning Full-Service Event Production Unlimited Entertainment Access State-of-the-Art Lighting & Sound Event Enhancements Experiential Branding Video Mapping Interactive Entertainment Creative & Customized Décor exclusive offers url making corporate cool Get down to business at one of our legendary venues! Host your next meeting or event with us and receive a complimentary coffee station. Learn More Learn More url make your vision a reality Take your event to the next level! Host your event and receive up to $500 in credit for event enhancements. Learn More Learn More url rock your wedding Celebrate your love story with us! Book your ceremony or reception with us and receive a complimentary confetti cannon blast. Learn More Learn More join our newsletter I'd like to receive special events updates from iTHINK Financial Amphitheatre. Plus, get highlights and exclusive offers from Live Nation Special Events. sign up FAQs What event spaces are available to rent for meetings or private events? iTHINK Financial Amphitheatre offers a variety of event spaces that can accommodate different capacities for your next meeting or private event. This allows you to choose the space that best fits your event's size and needs from Amphitheatre, Lawn, and VIP Club. What event services can I expect, including catering and vendor partnerships? We offer exceptional full-service event planning services with an experienced in-house team and established partnerships with premier vendors. Our event planning team will handle every detail including world-renowned artists packages, décor, custom branding, state-of-the-art lighting, A/V equipment and sound. Let our culinary experts create an unparalleled dining experience with custom catering menus and bar packages. Contact us today to learn more about our services and how we can make your event a one-of-a-kind experience. Can the venue team book entertainment, bands, DJs, and keynote speakers for my event? Yes, iTHINK Financial Amphitheatre's in-house venue team has relationships with a variety of artists and DJs that they can recommend for your unique event. Live Nation is the largest entertainment company in the world, which gives us access to an extensive network of world-renowned artists and keynote speakers. What parking options are provided by the venue? iTHINK Financial Amphitheatre's event team can provide parking and valet options for your meeting or private event when applicable. We recommend contacting us directly for more information on parking and availability. Our team is happy to assist you with any questions regarding parking arrangements. Is this venue accessible to those with disability needs? iTHINK Financial Amphitheatre prioritizes accessibility and strives to make our venue accessible to everyone. If you have specific accessibility needs, inform our event specialists in advance with your requirements and the date assistance will be needed. On the day of the event, our staff will be ready to support you. Contact us today to learn more about our accessibility options and how we can ensure your experience is inclusive and enjoyable. What is the event scheduling process, and how early should I start planning? Don't miss out on securing your preferred dates, contact us today to start planning! Whether you need to plan a corporate event, daytime meeting, filming, photoshoot, fundraiser, and private concert, our event specialists are here to assist you. While we can accommodate quick turnarounds, it's always best to book as soon as possible to ensure your desired date is available. Our team will help schedule a site tour and provide a comprehensive overview of our venue's floor plans, amenities, event venue specs, and address any inquiries you may have. As the leading provider of live entertainment, we are committed to efficiently working with you to create a successful event. Contact iTHINK Financial Amphitheatre 601-7 Sansburys Way, West Palm Beach, FL 33411 ithinkfiamp.com work 305.938.2517 @iTHINKFiAmp @ithinkfiamp @ithinkfiamp Explore Nearby Venues special event inquiries National Sales LiveNation special events SpecialEvents@livenation.com work 310.360.3077 facebook instagram linkedin copyright © 2025 live nation all rights reserved read our privacy policy or terms & conditions Do Not Sell or Share My Personal Information venues by close prev step personal details event details next step let's gather some info. Please fill out the form below to get started. First Name Last Name Your email Your number Get special events updates, highlights and exclusive offers from Live Nation Special Events. Please fill out the required fields. continue By signing up and continuing past this page, you agree to our Terms of Use and Privacy Policy and a bit more information. We will be in touch shortly. First Name Last Name Your number Your email Event Type Corporate Events Social Gatherings Wedding Convention Event Fundraiser School Events Military/Government Religious Tour & Travel Other How did you hear about us? Word of Mouth Special Events Sales Team Google/Search Engine Social Media Email Third-Party Website Advertisement Print Ad Direct Mail Attended an Event Other + Please fill out the required fields. Please complete the Captcha to proceed. submit or go back Select venue(s) from below Select a State Select a State Multi-Venue Arizona California Colorado Connecticut D.C. Delaware Florida Georgia Illinois Indiana Kentucky Louisiana Massachusetts Maryland Michigan Minnesota North Carolina Nevada New York Ohio Pennsylvania South Carolina Texas Wisconsin Utah Vancouver, BC venues input Please select at least one venue to proceed. submit or go back Thank you. Not to brag but... press & clients Back to top close By signing up and continuing past this page, you agree to our Terms of Use and Privacy Policy"
    },
    {
      "url": "https://www.infrafida.com/contact-us",
      "text": "Contact Us | InfraFIDA top of page Home About Us About FiDA Use Cases Our Services Contact Us Blog More Use tab to navigate through the menu items. Contact us Let's connect! We are here to support your journey into the open finance landscape. Whether you are a Data Holder looking to integrate with our infrastructure, a Data User aiming to leverage financial data for innovation, or simply want to learn more about our services, we would be delighted to hear from you. About Us How to Reach Us For inquiries, please use the contact form on the bottom of each web page. Feel free to reach us through direct channels as well: ​ Email: info@infrafida.com Phone: +370 633 71654 What We Offer Stay Informed Subscribe to our newsletter to stay updated with the latest developments in financial data access, upcoming regulations, and the innovative opportunities that open finance brings to the industry. By subscribing, you'll gain valuable insights into how our platform can benefit your business and help you stay ahead of the competition. Subscribe... Contact Us Don't like the form? Just write as an email... info@infrafida.com ​ First name * Last name * Email * Organization * Type your message here... Submit Ofida, UAB Registry code: 307094037 Lithuania ​ ​ Privacy Policy ​ Subscribe bottom of page"
    },
    {
      "url": "https://am.ticketmaster.com/lnsfl2/",
      "text": "iTHINK Financial Amphitheatre | iTHINK Financial Amphitheatre Skip to main content Toggle navigation menu close Contact Us Page Parking Directions Contact Us Page Parking Directions Ticketmaster Privacy Policy Terms of Use Cookie Policy © 1999-2025 Ticketmaster. All rights reserved. Content Box Welcome, iTHINK Financial Amphitheatre Fans! Log in to view and manage your tickets, pay invoices, and more. Quick Links Pay Invoices View and pay for your premium seats. Manage Tickets Access and manage tickets for upcoming shows. Contact Us Get in touch with our sales team. Ticketmaster Privacy Policy // // Terms of Use // Cookie Policy © 1999-2025 Ticketmaster. All rights reserved."
    },
    {
      "url": "https://ithinkfinance.com/about-us/",
      "text": "About Us | iThink Finance Home About Us How It Works Blog Contact Us Important Information Responsible Lending Complaints Procedure Charges & Payments Collections Policy GDPR & Data Protection Continuous Payment Authority Advertisement Policy FAQs Home About Us How It Works Blog Contact Us Important Information Responsible Lending Complaints Procedure Charges & Payments Collections Policy GDPR & Data Protection Continuous Payment Authority Advertisement Policy FAQs Apply now Warning: Late repayment can cause you serious money problems. For help, go to moneyadviceservice.org.uk About Us Here at **iThink Finance**, we are proud of our *treat others how you would like to be treated* philosophy. With this being the groundwork of our company, we vow to help you make informed choices and to support your decision towards the realisation of your financial ambitions. Our wealth of experience in the finance industry gives us the opportunity to put our customers first by educating and prompting you to make sophisticated choices that ultimately benefit your financial end goals. We are dedicated to investing in all things that matter to us. This is why we take care in our partnerships, so that we can invest in you. Regulated by the FCA , we are recognised as a reputable credit broker. As a trusted source in online lending, we work with a network of lenders so that we can provide the most suitable products for UK residents. We pride ourselves on our in-depth market knowledge and take it upon ourselves to secure the most exclusive, low-interest deals. Mission Statement iThink Finance was fostered on the belief that everybody should have access to the tools required to bring their financial aspirations to life. Situated in the heart of London, we are here to set up the framework that will support those very ambitions and goals. Whether you are looking to start a new home project, cover large private medical expenses, or organise the wedding of your dreams, iThink Finance wants to be a part of that journey with you. ### Core Values Respect Respect of customers and our employees is fundamental to iThink Finance . Being respectful to individuals of all backgrounds and experiences will remain the foundation of our company. Trust Trust is having confidence in the honesty, reliability, and objectivity of a person or company. These values will continue to be a staple in everything we do, and we aim to inspire our customers to do the same. Objectivity To recognise the requirements of others is an approach we take in all affairs. Subsequently, regardless of the circumstances, we remain objective with our customers, employees, and professional partners. Transparency We oversee all business undertakings with total transparency. We want our customers to have clear guidance from the minute they land on the page and feel that they received exceptional customer experience right up until they leave. To safeguard this, we practise people before profit. We do not refrain from addressing that we receive a small commission from your application. But, this is not at the heart of what we do. Instead, we put the customers’ needs above ours. In providing various different products, prioritising customer experience, and giving you access to our expert guides, we want to give you exactly what you need. ### What Makes Us Different? We know what it is like to have a vision. This is why we want to expand the pool of opportunity and offer support to those who want to realise their financial aspirations. Appropriately, we take pride in being extremely flexible and innovative. We work tirelessly 24/7 to find unique ways to support all financial pursuits and projects. Why Choose Us? We are passionate about ensuring customer satisfaction. This is why we work hard to keep our information up to date and take all feedback into consideration. We go the extra mile: We remain completely objective and ensure that you know the ins and outs of you loan, as well as the risks and benefits. Our application process is secure and confidential. We use 256-bit encryption protection, so all of your details are safe with us. This means that you do not have to worry about your details being passed onto third parties without your permission beforehand. Registration Details iThink Finance is registered under the trading name of Dojono Ltd, an appointed representative of QV Holdco Ltd , who are authorised and regulated by the FCA. We are also on the Financial Services Register under the reference number: YYYYYY. We are licensed by the Information Commissioner’s Office under the registration number: ZA271057. Registered office: 4th Floor, Office Block, 47 Dean Street, Soho, London, W1D 5BE, UK. Find Out How Much You Could Borrow Today Get A Free, No Obligation Quote And The Money Could Be In Your Bank in 15 Minutes Apply Now! iThink Finance Are you looking for a personal loan? We have all the information and resources to help you find the best unsecured personal loans with low monthly repayments, to suit both your wants and needs. We’re a fully regulated and authorised credit broker and not a lender. Contact Info Suite 2, The Harley Building, 77 New Cavendish St London, W1W 6XB 020 3137 5704 [email protected] ©iThink Finance is a registered Trading name of Quiddi Hub Limited which is an Appointed Representative of QV Holdco Ltd, and is entered on the Financial Services Register under reference number: WWWWWWW. QV Holdco Ltd is authorised and regulated by the Financial Conduct Authority, and is entered on the Financial Services Register under reference number: YYYYYY. Quiddi Hub Limited is registered in England and Wales (Company number: ZZZZZZZZ), Registered Office; QQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQQ. Licensed by the Information Commissioner’s Office (registration number: XXXXXXXX) © 2021 - iThink Finance - All rights reserved Privacy Policy Terms and Conditions Cookie Policy Sitemap Important Information Home Blog FAQs Glossary This website or its third party tools use cookies, which are necessary to its functioning and required to achieve the purposes illustrated in the cookie policy .  By tapping on \"I accept\" you agree to the use of cookies. I accept"
    },
    {
      "url": "https://www.ithinkfiamp.com/shows",
      "text": "iTHINK Financial Amphitheatre Upcoming Shows: 2025 Event Calendar Skip to content Shows Upgrades Visit Get Here Purchase Your Parking Bites and Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Shows Filter List Calendar Loading... Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch iTHINK Financial Amphitheatre 601-7 Sansburys Way West Palm Beach, FL 33411 ithinkampinquiry@livenation.com 561.795.8883 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.ithinkfiamp.com/accessibility",
      "text": "iTHINK Financial Amphitheatre Accessibility Services Skip to content Shows Upgrades Visit Get Here Purchase Your Parking Bites and Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Accessibility Accessibility Services iTHINK Financial Amphitheatre strives to ensure that all of our guests have a great time at our venue. If you need additional assistance while you are here, please make sure you let us know. Ticketing: Accessible tickets can be purchased online via ithinkfiamp.com . You do not need to call the box office to place an order as all of our accessible tickets are available through our website. Look for the logo on the Find Tickets page to view all available accessible seats. We do have accessible seating in every price range but be advised it does occasionally sell out. We have very limited seating available for guests on the day of the event so please make sure you purchase accessible seating when you order tickets. Restrooms: All venue restrooms are accessible. Day of Show Parking: Accessible Parking - To park in an accessible parking space, you will need a valid, state-issued accessible placard or license plate and a venue parking pass. Parking passes can be purchased online via Ticketmaster in advance or on the day of the show with a credit card when you arrive at the parking lots.  Accessible spaces are limited and first come, first served. Our parking crew will work to accommodate you if all accessible spaces are full. Dropping off fans near the gates prior to parking is also allowed. Please note: Parking is sold separately from concert tickets.  You will need to purchase a parking pass if you plan to park at the venue. Unexpected Needs: If you have had an injury or illness that prevents you from using the original seat you purchased, we strongly recommend going through www.livenation.com to exchange all tickets for accessible seating. We will have a very limited number of seats available on the day of the show for such issues, but we cannot guarantee we will be able to seat you. Please remember that accessible seating permits for the guest with the accessible need and one companion. Interpreter Requests: If you will need an interpreter for an event, please give us at least 2 weeks notice to secure. Guests who request an interpreter will need to pick up their tickets at will call. When the tickets are picked up we will introduce you to your interpreter for the evening and take you to your seats. Please contact iThinkAmpInquiry@LiveNation.com to arrange for an interpreter for your visit. Hearing Assistance: Guests who require assisted listening devices can contact our venue office prior to the event to arrange for a device. Please give us at least 2 days' notice. We can be reached at iThinkAmpInquiry@LiveNation.com . Service Animals: At iTHINK Financial Amphitheatre, we have specific guidelines to ensure all guests, and their service animals are supported throughout their visit. Service animals are defined by the ADA (Americans with Disabilities Act) as dogs or miniature horses that are trained to do work to perform tasks related to people with disabilities. The work or task the service animal is trained to do must directly relate to the person's disability. Service animals must be housebroken. Service animals are required to behave and not repeatedly bark, growl, jump up on or lunge at other guests or employees. Corrective action must be taken if the service animal is not behaving appropriately. Dogs whose sole function is to provide comfort or emotional support do not qualify as service animals under the Americans with Disabilities Act (ADA). Comfort animals, emotional support animals, and therapy dogs are not listed as service animals under Title III of the ADA.  This also applies to the other species of animals wild or domestic, trained, or untrained.  The ADA requires the service animal to be under the control of the handler. This may include using a harness, leash, or other tether. Our venue employees are not required to provide for, the care, or supervision of a service animal, including cleaning up after it. Service Animals must remain on the floor and are not allowed on dining chairs or tables in our food and beverage locations.  Live Nation and our operating partners have the right to deny access to a dog that disrupts our operations. Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch iTHINK Financial Amphitheatre 601-7 Sansburys Way West Palm Beach, FL 33411 ithinkampinquiry@livenation.com 561.795.8883 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.ithinkfiamp.com/season-tickets",
      "text": "iTHINK Financial Amphitheatre: 2025 Season Ticket Packages Skip to content Shows Upgrades Visit Get Here Purchase Your Parking Bites and Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Your Season. Amplified. Choose your exclusive extras, and enjoy them all season long. Best Seats in the House Private boxes. Wait service. Elevated views. Watch your show in total comfort, and impress your friends, family and clients too! Park Like a VIP Get in and out easily with our VIP parking lot, complete with a private entrance to the venue. Become a Club Regular Elevate every show with our two story VIP Club. Enjoy exclusive food and drink - and lots of it, too. Make an Entrance Breeze past the lines at the gates with your own entrance through the VIP Club. Maybe grab a drink at the bar on the way. Beat the Ticket Rush Get early access to the best tickets for Indy’s most in demand shows. Your Own Concierge One of our team will be on-hand for all food, drink and requests. Spend every moment enjoying the show. Experience the VIP lifestyle at iTHINK Financial Amphitheatre with Season Tickets: amazing seats, premium parking, VIP Club access, and personalized service can all be yours. Whether you’re looking for an unforgettable outing with friends or family, new ways to entertain clients or reward your team at the office, we have a season ticket package that will exceed your expectations and make your concert experience extraordinary. Season Tickets and VIP Ticket Packages at iTHINK Financial Amphitheatre provide a fantastic way to reward clients and employees, as well as a great way to enjoy a show with friends and family. Benefits Include: Premium Concert Seats VIP Parking (closest to the venue) VIP Club Access Private Venue Entrance Private Restrooms Additional Ticket Opportunities To Other Live Nation Concert Events in West Palm Beach Dedicated Customer Service Staff Don’t miss your chance to become a Season Ticket holder! Shape Your Season First name * Last name * Company (optional) Premium Season Seats Premium Partial Season Memberships Group Experiences Other Select your experience * Tell us more Email * Phone number * Submit By submitting, you consent to receive email/phone messages from Premium Representative and/or our AI tool. Terms of Use | Privacy Policy This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch iTHINK Financial Amphitheatre 601-7 Sansburys Way West Palm Beach, FL 33411 ithinkampinquiry@livenation.com 561.795.8883 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://am.ticketmaster.com/lnsfl2/terms",
      "text": "Terms And Conditions | iTHINK Financial Amphitheatre Skip to main content Toggle navigation menu close Contact Us Page Parking Directions Contact Us Page Parking Directions Ticketmaster Privacy Policy Terms of Use Cookie Policy © 1999-2025 Ticketmaster. All rights reserved. Terms of Use Ticketmaster Terms of Use Premium Seat Program Terms & Conditions Last Updated: August 02, 2022 The following are the terms of use (“Terms”) that govern your use of the Account Manager website (the “Site”), which features advanced ticketing transaction technologies and services (collectively referred to as “Advanced Services”). Some of the Advanced Services are provided by iTHINK Financial Amphitheatre, and some of the Advanced Services are provided by Ticketmaster (“us” or “we”). Our Privacy Policy and any other policies, rules or guidelines that may be applicable to particular offers or features on the Site are also incorporated into these Terms. These Terms shall constitute a valid, binding and enforceable legal agreement among you, iTHINK Financial Amphitheatre and us. There shall be no oral or implied agreement between you and us, you and iTHINK Financial Amphitheatre, or you, us and iTHINK Financial Amphitheatre, that shall be binding or enforceable. By visiting or using the Site, you expressly agree to these Terms, as may be updated from time to time. We may make changes to these Terms at any time. Any changes we make will be effective immediately when we post a revised version of these Terms on the Site. The “Last Updated” date above will tell you when these Terms were last revised. By continuing to use this Site after that date, you agree to the changes. COVID-19 WARNING: An inherent risk of exposure to COVID-19 exists in any place where people gather. COVID-19 is an extremely contagious disease that can lead to severe illness and death. You assume all risks, hazards, and dangers arising from or relating in any way to the risk of contracting COVID-19 or any other communicable disease or illness, or a bacteria, virus or other pathogen capable of causing a communicable disease or illness, whether occurring before, during, or after the event, however caused or contracted, and voluntarily waive all claims and potential claims against Ticketmaster, Live Nation, Event Providers, and their affiliated companies relating to such risks. Please note that while some of the events listed on the Site may appeal to children, the Site is not targeted at children under the age of 13, and they are not permitted to use the Site. We strongly encourage all parents and guardians to monitor the Internet use by their children. If you use the Site, you affirm you are at least 13 years old. Purchase Policy Balls, pucks, and other objects may fly into the spectator area during an event. Despite spectator shielding, injury can occur. Stay alert at all times before, during and after play or performance. If struck, immediately ask an usher for directions to a medical station. You voluntarily assume all risks and danger incidental to the event for which the ticket is issued, whether occurring before, during or after the event, and you waive any claims for personal injury or death against us, management, facilities, leagues, artists, other participants, and all of our respective parents, affiliated entities, agents, officers, directors, owners and employees on behalf of yourself and any accompanying minor. You bear all risks of inclement weather. Event date and time are subject to change. See the Limitation of Liability section in the Terms of Use for additional limits on our liability. You assume all risks, hazards, and dangers arising from or relating in any way to the risk of contracting a communicable disease or illness (including exposure to COVID-19, a bacteria, virus, or other pathogen capable of causing a communicable disease or illness), whether occurring before, during, or after the event, however caused or contracted, and hereby waives all claims and potential claims against Ticketmaster, Live Nation, and Event Providers relating to such risks. Account Registration You will be required to register for an account to use the Site. Your account username may not include the name of another person with the intent to impersonate that person, or be offensive, vulgar or obscene. Your account username and password are personal to you. You will be responsible for the confidentiality and use of your username and password, and for all activities (including purchases) that are conducted through your account. You may not transfer or sell access to your account. We will not be liable for any harm related to disclosure of your username or password or the use by anyone else of your username or password. You may not use another user’s account without that user’s permission. You will immediately notify us in writing if you discover any unauthorized use of your account or other account-related security breach. We may require you to change your username and/or password if we believe your account is no longer secure or if we receive a complaint that your username violates someone else’s rights. You will have no ownership in your account or your username. We may refuse registration, cancel an account or deny access to the Site for any reason. Code of Conduct You agree that you will comply with all applicable laws, rules and regulations, and that you will not: Restrict or inhibit any other person from using the Site; Use the Site for any unlawful purpose; Express or imply that any statements you make are endorsed by us, without our prior written consent; Impersonate any person or entity, whether actual or fictitious, including any employee or representative of our company; Submit (a) any content or information that is unlawful, fraudulent, libelous, defamatory, or otherwise objectionable, or infringes our or any third party’s intellectual property or other rights; (b) any non-public information about companies without authorization; or (c) any advertisements, solicitations, chain letters, pyramid schemes, surveys, contests, investment opportunities or other unsolicited commercial communication; Submit, or provide links to, any postings containing material that could be considered harmful, obscene, pornographic, sexually explicit, indecent, lewd, violent, abusive, profane, insulting, threatening, harassing, hateful or otherwise objectionable, includes the image or likeness of individuals under 18 years of age, encourages or otherwise depicts or glamorizes drug use (including alcohol and cigarettes), characterizes violence as acceptable, glamorous or desirable, or contains any personal contact information or other personal information identifying any third party; Submit, or provide links to, any postings containing material that harasses, victimizes, degrades, or intimidates an individual or group of individuals on the basis of religion, race, ethnicity, sexual orientation, gender, age, or disability; Engage in spamming or flooding; Harvest or collect information about Site users; Ownership of Content and Grant of Conditional License The Site and all data, text, designs, pages, print screens, images, artwork, photographs, audio and video clips, and HTML code, source code, or software that reside or are viewable or otherwise discoverable on the Site, and all tickets obtained from the Site, (collectively, the “Content”) are owned by us, iTHINK Financial Amphitheatre or our licensors. We own a copyright and, in many instances, patents and other intellectual property in the Site and Content. We may change the Content and features of the Site at any time. We grant you a limited, conditional, no-cost, non-exclusive, non-transferable, non-sublicensable license to view this Site and its Content as permitted by these Terms only if, as a condition precedent, you agree that you will not: Submit any software or other materials that contain any viruses, worms, Trojan horses, defects, date bombs, time bombs or other items of a destructive nature; Manipulate identifiers, including by forging headers, in order to disguise the origin of any posting that you submit; Link to any portion of the Site other than the URL assigned to the home page of the Site; “Frame” or “mirror” any part of the Site; Modify, adapt, sub-license, translate, sell, reverse engineer, decompile or disassemble any portion of the Site or otherwise attempt to derive any source code or underlying ideas or algorithms of any part of the Content; Remove any copyright, trademark or other proprietary rights notices contained on the Site; Use any robot, spider, offline reader, site search/retrieval application or other manual or automatic device, tool, or process to retrieve, index, data mine or in any way reproduce or circumvent the navigational structure or presentation of the Content or the Site, including with respect to any CAPTCHA displayed on the Site. Operators of public search engines may use spiders to copy materials from the Site for the sole purpose of and solely to the extent necessary for creating publicly available searchable indices of the materials, but not caches or archives of such materials. We may revoke this exception at any time and require removal of archived materials gathered in the past; Use any automated software or computer system to search for, reserve, buy or otherwise obtain tickets or any other items available on the Site, including sending information from your computer to another computer where such software or system is active; Take any action that imposes or may impose (in our sole discretion) an unreasonable or disproportionately large load on our infrastructure; Reproduce, modify, display, publicly perform, distribute or create derivative works of the Site or the Content; Reproduce or scan tickets in a format or medium different from that provided by the Site; Decode, decrypt, modify, or reverse engineer any tickets or underlying algorithms or barcodes used on or in production of tickets or the Site; You may not attempt to conceal your identity by using multiple Internet Protocol addresses or email addresses, or by any other means, to conduct transactions on the Site; Use the Site or the Content in an attempt to, or in conjunction with, any device, program or service designed to circumvent any technological measure that effectively controls access to, or the rights in, the Site and/or Content in any way including, without limitation, by manual or automatic device or process, for any purpose. This license is expressly conditioned on your preexisting agreement to comply with, and your actual compliance with, each of the provisions described in this Ownership of Content and Grant of Conditional License section. This license exists only so long as you strictly comply with each of the provisions described in this section. Any use of the Site or Content by you or anyone acting on your behalf that does not strictly comply with each and every provision in this section exceeds the scope of the license granted to you herein, constitutes unauthorized reproduction, display, or creation of unauthorized derivative versions of the Site and Content, and infringes our copyrights, trademarks, patents and other rights in the Site and Content. You will not acquire any ownership rights by using the Site or the Content. The registered and unregistered trademarks, logos and service marks displayed on the Site are owned by us, iTHINK Financial Amphitheatre or our licensors. You may not use our or iTHINK Financial Amphitheatre trademarks, logos and service marks in any way without our prior written permission. Links The Site contains links to other websites that may not be owned or operated by us. The fact that we may link to those websites does not indicate any approval or endorsement of those websites. We have no control over those websites. We are not responsible for the content of those websites, or the privacy practices of those websites. We strongly encourage you to become familiar with the terms of use and practices of any linked website. Your use of other websites is at your own risk and is subject to the terms of those websites. It is up to you to take precautions to ensure that whatever links you select or software you download (whether from the Site or other sites) is free of viruses, worms, Trojan horses, defects, date bombs, time bombs and other items of a destructive nature. Access from Outside the United States The Site is directed to people residing in the United States. We do not represent that Content available on or through the Site is appropriate or available in other locations. We may limit the availability of the Site or any service or product described on the Site to any person or geographic area at any time. If you choose to access the Site from outside the United States, you do so at your own risk. Purchasing Tickets The Advanced Services offer you the ability to purchase tickets from individuals and businesses that hold tickets purchased from iTHINK Financial Amphitheatre. These individuals and businesses are the sellers of the tickets, not us or iTHINK Financial Amphitheatre. Although we or iTHINK Financial Amphitheatre may process your payment, or may be the name that you see on your credit card statement, neither we nor iTHINK Financial Amphitheatre is the seller of the ticket. When you purchase a ticket from a third party via the Advanced Services, the original ticket will automatically be cancelled and invalidated, your credit card will be charged the ticket price and all applicable fees, and you will be issued a new ticket. You will not be able to obtain a refund or exchange after a ticket has been purchased, unless required by law or otherwise permitted by iTHINK Financial Amphitheatre. iTHINK Financial Amphitheatre may require you to pay a fee, to be a season ticket holder, to be on the waiting list to be a season ticket holder or to comply with a registration or other requirement, in order to view listings of, or to purchase, some or all of the tickets posted for sale. We and iTHINK Financial Amphitheatre make no warranty or guarantee about the quantity or quality of tickets that will be available for purchase if you pay such a fee, are a season ticket holder, are on the waiting list to be a season ticket holder or comply with registration or other requirements. Please see iTHINK Financial Amphitheatre website for further restrictions. Orders are processed only after a billing address, and other billing information, has been verified. Occasionally, we receive incorrect billing or credit card account information for a ticket order that can delay processing and delivery. In these cases, we will attempt to contact you, using the information provided at the time of purchase. If we are unable to reach you after our initial attempt, we may cancel your order and may sell your tickets to another customer without further notice. If you do not receive a confirmation number (in the form of a confirmation page or email) after submitting payment information, or if you experience an error message or service interruption after submitting payment information, it is your responsibility to confirm whether or not your order has been placed. Only you may be aware of any problems that may occur during the purchase process. We will not be responsible for losses (monetary or otherwise) if you assume that an order was not placed because you failed to receive confirmation. Seat views displayed on the Site may not be an exact representation. Opening acts or guests may sometimes tour with headlining performers. We are not always made aware of opening acts or the length of their performances. Opening acts, as well as festival performers, are subject to change or cancellation at any time without notice. No refund will be owed if an opening act or festival performer is changed or canceled. You agree that you will not attempt to evade, avoid, or circumvent any refund prohibitions in any manner with regard to tickets you purchased. Without limiting the generality of the foregoing, you will not contact us to seek a refund or exchange from us when we are prohibited from providing one by its clients, and you will not dispute or otherwise seek a “chargeback” from the company whose credit card you used to purchase tickets from the Site. Should you do so, your tickets may be canceled, and we may, in its sole discretion, refuse to honor pending and future ticket purchases made from all credit card accounts or online accounts on which such chargebacks have been made, and may prohibit all persons in whose name the credit card accounts exist and any person who accesses any associated online account or credit card or who otherwise breaches this provision from using the Site. If we issue you a refund for a ticket due to a canceled or postponed event, we will issue a refund of the ticket price paid and all service fees. In no event will delivery charges or any other amounts be refunded. If a refund is issued, it will be issued using the same method of payment that was used to purchase the tickets. We will not be liable for travel or any other expenses that you or anyone else incurs in connection with a canceled or postponed event. iTHINK Financial Amphitheatre reserves the right, without refund of any amount paid, to refuse admission to, or eject, any person whose conduct management deems disorderly, who uses vulgar or abusive language or who fails to comply with iTHINK Financial Amphitheatre rules. Breach of terms or rules will terminate your license to attend the event without refund. A ticket is a revocable license and admission may be refused upon refunding the ticket’s face amount. A ticket is not redeemable for cash. You agree that the event for which you purchase tickets is a public event, that your appearance and actions inside and outside the venue where the event occurs are public in nature, and that you have no expectation of privacy with regard to your actions or conduct at the event. You grant permission to us and the Event Provider(s) to utilize your name, image, likeness, acts, poses, plays, appearance, movements, and statements in any live or recorded audio, video, or photographic display or other transmission, exhibition, publication or reproduction made of, or at, the event (regardless of whether before, during or after play or performance) for any purpose, in any manner, in any medium or context now known or hereafter developed, without further authorization from, or compensation to, you or anyone acting on your behalf. We are not responsible for providing transportation or reimbursement of travel-related expenses under any circumstances unless those items are specifically included as part of a package. We are not responsible for any delay causing you to arrive late or miss your event for any reason. If our actions result in you missing your event, we will not be liable for more than your total purchase price. We are not responsible for the conditions or the actions of the crowd at any event or for any changes made at the venue including without limitation seating arrangements, stage set-up or venue conditions. Balls, pucks, and other objects may fly into the spectator area during an event. Despite spectator shielding, injury can occur. Stay alert at all times before, during and after play or performance. If struck, immediately ask an usher for directions to a medical station. You voluntarily assume all risks and danger incidental to the event for which the ticket is issued, whether occurring before, during or after the event, and you waive any claims for personal injury or death against us, management, facilities, leagues, artists, other participants, and all of our respective parents, affiliated entities, agents, officers, directors, owners and employees on behalf of yourself and any accompanying minor. You bear all risks of inclement weather. Event date and time are subject to change. You and your belongings may be searched on entry to the event. You consent to such searches and waive any related claims that may arise. If you elect not to consent to such searches, you may be denied entry to the event without refund or other compensation. Under certain facility rules, certain items may not be brought into the premises, including without limitation, alcohol, drugs, controlled substances, cameras, recording devices, laser pointers, strobe lights, irritants (e.g., artificial noisemakers), bundles and containers. Unlawful resale (or attempted resale), counterfeit or copy of tickets is grounds for seizure and cancellation without compensation. Certain maximum resale premiums and restrictions may apply in some states and we cannot be responsible for providing legal advice regarding resale or pricing of tickets. You are responsible for complying with all applicable ticket resale laws. Tickets may not be used for advertising, promotions, contests or sweepstakes, unless formal written authorization is given by us. Posting Tickets for Sale If you use the Advanced Services to sell a ticket, you will be the ticket’s seller, not us or iTHINK Financial Amphitheatre. We and iTHINK Financial Amphitheatre are only providing certain services that will facilitate your sale. Unlawful resale (or attempted resale), counterfeit or copy of tickets is grounds for seizure and cancellation without compensation. Certain maximum resale premiums and restrictions may apply in some states and we cannot be responsible for providing legal advice regarding resale or pricing of tickets. You are responsible for complying with all applicable ticket resale laws, rules and regulations when listing your tickets on any resale platform owned or controlled by us. Before posting a ticket for sale via the Advanced Services, please consult the website through which you will be posting your ticket for sale, which detail the prices at which you may post tickets for sale via the Advanced Services, the amounts that will be deducted, retained or charged from or over the sale price, the amounts that will be credited or remitted to you, the method by which you will receive such credit or remission and other terms applicable to the posting, sale and funds collection, retention, deduction and payment or crediting processes. Once a ticket has been ordered by a potential purchaser, you will not be able to modify or cancel your posting of that ticket, or to stop that ticket’s sale, even though title to that ticket may not pass to the purchaser until a later time. We or iTHINK Financial Amphitheatre will collect funds from the purchaser, and iTHINK Financial Amphitheatre will transmit to you a credit or payment as described elsewhere in these Terms. By posting a ticket using the Advanced Services, you authorize us and iTHINK Financial Amphitheatre, upon purchase of the ticket by another person through the Advanced Services, to cancel and invalidate your right to use or convey the ticket, and you acknowledge that the posted ticket will thereafter be invalid for entry to the applicable event by you or anyone other than the person who acquires that ticket via the Advanced Services (or any person lawfully receiving the ticket from such acquirer). iTHINK Financial Amphitheatre will be responsible for all payments and credits to you, you will solely hold iTHINK Financial Amphitheatre responsible for such payment or credit and neither we nor any other person or organization will be liable therefor. Please note that not all members of the public may be able to purchase, or view listings for, tickets that you post for sale, as iTHINK Financial Amphitheatre may require potential purchasers to pay a fee, be a season ticket holder, be on the waiting list to be a season ticket holder or comply with a registration or other requirement, in order to view listings of, or to purchase, some or all of the tickets posted for sale. You will not be entitled to receive any part of any payment made in connection with having access to ticket listings or ticket purchase capabilities, or in connection with wait list or season ticket holder status. You agree that you will not sell, convey, give away, forward, otherwise distribute, try to use or take any action that directly or indirectly allows to be cancelled or invalidated: (a) any ticket before or during any time that it is posted for sale via the Advanced Services, (b) any sold, forwarded or otherwise cancelled or invalidated tickets, or (c) any ticket that you have already sold, conveyed, forwarded or otherwise distributed to another. If an event for which you sell a ticket via the Advanced Services is cancelled, then you will be obligated to return, within five days of notice by iTHINK Financial Amphitheatre, the difference between the amount of payments you collected in connection with such sale and the amount of money that iTHINK Financial Amphitheatre would have refunded to you had you still been the holder of (i.e., as if you had not yet sold) such ticket when the event was cancelled. In such a case, if you did not receive a payment from iTHINK Financial Amphitheatre but instead received a credit, then the credit will be reduced so that it instead equals the amount of money that iTHINK Financial Amphitheatre would have refunded to you had you still been the holder of such ticket when the event was cancelled. If an event for which you sell a ticket via the Advanced Services is postponed and the purchaser of such ticket is given a refund of the amount that that purchaser has paid, then you will be obligated to return, within five days of notice by iTHINK Financial Amphitheatre, all of the payments you collected in connection with such sale, but iTHINK Financial Amphitheatre will return the ticket to you that you sold so that you can then use it to attend the event. In such a case, if you did not receive a payment from iTHINK Financial Amphitheatre but instead received a credit, then the credit will be entirely reversed (so that you will no longer have a credit), but iTHINK Financial Amphitheatre will return the ticket to you that you sold so that you can then use it to attend the event. Any failure by you to pay any amounts owed under this paragraph within such five days will constitute a material breach of these Terms. The following applies only to resale tickets to Illinois events: If you purchase resale tickets to an event located in Illinois, you will receive a refund of the amount you paid for that resale ticket if (a) the ticketed event is canceled (in which case you will not receive a refund of any delivery fees), (b) that ticket does not allow you to enter the ticketed event for reasons that may include, without limitation, that the ticket is counterfeit or that the ticket has been canceled by the issuer due to non-payment, unless the ticket is canceled due to an act or omission by you, (c) that ticket fails to conform to its listing description, or (d) you failed to receive that ticket. The following applies only to resale tickets to New York events: If you purchase a resale ticket to an event located in New York, you will receive a refund of the amount you paid for that resale ticket if: (a) the ticketed event is canceled (in which case you will not receive a refund of any order processing and delivery fees); (b) that ticket does not allow you to enter the ticketed event, unless the ticket is canceled due to an act or omission by you; or (c) that ticket fails to conform to its listing description unless you have pre-approved a substitution of tickets. Sold Tickets Before we can pay you, we will need to collect your taxpayer information in accordance with applicable laws. Ticketmaster is generally required to file a Form 1099-K report with the IRS if the gross amount of your transactions on our marketplaces is $600 or more in a calendar year. Ticketmaster will generally provide you a copy of the Form 1099-K by January 31 of the following year.  Many states may also require Ticketmaster to report when you have made at least $600 in transactions on our marketplaces, although some states may require reporting based on different thresholds. When required, Ticketmaster will generally provide you a copy of any state forms. For more information, please go to our FAQ page 1099-K Form: Answer to Some Common Questions. Other Purchases and Services You may be able to access Advanced Services to: purchase or renew season tickets register for season ticket waiting lists purchase rights of refusal for post season event tickets purchase additional suite seats purchase parking purchase ticket packages or single event tickets pay ticket or waiting list deposits engage in other activities If you elect to engage in any such transaction, then additional terms may apply. Please consult iTHINK Financial Amphitheatre for additional terms and requirements. Group Tickets iTHINK Financial Amphitheatre may allow a designated person (“Group Manager”) to distribute group tickets. If you are in the group ticket distribution, the Group Manager will send you an email to retrieve print-at-home tickets. You will be responsible for printing out and using your tickets. Either you or the Group Manager will be responsible for paying for the tickets, as applicable. If the Group Manager pays for a ticket, then the Group Manager may cancel ticket distribution at any time, even after you have already retrieved your ticket, in which case you will not be able to use it to attend the event. If you are responsible for paying for a ticket, then the Group Manager may only cancel ticket distribution before you pay for the ticket; once you pay for a ticket the Group Manager will not be able to cancel it. You will not be able to obtain a refund or exchange after a ticket has been purchased, unless required by law or otherwise permitted by iTHINK Financial Amphitheatre. Season Ticket Forwarding The Advanced Services may permit you to forward your season tickets to another person. You can send an email invitation with a link to transfer your tickets and if the recipient accepts your offer, the tickets will be placed into the recipient’s Ticketmaster account. Once the recipient accepts your offer, you will not be able to cancel the tickets. Tickets forwarded using the Advanced Services are subject to the ticket authentication and delivery fees as disclosed to you by us or iTHINK Financial Amphitheatre. You may be required to provide your credit card number and other information in order to pay such fees, which will be processed or collected by us or iTHINK Financial Amphitheatre. Such fees are not refundable under any circumstances. If iTHINK Financial Amphitheatre offers a program that allows you to forward your tickets to a charity, you should read the rules posted relating to such program on iTHINK Financial Amphitheatre website. You should not assume that you will receive a tax deduction for forwarding tickets to a charity or any documents that can be used to support a tax deduction. Violation of these Terms We may investigate any violation of these Terms, including unauthorized use of the Site. We may provide law enforcement with information you provide to us related to your transactions to assist in any investigation or prosecution of you. We may take legal action that we feel is appropriate. You agree that monetary damages may not provide us a sufficient remedy and that we may pursue injunctive or other relief for your violation of these Terms. If we determine that you have violated these Terms or the law, or for any other reason or for no reason, we may cancel your account and prevent you from accessing the Site at any time without notice to you. If that happens, you may no longer use the Site or any Content. You will still be bound by your obligations under these Terms. You agree that we will not be liable to you or any third party for termination of your access to the Site or to your account or any related information, and we will not be required to make the Site or your account or any related information available to you. If you violate these Terms, your transactions, distributions, deliveries, credit authorizations, payments, payment receipts, registrations, log-ins, ticket forwards, ticket postings, ticket sales, ticket purchases, ticket forwarding receptions, ticket orders, group management or participating or ticket management (any of the foregoing, or any other activities or transactions for which you use the Advanced Services, each an “Activity”), or season, package, group or other tickets, may be cancelled, set-offs and debits may be taken against your accounts and credits and payments that would otherwise be owed to you, and we may exercise any other remedy available to us. Disclaimer of Warranties WE PROVIDE THE SITE AND THE CONTENT TO YOU “AS IS” AND “AS AVAILABLE”. WE TRY TO KEEP THE SITE UP, BUG-FREE AND SAFE, BUT YOU USE IT AT YOUR OWN RISK. TO THE FULLEST EXTENT PERMISSIBLE BY LAW, AND TO THE EXTENT THAT APPLICABLE LAW PERMITS THE DISCLAIMER OF EXPRESS OR IMPLIED WARRANTIES, WE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING ANY WARRANTY OF TITLE, NON-INFRINGEMENT, ACCURACY, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR WARRANTIES THAT MAY ARISE FROM COURSE OF DEALING OR COURSE OF PERFORMANCE OR USAGE OF TRADE. WE DO NOT GUARANTEE THAT THE SITE WILL ALWAYS BE SAFE, SECURE OR ERROR-FREE OR THAT THE SITE WILL ALWAYS FUNCTION WITHOUT DISRUPTIONS, DELAYS OR IMPERFECTIONS. WE ARE NOT RESPONSIBLE FOR THE ACTIONS OR INFORMATION OF THIRD PARTIES, AND YOU RELEASE US FROM ANY CLAIMS AND DAMAGES, KNOWN AND UNKNOWN, ARISING OUT OF OR IN ANY WAY CONNECTED WITH ANY CLAIM YOU HAVE AGAINST ANY SUCH THIRD PARTIES. IF YOU ARE A CALIFORNIA RESIDENT, YOU WAIVE CALIFORNIA CIVIL CODE §1542, WHICH SAYS: A GENERAL RELEASE DOES NOT EXTEND TO CLAIMS WHICH THE CREDITOR DOES NOT KNOW OR SUSPECT TO EXIST IN HIS OR HER FAVOR AT THE TIME OF EXECUTING THE RELEASE, WHICH IF KNOWN BY HIM OR HER MUST HAVE MATERIALLY AFFECTED HIS SETTLEMENT WITH THE DEBTOR. Limitation of Liability IN NO EVENT WILL WE OR iTHINK Financial Amphitheatre , SUPPLIERS, ADVERTISERS AND SPONSORS, BE RESPONSIBLE OR LIABLE TO YOU OR ANYONE ELSE FOR, AND YOU HEREBY KNOWINGLY AND EXPRESSLY WAIVE ALL RIGHTS TO SEEK, DIRECT, INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OF ANY TYPE OTHER THAN OUT OF POCKET EXPENSES, AND ANY RIGHTS TO HAVE DAMAGES MULTIPLIED OR OTHERWISE INCREASED, ARISING OUT OF OR IN CONNECTION WITH THE SITE, THE CONTENT, OR ANY PRODUCT OR SERVICE PURCHASED THROUGH THE SITE, EVEN IF WE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES, AND REGARDLESS OF WHETHER THE CLAIM IS BASED UPON ANY CONTRACT, TORT, OR OTHER LEGAL OR EQUITABLE THEORY. WITHOUT LIMITING THE FOREGOING, YOU EXPRESSLY ACKNOWLEDGE AND AGREE THAT WE WILL HAVE NO LIABILITY OR RESPONSIBILITY WHATSOEVER FOR (a) ANY FAILURE OF ANOTHER USER OF THE SITE TO CONFORM TO THE CODES OF CONDUCT, (b) PERSONAL INJURY OR PROPERTY DAMAGE, OF ANY NATURE WHATSOEVER, WHETHER ARISING IN CONTRACT OR IN TORT, RESULTING FROM YOUR ACCESS TO AND USE OF OUR SITE, (c) ANY UNAUTHORIZED ACCESS TO OR USE OF OUR SECURE SERVERS AND/OR ANY AND ALL PERSONAL INFORMATION AND/OR FINANCIAL INFORMATION STORED THEREIN, (d) ANY BUGS, VIRUSES, WORMS, TROJAN HORSES, DEFECTS, DATE BOMBS, TIME BOMBS OR OTHER ITEMS OF A DESTRUCTIVE NATURE WHICH MAY BE TRANSMITTED TO OR THROUGH OUR SITE, (e) ANY ERRORS, MISTAKES, INACCURACIES OR OMISSIONS IN ANY CONTENT, OR (f) ANY LOST, STOLEN OR DAMAGED TICKETS, OR THE FAILURE OF A VENUE TO HONOR A TICKET. YOUR SOLE AND EXCLUSIVE REMEDY FOR DISSATISFACTION WITH THE SITE IS TO STOP USING THE SITE. THE LIMITATIONS IN THIS SECTION WILL APPLY EVEN IF ANY LIMITED REMEDY FAILS OF ITS ESSENTIAL PURPOSE. THE ALLOCATION OF RISK BETWEEN US IS AN ESSENTIAL ELEMENT OF THE BASIS OF THE BARGAIN BETWEEN US. OUR AGGREGATE LIABILITY ARISING OUT OF THESE TERMS OR THE USE OF THE SITE WILL NOT EXCEED THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU HAVE PAID US IN THE PAST TWELVE MONTHS. IN NO EVENT WILL ATTORNEYS’ FEES BE AWARDED OR RECOVERABLE. OUR LIABILITY WILL BE LIMITED UNDER THIS PARAGRAPH TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, AND THE PROVISIONS OF THIS PARAGRAPH WILL NOT APPLY TO THE EXTENT APPLICABLE LAW PERMITS THE RECOVERY OF DAMAGES, ATTORNEYS’ FEES OR COSTS OTHERWISE PROHIBITED UNDER THIS PARAGRAPH. THE PROVISIONS OF THIS PARAGRAPH THAT (A) PROHIBIT DAMAGES TO BE MULTIPLIED OR OTHERWISE INCREASED, (B) IMPOSE A DAMAGES LIMITATION OF THE GREATER OF ONE HUNDRED DOLLARS ($100) OR THE AMOUNT YOU HAVE PAID US IN THE PAST TWELVE MONTHS, AND (C) PROHIBIT THE RECOVERY OF ATTORNEYS’ FEES AND COSTS, DO NOT APPLY IN CERTAIN STATES, INCLUDING WITHOUT LIMITATION NEW JERSEY, TO CLAIMS BROUGHT UNDER STATUTES PERMITTING SUCH RECOVERY. Indemnification If anyone brings a claim against us related to your use of the Site or the content, or your violation of these Terms, you agree to indemnify, defend and hold us and our affiliated companies, iTHINK Financial Amphitheatre, suppliers, advertisers and sponsors, and each of our officers, directors, employees, and agents, harmless from and against any and all claims, damages, losses and expenses of any kind (including reasonable legal fees and costs). We reserve the right to take exclusive control and defense of any claim, and you will cooperate fully with us in asserting any available defenses. Disputes, Including Mandatory Arbitration and Class Action Waiver Any dispute or claim relating in any way to your use of the Site, or to products or services sold or distributed by us or through us, will be resolved by binding arbitration rather than in court, with the following exceptions: You may assert claims in small claims court if your claims apply; If a claim involves the conditional license granted to you as described in the Ownership of Content and Grant of Conditional License section above, either of us may file a lawsuit in a federal or state court located within Los Angeles County, California, and we both consent to the jurisdiction of those courts for such purposes; and In the event that the arbitration agreement in these Terms is for any reason held to be unenforceable, any litigation against us (except for small-claims court actions) may be commenced only in a federal or state court located within Los Angeles County, California, and we both consent to the jurisdiction of those courts for such purposes. The arbitration agreement in these Terms is governed by the Federal Arbitration Act (FAA), including its procedural provisions, in all respects. This means that the FAA governs, among other things, the interpretation and enforcement of this arbitration agreement and all of its provisions, including, without limitation, the class action waiver discussed below. State arbitration laws do not govern in any respect. This arbitration agreement is intended to be broadly interpreted, and will survive termination of these Terms. The arbitrator, and not any federal, state or local court or agency, shall have exclusive authority to the extent permitted by law to resolve all disputes arising out of or relating to the interpretation, applicability, enforceability or formation of this Agreement, including, but not limited to any claim that all or any part of this Agreement is void or voidable. There is no judge or jury in arbitration, and court review of an arbitration award is limited. However, an arbitrator can award on an individual basis the same damages and relief as a court (including injunctive and declaratory relief or statutory damages), and must follow these Terms as a court would. To begin an arbitration proceeding, you must send a letter requesting arbitration and describing your claim to: Live Nation Entertainment, Inc., 9348 Civic Center Drive, Beverly Hills, CA 90210, Attn: Legal. You may download the forms located at https://www.jamsadr.com . The arbitration will be conducted by JAMS under its Streamlined Arbitration Rules and Procedures or, if applicable, its Comprehensive Arbitration Rules and Procedures, and any applicable supplemental rules including its Consumer Arbitration Standards of Minimum Fairness. The JAMS Rules are available online at https://www.jamsadr.com or by calling (800) 352-5267. Payment of all filing, administration and arbitrator fees will be governed by JAMS’s rules. We will reimburse those fees for claims totaling less than $10,000 unless the arbitrator determines the claims are frivolous, but in no event will we pay for attorneys’ fees. You may choose to have the arbitration conducted by telephone, based on written submissions, or in person in the county where you live or at another mutually agreed location. We each agree that the arbitrator may not consolidate more than one person’s claims, and may not otherwise preside over any form of a representative or class proceeding, and that any dispute resolution proceedings will be conducted only on an individual basis and not in a class, consolidated or representative action. You agree to waive any right to a jury trial or to participate in a class action. If this specific provision is found to be unenforceable, then the entirety of this arbitration section will be null and void and neither of us will be entitled to arbitrate our dispute. You agree that these Terms evidence a transaction involving interstate commerce and will be governed by and construed in accordance with federal law to the fullest extent possible. However, if your dispute is regarding the re-sale of a ticket for any event located in Illinois, then these Terms will be governed and construed in accordance with the laws of Illinois, without regard to conflict or choice of law rules, and you consent to personal jurisdiction, and agree to bring all actions, exclusively in Chicago, Illinois. If you have an inquiry regarding a ticket re-sale transaction for any event located in Illinois, please contact us at 550 W. Van Buren Street, 13th Floor, Chicago, Illinois 60607 or (877) 446-9450 or ticketexchange@ticketmaster.com . Questions If you have any questions, comments or complaints regarding these Terms or the Site, please contact us at: Live Nation Entertainment, Inc. 9348 Civic Center Drive Beverly Hills, CA 90210 (800) 653-8000 California users may also contact the Complaint Assistance Unit of the Division of Consumer Services, California Department of Consumer Affairs, located at 1625 North Market Blvd., Sacramento, CA 95834, (800) 952-5210. Last Updated: November 24, 2024 Please visit https://premium.livenation.com/seat-terms to review the Live Nation Premium Seat Program Terms & Conditions. Ticketmaster Privacy Policy // // Terms of Use // Cookie Policy © 1999-2025 Ticketmaster. All rights reserved."
    },
    {
      "url": "https://www.ticketmaster.com/ithink-financial-amphitheatre-tickets-west-palm-beach/venue/106578",
      "text": "iTHINK Financial Amphitheatre  - West Palm Beach, FL | Tickets, 2025-2026 Event Schedule, Seating Chart Your browser is not supported. For the best experience, use any of these supported browsers: Chrome , Firefox , Safari , Edge . Skip to main content US United States selected, change country Hotels Sell Gift Cards Help VIP Ticketmaster Home page Concerts Sports Arts, Theater & Comedy Family Cities More Toggle search bar Search Search Sign In/Register Home iTHINK Financial Amphitheatre  Tickets iTHINK Financial Amphitheatre  Tickets 601-7 Sansburys Way, West Palm Beach, FL 33411, US Get Directions (Opens in new tab) Events & Add-Ons Venue Details Seating Chart Transport Related Links All Events and Add-Ons 11 Results All Events and Add-Ons 11 Results Tickets Merchandise Voucher Club Access Parking Special Entry VIP Filter by category All Categories Music Miscellaneous Dates All Dates Dates. Change date range: All Dates September 13, 2025 Sep 13 Saturday 07:00 PM Sat 7:00 PM Open additional information for Pantera 9/13/25, 7:00 PM Pantera Find Tickets Pantera 9/13/25, 7:00 PM Add-Ons Parking Parking: Pantera (Not A Concert Ticket) Club Access VIP Club Access: Pantera (Not a Concert Ticket) Special Entry Ford Fast Lane: Pantera (Not A Concert Ticket) Merchandise Voucher Blanket: Pantera (Not a Concert Ticket) Lawn Chair Rental: Pantera (Not a Concert Ticket) Lineup Pantera Amon Amarth King Parrot September 19, 2025 Sep 19 Friday 07:30 PM Fri 7:30 PM Open additional information for The Thuggish-Ruggish-Mafia Tour 9/19/25, 7:30 PM The Thuggish-Ruggish-Mafia Tour Cancelled The Thuggish-Ruggish-Mafia Tour 9/19/25, 7:30 PM Event Info Lineup Bone Thugs-N-Harmony Three 6 Mafia Tech N9ne DJ Quik September 20, 2025 Sep 20 Saturday 06:30 PM Sat 6:30 PM Open additional information for HARDY: Jim Bob World Tour 9/20/25, 6:30 PM HARDY: Jim Bob World Tour Find Tickets HARDY: Jim Bob World Tour 9/20/25, 6:30 PM Add-Ons Parking Parking: HARDY (Not A Concert Ticket) Club Access VIP Club Access: Hardy (Not a Concert Ticket) VIP HARDY VIP UPGRADES (Ticket Sold Separately) Special Entry Ford Fast Lane: Hardy (Not A Concert Ticket) Merchandise Voucher Blanket: Hardy (Not A Concert Ticket) Lawn Chair Rental: Hardy (Not a Concert Ticket) Lineup HARDY Koe Wetzel Stephen Wilson Jr. Sikarus September 28, 2025 Sep 28 Sunday 06:15 PM Sun 6:15 PM Open additional information for A Day To Remember & Yellowcard - Maximum Fun Tour 9/28/25, 6:15 PM A Day To Remember & Yellowcard - Maximum Fun Tour Find Tickets A Day To Remember & Yellowcard - Maximum Fun Tour 9/28/25, 6:15 PM Add-Ons Merchandise Voucher Blanket: A Day to Remember (This is Not a Concert Ticket) Lawn Chair Rental: A Day to Remember (Not A Concert Ticket) Club Access VIP Club Access: A Day to Remember (Not a Concert Ticket) Parking Parking: A Day to Remember (Not A Concert Ticket) Special Entry Ford Fast Lane: A Day to Remember (Not A Concert Ticket) Lineup A Day To Remember Yellowcard State Champs Boundaries October 2, 2025 Oct 02 Thursday 07:00 PM Thu 7:00 PM Open additional information for Lil Wayne: Tha Carter VI Tour Celebrating 20+ years of Carter Classics 10/2/25, 7:00 PM Lil Wayne: Tha Carter VI Tour Celebrating 20+ years of Carter Classics Find Tickets Lil Wayne: Tha Carter VI Tour Celebrating 20+ years of Carter Classics 10/2/25, 7:00 PM Add-Ons Merchandise Voucher Blanket: Lil' Wayne (This is Not a Concert Ticket) Lawn Chair Rental: Lil' Wayne (Not A Concert Ticket) Parking Parking: Lil' Wayne (Not A Concert Ticket) Special Entry Ford Fast Lane: Lil' Wayne (Not A Concert Ticket) Club Access VIP Club Access: Lil' Wayne (Not A Concert Ticket) Lineup Lil Wayne Tyga NoCap October 4, 2025 Oct 04 Saturday 07:30 PM Sat 7:30 PM Open additional information for Jason Aldean: Full Throttle Tour 2025 10/4/25, 7:30 PM Jason Aldean: Full Throttle Tour 2025 Find Tickets Jason Aldean: Full Throttle Tour 2025 10/4/25, 7:30 PM Add-Ons Merchandise Voucher Blanket: Jason Aldean (Not a Concert Ticket) Lawn Chair Rental: Jason Aldean (Not A Concert Ticket) VIP Nate Smith - Meet & Greet Upgrade Nate Smith VIP Upgrade (TICKET NOT INCLUDED) Jason Aldean VIP Upgrade Experience (TICKET NOT INCLUDED) Club Access VIP Club Access: Jason Aldean (Not A Concert Ticket) Special Entry Ford Fast Lane: Jason Aldean (Not A Concert Ticket) Parking Parking: Jason Aldean (Not A Concert Ticket) Lineup Jason Aldean Nate Smith RaeLynn Dee Jay Silver October 5, 2025 Oct 05 Sunday 07:00 PM Sun 7:00 PM Open additional information for Papa Roach & Rise Against: Rise of the Roach Tour 10/5/25, 7:00 PM Papa Roach & Rise Against: Rise of the Roach Tour Find Tickets Papa Roach & Rise Against: Rise of the Roach Tour 10/5/25, 7:00 PM Add-Ons Merchandise Voucher Lawn Chair Rental: Papa Roach (Not A Concert Ticket) Blanket: Papa Roach (Not a Concert Ticket) Parking Parking: Papa Roach (Not A Concert Ticket) Club Access VIP Club Access: Papa Roach (Not A Concert Ticket) Special Entry Ford Fast Lane: Papa Roach (Not A Concert Ticket) Lineup Papa Roach Rise Against Underoath October 10, 2025 Oct 10 Friday 08:00 PM Fri 8:00 PM Open additional information for TWENTY ONE PILOTS - THE CLANCY TOUR: BREACH 2025 10/10/25, 8:00 PM TWENTY ONE PILOTS - THE CLANCY TOUR: BREACH 2025 Find Tickets TWENTY ONE PILOTS - THE CLANCY TOUR: BREACH 2025 10/10/25, 8:00 PM Add-Ons Club Access VIP Club Access: Twenty One PIlots (Not a Concert Ticket) Merchandise Voucher Blanket: Twenty One Pilots (This is Not a Concert Ticket) Lawn Chair Rental: Twenty One Pilots (Not a Concert Ticket) Parking Parking: Twenty One Pilots (Not A Concert Ticket) Lineup Twenty One Pilots Dayglow October 24, 2025 Oct 24 Friday 06:30 PM Fri 6:30 PM Open additional information for Jake Owen & Dirty Heads 10/24/25, 6:30 PM Jake Owen & Dirty Heads Find Tickets Jake Owen & Dirty Heads 10/24/25, 6:30 PM Add-Ons Club Access VIP Club Access: Dirty Heads & Jake Owen (Not A Concert Ticket) Special Entry Ford Fast Lane: Dirty Heads & Jake Owen (Not A Concert Ticket) Merchandise Voucher Blanket: Dirty Heads & Jake Owen (This is Not a Concert Ticket) Lawn Chair Rental: Dirty Heads & Jake Owen (Not A Concert Ticket) Parking Parking: Dirty Heads & Jake Owen (Not A Concert Ticket) Lineup Jake Owen Dirty Heads The Wailers October 30, 2025 Oct 30 Thursday 06:30 PM Thu 6:30 PM Open additional information for Pierce The Veil - I Can't Hear You World Tour 10/30/25, 6:30 PM Pierce The Veil - I Can't Hear You World Tour Find Tickets Pierce The Veil - I Can't Hear You World Tour 10/30/25, 6:30 PM Add-Ons Special Entry Ford Fast Lane: Pierce the Veil (Not A Concert Ticket) Club Access VIP Club Access: Pierce The Veil (Not A Concert Ticket) Parking Parking: Pierce the Veil (Not A Concert Ticket) Merchandise Voucher Lawn Chair Rental: Pierce the Veil (Not a Concert Ticket) Blanket: Pierce the Veil (Not a Concert Ticket) Lineup Pierce The Veil HEALTH Ecca Vandal Like Roses Multiple Dates 2026 Premium Season Tickets Wait List On partner site Find Tickets 2026 Premium Season Tickets Wait List 12/31/26, 12:00 AM On partner site Advertisement Venue Details iTHINK Financial Amphitheatre , 601-7 Sansburys Way, West Palm Beach, FL 33411, US Get Directions (Opens in new tab) What are the box office phone numbers? You can reach the box office by phone at (561) 795-8883 or by email at iThinkAmpInquiry@LiveNation.com. When is the box office open? The box office is open on Fridays from 12 PM to 6 PM, and on show days from 12 PM until showtime. Please note that only credit card transactions are accepted at the box office. What payment types are accepted? iTHINK Financial Amphitheatre is a cashless venue. All points of sale accept credit, debit, or mobile payments such as Apple Pay and Google Pay. Accepted cards include Visa, MasterCard, American Express, and Discover. If you arrive without a card, you can visit a cash-to-card booth on-site to exchange cash for a prepaid card at no cost and with no fees. What are the will call rules? Will call is located at the venue box office and is open from 12 PM until showtime. To pick up tickets, guests must bring the original credit card used for purchase, a valid photo ID, and their Ticketmaster confirmation number. What are the parking options at iTHINK Financial Amphitheatre ? Parking lots open approximately three hours before showtime. Premier Parking is available for purchase online in advance, with prices varying by show. On the day of the event, Premier Parking is offered on a first-come basis and is credit card only. Will call for Premier Parking is located at Gate 2A, off Process Drive/Weisman Way. Accessible parking is available in Lot 6, adjacent to the main gate. A valid accessible placard must be displayed, and guests arriving early may be subject to an additional parking fee. Is there accessible seating? Yes, the venue is fully accessible. Guests in need of a sign language interpreter should call (561) 795-8883 at least three weeks before the event to make arrangements. Assisted listening devices are available at the Guest Services booth in the North Plaza and can be provided free of charge with valid ID. To reserve a device in advance, email iThinkAmpInquiry@LiveNation.com at least two days prior to the show. What are the general rules of iTHINK Financial Amphitheatre ? This is a mobile-entry-only venue, so please download your ticket in advance. Screenshots or photos will not be accepted. If a reprint is needed and possible, a $5 fee per ticket will apply. The venue has a clear bag policy: only clear plastic, vinyl, or PVC bags no larger than 12\" x 6\" x 12\" are permitted, along with small clutches up to 4.5\" x 6.5\". Lawn seating is general admission in an uncovered area where blankets are allowed, but outside lawn chairs are not permitted. Lawn chairs are available for rent on-site for $10, subject to availability. Smoking is allowed in designated lawn areas. Prohibited items include weapons, alcohol, illegal substances, glass containers, cans, hard-sided or large coolers, laser pointers, fireworks, and pets (except service animals). Allowed items include food in clear plastic bags, blankets, small umbrellas or parasols, and one sealed water bottle (up to 20 oz). Are children allowed? Infants under the age of two may enter for free but must receive a pass from the box office on the day of the show. Children aged two and older must have a ticket. For families, a smoke- and alcohol-free Family Zone is located at the bottom of the lawn. Please note that age policies may vary depending on the event, so it's best to contact the box office to confirm. Seating chart Select the event to see the seating chart. Check availability above or on the event page. iTHINK Financial Amphitheatre Pantera Bone Thugs-N-Harmony HARDY A Day To Remember Lil Wayne Jason Aldean Papa Roach Twenty One Pilots Jake Owen Pierce The Veil Pantera This map doesn't reflect availability Transport RideShare Uber is the official ride of iTHINK Financial Amphitheatre . With dedicated pickup and drop-off zones and the option to schedule your ride, you can arrive on time, leave after the encore, and never miss a minute. Book a ride now Related Links iTHINK Financial (Opens in new tab) Ford (Opens in new tab) OLIPOP (Opens in new tab) Athletic Brewing (Opens in new tab) Jack Daniel's (Opens in new tab) Chateau Ste Michelle (Opens in new tab) T-Mobile (Opens in new tab) Demesmin and Dover (Opens in new tab) Cleveland Clinic (Opens in new tab) Anheuser Busch (Opens in new tab) Bacardi (Opens in new tab) Smirnoff Ice (Opens in new tab) Everything Legendary (Opens in new tab) Owen's Craft Mixers (Opens in new tab) CVT (Opens in new tab) Mi Campo/Constellation Spirits (Opens in new tab) YETI (Opens in new tab) Uber (Opens in new tab) Gin & Juice (Opens in new tab) Skimmers (Opens in new tab) Heinz (Opens in new tab) Cutwater (Opens in new tab) Ticketmaster Logo Let's connect (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) (Opens in new tab) Download Our Apps (Opens in new tab) (Opens in new tab) By continuing past this page, you agree to our terms of use Helpful Links Help/FAQ Sell My Account Contact Us Gift Cards Do Not Sell or Share My Personal Information Get Started on Ticketmaster Our Network Live Nation House of Blues Front Gate Tickets TicketWeb universe NFL NBA NHL About Us Ticketmaster Blog Ticketing Truths Ad Choices Careers Ticket Your Event Innovation Friends & Partners PayPal Allianz AWS Our Policies Privacy Policy Cookie Policy Manage my cookies and ad choices © 1999-2025 Ticketmaster. All rights reserved."
    },
    {
      "url": "https://www.ithinkfi.org/about",
      "text": "About Us |Trust & Respect | FL & GA Credit Union| iTHINK Financial 🎉 This September, Get 2x The Points With myRewards Use your myRewards Visa® Signature Credit Card or myRewards Business Visa® Credit Card for everyday retail purchases like gas, groceries, dining, and shopping—and earn 2X the points all month long. 👉 Learn More & Apply Today Skip to content Join Us Contact Us Locations About Personal Banking Checking Savings Rewards Program Digital Banking Payments Member Alerts Loans Vehicle Loans Personal Loans Student Loans Check Loan Status Recreational Vehicle Rates Submit Proof Of Auto Insurance Registration and Title Information Credit Cards Card Control Visa Click to Pay Chip Technology Check Loan Status myRewards Signature Credit Card Visa Credit Card Balance Transfer Contactless Cards Visa Platinum Credit Card Card Management Mortgages First Mortgages Home Equity Lines of Credit Fixed Rate Second Mortgages Reverse Mortgages Contact a Mortgage Advisor Helpful Information Proof of Insurance Meet The Team Services Insurance Wire Transfers Credit Monitoring and Identity Theft Protection Overdraft Options Dental Benefits Max Digital Banking Member Discounts Other Services Free Shred Days Zelle Auto Buying Service Home Finder Early Direct Deposit Education Webinars & Seminars FAQs Student Center Financial Wellness Center Calculators Tax Information Forms Security & Fraud Center My Money Financial Literacy Program Monthly Promotions Business Banking Business Checking Savings Money Market Account Lawyer Trust IOTA/IOLTA Business Digital Banking Business Payments Loans Small Business Administration Loans Commercial Real Estate Loans Lines of Credit Term Loans Business Vehicle Loans Letters of Credit myRewards Business Visa Credit Card Check Loan Status Services Business eDeposits Cash Management Payroll Merchant Solutions SCORE Dental Benefits Max Digital Banking Education Wealth Personal Planning Transition to Retirement Financial Management and Investing Strategic Financial Guidance Risk Management and Insurance Estate Planning Guided Wealth Portfolios Business Planning Contact an Advisor Education Community iTHINK Community Foundation School Ready Days Jingle Bells at the Branches Scholarship Program 5K Building Up Business Spotlight Business Directory iTHINK Financial Amphitheatre Events Testimonials search close login close menu close Search Text Submit Search Login Show Username Remember me Username Password Log In Register Forgot Password? Forgot Username? Mobile Banking Login REGISTER Homepage About About Us What makes iTHINK Financial unique? Read on to find out! Apply for Membership Join Us Learn more Careers Learn more Board of Directors Learn more News Learn more Holiday Schedule Learn more Welcome Learn more Our History In 1969, a group of IBM employees got together (each giving $0.25) to form iTHINK Financial (formerly known as IBMSECU). Who would have thought that a set of quarters in 1969 would turn into one of the nation’s largest credit unions, with over $2 billion in assets and over 100,000 members across the country? What Makes iTHINK Financial Unique? That’s a good question. We are a financial institution similar to the others, but one thing sets us apart and makes a difference…. Our Personalized Service, Without It We’d Be Just Another Financial Institution! Join iTHINK Financial today and you’ll see the difference clearly. Read on to learn some of the many ways that we provide you with personalized service. Our Mission Is Service Excellence! At iTHINK Financial, we have made it our mission to provide our members with what we call Service Excellence. This means that each and every experience you have with your credit union should be a memorable one. We have even developed the Member Experience Program (MX) to ensure that you are treated the way you deserve to be treated, like our most valuable asset! You’re Not Only A Member – You’re An Owner! When you join the credit union, you automatically become an owner. We are a not-for-profit organization governed by a Board of Directors made up of members like you, elected by you. What you have to say really matters! Providing The Right Solutions To Your Needs! You can turn to your credit union for the right solutions to all of your financial needs! We have a complete range of products and services including: Checking and Savings accounts, Money Market accounts, Certificates, IRAs, First and Second Mortgages,\n    Car Loans, Visa Credit Cards, Business Services, and much more. You can access these products and services on your terms: in the branch, online, over the phone, via email and more! Trust And Respect, Values We Believe In! We respect that you have many choices and we understand that by bringing your financial needs to the credit union, you have placed your trust in us. Our promise to you is that we have and will always strive to provide you with Service Excellence and Superior\n    Financial Solutions! Our Credit Union Staff We are proud that our credit union staff is made up of people of many different cultures that speak many different languages. We work together to provide Service Excellence to our diverse membership! Feel Confident Your Money Is Safe With Us! Your savings at iTHINK Financial will continue to be federally insured to at least $250,000 by the National Credit Union Administration (NCUA), a federal agency backed by the full faith and credit of the United States Government. For more information,\n    please refer to NCUA’s Your Insured Funds . Not a Member? Join us today! It's easy to join! Apply for your lifetime Membership with iTHINK Financial in about 10 minutes. Join Us Member Testimonials Submit your testimonial I wanted to take a moment to express my sincere gratitude for the exceptional service I’ve experienced at iTHINK Financial, particularly with Kelly Stover and Courtney Bridges at the Jasper office. Their dedication and expertise have not only met but exceeded my expectations in every way. My journey with iTHINK Financial began many years ago when my mother opened a joint savings account for me as a teenager in 2006. Over the years, I’ve appreciated the reliability and community-focused approach of your credit union, even as I navigated significant life changes—living out of state in Alaska for two years and later going through a divorce. During these times, the support from your team was invaluable.\n \nRecently, as I compared iTHINK Financial to other institutions like Synovus Bank, Bank of OZK, and First Citizens Bank, Kelly and Courtney’s outstanding customer service and knowledge truly stood out. Their ability to address my needs promptly and efficiently was impressive, making it an easy decision to entrust iTHINK Financial with my business banking needs. Kelly’s emphasis on your credit union’s commitment to the community has resonated deeply with me. I must admit that I was initially skeptical, but my experiences with Kelly and Courtney have made me a firm believer in the values that iTHINK Financial represents. \n \nI would be honored to serve as a professional reference or advocate for your credit union if ever needed. Please extend my sincerest appreciation to Kelly and Courtney for their exceptional service. They are truly assets to your team. Thank you for fostering such a high standard of service within your organization. David S. One can feel the difference in dealing with people that treat people professional and with kindness.   Membership counts when dealing with a credit union.  The common bond is evident as one enters the premises. There is an atmosphere of a willingness to help.  I ran a mortgage company in Massachusetts and tried to give the same personal attention to our clients.  You just don’t get that from large impersonal banks.  Just a number and not always number 1. Thanks again Larry M. I have always known, since childhood, that the credit union is a safe, friendly place to do business with. My experience with the credit union has always been superb. During March I ran into some financial difficulties while I was trying to complete payment to a builder that added an efficiency to my house. Due to the COVID-19 virus, work on the house stopped for four months due to repeated illness of the workmen. As a result, I had to continue paying my mortgage while paying the workmen for the work they had done plus what they had left to do. So I paid four months mortgage more than I estimated to pay. I applied to the credit union for a loan, and although I got less than what I wanted to borrow, I got the loan the next day. I was able to pay the builder the outstanding balance and I am forever grateful to the credit union, and, especially to Celine, who was very helpful in making that possible. Efelin W. Vastyana Campbell is one of the best customer service agents I have ever had the please of speaking with in a long time. She went above and beyond to help me resolve an issue. I could tell she really cared about the issue, your client, and helping me. It is not often you see those qualities in a customer service agent in a call center setting. She is a much needed breath of fresh air, and has a lasting affect on people. Her customer service makes me want to learn more about this bank for my personal needs. Vastyana Campbell YOU ROCK!!! Na'Tivyla Professionalism and thoroughness delivered in a warm welcoming way…muita obrigado Neide Costa. You are an exemplar of the great service provided by iTHINK Financial. Thomas T. Thank you, Neide Costa, Mortgage service specialist, for answering all of my questions quickly, efficiently and in a way that I could easily understand. You were a godsend at a time when I was getting extremely frustrated with my inability to reach a person from iTHINK. Debra P. I can’t thank Bianca and Jeff enough for not only getting the best interest rate but making the entire car loan application process stress less! Always available for questions during the process and giving guidance on next steps! This is my second auto loan with this credit union and both times have been a great experience and saved me so much money! Thank you!! Bridgette B. I have used the Credit Union for the past 10 years for all of my banking needs – checking, savings, money market, car loans, mortgage, home equity and now my HSA. When I walk in I am greeted by name. Tell me what other bank makes you feel welcome? It has that warm, homey bank next door atmosphere that I have not found anywhere else and customer service with a smile! Like it’s supposed to be! Linda B. I became a member last year and just recently refinanced my mortgage. The entire experience was quite pleasant. Everyone could not have been more helpful, more personable, more attentive to my needs…well I could go on and on! I was a former BoA customer who was badly stung by their so called “customer service” in the most appalling manner. I only wish I had come to my credit union sooner. Thank you, thank you, thank you! Michele L. Thanks to the best home loan department ever, I was able to move into my new home in record timing. This was my third time purchasing a home, but I can say this was the best customer service experience I have had. Samuel B. Our Community Commitment iTHINK Financial’s mission is to deliver Service Excellence to the Membership and value to the communities we serve while ensuring the safety and soundness of the Credit Union. iTHINK Financial prides itself in supporting our communities. Learn more Upcoming Events Check out the upcoming events happening at iTHINK Financial. Go to Event Calendar sep 16 WEALTH MANAGEMENT WEBINAR - SOCIAL SECURITY: SEVEN KEYS TO ENHANCING BENEFITS SEPTEMBER 16TH, 2025 @ 11:00AM - 12:00PM sep 17 Business Webinar - Data-Driven Decisions SEPTEMBER 17TH, 2025 @ 10:00AM - 11:30AM sep 27 Shred Days SEPTEMBER 27TH, 2025 @ 10:00AM - OCTOBER 25TH, 2025 @ 1:00PM Go to Event Calendar SHARE Routing (ABA) Number: 267077627 800.873.5100 serviceplus@ithinkfi.org Contact Us Blog Stay Connected Equal Housing Lender Federally Insured By NCUA ©2025 iTHINK Financial Credit Union Privacy & Security Accessibility Disclosures Are You Sure You Want To Leave Our Site? iTHINK Financial does not provide, and is not responsible for, the product, service, overall website content, security, or privacy policies on any external third-party sites. These sites may not be conformant with current ADA requirements. If you continue, an external website that is owned and operated by a third-party will be opened in a new browser window. YES, CONTINUE NO, STAY HERE"
    },
    {
      "url": "https://www.ithinkfiamp.com/private-events",
      "text": "iTHINK Financial Amphitheatre: Multi-Use Venue for Private Events in West Palm Beach Skip to content Shows Upgrades Visit Get Here Purchase Your Parking Bites and Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … Make iThink Financial Amphitheatre Yours Featuring outdoor setting and soaring views, iTHINK Financial Amphitheatre is the perfect location for your next conference, corporate event, fundraiser, private concert or graduation. With access to the world’s greatest musical entertainment, state-of-the-art lighting and sound, custom menus and mixology, our talented staff handles every detail, so you don’t have to. Accommodating up to 17,200 guests, and located 10 miles from Palm Beach County Convention Center, 10 miles from Downtown, and 8 miles from Palm Beach International Airport this unique venue will exceed expectations. Let’s plan your event First name * Last name * Email * Phone number * Corporate Events Social Gatherings Wedding Convention Event Fundraiser School Events Military / Government Religious Tour & Travel Other Event type Event date Company name Number of attendees Word of Mouth Special Events Sales Team Google/Search Engine Social Media Email Third-Party Website Advertisement Print Ad Direct Mail Attended an Event Other How did you hear about us? Promo code Get special events updates, highlights and exclusive offers from Live Nation Special Events. Submit This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Contact our Sales Team Phone : 305.938.2505 Email : ithinkampevents@livenation.com Address : 601-7 Sansburys Way, West Palm Beach, FL 33411 One-Sheet Capacities More Details Event Spaces Amphitheatre Lawn VIP Club Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch iTHINK Financial Amphitheatre 601-7 Sansburys Way West Palm Beach, FL 33411 ithinkampinquiry@livenation.com 561.795.8883 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://www.ithinkfi.org/contact-us",
      "text": "Contact Us| iTHINK Financial 🎉 This September, Get 2x The Points With myRewards Use your myRewards Visa® Signature Credit Card or myRewards Business Visa® Credit Card for everyday retail purchases like gas, groceries, dining, and shopping—and earn 2X the points all month long. 👉 Learn More & Apply Today Skip to content Join Us Contact Us Locations About Personal Banking Checking Savings Rewards Program Digital Banking Payments Member Alerts Loans Vehicle Loans Personal Loans Student Loans Check Loan Status Recreational Vehicle Rates Submit Proof Of Auto Insurance Registration and Title Information Credit Cards Card Control Visa Click to Pay Chip Technology Check Loan Status myRewards Signature Credit Card Visa Credit Card Balance Transfer Contactless Cards Visa Platinum Credit Card Card Management Mortgages First Mortgages Home Equity Lines of Credit Fixed Rate Second Mortgages Reverse Mortgages Contact a Mortgage Advisor Helpful Information Proof of Insurance Meet The Team Services Insurance Wire Transfers Credit Monitoring and Identity Theft Protection Overdraft Options Dental Benefits Max Digital Banking Member Discounts Other Services Free Shred Days Zelle Auto Buying Service Home Finder Early Direct Deposit Education Webinars & Seminars FAQs Student Center Financial Wellness Center Calculators Tax Information Forms Security & Fraud Center My Money Financial Literacy Program Monthly Promotions Business Banking Business Checking Savings Money Market Account Lawyer Trust IOTA/IOLTA Business Digital Banking Business Payments Loans Small Business Administration Loans Commercial Real Estate Loans Lines of Credit Term Loans Business Vehicle Loans Letters of Credit myRewards Business Visa Credit Card Check Loan Status Services Business eDeposits Cash Management Payroll Merchant Solutions SCORE Dental Benefits Max Digital Banking Education Wealth Personal Planning Transition to Retirement Financial Management and Investing Strategic Financial Guidance Risk Management and Insurance Estate Planning Guided Wealth Portfolios Business Planning Contact an Advisor Education Community iTHINK Community Foundation School Ready Days Jingle Bells at the Branches Scholarship Program 5K Building Up Business Spotlight Business Directory iTHINK Financial Amphitheatre Events Testimonials search close login close menu close Search Text Submit Search Login Show Username Remember me Username Password Log In Register Forgot Password? Forgot Username? Mobile Banking Login REGISTER Homepage Contact Us Contact Us Make an Appointment SHARE Need More Info? Have a question you can't find the answer to? Search our FAQ Library! Contact Us Form Due to security purposes, any request asking for direct assistance with your card, Zelle, or inquiry that requires direct access to your information should be directed to Member Services at 800-873-5100 or sent through the Message Center found in your Online Banking/Mobile Application. Contact Information Branch and ATM Locations Please use our Branch & ATM Locator page\n to find one near you. See our CO-OP Shared Branch page for\n information on Shared Service Centers. Appointments Schedule an in-branch or phone appointment from the convenience of your computer, tablet, or phone. Simply choose your appointment type, date, time, and location, and we’ll pair you with a team member that best fits your needs. Call or Email Us If you still need assistance, call us at 800.873.5100 (Monday – Friday 8:00 a.m. – 9:00 p.m.) or email us at serviceplus@ithinkfi.org .\n Emails received outside of normal business hours will receive a response the following business day. Access your accounts from any touchtone phone – anytime, anywhere: Call 800.873.5100 Loan Department Call 800.873.5100, ext. 7701 during normal business hours to speak with a Loan Representative or email loans@ithinkfi.org . Mortgage Department For Mortgage Servicing call 800.873.5100, ext. 8734 For Mortgage Payoffs fax 561.226.5412 or email mortgageservicing@ithinkfi.org For a new Mortgage or Home Loan call 800.873.5100, ext. 7722 or email mortgage@ithinkfi.org Lost or Stolen Card? To report your Visa® Credit Card or Visa® Debit Card lost or stolen, please contact us 24/7 at 800.873.5100 for assistance. While waiting to get in contact with us, please utilize our Card Control feature to place a lock on your card so no unauthorized purchases can be made. You have the ability to unlock it if you happen to find your card. Activate New Card To activate your Visa® Platinum Credit Card, please contact us 24/7 at 800.873.5100 for assistance. Card Disputes For questions or disputes about your Visa Credit Card or Visa Debit Card, please call 800.873.5100 between 8:00 a.m. and 5:00 p.m. Monday thru Friday or email visa@ithinkfi.org . Travel Notification Please contact our Call Center by calling 800.873.5100 to let us know you’ll be out of town. Make sure we have your current contact information, including email address, on file. Fax Numbers Main fax number: 561.226.5415 Mailing Address P.O. Box 5090 Boca Raton, FL 33431-0890 Contact the CEO iTHINK Financial President and CEO Mike Miller loves hearing from members! Submit a message to Mike Routing (ABA) Number: 267077627 800.873.5100 serviceplus@ithinkfi.org Contact Us Blog Stay Connected Equal Housing Lender Federally Insured By NCUA ©2025 iTHINK Financial Credit Union Privacy & Security Accessibility Disclosures Are You Sure You Want To Leave Our Site? iTHINK Financial does not provide, and is not responsible for, the product, service, overall website content, security, or privacy policies on any external third-party sites. These sites may not be conformant with current ADA requirements. If you continue, an external website that is owned and operated by a third-party will be opened in a new browser window. YES, CONTINUE NO, STAY HERE"
    },
    {
      "url": "https://www.ithinkfiamp.com/",
      "text": "iTHINK Financial Amphitheatre Tickets & Schedule | West Palm Beach Concert Venue Skip to content Shows Upgrades Visit Get Here Purchase Your Parking Bites and Drinks Accessibility The Need-To-Know Before You Go Venue Map FAQ Season Tickets Private Events … SOUTH FLORIDA'S FAVORITE OUTDOOR VENUE: iTHINK FINANCIAL AMPHITHEATRE View Shows Stage Dive In Headline Acts 2026 Premium Season Tickets Wait List Thu Dec 31, 2026 Buy Tickets More Info Multi Day 31 - 31 Dec 2026 Premium Season Tickets Wait List Pantera Sat Sep 13, 2025 Buy Tickets More Info Sat 13 Sep Pantera HARDY: Jim Bob World Tour Sat Sep 20, 2025 Buy Tickets More Info Sat 20 Sep HARDY: Jim Bob World Tour A Day To Remember & Yellowcard - Maximum Fun Tour Sun Sep 28, 2025 Buy Tickets More Info Sun 28 Sep A Day To Remember & Yellowcard - Maximum Fun Tour Lil Wayne: Tha Carter VI Tour Celebrating 20+ years of Carter Classics Thu Oct 2, 2025 Buy Tickets More Info Thu 02 Oct Lil Wayne: Tha Carter VI Tour Celebrating 20+ years of Carter Classics Jason Aldean: Full Throttle Tour 2025 Sat Oct 4, 2025 Buy Tickets More Info Sat 04 Oct Jason Aldean: Full Throttle Tour 2025 Papa Roach & Rise Against: Rise of the Roach Tour Sun Oct 5, 2025 Buy Tickets More Info Sun 05 Oct Papa Roach & Rise Against: Rise of the Roach Tour TWENTY ONE PILOTS - THE CLANCY TOUR: BREACH 2025 Fri Oct 10, 2025 Buy Tickets More Info Fri 10 Oct TWENTY ONE PILOTS - THE CLANCY TOUR: BREACH 2025 Jake Owen & Dirty Heads Fri Oct 24, 2025 Buy Tickets More Info Fri 24 Oct Jake Owen & Dirty Heads Pierce The Veil - I Can't Hear You World Tour Thu Oct 30, 2025 Buy Tickets More Info Thu 30 Oct Pierce The Veil - I Can't Hear You World Tour 2026 Premium Season Tickets Wait List Thu Dec 31, 2026 Buy Tickets More Info Multi Day 31 - 31 Dec 2026 Premium Season Tickets Wait List Pantera Sat Sep 13, 2025 Buy Tickets More Info Sat 13 Sep Pantera HARDY: Jim Bob World Tour Sat Sep 20, 2025 Buy Tickets More Info Sat 20 Sep HARDY: Jim Bob World Tour A Day To Remember & Yellowcard - Maximum Fun Tour Sun Sep 28, 2025 Buy Tickets More Info Sun 28 Sep A Day To Remember & Yellowcard - Maximum Fun Tour Lil Wayne: Tha Carter VI Tour Celebrating 20+ years of Carter Classics Thu Oct 2, 2025 Buy Tickets More Info Thu 02 Oct Lil Wayne: Tha Carter VI Tour Celebrating 20+ years of Carter Classics Jason Aldean: Full Throttle Tour 2025 Sat Oct 4, 2025 Buy Tickets More Info Sat 04 Oct Jason Aldean: Full Throttle Tour 2025 Papa Roach & Rise Against: Rise of the Roach Tour Sun Oct 5, 2025 Buy Tickets More Info Sun 05 Oct Papa Roach & Rise Against: Rise of the Roach Tour TWENTY ONE PILOTS - THE CLANCY TOUR: BREACH 2025 Fri Oct 10, 2025 Buy Tickets More Info Fri 10 Oct TWENTY ONE PILOTS - THE CLANCY TOUR: BREACH 2025 Jake Owen & Dirty Heads Fri Oct 24, 2025 Buy Tickets More Info Fri 24 Oct Jake Owen & Dirty Heads Pierce The Veil - I Can't Hear You World Tour Thu Oct 30, 2025 Buy Tickets More Info Thu 30 Oct Pierce The Veil - I Can't Hear You World Tour 2026 Premium Season Tickets Wait List Thu Dec 31, 2026 Buy Tickets More Info Multi Day 31 - 31 Dec 2026 Premium Season Tickets Wait List See More Shows Amp Up Your Experience Enter the VIP Club Exclusive bars, private restrooms, and a private entrance? Say no more! If the exclusive bar doesn’t pull you in, the table service and food & drink will. Our VIP Club upgrade brings a new level of luxury to amphitheaters. View Upgrade Don't Just See It, VIP It First-class treatment. Backstage memories. Handshakes, high-fives and selfies with the artists you love. Make it a once in a lifetime experience with the VIP package. See Packages Grab the best spot Book a parking spot near the ticket gate, and beat the post-show rush on your way out. View Upgrade If You're Not First, You're Last Skip the lines and get inside the venue quickly! Be one of the first into the venue. View Upgrade One Stage. Unbridled Beats. Jason Aldean | October 27, 2023 Nothin' like a country music concert here in West Palm Beach. Jason Aldean knows how to throw a party! Odesza | September 9, 2023 The sounds, the visuals, the drumline... this EDM-duo left our venue buzzin'. Post Malone | July 31, 2023 Fans loved to see Posty rock our stage with his lively energy. Dave Matthews Band | July 28, 2023 This iconic band hits our stage every summer. It's a show you don't want to miss! In Collab With Never Miss a Beat. Or a Show. Concert alerts straight to your inbox. Sign Up This site is protected by reCAPTCHA Enterprise and the Google Privacy Policy and Terms of Service apply. Browse Shows Upgrades Visit Season Tickets Private Events Get in touch iTHINK Financial Amphitheatre 601-7 Sansburys Way West Palm Beach, FL 33411 ithinkampinquiry@livenation.com 561.795.8883 © 2025 Live Nation Worldwide, Inc. Privacy Policy By continuing past this page, you agree to our Terms of Use | Privacy Policy Do Not Sell or Share My Personal Information"
    }
  ]
}