{
  "fuentes": [
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "email": "banquetcord@jacarandadha.com"
    },
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "email": "bookings@jacarandadha.com"
    },
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "email": "info@bowlingalley.com"
    },
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "email": "info@jacarandadha.com"
    },
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "email": "info@jfccineplex.com"
    },
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "email": "membership@jacarandadha.com"
    },
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "email": "reservations@jacarandadha.com"
    },
    {
      "url": "https://jacarandacountryclub.com/contact/",
      "email": "info@jacarandacc.com"
    },
    {
      "url": "https://jacarandacountryclub.com/menus-pricing/",
      "email": "info@jacarandacc.com"
    },
    {
      "url": "https://jacarandacountryclub.com/",
      "email": "info@jacarandacc.com"
    },
    {
      "url": "https://jacarandahotels.com/indian-ocean/contact/",
      "email": "reservations.iobr@jacarandahotels.com"
    },
    {
      "url": "https://jacarandahotels.com/indian-ocean/contact/",
      "email": "sales@jacarandahotels.com"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://www.herecomestheguide.com/wedding-venues/florida/jacaranda-country-club",
      "email": "darcater@aol.com"
    },
    {
      "url": "https://www.herecomestheguide.com/wedding-venues/florida/jacaranda-country-club",
      "email": "info@herecomestheguide.com"
    },
    {
      "url": "https://jacarandacountryclub.com/schedule-a-consultation/",
      "email": "info@jacarandacc.com"
    },
    {
      "url": "https://jacarandagolfclub.com/Golf/Meet-the-Team-Golf-Instruction",
      "email": "amichael@jacarandagolfclub.com"
    },
    {
      "url": "https://jacarandagolfclub.com/Golf/Meet-the-Team-Golf-Instruction",
      "email": "bsienkiewicz@jacarandagolfclub.com"
    },
    {
      "url": "https://jacarandagolfclub.com/Golf/Meet-the-Team-Golf-Instruction",
      "email": "info@jacarandagolfclub.com"
    },
    {
      "url": "https://jacarandagolfclub.com/Golf/Meet-the-Team-Golf-Instruction",
      "email": "kcuervo@jacarandagolfclub.com"
    },
    {
      "url": "https://jacarandacountryclub.com/photos/",
      "email": "info@jacarandacc.com"
    },
    {
      "url": "https://jacarandagolfclub.com/Contact-Us",
      "email": "info@jacarandagolfclub.com"
    }
  ],
  "mails": [
    "amichael@jacarandagolfclub.com",
    "banquetcord@jacarandadha.com",
    "bookings@jacarandadha.com",
    "bsienkiewicz@jacarandagolfclub.com",
    "contact@clubcarwash.com",
    "darcater@aol.com",
    "info@bowlingalley.com",
    "info@herecomestheguide.com",
    "info@jacarandacc.com",
    "info@jacarandadha.com",
    "info@jacarandagolfclub.com",
    "info@jfccineplex.com",
    "kcuervo@jacarandagolfclub.com",
    "membership@jacarandadha.com",
    "reservations.iobr@jacarandahotels.com",
    "reservations@jacarandadha.com",
    "sales@jacarandahotels.com"
  ],
  "nombre_sitio": "jacarandacountryclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jacarandadha.com/contact-us/",
      "text": "Contact Us | Jacaranda Family Club DHA Islamabad Home Jacaranda Heights Restaurants Fine Dine Terrace BBQ Coffee Shop Continental Jacaranda Wok Banquets Imperial Hall Party Hall JFC Arena Lawns The Royal Garden The Radiant Garden Fitness Center Gym Male Gym Female Gym Swimming Pool Male Swimming Pool Female Swimming Pool Kids Swimming Pool Spa Male Spa Female Spa Squash Court Aerobics Lobby & Lounge Cineplex Bowling Corporates Jacaranda Board Room Margalla Board Room Membership Eligibility Criteria Procedure Types Member’s Family Transfer Suspension Visiting Members Reciprocal Clubs Events Careers Contact Us Select Page Contact Us JACARANDA Family CLUB Club Avenue, Sector E, Phase II, P.O. 1531, DHA Islamabad Contact # (051) 111-532-342 Fax: (051) 2311008 info@jacarandadha.com 1-Membership membership@jacarandadha.com EXT: 2611 3-Restaurants bookings@jacarandadha.com EXT: 2683,2670 5-Jacaranda Heights reservations@jacarandadha.com EXT: 2555 7-JFC CINEPLEX info@jfccineplex.com EXT: 2660,2661 2-Sales & Marketing info@jacarandadha.com EXT: 2624 4-Banquets banquetcord@jacarandadha.com EXT: 2626 6-Health & fitness Center info@jacarandadha.com EXT: 2637, 2686 8-JFC Bowling alley info@bowlingalley.com EXT: 2663 Send A Message Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Message * Send JACARANDA FAMILY CLUB Membership Request Form SERVICES Jacaranda Heights Restaurants Banquets Fitness Center Recreations Cineplex Bowling Alley USEFUL LINKS Terrace BBQ Menu Coffee Shop Menu Chinese Restaurant Menu Continental Restaurant Menu Membership Form Request RECIPROCAL CLUBS Carlton Club – London City Club – London Sunset Club – Karachi Creek Club – Karachi Defence Club “J” Sector – Lahore Defence Club “R” Sector – Lahore DeSOM – Lahore Others… FOLLOW US Follow Follow"
    },
    {
      "url": "https://jacarandacountryclub.com/contact/",
      "text": "Contact us at Jacaranda Country Club in Plantation, FL X Facebook Youtube Mail Instagram CALL TO RESERVE YOUR EVENT DATE! (954) 474-8998 MENUS Afternoon Tea Bar Options Weeknight Dinner Buffet Weekend Lunch Buffet Cocktail Hour Specialties Finishing Touches Kosher Packages Weekday Lunch/Brunch Buffet Lite Brunch Buffet Weeknight Sit Down Dinner Weekend Sit Down Lunch Party Packages Weekend Sit Down Dinner Weekend Dinner Buffets Weekday Sit Down Luncheons Teen Menu PRICING SCHEDULE A CONSULTATION PHOTOS GOLF CLUB E-BROCHURE BLOGS CONTACT US Menu Menu Have Questions? -Contact Us! Call (954) 474-8998 for any immediate inquiries. ADDRESS 9200 West Broward Blvd Plantation FL 33324 PHONE Office: (954) 474-8998 Fax: (954) 423-4444 HOURS Sun-Sat: 10am – 6pm Copyright ©2025 - Jacaranda Country Club And Catering - All Rights Reserved. - Enfold Theme by Kriesi Schedule a Consultation Photos Contact Us E-Brochure Scroll to top"
    },
    {
      "url": "https://jacarandacountryclub.com/menus-pricing/",
      "text": "Menus and Pricing | Jacaranda Country Club X Facebook Youtube Mail Instagram CALL TO RESERVE YOUR EVENT DATE! (954) 474-8998 MENUS Afternoon Tea Bar Options Weeknight Dinner Buffet Weekend Lunch Buffet Cocktail Hour Specialties Finishing Touches Kosher Packages Weekday Lunch/Brunch Buffet Lite Brunch Buffet Weeknight Sit Down Dinner Weekend Sit Down Lunch Party Packages Weekend Sit Down Dinner Weekend Dinner Buffets Weekday Sit Down Luncheons Teen Menu PRICING SCHEDULE A CONSULTATION PHOTOS GOLF CLUB E-BROCHURE BLOGS CONTACT US Menu Menu Menus & Pricing Afternoon Tea Bar Options Weeknight Dinner Buffet Weekend Lunch Buffet Cocktail Hours Specialties Finishing Touches Kosher Packages Weekday Lunch / Brunch Buffet Lite Brunch Buffet Weeknight Sit Down Dinner Weekend Sit Down Lunch Party Packages Weekend Sit Down Dinner Weekend Dinner Buffets Weekday Sit Down Luncheons Teen Menu ADDRESS 9200 West Broward Blvd Plantation FL 33324 PHONE Office: (954) 474-8998 Fax: (954) 423-4444 HOURS Sun-Sat: 10am – 6pm Copyright ©2025 - Jacaranda Country Club And Catering - All Rights Reserved. - Enfold Theme by Kriesi Schedule a Consultation Photos Contact Us E-Brochure Scroll to top"
    },
    {
      "url": "https://jacarandacountryclub.com/",
      "text": "Wedding and Events Venue Plantation | Jacaranda Country Club X Facebook Youtube Mail Instagram CALL TO RESERVE YOUR EVENT DATE! (954) 474-8998 MENUS Afternoon Tea Bar Options Weeknight Dinner Buffet Weekend Lunch Buffet Cocktail Hour Specialties Finishing Touches Kosher Packages Weekday Lunch/Brunch Buffet Lite Brunch Buffet Weeknight Sit Down Dinner Weekend Sit Down Lunch Party Packages Weekend Sit Down Dinner Weekend Dinner Buffets Weekday Sit Down Luncheons Teen Menu PRICING SCHEDULE A CONSULTATION PHOTOS GOLF CLUB E-BROCHURE BLOGS CONTACT US Menu Menu Previous Next Creating Memories That Last a Lifetime WEDDINGS, MITZVAHS, QUINCES, ETC. Open Bar Sit Down or Buffet Dinners, Lunches and Brunches Champagne Toast Decorated Cake selection to suit your occasion Hors D’oeuvres 50 colors in table linen and napkins Chiavari Chairs in several different finishes and dozens of cushion colors to choose from. Lighting package featuring lighted ceiling treatments,& LED Up-lighting in 60 colors at no additional charge! ~VIEW OUR PACKAGES CREATE YOUR OWN EVENT! Meetings and Seminars Breakfasts Social Luncheons Dinner Meetings Birthday Parties Graduation Parties Baby & Bridal Showers Retirement Parties Baptism & Communion Luncheons Bris & Baby Namings Cocktail Parties Golf Tournaments Award Banquets ~VIEW MENUS & PRICING LUNCH AT THE GRILLE Serving Tuesday through Sunday 11 am – 3 pm OPEN TO THE PUBLIC! Great selection of Gourmet Sandwiches, Giant Salads, Omelettes, Pastas & Daily Specials served all day starting at $12.95 Sunday Brunch Buffet 11 am – 3 pm All entrees include our Soup and Bread Bar with Two Homemade Soups, Freshly Baked Breads and Flavored Butters Spacious Indoor Dining, Breezy Covered Patios or call for Curbside Pickup 954-474-8998 ~VIEW MENU Read View reviews: in ADDRESS 9200 West Broward Blvd Plantation FL 33324 PHONE Office: (954) 474-8998 Fax: (954) 423-4444 HOURS Sun-Sat: 10am – 6pm Copyright ©2025 - Jacaranda Country Club And Catering - All Rights Reserved. - Enfold Theme by Kriesi Schedule a Consultation Photos Contact Us E-Brochure Scroll to top"
    },
    {
      "url": "https://jacarandahotels.com/indian-ocean/contact/",
      "text": "Hotel Nairobi Indian Ocean Beach Resort Lake Elementaita Lodge Offers Contact Us Check Availability Back to Indian Ocean Beach resort Rooms Restaurants & Bars Conferencing Gallery Contact sales@jacarandahotels.com +254 711 089 000 +254 721 508 000 P.O.Box 14287-00800 Woodvale Close, off Waiyaki Way, Westlands, Nairobi reservations.iobr@jacarandahotels.com +254 709 979 000 P.O. Box 73 â 80400 Ukunda, Diani Beach sales@jacarandahotels.com +254 734 237 333 P.O. Box 66 â 20116 Gilgil Hotel Nairobi Indian Ocean Beach resort Lake Elementaita Lodge Established in 1964, Jacaranda Group of Hotels has established itself as one of the leading, locally founded hotel brands in Kenya. We currently comprise of three properties across the country; Jacaranda Hotel Nairobi, located in Westlands, Jacaranda Indian Ocean Beach Resort, in Diani, and Jacaranda Lake Elementaita Lodge. Jacaranda Group of Hotels operates on values and philosophies of integrity, hard work, professionalism, respect and reliability. P.O. Box 73 â 80400, Ukunda, Diani Beach +254 709 979 000 reservations.iobr@jacarandahotels.com Â© 2025. All rights reserved. Handcrafted with love by Chika b.623"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://www.herecomestheguide.com/wedding-venues/florida/jacaranda-country-club",
      "text": "Jacaranda Country Club Wedding Venue Plantation FL 33324 Start Here Here Comes the Guide Here Comes the Guide Wedding Venues By State By Style Outdoor Elopement Deals Planning Checklists & Timelines Questions to Ask Free Printables Wedding Budget Choosing Vendors Engaged? Start Here Ideas + Inspo Wedding Ideas Curated Venues Real Wedding Galleries Guide Gals Podcast About Us About Us Our Brand Story Staff Our Core Values Join Us Engaged Couples Wedding Venues Venue Business Tips Careers engaged? start here Jacaranda Country Club 9200 West Broward Boulevard \t\t\t • Plantation  • FL  33324 Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Wedding Nature Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Wedding Nature Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Ron Wood Photography Contact Events Department Check My Date VISIT WEBSITE We'd love it if you would mention that you found\n\t\t                            Jacaranda Country Club\n\t\t                            on the Here Comes The Guide website. 954-474-8998 Email Video Prices Capacity Details Map Video Video by Vanessa and Johnny. PRICES: What's this going to cost? Ceremony Fee $595/event and up Ceremony fee varies depending on: Event duration The ceremony fee includes: A 30 minute ceremony Ceremony chairs Six columns Friday & Sunday Indoor | $595 Outdoor | $795 Saturday Daytime Indoor | $595 Outdoor | $795 Saturday Evening Indoor | $695 Outdoor | $895 Package Prices All-Inclusive wedding packages include: Space for the ceremony & reception Tables & Chiavari chairs Dressing suites Buffet or plated dinner Hors d’oeuvres Open bar Champagne toast And more! Meals (when priced separately) $83.95/person and up Customizable menus are available. Service Charge or Gratuity 22% get a custom quote! Capacity Indoors Outdoors Ceremony Seated 200 200 Cocktails, etc. Standing 200 200 Reception Seated 200 200 Meetings Total meeting capacity for this venue is 200. Please contact the venue for capacity information. Venue Details Site Uses All-Inclusive Outdoor Ceremony Ceremony Wedding Receptions LGBTQ+ Friendly Small Wedding Rehearsal Dinner Special Events / Parties Business Functions / Meetings Essential Info Price $ • \n\t\t\t\t\t\t\t\t\t$$ • \n\t\t\t\t\t\t\t\t\t$$$ Catering In-house Alcohol In-house Amplified Music Indoors Outdoors Wheelchair Access Wheelchair accessible Availability Year-round, daily. Venue Type Buildings & other settings available: Golf / Country Club Patio / Deck / Terrace Ballroom Lake Venue Views Peep the views you’ll enjoy from this venue! Forest / Woods Lake Landscaped Grounds Panoramic Wondering what CBA or BYO means? Want more info on our editorial process? Jacaranda Country Club Send an email to Jacaranda Country Club Desired Date Is Your Date Flexible? Yes No Approximate Guest Count Select your best guess Under 25 26–75 76–100 101–125 126–150 151–175 176–200 Over 200 Message We play nice. We promise never to share your info with anyone except Jacaranda Country Club. Your Name Your Email Address Your Phone # Your Preferred Contact Method Email Text Phone Send Email We play nice. We promise never to share your info with anyone except Jacaranda Country Club. Your email is on its way! Keep AN EYE ON YOUR INBOX FOR A RESPONSE FROM Jacaranda Country Club P.S. Don't forget to snap a photo during your venue tour and tag @herecomestheguide for a chance to win $500! Details here Email this venue *Sending your email through the Here Comes The Guide website lets this venue know we sent you! Thank you for your support! Is it love? GET A QUOTE! Wedding Venues > Florida \t\t        Wedding Venues > Fort Lauderdale \t\t        Wedding Venues Find Florida Wedding Venues Search Florida Wedding Venues | Florida Keys | Fort Lauderdale | Fort Myers | Jacksonville / St. Augustine | Miami | Orlando | Palm Beach | Pensacola / Destin / Tallahassee | Tampa / St. Petersburg / Sarasota | Find By Style of Venue | Outdoor Wedding Venues in Florida | Affordable Wedding Venues in Florida \"Best of\" Lists & Ideas for Florida Best of Wedding Venues in Florida | Florida Keys | Fort Lauderdale | Jacksonville / St. Augustine | Miami | Orlando | Palm Beach | Pensacola / Destin / Tallahassee | Tampa / St. Petersburg / Sarasota Even More Florida Goodness Florida Real Weddings Want to recommend a wedding venue in Florida? Please email us at info@herecomestheguide.com . Download our Wedding Checklist Follow Along Wedding Locations Wedding Ideas Real Weddings Choosing Wedding Vendors MyGuide Editorial Process Disclaimer / DCMA Notice Venue Business Education Join Our Venue Directory Link to Us Help Login Contact Here Comes The Guide Back to Top Page last updated: Thu, 10 Jul 25 05:10:29 © 1989 - 2025, Hopscotch Press, Inc. All text is written and copyrighted by Here Comes The Guide. The work on this website is licensed under a Creative Commons Attribution-Noncommercial-No Derivative Works 3.0 United States License. Privacy Policy • Cookie Notice • Do Not Sell My Info"
    },
    {
      "url": "https://jacarandacountryclub.com/schedule-a-consultation/",
      "text": "Schedule a Consultation | Jacaranda Country Club X Facebook Youtube Mail Instagram CALL TO RESERVE YOUR EVENT DATE! (954) 474-8998 MENUS Afternoon Tea Bar Options Weeknight Dinner Buffet Weekend Lunch Buffet Cocktail Hour Specialties Finishing Touches Kosher Packages Weekday Lunch/Brunch Buffet Lite Brunch Buffet Weeknight Sit Down Dinner Weekend Sit Down Lunch Party Packages Weekend Sit Down Dinner Weekend Dinner Buffets Weekday Sit Down Luncheons Teen Menu PRICING SCHEDULE A CONSULTATION PHOTOS GOLF CLUB E-BROCHURE BLOGS CONTACT US Menu Menu SCHEDULE A CONSULTATION Jacaranda Country Club And Catering 9200 West Broward Blvd Plantation FL 33324 Interested in any of our catering or event services? Need information on Golf Tee Times and Tournaments? Please complete this short form and we will contact you. Office (954) 474-8998 Fax (954) 423-4444 ADDRESS 9200 West Broward Blvd Plantation FL 33324 PHONE Office: (954) 474-8998 Fax: (954) 423-4444 HOURS Sun-Sat: 10am – 6pm Copyright ©2025 - Jacaranda Country Club And Catering - All Rights Reserved. - Enfold Theme by Kriesi Schedule a Consultation Photos Contact Us E-Brochure Scroll to top"
    },
    {
      "url": "https://jacarandagolfclub.com/Golf/Meet-the-Team-Golf-Instruction",
      "text": "Meet the Team & Golf Instruction Free Lessons Search Login Register Home Book a Tee Time Golf East Course West Course Golf Rates Meet the Team & Golf Instruction Instructional Videos Stay & Play Which Tee do I Play? Membership Tournament Calendar Groups & Events Tournaments & Outings Weddings & Banquets Explore More Dining Broward Amateur Championship Shop Career Opportunities Blogs FAQ Contact Us MEET THE TEAM & INSTRUCTION GOLF INSTRUCTION ANDREW MICHAEL, PGA General Manager amichael@jacarandagolfclub.com Andrew Michael was elevated to the position of General Manager after a long and successful run in golf operations at Jacaranda. He  joined the team in early 2008 and worked his way up to the Director of Golf position by 2011. He was able to secure his PGA Class A Professional status by 2014. Andrew has taught over 5000 hours of lessons throughout his career and has studied under prestigious golf instructors that helped shaped his approach to teaching the game of Golf. He has worked with numerous Amateur, Collegiate, and Professional Champions. On becoming GM, Andrew says,\" I am truly honored and excited to accept the role of General Manager at Jacaranda Golf Club. It is with great enthusiasm that I look forward to leading our team in providing you with an exceptional experience. We are committed to ensuring that your visit reflects our dedication to unparalleled customer service and top-notch course conditions. We hope you will truly “experience the difference” during your time with us. LESSONS AVAILABLE UPON REQUEST KEVIN CUERVO Director of Golf kcuervo@jacarandagolfclub.com Kevin Cuervo started as Jacaranda Golf Club's Director of Golf in October, 2024. Prior to joining Jacaranda, Kevin held a number of positions at the highly-regarded Trump National Doral. His most recent being Golf Operations Manager. Kevin is enrolled in the PGA Professional Golf Management Program, having completed  his Level 1 coursework- PAT, (Playing Ability Test), in May of 2023 The South Florida native is a graduate of Cornell University with a B.S. in Appled Economics and Management, FInance. On joining Jacaranda, Kevin says, \" I am thrilled to help lead this top-notch golf operation and work hard-in-hand with its amazlingly talented management team. It's an exciting time to be at Jacaranda with our owners preparing to invest heavily in the facility in order to take it to the next level. Jacaranda was already a star in the world of semi-private courses in Broward. After renovations, the sky's the limit!\" LESSONS AVAILABLE UPON REQUEST BRYAN SIENKIEWICZ, PGA First Assistant Golf Professional bsienkiewicz@jacarandagolfclub.com $50 per half hour | $90 per hour Multiple Player Lessons $50 per hour (per person) 9 Hole Playing Lesson $160 After Graduating from Broward College with a A.S. Degree in Criminal Justice in 2012, Bryan made the jump into the Golf Business and never looked back. Originally starting at Pine Island Ridge Country Club as a Bag staff attendant, he worked his way up to holding multiple jobs at the facility including Ranger, Starter, and Pro Shop Assistant. Bryan joined the Jacaranda team in 2013 as a Bag staff attendant but quickly worked his way into the Lead Assistant Professional/Merchandiser role. He is a PGA Class A Professional and enjoys working with the newest generation of golfers. “I like to Teach Juniors, it is a real passion of mine to grow the game through our youth. With that being said I also work seasonally for NSU University School as the Head Coach for Girls Varsity Golf team and assistant coach for the Boys Varsity Team.” “My method of teaching is very casual. I like to take golf terminology, and relate it to everyday experiences to help golfers comprehend faster as well as hold information easier. This allows players to take their learnings to the course and enjoy this game that I have for over 25 years.” The golf swing can be as easy as this mathematical equation 2+2= ___. Let’s solve this simple problem together. ELEVATE YOUR GAME Whether you are an experienced amateur or a beginner looking to break into the sport, our golf instructors cater their lessons to your skill level. Our General Manager, Andrew Michael, PGA and his staff of golf professionals work on the fundamentals of the game, including putting, chipping, pitching, sand play, full swings, and much more. Want to take your golf game to the next level? Call Jacaranda today at (954) 472-5836 for more information about golf lessons to suit your individual needs. Jacaranda Golf Club 9200 West Broward Blvd. Plantation, FL 33324 Phone: 954.472.5836 Fax: 954.472.7794 info@jacarandagolfclub.com Pro Shop Hours **Range Hours May Vary** Monday: 6:30AM - 5:30PM Tuesday: 6:30AM - 5:30PM Wednesday: 6:30AM - 5:30PM Thursday: 6:30AM - 5:30PM Friday: 6:30AM - 5:30PM Saturday: 6:30AM - 5:30PM Sunday: 6:30AM - 5:30PM Quick Links Book A Tee Time Leave a Review Directions Join Our Email List Career Opportunities Site Map Owned By Copyright 2025 by Total e Integrated : Terms Of Use : Privacy Statement"
    },
    {
      "url": "https://jacarandacountryclub.com/photos/",
      "text": "Wedding Photos in Plantation, FL | Jacaranda Country Club X Facebook Youtube Mail Instagram CALL TO RESERVE YOUR EVENT DATE! (954) 474-8998 MENUS Afternoon Tea Bar Options Weeknight Dinner Buffet Weekend Lunch Buffet Cocktail Hour Specialties Finishing Touches Kosher Packages Weekday Lunch/Brunch Buffet Lite Brunch Buffet Weeknight Sit Down Dinner Weekend Sit Down Lunch Party Packages Weekend Sit Down Dinner Weekend Dinner Buffets Weekday Sit Down Luncheons Teen Menu PRICING SCHEDULE A CONSULTATION PHOTOS GOLF CLUB E-BROCHURE BLOGS CONTACT US Menu Menu JACARANDA COUNTRY CLUB PHOTOS A place to celebrate life’s milestones. Load more ADDRESS 9200 West Broward Blvd Plantation FL 33324 PHONE Office: (954) 474-8998 Fax: (954) 423-4444 HOURS Sun-Sat: 10am – 6pm Copyright ©2025 - Jacaranda Country Club And Catering - All Rights Reserved. - Enfold Theme by Kriesi Schedule a Consultation Photos Contact Us E-Brochure Scroll to top"
    },
    {
      "url": "https://jacarandagolfclub.com/Contact-Us",
      "text": "Contact Us Free Lessons Search Login Register Home Book a Tee Time Golf East Course West Course Golf Rates Meet the Team & Golf Instruction Instructional Videos Stay & Play Which Tee do I Play? Membership Tournament Calendar Groups & Events Tournaments & Outings Weddings & Banquets Explore More Dining Broward Amateur Championship Shop Career Opportunities Blogs FAQ Contact Us EXPERIENCE THE DIFFERENCE! Jacaranda Golf Club is South Florida’s premier golf destination offering two championship courses each rated 4 stars by Golf Digest. Our picturesque courses are suited for any skill level but don’t get lost in their beauty and charm, as you will soon discover the unique challenges each one presents. Both courses are woven into the natural tropical landscape that includes tranquil ponds and blue lagoons while you hear the gentle rustling of palm trees. With tight bunkering along the greens, tricky doglegs, and water hazards throughout, we’re sure you’ll find our courses both demanding and rewarding. After your round, stop into one of our two on-site Restaurants , The Grille Room or The 19th Hole. Whether you’re looking for a quick bite to eat, a leisurely lunch, or enjoying a beverage with friends, our friendly service staff will attend to your every need. We offer Golf Packages for those who are vacationing in the area, and we can host your next Corporate Event or Tournament . Get in touch with a member of our golf operations specialists today. We look forward to speaking with you soon. Contact Us Jacaranda Golf Club 9200 West Broward Blvd. Plantation, FL 33324 Phone: 954.472.5836 Fax: 954.472.7794 info@jacarandagolfclub.com Pro Shop Hours **Range Hours May Vary** Monday: 6:30AM - 5:30PM Tuesday: 6:30AM - 5:30PM Wednesday: 6:30AM - 5:30PM Thursday: 6:30AM - 5:30PM Friday: 6:30AM - 5:30PM Saturday: 6:30AM - 5:30PM Sunday: 6:30AM - 5:30PM Quick Links Book A Tee Time Leave a Review Directions Join Our Email List Career Opportunities Site Map Owned By Copyright 2025 by Total e Integrated : Terms Of Use : Privacy Statement"
    }
  ]
}