{
  "fuentes": [
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://brixsodacompany.com/get-in-touch/",
      "email": "info@brixsodacompany.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "aleach@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "amestdagh@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "bbulmer@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "cgumbinger@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ecarlo@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "esoto@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "gmikaiel@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "info@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jallinson@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jbell@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jgoldschmidt@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "kmitura@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ldegon@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lhickox@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lsharrit@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "mcorrigan@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "pmartin@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "slindblad@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "swiechens@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "tchalifourdrahman@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "visitorinformation@visitjacksonville.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "brianna@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "kylie@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "lindsey@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "shirley@teamjackfoundation.org"
    }
  ],
  "mails": [
    "aleach@visitjacksonville.com",
    "amestdagh@visitjacksonville.com",
    "bbulmer@visitjacksonville.com",
    "brianna@teamjackfoundation.org",
    "cgumbinger@visitjacksonville.com",
    "ecarlo@visitjacksonville.com",
    "esoto@visitjacksonville.com",
    "gmikaiel@visitjacksonville.com",
    "info@brixsodacompany.com",
    "info@inzmo.com",
    "info@reception-plus.de",
    "info@visitjacksonville.com",
    "jallinson@visitjacksonville.com",
    "jbell@visitjacksonville.com",
    "jgoldschmidt@visitjacksonville.com",
    "kmitura@visitjacksonville.com",
    "kylie@teamjackfoundation.org",
    "ldegon@visitjacksonville.com",
    "lhickox@visitjacksonville.com",
    "lindsey@teamjackfoundation.org",
    "lsharrit@visitjacksonville.com",
    "mcorrigan@visitjacksonville.com",
    "pmartin@visitjacksonville.com",
    "shirley@teamjackfoundation.org",
    "slindblad@visitjacksonville.com",
    "swiechens@visitjacksonville.com",
    "tchalifourdrahman@visitjacksonville.com",
    "visitorinformation@visitjacksonville.com"
  ],
  "nombre_sitio": "jacksonvillebeachbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://brixsodacompany.com/get-in-touch/",
      "text": "Get in Touch - Contact Us | Brix Soda Co. Home Where the heart is Who We Are Who I am Find Brix Fountain Syrups Bottled Soda Photo Gallery Get In Touch Get in touch FAQ’s Menu Menu Twitter Facebook Instagram Get in Touch \" * \" indicates required fields Name * First Last Company Phone * Email * Message * CAPTCHA Email This field is for validation purposes and should be left unchanged. Contact Details Brix Soda Company E-Mail: info@brixsodacompany.com Address: 1601 Steele Ave SW Grand Rapids, MI 49507 Phone: 616.698.8828 © Copyright 2024 - Brix Soda Co. All rights reserved. Twitter Facebook Instagram Scroll to top"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "text": "Meet the Team | Visit Jacksonville Skip to content Newsletter Trip Planner 0 Saved 77 ° F Navigation Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Stay in Touch with Everything Jacksonville View Our 2025 Visitor Guide Home Who We Are Meet the Team Meet the Team Share Get in touch with the Visit Jacksonville team. See our full staff listing below. Get to know the friendly and helpful team at Visit Jacksonville. Click through for contact information for every member of our team including sales, destination experience, marketing, media, and more. Executive Team Michael Corrigan President & CEO Charged with marketing, selling and promoting Jacksonville’s image, driving visitation and boosting the economy through tourism. Office Phone: (904) 421-9150 Send An Email Sarina Wiechens Chief Operating Officer Oversees the daily operations and financial components of Visit Jacksonville to implement the vision and mission of the organization and CEO/President. Office Phone: (904) 421-9152 Send An Email Katie Mitura Chief Marketing Officer Oversees the Marketing team to implement the goals of the President and CEO for Visit Jacksonville pertaining to marketing Jacksonville as a premier destination. Office Phone: (904) 421-9160 Send An Email Jeanne Goldschmidt Director of Convention Sales Oversees the Convention Sales team to implement the goals of the President and CEO of Visit Jacksonville pertaining to growth of bookings and support within the destination. Office Phone: (904) 421-9164 Send An Email Courtney Gumbinger Director of Destination Experience Oversees the Destination Experience team to implement the goals of the President and CEO to provide exceptional customer service to both individual visitors as well as group and meeting attendees. Office Phone: (904) 421-9151 Send An Email Administration Becky Bulmer Assistant Director of Finance Responsible for the financial oversight and integrity of financial processes for the organization. Oversees all accounting functions. Office Phone: (904) 421-9189 Send An Email Eva Soto Accounting Manager Responsible for financial oversight, payment processing, financial statements and all financial aspects of the business. Office Phone: (904) 421-9155 Send An Email Laurie Degon Senior Analytics Manager Responsible for data analytics and reporting to develop marketplace analysis of trends in tourism as well as economic impact forecasts. Office Phone: (904) 421-9178 Send An Email Lisa Sharrit Administration Manager Responsible for human resources and insurance components for Visit Jacksonville. Liaison to the Board of Directors. Office Phone: (904) 421-9181 Send An Email Convention Sales Bob Doering Senior National Accounts Manager Responsible for promoting Jacksonville as a premier destination for Corporate, State and National Association conferences and events. Office Phone: (904) 798-9123 Send An Email Emma Carlo National Accounts Manager Responsible for promoting Jacksonville as a premier destination to the Social, Military, Religious and Fraternal markets. Office Phone: (904) 421-9172 Send An Email Sydney Lindblad Sales Development Manager Responsible for promoting Jacksonville as a premier destination to meetings of less than 200 total room nights and sporting events of all sizes. Office Phone: (904) 421-9182 Send An Email Gaby Mikaiel Sales and Administration Manager Responsible for administrative support, grant process management and travel coordination for the sales team and President. Office Phone: (904) 421-9159 Send An Email Destination Experience Paloma Martin Senior Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners, and acts as liaison with local hoteliers and businesses. Office Phone: (904) 421-9176 Send An Email Jorie Allinson Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners and oversees visitor center staffing. Office Phone: (904) 421-9154 Send An Email Kerry Weatherhead Destination Experience Coordinator Responsible for assisting visitors contacting or entering centers or as a part of a conference or group with requests for information, maps and brochures, referrals and trip planning services. Office Phone: (904) 798-9111 Send An Email Seymour Jax Responsible for showing you all there is to do and see in Jacksonville. Seymour often roams the streets and is set up at special events. Stop by, say hi, take a selfie… Meet Seymour Marketing Andrea Mestdagh Senior Marketing Communications Manager Responsible for marketing, communication and public relations initiatives to promote and market Jacksonville as a premier leisure destination to key markets. Office Phone: (904) 421-9169 Send An Email Tess Chalifour-Drahman Meetings Marketing Manager Responsible for marketing initiatives and strategies to entice conventions and groups to book their meetings in Jacksonville. Office Phone: (904) 421-9162 Send An Email Joey Bell Community Outreach Manager Responsible for managing outreach initiatives and growing relationships in the local community with all tourism partners and business entities. Office Phone: (904) 421-9157 Send An Email Autumn Leach Marketing Communications Manager Responsible for Visit Jacksonville’s website, promotions and other major marketing initiatives. Office Phone: (904) 421-9166 Send An Email Lauren Hickox Marketing Manager Responsible for assisting with the research and development of marketing materials, website content, app content, email content, and various marketing initiatives. Office Phone: (904) 421-9183 Send An Email Tucker Responsible for exploring Jacksonville and posing for photos. Follow his adventures on Instagram! Meet Tucker Want to join our team? Click here to see the open positions! Here to Help The Jacksonville Information Authority Visit Jacksonville is your go-to resource as you begin to plan your next Jacksonville story. Read More Your Next Meeting Destination Read More Industry Resources Learn about the Power of Tourism Read More More About Visit Jacksonville Destination Experience Hub Read More Meet the Sales Team Read More Meet the Visit Jacksonville Insiders Read More Visit Jacksonville Board of Directors Read More Research & Development Information Read More Jacksonville Area History Read More JAX Facts Read More Jacksonville Accolades Read More Stay in Touch with Everything Jacksonville Sign Up View Our 2025 Visitor Guide Download Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Visit Jacksonville 100 North Laura Street Suite 120 Jacksonville, FL 32202 (800) 733-2668 Industry Resources Newsletter Sign-Up Meet the Team Board of Directors Job Postings Privacy Policy ©2025 Visit Jacksonville, All Rights Reserved Cookies Policy This website uses cookies to optimize your visitor experience. Accept or Learn more Quick Search Search Location Map"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * First E-Mail Datenschutz Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "text": "Board & Staff | Team Jack Foundation Follow Follow Follow Follow U Search  Shop w News w Blog Donate Search for: About Us About Us Our Mission Our History Jack Hoffman Board & Staff Financials Contact Us Our Impact Projects & Progress We Fund Nebraska Childhood Brain Tumor Program Scientific Advisory Board Apply for TJF Grant Research Articles Brain Cancer About Brain Cancer What is DIPG? Brain Cancer Facts Cancer Awareness Months Brain Tumor Awareness Month Childhood Cancer Awareness Month Family Resources Events Takedown the Tumor Gala Golf Classic An Evening with Henry Winkler Miles for Team Jack Radiothon Texas Golf Broken Chair Trophy View All Events Get Involved Fundraise Workplace Giving Host an Event Birthday Fundraiser Partner Memorials Give Our Sponsors Volunteer Heroes Donate Shop Blog Select Page About Us Team Jack Board and Staff Team Jack Board Members The Team Jack Foundation is a nonprofit under the leadership of a volunteer board of directors consisting of community and business leaders from around Nebraska and the country. The board meets monthly to discuss budgets, events and other news about the fight against childhood brain cancer. The expert guidance of our volunteer board consistently drives Team Jack to new heights. Rex Burkhead Rex Burkhead is a retired running back of the National Football League. Originally drafted by Cincinnati in the sixth round (190th overall) of the 2013 NFL Draft, Burkhead spent four seasons with the New England Patriots, before signing with the Texans prior to the 2021 season. He was a key offensive contributor each season for the Patriots and was a member of the Patriots 2018 Super Championship team, scoring the last two touchdowns during the thrilling overtime AFC Championship against the Kansas City Chiefs. Burkhead played college football at the University of Nebraska, which is where his story with Team Jack began. Rex has played an important part to the development and ongoing success of the Team Jack Foundation. Not only does Burkhead serve as a board member on the Foundation’s board of directors, but he was instrumental in the Foundation’s inception itself. Team Jack was formed to raise funds for pediatric brain cancer research. Its namesake is Jack Hoffman, a 18-year-old from Nebraska who has been battling the disease for most of his life. Hoffman and Burkhead formed an unlikely friendship when Burkhead was a star player at Nebraska that has continued to this day. Hoffman even won a “Best Moment” ESPY award when he entered Nebraska’s 2013 spring game and scored a 69-yard touchdown while sporting No. 22, Burkhead’s number during his college days. The two even met President Barack Obama together at the White House in 2013. Rex is from Plano, TX, where he currently resides with this wife, Danielle, and two sons, Jett and Steel. Karen Carson Karen Carson is a Co-founder of Fat Brain Toys, a retailer and manufacturer of educational toys and games. Karen’s introduction to the toy industry came about at the suggestion of her then 10-year old son, Adam. In the Fall of 2002, after finding it difficult to locate specialty toys online, her son suggested that she and her husband Mark build their own website to better serve the growing demand for toys online. Carson accepted the challenge from her son and thus began a new career in the toy industry. Since 2002, Fat Brain Toys has grown into one of the largest online toy stores in the country. Recognizing the importance of a true multi-channel experience, Fat Brain Toys has since expanded into brick & mortar retail, opening retail store experiences in Omaha, Nebraska and Overland Park, Kansas. In addition to the company’s direct-to-consumer efforts, the company also designs and wholesales it’s own line of products to over 2,000 retailers around the world. Fat Brain Toys is a frequent benefactor to a number of non-profit organizations that support the needs of children, including: Team Jack Foundation, Omaha Children’s Hospital Foundation, Royal Family Kids, The Toy Bank, and many others. Karen has been married to her husband and business partner, Mark, since 1992, and lives in Elkhorn, Nebraska. Karen and Mark have three children, Adam, Makenzie, and Jenna. Scott Fangman Scott Fangman has 20+ years of industry experience and is the Director of Business Development at Wealth Enhancement Group where he leads outreach to RIAs across the US. He was most recently as the Business Development Officer – M&A for Advisor Seekers, leading their markets and sales team. Scott joined Wealth Enhancement Group because of the shared purpose, mission, and values. Scott previously held regional leadership roles at TD Ameritrade Institutional, where he was recognized multiple times for his accomplishments in surpassing company goals. A Nebraska native, Scott currently resides in Omaha, NE with his wife Anne and their 2 (teenage!) children. When not working, Scott enjoys hiking and reading. Scott also serves on the Board of Directors for the Team Jack Foundation raising funds and awareness for pediatric brain cancer research – his son is a survivor. Dr. Kari Galyen Dr. Kari is originally from Pierce, NE. She went to the University of Nebraska. Dr. Kari Galyen is a general practice family physician. Dr. Galyen and her husband, Dr. Jim Galyen, own and operate Sunny Meadow Medical Clinic in Norfolk, Nebraska. Originally from Pierce, NE, Dr. Galyen attended the University of Nebraska Medical Center where she received her medical doctor (MD) degree. She then completed a dual internal medicine/family practice residency in Omaha and Kearney, NE. Dr. Galyen is a strong advocate for increased funding for child brain cancer research and was a guest speaker at the 2013 Team Jack Foundation Gala. She has a strong commitment to helping improve treatment options and overall survivorship for children facing the disease. Dr. Galyen is married to Dr. Jim Galyen and together they live in Atkinson, NE with their four children, Ainsley, Brody, Blake and Luke. Brianna Hoffman Brianna Hoffman is a pharmacist at West Holt Medical Services in Atkinson, NE. She is also the Co-Founder and Board Chair of the Foundation. To contact: Brianna@TeamJackFoundation.org Kenneth Maxwell Kenneth Maxwell is the co-founder and Vice President of Advertising for Proxibid.com, a privately held Nebraska based e-commerce Company serving more than a million buyers, and thousands of businesses, auction companies, and non-profit organizations worldwide. In his tenure with the company he has led multiple teams responsible for the design and development of their real-time auction platform, and more recently, led the expansion of the company’s marketing team to provide advertising and creative services to Proxibid and their clients. Prior to Proxibid, Kenneth was the creative director for another Nebraska based startup – Leftbid.com, and was also a professional artist, selling original art through Anderson O’Brien Fine Art Gallery in Nebraska. Kenneth studied fine art at the University of Nebraska – Lincoln, and abroad in Florence, Italy. He is classically trained in painting and sculpture and graduated from UNL with a degree in Fine and Performing Arts. Ken resides in Omaha with his wife Lynn, and two children, Kate and Harrison – as well as two black Labrador retrievers, Cira and Chloe, AKA – “the meatballs”. Tiffany Miller Tiffany Miller serves as Deputy General Counsel for First Bank & Trust, Brookings, SD. She has practiced in the banking and financial services industry for over 16 years, specializing in contract negotiation and compliance. Outside of the office, Tiffany is involved in a number of community activities. She serves on the board of directors for Downtown Sioux Falls, Inc., and is on the Sioux Falls Area Chamber of Commerce Community Appeals Committee. Tiffany is motivated to serve the Foundation by the grueling and potentially harmful treatments currently used to treat pediatric brain cancer patients and the dire need for more funding to support pediatric cancer research. In honor of Jack and all children who are called to the front lines in the battle against cancer, Tiffany is committed to the Team Jack mission of raising awareness and funds for pediatric cancer research. She and her family are proud to Take A Stand in the fight against brain cancer together with the Team Jack Foundation. Tiffany and her husband, Dr. Nate Miller, are parents to two young boys, Noah and Luke. Janae Simard Janae Simard is a Registered Dental Hygienist with Family and Implant Dentistry in Lincoln, NE, since 1997. Janae is an originating member of the Team Jack Foundation board and is committed to helping the organization fund pediatric brain cancer research. She was appointed secretary for the Team Jack Foundation in 2013. Janae and her husband Robby live in Omaha, Nebraska with their two boys, Eli and Luke. The Simard family is dedicated to helping the Team Jack Foundation improve treatment for children with brain tumors. Having endured their own family adversity with one of their own children, Janae is a compassionate leader who is known for being a “hands on” servant leader for the Foundation. Janae is active in her childrens’ school and devotes much of her spare time working with children. She enjoys traveling, scuba-diving and family activities. Mark Walz Mark was born and raised in Lincoln, Nebraska. He graduated Summa Cum Laude from Nebraska Wesleyan University in 1988 with a Bachelor of Science Degree in Economics and an emphasis in Accounting. Mark began his professional career in 1988 as an independent auditor with the international accounting firm of Touche Ross & Co. (now Deloitte) in their Lincoln, Nebraska office. His client focus was primarily the banking and insurance industries. In May of 1991, Mark left Deloitte to become the Accounting Manager at Farmers Mutual Insurance Company of Nebraska and has been employed in various positions of increasing responsibility with Farmers Mutual since that time. He was promoted to Controller in 1997; Treasurer in 1999; Vice President and Treasurer in 2002; Senior Vice President, Treasurer and Chief Financial Officer in 2006; Executive Vice President, Treasurer and Chief Operating Officer in 2009; President, Treasurer and Chief Operating Officer in 2010; President and Chief Executive Officer in 2014; and Chairman, President and Chief Executive Officer in 2015. Mark is a member of both the American Institute of Certified Public Accountants and the Nebraska Society of Certified Public Accountants. Mark serves on the Board of Directors of Farmers Mutual Insurance Company of Nebraska, National Association of Mutual Insurance Companies, Nebraska Property and Liability Insurance Guaranty Association, Nebraska Chamber of Commerce, United Way, Team Jack, Junior Achievement, and the US Bank Advisory Board. *Andy Hoffman (Board Chairman 2013 - 2021) Courageous. Passionate. Gregarious. Brave. Selfless. Spiritual. Unwavering. These are just a few of the words used to describe our Team Jack Foundation co-founder, Andy Hoffman. Tributes have poured in from around the country following Andy’s passing on Monday, March 1. Andy was shockingly diagnosed with glioblastoma multiforme, a rare and very aggressive cancer, after having a seizure while running on the Cowboy Trail, in his hometown of Atkinson, Nebraska, in July 2020. Even after getting this devastating news, Andy was more determined than ever to find ways to raise money for Team Jack. And fast, while he was still able. Following his diagnosis, the Team Jack Foundation launched the “Twice the Fight” campaign as a way to show support for both Jack and Andy Hoffman’s brain cancer battles. One of Andy’s first visions to raise money for Team Jack was to sell t-shirts, and this time selling “Twice the Fight” t-shirts saw nearly 3,000 sold for over $65,000 raised. Earlier in 2020, Andy worked hard to fulfill his New Year’s resolution and finished writing his first book, “Yards After Contact” which details the family’s experience during Jack’s fight. It was published in October 2020 and has been a huge success. From the beginning, Andy made one thing clear with his book: 100% of the proceeds for the book sales go to Team Jack and, Team Jack would own the copyright to the book. To date, over 2,500 books have been sold, raising nearly $80,000 for Team Jack. In the book, Andy writes: “This book is the mission statement for the Team Jack Foundation, a Nebraska business that tirelessly works daily to improve brain cancer treatment in its region and nationally fund child brain cancer research. I hope you can open this book and know Jack and what his foundation stands for.” In early December, both ESPN and BigTen Networks produced shows giving an update on the Hoffmans’ life with cancer. The ESPN E:60 story aired as part of programming highlighting the importance of cancer research during ESPN’s 14th consecutive V Week on Dec.1-12. Andy spoke with Chris Connelly about his fight and his hopes for the future of those fighting childhood brain cancer. “This is going to sound screwy, but it’s been a blessing,” he said. “We’re supposed to thank God for the challenges that he gives us, and I’ve prayed the thank-you prayer. Thank you, God, for giving me brain cancer. Because he knows what he’s doing. And you don’t.” Check off another chance for Andy to raise awareness of this disease. Andy always looked to seize every opportunity to raise awareness for childhood brain cancer and fund research from some of the brightest research minds in the country. Although the Hoffmans knew the research they were funding may not benefit their son Jack, he did it for all the families down the road that will receive the horrible diagnosis of pediatric brain cancer. Andy remained hopeful even when faced with the grim nature of his prognosis. Andy worked hard to squeeze more life into his 42 years than most get in a lifetime. He did a couple of bucket list items, including a New Mexico elk hunt with his kids, his wife, and brothers during the last months of his life. He kept his unwavering faith and spent every moment possible with his family. In mid-February, his condition progressed, and his fight ended on Monday, March 1, where he peacefully passed away at home surrounded by his loving family. He is survived by his wife Brianna, children Jack, Ava and Reese, parents Gary and Karen Hoffman of Spencer, brothers Tony (Amy) Hoffman of Crofton and Michael (Jacky) Hoffman of Spencer, sister Julia (Chris) Jones of Tellico Plains, TN, parents-in-law Kerry and Bonnie Stiner of Burke, SD, sister-in-law Tiffany (Nate) Miller of Sioux Falls, SD, brother-in-law Kollin (Sarah) Stiner of Lakeville, MN, nephews Nathan Hoffman of Spencer, Hudson and Hayden Hoffman of Spencer, Luke Jones of Cleveland, OH, Matt and Nate Jones of Clarksburg, MD, Noah, Luke and Graham Miller of Sioux Falls, SD, and Karson Stiner of Lakeville, MN, nieces Alison (Justin) Wegenke of Fort Collins, CO, Samantha (Cody) Kahl of Grand Island, NE, Lauryn and Amelia Hoffman of Spencer, and Isabel and Nora Stiner of Lakeville, MN. He was also excited to be a Great Uncle to Will and Wren Wegenke and Alton Kahl. He was preceded in death by his brother Luke Hoffman. The Team Jack Foundation is committed to working harder than ever to ensure Andy’s legacy shines, and his mission grows. He had big ideas and big dreams for the foundation, and we will focus on making those a reality. He is irreplaceable and his smile and energy will be missed. But we will always follow the path he set to be a success. And fight on in his honor. How lucky we all are to have known him. * * Tragically, Jack’s dad, Andy Hoffman, was diagnosed with brain cancer (glioblastoma) in July of 2020. He battled for seven months before passing away from the disease. The Team Jack Foundation is committed to upholding Andy’s legacy by working harder than ever to fund the cure for childhood brain cancer. Team Jack Staff Team Jack’s caring, driven staff is dedicated to ending childhood brain cancer by pushing Team Jack forward every day. Kylie Dockter, Executive Director Kylie (Tielke) Dockter joined the Foundation in August 2013 as the first full time employee for the Foundation and is excited to be part of the fight against pediatric brain cancer. Kylie received her Bachelor of Science degree in Journalism: Public Relations in December 2009 from the University of Nebraska at Kearney with a minor in Political Science and has strong qualifications in management, marketing and sales through educational and job experience. She has been involved in the non-profit sector for over thirteen years. Prior to the Foundation, Kylie was the Director of Marketing and then Executive Director of a non-profit that benefits nearly 50 non-profits in the Denver, CO metro area. In addition to management skills, she assisted in planning large scale events to raise money for these 50 non-profits. She joined the Team Jack Foundation in August 2013 as the Chief Development Director and is now the Executive Director of the Foundation. Working with a Foundation that has such an impact on children and children’s lives has truly been a career dream for Kylie, so she is very excited to join such a prestigious and impactful Foundation to help with their goals. She was born and raised in Atkinson, NE and is married to her husband Stuart Dockter who is originally from North Dakota and together they have a daughter, Graesyn, and a son, Hayes. To contact: kylie@teamjackfoundation.org Lindsey Nemetz, Director of Marketing Lindsey (Mlnarik) Nemetz, a native of Clearwater, Nebraska, earned her degree in Business Administration from Nebraska Wesleyan University in 2001. While at NWU, she was a member of the Prairie Wolves women’s basketball and softball teams from 1997 to 2001. Lindsey now lives in Atkinson with her husband, Chris, and their five children: Maci, Drake, Avery, Landri, and Brooke. After a six-year career in property and casualty insurance, Lindsey shifted her focus to raising her family. In October 2013, she began working for the Team Jack Foundation on a limited part-time basis. Over time, her role and passion for the mission grew, leading her to become the Foundation’s Director of Marketing in November 2018. She is deeply dedicated to helping find a cure for childhood brain cancer. To contact: lindsey@teamjackfoundation.org Shirley Rossman, Event Coordinator Shirley Rossman joined the Team Jack Foundation in August 2020, assisting with donation processing and merchandise shipping. Before that, she spent her career as an elementary school teacher, retiring from West Holt Public Schools in 2020. A lifelong resident of Atkinson, Shirley and her husband, Bruce, are proud parents of four grown daughters which includes a set of triplets, and grandparents to ten grandchildren. To contact: shirley@teamjackfoundation.org Make an impact through your inbox News, upcoming events and research updates delivered straight to your inbox. About Us Our Mission Jack Hoffman Board & Staff Fund Allocation Financials Our Impact Scientific Advisory Board Sponsored Grants Research Articles Brain Cancer Family Resources Cancer Awareness Months Get Involved Fundraise Give Events Our Sponsors Volunteer Follow Follow Follow Follow Follow © 2025 Team Jack Foundation. POB 607, 47640 US Highway 20, STE 2, Atkinson, NE, 68713. All Rights Reserved. Team Jack Foundation, Inc. is exempt from federal income tax under section 501(c)3, ID Number 46-2301134, of the internal revenue code. All contributions to the Foundation are tax deductible. Privacy Policy • Contact"
    }
  ]
}