{
  "fuentes": [
    {
      "url": "https://www.coastalluxurypv.com/jacksonville-country-club/",
      "email": "service@coastalluxurypv.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "aleach@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "amestdagh@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "bbulmer@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "cgumbinger@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ecarlo@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "esoto@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "gmikaiel@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "info@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jallinson@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jbell@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jgoldschmidt@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "kmitura@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ldegon@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lhickox@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lsharrit@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "mcorrigan@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "pmartin@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "slindblad@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "swiechens@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "tchalifourdrahman@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "visitorinformation@visitjacksonville.com"
    },
    {
      "url": "https://www.jacksonvillecc.com/contact-information",
      "email": "chadedwards98@yahoo.com"
    },
    {
      "url": "https://www.jacksonvillecc.com/contact-information",
      "email": "jccchef@jacksonvillecc.com"
    },
    {
      "url": "https://www.jacksonvillecc.com/contact-information",
      "email": "jccdining@jacksonvillecc.com"
    },
    {
      "url": "https://www.jacksonvillecc.com/contact-information",
      "email": "michaelanderson@jacksonvillecc.com"
    },
    {
      "url": "https://www.jacksonvillecc.com/contact-information",
      "email": "thoaglin@yahoo.com"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://www.jacksonville.com/story/lifestyle/home-garden/2019/08/19/garden-club-of-jacksonville-hires-first-executive-director-97-years-after-founding/4430124007/",
      "email": "beth.cravey@jacksonville.com"
    },
    {
      "url": "https://www.jacksonville.com/story/lifestyle/home-garden/2019/08/19/garden-club-of-jacksonville-hires-first-executive-director-97-years-after-founding/4430124007/",
      "email": "info@gardenclubofjacksonville.org"
    },
    {
      "url": "https://jamessprunt.edu/",
      "email": "ebsmith@jamessprunt.edu"
    },
    {
      "url": "https://www.hiddenhillsgc.com/contactus/",
      "email": "info@hiddenhillsgc.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/queen-s-harbour-yacht-country-club/who-we-are",
      "email": "donald.beardsley@invitedclubs.com"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/queen-s-harbour-yacht-country-club/who-we-are",
      "email": "shannon.mcquarry@invitedclubs.com"
    }
  ],
  "mails": [
    "aleach@visitjacksonville.com",
    "amestdagh@visitjacksonville.com",
    "bbulmer@visitjacksonville.com",
    "beth.cravey@jacksonville.com",
    "cgumbinger@visitjacksonville.com",
    "chadedwards98@yahoo.com",
    "contact@clubcarwash.com",
    "donald.beardsley@invitedclubs.com",
    "ebsmith@jamessprunt.edu",
    "ecarlo@visitjacksonville.com",
    "esoto@visitjacksonville.com",
    "gmikaiel@visitjacksonville.com",
    "info@gardenclubofjacksonville.org",
    "info@hiddenhillsgc.com",
    "info@visitjacksonville.com",
    "jallinson@visitjacksonville.com",
    "jbell@visitjacksonville.com",
    "jccchef@jacksonvillecc.com",
    "jccdining@jacksonvillecc.com",
    "jgoldschmidt@visitjacksonville.com",
    "kmitura@visitjacksonville.com",
    "ldegon@visitjacksonville.com",
    "lhickox@visitjacksonville.com",
    "lsharrit@visitjacksonville.com",
    "mcorrigan@visitjacksonville.com",
    "michaelanderson@jacksonvillecc.com",
    "pmartin@visitjacksonville.com",
    "service@coastalluxurypv.com",
    "shannon.mcquarry@invitedclubs.com",
    "slindblad@visitjacksonville.com",
    "swiechens@visitjacksonville.com",
    "tchalifourdrahman@visitjacksonville.com",
    "thoaglin@yahoo.com",
    "visitorinformation@visitjacksonville.com"
  ],
  "nombre_sitio": "jacksonvilleccnc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.coastalluxurypv.com/jacksonville-country-club/",
      "text": "New Pool Construction near Jacksonville Country Club - Coastal Luxury Outdoors Follow Us on Instagram LOCATIONS SERVICED REFERRAL PROGRAM Service Request 904-543-2626 Pool Services Free 3D Designs Download our Pool Cost Guide New Residential Pool Types of Pools Gunite vs. Fiberglass vs. Vinyl Liner Pools What Is The Lifespan of a Pool? Residential Pool Remodels Pool Renovation Pool Resurfacing & Replastering Pool Remarciting Pool Retiling Pool Equipment Installation Residential Pool Maintenance and Repairs Weekly Pool Cleaning Residential Pool Maintenance Pool Filter Cleaning Green to Clean Residential Pool Repairs Pool Inspections Pool Lighting Pool Fencing Commercial Pool Services Commercial Pool Maintenance Commercial Pool Remodels Commercial Pool Repairs Financing Selling Your Pool Route Outdoor Living Decking, Driveways, and Pavers Paver Options Pool Deck Drains Screen Enclosures Summer Kitchens Water Features, Firepits, Athletics and Other Galleries Residential Pool and Spa Build Residential Pool Remodel Commercial Pool Remodel Pool Plaster Options Outdoor Living Maintenance and Repair FAQs About Our Story Meet the Team Blog Referral Program News Pool Construction Customer Reviews Locations Serviced CAREERS Contact Us Custom Swimming Pools at Jacksonville Country Club A Prestigious Neighborhood North Florida's Jacksonville Golf & Country Club features a gracious low country-style clubhouse nestled on gently rolling terrain. Along the Northeast Coast of Florida, this idyllic setting is surrounded by abundant tree cover, tranquil freshwater lakes, and thriving wildlife. Jacksonville Golf & Country Club was founded in June 1987 with the acquisition of 732 acres for $10.4 million, naming the area \"Jacksonville Country Club.\" The groundbreaking ceremony for the Club's 18-hole golf course, designed by golf course architect Clyde Johnston with player consultant Fuzzy Zoeller, took place in the Spring of 1988. Hunt Club Road's brick entryway was completed in June 1989, setting a prestigious tone for the neighborhood. In 1989, Jacksonville Golf & Country Club welcomed its first residents as a private, member-owned club. Exquisite Pools Built in Jacksonville Country Club Take a moment to imagine yourself in your new pool, floating lazily or doing laps in your exercise pool. When you’re finished, you can climb up to your outdoor kitchen, make a drink, and even cook breakfast. You can also lie on your tanning ledge and catch some healing rays. A firepit can be lit after the sun goes down, and you can entertain friends and family with food from your BBQ or firepit. Coastal Luxury Outdoors can help you realize your vision. We have been providing leading swimming pool services to Florida residents for many years. With this experience, we have gained a thorough understanding of the latest design trends that ensure your custom pool looks stylish and contemporary. Contact Us New Pool Construction and Existing Pool Remodeling New Residential Pool Building a new pool offers homeowners the unique opportunity to customize their outdoor living space from the ground up, tailoring every aspect of the pool's design, size, and features to match their vision and lifestyle. This process involves selecting from a variety of pool types, materials, and innovative technologies to create a personalized oasis that complements the home's architecture and the natural landscape. Here at Coastal Luxury Outdoors we offer free 3D design consultations to help you transform your vision into reality. Residential Pool Remodels Remodeling an existing pool allows homeowners to breathe new life into their current setup. Whether it's updating the pool's aesthetics with modern finishes and materials, enhancing functionality with the latest energy-efficient equipment, or adding luxurious features like waterfalls, spas, or automated cleaning systems, remodeling can transform an outdated pool into a modern retreat. Both building a new pool and remodeling an existing one require careful planning, design expertise, and a commitment to quality craftsmanship. However, each route provides a pathway to achieving a dream outdoor space that increases property value, encourages outdoor living, and creates a haven for relaxation and entertainment. Check out our full gallery featuring new pool creations and before and after images of remodeled pools . Top Trending Outdoor Features Our Clients Love in Jax Country Club Our elite pools are the best of the best, built to the specifications of our customers, no matter how complex those might be. From tropical resort like pools complete with caves, slides, waterfalls, and fountains. Include a bridge or an infinity spa. With so much to choose from our gallery options must be seen to be believed. Your pool will be planned, designed, and built by experts. Landscape architects and structural engineers combine to bring your dream to life – whatever you’ve envisioned for your backyard, we know exactly how to make it happen. There’s no pool too complex, and no project too ambitious. Coastal Luxury Outdoors has been building incredible pools in Florida for over 40 years, making thousands of dreams come true. If you’d like to be next, contact us today! How To Get Started? The best way to fully transform your outdoor space is through our custom outdoor living design and installation. We love adding thoughtful touches and unique features that will make your backyard both beautiful and functional. These outdoor living design services will make your home the place for entertaining, relaxing, and spending time with friends and family. Start the process and contact us . We'll require a property survey stamped by a licensed surveyor Review your 3D design You’ll review a state-of-the-art 3D presentation of the design We'll provide a quote and a detailed proposal. Our estimates will be the most detailed proposals you will find! Let the building start! Once we have a signed contract, we'll begin the construction process About Coastal Luxury Outdoors Coastal Luxury Outdoors is your premier local swimming pool contractor with decades of experience across Florida and Georgia. Our expertise and experience will ensure that you can build and enjoy the pool you've always wanted. Remodeling and renovating pools is what we do best. Our local experts at Coastal Luxury Outdoors can transform your pool into your ideal outdoor living space, from tile and coping to replastering and decking. And our maintenance services are second to none! Get in touch with us today to schedule a consultation! We offer a full spectrum of pool services across the following locations and more: Queens Harbor , Rivertown , Fernandina , Mandarin , Palencia , Plantation Oaks , Orange Park , Seven Pines , Bay Meadows , Sawgrass , Nocatee , E-Town , Coastal Grove , Neptune Beach , Julington Creek , and Tamaya . Where Vision and Possibility Meet Call Now Home About Pool Services Outdoor Living Galleries Selling Your Pool Route Blog Contact Us Contact Us: 904-543-2626 | service@coastalluxurypv.com We at Coastal Luxury Outdoors are leaders in pool construction, repair & maintenance in Jacksonville & St. Augustine, FL. Schedule an inspection & estimate today! Working Hours: Open Monday through Friday: 9:00am - 4:30pm Saturday and Sunday: Accepting Calls 9:00am - 4:30pm, In-Person Visits By Appointment Only Locations (Satellite location, by appointment only): 7750 Bayberry Rd, Jacksonville, FL  32256 (Headquarters) 967 Shetter Ave, Jacksonville Beach, FL 32250 (Satellite) 320 High Tide Dr. Suite 101, St. Augustine, FL 32080 (Satellite) 1845 Town Center Blvd Suite 205, Fleming Island, FL 32003 (Satellite) CPC License # 1460776 Coastal Luxury Outdoors © 2025 All Rights Reserved Privacy Policy Sitemap Accessibility Statement Pool Services Free 3D Designs Download our Pool Cost Guide New Residential Pool Types of Pools Gunite vs. Fiberglass vs. Vinyl Liner Pools What Is The Lifespan of a Pool? Residential Pool Remodels Pool Renovation Pool Resurfacing & Replastering Pool Remarciting Pool Retiling Pool Equipment Installation Residential Pool Maintenance and Repairs Weekly Pool Cleaning Residential Pool Maintenance Pool Filter Cleaning Green to Clean Residential Pool Repairs Pool Inspections Pool Lighting Pool Fencing Commercial Pool Services Commercial Pool Maintenance Commercial Pool Remodels Commercial Pool Repairs Financing Selling Your Pool Route Outdoor Living Decking, Driveways, and Pavers Paver Options Pool Deck Drains Screen Enclosures Summer Kitchens Water Features, Firepits, Athletics and Other Galleries Residential Pool and Spa Build Residential Pool Remodel Commercial Pool Remodel Pool Plaster Options Outdoor Living Maintenance and Repair FAQs About Our Story Meet the Team Blog Referral Program News Pool Construction Customer Reviews Locations Serviced CAREERS Contact Us"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "text": "Meet the Team | Visit Jacksonville Skip to content Newsletter Trip Planner 0 Saved 76 ° F Navigation Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Stay in Touch with Everything Jacksonville View Our 2025 Visitor Guide Home Who We Are Meet the Team Meet the Team Share Get in touch with the Visit Jacksonville team. See our full staff listing below. Get to know the friendly and helpful team at Visit Jacksonville. Click through for contact information for every member of our team including sales, destination experience, marketing, media, and more. Executive Team Michael Corrigan President & CEO Charged with marketing, selling and promoting Jacksonville’s image, driving visitation and boosting the economy through tourism. Office Phone: (904) 421-9150 Send An Email Sarina Wiechens Chief Operating Officer Oversees the daily operations and financial components of Visit Jacksonville to implement the vision and mission of the organization and CEO/President. Office Phone: (904) 421-9152 Send An Email Katie Mitura Chief Marketing Officer Oversees the Marketing team to implement the goals of the President and CEO for Visit Jacksonville pertaining to marketing Jacksonville as a premier destination. Office Phone: (904) 421-9160 Send An Email Jeanne Goldschmidt Director of Convention Sales Oversees the Convention Sales team to implement the goals of the President and CEO of Visit Jacksonville pertaining to growth of bookings and support within the destination. Office Phone: (904) 421-9164 Send An Email Courtney Gumbinger Director of Destination Experience Oversees the Destination Experience team to implement the goals of the President and CEO to provide exceptional customer service to both individual visitors as well as group and meeting attendees. Office Phone: (904) 421-9151 Send An Email Administration Becky Bulmer Assistant Director of Finance Responsible for the financial oversight and integrity of financial processes for the organization. Oversees all accounting functions. Office Phone: (904) 421-9189 Send An Email Eva Soto Accounting Manager Responsible for financial oversight, payment processing, financial statements and all financial aspects of the business. Office Phone: (904) 421-9155 Send An Email Laurie Degon Senior Analytics Manager Responsible for data analytics and reporting to develop marketplace analysis of trends in tourism as well as economic impact forecasts. Office Phone: (904) 421-9178 Send An Email Lisa Sharrit Administration Manager Responsible for human resources and insurance components for Visit Jacksonville. Liaison to the Board of Directors. Office Phone: (904) 421-9181 Send An Email Convention Sales Bob Doering Senior National Accounts Manager Responsible for promoting Jacksonville as a premier destination for Corporate, State and National Association conferences and events. Office Phone: (904) 798-9123 Send An Email Emma Carlo National Accounts Manager Responsible for promoting Jacksonville as a premier destination to the Social, Military, Religious and Fraternal markets. Office Phone: (904) 421-9172 Send An Email Sydney Lindblad Sales Development Manager Responsible for promoting Jacksonville as a premier destination to meetings of less than 200 total room nights and sporting events of all sizes. Office Phone: (904) 421-9182 Send An Email Gaby Mikaiel Sales and Administration Manager Responsible for administrative support, grant process management and travel coordination for the sales team and President. Office Phone: (904) 421-9159 Send An Email Destination Experience Paloma Martin Senior Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners, and acts as liaison with local hoteliers and businesses. Office Phone: (904) 421-9176 Send An Email Jorie Allinson Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners and oversees visitor center staffing. Office Phone: (904) 421-9154 Send An Email Kerry Weatherhead Destination Experience Coordinator Responsible for assisting visitors contacting or entering centers or as a part of a conference or group with requests for information, maps and brochures, referrals and trip planning services. Office Phone: (904) 798-9111 Send An Email Seymour Jax Responsible for showing you all there is to do and see in Jacksonville. Seymour often roams the streets and is set up at special events. Stop by, say hi, take a selfie… Meet Seymour Marketing Andrea Mestdagh Senior Marketing Communications Manager Responsible for marketing, communication and public relations initiatives to promote and market Jacksonville as a premier leisure destination to key markets. Office Phone: (904) 421-9169 Send An Email Tess Chalifour-Drahman Meetings Marketing Manager Responsible for marketing initiatives and strategies to entice conventions and groups to book their meetings in Jacksonville. Office Phone: (904) 421-9162 Send An Email Joey Bell Community Outreach Manager Responsible for managing outreach initiatives and growing relationships in the local community with all tourism partners and business entities. Office Phone: (904) 421-9157 Send An Email Autumn Leach Marketing Communications Manager Responsible for Visit Jacksonville’s website, promotions and other major marketing initiatives. Office Phone: (904) 421-9166 Send An Email Lauren Hickox Marketing Manager Responsible for assisting with the research and development of marketing materials, website content, app content, email content, and various marketing initiatives. Office Phone: (904) 421-9183 Send An Email Tucker Responsible for exploring Jacksonville and posing for photos. Follow his adventures on Instagram! Meet Tucker Want to join our team? Click here to see the open positions! Here to Help The Jacksonville Information Authority Visit Jacksonville is your go-to resource as you begin to plan your next Jacksonville story. Read More Your Next Meeting Destination Read More Industry Resources Learn about the Power of Tourism Read More More About Visit Jacksonville Destination Experience Hub Read More Meet the Sales Team Read More Meet the Visit Jacksonville Insiders Read More Visit Jacksonville Board of Directors Read More Research & Development Information Read More Jacksonville Area History Read More JAX Facts Read More Jacksonville Accolades Read More Stay in Touch with Everything Jacksonville Sign Up View Our 2025 Visitor Guide Download Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Visit Jacksonville 100 North Laura Street Suite 120 Jacksonville, FL 32202 (800) 733-2668 Industry Resources Newsletter Sign-Up Meet the Team Board of Directors Job Postings Privacy Policy ©2025 Visit Jacksonville, All Rights Reserved Cookies Policy This website uses cookies to optimize your visitor experience. Accept or Learn more Quick Search Search Location Map"
    },
    {
      "url": "https://www.jacksonvillecc.com/contact-information",
      "text": "Contact Information | jcc-1 top of page 1/3 Jacksonville Country Club Member Login Home Calendar Facilities Pool Tennis Location Contact Information Dining Menus Dining Areas Party Planning Golf Mens Golf Ladies Golf Reciprocal Clubs Membership Photo Gallery More Use tab to navigate through the menu items. Jacksonville Country Club Contact Information Jacksonville Country Club P.O Box 1235 100 Country Club Rd. Jacksonville, IL 62650 ​ Mike Anderson- General Manager &   PGA Golf Professional E- michaelanderson@jacksonvillecc.com P- 217-245-7717 Amy Rivers- Dining Room Manager E-​ jccdining@jacksonvillecc.com P- 217-245-2134 Charles Rivers - Executive Chef E​- jccchef @jacksonvillecc.com P- 217-245-2134 Chad Edwards- Golf Course Superintendent E​- chadedwards98@yahoo.com P- 217-245-9819 Success! Message received. Send © 2017 Jacksonville Country Club bottom of page"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://www.jacksonville.com/story/lifestyle/home-garden/2019/08/19/garden-club-of-jacksonville-hires-first-executive-director-97-years-after-founding/4430124007/",
      "text": "After 97 years, Garden Club hires first executive director News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals HOME-GARDEN After 97 years, Garden Club hires first executive director Beth Reese Cravey beth.cravey@jacksonville.com The Garden Club of Jacksonville has been led by its own members since founder Ninah Cummer and 20 friends organized in 1922 to help beautify the community. Almost 100 years later, the club has grown to at least 800 members and recently hired its first executive director — communications and nonprofit veteran Denise Reagan — and expanded its goals beyond beautification. Reagan and the governing board will have an open house Sept. 10 to discuss the club's future with the public. \"We will use our collective voice to champion green spaces, encourage effective tree planting, build access to fresh fruits and vegetables, protect the health of the St. Johns River and promote sustainability,\" Reagan said. \"These are some of the goals that emerged from the strategic planning process. Our members enjoy getting their hands dirty on community projects like these.\" The club's expanded view stems from a \"thorough strategic planning process\" last fall that was funded by a grant from the Jessie Ball duPont Fund, she said. The club has offered educational programs, demonstrations and youth classes but is adding more evening and weekend events to be \"more inclusive and accessible to working parents and young professionals,\" Reagan said. A new membership program also will be introduced that will provide discounts to club events and other perks. \"We want to collaborate with partners that share our mission and find those who want to join us as we donate our time and talent to build a better and more beautiful city,\" she said. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. Club President Bobi McGinnis said Reagan's background made her the board's choice to lead the organization into the future. \"Denise embodies all the qualities we were looking for in an executive director,\" she said. \"She has developed lifelong relationships throughout the Jacksonville community and across the country that will help the Garden Club reach a more diverse audience.\" A Jacksonville native, Reagan worked at newspapers and websites in six cities before returning home 13 years ago to be an editor at The Florida Times-Union. She later served as editor of Folio Weekly, communications director at the Museum of Contemporary Art Jacksonville and senior manager of public relations at Brunet García Advertising. She was also an adjunct professor at the University of Florida College of Journalism and Communications, her alma mater. Reagan shares the club's love of gardening and green space. She and her daughter planted a backyard garden with dozens of vegetables, fruits and herbs and she visits gardens and parks in the Jacksonville area and while traveling. \"I have a first-hand appreciation of how green spaces can build community and sustain the environment,\" she said. \"This knowledge fuels my desire to expand Jacksonville’s green spaces and increase access to fresh fruits and vegetables through community gardens. These projects can change lives. \"Green spaces help give a city its identity,\" she said. \"The Garden Club wants to underscore just how important these spaces are to the health and well-being of Jacksonville and the impact we all have on the natural world.\" The initial group founded by Cummer, a local civic leader and philanthropist, proved so popular that subgroups, called garden circles, were established throughout Jacksonville. Now there are 31 circles, each with 15 to 55 members, who meet monthly from October to May at the club's Riverside headquarters or in their neighborhoods. Members do not have to live in Jacksonville. \"The circles emphasize different areas of interest and meet in different regions of the city. The Garden Club is the umbrella organization for all of those circles and the new membership levels we are offering,\" Reagan said. \"The … club welcomes anyone who has a love of gardening, the environment and natural world.\" Early on the club focused on civic projects, city planning and the creation and revitalization of city parks. Members helped preserve many of the city’s ancient live oak trees, replaced many sycamore trees with live oaks and, along with philanthropist Jessie Ball duPont, rescued the historic Treaty Oak, according to the club website. Members raised money to buy land on the St. Johns River and construct their original clubhouse, which was destroyed by fire, according to the club website. In 1948, the Club Room was built, including a large fireplace, a brass chandelier and a small kitchen and in 1958 the grand ballroom was constructed, featuring floor-to-ceiling windows, six crystal chandeliers and a stage. The campus, located on Riverside Avenue near the Cummer Museum, also includes a courtyard, huge catering kitchens, offices and storage space and is available for rent for corporate retreats, business lunches, weddings and other events. Beth Reese Cravey: (904) 359-4109 Executive Director Denise Reagan and The Garden Club of Jacksonville's governing board will have an open house 11 a.m. to 1 p.m. Sept. 10 to discuss the nonprofit’s future. The club is at 1005 Riverside Ave., Jacksonville, FL 32204. Fore information call (904) 355-4224, email info@gardenclubofjacksonville.org or go to gardenclubofjacksonville.org . To learn more Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Legal Notices Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper NIE Jobs Real Estate Classifieds Pay Your Ad Bill Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.jacksonville.com. All rights reserved."
    },
    {
      "url": "https://jamessprunt.edu/",
      "text": "James Sprunt Community College Give Questions Search Apply About Our College President’s Message Presidential Search Board of Trustees College Leadership Mission, Vision, Values, Goals, & Accreditation Institutional Effectiveness Foundation Campus Safety Campus Directions Employee Directory Human Resources Employment Opportunities Title IX Consumer Information Admissions & Aid Spartan Accelerate Next NC Scholarship Steps to Apply NC Residency New Student Orientation Tuition and Fees Registrar Financial Aid Scholarships Veteran Affairs Work Study Program Nursing Applications Student Services Student Services Division Academic Calendar Access To Achievement Campus Bookstore Library Services Counseling / Disability Student Organizations WIOA Transportation Services Student Support Services Transcript Request Academics Programs of Study College Catalog Associate Degree Programs Apprenticeship Diploma Programs Certificate Programs Collaborative Programs Distance Learning Career & College Promise Early College High School Centro Educativo Latino Programas en Español Recursos y Becas Centro Educativo Latino FAQ Workforce Development Occupational / Short-Term Training Upcoming Classes College and Career Readiness Small Business Center Commercial Kitchen Hydroponics Smart Farm Transcript Requests Apprenticeship Campus Toolbox 2025-2026 Student Handbook 2024 Annual Report Office 365 Academic Calendar Watermark Campus Bookstore Concourse Course Catalog Curriculum Courses Distance Learning Inclement Weather Just Ask Tech Support Moodle NC Community Colleges Request a JSCC Representative Self-Service Weave Fall Course Book Sparty’s Cafe Give Questions Search Apply A Legacy of Leadership JSCC President Jay Carraway to Retire in February 2026 Search Survey Late Start Courses Available! It’s not too late to enroll in Fall Semester! Course Schedule Workforce Development A life-long learning partnership between education and industry. Upcoming Classes Join Our Family. Build Your Future. We’re here for you request information Let’s do this apply now jSCC Programs explore academics Workforce development short-term training Need Course Information? Click Here (910) 275-6170 Plan your future Apply for Academic Programs Current Academic Programs Register for Short-Term Training Time to Plan create your tomorrow ​​JSCC offers comprehensive programs for both financial aid and scholarships to assist students in meeting educational expenses. Financial aid is available to fill the “gap” between the total cost of education and the amount our students can contribute. Scholarships are provided yearly by the NCCC Systems Office from state, corporate, and private sponsors to assist students. Apply for Financial Aid and Scholarships JSCC Happenings Explore News and Events This is desktop version of grid news post. News A LEGACY OF LEADERSHIP: JSCC PRESIDENT JAY CARRAWAY TO RETIRE IN FEBRUARY 2026 News SUMMER 2025 JAMES SPRUNT COMMUNITY COLLEGE HONORS LIST RELEASED News JAMES SPRUNT COMMUNITY COLLEGE AWARDED $416,545 TO SUPPORT FIRST-GENERATION, LOW-INCOME, AND STUDENTS WITH DISABILITIES THROUGH TRIO STUDENT SUPPORT SERVICES This is mobile version of grid news post. News A LEGACY OF LEADERSHIP: JSCC PRESIDENT JAY CARRAWAY TO RETIRE IN FEBRUARY 2026 2 events found. Today Upcoming Upcoming Select date. 40th Annual Golf Tournament Sep 18 All day 40th Annual Golf Tournament JSCC 8-Day Tour Sep 14 September 14, 2026 - September 21, 2026 JSCC 8-Day Tour Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file View All Events View All News Holt Mercer // Agri-Business Technology I am graduating with an Associates in Ag-Business, and I am going straight to the workforce with the help of all my teachers here at JSCC! Edith Alejo // Office Administration Diploma James Sprunt Community College has helped me incorporate my Spartan Skills in the workforce. As situations arise in my current occupation, I am better equipped to respond.” Landen Kennedy // Associate in Arts James Sprunt Community College is an incredibly accepting environment. There is a sense of family on campus. I truly believe that JSCC embodies their slogan, “Join Our Family. Build Your Future.” Edit this column for background image. Learning. We provide high quality opportunities and necessary support services to help all students develop critical thinking skills and achieve their educational and employment goals. Partnership. We develop partnerships with schools, business and industry, and community organizations to meet the needs of the 21st century workforce. Integrity. We uphold honesty, ethical behavior, and respect in pursuit of an atmosphere of transparency and accountability. Diversity. We value an educational environment that attracts, nurtures, and supports a diverse faculty, student, and staff community. Innovation. We strive to embrace an atmosphere of creativity and innovation for our students, faculty, and staff. 133 James Sprunt Drive P.O. Box 398 Kenansville, NC 28349 (910) 296-2400 | ebsmith@jamessprunt.edu ©2025 James Sprunt Community College Privacy Policy Join The Family! Request Information James Sprunt Community College is an Equal Opportunity Employer. The College prohibits discrimination against any person (including staff, faculty or student body) on the basis of race, color, national origin, sex, disability, religion, political affiliation, sexual orientation, gender identity, veteran status, genetic information, or age. If you need assistance or accommodations, please contact 910-296-2400. For corrections to this site or for issues with web accessibility, please email mturner@jamessprunt.edu. Menu Spring Enrollment! CLOSE"
    },
    {
      "url": "https://www.hiddenhillsgc.com/contactus/",
      "text": "Contact Us - Hidden Hills Golf Club Skip to main content Skip to primary sidebar Skip to footer Home Tee Times Golf Course Details Rates Rules & Information Golf Shop Junior Golf Hills Pass Get Hills Pass Member Login Lessons Events Weddings Banquets Golf Outings Upcoming Events Hills Grill Partners Contact Job Opportunities Contact Us E-Club Sign Up Send a Gift The Jacksonville Championship Hidden Hills Golf Club Jacksonville, FL Book My Tee Time! Contact Us Contact Info Hidden Hills Golf Club 3901 Monument Rd. Jacksonville, FL 32225 Phone: (904) 620-0910 Email: info@hiddenhillsgc.com Pro Shop Hours Mon-Sun | 7 a.m. – 6 p.m. Practice Range Hours Sun & Mon | 6 a.m. – 6 p.m. Tue – Sat | 6 a.m. – 7 p.m. Clubhouse Hours Sun, Mon | 7 a.m. – 6 p.m. Tue, Wed, Thu | 7 a.m. – 6 p.m. Friday | 7 a.m. – 9 p.m. Saturday | 7 a.m. – 6 p.m. Golf Staff Wayne Ulmer, PGA Head PGA Professional Ted Hopkins, PGA Professional Emeritus Patrick Libby PGA Assistant We would like to hear from you! Have a question or comment for us? We’ll be happy to help. Just fill out the form below and we’ll get back to you with the answers you need. Or call us at 904-620-0910. Sorry - your browser does not support iframes. Primary Sidebar Contact Form Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone No. * Comments Website Submit Footer Visit Us 3901 Monument Rd. Jacksonville, FL 32225 Follow Us Contact Us (904) 641-8121 info@hiddenhillsgc.com Copyright © 2025 Hidden Hills Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.invitedclubs.com/clubs/queen-s-harbour-yacht-country-club/who-we-are",
      "text": "Who We Are | Queen's Harbour Yacht & Country Club | Jacksonville, FL | Invited × Thank you for visiting our site. Please review our Privacy Policy . We use cookies on our site and collect other information pursuant to our Privacy Policy. By continuing to use our site, you consent to our Privacy Policy and data collection practices. OK Skip to Content Opens in new tab Member Login Benefits Finder Opens in new tab Careers Queen's Harbour Yacht & Country Club Main Site Navigation Who We Are Golf Dining Membership Tournaments & Events Join Now Book A Tee Time Login - Opens in new tab Menu Who We Are Our Team Calendar Directions & Hours Golf Golf Course Dining Membership Tournaments & Events Weddings Meetings & Corporate Events Tournaments & Outings Event Rooms Contact Us Opens in new tab Member Login Benefits Finder Opens in new tab Careers Home Who We Are Our Team Calendar Directions & Hours Enjoy Your Best Life at Queen's Harbour Welcome and thank you for your interest in our Club. Join us and enjoy the many benefits and privileges of club life, as well as the lifelong friendships and fond memories you'll create here. No distractions, no interruptions, just quality family time, business networking and resort-style living – right in your backyard. Schedule A Tour Enjoy The Best Of All Worlds Queen's Harbour provides its Members with the best of all worlds including the surrounding freshwater yacht basin and Intracoastal waterway. The beautiful low country clubhouse, with its portico and sweeping verandas, combines Florida elegance with casual informality. Attractively positioned to overlook the lush natural surroundings and the 76-slip marina, the charming Harbour View Dining Room, The King's Tavern and The Queen's Parlor and Compass Board Room accommodate the business and social needs of our Members. Club amenities include lighted tennis courts, swimming pool, clubhouse dining, complimentary use of our private meeting and dining rooms with full-service catering and event planning and exclusive social and fun-filled family events. Recognized for Environmental Excellence Queen’s Harbour has retained its designation as a \"Certified Audubon Cooperative Sanctuary\" through the Audubon Cooperative Sanctuary Program for Golf Courses, an Audubon International program. Our golf was designated as a Certified Audubon Cooperative Sanctuary in 2002 and is one of over 900 courses in the world to hold certification from Audubon International. The Audubon Cooperative Sanctuary Program for Golf Courses, endorsed by the United States Golf Association, provides information and guidance to help golf courses preserve and enhance wildlife habitat and protect natural resources. Club Events Whether you’re part of an active family or you’re a busy professional with a passion for sports and social activities, we provide facilities and features to meet all your needs. With exceptional programming, business and social events, Members build lifelong relationships and develop a network of connections that lead to personal fulfillment and invaluable family memories. Tournaments Join your fellow Members for fun and competitive Club-hosted tournaments. This is Club spirit at its finest. Networking Build your network of business and social connections at our special Member events. Our Members include local professionals, civic and community leaders and other influential people to enhance your circle of friends. Kids & Family We offer programs for kids of all ages and their families. From sports teams and leagues to special dining events and fun activities, we have something for every member of your family. Enriching Programs Our programs are designed to enrich your life with cultural, educational and business-oriented events to match your interests. Enjoy guest speakers, professional seminars and special Member clubs and events. Holidays We enjoy celebrating holidays at the Club. Watch our calendar for special traditions and events, as well as holiday dining features. We’re also ready to help you host the perfect party with catering for any occasion. DB Donald  Beardsley General Manager Contact Me Contact Me About Donald + Close Donald  Beardsley information modal DB Donald  Beardsley General Manager Serving since 2020 Donald .Beardsley Donald .Beardsley Contact Me About Donald Don has been GM for 4 years and enjoys leading the team at Queen's Harbour Yacht & Country Club.After attending LaSalle University, he began his golf management career working for Invited in the Philadelphia market. After Invited sold the Philadelphia contracts, he managed golf facilities in Pennsylvania, Florida and Alabama, then returning to Pennsylvania. Along this journey, he learned from and met some of the greatest mentors and members. Being a PGA member for over 25 years, he has been fortunate to be nominated as a golf professional of the year and resort merchandiser of the year. He was instrumental in starting a junior golf program for inner-city youths in York, Pennsylvania, called York Youth Links, which still exists today.Utilizing hands-on leadership, Don has had great success in his management career, and he looks forward to using his experience and knowledge to make the member experience the best it can be. Contact Me SM Shannon McQuarry Membership Director Contact Me 904-656-6997 Contact Me + Close Shannon McQuarry information modal SM Shannon McQuarry Membership Director Serving since 2025 904-656-6997 Shannon.McQuarry 904-656-6997 Shannon.McQuarry Contact Me Contact Me Join the Community Membership Learn the benefits of membership at Queen's Harbour and start experiencing the very best of Jacksonville and beyond. Explore Membership Close Contact form for technical problems modal Contact form for technical problems. Report A Technical Problem Page URL Technical Problem* Submit Who We Are Golf Dining Membership Host An Event Contact Us Queen's Harbour Yacht & Country Club Opens in new window 1131 Queens Harbor Blvd Jacksonville, FL \r\n                                32225 1 904-220-2118 ClubCorp on facebook ClubCorp on instagram Privacy Policy Terms of Use Invited Clubs ClubLine Investors Technical Problems? © 2025 Invited (ClubCorp) All Rights Reserved."
    }
  ]
}