{
  "fuentes": [
    {
      "url": "https://www.rosenaquatic.com/about-the-rosen-aquatic-fitness-center/",
      "email": "info@rosenaquatic.com"
    },
    {
      "url": "https://www.rosenaquatic.com/about-the-rosen-aquatic-fitness-center/",
      "email": "mmiller@dev.rosenhotels.com"
    },
    {
      "url": "https://www.monroecounty-fl.gov/1326/Jacobs-Aquatic-Center",
      "email": "jac@standguardaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "aaron@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "alex@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "alison@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "becky@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "blair@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "chad@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "dan@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "danh@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "dylan@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "jason@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "jeff@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "paris@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "suzanne@machineaquatics.com"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "email": "tanya@machineaquatics.com"
    },
    {
      "url": "https://www.jacobsaquaticcenterkeylargo.com/rentals",
      "email": "jac@standguardaquatics.com"
    },
    {
      "url": "https://www.monroecounty-fl.gov/Directory.aspx?did=194",
      "email": "ballard-lindsey@monroecounty-fl.gov"
    },
    {
      "url": "https://aquaticinformatics.com/contact-us/get-in-touch/",
      "email": "info@aquaticinformatics.com"
    },
    {
      "url": "https://aquaticliving.co.uk/pages/contact",
      "email": "info@aquaticliving.co.uk"
    },
    {
      "url": "https://perfectaquatics.com/pages/contact-us",
      "email": "perfect_aquatics_gif_opt_100x@2x.webp"
    },
    {
      "url": "https://perfectaquatics.com/pages/contact-us",
      "email": "info@perfectaquatics.co.uk"
    },
    {
      "url": "https://www.jacobsaquaticcenterkeylargo.com/",
      "email": "jac@standguardaquatics.com"
    }
  ],
  "mails": [
    "aaron@machineaquatics.com",
    "alex@machineaquatics.com",
    "alison@machineaquatics.com",
    "ballard-lindsey@monroecounty-fl.gov",
    "becky@machineaquatics.com",
    "blair@machineaquatics.com",
    "chad@machineaquatics.com",
    "dan@machineaquatics.com",
    "danh@machineaquatics.com",
    "dylan@machineaquatics.com",
    "info@aquaticinformatics.com",
    "info@aquaticliving.co.uk",
    "info@perfectaquatics.co.uk",
    "info@rosenaquatic.com",
    "jac@standguardaquatics.com",
    "jason@machineaquatics.com",
    "jeff@machineaquatics.com",
    "mmiller@dev.rosenhotels.com",
    "paris@machineaquatics.com",
    "perfect_aquatics_gif_opt_100x@2x.webp",
    "suzanne@machineaquatics.com",
    "tanya@machineaquatics.com"
  ],
  "nombre_sitio": "jacobsaquaticcenterkeylargo.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.rosenaquatic.com/about-the-rosen-aquatic-fitness-center/",
      "text": "About Us | Rosen Aquatic & Fitness Center Orlando, FL | International Drive Donate MENU MENU About Us About Us Mission Statement Location & Facility Hours Live Stream. Powered By Accurate Swim Timing Meet The Team Meet Our Board Amenities Endless Pool Blog Policies Memberships Guest Pass Donate Donate Sponsors Cardboard Boat Race Fitness and Wellness Fitness and Wellness Amenities Fitness Classes CPR Classes Personal Training (Powered By FP Impulse) Aquatics Aquatics Swim Lessons Amenities Contact Back 8422 International Drive Orlando, FL 32819 Media (407) 996.3444 Lessons View Classes and Details Membership Access Your Account Events Calendar and Information Rentals Book with Us About The Rosen Aquatic & Fitness Center An Extraordinary Past “I remember arriving at the center one day and finding some Special Olympians hovering about,” said Harris Rosen. “One of the youngsters recognized me as a swimmer there. They asked me if they’d done something wrong to have it closed. It broke my heart. I knew I had to do something.” At that moment, Rosen, a local hotelier, became an activist for the aquatic and fitness center. Harris Rosen rallied support from Orlando organizations, celebrities, and from Orange County itself. He understood the importance of the aquatic and fitness center to the community. As an avid swimmer himself, he knows how one’s fitness can define and develop character. Fast forward to today when the ownership of the aquatic and fitness center, previously known as the Rosen YMCA Aquatic Center, is now in the hands of those who saved it. ( Here’s another true story about our exciting history .) Our Mission With courage, drive, and determination, the mission of the non-profit Rosen Aquatic & Fitness Center is to elevate the health and wellness of those who enter our facility through inclusive and supportive programs that benefit athletes and community members of all abilities. Through our mission, we also proudly serve as a supportive and vital member of Orange County by expanding our efforts to include community-benefiting events to improve the wellness of our local community. Make a Difference Today | Donate We strive to make a positive impact on the community, and we need your help. Your donation helps us expand the reach of our wellness program, swimming lessons and water safety in the Orange County communities who require financial assistance. Some individuals who have received aid have included Special Olympic athletes and senior citizens. We aim to help many others. Please consider donating today! Details on how easy it is to donate are below. Improve Your Fitness in the Gym Reach circuit training and body toning goals with the right equipment. Members have access to over 60 machines on the floor including: Treadmills Ellipticals Stationary bikes Arm, back, chest, and leg machines Free weights, squat racks, and more Fitness Classes Orlando Needs If you thought aquatic therapy was only for recovery, we’re excited to show you how it also applies to fitness. We provide fitness classes in and out of the pool. Our goal is to offer a variety of classes to keep you active in creative and fun ways. Adult Aquatic Classes: Private swim lessons and group classes like water Zumba and more Kid Aquatic Classes: Group and private swim lessons Special Needs Aquatic Classes: Group and private swim lessons Aquatic and regular Zumba Martial arts and other classes coming soon! We’re adjusting the way we approach fitness to better meet your needs. We may soon stream our in-person classes so you can stay fit anywhere. Changing Facilities Locker rooms, restrooms, and changing areas are available through the center. A family restroom with a changing area is located on deck (by the pool area) Spectator restrooms for Men and Women are located by the pool area Locker rooms for Men and Women are on deck (by the pool) with hot/cold showers, self-serve lockers, and private changing areas The Rosen Aquatic & Fitness Center is a Cashless Facility Ever accidentally leave cash in your workout clothes or swimming gear? The soggy result is definitely frustrating. Well, there’s no need to even carry cash when visiting the Rosen Aquatic & Fitness center — we’re a cashless operation! We accept major credit cards, most mobile payment services, and debit cards. Operating Hours Monday – Friday: 5 a.m. – 9 p.m. Saturday – Sunday: 8 a.m. – 4 p.m. Pool Hours Contact Home About Us Memberships Guest Pass Sponsors Fitness and Wellness Aquatics Contact Privacy Policy Terms and Conditions Site Map With the second-largest meeting center in the southeast in Orlando’s tourism area on IDrive, it makes sense that our indoor/outdoor aquatic center, one of Florida’s largest, be located here as well. We provide the area, which includes Dr. Phillips, access to our non-profit, state-of-the-art facility. Families, local community members, and out-of-town visitors are all welcome to enjoy the gym, pools, fitness classes, and personal facilities making us a perfect aquatic center for your next swim meet or for improving your health. Rosen Aquatic & Fitness Center 85-1859307 Rosen Aquatic & Fitness Center, Inc. has been recognized by the Internal Revenue Service as a 501(c)(3) non-profit charitable organization. Our federal identification number is 85-1859307.  The State of Florida requires us to notify you that a copy of the official registration and financial information may be obtained from the division of consumer services by calling toll-free at 1-800-HELP-FLA (435-7352) within the state. Registration does not imply endorsement, approval, or recommendation by the state. FDACS’s website is www.FDACS.gov . We use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept”, you consent to the use of ALL the cookies. Cookie settings ACCEPT Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://www.monroecounty-fl.gov/1326/Jacobs-Aquatic-Center",
      "text": "Jacobs Aquatic Center | Monroe County, FL - Official Website Skip to Main Content Search About Us Community Centers Parks & Beaches Boat Ramps Home Departments County Departments Parks & Beaches Community Centers Jacobs Aquatic Center Jacobs Aquatic Center In 1997, Doctor Jim Bolini “Doc” and members from the community helped form the Upper Keys Community Pool Inc. The goal was to bring a community pool to the Upper Keys. In 2002, the dream became a reality when the now beloved and much-used staple of Key Largo, Jacobs Aquatic Center, was built. For over 20 years, the Upper Keys Community Pool Inc. has successfully managed the pool. After many laps, countless Orange Bowls, and helping get the Keys Kids Swim program running, the time has come for Doc and Crew to hang up their swim caps one last time. In March 2024, StandGuard Aquatics stepped onto the diving board to take over operations. The team at StandGuard has over 30 years of experience in aquatic management and consulting, developing aquatic programming to best meet the community's needs. They operate pools in seven different states, ranging from water parks to community pools. Jacobs Aquatic Center Standguard Aquatics Jacobs Aquatic Center offers summer break camps and junior lifeguard training. If you have questions, contact the pool directly at 305-453-7946 or via email at jac@standguardaquatics.com . Big Pine Key Community Center Jacobs Aquatic Center Plantation Key Community Center Request Use of a Monroe County Facility Parks and Beaches School Break Camps Boat Ramps Request Facility Newsletter Advisory Board Contact Us Monroe County Parks and Beaches 102050 Overseas Hwy Key Largo, FL 33037 Phone: 305-453-8748 Helpful Links Building and Permitting Emergency Management Fire Rescue Constitutional Offices Outlook Webpage /QuickLinks.aspx Site Links Home Site Map Contact Us Calendar Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.machineaquatics.com/leadership-site-directors",
      "text": "Leadership & Site Directors — Machine Aquatics - Build Your Own Machine Aquatics - Build Your Own About Us Home Leadership & Site Directors Schedule An Evaluation Team Policies Team Records Machine Performance Center Testimonials Levels Progression Competitive Programs Maintenance Programs Locations All Locations Ashburn Audrey Moore Chesterbrook Claude Moore Dulles South Fairland Ida Lee Madeira Oakmont Round Hill Tysons One Life UMD Registration 2025-26 Registration Schedules and Pricing for All Locations Machine Gear Store Machine Gear Store 2025-26 Equipment Lists Contact Us About Us / Home Leadership & Site Directors Schedule An Evaluation Team Policies Team Records Machine Performance Center Testimonials Levels / Progression Competitive Programs Maintenance Programs Locations / All Locations Ashburn Audrey Moore Chesterbrook Claude Moore Dulles South Fairland Ida Lee Madeira Oakmont Round Hill Tysons One Life UMD Registration / 2025-26 Registration Schedules and Pricing for All Locations Machine Gear Store / Machine Gear Store 2025-26 Equipment Lists Contact Us / Leadership & Site Directors About Us / Home Leadership & Site Directors Schedule An Evaluation Team Policies Team Records Machine Performance Center Testimonials Levels / Progression Competitive Programs Maintenance Programs Locations / All Locations Ashburn Audrey Moore Chesterbrook Claude Moore Dulles South Fairland Ida Lee Madeira Oakmont Round Hill Tysons One Life UMD Registration / 2025-26 Registration Schedules and Pricing for All Locations Machine Gear Store / Machine Gear Store 2025-26 Equipment Lists Contact Us / Leadership & Administration: Dan Jacobs - Head Coach/Chief Operations Officer dan@machineaquatics.com Dan started swimming when he was 4 years old for his neighborhood team, the Marlbank Mudtoads. He swam AAU/USS for Coast Guard Blue Dolphins in Yorktown, VA, until the age of fourteen, when he moved to Northern Virginia. Dan then swam for Solotar, Oakton High School, and Vienna Aquatic Club (VAC). He started coaching in 1985 as a developmental assistant at VAC, and assistant coached there until he graduated HS. Dan attended College at Old Dominion University, where he graduated Cum Laude with a Bachelor of Fine Arts degree. He also swam Division 1 for ODU. During the summers Dan coached at Dunn Loring for three years before accepting the head coach position at Vienna Aquatic Club. Upon graduation from ODU he worked in the graphic design field for approximately 12 years, continuing to coach for VAC in the summer and coach year-round for York Swim Club. Dan started Machine Aquatics in 2001 with Paris Jacobs and Christian Doud. We all strive to make a positive impact on every swimmer and help each individual reach his or her maximum potential.  He believes he will never stop learning to be a better coach. Becky Widman - Team Administrator, Maryland becky@machineaquatics.com Becky is the Team Administrator for the Machine Maryland locations. She also manages all of our meet entries for our swimmers and coaches. When she’s not at her desk, you’ll find Becky whipping up tasty treats for the officials and coaches in hospitality, chasing her dogs and children through their busy days or simply heading out for a run. Paris Jacobs - Owner/Chief Executive Officer paris@machineaquatics.com Originally from Atlanta, Georgia, Paris grew up recreationally swimming for Dynamo Swim Club. She began her coaching career in Atlanta at her summer league pool as an assistant coach. She moved to the Northern Virginia area in 1993 to attend boarding school. She attended George Mason University studying Business. After working as a developmental age group coach for a few years, in 2001 Paris co-founded Machine Aquatics, where she served as team manager and age group coach until 2009 when she stepped off the deck as a full-time Machine coach to run the dry side team operations and be a mom. Since its inception in 2001, Machine Aquatics has grown into Machine Brands, which encompasses four divisions.  Machine Aquatics, a nationally ranked USA Swimming competitive team with seven training sites and 1100+ members, Machine Swim School, a large swim school providing 800+ lessons weekly, Machine Performance Center, a 22,000 sq. ft. performance center for swim, fitness, yoga, and physical therapy. Paris serves as CEO of Machine Brands overseeing the business operation and development of all divisions.  After a long volunteer career within USA Swimming and USA Swimming Foundation, Paris served as a business development consultant for The American Swim Coaches Association (ASCA) from 2015-2017 and the Chief Operations Officer (COO) of the American Swim Coaches Association from 2018-2020.  Paris also severed as Senior Management Advisor and Event Operations Director for the International Swimming League (ISL) in 2019 & 2020. Currently, Paris sits on the CEO Advisory Council for USA Swimming. Paris has two children Lillyan (22), a recent graduate of the University of South Carolina studying exercise science and neuroscience, and Daniel, III (20), a Junior at East Carolina Univeristy studying Sports Management/ Business. Alison Galbraith - Team Administrator, Virginia alison@machineaquatics.com Alison is the Team Administrator for the Machine Virginia locations. She also manages all of our registration and billing. She is the mother of three former Machine swimmers. When she’s not at her desk, you’ll find Alison playing in her garden or playing with her three dogs. MACHINE AQUATICS SITE DIRECTORS Ida Lee: Tanya Chang, tanya@machineaquatics.com Madeira School: Alex Miller, alex@machineaquatics.com Oakmont : Jason Cochran, jason@machineaquatics.com Round Hill: Tanya Chang, tanya@machineaquatics.com Tysons : Dylan Cudahy, dylan@machineaquatics.com UMD : Dan Haines, danh@machineaquatics.com Ashburn : TBA Audrey Moore: Aaron Durrence, aaron@machineaquatics.com Chesterbrook : Blair Piddington, blair@machineaquatics.com Claude Moore: Suzanne Patras, suzanne@machineaquatics.com Dulles South: Jeff Newman, jeff@machineaquatics.com Fairland: Chad Williams, chad@machineaquatics.com About Us / Home Leadership & Site Directors Schedule An Evaluation Team Policies Team Records Machine Performance Center Testimonials Levels / Progression Competitive Programs Maintenance Programs Locations / All Locations Ashburn Audrey Moore Chesterbrook Claude Moore Dulles South Fairland Ida Lee Madeira Oakmont Round Hill Tysons One Life UMD Registration / 2025-26 Registration Schedules and Pricing for All Locations Machine Gear Store / Machine Gear Store 2025-26 Equipment Lists Contact Us / Machine Aquatics - Build Your Own"
    },
    {
      "url": "https://www.jacobsaquaticcenterkeylargo.com/rentals",
      "text": "Rentals - Jacobs Aquatic Center Jacobs Aquatic Center Home Pirate/Activity Pool Closure Friday Nights Afterschool About Admission Pricing/Hours Programming Rentals Season Passes Special Events Contact Jacobs Aquatic Center Home Pirate/Activity Pool Closure Friday Nights Afterschool About Admission Pricing/Hours Programming Rentals Season Passes Special Events Contact Rentals All Multipurpose Room Rental Plan your event with ease by choosing our multipurpose room rental. From intimate gatherings to larger functions, our flexible space caters to diverse requirements and ensures a seamless experience for all attendees. Park Rental Afterhours Make lasting memories with loved ones by booking Park Rental Afterhours for private events, such as weddings, birthdays, and anniversaries. Birthday Parties Host your birthday party at JAC.  Our Birthday Party Packages include 2 hours in the pool area and 1 hour in a room.  We offer two packages, Basic and Deluxe. Deluxe Package - Let us provide the food, drink and ice cream treat so you can relax and have a great time at the party. Jacobs Aquatic Center Copyright © 2025 All rights reserved Home Friday Nights About Admission Pricing/Hours Programming Rentals Season Passes Special Events Contact"
    },
    {
      "url": "https://www.monroecounty-fl.gov/Directory.aspx?did=194",
      "text": "Staff Directory • Jacobs Aquatic Center Skip to Main Content Search Departments Services / Programs Our Community Find It Fast Home Staff Directory Jacobs Aquatic Center Physical Address: 320 Laguna Ave. Key Largo, FL 33037 Phone: 305-453-7946 Link: Jacobs Aquatic Center Website Hours Open 7 Days a Week 10 a.m. to 6 p.m. Closed: Thanksgiving and Christmas Pool Rules Absolutely NO Coolers or Outside Food or Drink NO Smoking or Alcoholic Beverages Only U.S. Coast Guard Approved Floatation Swim Diapers Required No Spray On Sunscreens Return to Staff Directory Live Edit Employment County Commission County Administrator Hurricane Irma Recovery Title VI, EOE & ADA Accessibility Alert!Monroe & Notify Me® Sign up here Employment See open positions Permits & Licenses Forms & information Meetings, Agendas & Minutes Current, upcoming & past Public Notices Learn More Here Emergency Management Hurricane information Contact Us Monroe County 1100 Simonton Street Key West, FL 33040 Main Number: 305-294-4641 County Staff Directory Email Us Helpful Links Building and Permitting Emergency Management Fire Rescue Constitutional Offices Outlook Webpage /QuickLinks.aspx Site Links Home Site Map Contact Us Calendar Accessibility Copyright Notices /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://aquaticinformatics.com/contact-us/get-in-touch/",
      "text": "Get in touch | Aquatic Informatics toggle menu Products Featured Products Hach WIMS™ Platform Aquarius Analytics Software for the Natural Environment Other Products WaterTrax Water Quality & Wastewater Compliance Tokay Backflow Prevention & Cross-Connection Control Hazards Management Linko Wastewater Pretreatment & FOG Regulatory Compliance Aquatic Compliance Platform Cloud-based FOG & Hauled Waste Management Solutions Applications Wastewater Drinking Water Stormwater Source Water Industries National & Federal Agencies State & Local Government Consulting & Engineering Hydropower Mining Utilities Resources Library Success Stories Blog Company About Careers Ripple Effect Contact News & Awards Associations Environment & Community Support Book Consultation Connect with the team Looking to connect with us, but not interested in speaking to Sales or in need of technical support ? You’ve come to the right place. Get in Touch With Aquatic Informatics By submitting, I confirm that I have reviewed and agree with the Aquatic Informatics’ Privacy Policy , including my personal data privacy choices as outlined in the “Your Privacy Choices” section. I also understand my privacy choices as they pertain to my personal data as provided in the Aquatic Informatics’ Privacy Policy under the section “Your Privacy Choices”. Products Why Aquatic Informatics Aquarius Rio WIMS WaterTrax Linko Tokay Aquatic Compliance Platform Solutions Stormwater Source Water Drinking Water Wastewater Pretreatment FOG Backflow Industries National & Federal Agencies State & Local Government Consulting & Engineering Hydropower Mining Utilities Resources Events Library Blog FAQs Company About News & Awards Careers Diversity, Equity, + Inclusion Associations Environment & Community Ripple Effect Support Get In Touch Book a Consultation Contact Us Contact Support Unit 1010, 601 West Hastings St. Vancouver, BC V6B 1M8 1.877.546.5699 | +1.604.873.2782 info@aquaticinformatics.com Veralto Water Quality Copyright ©2025 Aquatic Informatics ULC Privacy Policy Cookie Policy Terms of Use Do Not Sell or Share My Data Cookie Settings"
    },
    {
      "url": "https://aquaticliving.co.uk/pages/contact",
      "text": "Contact Us – Aquatic Living Browse Close menu Your Cart ( ) \"Close Cart\" GUARANTEED SAFE & SECURE CHECKOUT Spend £300 to Unlock Free Shipping to United Kingdom 0 0 Your cart is currently empty. Shop Now Water Tanks Non Potable Water Tanks (Vertical) Potable Drinking Water Tanks (Vertical) Fluid Category 5 AB Air Gap Break Tank Baffled Water Tanks Sprayer Water Tanks Horizontal Sprayer Tank Vertical Sprayer Water Tanks Transport Tanks & Bowsers Horizontal Transport Tanks Rainwater Harvesting Tanks Insulated Water Tanks Static Water Tanks (Horizontal) Static Water Bowsers Static Tanks Non-Potable Static Water Bowsers Potable Static Drinking Water Bowsers With Bauer Filler Water Features All Water Features Durable Lightweight Resin Waterfalls Metal Water Features Lightweight Concrete Waterfalls Water Harvesting Garden Pools Premium Wooden Pools Knightsbridge Pool Belgravia Pool Bayswater Pool Westminster Pool Chelsea Pool Exercise Pool Nazca Wooden Pools Nazca 4m x 2m Exercise Pool Nazca 6m x 3m Pool Nazca 6m x 4m Pool Nazca 8m x 2m Pool Nazca 8m x 4m Pool Eco Pool Small Eco Pool Large Eco Pool Large Stretched Eco Pool Splasher Pools Wooden Fun Pools Intex Easy Set Pools Intex Metal Frame Pools Paddling Pools Fun & Games Pool Ride-On Inflatables Solar Covers EnergyGuard 500 Micron Sol+Guard 500 Micron CoolGuard Ultra 500 Micron Midas 500 Micron Apollo 400 Micron Blue 400 Micron Black 400 Micron Blue 200 Micron Leading Edge Winter Debris Covers Deluxe Debris Covers Deluxe Criss Cross Debris Covers Flush-Fix Debris Covers Premium Debris Covers Low Profile Decking Debris Covers Opaque Debris Covers Above Ground Pool Debris Covers Accessories Commercial Brands The FirePit Company Mon-Sat 9am-6pm GMT 020-3004-1152 Close Menu Water Tanks Non Potable Water Tanks (Vertical) Potable Drinking Water Tanks (Vertical) Fluid Category 5 AB Air Gap Break Tank Baffled Water Tanks Sprayer Water Tanks Horizontal Sprayer Tank Vertical Sprayer Water Tanks Transport Tanks & Bowsers Horizontal Transport Tanks Rainwater Harvesting Tanks Insulated Water Tanks Static Water Tanks (Horizontal) Static Water Bowsers Static Tanks Non-Potable Static Water Bowsers Potable Static Drinking Water Bowsers With Bauer Filler Water Features All Water Features Durable Lightweight Resin Waterfalls Metal Water Features Lightweight Concrete Waterfalls Water Harvesting Garden Pools Premium Wooden Pools Knightsbridge Pool Belgravia Pool Bayswater Pool Westminster Pool Chelsea Pool Exercise Pool Nazca Wooden Pools Nazca 4m x 2m Exercise Pool Nazca 6m x 3m Pool Nazca 6m x 4m Pool Nazca 8m x 2m Pool Nazca 8m x 4m Pool Eco Pool Small Eco Pool Large Eco Pool Large Stretched Eco Pool Splasher Pools Wooden Fun Pools Intex Easy Set Pools Intex Metal Frame Pools Paddling Pools Fun & Games Pool Ride-On Inflatables Solar Covers EnergyGuard 500 Micron Sol+Guard 500 Micron CoolGuard Ultra 500 Micron Midas 500 Micron Apollo 400 Micron Blue 400 Micron Black 400 Micron Blue 200 Micron Leading Edge Winter Debris Covers Deluxe Debris Covers Deluxe Criss Cross Debris Covers Flush-Fix Debris Covers Premium Debris Covers Low Profile Decking Debris Covers Opaque Debris Covers Above Ground Pool Debris Covers Accessories Commercial Brands The FirePit Company Got a Question? Call Us 020-3004-1152 Mon-Sat 9am-6pm GMT Home / Contact Us Get in Touch – We're Here to Help! Our team of aquatic experts is ready to help. Choose the best way to reach us! Contact Form I agree to subscribe to updates from Aquatic Living Privacy Policy Contact Us Availability: Mon-Sat 9am-6pm GMT 020-3004-1152 info@aquaticliving.co.uk Live Chat"
    },
    {
      "url": "https://perfectaquatics.com/pages/contact-us",
      "text": "Contact Us | Biggest Koi Store in Henlow Bedfordshire Skip to content Free Delivery over £50* - 1000's of Products In-Stock - Exclusive Lines - Shop Now! Home Events Japanese Koi Pond Tropical Marine Gift Cards Blog Posts Perfect Aquatics Competitions Need help? Call us 01462 850822 info@perfectaquatics.co.uk Follow Us Facebook Twitter Instagram YouTube Back Japanese Koi Japanese Koi Koi Auction - Winners Back Pond Preformed Ponds & Liner Pond Plants Filters UV Filters UV Bulbs Foods Treatments Pumps and Fountains Pipework and Fittings Outdoor Lighting Accessories Spares Back Tropical Aquariums Accessories Filters / Pumps Foods Lighting and Heaters Spares Treatments Back Marine Aquariums Lighting Protein Skimmers Filters / Pumps Rockwork / Sand Foods Accessories Spares Frozen Food Back Blog Posts News Ultimate Fishkeeping Guides Back Preformed Ponds & Liner Preformed Ponds and Liner Liner Calculator Pond Volume Calculator Back Pond Plants Deep Water Pond Plants Oxygenating Pond Plants Marginal Pond Plants Floating Pond Plants Lilies Pond Snails All Pond Plants Back Filters Evolution Aqua Oase PondXpert Laguna Superfish Blagdon All Pond Filters Filter Media/Foams Back UV Filters Evolution Aqua Oase PondXpert All UV Filters Back Foods Hikari NT Labs Saki Hikari Shark Tetra Takazumi All Pond Food Back Treatments Aqua Utopia Algae Treatments Bactoplus Blagdon Cloverleaf Colombo Evolution Aqua Kusuri NT Labs All Pond Treatments Back Pumps and Fountains Oase Evolution Aqua FujiMac Laguna PondXpert Superfish Blagdon Bermuda All Pumps and Fountains Back Pipework and Fittings Pressure Waste Eazy Connectors Back Outdoor Lighting Oase PondXpert Blagdon Bermuda All Outdoor Lighting Back Accessories Air Accessories Filter Media Hose Accessories Nets Koi Bowls Pond Heaters Pond Vacuums Pond Feeders Pond Skimmers Pond Testing Kits Pond Covers Posters Switch Boxes Spawning Brushes All Pond Accessories Back Spares Bermuda Blagdon Evolution Aqua Laguna Oase PondXpert Superfish Back Aquariums Aqua One AquaEl Aquatlantis BiOrb D-D Aqua Pro D-D Aqua Pro Aquascaper Eheim Fluval Juwel Oase Redsea Desktop Aquariums Superfish TMC Freshwater Aquariums Aquarium Cabinets All Aquariums Back Accessories Aquarium Decor Aquarium Background Aquascaping Tools Air Accesories Aquarium Gravel Breeding Traps Cleaning Equipment CO2 Kits Nets Plant Food Testing Kits Extra Accessories Back Filters / Pumps Air Pumps Aquarium Filter Media Internal Filters External Filters Hang On Filters Air Sponge Filters Return Pumps UV Filters Wavemakers All Filters / Pumps Back Foods Automatic Feeders Cloverleaf Hikari Holiday Food King British NT Labs Ocean Nutrition Superfish Tetra Vitalis Frozen Food All Tropical Foods Back Lighting and Heaters Aquael Lighting Superfish Lighting Interpet Lighting Juwel Lighting NT Labs Lighting All Aquarium Lighting Heaters, Chillers and Fans Back Spares AquaEl BiOrb Eheim Fluval Juwel Superfish Back Treatments API Colombo Evolution Aqua Esha Fluval Interpet NT Labs Seachem Tetra Waterlife Back Aquariums Aqua One AquaEl Aquaforest D-D Reef Pro D-D Reef Pro Deluxe Fluval Neptunian Nyos Red Sea TMC All Marine Aquariums Back Lighting Ecotech Marine RedSea Aqua Illumination TMC Lighting Back Protein Skimmers Aqua One Aquavitro Deltec RedSea Reef Octopus Nyos Fluval SEA TMC D-D Back Filters / Pumps Algae Reactors Automatic Top Offs Dosing Pumps External Filters Fluidized Reactors Roller Mats Return Pumps UV Filters Wavemakers Back Rockwork / Sand Aquaforest Rock Caribsea Rock D-D Marco Rock Hugo Rock TMC Rock Aqua One Sand Aquaforest Sand Colombo Sand Caribsea Sand TMC Sand Back Foods Aquaforest NT Labs Nyos Ocean Nutrition Vitalis Back Accessories Cleaning Cover Nets Cabinet Management Control & Monitoring Fragging Heaters, Chillers & Fans Marine Treatments Marine Salt Media Refractometers Testing Kits Back Spares Redsea D-D TMC Ecotech Marine Nyos Aqua Illumination Deltec Kamoer Jecod Fluval SEA Tunze Reef Octopus Perfect Aquatics Ltd Clear Close Login / Signup My account 0 Cart Spend £50.00 more and get free shipping! Your cart is empty Shop our products Home Events Japanese Koi Japanese Koi Koi Auction - Winners Pond Preformed Ponds & Liner Preformed Ponds and Liner Liner Calculator Pond Volume Calculator Pond Plants Deep Water Pond Plants Oxygenating Pond Plants Marginal Pond Plants Floating Pond Plants Lilies Pond Snails All Pond Plants Filters Evolution Aqua Oase PondXpert Laguna Superfish Blagdon All Pond Filters Filter Media/Foams UV Filters Evolution Aqua Oase PondXpert All UV Filters UV Bulbs Foods Hikari NT Labs Saki Hikari Shark Tetra Takazumi All Pond Food Treatments Aqua Utopia Algae Treatments Bactoplus Blagdon Cloverleaf Colombo Evolution Aqua Kusuri NT Labs All Pond Treatments Pumps and Fountains Oase Evolution Aqua FujiMac Laguna PondXpert Superfish Blagdon Bermuda All Pumps and Fountains Pipework and Fittings Pressure Waste Eazy Connectors Outdoor Lighting Oase PondXpert Blagdon Bermuda All Outdoor Lighting Accessories Air Accessories Filter Media Hose Accessories Nets Koi Bowls Pond Heaters Pond Vacuums Pond Feeders Pond Skimmers Pond Testing Kits Pond Covers Posters Switch Boxes Spawning Brushes All Pond Accessories Spares Bermuda Blagdon Evolution Aqua Laguna Oase PondXpert Superfish Tropical Aquariums Aqua One AquaEl Aquatlantis BiOrb D-D Aqua Pro D-D Aqua Pro Aquascaper Eheim Fluval Juwel Oase Redsea Desktop Aquariums Superfish TMC Freshwater Aquariums Aquarium Cabinets All Aquariums Accessories Aquarium Decor Aquarium Background Aquascaping Tools Air Accesories Aquarium Gravel Breeding Traps Cleaning Equipment CO2 Kits Nets Plant Food Testing Kits Extra Accessories Filters / Pumps Air Pumps Aquarium Filter Media Internal Filters External Filters Hang On Filters Air Sponge Filters Return Pumps UV Filters Wavemakers All Filters / Pumps Foods Automatic Feeders Cloverleaf Hikari Holiday Food King British NT Labs Ocean Nutrition Superfish Tetra Vitalis Frozen Food All Tropical Foods Lighting and Heaters Aquael Lighting Superfish Lighting Interpet Lighting Juwel Lighting NT Labs Lighting All Aquarium Lighting Heaters, Chillers and Fans Spares AquaEl BiOrb Eheim Fluval Juwel Superfish Treatments API Colombo Evolution Aqua Esha Fluval Interpet NT Labs Seachem Tetra Waterlife Marine Aquariums Aqua One AquaEl Aquaforest D-D Reef Pro D-D Reef Pro Deluxe Fluval Neptunian Nyos Red Sea TMC All Marine Aquariums Lighting Ecotech Marine RedSea Aqua Illumination TMC Lighting Protein Skimmers Aqua One Aquavitro Deltec RedSea Reef Octopus Nyos Fluval SEA TMC D-D Filters / Pumps Algae Reactors Automatic Top Offs Dosing Pumps External Filters Fluidized Reactors Roller Mats Return Pumps UV Filters Wavemakers Rockwork / Sand Aquaforest Rock Caribsea Rock D-D Marco Rock Hugo Rock TMC Rock Aqua One Sand Aquaforest Sand Colombo Sand Caribsea Sand TMC Sand Foods Aquaforest NT Labs Nyos Ocean Nutrition Vitalis Accessories Cleaning Cover Nets Cabinet Management Control & Monitoring Fragging Heaters, Chillers & Fans Marine Treatments Marine Salt Media Refractometers Testing Kits Spares Redsea D-D TMC Ecotech Marine Nyos Aqua Illumination Deltec Kamoer Jecod Fluval SEA Tunze Reef Octopus Frozen Food Gift Cards Blog Posts News Ultimate Fishkeeping Guides Perfect Aquatics Competitions Contact Us Please use our contact form below or use our Live Chat service to contact us. *PLEASE NOTE* if you are not price matching a product, please leave the requested information blank. Your name Your email Your message Send message Find us Perfect Aquatics, Hitchin Road, Henlow, Bedfordshire, SG16 6BB Visit our Store Perfect Aquatics Hitchin Road, Henlow Bedfordshire SG16 6BB 100% Satisfaction If you have any problem with the products you have purchased, get in touch! Caring for our Customers Call us for any advice you need on  01462 850 822 Open 7 Days a Week Monday - Saturday: 9am - 5.30pm Sunday: 11am - 5pm Klarna Finance Klarna Finance FAQ's Klarna Terms and Conditions Loyalty Scheme LoyalZoo - COMING SOON Hey, Don't forget about us down here! Terms and Conditions About us News Contact us Orders Order Tracking Price Match Shipping Returns Warranty Perfect Aquatics Store Opening Hours Monday: 9AM - 5:30PM Tuesday: 9AM -5:30PM Wednesday: 9AM - 5:30PM Thursday: 9AM - 5:30PM Friday: 9AM - 5:30PM Saturday: 9AM - 5:30PM Sunday: 11AM - 5PM Pet License CB/LANW/16/055849 © 2025 Perfect Aquatics Ltd Powered by Shopify Follow Us We Accept Apple Pay Google Pay Mastercard PayPal Shop Pay Visa © 2025 Perfect Aquatics Ltd Powered by Shopify Opens in a new window."
    },
    {
      "url": "https://www.jacobsaquaticcenterkeylargo.com/",
      "text": "Jacobs Aquatic Center - Jacobs Aquatic Center Jacobs Aquatic Center Home Pirate/Activity Pool Closure Friday Nights Afterschool About Admission Pricing/Hours Programming Rentals Season Passes Special Events Contact Jacobs Aquatic Center Home Pirate/Activity Pool Closure Friday Nights Afterschool About Admission Pricing/Hours Programming Rentals Season Passes Special Events Contact Jacobs Aquatic Center Welcome to Jacobs Aquatic Center, the premier destination for aquatic activities and events located in Key Largo, FL. Our state-of-the-art facilities cater to all ages and skill levels, offering a range of programs including swimming lessons, water aerobics, afterschool programs, summer camp, jr. lifegaurd class and lifeguard classes. Whether you're looking to improve your technique, host a special event, or simply relax by the pool, Jacobs Aquatic Center provides the perfect setting for all your aquatic needs. Pirate/Activity Pool Closure Friday Nights All Just Keep Swimming JAC will be  open from Special Events on Friday Nights from 6p-9p. Come join us for Friday Night Fun!!! Food Combo Special Hotdog/Corndog\r\nChips\r\nDrink\r\n$7 Intro to Scuba Scuba Fun is offering an Intro to Scuba for Free\r\nCall 305-453-7946 to sign up\r\nSpace is limited\r\nAges 8+ Jacobs Aquatic Center Afterschool Date: 8/13/25-5/29/26 Time: Afterschool to 6pm Ages: 5-12 years Old Cost: $75 a week please email: jac@standguardaquatics.com for more informtion Registration Link About Us Welcome to Jacobs Aquatic Center, where we provide a safe and fun environment for all ages to enjoy aquatic activities. Our state-of-the-art facilities include jr. Olympic lap pools, diving well, shallow training pool and an activity pool. Our professional staff is dedicated to making your visit unforgettable. Admission Pricing Weekday Adult - $12 Child (3-17) - $8 2 and under - Free Family (2 Adults and 2 Children) - $30 Weekend Adult - $14 Child (3-17) - $10 2 and under - Free Family (2 Adults and 2 Children) - $35 Programming All Afterschool Program The after school schedule offers homework assistance, recreational time, games, crafts and of course pool time (weather permitting)!\r\nThe after school program starts at the end of the school day and ends at 6:00 pm each full school day.  JAC programs serve students ages 5-12 years of age.  Capacity for this program is 40 participants each week. Water Fitness Join our water fitness classes designed to improve cardiovascular health and strengthen muscles in a low-impact environment.  We offer water aerobics on Mondays, Wednesdays and Fridays from 9a-10a.  No registration is needed. Cost $6 for everyone attending the class. Swimming Lessons Our certified instructors offer swimming lessons for all skill levels, from beginners to advanced swimmers. Summer Camp Looking for a place for your kids to go on when school in not in session.  JAC offers School Day Out Camps for your kids to attend from 8a-6p. Rentals All Multipurpose Room Rental Plan your event with ease by choosing our multipurpose room rental. From intimate gatherings to larger functions, our flexible space caters to diverse requirements and ensures a seamless experience for all attendees. Park Rental Afterhours Make lasting memories with loved ones by booking Park Rental Afterhours for private events, such as weddings, birthdays, and anniversaries. Birthday Parties Host your birthday party at JAC.  Our Birthday Party Packages include 2 hours in the pool area and 1 hour in a room.  We offer two packages, Basic and Deluxe. Deluxe Package - Let us provide the food, drink and ice cream treat so you can relax and have a great time at the party. Season Passes Season passes are offer for 3 months, 6 months and 12 months.  The passes include individual, youth, family (2 adults and 2 kids) and more. Please use the attched link to access the informaion to see teh prices and all the different types of season passes offered. Season Pass Link Special Events Upcoming Events Past Events 12 Sep Just Keep Swimming Friday Nights 09/12/2025 06:00 PM - 09/12/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 19 Sep Just Keep Swimming Friday Nights 09/19/2025 06:00 PM - 09/19/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 26 Sep Just Keep Swimming Friday Nights 09/26/2025 06:00 PM - 09/26/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 03 Oct Just Keep Swimming Friday Nights 10/03/2025 06:00 PM - 10/03/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 10 Oct Just Keep Swimming Friday Nights 10/10/2025 06:00 PM - 10/10/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 17 Oct Just Keep Swimming Friday Nights 10/17/2025 06:00 PM - 10/17/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 31 Oct Just Keep Swimming Friday Nights 10/31/2025 06:00 PM - 10/31/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 05 Sep Just Keep Swimming Friday Nights 09/05/2025 06:00 PM - 09/05/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 29 Aug Just Keep Swimming Friday Nights 08/29/2025 06:00 PM - 08/29/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More 22 Aug Just Keep Swimming Friday Nights 08/22/2025 06:00 PM - 08/22/2025 09:00 PM 320 Laguna Avenue, Key Largo, FL, USA Special Event \"Just Keep Swimming Friday Nights\"\r\nTime 6p-9p\r\nDates - Starting August 22nd\r\nCost - $6\r\nNightly Food Specials Read More Contact Contact Us 320 Laguna Avenue, Key Largo, FL, USA +1-305-453-7946 jac@standguardaquatics.com Mon-Sun - 10:00a-6:00p Jacobs Aquatic Center Copyright © 2025 All rights reserved Home Friday Nights About Admission Pricing/Hours Programming Rentals Season Passes Special Events Contact"
    }
  ]
}