{
  "fuentes": [
    {
      "url": "https://www.jannus.org/",
      "email": "dots@4x.png"
    },
    {
      "url": "https://www.jannus.org/",
      "email": "eojannus@3x.png"
    },
    {
      "url": "https://www.jannus.org/",
      "email": "info@jannus.org"
    },
    {
      "url": "https://jannuslive.com/",
      "email": "kendall@jannuslive-com.preview-domain.com"
    },
    {
      "url": "https://www.jannuslive.com/events/knock2/",
      "email": "info@jannuslive.com"
    },
    {
      "url": "https://www.tampabay.com/news/pinellas/2025/04/30/jeff-knight-steps-down-jannus-live-after-boat-crash/",
      "email": "ewunderlich@tampabay.com"
    },
    {
      "url": "https://www.tampabay.com/news/pinellas/2025/04/30/jeff-knight-steps-down-jannus-live-after-boat-crash/",
      "email": "jprator@tampabay.com"
    },
    {
      "url": "https://www.tampabay.com/news/pinellas/2025/04/30/jeff-knight-steps-down-jannus-live-after-boat-crash/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://www.tampabay.com/news/pinellas/2025/04/30/jeff-knight-steps-down-jannus-live-after-boat-crash/",
      "email": "tisch@tampabay.com"
    },
    {
      "url": "https://www.tampabay.com/news/health/2019/10/29/news-of-a-nasty-rash-goes-viral-officials-investigate-the-pelican-pub/",
      "email": "jgriffin@tampabay.com"
    },
    {
      "url": "https://www.tampabay.com/news/health/2019/10/29/news-of-a-nasty-rash-goes-viral-officials-investigate-the-pelican-pub/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://www.hospitalityandcateringnews.com/2022/06/the-pelican-notting-hill/",
      "email": "bookings@thepelicanw11.com"
    },
    {
      "url": "http://pelicanpromo.com/ContactUs",
      "email": "mrush293040@asicentral.com"
    },
    {
      "url": "http://pelicanpromo.com/ContactUs",
      "email": "stephanie@pelicanpromo.com"
    },
    {
      "url": "https://pelicanhotel.com/contact/",
      "email": "reservation@pelicanhotel.com"
    },
    {
      "url": "https://pelicanhotel.com/contact/",
      "email": "restaurant@pelicanhotel.com"
    },
    {
      "url": "https://www.jannuslive.com/visit/",
      "email": "info@jannuslive.com"
    },
    {
      "url": "https://www.jannuslive.com/visit/",
      "email": "megan@jannuslive.com"
    },
    {
      "url": "https://jannuslive.com/contact/",
      "email": "20info@jannuslive.com"
    },
    {
      "url": "https://jannuslive.com/contact/",
      "email": "info@jannuslive.com"
    },
    {
      "url": "https://jannuslive.com/contact/",
      "email": "kendall@jannuslive.com"
    },
    {
      "url": "https://jannuslive.com/contact/",
      "email": "marshall@jannuslive.com"
    },
    {
      "url": "https://jannuslive.com/contact/",
      "email": "megan@jannuslive.com"
    },
    {
      "url": "https://www.jannuslive.com/events/garbage/",
      "email": "info@jannuslive.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "canada.sales@pelican.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "info.australia@pelican.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "japan@pelican.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "jin.li@pelican.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "korea@pelican.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "latam@pelican.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "philanthropy@pelican.com"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "email": "seasia@pelican.com"
    },
    {
      "url": "https://www.pelicanstatecu.com/contactus",
      "email": "pelicanstatecu@imcovered.com"
    },
    {
      "url": "https://www.thepelicanclub.co.uk/contact-us",
      "email": "info@thepelicanclub.co.uk"
    },
    {
      "url": "https://www.thepelicanhotel.com/contact-us.html",
      "email": "sales@thepelicanhotel.onmicrosoft.com"
    },
    {
      "url": "https://www.thepelicanhotel.com/contact-us.html",
      "email": "info@thepelicanhotel.com"
    },
    {
      "url": "https://www.fox13news.com/news/jannus-live-owner-steps-down-after-clearwater-ferry-crash-leaves-1-dead-10-injured",
      "email": "fox13tampanews@foxtv.com"
    }
  ],
  "mails": [
    "20info@jannuslive.com",
    "bookings@thepelicanw11.com",
    "canada.sales@pelican.com",
    "dots@4x.png",
    "eojannus@3x.png",
    "ewunderlich@tampabay.com",
    "fox13tampanews@foxtv.com",
    "info.australia@pelican.com",
    "info@jannus.org",
    "info@jannuslive.com",
    "info@thepelicanclub.co.uk",
    "info@thepelicanhotel.com",
    "japan@pelican.com",
    "jgriffin@tampabay.com",
    "jin.li@pelican.com",
    "jprator@tampabay.com",
    "kendall@jannuslive-com.preview-domain.com",
    "kendall@jannuslive.com",
    "korea@pelican.com",
    "latam@pelican.com",
    "licensing@zumapress.com",
    "marshall@jannuslive.com",
    "megan@jannuslive.com",
    "mrush293040@asicentral.com",
    "pelicanstatecu@imcovered.com",
    "philanthropy@pelican.com",
    "reservation@pelicanhotel.com",
    "restaurant@pelicanhotel.com",
    "sales@thepelicanhotel.onmicrosoft.com",
    "seasia@pelican.com",
    "stephanie@pelicanpromo.com",
    "tisch@tampabay.com"
  ],
  "nombre_sitio": "jannuslive.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jannus.org/",
      "text": "Jannus Home Programs Economic Opportunity Agency for New Americans Economic Opportunity English Language Center Global Gardens Global Talent Idaho Office for Refugees Public Policy Idaho Out of School Network Community Health Early Head Start Empower Idaho Idaho Crisis & Suicide Hotline Aging Strong Southwest Idaho Area Health Education Center (AHEC) About Us Board Staff Financials Become a Program of Jannus Volunteer Employment Contact Events Donate Jannus is a unique health and human services organization with 13 programs operating throughout Idaho in the areas of community health, economic opportunity, and public policy. Each of our programs has a unique vision and mission serving populations from infancy to older adults – all are aligned with the overall mission of Jannus: changing lives in Idaho for the better. Community Health Our programs start with newborns and extend all the way to healthy aging for seniors. Economic opportunity We help people with few resources improve their financial health and support successful entrepreneurs. Public Policy We do in-depth analytical research and speak on behalf of those who need a voice. Jannus is structured with a centralized shared service team to provide essential services to all the programs. The Team includes executive leadership, financial expertise, human resources, grant writing and information technology. By centralizing this part of the organization, we not only offer greater efficiency, but also consistency, accountability, and compliance in many areas from complex funding requirements to human resource standards. JANNUS Impact Making a difference every day It was a snowy evening, around midnight and the phones were ringing intermittently at the Hotline. When I answered my phone, the woman’s voice on the line was shaky and tentative. Offering assurances, I let her know that we are here for her and care about her safety and well-being. As I listened to her struggles with depression and thoughts of suicide I started to understand what she was going through. She saw suicide as the only option and feared being a burden to her loved ones. As she spoke, I supported her in exploring her personal strengths and resiliency she’s demonstrated in other challenging situations. From there, I conducted a safety assessment to make sure she was not in danger. Like many people who call the Hotline, she was hesitant to reach out and concerned about taking time away from someone who may be “worse off than me.”By the end of the call, the help seeker was able to create a plan to keep herself safe and she agreed to receive a follow-up call. When the Hotline connected with her the next evening she was feeling much better and sounded calmer and relieved. She’d gotten good rest, connected with a supportive friend and spent some time at a park with her young children. As we said goodbye, she said “Thank you so much for being there for me, you saved my life.” Crisis and Suicide Hotline Responder Working Together to Improve Lives in Idaho We believe success happens when people work together, and together, we are securing the future of Jannus. We are rethinking major expenses and making changes to be more efficient. In 2024, we sold our real estate assets, invested the proceeds into a permanent endowment fund, and consolidated most programs in one leased location to improve efficiencies and the client experience. Becoming part of our life My Early Head Start journey started over seven years ago. While attending an event at the fairgrounds, I met a wonderful woman who told me all about the program. She explained all the benefits and I was convinced it would be great for me and my 18-month-old. I was assigned a wonderful home visitor who gave us encouragement and support. I learned how important my daily interactions with my children are and found social activities for our growing family. The program also gave me so many opportunities for personal growth. I joined the policy council and then served as the chair. I was a representative to the Idaho Head Start Association and a parent representative to the board. I loved serving and advocating for young children. As part of a group of Early Head Start parents that traveled to Washington, DC this year, I encouraged our congressmen and women to “Think Babies.” We encouraged our Idaho delegation to work on legislation that supports families. Today, I have five children, and I know the benefits of early childhood education first-hand, thanks to Early Head Start. And I’m still on the journey, pursuing my Early Childhood Education degree, set to graduate from the University of Idaho in May 2024. Anna JANNUS Impact Our Work is Needed as Idaho Grows We see increased pressure on families as the supply of affordable housing diminishes, child care and out-of-school programs can be unaffordable, many families are uninsured or can’t find a provider because the shortage of health care providers continues, and our aging population is in need of care. Our programs are addressing the needs of Idaho’s most vulnerable populations. Learn More → JANNUS Impact Connection provides sincere support As a Vietnam Vet, I decided to become an Aging Strong Volunteer, serving veterans of all ages. For the last several years, I have gotten to know Jim and Vikki. They moved to Idaho after losing everything in the 2018 Paradise fire. Jim, a veteran of the Korean war, suffered from dementia and Vikki, his loving wife was a full-time caregiver. I was there to give Vikki a break and bring some joy to Jim. Vickki shared, “Thank you, Aging Strong, for all that you do to help families like mine during difficult times. You sent us Webb, a unique individual with a big, beautiful heart. I didn’t know how much we needed him. He took my husband fishing, took him to lunch and an occasional dinner. Being a family caregiver doesn’t allow time for a social life. Because of Webb, I was able to be social again. My heart is full of gratitude for all that Webb offered to me and my husband. “I helped them through hard days, even Jim’s final day. That day, I was present as well as his family. I placed the flag over Jim, as he left his home for the last time. I was humbled and honored to have served this family. Webb Insights about resources to reach for the stars We are not businesswomen, but my daughter and I have a passion for people and food, especially beignets. So, the story of Ten/6 begins, and struggles in Coeur d’Alene. We needed a big “boost” educationally and financially to get our restaurant plans focused. It was our luck that we found Economic Opportunity. What we expected was a quick call with more numbers and names of someone else who ‘maybe’ could help us. To our surprise – we got a zoom meeting, with a welcoming face who wasn’t in a rush. Jessica spent over an hour with us on that first call. She was genuinely interested, asked thoughtful questions, and truly wanted to know our story. She knew right away the resources we needed and which team members to meet. We were supported, mentored, and inspired on our entrepreneurial journey. It was a game changer! From our first meeting with Jessica, to Cameo, our loan underwriter, and Mark who taught us about projections and finances – everyone helped us navigate unfamiliar territory.Now we are set to re-open this fall! “It’s hard to put into words how much the whole EO team impacted me and our business. We are forever grateful!” Jill and Taylor JANNUS Impact Jannus, Inc 3501 W. Elder Street Ste 104 Boise, ID 83705 Phone: 208-336-5533 Fax: 208-336-0880 Email: info@jannus.org Powered by Valice"
    },
    {
      "url": "https://jannuslive.com/",
      "text": "Jannus Live Skip to content Shows VIP UPGRADE VIP Suites Table Visit About Contact Shows VIP UPGRADE VIP Suites Table Visit About Contact Instagram Facebook-f 87°F We love you, St Pete Welcome to Jannus Live—St. Pete’s iconic standing room only outdoor music venue. Hosting world-class talent and unforgettable shows for over 40 years. VIEW SHOWS UPCOMING SHOWS Tue 16 Sep The Plot In You Buy Tickets Sun 21 Sep Rome “Formerly of Sublime with Rome”w/ Evening Elephants, Beach Fly & Jordan Fletcher Buy Tickets Wed 24 Sep Aidan Bissett: shut up and love me tour Buy Tickets Thu 25 Sep B.o.B – Adventure of Bobby Ray 15th Anniversary Tour Buy Tickets Fri 26 Sep Lake Street Dive Sold Out! Sat 27 Sep DESTIN CONRAD – LOVE ON DIGITAL TOUR Buy Tickets Sun 28 Sep The Bouncing Souls Buy Tickets Wed 01 Oct Buckcherry/Michael Monroe Tour Buy Tickets Fri 03 Oct Noga Erez w/ V1V1D – The Vandalist Tour Buy Tickets Sat 04 Oct RIESPECT FEST: The Ries Brothers and Nick Hexum of 311 Buy Tickets Sun 05 Oct Runaway GIn: a Tribute to Phish Buy Tickets Tue 07 Oct Lil Tecca Buy Tickets Wed 08 Oct SOLD OUT: Kublai Khan TX Sold Out! Thu 09 Oct Dabin Buy Tickets Fri 10 Oct The Fray w/ Very Gently Sold Out! Sat 11 Oct Marianas Trench w/ The Summer Set and senses Buy Tickets Sun 12 Oct SOLD OUT: Shaboozey Sold Out! Tue 14 Oct The Band Camino The Band CAMINO: The NeverAlways Tour with special guest almost monday The Band Camino Buy Tickets Thu 16 Oct Phantogram Buy Tickets Fri 17 Oct SOLD OUT: Magdalena Bay: Imaginal Mystery Tour Sold Out! Fri 26 Sep Lake Street Dive Sold Out! Sat 27 Sep DESTIN CONRAD – LOVE ON DIGITAL TOUR Buy Tickets Sun 28 Sep The Bouncing Souls Buy Tickets Wed 01 Oct Buckcherry/Michael Monroe Tour Buy Tickets Fri 03 Oct Noga Erez w/ V1V1D – The Vandalist Tour Buy Tickets Sat 04 Oct RIESPECT FEST: The Ries Brothers and Nick Hexum of 311 Buy Tickets Sun 05 Oct Runaway GIn: a Tribute to Phish Buy Tickets Tue 07 Oct Lil Tecca Buy Tickets Wed 08 Oct SOLD OUT: Kublai Khan TX Sold Out! Thu 09 Oct Dabin Buy Tickets Fri 10 Oct The Fray w/ Very Gently Sold Out! Sat 11 Oct Marianas Trench w/ The Summer Set and senses Buy Tickets Sun 12 Oct SOLD OUT: Shaboozey Sold Out! Tue 14 Oct The Band Camino The Band CAMINO: The NeverAlways Tour with special guest almost monday The Band Camino Buy Tickets Thu 16 Oct Phantogram Buy Tickets Fri 17 Oct SOLD OUT: Magdalena Bay: Imaginal Mystery Tour Sold Out! Sat 18 Oct Noah Cyrus Buy Tickets Sun 19 Oct 2hollis – The Star Tour Buy Tickets Mon 20 Oct Iam Tongi – Fall 2025 North America Tour Buy Tickets Fri 24 Oct Thrice – Fall Tour 2025 Buy Tickets Tue 16 Sep The Plot In You Buy Tickets Sun 21 Sep Rome “Formerly of Sublime with Rome”w/ Evening Elephants, Beach Fly & Jordan Fletcher Buy Tickets Wed 24 Sep Aidan Bissett: shut up and love me tour Buy Tickets Thu 25 Sep B.o.B – Adventure of Bobby Ray 15th Anniversary Tour Buy Tickets Fri 26 Sep Lake Street Dive Sold Out! Sat 27 Sep DESTIN CONRAD – LOVE ON DIGITAL TOUR Buy Tickets Sun 28 Sep The Bouncing Souls Buy Tickets Wed 01 Oct Buckcherry/Michael Monroe Tour Buy Tickets Fri 03 Oct Noga Erez w/ V1V1D – The Vandalist Tour Buy Tickets Sat 04 Oct RIESPECT FEST: The Ries Brothers and Nick Hexum of 311 Buy Tickets Sun 05 Oct Runaway GIn: a Tribute to Phish Buy Tickets Tue 07 Oct Lil Tecca Buy Tickets Wed 08 Oct SOLD OUT: Kublai Khan TX Sold Out! Thu 09 Oct Dabin Buy Tickets Fri 10 Oct The Fray w/ Very Gently Sold Out! Sat 11 Oct Marianas Trench w/ The Summer Set and senses Buy Tickets Sun 12 Oct SOLD OUT: Shaboozey Sold Out! Tue 14 Oct The Band Camino The Band CAMINO: The NeverAlways Tour with special guest almost monday The Band Camino Buy Tickets Thu 16 Oct Phantogram Buy Tickets Fri 17 Oct SOLD OUT: Magdalena Bay: Imaginal Mystery Tour Sold Out! VIEW ALL SHOWS VIP Upgrade Elevate your experience with exclusive access. Upgrade your night with a VIP Suite or Table and enjoy: PRIVATE BALCONY VIEWS AIR-CONDITIONED LOUNGES DEDICATED FOOD & BEVERAGE SERVICE VIP-ONLY RESTROOMS SKIP-THE-LINE ENTRY Limited availability per event – book your VIP experience now! Contact Kendall Doran at kendall@jannuslive-com.preview-domain.com or 727-688-5708. Explore VIP Packages LEARN MORE PLAN YOUR VISIT Make the most of your Jannus Live experience. Location : 200 1st Avenue N, St. Petersburg, FL 33701 Parking : Multiple garages and street parking nearby Where to Stay : Plenty of hotel options within walking distance MORE INFO JANNUS INFO The history. The legend. For decades, Jannus Live has been a mecca of Florida’s music scene. We’ve hosted some of the biggest names in rock, reggae, hip-hop, electronic, and alternative music to date. Explore Our History & Gallery Private Events Host your event in an unforgettable setting. Looking for a unique venue for your next big event? Jannus Live offers a celebrated open-air courtyard, VIP lounges, and private suites. LEARN MORE JOIN THE JANNUS LIVE MAILING LIST Join the Jannus Live email newsletter to stay updated on exclusive concert announcements,ticket discounts, and special events at your favorite venue. Email SIGN UP JANNUS LIVE Experience Live Music Like Never Before in the\nHeart of St. Pete, where legendary performances\nmeet an unforgettable atmosphere. Instagram Facebook-f Address 200 1st Ave N STE 206, St. Petersburg, FL 33701, United States SHOWS VIP UPGRADE VISIT ABOUT CONTACT 2025 Jannus Live"
    },
    {
      "url": "https://www.jannuslive.com/events/knock2/",
      "text": "Knock2 – Jannus Live Skip to content Shows VIP UPGRADE VIP Suites Table Visit About Contact Shows VIP UPGRADE VIP Suites Table Visit About Contact Instagram Facebook-f Knock2 Saturday 01 Mar / 07:00PM On sale $30 0 0 Days 0 0 Hours 0 0 Minutes 0 0 Seconds GET TICKETS JannusLive is an outdoor, STANDING ROOM ONLY venue that is committed to providing a safe and secure environment for our guests. Please review our safety and security information below PRIOR to arriving at the venue. All ticket prices are subject to increase on the day the of event. Please arrive early to the venue to allow enough time for you and your guests to move through the queue and enter the venue. Prior to entering the venue, guests will be searched (wand and/or pat-downs) to ensure that none of the restricted items enters the courtyard We suggest you leave valuable and unnecessary items at home. You may be asked to empty your pockets of all items so that they can be examined. All alcohol and narcotic laws will be strictly enforced. All bags will be searched, and no large bags or backpacks will be allowed (larger than a standard sheet of paper). We reserve the right to refuse entry to anyone. If you see something that concerns you, please say something to our management or security so we can ensure the best experience possible Restricted Items: Considering recent events, the following items are strictly prohibited No guns, knives, weapons, pepper spray, projectiles of any kind, or any other item that could be used to inflict harm. Replicas of weapons are also NOT permitted No large purses, bags or backpacks will be allowed (larger than a standard sheet of paper). No drugs, drug paraphernalia, or illegal substances of any kind No outside food or drinks No blankets, lawn chairs and/or any other personal furniture, please see FAQs for email info@jannuslive.com or questions regarding ADA No umbrellas, Jannus Live is an outdoor venue, so please plan accordingly No personal video cameras, Go-Pros, selfie sticks, drones, masks or laser pointers. No professional audio, video, or audio recording equipment – (including detachable lenses, tripods, zooms or commercial use rigs) For press pass access, please contact the artist or their management directly. No pet, please see our FAQs or email info@jannuslive.com for questions regarding service animals This list of prohibited items is subject to change at the discretion of venue management Other Important Rules for our Venue We are an outdoor, STANDING ROOM ONLY venue All tickets are considered General Admission, unless specifically noted VIP. If your ticket was purchased from either Ticketmaster or AXS.com, they may print with a seat number. This is something we cannot control on their printed tickets and is not a real seat. Jannus Live does not have seating of any kind. All shows are considered ALL-AGES unless specifically noted on the website or flyer, however we always recommend parental discretion based on the artist content and our bar-like environment. Jannus Live does not have a specific ADA section, however we are 100% wheel chair accessible and allow for certain types of medical equipment to be used in the venue. For specific questions please email info@jannuslive.com All concerts are considered RAIN OR SHINE, with the exception of extremely severe weather. Cancellations due to weather are rare and are announced as early as possible via this website and social media. Please note, UMBRELLAS are prohibited, but we do sell ponchos! JOIN THE JANNUS LIVE MAILING LIST Join the Jannus Live email newsletter to stay updated on exclusive concert announcements,ticket discounts, and special events at your favorite venue. Email SIGN UP JANNUS LIVE Experience Live Music Like Never Before in the\nHeart of St. Pete, where legendary performances\nmeet an unforgettable atmosphere. Instagram Facebook-f Address 200 1st Ave N STE 206, St. Petersburg, FL 33701, United States SHOWS VIP UPGRADE VISIT ABOUT CONTACT 2025 Jannus Live"
    },
    {
      "url": "https://www.tampabay.com/news/pinellas/2025/04/30/jeff-knight-steps-down-jannus-live-after-boat-crash/",
      "text": "Jeff Knight steps down from Jannus Live after boat crash Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement News / Pinellas Jeff Knight steps down from Jannus Live after boat crash The announcement was made days after a boat crash involving the Clearwater Ferry. Jeff Knight is seen on the phone while sitting in a boat that authorities say collided with the Clearwater Ferry on Sunday, resulting in one death and multiple injuries. [ DOUGLAS R. CLIFFORD  |  Times ] By Chris Tisch Times staff Emily Wunderlich Times staff Jack Prator Times staff Published | Updated Chris Tisch is the senior news editor overseeing breaking news, criminal justice, weather and environment. Reach him at tisch@tampabay.com. Emily Wunderlich Midday Editor Jack Prator is a reporter covering breaking news and environment. Reach him at jprator@tampabay.com. MORE FOR YOU Democrat Jennifer Jenkins is challenging Ashley Moody for US Senate • The Buzz on Florida Politics Florida Holocaust Museum reopens with giant rescue boat, Elie Wiesel artifacts • History Advertisement Clearwater man who killed ex in front of daughter gets life in prison • Crime British pub The Moon Under Water finally has a new home • Food Is the Trump-DeSantis rivalry back on? Look out for 2026. • The Buzz on Florida Politics Tampa Bay school districts adopt budgets amid declining enrollment • The Education Gradebook Lawn tyranny in Tampa Bay’s rainy season | Column • Viewpoints With no more vaccine mandates, who are the most at risk in Florida? • Health Hillsborough school board votes to remove more books • Hillsborough Dick’s Sporting Goods completes multibillion-dollar deal to acquire Foot Locker • Business Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.tampabay.com/news/health/2019/10/29/news-of-a-nasty-rash-goes-viral-officials-investigate-the-pelican-pub/",
      "text": "News of a nasty rash goes viral. Officials investigate the Pelican Pub. Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement News / Health News of a nasty rash goes viral. Officials investigate the Pelican Pub. Health inspectors made notes about bed bugs and cleaning formula. The downtown St. Pete bar will close until the issue is resolved. Lauren Bedor, 31, visited the Pelican Pub in June. Days after, her legs broke out in a red, irritated rash that took weeks to resolve. [ Inset photo courtesy of Lauren Bedor; Times (2010) ] By Justine Griffin Times staff Published | Updated Justine Griffin Economy and Health Editor MORE FOR YOU Democrat Jennifer Jenkins is challenging Ashley Moody for US Senate • The Buzz on Florida Politics With no more vaccine mandates, who are the most at risk in Florida? • Health Advertisement Manatee could be 2nd Florida county to crack down on kratom. What to know • Health Can ‘everybody’ get the new COVID-19 vaccine? | Fact check • Health I ran the Florida Department of Health. Dr. Ladapo is endangering our children | Column • Viewpoints Florida governor hopefuls react to DeSantis ending vaccine requirements • The Buzz on Florida Politics At CDC, worries mount that agency has taken anti-science turn • Health School leaders react to Florida plan to axe vaccine mandates: ‘That’s so crazy’ • The Education Gradebook Skittles, slushies and gummies: The delta-8 products on sale in Tampa Bay • Health Federal funding loss closed Florida’s only drop-in center for the homeless • Tampa Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://www.hospitalityandcateringnews.com/2022/06/the-pelican-notting-hill/",
      "text": "Whispers of The Pelican in Notting Hill investigated... - Hospitality & Catering News Latest News Restaurant News Hotel News Catering News Chef News Pub & Bar News Supplier News Hospitality & Catering News hospitality and catering news Whispers of The Pelican in Notting Hill investigated… June 9, 2022 By Denis Sheehan, Publisher, H&C News: Whispers of The Pelican in Notting Hill investigated… We have heard a few whispers that The Pelican in Notting Hill is fast becoming a haunt frequented by the great and good of the food world, so we asked someone in the know for more info… The Pelican has been a pub in Notting Hill on All Saints Road since 1870, but was recently acquired by new owners and, following a full restoration and soft opening period, it has relaunched as a pub and dining room. Restaurateur James Gummer, along with co-owners Phil Winser and Richard Squire, and Head Chef Owen Kenworthy, have redesigned and refurbished the site to create what they describe as “a place that becomes a cornerstone of the local community, not just somewhere to eat and drink”. Owen Kenworthy’s background is impressively broad, ranging from The Wolseley and Sketch to Primeur and Brawn, where he was Head Chef alongside Ed Wilson when it opened in 2010. His cooking style is rustic, modern executions of classic British and European cuisine. The focus is on the finest British produce, with sustainability also a fundamental priority, and engaging suppliers who use regenerative farming methods, where possible. Typical dishes on the dining room menu include: Raw beef with Gentleman’s Relish, Ham hock with egg mayo, Potted shrimp, Onglet and shallot, and Lobster and monkfish pie with lobster head gravy. Various cuts of beef are butchered on-site, and a ‘5th Quarter Pie’ makes use of the offal.  Desserts include Lemon posset with shortbread; and Ginger Parkin and custard, made with Owen’s family recipe. The pub offering is more casual with options such as Mince on toast; Welsh rarebit; Sausage roll; and Spider crab toast. A wide selection of British beers includes Allsopp’s IPA, Portobello Pilsner, and Deya.  In addition to classic cocktails and a concise 40-bin wine list (glasses from £5/bottles from £25), a constantly evolving single bottle wine list is available. James Gummer – who oversees the day-to-day operations – also owns 7 Saints restaurant, located further down All Saints Road, which opened in 2018.  His career in hospitality began at The Smile in New York, followed by roles at The Wolseley and the Santa Cruz group’s Isabel in Mayfair.  Fellow co-founder Phil Winser recently returned to London from New York, where he spent the last 12 years operating the Silkstone Group and hugely successful The Fat Radish (including co-writing The Fat Radish Kitchen Diaries). The dining room accommodates up to 48, while the pub/bar area can seat 40 (16 of those in a small section by the fireplace), and up to 24 outdoors, with license for standing drinkers. The Pelican Room on the upper level – for private hire and events – can seat up to 30, and has its own bar.  The understated design throughout – devised by the three owners – features warm lighting and cosy tan leather banquettes, original fireplaces, and antique furniture. Enthusing about the objectives of The Pelican to play a vital role in the neighbourhood, James Gummer stated: “We want it to be fun for our guests to join us for not only dining and drinking, but also for any of the planned regular events and activities in the building, from film and jazz nights, to boxing, bridge and pilates classes.” Aiming to create a ‘town hall’ environment for the surrounding community, the team opens up the Pelican Room to local council meetings and the Tavistock Gardens Residents’ Association. The Pelican also sponsors the Rugby Portobello Under 12s, a team at the local Football Academy funded by the Rugby Portobello Trust. We might ask the same ‘someone in the know’ if they could arrange for a table soon, if so full report to follow, the Onglet and shallot looks a must. CURRENT OPENING HOURS The Pelican is open daily THE DINING ROOM: Lunch Saturday and Sunday Noon-3.30pm Dinner Monday-Saturday 6pm-10pm; Sunday 6pm-9pm THE PUB:  Monday-Thursday 5pm-Midnight; Friday-Saturday Noon-Midnight; Sunday Noon-10.30pm (Bar menu available throughout pub opening hours) The Pelican – 45 All Saints Road, London W11 1HE Telephone – 020 4537 2880, or Email – bookings@thepelicanw11.com Website – www.thepelicanw11.com  Instagram – @thepelican_w11 Zest Quest Asia announced beneficiary of the H&C News Golf Day in association with Meiko UK Email Newsletter Subscribe to our email newsletter and keep a close eye on the UK hospitality and catering business Search h&C NEWS Facebook Twitter Join our email newsletter community here Supplier News Condensation, Damp and Mould: The Hidden Autumn Hazards in Commercial Kitchens Kitchen Porter of the Month recognising an array of talent from across our industry Riso Gallo Celebrates National Rice Week with Sustainability, Quality, and Kitchen-Ready Innovation Transforming Accessible Tourism Thai Sweet Chilli Sauce Joins Country Range’s Sauce Assortment Wafflemeister Partners With TRGC for First Airport Opening Country Range Store Cupboard Enhanced With Addition of Multi-Use Tomato Sauce HEWI Joins Accessible Hospitality Alliance as Sponsor Partner, Deepening Commitment to Accessible Design Hyde London City Unveils Adaptogenic Iced Coffee Collaboration with London Nootropics HancNews News Categories Latest News Restaurant News Hotel News Catering News Chef News Pub & Bar News Supplier News Home | Privacy | Sitemap Copyright © · Hospitality & Catering News"
    },
    {
      "url": "http://pelicanpromo.com/ContactUs",
      "text": "Contact Us - Pelican Promotions & Advertising Specialities Office Location 4425 Bluebonnet Rd Baton Rouge, LA  70809-2645 Phone: (225) 291-0600 Fax: (225) 291-0607 E-mail: stephanie@pelicanpromo.com Sign in | Create Account Home Product Search Top Searches YETI pens lanyard tote bag can cooler lanyards BG100 Owala Pen sunglasses tote bags scarf koozie cooling towel ACM1026 tent temporary tattoos stress balls playing cards water bottle Top Categories Awards Bags Bandannas Blankets Bottled Water Bottles Decals & Labels Golf Accessories Hand Sanitizers Kits Lanyards Microfiber Cloths Mouse Pads Pet Items Stools Sunglasses Tote Bags Travel Mugs and Cups Wristbands Product Collections Patriotic Products Back to the Beach School Store Breast Cancer Awareness Computer Accessories Holiday Gifts Food & Drink Employee Recognition About Us Contact Us More News & Videos Error Search Search all Products Go Contact Us Need assistance? We are here to help. To inquire about the products and services found on our website, please contact us by phone or e-mail, and we'll gladly assist you. Office Location 4425 Bluebonnet Rd Baton Rouge, LA  70809-2645 Phone: (225) 291-0600 Fax: (225) 291-0607 E-mail: stephanie@pelicanpromo.com WELCOME! Looking for promotional products?  You've come to the right site!  Whether you are looking for a specific item or just browsing for ideas, our site is your one-stop source. Read More Newsletter Submit your e-mail address to get the latest deals and promos. Submit Office Location 4425 Bluebonnet Rd Baton Rouge, LA  70809-2645 Phone: (225) 291-0600 Fax: (225) 291-0607 E-mail: stephanie@pelicanpromo.com Powered by ASI. Privacy Policy and Notice of Collection Terms of Service"
    },
    {
      "url": "https://pelicanhotel.com/contact/",
      "text": "Contact - Pelican Hotel Miami Beach Skip to content Contact MORE MORE Hotel HOTEL Story Gallery Press Location & Arrival Story Gallery Press Location & Arrival BOOK NOW BOOK NOW LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 CONTACT US +1 305-673-3373 EMAIL reservation@pelicanhotel.com NEWS The Pelican Hotel Blog Facebook-square Instagram Linkedin Youtube Rooms ROOMS Penthouse One Suite King Executive Suite King Ocean View Suite Queen Deluxe King Suite Accesible Deluxe King Suite Deluxe Queen Ocean View Deluxe Queen Bohemian Deluxe Queen Suite Deluxe Queen Deluxe Twin Deluxe Twin Accessible BOOK NOW BOOK NOW LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 CONTACT US +1 305-673-3373 EMAIL reservation@pelicanhotel.com NEWS The Pelican Hotel Blog Facebook-square Instagram Linkedin Youtube Pelican Cafe PELICAN CAFE Restaurant Book a table Kitchen Pelican Cafe Bar Corporate & Gatherings Restaurant Book a table Kitchen Pelican Cafe Bar Corporate & Gatherings BOOK A TABLE BOOK NOW LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 CONTACT US +1 305-673-3373 EMAIL reservation@pelicanhotel.com NEWS The Pelican Hotel Blog Facebook-square Instagram Linkedin Youtube Room 55 Experience Miami Offers BOOK NOW BOOK NOW BOOK NOW BOOK NOW Need more info or just want to say hi? We would love to hear from you! Get in touch with us and leave a message in the attached form. Your Name Email Phone Number Message I accept the Privacy Policy Send Contact How to get here Hotel Policies Arrival Get Arround Accessibility Careers Catering & Events Phone: + 1 305 673 3373 WhatsApp: +1 305 699 7830 Email: reservation@pelicanhotel.com Address: 826 Ocean Drive, Miami Beach, FL. 33139 Get Here: Pelican Hotel, located at 826 Ocean Drive, Miami Beach, FL 33139 From Miami International Airport (MIA): By Car: Head east on FL-836 E from the airport. Merge onto I-395 E toward Miami Beach. Continue onto MacArthur Causeway. Turn left onto Collins Avenue. Turn right onto 8th Street. Continue onto Ocean Drive. Pelican Hotel will be on your left at 826 Ocean Drive. By Public Transportation: Take the MIA Mover from the airport to the Miami Central Station. Transfer to the Orange Line of Miami-Dade Metrorail heading towards Dadeland South. Get off at Government Center Station and transfer to the Southbound C Local Metrobus. Get off at 9th Street & Washington Avenue. Walk east on 9th Street towards Ocean Drive. Turn left on Ocean Drive, and Pelican Hotel will be on your right. From Port of Miami: By Car: Head west on Port Boulevard. Continue onto I-395 W. Merge onto MacArthur Causeway. Turn left onto Collins Avenue. Turn right onto 8th Street. Continue onto Ocean Drive. Pelican Hotel will be on your left at 826 Ocean Drive. By Public Transportation: Unfortunately, there is no direct public transportation route from the Port of Miami. A taxi or rideshare service would be recommended. From Fort Lauderdale-Hollywood International Airport (FLL): By Car: Take I-595 E from the airport. Merge onto I-95 S toward Miami. Take exit 4 toward I-195 E/Miami Beach. Continue onto W 41st Street/Arthur Godfrey Road. Turn right onto Indian Creek Drive. Continue onto Collins Avenue. Turn left onto 8th Street. Continue onto Ocean Drive. Pelican Hotel will be on your left at 826 Ocean Drive. By Public Transportation: Take the Tri-Rail Shuttle to Fort Lauderdale Airport Station. Board the Tri-Rail train heading south to the Metrorail Transfer Station. Transfer to the Orange Line of Miami-Dade Metrorail heading towards Dadeland South. Get off at Government Center Station and transfer to the Southbound C Local Metrobus. Get off at 9th Street & Washington Avenue. Walk east on 9th Street towards Ocean Drive. Turn left on Ocean Drive, and Pelican Hotel will be on your right. Remember to check for any updates or changes in transportation options, and consider traffic conditions when traveling by car. Safe travels! Check-in – 4:00 PM Check-out – 11:00 AM Internet – Free WiFi is available in all areas of the hotel. Resort Fee – There is a service fee of $38.00 per night. Plus tax Parking – The parking fee is $42 per night before taxes. Unlimited in/out access Eligible Age to check-in – 21 years Pets are welcome! – We allow one dog 30lbs or under. There is a fee of $25 per night plus a onetime clean up fee of $150.00 *Pet reservations must be re approved by the hotel prior to arrival. Children – Children 12 sleeping in the same bed as parents stay free. Children Over 12 pay 3 rd occupancy rate plus extra bed rate. Extra Beds & Cribs – Rollaway beds in approved rooms subject to availability. $75 per day. Cribs are available, subject to availability and carry a rental fee of $75.00 per stay. Smoking – Our hotel is 100% non-smoking, sorry, no smoking is allowed. Guest Payment Options – We accept American Express, Visa, Euro/Mastercard, and Discover cards. Guest Information Required for Reservations and at Check-in: Guests will be required to provide a valid ID and at check-in.‍ All guests staying in the hotel must be registered with the front desk. Credit/Debit Card Pre-authorizations & Charges: Guest credit cards will be pre-authorized and charged for the first night room and tax prior to arrival. Credit/Debit Card Charges at Check-in: A $300 deposit will be held on the credit card provided at check in to cover incidental charges and damage upon check-in, and it will be released back to the same payment method at check out Cancellation policies: We offer free cancellations up to 72 hours prior to arrival, but early departures within this window are non-refundable. Please note that non-refundable rates are, as the name suggests, non-refundable. We’re excited to welcome you to the Pelican Hotel in the heart of Miami Beach! To ensure a smooth and enjoyable arrival experience, please take note of the following details: Address Information: Pelican Hotel 826 Ocean Drive Miami Beach, FL 33139 Tel: 305-673-3373 Check-In Time: Check-In Time: 4:00 PM EST. Please note that we cannot guarantee early check-in. To ensure access to guest rooms for guests traveling overnight, we recommend booking the night prior to facilitate early room availability. As a courtesy, the hotel will hold your bags on your day of arrival until your room is ready for check-in, allowing you time to explore the city. Check-Out Time: Check-Out Time: 11:00 AM EST. We regret that we cannot guarantee late check-out due to incoming guests. However, we would be pleased to hold your bags until you are ready to depart for the airport, port, or next destination. Please note that we do not hold bags once you have checked out of the hotel. Parking: For guests arriving by car, we offer valet parking at the Pelican Hotel for $42.00 per day with in/out services. Please approach the hotel entrance upon arrival, and our valet attendants will assist you with parking arrangements. Airport Transportation: For guests arriving at Miami International Airport (MIA) or Fort Lauderdale-Hollywood International Airport (FLL), or Ports, we recommend transportation options such as taxis, ride-sharing services, and rental cars. Please contact our concierge team for assistance and pricing with arranging private limo airport transportation in advance. Special Requests: We strive to accommodate our guests needs and preferences to ensure a memorable stay. If you have any special requests or require additional assistance during your arrival, please inform us in advance, and we’ll do our best to accommodate you. We look forward to welcoming you and making your stay with us unforgettable! Welcome to the Pelican Hotel Miami Beach! To make your stay even more enjoyable, here are some convenient transportation options for exploring the vibrant city of Miami Beach. Public Transportation Miami-Dade Transit (MDT): The Miami-Dade Transit system offers extensive bus routes and Metrorail services throughout the city. Bus stops are conveniently run along Collins Avenue and Washington Avenue, providing easy access to the Government Center Metrorail station in downtown Miami. Metrorail: Metrorail is a rapid transit system serving Miami-Dade County with convenient connections to downtown Miami and other major destinations (like the speed train to Orlando) From Government Center Metrorail Station, you can also take the Metrorail Orange line towards Miami International Airport (MIA) Disembark at the next stop, Miami Central Station Take the Brightline train to Orlando Additionally, keep in mind that transportation options and schedules may change, so it’s best to verify the current information closer to your travel date. Hop-on-Hop-off: The Red Bus is a popular hop-on hop-off tour service that allows visitors to discover Miami Beach, Little Havana, Wynwood, Coconut Grove and other top attractions. The buses are double-decker, providing great views of the city as you travel. Passengers can hop on and off at any designated stops along the route, making it easy to explore different areas of Miami Beach. See the concierge for pricing. Free Rides and Shuttle Services Freebee: Freebee offers on-demand, eco-friendly transportation within specific areas of Miami Beach. Download the Freebee app to request a ride and enjoy complimentary transportation to nearby attractions, restaurants, and shops. Miami Beach Trolley: The Miami Beach Trolley is a free transportation option that connects popular destinations within Miami Beach, including South Beach, North Beach, and Mid-Beach. Look for the nearest trolley stop close to the Pelican Hotel to hop on board and explore the area hassle-free. Additional Transportation Options Ride-Sharing Apps: Utilize popular ride-sharing apps like Uber and Lyft for convenient door-to-door transportation around Miami Beach. Simply request a ride through the app, and a driver will pick you up at the Pelican Hotel and take you to your desired destination. Bicycle Rentals: CitiBikes Conveniently located across the street with numerous dock stations around Miami Beach.  The solar-powered bike sharing system consists of a fleet of specially designed, sturdy, very durable bikes that are locked into a network of docking stations sited at regular intervals around a city. With 160+ station locations and more on the way, bikes are available to use 24 hours a day, 365 days a year. There are two distinct ways to utilize the Citi Bike program, Hourly Rental. Explore Miami Beach at your own pace. Accessibility Commitment at Pelican Hotel At Pelican Hotel, we are dedicated to ensuring that our website is accessible to all individuals, regardless of their circumstances and abilities. Our commitment extends to conforming with the Web Content Accessibility Guidelines (WCAG 2.0, Level AA) set forth by the World Wide Web Consortium (W3C). Guiding Principles The WCAG guidelines provide a comprehensive framework for enhancing web content accessibility, specifically designed to accommodate users with disabilities. We strive to align our website closely with these principles to create an inclusive and user-friendly online environment. Ongoing Efforts While we work diligently to uphold accessibility standards throughout www.pelicanhotel.com, we acknowledge that achieving perfection in every aspect can be challenging. Our team is actively engaged in an ongoing effort to address any areas where compliance may be currently lacking. Dynamic Nature of the Website Please be aware that our website is dynamic and regularly updated to provide fresh and relevant content. Due to this dynamic nature, minor accessibility issues may occasionally arise. Rest assured, we are committed to promptly identifying and rectifying any such issues as they occur. Continuous Improvement Pelican Hotel is dedicated to ensuring that every section of our website attains the highest level of web accessibility. We are continually exploring and implementing solutions to elevate the overall accessibility of our site, fostering an inclusive online experience for all users. Your Feedback Matters Your input is invaluable to us. If you have any comments or suggestions regarding the accessibility of our site, please do not hesitate to contact our accessibility coordinator. You can reach us via email at reservation@pelicanhotel.com or by phone at 305-673-3373. Your feedback plays a crucial role in our ongoing efforts to enhance accessibility, and we appreciate your assistance in making our website more accessible for everyone. Thank you for choosing Pelican Hotel. BOOK Book a Room Book a Table NAVIGATE Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ ROOMS Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Suite King Ocean View Suite King Executive Penthouse One Facebook-square Instagram Linkedin Youtube Copyright © 2025 Pelican Hotel. Carefully crafted by Subsign CONTACT US +1 305-673-3373 Contact us here LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 EMAIL reservation@pelicanhotel.com restaurant@pelicanhotel.com NEWSLETTER I accept the Privacy Policy Submit Terms and Conditions Privacy Policy Cookie Policy Hotel Policies Pet Policy Accessibility Copyright © 2025 Pelican Hotel Facebook-square Instagram Linkedin Youtube BOOK Book a Room Book a Table CONTACT US +1 305-673-3373 LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 EMAIL reservation@pelicanhotel.com restaurant@pelicanhotel.com ROOMS Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Suite King Ocean View Suite King Executive Penthouse One NEWSLETTER I accept the Privacy Policy Submit Hotel Policies Pet Policy Accessibility Terms and Conditions Privacy Policy Cookie Policy Copyright © 2025 Pelican Hotel Carefully crafted by Subsign BOOK Book a Room Book a Table ROOMS Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Suite King Ocean View Suite King Executive Penthouse One NEWSLETTER I accept the Privacy Policy Submit CONTACT US +1 305-673-3373 LOCATION 826 Ocean Drive, Miami Beach, FL. 33139 EMAIL reservation@ pelicanhotel.com restaurant @ pelicanhotel.com NAVIGATE Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ Hotel Rooms Pelican Cafe Room 55 Experience Miami Offers Blog FAQ Hotel Policies Pet Policy Accessibility Terms and Conditions Privacy Policy Cookie Policy Copyright © 2025 Pelican Hotel Carefully crafted by Subsign MORE MORE MORE MORE BOOK NOW BOOK NOW WELCOME TO MIAMI! 8:25 AM   / Miami, FL 81° Sunny Miami, FL 10 days weather forecast ▸ Home Hotel Story Gallery Press Location & Arrival Rooms Deluxe Queen Bohemian Deluxe Queen Deluxe Twin Deluxe Twin Accessible Deluxe King Suite Deluxe King Suite Accessible Deluxe Queen Suite Deluxe Queen Ocean View Suite Queen Ocean Front Suite King Suite King Executive Penthouse One Pelican Cafe Restaurant Book a table Kitchen Pelican Cafe Bar Corporate&Gatherings Room 55 Experience Miami Offers CONTACT US +1 305-673-3373 Location 826 Ocean Drive, Miami Beach, FL. 33139+1 305-673-3373 Email reservation@pelicanhotel.com Facebook-square Instagram Linkedin Youtube CONTACT US +1 305-673-3373 Location 826 Ocean Drive, Miami Beach, FL. 33139+1 305-673-3373 Email reservation@pelicanhotel.com Facebook-square Instagram Linkedin Youtube Everything worked perfectly! Our team will review your inquiry and contact you within 24 hours. HOME HOME"
    },
    {
      "url": "https://www.jannuslive.com/visit/",
      "text": "Visit – Jannus Live Skip to content Shows VIP UPGRADE VIP Suites Table Visit About Contact Shows VIP UPGRADE VIP Suites Table Visit About Contact Instagram Facebook-f Visit Your Ultimate Concert Experience Starts Here FROM PARKING TIPS TO NEARBY HOTELS, HERE’S EVERYTHING YOU NEED TO KNOW BEFORE YOUR VISIT: Address: 200 1st Avenue N, St. Petersburg, FL 33701 KNOW BEFORE YOU GO Rain or Shine: All concerts happen as scheduled, no matter the weather.\n(Umbrellas are not permitted , but ponchos are available for purchase .) STANDING ROOM ONLY: Jannus live is a general admission, standing-only venue—there is no seating. BAG POLICY: Small bags only—no backpacks or large purses. SECURITY CHECKS: All guests are subject to screening at entry.IS NO SEATING. ALL AGES WELCOME: Unless noted otherwise, our events are all ages. However, parental discretion is advised. WHERE TO STAY Make a night of it! There are plenty of hotels within walking distance\nof Jannus Live. Courtyard St. Petersburg Downtown The Vinoy Resort & Golf Club The Cordova Inn Hyatt Place St. Petersburg Downtown The Hollander Hotel The Avalon FIND HOTELS NEARBY WHERE TO PARK Parking Options Sundial Parking Garage (117 2nd Street N) SouthCore Parking Garage (100 1st Avenue S) Pro Tip: Arrive early to allow time for parking and entry. GET DIRECTIONS RESTRICTED ITEMS The following items are stringly prohibited: No guns, knives, weapons,\npepper spray, projectiles\nof any kind, or any other\nitem that could be used\nto infict harm. Replicas of weapons\nare also NOT permitted. No large purses,\nbags or backpacks\nwill be allowed (larger\nthan a standard sheet\nof paper). No drugs, drug\nparaphernalia, or\nillegal substances\nof any kind. No outside food or\ndrinks No blankets, lawn chairs\nand/or any other personal\nfurniture, please see FAQs or\nemail info@jannuslive.com\nfor questions regarding ADA No umbrellas,\nJannus Live is\nan outdoor venue,\nso please plan\naccordingly No personal video\ncameras, Go-Pros,\nselfe sticks, drones,\nor laser pointers. No professional audio,video, or audio recor-\nding equipment – (in-\ncluding detachablelenses, tripods, zooms\nor commercial use No pet, please see\nour FAQs or email\ninfo@jannuslive.com\nfor questions\nregarding service\nanimals ACCESSIBILITY Jannus Live is a standing-room-only concert venue , which means we do not have seating available and cannot permit personal chairs to be brought into the venue. However, we are fully wheelchair accessible. While we understand that you may not typically use such items, they could be a safe and practical option if you need to rest during the event. Below is a list of mobility devices that are permitted as reasonable accommodations under our standing-room-only policy: -Walkers (with or without a seat) -Rollators (with or without a seat) -Canes (with or without a seat) -Crutches -Wheelchairs -Power wheelchairs -Mobility scooters Please note, in accordance with ADA regulations, if you are using a cart or powered mobility device, while we won’t inquire about the specifics of your disability, we may request “credible assurance” of its use for accessibility. This could include: -A valid, state-issued disability parking placard. -Other state-issued proof of disability. -A personal statement affirming its use for a disability (unless behavior contradicts this statement). If you have further questions or need assistance, feel free to contact Megan Barnes directly at megan@jannuslive.com . FAQ Q. What is your camera policy? The standard venue policy allows camera phones, disposable cameras, and small digital cameras. Any camera with a detachable lens or a lens that extends more than 1 inch will be considered professional and is not permitted. Some artists may have specific restrictions, so please check for the show you will be attending. Q. What is your COVID-19 policy? Currently, there are no restrictions or mandates for guests to wear masks, social distance, present a negative COVID test, or show proof of vaccination. Q. Do you have seating? Jannus Live is an outdoor standing room only venue with no seating permitted. For questions related to ADA accessibility, please email info@jannuslive.com. Q. What are your office hours? Monday to Friday from 11 am to 6 pm. For a more timely response, please email info@jannuslive.com. Q. How do I purchase tickets? We strongly recommend purchasing tickets through our promoter-approved websites directly from the link (red box marked “TICKETS”) on www.jannuslive.com to ensure correct pricing and genuine tickets. We do not recommend purchasing tickets from other websites and cannot be responsible for their validity, pricing, or refund policy. Q. Can I purchase tickets over the phone or at your box office? Jannus Live does not have a daily box office. On the day of each concert, will call will open 15-30 minutes prior to the scheduled gate opening time. If tickets still remain for purchase, they will be sold here. For questions on purchasing tickets in advance, please email info@jannuslive.com. Q. Where do I pick up my will call tickets? Our will call window is located at the main entrance (2nd St N). This window typically opens a little before gates (roughly 15-30 minutes), based on the particular concert. Please bring your photo ID and the credit card you used to purchase the tickets. Q. Can you scan tickets from a mobile phone? We recommend printing out your tickets to expedite the entry process. However, we can accept electronic tickets from your phone. The original emailed barcode (not a screenshot) is recommended in case backup is needed for tickets that do not scan. Upon arrival, please ensure your email is open, with the ticket barcode showing, and your phone brightness is at the highest setting. Q. Can I refund my tickets? All tickets are final sale. In the rare case a concert is canceled, your tickets will be automatically refunded from your point of purchase (this applies to promoter-approved, online sales only). Jannus Live cannot control refunds for tickets purchased from unknown ticketing sources. For specific questions regarding refunds, please email info@jannuslive.com. Q. Are you wheelchair accessible? Jannus Live does not have an exclusive ADA section but is 100% wheelchair accessible and allows other types of medical equipment in the venue. For specific questions, please email info@jannuslive.com. Q. Are you an all-ages venue? All shows are considered “all ages” unless otherwise indicated on our website. However, we encourage parental discretion based on the artist’s performance/content and our bar-like environment where patrons have the option to drink and smoke cigarettes. We also encourage you to consider the volume of music played if your child is of a younger age. We do not enforce, but encourage, headphones be worn by any child under 5 years of age. Q. Do young children require a ticket for entry? The promoter of each show determines this rule for their specific concert. For entry requirements for a specific show, please email info@jannuslive.com. Q. Do you allow pets into the venue? We do not allow pets of any kind into the venue for the safety of themselves and other guests. Service animals are allowed but not recommended unless absolutely necessary due to the volume of music and capacity of guests, which could be overwhelming. For specific questions regarding service animals, please email info@jannuslive.com. Q. Do you have an ATM on the property? Yes, we have two ATMs on site for your convenience. The first is located just outside the gates, next to will call (please use this before entry), and a second is located at the back of the venue. Q. Does the show still go on if it rains? All concerts are considered rain or shine, with the exception of extremely severe weather. Cancellations due to weather are rare and are announced as early as possible via our website and social media. Please note, umbrellas are prohibited, but we do sell ponchos. Q. Can I bring my own drinks and food into the venue? No outside food or beverages, including water, are permitted inside the venue. Jannus Live provides many full-service liquor and beer bars throughout (that accept cash and credit cards), as well as a pizza stand provided by Joey Brooklyn’s Famous Pizza Kitchen. Q. Can I bring a camera into the venue? DSLRs, GoPros, and/or video cameras are strictly prohibited by the venue unless permission is granted. For press pass access, please contact the artists or their management directly. Q. What items are prohibited from the venue? The following items are strictly prohibited inside Jannus Live: weapons of any kind; backpacks, oversized bags, or large purses (larger than a standard sheet of paper); laser pens; signs; banners; food; beverages; drugs; alcohol; umbrellas; or any type of glass. Jannus Live and our security team are not responsible for any of these items left at the gate or confiscated upon entry. Please leave anything you would like to keep in your possession at home or in your vehicle. For additional information, please visit the Information page on our website or email info@jannuslive.com. JOIN THE JANNUS LIVE MAILING LIST Join the Jannus Live email newsletter to stay updated on exclusive concert announcements,ticket discounts, and special events at your favorite venue. Email SIGN UP JANNUS LIVE Experience Live Music Like Never Before in the\nHeart of St. Pete, where legendary performances\nmeet an unforgettable atmosphere. Instagram Facebook-f Address 200 1st Ave N STE 206, St. Petersburg, FL 33701, United States SHOWS VIP UPGRADE VISIT ABOUT CONTACT 2025 Jannus Live"
    },
    {
      "url": "https://jannuslive.com/contact/",
      "text": "Contact – Jannus Live Skip to content Shows VIP UPGRADE VIP Suites Table Visit About Contact Shows VIP UPGRADE VIP Suites Table Visit About Contact Instagram Facebook-f Contact Have Questions? Need VIP Access?\nPlanning an Event? WE’RE HERE TO HELP! General Manager & Venue Operations All Locations: Jannus Live, The Landing, Pelican Pub, Detroit Liquor MEGAN BARNES megan@jannuslive.com 727-565-0550 VIP Experience & Upgrades KENDALL DORAN kendall@jannuslive.com 727-688-5708 Booking & Talent Inquiries MARSHALL LOWE marshall@jannuslive.com Marketing & Press Inquiries Marketing Team info@jannuslive.com LOCATION JANNUS LIVE 200 1st Avenue N, St. Petersburg, FL 33701 Parking : Nearby garages & metered street parking available. Hotels Nearby: Walkable options include The Vinoy, Hyatt Place, and The Cordova Inn. General Inquiries: info@jannuslive.com JOIN THE JANNUS LIVE MAILING LIST Join the Jannus Live email newsletter to stay updated on exclusive concert announcements,ticket discounts, and special events at your favorite venue. Email SIGN UP JANNUS LIVE Experience Live Music Like Never Before in the\nHeart of St. Pete, where legendary performances\nmeet an unforgettable atmosphere. Instagram Facebook-f Address 200 1st Ave N STE 206, St. Petersburg, FL 33701, United States SHOWS VIP UPGRADE VISIT ABOUT CONTACT 2025 Jannus Live"
    },
    {
      "url": "https://www.jannuslive.com/events/garbage/",
      "text": "Garbage: FINAL NORTH AMERICAN HEADLINE TOUR – Jannus Live Skip to content Shows VIP UPGRADE VIP Suites Table Visit About Contact Shows VIP UPGRADE VIP Suites Table Visit About Contact Instagram Facebook-f Garbage: FINAL NORTH AMERICAN HEADLINE TOUR Saturday 06 Sep / 07:00PM 0 0 Days 0 0 Hours 0 0 Minutes 0 0 Seconds GET TICKETS JannusLive is an outdoor, STANDING ROOM ONLY venue that is committed to providing a safe and secure environment for our guests. Please review our safety and security information below PRIOR to arriving at the venue. All ticket prices are subject to increase on the day the of event. Please arrive early to the venue to allow enough time for you and your guests to move through the queue and enter the venue. Prior to entering the venue, guests will be searched (wand and/or pat-downs) to ensure that none of the restricted items enters the courtyard We suggest you leave valuable and unnecessary items at home. You may be asked to empty your pockets of all items so that they can be examined. All alcohol and narcotic laws will be strictly enforced. All bags will be searched, and no large bags or backpacks will be allowed (larger than a standard sheet of paper). We reserve the right to refuse entry to anyone. If you see something that concerns you, please say something to our management or security so we can ensure the best experience possible Restricted Items: Considering recent events, the following items are strictly prohibited No guns, knives, weapons, pepper spray, projectiles of any kind, or any other item that could be used to inflict harm. Replicas of weapons are also NOT permitted No large purses, bags or backpacks will be allowed (larger than a standard sheet of paper). No drugs, drug paraphernalia, or illegal substances of any kind No outside food or drinks No blankets, lawn chairs and/or any other personal furniture, please see FAQs for email info@jannuslive.com or questions regarding ADA No umbrellas, Jannus Live is an outdoor venue, so please plan accordingly No personal video cameras, Go-Pros, selfie sticks, drones, masks or laser pointers. No professional audio, video, or audio recording equipment – (including detachable lenses, tripods, zooms or commercial use rigs) For press pass access, please contact the artist or their management directly. No pet, please see our FAQs or email info@jannuslive.com for questions regarding service animals This list of prohibited items is subject to change at the discretion of venue management Other Important Rules for our Venue We are an outdoor, STANDING ROOM ONLY venue All tickets are considered General Admission, unless specifically noted VIP. If your ticket was purchased from either Ticketmaster or AXS.com, they may print with a seat number. This is something we cannot control on their printed tickets and is not a real seat. Jannus Live does not have seating of any kind. All shows are considered ALL-AGES unless specifically noted on the website or flyer, however we always recommend parental discretion based on the artist content and our bar-like environment. Jannus Live does not have a specific ADA section, however we are 100% wheel chair accessible and allow for certain types of medical equipment to be used in the venue. For specific questions please email info@jannuslive.com All concerts are considered RAIN OR SHINE, with the exception of extremely severe weather. Cancellations due to weather are rare and are announced as early as possible via this website and social media. Please note, UMBRELLAS are prohibited, but we do sell ponchos! JOIN THE JANNUS LIVE MAILING LIST Join the Jannus Live email newsletter to stay updated on exclusive concert announcements,ticket discounts, and special events at your favorite venue. Email SIGN UP JANNUS LIVE Experience Live Music Like Never Before in the\nHeart of St. Pete, where legendary performances\nmeet an unforgettable atmosphere. Instagram Facebook-f Address 200 1st Ave N STE 206, St. Petersburg, FL 33701, United States SHOWS VIP UPGRADE VISIT ABOUT CONTACT 2025 Jannus Live"
    },
    {
      "url": "https://www.pelican.com/us/en/support/contact-us/",
      "text": "Contact Us | Pelican Free Ground Shipping on orders over $165* Pelican.com Business Solutions US / Global CASES CASES Gun & Ammo Camera Cases Vehicle Cases Overlanding Cases Pelican Prepare Accessories View All Cases Learn More Size Small Medium Large Long Series Protector Storm Air Vault Micro Laptop Custom Foam Pistols Drones Apple Vision Pro GoPro Wine/Spirit/Beer Cigar Case Gun & Ammo Cases Protection for your handguns, rifles, shotguns, and ammunition Camera Cases Safely transport your DSLR, mirrorless cameras, memory cards and lenses on set and on location Vehicle Cargo Cases Mount-compatible cases that can be attached to your vehicle's roof rack, truck bed, or trunk Travel Cases Carry-on and check-in sizes for safe travel luggage Case Accessories Find compatible foam, padded dividers, TrekPak organizers, and more for your case Small Cases 12 inches long Recommended for storing memory cards, phones, and tools Medium Cases 12 - 22 inches long Recommended for cameras, travel, gear, and drones Large Cases 23 - 30 inches long Recommended for tall hardware, film props, heavy objects Square Cases Similar in length and width Recommended for drones and square or round objects Long Cases 30 inches long Recommended for rifles, golf clubs, bows, and tripods Protector Cases The original and classic waterproof, crushproof, dustproof case Air Cases Up to 40% Lighter than other polymer cases Storm Cases Unique Press & Pull™ latches that lock automatically and open with a light touch Vault Cases Premium protection at an affordable price Cargo Cases Ready to attach to a mount kit to your vehicle Personal Utility Cases Compact cases for storing phones, tools, first aid Laptop Cases Compact and sleek protection for your tablet, laptop, or notebook Micro Cases Small cases for every day carry items Foam Cases Pick n' Pluck and solid foam can be customized for precise shock protection No Foam Cases Maximize interior space or use the case as a storage box Padded Divider Cases High-visibilty colors and padded protection with velcro walls Trekpak Cases Adaptable organization system with strong wall and divider panels, locking pins and a cutting tool Hybrid Cases Combines foam and Trekpak configurations for the ultimate customizable case Organizer Cases Specialty cases with custom organizers unique to the case TRAVEL TRAVEL Carry-On Check-In Backpacks Duffels Slings Packing Cubes / Organization View All Travel Learn More Series ATX Aegis Air TRVL ModPak Construction Hard-Sided EVA Cordura® Hybrid with Cordura® Mission Adventure Travel Tactical Mission Creative Pursuit Overland Expedition COOLERS COOLERS Hard Coolers Soft Coolers Wheeled Coolers Accessories View All Coolers Learn More MOBILE MOBILE iPhone Cases Samsung Cases AirTag Cases MagSafe Accessories Waterproof Collection View All Phone Cases & Accessories LIGHTS LIGHTS Tactical Safety Right Angle Headlamps Remote Area Accessories View All Flashlights GEAR GEAR Apparel Drinkware Search Free Ground Shipping on orders over $165* Cases < Cases All Cases Gun & Ammo Cases < Gun & Ammo Cases All Gun & Ammo Cases Ammo Cases Pistol Cases Rifle Cases Camera Cases Vehicle Cases Travel Cases Pelican Prepare Accessories Size < SIZE Small Cases Medium Cases Large Cases Long Cases Series < SERIES Protector Storm Air Vault Vehicle Micro Laptop Custom Foam < Custom Foam Pistols Drone Apple Vision Pro GoPro Wine/Spirit/Beer Cigar Case Configuration < CONFIGURATION Foam Padded Divider TrekPak Trekpak / Foam Learn More Travel All Travel Carry-On Check-In Backpacks Duffels Packing Cubes / Organization Series < Series ATX Aegis Air TRVL Modpak Construction < Construction Hard-Sided EVA Cordura® Hybrid with Cordura® Mission < Mission Adventure Travel Tactical Mission Creative Pursuit Overland Expedition Learn More Coolers < Coolers All Coolers Hard Coolers Soft Coolers Cooler Accessories Mobile < Mobile All Phone Cases & Accessories iPhone Cases Samsung Cases AirTag Cases MagSafe Accessories Waterproof Collection Lights < Lights Lights Tactical Flashlights Safety Lights Right Angle Lights Headlamps Remote Area Lights Accessories Gear < Gear Apparel Drinkware Commercial/Government < Commercial/Government Industries < INDUSTRIES Military / Government Law Enforcement Industrial / Petroleum Aviation / Aerospace Fire Safety / EMS Medical Solutions Cases < CASES Single Lid Cases ISP Cases Rack Mount Cases Military < MILITARY Mobile Military ISP Cases Lights < LIGHTS Safety Lights Tactical Lights Headlamps Remote Area Lights Services < SERVICES Design Your Own Foam Custom Cases Custom Flashlights CAD Downloads Dealer Locator Request a Quote Business Solutions Account US / Global × Search Contact Us Please Click Here for Warranty Inquiries Please Click Here or call 844-805-8142 for Pelican.com Online Store Questions Name Email * Phone * Consumer CE Order Number (if applicable) Type Inquiry Warranty Complaint Inquiry Type * Cancel Order Product Inquiry Request Refund Order Status Initiate Warranty Claim Order not tracking Order not delivered Refund not received Return/Replace Request: Ordered wrong product Return/Replace Request: Ordered wrong size Return/Replace Request: Ordered wrong color Return/Replace Request: Received wrong product Return/Replace Request: Received product damaged Return/Replace Request: Damaged O-ring/Gasket Return/Replace Request: Product defect Description Type Detail (New): Customer Service Monitor Warranty New Medium Case Reason Customer Customer Service Warranty Shipping Production Reason Detail - Primary --None-- Cancellation Refund Request Order/Backorder Status Missing Tracking Information Shipment Delay Customer Error Product Defect Gasket (o-ring) damaged/missing Damage or Damaged in Transit Wrong Product Shipped Reason Detail - Secondary Ordered wrong product Ordered wrong size Ordered wrong color Case Record Type Submit Please Click Here for Customer Support Order Status / Product Questions / Customer Service Requests This form is for customer support, including order status, product questions and customer service requests. If you need immediate assistance, please call us at 310.326.4700 or Toll Free at 800.473.5422 Name Phone Email Company Address State/Province Alaska Alabama American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Federated States of Micronesia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Marshall Islands Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Palau Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virgin Islands Virginia Washington West Virginia Wisconsin Wyoming Armed Forces Africa Armed Forces Americas (except Canada) Armed Forces Canada Armed Forces Europe Armed Forces Middle East Armed Forces Pacific -- OTHER -- Zip/Postal Code Country United States Canada Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and/or Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia and Herzegovina Botswana Bouvet Island Brazil British lndian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cambodia Cameroon Cape Verde Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo Cook Islands Costa Rica Croatia (Hrvatska) Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Falkland Islands (Malvinas) Faroe Islands Fiji Finland France France, Metropolitan French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guinea Guinea-Bissau Guyana Haiti Heard and Mc Donald Islands Honduras Hong Kong Hungary Iceland India Indonesia Iran (Islamic Republic of) Iraq Ireland Israel Italy Ivory Coast Jamaica Japan Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kosovo Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libyan Arab Jamahiriya Liechtenstein Lithuania Luxembourg Macau Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia, Federated States of Moldova, Republic of Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands Netherlands Antilles New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfork Island Northern Mariana Islands Norway Oman Pakistan Palau Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Reunion Romania Russian Federation Rwanda Saint Kitts and Nevis Saint Lucia Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia South Sandwich Islands Spain Sri Lanka St. Helena St. Pierre and Miquelon Sudan Suriname Svalbarn and Jan Mayen Islands Swaziland Sweden Switzerland Syrian Arab Republic Taiwan Tajikistan Tanzania, United Republic of Thailand Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkey Turkmenistan Turks and Caicos Islands Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States minor outlying islands Uruguay Uzbekistan Vanuatu Vatican City State Venezuela Vietnam Virgin Islands (British) Virgin Islands (U.S.) Wallis and Futuna Islands Western Sahara Yemen Yugoslavia Zaire Zambia Zimbabwe Subject Industry Type Commercial Consumer General Government Description Pelican Products, Inc. respects your \"Web privacy\" and will not share your information with any other company. We will only use your information to provide you with periodic updates about our company or products. If you want to be removed from our email list, just send us an email saying \"Please remove\". Type Inquiry Status Open Case Record Type Blue Acorn Submit Please Click Here for Sales / General Inquiries Order Quotes / Drawing Requests / General Sales Inquiries This form is for sales inquiries, including new product quotes, drawing requests and general sales inquiries. If you need immediate assistance, please call us at 310.326.4700 or Toll Free at 800.473.5422 We support the local communities in which we work and live. If you would like to request a product or monetary donation, please email your request to philanthropy@pelican.com . Thank you for visiting our site. GLOBAL LOCATIONS Headquarters (USA) Pelican Products, Inc. 23215 Early Avenue Torrance, CA 90505 toll free: +1 800 473 5422 tel: +1 310 326 4700 fax: +1 310 326 3311 pelican.com East Coast Mfg (USA) Pelican Products, Inc. 147 North Main Street South Deerfield, MA 01373 toll free: +1 800 542 7344 fax: +1 413 665 8330 Europe / Middle East / Africa / India Peli Products, S.L.U. c/ Provença, 388, Planta 7 Barcelona, Spain 08025 tel: +34 934 674 999 fax: +34 934 877 393 peli.com Australia Pelican Products Pty Ltd 2 Forbes Close, Knoxfield, VIC 3180 Australia tel: +61 (03) 9765 1500 info.australia@pelican.com pelican.com/au Canada Pelican Products ULC 10221-184th Street Edmonton, Alberta T5S 2J4 Canada toll free: 866 273 5422 tel: +780 481 6076 fax: +780 481 9586 canada.sales@pelican.com pelican.com/ca Japan Pelican Products K.K. Nisso 22 Bldg 9F 1-11-10 Azabu Dai Minato ward Tokyo, Japan 106-0041 tel: +81 33 585 9100 fax: +81 33 585 9109 japan@pelican.com pelican.com/jp China Pelican Products China Representative Office Pine City Building, Room 1026 777 Zhaojiabang Road Shanghai, China 200032 toll free: 800 820 3082 tel: +86 21 64189685 fax: +86 21 64189679 jin.li@pelican.com pelican.com/cn Korea Pelican Products Korea Ltd #27, Dongmak-ro 14-gil, Mapo-gu, Seoul, Republic of Korea (04074) tel: +82 2 6092 4700 fax: +82 2 6739 4700 korea@pelican.com SE Asia and rest of Asia 19 Tukang Innovation Drive Greenhub #04-01 Singapore 618301 tel: +65 9298 3322 seasia@pelican.com Latin America Pelican Products, Inc. 23215 Early Avenue Torrance, CA 90505 tel: +1 310 326 4700 fax: +1 310 326 3311 latam@pelican.com Peli BioThermal Headquarters 10050 89th Ave N, Maple Grove, MN 55369 USA toll-free: +1 877 537 9800 tel: +1 763 412 4800 pelibiothermal.com Peli BioThermal Celsius House, Stanbridge Buildings, Stanbridge Rd Leighton Buzzard LU7 4QQ, UK tel: +44 (0) 1525 243770 pelibiothermal.com ADVANCED CASE FACILITIES California, USA 651 Barrington Ave, Unit A Ontario, CA 91764 tel: (909) 980-1502 fax: (909) 987-8439 Massachusetts, USA 147 North Main Street South Deerfield, MA 01373 tel: (413) 665-2163 fax: (413) 665-8330 UK Unit 4, Brookfield Industrial Estate Leacon Road Ashford Kent TN23 4TU, UK tel: +44 (0) 1233-895895 fax: +44 (0) 1233-895899 Australia 2 Forbes Close, Knoxfield Victoria, 3180, Australia tel: +613 9765 1500 fax: +613 9765 1550 Canada 360 Boul. Du Seminaire, N. Local 20 St-Jean-sur-Richelieu QC J3B 5L1, Canada tel: (450) 348-2753 fax: (450) 348-9714 × United States / Global English Europe English Español Français Italiano Deutsch Русский Canada English Français Australia / New Zealand English Japan 日本語 China 中文 Latin America Español × Consumer Retailers amazon.com bhphotovideo.com cabelas.com ganderoutdoors.com adorama.com midwayusa.com scheels.com dickssportinggoods.com academy.com sportsmans.com homedepot.com opticsplanet.com moosejaw.com backcountry.com rplumber.com × Shipping Charges Apply Free ground shipping excludes Cargo Cases, drinkware and Case-mate products × Shipping Charges Apply Free ground shipping excludes Cargo Cases and Vault Cases. Compare Go × SIGN UP FOR 10% OFF Subscribe to our mail list and receive 10% off your next order* and be the first to hear about special promotions, product announcements, and more. *Excludes Pelican phone cases, Pelican Outdoor & PelicanFoam.com products THANK YOU FOR SIGNING UP We'll be in touch. Social Why Pelican? About Our Story Our Vision Mission and Values Careers Press Releases Pelican in the News Community Engagement Sustainability Leadership Affiliate Program Support Contact Us Submit a Warranty Claim Dealer Login Guarantee of Excellence Technical Bulletins California Supply Chain Act Battery Safety Return Policy Online Store FAQ Shipping & Handling Military Discount Program U.S. Govt. Flow-Down Terms Blog & Resources Pelican Flyer Blog Case Comparison Literature Survival Stories Videos Biothermal Peli BioThermal Outdoor Pelican Outdoor © 2025 Pelican Products, Inc.   | US / Global Terms & Conditions | Privacy Policy | Cookie Preferences | Accessibility |  Patents"
    },
    {
      "url": "https://www.pelicanstatecu.com/contactus",
      "text": "Contact Us | Pelican Credit Union Home Skip to main content Skip to footer Download Acrobat Reader 5.0 or higher to view .pdf files. Myself / My Family Myself / My Family My Business / Organization Join Pelican Locations & Hours Make a Payment Zelle Rates Routing: 265473485 Careers Contact Video Banking Partner with Pelican Join Pelican Contact Careers Video Banking Pelican State Credit Union Myself / My Family Myself / My Family My Business / Organization Save & Spend Reward Checking Accounts Savings Accounts Simple Spend Account Horizon Checking Account Kid & Teen Accounts School Pride Debit Cards Long-Term Savings and Investments Courtesy Pay Options Borrow Personal & Debt Consolidation Loans Vehicle Loans Preferred Dealers Boat and RV Loans Credit Cards Mortgages Payday Loan Alternative K-12 Private School Tuition Loans Inventory for Sale Financial Wellness Free Credit Counseling Tools & Resources Fraud & ID Theft For Kids Connect MyPelican Blog Who We Are Careers Upcoming Events Support Accounts & Loans Business Checking Business Savings Business Loans Business Credit Cards & Lines of Credit Equipment and Real Estate Loans Customer Solutions Accept Payments Offer Customer Financing Employer Services Invite Pelican to Your Workplace Process Employee Payroll Offer Health Savings Accounts Schools & Non-Profits School Fundraising Classroom Education Programs Non-Profit Programs Support Myself / My Family My Business / Organization Join Pelican Locations & Hours Make a Payment Zelle Rates Routing: 265473485 Careers Contact Video Banking Partner with Pelican Join Pelican Contact Careers Video Banking Enter search terms Go Start Site Search Toggle Search Login Toggle Menu Account Login Close search dialog Username Enroll Forgot Password Search Our Site Close search dialog Enter search terms Go Start Site Search Contact Us Home Contact Us Mobile & Self-Service Options Any option below marked with 📱 can be completed quickly and easily in MyPelican ! Make a Payment 📱 or Skip a Payment 📱 To make a payment from a Pelican checking or savings account: Login to MyPelican and select \"Transfers.\" There, you can transfer money easily between Pelican accounts. To make a p ayment from another institution: Login to MyPelican and select \"Accounts.\" Click the + icon to add an external savings or checking account from another bank or credit union. Keep in mind that setting up a new external account can take up to 2-3 business days. Once the external account is set up, select \"Transfers\" in the menu to make a payment to your Pelican loan or credit card. We've upgraded our Online Payment Center for you to make recurring Pelican loan payments for FREE! Of course, you can always bring cash into a Pelican branch near you. Skip the line and enroll in the Online Payment Center today! To skip a payment: For just $40 per loan , you can skip your next qualifying payment if your loan(s) meet all of the requirements. To skip your payment, login to MyPelican and select \"Skip-A-Pay\" in the menu. MyPelican will only show you loans that are eligible for this service. Loan Reminder Team If you are past due on your payments, you may receive a phone call from Pelican's loan reminder team at (866) 536-2435 to see how we can assist you. Learn More Balance Inquiries 📱 MyPelican : Check account balances by logging into MyPelican. All accounts and their balances are listed at the top of the screen. Phone: Check account balances by calling 1-800-351-4877. Get Your Full Account Number(s) 📱 Where to find full account numbers: Checks - Your full account number is located at the bottom of your checks. MyPelican - Simply select the account and look for the account number under \"Details.\" Is my member number the same as my account number? No. Do not use your member number to set up direct deposit or ACH payments. If you do, it will be returned. You should only use your member number when contacting us so we can look up your account. Checking Your Online Membership Application? We’re here to help! If you’ve recently applied for membership online and want to check the status of your application, log in to your application here or give us a call at 1-800-351-4877 . Our friendly team is ready to assist you and answer any questions you may have. At Pelican, you're more than just a member—you're family! Activate a New Card & PIN Change 📱 MyPelican : Select the account that the card is associated with, choose \"Card management,\" and click or tap \"Activate new card.\" Phone: Activate your new card by calling 1-800-351-4877 and selecting menu option #2 - Debit and Credit Cards. You can change your card PIN by calling 1-800-351-4877 and selecting menu option #2 - Debit and Credit Cards. Report a Lost or Stolen Card 📱 MyPelican: Select the account that the card is associated with, choose \"Card management,\" and click or tap \"Report lost/stolen.\" Keep in mind that once this is done, you cannot reactivate the card within the app. If you've simply misplaced your card, you can temporarily disable it by using the on/off toggle. Phone: Call 1-800-351-4877 and select menu option #2 - Debit and Credit Cards. This is available 24/7. Dispute a Transaction If you need to dispute a debit or credit card transaction, including ATM withdrawals conducted at non-Pelican ATMs, have your card number ready and follow these steps: Contact the Merchant: A majority of billing errors can be resolved in the most efficient manner by contacting the merchant directly. Should the merchant be unwilling or unable to correct the transaction, or if you do not recognize the charge, we’re here to provide additional assistance. Prepare and File: Before initiating your dispute, gather all supporting documentation, such as receipts, proof of return, copies of communication with the merchant, or any other information relevant to your dispute case. Call 888-330-1011 to begin the process. Keep in Touch: Our team may require further details from you and reach out to you directly. It is crucial to promptly review and respond to their message. For any other dispute type, please message us in MyPelican or call us at 1-800-351-4877. When will I be reimbursed for my disputed charge? You will receive communication within 15 days of the day your dispute was filed, letting you know whether we will be able to reimburse you or not. May I keep my current card? In situations where there was a billing error, you'll be able to keep your card. In cases of fraudulent or unrecognized charges, your card must be blocked immediately. A new card and number will be issued to you prevent to further unauthorized charges. What can I expect after filing a dispute? We may need additional information about your transaction while we conduct our investigation. Please be on the lookout for communication from us and respond as soon as possible. How long does the dispute process take? The process may take between 60 to 120 days. If the dispute is found in your favor, you'll receive communication that your case has been closed and the provisional credit will remain in your account permanently. If we receive a merchant response with supporting evidence that the charge was legitimate, we will send a copy for you to review. If this occurs, you can respond and send additional information to us for further review. File a Credit Life/Credit Disability Claim Credit Disability In your time of need, our claims process is quick and easy. If you elected payment protection on your loan, you can use this convenient claims process to quickly and easily file your disability claim. File Your Claim To check on the status of a claim, call 1-800-621-6323. Credit Life To file a Credit Life claim, please call us at 1-800-351-4877. Don't forget to have your date of disability handy when filing your claim! Your disability date is the last day that you worked, your injury date, or your diagnosis date. Transfer Balances or Request a Limit Increase on your Credit Card Transfer Balances or Request a Limit Increase on your Credit Card Submit a balance transfer request here . To request a credit card limit increase or a temporary purchase limit increase on your Pelican credit card, message us in MyPelican , fill out the contact form below, or call us at 1-800-351-4877 . Order Checks Click here to order checks online. Zelle ® Support Pelican members cannot send or request funds until their checking account has been open for 60 days. However, another Zelle user can send funds to the newly enrolled account immediately. For detailed answers to other most frequently asked Zelle questions, such as payment limits and enrollment, click here . To speak directly with Zelle customer support, call 1-844-428-8542. Collateral Protection Insurance (CPI) Notice Why did I receive a Collateral Protection Insurance Notice? One of the conditions of your loan agreement is that you're required to maintain comprehensive and collision coverage on your vehicle as long as you have a loan with Pelican. If you're receive a notice from us, that's because we have not received proof that you have acceptable insurance coverage. In order to prove you have the proper comprehensive and collision coverage needed, we need you to provide us with information outlined in your insurance policy, which includes showing Pelican Credit Union as the lienholder and the amount of your deductible. Please note that an insurance card is not an acceptable proof of insurance. What happens if I haven't submitted proof of insurance to Pelican? If we don't receive proof of insurance that meets the requirements outlined in your loan agreement, Collateral Protection Insurance (CPI) may be issued to you through Pelican's insurance program. This coverage is intended to protect Pelican's interests and will not meet the requirements of any financial responsibility law or provide liability coverage to you. How do I submit my proof of insurance to Pelican? If you've received a notice from us, it's simple to submit your insurance information to us quickly and securely online, or you can always submit proof via mail or fax. To email your proof of insurance, please email the policy as an attachment to pelicanstatecu@imcovered.com . To mail your proof of insurance, please send your policy to: Pelican Credit Union P.O. Box 690267 San Antonio, TX 78269-0267 To fax your proof of insurance, please send your policy to (877) 935-3967. For any other questions regarding Pelican's insurance program, please call (833) 921-8093. Submit Proof of Insurance Here Loan Reminder Team If you are past due on your loan payments and/or proof of insurance, you may receive a phone call from Pelican at (866) 536-2435. Financial Hardship Extension Request We understand that bad things happen to good people. Fill out the form below to request an extension on your Pelican loan(s) and we will be happy to review your account for hardship assistance. Your request will be reviewed in 1-2 business days. Can't find what you're looking for? Contact us! No time to wait for the next available team member? Try our \"Request a Call Back\" feature! Choose the \"hold my place in line\" option when you call in and we'll call you back the same day. Chat: Message us in MyPelican Mon - Fri: 8:00 am - 6:00 pm Sat: 9:00 am - 1:00 pm Visit: Find a branch Call: 1-800-351-4877 Text: 1-844-916-1956 Mon - Fri: 8:00 am - 6:00 pm Sat: 9:00 am - 1:00 pm Make an Appointment We've also enhanced our services to meet your needs! You can video chat with our live team members from wherever you are on Monday through Friday from 9:00 AM - 5:00 PM. Start a Video Call Need Anything Else? Complete the form below and someone will reach out to you within 1-2 business days. About Us Careers Who We Are Find A Location Join Pelican Contact Security Privacy Policy Resources Fees & Disclosures Non-Discrimination Notice Wire Transfer (PDF 170.7 kB) Inventory for Sale MyPelican Digital Banking Why CUs are Tax Exempt Connect Facebook LinkedIn Instagram YouTube © Pelican State Credit Union. Back to top"
    },
    {
      "url": "https://www.thepelicanclub.co.uk/contact-us",
      "text": "Contact Us | The Pelican Club Nottingham top of page RESERVATIONS MENUS LIVE JAZZ GIFT CARD GALLERY CONTACT US More Use tab to navigate through the menu items. THE PELICAN CLUB ITALIAN RESTAURANT AND JAZZ BAR CONTACT US If you have a question or just want to say hi - get in touch below! For reservations, please visit our reservations page . Alternatively, email us on info@thepelicanclub.co.uk or give us a call on 0115 924 2932 . Submit Thanks for your enquiry, we will be in touch shortly. ADDRESS ​ ​ The Pelican Club 55 St. Mary's Place, Nottingham, NG1 1PH​ ​ GET DIRECTIONS OPENING TIMES ​ Sunday - Monday: Closed Tues-Thurs: Open from 17:00 ​ Fri - Sat: 17:00   ’til late PARKING​ Fletcher Gate car park is a 2 min walk TRAM Lace Market tram is a 2 min walk The Pelican Club 55 St. Mary's Place, Nottingham, NG1 1PH info@thepelicanclub.co.uk 0115 924 2932 FIND US OPENING TIMES Sunday - Monday: Closed Tues-Thurs: Open from 17:00 Fri - Sat: 17:00   ’til late © 2025 - Copyright - The Pelican Club | Web - Ryan Cornelius Design Privacy Policy. bottom of page"
    },
    {
      "url": "https://www.thepelicanhotel.com/contact-us.html",
      "text": "Contact Us | The Pelican Hotel, Accra Book Now Close Check In Check Out Adults 1 2 Children 0 1 2 Promo Code Toggle navigation About Us Offers Accommodation Dining Meetings & Events Facilities Gallery Location Contact Us Blog Home > Contact Us Contact The Pelican Hotel, Accra The Pelican Hotel, Accra Address :Â Cantonments Road, Adjacent toÂ EU Office, Accra, Ghana | Map Email :Â info@thepelicanhotel.com Telephone :Â +233 (0) 30 279 4455 Â Mobile Number : +233 (0) 50 308 0000 Sales Team: +233 50 297 3042 For group bookings and enquiries, contact:Â Sales@thepelicanhotel.onmicrosoft.com Â Reach Out to Us Name Email Phone Query Â Submit Ã The Pelican Hotel, Accra Email Us info@thepelicanhotel.com Follow Us Home About Us Offers Accommodation Dining Meetings & Events Facilities Gallery Location Contact Us Terms & Conditions Blog Manage Booking Call us T | +233 30 279 4455 T | +233 30 276 1040 M | +233 50 308 0000 Visit us Cantonments Road, Adjacent to EU Office, Accra, Ghana This hotel is proudly managed by Sitemap Simplotel - Hotel Website Design & Booking Engine Continue your booking"
    },
    {
      "url": "https://www.fox13news.com/news/jannus-live-owner-steps-down-after-clearwater-ferry-crash-leaves-1-dead-10-injured",
      "text": "Jannus Live owner steps down after Clearwater Ferry crash leaves 1 dead, 10 injured | FOX 13 Tampa Bay News Weather Sports Good Day We Live Here Contests More Watch Live Expand / Collapse search ☰ Search site News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us Jannus Live owner steps down after Clearwater Ferry crash leaves 1 dead, 10 injured By Katelyn Massarelli and Kylie Jones Published April 30, 2025 2:52pm EDT Clearwater FOX 13 News Share Copy Link Email Facebook Twitter LinkedIn Reddit Jannus Live owner steps down after ferry crash Kylie Jones reports. The Brief Jannus Live owner, Jeffry Knight, is stepping down from his position with the concert venue days after the deadly Clearwater Ferry crash. A statement was released by Jannus Live on Wednesday that said the \"decision was made out of respect for the victims.\" A Palm Harbor father of two died in the crash and 10 other passengers on the ferry were injured. CLEARWATER, Fla. - Days after the deadly Clearwater Ferry crash, Jannus Live owner, Jeffry Knight, is stepping down from his position with the popular St. Petersburg concert venue. Knight was the operator of the recreational boat that crashed into the Clearwater Ferry Sunday evening near the Memorial Causeway Bridge. It left Palm Harbor father of two, Jose Castro, dead and 10 others injured. Pictured: Scene after the Clearwater Ferry crash on Sunday evening. PREVIOUS: Clearwater Ferry crash: Jannus Live releases statement on owner's involvement in deadly incident Jannus Live on Jeffry Knight stepping down What they're saying: Jannus Live released the following statement on Instagram Wednesday afternoon: \"Effective immediately, Jeff Knight is stepping down from his position at Jannus Live and will no longer have any affiliation with the venue. This decision was made out of respect for the victims of the recent Clearwater Ferry tragedy and to ensure that ongoing developments do not detract from the work of talented artists, staff, and community partners who have long contributed to the success of Jannus Live. Jannus Live will continue normal operations under its existing management team with a renewed focus on delivering world-class live entertainment to the St. Petersburg community.\" Follow FOX 13 on YouTube Clearwater Ferry crash latest What we know: Officials said the Clearwater Ferry crash happened near the Memorial Causeway Bridge, which connects downtown Clearwater to Clearwater Beach. The crash happened between 8:30 p.m. and 8:40 p.m. on Sunday when a recreational boat slammed into the ferry. The Florida Fish and Wildlife Conservation Commission said more than 40 people were on board the Clearwater Ferry at the time of the crash, and six people were on board the 37-foot recreational boat. RELATED: Clearwater Ferry crash: Jannus Live owner’s attorney addresses ‘misinformation’ as investigation unfolds Video released by the Clearwater Police Department showed the moment the recreational boat rammed into the ferry. Video: Boat crashes into Clearwater Ferry The Clearwater Police Department released video of a boat crashing into the Clearwater Ferry Sunday evening. The crash left 1 person dead and 10 others injured. Courtesy: Clearwater Police Department. First responders with FWC, CPD, the Clearwater Fire Department, the Pinellas County Sheriff's Office and the United States Coast Guard all responded to the crash to help passengers, secure the scene and begin their investigation into what they deemed a \"mass casualty event.\" What we don't know: While authorities said their investigation will take time, no arrests have been made in the crash. PREVIOUS: Clearwater Ferry crash: 1 dead and 10 hospitalized, boat involved located Dig deeper: FWC investigators said they spoke with Knight after the crash, and he and all the passengers on the recreational boat were cooperative with the investigation. Knight even did a voluntary breathalyzer test, which came back with a reading of zero. Authorities said the investigation into the Clearwater Ferry crash remains active. The FWC is now looking for any video footage from the area where the crash happened. If you have any video from the area between 8 p.m. and 8:45 p.m. on Sunday, you're asked to contact the Wildlife Alert Hotline at 888-404-3922. Letter from Knight's attorney The other side: In a letter sent to investigators and obtained by FOX 13 on Tuesday, Knight’s attorney aimed to address what he described as \"misinformation\" surrounding the incident , particularly claims that Knight left the crash scene. The letter reads, in part: \"Immediately after the accident, Mr. Knight directed a passenger on his vessel to call 911, and that passenger remained on the line with 911 for 12 minutes… Mr. Knight tied his vessel to the ferry in order to stabilize it and render aid. He used his boat to maneuver the ferry closer to shore so that first responders would have easier access to the passengers.\" READ: Family of Clearwater Ferry crash victim mourns loss as investigation continues: ‘We need justice’ The letter goes on to say Knight \"told the captain of the ferry boat he was able to transport injured individuals by water to Morton Plant Hospital … this offer was declined.\" The attorney said Knight only departed when emergency responders arrived, and his boat began taking on too much water. Knight's boating history The backstory: According to court records, this isn't the only boating incident that Knight has been involved in over the years. \"My clients were in a pontoon boat along with two other passengers, and out of nowhere, Mr. Knight just plowed his vessel right through my client's pontoon boat,\" Brandon Volk, a maritime attorney out of South Florida, said. Volk said he represented clients in a civil lawsuit against Knight after a boating incident in 2019. According to the lawsuit, Knight crashed into a pontoon boat near the Dick Misener Bridge in St. Pete. Court records claim that Knight admitted to looking down leading up to the crash. What they're saying: \"There were a lot of similarities between these two incidents,\" Volk said. Volk said his clients were injured and taken to the hospital after the crash, but nobody was killed. The lawsuit ended in a confidential settlement. \"Our waters in Florida, they should be safe, and you shouldn't be plowing your boats through other boats in the state of Florida,\" Volk said. The Source: The information in this story was gathered using details from Wednesday's statement posted on Jannus Live's Instagram. It also includes previous information from investigators on the Clearwater Ferry crash as well as previous details gathered by FOX 13's Evyn Moon and Kylie Jones. WATCH FOX 13 NEWS: STAY CONNECTED WITH FOX 13 TAMPA: Download the FOX Local app for your smart TV Download FOX Local mobile app: Apple | Android Download the FOX 13 News app for breaking news alerts, latest headlines Download the SkyTower Radar app Sign up for FOX 13’s daily newsletter Clearwater Crime and Public Safety Daily Newsletter All the news you need to know, every day By clicking Sign Up, I confirm that I have read and agree to the Privacy Policy and Terms of Service . Trending President Trump pushes back on DeSantis' effort to rescind vaccine mandates Millions could lose SNAP benefits as stricter rules take effect Families of Florida's missing children gather to honor loved ones, continue search Dozens of Tampa homeowners say their roofs are defective, demand repair from builder Sarasota's 'Sash and Sill' owner arrested for third time on two additional larceny charges Latest headlines Developing Live Updates: Charlie Kirk shot at Utah college event Woman charged in Polk County deputy's 2022 death stands trial ‘Operation Kings Fall’ yearlong investigation into drug trafficking, violence nets 22 arrests Red-light runner strikes Sarasota motorcycle deputy: SCSO Video: Florida man spits on judge during attack attempt in court News Top Stories Local Tampa Bay News Florida Tonight National FOX 13 Investigates Consumer Health Politics Seen on TV Daily Newsletter FOX News Sunday Rhythm Roots Weather SkyTower Radar Views Interactive Radar Live Webcams Marine Weather Weather Alerts Hurricane Safety Tracking the Tropics MyFoxHurricane FOX Weather Sports Buccaneers Rays Lightning No Off Days with Scott Smith Weekly Fishing Report High School Sports Good Day Traffic Charley's World Hometown Heroes Extraordinary Ordinaries Recipes First Birthdays We Live Here What's Right Dinner DeeAs One Tank Trips Theme Parks Made in Tampa Bay Recipes, Food & Drink Tampa Bay History Care Force Watch Live How To Stream Live FOX 13 Newscasts LiveNOW from FOX FOX Weather FOX Soul FOX Live Feed Central NASA TV Money Consumer Personal Finance The Economy Small Business Entertainment Headlines Trending Stories FOX Shows What's on FOX 13 Contests Tampa Bay Reads Regional News Orlando News - FOX 35 Orlando Gainesville News - FOX 51 Gainesville Atlanta News - FOX 5 Atlanta About Us Meet the FOX 13 team TV Listings Jobs & Internships WTVT History Closed Captioning FCC Public File FCC Applications Contact Us facebook twitter instagram youtube email New Privacy Policy Updated Terms of Use Your Privacy Choices FCC Public File EEO Public File About Us Jobs at FOX 13 Contact Us This material may not be published, broadcast, rewritten, or redistributed. ©2025 FOX Television Stations"
    }
  ]
}