{
  "fuentes": [
    {
      "url": "https://www.jaxbeachfestivals.com/home/belk-music-festival-in-jacksonville-fl/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://jaxbeachcountryfest.net/lineup",
      "email": "micah@micahrich.com"
    },
    {
      "url": "https://www.coab.us/Calendar.aspx?EID=8081",
      "email": "info@coab.us"
    },
    {
      "url": "https://www.theredondo.com/contact-us",
      "email": "lnorman@pacificahotels.com"
    },
    {
      "url": "https://www.theredondo.com/contact-us",
      "email": "reservations@theredondo.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "info.sbr@sugarbeachmauritius.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "reservations.sugarbeach@yoursunlife.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/vendors-musicians-sponsors/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/musicians/sea-walk-music-festival-in-jacksonville-fl/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "brianna@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "kylie@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "lindsey@teamjackfoundation.org"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "email": "shirley@teamjackfoundation.org"
    },
    {
      "url": "https://www.springingtheblues.com/contact/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x-300x278.png"
    },
    {
      "url": "https://www.springingtheblues.com/contact/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x-480x446.png"
    },
    {
      "url": "https://www.springingtheblues.com/contact/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x-768x713.png"
    },
    {
      "url": "https://www.springingtheblues.com/contact/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x.png"
    },
    {
      "url": "https://www.springingtheblues.com/contact/",
      "email": "info@springingtheblues.com"
    },
    {
      "url": "https://www.springingtheblues.com/contact/",
      "email": "media@springingtheblues.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "aleach@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "amestdagh@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "bbulmer@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "cgumbinger@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ecarlo@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "esoto@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "gmikaiel@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "info@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jallinson@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jbell@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "jgoldschmidt@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "kmitura@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "ldegon@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lhickox@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "lsharrit@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "mcorrigan@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "pmartin@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "slindblad@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "swiechens@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "tchalifourdrahman@visitjacksonville.com"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "email": "visitorinformation@visitjacksonville.com"
    },
    {
      "url": "https://www.springingtheblues.com/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x-300x278.png"
    },
    {
      "url": "https://www.springingtheblues.com/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x-480x446.png"
    },
    {
      "url": "https://www.springingtheblues.com/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x-768x713.png"
    },
    {
      "url": "https://www.springingtheblues.com/",
      "email": "coj_dse_logo_centered_silver-gradient_color@2x.png"
    },
    {
      "url": "https://www.springingtheblues.com/",
      "email": "info@springingtheblues.com"
    },
    {
      "url": "https://www.springingtheblues.com/",
      "email": "media@springingtheblues.com"
    },
    {
      "url": "https://jax.com/contact-jax/",
      "email": "info@jax.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/musicians/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/music-festival-locations/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/sponsors/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/festival-applications/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/tos/",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/community-first-seawalk-music-festival-2024",
      "email": "info@jaxbeachfestivals.com"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/community-first-seawalk-music-festival-2024",
      "email": "mindy@kidsoutandabout.com"
    }
  ],
  "mails": [
    "aleach@visitjacksonville.com",
    "amestdagh@visitjacksonville.com",
    "bbulmer@visitjacksonville.com",
    "brianna@teamjackfoundation.org",
    "cgumbinger@visitjacksonville.com",
    "coj_dse_logo_centered_silver-gradient_color@2x-300x278.png",
    "coj_dse_logo_centered_silver-gradient_color@2x-480x446.png",
    "coj_dse_logo_centered_silver-gradient_color@2x-768x713.png",
    "coj_dse_logo_centered_silver-gradient_color@2x.png",
    "ecarlo@visitjacksonville.com",
    "esoto@visitjacksonville.com",
    "gmikaiel@visitjacksonville.com",
    "info.sbr@sugarbeachmauritius.com",
    "info@coab.us",
    "info@jax.com",
    "info@jaxbeachfestivals.com",
    "info@springingtheblues.com",
    "info@visitjacksonville.com",
    "jallinson@visitjacksonville.com",
    "jbell@visitjacksonville.com",
    "jgoldschmidt@visitjacksonville.com",
    "kmitura@visitjacksonville.com",
    "kylie@teamjackfoundation.org",
    "ldegon@visitjacksonville.com",
    "lhickox@visitjacksonville.com",
    "lindsey@teamjackfoundation.org",
    "lnorman@pacificahotels.com",
    "lsharrit@visitjacksonville.com",
    "mcorrigan@visitjacksonville.com",
    "media@springingtheblues.com",
    "micah@micahrich.com",
    "mindy@kidsoutandabout.com",
    "pmartin@visitjacksonville.com",
    "reservations.sugarbeach@yoursunlife.com",
    "reservations@theredondo.com",
    "shirley@teamjackfoundation.org",
    "slindblad@visitjacksonville.com",
    "swiechens@visitjacksonville.com",
    "tchalifourdrahman@visitjacksonville.com",
    "visitorinformation@visitjacksonville.com"
  ],
  "nombre_sitio": "jaxbeachfestivals.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jaxbeachfestivals.com/home/belk-music-festival-in-jacksonville-fl/",
      "text": "belk-music-festival-in-jacksonville-fl - Jax Beach Festivals (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page belk-music-festival-in-jacksonville-fl Search for: Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://jaxbeachcountryfest.net/lineup",
      "text": "Lineup Home Lineup Vendors FAQ's Sponsors More Home Lineup Vendors FAQ's Sponsors Home Lineup Vendors FAQ's Sponsors 2025 Lineup 2pm - Gates open 3pm - Darrell Rae 4pm - Emily Mikus 5pm - Katie O 6pm - Bryce Leatherwood 7pm - John Morgan 8pm - Tigirlily Gold Tigirlily Gold Sisters Kendra Olson and Krista Slaubaugh have been playing music together since they could walk and officially formed Tigirlily Gold when they were still teens. While still in high school, they crisscrossed the Midwest, forming a fierce fan base and selling out amphitheaters across their home-state of North Dakota. After moving to Nashville, they landed a weekly residency at Dierks Bentley’s Whiskey Row on the city’s famed lower Broadway. Playing four-hour sets, three to four nights a week, the sisters developed a performance style that’s not only captivating and fun but shows that entertaining is in their blood. After releasing their original song “Somebody Does,” in 2021, the track topped the iTunes chart, leading to Tigirlily Gold signing to Monument Records. They released their self-titled, debut EP in July of that year, working with multi-Grammy Award winner Shane McAnally. In 2024, the powerhouse duo embarked on a new musical chapter, releasing their debut, full length album, Blonde – a deeply personal project featuring tales of love and loss alongside powerful anthems and songs of female empowerment. The album featured radio single “Shoot Tequila,” which reached the Top 40, and found viral success across social media with the sisters performing the track on NBC’s TODAY Show. Their follow-up single, “I Tried A Ring On,” surpassed that success by reaching top 30 at country radio, and earned Tigirlily Gold features in Billboard, American Songwriter, Vulture, and Forbes. In 2024, the duo was nominated for two CMT Awards and two People’s Choice Country Awards and won the ACM Award for New Duo of the Year, where they performed “I Tried A Ring On” during the show to a national audience. Ready to take country music by storm, Tigirlily Gold shares the first taste of new music with their wistful and dreamy new single “Forever From Here.” A nostalgic love letter to the Midwest, and a call back to the place that made them Tigirlily Gold, “Forever From Here” is set for release on February 14th, with more music expected this year. Named to Music Row’s “Next Big Thing” list, performing at festivals like Stagecoach, Faster Horses, Pilgrimage, and Tortuga Music Festival, and sharing stages with artists like Kelsea Ballerini, Parker McCollum, and Carly Pearce, Tigirlily Gold is poised for a breakout year -- ready to bring girl group energy back to country. John Morgan Armed with enough talent to bypass Nashville’s 10-year town rule, John Morgan moved to Nashville in 2019 and quickly established himself as a hit songwriter scoring #1s and cuts by numerous artists, including Thomas Rhett, Dustin Lynch, Jon Pardi, Michael Ray and George Birge. Jason Aldean cut 16 of Morgan’s songs - including the #1 hits “Trouble with a Heartbreak” and “If I Didn’t Love You,” a smash duet with Carrie Underwood - and the superstar signed Morgan to his Night Train Records imprint through BBR Music Group/BMG Nashville. His full-length debut album, Carolina Blue, spotlights a gifted storyteller unafraid to mine his own heart to deliver songs that feel both intensely personal yet warmly universal. Having co-written 12 compelling songs that cover a variety of emotional territory, Morgan began crafting Carolina Blue. The resulting album is a snapshot of a self-aware artist moving into a new chapter. “I was in a different stage of life when I moved here as opposed to where I am now. I’m a dad and I’m married,” he smiles. “I’ve got different goals and requirements of me now that I didn’t have when I was writing and cutting early on, so that’s been the shift for me in a lyrical sense. Morgan’s working-class roots and his appreciation for the people who are the backbone of our nation reverberate throughout the album in such key tracks as “Long Ride Home,” the story of a truck driver making his way home to the woman he loves. The poignant “Without ’Em” is a salute to the waitresses, pastors and other hard-working heroes that make the world go round. His breakthrough hit “Friends Like That” is a good-time anthem with an unforgettable hook. “It’s a fun song. It’s kind of cheeky. There’s no seriousness about it,” he says of the song, which features Aldean chiming in with his distinctive vocal. “It’s a great live song, and it’s been cool to see audiences react to it.” Serving up slices of life in songs that make listeners stop in their tracks and say, “Yes, I’ve been there.” That’s John Morgan’s gift. It’s made other artists seek out his songs, but as demonstrated on Carolina Blue, there’s no substitute for hearing his own earnest, evocative interpretation in a voice that’s warm, steady and totally relatable. “The majority of the people who hear this project are doing the blue-collar jobs that I would be doing if this wasn’t working out,” Morgan says. “I hope there’s relatability in how I write. I don’t try to be anything I’m not. I’ve never been good at that, and I think people can snuff that out pretty quick. I hope these songs give people a message that there’s value in whatever they are doing. Hopefully, people will just feel their worth.” Bryce Leatherwood Singer/songwriter Bryce Leatherwood aims to carry the torch of country music and continue the legacy of legends prior. Born and raised in Woodstock, GA, his passion for music began at an early age. Working on his grandfather’s farm every summer, Leatherwood was exposed to the classic country hits of George Jones, Merle Haggard and Conway Twitty. Soon thereafter he began picking up guitars and playing the traditional country music that inspires him today. Leatherwood’s music career began to blossom in Statesboro, GA, where he attended Georgia Southern University. During his time in Statesboro, Leatherwood played college venues and continued to grow his stage presence and his country music repertoire. While in college, Leatherwood formed his band and began playing all around the Southeast. Just weeks after graduating college, Bryce set his mind on a new task. In 2022, Leatherwood competed on the NBC hit television show The Voice and was crowned the Season 22 winner in December. Following his success, Leatherwood moved to Nashville where he has been songwriting and recording for his debut album on Mercury Records. A next generation traditionalist plugged firmly into the modern mainstream, with all the hallmarks of a rising star, Leatherwood concluded his first-ever headlining tour, The Neon Does Tour last year, took the Good Molecules Reverb Stage at CMA Fest and made his Grand Ole Opry debut on Sept. 14, 2024. His debut single, “Hung Up On You,” arrived at country radio as the most-added single, with 45 first week adds and is currently climbing the country chart. For the latest news, click on Bryce's photo to visit his website. Katie O Katie Ondrejicka, known as Katie O, is a 19-year-old country singer-songwriter from Jacksonville, Florida. With a deep love for traditional country, gospel, and bluegrass, she delivers a timeless, authentic sound. Katie gained national attention on The Voice, earning a 4-chair turn and reaching the Top 20. She was also a golden ticket winner on American Idol Season 20. Performing since age 11, she has opened for artists like Trent Tomlinson, Rodney Atkins, High Valley, and many others, sharing her music nationwide. She gives all glory to Jesus Christ for the opportunity to pursue her passion. Follow Katie O on social media for new music and 2025 tour dates! Click Katie's photo to check out her website! Emily Mikus Emily is a singer/songwriter from Jacksonville, Florida with big dreams! She has always been inspired by soft rock from the 70's and country music. Her catalogue consists of a singer/songwriter and pop feel with hints of country and vintage style.  As a graduate from an arts high school and music major at Jacksonville University, Emily is used to the rigorous tasks involved with being a performing musician. Being both a classical and jazz saxophonist, singer, songwriter, solo acoustic performer, and worship leader, Emily is well rounded and knows how to play in many performance settings with multiple styles of music. Over the course of her time as a musician, Emily has performed in prestigious halls and conferences such as Carnegie Hall, The Midwest Clinic in Chicago, and more. She is continuing her music career as a solo acoustic performer for restaurants, weddings, churches, and events. In her years at Jacksonville University, she has started a chapter of Delight Ministries, a college women’s ministry, and will be working for Delight after graduation as a Regional Director. Emily wants to be a light in the music industry and plans on making a career out of her passion, singing and songwriting. Click Emily's photo to check out her website! Darrel Rae Jacksonville local singer songwriter and Nashville recording artist performing 5 nights a week around North Florida and South Georgia. Lived in Nashville for a few years recording and performing on Broadway every night and has been an opening act for artists such as Chris Janson, Travis Tritt and many more. Original music available on all streaming platforms! Click Darrell's photo to check out his website! Home Lineup Vendors FAQ's Jax Beach Country Fest 75 1st Street North. Jacksonville Beach, FL, USA Copyright © 2025 Jax Beach Country Fest - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.coab.us/Calendar.aspx?EID=8081",
      "text": "Calendar • Atlantic Beach Music Festival Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Home Calendar Calendar View all calendars is the default. Choose Select a Calendar to view a specific calendar. Select the arrows on either side of the current month to change the month. List Week Month Subscribe to iCalendar Print Notify Me Find a Facility Search Calendars by: Start Date End Date Enter Search Terms Show Past Events Select a Calendar Select Calendar/Calendars to filter All Calendars City Calendar Public Utilities Calendar Recreation and Special Events Search Return to Previous Event Details View Map Google Bing Date: November 16, 2024 2024-11-16T17:00:00 Time: 5:00 PM - 9:00 PM Location: View Facility Johansen Park Address: 1300 Seminole Road Atlantic Beach , FL 32233 Atlantic Beach Music Festival Saturday, November 16, 2024 Map Agenda Facility Submit Event Print Email Event Subscription View RSS Feeds Select on Calendar Expand Collapse Previous Next Down Up Map Share Show more Agenda Live Edit Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.theredondo.com/contact-us",
      "text": "Hotels In LA | Redondo Beach Hotel, Tapestry Collection - Contact Us SKIP TO CONTENT Menu (310) 376-0746 Book Now Close Rooms & Suites Special Offers Weddings Meeting & Events Gallery Destination Upcoming Events Azul Cafe and Bar Local Dining Hotel FAQ Contact Us Careers Accessibility Close Check Availability Check In - Check Out: Check In Check Out Adults Adults 1 2 3 4 5 6 7 8 9 10 Enter Code Select Code Type Promotion Code Corporate Account Group Code Please select a rate type Check Availability Stay In Touch Contact us directly at: Redondo Beach Hotel, Tapestry Collection by Hilton 400 N. Harbor Drive Redondo Beach, CA 90277 Phone: 310.376.0746 Email: reservations@theredondo.com For media inquiries, please email lnorman@pacificahotels.com Hotel FAQ Contact Us Careers Accessibility Hilton Global Privacy Policy Privacy Policy California Consumer Privacy Notice Sitemap Site Usage Agreement Cookies Statement Personal Data Requests Do Not Sell My Information Do Not Sell/Share Ad Choices text and icon facebook instagram twitter 400 N. Harbor Drive,\n\t\t\t\t\t\tRedondo Beach,\n\t\t\t\t\t\tCA\t\t\t\t\t\t90277 reservations@theredondo.com (310) 376-0746 © 2025 The Redondo Beach Hotel. All Rights Reserved."
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "text": "Contact Us | Sugar Beach, Luxury Mauritius Resort Explore the resorts Back The Resort Rooms & Suites Deluxe Sea View Room Deluxe Beach Front Room Premium Sea View Room Premium Beach Front Room Family Room Premium Suite Premium Accessible Room Executive Beach Front Suite Offers Restaurants & Bars Wellness & Fitness Golf Experiences & Activites Weddings Wedding Packages Legal Requirements Meetings & Celebrations Venue spaces Conferences Parties & Celebrations Gift Voucher Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs Location Day Pass Contact Us EN FR DE Day Pass Location Gift Voucher Contact Us Book Now Book Now Home Sugar Beach Contact Us Have a Question? Instantly get answers to your questions. Just send us a WhatsApp message. Using a laptop but prefer to chat on your mobile? No problem! Simply scan the QR code to start the conversation. Get in touch Call, email or complete our form Our team will get back to you and we look forward to welcoming you to experience Sugar Beach. Address Wolmar Flic en Flac Mauritius For More Information: Call on: +230 403 3300 For Reservations: Call on: +230 402 0151 or Email: reservations.sugarbeach@yoursunlife.com topic General Enquiry Wedding Enquiry Meeting Enquiry Dining Enquiry Spa Enquiry I AGREE TO THE TERMS & CONDITIONS Submit Newsletter Sign Up First Name Email Address * Website_Visitor Sunlife Sugar Beach Long Beach Ambre La Pirogue I agree to the privacy policy Sustainability Financial Information & Governance Mobile App Reviews Gift Voucher Members Club Join the Team Awards Cookie Policy Privacy Policy © Copyright Sun life 2022 Sugar Beach Wolmar, Flic en Flac, Mauritius Tel: +230 403 3300 Email: info.sbr@sugarbeachmauritius.com Website by 80 Days Resorts Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/vendors-musicians-sponsors/",
      "text": "Jax Beach Music Festivals for Vendors, Musicians, Sponsors (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page Vendors - Musicians - Sponsors Contact us today for participation opportunities!  Vendors & Exhibitors Sell your product or service.  Musicians & Performers Showcase your talent.  Sponsors & Advertisers Market your company or brand. i Vendor Applications Download PDF applications. Festival Location Jax Beach Festivals, Inc. produces festivals and special events at the oceanfront Seawalk Pavilion in the City of Jacksonville Beach, Florida. Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/musicians/sea-walk-music-festival-in-jacksonville-fl/",
      "text": "sea-walk-music-festival-in-jacksonville-fl - Jax Beach Festivals (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues VIP Passes Community First Seawalk Springing The Blues Applications Location FAQ Select Page sea-walk-music-festival-in-jacksonville-fl Search for: Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://teamjackfoundation.org/about-us/board-staff/",
      "text": "Board & Staff | Team Jack Foundation Follow Follow Follow Follow U Search  Shop w News w Blog Donate Search for: About Us About Us Our Mission Our History Jack Hoffman Board & Staff Financials Contact Us Our Impact Projects & Progress We Fund Nebraska Childhood Brain Tumor Program Scientific Advisory Board Apply for TJF Grant Research Articles Brain Cancer About Brain Cancer What is DIPG? Brain Cancer Facts Cancer Awareness Months Brain Tumor Awareness Month Childhood Cancer Awareness Month Family Resources Events Takedown the Tumor Gala Golf Classic An Evening with Henry Winkler Miles for Team Jack Radiothon Texas Golf Broken Chair Trophy View All Events Get Involved Fundraise Workplace Giving Host an Event Birthday Fundraiser Partner Memorials Give Our Sponsors Volunteer Heroes Donate Shop Blog Select Page About Us Team Jack Board and Staff Team Jack Board Members The Team Jack Foundation is a nonprofit under the leadership of a volunteer board of directors consisting of community and business leaders from around Nebraska and the country. The board meets monthly to discuss budgets, events and other news about the fight against childhood brain cancer. The expert guidance of our volunteer board consistently drives Team Jack to new heights. Rex Burkhead Rex Burkhead is a retired running back of the National Football League. Originally drafted by Cincinnati in the sixth round (190th overall) of the 2013 NFL Draft, Burkhead spent four seasons with the New England Patriots, before signing with the Texans prior to the 2021 season. He was a key offensive contributor each season for the Patriots and was a member of the Patriots 2018 Super Championship team, scoring the last two touchdowns during the thrilling overtime AFC Championship against the Kansas City Chiefs. Burkhead played college football at the University of Nebraska, which is where his story with Team Jack began. Rex has played an important part to the development and ongoing success of the Team Jack Foundation. Not only does Burkhead serve as a board member on the Foundation’s board of directors, but he was instrumental in the Foundation’s inception itself. Team Jack was formed to raise funds for pediatric brain cancer research. Its namesake is Jack Hoffman, a 18-year-old from Nebraska who has been battling the disease for most of his life. Hoffman and Burkhead formed an unlikely friendship when Burkhead was a star player at Nebraska that has continued to this day. Hoffman even won a “Best Moment” ESPY award when he entered Nebraska’s 2013 spring game and scored a 69-yard touchdown while sporting No. 22, Burkhead’s number during his college days. The two even met President Barack Obama together at the White House in 2013. Rex is from Plano, TX, where he currently resides with this wife, Danielle, and two sons, Jett and Steel. Karen Carson Karen Carson is a Co-founder of Fat Brain Toys, a retailer and manufacturer of educational toys and games. Karen’s introduction to the toy industry came about at the suggestion of her then 10-year old son, Adam. In the Fall of 2002, after finding it difficult to locate specialty toys online, her son suggested that she and her husband Mark build their own website to better serve the growing demand for toys online. Carson accepted the challenge from her son and thus began a new career in the toy industry. Since 2002, Fat Brain Toys has grown into one of the largest online toy stores in the country. Recognizing the importance of a true multi-channel experience, Fat Brain Toys has since expanded into brick & mortar retail, opening retail store experiences in Omaha, Nebraska and Overland Park, Kansas. In addition to the company’s direct-to-consumer efforts, the company also designs and wholesales it’s own line of products to over 2,000 retailers around the world. Fat Brain Toys is a frequent benefactor to a number of non-profit organizations that support the needs of children, including: Team Jack Foundation, Omaha Children’s Hospital Foundation, Royal Family Kids, The Toy Bank, and many others. Karen has been married to her husband and business partner, Mark, since 1992, and lives in Elkhorn, Nebraska. Karen and Mark have three children, Adam, Makenzie, and Jenna. Scott Fangman Scott Fangman has 20+ years of industry experience and is the Director of Business Development at Wealth Enhancement Group where he leads outreach to RIAs across the US. He was most recently as the Business Development Officer – M&A for Advisor Seekers, leading their markets and sales team. Scott joined Wealth Enhancement Group because of the shared purpose, mission, and values. Scott previously held regional leadership roles at TD Ameritrade Institutional, where he was recognized multiple times for his accomplishments in surpassing company goals. A Nebraska native, Scott currently resides in Omaha, NE with his wife Anne and their 2 (teenage!) children. When not working, Scott enjoys hiking and reading. Scott also serves on the Board of Directors for the Team Jack Foundation raising funds and awareness for pediatric brain cancer research – his son is a survivor. Dr. Kari Galyen Dr. Kari is originally from Pierce, NE. She went to the University of Nebraska. Dr. Kari Galyen is a general practice family physician. Dr. Galyen and her husband, Dr. Jim Galyen, own and operate Sunny Meadow Medical Clinic in Norfolk, Nebraska. Originally from Pierce, NE, Dr. Galyen attended the University of Nebraska Medical Center where she received her medical doctor (MD) degree. She then completed a dual internal medicine/family practice residency in Omaha and Kearney, NE. Dr. Galyen is a strong advocate for increased funding for child brain cancer research and was a guest speaker at the 2013 Team Jack Foundation Gala. She has a strong commitment to helping improve treatment options and overall survivorship for children facing the disease. Dr. Galyen is married to Dr. Jim Galyen and together they live in Atkinson, NE with their four children, Ainsley, Brody, Blake and Luke. Brianna Hoffman Brianna Hoffman is a pharmacist at West Holt Medical Services in Atkinson, NE. She is also the Co-Founder and Board Chair of the Foundation. To contact: Brianna@TeamJackFoundation.org Kenneth Maxwell Kenneth Maxwell is the co-founder and Vice President of Advertising for Proxibid.com, a privately held Nebraska based e-commerce Company serving more than a million buyers, and thousands of businesses, auction companies, and non-profit organizations worldwide. In his tenure with the company he has led multiple teams responsible for the design and development of their real-time auction platform, and more recently, led the expansion of the company’s marketing team to provide advertising and creative services to Proxibid and their clients. Prior to Proxibid, Kenneth was the creative director for another Nebraska based startup – Leftbid.com, and was also a professional artist, selling original art through Anderson O’Brien Fine Art Gallery in Nebraska. Kenneth studied fine art at the University of Nebraska – Lincoln, and abroad in Florence, Italy. He is classically trained in painting and sculpture and graduated from UNL with a degree in Fine and Performing Arts. Ken resides in Omaha with his wife Lynn, and two children, Kate and Harrison – as well as two black Labrador retrievers, Cira and Chloe, AKA – “the meatballs”. Tiffany Miller Tiffany Miller serves as Deputy General Counsel for First Bank & Trust, Brookings, SD. She has practiced in the banking and financial services industry for over 16 years, specializing in contract negotiation and compliance. Outside of the office, Tiffany is involved in a number of community activities. She serves on the board of directors for Downtown Sioux Falls, Inc., and is on the Sioux Falls Area Chamber of Commerce Community Appeals Committee. Tiffany is motivated to serve the Foundation by the grueling and potentially harmful treatments currently used to treat pediatric brain cancer patients and the dire need for more funding to support pediatric cancer research. In honor of Jack and all children who are called to the front lines in the battle against cancer, Tiffany is committed to the Team Jack mission of raising awareness and funds for pediatric cancer research. She and her family are proud to Take A Stand in the fight against brain cancer together with the Team Jack Foundation. Tiffany and her husband, Dr. Nate Miller, are parents to two young boys, Noah and Luke. Janae Simard Janae Simard is a Registered Dental Hygienist with Family and Implant Dentistry in Lincoln, NE, since 1997. Janae is an originating member of the Team Jack Foundation board and is committed to helping the organization fund pediatric brain cancer research. She was appointed secretary for the Team Jack Foundation in 2013. Janae and her husband Robby live in Omaha, Nebraska with their two boys, Eli and Luke. The Simard family is dedicated to helping the Team Jack Foundation improve treatment for children with brain tumors. Having endured their own family adversity with one of their own children, Janae is a compassionate leader who is known for being a “hands on” servant leader for the Foundation. Janae is active in her childrens’ school and devotes much of her spare time working with children. She enjoys traveling, scuba-diving and family activities. Mark Walz Mark was born and raised in Lincoln, Nebraska. He graduated Summa Cum Laude from Nebraska Wesleyan University in 1988 with a Bachelor of Science Degree in Economics and an emphasis in Accounting. Mark began his professional career in 1988 as an independent auditor with the international accounting firm of Touche Ross & Co. (now Deloitte) in their Lincoln, Nebraska office. His client focus was primarily the banking and insurance industries. In May of 1991, Mark left Deloitte to become the Accounting Manager at Farmers Mutual Insurance Company of Nebraska and has been employed in various positions of increasing responsibility with Farmers Mutual since that time. He was promoted to Controller in 1997; Treasurer in 1999; Vice President and Treasurer in 2002; Senior Vice President, Treasurer and Chief Financial Officer in 2006; Executive Vice President, Treasurer and Chief Operating Officer in 2009; President, Treasurer and Chief Operating Officer in 2010; President and Chief Executive Officer in 2014; and Chairman, President and Chief Executive Officer in 2015. Mark is a member of both the American Institute of Certified Public Accountants and the Nebraska Society of Certified Public Accountants. Mark serves on the Board of Directors of Farmers Mutual Insurance Company of Nebraska, National Association of Mutual Insurance Companies, Nebraska Property and Liability Insurance Guaranty Association, Nebraska Chamber of Commerce, United Way, Team Jack, Junior Achievement, and the US Bank Advisory Board. *Andy Hoffman (Board Chairman 2013 - 2021) Courageous. Passionate. Gregarious. Brave. Selfless. Spiritual. Unwavering. These are just a few of the words used to describe our Team Jack Foundation co-founder, Andy Hoffman. Tributes have poured in from around the country following Andy’s passing on Monday, March 1. Andy was shockingly diagnosed with glioblastoma multiforme, a rare and very aggressive cancer, after having a seizure while running on the Cowboy Trail, in his hometown of Atkinson, Nebraska, in July 2020. Even after getting this devastating news, Andy was more determined than ever to find ways to raise money for Team Jack. And fast, while he was still able. Following his diagnosis, the Team Jack Foundation launched the “Twice the Fight” campaign as a way to show support for both Jack and Andy Hoffman’s brain cancer battles. One of Andy’s first visions to raise money for Team Jack was to sell t-shirts, and this time selling “Twice the Fight” t-shirts saw nearly 3,000 sold for over $65,000 raised. Earlier in 2020, Andy worked hard to fulfill his New Year’s resolution and finished writing his first book, “Yards After Contact” which details the family’s experience during Jack’s fight. It was published in October 2020 and has been a huge success. From the beginning, Andy made one thing clear with his book: 100% of the proceeds for the book sales go to Team Jack and, Team Jack would own the copyright to the book. To date, over 2,500 books have been sold, raising nearly $80,000 for Team Jack. In the book, Andy writes: “This book is the mission statement for the Team Jack Foundation, a Nebraska business that tirelessly works daily to improve brain cancer treatment in its region and nationally fund child brain cancer research. I hope you can open this book and know Jack and what his foundation stands for.” In early December, both ESPN and BigTen Networks produced shows giving an update on the Hoffmans’ life with cancer. The ESPN E:60 story aired as part of programming highlighting the importance of cancer research during ESPN’s 14th consecutive V Week on Dec.1-12. Andy spoke with Chris Connelly about his fight and his hopes for the future of those fighting childhood brain cancer. “This is going to sound screwy, but it’s been a blessing,” he said. “We’re supposed to thank God for the challenges that he gives us, and I’ve prayed the thank-you prayer. Thank you, God, for giving me brain cancer. Because he knows what he’s doing. And you don’t.” Check off another chance for Andy to raise awareness of this disease. Andy always looked to seize every opportunity to raise awareness for childhood brain cancer and fund research from some of the brightest research minds in the country. Although the Hoffmans knew the research they were funding may not benefit their son Jack, he did it for all the families down the road that will receive the horrible diagnosis of pediatric brain cancer. Andy remained hopeful even when faced with the grim nature of his prognosis. Andy worked hard to squeeze more life into his 42 years than most get in a lifetime. He did a couple of bucket list items, including a New Mexico elk hunt with his kids, his wife, and brothers during the last months of his life. He kept his unwavering faith and spent every moment possible with his family. In mid-February, his condition progressed, and his fight ended on Monday, March 1, where he peacefully passed away at home surrounded by his loving family. He is survived by his wife Brianna, children Jack, Ava and Reese, parents Gary and Karen Hoffman of Spencer, brothers Tony (Amy) Hoffman of Crofton and Michael (Jacky) Hoffman of Spencer, sister Julia (Chris) Jones of Tellico Plains, TN, parents-in-law Kerry and Bonnie Stiner of Burke, SD, sister-in-law Tiffany (Nate) Miller of Sioux Falls, SD, brother-in-law Kollin (Sarah) Stiner of Lakeville, MN, nephews Nathan Hoffman of Spencer, Hudson and Hayden Hoffman of Spencer, Luke Jones of Cleveland, OH, Matt and Nate Jones of Clarksburg, MD, Noah, Luke and Graham Miller of Sioux Falls, SD, and Karson Stiner of Lakeville, MN, nieces Alison (Justin) Wegenke of Fort Collins, CO, Samantha (Cody) Kahl of Grand Island, NE, Lauryn and Amelia Hoffman of Spencer, and Isabel and Nora Stiner of Lakeville, MN. He was also excited to be a Great Uncle to Will and Wren Wegenke and Alton Kahl. He was preceded in death by his brother Luke Hoffman. The Team Jack Foundation is committed to working harder than ever to ensure Andy’s legacy shines, and his mission grows. He had big ideas and big dreams for the foundation, and we will focus on making those a reality. He is irreplaceable and his smile and energy will be missed. But we will always follow the path he set to be a success. And fight on in his honor. How lucky we all are to have known him. * * Tragically, Jack’s dad, Andy Hoffman, was diagnosed with brain cancer (glioblastoma) in July of 2020. He battled for seven months before passing away from the disease. The Team Jack Foundation is committed to upholding Andy’s legacy by working harder than ever to fund the cure for childhood brain cancer. Team Jack Staff Team Jack’s caring, driven staff is dedicated to ending childhood brain cancer by pushing Team Jack forward every day. Kylie Dockter, Executive Director Kylie (Tielke) Dockter joined the Foundation in August 2013 as the first full time employee for the Foundation and is excited to be part of the fight against pediatric brain cancer. Kylie received her Bachelor of Science degree in Journalism: Public Relations in December 2009 from the University of Nebraska at Kearney with a minor in Political Science and has strong qualifications in management, marketing and sales through educational and job experience. She has been involved in the non-profit sector for over thirteen years. Prior to the Foundation, Kylie was the Director of Marketing and then Executive Director of a non-profit that benefits nearly 50 non-profits in the Denver, CO metro area. In addition to management skills, she assisted in planning large scale events to raise money for these 50 non-profits. She joined the Team Jack Foundation in August 2013 as the Chief Development Director and is now the Executive Director of the Foundation. Working with a Foundation that has such an impact on children and children’s lives has truly been a career dream for Kylie, so she is very excited to join such a prestigious and impactful Foundation to help with their goals. She was born and raised in Atkinson, NE and is married to her husband Stuart Dockter who is originally from North Dakota and together they have a daughter, Graesyn, and a son, Hayes. To contact: kylie@teamjackfoundation.org Lindsey Nemetz, Director of Marketing Lindsey (Mlnarik) Nemetz, a native of Clearwater, Nebraska, earned her degree in Business Administration from Nebraska Wesleyan University in 2001. While at NWU, she was a member of the Prairie Wolves women’s basketball and softball teams from 1997 to 2001. Lindsey now lives in Atkinson with her husband, Chris, and their five children: Maci, Drake, Avery, Landri, and Brooke. After a six-year career in property and casualty insurance, Lindsey shifted her focus to raising her family. In October 2013, she began working for the Team Jack Foundation on a limited part-time basis. Over time, her role and passion for the mission grew, leading her to become the Foundation’s Director of Marketing in November 2018. She is deeply dedicated to helping find a cure for childhood brain cancer. To contact: lindsey@teamjackfoundation.org Shirley Rossman, Event Coordinator Shirley Rossman joined the Team Jack Foundation in August 2020, assisting with donation processing and merchandise shipping. Before that, she spent her career as an elementary school teacher, retiring from West Holt Public Schools in 2020. A lifelong resident of Atkinson, Shirley and her husband, Bruce, are proud parents of four grown daughters which includes a set of triplets, and grandparents to ten grandchildren. To contact: shirley@teamjackfoundation.org Make an impact through your inbox News, upcoming events and research updates delivered straight to your inbox. About Us Our Mission Jack Hoffman Board & Staff Fund Allocation Financials Our Impact Scientific Advisory Board Sponsored Grants Research Articles Brain Cancer Family Resources Cancer Awareness Months Get Involved Fundraise Give Events Our Sponsors Volunteer Follow Follow Follow Follow Follow © 2025 Team Jack Foundation. POB 607, 47640 US Highway 20, STE 2, Atkinson, NE, 68713. All Rights Reserved. Team Jack Foundation, Inc. is exempt from federal income tax under section 501(c)3, ID Number 46-2301134, of the internal revenue code. All contributions to the Foundation are tax deductible. Privacy Policy • Contact"
    },
    {
      "url": "https://www.springingtheblues.com/contact/",
      "text": "Contact Info for Springing The Blues Festival of Jacksonville Beach, FL Seawalk Pavilion Jacksonville Beach, FL Friday: April 10th, 2026 Saturday: April 11th, 2026 Sunday: April 12th, 2026 Seawalk Pavilion Jacksonville Beach, FL Friday: April 4th, 2025 Saturday: April 5th, 2025 Sunday: April 6th, 2025 Springing The Blues Artists Schedule Tickets Sponsors FAQ Springing The Blues presented by Sawgrass Asset Management Name Phone Email Address Inquiry Inquiry VIP Pass Sponsor Vendor Musician Volunteer Other Message 9 + 8 = Submit Have questions? Need assistance with something? Our team is ready to help. Contact us today!  Contact Us info@springingtheblues.com Call: (904) 270-9301  Seawalk Pavillion 1st Street North Jacksonville Beach, FL 32250 u Frequently Asked Questions Have a question? Check our FAQs. SPRINGING THE BLUES SPONSORS Springing The Blues  VIP Tickets Get the best seats in the house.  Artist Lineup Learn more about the bands. u Frequently Asked Questions Have a question? Check our FAQs.  Seawalk Pavillion 75 1st Street North Jacksonville Beach, FL 32250  Contact Us info@springingtheblues.com Call: (904) 270-9301  Media & Press Info Are you a member of the media? Contact info@springingtheblues.com for more info. Participate  Musicians Interested in performing at Springing The Blues? Contact us!  Sponsorship Be a sponsor for the South East's largest blues festival.  Volunteers Want to help out and listen to great music? Join us!  Vendors Promote & sell your food or merchandise at the festival.  Transportation Get local travel tips & tricks.  Hotels Book local accommodations. Facebook X Terms of Service | Privacy Policy | Cookie Notice | Accessibility | Sitemap Copyright © 1990-2024 - Springing The Blues Festival - All Rights Reserved Designed by Strategic Media Plus"
    },
    {
      "url": "https://www.visitjacksonville.com/about/meet-the-team/",
      "text": "Meet the Team | Visit Jacksonville Skip to content Newsletter Trip Planner 0 Saved 76 ° F Navigation Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Stay in Touch with Everything Jacksonville View Our 2025 Visitor Guide Home Who We Are Meet the Team Meet the Team Share Get in touch with the Visit Jacksonville team. See our full staff listing below. Get to know the friendly and helpful team at Visit Jacksonville. Click through for contact information for every member of our team including sales, destination experience, marketing, media, and more. Executive Team Michael Corrigan President & CEO Charged with marketing, selling and promoting Jacksonville’s image, driving visitation and boosting the economy through tourism. Office Phone: (904) 421-9150 Send An Email Sarina Wiechens Chief Operating Officer Oversees the daily operations and financial components of Visit Jacksonville to implement the vision and mission of the organization and CEO/President. Office Phone: (904) 421-9152 Send An Email Katie Mitura Chief Marketing Officer Oversees the Marketing team to implement the goals of the President and CEO for Visit Jacksonville pertaining to marketing Jacksonville as a premier destination. Office Phone: (904) 421-9160 Send An Email Jeanne Goldschmidt Director of Convention Sales Oversees the Convention Sales team to implement the goals of the President and CEO of Visit Jacksonville pertaining to growth of bookings and support within the destination. Office Phone: (904) 421-9164 Send An Email Courtney Gumbinger Director of Destination Experience Oversees the Destination Experience team to implement the goals of the President and CEO to provide exceptional customer service to both individual visitors as well as group and meeting attendees. Office Phone: (904) 421-9151 Send An Email Administration Becky Bulmer Assistant Director of Finance Responsible for the financial oversight and integrity of financial processes for the organization. Oversees all accounting functions. Office Phone: (904) 421-9189 Send An Email Eva Soto Accounting Manager Responsible for financial oversight, payment processing, financial statements and all financial aspects of the business. Office Phone: (904) 421-9155 Send An Email Laurie Degon Senior Analytics Manager Responsible for data analytics and reporting to develop marketplace analysis of trends in tourism as well as economic impact forecasts. Office Phone: (904) 421-9178 Send An Email Lisa Sharrit Administration Manager Responsible for human resources and insurance components for Visit Jacksonville. Liaison to the Board of Directors. Office Phone: (904) 421-9181 Send An Email Convention Sales Bob Doering Senior National Accounts Manager Responsible for promoting Jacksonville as a premier destination for Corporate, State and National Association conferences and events. Office Phone: (904) 798-9123 Send An Email Emma Carlo National Accounts Manager Responsible for promoting Jacksonville as a premier destination to the Social, Military, Religious and Fraternal markets. Office Phone: (904) 421-9172 Send An Email Sydney Lindblad Sales Development Manager Responsible for promoting Jacksonville as a premier destination to meetings of less than 200 total room nights and sporting events of all sizes. Office Phone: (904) 421-9182 Send An Email Gaby Mikaiel Sales and Administration Manager Responsible for administrative support, grant process management and travel coordination for the sales team and President. Office Phone: (904) 421-9159 Send An Email Destination Experience Paloma Martin Senior Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners, and acts as liaison with local hoteliers and businesses. Office Phone: (904) 421-9176 Send An Email Jorie Allinson Destination Experience Manager Responsible for providing exceptional customer service, referrals, trip planning services and amenities in our visitor centers as well as to groups and planners and oversees visitor center staffing. Office Phone: (904) 421-9154 Send An Email Kerry Weatherhead Destination Experience Coordinator Responsible for assisting visitors contacting or entering centers or as a part of a conference or group with requests for information, maps and brochures, referrals and trip planning services. Office Phone: (904) 798-9111 Send An Email Seymour Jax Responsible for showing you all there is to do and see in Jacksonville. Seymour often roams the streets and is set up at special events. Stop by, say hi, take a selfie… Meet Seymour Marketing Andrea Mestdagh Senior Marketing Communications Manager Responsible for marketing, communication and public relations initiatives to promote and market Jacksonville as a premier leisure destination to key markets. Office Phone: (904) 421-9169 Send An Email Tess Chalifour-Drahman Meetings Marketing Manager Responsible for marketing initiatives and strategies to entice conventions and groups to book their meetings in Jacksonville. Office Phone: (904) 421-9162 Send An Email Joey Bell Community Outreach Manager Responsible for managing outreach initiatives and growing relationships in the local community with all tourism partners and business entities. Office Phone: (904) 421-9157 Send An Email Autumn Leach Marketing Communications Manager Responsible for Visit Jacksonville’s website, promotions and other major marketing initiatives. Office Phone: (904) 421-9166 Send An Email Lauren Hickox Marketing Manager Responsible for assisting with the research and development of marketing materials, website content, app content, email content, and various marketing initiatives. Office Phone: (904) 421-9183 Send An Email Tucker Responsible for exploring Jacksonville and posing for photos. Follow his adventures on Instagram! Meet Tucker Want to join our team? Click here to see the open positions! Here to Help The Jacksonville Information Authority Visit Jacksonville is your go-to resource as you begin to plan your next Jacksonville story. Read More Your Next Meeting Destination Read More Industry Resources Learn about the Power of Tourism Read More More About Visit Jacksonville Destination Experience Hub Read More Meet the Sales Team Read More Meet the Visit Jacksonville Insiders Read More Visit Jacksonville Board of Directors Read More Research & Development Information Read More Jacksonville Area History Read More JAX Facts Read More Jacksonville Accolades Read More Stay in Touch with Everything Jacksonville Sign Up View Our 2025 Visitor Guide Download Things to Do Beaches & Waterways Outdoors Family Fun Arts & Culture Shopping Sports Nightlife Dog-Friendly Tours Travel Guides and Itineraries Black Travel LGBTQ+ Travel Latino Travel Events Annual Events Submit Your Event Neighborhoods Beaches & Waterways Arlington Brooklyn Cathedral District Downtown Jacksonville Durkeeville Eastside Mandarin Murray Hill North Jacksonville & Airport Ortega Rail Yard District Riverside Avondale San Marco Southside Springfield Westside Food & Drink Jax Ale Trail Jax Coffee & Donuts Trail Mayport Shrimp Trail Distilleries Where to Stay Plan Your Trip Getting Here & Getting Around App & Brochures Newsletter Sign-Up Meeting Planners Newsletter Update Visitor Centers Jacksonville Webcams An Accessible Travel Guide Deals Weather Frequently Asked Questions Cruisin' for a Good Time Traveling to Jacksonville for Medical Treatment? Meetings & Events Submit a Meeting or Event RFP Meetings Incentives Venues Meet the Sales Team Destination Services Why Meet in Jax Virtual Site Visit Intellectual Capital Bring It Home! Jax Join Our Volunteer Database Meeting Planners Newsletter Sign-Up Newsletter Sign-Up Group Sports Media Who We Are Blog Visit Jacksonville 100 North Laura Street Suite 120 Jacksonville, FL 32202 (800) 733-2668 Industry Resources Newsletter Sign-Up Meet the Team Board of Directors Job Postings Privacy Policy ©2025 Visit Jacksonville, All Rights Reserved Cookies Policy This website uses cookies to optimize your visitor experience. Accept or Learn more Quick Search Search Location Map"
    },
    {
      "url": "https://www.springingtheblues.com/",
      "text": "Springing The Blues Music Festival in Jacksonville Beach, FL Seawalk Pavilion Jacksonville Beach, FL Friday: April 10th, 2026 Saturday: April 11th, 2026 Sunday: April 12th, 2026 Seawalk Pavilion Jacksonville Beach, FL Friday: April 4th, 2025 Saturday: April 5th, 2025 Sunday: April 6th, 2025 Springing The Blues Artists Schedule Tickets Sponsors FAQ Join the JaX Beach Fun! The Springing The Blues presented by Sawgrass Asset Management is one of the world’s finest blues music events, located at the Seawalk Pavilion in downtown Jacksonville Beach . Please join us on April 4th-6th,  2025 for three great days of blues on the beach! Be sure to get your VIP passes now ! The Springing The Blues presented by Sawgrass Asset Management is a free , outdoor blues music festival that celebrates America’s indigenous musical form. The three-day oceanfront event features national, regional and local blues artists on two stages . Springing the Blues is held at Jacksonville Beach’s SeaWalk Pavilion every April. DAY ONE: Friday, April 10th, 2026 Buy VIP Tickets LINEUP COMING SOON! DAY TWO: Saturday, April 11th, 2026 Buy VIP Tickets LINEUP COMING SOON! DAY THREE: Sunday, April 12th, 2026 Buy VIP Tickets LINEUP COMING SOON! SPRINGING THE BLUES SPONSORS Springing The Blues  VIP Tickets Get the best seats in the house.  Artist Lineup Learn more about the bands. u Frequently Asked Questions Have a question? Check our FAQs.  Seawalk Pavillion 75 1st Street North Jacksonville Beach, FL 32250  Contact Us info@springingtheblues.com Call: (904) 270-9301  Media & Press Info Are you a member of the media? Contact info@springingtheblues.com for more info. Participate  Musicians Interested in performing at Springing The Blues? Contact us!  Sponsorship Be a sponsor for the South East's largest blues festival.  Volunteers Want to help out and listen to great music? Join us!  Vendors Promote & sell your food or merchandise at the festival.  Transportation Get local travel tips & tricks.  Hotels Book local accommodations. Facebook X Terms of Service | Privacy Policy | Cookie Notice | Accessibility | Sitemap Copyright © 1990-2024 - Springing The Blues Festival - All Rights Reserved Designed by Strategic Media Plus"
    },
    {
      "url": "https://jax.com/contact-jax/",
      "text": "Contact | JAX INC. Contact JAX +1 262 781 8850 Please complete the contact form and we’ll get in touch with you shortly. Alternatively, you can contact our CSR team by telephone. I'm Interested In: - Select Your Interest - Requesting a Product Quote Connecting with a Distributor In My Area Application Assistance or Cross-Reference Information Send Me Literature On JAX Products I'm Interested In Becoming a Distributor For JAX Products First Name Last Name Email Phone I have read and agree to JAX INC. Privacy Policy Company Company Title Company Address City State/Province - SELECT STATE/PROVINCE - Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Nova Scotia Ontario Prince Edward Island Quebec Saskatchewan Zip/Postal Code Country SELECT COUNTRY Afghanistan Albania Algeria Andorra Angola Antigua & Deps Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bhutan Bolivia Bosnia Herzegovina Botswana Brazil Brunei Bulgaria Burkina Burundi Cambodia Cameroon Canada Cape Verde Central African Rep Chad Chile China Colombia Comoros Congo Congo {Democratic Rep} Costa Rica Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Fiji Finland France Gabon Gambia Georgia Germany Ghana Greece Grenada Guatemala Guinea Guinea-Bissau Guyana Haiti Honduras Hungary Iceland India Indonesia Iran Iraq Ireland {Republic} Israel Italy Ivory Coast Jamaica Japan Jordan Kazakhstan Kenya Kiribati Korea North Korea South Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Mauritania Mauritius Mexico Micronesia Moldova Monaco Mongolia Montenegro Morocco Mozambique Myanmar, {Burma} Namibia Nauru Nepal Netherlands New Zealand Nicaragua Niger Nigeria Norway Oman Pakistan Palau Panama Papua New Guinea Paraguay Peru Philippines Poland Portugal Qatar Romania Russian Federation Rwanda St Kitts & Nevis St Lucia Saint Vincent & the Grenadines Samoa San Marino Sao Tome & Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Sudan Spain Sri Lanka Sudan Suriname Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tonga Trinidad & Tobago Tunisia Turkey Turkmenistan Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Yemen Zambia Zimbabwe Message/Comments SUBMIT Corporate Headquarters N59 W13330 Manhardt Dr., Menomonee Falls, WI 53051 Monday to Friday 7:30am to 4:00pm CST (262) 781-8850 (800) 782-8850 info@jax.com Western Regional Distribution Center 819 F Street, Suite 400 West Sacramento, CA 95605 Customer Support & Sales +1 262 781 8850 N59 W13330 Manhardt Dr., Menomonee Falls, WI 53051 Monday to Friday 7:30am - 4:00pm CST JAX INC. JAX is a US-based industrial lubricant manufacturer with expertise formulating high-performance synthetic lubricants, fleet and heavy-duty lubricants, industrial lubricants and biodegradable and food-grade lubricants. Since 1955, JAX has earned a worldwide reputation as a leader in emerging lubrication technology. Contact | Privacy Policy | Sitemap | © 2023 JAX Incorporated"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/musicians/",
      "text": "Musicians & Performer Application | Jax Beach Music Festivals (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page Musicians & Performers Contact us today for showcase opportunities! ARTIST APPLICATION ARTIST APPLICATION Festival Location Jax Beach Festivals, Inc. produces festivals and special events at the oceanfront Seawalk Pavilion in the City of Jacksonville Beach, Florida. Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/music-festival-locations/",
      "text": "Music Festival Locations in Jacksonville Beach, Florida (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page Music Festival Locations Seawalk Plaza Address Information and More Festival Address Seawalk Pavilion, 100 1st Ave N Jacksonville Beach, Florida 32250 Jax Beach Festivals Sponsors Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/sponsors/",
      "text": "Sponsors & Advertiser Application | Jax Beach Music Festivals (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page Sponsors & Advertisers Put your Brand in front of over thousands of potential customers. BECOME A SPONSOR In 1990, Sam Veal and a handful of friends held the first Springing the Blues Festival in a small pergola near the old Jacksonville Beach Flag Pavilion . The event featured six acts and lasted one day . Thirty years later, Springing the Blues Festival is one of the most highly anticipated music events in Florida . Read more > Our OCEANFRONT music festivals create days of FUN for THOUSANDS of fans and EXCLUSIVE opportunities to promote your brand! MEDIA EXPOSURE? WE’VE GOT YOU COVERED. In The News N Florida Times-Union N Folio Weekly N Buzz Magazine N All Jax Local News N Blues Review Magazine Notable Awards  Top 50 Music Festivals Named by Downbeat Magazine as one of the Top 50 Music Festivals in the World .  Top 20 Destinations Named by Southeast Tourism Society as one of the Top 20 Destination Events in the country .  Best Festival in Northeast Florida Voted “ Best Festival in Northeast Florida ” in 2016 by the popular Folio Weekly Magazine annual readers’ poll. READY TO BE A SPONSOR? MORE FESTIVAL INFO HOW ABOUT WE PUT YOUR BRAND HERE, AND HERE, AND HERE . . . Customers love businesses who help the local community . Learn more about how Jax Beach Festivals gives back to the local economy. COMMUNITY GROWTH. ONE FESTIVAL AT A TIME. Since its inception in 1991, the Springing the Blues Festival has had a tremendous impact on the Jacksonville Beach area, the artists and the concert-goers who come back year after year. Here’s a look back to celebrate 28 years of Blues in Jacksonville and what it has done for the local community. Management & Staff  Blood, Sweat & Blues Jax Beach Festivals take over 10 months of planning by volunteers.  It's a Team Effort 100+ volunteers commit their time to make it a great fan experience. } Volunteer Love Roughly 5,000 hours are generously volunteered each year to make sure the party rocks on. Economic Impact  Local Communities Over $5.5 million infused in the local economy each year.  Hotels Love Us More than 5,300 hotel rooms sold yearly during the festivals.  It's Time to Eat 15,000 restaurant meals bought each year by festival attendees. Benefits Charities  Giving Back is Good Proceeds from the festival have been disseminated to various local charities , including: Beaches Arts Foundation Exchange Club Beaches Emergency Assistance Ministry Fletcher High School Blues/Jazz Band Beaches Habitat for Humanity Improving Children’s Playgrounds Blues in the Schools Jacksonville Beach Food Kitchen Community Assisted Policing Effort (CAPE) Meals on Wheels Duval County 4-H Entertainment and Arts Collaborative of Northeast Florida Support Local Talent  We've Got the Blues Springing The Blues has featured over 298 blues artists in 28 years. Z Talented Artists 790 Blues Music Award nominees have played at our festivals.  The Best of the Best 189 Blues Music Award winners have played at our festivals.  World Renowned 18 International Blues Challenge winners and top 3 finalists.  Hall of Fame Artists 10 Blues Hall of Fame inductees. READY TO SPONSOR A GREAT LOCAL EVENT? CLICK HERE TO GET STARTED. Jax Beach Festivals Sponsors Jax Beach Festivals has partnered with Airstream Ventures for all sponsor & advertising opportunities. Contact our sponsor support team using the form. We look forward to working with you. Thank you. Festival Location Jax Beach Festivals, Inc. produces festivals and special events at the oceanfront Seawalk Pavilion in the City of Jacksonville Beach, Florida. Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/",
      "text": "Jax Beach Festivals | Music Festivals in Jacksonville, Florida (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page Check Out Our Festivals Below! 13th Annual Community First Seawalk Festival Dates: 2/22 – 2/23/2025 LOCAL festival. LOCAL vendors. LOCAL music. LOCAL life. communityfirstseawalkmusicfest.com Buy a VIP Pass Now! The 33rd Annual Springing The Blues Dates: 4/4- 4/6/2025 Named by “Downbeat Magazine” as one of the top 50 Music Festivals in the World! springingtheblues.com Buy a VIP Pass Now! Interested in Participating? For Vending, Exhibiting, Sponsoring & Volunteering, contact us today! Get Info Jax Beach Festivals Sponsors Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/festival-applications/",
      "text": "Jacksonville Music Festival Applications - Download Center (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page Festival Application Request Complete the form below or email jaxbeachfestivalsvendors@gmail.com to request your application. Thank you! Become a Sponsor Interested in becoming a sponsor of one or all of the festivals? LEARN MORE Festival Location Jax Beach Festivals, Inc. produces festivals and special events at the oceanfront Seawalk Pavilion in the City of Jacksonville Beach, Florida. Jax Beach Festivals Sponsors Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://www.jaxbeachfestivals.com/tos/",
      "text": "ToS - Jax Beach Festivals (904) 270-9301 info@jaxbeachfestivals.com Community First Seawalk Springing The Blues Home Tickets Community First Seawalk VIP Pass Springing the Blues VIP Pass Vendors – Musicians – Sponsors Vendors Musicians Sponsors Application Request Overhead Site Photos FAQ Location Select Page Contents: Terms of Service Privacy Policy Terms of Service: The following terms and conditions govern all use of the jaxbeachfestivals.com website and all\ncontent,\nservices and products available at or through the website (taken together, the Website). The Website is owned\nand operated by Jax Beach Festivals, Inc. (\"Jax Beach Festivals\"). The Website is\noffered subject to your acceptance without modification of all of the terms and conditions contained herein and\nall other operating rules, policies (including, without\nlimitation, Jax Beach Festivals' Privacy Policy) and procedures that may be\npublished from time to time on this Site by Jax Beach Festivals (collectively, the \"Agreement\"). Please read this Agreement carefully before accessing or using the Website. By accessing or using any part of the\nweb site, you agree to become bound by the terms and conditions of this agreement. If you do not agree to all\nthe terms and conditions of this agreement, then you may not access the Website or use any services. If these\nterms and conditions are considered an offer by Jax Beach Festivals, acceptance is expressly limited to\nthese terms. The Website is available only to individuals who are at least 13 years\nold. Your jaxbeachfestivals.com Account and Site. If you create a blog/site on the\nWebsite, you are responsible for maintaining the security of your account and blog, and you are fully\nresponsible for all activities that occur under the account and any other actions taken in connection with\nthe blog. You must not describe or assign keywords to your blog in a misleading or unlawful manner,\nincluding in a manner intended to trade on the name or reputation of others, and Jax Beach Festivals            may change or remove any description or keyword that it considers inappropriate or unlawful, or otherwise\nlikely to cause Jax Beach Festivals liability. You must immediately\nnotify Jax Beach Festivals of any unauthorized uses of your blog, your account or any other breaches\nof security. Jax Beach Festivals will not be liable for any acts or omissions by You, including any\ndamages of any kind incurred as a result of such acts or omissions. Responsibility of Contributors. If you operate a blog, comment on a blog, post material to\nthe Website, post links on the Website, or otherwise make (or allow any third party to make) material\navailable by means of the Website (any such material, \"Content\"), You are entirely responsible for\nthe content of, and any harm resulting from, that Content. That is the case regardless of whether the\nContent in question constitutes text, graphics, an audio file, or computer software. By making Content\navailable, you represent and warrant that: the downloading, copying and use of the Content will not infringe the proprietary rights, including\nbut not limited to the copyright, patent, trademark or trade secret rights, of any third party; if your employer has rights to intellectual property you create, you have either (i) received\npermission from your employer to post or make available the Content, including but not limited to\nany software, or (ii) secured from your employer a waiver as to all rights in or to the Content; you have fully complied with any third-party licenses relating to the Content, and have done all\nthings necessary to successfully pass through to end users any required terms; the Content does not contain or install any viruses, worms, malware, Trojan horses or other harmful\nor destructive content; the Content is not spam, is not machine- or randomly-generated, and does not\ncontain unethical or unwanted commercial content designed to drive traffic to third party sites or\nboost the search engine rankings of third party sites, or to further unlawful acts (such as\nphishing) or mislead recipients as to the source of the material (such as spoofing); the Content is not pornographic, does not contain threats or incite violence towards individuals or\nentities, and does not violate the privacy or publicity rights of any third party; your blog is not getting advertised via unwanted electronic messages such as spam links on\nnewsgroups, email lists, other blogs and web sites, and similar unsolicited promotional methods; your blog is not named in a manner that misleads your readers into thinking that you are another\nperson or company. For example, your blog's URL or name is not the name of a person other than\nyourself or company other than your own; and you have, in the case of Content that includes computer code, accurately categorized and/or\ndescribed the type, nature, uses and effects of the materials, whether requested to do so by\nJax Beach Festivals or otherwise. By submitting Content to Jax Beach Festivals for inclusion on your Website, you\ngrant Jax Beach Festivals a world-wide, royalty-free, and non-exclusive license to reproduce,\nmodify, adapt and publish the Content solely for the purpose of displaying, distributing and promoting\nyour blog. If you delete Content, Jax Beach Festivals will use reasonable efforts to remove it\nfrom the Website, but you acknowledge that caching or references to the Content may not be made\nimmediately unavailable. Without limiting any of those representations or warranties, Jax Beach Festivals has the right\n(though not the obligation) to, in Jax Beach Festivals' sole discretion (i) refuse or\nremove any content that, in Jax Beach Festivals' reasonable opinion, violates\nany Jax Beach Festivals policy or is in any way harmful or objectionable, or (ii) terminate or\ndeny access to and use of the Website to any individual or entity for any reason,\nin Jax Beach Festivals' sole discretion. Jax Beach Festivals will have no\nobligation to provide a refund of any amounts previously paid. Payment and Renewal. General Terms. By selecting a product or service, you agree to pay Jax Beach Festivals the one-time and/or\nmonthly or\nannual subscription fees indicated (additional payment terms may be included in other\ncommunications). Subscription payments will be charged on a pre-pay basis on the day you sign up for\nan Upgrade and will cover the use of that service for a monthly or annual subscription period as\nindicated. Payments are not refundable. Automatic Renewal. Unless you notify Jax Beach Festivals before the end of the applicable subscription period\nthat you want\nto cancel a subscription, your subscription will automatically renew and you authorize us to collect\nthe then-applicable annual or monthly subscription fee for such subscription (as well as any taxes)\nusing any credit card or other payment mechanism we have on record for you. Upgrades can be canceled\nat any time by submitting your request to Jax Beach Festivals in writing. Services. Fees; Payment. By signing up for a Services account you agree to\npay Jax Beach Festivals                    the applicable setup fees and recurring fees. Applicable fees will be invoiced starting from the day\nyour services are established and in advance of using such services. Jax Beach Festivals                    reserves the\nright to change the payment terms and fees\nupon thirty (30) days                    prior written notice to you. Services can be canceled by you at anytime on\nthirty (30) days written notice\nto Jax Beach Festivals. Support. If your service includes access to priority email support. \"Email\nsupport\" means the ability to make requests for technical support assistance by email at any\ntime (with reasonable efforts by Jax Beach Festivals to respond within\none business day) concerning the use of the VIP Services.\n\"Priority\"\nmeans that support takes priority over support for users of the standard or\nfree jaxbeachfestivals.com                    services. All support will be provided in accordance\nwith Jax Beach Festivals standard services practices,\nprocedures and policies. Responsibility of Website Visitors. Jax Beach Festivals has not reviewed, and\ncannot review, all\nof the material, including computer software, posted to the Website, and cannot therefore be responsible for\nthat material's content, use or effects. By operating the Website, Jax Beach Festivals does not\nrepresent or imply\nthat it endorses the material there posted, or that it believes such material to be accurate, useful or\nnon-harmful. You are responsible for taking precautions as necessary to protect yourself and your computer\nsystems from viruses, worms, Trojan horses, and other harmful or destructive content. The Website may\ncontain content that is offensive, indecent, or otherwise objectionable, as well as content containing\ntechnical inaccuracies, typographical mistakes, and other errors. The Website may also contain material that\nviolates the privacy or publicity rights, or infringes the intellectual property and other proprietary\nrights, of third parties, or the downloading, copying or use of which is subject to additional terms and\nconditions, stated or unstated. Jax Beach Festivals disclaims any responsibility for any harm\nresulting from the\nuse by visitors of the Website, or from any downloading by those visitors of content there posted. Content Posted on Other Websites. We have not reviewed, and cannot review, all of the\nmaterial, including computer software, made available through the websites and webpages to which\njaxbeachfestivals.com links, and that link to jaxbeachfestivals.com.\nJax Beach Festivals does not have any control over those non-Jax Beach Festivals websites\nand webpages, and is not responsible for their contents or their use. By linking to a\nnon-Jax Beach Festivals website or webpage, Jax Beach Festivals does not represent or imply\nthat it endorses such website or webpage. You are responsible for taking precautions as necessary to protect\nyourself and your computer systems from viruses, worms, Trojan horses, and other harmful or destructive\ncontent. Jax Beach Festivals disclaims any responsibility for any harm resulting from your use of\nnon-Jax Beach Festivals websites and webpages. Copyright Infringement and DMCA Policy. As Jax Beach Festivals asks others to\nrespect its\nintellectual property rights, it respects the intellectual property rights of others. If you believe that\nmaterial located on or linked to by jaxbeachfestivals.com violates your copyright, you are\nencouraged to notify Jax Beach Festivals in accordance with Jax Beach Festivals' Digital Millennium Copyright Act (\"DMCA\") Policy.\nJax Beach Festivals will respond to all such notices, including as required or appropriate by\nremoving the infringing material or disabling all links to the infringing\nmaterial. Jax Beach Festivals will terminate a visitor's access to and use of the Website if, under\nappropriate circumstances, the visitor is determined to be a repeat infringer of the copyrights or other\nintellectual property rights of Jax Beach Festivals or others. In the case of such\ntermination, Jax Beach Festivals will have no obligation to provide a refund of any amounts\npreviously paid to Jax Beach Festivals. Intellectual Property. This Agreement does not transfer from Jax Beach Festivals            to you any Jax Beach Festivals or third party intellectual property, and all right, title and\ninterest in and to such property will remain (as between the parties) solely\nwith Jax Beach Festivals. Jax Beach Festivals, jaxbeachfestivals.com,\nthe jaxbeachfestivals.com logo, and all other trademarks, service marks, graphics and logos used\nin connection with jaxbeachfestivals.com, or the Website are trademarks or registered trademarks\nof Jax Beach Festivals or Jax Beach Festivals' licensors. Other trademarks, service\nmarks, graphics and logos used in connection with the Website may be the trademarks of other third parties.\nYour use of the Website grants you no right or license to reproduce or otherwise use\nany Jax Beach Festivals or third-party trademarks. Advertisements. Jax Beach Festivals reserves the right to display advertisements\non your blog unless you have purchased an ad-free account. Attribution. Jax Beach Festivals reserves the right to display attribution links\nsuch as 'Blog at jaxbeachfestivals.com,' theme author, and font attribution in your blog footer\nor toolbar. Partner Products. By activating a partner product (e.g. theme) from one of our partners,\nyou agree to that partner's terms of service. You can opt out of their terms of service at any time by\nde-activating the partner product. Domain Names. If you are registering a domain name, using or transferring a previously\nregistered domain name, you acknowledge and agree that use of the domain name is also subject to the\npolicies of the Internet Corporation for Assigned Names and Numbers (\"ICANN\"), including their Registration\nRights and Responsibilities . Changes. Jax Beach Festivals reserves the right, at its sole discretion, to modify\nor replace any\npart of this Agreement. It is your responsibility to check this Agreement periodically for changes. Your\ncontinued use of or access to the Website following the posting of any changes to this Agreement constitutes\nacceptance of those changes. Jax Beach Festivals may also, in the future, offer new services and/or\nfeatures\nthrough the Website (including, the release of new tools and resources). Such new features and/or services\nshall be subject to the terms and conditions of this Agreement. Termination. Jax Beach Festivals may terminate your access to all or any part of\nthe Website at\nany time, with or without cause, with or without notice, effective immediately. If you wish to terminate\nthis Agreement or your jaxbeachfestivals.com account (if you have one), you may simply\ndiscontinue\nusing the\nWebsite. Notwithstanding the foregoing, if you have a paid services account, such account can only be\nterminated by Jax Beach Festivals if you materially breach this Agreement and fail to cure such\nbreach within\nthirty (30) days            from Jax Beach Festivals' notice to you thereof;\nprovided that, Jax Beach Festivals can terminate the Website immediately as part of a general shut\ndown of our\nservice. All provisions of this Agreement which by their nature should survive termination shall survive\ntermination, including, without limitation, ownership provisions, warranty disclaimers, indemnity and\nlimitations of liability. Disclaimer of Warranties. The Website is provided \"as is\".\nJax Beach Festivals and its suppliers and licensors hereby disclaim all warranties of any kind,\nexpress or\nimplied, including, without limitation, the warranties of merchantability, fitness for a particular purpose\nand non-infringement. Neither Jax Beach Festivals nor its suppliers and licensors, makes any\nwarranty that the\nWebsite will be error free or that access thereto will be continuous or uninterrupted. You understand that\nyou download from, or otherwise obtain content or services through, the Website at your own discretion and\nrisk. Limitation of Liability. In no event will Jax Beach Festivals,\nor its suppliers\nor licensors, be liable with respect to any subject matter of this agreement under any contract, negligence,\nstrict liability or other legal or equitable theory for: (i) any special, incidental or consequential\ndamages; (ii) the cost of procurement for substitute products or services; (iii) for interruption of use or\nloss or corruption of data; or (iv) for any amounts that exceed the fees paid by you\nto Jax Beach Festivals under this agreement during\nthe twelve (12) month period prior to the cause of\naction. Jax Beach Festivals shall have no liability for any failure or delay due to matters beyond\ntheir reasonable control. The foregoing shall not apply to the extent prohibited by applicable law. General Representation and Warranty. You represent and warrant that (i) your use of the\nWebsite will be in strict accordance with\nthe Jax Beach Festivals Privacy Policy, with this Agreement\nand with all applicable laws and regulations (including without limitation any local laws or regulations in\nyour country, state, city, or other governmental area, regarding online conduct and acceptable content, and\nincluding all applicable laws regarding the transmission of technical data exported from the United States\nor the country in which you reside) and (ii) your use of the Website will not infringe or misappropriate the\nintellectual property rights of any third party. Indemnification. You agree to indemnify and hold harmless Jax Beach Festivals, its\ncontractors,\nand its licensors, and their respective directors, officers, employees and agents from and against any and\nall claims and expenses, including attorneys' fees, arising out of your use of the Website, including but\nnot limited to your violation of this Agreement. Miscellaneous. This Agreement constitutes the entire agreement\nbetween Jax Beach Festivals and\nyou concerning the subject matter hereof, and they may only be modified by a written amendment signed by an\nauthorized executive of Jax Beach Festivals, or by the posting by Jax Beach Festivals of a\nrevised version. Except to\nthe extent applicable law, if any, provides otherwise, this Agreement, any access to or use of the Website\nwill be governed by the laws of the state of Florida, U.S.A., excluding its conflict of law provisions,\nand the proper\nvenue for any disputes arising out of or relating to any of the same will be the state and federal courts\nlocated in Duval County, Florida. Except for claims for injunctive or equitable relief or\nclaims regarding\nintellectual property rights (which may be brought in any competent court without the posting of a bond),\nany dispute arising under this Agreement shall be finally settled in accordance with the Comprehensive\nArbitration Rules of the Judicial Arbitration and Mediation Service, Inc. (\"JAMS\") by three\narbitrators appointed in accordance with such Rules. The arbitration shall take place in\nJacksonville, Florida, in the English language and the arbitral decision may be\nenforced\nin any court.\nThe prevailing party in any action or proceeding to enforce this Agreement shall be entitled to costs and\nattorneys' fees. If any part of this Agreement is held invalid or unenforceable, that part will be construed\nto reflect the parties' original intent, and the remaining portions will remain in full force and effect. A\nwaiver by either party of any term or condition of this Agreement or any breach thereof, in any one\ninstance, will not waive such term or condition or any subsequent breach thereof. You may assign your rights\nunder this Agreement to any party that consents to, and agrees to be bound by, its terms and conditions;\nJax Beach Festivals may assign its rights under this Agreement without condition. This Agreement\nwill be binding\nupon and will inure to the benefit of the parties, their successors and permitted assigns. Back to top Privacy Policy: Jax Beach Festivals, Inc. (\" Jax Beach Festivals \")\noperates jaxbeachfestivals.com and may operate other websites. It\nis Jax Beach Festivals' policy to respect your privacy regarding any information we may collect\nwhile operating our websites. Website Visitors Like most website operators, Jax Beach Festivals collects non-personally-identifying information of the\nsort that web browsers and servers typically make available, such as the browser type, language preference,\nreferring site, and the date and time of each visitor request. Jax Beach Festivals' purpose in\ncollecting non-personally identifying information is to better understand\nhow Jax Beach Festivals' visitors use its website. From time to\ntime, Jax Beach Festivals may release non-personally-identifying information in the aggregate, e.g., by\npublishing a report on trends in the usage of its website. Jax Beach Festivals also collects potentially personally-identifying information like Internet Protocol\n(IP) addresses for logged in users and for users leaving comments on jaxbeachfestivals.com        blogs/sites. Jax Beach Festivals only discloses logged in user and commenter IP addresses under the same\ncircumstances that it uses and discloses personally-identifying information as described below, except that\ncommenter IP addresses and email addresses are visible and disclosed to the administrators of the blog/site\nwhere the comment was left. Gathering of Personally-Identifying Information Certain visitors to Jax Beach Festivals' websites choose to interact\nwith Jax Beach Festivals in ways that require Jax Beach Festivals to gather\npersonally-identifying information. The amount and type of information that Jax Beach Festivals gathers\ndepends on the nature of the interaction. For example, we ask visitors who sign up at jaxbeachfestivals.com to provide a\nusername and email address. Those who engage in transactions with Jax Beach Festivals are asked to\nprovide additional information, including as necessary the personal and financial information required to\nprocess those transactions. In each case, Jax Beach Festivals collects such information only insofar as\nis necessary or appropriate to fulfill the purpose of the visitor's interaction with\nJax Beach Festivals. Jax Beach Festivals does not disclose personally-identifying information\nother than as described below. And visitors can always refuse to supply personally-identifying information, with\nthe caveat that it may prevent them from engaging in certain website-related activities. Aggregated Statistics Jax Beach Festivals may collect statistics about the behavior of visitors to its\nwebsites. Jax Beach Festivals may display this information publicly or provide it to others.\nHowever, Jax Beach Festivals does not disclose personally-identifying information other than as\ndescribed below. Protection of Certain Personally-Identifying Information Jax Beach Festivals discloses potentially personally-identifying and personally-identifying information\nonly to those of its employees, contractors and affiliated organizations that (i) need to know that information\nin order to process it on Jax Beach Festivals' behalf or to provide services available\nat Jax Beach Festivals' websites, and (ii) that have agreed not to disclose it to others. Some\nof those employees, contractors and affiliated organizations may be located outside of your home country; by\nusing Jax Beach Festivals' websites, you consent to the transfer of such information to\nthem. Jax Beach Festivals will not rent or sell potentially personally-identifying and\npersonally-identifying information to anyone. Other than to its employees, contractors and affiliated\norganizations, as described above, Jax Beach Festivals discloses potentially personally-identifying and\npersonally-identifying information only in response to a subpoena, court order or other governmental request, or\nwhen Jax Beach Festivals believes in good faith that disclosure is reasonably necessary to protect the\nproperty or rights of Jax Beach Festivals, third parties or the public at large. If you are a registered\nuser of an Jax Beach Festivals website and have supplied your email address, Jax Beach Festivals        may occasionally send you an email to tell you about new features, solicit your feedback, or just keep you up to\ndate with what's going on with Jax Beach Festivals and our products. If you send us a request (for\nexample via email or via one of our feedback mechanisms), we reserve the right to publish it in order to help us\nclarify or respond to your request or to help us support other users. Jax Beach Festivals takes all\nmeasures reasonably necessary to protect against the unauthorized access, use, alteration or destruction of\npotentially personally-identifying and personally-identifying information. Cookies A cookie is a string of information that a website stores on a visitor's computer, and that the visitor's browser\nprovides to the website each time the visitor returns. Jax Beach Festivals uses cookies to\nhelp Jax Beach Festivals identify and track visitors, their usage of Jax Beach Festivals        website, and their website access preferences. Jax Beach Festivals visitors who do not wish to have\ncookies placed on their computers should set their browsers to refuse cookies before\nusing Jax Beach Festivals' websites, with the drawback that certain features\nof Jax Beach Festivals' websites may not function properly without the aid of cookies. Business Transfers If Jax Beach Festivals, or substantially all of its assets, were acquired, or in the unlikely event\nthat Jax Beach Festivals goes out of business or enters bankruptcy, user information would be one of the\nassets that is transferred or acquired by a third party. You acknowledge that such transfers may occur, and that\nany acquirer of Jax Beach Festivals may continue to use your personal information as set forth in this\npolicy. Ads Ads appearing on any of our websites may be delivered to users by advertising partners, who may set cookies.\nThese cookies allow the ad server to recognize your computer each time they send you an online advertisement to\ncompile information about you or others who use your computer. This information allows ad networks to, among\nother things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy\nPolicy covers the use of cookies by Jax Beach Festivals and does not cover the use of cookies by any\nadvertisers. Privacy Policy Changes Although most changes are likely to be minor, Jax Beach Festivals may change\nits Privacy Policy from time to time, and in Jax Beach Festivals' sole\ndiscretion. Jax Beach Festivals encourages visitors to frequently check this page for any changes to\nits Privacy Policy. If you have a jaxbeachfestivals.com account, you might also\nreceive an alert informing you of these changes. Your continued use of this site after any change in\nthis Privacy Policy will constitute your acceptance of such change. Back to top Cookie Policy Effective Date: 06-Dec-2024 Last Updated: 06-Dec-2024 What are cookies? This Cookie Policy explains what cookies are and how we use them, the types of cookies we use i.e, the information we collect using cookies and how that information is used, and how to manage the cookie settings. Cookies are small text files that are used to store small pieces of information. They are stored on your device when the website is loaded on your browser. These cookies help us make the website function properly, make it more secure, provide better user experience, and understand how the website performs and to analyze what works and where it needs improvement. How do we use cookies? As most of the online services, our website uses first-party and third-party cookies for several purposes. First-party cookies are mostly necessary for the website to function the right way, and they do not collect any of your personally identifiable data. The third-party cookies used on our website are mainly for understanding how the website performs, how you interact with our website, keeping our services secure, providing advertisements that are relevant to you, and all in all providing you with a better and improved user experience and help speed up your future interactions with our website. Types of Cookies we use Manage cookie preferences Cookie Settings You can change your cookie preferences any time by clicking the above button. This will let you revisit the cookie consent banner and change your preferences or withdraw your consent right away. In addition to this, different browsers provide different methods to block and delete cookies used by websites. You can change the settings of your browser to block/delete the cookies. Listed below are the links to the support documents on how to manage and delete cookies from the major web browsers. Chrome: https://support.google.com/accounts/answer/32050 Safari: https://support.apple.com/en-in/guide/safari/sfri11471/mac Firefox: https://support.mozilla.org/en-US/kb/clear-cookies-and-site-data-firefox?redirectslug=delete-cookies-remove-info-websites-stored&redirectlocale=en-US Internet Explorer: https://support.microsoft.com/en-us/topic/how-to-delete-cookie-files-in-internet-explorer-bca9446f-d873-78de-77ba-d42645fa52fc If you are using any other web browser, please visit your browser’s official support documents. Cookie Policy Generated By CookieYes – Cookie Policy Generator . Home Vendors Musicians Sponsors Applications Location FAQ Accessibility Terms & Conditions Cookie Policy Copyright © 2001-2024 - Jax Beach Festivals, Inc. - All Rights Reserved Web Design by Strategic Media Plus"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/community-first-seawalk-music-festival-2024",
      "text": "Community First Seawalk Music Festival 2024 | Kids Out and About Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips Community First Seawalk Music Festival 2024 *The event has already taken place on this date: Sun, 02/25/2024 Join Jax Beach Festivals and Community First Credit Union for the Community First Seawalk Music Festival In its 9th year, we bring you local merchants, local foods and local performers onstage at the oceanfront pavilion in Jacksonville Beach. The Community First Seawalk Music Festival is a free, family-friendly event that celebrates local music. Click here for more information about this activity Please help us keep this calendar up to date! If this activity is sold out, canceled, or otherwise needs alteration, email mindy@kidsoutandabout.com so we can update it immediately. If you have a question about the activity itself, please contact the organization administrator listed below. GET YOUR TICKET TODAY Jacksonville Beach Festivals *Times, dates, and prices of any activity posted to our calendars are subject to change. Please be sure to click through directly to the organization’s website to verify. Location: Seawalk Pavilion - Jacksonville Beach, FL 75 1st St N Jacksonville Beach , FL , 32250 United States See map: Google Maps Contact name: Jacksonville Beach Festivals Email address: info@jaxbeachfestivals.com Click for more information The event has already taken place on this date: 02/25/2024 Time: See website Price: FREE - VIP $30 Ages All Ages Tags: Event Annual event Festival/fair Food event Outdoors Event Performance Outdoors Arts: Performance Music Nature/Outdoors Web Service Pinterest Share on Facebook Tweet Widget Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    }
  ]
}