{
  "fuentes": [
    {
      "url": "https://www.jaxcafe.com/pages/contact-us",
      "email": "bill@jaxcafe.com"
    },
    {
      "url": "https://www.jaxcafe.com/pages/contact-us",
      "email": "events@jaxcafe.com"
    },
    {
      "url": "https://www.jaxcafe.com/pages/contact-us",
      "email": "rob@jaxcafe.com"
    },
    {
      "url": "https://www.tripadvisor.co.uk/Restaurant_Review-g1635501-d21091801-Reviews-Jaxons_Eating_House-Upminster_Greater_London_England.html",
      "email": "enquiries@jaxonseatinghouse.com"
    },
    {
      "url": "https://www.brownsrestaurantgroup.com/contactus",
      "email": "corporatehr@brownsrestaurantgroup.com"
    },
    {
      "url": "https://www.brownsrestaurantgroup.com/contactus",
      "email": "csvensson@brownsrestaurantgroup.com"
    },
    {
      "url": "https://www.brownsrestaurantgroup.com/contactus",
      "email": "franchising@brownsrestaurantgroup.com"
    },
    {
      "url": "https://www.brownsrestaurantgroup.com/contactus",
      "email": "giftcards@brownsrestaurantgroup.com"
    },
    {
      "url": "https://carmensluxurytravel.com/a-family-owned-historic-gem-in-south-florida-jaxsons-ice-cream-parlour-restaurant/",
      "email": "carmen@carmensluxurytravel.com"
    },
    {
      "url": "https://jacksons.com/contact/",
      "email": "news@jacksons.com"
    },
    {
      "url": "https://jax.com/contact-jax/",
      "email": "info@jax.com"
    },
    {
      "url": "https://jacksonsrestaurant.com/",
      "email": "contact@jacksonsrestaurant.com"
    },
    {
      "url": "https://burgerbeast.com/jaxsons-ice-cream/",
      "email": "burgerbeast@burgerbeast.com"
    }
  ],
  "mails": [
    "bill@jaxcafe.com",
    "burgerbeast@burgerbeast.com",
    "carmen@carmensluxurytravel.com",
    "contact@jacksonsrestaurant.com",
    "corporatehr@brownsrestaurantgroup.com",
    "csvensson@brownsrestaurantgroup.com",
    "enquiries@jaxonseatinghouse.com",
    "events@jaxcafe.com",
    "franchising@brownsrestaurantgroup.com",
    "giftcards@brownsrestaurantgroup.com",
    "info@jax.com",
    "news@jacksons.com",
    "rob@jaxcafe.com"
  ],
  "nombre_sitio": "jaxsonsrestaurant.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jaxcafe.com/pages/contact-us",
      "text": "Contact Us\n – Jax Cafe, Inc. Skip to content Make a Reservation Menus Private Dining Weddings Our Story Shop Jax Log in X (Twitter) Facebook Instagram Make a Reservation Menus Private Dining Weddings Our Story Shop Jax Search Log in Cart Item added to your cart View cart Check out Continue shopping Get Jax Cafe emails and texts We are proud to offer a variety of special offers and promotions only to our email list throughout the year and would like to share them with you. For reservations, please visit the Make a Reservation page or call us at (612) 789-7297 . Contact form Name Email * Phone number Comment / Birthday / Anniversary Send 1928 University Ave NE Minneapolis, MN 55418 Get Directions Hours Weekend Brunch Seating Hours: Saturday and Sunday 10:00AM -1:30PM Lunch Menu Seating Hours: Friday Only: 11:00AM - 2:00PM Happy Hour (Bar Only) Seating Hours: Wednesday to Sunday: 3:30PM to 6:00PM Dinner Menu Seating Hours: Wednesday to Saturday 4:00PM to 9:00PM Sunday 4:00PM to 8:00PM Contact Info Phone: (612) 789-7297 Owner Bill bill@jaxcafe.com Chef Rob rob@jaxcafe.com Events - Hayley events@jaxcafe.com Gallery Our Story Share Your Story Contact Shop Jax Careers Facebook Instagram X (Twitter) © 2025, Jax Cafe, Inc. Powered by Shopify Refund policy Privacy policy Terms of service Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.tripadvisor.co.uk/Restaurant_Review-g1635501-d21091801-Reviews-Jaxons_Eating_House-Upminster_Greater_London_England.html",
      "text": "JAXONS EATING HOUSE, Upminster - 2025 Reviews & Information Skip to main content Discover Trips Review GBP Sign in Upminster Hotels Things to Do Restaurants Flights Cruises Holiday Rentals Forums Europe United Kingdom (UK) England Greater London Upminster Upminster Restaurants Jaxons Eating House Jaxons Eating House Claimed Someone from this business manages this listing. Learn More Share Review Save 3.5 3.5 of 5 bubbles ( 42 reviews ) #41 of 72 Restaurants in Upminster European , Grill , ££ - £££ 30 What is Travellers’ Choice? Tripadvisor gives a Travellers’ Choice award to accommodations, attractions and restaurants that consistently earn great reviews from travellers and are ranked within the top 10% of properties on Tripadvisor. Interior 4 Food 15 Drinks 2 Jaxons Eating House Share Review Save At a glance Closed today See all hours St. Marys Lane Cranham Golf Course, Upminster RM14 3NU England Website +44 1708 560056 Email Improve this listing About British casual fine dining restuarant open to the public, based on Cranham golf course. We are open Wednesday to Saturday for dinner and open for Sunday lunch. We do not turn tables so your table is yours for the evening so there is no rushing you out the door and you can feel relaxed and enjoy your meal. With an elegant feel, Jaxon's is the perfect place to come and celebrate with your loved one. With an additional private function room with its own bar, we are able to accommodate for larger parties, and specialise in hosting wakes. Read more Read less Features CUISINES European, Grill, Contemporary Meal types Dinner PRICE ££ - £££ FEATURES Reservations Seating Serves Alcohol Wheelchair Accessible Location St. Marys Lane Cranham Golf Course, Upminster RM14 3NU England Is this an European restaurant? Yes No Unsure Save this restaurant Save Hours Suggest an edit Closed today Sunday 12:00 - 16:30 Monday Closed Tuesday Closed Wednesday Closed Thursday Closed Friday 18:00 - 21:00 Saturday 18:00 - 21:00 Reviews Tips/Q&A All reviews Write a review Traveller photos All reviews We perform checks on reviews. Tripadvisor’s approach to reviews Before posting, each Tripadvisor review goes through an automated tracking system, which collects information, answering the following questions: how, what, where and when. If the system detects something that potentially contradicts our community guidelines , the review is not published. When the system detects a problem, a review may be automatically rejected, sent to the reviewer for validation, or manually reviewed by our team of content specialists, who work 24/7 to maintain the quality of the reviews on our site. Our team checks each review posted on the site disputed by our community as not meeting our community guidelines . Learn more about our review moderation. Write a review Reviews are the subjective opinion of Tripadvisor members and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. No reviews for this property yet. Write a review Best moderately priced restaurants See all Sponsored Aspen Tree 3.8 3.8 of 5 bubbles ( 191 reviews ) Bar • ££ - £££ Open now Thatched House 4.0 4 of 5 bubbles ( 974 reviews ) Bar • ££ - £££ Open now Reserve LEFKE Restaurant & Bar 4.6 4.6 of 5 bubbles ( 439 reviews ) Bar • ££ - £££ Open now Order online The Jobber's Rest 4.3 4.3 of 5 bubbles ( 822 reviews ) British • ££ - £££ Open now Sorrento 4.6 4.6 of 5 bubbles ( 239 reviews ) Italian • ££ - £££ Open now Crumpled Horn 4.3 4.3 of 5 bubbles ( 278 reviews ) Bar • ££ - £££ Open now Kaani Kaana 5.0 5 of 5 bubbles ( 34 reviews ) Indian • ££ - £££ Open now Order online Fete Lounge 4.5 4.5 of 5 bubbles ( 126 reviews ) ££ - £££ Open now Masala Grill 4.4 4.4 of 5 bubbles ( 251 reviews ) Indian • ££ - £££ Open now Order online Junction 4.4 4.4 of 5 bubbles ( 127 reviews ) Bar • ££ - £££ Open now Best nearby We rank these hotels, restaurants, and attractions by balancing reviews from our members with how close they are to this location. Best nearby hotels See all Glass House Retreat 4.9 4.9 of 5 bubbles ( 512 ) 2.63 miles away Travelodge London Romford The Quadrant 4.3 4.3 of 5 bubbles ( 687 ) 4.64 miles away Travelodge London Romford 4.3 4.3 of 5 bubbles ( 412 ) 4.69 miles away Marygreen Manor Hotel 4.3 4.3 of 5 bubbles ( 1,601 ) 3.69 miles away Best nearby restaurants See all Thatched House 4.0 4 of 5 bubbles ( 973 ) 0.37 miles away The Jobber's Rest 4.3 4.3 of 5 bubbles ( 822 ) 0.5 miles away Farm Cafe-A 3.9 3.9 of 5 bubbles ( 49 ) 0.08 miles away Puddledock Farm and Fishery 4.1 4.1 of 5 bubbles ( 60 ) 0.45 miles away Best nearby attractions See all Thames Chase Forest Centre 4.3 4.3 of 5 bubbles ( 166 ) 0.51 miles away Room Lockdown 4.9 4.9 of 5 bubbles ( 1,388 ) 2.77 miles away Stubbers Adventure Centre 4.7 4.7 of 5 bubbles ( 231 ) 1.62 miles away Brentwood Karting 4.7 4.7 of 5 bubbles ( 379 ) 2.7 miles away Is This Your Listing? Own or manage this property?  Claim your listing for free to respond to reviews, update your profile and much more. Claim Your Free Listing JAXONS EATING HOUSE, Upminster - 2025 Reviews & Information Upminster Upminster Tourism Upminster Hotels Bed and Breakfast Upminster Upminster Holiday Rentals Flights to Upminster Upminster Restaurants Upminster Attractions Upminster Photos Upminster Map Hotels All Upminster Hotels Upminster Hotel Deals Hotels Near Me Near Landmarks Hotels near Thames Chase Forest Centre Hotels near Partyman World Of Play Upminster Hotels near Upminster Windmill Hotels near Upminster Park Hotels near Clockhouse Gardens Hotels near Cely Woods Hotels near Upminster Tithe Barn Museum of Nostalgia Hotels near Harold Court Woods Hotels near Partyman World Of Play Hotels near Parklands Open Space Near Train Stations Hotels near Upminster Station Hotels near West Horndon Station Hotels near Kenton Hotels near Harrow & Wealdstone Hotels near Laindon Station Hotels near Upminster Bridge Hotels near Hornchurch Hotels near Emerson Park Station Hotels near Brentwood Station Hotels near Headstone Lane Near Airports Hotels near Heathrow Airport (LHR) Hotels near London City Airport (LCY) Hotels near Luton Airport (LTN) Motels near London City Airport (LCY) Motels near Luton Airport (LTN) Motels near Heathrow Airport (LHR) Near Colleges Hotels near London Institute of Management and Technology Hotels near University of East London Popular Hotel Categories Popular All-Inclusive Family Resorts Popular Hotels With Waterparks Popular All-Inclusive Hotels Popular Bed and Breakfasts Popular Hostels Popular Ski Resorts Popular All-Inclusive Resorts Popular Cheap Resorts Popular Villas Popular Campgrounds Things to Do Restaurants All Upminster Restaurants Restaurants near Jaxons Eating House Popular Types of Food Healthy Restaurants in Upminster Pakistani Restaurants in Upminster Fast Food Restaurants in Upminster Turkish Restaurants in Upminster Street Food Restaurants in Upminster Gluten Free Restaurants in Upminster Halal Restaurants in Upminster Vegetarian Restaurants in Upminster Vegan Restaurants in Upminster British Restaurants with Outdoor Seating in Upminster Late Night Indian Restaurants in Upminster Cafes for Lunch in Upminster Popular Dishes Best Fettuccine Alfredo in Upminster Best Doner Kebab in Upminster Best Fajitas in Upminster Best Porterhouse Steaks in Upminster Best Gelato in Upminster Best Pancakes in Upminster Best Crawfish in Upminster Best Steak Frites in Upminster Best Beef Bourguignon in Upminster Best Lobster in Upminster Best Pad Thai in Upminster Best Wings in Upminster Best Cod in Upminster Best Haddock in Upminster Best Salmon in Upminster Popular Restaurant Categories Breakfast Restaurants in Upminster Lunch Restaurants in Upminster Dinner Restaurants in Upminster Cheap Eats in Upminster Buffet Restaurants in Upminster Late Night Restaurants in Upminster Restaurants for Group Dining in Upminster Kid Friendly Restaurants in Upminster Food Delivery Restaurants in Upminster Restaurants with Outdoor Seating in Upminster Desserts in Upminster Coffee & Tea in Upminster Flights Holiday Rentals Travel Stories Cruises More Tours Add a Place Airlines Travellers' Choice Help Centre Trip Planner © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in United Kingdom . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor   LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor   LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor  . Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more £ GBP United Kingdom"
    },
    {
      "url": "https://www.brownsrestaurantgroup.com/contactus",
      "text": "Contact Us — Browns Restaurant Group 0 Skip to Content Our Team Key Players Careers Franchising Franchising FAQ News Our Brands Gift Cards Contact Us Open Menu Close Menu Our Team Key Players Careers Franchising Franchising FAQ News Our Brands Gift Cards Contact Us Open Menu Close Menu Folder: Our Team Back Key Players Careers Folder: Franchising Back Franchising FAQ News Our Brands Gift Cards Contact Us Contact us. Corporate Office Information 207A – 3540 West 41st Avenue Vancouver, British Columbia V6N 3E6 Phone: 604.630.0885 Restaurant Feedback: Rant & Rave We value your feedback! Please use the links below. Browns Socialhouse Browns Crafthouse Liberty Kitchen Scotty Browns Gift Card Program and Charitable Donations For all charitable donations or gift card inquiries, please send a detailed email to our Gift Card Administrator Get In Touch Browns Restaurant Group offers a variety of partnership opportunities. To get to know more about you, your business approach and your interest level, we have a few questions we need you to answer, to see if this is a potential match. We encourage you to share as much information as possible and include anything that you find will make your candidacy stand out as a potential Browns Franchisee. Download the General Information  Fillable Form Corporate Contacts Franchise, Real Estate & Partnership Opportunities Bruce Fox  | email Corporate Marketing, Media Inquiries & Operations Chris Svensson | email Human Resources For all HR-related concerns, please send a detailed email to our Corporate HR Administrator 207A - 3540 W41st Avenue, Vancouver, BC (604)-630-0885"
    },
    {
      "url": "https://carmensluxurytravel.com/a-family-owned-historic-gem-in-south-florida-jaxsons-ice-cream-parlour-restaurant/",
      "text": "A Family-Owned Historic Gem in South Florida: Jaxson’s Ice Cream Parlour & Restaurant Skip to content Luxury Travel Blogger – Carmen Edelson Menu Visit My Shop Search Search Facebook Twitter Instagram Pinterest Bloglovin' YouTube RSS Visit My Shop Search Primary navigation HOME ABOUT PRESS AND MEDIA PRIVACY POLICY LUXURY DESTINATIONS UNITED STATES CALIFORNIA CHICAGO COLORADO FLORIDA FORT LAUDERDALE MIAMI ST. PETERSBURG NEW YORK RHODE ISLAND WASHINGTON DC AFRICA MAURITIUS ASIA INDONESIA JAPAN MALDIVES SINGAPORE TOKYO AUSTRALIA CANADA CARIBBEAN BAHAMAS CUBA DOMINICAN REPUBLIC JAMAICA PUERTO RICO ST. LUCIA CHINA EUROPE PORTUGAL AUSTRIA VIENNA CROATIA CZECH REPUBLIC PRAGUE FRANCE PARIS GERMANY GREECE HUNGARY BUDAPEST ICELAND IRELAND ITALY NORWAY PORTUGAL ROMANIA SPAIN UKRAINE UNITED KINGDOM LONDON MIDDLE EAST DUBAI ISRAEL TURKEY RUSSIA SOUTH AMERICA LUXURY TRAVEL LUXURY AIRLINES PRIVATE JETS LUXURY CRUISES LUXURY HOTELS LUXURY BOUTIQUE HOTELS LUXURY CASTLES LUXURY RESORTS & SPAS LUXURY VILLAS & VACATION HOMES LUXURY SKIING RESORTS LUXURY TOURS LUXURY TRAINS LIFESTYLE ARTS BOATING BEAUTY + FASHION GIVEAWAYS | LIFESTYLE INTERVIEWS TECH FOOD + WINE CONTACT Search and filter blog content Close Search Content filters Years 2025 2024 2023 2022 2021 2020 2019 2018 2017 2016 2015 2014 2013 Categories LIFESTYLE TRAVEL LUXURY TRAVEL DESTINATIONS LUXURY AIRLINES & CRUISES TOURS, LUXURY HOTELS EUROPE LUXURY HOTELS UNITED STATES FOOD + WINE BEAUTY + FASHION LUXURY RESORTS, HOTELS & LUXURY SPAS FLORIDA SPAIN LUXURY TOURS LUXURY CRUISES SITES TO SEE LUXURY TRAVEL TO ITALY LUXURY TRAVEL ASIA FRANCE CARIBBEAN LUXURY TRAVEL UNITED KINGDOM Tags Cuba Luxury Hotel Luxury Hotels Spain Seven Stars Luxury Hospitality and Lifestyle Awards Italy Seven Stars Luxury Awards Travel to Cuba New York City Luxury Family Hotel Luxury Travel Tenerife Luxury Hotel Deals Luxury Hotel Rooms Greece London Hotel Luxury Luxury Hotel Breaks Luxury Hotel Offers Luxury Hotel Amenities Months September 2025 August 2025 July 2025 June 2025 May 2025 April 2025 March 2025 February 2025 January 2025 December 2024 November 2024 October 2024 September 2024 August 2024 July 2024 June 2024 May 2024 April 2024 March 2024 February 2024 Mobile sidebar Close Mobile sidebar navigation HOME ABOUT PRESS AND MEDIA PRIVACY POLICY LUXURY DESTINATIONS UNITED STATES CALIFORNIA CHICAGO COLORADO FLORIDA NEW YORK RHODE ISLAND WASHINGTON DC AFRICA MAURITIUS ASIA INDONESIA JAPAN MALDIVES SINGAPORE TOKYO AUSTRALIA CANADA CARIBBEAN BAHAMAS CUBA DOMINICAN REPUBLIC JAMAICA PUERTO RICO ST. LUCIA CHINA EUROPE PORTUGAL AUSTRIA CROATIA CZECH REPUBLIC FRANCE GERMANY GREECE HUNGARY ICELAND IRELAND ITALY NORWAY PORTUGAL ROMANIA SPAIN UKRAINE UNITED KINGDOM MIDDLE EAST DUBAI ISRAEL TURKEY RUSSIA SOUTH AMERICA LUXURY TRAVEL LUXURY AIRLINES PRIVATE JETS LUXURY CRUISES LUXURY HOTELS LUXURY BOUTIQUE HOTELS LUXURY CASTLES LUXURY RESORTS & SPAS LUXURY VILLAS & VACATION HOMES LUXURY SKIING RESORTS LUXURY TOURS LUXURY TRAINS LIFESTYLE ARTS BOATING BEAUTY + FASHION GIVEAWAYS | LIFESTYLE INTERVIEWS TECH FOOD + WINE CONTACT Blog posts A Family-Owned Historic Gem in South Florida: Jaxson’s Ice Cream Parlour & Restaurant FLORIDA , FOOD + WINE , LIFESTYLE , TRAVEL , UNITED STATES August 11, 2023 Lauren Meshkin I am proud to call South Florida home, and while I have often shared my favorite places to eat in Fort Lauderdale , I have another gem to introduce you to today. Jaxson’s Ice Cream Parlour & Restaurant takes guests on a delectable journey to a place where ice cream isn’t just a treat – it’s a heartfelt tradition that has stood the test of time. If you find yourself in Dania Beach, prepare to be drawn in by the irresistible allure and historic charm of Jaxson’s. You see, Jaxson’s isn’t just an ice cream parlor; it’s a slice of history dripping with nostalgia. Founded in 1956, this family-owned establishment has seen generations of locals and tourists indulge in its culinary delights. Owner Linda Zakheim Udell is like the guardian of a delicious time capsule, ensuring that the magic created by her parents, Monroe and Connie Udell, lives on. This is a true family business, where Linda is at Jaxson’s every weekday making sure guests are getting the most out of their visit. After all, she grew up at Jaxson’s, and it is wonderfully obvious how much pride and passion she puts into it. When her father passed in 2014, she took ownership of the family business and has continued running Jaxson’s just as he would. Her father’s mission was to produce the finest food and ice cream possible, with that mission still ringing true today because of Linda. As you step inside Jaxson’s, prepare to be transported back to the 1950s. The interiors are a fascinating tapestry of nostalgia, with every inch oozing old-school charm. With one of the nation’s largest collections of American memorabilia, this sets the stage for an authentic, vintage experience that’s as Instagram-worthy as it is heartwarming. Family photos line the walls, along with an impressive number of historic license plates. Do not miss out on browsing their country store section which is filled with fresh candy that is bagged daily at Jaxson’s, plus an assortment of retro toys that are fun for both kids and adults to browse. Speaking of license plates, one of the first things I noticed upon arriving at Jaxson’s were the amount of cars parked out front with different license plates from around the United States. This is clearly a popular stop for tourists, road trippers, as well as South Florida locals. So, it is even more fitting when you walk inside and are greeted with license plates on the walls from around North America. Let’s take a moment to talk about the savory dishes at Jaxson’s, because the high quality ingredients here goes way beyond their famous ice cream. The menu boasts an array of classic American dishes that are perfect for a hearty meal before diving into a sundae. From juicy burgers that defy gravity with their towering toppings to crispy onion rings that practically beg for a dip in their homemade cajun remoulade (I told Linda she needs to bottle and sell this stuff!), every bite feels like a warm hug from your favorite comfort food. This is not your average, diner-quality food. The quality here is exceptional and the prices are incredibly fair for the large portions you receive. Their kids meals are amazing value as well for those 10 years old and under, with each meal coming with fries and a sundae. I also highly recommend any of their all-beef, New York-style hot dogs. With a 1/2 pound being the smallest option, each hot dog is served on a toasted bun, with an array of toppings to choose from. The pastrami sandwiches are also out of this world — I could go on and on, but let’s get to the ice-cream! Jaxson’s ice cream is the stuff of legends; all 50+ flavors are made in-house with the kind of care that only comes from decades of practice. Along with the ice cream, all of their sundae toppings and sodas are made in house as well, using all of her dads’ secret recipes. Flavors range from classics like Chocolate to the wild and wacky Bubble Gum, your taste buds are in for a rollercoaster ride of flavor. My personal favorite ice cream flavors at Jaxson’s are their creamy Vanilla, Rock Road, Oreo Cookie, and Strawberry Cheesecake. And if you’re feeling adventurous, dive into their indulgent sundaes, ice cream goblets, soda floats, or banana splits. Not only are there multiple ways to enjoy ice cream at Jaxson’s, but they even offer a few fat-free, dairy-free, and sugar-free options as well. If you’re visiting Jaxson’s with a group of at least 4 people, I highly recommend ordering The Kitchen Sink. Cleverly playing on the phrase ‘everything but the kitchen sink’, this dish is quite famous at Jaxson’s, and is a registered trademark and original design of their founder, Monroe. Each person gets to picks an ice cream flavor and they’ll receive 1 pound of ice cream per person; it’s all piled high with bananas, strawberry, pineapple, chocolate syrup, marshmallows, whipped cream and sprinkles. If that weren’t exciting enough, they bring it to the table in a “kitchen sink” with sparklers on top, American flags, while an old-fashioned fire siren sounds off! This is so much fun for a birthday or special occasion and will create such a memorable ending to your visit at Jaxson’s. Photo courtesy of Jaxson’s . I highly recommend paying this historic ice cream parlor and restaurant a visit next time you’re in South Florida. Jaxson’s is a time capsule, a family legacy, and a culinary adventure all rolled into one delightful package. 1950s family owned restaurant jaxson's 1950s restaurants in america best family owned restaurants in florida best ice cream in dania beach best ice cream in florida best ice cream in fort lauderdale best ice cream in south florida best restaurants in dania beach best restaurants in south florida family owned restaurants in south florida historic restaurants in america historic restaurants in florida jaxson's dania beach restaurant review jaxson's famous ice cream jaxson's ice cream parlour and restaurant review what to eat at jaxson's dania beach Share this story Facebook Twitter Pinterest Google+ Email Leave a Comment About the author Lauren Meshkin Lauren Meshkin is a travel writer and online content creator with a passion for Europe and North America. For almost a decade, she's shared her travels online with the hopes of entertaining, inspiring, and guiding people towards a lifetime of travel. As a content manager for the Carmen's Luxury Travel team, she is always thinking of new ways to share the best of the best when it comes to luxury travel and how to expertly plan your next five-star trip. Instagram You Might Also Like The Best Fine Dining Restaurants in York, England Luxury Stars in Rome: A Grand Vacation Apartment Near the Colosseum 4 Reasons to Try Scuba Diving Vista Verde Ranch: A Luxury Dude Ranch Experience Bonnet House Museum and Gardens Albania’s Street Art Scene: The City’s Most Colorful Murals Flying with Qatar Executive: The Ultimate Luxury Travel Experience Why Your Next Vacation Should Be In The South-East Of Sicily Little Palm Island Resort & Spa, Little Torch Key Discovering the Hidden Charms of Albi in Southern France Leave a Comment Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Please enter an answer in digits: 2 × 2 = « Previous Post 6 Surprising Ways Loungewear Can Spruce Up Your Lifestyle Next Post » 5 Must-See Destinations Perfect for Ski Breaks Site sidebar WELCOME TO MY BLOG I’m Carmen... \r\n\r\nIn this blog, I share my passion for travel and my insights on the most luxurious places to stay, the most delicious places to eat, and the most interesting destinations to visit in the world. Read More Facebook Twitter Instagram Pinterest Bloglovin' YouTube RSS Video Intro https://www.youtube.com/watch?v=O1I9aHrqYeI My Latest Video HOTEL CASA 1800 | A Luxury Stay in SEVILLE, SPAIN Visit our YouTube channel View this profile on Instagram Carmen Edelson (@ carmensluxurytravel ) • Instagram photos and videos NEVER MISS A POST First Name Last Name Email address: Leave this field empty if you're human: Facebook Twitter Instagram Pinterest Bloglovin' YouTube RSS NAVIGATION HOME LUXURY DESTINATIONS LUXURY TRAVEL LUXURY FOOD LIFE STYLE QUICK INTRO I’m Carmen...In this blog, I share my passion for travel and my insights on the most luxurious places to stay, the most delicious places to eat, and the most interesting destinations to visit in the world. Read More CONTACT ME carmen@carmensluxurytravel.com Copyright © Carmen's Luxury Travel 2025 All Rights Reserved."
    },
    {
      "url": "https://jacksons.com/contact/",
      "text": "Contact Jacksons Food Stores - Jacksons Food Stores Let’s Go Rewards Offers Hot In-Store Offers Member Exclusive Offers Locations Order Let’s Go Rewards Offers Hot In-Store Offers Member Exclusive Offers Locations Order Login CONTACT US Get in touch JACKSONS FOOD STORES, INC 3450 E. Commercial St. Meridian, Idaho 83642 CALL US Local: (208) 888-6061 Toll-Free: (888) 369-0657 CAREERS JacksonsCompanies.com NEED HELP WITH JACKSONS LET'S GO REWARDS? Visit Let's Go Rewards Support ADDITIONAL CONTACT OPTIONS Donations & Sponsorships Vendor Inquiries Media Inquiries? Please contact us at news@jacksons.com Full Name Email Address Phone Number Preferred Method of Contact Phone Email If comments are related to a specific store or store employee, please include the following: Employee Name Store Number (or Street Address) Date Time Select A Subject Stores Products General Inquiries Comments By submitting this form you consent to us emailing you occasionally about our products and services. You can unsubscribe from emails at any time, and we will never pass your email onto third parties. Privacy Policy Submit STAY IN TOUCH SUBSCRIBE NOW COMPANY Our Story Our Brands Bananas Brew Reserve Jacksons Products Jacksons + Boise State Careers Real Estate Vendor Inquiries SERVICES Let's Go Rewards Delivery Car Wash ExtraMile by Jacksons Shell Fuel Rewards Chevron Texaco Rewards COMMUNITY Communities Company News Volunteer Work Donations | Sponsorships Win With Jacksons GET IN TOUCH Let's Go Rewards FAQs Let's Go Rewards Support Contact Us Local: (208)888-6061 Toll-Free: (888)369-0657 Facebook-f Icon-tiktok X-twitter Instagram Linkedin COMPANY Our Story Our Brands Bananas Bakehouse Brew Reserve Jacksons Products Jacksons + Boise State Careers Real Estate Vendor Inquiries SERVICES Let's Go Rewards Delivery Car Wash ExtraMile by Jacksons Shell Fuel Rewards Chevron Texaco Rewards COMMUNITY Communities Company News Volunteer Work Donations | Sponsorships Win With Jacksons GET IN TOUCH Let's Go Rewards FAQs Let's Go Rewards Support Contact Us Local: (208)888-6061 Toll-Free: (888)369-0657 Facebook-f Icon-tiktok X-twitter Instagram Linkedin © 2024 Jacksons Food Stores, Inc. All Rights Reserved. Employee Portal Let’s Go Rewards Terms | Terms of Use | Privacy Policy | CCPA Data Request Let’s Go Rewards Terms | Terms of Use Privacy Policy | CCPA Data Request Employee Portal Login Email or username Password Remember me Lost your password? or Select a category"
    },
    {
      "url": "https://jax.com/contact-jax/",
      "text": "Contact | JAX INC. Contact JAX +1 262 781 8850 Please complete the contact form and we’ll get in touch with you shortly. Alternatively, you can contact our CSR team by telephone. I'm Interested In: - Select Your Interest - Requesting a Product Quote Connecting with a Distributor In My Area Application Assistance or Cross-Reference Information Send Me Literature On JAX Products I'm Interested In Becoming a Distributor For JAX Products First Name Last Name Email Phone I have read and agree to JAX INC. Privacy Policy Company Company Title Company Address City State/Province - SELECT STATE/PROVINCE - Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Alberta British Columbia Manitoba New Brunswick Newfoundland and Labrador Nova Scotia Ontario Prince Edward Island Quebec Saskatchewan Zip/Postal Code Country SELECT COUNTRY Afghanistan Albania Algeria Andorra Angola Antigua & Deps Argentina Armenia Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bhutan Bolivia Bosnia Herzegovina Botswana Brazil Brunei Bulgaria Burkina Burundi Cambodia Cameroon Canada Cape Verde Central African Rep Chad Chile China Colombia Comoros Congo Congo {Democratic Rep} Costa Rica Croatia Cuba Cyprus Czech Republic Denmark Djibouti Dominica Dominican Republic East Timor Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Ethiopia Fiji Finland France Gabon Gambia Georgia Germany Ghana Greece Grenada Guatemala Guinea Guinea-Bissau Guyana Haiti Honduras Hungary Iceland India Indonesia Iran Iraq Ireland {Republic} Israel Italy Ivory Coast Jamaica Japan Jordan Kazakhstan Kenya Kiribati Korea North Korea South Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macedonia Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Mauritania Mauritius Mexico Micronesia Moldova Monaco Mongolia Montenegro Morocco Mozambique Myanmar, {Burma} Namibia Nauru Nepal Netherlands New Zealand Nicaragua Niger Nigeria Norway Oman Pakistan Palau Panama Papua New Guinea Paraguay Peru Philippines Poland Portugal Qatar Romania Russian Federation Rwanda St Kitts & Nevis St Lucia Saint Vincent & the Grenadines Samoa San Marino Sao Tome & Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Slovakia Slovenia Solomon Islands Somalia South Africa South Sudan Spain Sri Lanka Sudan Suriname Swaziland Sweden Switzerland Syria Taiwan Tajikistan Tanzania Thailand Togo Tonga Trinidad & Tobago Tunisia Turkey Turkmenistan Tuvalu Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Yemen Zambia Zimbabwe Message/Comments SUBMIT Corporate Headquarters N59 W13330 Manhardt Dr., Menomonee Falls, WI 53051 Monday to Friday 7:30am to 4:00pm CST (262) 781-8850 (800) 782-8850 info@jax.com Western Regional Distribution Center 819 F Street, Suite 400 West Sacramento, CA 95605 Customer Support & Sales +1 262 781 8850 N59 W13330 Manhardt Dr., Menomonee Falls, WI 53051 Monday to Friday 7:30am - 4:00pm CST JAX INC. JAX is a US-based industrial lubricant manufacturer with expertise formulating high-performance synthetic lubricants, fleet and heavy-duty lubricants, industrial lubricants and biodegradable and food-grade lubricants. Since 1955, JAX has earned a worldwide reputation as a leader in emerging lubrication technology. Contact | Privacy Policy | Sitemap | © 2023 JAX Incorporated"
    },
    {
      "url": "https://jacksonsrestaurant.com/",
      "text": "Home - Jackson's Steakhouse Skip to content Home About Our History Contact Location Menus Menus Lunch Dinner Wine Bar Private Events Venue Menus News News Calendar Newsletter Shop Shop E-Gift Cards Gift Card Balance Reservations 0 Toggle website search 0 Menu Close Sep 10 Wednesday Wine Down Wednesday Wine Down Wednesday Starting at 5:00 for half-priced wines on our Governor’s List! 5:00 PM WELCOME TO JACKSON’S MAINE LOBSTER MONDAY Whole Maine Lobster $19.95, Monday Night 5:00 PM – 6:00 PM PRIME TIME TUESDAY Prime Rib Special beginning at 5:00 PM\nSlow-roasted herb and spice-rubbed 16-oz. President’s cut of boneless prime rib of beef and a steakhouse potato $19.95. WINE DOWN WEDNESDAY Beginning at 5:00 PM for half-priced bottles of wine from our award winning wine list COOKING CLASSES Save the Third For Chef Irv Reservations Required. LEARN MORE FRIDAY MARTINI LUNCH It’s a Jackson’s tradition. The first one is on us with purchase of an entrée. Previous slide Next slide Home Menus about Private events Location Shop News Reservations Sep 10 Wednesday Wine Down Wednesday Wine Down Wednesday Starting at 5:00 for half-priced wines on our Governor’s List! 5:00 PM Sep 12 Friday Friday Martini Lunch Join us every Friday for a Jackson’s tradition. The first martini is on us with purchase of an entrée! 11:00 AM Sep 15 Monday Maine Lobster Monday Maine Lobster Monday Whole Maine Lobster $19.95 Every Monday night 5:00 PM until 6:00 PM Dine-in only. 5:00 PM Sep 16 Tuesday Prime Time Tuesday Prime Time Tuesday Prime Rib Special- Every Tuesday starting at 5:00 p.m. Slow-roasted herb and spice-rubbed 16-oz. President’s cut of boneless prime rib of beef and a steakhouse potato $19.95 5:00 PM Sep 17 Wednesday Save the Third for Chef Irv Cooking Demonstrations Join Chef Irv Miller of Jackson’s Steakhouse as he leads a series of cooking classes on the third Wednesday of each month. Classes cover everything from shopping to preparation to presentation. 5:00 PM Facebook-f Instagram 400 South Palafox Street  Pensacola, FL 32502 850-469-9898 contact@jacksonsrestaurant.com SIGN UP FOR NEWS Close Menu × × Cart CloseMenu WELCOME TO JACKSON'S STEAKHOUSE A GREAT SOUTHERN RESTAURANT HOURS SUNDAY – THURSDAY 5:00 PM until 9:00 PM FRIDAY 11:00 AM until 2:00 PM and 5:00 PM until 10:00 PM SATURDAY 5:00 PM until 10:00 PM PLEASE CALL 850-469-9898 OR CLICK HERE FOR ONLINE RESERVATIONS . View Menus News From JACKSON's Jackson’s Steakhouse: Thanksgiving Day Please join us at Jackson’s Steakhouse on Thursday, November 27, as we celebrate Thanksgiving. We will be open from 11:00 a.m. – 7:00 p.m., serving a Thanksgiving Plate in addition to our full dinner menu. read more ❯ Jazz at Jackson’s: Celebrating Nat King and Natalie Cole with Ellen Vinson, Jack Zoesch Join us at Jackson’s Steakhouse on Thursday, October 23, for our latest installment of “Jazz at Jackson’s.” read more ❯ Celebrate Rosh Hashanah at Jackson’s Steakhouse Celebrate Rosh Hashanah and begin your New Year at Jackson’s on Monday, September 22, beginning at 5:00 p.m. For the past decade, Jackson’s has offered a traditional Rosh Hashanah meal celebrating the first night of this New Year celebration. read more ❯ Save the Third for Chef Irv Cooking Demonstrations and Drinks at Jackson’s Steakhouse Join Chef Irv Miller of Jackson’s Steakhouse as he leads a series of cooking classes on the third Wednesday of each month. Classes cover everything from shopping to preparation to presentation. Two classes are scheduled for each month. read more ❯ CLICK HERE TO VIEW ALL NEWS JOIN OUR NEWSLETTER EVENTS From JACKSON'S Sep 10 Wednesday Wine Down Wednesday Wine Down Wednesday Starting at 5:00 for half-priced wines on our Governor’s List! 5:00 PM Sep 12 Friday Friday Martini Lunch Join us every Friday for a Jackson’s tradition. The first martini is on us with purchase of an entrée! 11:00 AM Sep 15 Monday Maine Lobster Monday Maine Lobster Monday Whole Maine Lobster $19.95 Every Monday night 5:00 PM until 6:00 PM Dine-in only. 5:00 PM Sep 16 Tuesday Prime Time Tuesday Prime Time Tuesday Prime Rib Special- Every Tuesday starting at 5:00 p.m. Slow-roasted herb and spice-rubbed 16-oz. President’s cut of boneless prime rib of beef and a steakhouse potato $19.95 5:00 PM Sep 17 Wednesday Save the Third for Chef Irv Cooking Demonstrations Join Chef Irv Miller of Jackson’s Steakhouse as he leads a series of cooking classes on the third Wednesday of each month. Classes cover everything from shopping to preparation to presentation. 5:00 PM CLICK HERE TO VIEW ALL EVENTS"
    },
    {
      "url": "https://burgerbeast.com/jaxsons-ice-cream/",
      "text": "Jaxson’s Ice Cream Parlor and Restaurant Reddit YouTube Instagram Facebook X (Twitter) Pinterest TikTok Tumblr LinkedIn RSS HOME BURGER BEAST APPROVED BURGER TALK BEST BURGERS MIAMI BEST BURGERS BROWARD BEST FRITAS IN MIAMI BEST BURGERS ORLANDO BEST OF LISTS GUIDES COMFORT FOOD FOOD HISTORY EVENTS CROQUETA PALOOZA FOOD TRUCKS RECIPES MERCH PODCAST NEWSLETTER ABOUT HOME COMFORT FOOD BROWARD Jaxson’s Ice Cream Parlor and Restaurant In BROWARD Jaxson’s Ice Cream Parlor and Restaurant By BEAST February 20, 2025 SHARE Facebook Twitter Pinterest Email LinkedIn Tumblr Reddit WhatsApp Jaxson’s Ice Cream Parlor and Restaurant has been a beloved Dania Beach, Florida institution since 1956. Founded by Monroe Udell, Jaxson’s began as a small ice cream shop and has since grown into a full-service restaurant and one of the most iconic dessert destinations in South Florida. Known for its nostalgic 1950s decor, extensive collection of American memorabilia, and famously large portions, Jaxson’s has welcomed generations of families looking to indulge in classic comfort food and their legendary homemade ice cream. Their signature “ Kitchen Sink ” sundae, a massive ice cream creation served in a literal sink, has become a must-try for visitors with a serious sweet tooth. Jaxson’s : Home of the Original Kitchen Sink I’ve come by here quite a few times to wait in line outside for the ice cream, which is homemade and very good, by the way. Jaxson’s Ice Cream Flavors Menu Menu Back Once you step inside Jaxson’s , you almost feel nothing has changed since its opening. The first thing to your right is a vast selection of candies, particularly some you probably haven’t seen in years. Don’t forget to find your favorite on the way out. Candies These were my findings after two visits within weeks of each other. I was seated in a different part of the restaurant ( two rooms ). The first is primarily long communal tables, and the second is all individual tables. Jaxson’s Ice Cream Visit 1 Popcorn One of the first things the server asked me on both occasions was whether I’d like some popcorn while I waited for my food. The first time, I passed on it, but the following time, I figured I might as well. I was with my cousin Fred and convinced him to come to Jaxson’s by telling him I had only tried their ice cream. He was in amazement at the old-school vibes. House Cola We were looking over the menu when the waitress approached us. And then it happened: I ordered a Coke. Waitress: “ We only serve homemade cola. “ I was intrigued, so I said, “ Yes. ” It was one of the best “ Yeses ” of my life. The sip was so delicious that I didn’t want it to end. Fred took one sip and didn’t want to give back my cup. It was settled. He needed his own soda, and I had a new obsession. During our cola battle, my patty melt arrived. I also have a well-documented obsession with Patty Melts ( see below for their Patty Melt breakdown ). The beauty I was served fit right in the best of the ones I’ve tried with its marble rye bread. It was beautiful, juicy, and, yes, delicious. Right before leaving, we ordered a shake for each of us. We take a couple of sips and take it along with a to-go cup of cola ( duh! ). A Second Visit To Jaxson’s Jaxson’s Ice Cream Parlor Street Sign On my second visit, I was with my wife, Marcela . Since I couldn’t stop raving about how great the cola was, so she ordered the pink lemonade to teach me a lesson. I got my cola and kept it safely out of her reach ( not that she wanted it anyway ). I kicked things off with some potato pancakes—nothing exceptional, but that didn’t stop me from finishing them out of sheer spite. Marcela went for the patty melt while I set my sights on a ridiculously oversized 1-pound hot dog called the Artillery Dog, served with some relishes and chopped onions. The Artillery Dog I went bacon and cheese on this mutha. Marcela thought I was over my head because I hadn’t finished it. I don’t know what I was thinking, but in the end, it worked out. The dog was even better later when I finished it while watching Survivor at home. Days later, I had some hot flashes about that hot dog. And what about Jaxson’s Cola, you ask? Patty Melt I’m still thinking about the cola with some thoughts of the patty melt sprinkled all over. Jaxson’s Patty Melt Ingredient Recap: Fresh Ground Beef Patty Sautéed Onions Cheddar Cheese Marbled Rye Bread Unnecessarily Crispy Crinkle Cut Fries Jaxson’s Ice Cream Parlor & Restaurant 128 S Federal Highway Dania Beach, FL (954) 923-4445 Website – https://www.jaxsonsicecream.com Instagram – https://www.instagram.com/jaxsonsicecream Monday 11:30 am – 11:00 pm Tuesday 11:30 am – 11:00 pm Wednesday 11:30 am – 11:00 pm Thursday 11:30 am – 11:00 pm Friday 11:30 am – 12:00 am Saturday 11:30 am – 12:00 am Sunday 11:30 am – 11:00 pm Author BEAST For almost two decades Burger Beast has documented his burger and comfort food excursions and food history findings via his blog and social media. Website Related Posts Shipley’s Do-Nuts of Texas in Jacksonville, Florida September 7, 2025 IHOP Miami: From Pancakes to Burgers and Back Again September 5, 2025 You Must Visit Cherry Smash Ice Cream Parlor September 2, 2025 2 Comments Don Jaffe 5 years ago Reply Hey Beast. My daughter and I have a bet going but can’t find the answer. Back in the day i believe they used to give you regular water in a pitcher and seltzer water as well when you sat down with popcorn to. I’m talking 90’s here. Any help would be greatly appreciated. Burger Beast Post Author 5 years ago Reply I asked Jaxson’s General Manager Jerry Smith and this is what he responded: “True, and we still serve free seltzer water, still water and popcorn at each table. You win, Dad!!” Write A Comment Cancel Reply Save my name, email, and website in this browser for the next time I comment. © 2025 BURGER BEAST Top"
    }
  ]
}