{
  "fuentes": [
    {
      "url": "https://www.fairfaxcounty.gov/parks/golf/jefferson",
      "email": "fcpajeffersongc@fairfaxcounty.gov"
    },
    {
      "url": "https://jeffersongolfcourse.org/membership/",
      "email": "golf@jeffersongolfcourse.org"
    },
    {
      "url": "https://portjeffcc.com/contact-us/",
      "email": "memberoffice@portjeff.com"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "berna.marketing@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "daisy.raquel@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "golf@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "info@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "mohammad.rashed@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "raymond.sandoval@acci.com.ph"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "shawna@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "drakeb@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "jkulhamer@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "noakley@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "rzellner@greenpondcc.com"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "email": "sfrey@greenpondcc.com"
    },
    {
      "url": "https://www.colecountyhistoricalmuseum.org/product-page/jefferson-city-country-club",
      "email": "cchs@socket.net"
    }
  ],
  "mails": [
    "berna.marketing@acci.com.ph",
    "cchs@socket.net",
    "daisy.raquel@acci.com.ph",
    "drakeb@greenpondcc.com",
    "fcpajeffersongc@fairfaxcounty.gov",
    "golf@acci.com.ph",
    "golf@jeffersongolfcourse.org",
    "info@acci.com.ph",
    "jkulhamer@greenpondcc.com",
    "memberoffice@portjeff.com",
    "mohammad.rashed@acci.com.ph",
    "noakley@greenpondcc.com",
    "raymond.sandoval@acci.com.ph",
    "rzellner@greenpondcc.com",
    "sfrey@greenpondcc.com",
    "shawna@greenpondcc.com"
  ],
  "nombre_sitio": "jeffersoncountryclubflorida.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fairfaxcounty.gov/parks/golf/jefferson",
      "text": "Jefferson District Golf Course | Park Authority Skip to main content FFX Global Navigation Department Homepage Hours Operational Hours Holiday Hours & Class Schedules Rec Center Schedules Parks Find It Waterfront Parks Nature and History Water Parks and Spray Grounds Sports and Fitness Specialty Attractions Rec Centers Rec Centers Home Memberships Audrey Moore Cub Run Franconia George Washington Mount Vernon Oakmont Providence South Run Spring Hill Golf Courses Golf Home Operating Status Burke Lake Golf Center Greendale Golf Course Jefferson Golf Course Laurel Hill Golf Club Oakmont Golf Center Pinecrest Golf Course Twin Lakes Golf Course Events Calendar Park Reservations Picnic Areas (Picnic shelters, canopy’s, gazebos) Camping Reservations Golf Tee Times Water Mine Our Special Harbor Programs and Activities PARKTAKES ONLINE Summer Entertainment Series Classes Camps Popular Activities Farmers Markets Healthy Strides Preschool Group Activities Gift  Cards Wonder Wagon Dogs of Fairfax County Older Adults Park Maintenance Requests Request Tree and Debris Removal Athletic Field Maintenance Board and Committee Meetings Park Budget and Fees Natural and Cultural Resources Archaeology and Collections Heritage Conservation Nature and Natural Resources Trails Trails Home Trail Buddy Discovery Trail Map Accessible Trails Cross County Trail Bike Trails Equestrian Trails Trail Mix QR Code Fitness Trails First Hike Special Topics Jobs at the Park Authority #joinFCPA Jobs Rentals and Permits Park Use Permits Facility Rentals Long Range Planning Planning and Improvements Planning Projects Development Projects Park Bond Quarterly Project Updates Park News Connect Contact Us Stay Informed and Engaged Park News Subscribe to E-News and E-Newsletters Support Your Parks Friends Group Mastenbrook Volunteer Matching Fund Grant Program Volunteer Park Volunteer Teams About Us Park Authority Board Rules Awards Weather-Related Closures Recreation Services for Customers with Disabilities ♿ Parks Website Comments Residents Animals & Pets Adoptions Animal Control & Regulations Guide to Dogs Lost & Found Pets Shelter Support & Supplies Wildlife More Courts & Legal Case Information Circuit Court Docket Jury Duty Land Records Magistrate Public Law Library Self-Help Resources Traffic Court Vital Records More Environment & Energy Invasive Species Litter Recycle, Trash & Compost Sustain Fairfax Trees Watersheds More Health & Human Services Basic Needs & Assistance Disability Services Diseases & Conditions Domestic & Sexual Violence Health Clinics Mental Health Opioids More Individuals & Families Children & Youth Federal Workforce Immigrants Military & Veterans New Residents Older Adults Parents People with Disabilities Volunteers More Land Use & Planning Comprehensive Plan County Capital Projects Land Records Parks Planning Planning Projects Research Tools Transportation Projects Urban Centers More Library & Education Adult Education Early Childhood Programs Library Branches Library Catalog Search Public Schools More Parks & Recreation Arts Athletic Fields Camps Community Centers Parktakes Classes Rec Centers Senior Centers Teen Centers Trails More Permits & Licenses Birth & Death Certificates Building Child Care Dogs Health Marriage Park Use Solicitors More Property & Housing Affordable Housing Code & Zoning Neighborhoods Real Estate Values Recycling & Trash Tenant Landlord Issues Utilities More Public Safety & Emergencies 9-1-1 Emergency Preparedness Fire & Rescue Gun Violence Prevention Police Scams Sheriff More Roads & Commuting Bike & Walk Connector Bus Metrobus & Metrorail Park & Ride Pedestrian Safety Road Maintenance/VDOT Street Parking Toll Roads Transportation Projects More Taxes & Fees Car Taxes Park Fees Real Estate Taxes Tax Relief Trash Disposal Fees More Voting & Elections Absentee Voting Early Voting Election Results Polling Places Voter Registration More Weather & Climate Air Quality Climate Action Dashboard Extreme Heat Floods Ready Fairfax Resilient Fairfax Snow Tornadoes More Business Business & Construction Building Permits Code & Zoning Land Use More Business Services Business Emergency Preparedness Business Taxes Consumer Services Employer Transportation Service Green Business Partners Program Home-Based Business Regulation & Licensing Small Business Starting a Business Workplace Issues More Doing Business with Fairfax Contracting and Procurement Current Solicitations Permits Vendor Pitch Portal More Government About Codes & Standards Countywide Strategic Plan Facilities & Locations History of Fairfax County Operating Status More Board of Supervisors Auditor Board Members Boards, Authorities & Commissions Clerk Services Committees Meetings & Agendas More Budget & Finance Bonds Budget Financial Transparency Unclaimed Money More Departments & Agencies Jobs & Employment Full-Time Openings Internships Seasonal & Non-Merit Maps & Data Countywide Data Analytics Demographics Geographic Information Systems Interactive Data Tools More One Fairfax Digital Equity Inclusive Engagement Trust Policy Services Find Animal Shelter Health Clinics Jobs Library Resources Lost or Found Pet Mental Health Support Park Classes Real Estate Values Recycling & Trash Volunteer Opportunities More Pay Business Taxes Car Taxes Dog Licenses Driving & Parking Fines False Alarm Fees Real Estate/Property Taxes SACC Payments More Register/Apply Basic Needs & Assistance Building Inspections Car Registration Fairfax Alerts Permits & Licenses Tax Relief Vote More Report Animal Control Issues Consumer Complaints Crime Domestic Violence Financial Crimes Neighborhood Complaints Road Issues to VDOT Street Light Outages More Connect Alerts, Emails & Apps Email Subscriptions Fairfax Alerts Mobile App More Community Engagement Surveys & Projects Contact Directory Hotlines & Emergency Numbers VDOT VFOIA Requests More News & Events Daily Headlines Emergency Information Blog Events Calendar NewsCenter NotiCentro (Spanish) Public Meetings Calendar More Social Media Comments Policy Directory of Accounts More TV, Video & Podcasts Channel 16 Podcasts & Radio YouTube More TRANSLATE Language Selection Select Language English Afrikaans Azərbaycan dili Bahasa Indonesia Bahasa melayu Català Cymraeg Cрпски Deutsch Eesti keel Español Esperanto Filipino Français Gaeilge Galego Hausa Hmoob Igbo Italiano Język polski Kiswahili Kreyòl ayisyen Latviešu valoda Limba română Lingua Latina Magyar Malti Nederlands Norsk Português Shqip Sinugboanon Slovenčina Slovenščina Suomi Svenska Te Reo Māori Tiếng Việt Türkçe Yorùbá af Soomaali baṣa Jawa bosanski dansk euskara hrvatski isiZulu lietuvių kalba Íslenska čeština Ελληνικά Беларуская мова Монгол Русский язык български македонски українська мова Հայերէն עברית ײִדיש नेपाली मराठी< हिन्दी বাংলা ਪੰਜਾਬੀ ગુજરાતી தமிழ் తెలుగు ಕನ್ನಡ ภาษาไทย ພາສາລາວ ქართული ភាសាខ្មែរ 日本語 简体中文 繁体中文 한국어 ﺍﺭﺩﻭ ﻉﺮﺑﻯ ﻑﺍﺮﺳﻯ To change the language of this website, click the drop-down list and select the desired language. \n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tThe Fairfax County Web site is being translated through \"machine translation\" powered by Google Translate. Disclaimer Jefferson Golf Course Home Park Authority Park Authority Golf Courses Jefferson District Golf Course Alert: CONTACT INFORMATION: Course open dawn to dusk, weather permitting. Course is closed on Tuesdays until 10am for maintenance. Jefferson Grill open 10am-4pm, weather dependent. 703-573-0444 TTY 711 FCPAJeffersonGC@fairfaxcounty.gov 7900 Route 29 Falls Church, VA 22042 @fairfaxparks Jonathan Casey General Manager Jefferson District Golf Course Welcome Jefferson District Golf Course is a beautifully landscaped 9 hole executive course which features a gently rolling playing surface with four ponds, ideal for golfers who prefer walking. The course offers a challenging round of golf and includes a par five and some demanding par fours. Department Resources Department Homepage Hours Operational Hours Holiday Hours & Class Schedules Rec Center Schedules Parks Find It Waterfront Parks Nature and History Water Parks and Spray Grounds Sports and Fitness Specialty Attractions Rec Centers Rec Centers Home Memberships Audrey Moore Cub Run Franconia George Washington Mount Vernon Oakmont Providence South Run Spring Hill Golf Courses Golf Home Operating Status Burke Lake Golf Center Greendale Golf Course Jefferson Golf Course Laurel Hill Golf Club Oakmont Golf Center Pinecrest Golf Course Twin Lakes Golf Course Events Calendar Park Reservations Picnic Areas (Picnic shelters, canopy’s, gazebos) Camping Reservations Golf Tee Times Water Mine Our Special Harbor Programs and Activities PARKTAKES ONLINE Summer Entertainment Series Classes Camps Popular Activities Farmers Markets Healthy Strides Preschool Group Activities Gift  Cards Wonder Wagon Dogs of Fairfax County Older Adults Park Maintenance Requests Request Tree and Debris Removal Athletic Field Maintenance Board and Committee Meetings Park Budget and Fees Natural and Cultural Resources Archaeology and Collections Heritage Conservation Nature and Natural Resources Trails Trails Home Trail Buddy Discovery Trail Map Accessible Trails Cross County Trail Bike Trails Equestrian Trails Trail Mix QR Code Fitness Trails First Hike Special Topics Jobs at the Park Authority #joinFCPA Jobs Rentals and Permits Park Use Permits Facility Rentals Long Range Planning Planning and Improvements Planning Projects Development Projects Park Bond Quarterly Project Updates Park News Connect Contact Us Stay Informed and Engaged Park News Subscribe to E-News and E-Newsletters Support Your Parks Friends Group Mastenbrook Volunteer Matching Fund Grant Program Volunteer Park Volunteer Teams About Us Park Authority Board Rules Awards Weather-Related Closures Recreation Services for Customers with Disabilities ♿ Parks Website Comments Related Resources Park Authority Board Fairfax County Park Foundation facebook twitter instagram youtube Tee Times and Rates Tee Times and Rates Indoor Golf Simulator Reservation and Rates at Pinecrest Upcoming Events Oct 04 Four Club Fall Classic – Jefferson Cup Tournament Series 9:00AM,  04, (18 yrs. +) Participants compete in a 9-hole stroke play tournament where… See all Featured Tournaments and Special Events Play and Practice Golf Course Status Tee Times Rates and Offers Course and Clubhouse Practice Facilities Leagues Jefferson District Park Mini Golf Women & Golf Learn and Compete Junior Golf Tournaments Connect Golf Fairfax E-News Club Jobs Volunteer Rules Handicap Services Click to view in Google Maps Click to view in Google Maps Jefferson District Park and Golf Course 7900 Route 29 Falls Church, \n\t\tVA, \n\t\t22042 Link to Google Maps More About Jefferson Golf Course Play and Practice Tee Times Rates and Offers Course and Clubhouse Practice Facilities Learn and Compete Junior Golf Tournaments Connect Golf Fairfax E-News Club Jobs Volunteer Rules Handicap Services Jefferson District Golf Course Home Fairfax Virtual Assistant How can I help? Ask a question Close Fairfax Virtual Assistant Related Resources Park Authority Board Fairfax County Park Foundation facebook twitter instagram youtube Translate Awards Site Feedback PRIVACY POLICY & COPYRIGHT Main Address 12000 Government Center Pkwy Fairfax, VA 22035 Phone 703-324-7329 TTY 711 Site Tools Website Accessibility Translate Download Mobile App Support ADA Accessibility FOIA Requests Website Administrator Additional Resources Fairfax County Public Schools Economic Development Authority Visit Fairfax Council of Governments Commonwealth of Virginia USA.gov Calendar Channel 16 Mail Security WIFI Facebook Twitter Instagram YouTube Mobile The Official Site of Fairfax County"
    },
    {
      "url": "https://jeffersongolfcourse.org/membership/",
      "text": "Jefferson Golf Course | Jefferson Golf Course | Wisconsin Golf Link to Facebook Link to Instagram Link to Mail Join Our E Club Call us at (920) 541-3513 Shopping Cart Shopping Cart 0 Shopping Cart Golf Rates Membership Women’s League Wednesday Night Men’s League Thursday Night Men’s League Events Members Only & News About About Us Calcuttas and Outings Tee Times Buy Online Online Store View My Cart Edit My Account Contact Us Menu Menu 2025 Membership Fees Greens Membership Single $875 Couple $1135 Add Child (max $250) $100 Senior (62+) $800 Senior Couple (62+) $1045 Collegiate (Out of High School 18 to 24) $500 Junior (In High School 10 to 18) $185 Seasonal Golf Cart Membership Single $460 Couple $635 Trail Fee $250 * Loyalty Program: Members receive $20 off per continuous year max of $100 per year on their yearly membership dues. * Discounts: Members at JGC receive 15% on originally priced merchandise on our golf shop. * Guest Passes: Membership packages also include 5 guest passes (Greens Fees only) **Junior and Collegiate memberships do not receive any loyalty program, discounts or guest passes. **Sales tax is not included in the prices listed above. Navigation Home Rates Membership About Us Contact Us Contact 913 Golf Drive Jefferson, WI 53549 Phone: (920) 541-3513 Email: golf@jeffersongolfcourse.org ©Copyright Jefferson Golf Course -   Powered by Teesnap. | Privacy Policy | Terms & Conditions | Cookie Policy | Returns Policy | Contact Us Link to Facebook Link to Instagram Link to Mail Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://portjeffcc.com/contact-us/",
      "text": "Contact Us - Port Jefferson Country Club Golf Lessons Membership Policies Order Pro Shop Gear Clinics Adult Clinics Junior Clinics Junior Package Dining The Turn – Pub & Grub Events Calendar Weddings & Events Outings News & Updates Village of Port Jefferson Welcomes Lessing’s Hospitality Group as New Food and Beverage Partner at Port Jefferson Country Club Contact Us Member Area Select Page Contact Us Contact Us  44 Fairway Drive, Port Jefferson, NY 11777  [email protected]  Membership Services 631-828-5029  Golf Pro Shop 631-285-1814 Our Membership Office is open 5 days a week. The following schedule is for Danielle Condia, Membership Coordinator. Please feel free to e-mail us here and we will reply to you as soon as we are in the office. Full Name* Email* Phone Number* Subject* —Please choose an option— New Membership Membership Renewal Corporate Membership Golf Outing Inquiry Golf Lessons Other Additional comments This form uses Akismet to reduce spam. Learn how your data is processed. Δ Pat Sullivan Head Superintendent Danielle Condia Membership Services Jake Anderson Head Golf Professional Jeff Welischar Assistant Superintendent Larry Scortichini Assistant Golf Professional Find Us 44 Fairway Drive Port Jefferson, NY 11777 Contact Us [email protected] Membership Services | 631-828-5029 Golf Pro Shop | 631-285-1814 Tennis Pro Shop | 631-285-1815 Connect With Us Follow Follow © Copyright Port Jefferson Country Club Website by Lightspeed"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "text": "Contact Us - Alabang Country Club, Inc. Skip to content Menu Facebook-f Instagram Search Contact Us Home Contact Us GET IN TOUCH For inquiries, please feel free to send us a message or reach us on the contact details provided below. clubhouse OPERATIONS Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph GOLF OPERATIONS Felicita V. Mallari 0998 587 9420 8842-3530 loc 157 golf@acci.com.ph corporate services Daisy C. Raquel 0998 587 9422 8842-3530 loc 176 daisy.raquel@acci.com.ph member relations Berna D. Malolos 0917 568 5764 8842-3530 loc 152 berna.marketing@acci.com.ph DINING & BANQUETS Mohammad Rashed Jr. 0918 239 4898 8842-3530 loc 226 mohammad.rashed@acci.com.ph data privacy officer Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph Contact Form \" * \" indicates required fields Full Name * Email * Contact Number * Subject * Subject * Membership Golf Operations Dining & Banquets Events Message Name This field is for validation purposes and should be left unchanged. ACCI started its operation in 1981 with a Member-base of 1,646. Our primary objective is to provide Members excellent leisure facilities designed for the whole family. Quick Links About Facilities Events Membership Careers Contact Us Contact Us 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines Follow Us Facebook-f Instagram © Copyright 2025 Alabang Country Club. All Rights Reserved. © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines Privacy Policy Facebook-f Instagram Home About Us History of the Club Mission & Vision Board of Directors The Committees Club Management Events Social Activities Monthly Newsletter Golf Course Tour Golf Tournaments Facilities Member Services Sports and Recreation Dining and Banquets Members Corner Contact Us Career"
    },
    {
      "url": "https://greenpondcc.com/contact-us/",
      "text": "Contact Us: Get in Touch with Green Pond Country Club - Green Pond Country Club REQUEST AN EVENT GOLF:  610-691-9453 EVENTS: 610-253-2505 About The Club Employment Golf GOLF RATES & MEMBERSHIP GROUP OUTING PACKAGES LEHIGH VALLEY AMATEUR TOURNAMENT GREEN POND GOLF ASSOCIATION TOURNAMENT SCHEDULE SENIOR LEAGUE GOLF COURSE LAYOUT SCORECARD PRO SHOP GOLF LESSONS Course Videos LVHN GOLF PERFORMANCE PROGRAM Weddings WEDDING PACKAGES PHOTO GALLERY WEDDING VIDEOS TRUSTED VENDORS & PARTNERS Events Event Menus Location Contact Us Request an Event The Public's Country Club Contact Us Green Pond Country Club 3604 Farmersville Road Bethlehem, PA 18020 Call: (610) 253-2505 or Tee Times: (610) 691-9453 Do you need to contact us regarding our products and services? Are you interested in a tour of the property? Need to book a tee time?  Planning a party?  We've got you covered! We look forward to assisting you and hope to see you at Green Pond Country Club for a visit very soon. Current hours of operation are ; Open 7 days a week from 6:30am - 11:59pm Our contact information is below based on department. _______________________________________ Rodger Zellner, President, COO, GM John Kulhamer, Golf Pro Nanci Oakley, Golf Outings Coordinator Shawna Shriver, Event Coordinator Brian Drake, Food & Beverage Manager Sarah Frey, Office Manager _______________________________________ Should you have questions or need information, please email us or submit the contact form below. [To request an event, please call (610) 253-2505 or submit our Online Event Request Form ] Contact Us Notice: JavaScript is required for this content. Our Location: 3604 Farmersville Road Bethlehem, PA 18020 • Main Phone: (610) 253-2505 ABOUT • GOLF • WEDDINGS • BANQUETS • REQUEST AN EVENT • CONTACT US ©2025 Green Pond Country Club. Privacy Policy • Terms of Use Facebook Green Pond Country Club Instagram Green Pond Country Club Twitter Green Pond Country Club YouTube Green Pond Country Club LinkedIn Menu About The Club ▼ Employment Golf ▼ GOLF RATES & MEMBERSHIP GROUP OUTING PACKAGES LEHIGH VALLEY AMATEUR TOURNAMENT GREEN POND GOLF ASSOCIATION TOURNAMENT SCHEDULE SENIOR LEAGUE GOLF COURSE LAYOUT SCORECARD PRO SHOP GOLF LESSONS Course Videos LVHN ▼ GOLF PERFORMANCE PROGRAM Weddings ▼ WEDDING PACKAGES PHOTO GALLERY WEDDING VIDEOS TRUSTED VENDORS & PARTNERS Events ▼ Event Menus Location Contact Us ▼ Request an Event"
    },
    {
      "url": "https://www.colecountyhistoricalmuseum.org/product-page/jefferson-city-country-club",
      "text": "Jefferson City Country Club | colecountyhistorical top of page Cole County Historical Society and Museum Office Hours Tuesday and Thursday 9:30 a.m. - 11:30 a.m. 12:30 p.m. - 3:00 p.m. Closed Monday-Wednesday-Friday Saturday and Sunday ​ 109 Madison Street Jefferson City, Missouri 65101 (573) 635 - 1850 cchs@socket.net ​ ​ ​ ​ Museu m Hours By Appointment Only Admission Fees Adults (18+) $5 Seniors (55+) $4 Children (K-12) $3 Children (5 & under) Free Members  Free Museum is open by appointment Only (Call 573-635-1850) Jefferson City Country Club SKU: 0030 $20.00 Price Description: Jefferson City Country Club              Date: 2012 A History of Jefferson City Country Club The original meeting to form the Jefferson City Country Club was held under the chairmanship of Governor Herbert S. Handley on September 7, 1909, at the old Monroe House at High and Monroe Streets.  Those attending represented the civic, business and professional leadership of the community.   As reported I the press the Clubwould bring the community’s business and professional men into closer acquaintance.  To that end, there would be provided a clubhouse for members and their families and a golf course, tennis courts and other recreational facilities.  It was agreed that the Club should have 150 members, of whom 100, should be local and 50 from outside Jefferson City.  The members to be chosen from outside the community would contribute; it was felt, toward the objective of retaining the capitol in Jefferson City. The Club’s Board of Directors consisted of Governor Hadley, C. W. Thomas, Sam B. Cook, G. A. Fischer, W. A. Dallmever, Ernest Simonsen, J. L. Thorpe, J.W. Henry, C. G. Hammond, Julius Conrath & Ben G. Veith.  The first president was Governor Hadley. The bylaws specified that the dues of active members should not exceed $24 a year. With Thomas Lawson Price, Chairman, and the members of the Grounds and Greens Committee, the Rev. Talbot (three time amateur golf champion of Kansas) helped plan and lay out the golf course.  Originally it was a nine-hole course with sand greens.  Henry Andrae Sr., a charter member of the Club who was Warden of the Penitentiary at the time, arranged a detail of inmates to help clear and construct the golf course.  Use of prison labor was commonplace at that time. While golf was a major attraction at the Club form the start, its two clay tennis courts were very popular.  Several couples formed a group of Wednesday tennis with dinner and sometimes bridge. That group became known as the Tennis Club consisted of about fifteen couples. The Jefferson City Country Club was opened with a meeting of its members at the Club the afternoon of Monday, May 8, 1911.  The newly constructed clubhouse was located at the site of the present clubhouse.  The original clubhouse bore no resemblance to the current building.  It was more rustic and outdoor oriented with front and back porches running the full length of the building.  The news reported the opening in the Jefferson City Democrat-Tribune, which said, “The Country Club was formally opened to its members Monday afternoon un auspicious circumstances.  “Governor Herbert S. Hadley, an avid golfer was a moving spirit in organizing the Club.” When the Club opened, Jefferson City had a population of fewer than 12,000. It was an era when stables in the back of homes were being converted into garages, although many still housed horses, buggies and carriages. One summer the Dr. W. A. Clark family lived in a tent pitched on the Country Club grounds where the pro shop now stands.  It was a tent with a raised wooden floor and a curtain that could be drawn to divide it into two rooms.  Howard & Lewis Clark also had a tent at the Club one summer.  The Reverend Talbot and his family had a tent in a grove of persimmon trees on the course. On February 5 of that year lightning struck the Capitol, igniting a fire which destroyed the Capitol. The Jefferson City News-Tribune later recalled, “The Country Club played a useful role in the campaign to convince leaders of public opinion across the State of the advantages of Jefferson City.”  “It was not an uncommon sight that summer\" , the newspaper said, “to see crowded excursion trains switched from the Missouri Pacific mainline tracks to the Bagnell Branch and proceed over the uncertain roadbed to the Country Club.” On September 30, 1911, President William Howard Taft who was visiting the Missouri State Fair in Sedalia joined Governor Hadley in a golf match at the Country Club.  From the start, Missouri Governors were either active in the affairs of the Club or frequently made use of its facilities.  Governor Fredrick D. Gardner built at his own expense a one-room addition to the Club in 1917 called the Blue Room. In the afternoon of February 3, 1920 a fire threatened the clubhouse but Club employees prevented serious damage.  The population of Jefferson City had increased and was approaching 15,000 as the Club entered the Roaring 20’s.  The Club converted the sand putting green to grass.  The Club employed its first golf pro in 1927.  He was Horton Smith, who was to twice win the U. S. Master Tournament in Augusta, Georgia. In the early 30’s ladies golf began picking up momentum at the Club.  The Club firmly established Thursday, as Men’s Night by the 30’s and “Ladies Day” on Tuesday.  The men’s group assembled in the late afternoon-in summer, after golf-for pitch, bridge, poker or simply conversation around the bar.  These traditions continue today.  The 30’s were marked by the Great Depression, which nearly paralyzed the nation.  In 1937, the Club’s circumstances had improved sufficiently to permit inter redecoration of the clubhouse, which was completed in June of that year. On November 18 of 1937, a few months after the redecoration, a tragic fire completely destroyed the clubhouse.  The fire claimed the lives of a black porter and his wife who slept in and upstairs room.  Even though stunned by the disaster, Club officers and members reported that the Club would be rebuilt.  And in April 1939, just under seventeen months after the fire, the formal opening of the new clubhouse was announced. Early in 1947 the membership voted to revise the Club’s membership limit form 125 to 150.  A large porch was added and enclosed for year round usage.  The lake was stocked with fish to give pleasure to members and a park-like area near the dam was added with picnic tables and cook out facilities for members. On May 31, 1953, the pool was opened and during the next three years, the building housing dressing rooms for swimmers and the golf pro shop was completed.   The 18-hole golf course had been a long-held dream of golfing members and in September 1959 that dream was approved.  In August 1952 Life Magazine published a photojournalism feature on the Jefferson City Country Club.  The article presented text that noted prominent legislators and officials who felt at home at the Club.  It said, “Many believe more legislation is born or dies at the Club than at the state Capitol.” In 2011, as when it opened 100 years ago, Jefferson City Country Club continues to be a gracious, peasant place.  It has kept abreast of the times and of the needs and desires of its membership as they have widened and expanded.  Its major programs and services are under the direction of capable professionals.  The Club’s position today and through the years is testimony to the character and capability of the lay leadership that has guided its course. Back to Gift Shop bottom of page"
    }
  ]
}