{
  "fuentes": [
    {
      "url": "https://www.hometownnewstc.com/",
      "email": "newsfp@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewstc.com/",
      "email": "classifieds@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewstc.com/",
      "email": "info@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "3908-jensenbeach@gfenterprisellc.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "ambre@kiddysclassics.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "blackpearlmetal@yahoo.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "hienthejoint@yahoo.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "info@amethystclean.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "info@mchealthystart.org"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "info@titanpw.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "krgmakes3@yahoo.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "sedric@kirbyemployeebenefits.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "shendricks@bassettfurniture.com"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "email": "tim@ecmflorida.com"
    },
    {
      "url": "https://www.martin.fl.us/JensenBeachMooringField",
      "email": "jbmooring@martin.fl.us"
    },
    {
      "url": "https://www.martin.fl.us/JensenBeachMooringField",
      "email": "jbmooring@martin.fl.us"
    },
    {
      "url": "https://www.martin.fl.us/JensenBeachMooringField",
      "email": "jbmooring@martin.fl.us"
    },
    {
      "url": "https://iflydrones.com/venue/jensen-beach-causeway-park/",
      "email": "gary@iflydrones.com"
    },
    {
      "url": "https://www.hometownnewstc.com/news/jensen-beach-causeway-to-close-temporarily-for-event/article_d8d3f1ea-984d-11e9-8576-87d590a71a58.html",
      "email": "classifieds@hometownnewsmediagroup.com"
    },
    {
      "url": "https://www.hometownnewstc.com/news/jensen-beach-causeway-to-close-temporarily-for-event/article_d8d3f1ea-984d-11e9-8576-87d590a71a58.html",
      "email": "cmorales@martin.fl.us"
    },
    {
      "url": "https://www.hometownnewstc.com/news/jensen-beach-causeway-to-close-temporarily-for-event/article_d8d3f1ea-984d-11e9-8576-87d590a71a58.html",
      "email": "info@hometownnewsmediagroup.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "ashley@atlaseventrental.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "business@jensenbeachchamber.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "business@jensenbeachchamber.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "eric.monaghan@ml.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "eric.monaghan@ml.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "info@islandprincesscruises.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "info@jensenbeachstorage.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "info@landturtleusa.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "rosemary@tikitaxiandcruises.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "sbeatty@elementfunding.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "stuart586@cbdrx4u.com"
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "email": "yourguide@northstarpressurewashing.com"
    },
    {
      "url": "https://jensenbeachflorida.info/membership-2/get-connected/",
      "email": "info@jensenchamber.com"
    }
  ],
  "mails": [
    "3908-jensenbeach@gfenterprisellc.com",
    "ambre@kiddysclassics.com",
    "ashley@atlaseventrental.com",
    "blackpearlmetal@yahoo.com",
    "business@jensenbeachchamber.com",
    "classifieds@hometownnewsmediagroup.com",
    "cmorales@martin.fl.us",
    "eric.monaghan@ml.com",
    "gary@iflydrones.com",
    "hienthejoint@yahoo.com",
    "info@amethystclean.com",
    "info@hometownnewsmediagroup.com",
    "info@islandprincesscruises.com",
    "info@jensenbeachstorage.com",
    "info@jensenchamber.com",
    "info@landturtleusa.com",
    "info@mchealthystart.org",
    "info@titanpw.com",
    "jbmooring@martin.fl.us",
    "krgmakes3@yahoo.com",
    "newsfp@hometownnewsmediagroup.com",
    "rosemary@tikitaxiandcruises.com",
    "sbeatty@elementfunding.com",
    "sedric@kirbyemployeebenefits.com",
    "shendricks@bassettfurniture.com",
    "stuart586@cbdrx4u.com",
    "tim@ecmflorida.com",
    "yourguide@northstarpressurewashing.com"
  ],
  "nombre_sitio": "jensenbeachflorida.info",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hometownnewstc.com/",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://www.jensenbeachflorida.info/contacts/feed/",
      "text": "Jensen Beach | Chamber of Commerce Call Today to Join! 772-334-3444 Menu Click or Call Today to Join! 772-334-3444 Please assign a menu to the Main Menu in Appearance > Menus Search Search Jammin' Jensen Taste of Jensen Fine Art & Craft Show Award Winning Beaches Previous Next Welcome! Want to become a vendor? Click here for the application. WHAT’S HAPPENING? Jensen Beach Chamber of Commerce Jensen Beach Chamber of Commerce It was a packed Member Luncheon today in the newly renovated banquet room at Stringers Tavern & Oyster Bar. Our speaker was Martin County Fire & Recue and the event was Sponsored by White Glove  Moving, Storage & Delivery of Florida. We also honored the Jensen Beach Elementary School Teacher & Student of the Month. + 9 View on Facebook MEET OUR NEW MEMBERS! METAL ART & DESIGN Black Pearl Metal 3758 SE Ocean Blvd Stuart FL 34996 (561) 707-9645 blackpearlmetal@yahoo.com www.blackpearlmetal.com Joseph Puleo, Owner ADVERTISING & MARKETING St. Lucie Voice Vero Beach FL 32963 (516) 721-0848 lisastlucievoice@gmail.com www.stlucievoice.com Lisa Crawford, Marketing Consultant RESTAURANTS Buffalo Wild Wings 3299 NW Federal Hwy Jensen Beach FL 34957 (772) 692-0465 3908-jensenbeach@gfenterprisellc.com www.buffalowildwings.com Lisa Roberts, General Manager VACATION RENTALS Stuart Vacation 3819 SE Lee St Stuart FL 34997 (772) 266-0315 hello@stuartvacation.com www.stuartvacation.com John Macris, Founder PRESSURE WASHING/MOBILE DETAILING Titan Pressure Washing 3756 SE Dixie Hwy Stuart FL 34997 (772) 245-0402 info@titanpw.com www.titanpw.com Sarah Brickman, Owner PIZZA Big Apple Pizza 1858 NE Jensen Beach Blvd Jensen Beach FL 34957 (772) 344-3111 krgmakes3@yahoo.com www.bigapplepizza.com Richard Neu, President INSURANCE Kirby Employee Benefits 6671 W Indiantown Rd Jupiter FL 33458 (561) 781-8188 sedric@kirbyemployeebenefits.com www.kirbyemployeebenefits.com Sedric Simon, Sales Manager GIFT SHOPS Nautical But Nice of Jensen 50 NE Jensen Beach Blvd Jensen Beach, FL 34957 (772) 287-2520 Kathryn Hendron, Owner CATERING DSK Meal Planning & Catering LLC Port St Lucie FL 34952 (772) 341-9166 chefmariasanchez@gmail.com www.dskmeals.com Maria Sanchez, Owner FUNERAL SERVICES Treasure Coast Seawinds Funeral Home & Crematory 950 SE Monterey Rd Stuart FL 34994 (772) 287-1985 www.treasurecoastseawinds.com Jim Ostrand, Funeral Director FURNITURE & ACCESSORIES Bassett Furniture 3900 NW Federal Hwy Jensen Beach FL 34957 (772) 692-9005 shendricks@bassettfurniture.com Suzette Hendricks, Design Consultant BICYCLE SALES, REPAIRS Scooter Kings 1840A NE Jensen Beach Blvd Jensen Beach FL 34957 (772) 232-6394 scooterkingsusa@gmail.com www.scooterkingsusa.com David Moffo & Jimmy Linnus, Owners CHIROPRACTIC PHYSICIANS The Joint Chiropractic 2387 SE Federal Hwy Stuart FL 34994 Stuart Centre (772) 266-9569 hienthejoint@yahoo.com www.thejoint.com/florida/stuart Hein O’Grady, Owner NONPROFIT/ASSOCIATIONS Martin County Healthy Start Coalition, Inc. 963 SE Federal Hwy Stuart FL 34994 Mayfair Plaza (772) 463-2888 info@mchealthystart.org www.mchealthystart.org Samantha Suffich, CEO AUTO REPAIR & SERVICE Kiddy’s Classics Automotive Restoration 3422 NE Candice Ave Jensen Beach FL 34957 (772) 334-2041 ambre@kiddysclassics.com www.kiddysclassics.com Ambre Kiddy, Director of Administrative Sales CUSTOM CABINETRY East Coast Cabinetry and Millwork Inc 1333 SE Dixie Hwy Stuart FL 34994 (772) 263-0898 tim@ecmflorida.com www.ecmflorida.com Tim Patrick, Owner EVENT FUNDRAISING/WINE TASTINGS ONEHOPE Wine Jensen Beach FL 34957 (772) 284-6540 susanne.yesse@gmail.com www.onehopewine.com/myshop/susanne-yesse Susanne Yesse, Cause Entrepreneur CLEANING SERVICES Amethyst House Cleaning 50 NE Dixie Hwy #C5 Stuart FL 34994 Shannon Square (772) 667-3977 info@amethystclean.com www.mypurpleclean.com Lucie Wismer, Owner CIGARS Perfect Ash Cigar Lounge 1485 NE Jensen Beach Blvd Jensen Beach FL 34957 (772) 529-2459 perfectashllc@gmail.com www.perfectashllc.com Mike Maher, Owner HAIR SALONS & BEAUTY SERVICES Islander Beauty Station 11033 S Ocean Dr Jensen Beach FL 34957 (772) 323-0829 islanderbs@gmail.com www.islandbeautystation.com Lisa Wahgler, Owner YACHT BROKER Atlantis Yacht Charters and Sales 607 NE Silver Oak Terr Jensen Beach FL 34957 (561) 339-1083 atlantisyachtchartersandsales@gmail.com www.atlantisyachtchartersandsales.com Harvey Naseck, Broker Click Here For The Areas #1 Business Directory! Latest Tweets Please install the oAuth Twitter Feed Plugin and follow the theme documentation to set it up. Follow @JensenBeachBuzz . Contact Us Phone: 772-334-3444 1912 NE Jensen Beach Blvd. Jensen Beach, Florida 34957 Document Downloads Membership Application Jammin' Jensen Application 2023 Art & Craft Show Application Upcoming Events Please Support Our Sponsors ©2025 Jensen Beach Chamber of Commerce"
    },
    {
      "url": "https://www.martin.fl.us/JensenBeachMooringField",
      "text": "Jensen Beach Mooring Field | Martin County Florida Skip to main content Above Header Facebook Twitter Youtube Instagram linkedIn Search Directory Jobs News Request for Service Employees Language Select a language to translate to English Spanish French Creole 中文 Search for Services, Information and More Search the site Martin County Florida Your County. Your Community. Home Residents Cone Zone Connect Martin Mobile App Contact Us Find Your District Fire Rescue Scanner MCTV On Demand Martin County Public Transit Other Government & Constitutional Offices Property Information Lookup Search Projects Show Me Where Sign Up for County Newsletters Weather Stations Business Bid Opportunities Business Development Board Commercial Real Estate Search County Contracts Disadvantaged Business Enterprise Plan Doing Business with Martin County Purchasing Manual Surplus Equipment Tax Exempt Certificate Vendor Registration W-9 Forms Departments Administration Airport Building County Attorney Fire Rescue General Services Growth Management Information Technology Services Library Parks and Recreation Public Works Utilities and Solid Waste Things To Do Events For Kids & Teens Get Involved Martin County Tourism Nature Trails Paddling Trails Park Finder Parks and Recreation Preserves I Want To Services Transparency Audits & Financial Reports Board of County Commissioners Budget Information Capital Improvement Plan Check Registry Search Commission & Administrator Emails Correspondence County Administrator County Code of Ordinances Financial Transparency GIS Maps, Data and Aerial Imagery Public Meetings Public Records Request Sunshine Law Documents Copyrighted Documents Correspondence Main Menu Home Residents Cone Zone Connect Martin Mobile App Contact Us Find Your District Fire Rescue Scanner MCTV On Demand Martin County Public Transit Other Government & Constitutional Offices Property Information Lookup Search Projects Show Me Where Sign Up for County Newsletters Weather Stations Business Bid Opportunities Business Development Board Commercial Real Estate Search County Contracts Disadvantaged Business Enterprise Plan Doing Business with Martin County Purchasing Manual Surplus Equipment Tax Exempt Certificate Vendor Registration W-9 Forms Departments Administration Airport Building County Attorney Fire Rescue General Services Growth Management Information Technology Services Library Parks and Recreation Public Works Utilities and Solid Waste Things To Do Events For Kids & Teens Get Involved Martin County Tourism Nature Trails Paddling Trails Park Finder Parks and Recreation Preserves I Want To Services Transparency Audits & Financial Reports Board of County Commissioners Budget Information Capital Improvement Plan Check Registry Search Commission & Administrator Emails Correspondence County Administrator County Code of Ordinances Financial Transparency GIS Maps, Data and Aerial Imagery Public Meetings Public Records Request Sunshine Law Documents Copyrighted Documents Correspondence Directory Jobs News Request for Service Employees You are here Departments Parks and Recreation Jensen Beach Mooring Field Jensen Beach Mooring Field Mooring Field Map Make a Reservation Additional Moorings Additional Moorings Manatee Pocket Mooring Field Newsletter Sign Up Overview The Jensen Beach Mooring Field is a 56-vessel mooring facility at a 8 ft depth located offshore of the Jensen Beach Causeway, at 2402 NE Causeway Blvd., on the Indian River Lagoon. This facility features moorings constructed of high quality steel helix anchors coupled with Helmken \"StormSoft\" upline buoy systems designed to accommodate vessels up to 50 ft. Amenities Restrooms & shower facilities Laundry facilities (washers & dryers only accept quarters; cost is $2.00/washer load $1.50/dryer load) Dedicated mooring field dinghy dock. Vehicle parking (available on a first-come, first-served basis) Weekly pump out service Trash receptacles & recycling available Boat ramp access Free Wi-Fi (available at mooring facility - network name is \" mcpublic \" or \" jbmooring\" ) The facility accepts transient and long-term moorage customers, and only accepts seaworthy vessels, properly titled and registered, in full compliance with federal, state and local maritime laws and regulations. Reservations Rates Daily $30.00 + tax Weekly $180.00 + tax Monthly $400.00 + tax How to Make a Reservation Select “Make a Reservation” to proceed with the reservation of a buoy. Click the \"Done\" button once you have completed the digital waiver and the system will take you to the reservation platform. A confirmation will be emailed to you with reservation details and the access code for upland amenities. Be prepared to provide the following information: insurance name, policy number, policy limits, expiration date, boat registration number, phone number, email address, the vessel's length, width (beam), draft, and name. If you need help with your reservation, please call (772) 320-3184 or email jbmooring@martin.fl.us . Make a Reservation Modify A Reservation Rules & Regulations Rules & Regulations Policies, rules and regulations. View Hurricane Plan Hurricane plan for the mooring facility. View Tie Up Procedures Learn how to tie up to a mooring buoy. View FAQs What forms of payment do you accept? Mastercard Visa AMEX Discover What documents are required for registration? Proof of your vessel’s registration for stays of thirty (30) days or more. Proof of Marine Liability Coverage (All Risk Policy) for stays of thirty (30) days or more including hull, bodily injury, property damage and pollution insurance with a minimum coverage limit of $300,000 per occurrence for any vessel 40 feet and under and $500,000 per occurrence for any vessel 41 feet up to 50 feet, which is the maximum boat length allowed. For stays of thirty (30) days or more Martin County shall be named as an additional insured.  See Agreement form for details. What is your cancellation policy? Late arrivals and early departures are not eligible for a refund. Cancellation requests must be submitted in writing by contacting the Harbormaster via email at JBmooring@martin.fl.us . All requests must be accompanied by a buoy number and the name of the person that made the reservation. The following cancellation policy will apply: Cancellation Policy: Daily reservations: cancellation requests must be made 24 hours prior to 12:00 p.m. on the reservation’s arrival date to be eligible to receive a full refund, MINUS a one-time cancellation recovery charge of $10.00.  Cancellations that do not meet the allotted time frame will not be eligible for a refund. Weekly reservations : cancellations must be made 5 days prior to 12:00 p.m. on the reservation’s arrival date to be eligible to receive a full refund, MINUS a one-time cancellation recovery charge of $10.00.  Cancellations that do not meet the allotted time frame will not be eligible for a refund. Monthly and long-term reservations: cancellation requests must be made 15 days prior to 12:00 p.m. on the reservation’s arrival date to be eligible to receive a full refund, MINUS a one-time cancellation recovery charge of $10.00.  Cancellations made within 15 days prior to 12:00 p.m. on the reservation’s arrival date will be subject to a 20% cancellation fee in addition to the one-time cancellation recovery charge of $10.00. In the event the Mooring Facility closes due to Tropical Storms, Hurricanes, or required maintenance, customers will receive a refund for the duration of the closure. Does the mooring field have a place to dock my dinghy? Yes, we have a dinghy dock with secure gate code access. We ask our guests to tie up with one line and not side-tie their dinghy; this will ensure access and availability for everyone. Please do not tie up in front of the Harbormasters boat lift. Do you have a service to pump out holding tanks? Yes. The Martin Ship Pump Out Program (M.S. POOP) vessel provides pump-out services. MS POOP comes out on Tuesday Mornings usually before 11 a.m.  To request a pump out, please call 772-260-8326 the day before (Monday) and leave a short message on their answering machine requesting a pump out, including your name, buoy #, boat name, and the mooring field you are at.  Only leave one message to avoid filling out their voicemail and blocking others from signing up. Please note that the recording at the beginning of the message refers to Sunset Bay, which is another Mooring Facility.  Ignore the instructions to contact your Dockmaster to get put on a sign-up list. How do I get access to the dock gate, restrooms & laundry facility? Upon registration, a 4-digit code with instructions to access the amenities will be provided. Do you provide a shuttle service to the dock and back? The Jensen Beach Mooring Field does not offer a shuttle service. We strongly encourage all our guests to have dinghys so you can access our amenities at your convenience. What happens if I have a problem after hours? If you have a medical or police emergency, please call 911 or hail the Coast Guard on Channel 16. If there is a facility maintenance emergency (not with your vessel), please call (772) 834-1943 . What is the depth and preferred entrance to the mooring field? At low tide, the average depth is 7 1/2 feet, and during extremely low tide, the shoaling between the mooring field and the Intracoastal Waterway (ICW) can be as shallow as 5 feet. With this shoaling, we advise vessels that draw more water to refrain from booking buoys #50 to #56. For vessels with drafts exceeding 4 feet, we recommend exiting the ICW south of channel marker R 220 and heading west 30 to 40 feet before proceeding north into the mooring field. This route offers the safest passage with the greatest water depths. Are there restaurants and bars within walking distance? Yes. Downtown Jensen Beach has multiple restaurants within walking distance. Visit Discover Martin for a listing of nearby attractions and restaurants. Is there overnight parking available for our guests? Yes. Parking is available on a first-come, first-served basis only. All vehicles must be parked in designated parking areas only. All vehicles must be operable and properly licensed. Does the mooring field have fresh water to fill boat tanks? Yes, a freshwater line is available on the dinghy dock. Can I get packages and mail delivered to the facility? The on-land facility does not have a deliverable mailing address with US Mail and other mail-carrying services. We recommend that you call Mail Box Plus of Jensen Beach at (772)-334-5200 to set up mail and package delivery options. The Jensen Beach US Post Office allows forwarding of mail to their location for pickup as well. Call in advance at (800) 275-8777 to confirm. Their address is 2301 NE Savannah Rd, Jensen Beach, FL 34957. Amazon does deliver to our facility when instructions with gate codes are included, but be aware that if Amazon uses a third party like Federal Express or UPS, they will not deliver. How long can I live on my boat in the mooring field during a 12-month period? The Mooring Facility will accommodate Liveaboard vessels. A Liveaboard is defined in the Jensen Beach Mooring Facility Sovereign Submerged Land Lease as a Vessel moored at the facility and inhabited by a person or persons for any five consecutive days or a total of ten days within a 30-day period. Liveaboard status at the facility will not exceed six months within a 12-month period, nor shall any such Vessel constitute a legal primary residence. About A mooring field is a legally defined area within a body of water. Mooring buoys provide an organized, secure way to protect boats and the environment. Customers of the Jensen Beach Mooring Field are assigned a mooring and can then secure their boat to the mooring buoy, which is attached to permanent anchors. Mooring fields are beneficial to the environment, as the use of mooring buoys helps protect sea grass and the sea floor from anchor dragging. Pump-out services are required for boats in the mooring field, and the illegal discharge of solid or liquid waste into the waterway can be substantially curbed. Mooring fields are also beneficial to safety, the local economy and the boating community. Learn more at martin.fl.us/Mooringfields . The Florida Inland Navigation District (FIND) provided $500,000 towards the construction costs for the Jensen Beach Mooring Field. The Florida Inland Navigation District is a special State taxing district for the continued management and maintenance of the Atlantic Intracoastal Waterway (ICW), commonly referred to as the M-95 marine highway. FIND was created by the Florida Legislature in 1927 to be the State local sponsor for the Atlantic Intracoastal Waterway. FIND plays two key roles in Florida's marine industry: to perform the functions of the \"local sponsor\" of the Federally-authorized Atlantic Intracoastal Waterway (ICW) project and a portion of the Okeechobee Waterway project in Florida, both of which are State/Federal navigation projects, and to provide assistance to other governments to develop waterway access and improvement projects. Along with the U.S. Army Corps of Engineers, FIND maintains the ICW along the east coast of Florida.  As the local sponsor, FIND provides all the upland land parcels, including right of ways, for the management of dredged materials removed from the waterway. Additional Resources Derelict Vessels F.I.N.D. Website FWC Boating Regulations FWC Boating Information USCG Boating Safety USCG Auxiliary Contact Us Jensen Beach Mooring Field 2402 NE Causeway Blvd Jensen Beach, FL, 34957 27.25° N | 80.22° W HARBORMASTER CONTACT VHF channel 16, or by phone at (772) 320-3184 (main line) or (772) 834-1943 (cell) Email Us Satisfaction Survey Newsletter Sign Up Accessibility Statement Martin County is committed to ensuring website accessibility for people with disabilities. To report an ADA accessibility issue, request accessibility assistance regarding our website content, or to request a specific electronic format, please contact the County ADA Coordinator (772) 320-3131 , Florida Relay 711, or complete our ADA Accessibility Feedback Form . We will make reasonable efforts to accommodate all needs. Site branding Martin County Florida Your County. Your Community. Main Site: Social Links (footer) Facebook Twitter Youtube Instagram Top Footer Menu Questions? About Martin County Career Opportunities Newsletter Signup 2401 SE Monterey Road, Stuart, FL 34996 Phone (772) 288-5400 Footer Menu Accessibility Terms of Service Privacy Policy Sitemap Employees © 2025 Martin County. All rights reserved. Clause de non-responsabilité × Pour la commodité des utilisateurs, ce site Web du comté de Martin utilise le service de traduction gratuit de Google. En cliquant sur le bouton \"J'accepte\", vous acceptez que les pages de ce site Web soient converties dans des langues autres que l'anglais. Le comté de Martin s'est efforcé d'assurer l'exactitude de la traduction. Cependant, aucune traduction automatique ou informatique n'est parfaite. Par exemple, la traduction n'est pas sensible au contexte et ne peut pas entièrement traduire le texte dans son sens complet. En outre, vous pouvez trouver des différences associées aux dialectes ou aux préférences régionales. De plus, vous ne pouvez pas traduire des graphiques avec du texte, des fichiers PDF ou des applications spéciales sur ce site Web. Le comté de Martin n'est pas responsable de la traduction fournie par Google. La version originale de ce site Web est disponible en anglais. En cas de divergence entre la version anglaise de ce site Web et la version traduite, la version anglaise prévaudra. En cliquant sur \"J'accepte\", vous acceptez que toute divergence dans la traduction ne soit pas contraignante et n'ait aucun effet juridique. Martin County ne peut garantir l'exactitude du texte converti et n'assume aucune responsabilité pouvant découler de l'utilisation ou de l'utilisation de la traduction fournie par Google. En cliquant sur \"J'accepte\", vous acceptez de renoncer à toute perte pouvant être causée au comté de Martin en vous fiant à la traduction fournie par Google. Accepter Déclin Exención de responsabilidad × Para comodidad de los usuarios, este sitio web del condado de Martin utiliza el servicio gratuito de traducción de idiomas de Google. Al hacer clic en el botón \"Acepto\", acepta que las páginas de este sitio web se conviertan a otros idiomas además del inglés. El condado de Martin ha hecho todo lo posible para garantizar la precisión de la traducción. Sin embargo, ninguna traducción automática o por computadora es perfecta. Por ejemplo, la traducción no es sensible al contexto y no puede traducir completamente el texto a su significado completo. Además, puede encontrar diferencias asociadas con dialectos o preferencias regionales. Además, no puede traducir gráficos con texto, archivos PDF o aplicaciones especiales en este sitio web. El condado de Martin no es responsable de la traducción proporcionada por Google. La versión original de este sitio web está disponible en inglés. Si hay alguna discrepancia entre la versión en inglés de este sitio web y la versión traducida, la versión en inglés prevalecerá. Al hacer clic en \"Acepto\", acepta que cualquier discrepancia en la traducción no será vinculante y no tendrá ningún efecto legal. El condado de Martin no puede garantizar la precisión del texto convertido y no asume ninguna responsabilidad que pueda derivarse del uso o la confianza en la traducción proporcionada por Google. Al hacer clic en \"Acepto\", acepta renunciar a cualquier pérdida que pueda causarse al condado de Martin al confiar en la traducción proporcionada por Google. Acepto Rechazar Limit responsabilite nou × Pou konvenyans itilizatè yo, sitwèb Martin County sa a itilize sèvis tradiksyon lang gratis Google la. Lè w klike sou bouton \"Mwen Aksepte\", ou dakò ke paj yo nan sit entènèt sa a pral konvèti nan lang ki pa angle. Martin County te fè tout efò posiblite pou asire tradiksyon an presizyon. Sepandan, pa gen okenn tradiksyon machin oswa òdinatè ki pafè. Pa egzanp, tradiksyon an pa sansib nan kontèks epi li pa ka tradui tèks la nèt ak tout siyifikasyon li. Epitou, ou ka jwenn diferans ki asosye ak dyalèk oswa preferans rejyonal yo. Epitou, ou pa ka tradui grafik ak tèks, dosye PDF oswa aplikasyon espesyal sou sit entènèt sa a. Martin County pa responsab pou tradiksyon Google bay la. Vèsyon orijinal sitwèb sa a disponib nan lang angle. Si gen nenpòt diferans ant vèsyon angle a nan sit entènèt sa a ak vèsyon an tradui, vèsyon angle a pral pran priyorite. Lè w klike sou \"Mwen dakò\", ou dakò ke nenpòt dezakò nan tradiksyon an pa pral obligatwa epi yo pa pral gen okenn efè legal. Martin County pa ka garanti presizyon tèks konvèti a epi li pa sipoze okenn responsablite ki ka rive lè w sèvi ak oswa konte sou tradiksyon Google bay la. Lè w klike sou \"Mwen dakò\" ou dakò pou renonse nenpòt pèt ki ka lakòz Martin County lè w konte sou tradiksyon Google bay la. Aksepte Dekline 免責聲明 × 為方便用戶，本馬丁縣網站使用谷歌的免費語言翻譯服務。單擊“我接受”按鈕，即表示您同意將本網站的頁面轉換為英語以外的語言。馬丁縣已盡一切努力確保翻譯的準確性。然而，沒有機器或計算機翻譯是完美的。例如，翻譯對上下文不敏感，無法將文本完全翻譯成其完整含義。此外，您可能會發現與方言或地區偏好相關的差異。此外，您不能翻譯帶有文本的圖形、PDF 文件或本網站上的特殊應用程序。馬丁縣不對 Google 提供的翻譯負責。本網站的原始版本是英文的。如果本網站的英文版本與翻譯版本之間存在任何差異，以英文版本為準。單擊“我同意”即表示您同意翻譯中的任何差異均不具有約束力，也不具有任何法律效力。 Martin County 無法保證轉換後文本的準確性，並且不承擔因使用或依賴 Google 提供的翻譯而產生的任何責任。點擊“我同意”即表示您同意放棄因依賴谷歌提供的翻譯而給馬丁縣造成的任何損失。 接受 拒絕"
    },
    {
      "url": "https://iflydrones.com/venue/jensen-beach-causeway-park/",
      "text": "Jensen Beach Causeway Park - I Fly Drones 804.356.5179 Home Services Aerial Photography & Videography Real Estate Photos and Video Film, Broadcast, and Social media content Festival & Concerts Sporting Events Memorial Services Social media Drone Sales, Rentals & Support Drone Repair Rentals Training & Experiences Drone Training The Drone Experience Industrial & Commercial Solutions Construction Site Surveying Image Mapping Photogrammetry Agriculture and Pond Management Services Specialized Drone Services Public Safety / Search & Rescue Thermal or Infrared Imaging Live Streams Drone Light Shows Fleet Gallery About Us Contact Shop Blog Events Media More 0 0 events found. Notice There are no upcoming events. Notice There are no upcoming events. Jensen Beach Causeway Park Events Venues Jensen Beach Causeway Park Address Jensen Beach , FL United States Get Directions Events at this venue Today Upcoming Upcoming Select date. Previous Events Today Next Events Subscribe to calendar Google Calendar iCalendar Outlook 365 Outlook Live Export .ics file Export Outlook .ics file Connect With Us Facebook Instagram Linkedin Pinterest YouTube Get in Touch 9507 Lyndonway Dr, Richmond, VA 23229, United States Gary@IFlyDrones.com 804.356.5179 More Links Home Fleet Gallery More About Useful links Contact Blog Shop Services Privacy Policy Newsletter Join our subscribers list to get the latest news, updates and special offers delivered directly in your inbox. Email Copyright © 2025 I Fly Drones - All Rights Reserved  | Design & Developed By: Digital Guider Home Wishlist Cart Login"
    },
    {
      "url": "https://www.hometownnewstc.com/news/jensen-beach-causeway-to-close-temporarily-for-event/article_d8d3f1ea-984d-11e9-8576-87d590a71a58.html",
      "text": "Jensen Beach Causeway to close temporarily for event | News | hometownnewstc.com Skip to main content You have permission to edit this article. Edit Close 77° Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Home Advertise About Us Contact Us Term of Use Subscription Services Gift Certificates Submission Forms Submit News Weather Search Rack Locations Indian River Martin County St. Lucie News Indian River County St. Lucie County Martin County Sports Arts & Entertainment Out and About - Indian River County Out and About - St. Lucie County Out and About - Martin County Event Features Dining Reviews Business Business Profiles Business News Business Briefs Stock Market Community Page Calendar Adopt a Pet Pet of the week Catch of the week Touring with the Townies Photo Submission Opinion Rants & Raves Police Report Arrest Reports Martin County Indian River County St. Lucie County Columns Chef's Corner Compute This Earl Stewart Financial Garden Nook Golf Horoscopes Senior Strategically Speaking Weather Wise Weekend Wanderer Obituaries Multimedia Headlines and Highlights Podcast Photos of the Week Video Gallery Announcements Anniversaries Births Engagements Weddings e-Edition Special Sections Special Sections Archive Marketplace Classifieds Place a Classified Ad Featured Advertisers Legal Ads Legal Notices © Copyright 2025 Hometown News Treasure Coast 5059 Turnpike Feeder Road, Fort Pierce, FL | Terms of Use | Privacy Policy Site search Search Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout SUBSCRIBE Join our VIP Club Menu Search 77° Home Advertise About Us Contact Us Term of Use Subscription Services Submit News Local Weather Rack Locations - Indian River Rack Locations - Martin County Rack Locations - St. Lucie Gift Certs Search News Indian River County St. Lucie County Martin County Sports Police Report Arrest Reports Indian River County Martin County St. Lucie County Business Business Briefs Business News Business Profiles Stock Market A & E Out and About Indian River County Out and About St. Lucie County Out and About Martin County Event Features Dining Community Adopt a Pet Calendar Catch of the Week Pet of the Week Photo Submission Touring with the Townies Opinion Rants and Raves Columns Chef's Corner Compute This Earl Stewart Financial Garden Nook Golf Horoscopes Senior Strategically Speaking Weather Wise Weekend Wanderer Your_health Obits Multimedia Headlines and Highlights Photo Galleries Indian River County Photo Galleries St. Lucie County Photo Galleries Martin County Photos of the Week Video Gallery Business Directory Classifieds Real Estate Property For Rent Cars & Vehicles Jobs Items For Sale Pets Auctions, Estate & Garage Sales Services Community Personals Featured Advertisers Legal Ads e-Edition Special Sections Special Section Archives Legal Notices Jensen Beach Causeway to close temporarily for event For Hometown News Jun 27, 2019 Jun 27, 2019 0 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save On Saturday, July 13, the Cleveland Clinic Martin Health Foundation will be hosting the 18th Annual Goombay Bash event at the Jensen Beach Causeway Park. The event raises critical funds for maternal, child and pediatric services at Cleveland Clinic Martin Health. This event will result in the closure of the Jensen Beach Causeway Park, including boat ramps and pavilions, beginning Saturday, July 13 at 6 a.m. and reopening to the public on Sunday, July 14 at midnight. Boat ramps will be available at the Stuart Causeway and the Jensen Beach boat ramp next to the US Sailing Center, Martin County. Although the event won't create a change in the regular traffic pattern, motorists are encouraged to exercise caution and expect minor delays. For more information about this park closure please contact Carlos Morales, Special Events and Volunteer Coordinator at cmorales@martin.fl.us or at 772-221-1430. Find more information on Parks and Recreation's facilities, special events, activities and programs at www.LoveMCparks.com or on Facebook at www.facebook.com/MyMCParks . Facebook Twitter WhatsApp SMS Email Print Copy article link Save × Post a comment as anonymous Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching (0) comments Welcome to the discussion. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another\nperson will not be tolerated. Be Truthful. Don't knowingly lie about anyone\nor anything. Be Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person. Be Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Post a comment Watch this discussion. Stop watching this discussion. Florida Lottery Winning Numbers Legal Notices Ownership TC CVC HTNMG Bulletin Featured Advertisers Billys Drywall Bulletin Contact Information hometownnewstc.com 5059 Turnpike Feeder Road Fort Pierce, FL 34951 Phone: 772-465-5656 Email: info@hometownnewsmediagroup.com Sections Home News Sports A & E Business Opinion Crime Columns Obituaries Multimedia Announcements Local Events Online Features Services Subscription Services Forms Join our VIP Club Subscription_services Classifieds Place an ad Business Directory Search Weather Media Kit Rack Locations - Indian River Rack Locations - Martin County Rack Locations - St. Lucie Advertise with Us To advertise your business, call (772) 465-5656. Agencies | National | Regional: Call Amanda Tucker at (772) 467-4352. Place a Legal Ad Call: 772-465-5551 or 1-800-823-0466 Email: classifieds@hometownnewsmediagroup.com Follow Us: Martin County Facebook Twitter Follow Us: Indian River County Facebook Follow Us: St. Lucie County Facebook × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 Hometown News Treasure Coast 5059 Turnpike Feeder Road, Fort Pierce, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    },
    {
      "url": "https://jensenbeachflorida.info/chamber-news-may-1-2020/",
      "text": "Chamber News: May 1, 2020 | Jensen Beach Call Today to Join! 772-334-3444 Menu Click or Call Today to Join! 772-334-3444 Please assign a menu to the Main Menu in Appearance > Menus Search Search Chamber News: May 1, 2020 Chamber News: May 1, 2020 Chamber News: May 1, 2020 May 2, 2020 Ignacio Fiallos WHAT’S NEXT – MAY 2020 Chamber Events Expected to Restart in JUNE Member News New & Renewing Members Business Intelligence Report – Tips for growing your business. (see attachment) Steps to Reopen & Plan for Future Business Success Online Resource for Information Related to COVID-19 Governor DeSantis’ Re-Open Florida Plan Your Chamber is here to help your business thrive. Don’t hesitate to contact us. We have a large network of business members all willing to help each other. Working together and staying connected is what it will take! Email: business@JensenBeachChamber.com Phone: (772) 334-3444 PLEASE JOIN THE CHAMBER FACEBOOK GROUP The Jensen Beach Chamber of Commerce Facebook Group creates an effective platform for meaningful member to member communication and interaction . Please join this exclusive Group . The public can view your posts, but to join the Group , you must be a member of the Jensen Beach Chamber of Commerce. We encourage you to make a weekly post highlighting anything you want to share with the Chamber membership. It could be when you plan on reopening, delivery or pickup service, a special promotion, employee or volunteer recognition, philanthropy work during these challenging times, etc. We also encourage you to search the Group for any goods or services you or your business may need. Please do business with a Chamber member! CLICK ON THIS LINK TO JOIN THE JENSEN BEACH CHAMBER MEMBER FACEBOOK GROUP MARK YOUR CALENDAR We are tentatively planning to safely restart our networking events in June. We will be respecting all state and county guidelines. We will post the events online by mid-May for reservations DON’T DISPAIR! TENTATIVE SCHEDULE OF JUNE CHAMBER EVENTS. ALL EVENTS WILL FOLLOW STATE & COUNTY GUIDELINES. Government Relations Council Meeting Monday, June 1 (12-1pm) Jensen Beach Community Center 1912 NE Jensen Beach Blvd., Jensen Beach Speaker: Dave Heaton, Executive Director, Children’s Services Council Ribbon Cutting – Fantini’s New Haven Style Apizza Wednesday, June 3 (5:15pm) North Stuart Plaza, 1560 NW Federal Highway, Stuart After Hours Mix & Mingle Tuesday, June 9 (5:30-7pm) Port Barna Restaurant (outside patio) 3478 A NW Federal Hwy, Jensen Beach Treasure Coast Square Mall Ambassador Committee Meeting Wednesday, June 10 (11:45am – 12:45pm) Elliott Museum 825 NE Ocean Blvd., Hutchinson Island Lunch N’ Learn Member Luncheon Thursday, June 18 (11:45am–1pm) Hutchinson Shores Resort & Spa 3793 NE Ocean Blvd, Jensen Beach Speaker: Nerissa Okiye, Tourism Director, Office of Tourism & Marketing Before Hours Networking Breakfast Thursday, June 25 (7:45-8:45am) Ocean Breeze Animal Hospital 1553 NE Jensen Beach Blvd., Jensen Beach Members are encouraged to bring their pet Breakfast compliments of Ocean Breeze Animal Hospital IMPORTANT ONLINE EVENT AND MEMBERSHIP RENEWAL PAYMENT CHANGE You can now pay by credit card for Chamber networking events and also to renew your membership online by visiting www.JensenBeachChamber.com . We will no longer be using PayPal to process credit card payments. MEMBER NEWS Message from Kate P. Cotner , Senior External Affairs Advisor , Florida Power & Light Company I’m writing to provide an update regarding the good news I shared earlier this month about your electric bill amid the ongoing coronavirus (COVID-19) pandemic. The Florida Public Service Commission has unanimously approved our plan to fast-track bill savings to you. This will result in a one-time bill decrease in May of nearly 25% for the typical residential customer bill. Business customers would see a significant one-time decrease as well. As I wrote in my previous note, these types of savings are typically spread out over the remainder of the year, but we felt it was important to accelerate the savings and include them in a single month’s bill given the uncertain economic times. Importantly, I hope you and your family continue to stay safe during this difficult time. Online resource for information related to COVID-19 Key COVID-19 Updates @ Martin County BIZHub Daily Reports MC Covid 19 Dashboard Florida Covid-19 Dashboard County News Governor DeSantis’ Re-Open Florida Plan Governor Ron DeSantis announced his plans to methodically reopen Florida’s economy. Toplines for this deliberate approach to restarting Florida’s economy include: Upon the expiration of the Safer at Home order, all Florida counties with the exception of Miami-Dade, Palm Beach and Broward will begin to reopen using a phased-in approach, Hospitals will be allowed to resume non-essential elective surgeries, Restaurants and retail establishments will reopen at 25 percent capacity indoors, and Movie theaters, gyms, fitness centers, bars, and salons/barber shops will remain closed under the initial reopen phase. Florida’s state parks will reopen on Monday, as the state begins the first phase of its reopening after the new coronavirus outbreak. Gov. Ron DeSantis said Friday it’s safe to get residents outside again to enjoy state parks starting on Monday. Read the Latest What does this mean for your business? Click here for Governor Ron DeSantis Presentation – April 29, 2020 GENERAL QUESTIONS ABOUT EXECUTIVE ORDER 20-112 When did the Governor’s Executive Order take effect? How long does it last? The Governor’s Executive Order takes effect Monday, May 4, 2020 at 12:01 a.m. and lasts until the Governor issues a subsequent order. Is the “Safer at Home” Order over? The Governor’s Executive Order 20-91 , Essential Services and Activities is extended until 12:01 a.m. Monday, May 4, by Executive Order 20-111. At that point, Executive Order 20-112 will maintain limitations on the movements of persons except for those businesses and services that are currently open and those businesses that re-open at 25 percent building occupancy. Does this order apply to all Florida counties? This order is in effect statewide, however in coordination with Miami-Dade, Broward, and Palm Beach county mayors, these three counties will follow stricter protocol without the re-open provisions of Executive Order 20-112. Is the Governor’s Executive Order consistent with the President’s Opening Up America Again Plan? Governor DeSantis met with President Trump on April 28 to discuss this plan and the President was very supportive of Florida’s efforts to take a safe, smart, step-by-step approach to re-open Florida. See President Trump’s guidance here: https://www.whitehouse.gov/openingamerica/ . Does this Executive Order supersede local law? The Governor’s Executive Order 20-91 limiting the movements of persons has been incorporated and modified in the new Executive Order 20-112 to include businesses currently open and certain businesses re-opening at 25 percent building occupancy. The Governor’s Executive Orders do not contain a preemption on local rules where those rules restrict or close businesses or buildings. When can we expect Phase 2 to start? Once the Governor determines it is suitable to continue re-opening and after fully considering medical data in consultation with state health officials. MEDICAL Can I go to my doctor if it’s not COVID-19 related? Medical services, including elective procedures, surgical centers, office surgery centers, dental offices, orthodontic offices, endodontic office and other health care practitioners offices may fully re-open. As a condition of resuming elective procedures, hospitals will be required to assist nursing homes and long-term care facilities in their efforts to protect the vulnerable. However, they must maintain adequate bed capacity and PPE. They must also have the capacity to immediately convert additional surgical and intensive care beds in a surge situation and must not have received or sought any additional federal, state or local government assistance regarding PPE after resuming elective procedures. May senior citizens and individuals with significant medical conditions leave their homes to go to the grocery store or pharmacy, or go for a walk, or go to work? Yes, they may leave their homes to obtain or provide open services or conduct open activities. Can individuals visit nursing homes and long-term care facilities? No, those restrictions will remain in place in Phase 1 of the Safe. Smart. Step-by-Step. Plan for Florida’s Recovery and with conditions set by the Agency for Health Care Administration. TRAVEL Is airport screening and isolation in effect for visitors from highly affected COVID-19 areas? Yes, this order extends Executive Order 20-80 , Airport Screening and Isolation, and Executive Order 20-82 , Isolation of Individuals traveling to Florida, with exceptions for military, emergency, health, infrastructure or commercial related activity. BUSINESS Can I open my business? Restaurants will be allowed to re-open, with full outdoor seating. Indoor seating will be allowed at 25 percent of building capacity. On-site sale and retail businesses will be allowed to operate at 25 percent occupancy. If your business is open, it may remain open and should continue appropriate social distancing and sanitation measures. Also, any activity or work that has been available under the previous order remains available. Businesses should adopt appropriate social distancing and sanitation measures. What businesses will remain closed? Bars, nightclubs and gyms will remain closed during Phase 1 of re-opening. While personal care services such as barbershops and salons with close contact should remain closed, the portions of those businesses with on-site retail sales may re-open at 25 percent building occupancy. May my business and its employees continue to operate remotely and provide delivery of our product? Yes, all businesses are encouraged to provide delivery or pickup and to take orders online or by telephone. Are there minimum health protocols that must be met to open my business? Yes, the Governor’s Executive Order 20-112 requires appropriate social distancing and limits groups to 10 people or fewer. Regulated businesses should adhere to agency guidance. Additionally, businesses should consult with the most up-to-date Centers for Disease Control and Prevention (CDC) guidance. What do I need to do to open my business? Review the requirements of the Governor’s Executive Order 20-112. Also review any guidance that has been provided from state and federal regulatory agencies including the Centers for Disease Control and Prevention, the Florida Department of Health and the Florida Department of Business and Professional Regulation. Do employee temperature checks need to be done? For restaurants, employee protocols remain in place under the Governor’s Executive Order. Other businesses should adopt appropriate measures based on CDC guidance. Are masks required for employees and customers? The Governor’s Executive Order does not mandate the use of masks. However customers, employees and employers should consult CDC guidance. If a business exceeds 25 percent capacity, do they get fined? Yes, enforcement penalties remain in place including a second-degree misdemeanor with a fine up to $500. Certain regulated businesses may face enforcement action for violations from their regulatory agency. Should individuals go to facilities that have not re-opened? Individuals should travel only to businesses that have been open or are now re-opened. Who enforces compliance? Local and state law enforcement continue to enforce Executive Orders, along with the regulatory agencies that oversee businesses. ACTIVITES Can I visit or travel to a family member? Yes, if caring for or otherwise assisting a loved one or friend. May I exercise outside or participate in recreational activities? Yes, if consistent with social distancing guidelines as published by the CDC. Are gyms open? No, gyms and fitness centers should remain closed. Can I go to a professional sporting event? No, sporting venues may operate but without spectators. May churches, synagogues, or other houses of worship hold services? Yes. The Governor’s Executive Order 20-91 identified attending religious services at churches, synagogues and places of worship as an open activity. While that order did not place restrictions directly on any building or venue, many local orders have done so. Any building or venue that is open should continue to follow appropriate social distancing and sanitation procedures. The Florida Department of Health encourages them to follow CDC guidance specific to faith organizations. Can I rent or stay at a vacation rental? No, the prohibition on vacation rentals remains in effect. Are state parks and beaches open? The Governor’s Executive Orders have not closed beaches other than those at the request of Broward and Palm Beach counties ( Executive Order 20-90 ). Florida’s Department of Environmental Protection will announce a phased-in re-opening of state parks. May childcare centers remain open? Yes, if currently able to open and as long as they follow proper social distancing protocols. Florida Department of Education has prioritized children of medical professionals and first responders working at businesses or operations that are essential services, to the extent those childcare centers adhere to social distancing. Are museums and libraries open? Museums and libraries may open at no more than 25 percent of their building occupancy as long as their local government allows. Interactive shared exhibits, like child play areas, remain closed. LOCAL GOVERNANCE & ENFORCEMENT Are local authorities allowed to adopt requirements directly on businesses, operations or venues, including buildings, beaches and parks, that may be stricter than the Governor’s Executive Order? Yes. How is the Governor’s Executive Order enforced? By law enforcement. Violation of the Governor’s Executive Order is a second-degree misdemeanor. Where can I report a business that violates the Governor’s Executive Order? Local law enforcement. Do I need a special permit to leave my house if I am going to an essential service or essential activity? No. Some businesses may wish to provide a letter to employees to clarify that their business is indeed an open service. FLORIDA CHAMBER SMALL BUSINESS COUNCIL How Can I Reopen My Small Business? Business Continuity – Steps to Reopen & Plan for Future Business Success As Phase I of Governor Ron DeSantis’ Safe. Smart. Step-by-Step. reopening of Florida’s Economy begins on Monday, May 4, the Florida Chamber Small Business Council has developed a short video for small businesses preparing to reopen. This video will help small businesses answer important questions: What regulations and guidance is available to guide my business reopening? What are some best practices to keep employees and customers safe? How can my business innovate and adapt to the coronavirus pandemic? How can I protect my business and plan for future business disruptions due to pandemics or natural disasters Main page: https://www.flchamber.com/covid-19-resource-center-small-business-council/ Introducing Our New Members – Please do business with and refer Chamber members. PRESSURE WASHING, DECK & PATIO SEALING, GUTTER CLEANING Northstar Pressure Washing, Inc. (772) 444-3094 Shawna Hager, Administrative Executive www.northstarpressurewashing.com yourguide@northstarpressurewashing.com BOAT CRUISES – Lunch / Dinner Island Princess Cruises 555 NE Ocean Blvd Stuart FL 34996 Hutchinson Island Marriott Marina (772) 225-2100 Bob Gibbons, Business Development www.islandprincesscruises.com info@islandprincesscruises.com HEALTH & WELLNESS The Grow Room Yoga & Wellness 752 NE Jensen Beach Blvd Jensen Beach, FL34957 (513) 543-4852 Amanda Laboissonniere, Co-Owner thegrowroomyoga@gmail.com www.thegrowroomyoga.com AUTO PURCHASING Wheels For The Heart Buy Center, LLC 3353 NW Main Ave. Jensen Beach, FL 34957 (561) 445-7444 Steve Muschlitz, Manager wheelsfromtheheart100@gmail.com www.wheelsfortheheart.com ASSOCIATIONS & ORGANIZATIONS Wheels From The Heart 3353 NW Main Ave. Jensen Beach, FL 34957 (561) 231-0108 Belle Forino, Executive Director wheelsfromtheheart100@gmail.com www.wheelsfromtheheart.org HOME / COMMERCIAL INSPECTIONS TCPalm Home Inspections (772) 678-8133 / (772) 267-5138 Gary & Terry Mulka, Owners www.tcpalmhomeinspections.com STORAGE CENTER Jensen Beach Storage 3250 NE Candice Ave Jensen Beach, FL 34957 (772) 334-8047 Kevin rCummins, Manager info@jensenbeachstorage.com www.jensenbeachstorage.com Business Plus Level Member FINANCIAL ADVISORS / INVESTMENTS Merrill Lynch/Monaghan & Tweeddale Group 2301 SE Monterey Road, Suite 1 Stuart, FL 34996 Monterey Commons (772) 223-6779 Eric Monaghan & Rob Tweeddale, Financial Advisors eric.monaghan@ML.com www.fa.ml.com/monaghan-tweeddale BUSINESS SALES Murphy Business Sales (772) 919-2554 Adrienne Schoenwalder, Associate www.paullapidus-murphy.com ENTERTAINMENT Mr. Medina (407) 558-6157 Anthony Medina, Owner themrmedina@gmail.com BOAT CRUISES Tiki Taxi & Cruises Stuart, FL 34994 (772) 521-0024 Rosemary Kuyrkendall, President/Owner rosemary@tikitaxiandcruises.com www.tikitaxiandcruises.com CLOTHING & ACCESSORIES Cooper’s Treasure Chest 3748 SE Ocean Blvd Stuart, FL 34996 Harbour Bay Plaza (772) 266-4413 Shelley Brittan, Owner/Operator saltwateraddiction7@gmail.com MORTGAGES Element Funding 1959 NE Jensen Beach Blvd Jensen Beach, FL 34957 (772) 370-1864 Welcome Home Realty International Sam Beatty, Branch Manager sbeatty@elementfunding.com RESTAURANTS The Pineapple 796 NE Dixie Hwy Jensen Beach, FL 34957 (772) 232-6061 Kurt Anderson, Big Kahuna www.thepineapplerio.com UTILITY CARTS L and Turtle USA 2336 SE Ocean Blvd #330 Stuart, FL 34996-3310 (772) 486-1616 John Cornwell, President info@landturtleusa.com www.landturtleusa.com ASSOCIATIONS & ORGANIZATIONS ReefHuggers.org (573) 694-5751 Ben Faulconer, Owner/Operator reefhuggers.org@gmail.com www.reefhuggers.org HEALTH / WELLNESS Your CBD Store 1702 NW Federal Hwy Stuart, FL 34994-9632 (772) 405-8116 Jennifer Shoup, Owner/Operator stuart586@cbdrx4u.com www.cbdrx4u.com RENTALS (EVENT) Atlas Party Rental 7856 SW Jack James Dr Stuart, FL 33426 (772) 208-8100 Ashley Kepchar, Creative Director ashley@atlaseventrental.com www.atlaseventrental.com Recent Member Renewals – Thank you for your continued support and staying connected. Luminary Circle Trustee STS Aviation Group Franco Construction, Inc. Kyle G’s Prime Seafood & Steaks Business Premium Level Member Ocean Breeze Resort St. Lucie Medical Center Florida Power & Light Company Advantage Ford of Stuart Hutchinson Island Marriott Beach Resort & Marina Law Offices of Travis R. Walker, P.A. Business Essentials Level Members Mingace Custom Sound, Inc. Dave’s Plumbing, Inc. Beach Front Mann Realty Conchy Joe’s Seafood Restaurant & Bar A/C Doctors, Inc. Jensen Beach Plumbing, Inc. River Palm Cottages & Fish Camp Jan’s Place Restaurant Surfside Grill & Pizzeria HR Law, PA Jensen Beach Dental Massey Services, Inc. Ecological Associates, Inc. Home Depot McDonalds Networker Level Member U.S. Sailing Center of Martin County Fifth Third Bank Merchant Services Regal Design Olive Garden Fredgie’s World Famous Hot Dogs AlexUSrealty.com LLC Castaways Gastropub Jewelry Design Studio Crown Trophy B & A Flea Market AAA Mobile Key & Lock Shop Martin County Supervisor of Elections Janet C. Lagerstrom, P.A. Pinelake Village Senior Solutions of the Treasure Coast Salt of the Earth Spa & Halotherapy Jensen Beach Hometown Cleaners & Tailors 9Round Tropaholic.com Melody Fortier, The Keyes Company Realtors Sunblock Window Tinting Snook Nook Bait & Tackle Sailfish Floors Periwinkle Environmental Boat Rentals Welcome Home Realty International Affordable Staffing Arium of Jensen Beach PrimeLending Karen Leffel-Massengill Studio Community Partner Level Members History Museum of Jensen Beach The Entrepreneurship Foundation Helping People Succeed, Inc. Treasure Coast Food Bank Historical Society of Martin County First Baptist Church of Jensen Beach Education Foundation of Martin County Treasure Coast Sports Commission Children’s Museum of the Treasure Coast SCORE Chapter 308 Martin County Tax Collector All Saints Cemetery May 2, 2020 Categories: News 0 Likes Click Here For The Areas #1 Business Directory! Latest Tweets Please install the oAuth Twitter Feed Plugin and follow the theme documentation to set it up. Follow @JensenBeachBuzz . Next Article Chamber News: April 27, 2020 In Uncategorized on May 2, 2020 Contact Us Phone: 772-334-3444 1912 NE Jensen Beach Blvd. Jensen Beach, Florida 34957 Document Downloads Membership Application Jammin' Jensen Application 2023 Art & Craft Show Application Upcoming Events Please Support Our Sponsors ©2025 Jensen Beach Chamber of Commerce"
    },
    {
      "url": "https://jensenbeachflorida.info/membership-2/get-connected/",
      "text": "We Bring Members Together – Jensen Beach Chamber of Commerce Skip to content Become a Member Renew membership Facebook Twitter Youtube Home Events Chamber Event Registration Community Events Chamber Events Martin County Events Jammin Jensen Taste of Jensen Fine Art & Craft Show Jensen Beach St. Patrick’s Day Parade Art, Music & Benefit Auction Membership Member Login Membership Renewal Trustees Sponsorship & Marketing Opportunities We Bring Members Together Join Forces With Top Businesses Ambassador Program 2025 Board of Directors Job Postings Adding the Chamber Logo Business Directory Join The Chamber Online Download Application PDF Visitor Guide Jensen Beach Webcam Beaches & Parks Local Attractions Outdoor Activities History of Jensen Beach Economic Development Business Directory Relocation Important Telephone Numbers New Residents Guide Health & Wellness Education Demographics Business Directory Meet Our Members Meet Our New Members View All Categories View All Business Menu Home Events Chamber Event Registration Community Events Chamber Events Martin County Events Jammin Jensen Taste of Jensen Fine Art & Craft Show Jensen Beach St. Patrick’s Day Parade Art, Music & Benefit Auction Membership Member Login Membership Renewal Trustees Sponsorship & Marketing Opportunities We Bring Members Together Join Forces With Top Businesses Ambassador Program 2025 Board of Directors Job Postings Adding the Chamber Logo Business Directory Join The Chamber Online Download Application PDF Visitor Guide Jensen Beach Webcam Beaches & Parks Local Attractions Outdoor Activities History of Jensen Beach Economic Development Business Directory Relocation Important Telephone Numbers New Residents Guide Health & Wellness Education Demographics Business Directory Meet Our Members Meet Our New Members View All Categories View All Business Member Login We Bring Members Together This is where you can build a relationship and have a conversation face to face. Expand your opportunity by getting involved and attending events. • After Hours Mix & Mingle – 2nd Tuesday of the month (5:30pm – 7pm) • Chamber Luncheons – 3rd Thursday of the month (11:45am – 1pm) • Before Hours Networking Breakfast – Last Thursday of the month (8am – 9am) Dates and event locations are subject to change. Please check event dates and times at www.JensenChamber.com. Make great connections and share your input by joining a Chamber committee. For additional information contact Ron Rose, President CEO, (772) 334-3444. Ron@JensenChamber.com. Becoming eligible to be selected as an Ambassador is one of the first steps you can take to get more involved. Ambassadors are a team of knowledgeable Chamber members that share with new, current, and potential members the benefits of Chamber involvement. Ambassadors help fellow members engage in the Chamber programs and events, as well as aid Chamber staff at our various networking and ribbon cutting events. To be selected as an Ambassador certain criterion must be met. To apply contact the Chamber (772) 334-3444, info@JensenChamber.com . The Government Relations Council advocates matters related to local and state government. The Council’s overall objective is to continually improve the business climate through dialogue with elected officials to raise awareness and stay in front of issues that may impact our business community. Council members review and develop pro-business public policy positions, share relevant legislative updates with the membership, and monitor issues that may impact business. The Council meets every other month in conjunction with our “Coffee with the Commissioner” program series. The Education Committee works to achieve a cooperative interchange of goals, information and activities between businesses and schools. Committee initiatives include Welcome Back Teachers & Staff Appreciation Breakfast, The Entrepreneurship Foundation Scholarship Program, Celebrating Influential Teachers & Students of the Month, and supporting Junior Achievement. The annual fundraising, presented by The Entrepreneurship Foundation and supported by the Chamber, is the Art, Music & Benefit Auction. Funds raised support the art and music programs at Jensen Beach Elementary School, Felix A. Williams Elementary School, Stuart Middle School, Jensen Beach High School, and the Environmental Studies Center. The committee meets the last Tuesday of each month September, October, and January through April. Community Engagement Volunteers work to enhance the image and quality of life of Jensen Beach through beautification projects and community events that keep Jensen Beach top-of-mind. Volunteers assist with Chamber produced events such as Taste of Jensen, Jensen Beach Fine Art & Craft Show, St. Patrick’s Day Festivities & Parade, Jammin’ Jensen, and the Jack-O- Lantern Blazer Bowling Bash. The Fundraising Committee seeks donations and grants to help fund programs and projects related to educational initiatives and historical preservation. Our Chamber supported 501c3 nonprofits are: The Entrepreneurship Foundation, Inc. is a specialized business educational foundation that provides resources needed to support entrepreneurial development in the community. The Foundation fosters, encourages and promotes an entrepreneurial culture and acts as the unifying source of educational, government and private sector resources to benefit current and future entrepreneurs. Contact Foundation President: Ed Griffith (772) 334-1950 The History Museum of Jensen Beach, Inc. preserves the heritage of Jensen Beach for the benefit of present and future generations. Housed in the Jensen Beach Community Center in downtown Jensen Beach, the museum promotes the collection, preservation, and educational interpretation of its people, institutions, and culture. The museum also displays early artifacts, photos, and documents. Contact Museum President: Ann Kagdis (772) 334-3444 JOIN THE CHAMBER ONLINE! DOWNLOAD APPLICATION PDF! Informative Relocation Visitor Guide Business Directory Chamber Event Contact Us Get in touch 772-334-3444 1912 NE Jensen Beach Blvd. Jensen Beach, Florida 34957 Facebook Twitter Youtube ©2024 Jensen Beach Chamber of Commerce"
    }
  ]
}