{
  "fuentes": [
    {
      "url": "https://www.jamaicaobserver.com/2024/11/13/sponsors-vendors-patrons-give-props-grace-jamaican-jerk-festival/",
      "email": "advertising@jamaicaobserver.com"
    },
    {
      "url": "https://www.jamaicaobserver.com/2024/11/13/sponsors-vendors-patrons-give-props-grace-jamaican-jerk-festival/",
      "email": "community@jamaicaobserver.com"
    },
    {
      "url": "https://jerkfestival.com/media-credentials/",
      "email": "logo_wh@2x.png"
    },
    {
      "url": "https://jerkfestival.com/media-credentials/",
      "email": "martel@circleofonemarketing.com"
    },
    {
      "url": "https://jerkfestival.com/media-credentials/",
      "email": "nicole@circleofonemarketing.com"
    },
    {
      "url": "https://jerkfestival.com/media-credentials/",
      "email": "nicole@circleofonemarketing.com.requirements"
    },
    {
      "url": "https://jerkfestival.com/media-credentials/",
      "email": "suzan@circleofonemarketing.com"
    },
    {
      "url": "https://jerkandjollof.ca/",
      "email": "info@jerkandjollof.ca"
    },
    {
      "url": "https://bostonjerkfest.com/about/",
      "email": "info@bostonjerkfest.com"
    },
    {
      "url": "https://www.overheretoronto.com/jerkfest-toronto/",
      "email": "hi@overheretoronto.com"
    },
    {
      "url": "https://jerkfestival.com/about/",
      "email": "info@circleofonemarketing.com"
    },
    {
      "url": "https://jerkfestival.com/about/",
      "email": "logo_wh@2x.png"
    },
    {
      "url": "https://jerkfestival.com/contact-us/",
      "email": "jerkfestivalinfo@jerkfestival.com"
    },
    {
      "url": "https://jerkfestival.com/contact-us/",
      "email": "logo_wh@2x.png"
    },
    {
      "url": "https://ethicalstaff.co.uk/jobs-board/",
      "email": "team@ethicalstaff.co.uk"
    },
    {
      "url": "https://jerkfestival.com/services/live-music/",
      "email": "logo_wh@2x.png"
    },
    {
      "url": "https://jerkfestival.com/services/food-drinks/",
      "email": "logo_wh@2x.png"
    },
    {
      "url": "https://concerts.theurbanmusicscene.com/2023/04/21st-annual-grace-jamaican-jerk-festival/",
      "email": "suzan@circleofonemarketing.com"
    },
    {
      "url": "https://www.jerkfestival.ca/terms-conditions",
      "email": "info@jerkfestival.ca"
    }
  ],
  "mails": [
    "advertising@jamaicaobserver.com",
    "community@jamaicaobserver.com",
    "hi@overheretoronto.com",
    "info@bostonjerkfest.com",
    "info@circleofonemarketing.com",
    "info@jerkandjollof.ca",
    "info@jerkfestival.ca",
    "jerkfestivalinfo@jerkfestival.com",
    "logo_wh@2x.png",
    "martel@circleofonemarketing.com",
    "nicole@circleofonemarketing.com",
    "nicole@circleofonemarketing.com.requirements",
    "suzan@circleofonemarketing.com",
    "team@ethicalstaff.co.uk"
  ],
  "nombre_sitio": "jerkfestival.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jamaicaobserver.com/2024/11/13/sponsors-vendors-patrons-give-props-grace-jamaican-jerk-festival/",
      "text": "Sponsors, vendors and patrons give props to Grace Jamaican Jerk Festival - Jamaica Observer ℹ Jamaica Decides 2025 Follow elections coverage here. Subscribe Login ePaper ePaper Home News Latest News Cartoon Central North & East Western Environment Health International # Elections Business Social Love Sports Football Basketball Cricket Horse Racing World Champs Commonwealth Games FIFA World Cup 2022 Olympics # Entertainment Music Movies Art & Culture Bookends # Lifestyle Page2 Food Tuesday Style Food Awards JOL Takes Style Out Design Week JA Black Friday # All Woman Home Relationships Features Fashion Fitness Rights Parenting Advice # Classifieds Employment Property Motor Vehicles Place an Ad Obituaries More Games Obituaries Jobs & Careers Study Centre Jnr Study Centre Letters Columns Advertorial Editorial Supplements Webinars tap Home News Latest News Cartoon Central North & East Western Environment Health International # Elections Business Social Love Sports Football Basketball Cricket Horse Racing World Champs Commonwealth Games FIFA World Cup 2022 Olympics # Entertainment Music Movies Art & Culture Bookends # Lifestyle Page2 Food Tuesday Style Food Awards JOL Takes Style Out Design Week JA Black Friday # All Woman Home Relationships Features Fashion Fitness Rights Parenting Advice # Classifieds Employment Property Motor Vehicles Place an Ad Obituaries More Games Obituaries Jobs & Careers Study Centre Jnr Study Centre Letters Columns Advertorial Editorial Supplements Webinars Home News Elections Latest Business Cartoon Games Food Awards Health Entertainment Bookends Regional Sports Sports World Cup World Champs Olympics All Woman Career & Education Environment Webinars More Football Letters Advertorial Columns Editorial Supplements Epaper Classifieds Design Week These patrons paused for a photo op while enjoying the sights and sounds at the 22nd Grace Jamaican Jerk Festival. Latest News , News Kevin Jackson November 13, 2024 Sponsors, vendors and patrons give props to Grace Jamaican Jerk Festival It was a wholesome family affair at last Sunday’s staging of the 22nd Grace Jamaican Jerk Festival South Florida edition. Several Jamaican companies, brands and vendors displayed their products, services and food to thousands of patrons who converged at the Miramar Regional Park in Miramar to enjoy the best of what the Caribbean has to offer. Despite intermittent afternoon showers, patrons enjoyed themselves. Grace Foods is the title sponsor of the event. Andrea Reynolds, marketing manager for Grace Foods United States of American (USA), described the partnership with the event’s organisers as amicable and fruitful. Andrea Reynolds, marketing manager for Grace Foods USA (second from left) greets patrons at the Grace Jamaican Jerk Festival last Sunday at the Miramar Regional Park in South Florida. “It was another successful event, despite the rains. It has been a long-standing, amicable and fruitful partnership over the years. We were able to welcome a wide cross-section of patrons from near and far, who wanted to enjoy good food, good vibes and just to have a fun-filled day.  Vendors had the opportunity to showcase a myriad of jerk dishes… jerk shrimp, jerk chicken, jerk pork and even jerk ice cream, courtesy of Grace Jerk. We look forward to many more years to come with this partnership as we take Grace jerk across the globe,” Reynolds told Observer Online . The HTB booth located on the far-right hand side of the venue was a hit with patrons. Bread as well as bun served with cheese were sampled and there was a spin-the-wheel engagement which saw patrons winning attractive prizes. Observer Online spoke to Korie-Page Jones, export marketing manager National/HTB brands, one of the sponsors of the event. (From left) Korie-Page Jones, export marketing manager, National/HTB brands and Omega Harris, key account manager, National and HTB Portfolio hang out inside the HTB booth at the Grace Jamaican Jerk Festival. “As proud sponsors of this year’s staging of the Grace Jamaican Jerk Festival, HTB offered free HTB Giant Hardo Bread to all jerk vendors for their patrons to pair with their favourite jerk meals.  At our booth, we sampled our bread and buns to patrons, and they all left with smiles and gifts such as tumblers, tote and caps from the brand,” said Page-Jones. She added, “The HTB brand has been participating in the jerk festival for years. Each year we also highlight the Homade brand through sampling and giveaways.” Garry Hanson, operator of Maam’s Restaurant, located in Miami, participated in the jerk festival for 13 years before a one year hiatus due to an accident. He returned this year and he described the experience as good for his business. Garry Hanson, owner of Maam’s Jamaican Restaurant points in the direction of his booth at the Grace Jamaican Jerk Festival. “I do a lot of events but this one has good traffic. It’s a food festival and people are just ready to eat. At this event, they come with their appetites and I enjoy meeting different people while giving them a taste of the Jamaican flavour,” said Hanson, a native of  Portland. Shameala Matthews,  the owner of Sannicoles Little Kitchen, who migrated from Clarendon several years ago,  has been in the food business for 12 years. And this was her eighth year participating in the jerk festival. “What I enjoy most about doing this event is just seeing the happy faces after customers taste my food. That just makes my day because I love what I do,” said Matthews. Guyanese Roy Maynard, who operates B&M Bakery and a catering business, said this was his first year participating in the event. “I’ve been in business for 29 years and we do baking, fish and meat produce and take out food. I am always busy running my business and this year I decided to participate and it has been very successful, very good. I’ll definitely be here next year,” said Maynard. Rusty’s Carib Cuisine offered patrons a melting pot of jerk meals with guava and pineapple jerk sauces to add flavour. The owner, Holly Scott, a native of Jamaica, said it was her first time participating as a vendor at the festival. “This is my third time and it has been pretty good. We are giving our customers different Caribbean flavours. This is a part of what the community is about so I had to be a part of it,” she said. Sandra Morrison, who resides in West Palm Beach, travelled all the way to Miramar just to get a taste of the jerk that she has been missing out on since she migrated from Jamaica 12 years ago. “I’m from St Catherine and let me tell yuh, I had to be here. This is Jamaican, it is Caribbean, so I had to support it. The food is good and the event is very entertaining,” she disclosed. Dwayne Johnson from Fort Lauderdale concurred with Morrison. “This event is always a good showing. I enjoy the music, visiting the different booths and enjoying the different flavours and food. I even had some Grace bulla and Sorrel drink, which were really good,” he said. African American Alicia Jalaal said she was invited to the jerk festival by her Jamaican friends. “This is my first time coming here and my friends invited me. I’m actually enjoying this despite the rain,” said Jalaal. Hazel Smith has been residing in the United States for 12 years and this is her first time attending the South Florida edition of the jerk festival. “This is wonderful, I really enjoyed it. I’m here with my mother and she is also having a good time,” Smith explained. The Grace Jamaican Jerk Festival also featured a show-stopping performance by Nigy Boy, the Energy God Elephant Man, veteran reggae band Chalice, the Fantells and former Digicel Rising Stars winner, Shuga. In between sets, patrons enjoyed musical selections courtesy of Richie D, DJ Brad and DJ Stretch of Extatic Sound. Tags: food festival Grace Foods Grace Jamaican Jerk Festival South Florida {\"jamaica-observer\":\"Jamaica Observer\"} 0 Comments · Make a comment ALSO ON JAMAICA OBSERVER International News, Latest News US warship enters Panama Canal, heading toward Caribbean August 30, 2025 PANAMA CITY, Panama (AFP) — A US guided missile cruiser, USS Lake Erie, was seen crossing the Panama Canal from the Pacific to the Caribbean Friday ni... {\"jamaica-observer\":\"Jamaica Observer\"} Entertainment, Latest News Capleton soars to ‘Heights of Fire’; set for big performance at Barclays Center in New York August 30, 2025 Rastafarian firebrand star Capleton is excited about the release of his upcoming album, \"Heights of Fire,\" an album title that he says is synonymous w... {\"jamaica-observer\":\"Jamaica Observer\"} Latest News Man shot dead in bizarre incident involving wife in upscale Spalding community August 30, 2025 CLARENDON, Jamaica— Police are trying to determine the circumstances which led to a man being shot dead at his home in the upscale community of Glenco... {\"jamaica-observer\":\"Jamaica Observer\"} Elections, Latest News, News JLP accuses Golding of making false claims during leadership debate August 30, 2025 The governing Jamaica Labour Party (JLP) has accused Opposition People’s National Party (PNP) President Mark Golding of making several false claims du... {\"elections\":\"Elections\", \"jamaica-observer\":\"Jamaica Observer\"} Latest News, News 12 arrested in joint operation with JCF, JDF — Police August 29, 2025 KINGSTON, Jamaica — A large police operation in Downtown Kingston on Thursday, resulted in several people being detained for weapons offences, police ... {\"jamaica-observer\":\"Jamaica Observer\"} Latest News, News JTA Action Committee agrees to pause pending industrial action August 29, 2025 KINGSTON, Jamaica — The Jamaica Teachers’ Association (JTA) President Mark Malabver asked the association's Action Committee to place a pause on any i... {\"jamaica-observer\":\"Jamaica Observer\"} Entertainment, Latest News Festival Song winner Abi-D set to make waves in New York for Labour Day weekend August 29, 2025 KINGSTON, Jamaica — Jamaica’s 2025 Festival Song winner, Abi-D, heads to New York for an exciting series of live performances and media appearances th... {\"jamaica-observer\":\"Jamaica Observer\"} International News, Latest News, News Texas House passes bill to curb mailed-in abortion pills August 29, 2025 TEXAS, United States (AFP) — Texas lawmakers have advanced a bill allowing people to sue those who mail abortion-inducing pills into the conservative-... {\"jamaica-observer\":\"Jamaica Observer\"} ❮ ❯ Polls HOUSE RULES We welcome reader comments on the top stories of the day. Some comments may be republished on the website or in the newspaper; email addresses will not be published. Please understand that comments are moderated and it is not always possible to publish all that have been submitted. We will, however, try to publish comments that are representative of all received. We ask that comments are civil and free of libellous or hateful material. Also please stick to the topic under discussion. Please do not write in block capitals since this makes your comment hard to read. Please don't use the comments to advertise. However, our advertising department can be more than accommodating if emailed: advertising@jamaicaobserver.com . If readers wish to report offensive comments, suggest a correction or share a story then please email: community@jamaicaobserver.com . Lastly, read our Terms and Conditions and Privacy Policy Recent Posts Archives Facebook Twitter Instagram Tweets Polls Recent Posts Archives Breaking news from the premier Jamaican newspaper, the Jamaica Observer. Follow Jamaican news online for free and stay informed on what's happening in the Caribbean Featured Tags Editorial Columns Health Auto Business Letters Page2 Football Categories tap Business Politics Entertainment Page2 Business Politics Entertainment Page2 Jamaica Observer, © All Rights Reserved Home Contact Us RSS Feeds Feedback Privacy Policy Editorial Code of Conduct"
    },
    {
      "url": "https://jerkfestival.com/media-credentials/",
      "text": "Media Credentials - Grace Jamaican Jerk Festival Skip to content Skip to footer Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Get Early Bird Tickets – Save Now Close Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Media Credentials OFFICIAL MEDIA CREDENTIAL APPLICATION PLEASE NOTE: MEDIA CREDENTIALS ARE LIMITED Request deadline: Friday, October 31, 2024. Contact: Nicole Brown , nicole@circleofonemarketing.com . Requirements: Only legitimate media is allowed. Must be a journalist, assigned freelancer, or established blogger. Must be a media outlet that distributes to the public. Must use a byline. Must submit previous feature work. No walk-up media is allowed. Media credential application must be submitted by deadline. For general media questions and requests: Suzan McDowell , President & CEO Circle of One Marketing suzan@circleofonemarketing.com Martel Sharpe , Public Relations Manager Circle of One Marketing martel@circleofonemarketing. com Di Original... The Biggest and the Best! Get Early Bird Tickets – Save Now Home About Us Cookie Policy Contact Us Grace Jamaican Jerk Festival © 2025. All Rights Reserved. Go to Top Manage Cookie Consent We use technologies like cookies to store and/or access device information. We do this to improve browsing experience and to show personalized ads. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://jerkandjollof.ca/",
      "text": "Register for the Jerk and Jollof Fest 2025 - Jerk And Jollof Program KidsZone Stage Lineup JJF Marketplace JJF Food Village Activities JJF Olympics JJF Food Wars JJF Fashionshow JJF Fly Your Flag Get Involved Volunteer Sponsor JJF Artist Signup Become a Marketplace Vendor Become a Food & Beverage Vendor About Us Impact Report 2023 Impact Report 2024 Previous Festivals Buy Tickets KidsZone Ticket Food Village Tickets VIP Experience Ticket Meet Your Community Ticket RSVP NOW Program KidsZone Stage Lineup JJF Marketplace JJF Food Village Activities JJF Olympics JJF Food Wars JJF Fashionshow JJF Fly Your Flag Get Involved Volunteer Sponsor JJF Artist Signup Become a Marketplace Vendor Become a Food & Beverage Vendor About Us Impact Report 2023 Impact Report 2024 Previous Festivals Buy Tickets KidsZone Ticket Food Village Tickets VIP Experience Ticket Meet Your Community Ticket A feast for your senses (FREE EVENT) Come For The Food, Stay For The Vibes 23RD AUGUST 2025 7507 BORDEN PARK ROAD NW, EDMONTON ALBERTA Explore Food Village Explore KidsZone 2800+ Attendees 600+ Children 44+ Vendors $35,000 In Prizes (Cash & In-Kind) Don't miss the fun! RSVP Now Photo & Video Gallery View Media Gallery → Our Activities Give Your Kids the Day Off (And Yourself Too!). Secure Your Spot Taste your way through JJF – Pre-purchase your food tickets now and save 5%! Get Your Food Tickets Gather your community with a premium tent space at JJF including KidZone tickets, swag bag placement, and more. Book Your Community Spot Get your VIP picnic table for an forgettable festival experience. Reserve Your VIP Table Shop handmade goods and support Black-owned businesses. Explore The Marketplace Get the family together and go for gold with Mini Legends Explore JJF Olympics Fasion designers, models and creative visionaries, this is your moment. Explore The Fashionshow Who serves the best jollof? Whose jerk chicken reigns supreme? You decide! Explore The Food Wars Show up. Show out. Rep your country with pride. Explore Fly Your Flag Shop handmade goods and support Black-owned businesses. Explore The Marketplace Get the family together and go for gold with Mini Legends Explore JJF Olympics Fasion designers, models and creative visionaries, this is your moment. Explore The Fashionshow Who serves the best jollof? Whose jerk chicken reigns supreme? You decide! Explore The Food Wars Show up. Show out. Rep your country with pride. Explore Fly Your Flag Questions or Custom Partnership Ideas? Δ About Us Tickets Contact Us Privacy Policy Terms Of Use Become a Sponsor Volunteer With Us Our Sponsors and Partners Be Part of the Culture! Come for the food, stay for the vibes, and leave with memories that last a lifetime Our Email Address info@jerkandjollof.ca © Jerk & Jollof Fest 2025 • All Rights Reserved • Amplified by Odio Digital Be Part of the Culture! Come for the food, stay for the vibes, and leave with memories that last a lifetime Our Email Address info@jerkandjollof.ca © Jerk & Jollof Fest 2025 • All Rights Reserved • Amplified by Odio Digital JJF Pitch Application – Jerk & Jollof Fest 2025 We’re excited to hear about your business or idea! Please complete the form below to apply for the JJF Pitch. General Information: Your Full Name Your Email Your Phone Number Business Name Does your business currently exist? —Please choose an option— Yes No Social Media Handles Video Submission: Please include a link to your 1-minute pitch video: (You can upload your video to platforms like Instagram, YouTube, Vimeo, or Google Drive and share the link here.) Did you upload the video to Instagram and tag @originaljerkandjollof as a collaborator? —Please choose an option— Yes No Δ × JJF Olympics – Jerk & Jollof Fest 2025 Full Name Email Address What nationality or cultural background are you representing? How many people are attending with you (including yourself)? Would you like to receive updates about future Jerk & Jollof events? Select an option Yes No Δ × Fly Your Flag – Jerk & Jollof Fest 2025 Full Name Email Address What nationality or cultural background are you representing? How many people are attending with you (including yourself)? Would you like to receive updates about future Jerk & Jollof events? Select an option Yes No Δ × Thanks For Signing Up! Here’s what you need to do next: RSVP for Jerk and Jollof Fest ‘25. Record a 60-second video pitch selling your business. Share your full name, the name of your brand, what you do, and what stands your brand out from the crowd. Encourage your community to support your pitch by engaging actively with your video. Post it on your IG, TikTok or Facebook page and tag @jerkandjolloffest. Get your friends and family to engage with your post. Selection criteria : The top 3 entries will pitch their businesses at Jerk and Jollof Fest ‘24 and the winner will be selected by our delectable panel of judges. So, get posting now. The higher your post engagement, the higher your chances of making it to the top 3! Follow @jerkandjolloffest on all platforms and stay glued for more updates. × Showcase Your Talent At The Jerk & Jollof Fest 2025 Here’s what you need to do next: Make a 30-second video of yourself showcasing your talent Share it on IG, TikTok or Facebook using #jerkfreestyle Tag and follow @jerkandjolloffest and @thelive.ca Entries close on the 7th of August. You could be one of the two winners who will be announced at the Jerk and Jollof Fest event.. × Performer Application – Jerk & Jollof Fest 2025 Artist Information Artist or Group Name Main Contact Name Email Address Phone Number Location (City/Province) Type of Performance Solo Musician Band DJ Dancer/Dance Group Spoken Word/Poet Cultural Performance Group Other (please specify) Specify category: Number of People in Your Act Brief Artist Bio (2–3 sentences) How would you describe your performance style or genre? Performance Samples Website / Social Media (link at least one) Link to Performance Video or Audio Sample (YouTube, SoundCloud, Google Drive, etc.) Tech & Setup Needs What equipment do you require? (Check all that apply) Microphone(s) DJ Controller Setup Aux Input Monitors Other (please specify) Specify equipment: Will you be bringing any of your own equipment? Yes (please specify) No Please Specify How long is your preferred set time? 10–15 minutes 15–20 minutes 20–30 minutes Flexible Artist Logistics Do you require a performance fee or are you open to an unpaid set with promotion? I require an honorarium I’m open to performing without pay Let’s talk – depends on setup/logistics Do you give Jerk & Jollof Fest permission to take photos/video of your performance for future promotion?. Yes No Final Notes Do you have any accessibility or accommodation needs? Any additional info you'd like us to know? Δ × Volunteer Application – Jerk & Jollof Fest 2025 Business Information Your Full Name Your Email Phone Number (required) Age (Volunteers must be 16+) Instagram (optional) Emergency Contact Name & Number Availability Which shift(s) are you available for? (Check all that apply) 7:00 AM – 11:00 AM (Setup) 11:00 AM – 3:00 PM 2:30 PM – 6:30 PM 6:00 PM – 10:00 PM 8:00 PM – 11:00 PM (Tear-down) Are you available for more than one shift? —Please choose an option— Yes No Are you interested in being entered into the Volunteer Scholarship Raffle (for those completing 2 shifts)? —Please choose an option— Yes No Role Preferences What type of tasks are you most interested in? (Check all that apply) Guest Services / Info Booth KidsZone JJ Olympics Support Line Management Marketplace/Vendor Support Stage & Performer Assistance Content / Photo / Social Media Set-up & Tear-down Anywhere I'm needed Do you have any relevant experience, certifications, or skills you'd like us to know about? (Optional) Food & Accessibility Do you have any dietary restrictions or allergies? Do you require any accessibility accommodations? Confirmation T-shirt size (if available) —Please choose an option— S M L XL 2XL 3XL I understand that I must arrive on time, check in at the volunteer station, and stay for the full duration of my selected shift. I agree I give permission for photos or videos of me during the festival to be used for future Jerk & Jollof promotions. Yes No Δ × Marketplace Vendor Application – Jerk & Jollof Fest 2025 Business Details Business Name (required) Owner Name (required) Email Address (required) Phone Number (required) Business Website / Social Media Links Business Location Vendor Category What category best describes your business? —Please choose an option— Fashion & Apparel Beauty & Skincare Wellness & Health Art / Crafts / Home Goods Business or Financial Services Coaching / Education / Consulting Tech or Creative Services Nonprofit or Community Organization Other (please specify) Specify category: Brief Description of Your Products or Services (2–3 sentences) Booth Requirements Do you require electricity? i(Note: Limited spots with power available)i Yes No – I will apply for one Do you plan to bring additional signage or display setups? Yes No (Let us know if your setup requires extra space or special accommodations) All vendor fees include a 10x10 tent, one table, and two chairs Agreement & Confirmation Do you agree to arrive by 9:00 AM for setup and remain until the end of the festival at 8:00 PM? Yes No I understand that my vendor fee is non-refundable unless my application is not accepted. I agree Would you like to be added to our vendor mailing list for future events? Yes No Δ × Be a Part of JJF as a Food Vendor Business Information Business Name (required) Main Contact Name (required) Email Address (required) Phone Number (required) Business Address (City, Province) Website and/or Social Media Links Food Details What type of food or beverages do you offer? What category best describes your setup? —Please choose an option— Food Truck Food Tent / Booth Mobile Catering Beverage Vendor (non-alcoholic) Dessert / Baked Goods Vendor Do any of your dishes represent African, Caribbean, or Afro-fusion cuisine? Yes No Some Will you be selling food prepared on-site or pre-packaged items? Prepared on-site Pre-packaged Health & Licensing Do you have a current AHS (Alberta Health Services) permit? Yes No – I will apply for one Do you have a City of Edmonton business license? Yes No Do you have valid liability insurance for this event? Yes No – I will secure it before the event Please upload a copy of your AHS permit and business license (if available now) Booth & Equipment What size is your setup? 10x10 ft tent Food truck (please include dimensions) Other (please describe) Please enter food truck dimensions: Please describe your setup: Do you require access to power? Yes No I will bring my own generator Do you use propane or open flame cooking equipment? Yes No Do you require any accommodations or special setup instructions? (Optional) Payment & Confirmation Vendor Fee Acknowledgment I understand the vendor fee is $450 + 5% of online sales from the pre-festival virtual storefront, which includes booth space, one table, two chairs, and basic festival support, pre-festival virtual storefront, etc. Arrival Commitment I agree to arrive by 9:00 AM and remain open until 8:00 PM. Media Release I consent to Jerk & Jollof Fest using photos or videos of my booth for event promotion. Would you like to be notified of future vendor opportunities? Yes No Δ × Save the Date! Jerk & Jollof Fest 2025 is coming up on August 23rd! Last year was massive. This year, it’s bigger and better. It’s Jerk and Jollof Fest 2025! Check your inbox for more details! × Be a Part of JJF as a Sponsor – Our Team Will Contact You. Your Full Name Company/Brand Name Position/Role Your Email Your Phone Number Company Website Δ × 0 YOUR CART Apply No products in the cart. Subtotal: $ 0.00 Update Cart CHECKOUT × Sign Up For The Jerk And Jollof Fest! Fill the form below to register. Enter your First Name Enter your Phone Number Enter your Email"
    },
    {
      "url": "https://bostonjerkfest.com/about/",
      "text": "About Us - Boston JerkFest 2025 Skip to content July 11th & 12th, 2025 Facebook Twitter Instagram Join our Mailing List Home Rhythm N’ Spice Festivities Festival Basics Rum and Brew Chef Demonstrations Entertainment Vendors Participate Get Tickets Become A Sponsor Become A Vendor Become A Volunteer About About Us About Jamaican Jerk About the Producer JerkFest Media Our Blog Directions & Parking Contact Contact Us Home Rhythm N’ Spice Festivities Festival Basics Rum and Brew Chef Demonstrations Entertainment Vendors Participate Get Tickets Become A Sponsor Become A Vendor Become A Volunteer About About Us About Jamaican Jerk About the Producer JerkFest Media Our Blog Directions & Parking Contact Contact Us Facebook Twitter Instagram Join our Mailing List July 11th & 12th, 2025 Home Rhythm N’ Spice Festivities Festival Basics Rum and Brew Chef Demonstrations Entertainment Vendors Participate Get Tickets Become A Sponsor Become A Vendor Become A Volunteer About About Us About Jamaican Jerk About the Producer JerkFest Media Our Blog Directions & Parking Contact Contact Us Home Rhythm N’ Spice Festivities Festival Basics Rum and Brew Chef Demonstrations Entertainment Vendors Participate Get Tickets Become A Sponsor Become A Vendor Become A Volunteer About About Us About Jamaican Jerk About the Producer JerkFest Media Our Blog Directions & Parking Contact Contact Us About Us The 12th Boston JerkFest™ is a 2-day outdoor Caribbean style foodie festival that features Jamaican jerk spiced food and all things spicy and hot to be held July 11th-12th, 2025 at Harvard Athletic Complex, 145 North Harvard Street in Allston, and just over the bridge from Harvard Square, Cambridge. This multi-day festival kicks off with a Rum & Brew Tasting Fundraiser on Friday, July 11th, 2025, 7 – 10 PM (6PM for VIP) and followed by the Boston JerkFest Festival on Saturday, July 12th, from 11 AM – 8 PM. Boston Jerkfest will feature authentic Caribbean, international, and local spicy food for sale, including: spicy meals, jams, nuts, and desserts, as well as traditional home-made drinks from the Caribbean. Boston Jerkfest also offers live music entertainment and performances for the whole family. Our Spice Lane will feature the best hot sauces in New England, as well as hot pepper value-added products. A Kids & Culture stage will offer  family-friendly performances, including the Cambridge Carnival Youth Steel Orchestra , and hands-on interactive activities. The Friday evening Rum & Brew Tasting is for 21+ festival attendees and features live music and unlimited tastings of a variety of Ca ribbean themed libations, spirits, local craft beer, wine, and artisan beverages. Our famous Cocktail Throwdown featuring rum inspired cocktails will be back again. Card To Culture We are proud to participate in the Card to Culture program, a collaboration between Mass Cultural Council and Department of Transitional Assistance , the Women, Infants & Children (WIC) Nutrition Program , and the Massachusetts Health Connector , by broadening accessibility to cultural programming. EBT, WIC, and ConnectorCare cardholders receive 1/2 off admission price to the Annual Boston JerkFest for the Saturday festival on July 12th, 2025. Children 12 and under receive free admission with an  accompanying adult. This special discount is limited to 2 adults for general admission for SATURDAY ONLY and limited to 150 tickets total available for EBT, WIC and ConnectorCare cardholders. Friday night, VIP and 2-Day passes not eligible for the discount. To access the special discount code, email us at info@bostonjerkfest.com with the subject matter: CULTURECARD and we’ll send you the link to purchase your discounted tickets. Nonprofit Partners By participating in the Boston JerkFest you are helping to support our affiliated nonprofits, Sustainable Food and Culture , Inc and the Cambridge Carnival International Cambridge Youth Steel Orchestra. Highlights of 2025 Boston JerkFest New and expanded festival footprint accommodate for more people and more vendors at Harvard Athletic Complex 9 hours of fun in the sun (extended an extra hour until 8pm) More jerk! Every restaurant vendor will offer at least one jerk dish! Spice Lane , with lots more hot stuff to keep you in the mood and the More live reggae music featuring headliner International Reggae artists to get your “Irie” on Chef demos, including a Seafood Throwdown and the Jerk Cook-off competitions, each with two chefs vying for the best jerk dish and sponsored by North American Marine Alliance, Red’s Best , and World Farmers Cocktail Throwdown featuring Boston’s hottest Mixologists who will stir up the best “Irie” drinks made from products featured at the Rum & Brew Tasting. people’s  hot sauce choice Kids & Culture stage with more family-friendly fun VIP Reggae Lounge for that extra special attention JerkFest Jamaican Rum Punch at the Reggae Bar will be on tap throughout the day Boston JerkFest T-shirts and curated Boston JerkFest Jerk Rub merchandise for sa5 2014-2025 Boston JerkFest, a production of The Williams Agency. www.thewilliamsagency.ne t site development by @trulygood"
    },
    {
      "url": "https://www.overheretoronto.com/jerkfest-toronto/",
      "text": "JerkFest Toronto 2025: Caribbean Food & Music Festival Returns August 8–10 • Over Here Toronto Skip to content Account Register Login Logout Instagram TikTok Facebook Email YouTube Latest Expand News Events New Launches Things To Do Expand This week Next Week Summer 2025 Fall 2025 August 2025 September 2025 October 2025 November 2025 December 2025 Best Of Expand Restaurants Cafe Bars Hotels Kid-Friendly Business Travel Events Expand Festivals 2025 Thanksgiving Halloween 2025 Add an Event TIFF 2025 View All Events Submit a Story Search Search Instagram TikTok Facebook Toggle Menu JerkFest Toronto 2025: Caribbean Food & Music Festival Returns August 8–10 Julie Anne L. May 22, 2025 19+ · 2025 · Activities · August 2025 · Events · News · Summer 2025 · Toronto Toronto, are you ready to turn up the heat? JerkFest Toronto is firing up the grill and the stage for another summer of sizzling food, dancehall rhythms, and community vibes. Mark your calendars: Friday, August 8 to Sunday, August 10, 2025, Centennial Park in Etobicoke is the place to be. Photo by DICSON on Unsplash Whether you’re here for the mouthwatering jerk chicken, high-energy performances, or just the warm island spirit, JerkFest delivers a full-on Caribbean experience — no plane ticket required. Music, Flavour, and Island Vibes This year’s headliner lineup is already making waves. Valiant, the Jamaican dancehall superstar known for viral hits like “Dunce Cheque” and “Narcissistic” , kicks things off on Friday night. He’s racked up over 290 million views on YouTube — and now, he’s bringing that energy to Toronto. Also performing is Agent Sasco (a.k.a. Assassin) — a veteran in the dancehall scene and collaborator to icons like Shaggy, Marcia Griffiths, Beres Hammond, and even Kendrick Lamar. His sets on Saturday and Sunday are guaranteed to get the crowd moving. View this post on Instagram A post shared by Jerk Festival Toronto (@jerkfestivaltoronto) Advertisement What Else Is Cooking? If you’re more of a foodie, you won’t be left behind. JerkFest isn’t just about music — it’s a Caribbean culinary showcase. Live cooking demos happen Saturday and Sunday at 1 PM, 3 PM, and 5 PM. Talented chefs will walk you through the magic behind jerk spices and traditional recipes. A chef lineup will be announced soon — so stay tuned. For a truly VIP experience, grab a ticket that includes a Caribbean meal, exclusive seating, and lounge perks. Kick Things Off on the Water Want to start the festival early? On Thursday, August 7, JerkFest sets sail with a VIP Meet & Greet Boat Cruise aboard the River Gambler. Expect: Performances from featured artists A Caribbean meal (jerk chicken, fish, or vegetarian) A cash bar and unmatched city views A party-ready crowd This 19+ cruise boards at 7:30 PM from 176 Cherry Street. Tickets are limited. Advertisement Jerkfest Toronto Ticket Options & Festival Access Photo via Jerk Festival Toronto (@jerkfestivaltoronto) • Instagram JerkFest has something for every budget and vibe: General Admission (Friday from $55.94, Saturday/Sunday from $28.25) VIP Garden (includes meals, private washrooms, front-stage access – from $169.50) Tiki Table Packages (great for families, includes 4 tickets + snacks – $90.40) Combo hotel + ticket bundles available through Marriott packages VIP and Platinum ticket holders receive meals. Security will not allow outside food or drinks, and staff will deny re-entry once you’re inside. Event Highlights at a Glance Dates: August 8–10, 2025 Location: Centennial Park , 256 Centennial Park Rd, Etobicoke (TTC accessible) Boat Cruise Kickoff: August 7 at 7:30 PM, 176 Cherry Street Performers: Valiant (Aug. 8), Agent Sasco (Aug. 9 & 10), more TBA Cooking Demos: Saturday & Sunday at 1 PM, 3 PM, and 5 PM Food Vendors & Craft Market: Open daily Cashless Policy: Tap to pay at entry and drink booths (cash still accepted at food/craft stalls) Parking: Paid parking near Hollycrest Middle School ($20 per car) Chairs & Umbrellas: Bring your own chairs. Umbrella tables are available for rent Pet Policy: Only service animals are allowed Rain or Shine: The festival goes on unless otherwise announced How to Enter the Spotlight Got talent? Enter the “Show Your Flow” competition for a chance to perform live at JerkFest 2025 and win a cash prize. Submit your R&B, Soca, Reggae, Dancehall, Hip-Hop, Afrobeat, or Gospel performance online. Plan Your Visit at Jerkfest Toronto Website: www.jerkfestival.ca Tickets: Available online. Prices increase closer to the event Hotel Packages: Stay at Residence Inn by Marriott (7 mins from venue) with free breakfast Note: All details may change at the organizer’s discretion. Check the official website for the most up-to-date info. More… https://www.jerkfestival.ca https://jerkfest.ticketpro.ca/en/pages/JerkFest2025 https://www.jerkfestival.ca/about Advertisement Post Tags: # Caribbean culture Toronto # Caribbean food festival Toronto # JerkFest tickets # JerkFest Toronto 2025 # Toronto summer festivals 2025 # Valiant Agent Sasco Toronto Julie Anne L. Hey, it’s Julie! Powered by coffee and cuddles from my five feline overlords, I’m always hunting down the best cafés and restos in Toronto and the GTA. When I’m not indulging in my latest food obsession, you’ll find me binge-watching shows or dreaming up my next adventure. Post navigation Previous Previous Toronto Outdoor Picture Show 2025: Free Outdoor Movies in Parks All Summer Long Next Continue Ramaphosa Keeps Cool as Trump Claims ‘White Genocide’ in Tense Oval Office Meeting Read More.. 2025 · Best · Best Restaurants · Father's Day · Food · June 2025 · Toronto 25+ Best Restaurants for Father’s Day in Toronto (2025) From rooftop steakhouses to laid-back Italian spots, here’s where to treat Dad this Father’s Day in Toronto. Read More 25+ Best Restaurants for Father’s Day in Toronto (2025) Continue Culture · Events · February 2025 Cultural Events at the Invictus Games Vancouver & Whistler 2025 The Invictus Games are more than just a competition—they bring together sport, community, and culture. From February 8 to 16,… Read More Cultural Events at the Invictus Games Vancouver & Whistler 2025 Continue 2025 · News · Sports Brendan Shanahan Out as Maple Leafs President: What’s Next for Toronto Hockey? The Shanaplan era ends as Brendan Shanahan exits the Maple Leafs. Here’s what fans are saying and what’s next for the team. Read More Brendan Shanahan Out as Maple Leafs President: What’s Next for Toronto Hockey? Continue 2025 · News · Space · Tech SpaceX Starship Test Fails After 30 Minutes | What Went Wrong & What’s Next SpaceX’s Starship lost control 30 minutes into flight due to a leak. What this means for future Mars missions and NASA’s Artemis program. Read More SpaceX Starship Test Fails After 30 Minutes | What Went Wrong & What’s Next Continue 2025 · Events · Formula 1 · Games · Grand Prix · racing · Sports · sports 2025 How F1 2025 Rule Changes Could Impact the Championship Battle The Formula 1 2025 season will bring a fresh batch of rule changes that will shake up the championship battle…. Read More How F1 2025 Rule Changes Could Impact the Championship Battle Continue 2025 · Lotto · News · Toronto Virginia Zapanta of Scarborough Wins $1M Lotto Max Prize on 83rd Birthday Virginia Zapanta of Scarborough celebrates her 83rd birthday with a $1 million Lotto Max win, ending four decades of lottery dreams. Read More Virginia Zapanta of Scarborough Wins $1M Lotto Max Prize on 83rd Birthday Continue Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. SIGN UP FOR OUR NEWSLETTER Stay ahead with the latest and most exciting updates. Let's Connect Instagram TikTok YouTube Facebook X Pinterest Follow Us On Instagram View this post on Instagram A post shared by Over Here TorontoToronto Things To Do (@overheretoronto) Overheretoronto is Toronto's leading blog and media company, curating events, best restaurants, things to do, travel guide and places to go in Toronto & Ontario. Latest Blog Posts View this post on Instagram A post shared by Over Here Toronto Toronto Things To Do (@overheretoronto) Redbreast Whiskey Takes Center Stage at TIFF 2025 The Best Spots to Watch the 2025 Toronto Waterfront Marathon (and Grab a Coffee) Elevate Festival 2025: What to Expect at Canada’s Biggest Tech Conference The Best Fall Food Festivals in Toronto & GTA (2025) A Guide to the Biggest Concerts in Toronto This October (2025) 15+ Best Fall Photo Spots in Toronto for Instagram (2025) Trinbago Toronto Festival Takes Over Nathan Phillips Square This Weekend 25+ Things to Do in Toronto This Week (September 8-14) Here’s What to Do in Toronto This Week (September 1-7) 30+ Fun Things To Do in Toronto This Thanksgiving Weekend 2025 ACCESS PERKS & THE LATEST Subscribe to access exclusive deals, upcoming events and more About Over Here Toronto is a media company covering what’s happening right now in the city — from events and pop-ups to brand launches, content, and local culture. We spotlight what’s fresh, local, and worth your time — with over 200K+ visits and over 12 million impressions to date in 2025, and counting. Facebook X Instagram Email Pinterest TikTok Contribute a Story Add an Event List Your Business Content Creators Program Advertise Your Business About Over Here Toronto Press / Media Contact © 2025 Over Here Toronto · Web Design & Marketing By Brand Glow Up Privacy Policy Scroll to top Scroll to top Latest Toggle child menu Expand News Events New Launches Things To Do Toggle child menu Expand This week Next Week Summer 2025 Fall 2025 August 2025 September 2025 October 2025 November 2025 December 2025 Best Of Toggle child menu Expand Restaurants Cafe Bars Hotels Kid-Friendly Business Travel Events Toggle child menu Expand Festivals 2025 Thanksgiving Halloween 2025 Add an Event TIFF 2025 View All Events Submit a Story Toggle Menu Close Search for: Search"
    },
    {
      "url": "https://jerkfestival.com/about/",
      "text": "About Us - Grace Jamaican Jerk Festival Skip to content Skip to footer Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Get Early Bird Tickets – Save Now Close Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us About Us Our Team Our amazing team of service providers includes Circle of One Marketing, Socially Buzz, New Gen Solutions, Ecessories by Ellen, and We Do Events, all coming together to make the Grace Jamaican Jerk Festival unforgettable! For information: info@circleofonemarketing.com about us JAMAICAN JERK FESTIVAL USA, INC. Jamaican Jerk Festival USA, Inc.,was established to develop and produce Jerk festivals and related events throughout the United States and other global markets. The team of Managing Partners all bring various areas of expertise to the organization, working in harmony to execute successful events. The annual Jamaican Jerk Festivals in Miramar, Florida and Queens, New York, have evolved as major events, attracting all ethnicities and key demographics. It is the mission of Jamaican Jerk Festival USA, Inc. to set standards and work with other organizations in promoting this uniquely Jamaican culinary art form, maintaining and protecting its authenticity globally. Grace Jamaican Jerk Festival Countdown Days : Hours : Minutes : Seconds Di Original...\nThe Biggest and the Best! Get Early Bird Tickets – Save Now Home About Us Cookie Policy Contact Us Grace Jamaican Jerk Festival © 2025. All Rights Reserved. Go to Top Manage Cookie Consent We use technologies like cookies to store and/or access device information. We do this to improve browsing experience and to show personalized ads. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://jerkfestival.com/contact-us/",
      "text": "Contact Us - Grace Jamaican Jerk Festival Skip to content Skip to footer Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Get Early Bird Tickets – Save Now Close Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Contact Us Contact Details Jamaican Jerk Festival USA, Inc. Administrative Office 6151 Miramar Pkwy. Ste. 119 Miramar, FL 33023 jerkfestivalinfo@jerkfestival.com 754-213-5105 Grace Jamaican Jerk Festival Countdown Days : Hours : Minutes : Seconds Di Original...\nThe Biggest and the Best! Get Early Bird Tickets – Save Now Home About Us Cookie Policy Contact Us Grace Jamaican Jerk Festival © 2025. All Rights Reserved. Go to Top Manage Cookie Consent We use technologies like cookies to store and/or access device information. We do this to improve browsing experience and to show personalized ads. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://ethicalstaff.co.uk/jobs-board/",
      "text": "Event Staff | Festival Staff | Hire Festival Staff | Hire Event Staff Home About Us Jobs Board Services Festival Staffing Event Staffing Sustainability Teams Promotional & Brand Activations Illuminations & Light Trails Challenge & Sporting Events Public Sector Staffing Accreditation & Access Teams Heritage Events Exhibitions & Galleries Hospitality & Stadiums Higher Education Corporate Event Staffing Roles Retail and Merchandise Staff Campsite Management Event Staff Event Stewards Roadshow Staff Event Supervisors Welcome Teams RFID Operatives Promotional Staff Customer Service Staff Ticket Scanning Staff Gate Managers Event Managers Lost Property Management Wristbanding Staff Front of House Staffing Teams Trade Show Staff Route Marshalls Accreditation Teams Brand Ambassadors Box Office Staff Street Marketing Staff Hospitality Staff Egress Team Clients News Contact Flexible Opportunities That Work For You JOIN OUR CREW Fulfilling work that fits perfectly around your other commitments You First At Ethical Staffing, YOU are more than just a number. We prioritise your development, wellbeing, and experience every step of the way. Fortnightly Pay We believe in keeping things simple and stress-free. With fortnightly living-wage pay, you get paid faster and more frequently, giving you real financial control. Reward As a proud Living Wage employer, we believe your hard work deserves fair pay. We’re committed to ensuring everyone on our team earns a wage that reflects the value they bring. Development Joining Ethical Staffing means joining a team that invests in your future. From recognised certifications to practical on-the-job skills, we provide the tools you need to grow your career. Opportunities Nov 6 - Jan 11 Event Stewards – Longleat’s Festival of Light 2025 More Info Apply Now Nov 22 - Nov 22 Event Stewards – UWE Open Day 2025 (Sat 22nd Nov) More Info Apply Now Nov 1 - Nov 2 Gates Team – Battersea Fireworks – London, 2025 More Info Apply Now Oct 11 - Oct 11 Event Stewards – UWE Open Day 2025 (Sat 11th Oct) More Info Apply Now Ongoing National Festival & Events Opportunities 2025 More Info Apply Now Sep 12 - Sep 14 Event Stewards – Longleat’s Icons Of The Sky 2025 No More Applications Sep 11 - Sep 14 Event Stewards – UWE Welcome Week 2025 No More Applications Ongoing Event Stewards – Longleat Summer Carnival 2025 No More Applications Aug 23 - Aug 23 Event Stewards – Bristol Old City Sounds 2025 No More Applications Jul 5 - Jul 5 Car Parking Marshalls & Accreditation Staff – Bristol, 2025 No More Applications Aug 21 - Aug 25 Gates Team – VMXDN Foxhill Swindon 2025 No More Applications Ongoing Ethical Staffing | Workforce Administrator 2025 No More Applications Jun 24 - Jun 30 Internal Traffic Management Team – Glastonbury 2025 No More Applications Jun 28 - Jun 29 Sustainability Ambassadors – British Summer Time 2025 No More Applications Jun 19 - Jun 19 Social Value UK – Networking Event, London 2025 No More Applications Sep 12 - Sep 14 Gates & Stewarding Team – Gunnersbury Park 2025 No More Applications Jul 4 - Jul 6 Event Stewards – Bristol Film Festival 2025 No More Applications Aug 5 - Aug 11 Wristband Support Team – Boomtown Festival 2025 No More Applications Aug 5 - Aug 11 Box Office Team – Boomtown Festival 2025 No More Applications Jul 12 - Jul 12 Event Stewards – Bristol Pride Festival 2025 No More Applications Jun 20 - Jun 30 Internal Traffic Management Team – Glastonbury 2025 No More Applications Jun 28 - Jun 28 Event Stewards – National Bell Ringing Competition 2025 No More Applications May 23 - Jun 1 Event Stewards – Steve Backshall Live 2025 No More Applications May 24 - May 25 Event Stewards – Love Saves the Day 2025 No More Applications Jul 16 - Aug 17 Car Park Marshalls – Dean Forest Railway 2025 (Wed 16th July – Sun 17th August) No More Applications What roles do you offer? We offer a range of different roles, depending on the needs of our partners. At events , our most common roles include box office, stewarding, hospitality and customer service roles. Our non event roles range from front of house, barista, catering and logistics positions. Have a look at our events pages to see what roles suit your skills, interests and availability best. What sectors do you support? Ethical Staffing work with a hugely diverse range of clients; Conferences, Sporting Events, Brand activations, World Heritage events, University Graduations, and of course, Live Events and Festivals. We are proud to state that our client portfolio is as diverse as our staffing teams! What is the application process? Want to join our superstar team? First you’ll need to fill out an application form on our recruitment portal. Here you can tell us about your experience & what events you’re interested in. One of our recruitment team will then arrange to have a telephone or Zoom interview with you, and if successful we will set you up on our shift allocation system where you will be able to choose any roles that you are interested in working at, and be the first to find out about exciting new openings! Learn more here. Can I work with my friends? Absolutely! The more the merrier! We can’t guarantee that your shifts / roles will align, but we can do our very best to make it work. Please ensure you mention this when you are contacted by our team at HQ to book in your work. What's in it for me? We truly take pride in supporting our your wellbeing and happiness! At an event, this includes free tea and coffee, snacks and around the clock support from our awesome team of managers. For weekend camping events you will also get perks like a free meal ticket for each shift worked, access to a dedicated crew camping area with hot showers, phone charging points and lots more! “Just wanted to say thanks to you and the team for today. I’ve worked with various agencies at events/festivals before and this was by far the most enjoyable experience. You have a really nice team and I felt valued and trusted” - Leanne, ES Crew 2022 \"Working with Ethical Staffing has given me confidence and helped build my people skills. I spent the summer working at the most awesome festivals and events in the UK!\" - Gary, ES Crew 2022 Services EXPLORE Roles EXPLORE Purpose Driven Staffing Solutions Location Kambe House 34 Portland Square Bristol BS2 8RG Useful Links FAQ’s Meet The Team Privacy Environmental Policy Email Us team@ethicalstaff.co.uk Call Us 0117 462 2579 Ethical Event Staffing LTD. Company registration number: 09549843 © All content Ethical Staffing Group 2025. Maintained by D3 Digital Skip to toolbar About WordPress WordPress.org Documentation Learn WordPress Support Feedback Search"
    },
    {
      "url": "https://jerkfestival.com/services/live-music/",
      "text": "Live Music - Grace Jamaican Jerk Festival Skip to content Skip to sidebar Skip to footer Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Get Early Bird Tickets – Save Now Close Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Live Music Mauris eu nisi eget nisi imperdiet vestibulum. Nunc sodales vehicula risus. Suspendisse id mauris sodales, blandit tortor eu, sodales justo. Morbi tincidunt, ante vel suscipit volutpat, turpis enim volutpSectetur adipiscing elit, sed do eiusm onsectetur adipiscing elit, sed do eiusm od tempor incididunt ut labore. Ut vel placerat eros, eu tincidunt velit. Consectetur adipiscing elit, adipiscing elit, sed do. Sed ut perspiciatis unde omnis iste natus et Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Aliquam laoreet sed neque ac vehicula. Cras congue eros nec quam laoreet, in viverra erat bibendum. Cras turpis urna, vulputate at est vitae, posuere lobortis erat. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Aliquam quis lobortis quam Curabitur pellentesque odio magna, id malesuada arcu sodales ut. Sed sed quam ut ex bibendum commodo id id magna. Aliquam sed ligula sed ante blandit volutpat. Ut bibendum, nisi et mattis vulputate, odio arcu aliquet metus, nec dapibus risus risus quis lectus. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr. Get in Touch Error: Contact form not found. Contact Info Germany — 785 15h Street, Office 478 Berlin, De 81566 info@email.com +1 840 841 25 69 Grace Jamaican Jerk Festival Countdown Days : Hours : Minutes : Seconds Di Original...\nThe Biggest and the Best! Get Early Bird Tickets – Save Now Home About Us Cookie Policy Contact Us Grace Jamaican Jerk Festival © 2025. All Rights Reserved. Go to Top Manage Cookie Consent We use technologies like cookies to store and/or access device information. We do this to improve browsing experience and to show personalized ads. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://jerkfestival.com/services/food-drinks/",
      "text": "Food & Drinks! - Grace Jamaican Jerk Festival Skip to content Skip to sidebar Skip to footer Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Get Early Bird Tickets – Save Now Close Home Entertainment Culinary Stage Sizzling Performances Cultural Presentations Features Food Court Corporate Exhibitors VIP Vibe Kids Activity Merchandise About Us Press Room Media Credentials General Info. FAQs Contact Us Food & Drinks! Mauris eu nisi eget nisi imperdiet vestibulum. Nunc sodales vehicula risus. Suspendisse id mauris sodales, blandit tortor eu, sodales justo. Morbi tincidunt, ante vel suscipit volutpat, turpis enim volutpSectetur adipiscing elit, sed do eiusm onsectetur adipiscing elit, sed do eiusm od tempor incididunt ut labore. Ut vel placerat eros, eu tincidunt velit. Consectetur adipiscing elit, adipiscing elit, sed do. Sed ut perspiciatis unde omnis iste natus et Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Aliquam laoreet sed neque ac vehicula. Cras congue eros nec quam laoreet, in viverra erat bibendum. Cras turpis urna, vulputate at est vitae, posuere lobortis erat. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Aliquam quis lobortis quam Curabitur pellentesque odio magna, id malesuada arcu sodales ut. Sed sed quam ut ex bibendum commodo id id magna. Aliquam sed ligula sed ante blandit volutpat. Ut bibendum, nisi et mattis vulputate, odio arcu aliquet metus, nec dapibus risus risus quis lectus. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr. Get in Touch Error: Contact form not found. Contact Info Germany — 785 15h Street, Office 478 Berlin, De 81566 info@email.com +1 840 841 25 69 Grace Jamaican Jerk Festival Countdown Days : Hours : Minutes : Seconds Di Original...\nThe Biggest and the Best! Get Early Bird Tickets – Save Now Home About Us Cookie Policy Contact Us Grace Jamaican Jerk Festival © 2025. All Rights Reserved. Go to Top Manage Cookie Consent We use technologies like cookies to store and/or access device information. We do this to improve browsing experience and to show personalized ads. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://concerts.theurbanmusicscene.com/2023/04/21st-annual-grace-jamaican-jerk-festival/",
      "text": "The 21st Annual Grace Jamaican Jerk Festival | Nov. 12th, 2023 TheUrbanMusicScene.com | Concerts & Festivals! Facebook Twitter Show Navigation Hide Navigation Home New R&B/Soul Releases New Gospel Releases New Jazz Releases Current Releases Concerts/Festivals United States International Canada Music Reviews Interviews The Youth Spot Contact Us! The 21st Annual Grace Jamaican Jerk Festival | November 12th, 2023 JaSupreme April 1, 2023 Concert Series , Concert/Festivals News , Concerts , Festivals , Food FOOD AND MUSIC HEADLINE THE 21ST ANNUAL GRACE JAMAICAN JERK FESTIVAL WITH PERFORMANCES BY MORGAN HERITAGE, DING DONG, COLLIE BUDDZ AND CELEBRITY CHEFS FROM ALL OVER THE CARIBBEAN Popular Caribbean food festival returns Sunday November 12th to Miramar Regional Park Miramar, FL (October 18, 2023) – The 21st Annual Grace Jamaican Jerk Festival (GJJF), happening on Sunday, November 12, 2023 from 1pm-10 pm at Miramar Regional Park, located at 16801 Miramar Pkwy, Miramar, Fl 33027, has announced its sizzling all-star lineup of chefs and musical performers. The Publix Culinary Pavilion will feature Internationally acclaimed celebrity chefs Travis Reece (Jamaica), Jamal Small (Bahamas) and Darian Bryan (Jamaica), while on the musical side, two-time Grammy-winning Royal Family of Reggae Morgan Heritage, Jamaican dancehall sensation Ding Dong and straight out of Bermuda, reggae artist Collie Buddz, will provide the soundtrack and vibes for a day filled with fun, food and Caribbean culture. Turning up the heat in the Chef Challenge is the 2022 champion, NBC-6’s Cherney Amhara, who is being challenged this year by WPLG’s Alexis Frazier for the honor GJJF’s 2023 Top Chef award. Celebrity judges include Jamaica Food Boss and South Florida based Hungry Black Man Additional entertainment will feature comedian Chris “Johnny” Daley, Dancin’ Dynamites 2003 winners from Jamaica, DJs Richie D, Jazzy T, DJ Radcliffe and Ecstatic Sound along with a Patty Eating Contest with a $1,000 prize! Emcees are Jody Ann Gray and Tanto Irie of Hot105 FM. From succulent jerk chicken to tender jerk lobster, GJJF serves up an authentic culinary journey through the heart of the islands. The festival features an exciting food court offering a wide assortment of cuisines such as jerk chicken, pork, and fish, along with Jamaican favorites fried festival, oxtails, curry goat, escovitch fish, roasted corn, as well as other tasty delights. GJJF Managing Partner and CEO Eddy Edwards commented “South Florida is home to the largest Caribbean population in the United States. The Grace Jamaican Jerk Festival reminds us of the significant, positive and delicious impact the Caribbean has on the American culture. Over the past 21 years, the festival has evolved to incorporate other wonderful Caribbean cultures, such as the Bahamas, and attract people the world over”. GJJF presented by Publix in partnership with City of Miramar, Western Union, Greater Ft. Lauderdale Visitors and Conventions Bureau, The National Weekly, Jamaica Observer, WAVS 1170 AM, Cox Radio Miami, and for the first time ever, the top stations in the Bahamas Star 106.5 and HOT 91.7 along the Nassau Guardian to welcome attendees from Islands of the Bahamas to enjoy some South Florida style island culture. General admission tickets are $40 and $50 at the gate on event day. VIP tickets are $175. Kids under 10 are free to attend. To purchase tickets and for more information, visit www.jerkfestival.com Media contact: Suzan McDowell, suzan@circleofonemarketing.com or 305-576-3790 –MEDIA IMAGES About Jamaican Jerk Festival USA, Inc. : The Jamaican Jerk Festival USA, Inc. develops and produces Jerk festivals and related events throughout the United States and other global markets. The annual festivals in Miramar, Florida, and Queens, New York, are major events attracting all ethnicities and key demographics. Circle of One Marketing Florida United States Did you like this article? Share it with your friends! Tweet Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Type in the text displayed above Most Viewed Concerts on T.U.M.S.! (Now) The JazzFest White Plains Concerts at ArtsWestchester | Sept. 10th-14th, 2025 Black Tie Cinematic Symphony – Live in Los Angeles, CA | October 10th, 2025 The 28th Annual Dave Koz & Friends Christmas Tour | Kicks Off Nov. 28th, 2025 Jazzmobile’s 60th Annual Summerfest in NYC (FREE ADMISSION!) | July 9th – Sept. 12th, 2025 The 41st Annual Jazz at the Lake in Lake George, NY | Sept. 12th – 14th, 2025 The 68th Annual Monterey Jazz Festival | Sept. 26th-28th, 2025 The 2nd Annual Music at the Intersection | Sept. 10th-11th, 2022 The 38th Annual COTA Jazz & Arts Festival | Sept. 11th-13th, 2015 The Detroit Gospel Legends Tour | Kicks Off Oct. 18th, 2025 The Holo Holo Music Festival in Utah | December 5th-6th, 2025 Categories Categories Select Category Art Award Shows Benefits Black History Month Celebrations Blues CD Release Concerts Charity Christmas Clubs Comedy Competitions Concert Series Concert/Festivals News Concerts Conferences Conventions Cruises Culinary Arts Cultural Events Dance Events Exhibits Fair Fashion Shows Festivals Food FREE CONCERTS! Fundraisers Gospel Hip-Hop/Rap Music International Interviews Jazz Clinics Las Vegas Residency Latin Live Performances Museums Musicals Old School Orchestra Panel Discussions Parties Plays Radio Shows Reggae Restaurants Seminars Speaking Engagements Sports Stage Plays T.U.M.S. Concert News Theatre Tour Informations Trade Expos Tributes TV Shows Uncategorized Via Internet Concerts Video Virtual Concerts Webcasts Wine Tasting Zydeco Archives Archives Select Month September 2025  (7) August 2025  (3) July 2025  (5) June 2025  (1) May 2025  (2) April 2025  (4) March 2025  (9) February 2025  (33) January 2025  (20) December 2024  (1) October 2024  (1) September 2024  (10) August 2024  (4) July 2024  (6) May 2024  (11) April 2024  (6) March 2024  (20) February 2024  (6) January 2024  (13) December 2023  (3) November 2023  (2) October 2023  (5) September 2023  (3) August 2023  (1) July 2023  (2) June 2023  (1) May 2023  (4) April 2023  (13) March 2023  (7) February 2023  (6) January 2023  (9) December 2022  (4) November 2022  (4) October 2022  (2) August 2022  (4) July 2022  (3) June 2022  (1) May 2022  (1) April 2022  (2) March 2022  (7) February 2022  (14) January 2022  (26) December 2021  (6) November 2021  (6) October 2021  (8) September 2021  (3) August 2021  (5) July 2021  (4) June 2021  (16) May 2021  (7) April 2021  (15) February 2021  (3) January 2021  (4) December 2020  (6) November 2020  (5) October 2020  (5) September 2020  (2) August 2020  (3) July 2020  (3) June 2020  (1) March 2020  (1) February 2020  (3) January 2020  (3) December 2019  (3) November 2019  (6) October 2019  (3) September 2019  (3) August 2019  (3) July 2019  (3) May 2019  (2) April 2019  (1) March 2019  (4) February 2019  (9) January 2019  (26) December 2018  (2) November 2018  (1) October 2018  (4) August 2018  (1) April 2018  (1) March 2018  (7) February 2018  (5) January 2018  (21) December 2017  (1) October 2017  (3) September 2017  (1) August 2017  (4) July 2017  (5) June 2017  (1) May 2017  (7) April 2017  (2) March 2017  (6) February 2017  (3) January 2017  (10) December 2016  (7) November 2016  (15) October 2016  (22) September 2016  (13) August 2016  (5) July 2016  (3) June 2016  (2) May 2016  (4) April 2016  (2) March 2016  (1) January 2016  (16) December 2015  (9) November 2015  (18) October 2015  (6) September 2015  (5) August 2015  (2) July 2015  (6) June 2015  (8) May 2015  (13) April 2015  (21) March 2015  (17) February 2015  (9) January 2015  (22) December 2014  (2) November 2014  (2) October 2014  (2) September 2014  (7) August 2014  (7) July 2014  (11) June 2014  (5) May 2014  (13) April 2014  (16) March 2014  (16) February 2014  (10) January 2014  (36) December 2013  (12) November 2013  (1) October 2013  (2) September 2013  (20) August 2013  (24) July 2013  (15) June 2013  (11) May 2013  (26) April 2013  (5) March 2013  (4) February 2013  (17) January 2013  (15) December 2012  (6) November 2012  (2) October 2012  (4) September 2012  (20) August 2012  (43) July 2012  (12) June 2012  (15) May 2012  (39) April 2012  (14) March 2012  (18) February 2012  (1) January 2012  (53) December 2011  (5) November 2011  (34) October 2011  (15) September 2011  (10) August 2011  (27) July 2011  (16) June 2011  (36) May 2011  (25) April 2011  (31) March 2011  (41) February 2011  (29) January 2011  (26) December 2010  (32) November 2010  (21) October 2010  (34) September 2010  (44) August 2010  (42) July 2010  (26) June 2010  (46) May 2010  (29) April 2010  (41) March 2010  (31) February 2010  (28) January 2010  (48) December 2009  (57) November 2009  (15) October 2009  (23) September 2009  (41) August 2009  (25) July 2009  (26) June 2009  (16) May 2009  (20) April 2009  (22) March 2009  (22) February 2009  (12) January 2009  (4) Recent Comments Administration on Black Tie Cinematic Symphony – Live in Los Angeles, CA | October 10th, 2025 Marilyn Stone on Black Tie Cinematic Symphony – Live in Los Angeles, CA | October 10th, 2025 jason Beeching on Jazzmobile’s 60th Annual Summerfest in NYC (FREE ADMISSION!) | July 9th – Sept. 12th, 2025 user-413730 on The 30th NAACP Theatre Awards in Los Angeles, CA | June 3rd, 2024 zoritoler imol on The 4th Annual Wonderfront Music & Arts Festival in San Diego, CA | May 16th-18th, 2025 | WATCH VIDEO! Tags Alabama Arizona Aruba California Canada Colorado Connecticut Florida Georgia Illinois Indiana International Iowa Jamaica Kentucky Las Vegas Louisiana Maryland Massachusetts Mexico Michigan Minnessota Mississippi Missouri Nevada New Hampshire New Jersey New Mexico New York North Carolina Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina Tennessee Texas United States Utah Vermont Virginia Washington Washington DC Wisconsin Articles direct from T.U.M.S. - Copyright (C) The Jordan Music Group, 2007-2025 | All Rights Reserved. All Press Releases under Copyright from their respective parties. Music Streams are used by permission by Owner/Management of said Record Label(s). You cannot copy content of this page"
    },
    {
      "url": "https://www.jerkfestival.ca/terms-conditions",
      "text": "Terms & Conditions — JerkFest Toronto 2025 - Presented by TD Ready Commitment 0 Skip to Content Home Schedule Festival Guide Festival Guide Directions Accessibility Sustainability About US Health & Safety SHOP Contact General Inquiry Call Us Text Us WHATSAPP 1-833-998-JERK Open Menu Close Menu Home Schedule Festival Guide Festival Guide Directions Accessibility Sustainability About US Health & Safety SHOP Contact General Inquiry Call Us Text Us WHATSAPP 1-833-998-JERK Open Menu Close Menu Home Schedule Folder: Festival Guide Back Festival Guide Directions Accessibility Sustainability About US Health & Safety SHOP Folder: Contact Back General Inquiry Call Us Text Us WHATSAPP 1-833-998-JERK Terms & Conditions JerkFest Toronto – Terms & Conditions and Liability Waiver Operated by Caribbean Promotions Arts & Culture Inc. Applies to all festival-related events including the JerkFest Boat Cruise 1. Agreement to Terms By purchasing, possessing, or using a ticket for JerkFest Toronto (the “Event”), including access to the JerkFest Boat Cruise, registering as a vendor, entering the premises or otherwise participating in JerkFest Toronto, you acknowledge that you have read, understood, and agree to be bound by these Terms & Conditions and Liability Waiver. Entry into any JerkFest venue constitutes your acceptance of these terms. If you do not agree to these terms, do not attend the Event. 2. All Sales Final / Right to Refuse Entry All ticket sales are final. No refunds or exchanges will be issued for any reason. JerkFest Toronto is a rain-or-shine event. The organizers reserve the right to deny entry or remove any attendee from the premises or boat cruise without refund for failure to comply with festival rules, applicable laws, or event staff instructions. The promoters reserve the right to make lineup changes or schedule modifications or changes, and any such changes are at the sole discretion of the promoters and shall not constitute grounds for refunds or claims. 3. Entry and Conduct Policy JerkFest is committed to providing a safe, enjoyable, and welcoming environment for all. By participating in the Festival, all individuals agree to follow the event’s rules and regulations. Entry is only allowed with a valid ticket; all participants must adhere to safety and security protocols. Disruptive behaviour, including violence, harassment or illegal activities, will result in immediate removal and or ban from the event. Attendees are responsible for their personal belongings and must respect the event environment. Event organizers are not liable for any injuries or damages. 4. Assumption of Risk & Waiver of Liability By attending JerkFest Toronto and its associated events (including the Boat Cruise), a.) You do so at your own risks. You understand that participation carries inherent risks, including but not limited to: personal injury, illness, property damage, allergic reactions, dehydration, sun exposure, food allergies and contamination, equipment or structure malfunction, and crowd-related risks. You voluntarily accept any and all such risks, whether caused by environmental factors, other attendees, or activities at the event. b.)You hereby release, waive, indemnify and forever discharge Caribbean Promotions Arts & Culture Inc., its officers, employees, contractors, sponsors, volunteers, partners, and affiliates (“the Releases”) from any claims or causes of action, including negligence, for any injury, death, theft, property damage incurred in connection with your attendance, food, drink or product consumption; weather conditions or natural disasters; acts of third parties including vendors or other patrons, or expenses arising from your attendance or participation. It is understood and agreed that by attending or participating in the festival, you assume all known and unknown risks, whether foreseeable or not associated with attending or participating in the festival and agree to indemnify, defend and hold harmless Caribbean Promotions Arts & Culture Inc. all its officers and agents and affiliates from any and all liabilities, claims, demands, causes of action, suits, losses, damages, fines or penalties, costs, and expenses (including legal fees) arising out of or related to: a. Your violation of these terms; b. Your actions, inactions, negligence or misconduct; c. Your participation or attendance at the festival; Any damage you cause to persons or their property. 5. JerkFest Boat Cruise The Boat Cruise is operated by a third-party service provider. JerkFest Toronto is not responsible for any incidents, accidents, or actions occurring on the cruise, including actions by boat staff or attendees. Participation is voluntary and at your own risk. Attendees must comply with all safety and conduct instructions from boat staff and event organizers. Alcohol will be served on board in accordance with Ontario law; valid government-issued ID is required. 6. Children’s Activities & Supervision Children under 18 must be accompanied and supervised by a parent or legal guardian at all times. Certain children’s activities (e.g., inflatables) require a separate waiver signed by the parent or guardian. JerkFest does not provide childcare or assume responsibility for minors on site or on the boat cruise. 7. Vendor Conditions Vendors must operate in accordance with health and safety regulations and municipal bylaws. Vendors are solely responsible for: a. Their product, setup and staff; b. Ensure all permits and insurance coverage are current and valid; c. Any claims or damages resulting from their services or goods. Caribbean Promotions Art and Culture Inc. does not provide insurance or assume liability for vendor operations. Vendors agree to indemnify, defend and hold harmless Caribbean Promotions Art and Culture Inc and all affiliates from any liability claim or losses in accordance with paragraph 3(a)(b). 6. Alcohol Consumption Alcoholic beverages will be available in designated licensed areas. Attendees must be 19+ and may be required to show valid government-issued ID. Attendees are expected to drink responsibly. Parents or guardians consuming alcohol remain solely responsible for their children during the event. 7. Food Sampling & Allergies Food and beverage sampling will occur at various locations including the Demonstration Tent. Attendees are responsible for inquiring about ingredients and allergens. JerkFest Toronto is not liable for any food-related illness or allergic reaction. 8. Tickets Purchased for Others If you purchase tickets for others, you represent that you are authorized to accept these Terms & Conditions on their behalf. You agree to communicate these terms to them. Entry by any ticket holder constitutes acceptance of these terms. 9. Publicity Release By attending JerkFest Toronto or the JerkFest Boat Cruise, you grant the organizers and their affiliates the right to photograph, film, or otherwise record you and use your image, likeness, voice, or recordings in any promotional or marketing materials, in perpetuity and without notice or compensation. 10. No Liability for Third Parties The Festival may feature performances, installations, or services provided by independent contractors and or third parties. Caribbean Promotions Arts and Culture Inc. 11. Force Majeure / Event Changes In the event of festival cancellation, delay, or changes due to circumstances beyond the organizers’ control (including but not limited to severe weather, natural disasters, public health emergencies, or acts of God), JerkFest Toronto reserves the right to cancel, reschedule, or modify the event without obligation to provide a refund or other compensation. 12. Sever-ability If any part of these Terms is deemed invalid or enforceable, the remaining provisions shall continue in full force and effect. 13. Governing Law & Legal Venue These Terms & Conditions are governed by the laws of the Province of Ontario and the federal laws of Canada. Any disputes arising under these terms shall be resolved exclusively in the courts of Ontario. 14. Disclaimer: Show Your Flow Competition – JerkFest Toronto 2025 By submitting a video entry to the \"Show Your Flow\" competition, participants agree to the following terms: Eligibility : All entrants must be 18 years of age or older, or have parental/guardian consent if under 18. All required information must be submitted with the video entry to be eligible. Content Ownership : By entering, you confirm that the submitted video is your original work and that you have the rights to any music, lyrics, or visuals used. You retain ownership of your work but grant the organizers a non-exclusive, royalty-free license to use, reproduce, and display your submission for promotional and festival-related purposes. Public Use : Submitted content may be used for marketing, promotional, or media purposes by JerkFest Toronto and its partners. Judging and Selection : A panel of judges selected by the festival organizers will review all submissions and choose a shortlist of top entries. These selected videos will then be posted on the official JerkFest Toronto website for public voting. The final winner(s) will be determined by the number of public votes received. The organizers reserve the right to verify the authenticity of votes and disqualify any suspicious or manipulated entries. Prize and Performance : The winning artist(s) will receive a cash prize and the opportunity to perform live at the 2025 JerkFest Toronto. No travel or accommodation expenses are guaranteed unless otherwise stated. Code of Conduct : Any entries deemed inappropriate, offensive, or not in line with the spirit of the competition may be disqualified at the organizers’ discretion. Legal Release : By entering, participants release JerkFest Toronto, its sponsors, and affiliates from any liability related to their participation in the competition or use of their submitted content. 15. Acknowledgement of Risk BY ENTERING THE FESTIVAL GROUNDS OR BOARDING THE BOAT CRUISE, YOU ACKNOWLEDGE THAT YOU HAVE READ AND UNDERSTOOD THESE TERMS & CONDITIONS AND LIABILITY WAIVER, AND THAT YOU ARE VOLUNTARILY WAIVING SUBSTANTIAL LEGAL RIGHTS (INCLUDING THE RIGHT TO SUE JERKFEST TORONTO, CARIBBEAN PROMOTIONS ARTS AND CULTURE INC, OR ITS AFFILIATES). 16. JerkFest SMS & Email Terms By signing up to receive SMS and/or email communications from JerkFest, you agree to the following terms: Consent to Receive Messages: You consent to receive promotional, marketing, and informational messages related to JerkFest, including event updates, special offers, and important notifications via SMS and/or email. Message & Data Rates: Message and data rates may apply according to your carrier’s plan. Message frequency may vary based on event schedules and promotions. Opt-Out: You may unsubscribe at any time by replying STOP to any SMS message or using the unsubscribe link in any email. After opting out, you will no longer receive messages from JerkFest. Help & Support: For assistance, reply HELP to any SMS message or contact our support team at 1-833-998-5375 Privacy & Data Protection: Your phone number and email address will be used solely for communications from JerkFest. We will not share your information with third parties for marketing or promotional purposes. Message Timing: Messages will be sent during reasonable hours to respect your time and convenience. Changes to Terms: JerkFest reserves the right to update or modify these terms at any time. Continued use of the messaging services after changes constitutes acceptance of the new terms. If you have any questions or concerns please contact info@jerkfestival.ca ABOUT | CONTACT | INFO | ACKNOWLEDGMENTS YOUR JERK . YOUR MUSIC . YOUR VIBE. Privacy Policy Terms & Conditions 2023 © Caribbean Promotions Arts & Culture Inc. All Rights Reserved. Website Designed & Developed by B3 Host ( A Mookey Media Group Inc. Company) Enable JavaScript to ensure website accessibility"
    }
  ]
}