{
  "fuentes": [
    {
      "url": "https://www.joesjeans.com/pages/contact-us",
      "email": "new_black_joe_s_logo_black_copy_170x@2x.png"
    },
    {
      "url": "https://www.joesjeans.com/pages/contact-us",
      "email": "mainmenu_1_2x_5_370x230@2x.jpg"
    },
    {
      "url": "https://www.joesjeans.com/pages/contact-us",
      "email": "mainmenu_2_2x_5_370x230@2x.jpg"
    },
    {
      "url": "https://www.joesjeans.com/pages/contact-us",
      "email": "mainmenu_m_sale_2x_15ed36c6-226a-4cfb-8e66-35a970b4bafe_370x230@2x.jpg"
    },
    {
      "url": "https://www.joesjeans.com/pages/contact-us",
      "email": "mainmenu_w_sale_2x_85c2d33e-dd8f-467a-ae2e-b723a89ff565_370x230@2x.jpg"
    },
    {
      "url": "https://www.joesjeans.com/pages/contact-us",
      "email": "shop@joesjeans.com"
    },
    {
      "url": "https://www.biography.com/athletes/shoeless-joe-jackson",
      "email": "editor@biography.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/trader-joes/",
      "email": "bpalbaum@traderjoes.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/trader-joes/",
      "email": "close@2x.png"
    },
    {
      "url": "https://www.elliott.org/company-contacts/trader-joes/",
      "email": "jbasalone@traderjoes.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/trader-joes/",
      "email": "mheeger@traderjoes.com"
    },
    {
      "url": "https://www.elliott.org/company-contacts/trader-joes/",
      "email": "nhigh@traderjoes.com"
    },
    {
      "url": "https://www.legistorm.com/person/bio/267934/Joseph_S_Katz.html",
      "email": "congress@legistorm.com"
    },
    {
      "url": "https://trader-joes.pissedconsumer.com/customer-service.html",
      "email": "privacy@traderjoes.com"
    }
  ],
  "mails": [
    "bpalbaum@traderjoes.com",
    "close@2x.png",
    "congress@legistorm.com",
    "editor@biography.com",
    "jbasalone@traderjoes.com",
    "mainmenu_1_2x_5_370x230@2x.jpg",
    "mainmenu_2_2x_5_370x230@2x.jpg",
    "mainmenu_m_sale_2x_15ed36c6-226a-4cfb-8e66-35a970b4bafe_370x230@2x.jpg",
    "mainmenu_w_sale_2x_85c2d33e-dd8f-467a-ae2e-b723a89ff565_370x230@2x.jpg",
    "mheeger@traderjoes.com",
    "new_black_joe_s_logo_black_copy_170x@2x.png",
    "nhigh@traderjoes.com",
    "privacy@traderjoes.com",
    "shop@joesjeans.com"
  ],
  "nombre_sitio": "joesonmain.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.joesjeans.com/pages/contact-us",
      "text": "Contact Us\n      \n      \n        – Joe's® Jeans Skip to content New Arrivals Women Men FALL COLLECTION WOMENS MENS Women FEATURED New Arrivals Coat Check Elevated Texture NEUTRAL TERRITORY DETAILED DENIM COLLEGIATE CHIC Matching Sets Denim Alternatives Back in Stock Best Sellers Essentials Petite Maternity CLOTHING Tops Sweaters Shirts Tees / Tanks Bottoms Pants Shorts / Skirts Dresses / Jumpsuits Jackets / Outerwear SHOP DENIM Skinny CHARLIE ICON TWIGGY Straight MARGOT SLIM MARGOT Relaxed RYAN BOWIE Bootcut HI HONEY STACEY FRANKIE CALLIE Flare MOLLY Wide Leg MIA LOU LOU BLAKE Petite PROVOCATEUR MIA Rise Low Mid High SHOP BY FABRIC Rigid Low Stretch Super Stretch Weightless Denim Men FEATURED New Arrivals Fit Focus Bespoke Essentials Collection Best Sellers CLOTHING Tops / Tees Pants / Trousers Sweaters / Hoodies Jackets / Outerwear Shorts SHOP DENIM FITS THE SAWYER 32\" - SLIM STRAIGHT THE JOE 30\" - RELAXED STRAIGHT THE BRIXTON - STRAIGHT & NARROW THE ASHER - SLIM THE CLASSIC - STRAIGHT THE ROUX - VINTAGE STRAIGHT SHOP BY FABRIC RIGID LOW STRETCH SUPER STRETCH SHOP BY INSEAM 30\" INSEAM 32\" INSEAM 36\" INSEAM Sale WOMEN $99 & Under Shorts Jeans Pants Tops Jackets Skirts / Dresses MEN $99 & Under Shorts Jeans Pants Shirts Jackets Fit Guide Men's fit guide Women's fit guide Joe’s ReClassics Account Subscribe JOE'S INSIDERS Cart Cart is currently empty SIGN UP & RECEIVE 20% OFF YOUR ORDER OF $100+ New Arrivals New Arrivals Women Men Women's New Arrivals Men's New Arrivals FALL COLLECTION WOMENS MENS Women Women FEATURED New Arrivals Coat Check Elevated Texture NEUTRAL TERRITORY DETAILED DENIM COLLEGIATE CHIC Matching Sets Denim Alternatives Back in Stock Best Sellers Essentials Petite Maternity CLOTHING Tops Sweaters Shirts Tees / Tanks Bottoms Pants Shorts / Skirts Dresses / Jumpsuits Jackets / Outerwear SHOP DENIM Skinny CHARLIE ICON TWIGGY Straight MARGOT SLIM MARGOT Relaxed RYAN BOWIE Bootcut HI HONEY STACEY FRANKIE CALLIE Flare MOLLY Wide Leg MIA LOU LOU BLAKE Petite PROVOCATEUR MIA Rise Low Mid High SHOP BY FABRIC Rigid Low Stretch Super Stretch Weightless Denim Men Men FEATURED New Arrivals Fit Focus Bespoke Essentials Collection Best Sellers CLOTHING Tops / Tees Pants / Trousers Sweaters / Hoodies Jackets / Outerwear Shorts SHOP DENIM FITS THE SAWYER 32\" - SLIM STRAIGHT THE JOE 30\" - RELAXED STRAIGHT THE BRIXTON - STRAIGHT & NARROW THE ASHER - SLIM THE CLASSIC - STRAIGHT THE ROUX - VINTAGE STRAIGHT SHOP BY FABRIC RIGID LOW STRETCH SUPER STRETCH SHOP BY INSEAM 30\" INSEAM 32\" INSEAM 36\" INSEAM Sale Sale WOMEN $99 & Under Shorts Jeans Pants Tops Jackets Skirts / Dresses MEN $99 & Under Shorts Jeans Pants Shirts Jackets Women's Sale Men's Sale Fit Guide Men's fit guide Women's fit guide Joe’s ReClassics Joe’s ReClassics FREE GROUND SHIPPING ON ORDERS OF $200+ Joe's Insiders Subscribe Account Cart ( 0 ) Home / Contact Us Contact Us If you have any questions, concerns, or comments regarding Joe's products, JoesJeans.com Online Shopping Site or purchases made at JoesJeans.com, please call Toll Free: 1.877.528.JOES (5637) | USA Hours of Operation: 9AM - 5PM EST, Monday - Friday with the exception of holidays. Or email us at shop@joesjeans.com . To contact our Customer Care department by phone Call Toll Free: 1.877.528.JOES (5637) | USA Calls from outside USA will be charged at international rates. Need help? If you’re subscribed to SMS messages, text “Support” to 69957. Message and data rates may apply Text Us Product Advice Should you have questions relating to any of our merchandise, our Product Advisors will be happy to provide you with any additional information or advice you may require. Please send an email to shop@joesjeans.com Feedback If you have any feedback or comments on fashion and general topics that may be of interest to us we would love to hear from you. Please send an email to shop@joesjeans.com Your name Your email Your message Send message This site uses cookies and other tracking devices to simplify and improve your use and experience on this website, as well as for other purposes. Cookies are small text files stored on the device you are using to access this website. If you ignore this message and continue without changing your browser settings, we will assume that you are consenting to our and third parties permitted by us, use of such cookies.  For further information, please see our Privacy Policy . CUSTOMER SERVICE HELP CENTER CONTACT US YOUR ACCOUNT/LOG IN START A RETURN GIFT CARD SHIPPING & RETURNS STUDENT DISCOUNT About Joe's COMPANY CAREERS STORES TERMS PRIVACY TRANSPARENCY IN SUPPLY CHAIN STATEMENT YOUR CALIFORNIA PRIVACY RIGHTS ACCESSIBILITY Newsletter SIGN UP NOW AND RECEIVE 20% OFF YOUR ORDER OF $100+"
    },
    {
      "url": "https://www.biography.com/athletes/shoeless-joe-jackson",
      "text": "Shoeless Joe Jackson: Biography, Baseball Player, Athlete Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Elvis & Tom Parker’s Feud Rupert Murdoch Howard Stern Lainey Wilson Famous Athletes Baseball Players Shoeless Joe Jackson Shoeless Joe Jackson Shoeless Joe Jackson was one of baseball’s top stars in the early 20 th century. He was ousted from the sport for his alleged role in game-fixing before being reinstated in 2025. By Biography.com Editors and Tyler Piccotti Updated: May 15, 2025 12:37 PM EDT Listen (9 min) 9 min Getty Images We may earn commission from links on this page, but we only recommend products we back. 1887–1951 Latest News: MLB Reinstates Shoeless Joe Jackson More than 70 years after his death, “Shoeless” Joe Jackson is finally eligible for the Baseball Hall of Fame. He was banned from playing professionally 13 years into his career for his role in the infamous 1919 Black Sox Scandal. On May 13, MLB Commissioner Rob Manfred announced he’s removing Jackson from the sport’s permanently ineligible list. Manfred determined the league’s punishment of banned players should end after their deaths, meaning the all-time hit leader Pete Rose and several other players are also reinstated. “Obviously, a person no longer with us cannot represent a threat to the integrity of the game. Moreover, it is hard to conceive of a penalty that has more deterrent effect than one that lasts a lifetime with no reprieve,” Manfred wrote in a letter to representatives of Rose’s family who petitioned he be reinstated. With the reversal, Jackson—considered one of baseball’s earliest superstars prior to his ban in 1921—will be considered for Hall of Fame election through the Classic Baseball Era Committee. The group next meets in December 2027 to consider candidates for the 2028 induction class. Jump to: Who Was Shoeless Joe Jackson? Quick Facts Early Life Baseball Career Black Sox Scandal and Ban Stats Later Years, Death, and Reinstatement Movies Quotes Who Was Shoeless Joe Jackson? Joe Jackson, known as Shoeless Joe, was one of baseball’s earliest superstars. He earned his nickname before turning pro by once playing in stockings when his baseball shoes weren’t broken in. He played in the MLB from 1908 through 1920 and had his best seasons with Cleveland and the Chicago White Sox. His .356 career batting average remains one of the highest ever, but Jackson was banished from the sport for his alleged involvement in fixing the outcome of the 1919 World Series. He died in December 1951 at age 64. In May 2025, the MLB posthumously reinstated Jackson, making him eligible for the Baseball Hall of Fame. Quick Facts FULL NAME: Joseph Jefferson Jackson BORN: July 16, 1887 DIED: December 5, 1951 BIRTHPLACE: Brandon Mills, South Carolina SPOUSE: Katie Wynn Jackson (1908–1951) ASTROLOGICAL SIGN: Cancer Early Life Joseph Jefferson Jackson was born on July  16, 1887, in Brandon Mills, South Carolina. According to the Shoeless Joe Jackson Museum and Baseball Library , he was the oldest of eight children born to George and Martha Jackson. The couple had six sons and two daughters. The family never had any money. At the age of 6, Joe, who never went to school and was  illiterate his entire life, worked at a cotton mill. The company’s baseball team eventually changed the trajectory of Joe’s life. By his early teen years, the gangly boy was already a  superb baseball player, dominating older athletes while competing for the  mill team. It was during this time that Joe earned the nickname that  would stick for life. He hit a base-clearing triple  after forgoing a pair of baseball spikes that had started to irritate  his feet. From then on, most everyone called him “Shoeless Joe.” Baseball Career Getty Images Shoeless Joe Jackson hit .356 during his professional career. In 1908, the Philadelphia A’s purchased Shoeless Joe Jackson’s contract for $325 from the Greenville Spinners, a semi-pro team. While a country boy at heart,  Jackson quickly grew accustomed to his new city life and playing in the  big leagues. He was traded to the Cleveland franchise prior to the 1910 season. In 1911, his first season as a full-time player, Jackson and his  trusty bat, Black Betsy, slugged a career-high .408 average, banging out 19 triples  and 45 doubles. The next season it was much the same. Jackson’s  abilities were such that he drew praise from the mercurial Ty Cobb and  even Babe Ruth , who gushed: “I copied Jackson’s style  because I thought he was the greatest hitter I had ever seen, the  greatest natural hitter I ever saw. He’s the guy who made me a hitter.” Other Baseball Greats Jackie Robinson Joe DiMaggio Lou Gehrig Mickey Mantle Barry Bonds A little more than halfway through the 1915 season, Jackson was on the move  again, this time courtesy of a trade from Cleveland to Chicago, where  the outfielder suited up for the White Sox. In 1917, Jackson helped lead  the club to a World Series title. Black Sox Scandal and Ban During the 1919 season, it looked as though Jackson and the White Sox  would again finish the season as champs. The club steamrolled through  the competition, with Jackson hitting .351 and knocking in 96 runners. But for all the team’s success, the club’s owner, Charles  Comiskey, preferred to underpay his players and not deliver promised  bonuses. Disgruntled and angry, eight members of the team, including Jackson,  were accused of accepting payments for throwing the 1919 World Series against the  Cincinnati Reds. Jackson later denied he knew about the fix and said his name had been given to the conspirators without his consent to participate in the scam. For Jackson’s part, the hard-hitting ballplayer was promised $20,000, a  significant bump in pay from his $6,000 salary. Still, Jackson’s stellar performance in the series didn’t quite add-up. Over the course of the  eight-game series, which Cincinnati won five games to three, Shoeless  batted .375, including an impressive .545 in the contests the White  Sox won. The batting stats were the highest of any player on both teams. But not everything went as planned as far as the money promised. Jackson only received $5,000 for the fix and said later that he tried to return the money. He signed a confession stating he had accepted the money but later claimed that he didn’t understand the confession and that the team’s attorney had taken advantage of his illiteracy. Nonetheless, when the fix was discovered, all eight  players were brought to trial. Jackson and his teammates were all  acquitted but, in 1920, baseball’s newly appointed commissioner, Judge  Kenesaw Mountain Landis, banned the group from the sport for life. Jackson’s stellar MLB career was over after 13 seasons. Stats While the Black Sox Scandal tarnished his legacy and cut his career short, Jackson is still considered one of the greatest hitters in baseball history. His .356 career batting average ranks fifth all-time behind only Josh Gibson, Ty Cobb, Oscar Charleston, and Rogers Hornsby. Here is a rundown of his career stats in key categories: At-bats: 4,981 Batting average: .356 Hits: 1,772 Runs scored: 872 Home runs: 54 RBIs: 792 Stolen bases: 202 Later Years, Death, and Reinstatement After his playing career ended, Jackson and his wife, Katie Wynn Jackson, retired to Greenville, South Carolina, to help care for his ailing mother. Shoeless and Katie had married in 1908. “The popular center fielder of the local team made the greatest home run of his career on Sunday. The home run was made on Cupid’s diamond and the victory was a fair young lady,” a news report read . The couple never had children. In Greenville, Shoeless operated a number of businesses, including a pool parlor and a liquor store. Still, he never gave his quest to be reinstated into his former sport, hoping that he could one day be inducted into the Baseball Hall of Fame. He didn’t live to see it happen. Jackson died of a heart attack on December 5, 1951, at his home in Greenville. He was 64 and survived by his wife. More than seven decades after his death, Jackson’s dream to be enshrined in Cooperstown received renewed potential. In May 2025, MLB Commissioner Rob Manfred announced he was reinstating Jackson and other deceased players from the permanently ineligible list after determining the players’ punishments should conclude upon their deaths. Jackson is now eligible for the Hall of Fame through the Classic Baseball Era Committee, which next meets in 2027 to consider candidates for the 2028 induction class. Movies Jackson is depicted in the movies Eight Men Out (1988) and Field of Dreams (1989) with D.B. Sweeney and Ray Liotta , respectively, portraying the player. Quotes I ain’t afraid to tell the world that it don’t take school stuff to help a fella play ball. God knows I gave my best in baseball at all times, and no man on earth can truthfully judge me otherwise. Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Tyler Piccotti News and Culture Editor, Biography.com Tyler Piccotti joined the Biography.com staff as an Associate News Editor and is now the News and Culture Editor. He previously worked as a reporter and copy editor for a daily newspaper recognized by the Associated Press Sports Editors. In his current role, he shares the true stories behind your favorite movies and TV shows and profiles rising musicians, actors, and athletes. When he's not working, you can find him at the nearest amusement park or movie theater and cheering on his favorite teams. Watch Next Advertisement - Continue Reading Below Baseball Players 10 of the Greatest Hispanic American Athletes Jackie Mitchell Struck Out 2 Baseball Legends Jackie Robinson The Activism of Jackie Robinson Advertisement - Continue Reading Below Hank Aaron Aaron Judge The Impressive Career of Baseball’s Shohei Ohtani How Babe Ruth Became a Cancer Pioneer Willie Mays 10 Rare Vintage Photos of Joe DiMaggio Deion Sanders 8 Negro League Legends Featured in a New MLB Game Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://www.elliott.org/company-contacts/trader-joes/",
      "text": "Trader Joe's Customer Service Contact Support Via Phone Email Exec Contacts - Elliott Report Skip to content Elliott Report Menu Menu Home Features Advocacy Destinations Problem Solved On Travel Safe Travels The Travel Troubleshooter Red List/Green List Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Christopher Elliott’s books Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Get Help Elliott Report Menu Home Features Advocacy Destinations Problem Solved On Travel Safe Travels The Travel Troubleshooter Red List/Green List Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Christopher Elliott’s books Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Trader Joe’s Customer Service Contacts Trader Joe’s, named after its founder Joe Coulombe, is a privately held grocery store chain in the United States. How to reach a person at  Trader Joe’s Main : (626) 599-3700 Fax: (6 26) 301-4431 traderjoes.com Trader Joe's Responsiveness rating 3/5 The Elliott Responsiveness Rating scores companies based on how responsive they are to customers. Here's more information about our ratings. Want to know which companies have the best -- and worst -- customer service? Check out our Red List and Green List. What you need to know about Trader Joe’s The company responds to most customer complaints in a satisfactory manner. How to resolve a problem with Trader Joe’s This guide on how to solve a customer service problem will help you resolve most problems with the company. You can also refer to the executive contacts below or contact our advocacy team directly . Note: If you’re having customer service trouble, please use our proven methods for fixing any consumer problem before contacting a manager. We care about accuracy. If any of the following email addresses bounce back or the phone numbers are incorrect, please report it to us immediately through this form. Trader Joe’s mailing address Trader Joe’s 800 South Shamrock Avenue Monrovia, CA  91016 Trader Joe’s executive customer service contacts Primary Contact Nicole High Director, Customer Relations Communication 800 South Shamrock Avenue Monrovia, CA  91016 nhigh@traderjoes.com LinkedIn Secondary Contact Mitch Heeger Executive Vice President Marketing and Merchandising 800 South Shamrock Avenue Monrovia, CA  91016 mheeger@traderjoes.com LinkedIn Jon Basalone President, Stores 800 South Shamrock Avenue Monrovia, CA  91016 jbasalone@traderjoes.com LinkedIn Chief Executive Bryan Palbaum 800 South Shamrock Avenue Monrovia, CA  91016 bpalbaum@traderjoes.com (626) 599-3700 Frequently asked questions about Trade Joe's What is Trader Joe's? Trader Joe’s is a popular grocery store chain in the United States. What is the email format for Trader Joe's? The official email format of Trader Joe’s usually follows the pattern of firstnameinitial.lastname@traderjoes.com. and [first_initial][last_name]@traderjoes.com. What company owns Trader Joe's? Trader Joe’s is owned by Aldi Nord, a German company. How long does it take for Trader Joe's to contact you? Trader Joe’s typically responds to inquiries within a day. Does Trader Joe's ship online? Trader Joe’s products are not available for online purchase or nationwide shipping. The products can only be found in physical stores. Who is the CEO of Trader Joe's? The current CEO of Trader Joe’s is Bryan Palbaum . Is Trader Joe's owned by Walmart? No, Trader Joe’s is not owned by Walmart. It is owned by Aldi Nord. How can I contact Trader Joe's customer service? Call (626) 599-3700 . What are the customer service hours for Trader Joe's? Monday to Friday, 6 a.m. to 6 p.m. Pacific time. How can I find the nearest Trader Joe's store? You can find the nearest Trader Joe’s store by using the Store Locator tool on the Trader Joe’s website. How can I find out if a product is available at my local Trader Joe's? Availability of products can vary by location. Call your local Trader Joe’s store directly to inquire about specific products. Does Trader Joe's offer online shopping or delivery services? As of now, Trader Joe’s does not offer online shopping or delivery services. It focuses on providing in-store shopping experiences. How to get professional help with your Trader Joe's problem If you need help with Trader Joe's, you can contact our advocacy team or just click the \"Get Help\" button. For immediate assistance, you can also send us a message on our Facebook group . Note : We do not charge for our advocacy. Get Help DISCLAIMER: The names, numbers and email addresses on this page are provided for informational purposes and are believed to be reliable. However, they should in no way be construed as a guarantee of their accuracy by Elliott.org. Company executives change their email addresses and phone numbers frequently to avoid contact with customers. If an email address bounces or a phone number is wrong, please report it to us immediately through this form. 128960 This contact was published on March 9, 2024 and updated on May 15, 2025. What's Your Problem? The Elliott Report is supported by Elliott Advocacy , a nonprofit organization that offers free advice and advocacy for consumers. If you need help with any problem, please contact us through this form . We’re always here to help. Get Help Company Contacts We publish the names and emails of customer service managers. Check out our directory. Uber Lyft Paypal Amazon Airbnb See all contacts Subscribe to our free newsletter Check out Elliott Advocacy Today , our free, daily newsletter with links to your favorite commentary, tips and news about consumer advocacy. You’ll also connect with other readers who want to make the world a better place. Name (Required) Email (Required) CAPTCHA Δ Most Popular Downgraded on my flight from Sydney to Tokyo. Why won’t Booking.com refund my money? This is the most dangerous room in a hotel Help! Someone stole 200,000 Chase points, and I can’t get them back Passengers are missing their summer flights. Here’s how to avoid being left behind Ultimate Guides The ultimate guide to finding your lost luggage Here’s your insider guide to spring break travel in 2025 Here’s your ultimate guide to holiday travel Eat this! The ultimate guide to travel food Advocacy They found toxic mold in their Vrbo rental — can they get $19,500 back? I paid for unlimited airport parking. Then the company changed its rules. StubHub charged me $747 in fees after Adele postponed her concert. But it promised not to! Tricked into a Palladium membership: My honeymoon nightmare More from Elliott Confidential CONSUMER ALERT: U.S. drops proposed airline compensation rule September 8, 2025 by Christopher Elliott The government would have required airlines to compensate you for flight delays. Here's what it means for your next trip. Are you becoming the passenger everyone hates? September 7, 2025 by Christopher Elliott By removing seatback screens, airlines unleashed a cacophony of leaky headphones and bright laptops. Here's how not to be part of the problem. Loire Valley Confidential: Our visit to a French Château September 6, 2025 by Christopher Elliott In this podcast: Our adventures at Château de Candes, a private chef experience in Paris, and yes, we've turned into a food podcast (recorded 9/5/25 in Paris) Airlines want to end consumer protections. Do they have a point? September 5, 2025 by Christopher Elliott U.S. carriers are trying to roll back decades of regulations that cover everything from refunds to fare transparency. Should the government allow it? AI Anxiety: Is the algorithm out to get you? August 31, 2025 by Christopher Elliott How travel companies use AI as a digital pickpocket — and how you can fight back What’s Your Problem? If you have a consumer problem, please contact our team at Elliott Advocacy through this form . We’re always here to help. Our help is free. Get Help Our Newsletter Check out Elliott Advocacy Today , our free, daily newsletter with links to your favorite commentary, tips and news about consumer advocacy. Did we mention it's free? Sign Up What's This Site? The Elliott Report is a consumer news site supported by Elliott Advocacy , a nonprofit organization that offers free advice and advocacy for consumers. Join Us Follow Us © 2025 Elliott Report | Privacy Policy Home Features Advocacy Problem Solved On Travel The Travel Troubleshooter Ultimate Consumer Guides Company Contacts Sites Elliott Advocacy Elliott Confidential EA Facebook Group Newsletters Elliott Advocacy Today (Daily) Elliott Confidential (Premium) Elliott’s E-Mail (Weekly) Media Leads (Weekly) Advocacy About Contact Us Get Help Close Search for: Don't Miss a Story! Our award-winning daily newsletters keep you posted on our random acts of consumer advocacy. Plus, we have insightful letters, insider tips, and more. Invalid email address Thanks for subscribing!"
    },
    {
      "url": "https://www.legistorm.com/person/bio/267934/Joseph_S_Katz.html",
      "text": "Joe Katz - Previously held position: Sen. Elizabeth Warren (D-MA) (Sept. 2018-April 2021), Systems Administrator - Biography | LegiStorm Home Solutions Industries Media Congress Government Relations Grassroots Advocacy Research Job Searching Products CongressStorm Overview Buy Staff Contact Lists Congress by the Numbers Find a Member Official Expenses Salaries Turnover Townhalls Premium Documents Buy Policy Reports Congressional Record Search Premium Earmarks (2008-2010) Financial Disclosures Foreign Gifts Pro Privately Funded Travel Pro LobbyStorm Overview New Filings Premium Client Search Premium Lobbyist Search Premium Revolving Door Premium Top Lobbying Firms Premium StateStorm Overview State Legislators Premium State Legislative Staff Premium State Executive Staff Premium StormFeed Congressional, Federal and State Press Releases Pro Pricing Resources News Caught Our Eye DevBlog Weekly Newsletters Subscriptions Mobile App Subscribe Now About About LegiStorm About Our Data LegiStorm in the News Media Kit Contact Claim Your Page Contact Us Call Us: 202-360-4172 Request Demo Start Free Login Forgot Password Don't have an account? Register now! Menu Search Account LegiStorm » Get LegiStorm App » Get LegiStorm Pro Free Demo Weekly Updates LegiStorm is constantly adding new information on the people, places and reports in our database. In the past week, LegiStorm added: 678 new people 109 new organizations 552 new photos 1822 job history records for people in our database 460 education records for people in our database 1625 contact addresses, emails and URLs (LinkedIn, Facebook, etc.) 5 new people through the revolving door 122 new policy reports 224 new trips to our privately funded travel database 52 new personal financial disclosures 22169 new press releases 17 new town halls 52 new hearings Caught Our Eye Rss Disclosures vary sharply for Bahrain, Saudi trip by Caleb Mynatt on 09/08/2025 Citigroup vet deposits expertise into finance committee by Sean McGlinn on 09/04/2025 GOP dominates alumni ranks of Top 25 football schools by Caleb Mynatt on 09/02/2025 Physicians' group prescribes lobbying for health policy by Sean McGlinn on 08/29/2025 Lobbyist swaps derivatives policy for House fintech job by Sean McGlinn on 08/28/2025 » More from Caught Our Eye Social Media Follow @LegiStorm DevBlog Rss LegiStorm adds House Q2 salaries and expenses 2025-09-04 Latest Senate salary and expense records published 2025-06-20 LegiStorm adds House Q1 salaries and expenses 2025-06-10 LegiStorm adds House Q4 salaries and expenses 2025-03-05 » More from our DevBlog Report inaccuracy on page Joe Katz Is this you? Claim this page to update your photo and bio info. Summary Salaries Disclosures Analytics Non-Salary Payments Trips Personal Finances Lobbying Lobbyist Overview Client Overview Registrant Overview LDA Filings FARA Filings Gifts StormFeed More … Less … Biographical Subscribers to LegiStorm Pro see biographical and contact information about Joseph S. Katz (Joe), including gender and hometown. Click here to see more LegiStorm Pro benefits and subscribe, or log in to your Pro account. Education Subscribers to LegiStorm Pro see an education history for Joseph S. Katz (Joe). All college degrees and activities we have listed for Joseph S. Katz (Joe) will be available to LegiStorm Pro subscribers. Click here to see more LegiStorm Pro benefits and subscribe, or log in to your Pro account. Employment History Subscribers to LegiStorm Pro see an employment history for Joseph S. Katz (Joe). Any jobs we have listed will show up here for LegiStorm Pro subscribers. Click here to see more LegiStorm Pro benefits and subscribe, or log in to your Pro account. Congressional Salary Subscribers to LegiStorm Pro see the salary paid to congressional aide Joseph S. Katz (Joe), graphed year by year to illuminate trends. Click here to see more LegiStorm Pro benefits and subscribe, or log in to your Pro account. Home About Us About Congressional Salaries Salaries FAQ Contact Us Privacy Policy Terms of Use Join Us © LegiStorm LegiStorm LLC 1025 Thomas Jefferson St. NW Suite 400 West Washington, DC 20007 (202) 360-4172 / congress@legistorm.com"
    },
    {
      "url": "https://trader-joes.pissedconsumer.com/customer-service.html",
      "text": "Trader Joes Customer Service Phone Number (833) 771-0299, Email, Help Center Skip to content PissedConsumer Reviews Categories All Categories Media Auctions and Marketplaces E-commerce Food Delivery Footwear and Clothing Gambling and Lotto Transportation and Logistics Companies All Companies Amazon Meesho Temu Google YouTube TV KukuFM Blinkit Write review For Business Login Food Stores Trader Joes 257 Customer Service Updated on 08/29/2025 Contact Trader Joes Customer Service Reviews 0 Contacts Q&A Advertisements Trader Joes Phone Numbers and Emails Toll-Free Number: (833) 771-0299 Call customer service Send Message Customer Service: (626) 599-3817 Legal: (833) 670-4649 Privacy Inquiries Trader Joes Emails: Jobs/ Career Legal Privacy Inquiries Is this your business? Advertisements Trader Joes Customer Service Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Trader Joes Customer Service is rated at 2.5 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 85% phone 15% email The best phone number to call Trader Joes is 8337710299 . 68% of consumers used this number to address their issues and concerns. It is also considered the best number to call, as 80% of customers reported contacting a real person successfully. The average hold time is less than 1 minute . The longest wait times are on Thursday , while the shortest are on Sunday . The average call time is 2 minutes . Be prepared for the call as Trader Joes may ask you for the following information to identify you as a customer: first and last name, phone number or email . View full overview › Trader Joes Overview The aggregated data is based on calls made from PissedConsumer.com website and questionnaires provided by PissedConsumer.com users. Trader Joes Customer Service is rated at 2.5 out of 5 . Consumers who contact the company are mostly dissatisfied . More commonly used way of contact is by phone . Source Distribution 85% phone 15% email The best phone number to call Trader Joes is 8337710299 . 68% of consumers used this number to address their issues and concerns. It is also considered the best number to call, as 80% of customers reported contacting a real person successfully. The average hold time is less than 1 minute . The longest wait times are on Thursday , while the shortest are on Sunday . The average call time is 2 minutes . Be prepared for the call as Trader Joes may ask you for the following information to identify you as a customer: first and last name, phone number or email . People call Trader Joes mainly because of product/ service, request for information and employment . 24% of the consumers who called the company’s customer support stated that their issues were resolved. Most customers feel very satisfied after talking to customer service representatives. The best email to contact Trader Joes is privacy@traderjoes.com . 95% of customers use this email address to address their issues and concerns. Customers evaluated the effort they needed to make to contact customer service as easy . Close How to Contact Trader Joes? Most Popular Number: (833) 771-0299 Total calls: 783 Issues resolved: 61 Last call: Sep 2, 2025 Rebecca A. Garland PissedConsumer Reporter What Is The Trader Joes Phone Number? While the company has numerous locations all over the United States, the main Trader Joes phone number is 626-599-3700. If you want to contact a certain location, check out the full list of Trader Joes locations in its “Locations by page” section. Can I Email Trader Joes Customer Service? The company allows customers to get in touch with Trader Joe's customer service to share their experience, ask a question or even request a store in a specific location. While there is no general Trader Joe’s email for consumers’ requests and feedback, the company has a couple of “Contact Us” forms on its website. To request a store in your city, go down the main page and click the “Contact Us” button. After that click the “Request a Trader Joe's in My City” button to get redirected to the submission form. If you are a customer who wants to share their experience and leave feedback, click the “Store & Crew Feedback” button. If you want to leave feedback about a specific product you bought, you need to click the “Product Feedback” button. Each of the submission forms has fields to be filled out. After you provide all the requested information, your inquiry will be forwarded directly to the Trader Joe’s customer service team. Where Is Trader Joes Headquarters Located? Company headquarters is located in Monrovia. Trader Joe’s address is 800 South Shamrock Avenue, Monrovia, CA 91016, USA. You can use this address for contacting the company via regular mail. To get faster assistance, call the company by phone or leave your request via the “Contact Us” form. What Are The Trader Joes Business Hours? As Trader Joes has numerous locations in different states, business hours of each specific store may differ. Generally the stores are open from 8 am till 9 pm. The company has stores in Alabama, Idaho, Kansas, New York, Tennessee, Vermont, and other states. To verify business hours of a certain location, check out the “Stores” page. Contact Information Trader Joes Website: www.traderjoes.com Trader Joes Help Center: Visit contact page Corporate Office Address: Trader Joe's 800 S. Shamrock Ave. Monrovia, California 91017-7149 United States Help in Social Networks: Facebook Pinterest Instagram Twitter Linkedin Youtube Other Info (opening hours): Alternative Mailing Address: Trader Joe’s PO Box 5049 Monrovia, CA 91017-7149 More contact details Trader Joes Customer Service Reviews 2.5 / 5 Average See all 257 reviews Angelli Esm Feb 5, 2025 You have discontinued your blintzes, one of my all time favorites. 5.0 I never found out why the product was discontinued or whether it or a similar item will be available in the future. The person I talked to didnt seem to have any information. Read full review Xochilt Yop Jan 29, 2025 Foul product 4.0 The product I purchased was very ill tasted. I kept it frozen from the store to my freezer. But it had a taste that it was not fresh Read full review Tashema Qac Jan 3, 2025 No resolution 5.0 Just an opportunity to tell of a bad experience with a long black hair in my frozen quiche that I purchased Read full review Tzirel Ebo Dec 23, 2024 Info about flowers 5.0 Needed to know if flowers were organic or not. Customer service person was helpful and friendly. She answered my question and gave good info. Read full review How Good is Trader Joes's Customer Service? Elika Efp Elika Efp Feels Satisfied | Aug 16, 2024 12445 Read full quote Geraldo Uks Geraldo Uks Feels Satisfied | Jul 14, 2024 I just had a question about a particular salad and why it didn’t indicate that it had been triple washed. I love Trader Joe’s. Read full quote Shaylene Clh Shaylene Clh Feels Satisfied | Jun 09, 2024 I called the stor. Cs online weird to navigate. Needed to find out bout recall on cream cheese which i just purchased 2 blocks. Read full quote Vanilla Sxh Vanilla Sxh Feels Satisfied | May 03, 2024 She gave me the info I needed, courteous Read full quote Letoya Dyo Letoya Dyo Feels Neutral | Mar 15, 2024 They were polite but not.helpful in offering me compensation Read full quote Thorin Sxl Thorin Sxl Feels Disappointed | Mar 02, 2024 No response at all from them I acceptable Read full quote Summary of Trader Joes Customer Service Calls 1.1K TOTAL CALLS 02:13 AVG CALL DURATION 24% ISSUES RESOLVED Top Reasons of Customers Calls Consumers Call the Most From Why Do People Call Trader Joes? Product/ Service Question: 7d ago “Mold in products bought two days ago” 29d ago “Product expiration question” 5M ago “Expiration date questio” Request for Information Question: 28d ago “Fit bit information” 1M ago “Would like to find out about products” 1M ago “I am not a pissed off customer. I'm calling about a product that, I feel, should be recalled..” Employment Question: 4M ago “Job inquirie for a store opening soon” 5M ago “W2” 6M ago “2023 w2” Payments and Charges Question: 3M ago “Store credit” 6M ago “Trader Joe Charged me for something i didn’t even buy” 7M ago “Charge” Cards Question: 8M ago “Scratched off gift card pin” 8M ago “Lost gift card” 11M ago “Issues with gift card” Staff Question: 5M ago “Customer service related” 7M ago “Rude and disrespectful employee in store” 8M ago “Customer service complaint” Shipping and Delivery Question: 11d ago “New store location” 5M ago “Store location” 6M ago “Wrong item scanned” Return/ Replace Question: 5M ago “Return” 6M ago “Return policy” 1Y ago “Denied return” Account Question: 8M ago “I lived in San Francisco for 30 years and loved Trader Joe’s. Now I live in Salisbury, MD and we have Salisbury university here. And I know you would do a great business in Salisbury,. Would you consider opening a store here? The ZIP Code is 21801.” 9M ago “Gym Membership” 11M ago “Can't determine balance on gift card” Website/ Application Question: 9M ago “I sent an application to the wrong store” 1Y ago “Application fot truck driver” 2Y ago “Stevia when sold by itself is not taxable. Per California web site” Refund Question: 8M ago “Refund not received” 8M ago “Refund” Activation/ Cancellation Question: 3Y ago “Wrongfully terminated” Other Question: 21d ago “L9cation for interviews for new store in Myrtle beach” 1M ago “Scam?” 1M ago “Phone number” Compare Trader Joes Customer Service To Companies are selected automatically by the algorithm. A company's rating is calculated using a mathematical algorithm that evaluates the information in your profile. The algorithm parameters are: user's rating, number of resolved issues, number of company's responses etc. The algorithm is subject to change in future. Sprouts Farmers Market Customer Service 1.7 out of 5 Whole Foods Market Customer Service 1.8 out of 5 Stop And Shop Customer Service 2.1 out of 5 Write a review Do you have something to say about Trader Joes? What happened? What can we help you with? Submit review Don't show this popup Call Company Send Message Trader Joes Reviews Contacts Q&A Write a review About About PissedConsumer Press Page Blog FAQ for Consumers FAQ for Companies Careers Contact PissedConsumer Browse Companies Reviews Categories State Attorneys General Contacts Services Business Solutions List your Business Tips For Consumers Tips For Companies PissedConsumer Club Advertise with us Legal Privacy Policy Terms Of Use Legal Information Dispute Resolution (LVP Program) facebook youtube linkedin twitter tiktok PissedConsumer            © 2025 All\n            Rights Reserved Are you sure you want to leave Trader Joes contact page? Contact Trader Joes Contact PissedConsumer Terms of Service I agree to TOS Cancel"
    }
  ]
}