{
  "fuentes": [
    {
      "url": "https://joiabeachmiami.com/privacy-policy/",
      "email": "reservations@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/",
      "email": "reservations@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/main-menu/",
      "email": "reservations@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/events-contact/",
      "email": "reservations@joiabeachclub.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "info.sbr@sugarbeachmauritius.com"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "email": "reservations.sugarbeach@yoursunlife.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "aberdeenbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "chehalisbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "longbeachbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "oceanparkbookings@greatnwfcu.com"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "email": "raymondbranchbookings@greatnwfcu.com"
    },
    {
      "url": "https://joiabeachmiami.com/careers/",
      "email": "careers@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/careers/",
      "email": "careers@joiabeachmiami.com"
    },
    {
      "url": "https://joiabeachmiami.com/careers/",
      "email": "reservations@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/contact/",
      "email": "careers@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/contact/",
      "email": "lounge@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/contact/",
      "email": "reservations@joiabeachclub.com"
    },
    {
      "url": "https://clinicajoia.com/contact-us/",
      "email": "info@clinicajoia.com"
    },
    {
      "url": "https://joiabeachmiami.com/event-inquiries/",
      "email": "reservations@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/make-a-reservation/",
      "email": "careers@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/make-a-reservation/",
      "email": "lounge@joiabeachclub.com"
    },
    {
      "url": "https://joiabeachmiami.com/make-a-reservation/",
      "email": "reservations@joiabeachclub.com"
    }
  ],
  "mails": [
    "aberdeenbranchbookings@greatnwfcu.com",
    "careers@joiabeachclub.com",
    "careers@joiabeachmiami.com",
    "chehalisbranchbookings@greatnwfcu.com",
    "info.sbr@sugarbeachmauritius.com",
    "info@clinicajoia.com",
    "longbeachbookings@greatnwfcu.com",
    "lounge@joiabeachclub.com",
    "oceanparkbookings@greatnwfcu.com",
    "raymondbranchbookings@greatnwfcu.com",
    "reservations.sugarbeach@yoursunlife.com",
    "reservations@joiabeachclub.com"
  ],
  "nombre_sitio": "joiabeachmiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://joiabeachmiami.com/privacy-policy/",
      "text": "Privacy Policy - Joia Beach Restaurant & Beach Club On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact Privacy Policy joia beach privacy policy Joia Beach Privacy Notice​ Updated: january 2020 This privacy policy (“policy”) will help you understand how Joia Beach (“us”, “we”, “our”) uses and protects the data you provide to us when you visit and use www.joiabeachmiami.com (“website”, “service”). We reserve the right to change this policy at any given time, of which you will be promptly updated. If you want to make sure that you are up to date with the latest changes, we advise you to frequently visit this page. Information collection, use and sharing We only have access to collect information that you voluntarily give us via email or direct contact from you via our contact forms. We will not sell or rent this information to anyone.  We will use your information to respond to you, regarding the reason you contacted us. Links to Other Websites Our website may contain links that lead to other websites. If you click on these links, we are not held responsible for your data and privacy protection. Visiting those websites is not governed by this privacy policy agreement. Make sure to read the privacy policy documentation of the website you go to from our website. Contact Us If you have any questions regarding our privacy policy, please contact Joia Beach Customer Support as follows, email: hello@joiabeachclub.com Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://joiabeachmiami.com/",
      "text": "Joia Beach Miami – Waterfront Dining, Drinks & Private Events On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact Your browser does not support HTML5 video. Welcome to Joia Beach — a hidden enclave in the heart of miami , where city energy meets coastal serenity. Nestled between the rhythm of the city and the beauty of nature, our vibrant restaurant and beachfront oasis invites you to indulge, unwind, and experience the magic. The Restaurant Enjoy a culinary escape on the sand or under our palapa. The restaurant blends refined European flavors with vibrant Miami energy. Dine under swaying palms, sip craft cocktails, and savor dishes made to match the view. Explore More The Beach Club Where days stretch long, and the soundtrack never stops. The Beach Club is your beachfront paradise — complete with plush beach chairs and cabanas, shoreline food & beverage service, and water access. Explore More The Beach Lounge Just steps from the shoreline, The Lounge offers a more intimate way to unwind. Sink into our loungers in the sand, indulge in cocktails and bites, and be immersed in the music of DJs, live entertainers and more! Explore More On the Menu Freshly-sourced seasonal ingredients are the core of joia beach’s culinary program, where classic techniques meet modern influences. Private Events Perfect for sunset cocktail affairs, waterfront private dinners, and elegant outdoor galas, joia beach offers seasonally-inspired cuisine, friendly refined service, and fresh handcrafted cocktails. Inquire Now Event Spaces Gallery PARKING Valet is available for $20 Ride sharing is encouraged Self-parking is only available at Jungle Island ARRIVALS BY YACHT Arrivals by yacht are not permitted at this time. PETS With the exception of service animals, no pets are allowed. Service dogs must be housebroken as well as harnessed, leashed, or tethered to their accompanying individual. JET SKIS Jet skis are not permitted DRESS CODE At Joia Beach , we embrace a European-inspired, upscale beach chic dress code to maintain the elevated experience our guests expect. Proper attire is required for entry, and management reserves the right to refuse access or ask guests to leave if dress code guidelines are not followed. Joia Beach has 3 main areas, the restaurant, the lounge, and the beach club. While we understand that guests visiting our beach may be dressed in beachwear, we ask that appropriate cover-ups be worn when entering the venue. Swimsuits are only permitted within the beach club & lounge areas. Shirts, bottoms, and shoes are required in the restaurant. Note that fishnet cover-ups, offensive clothing, athletic apparel, hoodies, sweatpants, tank tops, cargo pants and slides worn with socks are not permitted in any area of the venue . We appreciate your cooperation in helping us create a refined environment for all. Mailing List Sign up to receive joia beach news, updates, events and invitations Please enable JavaScript in your browser to complete this form. First Name * Last Name * Email * Submit Happenings Social Club It is here that you'll discover , exclusive interviews with the people who make up the heartbeat of our hidden oasis , insider features, and the cultural narrative that is uniquely joia beach. Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility ×"
    },
    {
      "url": "https://joiabeachmiami.com/main-menu/",
      "text": "Joia Beach Miami Menu – Gourmet Bites, Seafood & Cocktails On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact On the Menu Sun Kissed Flavors of Europe Experience a carefully curated menu with seasonal specials A Culinary Escape Welcome to Paradise—a refined dining experience inspired by the vibrant, sun-kissed flavors of the Mediterranean. Our thoughtfully curated menu invites you to slow down and savor every bite, from traditional Greek spreads and fresh crudos to handmade pastas and expertly crafted dishes from land and sea. Each plate blends bold flavors with elegant simplicity, creating a truly soul-nourishing experience. Our Menu Miami Spice Sunset Hour Sweet Escape Lunch Lounge & Beachclub Cocktails Riviera Brunch Our Cocktails Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://joiabeachmiami.com/events-contact/",
      "text": "Joia Beach Event Spaces – Stunning Private Parties & Moments On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact Your browser does not support HTML5 video. Host Your Event For large groups over 10 people in size only Special Events at Joia Beach Perfect for sunset cocktails, waterfront dinners, and elegant outdoor galas, Joia Beach offers seasonally inspired cuisine, refined service, and fresh handcrafted cocktails. Our events team ensures seamless planning from start to finish, having worked with top clients across luxury, fashion, crypto, and entertainment. We host group dining, semi-private events, and full buyouts for up to 500 guests on our bayfront property. Boho vibes meet upscale luxury, with lush walkways and Tulum-inspired décor creating a magical, one-of-a-kind setting. Whether a wedding, corporate function, or brand activation, Joia Beach is your ideal event destination. Inquire Now Explore our Spaces click each area to view our event galleries Restaurant Palapa Beach Lounge Palapa Bar Terrazzo Chef's Corner The Canopy Shoreline  / Beach Club Secret Beach  Reception Space* Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.yoursunlife.com/sugarbeachmauritius/contact-us/",
      "text": "Contact Us | Sugar Beach, Luxury Mauritius Resort Explore the resorts Back The Resort Rooms & Suites Deluxe Sea View Room Deluxe Beach Front Room Premium Sea View Room Premium Beach Front Room Family Room Premium Suite Premium Accessible Room Executive Beach Front Suite Offers Restaurants & Bars Wellness & Fitness Golf Experiences & Activites Weddings Wedding Packages Legal Requirements Meetings & Celebrations Venue spaces Conferences Parties & Celebrations Gift Voucher Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs Location Day Pass Contact Us EN FR DE Day Pass Location Gift Voucher Contact Us Book Now Book Now Home Sugar Beach Contact Us Have a Question? Instantly get answers to your questions. Just send us a WhatsApp message. Using a laptop but prefer to chat on your mobile? No problem! Simply scan the QR code to start the conversation. Get in touch Call, email or complete our form Our team will get back to you and we look forward to welcoming you to experience Sugar Beach. Address Wolmar Flic en Flac Mauritius For More Information: Call on: +230 403 3300 For Reservations: Call on: +230 402 0151 or Email: reservations.sugarbeach@yoursunlife.com topic General Enquiry Wedding Enquiry Meeting Enquiry Dining Enquiry Spa Enquiry I AGREE TO THE TERMS & CONDITIONS Submit Newsletter Sign Up First Name Email Address * Website_Visitor Sunlife Sugar Beach Long Beach Ambre La Pirogue I agree to the privacy policy Sustainability Financial Information & Governance Mobile App Reviews Gift Voucher Members Club Join the Team Awards Cookie Policy Privacy Policy © Copyright Sun life 2022 Sugar Beach Wolmar, Flic en Flac, Mauritius Tel: +230 403 3300 Email: info.sbr@sugarbeachmauritius.com Website by 80 Days Resorts Sunlife Sugar Beach Long Beach La Pirogue Ambre Anahita Golf & Spa Resort Anahita Golf Ile aux Cerfs"
    },
    {
      "url": "https://www.greatnwfcu.com/contactus",
      "text": "Contact Us Free Community Shred Day to be held at our Aberdeen, Raymond and Long Beach branch locations - Saturday, September 20th from 9AM to Noon. Bring your sensitive documents and mail to be securely destroyed on-site. Donations of canned goods for local food banks will be accepted. Close Alert Go to main content Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Search: Online Banking Login Login Username Register Bank Borrow Manage Discover Spend Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Share Savings HSAs Youth Accounts Christmas Club Investment Accounts Money Market IRAs Certificates Business Accounts Retirement & Investment Services Savings Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Loans Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Access Online Banking Mobile Banking EasyPay Protection Insurance Estate Planning Loan Payment Options Business Services Card Services Courtesy Pay Order Checks Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More About Us About Great NorthWest FCU Become a Member Membership Benefits Buy Local Spend Local Promotions Refer a Friend Career Opportunities Get Help Contact Us Frequently Asked Questions Disclosures & Agreements Provide Feedback Rates Locations Locations & ATMs Financial Education Great NorthWest Insider Great NorthWest Scholarships Credit Score Refer a Friend! Great adventures—and great credit unions—are better with friends. When you refer someone to Great NorthWest FCU, you both get rewarded! Learn More Contact Us We're here when you need us. Have a question or need a hand? We’re here to help. Reach out by phone, text, email, or visit us in person—our team is ready to support you, wherever life takes you. Contact Us Quick Question? Get a quick answer during business hours. Text 3605339990 and a Member Service Representative will reply! Need a notary? Want to open a Safe Deposit Box? Have questions about filing a cardholder dispute? Skip the line at your local branch and Schedule an Appointment ! * Required Fields First Name: Last Name: Email Address: Message: Are you a current member of Great NorthWest FCU? Yes No Branch Information Filter by City All Cities All Cities Aberdeen, WA Chehalis, WA Long Beach, WA Ocean Park, WA Raymond, WA Filter by Service All Services All Services Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Aberdeen Branch 301 W. Wishkah Street Aberdeen, WA 98520 Get Directions Phone: 360-533-9990 TTY: 1-800-533-8396 Email Us Schedule an Appointment 24-Hour Drive-Thru ATM located across the street at 320 W. Wishkah St. You can also visit our Great NorthWest Financial Center. Located at 331 W. Wishkah St., this office houses our Retirement & Investment Services along with Mortgage and Business Lending. Lobby Hours: Mon: 9am - 6pm Tue: 9am - 6pm Wed: 9am - 6pm Thu: 9am - 6pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 6pm Tue: 8am - 6pm Wed: 8am - 6pm Thu: 8am - 6pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru Safe Deposit Boxes Night Deposit Coin Counter Notary Services Chehalis Branch 1601 N.W. Louisiana Avenue Chehalis, WA 98532 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 8:30am - 5:30pm Tue: 8:30am - 5:30pm Wed: 8:30am - 5:30pm Thu: 8:30am - 5:30pm Fri: 8:30am - 6pm Sat: 9am - 1pm Sun: Closed On-site ATM Notary Services Long Beach Branch 705 Pacific Ave. S. Long Beach, WA 98631 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Ocean Park Branch 1409 251st Pl. Ocean Park, WA 98640 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive Thru Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: Closed Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Raymond Branch 327 Commercial Street Raymond, WA 98577 Get Directions Phone: 1-800-533-8396 Email Us Schedule an Appointment Lobby Hours: Mon: 9am - 5:30pm Tue: 9am - 5:30pm Wed: 9am - 5:30pm Thu: 9am - 5:30pm Fri: 9am - 6pm Sat: 9am - 1pm Sun: Closed Drive Thru Hours: Mon: 8am - 5:30pm Tue: 8am - 5:30pm Wed: 8am - 5:30pm Thu: 8am - 5:30pm Fri: 8am - 6pm Sat: 9am - 1pm Sun: Closed Drive-thru On-site ATM Safe Deposit Boxes Night Deposit Coin Counter Notary Services Go to main navigation Make it Great! Send Us A Message This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Call Center (360) 533-9990 (call or text) (800) 533-8396 Call Center Hours (PST) Monday - Friday: 8am - 6pm Saturday: 9am - 1pm Sunday: Closed Mailing Address 301 W. Wishkah St. Aberdeen, WA 98520 Routing Number: 325180333 Accessibility Statement Privacy Policy Disclosures Site Map © 2025 Great NorthWest Federal Credit Union Website by CUSG Facebook Instagram This Credit Union is federally-insured by the National Credit Union Administration. We do business in accordance with the Federal Fair Housing Law and the Equal Credit Opportunity Act. *APY=Annual Percentage Yield. **APR=Annual Percentage Rate. NMLS #401392 Search: Bank Checking Overview Great Value Checking Great Perks Checking Great Advantage Checking Platinum Plus Savings Accounts Investment Accounts Business Accounts Retirement & Investment Services Savings Rates Borrow Auto Loans Home Loans Personal Loans Credit Cards Business Loans Car Buying Service Skip-A-Payment Foreclosure Information Loan Rates Manage Online Banking Insurance Loan Payment Options Business Services Courtesy Pay Card Services Order Checks Discover About Great NorthWest FCU Become a Member Membership Benefits Promotions Career Opportunities Locations & ATMs Contact Us FAQs Provide Feedback Great NorthWest Insider Video Banking Apply for a Loan Become a Member Locations & ATMs Contact Us Google ReCaptcha Error"
    },
    {
      "url": "https://joiabeachmiami.com/careers/",
      "text": "Career Opportunities at Joia Beach Club Restaurant On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact Careers join the joia beach family JOIA BEACH RESTAURANT & BEACH CLUB 1111 PARROT JUNGLE TRAIL MIAMI FLORIDA 33132 we are located on the furthest west end of jungle island PHONE 305.400.7280 EMAIL careers@joiabeachclub.com JOIN OUR TEAM are you passionate about the hospitality industry? we strive to deliver the best food, beverage, and services to our guests at all times. if you are a professional, hard-working individual and think you would be a good asset to our team we would love to hear from you. please visit the link below to see currently available positions: JOIA BEACH CAREER PORTAL UPCOMING JOB FAIRS if no upcoming job fairs are listed below, feel free to contact us or visit the career portal for open positions. Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://joiabeachmiami.com/contact/",
      "text": "Contact Joia Beach Miami – Reservations, Events & Inquiries On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact Contact Us GET IN TOUCH Send us a message, we'd love to hear from you! JOIA BEACH RESTAURANT & BEACH CLUB 1111 PARROT JUNGLE TRAIL MIAMI FLORIDA 33132 We are located on the furthest west end of jungle island PHONE 305.400.7280 EMAIL Reservation & General Inquiries reservations@joiabeachclub.com Press Inquiries hello@joiabeachclub.com Join Our Team careers@joiabeachclub.com RESERVATION & GENERAL INQUIRIES please send all reservation and general inquiries to: reservations@joiabeachclub.com or please leave your information below and we will get in touch. Thank you for contacting us! We will reply as soon as possible! Please enable JavaScript in your browser to complete this form. Full Name * Phone Your Email * Your Message * Send By submitting your contact information, you will be subscribed to our joia beach mailing list. you may opt-out at any time About Hidden behind a picturesque pathway encompassed by lush jungle greenery and ambient lighting, sits Joia Beach , a day-to-night dining destination located in an exclusive enclave on Watson Island. here, sun-drenched sands, sweeping views of biscayne bay and the city skyline, and vibrant pink-hued golden sunsets await. Opened in 2020 and designed by Francois Frossard, Joia Beach has been hailed by condé nast traveler as one of \" the best beaches in Miami .\" Described as one of the best places in Miami Beach for \"those craving a slick beach scene away from Miami Beach’s masses,\" Joia Beach is Miami's ultimate hidden oasis. Perfect for sunset cocktails, waterfront dinners, and weekend festivities, Joia Beach has quickly become renowned as one of the best Miami beach clubs and restaurants in the magic city. European inspired bites and platters designed for sharing, handcrafted cocktails, and live djs and entertainment redefine South Beach dining and transport you to a place of pure joia . Information HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm PARKING & VALET Valet is available for $20 Ride sharing is encouraged Self-parking is only available at Jungle Island ARRIVALS BY YACHT Arrivals by yacht are not permitted at this time. PETS With the exception of service animals, no pets are allowed. Service dogs must be housebroken as well as harnessed, leashed, or tethered to their accompanying individual. JET SKIS Jet skis are not permitted GIFT CARD Purchase Gift Cards FAQs View Our FAQ's What is the dress code? At Joia Beach , we embrace a European-inspired, upscale beach chic dress code to maintain the elevated experience our guests expect. Proper attire is required for entry, and management reserves the right to refuse access or ask guests to leave if dress code guidelines are not followed. Joia Beach has 3 main areas, the restaurant, the lounge, and the beach club. While we understand that guests visiting our beach may be dressed in beachwear, we ask that appropriate cover-ups be worn when entering the venue. Swimsuits are only permitted within the beach club & lounge areas. Shirts, bottoms, and shoes are required in the restaurant. Note that fishnet cover-ups, offensive clothing, athletic apparel, hoodies, sweatpants, tank tops, cargo pants and slides worn with socks are not permitted in any area of the venue . We appreciate your cooperation in helping us create a refined environment for all. Can I bring my own food or beverages to the beach or restaurant? No external food or beverages are allowed to be brought on to the property. Can I shoot professional photography at joia beach? We do not allow professional photography on the beach or at the restaurant without prior approval. Joia Beach charges a location fee for photographers or brands who want to shoot on site. Can I bring my own decorations and balloons for a birthday party? No external decorations are allowed at Joia Beach without prior approval. Is there self-parking at joia beach? The only self-parking available is at Jungle Island’s main parking garage and the cost is $20. Is gratuity included? Automatic service charge of 20% will be added. 23% service charge will be added to groups of 11 or more Is smoking allowed? No tobacco, cigars or electronic cigarettes are allowed to be smoked under the palapa/inside the restaurant. Smoking is allowed in the designated areas on the beach only. Are children allowed? Children are more than welcome to join us during the day in the dining room, but Joia Beach is not a kid-friendly environment. Guests must be 21+ to enter the Beach Club and Lounge from Friday through Sunday. Are service animals allowed? In accordance with titles II and III of the ADA, Joia Beach welcomes service dogs only. Service dogs must be housebroken as well as harnessed, leashed, or tethered to their accompanying individual. With the exception of service animals that meet the federal government’s guidelines for animals trained to perform tasks for the benefit of an individual with a qualifying disability under the Americans with Disabilities Act (ADA), visitors are not permitted to bring animals on to joia beach property. Visitors may not bring any other animals onto Joia Beach property, including but not limited to pets or emotional support animals. Is there a corkage fee? We do not allow external alcohol to be brought on to the property. Is Joia Beach wheelchair accessible? Yes, we are wheelchair accessible and have ADA bathrooms on Jungle Island’s property right next door. How much is the valet? Our valet is $20 and can be paid with cash or a credit card. How many people does the restaurant seat? 120 people. What's the largest group number I can book for the restaurant? Parties over ten people fall under our large group dining agreements. Can I purchase gift cards for Joia Beach? Gift cards for Joia Beach restaurant may be purchased at the link here Are drones allowed at Joia Beach? Drones may not be operated or used at Joia Beach without prior approval from management under any circumstances. Does Joia Beach offer towel rentals? Yes! Towels are available for rent in our lounge for $15 each. In The Press View Press Coverage Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://clinicajoia.com/contact-us/",
      "text": "Contact Us - Clinica Joia Skip to content About Who are We? Our Specialists Non Surgical Treatments Face Dermal Fillers Expression Lines Treatment Thread Lifts Skin Attiva Intense Pulsed Light CO2 Laser Dermapen ® Microneedling Chemical Peeling PRP (Platelet Rich Plasma) Skin Mesotherapy (Skin Booster) Ultherapy Body Cellulite Liposculpture Plastic Surgeries Face Face and Neck Lift Rhinoplasty (nose job) Blepharoplasty (eye lift) Pinnaplasty (ear) Brow Lift Body Breast Augmentation Breast Lift (Mastopexy) Male Gynecomastia Abdominoplasty (Tummy Tuck) Liposuction Arm Lift Thigh Lift General Surgeries Laparoscopic Surgery Hernia Repair Sleeve Gastrectomy (Weight Loss) Gastric Bypass (Weight Loss) Gall Bladder Removal Haemorrhoid Removal Vein Treatment Microsclerotherapy Varicose Vein Ablation/Stripping News Contact Us Gift Vouchers € 0.00 0 Cart Search ... Results See all results € 0.00 0 Cart Get In Touch 66, Sir Adrian Dingli Street Sliema, Malta. +356 7931 7641 +356 2131 7641 info@clinicajoia.com Facebook-f Instagram Linkedin-in Contact Us Kindly fill in the form below and a member from our team will get in touch with you shortly. What service are you interested in? Submit Book a Consultation Get in touch 66, Sir Adrian Dingli Street Sliema, Malta. +356 7931 7641 +356 2131 7641 info@clinicajoia.com Facebook-f Instagram Linkedin-in Discover Home About Non Surgical Treatments Plastic Surgeries General Surgeries news Contact Us Gift Vouchers Clinic hours Monday 09:00 AM - 7:30 PM Tuesday 09:00 AM - 7:30 PM Wednesday 09:00 AM - 6:00 PM Thursday 09:00 AM - 7:30 PM Friday 09:00 AM - 6:00 PM Copyright © 2022 ClinicaJoia Privacy policy Shopping Cart Scroll to Top This website uses cookies to ensure you get the best experience on our website. By continuing browsing, you consent to the use of cookies and other technologies Accept learn more"
    },
    {
      "url": "https://joiabeachmiami.com/event-inquiries/",
      "text": "Event Inquiries - Joia Beach Restaurant & Beach Club On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact Event Inquiries for large groups over 10 people in size only please allow our team 24-48 hours to respond Private Event Software powered by Tripleseat Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://joiabeachmiami.com/make-a-reservation/",
      "text": "Contact Joia Beach Miami – Reservations, Events & Inquiries On The Menu Happenings Groups & Events Information & Contact Reservations On The Menu Happenings Groups & Events Information & Contact Contact Us GET IN TOUCH Send us a message, we'd love to hear from you! JOIA BEACH RESTAURANT & BEACH CLUB 1111 PARROT JUNGLE TRAIL MIAMI FLORIDA 33132 We are located on the furthest west end of jungle island PHONE 305.400.7280 EMAIL Reservation & General Inquiries reservations@joiabeachclub.com Press Inquiries hello@joiabeachclub.com Join Our Team careers@joiabeachclub.com RESERVATION & GENERAL INQUIRIES please send all reservation and general inquiries to: reservations@joiabeachclub.com or please leave your information below and we will get in touch. Thank you for contacting us! We will reply as soon as possible! Please enable JavaScript in your browser to complete this form. Full Name * Phone Your Email * Your Message * Send By submitting your contact information, you will be subscribed to our joia beach mailing list. you may opt-out at any time About Hidden behind a picturesque pathway encompassed by lush jungle greenery and ambient lighting, sits Joia Beach , a day-to-night dining destination located in an exclusive enclave on Watson Island. here, sun-drenched sands, sweeping views of biscayne bay and the city skyline, and vibrant pink-hued golden sunsets await. Opened in 2020 and designed by Francois Frossard, Joia Beach has been hailed by condé nast traveler as one of \" the best beaches in Miami .\" Described as one of the best places in Miami Beach for \"those craving a slick beach scene away from Miami Beach’s masses,\" Joia Beach is Miami's ultimate hidden oasis. Perfect for sunset cocktails, waterfront dinners, and weekend festivities, Joia Beach has quickly become renowned as one of the best Miami beach clubs and restaurants in the magic city. European inspired bites and platters designed for sharing, handcrafted cocktails, and live djs and entertainment redefine South Beach dining and transport you to a place of pure joia . Information HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm PARKING & VALET Valet is available for $20 Ride sharing is encouraged Self-parking is only available at Jungle Island ARRIVALS BY YACHT Arrivals by yacht are not permitted at this time. PETS With the exception of service animals, no pets are allowed. Service dogs must be housebroken as well as harnessed, leashed, or tethered to their accompanying individual. JET SKIS Jet skis are not permitted GIFT CARD Purchase Gift Cards FAQs View Our FAQ's What is the dress code? At Joia Beach , we embrace a European-inspired, upscale beach chic dress code to maintain the elevated experience our guests expect. Proper attire is required for entry, and management reserves the right to refuse access or ask guests to leave if dress code guidelines are not followed. Joia Beach has 3 main areas, the restaurant, the lounge, and the beach club. While we understand that guests visiting our beach may be dressed in beachwear, we ask that appropriate cover-ups be worn when entering the venue. Swimsuits are only permitted within the beach club & lounge areas. Shirts, bottoms, and shoes are required in the restaurant. Note that fishnet cover-ups, offensive clothing, athletic apparel, hoodies, sweatpants, tank tops, cargo pants and slides worn with socks are not permitted in any area of the venue . We appreciate your cooperation in helping us create a refined environment for all. Can I bring my own food or beverages to the beach or restaurant? No external food or beverages are allowed to be brought on to the property. Can I shoot professional photography at joia beach? We do not allow professional photography on the beach or at the restaurant without prior approval. Joia Beach charges a location fee for photographers or brands who want to shoot on site. Can I bring my own decorations and balloons for a birthday party? No external decorations are allowed at Joia Beach without prior approval. Is there self-parking at joia beach? The only self-parking available is at Jungle Island’s main parking garage and the cost is $20. Is gratuity included? Automatic service charge of 20% will be added. 23% service charge will be added to groups of 11 or more Is smoking allowed? No tobacco, cigars or electronic cigarettes are allowed to be smoked under the palapa/inside the restaurant. Smoking is allowed in the designated areas on the beach only. Are children allowed? Children are more than welcome to join us during the day in the dining room, but Joia Beach is not a kid-friendly environment. Guests must be 21+ to enter the Beach Club and Lounge from Friday through Sunday. Are service animals allowed? In accordance with titles II and III of the ADA, Joia Beach welcomes service dogs only. Service dogs must be housebroken as well as harnessed, leashed, or tethered to their accompanying individual. With the exception of service animals that meet the federal government’s guidelines for animals trained to perform tasks for the benefit of an individual with a qualifying disability under the Americans with Disabilities Act (ADA), visitors are not permitted to bring animals on to joia beach property. Visitors may not bring any other animals onto Joia Beach property, including but not limited to pets or emotional support animals. Is there a corkage fee? We do not allow external alcohol to be brought on to the property. Is Joia Beach wheelchair accessible? Yes, we are wheelchair accessible and have ADA bathrooms on Jungle Island’s property right next door. How much is the valet? Our valet is $20 and can be paid with cash or a credit card. How many people does the restaurant seat? 120 people. What's the largest group number I can book for the restaurant? Parties over ten people fall under our large group dining agreements. Can I purchase gift cards for Joia Beach? Gift cards for Joia Beach restaurant may be purchased at the link here Are drones allowed at Joia Beach? Drones may not be operated or used at Joia Beach without prior approval from management under any circumstances. Does Joia Beach offer towel rentals? Yes! Towels are available for rent in our lounge for $15 each. In The Press View Press Coverage Paradise Found JOIA BEACH @ Jungle Island 1111 Parrot Jungle Trail Miami, FL 33132 ph: 305.400.7280 FOLLOW US HOURS OF OPERATION Monday: 11:30am - 8pm Tuesday: closed Wednesday & Thursday: 11:30am - 8pm Friday & Saturday: 11:30am - 10pm Sunday: 11:30am - 9pm CONTACT US Reservations Team General Inquiries Press Inquiries Join Our Team All rights reserved © 2025 JoiaBeachMiami.com | Privacy Policy - Accessibility Please ensure Javascript is enabled for purposes of website accessibility"
    }
  ]
}