{
  "fuentes": [
    {
      "url": "http://www.jucys.com/ContactUs.html",
      "email": "mrjucy@bellsouth.net"
    },
    {
      "url": "https://www.magneticconcepts.com/popular-designs/whiteboards-by-job-function/personnel-whiteboards",
      "email": "sales@magneticconcepts.com"
    },
    {
      "url": "https://teamboard.cloud/teamboard-for-monday-com/",
      "email": "atlassian@devsamurai.com"
    },
    {
      "url": "https://juicyvapes.co.uk/pages/contact-us",
      "email": "enquiries@juicyvapes.co.uk"
    },
    {
      "url": "https://thejuicebarjuicecompany.com/pages/about-us",
      "email": "img_0112_ef67f25f-c968-4e75-b864-6657aa904948_450x@2x.jpg"
    },
    {
      "url": "https://www.juicywpb.com/",
      "email": "josh@juicywpb.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.birmingham@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.bristolcornst@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.bristoltriangle@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.canarywharf@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.cardiff@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.exeter@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.goodgest@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.liverpoolst@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.mansionhouse@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.monument@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.oldst@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.oxfordcircus@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.reading@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.shaftesburyave@nightcapgroup.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "email": "gm.tcc.shoreditch@nightcapgroup.com"
    },
    {
      "url": "https://scrunchy.io/restaurant/cc512530-cd4c-4cdd-9fd3-cae360fb7297",
      "email": "josh@juicywpb.com"
    },
    {
      "url": "https://barproducts.in/pages/about-us",
      "email": "info@yourwebsite.com"
    },
    {
      "url": "https://www.juicywpb.com/menu-2",
      "email": "josh@juicywpb.com"
    }
  ],
  "mails": [
    "atlassian@devsamurai.com",
    "enquiries@juicyvapes.co.uk",
    "gm.tcc.birmingham@nightcapgroup.com",
    "gm.tcc.bristolcornst@nightcapgroup.com",
    "gm.tcc.bristoltriangle@nightcapgroup.com",
    "gm.tcc.canarywharf@nightcapgroup.com",
    "gm.tcc.cardiff@nightcapgroup.com",
    "gm.tcc.exeter@nightcapgroup.com",
    "gm.tcc.goodgest@nightcapgroup.com",
    "gm.tcc.liverpoolst@nightcapgroup.com",
    "gm.tcc.mansionhouse@nightcapgroup.com",
    "gm.tcc.monument@nightcapgroup.com",
    "gm.tcc.oldst@nightcapgroup.com",
    "gm.tcc.oxfordcircus@nightcapgroup.com",
    "gm.tcc.reading@nightcapgroup.com",
    "gm.tcc.shaftesburyave@nightcapgroup.com",
    "gm.tcc.shoreditch@nightcapgroup.com",
    "img_0112_ef67f25f-c968-4e75-b864-6657aa904948_450x@2x.jpg",
    "info@yourwebsite.com",
    "josh@juicywpb.com",
    "mrjucy@bellsouth.net",
    "sales@magneticconcepts.com"
  ],
  "nombre_sitio": "juicywpb.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "http://www.jucys.com/ContactUs.html",
      "text": "Jucy's Bar B Q, Contact Us Home I About Us I Menu I Carry Out Catering I Honey Glazed Spiral Sliced Ham I Specials I Gift Cards I Contact Us I Map I Testimonials Jucyâs Smokehouse Bar-B-Q 7626 West Highway 146 Pewee Valley, KY 40056 502-241-5829   Email: mrjucy@bellsouth.net COMPANY NAME: CONTACT NAME: required ADDRESS: ADDRESS: CITY: STATE: ZIP: COUNTRY: PHONE: FAX: EMAIL: required COMMENTS:"
    },
    {
      "url": "https://www.magneticconcepts.com/popular-designs/whiteboards-by-job-function/personnel-whiteboards",
      "text": "Personnel Whiteboards | Employee Status & Communication Boards If you have any questions or concerns, please contact us at sales@magneticconcepts.com or call in at 1-800-334-4245. We are open Monday-Friday 8am-5pm EST, USA. NOTE: Sometimes our system emails get caught in SPAM.  Please contact us if you are expecting a quote or other email and have not received it. CUSTOMER LOGIN QUICK ORDER Part # REQUEST QUOTE 1-800-334-4245 CHECKOUT $0.00 Login Order Part # Quote Call $0.00 Search Home Popular Designs Custom Designs Plain Whiteboards Board Display Styles Accessories All Products MENU Search Products Home Popular Designs Custom Designs Plain Whiteboards Board Display Styles Accessories All Products Popular Designs > Whiteboards by Job Function > Personnel Whiteboards Back Personnel Whiteboards Communicate employee status, staff assignments, and company goals Personnel Management Whiteboards Our selection of personnel whiteboards allows you to showcase priorities, daily scheduling, and company goals to foster collaboration and project success. Easily update your priorities and goals as they change throughout your project and keep your team members on the same page. Built for Your Business Any of our personnel whiteboards can be customized for your specific business needs. Send us a sketch of your whiteboard design and we’ll help you make a unique whiteboard for your business. Click on a picture for various Employee Status Board descriptions, sizes, prices 31 items Sort By: Featured (OPTIONAL) Alphabetical (OPTIONAL) In and Out Status Indicator Whiteboards Sliding red/green indicator bars to display employee status In and Out Remark Whiteboards Use magnets to track whose in or out with written comments In & Out Plus Evacuation Control Whiteboards \"Grab & Go\" In and Out board with evacuation status Thermometer Chart Whiteboards Track progress towards sales, production, or fundraising goals Staff Scheduler Whiteboard Communicate shift hours for 2 week period Cross Training Level Whiteboards Track \"who's trained at what job\" to promote job flexibility Fishbone Chart Whiteboard Cause & effect diagram to brainstorm cause of a problem Five Why Chart Whiteboard Ask \"Why?\" five times to get to the root of the problem Status Indicator Whiteboards Quickly display visual updates with red/green sliding indicator bars Staff Picture Display Whiteboards Photo display board for face-to-face customer interactions Staff Schedule Whiteboard Coordinate team schedules and shifts In and Out Location Whiteboards Use magnets to track location and status of personnel In and Out Combination Kits Display personnel status with pinned messages Improvements Center Whiteboard Organize continuous improvement documentation Company Information Whiteboards Memo board to improve staff awareness and communication Daily Meeting Whiteboard Keep track of staff as they go in and out of meetings Employee Communication Whiteboard Paper grips organize schedules, sales data, product news & more Employee Recognition Whiteboard Display and recognize \"Employee of the Month\" winners Goal Progress Whiteboard Track progress towards goals and milestones In and Out Message Whiteboards Track the availability of personnel with written & pinned messages In and Out Time Whiteboards Track personnel status and return times Message Whiteboards Leave clipped messages directly on a dry erase whiteboard Monthly Sales Tracker Whiteboard Track daily sales results for each rep for up to a month On-Duty Whiteboard See who is currently working and how to contact them Organization Chart Whiteboards Display company structure and communicate staff changes Personnel Contact Whiteboards Track whose in or out and display various contact methods Safety Record Whiteboard Track accident cases, time lost, and goal progress Shift Duty Roster Whiteboards Use magnetic data cards to display and change job duties Staff Scheduler Lift-Out Whiteboards Coordinate team schedules with movable week panels Training Room Whiteboards Wood-framed whiteboards with disappearing grid lines Vacation and Attendance Whiteboards Schedule time off and spot vacation conflicts Order Information Upload Files Shipping and Handling Terms and Conditions International Export Product Information Selection Guides How To Tips Cleaning Your Whiteboard Related Sites and Resources Architectural Specifications Customization Ideas Full Product List Company Information FAQ Warranty and Returns Privacy Policy Corporate Profile Testimonials Customer Support Contact Us Request Sample Request a Quote Contact Information Magnetic Concepts 17005 Westfield Park Rd Ste 100 Westfield, IN 46074 Call : 1-800-334-4245 Local: 317-580-4020 Fax : 317-580-4024 sales@magneticconcepts.com We accept POs! Since 1994, © 2025 Magnetic Concepts. All rights reserved."
    },
    {
      "url": "https://teamboard.cloud/teamboard-for-monday-com/",
      "text": "TeamBoard for monday.com - TeamBoard - Resource planning, project management and Gantt Chart for Jira, monday.com Products ProScheduler for Jira Task Management WBS Gantt Chart Resource/Team Management Project/Portfolio Timeline Workload Management Project/Portfolio Calendar Time Tracking Report & Dashboard TimePlanner for Jira Resource Management Team Management Time Tracking, Timesheets Cost Management Client Management Report & Dashboard TeamBoard for monday.com Task Management Work Management Resource/Team Management Time Tracking Program Board TeamBoard for Salesforce Task Management Resource Management Time Tracking Reporting Portfolio Management Solutions By Industry IT Teams Marketing Sales Human Resources Operations Real Estate Customer Support Healthcare Retail By Capability Small Business Medium Business Enterprise Business By Use Case Project Managers Team Leaders Product Owners Business Owners Contractors HR Managers Financial Controllers Pricing ProScheduler for Jira TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Resources Documentation Blogs What’s New eBooks Video Tutorial Webinars Integrations FAQs Support Contact us Schedule a Demo Support Desk Test on Sandbox About Us Trust Center Leave a review TeamBoard ProScheduler for Jira TeamBoard TimePlanner for Jira TeamBoard for monday.com TeamBoard for Salesforce Try Now TeamBoard for monday.com Resource Management, Calendar, Recurring Tasks & Time Tracking, Timesheets – All in One Place! Start your free trial Book a Demo Resource Scheduler Plan and Assign Tasks with Ease Simple Task Planning : Assign tasks based on team availability and capacity. Real-Time Updates: Changes sync automatically across your monday.com boards. Avoid Overload: Track team workloads to prevent overburdening anyone. Clear Overview: See tasks on a visual timeline to spot potential issues early. Try for free → Working Capacity & Holiday Calendar Manage Workloads and Time Off with Ease Track Capacity: Easily see how much work each team member can handle. Plan for Time Off : Keep track of holidays, vacation days, and time off to avoid scheduling conflicts. Leave Requests : Track and approve team members’ time off requests in one place. Balance Workloads: Adjust tasks based on team availability to ensure no one is overloaded. Try for free → Time Tracking & Timesheets Effortlessly Track Time and Manage Timesheets Simple Time Tracking : Log time spent on tasks directly in the app. Timesheet Management : Review and approve timesheets with a few clicks. Easy Reports: Generate reports to see where time is being spent and optimize your workflow. Try for free → Calendar View Get a Clear Overview of Tasks and Deadlines View Tasks & Deadlines : See all your tasks and deadlines in one calendar. Customizable Views: Switch between daily, weekly, or yearly views to fit your needs. Track Holidays: Easily manage team holidays and ensure proper planning. Stay Organized: Keep track of all upcoming work and prevent scheduling conflicts. Try for free → Recurring Tasks Automate Repetitive Tasks and Save Time Set Up Once, Automate Forever : Create tasks that automatically repeat on your preferred schedule. Flexible Scheduling: Choose from daily, weekly, or custom intervals. Stay Organized: Keep recurring tasks organized and ensure nothing gets missed. Save Time: Eliminate the need to manually recreate tasks over and over again. Try for free → Manage Multiple Boards in Dashboard & Reports Track Multiple Boards in One Unified Dashboard Unified Dashboard : Monitor all your projects and teams in one place. Custom Reports: Create interactive reports to track performance, progress, and resource usage. Cross-Board Management: Easily manage tasks and resources from multiple boards within a single dashboard. Real-Time Updates: Get live insights into your team’s performance and project timelines. Try for free → Get Started with TeamBoard for monday.com Getting Started is Simple Start using TeamBoard in just a few clicks. Install the app from the monday.com marketplace, explore its intuitive features like the Resource Scheduler, Calendar View, and Timesheets, and see how it transforms your workflow. Need help? Book a free demo and let us guide you through everything your team needs to get started quickly and effectively. Access the Quick Start Guide → Integrate with monday.com Integrates seamlessly with monday.com environments and offers a centralized platform for managing tasks, projects, and resources effectively. Install Now TeamBoard for monday.com Features Resource Planning Resource Planning helps managers optimize their workforce and workload distribution. Try for free Project management Project management empowers managers to oversee their projects effectively. Try for free Workload Management It involves the process of efficiently distributing and managing work across your team members. Try for free Time Tracking Time Tracking lets managers monitor hours spent on tasks accurately. Try for free Calendar View This feature helps individuals and teams see at a glance what needs to be accomplished daily, weekly, monthly, or even annually. Try for free Others Additional features include work capacity, holiday scheme, timesheet, task planning, comprehensive reporting,… Try for free Blog Posts Resource Planning , TeamBoard TimePlanner , Time Management 9 Jul at 6:39 am TimePlanner vs. Activity Timeline: Best tool for Jira time tracking TeamBoard TimePlanner , Time Management 30 Jun at 6:08 am TimePlanner vs. Timesheets: Comparing Jira time tracking tools TeamBoard ProScheduler , Work Productivity 30 Jun at 4:06 am How to Boost Your Remote Work Productivity Project Management 20 Jun at 10:06 am 10 Common Mistakes to Avoid When Using Gantt Charts in Project Management All , Resource Planning 11 Feb at 4:50 am Why Task Management is the Missing Link in Agile Resource Planning Project Management 9 Jan at 8:30 am 2025 Project Management Trends: Essential Tools and Breakthrough Innovations TeamBoard TimePlanner 8 Jan at 3:56 am New Team UI and Exciting Updates in TimePlanner | Upcoming Release for Jira Cloud All , TeamBoard for monday.com , Time Management 5 Dec 2024 5 Tips to Optimize Time Tracking with Teamboard App on monday.com Project Management 4 Dec 2024 🎅 Santa’s Workshop: Project Management Tips for a Productive Season All , TeamBoard TimePlanner 2 Dec 2024 Common Challenges of Leave Management in Jira and How to Overcome them View All Blogs We’re Here for You! Knowledge Base App Support Desk Request Demo One-Stop Solution for project management, resource planning, WBS gantt charts, time tracking, and timesheets. Twitter YouTube Pinterest Facebook LinkedIn Solutions Gantt Chart for Jira with TeamBoard Resource Planning Cost Management Resource Management Time tracking, Timesheets Project Management Support Documentation Video About Us Contact Us TeamBoard Demo Request eBooks Pricing Test on Sandbox Trust Center Sitemap Other products ProductGo AssetIT Mocky Leanboard AgileTest AgileBox Routemap TaskFord AssetLoom Contact Us hello@teamboard.cloud +81 50 362 78910 DevSamurai, Inc. 3-6-25 Komone, Itabashi-ku, Tokyo 173-0037 Japan © 2022 TeamBoard. All Right Reserved. Menu"
    },
    {
      "url": "https://juicyvapes.co.uk/pages/contact-us",
      "text": "Contact Us | Get in Touch for Support & Enquiries\n – Juicy Vapes Skip to content Home Prefilled Pods Prefilled Pods Prefilled Pod Kits Angel 2400 Crystal Pro Switch 30k Dojo Blast 2000 Dojo Blast 6000 Dojo Blast 10k Drifter Bar 6000 Elfbar 4 in 1 Elfbar 600 Elf Bar AF5500 Elfbar Dual 10K Elfa by Elfbar Gold Bar Apollo 20k Gold Bar Reload Hayati Pro Max 6K Hyola Pro Max 8000 Instapod 6000 IVG 2 in 1 IVG 2400 Air IVG Pro 12 IVG SAVR Juicy Pod NovaMax 10k Lost Mary 4 in 1 Lost Mary BM600 Lost Mary BM6000 Lost Mary Nera 30k Lost Mary Tappo PIXL 8000 PIXL Duo 12K Pyne Pod Click 50k Riot Connex SKE Crystal 4 in 1 SKE Crystal CL6000 SKE Crystal Plus SKE Crystal Pro 600 Solobar Boost 30K Uwell Viscore 8000 Vaporesso Deliciu Mate Veev One Zeltu X3 Prefilled Pods Angel 2400 Crystal Pro Switch 30k Dojo Blast 2000 Dojo Blast 6000 Dojo Blast 10k Drifter Bar 6000 Elfbar 4 in 1 Elfbar 600 Elf Bar AF5500 Elf Bar Dual 10k Elfa Pro Pods Gold Bar Apollo 20k Gold Bar Reload Hayati Pro Max 6k Hyola Pro Max 8000 Instapod 6000 IVG 2400 IVG Air IVG Pro 12 IVG SAVR Juicy Pod NovaMax 10k Lost Mary 4 in 1 Lost Mary BM600 Lost Mary BM6000 Lost Mary Nera 15k Lost Mary Tappo PIXL 8000 Pixl Duo 12k Pyne Pod Click Riot Connex SKE Crystal 4 in 1 SKE Crystal CL6000 SKE Crystal Plus SKE Crystal Pro 600 SoloBar Boost 30K Uwell Viscore 8000 Vaporesso Deliciu Mate Veev One Zeltu X3 All Vape Pods Prefilled Flavours Apple Banana Blackcurrant Blueberry Blue Raspberry Cherry Citrus Cola Grape Kiwi Lemon Lime Mango Menthol Orange Peach Pineapple Raspberry Strawberry Tobacco Watermelon All Flavours Kit Types 600 Puffs 2000 Puffs 2400 Puffs 4000 Puffs 5000 Puffs 6000 Puffs 7000 Puffs 8000 Puffs 10000 Puffs 12000 Puffs 15000 Puffs 20000 Puffs 30000 Puffs Multi Flavoured Vapes 4 in 1 Vapes Heavy Smokers Deals Crystal Bar Bulk Deals Elf Bar Bulk Deals Gold Bar Bulk Deals IVG Bulk Deals IVG 2400 Box of 5 IVG 2400 Box of 10 Lost Mary Box of 10 100ml for £10 2 x 100ml for £25 E Liquids E Liquids Flavours Apple Banana Blueberry Blue Raspberry Blueberry Sour Raspberry Blue Razz Lemonade Bubblegum Cherry Cola Cotton Candy Grape Gummy Bear Lemon & Lime Mango Menthol Mint Pineapple Pink Lemonade Strawberry Ice Tobacco Watermelon 100ml E Liquid Spartan Juice Lucky Thirteen Bar Hacker Bar Series Cyber Rabbit Doozy Vape Double Drip Element IVG Jack Rabbit Just Juice Mejusa Puff More Pukka Juice Rachael Rabbit Ruthless Sweet Shop Ultimate Puff Unreal Unreal 2 Unreal 3 Unreal Berries Vampire Vape Wick Liquor Zeus Juice 10ml Nic Salts Lucky Thirteen Salts Bar Juice 5000 Bar Series Crystal Clear Crystal Original Dinner Lady ElfLiq Elux Firerose Elux Legend Gold Bar Hayati Pro Max Imp Jar Jack Rabbit MaryLiq Mejusa Nasty Liq Oxva OX Passion Ohm Brew Puff More Pukka Juice Rachael Rabbit Riot Squad Unreal Unreal 2 Unreal 3 Unreal Berries Zeus Juice 50ml E Liquid Imp Jar IMP20 Imp Jar X Doozy Imp Jar X Lucky Thirteen Imp Jar X Wick Liquor Imp Jar X Zeus Juice Nasty Juice Riot Squad 10ml E Liquid Hangsen Vampire Vape E Liquid Types 0mg 3mg 5mg 6mg 10mg 12mg 18mg 20mg Low Nicotine 50/50 Vape Juice 70/30 Vape Juice High VG Vape Juice Vape Kits Vape Kits Brands Aspire Elfa by Elf Bar Innokin Lost Mary Tappo Lost Vape SMOK OXVA Uwell Vaporesso Voopoo Vape Kits MTL Kits Pod Kits Rechargeable Vapes Refillable Vapes Small Kits Starter Kits Sub Ohm Kits Vape Pen Bundles Styles Black Vape Kits Blue Vape Kits Green Vape Kits Pink Vape Kits Purple Vape Kits Coils Coils Aspire FreeMax Geek Vape HorizonTech Innokin OXVA SMOK Uwell Vaporesso Voopoo All Coils Tanks Tanks Aspire FreeMax Geek Vape HorizonTech SMOK Uwell All Tanks Accessories Accessories Nic Shots Spare Glass 18650 Batteries 21700 Batteries Chargers & Cables Vape Bottles New Arrivals Nicotine Pouches Deals Deals Black Friday Deals Box Deals Bulk Deals E Liquid Deals Vape Kit Bundles Search Search Account Account Other sign in options Sign in Orders Profile Account Account Other sign in options Sign in Orders Profile Total items in cart: 0 0 Your cart is empty Have an account? Log in to check out faster. Continue shopping Home Prefilled Pods Prefilled Pod Kits Angel 2400 Crystal Pro Switch 30k Dojo Blast 2000 Dojo Blast 6000 Dojo Blast 10k Drifter Bar 6000 Elfbar 4 in 1 Elfbar 600 Elf Bar AF5500 Elfbar Dual 10K Elfa by Elfbar Gold Bar Apollo 20k Gold Bar Reload Hayati Pro Max 6K Hyola Pro Max 8000 Instapod 6000 IVG 2 in 1 IVG 2400 Air IVG Pro 12 IVG SAVR Juicy Pod NovaMax 10k Lost Mary 4 in 1 Lost Mary BM600 Lost Mary BM6000 Lost Mary Nera 30k Lost Mary Tappo PIXL 8000 PIXL Duo 12K Pyne Pod Click 50k Riot Connex SKE Crystal 4 in 1 SKE Crystal CL6000 SKE Crystal Plus SKE Crystal Pro 600 Solobar Boost 30K Uwell Viscore 8000 Vaporesso Deliciu Mate Veev One Zeltu X3 Prefilled Pods Angel 2400 Crystal Pro Switch 30k Dojo Blast 2000 Dojo Blast 6000 Dojo Blast 10k Drifter Bar 6000 Elfbar 4 in 1 Elfbar 600 Elf Bar AF5500 Elf Bar Dual 10k Elfa Pro Pods Gold Bar Apollo 20k Gold Bar Reload Hayati Pro Max 6k Hyola Pro Max 8000 Instapod 6000 IVG 2400 IVG Air IVG Pro 12 IVG SAVR Juicy Pod NovaMax 10k Lost Mary 4 in 1 Lost Mary BM600 Lost Mary BM6000 Lost Mary Nera 15k Lost Mary Tappo PIXL 8000 Pixl Duo 12k Pyne Pod Click Riot Connex SKE Crystal 4 in 1 SKE Crystal CL6000 SKE Crystal Plus SKE Crystal Pro 600 SoloBar Boost 30K Uwell Viscore 8000 Vaporesso Deliciu Mate Veev One Zeltu X3 All Vape Pods Prefilled Flavours Apple Banana Blackcurrant Blueberry Blue Raspberry Cherry Citrus Cola Grape Kiwi Lemon Lime Mango Menthol Orange Peach Pineapple Raspberry Strawberry Tobacco Watermelon All Flavours Kit Types 600 Puffs 2000 Puffs 2400 Puffs 4000 Puffs 5000 Puffs 6000 Puffs 7000 Puffs 8000 Puffs 10000 Puffs 12000 Puffs 15000 Puffs 20000 Puffs 30000 Puffs Multi Flavoured Vapes 4 in 1 Vapes Heavy Smokers Deals Crystal Bar Bulk Deals Elf Bar Bulk Deals Gold Bar Bulk Deals IVG Bulk Deals IVG 2400 Box of 5 IVG 2400 Box of 10 Lost Mary Box of 10 100ml for £10 2 x 100ml for £25 E Liquids Flavours Apple Banana Blueberry Blue Raspberry Blueberry Sour Raspberry Blue Razz Lemonade Bubblegum Cherry Cola Cotton Candy Grape Gummy Bear Lemon & Lime Mango Menthol Mint Pineapple Pink Lemonade Strawberry Ice Tobacco Watermelon 100ml E Liquid Spartan Juice Lucky Thirteen Bar Hacker Bar Series Cyber Rabbit Doozy Vape Double Drip Element IVG Jack Rabbit Just Juice Mejusa Puff More Pukka Juice Rachael Rabbit Ruthless Sweet Shop Ultimate Puff Unreal Unreal 2 Unreal 3 Unreal Berries Vampire Vape Wick Liquor Zeus Juice 10ml Nic Salts Lucky Thirteen Salts Bar Juice 5000 Bar Series Crystal Clear Crystal Original Dinner Lady ElfLiq Elux Firerose Elux Legend Gold Bar Hayati Pro Max Imp Jar Jack Rabbit MaryLiq Mejusa Nasty Liq Oxva OX Passion Ohm Brew Puff More Pukka Juice Rachael Rabbit Riot Squad Unreal Unreal 2 Unreal 3 Unreal Berries Zeus Juice 50ml E Liquid Imp Jar IMP20 Imp Jar X Doozy Imp Jar X Lucky Thirteen Imp Jar X Wick Liquor Imp Jar X Zeus Juice Nasty Juice Riot Squad 10ml E Liquid Hangsen Vampire Vape E Liquid Types 0mg 3mg 5mg 6mg 10mg 12mg 18mg 20mg Low Nicotine 50/50 Vape Juice 70/30 Vape Juice High VG Vape Juice Vape Kits Brands Aspire Elfa by Elf Bar Innokin Lost Mary Tappo Lost Vape SMOK OXVA Uwell Vaporesso Voopoo Vape Kits MTL Kits Pod Kits Rechargeable Vapes Refillable Vapes Small Kits Starter Kits Sub Ohm Kits Vape Pen Bundles Styles Black Vape Kits Blue Vape Kits Green Vape Kits Pink Vape Kits Purple Vape Kits Coils Aspire FreeMax Geek Vape HorizonTech Innokin OXVA SMOK Uwell Vaporesso Voopoo All Coils Tanks Aspire FreeMax Geek Vape HorizonTech SMOK Uwell All Tanks Accessories Nic Shots Spare Glass 18650 Batteries 21700 Batteries Chargers & Cables Vape Bottles New Arrivals Nicotine Pouches Deals Black Friday Deals Box Deals Bulk Deals E Liquid Deals Vape Kit Bundles More Contact Us It has never been easier to contact our customer service team. Use the options below to chose whether you wish to speak in person, over the phone, by email, live chat, social media - whatever YOU prefer. And we're not just there to talk about orders, we are always happy help in any way we can - whether you want to ask a general question about vaping, can't decide on a product, or want advice about anything vape related, we're here for you. Telephone Our customer service team is available 9am - 5pm (Mon - Fri) In the UK please call: 01234 840004 Email For all general enquiries please email enquiries@juicyvapes.co.uk If you have any queries regarding a product on an order, you can also use the contact form below. This will help us direct your query to the relevant department and deal with your query promptly. Mail Send standard mail correspondence to: Customer Services, Juicy Vapes, Unit 70 Singer Way, Woburn Road Industrial Estate, Kempston, Bedfordshire, MK42 7PU Contact Us Form We will endeavour to respond to all enquiries within 2 working days Name Email * Phone Comment Send Quick Links Quick Links Search Privacy Policy Refund Policy Shipping Policy Terms of Service Store Locator Contact Us Help & Guidance Juicy Vapes, Unit 70 Singer Way , Woburn Road Industrial Estate, Kempston, Beds, MK42 7PU. Email: enquiries@juicyvapes.co.uk © 2025 Juicy Vapes , Powered by Shopify Refund policy Privacy policy Terms of service Shipping policy Search Clear Products 24k Mango Gold Bar Reload Pods £4.99 GBP Acai Berry Blueberry Lost Mary BM6000 Pod Kit £9.99 GBP Acai Berry Blueberry Lost Mary BM6000 Refill Pod £5.99 GBP Acai Berry Lemonade Lost Mary BM6000 Pod Kit £9.99 GBP View all"
    },
    {
      "url": "https://thejuicebarjuicecompany.com/pages/about-us",
      "text": "About Us – The Juice Bar Juice Company Skip to content Search About Us Cold Pressed Juice Juice Cleanse Sea Moss 1/2 Gallon Jugs Gift Cards The Juice: Blog posts Account Site navigation Search Search Cart Menu Site navigation About Us Cold Pressed Juice Juice Cleanse Sea Moss 1/2 Gallon Jugs Gift Cards The Juice: Blog posts Account Item added to cart. View cart and check out . Close Close Same Day Pickup on All Juice Cleanses! Close About Us The Juice Bar Juice Company is a family owned & operated business that specializes in 100% Fresh & Natural Cold Pressed Juice. Our mission is to provide a healthy, affordable high quality alternative to the sugary juice options provided in most fast food chains & grocery stores. Our juices are 100% natural with no added sugars, water, or preservatives. The Juice Bar Juice Company is a health & wellness brand dedicated to improving the lives of our community with nature’s medicine: Fresh fruit & vegetable juice! Before you go! Contact Us Search Refund Policy © 2025, The Juice Bar Juice Company . Powered by Shopify Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection. Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device"
    },
    {
      "url": "https://www.juicywpb.com/",
      "text": "Juicy Cocktail Bar 0 Skip to Content HOME MENU ABOUT Open Menu Close Menu HOME MENU ABOUT Open Menu Close Menu HOME MENU ABOUT Juicy, a COMPACT Cocktail HAVEN WED - SAT 5PM - 12 AM Juicy is a 22-Seat Hole-in-the-Wall nestled  in Downtown West Palm Beach.  With a focus on exotic & tropical fruits, our aim is simple - offer delightful cocktails. Never too sweet, sometimes a bit indulgent, and occasionally unexpected. ABOUT US VIEW MENU FOLLOW US ON SOCIAL BOOK YOUR NEXT EVENT Name * First Name Last Name Email * Message * Phone (###) ### #### Thank you! Please allow 24 hours for a response. Location 202 South Olive Ave West Palm Beach, FL 33401 Hours Wednesday - Saturday 5 PM - 12 AM Contact Josh@Juicywpb.com"
    },
    {
      "url": "https://www.thecocktailclub.com/about-us",
      "text": "About Us  |  The Cocktail Club Our Story From the Basement to The World The Cocktail Club didn’t become one of London’s most prestigious bar experiences overnight. In fact, our story started way back in 2008, when childhood friends JJ Goodman and James “Hoppy” Hopkins, with nothing more than a small loan from JJ’s mum, Lizzie, decided to change the London bar scene. Armed with a world-class drinks menu, years of cocktail expertise, and a passion for nightlife artistry, they came together to open the Covent Garden Cocktail Club. From that moment onwards, a little local site with a lot of heart soon blossomed into one of London’s most booming bars. Aided by their victory on the 2009 UK television program, The Restaurant, which featured Raymond Blanc and Dragons’ Den’s Sarah Willingham, The Cocktail Club began to revolutionise the London cocktail scene. Since that first site, TCC has exploded outwards, winning a range of national awards from London Lifestyle, Time Out, Design My Night, and more. What started with a speakeasy-style basement has now become London’s most sought-after party experience. 13 years and 17 new sites later, The Cocktail Club brings the very best of British Bars to your night out. We party harder, we go for longer, we do it better. Every. Single. Time. Founder JJ Goodman A globally recognized personality and thought-leader in the world of mixed drinks, JJ Goodman is the Founder and Owner of The Cocktail Club bar group. Infatuated with bartending from a young age, JJ had firmly established himself as an innovator in the drinks industry before opening his first bar at the age of 24 in 2008. Since then, he has opened an additional 10 cocktail bars across London, pioneered revolutionary cocktail trends around the world, and is seen as one of the globe’s greatest drinks minds due to his many accolades. Achievements & Recognition Among JJ’s achievements, highlights include winning the 42 Below Cocktail World Cup, becoming one of London Lifestyle Award’s 50 Most Influential People and one of Zagat’s 30 Under 30 Trailblazers. JJ also won BBC Two’s The Restaurant in 2008, which consequently secured him a business partnership with Dragons’ Den’s Sarah Willingham and chef personality Raymond Blanc OBE. This win catapulted JJ’s career into the limelight, and he is now recognized as the leading celebrity bartender. Recent television credits include Alan Carr: Chatty Man, Let’s Do Lunch with Gino and Mel, The Alan Titchmarsh Show and Saturday Kitchen. JJ has also recently partnered with multiple global brands and is currently an ambassador for the likes of Sainsbury’s, Marks & Spencer, Lidl, Red Bull, Eurostar, & Marriott. Other notable media credits include features in The Daily Mail, Wall Street Journal, Evening Standard, Metro, The Sunday Times and Bar Magazine. After partnering with The Prince’s Trust, Springboard UK, and the British Institute of Innkeeping (BII), JJ is now focused on education and developing a community of resources within the hospitality industry. His vision is to open doors within hospitality for Britain’s unemployed youth and, in collaboration with the industry’s leading companies, to create the first government accredited qualification in specialized cocktail bartending. 020 7580 1960 Quick Links About FAQs & Contact Us Safer Together Join The Team Offers Gift Cards Blog Free Cocktail Christmas 2025 More Information Terms & Conditions Cookie Policy Privacy Policy © Copyright 2025 The Cocktail Club . All rights reserved. Operated by Powered by Happy Hour Events & Bottomless Brunch Menus Offers Occasions Christmas 2025 Our Bars Book Now"
    },
    {
      "url": "https://scrunchy.io/restaurant/cc512530-cd4c-4cdd-9fd3-cae360fb7297",
      "text": "Juicy Cocktail Bar | Scrunchy Scrunchy Explore Restaurants For Diners For Restaurants Toggle theme Toggle theme Explore Restaurants For Diners For Restaurants Juicy Cocktail Bar $$ • Bar Location & Contact 202 S Olive Ave, West Palm Beach, FL 33401 Email: josh@juicywpb.com Website The Infatuation's Review The Infatuation's Review Categories Bar Cocktail Bar About Make a reservation at Juicy Cocktail Bar, where tropical flavors meet cocktail excellence in the heart of West Palm Beach, Florida. This intimate 22-seat bar is renowned for its innovative cocktails that showcase the best of South Florida's vibrant fruit scene. Signature drinks like Tony’s masala margarita, featuring sweet potato and turmeric, and the refreshing mandarin cream crush are must-tries for any cocktail enthusiast. The laid-back ambiance, paired with upbeat tunes, creates a fun and inviting atmosphere perfect for a night out with friends or a romantic date. Diners especially love the unique experience of enjoying seasonal fruit plates alongside their drinks, making it a delightful culinary adventure. Juicy Cocktail Bar is not just about great drinks; it’s a place where the bartenders engage with guests, ensuring a personalized experience. With a focus on authenticity and creativity, this bar is a standout in the local scene. Don't miss out on their rotating specials, including the popular blackberry shaved ice cocktail. Whether you're a local or visiting from Miami, securing a reservation is highly recommended to experience the best cocktails in town. Make a Reservation at Juicy Cocktail Bar Fill out the form below and we'll check availability for your group Full Name Email Group Size Date Pick a date Time Select time Location Types of Dining Establishment Select establishments Cuisines Select cuisines Specialties Select specialties Budget per Person Select budget range Dining Room Preference Select dining room preference Preferred Atmosphere Select atmosphere preference Type of Event Select event type Dietary Restrictions (Optional) Special Requests (Optional) Additional Information (Optional) Submit Reservation Request"
    },
    {
      "url": "https://barproducts.in/pages/about-us",
      "text": "About Us Skip to content BAR SUPPLIES BARTENDING DRINKWARE TABLEWARE BEER AND WINE BAR SETS LEATHER PRODUCTS PARTY SUPPLIES PEDICURE AND MANICURE Need help? Call us 000-000-0000 info@yourwebsite.com Follow Us Facebook Twitter Instagram Back BAR SUPPLIES LIQUOR POURERS STRAWS BAR MATS ICE SCOOPS BAR STIRRERS SKEWER/COCKTAIL PICKS TWEEZERS ICE TOOLS Back BARTENDING BOTTLE OPENERS COCKTAIL STRAINERS MUDDLERS COCKTAIL SHAKERS BOSTON SHAKERS PEG MEASURERS POURER CAPS Back DRINKWARE POLYCARBONATE CUPS WHISKY STONES JULEP CUPS WINE GOBLETS STAINLESS STEEL TUMBLERS Back TABLEWARE TABLE NUMBER STAND COASTERS CATCHER DREDGER FRY CUPS Back BEER AND WINE CORCKSCREW BOTTLE STOPPER Back LEATHER PRODUCTS LEATHER MENU COVERS WOODEN MENU COVERS PVC TRANSPARENT MENU COVERS ROOM DIRECTORY FOLDER NOTE PADS/ DESK BLOTTERS DOCUMENTS FOLDERS BEVERAGE FOLDER /WINE LIST CHECK BILL FOLDERS TABLE MENU STAND CONVOCATION DIPLOMA FOLDERS HOLSTERS PAGING BOARDS Back PARTY SUPPLIES BEER BUCKETS WINE BUCKETS Barproducts.in Clear All categories All categories BAR CADDIES & SALT RIMMERS BAR CASE BAR KNIFE AND PEELERS BAR MATS BAR POSTERS BAR SETS BAR SIGNS BAR SPOONS BAR STIRRERS BAR SUPPLIES BAR TOOL SET BARCADDY BARTENDING BEER AND WINE BEER BUCKETS BEER CHILLER BEER GLASSES BEER MUGS BEER TOWER BEVERAGE FOLDER /WINE LIST BOSTON SHAKERS BOTTLE CAP HOLDER BOTTLE OPENERS BOTTLE SHELF BOTTLE STOPPER BREAD BASKETS CANDLE HOLDER/JAR CATCHER CHAMPAGNE BOWLS CHECK PRESENTER /  BILL FOLDERS CITRUS TOOLS COASTERS COCKTAIL CONDIMENTS COCKTAIL SET COCKTAIL SHAKERS COCKTAIL STRAINERS CONVOCATION DIPLOMA FOLDERS COPEPR SHOT CUPS COPPER BARTOOLS COPPER BOWLS COPPER BUCKETS COPPER CANDLE HOLDERS COPPER CUTLERY COPPER JULEP CUPS COPPER MUGS COPPER PARTY TUB COPPER SERVINGWARES COPPER SHAKERS COPPER STIRRER COPPER TRAY COPPER TUMBLER COPPER WINE GLASS COPPERWARE CORCKSCREW CORKS CORKSCREWS COTTON BAGS FOR PACKING CUTLERY CUTTING BOARDS DECANTER DISPOSABLE DRINK ACEESSORIES DOCUMENTS FOLDERS DREDGER DRINKWARE DRIP TRAY ELITE  DRINKWARE FLAIR PRODUCTS FLAIR PRODUCTS FOIL CUTTER FRY CUPS GLASS CLEANING CLOTH GLASS RACK HOLSTERS HOME BAR KITS Home page ICE SCOOPS ICE TOOLS JULEP CUPS LEATHER MENU COVERS LEATHER PRODUCTS LEMON SQUEEZER LIQUOR POURERS MIXING GLASS MIXOLOGY SET MUDDLERS NAPKIN HOLDER NOTE PADS/ BLOTTERS OPENER CASES ORDER BELL ORDER RAILS Paging Boards PARTY SUPPLIES PARTY TUBS PEDICURE AND MANICURE PEG MEASURERS PLASTIC BUCKETS POLYCARBONATE CUPS POURER CAPS PROPS FOR BAR PVC TRANSPARENT MENU COVERS ROOM DIRECTORY FOLDER SAUCE CUPS SERVING TRAYS SHOOTER GEAR & CLUB DRINKWARE SHOT GLASSES SHOT SERVER SKEWER/COCKTAIL PICKS SMOKING SUPPLIES SPEED RAILS STAINLESS STEEL BUCKET STAINLESS STEEL TUMBLERS STORE AND POUR STRAWS T-LIGHT TABLE MAT TABLE MENU STAND TABLE NUMBER STAND TABLEWARE TIKI MUGS TIP TRAY TRAVEL BAR  KIT TWEEZERS WALL-ART WHISKY SET WHISKY STONES WINE BOTTLE STAND WINE BOX WINE BUCKETS WINE CHILLER WINE COOLERS WINE GLASSES WINE GOBLETS WINE RACK WINE TOTE BAGS WOODEN MENU COVERS Close Login / Signup My account 0 Cart Your cart is empty Shop our products BAR SUPPLIES LIQUOR POURERS STRAWS BAR MATS ICE SCOOPS BAR STIRRERS SKEWER/COCKTAIL PICKS TWEEZERS ICE TOOLS BARTENDING BOTTLE OPENERS COCKTAIL STRAINERS MUDDLERS COCKTAIL SHAKERS BOSTON SHAKERS PEG MEASURERS POURER CAPS DRINKWARE POLYCARBONATE CUPS WHISKY STONES JULEP CUPS WINE GOBLETS STAINLESS STEEL TUMBLERS TABLEWARE TABLE NUMBER STAND COASTERS CATCHER DREDGER FRY CUPS BEER AND WINE CORCKSCREW BOTTLE STOPPER BAR SETS LEATHER PRODUCTS LEATHER MENU COVERS WOODEN MENU COVERS PVC TRANSPARENT MENU COVERS ROOM DIRECTORY FOLDER NOTE PADS/ DESK BLOTTERS DOCUMENTS FOLDERS BEVERAGE FOLDER /WINE LIST CHECK BILL FOLDERS TABLE MENU STAND CONVOCATION DIPLOMA FOLDERS HOLSTERS PAGING BOARDS PARTY SUPPLIES BEER BUCKETS WINE BUCKETS PEDICURE AND MANICURE Use this bar to show information about your cookie policy. Accept Decline About Us Barproducts.in is your online shop for bar accessories - equip your cocktail bar professionally. In our shop we have everything you need to set up your cocktail bar according to your wishes and quality. Our organization is a distinguished name in manufacturing and exporting Bar Products , Kitchenware, Hotel-ware and Copper products etc. \"NJ Overseas Pvt. Ltd. \" is run under the supervision of \"Mr. JP SINGH\". Set up in the year 2013, we have successfully manufactured the quality products using modern machinery. The clients trust our products for their quality. Our products range takes you to the most important things; work utensils and tools for bartenders. Here you will find all the essential bar utensils to prepare a great drink, from quality cocktail shakers to knives, bar muddlers or ice crushers. Our large selection is versatile and, with our many years of experience in the field of bar equipment, is also characterized by the our manufacturing process. It also has to run smoothly behind the scenes: The  another range includes equipment such as bottle openers, trays, aprons, but also utensils for storing ingredients or our selection of dishwashing and cleaning accessories. For news, product updates and more, follow us on  Instagram and Facebook  and subscribe to the newsletter! Have fun with your purchase! Newsletter A short sentence describing what someone will receive by subscribing Your email Subscribe FREE SHIPPING PROGRAM Many Products Eligible DESIGN YOUR OWN! Using our easy designer CHAT WITH US Mon-Fri, 9am-5pm EST QUICK TURNAROUND Most orders shipped within a day or 2 Barproducts.in NJ OVERSEAS PVT. LTD. Follow Us CUSTOMER CARE Contact Us About Us Privacy Policy Return, Refund and Cancellation Policy Shipping Policy Terms of Service OUR NEWSLETTER Subscribe to get notified about product launches, special offers and news. Your email Subscribe Contact Us | About us | Privacy Policy | Return and Refund Policy | Shipping Policy Copyright © 2025 Barproducts.in Contact Us | About us | Privacy Policy | Return and Refund Policy | Shipping Policy Copyright © 2025 Barproducts.in Opens in a new window."
    },
    {
      "url": "https://www.juicywpb.com/menu-2",
      "text": "Menu 1 — Juicy Cocktail Bar 0 Skip to Content HOME MENU ABOUT Open Menu Close Menu HOME MENU ABOUT Open Menu Close Menu HOME MENU ABOUT Our menu. changes frequently COCKTAILS FOOD WINE 'DRINKS LIKE A __' |  FRUIT, etc seasonal juice $ 15 GIMLET  | CANTELOUPE coconut-washed gin, Kaffir lime $ 15 $ 15 CAIPIRINHA | SUMMER SALAD white peach & tomato, corn & chamomile, raicilla $ 15 $ 16 SIDECAR | TAMARIND smoky mezcal, cointreau, luxardo maraschino $ 16 $ 16 'GLASS OF RED' | MULBERRY cognac, port, spicy, fruity $ 16 $ 18 MILK PUNCH | MANGO LASSI bourbon, allspice, cinnamon $ 18 $ 17 NEGRONI | PASSIONFRUIT rhum agricole, pineapple amaro, cocchi americano $ 17 $ 15 BANANA COLADA | BANANA ron zacapa, roasted banana and pineapple, coconut, pimento dram $ 15 HOUSE CLASSICS $ 16 GUAVA PASTELITO reposado tequila, guava, thai tea $ 16 $ 17. WAFU NEGRONI akashi ume whiskey, gran classico, dolin blanc $ 17. $ 16 FLIGHT SCHOOL bourbon, pineapple, sweet vermouth, luxardo maraschino $ 16 'Classics' $ 14. GOLD RUSH HIGHBALL bourbon, honey, lemon, soda $ 14. $ 16. DIVISION BELL aperol, mezcal, luxardo, lime $ 16. $ 17. VESPER MARTINI bar hill honey gin, vodka, lavender bitters $ 17. FOOD $ 15. Pulled Pork Nachos guac, queso, jalapeno $ 15. $ 15. Brisket Quesadilla Demkota Brisket, Melty Cheese $ 15. DAILY FRUIT MP. Complimentary Bar Snack WHITE $ 12G \n                  \n                    / $ 35B Gruner Veltliner Stadt Krems, Kremstal $ 12G \n                  \n                    / $ 35B $ 14G \n                  \n                    / $ 37B Unfiltered Arneis Angelo Negro, Piedmont, Italy $ 14G \n                  \n                    / $ 37B $ 15G \n                  \n                    / $ 42B Chardonnay Varner, Santa Barbara, Cali $ 15G \n                  \n                    / $ 42B $ 12G \n                  \n                    / $ 32B Rose Moulin d' Gassac, FR $ 12G \n                  \n                    / $ 32B RED $ 16G \n                  \n                    / $ 47B Monkey Jacket Red Blend Cruse Wine Co., North Coast, Cali $ 16G \n                  \n                    / $ 47B $ 15G \n                  \n                    / $ 45B Pinot Noir Varner, Santa Barbara $ 15G \n                  \n                    / $ 45B $ 12G \n                  \n                    / $ 35B Cabernet Blend Mary Taylor, Bordeaux $ 12G \n                  \n                    / $ 35B Location 202 South Olive Ave West Palm Beach, FL 33401 Hours Wednesday - Saturday 5 PM - 12 AM Contact Josh@Juicywpb.com"
    }
  ]
}