{
  "fuentes": [
    {
      "url": "https://www.jungleisland.com/animal-encounters/vip-tours/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/vip-tours/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/vip-tours/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://communitynewspapers.com/biscayne-bay/jungle-island-finds-a-new-loving-home-for-parks-orangutan-family/",
      "email": "advertising@communitynewspapers.com"
    },
    {
      "url": "https://communitynewspapers.com/biscayne-bay/jungle-island-finds-a-new-loving-home-for-parks-orangutan-family/",
      "email": "gloria@cnews.net"
    },
    {
      "url": "https://www.jungleisland.com/privacy-policy/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/privacy-policy/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/privacy-policy/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/frequently-asked-questions/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/frequently-asked-questions/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/frequently-asked-questions/",
      "email": "guestrelations@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/frequently-asked-questions/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/frequently-asked-questions/",
      "email": "nsaavedra@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "email": "aziadie@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "email": "cvelez@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "email": "msalinas@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "email": "nsaavedra@jungleisland.com"
    },
    {
      "url": "https://www.travelstride.com/blog/top-10-most-amazing-jungles-in-the-world",
      "email": "55353@travelstride.com"
    },
    {
      "url": "https://www.jungleisland.com/contact/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/contact/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/contact/",
      "email": "guestrelations@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/contact/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/baby-capybara-encounter/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/baby-capybara-encounter/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/baby-capybara-encounter/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/park-information/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/park-information/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/park-information/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.jungleisland.com/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/our-history/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/our-history/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/our-history/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungle-island.com/contact",
      "email": "info@jungle-island.com"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/super-vip/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/super-vip/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/super-vip/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungle.ai/who-we-are",
      "email": "sales@jungle.ai"
    },
    {
      "url": "https://www.jungleisland.com/careers/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/careers/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/careers/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.thejungletribe.com.au/contact",
      "email": "info@thejungletribe.com.au"
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "email": "aziadie@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "email": "cvelez@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "email": "logo_words_blue@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "email": "msalinas@jungleisland.com"
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "email": "nsaavedra@jungleisland.com"
    },
    {
      "url": "https://therealdeal.com/miami/2024/06/03/jungle-island-planning-miami-condo-tower-with-terra/",
      "email": "news@therealdeal.com"
    },
    {
      "url": "https://therealdeal.com/miami/2024/06/03/jungle-island-planning-miami-condo-tower-with-terra/",
      "email": "trd@therealdeal.com"
    },
    {
      "url": "https://www.jungleislandzoo.com/contact-us/",
      "email": "jungleisland@yahoo.com"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/flamingo-experience/",
      "email": "booknowbadge@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/flamingo-experience/",
      "email": "booknowbadgeshort@2x.png"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/flamingo-experience/",
      "email": "logo_words_blue@2x.png"
    }
  ],
  "mails": [
    "55353@travelstride.com",
    "advertising@communitynewspapers.com",
    "aziadie@jungleisland.com",
    "booknowbadge@2x.png",
    "booknowbadgeshort@2x.png",
    "cvelez@jungleisland.com",
    "gloria@cnews.net",
    "guestrelations@jungleisland.com",
    "info@jungle-island.com",
    "info@scibpaints.com",
    "info@thejungletribe.com.au",
    "jungleisland@yahoo.com",
    "logo_words_blue@2x.png",
    "msalinas@jungleisland.com",
    "news@therealdeal.com",
    "nsaavedra@jungleisland.com",
    "sales@jungle.ai",
    "trd@therealdeal.com"
  ],
  "nombre_sitio": "jungleisland.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.jungleisland.com/animal-encounters/vip-tours/",
      "text": "VIP Tour - Go Wild! - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. VIP Tour – Go Wild! Go WILD when you visit some of the most charismatic creatures! Savor special stops at our wallaby walkabout and lemur enclosure and then flamingle with the flock of Jungle Island flamingos! Our VIP tours also include a special added encounter with your choice of exotic parrots, reptiles, or our giant tortoises. Our tour will include an interaction with each! – be prepared for a unique encounter with these incredible species! IMPORTANT NOTICE: Participants between Age 6 and Age 16 need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ Looking for a VIP Tour for all ages? Check out our Kids VIP Experience! $299 .00 VIP Tour - Go Wild! ages 6 and up Includes Park, Playground & Treewalk Village BOOK NOW $199 .00 Kids VIP Experience all ages welcome Includes Park, Playground & Treewalk Village BOOK NOW Image Gallery Frequently Asked Questions Do I need to make a reservation for the VIP - Go Wild Tour? Reservations can be made in person or through the website. Reservations are recommended. Participants can book on a walk-in, same day basis if there is availability. Is there an age requirement for the VIP - Go Wild Tour? Yes. Children must be 6 years old or older to participate. Guests 16 and under need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ What should I wear for the VIP - Go Wild Tour? We suggest being as comfortable as possible. When should I arrive for my VIP - Go Wild Tour? Where do I meet my trainer? We ask you arrive to the Guest Relations Office 10 minutes before your scheduled encounter. Your trainer will pick you up from the Guest Relations Office and take you to the encounter. Will there be a photographer in the VIP - Go Wild Tour? Professional photographers are readily available to immortalize your animal encounters with their expert lens skills. Capture those unforgettable moments with the help of professional photographers specializing in animal photography. Can I take my own pictures during the encounter? Absolutely! Feel free to take your own pictures. What are Jungle Island's inclement weather protocols? Rainy days and storms are inevitable in Miami, so Jungle Island is open rain or shine!  Some pathways are under cover but much of the park is open to the elements. To keep Jungle Island’s guests, staff, and animals safe during storms we abide by the following protocols. When lightning occurs within 10 miles of Jungle Island, animal encounters and tree walk village will be temporarily closed to the public. Jungle Island officials will wait to reopen these experiences until 15-30 minutes after the last lightning strike. All guests are then encouraged to stay under cover and out of the storm. This is a great time to get a bite to eat or browse our gift shop! Guests who have purchased animal encounters will have the opportunity to reschedule or join a tour later in the day if space is available. Jungle Island animals may also be taken to behind the scenes housing during the inclement weather. Not to worry though! These animals will come back out once it is safe to do so. These policies and procedures are in place to keep our adventurers safe and we thank you in advance for your understanding. You may also like Lemur Encounter An unforgettable interaction! Meet and interact with a troop of beautiful lemurs. Sloth Encounter One of a kind experience! Feel time slow and embrace the majestic sloth. Flamingo Experience Fantastically flamboyant! Feed and interact with American Flamingos! Jungle Island Animal Encounters VIP Tour – Go Wild! Jungle Island Animal Encounters VIP Tour – Go Wild! Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://communitynewspapers.com/biscayne-bay/jungle-island-finds-a-new-loving-home-for-parks-orangutan-family/",
      "text": "Jungle Island finds a new loving home for park’s orangutan family | Biscayne Bay Tribune# Sign in Publications Aventura Biscayne Bay Broward Community Newspapers Coral Gables Cutler Bay Doral Fort Lauderdale Kendall Miami-Dade Miami Beach Miami Gardens Miramar North Miami North Miami Beach Palmetto Bay Pinecrest South Dade South Miami Sunny Isles West Park Broward County Miami Community Newspaper Sponsored Content CNEWS TV CNEWS TV Media Kit Grant Miller Michael Miller Susan Miller Gloria Burns Oscar Musibay Willard Shepard Fara Sax Wilson Alvarez Categories Miami Cannabis News Automotive Car Reviews FIU Miami-Dade Community News Sports News Miami Community Newspaper Sponsored Content Newspaper Past Editions Aventura Biscayne Bay Broward Coral Gables Cutler Bay Doral Kendall Miami Beach Miami Gardens Miramar News Palmetto Bay Pinecrest South Miami Sunny Isles West Park Events Submit Event Community Events Photo Gallery Latin Builders Association Community News Legal Notices Place Legal Notices Broward County Legal Notices Miami-Dade County Legal Notices City Legal Notices City of Coral Gables City of Hialeah City of Homestead City of North Miami City of Sweetwater City of West Miami Miami-Dade College Town of Cutler Bay Town of Miami Lakes Village of Biscayne Park Village of Palmetto Bay Village of Pinecrest Inspire Health Articles Past Issues Contact About Us Contact Us Legal Notices Submit Press Release E-Newsletters Subscribe Miami-Dade Email Newsletters Broward County Email Newsletter Aventura Email Newsletter Biscayne Bay Tribune Email Newsletter Coral Gables Email Newsletter Cutler Bay Email Newsletter Doral Email Newsletter Kendall Email Newsletter Miami Beach Email Newsletter Palmetto Bay Email Newsletters Pinecrest Email Newsletter South Miami Email Newsletter Sunny Isles Email Newsletter West Park Email Newsletters Inspire Health Email Newsletter Chamber Spotlight Email Newsletter Subscribe Sign in Welcome! Log into your account your username your password Forgot your password? Password recovery Recover your password your email Search Ads: 305.669.7355 Legal Notices: 305.669.7031 Office: 305.669.7030 Facebook Instagram Linkedin Twitter Youtube Advertise  305.669.7355 Media Kit Pay Online Contact Advertise 305.669.7355 Legal Notices 305.669.7031 Office 305.669.7030 Request Info Submit a Press Release Legal Notices 305.669.7031 Events Submit Event View all Events Special Sections Reviews Facebook Instagram Linkedin Twitter Youtube Publications Aventura Biscayne Bay Broward Community Newspapers Coral Gables Cutler Bay Doral Fort Lauderdale Kendall Miami-Dade Miami Beach Miami Gardens Miramar North Miami North Miami Beach Palmetto Bay Pinecrest South Dade South Miami Sunny Isles West Park Broward County Miami Community Newspaper Sponsored Content CNEWS TV CNEWS TV Media Kit Grant Miller Michael Miller Susan Miller Gloria Burns Oscar Musibay Willard Shepard Fara Sax Wilson Alvarez Categories Miami Cannabis News Automotive Car Reviews FIU Miami-Dade Community News Sports News Miami Community Newspaper Sponsored Content Newspaper Past Editions Aventura Biscayne Bay Broward Coral Gables Cutler Bay Doral Kendall Miami Beach Miami Gardens Miramar News Palmetto Bay Pinecrest South Miami Sunny Isles West Park Events Submit Event Community Events Photo Gallery Latin Builders Association Community News Legal Notices Place Legal Notices Broward County Legal Notices Miami-Dade County Legal Notices City Legal Notices City of Coral Gables City of Hialeah City of Homestead City of North Miami City of Sweetwater City of West Miami Miami-Dade College Town of Cutler Bay Town of Miami Lakes Village of Biscayne Park Village of Palmetto Bay Village of Pinecrest Inspire Health Articles Past Issues Contact About Us Contact Us Legal Notices Submit Press Release E-Newsletters Subscribe Miami-Dade Email Newsletters Broward County Email Newsletter Aventura Email Newsletter Biscayne Bay Tribune Email Newsletter Coral Gables Email Newsletter Cutler Bay Email Newsletter Doral Email Newsletter Kendall Email Newsletter Miami Beach Email Newsletter Palmetto Bay Email Newsletters Pinecrest Email Newsletter South Miami Email Newsletter Sunny Isles Email Newsletter West Park Email Newsletters Inspire Health Email Newsletter Chamber Spotlight Email Newsletter Subscribe More Search Home Biscayne Bay Tribune Jungle Island finds a new loving home for park’s orangutan family Biscayne Bay Tribune Jungle Island finds a new loving home for park’s orangutan family By Rachel Pinzur - October 10, 2020 Facebook Twitter Pinterest WhatsApp Getting your Trinity Audio player ready... Orangutan Connie, 43, poses for a beauty shot prior to being safely transported to her new home at the Center for Great Apes. With support from its owners ESJ Capital Partners, Jungle Island, a popular South Florida attraction, has found its orangutan family a new loving home. All five apes, including 16-year-old twins Peanut and Pumpkin, were safely transported on Sept. 18 to the Center for Great Apes where several family members reside. The Center for Great Apes is a non-profit sanctuary for orangutans and chimpanzees, located on more than 100 secluded acres in Wauchula. As Jungle Island moves forward with the next phase of a multi-million-dollar transformation to become Miami’s premier eco-adventure and entertainment destination, park leaders determined that relocating the attraction’s celebrated ambassadors would be in the best interest and welfare of the animals. “Along with Jungle Island’s veterinarian and the orangutans’ caretaker, we feel this is the right decision for the orangutans,” said Micha Dubernard, chief of staff at ESJ Capital Partners, which acquired Jungle Island in April 2017. “It was important to us that we find a facility where they can be together and stay as a family, as well as receive unrivaled care. They are in a peaceful, tranquil environment and will always be cherished in the stories shared with guests at Jungle Island.” In July 2012, Peanut gained national recognition when she was diagnosed with non-Hodgkin lymphoma and nursed back to health with the help of world-class care and chemotherapy generously provided by the Sylvester Comprehensive Cancer Center at the University of Miami Miller School of Medicine. Peanut has a fraternal twin sister, Pumpkin, which is a rarity in the animal kingdom. The other three orangutans that relocated to the Center for Great Apes are Hanna, Sinbad and Connie. “We are thrilled to welcome all five orangutans to our great ape family,” said Patti Ragan, Center for Great Apes’ founder and director. “We’ve enjoyed working with ESJ Capital Partners and the leadership team at Jungle Island to ensure a seamless transition for these extraordinary animals. Just like at Jungle Island, they will receive individualized and compassionate care.” The Center for Great Apes is now home to 28 orangutans and 31 chimpanzees. The sanctuary is known for its innovative approach to caring for primates. In addition to providing a life with dignity, the sanctuary is designed to allow the apes options and choices of space and companions. The tall habitats are three and four stories (32 to 40 feet) in height, and the apes can stroll through the woods through a mile-long aerial trailway system towards various habitats and see others of their species. These elevated walkways allow the apes to explore, walk to the health clinic, interact with one another, and change habitats. The apes are provided with many enrichment activities, a vital component to their care, as they are highly intelligent and creative. “As their human mother, I know that their futures will be bright at the Center for Great Apes,” said Linda Jacobs, who is the orangutans’ longtime caretaker at Jungle Island. “Each ape at the center is treated like an individual and with such compassion and integrity. It is important for animals that are so intelligent to have choices in their lives. I couldn’t ask for a more perfect situation and hope everyone will continue to follow their journey.” Jungle Island will continue to conduct interactive animal experiences to teach the public about endangered lemurs, two-toed sloths, Australian red kangaroos and other rare animals. Additionally, Jungle Island will offer immersive all-day adventures in a jungle-like setting including a TreeWalk Village and new aerial adventure park, which debuts this fall. Jungle Island, which is owned by Aventura-based ESJ Capital Partners, is undergoing a multi-million-dollar transformation into a premier eco-adventure park. A favorite South Florida landmark since 1936, the attraction is located across from PortMiami, between Downtown Miami and South Beach. On a typical day, Jungle Island takes guests on an epic journey through nature, animals, discovery, and play. From behind-the-scenes VIP tours to unforgettable interactions with some of the world’s most fascinating animals and thrilling attractions, Jungle Island offers guests a variety of real-life jungle experiences. For more information and updates, follow @JungleIsland on social media and visit www.jungleisland.com . Connect To Your Customers & Grow Your Business Click Here Rachel Pinzur TAGS Family finds home Island Jungle Loving New orangutan Park Facebook Twitter Pinterest WhatsApp Previous article Play: Woman recalls her shock election night four years ago Next article October 10 Rachel Pinzur RELATED ARTICLES MORE FROM AUTHOR Magnet Pull – Season 2 | Episode 1: What is a Magnet School? Strive 305 en español: Podcast para emprendedores con Jennifer Matute y Manuel Caicedo Carolyn & Jen Talk with Rep. Ashley Gantt | The First Alarm: Advocacy, Equity & Leadership Sign in Welcome! Log into your account your username your password Forgot your password? Get help Password recovery Recover your password your email A password will be e-mailed to you. - Advertisement - Advertise  305.669.7355 Media Kit Pay Online Contact Legal Notices 305.669.7031 Events Special Sections Reviews Advertise Promote your business to the localized audience you want to reach with Miami's Community Newspapers.  Call 305.669.7355 or view our Media Kit. Company Request Information Case Study Media Kit Newsletter Advertising Social Media Advertising Video Podcasts Events Advertising Terms and Conditions Terms & Conditions Privacy Policy Cookie Policy Editorial Policy About Us ADA Compliance Policy Latest Miami News Magnet Pull – Season 2 | Episode 1: What is a Magnet School? CNEWS TV September 10, 2025 0 ________________________________________________________________________\r\n\r\nMagnet Pull returns for Season 2!\r\n\r\nHost Dr. Magda Castro-Pereira,... Strive 305 en español: Podcast para emprendedores con Jennifer Matute y Manuel Caicedo CNEWS TV September 10, 2025 0 ________________________________________________________________________\r\n\r\nStrive 305 en español: Podcast para emprendedores en español,... Carolyn & Jen Talk with Rep. Ashley Gantt | The First Alarm: Advocacy, Equity & Leadership CNEWS TV September 10, 2025 0 In this inspiring episode of The First Alarm, hosts... Follow us Facebook Instagram Linkedin Mail Twitter Youtube © 2023 Miami's Community Newspapers a Miller Publishing Company. 6796 SW 62nd Avenue South Miami, Florida 33143 (305) 669-7030"
    },
    {
      "url": "https://www.jungleisland.com/privacy-policy/",
      "text": "Privacy Policy - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Privacy Policy Last updated March 4, 2019 Jungle Island (“we” or “us” or “our”) respects the privacy of our users (“user” or “you”). This Privacy Policy explains how we collect, use, disclose, and safeguard your information when you visit our website http://jungleisland.com including any other media form, media channel, mobile website, or mobile application related or connected thereto (collectively, the “Site”). Please read this Privacy Policy carefully. IF YOU DO NOT AGREE WITH THE TERMS OF THIS PRIVACY POLICY, PLEASE DO NOT ACCESS THE SITE. We reserve the right to make changes to this Privacy Policy at any time and for any reason. We will alert you about any changes by updating the “Revised” date of this Privacy Policy. Any changes or modifications will be effective immediately upon posting the updated Privacy Policy on the Site, and you waive the right to receive specific notice of each such change or modification. You are encouraged to periodically review this Privacy Policy to stay informed of updates. You will be deemed to have been made aware of, will be subject to, and will be deemed to have accepted the changes in any revised Privacy Policy by your continued use of the Site after the date such revised Privacy Policy is posted. COLLECTION OF YOUR INFORMATION We may collect information about you in a variety of ways. The information we may collect on the Site includes: Personal Data Personally identifiable information, such as your name, shipping address, email address, and telephone number, and demographic information, such as your age, gender, hometown, and interests, that you voluntarily give to us when you choose to participate in various activities related to the Site, such as online chat and message boards. You are under no obligation to provide us with personal information of any kind, however your refusal to do so may prevent you from using certain features of the Site. Derivative Data Information our servers automatically collect when you access the Site, such as your IP address, your browser type, your operating system, your access times, and the pages you have viewed directly before and after accessing the Site. Financial Data Financial information, such as data related to your payment method (e.g. valid credit card number, card brand, expiration date) that we may collect when you purchase, order, return, exchange, or request information about our services from the Site. We store only very limited, if any, financial information that we collect. Otherwise, all financial information is stored by our payment processor, Gateway eGalaxy , and you are encourage to review their privacy policy and contact them directly for responses to your questions. USE OF YOUR INFORMATION Having accurate information about you permits us to provide you with a smooth, efficient, and customized experience. Specifically, we may use information collected about you via the Site to: Compile anonymous statistical data and analysis for use internally or with third parties. Deliver targeted advertising, coupons, newsletters, and promotions, and other information regarding our website and mobile application to you. Fulfill and manage purchases, orders, payments, and other transactions related to the Site. Generate a personal profile about you to make future visits to the Site more personalized. Increase the efficiency and operation of the Site. Monitor and analyze usage and trends to improve your experience with the Site. Offer new products, services, and/or recommendations to you. Perform other business activities as needed. Prevent fraudulent transactions, monitor against theft, and protect against criminal activity. Respond to product and customer service requests. Solicit support for the Site. DISCLOSURE OF YOUR INFORMATION We may share information we have collected about you in certain situations. Your information may be disclosed as follows: By Law or to Protect Rights If we believe the release of information about you is necessary to respond to legal process, to investigate or remedy potential violations of our policies, or to protect the rights, property, and safety of others, we may share your information as permitted or required by any applicable law, rule, or regulation. This includes exchanging information with other entities for fraud protection and credit risk reduction. Third-Party Service Providers We may share your information with third parties that perform services for us or on our behalf, including payment processing, data analysis, email delivery, hosting services, customer service, and marketing assistance. Sale or Bankruptcy If we reorganize or sell all or a portion of our assets, undergo a merger, or are acquired by another entity, we may transfer your information to the successor entity. If we go out of business or enter bankruptcy, your information would be an asset transferred or acquired by a third party. You acknowledge that such transfers may occur and that the transferee may decline honor commitments we made in this Privacy Policy. We are not responsible for the actions of third parties with whom you share personal or sensitive data, and we have no authority to manage or control third-party solicitations. If you no longer wish to receive correspondence, emails or other communications from third parties, you are responsible for contacting the third party directly. TRACKING TECHNOLOGIES Cookies and Web Beacons We may use cookies, web beacons, tracking pixels, and other tracking technologies on the Site to help customize the Site and improve your experience. For more information on how we use cookies, please refer to our Cookie Policy posted on the Site, which is incorporated into this Privacy Policy. By using the Site, you agree to be bound by our Cookie Policy. Website Analytics We may also partner with selected third-party vendors, such as Google Analytics, to allow tracking technologies and remarketing services on the Site through the use of first party cookies and third-party cookies, to, among other things, analyze and track users’ use of the Site, determine the popularity of certain content and better understand online activity. By accessing the Site, you consent to the collection and use of your information by these third-party vendors. You are encouraged to review their privacy policy and contact them directly for responses to your questions. We do not transfer personal information to these third-party vendors. However, if you do not want any information to be collected and used by tracking technologies, you can visit the third-party vendor or Network Advertising Initiative Opt-Out Tool or Digital Advertising Alliance Opt-Out Tool . You should be aware that getting a new computer, installing a new browser, upgrading an existing browser, erasing or otherwise altering your browser’s cookies files may also clear certain opt-out cookies, plug-ins, or settings. THIRD-PARTY WEBSITES The Site may contain links to third-party websites and applications of interest, including advertisements and external services, that are not affiliated with us. Once you have used these links to leave the Site, any information you provide to these third parties is not covered by this Privacy Policy, and we cannot guarantee the safety and privacy of your information. Before visiting and providing any information to any third-party websites, you should inform yourself of the privacy policies and practices (if any) of the third party responsible for that website, and should take those steps necessary to, in your discretion, protect the privacy of your information. We are not responsible for the content or privacy and security practices and policies of any third parties, including other sites, services or applications that may be linked to or from the Site. GOOGLE MAPS This website uses Google Maps APIs. You may find the Google Maps APIs Terms of Service here . To better understand Google’s Privacy Policy, please refer to this link . By using our Maps API Implementation, you agree to be bound by Google’s Terms of Service. SECURITY OF YOUR INFORMATION We use administrative, technical, and physical security measures to help protect your personal information. While we have taken reasonable steps to secure the personal information you provide to us, please be aware that despite our efforts, no security measures are perfect or impenetrable, and no method of data transmission can be guaranteed against any interception or other type of misuse. Any information disclosed online is vulnerable to interception and misuse by unauthorized parties. Therefore, we cannot guarantee complete security if you provide personal information. POLICY FOR CHILDREN We do not knowingly solicit information from or market to children under the age of 13. If you become aware of any data we have collected from children under age 13, please contact us using the contact information provided below. CONTROLS FOR DO-NOT-TRACK FEATURES Most web browsers and some mobile operating systems include a Do-Not-Track (“DNT”) feature or setting you can activate to signal your privacy preference not to have data about your online browsing activities monitored and collected. No uniform technology standard for recognizing and implementing DNT signals has been finalized. As such, we do not currently respond to DNT browser signals or any other mechanism that automatically communicates your choice not to be tracked online. If a standard for online tracking is adopted that we must follow in the future, we will inform you about that practice in a revised version of this Privacy Policy. CALIFORNIA PRIVACY RIGHTS California Civil Code Section 1798.83, also known as the “Shine The Light” law, permits our users who are California residents to request and obtain from us, once a year and free of charge, information about categories of personal information (if any) we disclosed to third parties for direct marketing purposes and the names and addresses of all third parties with which we shared personal information in the immediately preceding calendar year. If you are a California resident and would like to make such a request, please submit your request in writing to us using the contact information provided below. If you are under 18 years of age, reside in California, and have a registered account with the Site, you have the right to request removal of unwanted data that you publicly post on the Site. To request removal of such data, please contact us using the contact information provided below, and include the email address associated with your account and a statement that you reside in California. We will make sure the data is not publicly displayed on the Site, but please be aware that the data may not be completely or comprehensively removed from our systems. CONTACT US If you have questions or comments about this Privacy Policy, please contact us at: Jungle Island 1111 Parrot Jungle Trail Miami, Florida 33132 United States Phone: (305) 400 – 7000 Fax: (305) 400 – 7291 Jungle Island Privacy Policy Jungle Island Privacy Policy Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.jungleisland.com/frequently-asked-questions/",
      "text": "Frequently Asked Questions - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. Frequently Asked Questions General Information What are your hours of operation? We are open seven days a week, 365 days a year! Park Hours: 9:30am-5:00pm Last Admission: 4:00pm What is included with General Admission? General Admission includes access to Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. How long does it take to fully experience the park? Depending on your experience, the average time in the park can range from 2-5 hours! What makes Jungle Island special? Jungle Island is a premier entertainment and outdoor adventure destination in Miami, with over 85+ years of rich history! Nestled between Downtown Miami and South Beach, Jungle Island features many playgrounds, animal sightings, and the only aerial adventure park in South Florida, Treetop Trekking Miami. What should I wear to the park? We recommend comfy clothes and closed-toe shoes for your adventure! Don't forget your sunscreen, hats, and sunglasses. Tickets & Payments Should I buy my tickets online, or can I purchase tickets at the park? Tickets are available both online and at the park. However, we recommend purchasing online in advance to secure your spot! Is Cash accepted in the park for payment? Jungle Island is a cashless park. We accept credit cards, debit cards, Apple Pay, and Google Pay. Animal Experiences Can guests touch or feed the animals or parrots in the park? For the safety of our animals and guests, touching or feeding animals is only allowed during guided animal encounters. At what time is your show? Guardians of the Jungle Show runs every day at 11:30am and 3:00pm at the Jungle Theater. Can I still take pictures with the parrots? Absolutely! You'll find our iconic parrots perched throughout the park, ready for the perfect photo. While they make great models, please note they cannot be picked up or held. Accessibility & Mobility Is Jungle Island wheelchair accessible? Yes, Jungle Island is wheelchair accessible. Please do keep in mind that our animal encounters are not accessible to wheelchairs. Do you have wheelchairs? Yes, we have wheelchairs available upon request on a first-come, first-served basis. Are scooters and bikes allowed in the park? For the safety of our guests and animals, scooters and bikes are not allowed inside the park. Food & Drink Do you have food and drinks in the park? Yes, you can refuel your wild adventure with delicious bites from Pink Flamingo Kitchen & Bar. With many more options to choose from, there's something for every kind of explorer! Can we bring our own food and drinks? Outside food and drinks are not permitted inside the park. For any dietary needs, please contact guestrelations@jungleisland.com . Parking & Transportation Is there a fee for parking? Yes, our covered garage has a flat rate of $20 per day. Policies & Safety What if it rains on my visit? Rainy days and storms are inevitable in Miami, so Jungle Island is open rain or shine! What is Jungle Island's inclement weather protocols? To keep Jungle Island’s guests, staff, and animals safe during storms, we follow these protocols. When lightning occurs within 10 miles of Jungle Island, animal encounters and tree walk village will be temporarily closed to the public. Jungle Island officials will wait to reopen these experiences until 15-30 minutes after the last lightning strike. All guests are then encouraged to stay under cover and out of the storm. This is a great time to get a bite to eat or browse our gift shop! Guests who have purchased animal encounters will have the opportunity to reschedule or join a tour later in the day if space is available. Jungle Island animals may also be taken to behind the scenes housing during the inclement weather. Not to worry, though! These animals will come back out once it is safe to do so. These policies and procedures are in place to keep our adventurers safe, and we thank you in advance for your understanding. Are pets allowed? While we love all animals, only trained service dogs (dogs that are individually trained to do work or perform tasks for people with disabilities) will be permitted to enter the park. Are weapons permitted in the park? No, weapons are not permitted inside the park. Events & Celebrations Can we celebrate birthdays in the jungle? Definitely, we'd love to celebrate with you! Please contact our events team at nsaavedra@jungleisland.com to book your event as no outside food/decorations/cake is allowed inside the park. Jungle Island Frequently Asked Questions Jungle Island Frequently Asked Questions Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.jungleisland.com/events/",
      "text": "Group Events - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. Your browser does not support HTML5 video. The Best Location. Jungle Island provides a great day out for any company or group. Our amazing animals, exciting exhibits and sensational shows make Jungle Island the perfect choice for a company picnic, large group outing or private daytime or evening event. Our event specialists will create your personalized event solution, from extraordinary menus under the direction of Executive Chef Gregg Nuguid, to world class atmospheres and event experiences. From weddings and showers to bar mitzvahs and quinces, we will help you design your dream event. Inquiries Chat Now Gallery of Spaces Private Event Software powered by Tripleseat Chef Gregg Nuguid – Executive Chef With over 30 years of experience in world-class hotels, resorts, and casinos, Chef Nuguid brings a wealth of culinary expertise to Jungle Island. As Executive Chef, he oversees all dining experiences, from daily park offerings to private events and large-scale galas. His passion for innovative cuisine and high-quality ingredients ensures that every meal elevates your Jungle Island experience. Aston H. Ziadie Special Events Senior Manager aziadie@jungleisland.com 305-400-7230 Maria Salinas Events Sales Manager msalinas@jungleisland.com 305-400-7230 Natalia Saavedra Event Sales Coordinator nsaavedra@jungleisland.com 305-400-7230 Carlos Velez, CPCE General Manager, Food & Beverage cvelez@jungleisland.com 305-400-7230 Do you have a site fee for weddings/events at your venue? ﻿ Yes What is the starting site fee for weddings/events during peak season? $2500 What is the starting site fee for weddings/events during oﬀ-peak season? $1500 What is included in the per person price? Food/Bar/Tables/Chairs/Linens/Flatware What is the starting price per person for 4 hours bar service? $42 What is included in the starting price for bar service? deluxe brands, domestic beers, house wine, sodas & juices What is the maximum capacity of your venue? Indoor/Outdoor 5000 How many event spaces or rooms does your venue oﬀer? 10 Jungle Island Group Events Jungle Island Group Events Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.travelstride.com/blog/top-10-most-amazing-jungles-in-the-world",
      "text": "Top 10 Most Amazing Jungles in the World Search Search Tours Design custom trip My Map & Lists Sign In Destinations Trending Machu Picchu Angkor Wat Danube River Mt. Kilimanjaro Rivers & Seas Galapagos Mediterranean Sea Ciudad Perdida (The Lost City) Mideast & N. Africa Mekong River Europe France Italy Croatia Ireland Greece Switzerland Spain Portugal Scandinavia See all > South America Peru Ecuador Brazil Argentina Chile Colombia Patagonia Amazon Rainforest Bolivia See all > Asia China India Cambodia Turkey Thailand Japan Indonesia Nepal Jordan See all > Africa Tanzania South Africa Kenya Morocco Egypt Botswana Rwanda Madagascar Ethiopia See all > North America United States Canada Mexico See all > Australia & Pacific Australia New Zealand Pacific Island See all > Antarctica & Arctic Antarctica Arctic Norway See all > Caribbean & C. America Costa Rica Belize Bahamas See all > See all destinations > Trip Themes & Styles Top Trips Top 10 Lists Editor Picks Most Popular Trips Award Winners Collections Top Trending See all activities, themes, and interests > Activities Cycling & Biking Small Ship Cruises Safari River Cruises Climbing and Mountaineering Trekking & Camping Hiking & Walking Train & Rail River Rafting Yoga, Meditation & Wellness Styles 50+ Family Friendly 18-30 Luxury Budget Adventure Travel Solo and Single Trips Group Guided Tours Custom Tour Packages Independent Vacation Packages Private Guided Interests Cultural Wildlife History Nature Birding tours Festivals and Special Events Eco/Sustainable Travel Volunteering Learning & Educational Ruins & Archaeology Culinary & Wine Tasting See all activities, themes, and interests > Tour Company Reviews Fun & Helpful Member Savings Program Tour operators Rover TripFinder AI Affiliate Partners Travel Trivia Game About Us Travel Articles Contact Us Gift Cards Contact Us 10 Most Amazing Jungles Around the World By Samantha Scott July 20, 2021 Plan your own jungle adventure Read more about top jungle attractions & things to do > Find trips to the world's top rainforests > Design your own dream jungle adventure > You enter the jungle - the distant sound of a howler monkey’s whoops a distinct reminder that you are far from alone. Thousands of jungle dwellers expertly camouflaged by dense foliage wait just out of sight. And the more you listen, the more the buzz of life becomes apparent, from the damp forest floor to the far reaches of the canopy above. Did you know? Rainforests cover about 3% of the planet's surface - but this number is shrinking rapidly as a result of deforestation. Jungles and rainforests are home to half of the world's terrestrial species (ie. land-dwelling plants and animals). There's actually a difference between what is considered a jungle and a rainforest : jungles are just dense forests while rainforests are forests with high amounts of rainfall. Learn more about how you can help protect our jungles through sustainable tourism >> TL;DR: Jungles are home to a wide array of astonishing wildlife and fauna- and are an essential part of our ecosystem. See over 6,500 jungle tours on Travelstride » Or read on to find out how you can discover the most amazing jungles in the world ... Jungles and rainforests have been frontiers traversed by explorers for centuries. They have a mystique, perpetuated by novels and movies, such as the epic 2016 flick Tarzan. Tarzan is set in a fictional, or at least not named, West African jungle. Many have speculated Cameroon, which would make sense with its coastal beauty and jungle interior creating the perfect landscape for Tarzan’s many adventures. Although Tarzan may not be based on reality, there are plenty of jungles around the world that offer the same rainforest type escape from civilization- many of which host ethnic communities that live off the land and abundant resources these dense forests provide. How well do you know the world? Play the game Compare your travel trivia knowledge with friends. How many can you get right in 1 minute? Continues below ...continued 1. The Jungles of Borneo The island of Borneo is the third-largest island in the world, the first two being Greenland and New Guinea, and is almost entirely jungle. It's an astonishing 130 million years old and home to a wide array of rare creatures and plants. Off the coast of Malaysia , it’s the perfect destination for wildlife enthusiasts - and one of the only places in the world to see the distinctive proboscis monkey, pygmy elephants, and beautiful clouded leopard. Trip recommendation: Classic Borneo by Intrepid Travel 2. The Brazilian Amazon The Amazon Rainforest is probably one of the world’s most well-known jungles. Home to over 10,000 species, with more being discovered every day, it’s a hotbed of incredible biodiversity. Spanning over 9 countries, but most prevalently in Brazil , it’s a popular river cruise destination - but be prepared for some hiking and humidity! Trip Recommendation: Cruising the Amazon River by Kuoda Travel 3. India - The Jungles of Kipling India’s jungles inspired turn of the century explorer and author Rudyard Kipling who wrote the popular fable “The Jungle Book” (another classic which was also made into a Disney movie). Kanha National Park is an excellent place to start for a Kipling-esque experience. One of the world’s largest tiger preserves, you’re sure to encounter your own personal Sherkan here. Trip Recommendation: India Tiger Volunteer Adventure by Discover Corps Travelstride Gift Card One card, thousands of extraordinary trips Explore Continues below ...continued 4. Sinharaja Forest Reserve - Sri Lanka Nadeera Jayasinghe, Flickr Another very Jungle Book-inspired destination, Sri Lanka’s jungles have a distinct aura of enigma and intrigue. With ancient structures throughout and tropical flora and fauna, you’ll feel like Tarzan or Mowgli himself is following your group, swinging through the trees above as you enter the forest. The forest itself is a UNESCO World Heritage Site and one of Sri Lanka's last visible rainforests. Stefan Krasowski, Flickr Trip Recommendation : Sri Lanka's Wildlife Highlights by Audley Travel 5. Tarzan’s Africa Mone Loe, Flickr The coastal jungles of West Africa likely inspired Edgar Rice Burroughs in the early 1900s as he set down his now famous first edition of the Tarzan story. However, today, some of the most accessible jungle on the African continent will be found in Uganda and Rwanda. Check out a Gorilla trek to get up close and personal with these incredible animals - Tarzan’s surrogate family. Trip Recommendation: Gorillas & Game Parks by Intrepid Travel 6. The Wild Jungles of Papua New Guinea Fascinating Papua New Guinea is over 75% jungle, and home to hundreds of unique species. Due to the country’s proximity to Australia, it’s the only other place on earth where you’ll find native marsupials such as kangaroos, living in the wild. With a wide range of ancient native cultures, it’s the perfect destination for history lovers as well as outdoor enthusiasts. Trip Recommendation: Wonders of New Guniea by Evaneos Connect & Share \" 10 Most Amazing Jungles Around the World \" Continues below ...continued 7. Christmas Island's Crazy Wildlife If you’re arachnophobic, or especially ostraconophobic, you may want to avoid Christmas Island - where the gifts under the trees will not be a welcome site. Home to, among other things, 40 million Red Crabs, and the Coconut Crab (one of the largest of this species), Christmas Island often looks like another planet. The Australian territory, just south of Indonesia, is a popular destination for wildlife and nature enthusiasts . 8. Ancient Waipoua Forest - New Zealand Located on the North Island of New Zealand , Waipoua is one of the earth’s oldest forests. Travel here to see the ancient, intimidatingly large Kauri Trees, with their massive trunks and bushy tops. Nearby, definitely don’t miss the incredible glow worm caves - an absolute must-see for the stunning neon display. Larry Koester, Flickr Trip recommendation: 24 Day Discover New Zealand by Real New Zealand Tours Popular posts 15 Top Bucket List Destinations Best Tours & Trips to Ecuador & Galapagos Islands 2023 Top Tips for Planning a Trip to Machu Picchu Italy vs France: Which Travel Destination is Right For You? Best Castles in Japan See all blog posts Continues below ...continued 9. Cloud Forest - Peru Peter Collins, Flickr A trip through Peru’s cloud forest is a right of passage for those seeking the lost city of the Inca’s: Machu Picchu . Nothing beats the view when you rise above the cloud cover and see the iconic citadel come into view. On your trek you’ll come across thousands of rare and unusual plant species, thriving in the unique ecosystem created by the low-lying and constant clouds which allow only intermittent sunlight to reach the forest floor. Trip recommendation: Cusco and Machu Picchu by World Expeditions 10. Monteverde Cloud Forest - Costa Rica Costa Rica’s forests attract adventure travel enthusiasts year-round, and for good reason. Another brilliant cloud forest, Monteverde is a sight to behold. And you can see it from a zip line, rope bridge, or “sky tram.” Any of these thrilling activities will allow you to truly appreciate the density and biodiversity of these forests which don’t see regular sunlight by virtue of their geographic location. But when they do - you’ll want your camera. The sun breaking through the clouds creates breathtaking patterns and shafts of light, such that you’ll want to stop whatever you’re doing to capture it. Hopefully you’re not in the middle of a zip line though. Trip recommendation: Costa Rica Wildlife Safari by Discover Corps Ready to embark on your own journey to explore the depths of the world's jungles? See all Jungle & Rainforest tours » See all tour operator reviews Recent posts Enjoying Fine Food, Wine and More Along France’s Canals Unforgettable Family Adventures in Thailand: Just in Time for Thai Mother’s Day Why Travelstride - Your Path to the Perfect Trip Hourglass Expeditions Joins Travelstride’s Partner Network Crucemundo Joins Travelstride’s Partner Network See all blog posts Close Sign in to reveal savings up to $700 per person! Continue With Google Continue With Email Find wonderful travel, your way Travelstride helps you search and compare 50,000+ expert-planned trips from 1,000+ companies. Get the real picture with both traveler and expert reviews to ensure the trip you book is the right one for you. travelstride About Travelstride Why Travelstride Member Benefits Press Travel Expert Blog Why Group Tours connect Join the Community Write a Review Tour Operators Careers FAQs & Help Blog Contact Affiliate Program Tours & Operators on Travelstride Awarded and Featured by: © 2025 Travelstride. All rights reserved. Site Map | Global Site Map | Terms of Use | Privacy Policy"
    },
    {
      "url": "https://www.jungleisland.com/contact/",
      "text": "Contact - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Contact TEL: (305) 400-7000 FAX: (305) 400-7291 1111 Parrot Jungle Trail Miami, Florida 33132 guestrelations@jungleisland.com Jungle Island Contact Jungle Island Contact Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/baby-capybara-encounter/",
      "text": "Baby Capybara Encounter - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. Baby Capybara Encounter Come Hang Out with the Cutest Baby Capybaras You Will Ever See! Feed and Interact with the Jungle Island Capybaras Get ready to go wild with baby capys! In this 30-minute adventure, you’ll hand-feed them their favorite snacks, enjoy up-close interactions, and make unforgettable memories with the world’s largest (and cutest) rodent. IMPORTANT NOTICE: Participants between Age 6 and Age 16 need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ $95 .00 Baby Capybara Encounter ages 6 and up Includes Park, Playground & Treewalk Village BOOK NOW Image Gallery Frequently Asked Questions Do I need to make a reservation for the Baby Capybara Encounter? Reservations can be made in person or through the website. Reservations are recommended. Participants can book on a walk-in, same day basis if there is availability. Is there an age requirement for the Baby Capybara Encounter? Yes. Children must be 6 years old or older to participate. Guests 16 and under need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ What should I wear for the Baby Capybara Encounter? We suggest being as comfortable as possible. When should I arrive for my Baby Capybara Encounter? Where do I meet my trainer? We ask you arrive to the Guest Relations Office 10 minutes before your scheduled encounter. Your trainer will pick you up from the Guest Relations Office and take you to the encounter. Will there be a photographer in the Baby Capybara Encounter? Professional photographers are readily available to immortalize your animal encounters with their expert lens skills. Capture those unforgettable moments with the help of professional photographers specializing in animal photography. Can I take my own pictures during the encounter? Absolutely! Feel free to take your own pictures. What are Jungle Island's inclement weather protocols? Rainy days and storms are inevitable in Miami, so Jungle Island is open rain or shine!  Some pathways are under cover but much of the park is open to the elements. To keep Jungle Island’s guests, staff, and animals safe during storms we abide by the following protocols. When lightning occurs within 10 miles of Jungle Island, animal encounters and tree walk village will be temporarily closed to the public. Jungle Island officials will wait to reopen these experiences until 15-30 minutes after the last lightning strike. All guests are then encouraged to stay under cover and out of the storm. This is a great time to get a bite to eat or browse our gift shop! Guests who have purchased animal encounters will have the opportunity to reschedule or join a tour later in the day if space is available. Jungle Island animals may also be taken to behind the scenes housing during the inclement weather. Not to worry though! These animals will come back out once it is safe to do so. These policies and procedures are in place to keep our adventurers safe and we thank you in advance for your understanding. You may also like Lemur Encounter An unforgettable interaction! Meet and interact with a troop of beautiful lemurs. Sloth Encounter One of a kind experience! Feel time slow and embrace the majestic sloth. VIP Tours Get the VIP treatment! Enjoy a private tour that brings you closer to wildlife than ever before! Jungle Island Animal Encounters Baby Capybara Encounter Jungle Island Animal Encounters Baby Capybara Encounter Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.jungleisland.com/park-information/",
      "text": "Park Information - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. Park Information Park Hours Park Map Directions GENERAL ADMISSION Every Day 9:30am - 5pm (last admission to park 4pm) JUNGLE SPLASH Monday - Friday 11am - 3:30pm (last admission 2:45) Saturday & Sunday 11am - 4:30pm (last admission 4pm) NALU ACROBATIC SHOW Wednesday - Monday 2:00pm LUMINOSA Sunday - Thursday 5:30pm - 9:30pm (last admission 9pm) Friday - Saturday 5:30pm - 10:30pm (last admission 10pm) ANIMAL ENCOUNTERS Every Day 9:30am - 4pm (last admission to park 3pm) Don't Get Lost In The Jungle! Click here to download a printable park map. 1111 Parrot Jungle Trail Miami, FL 33132 From I-95 Take I-395 East (MacArthur Causeway) exit 2D. Cross over the bridge and make your first right after the bridge onto Parrot Jungle Trail. Follow the road around and under the bridge to the parking garage on the left-hand side. From the East Take I-395 West (MacArthur Causeway), and make the first right turn after Palm Island, next to the Miami Yacht Club. Make the first left turn onto Parrot Jungle Trail and the parking garage will be on the right-hand side. Public Transportation Visit Miami-Dade transit at www.miamidade.gov/transit or call 305-770-3131 for detailed route information. Routes C, M, S, and 120 all provide bus service to Jungle Island. Jungle Island Park Information Jungle Island Park Information Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.jungleisland.com/",
      "text": "Jungle Island | Miami’s Iconic Wildlife Park & Attractions Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. Your browser does not support HTML5 video. PLAYGROUNDS ANIMAL ENCOUNTERS TREETOP TREKKING EDUCATIONAL SHOW PLAYGROUNDS TREETOP TREKKING EDUCATIONAL SHOW PLAYGROUNDS TREETOP TREKKING EDUCATIONAL SHOW THE HORRORLAND ANIMAL ENCOUNTERS General Admission Unleash your inner explorer and discover the treasures Jungle Island has to offer. Included with General Admission: Treewalk Village Wildlife Exhibits Guardians Of The Jungle Show Everglades Habitat Playground Manu Aviary LEARN MORE Free Child Admission Unleash your inner explorer and discover the treasures Jungle Island has to offer. Included with General Admission: Treewalk Village Wildlife Exhibits Guardians Of The Jungle Show Everglades Habitat Playground Manu Aviary LEARN MORE Free Child Admission SCHOOL'S OUT, FUN'S IN! Included with General Admission: Treewalk Village Wildlife Exhibits Guardians Of The Jungle Show Everglades Habitat Playground Manu Aviary LEARN MORE Animal Encounters One of a kind interactions with amazing animals from around the world! Baby Capybara Encounter Lemur Encounter Sloth Encounter VIP Tours Petting Zoo Bunny Encounter Flamingo Encounter Capybara Encounter Wallaby Encounter Giant Tortoise Encounter LEARN MORE Treetop Trekking Miami Step into the exotic and adventurous world of Treetop Trekking, South Florida’s only aerial adventure park. Discovery Courses (Ages 5+) Explorer Trek (Ages 9+) Thrill-seeker Trek (Ages 9+) Night Trek (Ages 9+) LEARN MORE Jungle Island Events Jungle Island provides a great day out for any company or group. Our amazing animals, exciting exhibits and sensational shows make Jungle Island the perfect choice for a company picnic, large group outing or private daytime or evening event. Ballroom Salons Foyer Terrace LEARN MORE Frequently Asked Questions What are Jungle Island's operating hours? Jungle Island is open daily from 9:30 AM to 5:00 PM. The last admission to the park is at 4 PM. Please check our website for any seasonal or special event hour changes. What is included with general admission to Jungle Island? General admission includes full access to Jungle Island, Treewalk Village, playgrounds, numerous wildlife sightings including wallabies, birds, sloths and more, Everglades habitat, and educational animal shows. Is there parking available at Jungle Island, and what is the cost? Yes, Jungle Island offers a covered parking garage with a flat rate of $20 per day. Can I purchase tickets at the park, or should I buy them online? You can purchase tickets at the park or online. We recommend purchasing online in advance to ensure availability and for potential online-exclusive offers. How far is Jungle Island from Downtown Miami? It takes less than 10 minutes to get here from Downtown Miami as we are just across the causeway. Are there shaded areas or places to sit? Yes, we have many shaded areas throughout the park to take a break from your adventures. Is Jungle Island a zoo? No, we are not a zoo. We are an eco-adventure park that offers numerous activities for guests to enjoy such as ziplining and aerial adventures, and animal experiences. Is Jungle Island suitable for all ages? Yes! Jungle Island offers fun and educational experiences for guests of all ages. Are pets allowed at Jungle Island? No, pets are not allowed in the park for the safety of our animals and guests, with the exception of certified service animals. Is Jungle Island wheelchair accessible? Yes, Jungle Island is fully wheelchair accessible, and we offer wheelchair rentals on-site for guest convenience at a first-come, first-serve basis. Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.jungleisland.com/our-history/",
      "text": "Our History - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Our History Jungle Island, a favorite South Florida landmark, is an intimate zoological park located in the heart of Miami, between downtown Miami and South Beach. Building upon a rich tradition that began in 1936, Jungle Island is home to some of the world’s rarest and most exotic animals. Park guests enjoy engaging animal shows and informative exhibits while strolling by streams and waterfalls under a lush canopy of tropical trees. Guests can choose to participate in hands-on interactions with fascinating animals or go on guided behind-the-scenes VIP tours. Jungle Island enriches the lives of park visitors through immersive, real-life jungle experiences centered on adventure, animals, discovery and play. With its newly renovated Treetop Ballroom and picturesque outdoor spaces including a private beach, the 18-acre park also serves as Miami’s destination for extraordinary events. Discover Jungle Island today. Jungle Island: A South Florida Tradition for 80 Years Jungle Island, Miami’s premier entertainment destination, combines the beauty of Miami’s tropical landscape with a jungle full of extraordinary animals from around the globe. Building upon its rich 80-year history, today’s Jungle Island is a contemporary theme park, featuring numerous wildlife such as lemurs, wallabies, capybaras and much more! Jungle Island began its history in 1936 as Parrot Jungle. Created by Franz Scherr with the idea of an attraction where birds could “fly free,” Parrot Jungle was originally located in south Miami and was known primarily its wide array of exotic birds including Pinky, the high-wire bicycle riding cockatoo, and our world-famous pink flamingos who have been prominently featured in the opening credits of television’s Miami Vice. The park has evolved over the years under the direction of its current owners who purchased the park in 1988. After Hurricane Andrew, the owners set their sights on continuing to develop the park on Watson Island. After construction was completed in 2003, the Watson Island location opened for business as Parrot Jungle Island. The evolution of the Jungle has led to the renaming of the park as Jungle Island to better encompass the wide variety of animals, plants and activities available. Jungle Island lives up to its name with unusual flora, from the extraordinary African sausage tree to a collection of rare cycads. Visitors to Jungle Island can stroll along the 1.35 miles of winding, covered trails while enjoying the many special exhibits, attractions and tours that are available. As Miami’s brightest and most unique destination, Jungle Island continues to delight the thousands of people who visit Miami each year. Jungle Island Timeline December 20, 1936 Franz Scherr opens Parrot Jungle to the public for the first time. 1939 The first bird “show” is introduced to the Jungle. Pop, a blue and gold macaw, does tricks for guests. 1940 Franz Scherr officially purchases the property that housed Parrot Jungle for $5,000. 1946 Winston Churchill visits Parrot Jungle and is given a VIP tour. After being gifted two turkey during a stop in Texas, Churchill would “gift” the bird to Franz Scherr to display at Parrot Jungle. 1947 The original Flamingo Lake is created. The Scherr family was so proud of the new addition that two of the Scherr children would stage their weddings there in 1953 and 1956. 1953 The new entrance complex is open! Designed by Tony Sherman, the new entrance structure includes a large gift shop, restaurant, offices and storage. The old entrance would become a snack bar. Mid-1960's The bird shows at Parrot Jungle move to the “big top.” Shows are now performed in the Parrot Bowl and grow in size and in performance ability of the birds. 1963 - 1964 Pinky, the bicycle riding Cockatoo, travels to the World’s Fair and becomes one of the most photographed birds in history. 1973 Franz Scherr, the founding father of Parrot Jungle, passes away. 1982 The world’s first Lear’s macaw is born in captivity at Parrot Jungle. The birth would make headlines around the world. 1980's Several motion pictures are filmed at Parrot Jungle including Police Academy. The television series, “Miami Vice” would also feature the park’s flamingos in the opening credits. Two of the park’s Macaws were also loaned to Jimmy Buffett who would feature them on his greatest hits album, “Songs you know by heart.” (1985) 1988 Dr. Bern and Mary Levine and Richard Schubot purchase Parrot Jungle from the Scherr family. The name is changed that year to “Parrot Jungle and Gardens” to more fully represent the world-class level of the grounds. 1989 Levine sets up Parrot Jungle’s first Primate section with orangutans, Hannah, Millie and Jake. 1992 Hurricane Andrew hits Miami. Despite the damage to the park, not a single animal was lost during the storm. 1995 Parrot Jungle and Gardens is registered as a historic location within Miami-Dade County. That same year, a formal announcement is made regarding the decision to move the park to Watson Island. 2000 Construction begins on Watson Island for the new Parrot Jungle. The 17-acre facility would include covered parking, a restaurant, gift shop, offices and the long sought after banquet and conference facilities. 2000 Mr. Ronald Krongold becomes operational partner of Jungle Island and its Treetop Ballroom. 2002 The City of Pinecrest purchases the Red Road location with the aim of developing the site as Pinecrest Gardens. April 12, 2003 The grand opening Gala for the Treetop Ballroom is held. The gala is a benefit for the New World School of the Arts. June 28, 2003 The newly re-named, Parrot Jungle Island, opens to the public on Watson Island. 2003 The Tiger/Liger exhibit officially opens. Previously, the big cats were featured in the Tale of the Tiger show. 2003 Hank the Crocosaurus arrives on Jungle Island to much fan-fare! Hank measured a whopping 20 feet! He is still remembered as one of the park’s most famous residents. 2006 Twin Orangutans, Peanut and Pumpkin, celebrate their 3rd birthday! 2007 4 years after the park opened on Watson Island, the name is officially changed to Jungle Island to better encompass the wide variety of animals who call the park home. 2008 Jungle Island hosts Fun and Fit as a Family, part of the South Beach Wine and Food Festival, for the first year. 2011 The park opens a brand new leopard exhibit housing a melanistic leopard and a spotted leopard. December 20, 2011 Jungle Island proudly celebrates its 75th Anniversary! Jungle Island Our History Jungle Island Our History Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.jungle-island.com/contact",
      "text": "Location & Hours/Contact Us — Jungle Island Paintball Park Home Rates Our Fields Media Park Info Click To Visit Wildlands Airsoft Back Paintball Paintball Lite Airball Gel Blaster Private Party Bays Back Paintball Fields Airsoft Fields at Wildlands Park Airball Fields Back Watch Videos Photo Gallery Back View Waiver Private Group Check In Location & Hours/Contact Us Events and News Calendar New Improvements First Timer Tips Employment Opportunities Gift Pass Private Group Events Event Hosting Home Rates Paintball Paintball Lite Airball Gel Blaster Private Party Bays Our Fields Paintball Fields Airsoft Fields at Wildlands Park Airball Fields Media Watch Videos Photo Gallery Park Info View Waiver Private Group Check In Location & Hours/Contact Us Events and News Calendar New Improvements First Timer Tips Employment Opportunities Gift Pass Private Group Events Event Hosting Jungle Island Paintball Park Click To Visit Wildlands Airsoft Park Info If you recently visited Jungle Island, we'd love to hear your positive feedback by telling us about it on Yelp and Google . Park Location Jungle Island 14881 Temescal Canyon Rd Lake Elsinore, CA 92530 Contact Us Call us at 951-775-9316 Send us a message using the form below. To cancel any game reservation, please email jungleislandpark@gmail.com . Open Form Contact Form Name * First Name Last Name Email Address * Phone (###) ### #### Message * Thank you! Park Hours We are open every Saturday and Sunday for individual or small group walk on play, birthdays and private games. We recommend that all players make a reservation. Private games are required to make a reservation in advance. Saturday & Sunday Daytime: 8:00am-4pm & first game at 9am* 30 min lunch break is taken at 12noon Weekdays Jungle Island is also available 7 days a week for private groups of 25 people, parties, corporate events, team building and more. Please reserve at least one week in advance. Please email Jungle Island for additional details. Park Hours 8:00am Gates Open 8:15am Registration Opens 9:00am First Games Start 3:30pm Last Game Starts 4:00pm Park Closed Book A Private Party Now! Jungle Island 14881 Temescal Canyon Road, Lake Elsinore, CA, 92530 951-775-9316 info@jungle-island.com Complete Waiver Online (New) View Waiver First Timer Tips Contact Us To cancel any game reservations, email jungleislandpark@gmail.com . We reserve the right to refuse entry and service at both the Jungle Island and Wildlands Airsoft Parks. Website Crafted by Moov Labs"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/super-vip/",
      "text": "Super VIP Tour - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Become the ultimate explorer with SUPER VIP Tour! In this private guided tour, you will be able to go wild with our baby capybaras, lemurs, sloths, wallabies, tortoises, flamingos, and emus! IMPORTANT NOTICE: Participants between Age 6 and Age 16 need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ $399 .00 Super VIP Tour ages 6 and up Includes Park, Playground & Treewalk Village BOOK NOW Image Gallery Frequently Asked Questions Do I need to make a reservation for the Baby Capybara Encounter? Reservations can be made in person or through the website. Reservations are recommended. Participants can book on a walk-in, same day basis if there is availability. Is there an age requirement for the Baby Capybara Encounter? Yes. Children must be 6 years old or older to participate. Guests 16 and under need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ What should I wear for the Baby Capybara Encounter? We suggest being as comfortable as possible. When should I arrive for my Baby Capybara Encounter? Where do I meet my trainer? We ask you arrive to the Guest Relations Office 10 minutes before your scheduled encounter. Your trainer will pick you up from the Guest Relations Office and take you to the encounter. Will there be a photographer in the Baby Capybara Encounter? Professional photographers are readily available to immortalize your animal encounters with their expert lens skills. Capture those unforgettable moments with the help of professional photographers specializing in animal photography. Can I take my own pictures during the encounter? Absolutely! Feel free to take your own pictures. What are Jungle Island's inclement weather protocols? Rainy days and storms are inevitable in Miami, so Jungle Island is open rain or shine!  Some pathways are under cover but much of the park is open to the elements. To keep Jungle Island’s guests, staff, and animals safe during storms we abide by the following protocols. When lightning occurs within 10 miles of Jungle Island, animal encounters and tree walk village will be temporarily closed to the public. Jungle Island officials will wait to reopen these experiences until 15-30 minutes after the last lightning strike. All guests are then encouraged to stay under cover and out of the storm. This is a great time to get a bite to eat or browse our gift shop! Guests who have purchased animal encounters will have the opportunity to reschedule or join a tour later in the day if space is available. Jungle Island animals may also be taken to behind the scenes housing during the inclement weather. Not to worry though! These animals will come back out once it is safe to do so. These policies and procedures are in place to keep our adventurers safe and we thank you in advance for your understanding. You may also like Lemur Encounter An unforgettable interaction! Meet and interact with a troop of beautiful lemurs. Sloth Encounter One of a kind experience! Feel time slow and embrace the majestic sloth. VIP Tours Get the VIP treatment! Enjoy a private tour that brings you closer to wildlife than ever before! Jungle Island Animal Encounters Super VIP Tour Jungle Island Animal Encounters Super VIP Tour Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.jungle.ai/who-we-are",
      "text": "Jungle AI - Who we are Book a demo Solutions Canopy Improve machine uptime and performance Toucan Get accurate power forecasts Industries Wind Solar Maritime Resources Blog Case studies Who we are Careers Book a demo Who we are A top-notch team meets a purposeful mission Jungle develops the world âs most effective tools to resolve machine underperformance. Using state-of-the-art AI technology, we solve societyâs most pressing challenges, by conquering operational complexity and giving people full understanding of their machines. Our core values Actual positive impact in the world Giving people the understanding over their machines means accelerating the positive impact that key industries have. We optimise renewable energy production, help manufacturers go greener and ease out the transition towards sustainability. Crafting through machine learning Exploring data (science), perfecting our technological craft and putting our heart and brain into ML research - this is how the Jungle team delves into innovation. Empowering people Our solutions arenât meant to replace human labour and perspective. Quite the contrary: positive change is achieved by putting empowering tools in the hands of people, a philosophy that Jungle applies to both customers and employees. A nice place to work We donât need big adjectives: we aim to simply be a nice work place to all Jungleâs inhabitants. Being part of the team means being comfortable with oneâs self and in true balance with the Jungle ecosystem. The people behind the machines make the world go round At Jungle, we hold pride in our talented team, dedicated to advancing our mission. For a glimpse into our work culture and ethos, learn directly from the driven and enthusiast individuals who make it all happen. Product \"My experience at Jungle has been awesome thanks to the people and Canopy being a very interesting product! Iâve helped implement and improve our usersâ experience while learning a lot in the process.\" JoÃ£o Palmeiro, Full-stack Developer R&D \"In the R&D team, we are proud to be driving technological innovation and seeing the direct impact we have on Jungleâs solutions.\" JoÃ£o Correia, Machine Learning Engineer Product \"Every day at Jungle is a new adventure in the sense that are always new challenges to take on!\" Robert Mercieca, Full-stack Developer Engineering \"Over time, Iâve expanded my technical skills and autonomy, and cultivated a continuous learning mindset. This path showcases how Jungle has provided me with the opportunity to flourish as a professional and stay adaptable in the ever-evolving realm of software development.\" JerÃ³nimo Mendes, Software Engineer & former Summer Intern Service Delivery \"As part of the Service Delivery team I am in contact with almost every part of Jungle - with both customers and other Jungle teams. It feels amazing knowing our team effort helps customers improve their operations!\" JoÃ£o Campos, Customer Success Engineer Engineering \"Jungle focuses on fostering a friendly environment geared towards the growth of both the company and its employees. By balancing each personâs needs and goals with ongoing assignments, we are able to reach a sweet spot where we are consistently challenged while still close to our comfort zone.\" Nelson Rodrigues, Software Engineer &Â former Summer Intern Co-Founders \"Jungle emerged from a curiosity to apply advanced data and AI technologies to address meaningful problems in the world. We build solutions that benefit everyone involved, avoiding ones where one's gain is another's loss.\" Alexander Helmer, CTO & co-founder Support \"Itâs a true privilege to be part of such a warm, collaborative environment where you feel comfortable reaching out to absolutely anyone - either for a full cross-functional project, for a good brainstorming session, or simply for a nice chat\" Mafalda Rodrigues, Operations Manager Commercial \"When you can see the clear and greater purpose of your work, that feeling ends up coming across very naturally in any conversation. That means generating confidence in Jungleâs positive impact right from the start.\" Charles Monteiro, Sales Executive Our leadership team Arnoud Kamerbeek CEO Pim Breukelman CCO Alexander Helmer CTO & co-founder Silvio Rodrigues CIO & co-founder Want to join our growing team? See open roles Solutions Canopy Toucan Industries Wind Solar Maritime Company Blog Case studies Who we are Careers Contact us hello@jungle.ai sales@jungle.ai Stay in touch Â© 2025 All rights reserved Privacy Policy"
    },
    {
      "url": "https://www.jungleisland.com/careers/",
      "text": "Careers - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Careers join our tribe Our Mission To provide an ultimate, real jungle experience in the heart of Miami that invites guests to step out of their comfort zone, push their boundaries, and reconnect with vibrant nature. To create lifelong family memories of challenges conquered, playful journeys and animal encounters. To give our guest the well-earned reward of proudly telling friends, \"I did that!\" Careers We offer a broad array of career opportunities. We believe that each team member contributes directly to the organization’s growth and success, and we hope you will take pride in joining us in our exciting transformation. Apply today to become a member of our growing team! APPLY NOW Jungle Island is a Drug Free Workplace and an Equal Opportunity Employer. Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. Join Our Tribe People make the world go round and at Jungle Island it is no different. We value our people. We believe everyone should be living life for a living. Come check our upcoming Hiring events APPLY NOW Jungle Island Careers Jungle Island Careers Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://www.thejungletribe.com.au/contact",
      "text": "Contact us | Jungle Adventure Play Activities Activities Cubs Junior Play Cubs Junior Play Jungle Time Playground Jungle Time Playground The Jungle Jump Mini Golf Safari Tribal Climb The Canopy The Canopy The Hawk Gorilla Warrior Rhino Run About About FAQs Gift Cards What's on Offers Blog Health & Safety Privacy Ts&Cs Menu Parties & Groups Parties & Groups Parties Parties Corporate Mini Golf Package Exclusive Hire OSHC School Groups Jungle Juniors Food & Drink Locations Sign Waiver Book a Party Book Now Activities Activities Cubs Junior Play Cubs Junior Play Jungle Time Playground Jungle Time Playground The Jungle Jump Mini Golf Safari Tribal Climb The Canopy The Canopy The Hawk Gorilla Warrior Rhino Run About About FAQs Gift Cards What's on Offers Blog Health & Safety Privacy Ts&Cs Menu Parties & Groups Parties & Groups Parties Parties Corporate Mini Golf Package Exclusive Hire OSHC School Groups Jungle Juniors Food & Drink Locations Sign Waiver Book a Party Book Now Contact us Welcome to The Jungle. Please choose your venue below. Tingalpa North Lakes Activities Cub’s Junior Play Jungle Time Playground The Jungle Jump Mini Golf Safari Tribal Climb The Canopy The Hawk Gorilla Warrior Rhino Run Parties & Groups Parties Corporate Mini Golf Package Exclusive Hire OSHC School Groups Jungle Juniors About FAQs Gift Cards What's on Offers Blog Health & Safety Privacy Ts&Cs Contact 31 Proprietary St, Tingalpa,  QLD, 4173 2 McLennan Crt, North Lakes,  QLD, 4509 (07) 3147 8013 info@thejungletribe.com.au Instagram Facebook Website by Edison Agency and developed by Little Dash."
    },
    {
      "url": "https://www.jungleisland.com/events/birthdays/",
      "text": "Group Events - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. Your browser does not support HTML5 video. The Best Location. Jungle Island provides a great day out for any company or group. Our amazing animals, exciting exhibits and sensational shows make Jungle Island the perfect choice for a company picnic, large group outing or private daytime or evening event. Our event specialists will create your personalized event solution, from extraordinary menus under the direction of Executive Chef Gregg Nuguid, to world class atmospheres and event experiences. From weddings and showers to bar mitzvahs and quinces, we will help you design your dream event. Inquiries Chat Now Gallery of Spaces Private Event Software powered by Tripleseat Chef Gregg Nuguid – Executive Chef With over 30 years of experience in world-class hotels, resorts, and casinos, Chef Nuguid brings a wealth of culinary expertise to Jungle Island. As Executive Chef, he oversees all dining experiences, from daily park offerings to private events and large-scale galas. His passion for innovative cuisine and high-quality ingredients ensures that every meal elevates your Jungle Island experience. Aston H. Ziadie Special Events Senior Manager aziadie@jungleisland.com 305-400-7230 Maria Salinas Events Sales Manager msalinas@jungleisland.com 305-400-7230 Natalia Saavedra Event Sales Coordinator nsaavedra@jungleisland.com 305-400-7230 Carlos Velez, CPCE General Manager, Food & Beverage cvelez@jungleisland.com 305-400-7230 Do you have a site fee for weddings/events at your venue? ﻿ Yes What is the starting site fee for weddings/events during peak season? $2500 What is the starting site fee for weddings/events during oﬀ-peak season? $1500 What is included in the per person price? Food/Bar/Tables/Chairs/Linens/Flatware What is the starting price per person for 4 hours bar service? $42 What is included in the starting price for bar service? deluxe brands, domestic beers, house wine, sodas & juices What is the maximum capacity of your venue? Indoor/Outdoor 5000 How many event spaces or rooms does your venue oﬀer? 10 Jungle Island Group Events Jungle Island Group Events Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    },
    {
      "url": "https://therealdeal.com/miami/2024/06/03/jungle-island-planning-miami-condo-tower-with-terra/",
      "text": "Jungle Island Planning Miami Condo Tower with Terra Sign in Subscribe Subscribe search News All Markets San Francisco New York South Florida Los Angeles Chicago National Texas Sectors Residential Commercial Development Politics Tech Data Dashboard Snapshots Articles Rankings Interactive Maps Directory Data Books Magazine Data Book 2025 Current Issue Issue Archives The Closing Weekend Events Miami Forum Building Houston Future City Salon Series New York Forum Golf Classic Industry Events Video + Podcast Video Podcast Partners Brand Studio Content Videos Collaborate Advertise Sponsor & Exhibit Engage Sponsored Content Appliance Innovation Hub Multifamily Index Newsletters Other About Us Contact Us Privacy Policy Subscribe Corporate Subscriptions Advertise Help Center Careers Shop Reprints Development South Florida A Back to the voters: Jungle Island owner proposing condo project with Terra Plan calls for purchase of 5 acres of city land in exchange for public park; follows 2018 referendum that allowed for a hotel David Martin with ESJ’s Arnaud Sitbon and an aerial of Jungle Island (Terra, ESJ) Jun 3, 2024, 9:34 PM UTC By Katherine Kallergis Save article SHARE THIS ARTICLE FONT SIZE A A A David Martin’s Terra is partnering with the owner of Jungle Island to redevelop part of the city-owned site into a residential project, The Real Deal has learned. The proposal hinges on voters approving the deal, possibly later this year. Jungle Island, a waterfront eco-adventure park on Miami’s Watson Island, would close if the project moves forward, sources told TRD . ESJ Capital Partners, an Aventura-based firm led by founder and CEO Arnaud Sitbon, secured voter approval in 2018 that amended the city charter, allowing ESJ to modify the lease so that ESJ could build a hotel, new attractions at Jungle Island and a retail, restaurant and meeting space expansion. The hotel would have had a maximum height of 130 feet. Three years ago in 2021, the Miami City Commission approved a development agreement and special area plan (SAP) with Jungle Island, as well as a land use change to allow for commercial development. SAPs are used for projects that are at least nine acres in size. ESJ had a 2023 deadline to obtain its building permit, a move that would trigger $250,000 annual rent payments to the city. That amount would increase when the planned hotel was completed to $1.2 million a year and 5 percent of gross revenue. But ESJ hasn’t moved forward on the hotel. Instead, the firm was recently in talks with local developers to build a for-sale residential project on the site before securing a partnership with Coconut Grove-based Terra, sources said. In order to build a condo on the 18-plus-acre site at 1111 Parrot Jungle Trail, the developers would have to own the land where the condo would be built. ESJ has been in talks with the city to return nearly 13 acres of land back to the city for a waterfront public park in exchange for purchasing 5 acres for the residential project, a statement from ESJ and Terra confirms. ESJ and Terra said that their plan would “return most of the Jungle Island to the community as a public asset for all to enjoy free-of-charge” while creating revenue for the city via property taxes generated by the sale of condos. They said their proposal would generate less traffic than what has been approved by voters. Sign Up for the undefined Newsletter SIGN UP Read more South Florida How David Martin plans to deliver the biggest project of his career Commercial South Florida Merrimac, BH3 take over lease on Miami’s Watson Island to develop mixed-use project “We look forward to sharing more details with the community over the coming months,” the statement ends. The city has not responded to a public records request. ESJ paid $60 million for Jungle Island in 2017 and assumed the lease with the city of Miami and park debt owed to the city, Miami-Dade County and the U.S. Department of Housing and Urban Development. Bern Levine sold the theme park seven years ago. Levine had owned Jungle Island, then called Parrot Jungle, in 1988 when it was located in Pinecrest, and moved it to Watson Island in 2003. The island is sandwiched between Miami’s mainland and Miami Beach. Another major project is planned on the other side of the MacArthur Causeway, which cuts through Watson Island. Last year, Merrimac Ventures and BH3 Management partnered to take over the lease for nearly 11 acres on the west side of the island. The former developer, Mehmet Bayraktar’s Flagstone Property Group, was tangled in years of delays and litigation with the city of Miami. Voters approved Bayraktar’s deal via a referendum in 2001. His firm only completed the mega yacht marina; other plans included two luxury hotels, retail, public space and a garage. Any major changes to the plan for Merrimac and BH3’s site would have to be approved by voters in the form of another referendum. Tags Breaking Breaking News City Of Miami David Martin ESJ Capital Partners Jungle Island Miami-Dade County Terra Recommended All Markets All Markets Chicago Los Angeles National New York San Francisco South Florida Texas Recommended For You About us Contact us Privacy policy Terms and Conditions Subscribe Corporate Subscriptions Advertise Help center Careers Shop All rights reserved © 2025 The Real Deal is a registered Trademark of Korangy Publishing Inc. 450 West 31st Street, New York, NY 10001 Phone: 212-260-1332"
    },
    {
      "url": "https://www.jungleislandzoo.com/contact-us/",
      "text": "Contact Us | Jungle Island Zoo Jungle Island Zoo Call Today! 419-234-6103 Jungle Island Zoo LLC Kim (419) 234-3672 Ben (419) 234-6103 jungleisland@yahoo.com Delphos, OH 45833 Home Exotic Animal Petting Zoo Holidays & Promos Reindeer Rental Live Nativity Scene Animal Rental Events Cuddle Shuttle Hump Day School & Church Events Fun & Educational Programs Nursing Homes and Senior Center Reviews Contact Us Contact Us Jungle Island Zoo, L.L.C. Corporate Office: Delphos, Ohio Kim Osting Email: jungleisland@yahoo.com Cell:  (419) 234-3672 Antler Island Ranch, L.L.C. Corporate Office: Delphos, Ohio Ben Osting Email: benosting57@gmail.com Cell:  (419) 234-6103 Contact Us Name * Email Address * What Type Of Event Are You Having? * Fair Festival School Event Fundraiser Corporate Event Reindeer Rentals Religious Event Church Event Holiday Event Camp, Scouts, Youth Groups Productions Senior Living Group Other... Please Explain Below What CITY is Your Event In * What STATE is Your Event In * What is Your Event or Party For? When Is Your Event? * MM slash DD slash YYYY Approximate Start Time Of Event * : Hours Minutes AM PM AM/PM Phone Number Tell Us Details About Your Event or Ask A Question Would you like to receive updates about new attractions? * Yes - please keep me updated about new attractions No - please do not update me about new attractions Company This field is for validation purposes and should be left unchanged. Δ ***PLEASE NOTE:*** Jungle Island Petting Zoo is a\nMobile Petting Zoo & Does not\nAccept Visitors at Our Main Location Tell Us About Your Event Name * Email Address * Type Of Event * What CITY Are You Located In * What STATE Are You Located In * Phone Number Date & Time Of Event * Tell Us The Details of Your Event or Ask A Questions Would you like to be updated with news of new attractions? * Yes - please keep me updated about new attractions No - please do not update me about new attractions LinkedIn This field is for validation purposes and should be left unchanged. Δ Service Areas Jungle Island Zoo, LLC Email: jungleisland@yahoo.com Ben: 419-234-6103 Kim: 419-234-3672 Delphos, OH 45833 ***PLEASE NOTE:*** Jungle Island Petting Zoo is a\nMobile Petting Zoo & Does not\nAccept Visitors at Our Main Location © 2025 Jungle Island Zoo | Sitemap | Privacy Policy | Jungle Island Zoo Home Exotic Animal Petting Zoo Holidays & Promos Reindeer Rental Live Nativity Scene Animal Rental Back Events Cuddle Shuttle Hump Day School & Church Events Fun & Educational Programs Nursing Homes and Senior Center Back Reviews Contact Us × Close Panel"
    },
    {
      "url": "https://www.jungleisland.com/animal-encounters/flamingo-experience/",
      "text": "Flamingo Experience - Jungle Island Skip to content Open Every Day: 9:30am - 5:00pm Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Open Every Day: 9:30am - 5:00pm Home Contact Toggle navigation Toggle navigation Home Things To Do Animal Adventure Bundles Animal Adventure Bundles Bogo 50% Animal Encounters Bogo 50% Animal Encounters Parrots & Paint Let your creativity take flight! General Admission One Ticket. Multiple Attractions! Luminosa Luminosa Coming Soon! Jungle Kids Birthdays Celebrate birthdays with a Jungle Island adventure Field Trips Experience a true outdoor laboratory. Summer Camp Embark on a wild adventure! Events Info & Promotions Park Information Jungle Island is open 7 days a week! FAQs You have questions. We have answers! Promotions Discounts, coupons & special deals Calendar of Events See what’s happening in the Jungle! Photos From Your Visit Careers Annual Pass The Horrorland Your browser does not support HTML5 video. Flamingo Experience Mingle with the Jungle Island American Flamingos! Feed and Interact with the Jungle Island Flamingos Mingle with flamboyant flamingos! In this unique encounter, you’ll explore their vibrant habitat and have the chance to feed our fabulous pink residents. IMPORTANT NOTICE: Participants between Age 10 and Age 16 need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ $65 .00 Flamingo Experience ages 10 and up Includes Park, Playground & Treewalk Village BOOK NOW Image Gallery Frequently Asked Questions Do I need to make a reservation for Flamingo Encounter? Reservations can be made in person or through the website. Reservations are recommended. Participants can book on a walk-in, same day basis if there is availability. Is there an age requirement for the Flamingo Encounter? Yes. Children must be 10 years old or older to participate. Guests 16 and under need to be accompanied by an adult encounter participant. Minors that are not with a legal guardian will not be admitted without a signed and notarized Child Care Form located at: https://waiver.smartwaiver.com/w/5ca6139a9b6b6/web/ What should I wear for the Flamingo Encounter? We suggest being as comfortable as possible. When should I arrive for my Flamingo Encounter? Where do I meet my trainer? We ask you arrive to the Guest Relations Office 10 minutes before your scheduled encounter. Your trainer will pick you up from the Guest Relations Office and take you to the encounter. Will there be a photographer in the Flamingo Encounter? Professional photographers are readily available to immortalize your animal encounters with their expert lens skills. Capture those unforgettable moments with the help of professional photographers specializing in animal photography. Can I take my own pictures during the encounter? Absolutely! Feel free to take your own pictures. What are Jungle Island's inclement weather protocols? Rainy days and storms are inevitable in Miami, so Jungle Island is open rain or shine!  Some pathways are under cover but much of the park is open to the elements. To keep Jungle Island’s guests, staff, and animals safe during storms we abide by the following protocols. When lightning occurs within 10 miles of Jungle Island, animal encounters and tree walk village will be temporarily closed to the public. Jungle Island officials will wait to reopen these experiences until 15-30 minutes after the last lightning strike. All guests are then encouraged to stay under cover and out of the storm. This is a great time to get a bite to eat or browse our gift shop! Guests who have purchased animal encounters will have the opportunity to reschedule or join a tour later in the day if space is available. Jungle Island animals may also be taken to behind the scenes housing during the inclement weather. Not to worry though! These animals will come back out once it is safe to do so. These policies and procedures are in place to keep our adventurers safe and we thank you in advance for your understanding. You may also like Lemur Encounter An unforgettable interaction! Meet and interact with a troop of beautiful lemurs. Sloth Encounter One of a kind experience! Feel time slow and embrace the majestic sloth. VIP Tours Get the VIP treatment! Enjoy a private tour that brings you closer to wildlife than ever before! Jungle Island Animal Encounters Flamingo Experience Jungle Island Animal Encounters Flamingo Experience Hours & Info Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Information Home Park Information Promotions Our History Careers Contact Things To Do General Admission Animal Encounters Treetop Trekking Calendar of Events Jungle Kids Birthdays Field Trips Jungle Kids Summer Camp Events Jungle Island Events Birthdays Jungle Island is proud to be partnered with: PARK HOURS GENERAL ADMISSION Every Day: 9:30am - 5pm (last admission to the park 4pm) VIP ENCOUNTERS Open Daily (online reservations required) ANIMAL ENCOUNTERS Open Daily: 9am - 4pm CONTACT & TICKETS Tickets can be purchased at the park and online ! 1111 Parrot Jungle Trail Miami, Florida 33132 TEL: (305) 400-7000 FAX: (305) 400-7291 LET’S GET SOCIAL! Follow us for special offers and the latest happenings in the Jungle! © 2025 Jungle Island - All Rights Reserved | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility Terms & Conditions: Splash & Play This promotion applies exclusively to General Admission tickets and does not qualify as or function as an annual pass. General Admission includes Jungle Splash, Treewalk Village, Playgrounds, Guardians of the Jungle Show, and Animal Sightings. Admission: The “SPLASH & PLAY ALL SUMMER” promotion includes access to all General Admission experiences. Pass Validation: The “SPLASH & PLAY ALL SUMMER” pass will grant you unlimited General Admission access until August 31st, 2025. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. × Terms & Conditions: Buy A Day & Get The Year By purchasing the “Buy A Day & Get The Year” promotion, you agree to the following terms and conditions: This promotion applies exclusively to general admission tickets and does not qualify as or function as an annual pass. Tickets must be redeemed within the designated dates to remain valid. Tickets can be used for date of purchase but re-entry will not be reissued if the first date of visit is not between the dates of April 4th – May 31st. Admission: The “Buy A Day & Get The Year” promotion includes access to all General Admission experiences. Redemption Period: All members of the party must redeem this promotion between January 15th and May 31st, 2025 , to activate unlimited year park access. Reservations: Reservations are required for park entry and must be made online only . Promotions cannot be made or purchased in person. Jungle Island reserves the right to determine the availability of reservations for any given date. Pass Validation: Bookings must be made and redeemed between April 4th, 2025, and May 31st, 2025 . Failure to redeem by March 21st, 2025, will forfeit the promotional benefits. In such cases, your ticket will only be valid for the date booked. Once redeemed by March 21st, 2025, your pass grants unlimited general admission during regular park hours (9:30 AM–5:00 PM) until December 31st, 2025 . Blackout dates apply. Exclusions: This promotion does not include access to special events such as Horrorland , Luminosa , or other events. For visits between June 6th, 2025 – August 5th, 2025, and December 20th, 2025 – December 31st, 2025, entry to the park must occur before 11:00 AM in order for promotion to apply. ×"
    }
  ]
}