{
  "fuentes": [
    {
      "url": "https://tallenbuilders.com/portfolio/vineyard-tasting-room/",
      "email": "sallen@tallenbuilders.com"
    },
    {
      "url": "https://www.kayavineyards.com/",
      "email": "info@kayavineyards.com"
    },
    {
      "url": "https://katyavineyards.com/contact/",
      "email": "info@katyavineyards.com"
    },
    {
      "url": "https://www.caltekappliancerepair.com/contact",
      "email": "service@caltekappliance.com"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "email": "jeni@getvows.com"
    },
    {
      "url": "https://slavicbeauty.net/pages/about-us",
      "email": "info@slavicbeauty.net"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.ocalamarion.com/directory/katya-vineyards/",
      "email": "exploreocalamarion@marionfl.org"
    },
    {
      "url": "https://www.ocalamarion.com/directory/katya-vineyards/",
      "email": "info@katyavineyards.com"
    },
    {
      "url": "https://www.ocala.com/story/business/2020/11/27/katya-vineyard-wins-golden-spoon-fourth-winner-ocala/6425335002/",
      "email": "cmedina@starbanner.com"
    }
  ],
  "mails": [
    "cmedina@starbanner.com",
    "exploreocalamarion@marionfl.org",
    "info@katyavineyards.com",
    "info@kayavineyards.com",
    "info@scibpaints.com",
    "info@slavicbeauty.net",
    "jeni@getvows.com",
    "sallen@tallenbuilders.com",
    "service@caltekappliance.com"
  ],
  "nombre_sitio": "katyavineyards.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://tallenbuilders.com/portfolio/vineyard-tasting-room/",
      "text": "Katya Vineyards - Tallen Builders 352.629.0377 About Us Our Process Giving Back Services Luxury Home Building Commercial Construction Equine Facilities Tenant Build Out Design Build Portfolio Current Projects Residential Commercial Equine Facility Renovations/Additions/TI Testimonials News Contact Careers Become a Subcontractor Katya Vineyards Located in the beautiful area of Downtown Ocala we worked on this interior remodel for the Katya Vineyards.  A little over 1200 sq ft this Wine Bar and Tasting Room is an upscale elegant retail venue to showcase and sell their wine. They also have a small area for business meetings. The Vineyards Tasting Room kept the original ambiance of the Castro Building with the brick arches and dark tile floor similar to the entry way, with a few upgrades of their own. https://katyavineyards.com/ Architect: J Snell Daniels Designs https://www.jsnelldaniels.com/ Engineer: Riddle Consulting Engineers http://www.riddleengineering.com/ Share this post Share to Facebook Share to Twitter Share to LinkedIn Share via Email CGC#: 1517539 Services Luxury Home Building Commercial Construction Equine Facilities Tenant Build Out Design Build Links About Us Services Portfolio Testimonials Our Process Giving Back News Become a Subcontractor Contact Get in Touch Tallen Builders LLC 2531 NW 35th Street Ocala, Florida 34475 Phone 352.629.0377 Fax 352.690.6335 Email sallen@tallenbuilders.com © 2025 Tallen Builders . All Rights Reserved. Web Design by Graphicten Search Press enter to search"
    },
    {
      "url": "https://www.kayavineyards.com/",
      "text": "Kaya Vineyard & Winery | Dahlonega GA Wines, Cottages & Weddings Home Shop kayavineyards kayavineyards Tasting locations Wine Club Become a Member FAQ Weddings & Events Event Team Property Gallery FAQ Recommended Vendors List Dining Our Menu Picnic Baskets Events Cottages All Cottages OUR 360 TOUR About kayavineyards Contact Us BOOK NOW BOOK NOW BOOK NOW Home Shop kayavineyards kayavineyards Tasting locations Wine Club Become a Member FAQ Weddings & Events Event Team Property Gallery FAQ Recommended Vendors List Dining Picnic Baskets Our Menu Events Cottages OUR 360 TOUR All Cottages About About Kaya Vineyards Contact Us BOOK NOW BOOK NOW The Largest Winery in Dahlonega, Georgia KAYA VINEYARD AND WINERY an estate of it's own About Kaya Vineyard & Winery Kaya Vineyards and Winery was one of the first and largest of the current vineyards in the Dahlonega area. The winery, built upon the apex of a ridge topping a 1,600-foot elevation, offers exquisite mountain views and incomparable vineyard views from its tasting room. Enjoy sweeping views of the Blue Ridge Mountains in the panorama of lush vineyards, while experiencing some of the best wines in the Southeast. OUR WINES A black line is being drawn on a white background. PAY US A VISIT Kaya Vineyard A black line is being drawn on a white background. AN OUTDOOR PARADISE LUXURY COTTAGES Spend an unforgettable time in one our newly established Craftsman style cottages right in the best location in all of Georgia. VIEW COTTAGES EAT + DRINK TASTING ROOM Farm-to-table, fine dining, and always fresh. Find our favorite restaurants for any occasion. EXPLORE LOCATIONS LEAVE EVERYTHING TO US WEDDINGS Host your wedding at Kaya Vineyards WEDDINGS AT KAYA A black line is being drawn on a white background. REVIEWS What Our Visitors Say A black line is being drawn on a white background. \"Kaya is wonderful. It was the venue of my wedding, and it has fantastic scenery, a great environment, and a wonderful staff. Oh yeah, and the wine is really, really, really good!\" Matthew Buscher \"My husband and I visited Kaya Vineyard this past weekend and had the best time! The views are stunning, the facility is gorgeous and clean, and the staff were all knowledgeable and friendly. All the wines were sampled were delicious, and we had the best tasting Pimento Cheese sandwich (which tasted even better after a few glases- ha). If you are in the Atlanta area, do yourself a visit and plan an outing at Kaya Vineyard and Winery!\" Jade Summers Green \"First time to Kaya Vineyard and enjoyed the wine tasting, excellent service, beautiful view of the vineyard and Blue Ridge mountains!\" Ken Rempert \"Kaya is wonderful. It was the venue of my wedding, and it has fantastic scenery, a great environment, and a wonderful staff. Oh yeah, and the wine is really, really, really good!\" Matthew Buscher 2023 Dahlonega Discovery Guide Check out the new 2023 Discovery Guide to help plan your visit! VIEW THE GUIDE VIRTUAL EXPERIENCE Destination Tours Your virtual tour is open. TOUR WINERY TOUR COTTAGES TOUR WINERY TOUR COTTAGES JOIN OUR NEWSLETTER new wines, special events, and delicious recipes from our Executive Chef. Contact Us Email: Thank you for subscribing. Oops, there was an error. Please try again later. 5400 Town Creek Road, Dahlonega, GA 30533 | 706-219-3514 | info@kayavineyards.com © 2025 Kaya Vineyard and Winery﻿ | All Rights Reserved | Privacy Policy | Acc essibility Statement | Powered by Cloudbeds Share by: Chat with us"
    },
    {
      "url": "https://katyavineyards.com/contact/",
      "text": "Contact | Katya Vineyards Follow Follow Follow Follow 352-528-CORK (2675) 11 E. Silver Springs Blvd, Ocala, FL 34470 Home About Us Winery Our Wines Fine Dining Menu Wine List Reservations Gift Cards Shop Products Videos Noteworthy News Location & Contact For Gourmet Dining and Fine Wines, Make a Reservation Today! Restaurant: 11 E. Silver Springs Blvd. Ocala, Florida 34470 Phone: 352-528-CORK (2675) Email: info@katyavineyards.com Hours: Sun – Mon Closed Tue – Sat 5:00 pm – 9:00 pm Reservations Highly Recommended Make A Reservation We Accept: Katya Vineyards Gift Cards Parking: Street parking is available. Parking lot immediately behind building entrance off 1st Street NE. Private Events Host your next event in our exclusive VIP Private Dining Room—a luxurious experience tailored just for you! Whether it’s an intimate personal gathering or a professional business presentation, our VIP room offers the perfect setting. Enjoy the full à la carte menu or indulge in a curated food and wine pairing. For more information or to reserve your spot, email us at info@katyavineyards.com or call 352-528-CORK (2675). Let us make your event unforgettable! Contact Us First Name Last Name Email Phone Message Submit Katya Vineyards We look forward to your next visit We are always thankful to hear from our guests and friends. Leave us a message and we will get back to you shortly. Name Email Address Message Submit Home About Us Winery Our Wines Fine Dining Menu Wine List Reservations Gift Cards Shop Products Videos Noteworthy News Location & Contact Follow Follow Follow Follow Purchase A Gift Card Website Designed and Hosted by PC House Productions"
    },
    {
      "url": "https://www.caltekappliancerepair.com/contact",
      "text": "Reach Out to CalTeK: Atlanta's Trusted Appliance Repair | Contact Info & Form Maker Software Home About Services Testimonials FAQS Contact Open menu Maker Software Contact us Name Email Address Phone Number Address What do you need serviced today? Send Contact Information Hours: M-F 8:00 am - 5:00 pm Phone: 678-702-7494 Email: service@caltekappliance.com Services We offer a wide range of appliance repair services, including: Refrigerator Repair Dishwasher Repair Washer Repair Dryer Repair Microwave Repair Oven Repair Stove Repair and more! Footer Contact Us (678) 702-7494 service@caltekappliance.com Hours Monday - Friday: 8am - 5pm Weekends: Closed © 2025 CalTeK Appliance Repair LLC. All Rights Reserved."
    },
    {
      "url": "https://getvows.com/contact-us/",
      "text": "Contact Us - Get Vows Skip to content Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar New Jersey/New York Area (732) 763-2730 jeni@getvows.com Facebook Twitter Pinterest Flipboard Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar CONTACT US Send Message GET IN TOUCH If you’re interested in our services or have any questions, please reach out to us thru the contact information below or fill out our form on the right. jeni@getvows.com (732) 763-2730 New Jersey/New York Area CONTACT INFO jeni@getvows.com (732) 763-2730 New Jersey/New York Area SOCIAL Facebook Twitter Pinterest Flipboard NEED TO MAKE A PAYMENT? Payment Options Copyright © All Rights Reserved"
    },
    {
      "url": "https://slavicbeauty.net/pages/about-us",
      "text": "About Us – SlavicBeauty.net Skip to content (323) 522-5881 info@slavicbeauty.net 0 0 / $0.00 Products Dairy Cream separators Cream separator spare parts Coolers Milking units Butter churns and pasteurizers Plevnik-Cheese Making Equipment Cheese Making Equipment Prepresses Presses Cheese Tables Cheese Moulds Salting Vat Cheese Washing Machine Cheese Cutting Device Container Dairy Solutions Brochures Send Inquiry Bird and Wildlife Deterrents - Propane Cannon Other products Refurbished and specials Slavic Beauty gift card Books Blog Recipies FAQs References About Us Contact Us About Us Who We Are My name is Katya Luniova, and with my family, we run a small US-based business since 2003. We are happy to offer you high-quality and unique products for a healthy and simple lifestyle. Our company has grown from a hobby to a full-fledged business. I am lucky to have a loving husband who shares my enthusiasm and passion. My two beautiful children are always happy to help with photos and videos. My devoted friends are ready at all times to test our new equipment in their own homestead and give us their honest feedback. We are a small team working on a big dream. We listen and understand the needs of our clients. We learn a lot from our clients; their feedback enriches us with new ideas and inspires us to improve. I was born and raised in Ukraine, a picturesque country where traditions live. Since early childhood, I was always curious about watching a process, whether it was milking a cow or a miracle of turning white fresh milk into a savory yellow cheese. I was amazed to watch my grandparents, who seemed to know everything and could do just about anything using things at hand and what nature gave them. Being charmed by a simple lifestyle, I always tried to mark and remember our home recipes and secrets. Later on, I became fascinated with the idea to share my family and country heirloom traditions and connect my business with what I have always been most passionate about. The Internet really makes it a small world. One can learn about the lifestyle of different people around the planet. I am a member of many homestead and hobby farming forums. It is nice to be a part of the community where people turn their minds to better living habits, the use of natural resources, and consuming fresh and healthy food. We are proud that the products we offer can become great helpers to maintain a healthy lifestyle. We hope SlavicBeauty Youtube channel videos will provide helpful information on using a cream separator or making cream cheese or butter. We create an ongoing SlavicBeauty blog . The primary intention of our blog is to help you with any step in using your new device or to share a great recipe. Why choose SlavicBeauty Our strength comes from honest collaboration with our clients. You are our most important asset. You are the lifeblood of our company, after all. We are happy to provide you support at every stage of the purchasing cycle and long after the purchase is completed. We are here not just to sell but to stay with you afterward. How SlavicBeauty Stays Connected We keep you informed about our company’s innovations and events through SlavicBeauty social media pages: Instagram , Youtube , Facebook , Twitter . Our business is entirely online, but we understand the importance of personal meetings and seeing the product in real life. Since 2012 SlavicBeauty takes part in different shows and expos, such as World Dairy Expo , EuroTier , Mother Earth News Fair , and others. How To Contact SlavicBeauty We are happy to offer you outstanding customer service. We are always in touch and ready to provide a tailored solution based on a situation. SlavicBeauty Contact Us page. We genuinely believe that our approach and how we treat our clients make our company stand out in the marketplace. How We Deliver SlavicBeauty Products We ship most of our products from our US warehouses which means that United States residents can receive them very quickly thanks to proven carriers such as  UPS, FedEx, USPS  Most of the products ship free inside the US and for an additional charge can be shipped around the world. We ship worldwide. Customer Service We believe strongly in providing the best customer service possible so that you get the product you want in a timely fashion. Our friendly, courteous staff is here to explain about the products we offer and answer your questions as well. We understand that our reputation is only as good as our last customer. We strive every day to do the best we can so that you can enjoy our products. SLAVIC BEAUTY EXPOS Vist booth AL 116 to see the quality dairy equipment for small herds by SlavicBeauty. October 3-7, 2017Both, AL 116 Visit our new location booth AL 116 to see SlavicBeauty cream separators, goat milkers, cow milkers and butter churns at World Dairy Expo 2016. We look forward to be a part of WDE for the 5th consecutive year. Madison, WI October 4-8, 2016Booth AL 116 Slavic Beauty, distributor of quality dairy equipmen participated in the 2012 World Dairy Expo in Madison, Wisconsin. Booth AL 134 Slavic Beauty, distributor of quality dairy equipment took part in the 2013 World Dairy Expo in Madison, Wisconsin. Booth AL 134 Slavic Beauty, distributor of quality dairy equipment participated in the 2014 World Dairy Expo on September 30 – October 4 in Madison, Wisconsin. Booth AL 134 Slavic Beauty, distributor of quality dairy equipment, took part in the 2015 World Dairy Expo on September 29 – October 3 in Madison, Wisconsin. Stand AL 134 Slavic Beauty showcased cream separators, butter churns and mini milkers in stand # F11 at the Northern Michigan Small Farm Conference January 30, 2016 • Grand Traverse Resort. Stand F11 SlavicBeauty is happy to return to EuroTier – The world’s leading trade fair for animal production this year and showcase mini dairy equipment for small dairy farmers and homesteaders. Hannover, Germany 15-18 November, 2016Booth 13-D64 SlavicBeauty mini dairy equipment at Mother Earth News Fair West Bend, Wis July 9-10 2016 Booth 1605 SlavicBeauty cream separators, cows milkers, goat and sheep mini milking machines and butter churns at Mother Earth News Fair, Seven Springs, PA September 23-25 2016 Booth #2304 Slavic Beauty showcased high quality cream separators, milk analyzers and incubators at EuroTier – the world’s leading trade fair for animal production in Hanover from 11 to 14 November 2014. Hanover from 11 to 14 November 2014. Get in touch 8033 Sunset Boulevard, 460, Los Angeles California 90046, United States info@slavicbeauty.net (323) 522-5881 CUSTOMER SUPPORT CUSTOMER SUPPORT Home Search Blog FAQs About Us Contact us POLICIES POLICIES Privacy Policy Refund Policy Terms of Service Warranty Newsletter Signup Newsletter Signup Subscribe to our newsletter and get get special offers, free giveaways, and once-in-a-lifetime deals! Subscribe Copyright © 2025 Slavic Beauty all rights reserved. Powered by Slavic Beauty Choosing a selection results in a full page refresh. Shop 0 Wishlist 0 Cart Account Search"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Paint Budget Calculator Get instant estimates Calculate now Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.ocalamarion.com/directory/katya-vineyards/",
      "text": "Katya Vineyards | Ocala / Marion County Florida Skip to content 0 Saved Plan Your Trip Get Our App Equestrian Content Navigation Things to Do Equestrian Outdoor Adventures Indoor Adventures Shopping Arts & Culture Golf Agritourism Spas & Wellness Day Trips & Scenic Drives Events Annual Events Horse Shows & Events Submit Your Event Community Calendar Where to Stay Hotels & Motels Campgrounds & RV Parks Vacation Rentals Bed & Breakfasts Food & Drink Wineries, Breweries & Distilleries Plan Your Visit Transportation Weather & Avg Temperatures FAQs Area Vacation Guide OcalaMarion Travel Guide App E-Newsletter Signup Tropical Weather Updates Plan Your Trip Get Our App Equestrian Content Meetings & Events Blog Sports Events Weddings About Us Partners Download Vacation Guide Email Newsletter Signup Get Exclusive Deals < Back Website Email Menu Katya Vineyards 11 E Silver Springs Blvd Ocala, Florida 34470 United States Details Open in Google Maps Map Katya Vineyards 11 E Silver Springs Blvd Ocala, Florida 34470 (352) 528-2675 Share Overview With over 25 years of viticulture experience and a passion for food and wine, David, Patricia and Katherine Sokol, owners, teamed up with Chef Tony Deras to create a fresh and inviting fine dining experience. Our carefully crafted dishes are expertly paired with our award-winning wines to create unique flavor profiles. And because we value excellent customer service, weâre always here to make your visit memorable. Newcomers and regulars alike, we invite you to enjoy our welcoming space, excellent wines and flavorful dishes â we canât wait for you to become a part of the family. Cuisines Details Bar & Grill American Cuisine Related Stories & Events 6 Ways to Have an Unforgettable Romantic Getaway to Ocala/âMarion County Planning a getaway with someone you love is a great way to escape your day-to-day routine. Details How to Eat and Drink Well in Ocala/âMarion County A guide to some of our favorite restaurants and bars in Marion County Florida. Details Start Planning Your Stay In Ocala Vacation Guide Email Newsletter Visitor Center 109 West Silver Springs Boulevard | Ocala, FL 34475 Phone (352) 438-2800 | 1-888-FL-OCALA About Us Blog Media Contact Us Tour Operators Terms of Use Partners Privacy Policy Accessibility Â©2025 Ocala/Marion County Visitors and Convention Bureau This site uses cookies to provide you with an optimized experience. Privacy Policy Accept Quick Search Search Location Map"
    },
    {
      "url": "https://www.ocala.com/story/business/2020/11/27/katya-vineyard-wins-golden-spoon-fourth-winner-ocala/6425335002/",
      "text": "Katya Vineyards wins Golden Spoon, fourth winner for Ocala Man stabbed to death in NW Marion; detectives search for possible person of interest News Sports Entertainment Lifestyle Advertise Obituaries eNewspaper Legals BUSINESS Katya Vineyards wins Golden Spoon, fourth winner for Ocala Carlos E. Medina Ocala Star-Banner Ocala gained another Golden Spoon Award-winning restaurant this year when Katya Vineyard s received the coveted honor. The fine-dining awards, bestowed by Florida Trend magazine for some 50 years, recognized Katya on its first year of eligibility. \"We're very honored to be selected. We did not anticipate we would win. We're very happy,\" said David Sokol, founder and owner of the restaurant, located at 101 E. Silver Springs Blvd. With Katya's selection, Ocala is now home to four Golden Spoon restaurants. The others are La Cuisine, Sky Fine Dining and Craft Cuisine. It was one of the owners of Ocala's first Golden Spoon Hall of Fame restaurant who first told Sokol of the award. Looking for a free mini puzzle? Play the USA TODAY Quick Cross now. More: 25 things you should avoid doing when dining at a fancy restaurant \"Elodie Perron of La Cuisine called us to tell us she saw we made the list,\" he said. \"Patrice (Perron) came by and we shared a glass of wine to celebrate. That's the nice thing about Ocala. The restaurateurs support each other.\" Only 125 restaurants in the state earned a Golden Spoon. Sky earned its 11th award and Craft Cuisine earned a third spoon after receiving its first as one of the best new restaurants in 2018. Both of those restaurants are temporarily closed. Craft Cuisine owners Webster and Fatima Luzuriaga previously said the layout of the restaurant would not allow them to operate under social-distancing guidelines. Sky is closed for remodeling and will reopen in a few weeks, according to owner Danny Gaekwad. David and Patricia Sokol opened Katya in 2017 as a small tasting room and wine bar that featured some of the wine produced at their vineyard. \"We had a very small space. I think about 1,200 square feet,\" David Sokol said. Katherine Sokol Deras, the couple's daughter, serves as managing director. She married executive chef Antonio Deras, who is responsible for the ever-changing menu. The restaurant's menu does not follow a particular style, and Sokol describes it as international gourmet. More: As winter weather approaches, restaurants get creative with outdoor dining \"Antonio changes more than half of that menu every week and Katherine, who is studying to be a sommelier, matches the wines to the flavor profile of the food,\" Sokol said. \"It's a true family effort.\" While they expanded, the location is still cozy at only about 2,500 square feet. \"I don't know how Tony does what he does in such a small kitchen. I tell you, it's not much bigger than a food truck kitchen,\" Sokol said. \"It feels so go that we can all work together and not kill each other and still win a Golden Spoon.\" — Contact Carlos E. Medina at cmedina@starbanner.com or 234-4787. Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Licensing & Reprints Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.ocala.com. All rights reserved."
    }
  ]
}