{
  "fuentes": [
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "email": "info@theeddyskitchen.com"
    },
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "email": "info@theeddyskitchen.com"
    },
    {
      "url": "https://keepitlocalbrevard.com/contact-us/",
      "email": "gaillightle@keepitlocalbrevard.com"
    },
    {
      "url": "https://www.bcbev.com/",
      "email": "scott@bcbev.com"
    }
  ],
  "mails": [
    "gaillightle@keepitlocalbrevard.com",
    "info@theeddyskitchen.com",
    "scott@bcbev.com"
  ],
  "nombre_sitio": "keepitlocalbrevard.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.theeddyskitchen.com/contact-5",
      "text": "Contact | Eddy's Kitchen top of page Home Contact About us Catering Blog More Use tab to navigate through the menu items. ORDER NOW OR SCHEDULE! Contact Us Address 525 Somerset St. North Plainfield, NJ 07060 Contact 908-205-0531 Opening Hours Mon - Fri 6:30 am – 2:00 pm info@TheEddysKitchen.com Saturday 6:30 am – 2:00 pm ​Sunday Closed First Name Last Name Email Message Send Thanks for submitting! info@theeddyskitchen.com ©2023 by Eddy's Kitchen. bottom of page"
    },
    {
      "url": "https://keepitlocalbrevard.com/contact-us/",
      "text": "Contact Us - Keep it Local Brevard Wine Bar & Eatery Home About Us Our Services She Shed Weddings Yummy Gallery Blog Contact Us Home About Us Our Services She Shed Weddings Yummy Gallery Blog Contact Us Contact Us KEEP IT LOCAL BREVARD KAVA BAR  |  WINE BAR  |  EATERY Thank you for your interest in Keep it Local Brevard Wine Bar & Eatery. We offer dining, on-site catering, event space rentals, and offsite catering in the heart of the Historic Cocoa Village.  Feel free to give us a call to schedule a free consultation. Phone: 321-615-0059 Email: gaillightle@keepitlocalbrevard.com Location: 902 Florida Ave. Cocoa Village, FL 32922 HOURS Monday : CLOSED Tuesday : CLOSED Wednesday : 4 :00PM – 9:00PM Thursday : 4 :00PM – 9:00PM Friday : 12 :00PM – 10:00PM Saturday : 12 :00PM – 10:00PM Sunday : OPEN FOR PRIVATE PARTIES ONLY ﻿ Contact Us Full Name * Email * Phone * Date of Event Venue Location Type of Event * Corporate Event Business Lunch Social Event Dinner Party Birthday Party Wedding Other Number of Expected Guests * 1-10 10-30 30-50 50-100 100+ Event Details Message/Comment/Question Human Verification What is 5+6 * This box is for spam protection - please leave it blank : Keep It Local Brevard Wine Bar & Eatery is a chef-driven full-service venue, located in the Historic Cocoa Village, in Brevard County, FL. Location: 902 Florida Ave. Cocoa Village, FL 32922 Phone: 321-615-0059 HOURS Monday : CLOSED Tuesday : CLOSED Wednesday : 4 :00PM – 9:00PM Thursday : 4 :00PM – 9:00PM Friday : 4 :00PM – 10:00PM Saturday : 4 :00PM – 10:00PM Sunday : OPEN FOR PRIVATE PARTIES ONLY Search Our Website Home About Us Our Services She Shed Weddings Yummy Gallery Blog Contact Us FOLLOW US! © 2019 Copyright Keep it Local Brevard Wine Bar & Eatery – Designed by Outerspection – Organic Branding in Brevard – Elated Themes"
    },
    {
      "url": "https://www.bcbev.com/",
      "text": "Alcohol Control Systems | USA | 702-247-4432 HOME PRODUCTS Berg Liquor Controls Proof Syrup Soda Gun Jetter Napa Technology Focus Point of Sale FAQ CONTACT Call Us Comprehensive Beverage Solutions for Every Business Need Serving the Western U.S. with Alcohol Control Systems Reach Out to Us Empowering Your Business Innovative Beverage Solutions from Nevada’s Leading Distributor Boulder City Beverage is a trusted Las Vegas-based provider specializing in liquor control systems, wine and beer dispensing solutions, and a wide range of food and beverage equipment. As Nevada’s primary distributor for Berg Liquor Control Systems, Napa Technologies, Soda Gun Jetter, and Proof Craft Cocktail Syrups, we deliver cutting-edge technology and reliable service to enhance your business. Get In Touch Discover our EXTENSIVE suite of EXPERT Alcohol Control Systems services Our comprehensive range of services is designed to enhance the efficiency and quality of your beverage operations. We provide tailored solutions to meet the specific needs of bars, restaurants, and hospitality venues, ensuring optimal performance and customer satisfaction. Get Started From Initial Concept to Grand Opening Comprehensive Front-to-Back Solutions for Seamless Business Operations We offer a complete range of services for both front and back of house operations, from sales and service to full build-outs and remodels. Whether you're launching a new business or upgrading your current setup, our team manages everything from concept to grand opening, ensuring smooth, efficient execution. Contact Us A black and white icon of a bottle of beer and a mug of beer. Industry Leader As an industry leader, Boulder City Beverage sets the benchmark for excellence in beverage technology and equipment, continuously innovating to meet the evolving needs of our clients. A black and white drawing of a medal with a ribbon. Quality Guaranteed With Boulder City Beverage, quality is guaranteed in every product and service we provide, ensuring you receive only the best for your restaurant, bar, or casino operations. A black and white icon of three bottles of alcohol on a white background. High Expectations We consistently meet and exceed the high expectations of our clients by delivering top-tier beverage solutions and exceptional customer service tailored to enhance your business's efficiency and performance. Ensuring Peak Performance Reliable Support & Maintenance Services Our customized service programs are built to fit your unique business needs, offering comprehensive maintenance solutions that ensure your equipment operates flawlessly. Whether it’s routine upkeep or urgent repairs, we provide the dependable support you can count on to keep your operations running seamlessly. Learn More Expert Consulting & Financial Optimization Maximizing Profitability with Strategic Business Solutions Our team of expert consultants delivers in-depth business analysis, actionable profitability insights, and effective inventory management strategies. With tailored accounting and bookkeeping services, we help streamline your financial operations, empowering your business for long-term growth and success. Call Us Now Frequently Asked Questions Have any questions about our services? We're here to help. ﻿ Why is Boulder City Beverage so popular? Serving the United States, we stand as your premier destination for comprehensive alcohol control system services. Our unwavering commitment to delivering exceptional alcohol control system solutions has solidified Boulder City Beverage's reputable standing in the alcohol control system industry. Recognized for excellence, Boulder City Beverage emerges as the optimal choice for all your alcohol control system needs. We proudly offer affordable, customizable alcohol control system services tailored precisely to meet your specific requirements. For unparalleled service and detailed information, contact us today! What types of beverage technology and equipment do you offer? We offer a wide range of beverage technology and equipment, including liquor control systems, wine and beer dispense solutions, bar and restaurant equipment, and more to meet the needs of bars, restaurants, and hospitality venues. What areas do you serve? We serve the entire United States and Puerto Rico, offering our innovative beverage solutions to bars, restaurants, and hospitality venues nationwide, with a focus on understanding and meeting the specific needs of the local market. How can I contact Boulder City Beverage? If you have any questions or need support, feel free to reach out to us: Phone Numbers: 702-267-8844 We are here to assist you with all your beverage technology and equipment needs. CONTACT BOULDER CITY BEVERAGE Fill out the form below, and we will be in touch shortly! Contact Us Name: Email: Phone: Message: Thank you for contacting us. We will get back to you as soon as possible. Oops, there was an error sending your message. Please try again later. Alcohol Control Systems Contact Us Contact Info Phone : 702-267-8844 Email : scott@bcbev.com All Rights Reserved | Boulder City Beverage © 2025 Share by:"
    }
  ]
}