{
  "fuentes": [
    {
      "url": "https://www.servantkeeper.com/contact-us",
      "email": "billing@servantkeeper.com"
    },
    {
      "url": "https://www.servantkeeper.com/contact-us",
      "email": "sales@servantkeeper.com"
    },
    {
      "url": "https://keepersushi.com/",
      "email": "info@keepersushi.com"
    },
    {
      "url": "https://business.gulfchamber.org/list/member/keeper-s-bistro-and-bar-2634",
      "email": "info@gulfchamber.org"
    },
    {
      "url": "https://www.keepersbistro.com/contact-1",
      "email": "info@keepersbistro.com"
    },
    {
      "url": "https://keepersushi.com/sugar-land-sugarland-keeper-s-japanese-restaurant-and-bar-about",
      "email": "info@keepersushi.com"
    },
    {
      "url": "https://www.biffsbistro.com/contact/",
      "email": "donations@oliverbonacini.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "sarahh@bistrolive.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "elliec@bistrolive.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "info@bistrolive.com"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "email": "kellye@bistrolive.com"
    },
    {
      "url": "https://keepersaustin.com/",
      "email": "catering@silkrh.com"
    },
    {
      "url": "https://keepersaustin.com/",
      "email": "info@keepersaustin.com"
    },
    {
      "url": "https://keepersheartwhiskey.com/about-us/",
      "email": "info@keepersheartwhiskey.com"
    }
  ],
  "mails": [
    "billing@servantkeeper.com",
    "catering@silkrh.com",
    "donations@oliverbonacini.com",
    "elliec@bistrolive.com",
    "info@bistrolive.com",
    "info@gulfchamber.org",
    "info@keepersaustin.com",
    "info@keepersbistro.com",
    "info@keepersheartwhiskey.com",
    "info@keepersushi.com",
    "kellye@bistrolive.com",
    "sales@servantkeeper.com",
    "sarahh@bistrolive.com"
  ],
  "nombre_sitio": "keepersbistro.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.servantkeeper.com/contact-us",
      "text": "Contact Us | Servant Keeper Already using Servant Keeper? Say Yes to the Active Subscription question, and add your Customer ID Say Yes to the Active Subscription question, and add your Account ID It's A Miracle! Close. It's actually great church management software! Over 30,000 churches trust Servant Keeper church software. See how we can save your team hundreds of hours of work. Fill in your info to the right, and someone will get back to you shortly! What's inside Our Easy-To-Use Platform? â Church Management - Streamline membership, contributions, and outreach. Online Giving - Encourage generosity with easier donations. Communications - Connect instantly with your community via text & email. Sites, Apps, & Livestream - Expand your ministryâs reach. Child Check-In - Create a fun, safe place for kids to grow in the Word. Aimee W. Servant Keeper is in touch with churchesâ needs. Contact Us! Interested in a consultation? Fill out this form. First Name Last Name Email Address Organization Phone Number Do you have an active subscription with Servant Keeper? No â I'd like to learn more Yes â I want to explore adding services Yes â I need product support Yes â I need billing support Account ID Share anything specific we should know ahead of time (optional) Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Support Phone: (800) 785-3416 Email: support@servantkeeper.com Monday & Friday 10:00 am - 4:00 pm ET Tuesday, Wednesday &Â Thursday 9:00 am - 5:30 pm ET Billing Phone: (800) 773-7570 (Option 2) Email: billing@servantkeeper.com Monday &Â Friday 10:00 am - 4:00 pm ET Tuesday, Wednesday &Â Thursday 9:00 am - 5:00 pm ET Contact Support Now Reports 3 Common Mistakes in Church Capital Campaigns & How to Avoid Them Discover 3 common mistakes in church capital campaigns and how to avoid them with Servant Keeperâs giving, reporting, and dashboard tools. Learn expert tips to enhance storytelling, track progress, and streamline donations for a successful campaign. Children Child Check-in: 5 Must-Dos for Safe & Streamlined Classes Ensure child safety and streamline your church's check-in process with these 5 essential practices. Discover how Servant Keeperâs child check-in software enhances security and creates a welcoming experience for families in your childrenâs ministry. Communication 7 Steps to Better Church Newsletters Discover 7 steps to create engaging church newsletters that connect with your congregation. Learn how to use Servant Keeperâs church app and email tools to keep members informed and inspired. Giving 3 Church Budget Mistakes You May Be Making . . . and How to Avoid Them Discover 3 common church budget mistakes and how to avoid them with Servant Keeperâs expert tips. Learn to create a flexible, transparent budget to boost your ministry in 2025. Website 5 Easy Best Practices for Your Church Website Discover 5 best practices for church websites to attract visitors & engage members with Servant Keeperâs beautiful drag-and-drop builder. 5 Tips for Seamless Church Management Platform Adoption Learn 5 key strategies to successfully transition to a Church Management Platform. Streamline tasks, boost engagement, and manage data effectively. Children 5 child safety policies to make your congregation safer (Part 1) Discover 5 critical child safety policies to protect children in your church. Learn about screening, supervision, and more to ensure a secure environment. Read part 1 now! Giving The Benefits of Recurring Donations Discover how recurring donations boost church financial stability and donor engagement. Learn the benefits of predictable revenue, increased giving, and stronger community ties with Servant Keeperâs all-in-one platform. Giving Analyzing Online Giving For Better Results Discover how to analyze online giving data to increase donations and engagement. Learn key metrics, trends, and tools churches can use to improve digital fundraising results. Children How Child Safety Software Helps Identify Vulnerabilities and Build Trust for Your Congregationâs Summer Programs Ensure child safety and build parent trust in your churchâs summer programs with tools for background checks, secure check-in, staff planning, and parent communication. Giving Engaging the Next Generation: Giving Strategies For Younger Donors Discover proven strategies to increase church giving from Gen Z and Millennials. Learn how digital tools, real-time donation prompts, and impact-focused messaging can inspire generosity from younger donors. Events 3 opportunities to keep your congregation engaged after Easter is over Discover 3 strategies to maintain post-Easter momentum and foster community engagement. Learn how to connect with attendees, personalize communication, and host events to grow your congregation year-round. Giving Take Control of Your Churchâs Budget with Recurring Giving Struggling with inconsistent giving? Discover how recurring giving helps your church create a stable budget, eliminate giving gaps, and free up more time for ministry. Learn more today! Giving Simplify Giving with Custom Forms and QR Codes Learn how Servant Keeper's Online Giving feature makes generosity simple and accessible for your church community. With the ability to create multiple custom giving forms, automatically generated QR codes, and unique links, you can tailor donation pages for tithes, events, or campaigns while providing donors with a seamless giving experience. Discover how this feature enhances clarity, boosts engagement, and streamlines sharing to transform your churchâs giving strategy. Get started today! Accounting Servant Keeper Plus: Your Best Accounting Software Solution Learn why joining powerful church contribution tracking software with industry leading accounting software is the recommended way to manage ministry finances. Case Study: Camarillo United Methodist Church After using the same church software system for 20 years, Camarillo United Methodist Church (CUMC) knew it was time to consider new software. Improving Staff Uptake with Easy-to-Use Solutions For Ministries âI can set a volunteer down with Servant Keeper, and in a day theyâre up and running.â - Pastor Brad, Greater Portland Baptist Church Increasing efficiency of Community Chaplain Response Team With Servant Keeper in place, over 3 times as many people can be served each week through faster intake, more automated follow-up support, and much easier communication amongst staff and those they serve 25 years and counting with Servant Keeper Case Study: Greater Fairview + Servant Keeper Top Five Ways to boost VBS Effectiveness Top Five Tips to Boost VBS Effectiveness Avoid the Scariest Part of Trunk or Treat: 5 Steps 5 Steps to Building Relationships with Trunk or Treat Attendees 5 Professional Church Event Promotion Tips on a Limited Budget Tips for Church Event Promotion on Limited Budget 6 Signs Itâs Time for an Improved Church Directory Easy Ways to Make Childrenâs Ministry Safer This Month â Pt. 1 Easy Ways to Make Childrenâs Ministry Safer This Month â Pt. 2 Printing Your Own Statements is Easy Donât Let Your Group Miss Out on Online Profiles | Servant Keeper 5 Reasons Churches Love Online Directories How Notes Can Help You Serve & Connect Your Team How to Use Merge for Email and Print (Plus Why You Should) Manage Campaigns with Automated Pledge Tracking A Quick Look at Reporting for Churches Using Servant Keeper Groups to Better Manage Ministry Enhancing Your Volunteer Lifecycle Technology Churches Need in 2018: Online Directory Technology Churches Need in 2018: Email Campaigns Accounting Software vs. Church Software How Servant Keeper Helps you Enter Contributions Faster See How Easy it Can be to Send Out Contribution Statements Make Your VBS Safer in 24 Hours(Why You  Need Background Checks) 10 Background Screening Best Practices Child Ministry Background screening best practices for VBS & Children's Ministry Volunteer Recognition eToolkit How to Create a Culture of Service To Screen or Not to Screen Track & Manage Your Ministry Health with Powerful Dashboards Remote Church: 4 Free Tools to Connect Your Ministry 5 Ways Our Mobile App Streamlines Your Ministry Work Servant Keeper + Faithlife: The Future of Church Tech Easy Tools to Help Your Small Group Leaders Communicate 6 Tools to Manage Church Events and Facilities Increase VBS Attendance Last Minute Easter Promotion 5 Church Health Vital Signs to Check Now The 10 Most Important Church Staff Relations & How to Strengthen Them Are You Making These 5 Church Leadership Mistakes? Childrenâs Ministry Challenges: 7 Problems 7 Simple, Effective Ways Your Members Can Appreciate Their Pastor 5 Strategies to Elevate Your Ministryâs Efforts Navigating Ministry Trends 2024: Insights, Strategies, &  Growth How Church Management Software Streamlines Administration How to Plan your Ministry Calendar Tips for Promoting Ministry Activities to Encourage Greater Involvement How to (& How Not to) Talk About Tithing on Easter Easter Resource Bundle Letâs Ace Church Communications Letâs Build a Better Church Website Ministry Burnout First Aid Kit 5 Strategies to Elevate Your Ministry this Fall Top 5 Church Tech Trends to Watch in 2024 Master Ministry Planning Recorded: Easy Ministry Management with Servant Keeper Leadership Ministry Impact: How to Evaluate and Measure What Matters Staff Ministry Management Made Easy Tips to simplify your workload and lighten your day. Leadership How to Do Remote Church Training in 5 Steps Tips to simplify your workload and lighten your day. Contribution Easy Ministry Management with Servant Keeper Tips to simplify your workload and lighten your day. Giving 5 Steps to Foster Generous Giving in Tough Times Learn 5 actionable steps to encourage generous giving in your church during economic challenges. Foster discipleship, leverage technology, and build a culture of generosity. Read our guide to inspire giving that supports your ministryâs vision. Leadership The Not-So-Obvious Link between Discipleship and Stewardship Explore the vital link between discipleship and stewardship in this insightful blog post. Learn how viewing yourself as a steward of Godâs resources transforms your life, from managing resources to giving freely and making disciples. Discover biblical insights from the parable of the talents and the Great Commission. Giving 4-Step Recipe for Church Capital Campaign Landing Pages That Work Discover a 4-step guide to create a church capital campaign landing page that inspires donations. Learn how to use clear words, emotional storytelling, engaging visuals, and strategic design to connect with your community. Read now! Reports 5 Spectacular Ways to Use Your Church Management Reports Discover Servant Keeper: powerful church management software to streamline reporting, communication, and engagement. Connect with members, manage facilities, and grow your ministry with ease. Try it today! Email Why People Aren't Reading Your Church Emails and How to Fix It Learn why your church emails arenât being read and how to fix it with 5 practical tips. Discover how to craft concise, engaging, and purposeful emails using Servant Keeperâs tools to connect with your congregation. Boost engagement today! Sorry, there are no resources that match your search. newsletter Talking In Good Faith No one wins an argument. Use principled persuasion to point people down your path. Sign up to get our newsletter sent to your inbox Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Location 220 Woodward Ave, Lock Haven, PA 17745 800-773-7570 Sales Phone: (800) 773-7570 option 1 Email: sales@servantkeeper.com Mon & Fri 10:00 am - 4:00 pm ET Tues-Thus Â 9:00 am - 5:00 pm ET Support Phone: (800) 785-3416 Email: support@servantkeeper.com Mon & Fri 10:00 am - 4:00 pm ET Tues-Thus Â 9:00 am - 5:30 pm ET Billing Phone: (800) 773-7570 option 2 Email: billing@servantkeeper.com Mon & Fri 10:00 am - 4:00 pm ET Tues-Thus Â 9:00 am - 5:00 pm ET Product Sites, Apps, & Livestream Church Management Communications Child Check-In Online Giving Solutions Administration Pastors Treasurer Children's Ministry IT About Company Giving Terms of Use Privacy Policy General Terms and Conditions Resources Latest Webinars Articles White Papers Case Studies Copyright 2025, Servant Keeper, LLC Design by Bullpen"
    },
    {
      "url": "https://keepersushi.com/",
      "text": "Keeper's Japanese Restaurant & Bar - Sugarland, Sugar Land, TX × Order your favorite dishes in seconds! Order Online × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Skip to Main Content (281)-242-0389 info@keepersushi.com 4654 Hwy 6                                                          , Sugar Land About Us Menu Happy Hour Catering Parties Reservations Gift Cards Jobs Pick Up Delivery order from Ubereats order from GrubHub AWARDS Facebook page Yelp page Toggle navigation Facebook page Yelp page About Us Menu Happy Hour Catering Parties Reservations Gift Cards Jobs Pick Up Delivery AWARDS order from Ubereats order from GrubHub Check out our great menu and Happy Hour! Our Menu Host a private party with us! Private parties Check out our great menu and Happy Hour! Our Menu previous slide next slide Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 map marker pin 4654 Hwy 6, Sugar Land, TX 77478 About Keeper's Sushi Keeper’s Japanese Restaurant is all about variety. With an ever-expanding menu of delightful sushi as well as kitchen items, there is something for everyone. With over twenty-five years as a sushi chef and two previous restaurants (Kaneyama and Sushi King) under his belt, Exclusive chef Keeper is finally bringing his inventive cuisine to his hometown, Sugar Land. More about us Host Your Private Parties with us! Private parties about the Restaurant Reservations Join us today Click button below to make a reservation Book Now a table Reviews review by - Yelp Ryan H.: THE best sushi takeaway, for every day! Bentos for lunch rolls for dinner; either way it's a winner. My fav is tofu, sansi; thats a pleaser for this guy. review by - Yelp Bushra A.: I'm so glad that we went there, our experience was as wonderful as the service, they took our contactless temperature and since we chose to use paper products they had a different lounge, we really enjoyed the drinks and food. Portion sizes were good and they have a good variety of drinks, sushi bar is amazing, everything was fresh. Hostess was great since it was our first visit we asked her recommendations and didn't get disappointed. Would definitely be back for another great sushi experience. review by - Google Charles O'Brian: Every single visit to Keeper's has been perfect. Each dish was perfectly prepared each time. Quality, presentation and preparation is on point. I cannot say enough about the staff here, specifically Daniel. He has been our server a few times, and his service is impeccable. Happy, friendly and always ready with suggestions and guidance. We will always request him. Overall, the staff seems happy to work here, which tells me quite a bit about the management. I don't give out 5 stars very easily, but Keepers has earned it. review by - Yelp Priscilla Y: I've been coming here since they opened many moons ago! I compare literally ALL sushi places I eat to Keepers. I'm a regular and have nothing but good things to say about it! review by - Yelp Jerica C: Best sushi restaurant in Houston. Everything is always perfect! They have fresh grated wasabi and hamachi Kama so you can't beat it. review by - Yelp Lindsey R: Great happy hour! They have all day happy hour on Saturday and Sunday as well. My must haves are the angry lion, jalapeño age, and the Houston roll. review by - Yelp Truc N: Keepers is the place to go for HH food and drinks in sugarland! I've always received exceptional service and I love the bartender tiffany! She's so genuine and sweet. review by - Yelp Brigitte F: I got the spider roll and it was soooooo good! Highly recommended sushi place! The inside is big as well, plenty of space !. Newsletter Location 4654 Hwy 6 Sugar Land, TX 77478 Hours Mon, Tue, Wed, Thur 11:30 AM - 10:30 PM Fri, Sat 11:30 AM - 11:30 PM Sun 11:30 AM - 10:00 PM Find us on... Facebook page Yelp page Contact us (281)-242-0389 info@keepersushi.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. Order Reserve Parties Catering Jobs × Newsletter We strive to make our website accessible to everybody. Learn More."
    },
    {
      "url": "https://business.gulfchamber.org/list/member/keeper-s-bistro-and-bar-2634",
      "text": "Keeper's Bistro and Bar | Restaurants | Restaurants & Specialty Dining Skip to content Banner Sample Next Previous Facebook Instagram Home About Us Chamber Leadership Members Membership Application Membership Benefits Business Listings Helpful Links Events Annual & Monthly Events Job Postings Online Documents Contact Us Keeper's Bistro and Bar Categories Restaurants Restaurants & Specialty Dining 114 Sailors Cove Dr Port St. Joe FL 32456 (850) 227-9872 Visit Website Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Gulf County Chamber of Commerce | Site by GrowthZone Gulf County Chamber of Commerce telephone 850-227-1223 address 321B Reid Ave • Port St. Joe, Florida 32456 email info@gulfchamber.org Facebook Instagram © 2025 Gulf County Chamber of Commerce. All Rights Reserved. Scroll To Top"
    },
    {
      "url": "https://www.keepersbistro.com/contact-1",
      "text": "Contact 1 — keeper's 0 Skip to Content Home Menus + Events Gallery Contact keeper's Call Us! Open Menu Close Menu Home Menus + Events Gallery Contact keeper's Call Us! Open Menu Close Menu Home Menus + Events Gallery Contact Call Us! We’d love to hear from you! info@keepersbistro.com 850.227.9872 114 Sailors Cove Dr. Port St Joe, FL 32456 Name * First Name Last Name Email * Message * Thank you! Purchase Gift Cards Here"
    },
    {
      "url": "https://keepersushi.com/sugar-land-sugarland-keeper-s-japanese-restaurant-and-bar-about",
      "text": "Keeper's Japanese Restaurant & Bar - About Skip to Main Content (281)-242-0389 info@keepersushi.com 4654 Hwy 6                                                          , Sugar Land About Us Menu Happy Hour Catering Parties Reservations Gift Cards Jobs Pick Up Delivery order from Ubereats order from GrubHub AWARDS Facebook page Yelp page Toggle navigation Facebook page Yelp page About Us Menu Happy Hour Catering Parties Reservations Gift Cards Jobs Pick Up Delivery AWARDS order from Ubereats order from GrubHub About Keeper’s Sushi Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 Dot slide navigation number 6 Dot slide navigation number 7 Dot slide navigation number 8 Dot slide navigation number 9 About Keeper’s Sushi About us Keeper’s Japanese Restaurant is all about variety. With an ever-expanding menu of delightful sushi as well as kitchen items, there is something for everyone. With over twenty-five years as a sushi chef and two previous restaurants (Kaneyama and Sushi King) under his belt, Exclusive chef Keeper is finally bringing his inventive cuisine to his hometown, Sugar Land. Now Sushi-lovers and food aficionados alike can enjoy mouth-watering, fresh food in an elegant, yet welcoming atmosphere. Contact us: by phone (281)-242-0389, by email info@keepersushi.com Order Reserve Parties Catering Jobs"
    },
    {
      "url": "https://www.biffsbistro.com/contact/",
      "text": "Contact Us - Hours | Biff's Bistro About News Menus Contact Private Dining Gift Cards RESERVATIONS Toggle navigation About News Menus Contact Private Dining Gift Cards Instagram Facebook RESERVATIONS Contact getting here: directions » les heures Lunch Tues–Fri: 11:30am–3pm Dinner Tues–Thurs: 3–9pm Fri: 3–10pm Sat: 4–10pm Sun: 4–9pm Bar Tues–Thurs: 11:30am–10pm Fri: 11:30am–11pm Sat: 4–11pm Sun: 4–9pm Special Hours Wed, Sep 17: 11am–2pm (Closed for Private Dinner Event) téléphone: (416) 860-0086 getting here: 2 Front St. E Toronto, ON M5E 1B2 téléphone: (416) 860-0086 location & parking Underground parking is available in the 33 Yonge building, accessible from Scott Street between Wellington and Front Streets. The restaurant entrance is located off Front Street (look for the red doors). Donations Please email your donation/sponsorship requests to donations@oliverbonacini.com a minimum of six weeks prior to your event date. Be in touch to book and confirm your reservations immediately, we encourage you to use our online booking system . About News Menus Private Dining Gallery Contact Don’t miss out on exclusive offers and news Subscribe to our newsletter Contact: 2 Front St. E, Toronto, ON M5E 1G4 (416) 860-0086 More: Press Gift Cards Contact Reservations Discover the O&B Restaurant family © 2025 Oliver & Bonacini Accessibility Menus Reserve Back to Top × Please note: Ongoing promotions are subject to change, and may not be available during other promotions or special menus. Lunch Tues–Fri: 11:30am–3pm Dinner Tues–Thurs: 3–9pm Fri: 3–10pm Sat: 4–10pm Sun: 4–9pm Bar Tues–Thurs: 11:30am–10pm Fri: 11:30am–11pm Sat: 4–11pm Sun: 4–9pm Special Hours Wed, Sep 17: 11am–2pm (Closed for Private Dinner Event) Book a Table Party Size: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 18 19 20 Date: 20% off O&B gift cards until Dec 3! Valid at 15+ Toronto restaurants. Treat a foodie in your life (or yourself!). Gift cards never expire. Buy now and dine in style in 2025! Discount available until Dec 3. Buy Online"
    },
    {
      "url": "https://www.bistrolive.com/contact-us/",
      "text": "Contact Bistro Live | Get in Touch & Plan Your Event 0116 262 1212 BOOK Menu Whats On Leicester Nottingham Milton Keynes Special Offers Christmas What's On Christmas (current) Hen Parties (current) Birthdays (current) Other Events Great Nights Out NYE Private Parties Our Business Club School Proms Helpful Info FAQ's Latest News Meet the Team What People Say About Us Where we are Join Our Team Food Menus September to November 2025 Christmas Menu 2025 Drinks Menu (current) Contact Us (current) My Account Make a payment BOOK 0116 262 1212 Select an option below to help us direct you to the right person Select an option below to help us direct you to the right person Get In Touch Make An Enquiry Download A Hen Party Brochure Download A Christmas Brochure Download A Birthday Brochure Hire Bistro Live Exclusively Enquire About Business Club Host Your Prom Event Get In Touch Make An Enquiry Download A Hen Party Brochure Download A Christmas Brochure Download A Birthday Brochure Hire Bistro Live Exclusively Enquire About Business Club Host Your Prom Event Need to contact us? We Can Help... Got a question and not got the time to give us a call? Just fill in below and we'll get back to you asap! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your enquiry. You also agree to receiving information about our nights out. Please note - we will process and use your data in accordance with our Privacy Policy . YES, I’m happy to receive further information NO, I don’t want to receive further information Found the date you're looking for? GREAT - fill in the form below and we will check the availability for you. One of the team will give you a call and let you know if we can fit you in... Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your booking enquiry. You also agree to receiving information about our nights out. Please note - we will process and use your data in accordance with our Privacy Policy . YES, I’m happy to receive further information NO, I don’t want to receive further information Request a Hen Brochure To request your copy of our hen brochure with details about the night and our packages please fill in your details below and we'll email it over! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Likely Date of Hen Night Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your hen party enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Request a Christmas Brochure To request your copy of our Christmas brochure with details about our nights and our packages, please fill in your details below and we'll email it over! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your Christmas enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Having trouble filling in this form? Click here to email us with your name, email address and contact number and we’ll get in touch! Download a Birthday Brochure To request your copy of our Birthday Brochure, with details about the night and our packages, please fill in your details below and we'll email it over! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your birthday party enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Privately Hire Bistro Live Looking for an impressive venue for your corporate event or private party? Just fill in the form and we will get back to you asap! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Date of Event Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' By clicking the button above you agree to us contacting you in order to deal with your private party enquiry. Please note - we will process and use your data in accordance with our Privacy Policy. YES, I’m happy to receive further information NO, I don’t want to receive further information Join us for Business Club Our monthly networking event might be the perfect opportunity for you. Just fill the form in below, add the name of your business and the month you'd like to attend and Sarah will be in contact with you. Please note, the Business Club runs at our Leicester Venue ONLY. Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' Project Prom at Bistro Live Looking for an impressive venue for your prom event? Just fill in the form and we will get back to you asap! Title... Mr Mrs Miss Ms Dr Prof Sir Lord Lady Enter your post code and click to find your address Address lookup Or Enter address manually Preferred Party Date Date of Event Location... Leicester Nottingham Milton Keynes Date of Birth How did you hear about us? Recommended by a friend Found you on Google Saw a Facebook post Other social media post Received an email Received a text I’ve been to Bistro Live before Other Please wait whilst your request is submitted. Do not click 'Back' YES, I’m happy to receive further information NO, I don’t want to receive further information Quick Links Hen Parties Birthdays Christmas Blog T's & C's Privacy Policy Cookie Policy Bistro Live Ltd, registered in England no. 4106667. Registered office: 89-91 Charles St, Leicester, LE1 1FA × MESSAGE SENT! You've successfully updated your booking CLOSE ITEMS Loading... CLOSE"
    },
    {
      "url": "https://keepersaustin.com/",
      "text": "Homepage - Keepersaustin Skip to content MENUS & HOURS INFO RESERVATION GIFT CARDS Mailing List Contact us Menus Dinner Bar Dessert Order On Line Happy Hour available daily 3:00pm-6:30pm Specials Hours Sunday-Wednesday  3pm-9pm Thursday-Saturday 3pm-10pm Happy Hour Daily 3pm-6:30pm Specials Daisy Lounge Reservations Gift Cards Catering Contact us Mailing List Menu & Hours Info Specials 5701 W Slaughter Lane Building D, Austin, Texas 78749 Neve | Powered by WordPress Dinner Menu Sun-Wed 3:00pm-9:00pm Thursday 3:00pm-10:00pm Friday - Saturday 3pm-11pm Bar Menu Dessert Menu Happy Hour Available daily 3:00pm-6:30pm Sunday 3:00pm-close Late Night Friday-Saturdays 10pm-11pm Order On Line Keepers Austin 5701 W Slaughter Lane, Building D Austin, Texas 78749 Keepers Austin Keepers is a cozy neighborhood restaurant in the heart of Circle C in Austin. Our globally inspired dishes feature tacos with house-made heirloom blue corn tortillas, fresh local ingredients and sustainably caught seafood, juicy burgers and steaks and scratch made desserts. Pull up a seat at our raw bar and enjoy a rotating selection of fresh seafood, oysters, and hand rolls. Our white oak wrapped bar serves a thoughtful list of wines, cocktails and beers from Austin’s best local breweries. Our covered patio is not to be missed and hosts an array of tropical plants and cool misting fans inviting you to stay awhile. Join us for brunch, dinner or our daily happy hour. \n \nWe look forward to serving you! Chefs Amir & Ali Hajimaleki Catering Inquiries Reservations Visit our Sister Restaurants Subscribe to Our Mailing List Name Email Subscribe You can unsubscribe at anytime Specials Monday - 1/2 price Bottle Night Tuesday- All Day HH for Teachers Wednesday- $2  off Liquor of the Month Thursday- Pint & Po'boy Special Saturday- Buckets & Boils Teachers and Veterans Teachers - 15% off Entree (with valid ID) Veterans - 20% off Entree (with Valid ID)"
    },
    {
      "url": "https://keepersheartwhiskey.com/about-us/",
      "text": "About Us | Keeper's Heart Whiskey Keeper’s Heart About Us Our Whiskey Irish + American Irish + American 110 Proof Irish + Bourbon Irish + Bourbon Cask Strength 10 Year Irish Single Malt 21 Year Irish Single Malt Single Barrels Our Process Drinks Cask Society News Shop Buy Whiskey Find Near You Personalized Labels Merch Store Corporate Gifting Visit Facebook X Instagram YouTube About Us A NEW STYLE OF WHISKEY Discover a new taste experience with our award-winning whiskey that brings together the rich heritage of Irish and American whiskey-making traditions. This new to world style brings together the smoothness and richness of Irish whiskey with the boldness and complexity of American whiskey, creating a unique drinking experience like no other. Enjoy it neat, on the rocks, or in cocktails, and savor the perfect balance of flavors in every sip. Expertly Crafted A marriage made in whiskey heaven. World renowned Master Distiller, Brian Nation, hailing from Ireland, and best known for his work with Irish distillers on iconic whiskey brands such as Jameson, Redbreast, and Midleton has collaborated with the wizard of American whiskey and founder of High West Distillery, David Perkins to bring together the best of Irish and American whiskey-making traditions. Their combined experience, passion, and knowledge has allowed them to create a new whiskey that seamlessly fuses the best of both worlds, that whiskey lovers around the world can enjoy. MOST AWARDED NEW WHISKEY Since launching, Keeper’s Heart Whiskey has earned 150 awards and accolades across leading whiskey competitions including, World's Best Irish Whiskey at the 2023 San Francisco World Spirits Competition, “Best Whiskey in a Highball,” at the World Cocktail Championships by the Beverage Testing Institute, Platinum at the Critics Challenge International Spirits Competition, Triple Gold at the MicroLiquor Spirit Awards, and a 96 points and a Platinum at the Las Vegas Global Spirits Awards. Fugit Hora Celebrate the Moments Worth Keeping Savor the company of loved ones with every sip of Keeper’s Heart whiskey, crafted to unlock the best of times. Founded by cousins Patrick & Michael O'Shaughnessy, the O'Shaughnessy family motto, \"Fugit Hora\" or \"The Hour Flies,\" reminds us to cherish every moment spent with those closest to us. Whether it's a special occasion or a casual gathering, our whiskeys are the perfect addition to any celebration. So raise a glass and enjoy the fleeting moments - because before you know it, the hour flies. Our Home Destined to put Minnesota on the World Whiskey Map, O’Shaughnessy Distilling Co. dedicates more than 15,000 square feet entirely to the whiskey making process, including our signature component: three wondrous copper pot stills. The remainder of the distillery consists of our Restaurant & Bar, featuring unique shared spaces for people to come together and enjoy our delicious food and signature cocktails. OUR LOGO Every element of our logo was carefully considered to tell a part of our story. 01 KEEPER’S Represents our desire to cherish the important elements of life: loved ones, time, traditions. It is also our tip of the cap to that community whose mission is to serve: the world’s barkeepers. 02 THE HEART Everything we do comes from the heart, with passion and honesty. We also always carefully select the heart of the distillation. 03 THE CLOCK Represents the specialness of time spent together and a reminder from the family to enjoy every moment. Fugit Hora, The Hour Flies , is our family motto and reminder to slow down and enjoy every moment. 04 THE KEYS Your invitation from the family to join ours. We look forward to unlocking experiences together. 05 THE KEEP Traditionally every castle has a Keep—the innermost sanctum where the family’s most prized possessions are kept. Our Keep represents the specialness of the liquid created by Master Distiller Brian Nation. Home About Us Our Whiskey Drinks Visit Where to Buy Cask Society Contact Cask Members Privacy Policy Terms & Conditions 600 Malcolm Ave SE Minneapolis, MN 55414 info@keepersheartwhiskey.com Facebook X Instagram YouTube © 2025 O’Shaughnessy Distilling Co. Minneapolis, MN. — Keeper’s Heart Whiskey. 43% alc/vol. Please drink responsibly."
    }
  ]
}