{
  "fuentes": [
    {
      "url": "https://keg.social/karaoke",
      "email": "party@keg.social"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "legal@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "marketing@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "accessibility@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "birthdayprogram@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "consommateur@st-hubert.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "franchising@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "humanresources@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "investorrelatons@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "jimmy.dudomaine@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "marketing@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "privacy.officer@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "email": "thekeg@kegrestaurants.com"
    },
    {
      "url": "https://keg.social/",
      "email": "party@keg.social"
    },
    {
      "url": "https://orlandodailyliving.com/business/keg-social-orlando-dining-entertainment-12850-waterford-lakes-pkwy-orlando-florida",
      "email": "party@keg.social"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "legal@kegrestaurants.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "marketing@thekeg.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "accessibility@thekeg.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "birthdayprogram@thekeg.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "consommateur@st-hubert.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "franchising@kegrestaurants.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "humanresources@thekeg.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "investorrelatons@kegrestaurants.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "jimmy.dudomaine@thekeg.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "marketing@thekeg.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "privacy.officer@kegrestaurants.com"
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "email": "thekeg@kegrestaurants.com"
    },
    {
      "url": "https://mail.keg.social/",
      "email": "party@keg.social"
    },
    {
      "url": "https://keg.social/contact",
      "email": "party@keg.social"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "legal@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "employment@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "employment@thekeg.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "franchising@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "giftcard@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "investorrelations@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "investorrelatons@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "marketing@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "marketing@thekeg.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "privacy.officer@kegrestaurants.com"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "email": "thekeg@kegrestaurants.com"
    },
    {
      "url": "https://keg.social/arcade",
      "email": "party@keg.social"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "legal@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "employment@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "employment@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "franchising@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "giftcard@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "investorrelatons@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "marketing@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "marketing@thekeg.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "privacy.officer@kegrestaurants.com"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "email": "thekeg@kegrestaurants.com"
    },
    {
      "url": "https://keg.social/bowling",
      "email": "party@keg.social"
    }
  ],
  "mails": [
    "accessibility@thekeg.com",
    "birthdayprogram@thekeg.com",
    "consommateur@st-hubert.com",
    "employment@kegrestaurants.com",
    "employment@thekeg.com",
    "franchising@kegrestaurants.com",
    "giftcard@kegrestaurants.com",
    "humanresources@thekeg.com",
    "investorrelations@kegrestaurants.com",
    "investorrelatons@kegrestaurants.com",
    "jimmy.dudomaine@thekeg.com",
    "legal@kegrestaurants.com",
    "marketing@kegrestaurants.com",
    "marketing@thekeg.com",
    "party@keg.social",
    "privacy.officer@kegrestaurants.com",
    "thekeg@kegrestaurants.com"
  ],
  "nombre_sitio": "keg.social",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://keg.social/karaoke",
      "text": "Private Karaoke in Orlando – Sing & Party with Friends activities private events food drinks more private events contact us careers gallery weekly specials blog activities private events food drinks more Orlando Karaoke Lounges for Parties, Date Nights & Groups hours + Information karaoke pricing Keg Social Orlando does not take reservations. All activities are first-come, first-served unless pre-booked as a private event. Walk-ins are welcome, but wait times may vary. Private karaoke rooms for up to 40 guests, with food + drink service delivered to your lounge. all lounges 21+ karaoke at keg social orlando is a 21+ activity please note that our waterside patio is currently under construction, and therefore our giant Yard pong and cornhole are currently unavailable for purchase. we apologize for the inconvenience and thank you for your understanding! come see us! hours book a party 12850 Waterford Lakes Pkwy Orlando, FL 32828 407-286-3000 party@keg.social Mon - Tue: 4 PM - 1 AM Wed-Fri: 4 PM - 2 AM Sat: 12 PM - 2 AM Sun: 12 PM - 11 PM 21+ After 9 PM Get in touch with our team of event planners and start building your party today! book a party Sip on craft cocktails and snack on shareables without leaving your lounge! Queue up the bangers, the throwbacks, and the power ballads. Our massive song library lets you DJ your night your way Private Karaoke Lounges for Any Occasion From girls’ night and birthdays to date nights and team outings, our private karaoke suites are made for making memories! 15,000+ songs to fit your vibe food + Drinks Delivered to Your Mic please note that our waterside patio is currently under construction, and therefore our giant Yard pong and cornhole are currently unavailable for purchase. we apologize for the inconvenience and thank you for your understanding! karaoke lounge pricing (all lounges 21+) weekdays (Mon-Thur) walk-in rate Weekends (Fri-Sun) event rate gold lounge Maximum 10 guests $40/hour $50/hour platinum lounge Maximum 20 guests $50/hour $75/hour diamond lounge Maximum 40 guests $70/hour $100/hour Walk-in rate Event rate gold lounge Maximum 10 guests platinum lounge Maximum 20 guests diamond lounge Maximum 40 guests $50/hour $150 / 2 hrs $75/hour $225 / 2 hrs $100/hour $300 / 2 hrs Private events require a minimum of 2 hours rental on weekends. for both walk in parties and pre-planned events, KSO offers a wide range of shareable plates, entrees, and sides for everyone in your group to enjoy! to view our menus, click below. Main menu event platters & buffets Event food platters & buffets only available for pre planned and contracted events of 10+ guests. add food & drinks industry night $5 Bowling every monday Every Monday | 10PM–1AM | 21+ Only Groups of 4+ with proof of restaurant or retail employment. $10 unlimited bowling every wednesday 10PM-2AM | Exclusively 21+ Unlimited late-night bowling for just $10. Shoes not included. $5 one-hour arcade cards Monday-Friday 4PM-6PM | available monday-friday | play time begins on first swipe 01. choose activities Mix and match bowling, axe throwing, karaoke, ping pong, and more 02. add food & drinks Choose from shareable platters, buffet-style setups, and cocktail service from our full bars. 03. optional private spaces Want your own area? We offer private rooms, reserved lanes, and semi-private sections to make your group feel VIP. 04. inquire and plan Submit an event request to connect with our team! We’ll help you lock in your date, space, activities, and package details. book a private event Looking to plan ahead? Work with our in-house event planners to create a fully customized experience—perfect for birthdays, team outings, and group celebrations. book your event today! Can I make a reservation? We do not take reservations, however, you are welcome to plan an event by getting in touch with our event coordinators, through our 'Book a Party' page. ? Can we bring in personal bowling balls? Keg Social Orlando allows guests to use their personal bowling balls, with the understanding that the company is not liable for any damages that may occur as a result. ? What are the age requirements for axe throwing? Anyone who wishes to axe throw must be over the age of 14, and any participants under the age of 18 must be accompanied by an adult. ? is there a waitlist? Keg social works on a first come first served basis with a waitlist subject to availability. Guests  can call ahead to get a better idea of the current wait. ? Where can I buy activities? All of our activities (bowling, arcade cards, ping pong, axe throwing, billiards, karaoke, etc.) can be purchased at the bowling desk. ? Do you have any specials during the week? keg social offers a variety of weekly promotions and limited time deals! s All of our specials can be found here . ? ? What are the requirements for axe throwing? Anyone who wishes to axe throw must be over the age of 14, and any participants under the age of 18 must be accompanied by an adult. All guests must fill out the Axe Throwing Waiver to play. All throwers must be wearing closed-toed shoes. Keg Social Orlando allows guests to use their personal bowling balls, with the understanding that the company is not liable for any damages that may occur as a result. Can we bring in personal bowling balls? We do not take reservations, however, you are welcome to plan an event by getting in touch with our event coordinators, through our 'Book a Party' page. Can I make a reservation? Do you have any specials during the week? Yes! All of our specials can be found here! All of our activities (bowling, arcade cards, ping pong, axe throwing, billiards, karaoke, etc.) can be purchased at the bowling desk. Where can I buy activities? Our waitlist is based on volume and availability. We work on a first-come first-serve basis, and once activities are filled, we begin the waitlist. Guests are welcome to call ahead to get a better idea of the current wait, however, it is subject to change, and guests cannot be added to the waitlist over the phone. Is there a waitlist? Private Event Software powered by Tripleseat book your party today! All of our events are contracted and pre-paid, KSO does try to avoid last minute events as there's a lot that goes into the planning process. It's never too early to reach out and start planning, however, please inquire with more than 72 hours notice. We will attempt to make last minute accommodations, but full payment and finalized details are required prior to your event date in order to confirm your event. Yes, we do have a booking minimum of 10 contracted guests. For parties of less than 10 guests, you are welcome to join us as a walk-in party, where all activities and spaces are available on a first-come-first-served basis. Reserving activities through a contracted and prepaid event is the only way we can guarantee availability and that you will not have a wait time for activities, as we adhere to a contracted itinerary. Anything not included on event contracts will all be dependent on demand and available on a first-come-first served basis. How far in advance should I book an event? Is there a guest minimum? Is it better to walk in or do I need to pre-plan my event? Hours of Operation: Mon - Tue:  4PM - 1 AM Wed-Fri: 4PM - 2 AM Sat: 12PM - 2 AM Sun: 12PM - 12 AM 21+ After 9 PM Phone: 407-286-3000 Address: 12850 Waterford Lakes Pkwy Orlando, FL 32828 Email: party@keg.social Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! drinks food Book a Party Activities Home contact careers weekly specials blog private events"
    },
    {
      "url": "https://thekeg.com/en/contact-us",
      "text": "The Keg Steakhouse + Bar Reserve a Table en fr Locations Menu Gift Cards Careers Set Your Location Reserve Take Out Locations Menu Gift Cards Careers Set Your Location Reserve a Table Order Takeout en fr Contact Us We are committed to connecting with our guests. Please select one of the forms below to get in touch with us. Dining Feedback Dining Feedback As we continue to focus on delivering an exceptional Keg experience to our guests, your feedback is greatly appreciated. Submit Feedback Gift Card Inquiries Gift Card Inquiries To connect with our Gift Card Department, please submit an inquiry form below. Submit Inquiry Contact A Department Contact A Department If you have any questions or inquiries about our restaurants, we encourage you to browse our Frequently Asked Questions below or submit a request to connect with one of our departments. Submit Request Need to get in touch? Reach us directly at our corporate offices. The Keg Corporate Office (Guest Relations) 10100 Shellbridge Way Richmond, B.C. V6X 2W7 Tel: 604.276.0242 The Keg Eastern Office (HR, Marketing, Food Services) 560 King St. West, 2nd Floor Toronto, ON M5V 0L5 Tel: 416.695.2400 Frequently Asked Questions Donation Requests Employment Food & Beverage Franchising Gift Cards Keg Retail Products (Grocery) Locations Reservations Safety Social Media Collaborations Gift Certificate Donations To inquire about a donation on behalf of a charitable organization, please fill out our application to receive a donation in the form of a gift certificate.  Please note, due to the high volume of inquiries, requests will be reviewed over a 4-6 week period. Submit Request Give The Gift Of A Night Out Treat your loved ones with what they really want. Our gift cards are accepted at all locations for dine-in or takeout. They make the perfect gift and best of all, they never expire. Purchase Now Subscribe to our newsletter Sign Up Now Our Story Contact Us The Keg Steak Education Franchising Group Dining The Keg Retail Products The Keg Spirit Foundation The Keg Royalties Income Fund Nutrition & Allergen A Respectful Environment for Everyone Privacy Policy Accessibility Policy Terms of Use Privacy Policy Accessibility Policy Terms of Use Subscribe to our newsletter Sign Up Now Back to top Back to top"
    },
    {
      "url": "https://keg.social/",
      "text": "Keg Social Orlando activities private events food drinks more private events contact us careers gallery weekly specials blog activities private events food drinks more Orlando’s Ultimate Indoor Entertainment Venue for Bowling, Axe Throwing, Karaoke & More! Whether you're in the mood to let loose with your friends, create amazing memories with your family, or bond with your team, Keg Social is the ultimate destination to amp up your night out! Keg social orlando does not take any standard reservations, only pre-planned and contracted events. to book an event, click here! view activities hours + info 28 blacklight bowling lanes instructor led axe throwing 40+ arcade games private karaoke lounges ping pong, billiards, & more three Full-Service Bars explore 28 blacklight bowling lanes instructor led axe throwing 40+ arcade games private karaoke lounges ping pong, billiards, & more three Full-Service Bars explore customize your experience and choose your fun at the activities counter Play by duration, enjoy weekly specials, and play your way Start your night right with craft cocktails, chef specialties, and shareable plates eat. drink. party. play Wednesday Monday Thursday Friday $5 one-hour arcade cards Get 75% off our standard arcade cards every weeknight from 4PM-6PM social hour drink pricing $5 Call Liquors, $3 domestic beers, and $1 off canned wines every weeknight from 4PM-7PM $5 bowling 10PM-1am (21+) Work in the restaurant or retail industry? Come in for $5 Bowling every Monday for groups of 4+ Tuesday Weeknight savings Wednesday Monday Thursday Friday $5 one-hour arcade cards Get 75% off our standard arcade cards every weeknight from 4PM-6PM social hour drink pricing $5 Call Liquors, $3 domestic beers, and $1 off canned wines every weeknight from 4PM-7PM buy one hour of an activity, get one free join the zUPP app for access to our weekly in-app deals! All ZUPP deals must be redeemed through the ZUPP app. Tuesday Weeknight savings Wednesday Monday Thursday Friday $5 one-hour arcade cards Get 75% off our standard arcade cards every weeknight from 4PM-6PM social hour drink pricing $5 Call Liquors, $3 domestic beers, and $1 off canned wines every weeknight from 4PM-7PM Tuesday Weeknight savings college night $10 unlimited bowling & 50% off activities all guests can enjoy $10 unlimited bowling, and students get an additional 50% off on all other activities. 10PM-2AM (21+) Wednesday Monday Thursday Friday $5 one-hour arcade cards Get 75% off our standard arcade cards every weeknight from 4PM-6PM social hour drink pricing $5 Call Liquors, $3 domestic beers, and $1 off canned wines every weeknight from 4PM-7PM Tuesday Weeknight savings ladies night every thursday 10pm-2am (21+) enjoy our rotating ladies night themes including dirty trivia, spiced rodeo, and thirsty 2000's. Click here for the monthly calendar! Wednesday Monday Thursday Friday $5 one-hour arcade cards Get 75% off our standard arcade cards every weeknight from 4PM-6PM social hour drink pricing $5 Call Liquors, $3 domestic beers, and $1 off canned wines every weeknight from 4PM-7PM Tuesday Weeknight savings pre-built party packages for stress free planning Celebrate with ready-to-go birthday packages that include activities, food, and drinks for kids, teens, and adults. Next Back Party packages *Terms & Conditions apply for all Pre-Built Party Packages. Click here to view our event guide and learn more, or inquire with our party planners for more information! learn more Kid's Package 90 Mins of Bowling 30 Min Arcade cards Next Back book today! Party packages ages 13 and Under What's Included: one pizza per lane unlimited sodas *Terms & Conditions apply for all Pre-Built Party Packages. Click here to view our event guide and learn more, or inquire with our party planners for more information! starting at $19.99 per kid! Perfect for birthdays, school celebrations, and special occasions — designed to be fun for both kids and parents! Teen's package 1 hour of bowling 30 min axe throwing Next Back book today! Party packages ages 14-19 What's Included: choice of food platter* unlimited sodas *Terms & Conditions apply for all Pre-Built Party Packages. Click here to view our event guide and learn more, or inquire with our party planners for more information! starting at $22.99 per teen! Level up your party with the perfect mix of food, games, and hang-out time your teen will actually love. VIP package 1 hour of Billiards or karaoke* & 30 min arcade cards Next Back book today! Party packages adults 21+ What's Included: choice of food platter*, premium drink tickets, and couch reservation *Terms & Conditions apply for all Pre-Built Party Packages. Click here to view our event guide and learn more, or inquire with our party planners for more information! starting at $36.99 per adult! Good friends, great drinks, and karaoke that keeps the party going — everything you need for a stress-free celebration! fuel up for the fun with chef crafted menu items At KSO, each of our menu items are carefully crafted by our culinary experts. Whether it's at our traditional seating area, one of our bars, or at any activity, our Keg Social servers are ready to serve you food anytime, anywhere. view our menu come see us hours book a party 12850 Waterford Lakes Pkwy Orlando, FL 32828 407-286-3000 party@keg.social Mon - Tue: 4 PM - 1 AM Wed-Fri: 4 PM - 2 AM Sat: 12 PM - 2 AM Sun: 12 PM - 12 AM 21+ After 9 PM Get in touch with our team of event planners and start building your party today! book a party faq Do you have any specials during the week? Yes! All of our specials can be found here! Where can I buy activities? All of our activities (bowling, arcade cards, ping pong, axe throwing, billiards, karaoke, etc.) can be purchased at the bowling desk. Is there a waitlist? Our waitlist is based on volume and availability. We work on a first-come first-serve basis, and once activities are filled, we begin the waitlist. Guests are welcome to call ahead to get a better idea of the current wait, however, it is subject to change, and guests cannot be added to the waitlist over the phone. What are the requirements for axe throwing? Anyone who wishes to axe throw must be over the age of 14, and any participants under the age of 18 must be accompanied by an adult. All guests must fill out the Axe Throwing Waiver to play. All throwers must be wearing closed-toed shoes. Keg Social Orlando allows guests to use their personal bowling balls, with the understanding that the company is not liable for any damages that may occur as a result. Can we bring in and use our personal bowling balls? We do not take reservations, however, you are welcome to plan an event by getting in touch with our event coordinators, through our 'Book a Party' page. Private parties require a minimum guest count of 10. You cannot make reservations over the phone or without planning a private event. Can I make a reservation? gallery Private Event Software powered by Tripleseat book your party today! All of our events are contracted and pre-paid, KSO does try to avoid last minute events as there's a lot that goes into the planning process. It's never too early to reach out and start planning, however, please inquire with more than 72 hours notice. We will attempt to make last minute accommodations, but full payment and finalized details are required prior to your event date in order to confirm your event. Yes, we do have a booking minimum of 10 contracted guests. For parties of less than 10 guests, you are welcome to join us as a walk-in party, where all activities and spaces are available on a first-come-first-served basis. Reserving activities through a contracted and prepaid event is the only way we can guarantee availability and that you will not have a wait time for activities, as we adhere to a contracted itinerary. Anything not included on event contracts will all be dependent on demand and available on a first-come-first served basis. How far in advance should I book an event? Is there a guest minimum? Is it better to walk in or do I need to pre-plan my event? Hours of Operation: Mon - Tue:  4PM - 1 AM Wed-Fri: 4PM - 2 AM Sat: 12PM - 2 AM Sun: 12PM - 12 AM 21+ After 9 PM Phone: 407-286-3000 Address: 12850 Waterford Lakes Pkwy Orlando, FL 32828 Email: party@keg.social Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! drinks food Book a Party Activities Home contact careers weekly specials blog private events"
    },
    {
      "url": "https://orlandodailyliving.com/business/keg-social-orlando-dining-entertainment-12850-waterford-lakes-pkwy-orlando-florida",
      "text": "KEG SOCIAL ORLANDO - Dining & Entertainment orlandodailyliving.com : keg-social-orlando-dining-entertainment-12850-waterford-lakes-pkwy-orlando-florida Error : JavaScript is disabled For full functioning of this site it is necessary to enable JavaScript. How to enable Javascript Home Blogs Pricing Contact Us Add Listing Sign In Sign Up Top Go Back Share KEG SOCIAL ORLANDO - Dining & Entertainment 5 0 Add A Review KEG SOCIAL ORLANDO - Dining & Entertainment Location Thank You for your Reviews Rate & Write a Review Your Rating Submit Your Review Address KEG SOCIAL ORLANDO - Dining & Entertainment 12850 Waterford Lakes Pkwy, Orlando, Florida, 32828 (+1) 407-286-3000 party@keg.social 12 Premium Business Bulgogi House Korean Restaurant Service Anthony's Pizza Delivery Service Request A Quote Email Coupon To. Close Send Coupon SMS Coupon To. +1 +61 +32 +1 +33 +353 +39 +31 +64 +351 +34 +46 +44 +27 +91 +52 +49 Close Send Coupon Request A Quote: +1 +61 +32 +1 +33 +353 +39 +31 +64 +351 +34 +46 +44 +27 +91 +52 +49 Send Request We'll share your quote request with qualified businesses. They're competing to give you the best deal possible. Look out for a text message with contact information. You get to pick the winner! × We have sent you a Verification Code by SMS Didn’t Receive the OTP? Resend OTP Continue Useful Links How It works SiteMap Subscribe & Update Subscribe to get updates and information. Don’t worry, we won’t send spam! Copyright © 2025 orlandodailyliving.com. All Rights Reserved."
    },
    {
      "url": "https://www.kegsteakhouse.com/contact-us",
      "text": "The Keg Steakhouse + Bar Reserve a Table en fr Locations Menu Gift Cards Careers Set Your Location Reserve Take Out Locations Menu Gift Cards Careers Set Your Location Reserve a Table Order Takeout en fr Contact Us We are committed to connecting with our guests. Please select one of the forms below to get in touch with us. Dining Feedback Dining Feedback As we continue to focus on delivering an exceptional Keg experience to our guests, your feedback is greatly appreciated. Submit Feedback Gift Card Inquiries Gift Card Inquiries To connect with our Gift Card Department, please submit an inquiry form below. Submit Inquiry Contact A Department Contact A Department If you have any questions or inquiries about our restaurants, we encourage you to browse our Frequently Asked Questions below or submit a request to connect with one of our departments. Submit Request Need to get in touch? Reach us directly at our corporate offices. The Keg Corporate Office (Guest Relations) 10100 Shellbridge Way Richmond, B.C. V6X 2W7 Tel: 604.276.0242 The Keg Eastern Office (HR, Marketing, Food Services) 560 King St. West, 2nd Floor Toronto, ON M5V 0L5 Tel: 416.695.2400 Frequently Asked Questions Donation Requests Employment Food & Beverage Franchising Gift Cards Keg Retail Products (Grocery) Locations Reservations Safety Social Media Collaborations Gift Certificate Donations To inquire about a donation on behalf of a charitable organization, please fill out our application to receive a donation in the form of a gift certificate.  Please note, due to the high volume of inquiries, requests will be reviewed over a 4-6 week period. Submit Request Give The Gift Of A Night Out Treat your loved ones with what they really want. Our gift cards are accepted at all locations for dine-in or takeout. They make the perfect gift and best of all, they never expire. Purchase Now Subscribe to our newsletter Sign Up Now Our Story Contact Us The Keg Steak Education Franchising Group Dining The Keg Retail Products The Keg Spirit Foundation The Keg Royalties Income Fund Nutrition & Allergen A Respectful Environment for Everyone Privacy Policy Accessibility Policy Terms of Use Privacy Policy Accessibility Policy Terms of Use Subscribe to our newsletter Sign Up Now Back to top Back to top"
    },
    {
      "url": "https://mail.keg.social/",
      "text": "Keg Social Orlando Home Food Drinks Activities Book A Party Careers Contact Blog Home Food Drinks Activities Book A Party Careers Contact Blog EXPERIENCE ORLANDO'S ULTIMATE ENTERTAINMENT DESTINATION Whether you're in the mood to let loose with your friends, create amazing memories with your family, or bond with your team, Keg Social is the ultimate destination to amp up your night out! Powered by vimeo embed video generator DINE IN At KSO, each menu item is carefully crafted by our culinary experts. Keg Social servers are always ready to serve you food anywhere, anytime, whether it's in our traditional seating area, at one of our bars, or during any activity. GRAB A DRINK Come enjoy our four themed bars, including craft cocktails made with house-made syrups, 50 craft beers on tap, seasonal drafts and cans, and our upstairs Flo Bar dedicated to craft beers and spirits originating from Florida. PARTY WITH US Planning a special event? Our dedicated event team works with you to custom-build your perfect outing! Each event is uniquely shaped, including reservations for any activity and food catered to your needs. Reach out to start planning today! ACTIVITIES Get your game on with our wide variety of activities to choose from! Whether you want to bowl, shoot pool, axe throw, or battle it out in the arcade - we have something for the whole crew! JOIN THE TEAM The party doesn't start till you walk in! We are always looking for lively, outgoing, and attentive individuals to join the crew. Be sure to send in a resume so you can join the family. Contact Us! Have any Questions? Fill out our contact form to get in touch with us! KSO Dress Code To enhance the entertainment experience of all our guests we ask that you respect our dress code. Your comfort is our priority; however, we do not feel that overly casual or provocative attire is appropirate for our venue. All guests should be neatly groomed No shoes, no shirt, no service No hats, clothing, or jewelry with offensive imagery or language is permitted Any article of clothing or accessory indicative of gang affiliation is inadmissible Guests in soiled or torn clothing will only be permitted entry at the discretion of management Sagging pants are not allowed Clothing that is overly revealing is inappropriate Management has discretion with regards to enforcing our dress code and reserves the right to deny entry to or remove a guest from the premises for violating this dress code and/or for \r\n    argumentative, unsafe, threatening, hostile, rude, or offensive behavior towards our staff or other guests will not be tolerated. Check Out Our Weekly Specials! Doorbuster Deals Industry Night (21+) College Night (21+) Ladies Night (21+) Social Hour Doorbuster Deals Get ahead of the game! Whether it's the perfect after-school activity, or your favorite form of pre-gaming, get a 60-minute game card for only 5 dollars every Monday through Friday from 4-6 pm! Industry Night (21+) Join us every Every Monday 10PM-2AM $5 Bowling Per Person: For parties with 4+ guests | Max 6 guests per lane | Shoes included Late Night Social Hour: $3 Domestic Bears | $5 Call Spirits | $1 Off Canned Wine Free One-Hour Arcade Cards with proof of restaurant or retail job College Night (21+) KSO is the best place to party on a payment plan! Every Wednesday from 10PM-2AM, your student IDs get you discounts at the Keg! Get all activities for half off, all-you-can-bowl for only $10 per person, and 60-minute game cards for $5. Oh! And don't forget those social hour drink deals! Ladies Night (21+) Let's go GNO! Every Thursday at 10pm, head upstairs for a fun-filled evening with the girls and enjoy Dirty trivia, Dirty Bingo, FREE shots, and an all new Dirty Cocktail Menu. Compete in our ladies night games  to win a VIP karaoke room with wine for the group, and dance the night away with our DJ! Social Hour Monday - Friday: 4PM to 7PM $3 Domestic Beers Budweiser, Budlight, Miller Lite, Yeungling, Michelob Ultra $1 Off Canned Wine $5 Call Spirits Titos, Jim Beam, Captain Morgan, Hornitos Reposado, Aviation Gin House infomation Hours of Operation: Mon, Tue: 2 PM - 1 AM Wed, Thur, Fri: 2 PM - 2 AM Sat: 12 PM - 2 AM Sun: 12 PM - 12 AM 21+ After 9 PM\r\n            Phone: 407-286-3000 Address: 12850 Waterford Lakes Pkwy Orlando, FL 32828 Email: party@keg.social Book a Party Let's Party Follow Us! @kegsocialorlando @kegsocialorlando Stay in the Know Home Activities Food Drink Book A Party Careers Contact Weekly Specials Blog FAQ Keg Social Orlando is not affiliated with The Keg or The Keg Steakhouse & Bar. Copyright 2022 © Keg Social Orlando | 12850 Waterford Lakes Pkwy Orlando, FL 32828"
    },
    {
      "url": "https://keg.social/contact",
      "text": "Contact activities private events food drinks more private events contact us careers gallery weekly specials blog activities private events food drinks more have a question? contact us below Hours of Operation: Mon - Tue:  4PM - 1 AM Wed-Fri: 4PM - 2 AM Sat: 12PM - 2 AM Sun: 12PM - 12 AM 21+ After 9 PM Phone: 407-286-3000 Address: 12850 Waterford Lakes Pkwy Orlando, FL 32828 Email: party@keg.social Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! drinks food Book a Party Activities Home contact careers weekly specials blog private events"
    },
    {
      "url": "https://www.thekeg.com/en/keg-income-fund",
      "text": "The Keg Steakhouse + Bar Reserve a Table en fr Locations Menu Gift Cards Careers Set Your Location Reserve Take Out Locations Menu Gift Cards Careers Set Your Location Reserve a Table Order Takeout en fr The Keg Royalties \nIncome Fund Financial Reports & Fund Distributions View Financials News Releases View News Room Leadership Learn More Contact Us Connect Now Our Story Learn More Live Chart View Now Meeting Documentation & Forms Select one of the documents below to learn more: Management Information Circular July 2025 Proxy Form English July 2025 Letter of Transmittal Certificate of Abridgement Request for Financial Statements Form Financial Reports & Distributions The Keg Royalties Income Fund is committed to providing up-to-date information on our financial performance and other disclosure in a timely manner. This section provides links to our quarterly results information, financial reports and more. The Fund's investment objectives are to provide unitholders with monthly distributions; and the opportunity for capital appreciation, by investing in KEG-UN.TO. View Financials News Releases This is a one-stop source for Keg Royalties Income Fund news releases and archived news, corporate presentations and articles. Browse through our Archive section, where we put it all in perspective, with our results, company updates and more. View News Room Structures & Policies Income Fund Structure Policies Leadership C.C. Woodward Chairman, The Keg Royalties Income Fund C.C. Woodward has been Chairman of The Keg Royalties Income Fund since inception. Having spent over 11 years with Woodward Stores he was deeply involved with most aspects of the mass merchant. These included operating a number of merchandise/ marketing divisions and being a member of the Executive Committee, which managed the restructuring of the company. As well, Mr. Woodward, through his private holdings, controlled Canada's largest cattle ranch incorporating over 500,000 acres. This business comprised a vast array of forestry assets, and a completely vertically integrated cattle operation, considered the largest in North America. Among other active interests, Mr. Woodward is President of Woodcorp Investments Ltd, a private venture company. He is currently the Chair the of Vancouver Coastal Health Authority, Director of the Sea to Sky Gondola Corp, Advisor of the Army and Navy Group, Director of Village Farms International, Governor of Brentwood College School, President/Director of the Mr. and Mrs. P.A. Woodward’s Foundation. He was also past Chair of Providence Health Care and past Member of the Provincial Judicial Council. Read More Timothy Kerr Trustee Tim was born and raised in Vancouver British Columbia. Tim graduated from U.B.C. and later attended Harvard Business School A.M.P. In 1972 he and his brother ran their family business Lignum Ltd. until 2004 at which time it was sold to Riverside. During that time he sat on various forest industry committees. Since then Tim has run a family office, Springhouse Investments Corporation. In addition he and his sons manage the Timothy C Kerr Family Foundation. He is a member of the acquisition committee of the Vancouver Art Gallery. He has three sons and a German Shepard named Levy. Read More Nick Dean President & Director, Keg Restaurants Ltd. Nick Dean is President of Keg Restaurants Ltd. In his position, Nick is responsible for leading the strategic efforts of C-suite executives to develop and execute current and long-range objectives, plans and policies for the organization. With over 20+ years of business experience, Nick joined The Keg as President in 2019 after leading as CEO of Emblem Corp and KBS Canada. Nick’s first order of business at The Keg was to galvanize an effective senior leadership team by identifying critical opportunities for growth and resilience. A worthwhile investment, as Nick would lead this engaged team through the uncertainty and challenges of the pandemic. Nick’s focus for The Keg remains on growing value for shareholders. He has a steadfast respect for the hard work of Keggers and enjoys the satisfaction of creating outstanding customer experiences. As a strategic leader with an entrepreneurial mindset, Nick aims to modernize and grow Canada’s #1 beloved steakhouse in new markets. Read More Erin Legge Chief Financial Officer, Keg Restaurants Ltd. Erin Legge is the Chief Financial Officer for the Keg Restaurants Ltd. with responsibility for all finance-related functions as well as Information Technology. With 25+ years of finance and strategic operations experience, Erin joined The Keg in January 2024 from Daiya Foods Inc. where she was the Chief Financial Officer. Prior to this, Erin spent 17 years with George Weston Limited in a variety of progressively senior financial and operations roles. Erin is a Chartered Professional Accountant, Chartered Accountant and holds a Bachelor of Physical Education from McMaster University. Read More Senior Corporate Management Keg Restaurants Ltd. In addition to the members of the executive team, KRL has more than 100 years of combined experience with The Keg. The long-term association that these Keggers have with The Keg is a powerful testament to the passion and loyalty The Keg inspires within the organization. The senior management's collective experience with The Keg is one of KRL's most important assets. Senior management is a group of fully aligned and committed Keggers. Read More C.C. Woodward Chairman, The Keg Royalties Income Fund C.C. Woodward has been Chairman of The Keg Royalties Income Fund since inception. Having spent over 11 years with Woodward Stores he was deeply involved with most aspects of the mass merchant. These included operating a number of merchandise/ marketing divisions and being a member of the Executive Committee, which managed the restructuring of the company. As well, Mr. Woodward, through his private holdings, controlled Canada's largest cattle ranch incorporating over 500,000 acres. This business comprised a vast array of forestry assets, and a completely vertically integrated cattle operation, considered the largest in North America. Among other active interests, Mr. Woodward is President of Woodcorp Investments Ltd, a private venture company. He is currently the Chair the of Vancouver Coastal Health Authority, Director of the Sea to Sky Gondola Corp, Advisor of the Army and Navy Group, Director of Village Farms International, Governor of Brentwood College School, President/Director of the Mr. and Mrs. P.A. Woodward’s Foundation. He was also past Chair of Providence Health Care and past Member of the Provincial Judicial Council. Read More Timothy Kerr Trustee Tim was born and raised in Vancouver British Columbia. Tim graduated from U.B.C. and later attended Harvard Business School A.M.P. In 1972 he and his brother ran their family business Lignum Ltd. until 2004 at which time it was sold to Riverside. During that time he sat on various forest industry committees. Since then Tim has run a family office, Springhouse Investments Corporation. In addition he and his sons manage the Timothy C Kerr Family Foundation. He is a member of the acquisition committee of the Vancouver Art Gallery. He has three sons and a German Shepard named Levy. Read More Nick Dean President & Director, Keg Restaurants Ltd. Nick Dean is President of Keg Restaurants Ltd. In his position, Nick is responsible for leading the strategic efforts of C-suite executives to develop and execute current and long-range objectives, plans and policies for the organization. With over 20+ years of business experience, Nick joined The Keg as President in 2019 after leading as CEO of Emblem Corp and KBS Canada. Nick’s first order of business at The Keg was to galvanize an effective senior leadership team by identifying critical opportunities for growth and resilience. A worthwhile investment, as Nick would lead this engaged team through the uncertainty and challenges of the pandemic. Nick’s focus for The Keg remains on growing value for shareholders. He has a steadfast respect for the hard work of Keggers and enjoys the satisfaction of creating outstanding customer experiences. As a strategic leader with an entrepreneurial mindset, Nick aims to modernize and grow Canada’s #1 beloved steakhouse in new markets. Read More Erin Legge Chief Financial Officer, Keg Restaurants Ltd. Erin Legge is the Chief Financial Officer for the Keg Restaurants Ltd. with responsibility for all finance-related functions as well as Information Technology. With 25+ years of finance and strategic operations experience, Erin joined The Keg in January 2024 from Daiya Foods Inc. where she was the Chief Financial Officer. Prior to this, Erin spent 17 years with George Weston Limited in a variety of progressively senior financial and operations roles. Erin is a Chartered Professional Accountant, Chartered Accountant and holds a Bachelor of Physical Education from McMaster University. Read More Senior Corporate Management Keg Restaurants Ltd. In addition to the members of the executive team, KRL has more than 100 years of combined experience with The Keg. The long-term association that these Keggers have with The Keg is a powerful testament to the passion and loyalty The Keg inspires within the organization. The senior management's collective experience with The Keg is one of KRL's most important assets. Senior management is a group of fully aligned and committed Keggers. Read More Investor Relations Corporate Office: Keg Restaurants Ltd. 10100 Shellbridge Way Richmond, BC Canada V6X 2W7 Email us: investorrelatons@kegrestaurants.com Contact Us Subscribe to our newsletter Sign Up Now Our Story Contact Us The Keg Steak Education Franchising Group Dining The Keg Retail Products The Keg Spirit Foundation The Keg Royalties Income Fund Nutrition & Allergen A Respectful Environment for Everyone Privacy Policy Accessibility Policy Terms of Use Privacy Policy Accessibility Policy Terms of Use Subscribe to our newsletter Sign Up Now Back to top Back to top"
    },
    {
      "url": "https://keg.social/arcade",
      "text": "Arcade Games in Orlando – Classic & Modern Fun activities private events food drinks more private events contact us careers gallery weekly specials blog activities private events food drinks more Orlando’s Best Arcade for All Ages! Keg Social Orlando does not take reservations. All activities are first-come, first-served unless pre-booked as a private event. Walk-ins are welcome, but wait times may vary. Level up your night out with head-to-head challenges, retro favorites, and modern arcade thrills — all under one roof in East Orlando! hours + Information Arcade pricing please note that our waterside patio is currently under construction, and therefore our giant Yard pong and cornhole are currently unavailable for purchase. we apologize for the inconvenience and thank you for your understanding! come see us! hours book a party 12850 Waterford Lakes Pkwy Orlando, FL 32828 407-286-3000 party@keg.social Mon - Tue: 4 PM - 1 AM Wed-Fri: 4 PM - 2 AM Sat: 12 PM - 2 AM Sun: 12 PM - 11 PM 21+ After 9 PM Get in touch with our team of event planners and start building your party today! book a party Fuel up between rounds! From our bars to our seating areas, enjoy burgers, apps, and craft cocktails without missing a moment of the action. Mix up your night with time-based attractions like axe throwing, bowling, and private karaoke rooms. Perfect for group outings or friendly competition. 40+ arcade games for all ages Challenge your crew to Skeeball, pinball, racing games & more! From retro arcade favorites to high-energy modern machines, there’s something for every gamer. explore our Bowling, Axe Throwing & Karaoke! food + drink service around the venue please note that our waterside patio is currently under construction, and therefore our giant Yard pong and cornhole are currently unavailable for purchase. we apologize for the inconvenience and thank you for your understanding! arcade pricing + information Daily Price 1 hour game card Starts Upon First Swipe $20 / Hour 30 min game card Starts Upon First Swipe $15 / 30 mins weekly specials Don't miss our weekly specials! party packages choose from our kids and teens party packages for a stress free planning process custom events Looking for a custom event? choose from a la carte activities and food to build your own! food & drinks from pizzas and wings to burger sliders, our food options are great for all ages family friendly spaces Keg social is family friendly until 10PM, giving families plenty of time to celebrate! kids & teens birthday parties Looking to plan ahead? Work with our in-house event planners to create a fully customized experience—perfect for kids & teens parties of all ages! book your Party today! $5 one-hour arcade cards weekly specials 4PM-6PM Valid For One Hour Of Play Time Monday-Friday weekly specials 75% off! Can I make a reservation? We do not take reservations, however, you are welcome to plan an event by getting in touch with our event coordinators, through our 'Book a Party' page. ? Can we bring in personal bowling balls? Keg Social Orlando allows guests to use their personal bowling balls, with the understanding that the company is not liable for any damages that may occur as a result. ? What are the age requirements for axe throwing? Anyone who wishes to axe throw must be over the age of 14, and any participants under the age of 18 must be accompanied by an adult. ? is there a waitlist? Keg social works on a first come first served basis with a waitlist subject to availability. Guests  can call ahead to get a better idea of the current wait. ? Where can I buy activities? All of our activities (bowling, arcade cards, ping pong, axe throwing, billiards, karaoke, etc.) can be purchased at the bowling desk. ? Do you have any specials during the week? keg social offers a variety of weekly promotions and limited time deals! s All of our specials can be found here . ? ? What are the requirements for axe throwing? Anyone who wishes to axe throw must be over the age of 14, and any participants under the age of 18 must be accompanied by an adult. All guests must fill out the Axe Throwing Waiver to play. All throwers must be wearing closed-toed shoes. Keg Social Orlando allows guests to use their personal bowling balls, with the understanding that the company is not liable for any damages that may occur as a result. Can we bring in personal bowling balls? We do not take reservations, however, you are welcome to plan an event by getting in touch with our event coordinators, through our 'Book a Party' page. Can I make a reservation? Do you have any specials during the week? Yes! All of our specials can be found here! All of our activities (bowling, arcade cards, ping pong, axe throwing, billiards, karaoke, etc.) can be purchased at the bowling desk. Where can I buy activities? Our waitlist is based on volume and availability. We work on a first-come first-serve basis, and once activities are filled, we begin the waitlist. Guests are welcome to call ahead to get a better idea of the current wait, however, it is subject to change, and guests cannot be added to the waitlist over the phone. Is there a waitlist? Private Event Software powered by Tripleseat book your party today! All of our events are contracted and pre-paid, KSO does try to avoid last minute events as there's a lot that goes into the planning process. It's never too early to reach out and start planning, however, please inquire with more than 72 hours notice. We will attempt to make last minute accommodations, but full payment and finalized details are required prior to your event date in order to confirm your event. Yes, we do have a booking minimum of 10 contracted guests. For parties of less than 10 guests, you are welcome to join us as a walk-in party, where all activities and spaces are available on a first-come-first-served basis. Reserving activities through a contracted and prepaid event is the only way we can guarantee availability and that you will not have a wait time for activities, as we adhere to a contracted itinerary. Anything not included on event contracts will all be dependent on demand and available on a first-come-first served basis. How far in advance should I book an event? Is there a guest minimum? Is it better to walk in or do I need to pre-plan my event? Hours of Operation: Mon - Tue:  4PM - 1 AM Wed-Fri: 4PM - 2 AM Sat: 12PM - 2 AM Sun: 12PM - 12 AM 21+ After 9 PM Phone: 407-286-3000 Address: 12850 Waterford Lakes Pkwy Orlando, FL 32828 Email: party@keg.social Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! drinks food Book a Party Activities Home contact careers weekly specials blog private events"
    },
    {
      "url": "https://thekeg.com/en/careers",
      "text": "The Keg Steakhouse + Bar Reserve a Table en fr Locations Menu Gift Cards Careers Set Your Location Reserve Take Out Locations Menu Gift Cards Careers Set Your Location Reserve a Table Order Takeout en fr Create A Career You'll Love Thanks to our staff and managers, The Keg is more than just a place to work, it’s a place where life long connections are made, and a culture like no other is experienced. If you want to become a Kegger For Life™, apply today. Current Job Postings You're A Kegger, You Just Don't Know It Yet At The Keg, we look for more than just experience. A willingness to learn, grow and have fun are just a few of the commonalities Keggers share. Discover more below. Working At\nThe Keg A place to work, and a place to connect. We know that there is life outside of work, but we also believe that while at work, it should be fun.  Explore more below. What jobs are currently available? Explore Now Apply Now ROLES + DEPARTMENTS A passion for being the best - that's what being a Kegger means. From creating lasting memories to preparing the perfect steak, we hire great people and invest in them to help bring out their best. Service Team Culinary Team Service Team Genuine, warm, friendly, and professional, that is our promise to each and every guest. Whether setting the stage for the whole evening, greeting guests for what’s to come, or serving them the perfect steak, we welcome you to welcome them to The Keg. Server Host Busser Bartender Culinary Team A commitment to delivering the perfect plate of food to each guest every visit, lead by passionate Keggers on our culinary teams. Whether you're a seasoned top chef, or simply a lover of food, we have the right role for you! Cook Dishwasher Restaurant Management Working for an industry leader in training and development means you’ll have plenty of opportunities for developing skills in a variety of areas, including Human Resources, Marketing, Finance and Operations. Opportunities for growth and career advancement are second to none with a consistently busy and expanding brand. We’ve been successful since the 70s - we’ve seen it all and we know how to continue to be consistent and successful. Manager Head Office Opportunities Do you love The Keg and want to be a part of where we’re heading? If you want to help shape the future of The Keg, join us in our Corporate Offices in Toronto and Vancouver for dynamic and engaging roles across multiple departments. THERE’S LOTS TO LOVE ABOUT THE KEG LIFE Staff Benefits (Service + Culinary) Management Benefits More Than Just A Place To Work Thanks to our staff and managers, The Keg is more than just a place to work. It’s a place where life long connections are made, and a culture like no other. If you want to meet some fantastic people, apply today. See what our Keggers think about working with us by reading our reviews on Glassdoor! What Keggers Are Saying Recognition Behind every great night at The Keg is an even greater Kegger. We're proud to be recognized as a Top Employer in Canada. AON Hewitt's Top 50 Employers since 2003 Forbes list of Top Employers since 2020 Equal Opportunities At The Keg, we have always encouraged our guests to come as they are, and we believe this to be true for our staff. We hire based on drive and passion – we’ll train the rest. It’s part of the reason we’ve been named among the Top Employers in Canada since 2003. The Keg is an equal opportunity employer, and we welcome applications from people of all backgrounds. Subscribe to our newsletter Sign Up Now Our Story Contact Us The Keg Steak Education Franchising Group Dining The Keg Retail Products The Keg Spirit Foundation The Keg Royalties Income Fund Nutrition & Allergen A Respectful Environment for Everyone Privacy Policy Accessibility Policy Terms of Use Privacy Policy Accessibility Policy Terms of Use Subscribe to our newsletter Sign Up Now Back to top Back to top"
    },
    {
      "url": "https://keg.social/bowling",
      "text": "Bowling in Orlando – Modern Lanes & Fun Atmosphere activities private events food drinks more private events contact us careers gallery weekly specials blog activities private events food drinks more Blacklight Bowling in Orlando – An Elevated Entertainment Experience hours + Information Bowling pricing Looking for fun bowling places in Orlando? You found us! Whether you’re here with friends, coworkers, or your weekend crew, we’ve got the lanes, food, and drinks to make it a night. please note that our waterside patio is currently under construction, and therefore our giant Yard pong and cornhole are currently unavailable for purchase. we apologize for the inconvenience and thank you for your understanding! come see us! hours book a party 12850 Waterford Lakes Pkwy Orlando, FL 32828 407-286-3000 party@keg.social Mon - Tue: 4 PM - 1 AM Wed-Fri: 4 PM - 2 AM Sat: 12 PM - 2 AM Sun: 12 PM - 11 PM 21+ After 9 PM Get in touch with our team of event planners and start building your party today! book a party Game night eats, delivered right to your lane. From craft cocktails to loaded apps, we’ll keep you fueled while you bowl, sip, and celebrate. Pay for the time you want—not per player. Whether you’re a duo on date night or joining us as a group, you set the pace and own the lane. 28 blacklight bowling lanes bowling, music, and lane-side vibes. Whether you’re competing or coasting, our blacklight lanes keep the energy high and the experience unforgettable! purchase by time - not per person food + drink service to every lane please note that our waterside patio is currently under construction, and therefore our giant Yard pong and cornhole are currently unavailable for purchase. we apologize for the inconvenience and thank you for your understanding! bowling pricing + information walk-in rate event rate monday-thursday maximum 6 guests per lane $30/ hour $40/ hour friday-sunday maximum 6 guests per lane $40/ hour $80/ hour shoe rental bowling shoes required $4 per person weekly specials Don't miss our weekly specials! 01. choose activities Mix and match bowling, axe throwing, karaoke, ping pong, and more 02. add food & drinks Choose from shareable platters, buffet-style setups, and cocktail service from our full bars. 03. optional private spaces Want your own area? We offer private rooms, reserved lanes, and semi-private sections to make your group feel VIP. 04. inquire and plan Submit an event request to connect with our team! We’ll help you lock in your date, space, activities, and package details. book a private event Looking to plan ahead? Work with our in-house event planners to create a fully customized experience—perfect for birthdays, team outings, and group celebrations. book your event today! industry night $5 Bowling every monday Every Monday | 10PM–1AM | 21+ Only Groups of 4+ with proof of restaurant or retail employment. $10 unlimited bowling every wednesday 10PM-2AM | Exclusively 21+ Unlimited late-night bowling for just $10. Shoes not included. ? What are the requirements for axe throwing? Anyone who wishes to axe throw must be over the age of 14, and any participants under the age of 18 must be accompanied by an adult. All guests must fill out the Axe Throwing Waiver to play. All throwers must be wearing closed-toed shoes. Keg Social Orlando allows guests to use their personal bowling balls, with the understanding that the company is not liable for any damages that may occur as a result. Can we bring in personal bowling balls? We do not take reservations, however, you are welcome to plan an event by getting in touch with our event coordinators, through our 'Book a Party' page. Can I make a reservation? Do you have any specials during the week? Yes! All of our specials can be found here! All of our activities (bowling, arcade cards, ping pong, axe throwing, billiards, karaoke, etc.) can be purchased at the bowling desk. Where can I buy activities? Our waitlist is based on volume and availability. We work on a first-come first-serve basis, and once activities are filled, we begin the waitlist. Guests are welcome to call ahead to get a better idea of the current wait, however, it is subject to change, and guests cannot be added to the waitlist over the phone. Is there a waitlist? Can I make a reservation? We do not take reservations, however, you are welcome to plan an event by getting in touch with our event coordinators, through our 'Book a Party' page. ? Can we bring in personal bowling balls? Keg Social Orlando allows guests to use their personal bowling balls, with the understanding that the company is not liable for any damages that may occur as a result. ? What are the age requirements for axe throwing? Anyone who wishes to axe throw must be over the age of 14, and any participants under the age of 18 must be accompanied by an adult. ? is there a waitlist? Keg social works on a first come first served basis with a waitlist subject to availability. Guests  can call ahead to get a better idea of the current wait. ? Where can I buy activities? All of our activities (bowling, arcade cards, ping pong, axe throwing, billiards, karaoke, etc.) can be purchased at the bowling desk. ? Do you have any specials during the week? keg social offers a variety of weekly promotions and limited time deals! s All of our specials can be found here . ? Private Event Software powered by Tripleseat book your party today! All of our events are contracted and pre-paid, KSO does try to avoid last minute events as there's a lot that goes into the planning process. It's never too early to reach out and start planning, however, please inquire with more than 72 hours notice. We will attempt to make last minute accommodations, but full payment and finalized details are required prior to your event date in order to confirm your event. Yes, we do have a booking minimum of 10 contracted guests. For parties of less than 10 guests, you are welcome to join us as a walk-in party, where all activities and spaces are available on a first-come-first-served basis. Reserving activities through a contracted and prepaid event is the only way we can guarantee availability and that you will not have a wait time for activities, as we adhere to a contracted itinerary. Anything not included on event contracts will all be dependent on demand and available on a first-come-first served basis. How far in advance should I book an event? Is there a guest minimum? Is it better to walk in or do I need to pre-plan my event? Hours of Operation: Mon - Tue:  4PM - 1 AM Wed-Fri: 4PM - 2 AM Sat: 12PM - 2 AM Sun: 12PM - 12 AM 21+ After 9 PM Phone: 407-286-3000 Address: 12850 Waterford Lakes Pkwy Orlando, FL 32828 Email: party@keg.social Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! Stay in the know! Sign up with your email address to join the Keg Social clubs and stay up to date on our weekly deals and events 😎 First name Last name Email address Subscribe Thank you for subscribing! drinks food Book a Party Activities Home contact careers weekly specials blog private events"
    }
  ]
}