{
  "fuentes": [
    {
      "url": "https://www.hole19golf.com/courses/kelly-greens-golf-country-club",
      "email": "mark@kellygreens.com"
    },
    {
      "url": "https://kellygreens.clubhouseonline-e3.com/Contact",
      "email": "info@kellygreens.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/kelly-greens-golf-and-country-club/",
      "email": "matt@naplesgolfguy.com"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/kelly-greens-golf-and-country-club/",
      "email": "info@naplesgolfguy.com"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/8f3b42c0-86ac-11e4-8c28-020000005b00/kelly-greens-golf-country-club",
      "email": "golfshop@kellygreens.com"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520706215580279",
      "email": "info@kellygreens.com"
    },
    {
      "url": "https://www.kellygreens.com/Contact.aspx",
      "email": "info@kellygreens.com"
    },
    {
      "url": "https://www.hornbackus.com/kelly-greens-golf-country-club/",
      "email": "greg@hornbackus.com"
    },
    {
      "url": "https://www.hornbackus.com/kelly-greens-golf-country-club/",
      "email": "steve@hornbackus.com"
    },
    {
      "url": "https://www.royalshell.com/vacation-rentals/florida/fort-myers/kelly-greens-2845/615345/",
      "email": "info@royalshell.com"
    },
    {
      "url": "https://www.royalshell.com/vacation-rentals/florida/fort-myers/kelly-greens-2845/615345/",
      "email": "info@royalshell.com"
    },
    {
      "url": "https://www.royalshell.com/vacation-rentals/florida/fort-myers/kelly-greens-2845/615345/",
      "email": "ken.wilson@bizcor.com"
    }
  ],
  "mails": [
    "golfshop@kellygreens.com",
    "greg@hornbackus.com",
    "info@kellygreens.com",
    "info@naplesgolfguy.com",
    "info@royalshell.com",
    "ken.wilson@bizcor.com",
    "mark@kellygreens.com",
    "matt@naplesgolfguy.com",
    "steve@hornbackus.com"
  ],
  "nombre_sitio": "kellygreens.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hole19golf.com/courses/kelly-greens-golf-country-club",
      "text": "Kelly Greens Golf & Country Club - Golf Course Information | Hole19 Apps Discover Courses The 19th Hole Shop Sign In All courses ... Kelly Greens Golf & Country Club All courses United States Florida Iona Kelly Greens Golf & Country Club Join 4.8M+ golfers worldwide today. Download now! Hole19 is the leading golf app for tracking scores, navigating courses with GPS precision, and unlocking performance insights. 4.8 Kelly Greens Golf & Country Club Fort Myers, FL, United States This course is mapped and available on Hole19 App Enjoy 18 holes of championship golf and premium facilities at Kelly Greens Golf & Country Club in Iona, FL. Perfect for locals & tourists! Description Kelly Greens Golf & Country Club is an exceptional 18-hole championship course located in the scenic community of Iona, Florida. Just minutes from Fort Myers and the Gulf Coast, this beautifully designed course offers a blend of challenging play and stunning natural surroundings. Opened in 1988 with an honorary first round played by the legendary Sam Snead, the course features meticulously maintained fairways, strategic water hazards, and undulating greens that offer excitement for players of all skill levels.\n\nGolfers can warm up or refine their swing at the club's top-tier practice facilities, which include a driving range, chipping areas, and putting greens. The elegant clubhouse provides a welcoming retreat, offering full dining options, a pro shop stocked with the latest gear, and spaces for social gatherings or private events. Whether you're a local golfer or visiting the Iona area, Kelly Greens Golf & Country Club ensures an unforgettable golf experience in a picturesque Florida setting. Know Your Handicap at Kelly Greens Golf & Country Club Calculate My Handicap Select Course Combination 18, 18 Holes Scorecard Tee Distance PAR CR SR combo (3/4) 4951 72 67.1 120 tee five 4386 72 64.1 113 tee one 6426 72 74.9 147 tee two 5929 72 72.2 140 tee three 5491 72 69.9 128 tee four 4789 72 66.4 115 tee six (w) 4073 72 68.5 117 tee five (w) 4386 72 68.4 121 tee four (w) 4789 72 70.7 127 combo (5/6) 4198 72 67.3 118 Leaderboard Loading Phone number +1 (239 *** *** Show more Email mark@kellygreens.com Where is it? KELLY GREENS GOLF AND COUNTRY CLUB 12300 KELLY GREENS BLVD FT. MYERS, FL 33908 Find similar golf courses. Get Hole19 App today. Find and play the best golf courses with ease using the Hole19 app. Hole19 provides a seamless way to access course information and improve your game. Closest courses You might want to consider playing other courses around the same area. Here are some of the closest: 4.5 Shell Point Golf Club Fort Myers, FL, United States 5 Gulf Harbour Yacht & Country Club Fort Myers, FL, United States 4.8 Lexington Country Club Fort Myers, FL, United States 4.9 Crown Colony Golf & Country Club Fort Myers, FL, United States 3.6 Myerlee Country Club Fort Myers, FL, United States 5 Golfview Golf & Racquet Club Fort Myers, FL, United States Discover Top Golf Courses with Hole19 App Find and play the best golf courses with ease using the Hole19 app. Hole19 provides a seamless way to access course information and improve your game. Download Hole19 now and elevate your golfing experience. However you play. Play More. Hole19 Golf App All features Apple Devices Android Devices Premium CORE Golf App All features Apple Devices For Golfers Shop Discover Courses HCP Calculator Glossary The 19th Hole All posts Hole19 News Courses Game improvement Reviews For Partners Advertise with us Press Kit About About Hole19 Careers Contacts Support Help Center Terms & Conditions Privacy Policy © 2025 H19 Ltd"
    },
    {
      "url": "https://kellygreens.clubhouseonline-e3.com/Contact",
      "text": "Kelly Greens Contact | Phone | Fax | Email | Facebook - Kelly Greens Golf & Country Club - Fort Myers, FL Skip to content Member Login Logout Home Golf Hole-By-Hole Tour Location ClubLife Racquet Sports Dining Events Wellness/Fitness Governance Homes Page content CONTACT US Let's connect Play For more information you can connect with us by phone, email, or find us on Facebook! Note: visitors must enter via the main gate on Summerlin Blvd. To check out our banquet and meeting rooms click here . For information contact us: Phone: (239) 466-9570 [email protected] Kelly Greens Facebook Located midway between Sanibel Island and Fort Myers Beach Careers Find Us Kelly Greens Golf & Country Club 12300 Kelly Greens Blvd Fort Myers, FL 33908 Phone: (239)466-9570 Email: [email protected] Kelly Greens Where you want to be © 2025  Kelly Greens Golf & Country Club. All Rights Reserved. Privacy Policy Powered by Jonas Club Software"
    },
    {
      "url": "https://naplesgolfguy.com/golf-communities/kelly-greens-golf-and-country-club/",
      "text": "Kelly Greens Golf and Country Club - Naples Golf Homes | Naples Golf Guy Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog Property Search Golf Communities Naples Bonita Springs / Estero Fort Myers Greater Sarasota Bundled Equity Luxury Buyers Sellers Discover SWFL FAQ’s Dinning & Entertainment Shopping Beaches Calendar of Events Golf Accommodations Healthcare Arts & Attractions About Us Naples Golf Guy Team Downing Frye Realty Contact Us Testimonials Blog 239.370.0892 info@naplesgolfguy.com Back to Fort Myers Golf Communities Kelly Greens Golf and Country Club Kelly Greens Golf and Country Club is a private bundled golf community in Fort Myers, Florida. The 18-hole golf course was designed by Gordon Lewis. Additionally, the course design allows players to choose the tee box that suits their game on any given day. There are eight sets of tees ranging providing options for players at all skill levels. Beyond the course, the club includes a driving range, an extensive short game practice area plus an oversized putting green. Kelly Greens is a gated community with 939 single family homes and condos. Membership is bundled in with the purchase of your property. Over 85 percent of the homes overlook the golf course and numerous lakes. All residents have access to the golf course as well as tournament-level Tennis Courts, Fitness Center, resort-style pool, Snack Bar, and Activities Center. Bottom Line The Naples Golf Guy Team specializes in helping buyers and sellers with their real estate needs in Southwest Florida Golf Communities. Contact us today for more information. Location: Fort Myers, Florida Club Type: Private Membership Type: Bundled Real Estate Home Price Ranges Single Family: $334,000 – $1,138,000 View Homes for Sale Condos: $248,000 – $350,000 View Condos for Sale The Naples Golf Guy Team has 20 years of experience helping Buyers and Sellers with their real estate needs in Kelly Greens. Call, text, or email us today for more information. Stay informed with automatic property alerts… Learn what your home is worth… Sign up for our monthly market report Membership Information Maximum Number of Memberships 939 Golf Memberships Is Membership Required? Yes Non-Resident Memberships Available? No Membership Fees Golf Membership Initiation Fee: Bundled Annual Golf Dues: $6,160 Social Membership Initiation Fee: N/A Annual Social Membership Dues: N/A Please be aware, that other membership options may be available. Additional fees such as capital assessments, transfer fees, a food and beverage or taxes may apply. Please feel free to contact me for additional information. Golf Course Information Number of Courses 1 (18 Holes) Caddies Available No Practice Range Yes Own your own cart No Course Ratings / Scorecards Opened 1988 Original Architect Gordon Lewis Par: 72 Holes: 18 Yards Rating Slope One 7028 74.9 147 Two 6484 72.2 140 Three 6005 69.9 128 Three/Four 5437 67.1 120 Four 5260 66.4 115 Ladies Tees: Four 5260 70.7 127 Five 4797 68.4 121 Five/Six 4591 67.3 118 Six 4455 66.5 117 Amenities Gated Golf Community One Golf Course Driving Range Clubhouse Fitness Center Tennis Courts Community Pool Where is Kelly Greens Golf and Country Club Located Kelly Greens Golf and Country Club 12300 Kelly Greens Blvd. Fort Myers, FL 33908 239.466.9570 Visit Club Website Back to Fort Myers Golf Communities Stay in the know by subscribing to our newsletter Enter your email address 239.370.0892 info@naplesgolfguy.com ©2025 Naples Golf Guy Privacy Policy Accessiblity made by exploritech We serve cookies to analyze traffic and customize content on this site. Privacy & Cookie Policy Got It! Manage consent Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously. Cookie Duration Description cookielawinfo-checkbox-analytics 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\". cookielawinfo-checkbox-functional 11 months The cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\". cookielawinfo-checkbox-necessary 11 months This cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\". cookielawinfo-checkbox-others 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other. cookielawinfo-checkbox-performance 11 months This cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\". viewed_cookie_policy 11 months The cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data. Functional Functional Functional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features. Performance Performance Performance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors. Analytics Analytics Analytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc. Advertisement Advertisement Advertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads. Others Others Other uncategorized cookies are those that are being analyzed and have not been classified into a category as yet. SAVE & ACCEPT"
    },
    {
      "url": "https://18birdies.com/golf-courses/club/8f3b42c0-86ac-11e4-8c28-020000005b00/kelly-greens-golf-country-club",
      "text": "Kelly Greens Golf & Country Club - Scorecards, Reviews | 18Birdies Best Golf App 190k Ratings star star star star star 4.9 Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Try for Free Features School AI Swing Analyzer Premium Handicap Golf Courses Tournaments Blog Help Follow Us Navigations Kelly Greens Golf & Country Club Length 7028 yds Rating 74.9 Slope 147 4.2 star star star star star-o star 32 Reviews 37 Followers Address: 12300 Kelly Greens Blvd Phone: +1 (239) 466-9552 Email: golfshop@kellygreens.com Website: http://www.kellygreens.com/ Available Services Driving Range(Mat) Putting Green Practice Bunker Motor Cart Pull Cart Golf Club Rental Club Fitting Pro Shop Golf Lessons Restaurant Receptions Changing Room Locker Room Lodging Share to: Scorecard Kelly Greens One 7028 yds (147/74.9) for Men One 7028 yds for Women Two 6484 yds (140/72.2) for Men Two 6484 yds for Women Three 6005 yds (128/69.9) for Men Three 6005 yds for Women Three/Four 5474 yds (120/67.1) for Men Three/Four 5474 yds for Women Four 5260 yds (115/66.4) for Men Four 5260 yds (127/70.7) for Women Five 4797 yds (113/64.1) for Men Five 4797 yds (121/68.4) for Women Five/Six 4591 yds for Men Five/Six 4591 yds (118/67.3) for Women Six 4455 yds for Men Six 4455 yds (117/66.5) for Women Dnu1 for Men Dnu1 for Women Dnu2 for Men Dnu2 for Women Dnu3 3320 yds for Men Dnu3 3320 yds for Women Hole Par Handicap One 1 4 13 363 2 5 3 524 3 4 9 436 4 4 7 422 5 3 17 134 6 5 1 609 7 4 11 437 8 3 15 223 9 4 5 448 OUT 36 3596 TOT Hole Par Handicap One 10 4 12 402 11 5 2 528 12 3 18 155 13 4 8 472 14 4 6 317 15 5 4 559 16 4 10 339 17 3 16 239 18 4 14 421 IN 36 3432 TOT 72 7028 View Scorecards for Courses Worldwide Course Reviews 4.2 out of 5 star star star star star-o star 32 Reviews Value 4.4 star Course Condition 4.3 star Course Difficulty Hard Green Speed Fast Pace of Play Fast Graham Malcolm star star star star star Aug 7, 2025 Andrew Crawford star star star star star Mar 19, 2025 Dallas Cornpropst star star star star star-o Jan 12, 2025 David Krueger star star star star star Dec 7, 2024 Andrew Sullenbarger star star star star star Dec 1, 2024 Great course to play, be ready for lots of water! View More Course Reviews Download 18Birdies to View Course Insights Including Hole-by-Hole Stats & More · Golf GPS · Stats · Scorecards · Courses Worldwide google-play Followers(37) Leaderboards Kelly Greens - Best Gross (All times) 1 B. Friend -2 (70) 2 T. Hopson -1 (71) 3 Z. Bilotta +1 (73) 4 P. Perry +4 (76) T5 Z. Hill-Thiry +5 (77) View Complete Leaderboard Company About Us Our Mission Featured In Shop Features Digital Caddy School AI Swing Analyzer Community Tournaments Golf Courses Resources Contact Us Become an Ambassador FAQs Premium Membership Follow Us © 18Birdies, LLC.All Rights Reserved. Legal Information Terms of Service Privacy Policy"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520706215580279",
      "text": "Kelly Greens Golf & Country Club - Kelly Greens | mScorecard Login Sign Up home Home flag Courses contact_support Contact menu Courses Contact Login Sign Up Login Sign Up Home Courses Show Course Kelly Greens Golf & Country Club 12300 Kelly Greens Blvd 33908 Fort Myers, FL USA phone (239)466-9570 email info@kellygreens.com desktop_windows http://www.kellygreens.com/ Course: Kelly Greens course type Golf measurement Yards Please login to view full course information Login Sign Up for Free Men Tees Ladies Hole Par SI #1 #2 #3 #4 #5 #6 Par SI 1 4 -- 363 330 312 283 262 243 -- -- 2 5 -- 524 502 487 426 406 387 -- -- 3 4 -- 436 421 361 316 296 273 -- -- 4 4 -- 422 411 353 333 274 240 -- -- 5 3 -- 134 127 119 97 87 78 -- -- 6 5 -- 609 545 538 455 432 389 -- -- 7 4 -- 437 402 376 356 323 308 -- -- 8 3 -- 223 160 150 128 113 98 -- -- 9 4 -- 448 422 374 358 297 280 -- -- Out 36 3596 3320 3070 2752 2490 2296 36 10 4 -- 402 362 294 283 264 255 -- -- 11 5 -- 528 502 491 472 414 401 -- -- 12 3 -- 155 150 130 113 95 82 -- -- 13 4 -- 472 388 370 284 272 265 -- -- 14 4 -- 317 296 269 225 197 174 -- -- 15 5 -- 559 540 514 435 421 395 -- -- 16 4 -- 339 332 307 270 250 226 -- -- 17 3 -- 239 195 178 147 127 103 -- -- 18 4 -- 421 399 382 279 267 258 -- -- In 36 3432 3164 2935 2508 2307 2159 36 Total 72 7028 6484 6005 5260 4797 4455 72 Men CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- Women CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- --- Coordinates 90 points stored on 18 holes Your Stats Rounds Played: 0 Average Score: - Best Score: - Worst Score: - First Round: - Last Round: - This page shows golf course information for Kelly Greens Golf & Country Club in Fort Myers, USA. The golf course has 18 holes and its total par is 72 If the information is incorrect, please let us know using the contact form . © 2025 Velocor Ltd | Terms & Privacy Policy"
    },
    {
      "url": "https://www.kellygreens.com/Contact.aspx",
      "text": "Kelly Greens Contact | Phone | Fax | Email | Facebook - Kelly Greens Golf & Country Club - Fort Myers, FL Skip to content Member Login Logout Home Golf Hole-By-Hole Tour Location ClubLife Racquet Sports Dining Events Wellness/Fitness Governance Homes Page content CONTACT US Let's connect Play For more information you can connect with us by phone, email, or find us on Facebook! Note: visitors must enter via the main gate on Summerlin Blvd. To check out our banquet and meeting rooms click here . For information contact us: Phone: (239) 466-9570 [email protected] Kelly Greens Facebook Located midway between Sanibel Island and Fort Myers Beach Careers Find Us Kelly Greens Golf & Country Club 12300 Kelly Greens Blvd Fort Myers, FL 33908 Phone: (239)466-9570 Email: [email protected] Kelly Greens Where you want to be © 2025  Kelly Greens Golf & Country Club. All Rights Reserved. Privacy Policy Powered by Jonas Club Software"
    },
    {
      "url": "https://www.hornbackus.com/kelly-greens-golf-country-club/",
      "text": "Kelly Greens Golf & Country Club Home Communities New Construction Advanced Search Market Reports Buy Sell About Reviews Contact Login 239-319-5758 Sign in to your account Email Phone Number Need to reset your phone number? Log In Your browser does not support iframes. Don't have an account with us? Click here to sign up. Kelly Greens Golf & Country Club Kelly Greens is a private-gated community with its main entrance from Summerlin Road. Gates for use by residents are located at Kelly and John Morris roads that connect with McGregor Blvd. KG is a “bundled community”. When you purchase a residence (house or condo) you automatically become a member/owner of KG Country Club that includes golf, tennis, fitness center, restaurant, clubhouse facilities including Wi-Fi, Activities Center and community wide cable T.V. The quarterly assessment that every owner pays includes all of those amenities. The community is financially sound. If needed an appropriate line of credit is available. Numerous capital improvements have been accomplished during the last ten years. The Club has a mid six figure fund earmarked for emergencies and future improvements. KG is a completely developed community. Residences, country club facilities, and common grounds have been updated and professionally maintained reflecting the ambiance of a well - established neighborhood. Housing Total equals 939 residences comprised of single - family homes and various models of condos. Over 85 percent of residences overlook the golf course and KG’s numerous lakes. Major features include an eighteen hole championship golf course, tournament level tennis courts, a recently upgraded 200 seat full service restaurant, a state of the art lounge, recently renovated fitness center, pool, snack bar and Activities Center. KG’s enjoyable lifestyle features numerous activities, clubs and events available to all residents. The KG Golf Course and its lakes present natural beauty for the enjoyment of all. The entire community is attractively landscaped with various species of mature palms, oaks and other trees indigenous to the region. Augmented with perennials, annuals and other plantings, our community is a very attractive place to live and play. KG’s large population of water, wading and other species of birds is an interesting attraction. Osprey and Bald Eagles are regular visitors. Other species that adopt our lakes are Wood Storks, Great Blue Herons, Egrets, White Pelicans, Anhingas, Cormorants, the rare pink spoonbills and many more. And don’t overlook the “friendly” gators that frequently are observed sunning along the shores of our golf course. Available Properties in Kelly Greens Golf & CC 16161 Kelly Cove DR, Fort Myers $938,000 ▼ Discover this exquisite 4-bedroom, 3-bathroom estate home in an exclusive golf course community, privately nestled away from the golf course blending luxury, privacy, and... 4 Beds 2.5 Baths 224078804 MLS 12870 Kelly Bay CT, Fort Myers $555,900 ▼ Welcome home, You're about to step into your dream house - a stunning, 3-bed, 3-bath, golf course home located in the desirable gated neighborhood of Fort Myers. As soon ... 3 Beds 3 Baths 224084310 MLS 12881 Kelly Bay CT, Fort Myers $545,900 ▼ Stunning Golf & Lake Views in Kelly Greens’ Premier Location!\r\nExperience the best view in Kelly Greens from this fully remodeled, move-in-ready gem located in the highly... 3 Beds 2 Baths 225058409 MLS 12518 Kelly Sands WAY, Fort Myers $535,000 Luxurious Living Awaits in Kelly Greens Golf & Country Club. Welcome to your dream oasis nestled in the highly sought-after Kelly Greens Golf and Country Club! This stunn... 2 Beds 2 Baths 225016949 MLS 16380 Kelly Woods DR, Fort Myers $525,000 ▼ Professionally designed remodel to the highest standards.  3/2/2 pool home turn key with high end furnishings and fixtures.  A must see...how the colors are so well coord... 3 Beds 2 Baths 225018395 MLS 12880 Kelly Bay CT, Fort Myers $499,500 Step into luxury and ease with this fully remodeled home located in one of the area’s most desirable bundled golf communities. Every inch of this residence has been thoug... 3 Beds 2.5 Baths 225062276 MLS 16101 Kelly Woods DR, Fort Myers $499,000 ▼ MOTIVATED SELLER!! SPECTACULAR GOLF VIEWS!!!  Discover the luxury of resort style living in this Kelly Greens golf course home! Overlooking the 4th and 5th greens, 4th fa... 2 Beds 2 Baths 225015127 MLS 12370 Kelly Sands WAY, Fort Myers $499,000 COMPLETELY RENOVATED POOL HOME IN A PRIVATE GATED GOLF COMMUNITY JUST MINUTES FROM THE BEACHES. 3bedroom/2bathroom/2car attached garage, furnished, and everything is new.... 3 Beds 2 Baths 225006287 MLS 12580 Kelly Palm DR, Fort Myers $489,900 Modern living and convenience at Kelly Greens in sunny Fort Myers! Gorgeous 2bed/2bath + den! Simply stunning interior with a bright color palette and tile flooring that ... 2 Beds 2 Baths 225049492 MLS 12504 Kelly Pine CT, Fort Myers $476,900 ▼ Welcome to your dream oasis nestled in the highly sought-after Kelly Greens Golf and Country Club! This stunning single-family home, situated on a serene cul-de-sac, offe... 2 Beds 2 Baths 225062784 MLS 12630 Kelly Palm DR, Fort Myers $465,000 ▼ Beautifully remodeled home with stunning lake and golf course views in Kelly Greens, a premier golf bundle community in Fort Myers, FL. This 3-bedroom, 2-bathroom home wi... 3 Beds 2 Baths 223079879 MLS 16314 Kelly Woods DR, Fort Myers $449,900 ▼ Welcome to your dream home in prestigious Kelly Greens Country Club! Seller is offering to closing cost credit for the buyer (call for details) This 3 Bedroom 2-bathroom ... 3 Beds 2 Baths 224016115 MLS 16321 Kelly Woods DR Unit 179, Fort Myers — Verandas $419,900 The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 3 Beds 2 Baths 225034892 MLS Verandas Bldg. 16351 Kelly Woods DR Unit 169, Fort Myers — Verandas $419,900 ▼ The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 3 Beds 2 Baths 223082142 MLS Verandas Bldg. 12681 Kelly Palm DR, Fort Myers $400,000 ▼ Located in the prestigious Kelly Greens gated community, this beautifully updated 2-bedroom plus den, 2-bath home offers a perfect blend of comfort and style. As part of ... 2 Beds 2 Baths 225012544 MLS 16200 Kelly Cove DR Unit 209, Fort Myers — Verandas $399,900 ▼ The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 2 Beds 2 Baths 224015009 MLS Verandas Bldg. 16381 Kelly Woods DR Unit 150, Fort Myers — Verandas $399,900 ▼ The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 2 Beds 2 Baths 224015004 MLS Verandas Bldg. 12090 Kelly Greens BLVD Unit 107, Fort Myers — Verandas $399,900 ▼ The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 3 Beds 2 Baths 223082120 MLS Verandas Bldg. 12730 Kelly Palm DR, Fort Myers $399,000 ▼ Welcome to your dream home in the highly sought-after Kelly Greens Golf and Country Club, just 15 minutes from the white sands of Fort Myers Beach and the charm of Sanibe... 2 Beds 2 Baths 225055114 MLS 12540 Kelly Greens BLVD Unit 337, Fort Myers — Village $399,000 Move-in ready two bedroom and den, two bath furnished condominium in dynamic Kelly Greens location.  New hot water heater (2024) and new roof (2023).  Low maintenance fee... 2 Beds 2 Baths 225011336 MLS Village Bldg. 16320 Kelly Cove DR Unit 267, Fort Myers — Verandas $398,000 The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 3 Beds 2 Baths 225047958 MLS Verandas Bldg. 16351 Kelly Woods DR Unit 170, Fort Myers — Verandas $375,000 ▼ Completely renovated end unit where salt life meets golf life! This 2-bed + huge den/2-bath gem on the 1st floor captures stunning views of Kelly Greens' 3rd fairway. The... 2 Beds 2 Baths 224037401 MLS Verandas Bldg. 16380 Kelly Cove DR Unit 301, Fort Myers — Verandas $369,900 ▼ The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 2 Beds 2 Baths 224040339 MLS Verandas Bldg. 16321 Kelly Woods DR Unit 182, Fort Myers — Verandas $369,900 ▼ The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 2 Beds 2 Baths 224014845 MLS Verandas Bldg. 16190 Kelly Woods DR, Fort Myers $365,000 ▼ INVESTOR SPECIAL. Welcome to this charming home located in the desirable Kelly Greens community in Fort Myers. It's a bundled golf community, it includes restaurants & ba... 3 Beds 2 Baths 225066841 MLS 16321 Kelly Woods DR Unit 190, Fort Myers — Verandas $359,900 Breathtaking lake and golf course views from this completely renovated 2-bed, 2-bath home! Enjoy additional living space with both lanais under air, creating a seamless i... 2 Beds 2 Baths 225030614 MLS Verandas Bldg. 12170 Kelly Greens BLVD Unit 89, Fort Myers — Verandas $359,000 MOTIVATED SELLER!!  SECOND FLOOR VERANDA with fantastic golf and water views of the 9th fairway and pond, as well as first tee and covered bridge! Enjoy the gorgeous scen... 2 Beds 2 Baths 225055225 MLS Verandas Bldg. 16500 Kelly Cove DR Unit 2866, Fort Myers — Kelly Greens $359,000 Gorgeous modern brand new fully remodeled condo, 2 miles from beach, facing west and the most beautiful daily sunsets! Building is 9 ft above sea level. Structural Integr... 2 Beds 2 Baths 224090028 MLS Kelly Greens Bldg. 16326 Kelly Woods DR, Fort Myers — Kelly Greens $349,900 Kelly Greens Golf & Country Club is a picturesque bundled golf community located near the serene Sanibel Island, Bunche Beach, and Fort Myers Beach. This full-service gol... 3 Beds 2 Baths 225051942 MLS Kelly Greens Bldg. 12170 Kelly Greens BLVD Unit 88, Fort Myers — Verandas $345,000 Experience Florida living at its finest in this beautifully remodeled 2 bed, 2 bath condo. Featuring an open floor plan with vaulted ceilings, a light and bright white ki... 2 Beds 2 Baths 225055320 MLS Verandas Bldg. 12210 Kelly Greens BLVD Unit 62, Fort Myers — Verandas $335,000 ▼ Stunning remodeled Veranda II. Some of the upgrades include beautiful LVP throughout, natural stone Quartzite in the kitchen and baths, hardwood cabinetry, awesome custom... 2 Beds 2 Baths 225009126 MLS Verandas Bldg. 12521 Kelly Sands WAY Unit 34, Fort Myers — Kelly Greens $329,900 ▼ The only opportunity to own a beautifully fully renovated first floor Vernadas unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles th... 2 Beds 2 Baths 223078455 MLS Kelly Greens Bldg. 12130 Kelly Greens BLVD Unit 95, Fort Myers — Kelly Greens $329,900 ▼ One of the most beautiful subdivisions in Fort Myers. Close to Sanibel Island and Ft Myers beach, only few minutes from beach which you can access via bike or walking the... 2 Beds 2 Baths 223067549 MLS Kelly Greens Bldg. 12130 Kelly Greens BLVD Unit 94, Fort Myers — Verandas $325,000 Beautifully remodeled and completely updated 2 bedroom 2 bathroom ground level condo with one car garage directly on the golf course.  This condo is a short walk to the c... 2 Beds 2 Baths 225035651 MLS Verandas Bldg. 16351 Kelly Woods DR Unit 163, Fort Myers — Verandas $320,000 Best price on end unit in Kelly Greens! Completely renovated and furnished end unit where salt life meets golf life! This 2-bed + huge den/2-bath with detached garage on ... 2 Beds 2 Baths 225065524 MLS Verandas Bldg. 12130 Kelly Greens BLVD Unit 102, Fort Myers — Verandas $319,000 ▼ Welcome to your slice of Southwest Florida paradise! This 2nd floor, turnkey furnished 2-bedroom, 2-bath condo in the prestigious Kelly Greens Golf & Country Club blends ... 2 Beds 2 Baths 225039870 MLS Verandas Bldg. 16401 Kelly Woods DR Unit 139, Fort Myers — Verandas $299,999 ▼ Amazing Deal in Kelly Greens! This newly renovated 2 bedroom + den, 2 bath condo on the 1st floor with detached garage offers picturesque views of a tranquil pond and the... 2 Beds 2 Baths 223029865 MLS Verandas Bldg. 16404 Kelly Woods DR, Fort Myers $299,900 ▼ This stunning home is located in Kelly Greens Golf & Country Club and features 3 bedrooms and 2 full bathrooms with a 2 car garage. This community is showcased with an 18... 3 Beds 2 Baths 225063004 MLS 16296 Kelly Woods DR, Fort Myers $299,900 ▼ What a great opportunity to own this lovely home in the coveted Kelly Greens and Golf Country Club community. You'll be delighted with how spacious this 3 bedroom, 2 bath... 3 Beds 2 Baths 224090372 MLS 16440 Kelly Cove DR Unit 2806, Fort Myers — Manor $299,900 ▼ The only opportunity to own a beautifully fully renovated first floor Manor unit! Brand new everything!! Top of the line appliances, AC, water heater, ceramic tiles throu... 2 Beds 2 Baths 223063799 MLS Manor Bldg. 12090 Kelly Greens BLVD Unit 112, Fort Myers — Verandas $298,000 Exceptionally Remodeled 2BR + Den Ground-Level, Move-in Ready Condo !\r\nWelcome to Florida living at its finest with this beautifully updated 2-bedroom, 2-bath condo featu... 2 Beds 2 Baths 2025005058 MLS Verandas Bldg. 16230 Kelly Cove DR Unit 226, Fort Myers — Verandas $295,000 UPGRADES, UPGRADES, UPGRADES! Experience the Best of Golf & Gulf Coast Living in Kelly Greens! Welcome to your fully custom remodeled first-floor end unit in the gated, b... 2 Beds 2 Baths 225065255 MLS Verandas Bldg. 16500 Kelly Cove DR Unit 2886, Fort Myers — Manor $289,000 ▼ Kelly Greens Golf & Country Club offers a full range of social and recreational activities, featuring golf, tennis, bocce pickleball, biking, walking and fun galore and s... 2 Beds 2 Baths 225025004 MLS Manor Bldg. 12521 Kelly Sands WAY Unit 29, Fort Myers — Verandas $285,000 ▼ ALWAYS DESIRABLE END UNIT with extra windows and LARGEST VERANDA FLOORPLAN in Kelly Greens!!  This light filled condo offers stunning golf course and lake views from your... 2 Beds 2 Baths 224041034 MLS Verandas Bldg. 12541 Kelly Sands WAY Unit 19, Fort Myers — Verandas $284,900 Location! Price Value! Community! If you have the opportunity to live in Paradise, why not experience comfortable Florida living in this completely remodeled 1st-floor Ve... 2 Beds 2 Baths 225054038 MLS Verandas Bldg. 12621 Kelly Sands WAY Unit 307, Fort Myers — Terrace $279,000 ▼ This stunning condo ground floor condo has recently undergone a complete transformation with a new subzero fridge and a wolf oven. New a/c and water heater. New roof on t... 2 Beds 2 Baths 224073000 MLS Terrace Bldg. 12130 Kelly Greens BLVD Unit 103, Fort Myers — Verandas $272,000 ▼ FURNISHED FLORIDA OASIS 2/2 condo has the ULTIMATE SOUTH FLORIDA VIEW. You will walk up to your second-floor home and enter into a screened in lanai balcony that overlook... 2 Beds 2 Baths 225029681 MLS Verandas Bldg. 16260 Kelly Cove DR Unit 235, Fort Myers — Verandas $269,900 Kelly Greens Golf & Country Club, FIRST FLOOR Western exposure on the 13th fairway. Completely remodeled 2br/2ba and a Den/Office with 1 car detached garage. Screened fro... 2 Beds 2 Baths 225052316 MLS Verandas Bldg. 16290 Kelly Cove DR Unit 253, Fort Myers — Verandas $269,900 Kelly Greens Golf & Country Club, FIRST FLOOR Western exposure on the 13th fairway. Completely remodeled 2br/2ba and a Den/Office with 1 car detached garage. Screened fro... 2 Beds 2 Baths 225052236 MLS Verandas Bldg. 16410 Kelly Cove DR Unit 313, Fort Myers — Verandas $264,900 Kelly Greens Golf & Country Club, FIRST FLOOR on the lake of the 14th fairway. Completely remodeled 2br/2ba with 1 car detached garage. Screened front entrance with morni... 2 Beds 2 Baths 225052275 MLS Verandas Bldg. 16320 Kelly Cove DR Unit 270, Fort Myers — Verandas $264,900 Kelly Greens Golf & Country Club, western exposure on the 13th fairway. Completely remodeled 2br/2ba with 1 car detached garage. Screened front entrance with morning suns... 2 Beds 2 Baths 225052201 MLS Verandas Bldg. 16351 Kelly Woods DR Unit 168, Fort Myers — Verandas $249,000 ▼ Lakefront Luxury with Golf & Resort Amenities – First Floor Condo in Kelly Greens! Welcome to your Florida dream lifestyle in the heart of Kelly Greens Golf & Country Clu... 2 Beds 2 Baths 2025004618 MLS Verandas Bldg. 12601 Kelly Sands WAY Unit 402, Fort Myers — Kelly Greens $244,500 ▼ VERY MOTIVATED SELLER! Step inside this beautifully renovated 1st floor unit in the highly sought after golf community of Kelly Greens! This 2 bed, 2bath condo offers a b... 2 Beds 2 Baths 225060666 MLS Kelly Greens Bldg. 12581 Kelly Sands WAY Unit 525, Fort Myers — Terrace $239,900 ▼ This gated Golf & Tennis community enjoys an excellent location just minutes from the picturesque beaches of Sanibel Island known for it seashell covered shores, Bunche B... 2 Beds 2 Baths 225052303 MLS Terrace Bldg. 12581 Kelly Sands WAY Unit 518, Fort Myers — Terrace $235,000 Presenting a One of a Kind, 2nd Floor, Lakeview, and Turn-Key Condo! NO FLOODING Worries.  This one is UNIQUE, in that it is OVERr-SIZED, has a LARGER LANAI, and an EXTRA... 2 Beds 2 Baths 2025005642 MLS Terrace Bldg. 12181 Kelly Sands WAY Unit 1538, Fort Myers — Manor $229,900 ***Friendly, cooperative listing agent wants to work with you and your buyers. Motivated sellers said “Bring all offers”.*** Perfectly situated near stunning beaches, San... 2 Beds 2 Baths 225040957 MLS Manor Bldg. 12581 Kelly Sands WAY Unit 504, Fort Myers — Terrace $229,000 Kelly Greens Golf & Country Club is in an EXCELLENT location only minutes for walk or bike ride to Bunche Beach a quiet beach with beautiful views, Sanibel Island known  ... 2 Beds 2 Baths 2025002554 MLS Terrace Bldg. 12171 Kelly Sands WAY Unit 1568, Fort Myers — Manor $215,000 ▼ Kelly Greens Golf & Country Club is in an excellent location.  Nearby beaches include Bunche Beach, Fort Myers Beach and Sanibel Island.  Also an excellent location for s... 2 Beds 2 Baths 224086954 MLS Manor Bldg. 16470 Kelly Cove DR Unit 2846, Fort Myers — Manor $209,900 ▼ LOCATION, LOCATION, LOCATION! Take advantage of this awesome opportunity to own a 2nd floor condo overlooking 3-ponds and the prestigious Kelly Greens Golf & Country Club... 2 Beds 2 Baths 224027581 MLS Manor Bldg. 16470 Kelly Cove DR Unit 2856, Fort Myers — Manor $199,900 Within the vibrant Kelly Greens community, residents enjoy an impressive suite of amenities: challenge yourself on the championship golf course or tennis courts, take a d... 2 Beds 2 Baths 2025002880 MLS Manor Bldg. 12191 Kelly Sands WAY Unit 1502, Fort Myers — Manor $199,900 ▼ Welcome to effortless Florida living in this charming first-floor, 2-bedroom, 2-bathroom condo nestled in the highly sought-after Kelly Greens Golf & Country Club. This t... 2 Beds 2 Baths 225045086 MLS Manor Bldg. 12171 Kelly Sands WAY Unit 1575, Fort Myers — Manor $199,500 ▼ Stunning Golf Course & Lake Views!\r\nEnjoy breathtaking views and ultimate comfort in this spacious, beautifully furnished condo in the sought after community of Kelly Gre... 2 Beds 2 Baths 224080368 MLS Manor Bldg. 12581 Kelly Sands WAY Unit 502, Fort Myers — Terrace $199,000 Newly remodeled Kelly Greens Terrace condo with designer finishes. High level luxury vinyl flooring, white raised panel cabinets, quartz counters, stainless steel applian... 2 Beds 2 Baths 225067698 MLS Terrace Bldg. 12621 Kelly Sands WAY Unit 327, Fort Myers — Terrace $195,000 Third floor condo with beautiful golf and water views and larger lanai!! BEST LOCATION IN KELLY GREENS…where luxury and an active lifestyle await! This third-floor condo ... 2 Beds 2 Baths 2025007316 MLS Terrace Bldg. 12581 Kelly Sands WAY Unit 511, Fort Myers — Terrace $186,000 Welcome to Kelly Greens Golf & Country Club. Location, location, location. This unfurnished end unit condo offers 2 bedrooms, 2 bathrooms, screened lanai with beautiful v... 2 Beds 2 Baths 225038660 MLS Terrace Bldg. 12170 Kelly Sands WAY Unit 721, Fort Myers — Terrace $185,000 ▼ Welcome to your slice of paradise in Kelly Greens Golf & CC, a prestigious bundled golf community nestled between the world-renowned beaches of Sanibel & Captiva Islands ... 2 Beds 2 Baths 225054466 MLS Terrace Bldg. The data relating to real estate for sale on this web site comes in part from the Broker Reciprocity Program (BR Program) of M.L.S. of Naples, Inc. Properties listed with brokerage firms other than this company are marked with the BR Program Icon or the BR House Icon and detailed information about them includes the name of the listing brokers. The properties displayed may not be all the properties available through the BR Program. The information provided is for consumers’ personal, non-commercial use and may not be used for any other purpose. Like or Share Loading likes... Share on Facebook Share on X (Twitter) Share on LinkedIn Address Search Search Popular Areas Naples Bonita Springs Estero Fort Myers Buying or Selling Are You Buying a New House? Are You Selling Your House? Mortgage Calculator Amount of Loan Annual Interest Rate % Term of Loan Years Calculate Does not include any taxes or fees. Please consult a financial professional. MARKET REPORTS Stay current on the SWFL Real Estate Market & create a custom report to see what’s active, under contract & sold in your community! Create your Own Market Report Fort Myers Bundled Golf Communities Colonial Country Club Cross Creek CC Crown Colony Heritage Palms Kelly Greens Golf & CC Legends Country Club Lexington Country Club Olde Hickory Pelican Preserve Seven Lakes The Landings Verandah Fort Myers Private Golf Communities Fiddlesticks CC Renaissance Shadow Wood Preserve The Forest The Plantation Additional Navigation Home Communities New Construction Advanced Search Market Reports Buy Sell About Reviews Contact Naples Bonita Springs Estero Fort Myers Miromar Lakes Marco Island IDX Real Estate Websites by • Accessibility • Terms • Privacy"
    },
    {
      "url": "https://www.royalshell.com/vacation-rentals/florida/fort-myers/kelly-greens-2845/615345/",
      "text": "Fabulous Rent-Ready Vacation Homes | Royal Shell REAL ESTATE SALES SIGN IN / SIGN UP SIGN IN/UP OWNER SIGN IN/UP GUEST SIGN IN/UP RENT YOUR PROPERTY 866.341.7799 × Name * First Email * Phone * Message * LinkedIn This field is for validation purposes and should be left unchanged. Vacation Rentals LUXURY COLLECTION ISLAND RENTALS BEACHFRONT BEACH ACCESS DOG FRIENDLY JENSEN’S MARINA & COTTAGES SEASONAL RENTALS SPECIALS BOOK DIRECT FLEXCATION™ OPTIONS Specials Explore BLOG THINGS TO DO RECOMMENDED SERVICES PORT SANIBEL MARINA PORT SANIBEL MARINA – WEBCAM SANIBEL WEBCAM SUNDIAL BEACH RESORT AND SPA JENSEN’S MARINA Long-Term Rentals ANNUAL SEASONAL OFF SEASON About Us ABOUT ROYAL SHELL MEET THE MANAGEMENT TEAM RENT YOUR PROPERTY Contact Us VACATION RENTALS SEARCH ALL RENTALS LUXURY COLLECTION ISLAND RENTALS BEACHFRONT BEACH ACCESS DOG FRIENDLY JENSEN’S MARINA & COTTAGES SEASONAL RENTALS SPECIALS BOOK DIRECT FLEXCATION™ OPTIONS SEARCH BY COMMUNITY SANIBEL ISLAND CAPTIVA ISLAND NAPLES FORT MYERS FORT MYERS BEACH CAPE CORAL BONITA / ESTERO OCALA Fabulous Rent-Ready Vacation Homes Rent a Vacation Home in Paradise Royal Shell has fabulous vacation homes ready to rent in Sanibel Island, Captiva Island, Fort Myers, Cape Coral, Naples, Bonita Springs, and Ocala. Whether you’re looking to spend your vacation on the water, in the pool, or in the verdant hills of Central Florida, Royal Shell has what you want. Please browse our selection of available vacation rentals below. More of our rentals become ready for guests almost daily, so check back regularly. Call our knowledgeable and caring Vacation Planning Advisers for more information. 866.341.7799 Location Alva Bonita Springs Burlingame Cape Coral Captiva Island Cashiers Estero Fort Myers Fort Myers Beach Highlands Lake Glenville Lake Toxaway Lehigh Acres Naples North Fort Myers Ocala Pine Island Punta Gorda Reddick Sanibel Sapphire Valley 362 Guests 1+ 2+ 3+ 4+ 5+ 6+ 7+ 8+ 9+ 10+ 11+ 12+ 13+ 14+ 15+ 16+ 17+ 18+ 19+ 20+ 21+ 22+ 23+ 24+ 25+ 26+ 27+ 28+ 29+ 30+ 31+ 32+ 33+ 34+ 35+ 36+ 37+ 38+ 39+ 40+ 41+ 42+ 43+ 44+ 45+ 46+ 47+ 48+ 49+ 50+ Update Search Room Features TV Couch Administrative Individual Property Coupon/Discount Summer/Fall 2023 Fall Promo 2024 Additional Room Details Bonus Room Cancellation Policy Flexible Cancellation Policy Semi-Flexible Cancellation Policy Standard Cancellation Policy Luxury Collection Luxury Collection Outdoor Boat Dock Available Bikes Available Amenities Gated Community Community - Tennis Courts Community Grilling Area Private Barn Saltwater Pool EV Charger Entertainment Roku TV Apple TV Streaming Only Sports and Adventure Golf Cart Rental Golf Optional Suitability Event Property Dog Friendly Location Types Downtown Village Beach Front Beach View Golf Course Front Advanced Search Filters Loading... Showing of properties Favorites ( ) Unable to find any listings. Select Occupants (high to low) Occupants (low to high) Bedrooms Number (high to low) Bedrooms Number (low to high) Unit Name Price (high to low) Price (low to high) Favorite Properties ( ) Unable to find any listings. Featured Waterfront Hoa Approval Previous Next Previous Next Membership Dog OK Pool Boat Dock {[property.home_type]} {[property.home_type]} Guests Beds Bed Studio / Baths Bath / Baths Enter Dates for Pricing read more + less - VIEW THIS PROPERTY Insurance Included Walk To Slopes Hot Tub (Spa) Lake View Walk to Lake Lakefront Show More × Property Inquiry Adults 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 Children 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 Pets 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71 72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95 96 97 98 99 Close Send Inquiry QUICK LINKS VACATION PROPERTIES SEASONAL RENTALS ANNUAL RENTALS NORTH CAROLINA RENTALS TERMS & CONDITIONS TRAVELER'S INSURANCE PROPERTY MANAGEMENT CAREERS CONTACT US 866.341.7799 INFO@ROYALSHELL.COM Vacation. Rent. Buy. Sell. All Under One Shell. © COPYRIGHT 2025 | ROYAL SHELL ® | ALL RIGHTS RESERVED | SITEMAP | PRIVACY POLICY Find property Find property 2 bedroom, 1 bath condo in Principia of Fort Myers - V PG 6112 1 2 bedroom, 2 bath, Sanibel View Condo 2 bedroom, 2 bath 7th floor Cape Harbour Furnished Condo 2 bedroom, 2 bath Whiskey Creek Condo 2/1 2nd floor Downtown Naples Condo 2/2 furnished Colonial Country Club Coach Home 2nd Floor Condo Intown Club - IC 1275 206 2nd floor condo Reflection Key - RK 14961 424 3 bedroom + loft, 2.5 bath, 2 car garage Bristol Pines Townhome 3 bedroom, 1.5 bath Pet Friendly Cape Coral Duplex 3 bedroom, 2 bath, 15th floor Mastique II High-rise Condo 3 bedroom, 2 bath, single car garage Oak Hammock II Condo 3 bedroom, 2 bath Vanderbuilt Place Townhome 3 bedroom, 2.5 bath, single car garage Marbella on Cypress Townhome 3 bedroom, 2.5 bath Riva Del Lago High-rise Condo 3 bedroom, 3 bath, 2 car garage remodeled pool home in The Forest 4 bedroom + den, 3 bath Sandoval Home in Cape Coral 4 bedroom, 3 bath, 2 car garage Bayview Park Home 4th Floor Condo at Bonita Beach and Tennis - BBT 5500 5408 A Coconut Hideaway A Peaceful Place A Splash of Water Aah!!! Poppys Paradise Absentminded Addy's Dream Aiden's Hideaway Almas Cove Angelfish Angels Crossing Angels Estate Angels On The Gulf Anhinga House At Sea Oats H O 5850 (Annual PS) - 5850 NW 75th Avenue At The Beach Atala Cottage Atrium 103 Augusta A Augusta B Avalon Preserve 503 Avalon Preserve 1902 Aviva Captiva Avoca BB BP A-203 - Bay Pointe at Bonita Bay BB BP H-102 - Bay Pointe in Bonita Bay BB BP P-201 - Bay Pointe in Bonita Bay BB BP T-101 - Bay Pointe at Bonita Bay BB BP X-202 - Bay Pointe at Bonita Bay BBC D-450 - Bonita Beach Club BBC E258 - Bonita Beach Club BBC E556 - Bonita Beach Club BB ESP S1204 - Esperia South at Bonita Bay BB HL 9-201 -Harbor Landings at Bonita Bay BBK CH 13-201 - Cypress Hammock in Shadowood at The Brooks BBK MS 31-101 - Morningside at Shadow Wood at The Brooks BB OW 27038 - Oakwood in Bonita Bay BB SP 223 - Sandpiper in Bonita Bay BB SP 312 - Sandpiper in Bonita Bay BB VIS 404 - Vistas at Bonita Bay BB VIS 1202 - Vistas in Bonita Bay BB W8-102 - Wedgewood in Bonita Bay BB W9-202 Condo in Wedgewood at Bonita Bay BB W 11-201 - Wedgewood at Bonita Bay BB WP 103E - Wild Pines at Bonita Bay BB WP 106B - Wild Pines at Bonita Bay BB WP 206A -Wild Pines at Bonita Bay BB WP 304D - Wild Pines in Bonita Bay BB WSP 1-201 - Whiskey Pointe at Bonita Bay BB WSP 1-210 - Whiskey Pointe in Bonita Bay BC BRI 1604 - Brighton at Bay Colony BC MRQ 301 - Marquesa at Bay Colony BC MRQ 1002 - Marquesa at Bay Colony BC MRQ 1203 - Marquesa at Bay Colony BC TR 305  - Trieste in Pelican Bay at Bay Colony BF 3-402 - Naples Walk BF BOT B-107 - Botanika at Bonita Fairways BR VLA  20121-201 - Villages on Lake Augusta at Breckenridge BS AMB 306 - Ambassador Club BS BF 15-104 - Bonita Fairways BS BF 18-202 - Bermuda Links at Bonita Fairways BS BF 24-303 - Bermuda Links at Bonita Fairways BS BL 1-102 - Bermuda Lago BS BL 3-105 - Bermuda Lago BS CB 1-204 - Casa Bonita One BS CBI-804 - Casa Bonita BS CPII 901 - Cypress Plantation II BS G 12-102 - Gardens at Bonita Springs BS HW 9-208 - St Andrews Verandas III in HW BS HW 16-1602 - St. Andrews Veranda's in Highland Woods BS HW 25-105 - St. Andrews Verandas at Highland Woods BS HW 2110 - Highland Woods BS HW 2205 - Heathermoor Condo BS P23-202 - Paloma Grande in Bonita Springs BS SC 505 - Seascape Bonita Beach BS SW 2-101 - Palmas Grandes BS SW 4-421 - Marbella at Spanish Wells II BS SW 36-3632 - Marbella at Spanish Wells BW 637-104 - Beachwalk BW 661 A-103 - Condo in Beachwalk Baltusrol A Baltusrol B Bandy Beach D201 Barletta at Bella Terra Batiki West 608 Bay Breeze Bay Cedar at Pelican Landing 25201 Beach Breeze Beach Therapy Beachcomber C202 Bella Casa 380 Bella Casa 1105 Bellativa Belle Bellini Bethpage A Birdie Haven Blind Pass B205 Blind Pass G101 Blue Gulf 101 Blue Heaven Blue Heron At Eagles Landing Blue Heron at the Dunes Bokeelia Breeze Breathing Space Brittany Estates 7554 By The Sea CBI 701 - Condo in Casa Bonita CG 403  - Cypress Glen CL OI U6-202  - Osprey Isle in Carlton Lakes COR 10835 - Townhome in Cordera CS DM 205 - Coquina Sands/ Del Mar Cape Harbour 509 Captains Walk A7 Captiva Escapade Captiva Hampton Captiva Memories Captiva Paradise Captiva Shores 5D Carpe Diem Casa Marina 124 Casa Salty Casa Tranquila Caspian Clubside 12 Clubside 14 Clubside 8051 Clubside 8095 Clubside 8109 Coastal Breeze Coastal Calm Compass Point 121 Compass Point 122 Compass Point 141 Compass Point 152 Compass Point 171 Compass Point 191 Compass Point 231 Conch Cottage Copa Captiva Coquina Beach 2E Coquina Beach 2G Coquina Beach 3B Coquina Beach 3F Coquina Beach 4E Coquina Beach 4G Coquina Beach 5B Coquina Beach 5D Coquina Beach 5F Coquina Beach 5G Coral Way Escape Cupcake Cypress Hall 8025 Cyprina Beach 9 DUN GP6-403  - Grande Phoenician in The Dunes Dolphin Cove Guest Houses Dolphin Cove Main House Dolphin House Dolphin View Donax Village 04 Double Clear 3165 EL D-201  - Villages of Emerald Lakes ES BT 8-821 - Barletta at Bella Terra ES BT 23-2313  - Barletta at Bella Terra Eagles Landing A-1 Eagles Landing A-2 Eagles Landing A-3 Eagles Landing A-4 Eagles Landing A-5 Eagles Landing A-6 Eagles Landing B-2 Eagles Landing B-3 Eagles Landing B-5 Eagles Landing B-6 Eagles Landing C-1 Eagles Landing C-2 Eagles Landing C-4 Eagles Landing C-5 Eagles Landing C-6 Eagles Landing D-2 Eagles Landing D-3 Eagles Landing D-4 Eagles Landing D-5 Eagles Landing D-6 Eagles Landing E-1 Eagles Landing E-2 Eagles Landing E-3 Eagles Landing E-4 Eagles Landing E-5 Eagles Landing F-2 Eagles Landing F-3 Eagles Landing F-5 Eagles Landing Lakeside #1 Eagles Landing Lakeside #8 Eagles Landing Lakeside #13 Eagles Landing Villa #2 Eagles Landing Villa #3 Eagles Landing Villa #4 Eagles Landing Villa #6 Eagles Landing Villa #7 Eagles Landing Villa #10 Eagles Landing Villa #11 Eagles Landing Villa #14 Eagles Landing Villa #15 Egrets Walk  204 Endless Summer Escape To The Cape Esperia South at Bonita Bay 504 FF BC REM 901  - Remington at Bay Colony FF H AW 6481 - House in Autumn Woods FF HC GW 12500 - House in Hammock Cove at Gateway FF H ES CS 23234 - Villa in Coconut Shores FF H FMB 135A - 135A Gulfview Avenue FF VER 16251 - Verona Pointe FF VWBS 28234 - House in Villagewalk FG 104  -  Forest Glen FM CC 2-209 - Annual Rental in Cross Creek FM CC 2-209  - Cross Creek FW RW 1695-8 - Rosewood at Falling Waters Ferry Landing Fishermans Cove 80-101 Forest Lakes 1085 Fun Casa Funbar Hall Furnished 2 bedroom, 2 bath Sanibel View Condo GCC 541-1 - Glades Country Club Gardens At Beachwalk 314 Ghantous Home Golfview Home Good Times & Tan Lines Grotto Park 2 Gulfside Place 101 Gulfside Place 122 H BB 3310  -  House in Bonita Bay H BB 3936  -  House in Bonita Bay H BBK OS 9407 - Oak Strand at Shadow wood H BBK SB 9799 - Sweet Bay at Shadow Wood at the Brooks H BBKTT23243  -  Tamarind Trace in the Brooks H BL 11293  -  Botanica Lakes H BN 17151 - House in Bonita National H BP 12914  -  House in Brynwood Preserve H BS 27091 - House in Bonita Springs H BS 27153 - House in Bonita Springs H BS 27165  - House with Pool Bonita Springs H BS CC 9590 - House in Cedar Creek H BSL 242  - House in Berkshire Lakes H BT 21008 - House in Bella Terra H BT 21267 - House in Bella Terra H BW 724 - Beach Walk House H ES 20591 - House on Estero River H ES BT 20528  -  House in Bella Terra H ES BT 21203 - House in Bella Terra H ES BT 21203a - House in Bella Terra H ES RP 20350 - Rookery Pointe H ES RP 20421 - Rookery Pointe H FC OH 3318 - Oyster Harbor at Fiddler's Creek H GH 9842 - House in Greyhawk at Golf Club of The Everglades H IGC 1961 - Schnepf Home HL 9-204 - Huntington Lakes H LP 714 - House in Lake Park H MO 1824 - House in The Moorings H MO 2201 - House in the Moorings 2201 (Seasonal Rental) H MP 7932 - House in Madison Park H MR 6653 - House in Mill Run H NAP 1521 - House in Nature Pointe H NP 793 - House in Naples Park H ON 44 - House in Olde Naples H ON 56 - Beachfront Pool Home in Olde Naples H ON 300 - Resort Style Olde Naples Pool Home H ON 359 - House in Olde Naples H ON 361 - House in Olde Naples H ON 476 - House in Olde Naples H ON 590 - Lakefront Pool Home in Olde Naples H ON 675 - House in Olde Naples H PAL 26120 - House in Paloma H PB 714 - House in Oakmont in Pelican Bay H PB 836 House in Pelican Bay H PB 6605 - Village at Pelican Bay H PB 6967 - House in Pelican Bay H PB CH 5916 - House in Chanteclair in Pelican Bay H PC 20385 - House in Preserve of Corkscrew H PL 3500 - House in Pelican Landing H PL 25221 - House in Pelican Landing H PL COT3628 - House in Pelican Landing H PL L 3510 - House in Lakemont at Pelican Landing H PL PP25094 - Pinewater Place at Pelican Landing H PM TI 1920 - Timarron at Pelican Marsh H PM TI 1959 - House in Timarron at Pelican Marsh H PM V 8780 - House in Ventura at Pelican Marsh H SAP 5901 - Ana's Place in The Strand H SOK 1511 - House in The Preserve at Sterling Oaks H SSG 5815 - Sawgrass in The Strand H STC 4126 - House in Stonecreek H STG 6702 - House in Stonegate 6702 H SW 28387 - House in Spanish Wells H SW 28417 - Home in Spanish Wells H SW 28440 - House in Spanish Wells H VAS 28243 - House in Bellino at Vasari H VB 15122 - Home in Vista Blue H VR 8484 - House in Verona Walk H VV 20213 - Home in Verdana Village H VW 28983 - House in Villagewalk H VWBS 28100 - House in Village Walk Halcyon Days Haven House Heritage Bay A Golfer's Dream Hibiscus Hideaway Homebase 2 Home in Bonita Springs 9755 House in Big Cypress Golf Club House in Golden Hills House in Olde Naples 678 IGE BG F-4 - Bermuda Greens at Imperial Golf Estates IMP BG-R8 - Bermuda Greens at Imperial Golf Estates IMP CS 1-201 - Charleston Square at Imperial Golf Estates Ibis Cottage Into the Mystic Island Beach Club 2PC Island Beach Club 210F Island Beach Club 230F Island Beach Club 310C Island Beach Club 310D Island Beach Club 320D Island Beach Club 330C Island Beach Club P2F Island Palm Island Times Isle-B-Back Jensen's Cottage #01 Jensen's Cottage #02 Jensen's Cottage #03 Jensen's Cottage #04 Jensen's Cottage #05 Jensen's Cottage #06 Jensen's Cottage #07 Jensen's Cottage #08 Jensen's Cottage #09 Jensen's Cottage #10 Jensen's Cottage #11 Jensen's Cottage #12 Jensen's Cottage #14 Jensen's Cottage #15 Jonathan's Bay 202 Just By Chance Kaspar Home Keepin' It Reel Kelly Greens Furnished Condo - C KG 12191 1523 Kings Crown 108 Kings Crown 218 Kings Crown 311 Kings Crown 314 Kings crown 213 LEM 1303 - Lemuria LR O 4903 - Ole at Lely Resort La Dolce Vita Lake View Condo at Pipers Pointe - C PP 109 205 Lazy Palm Lemon Drop Home Lighthouse Point 115 Lighthouse Point 214 Lighthouse Point 219 Lighthouse Point 220 Lighthouse Point 226 Loggerhead Cay 102 Loggerhead Cay 103 Loggerhead Cay 104 Loggerhead Cay 111 Loggerhead Cay 113 Loggerhead Cay 133 Loggerhead Cay 144 Loggerhead Cay 152 Loggerhead Cay 172 Loggerhead Cay 191 Loggerhead Cay 201 Loggerhead Cay 211 Loggerhead Cay 241 Loggerhead Cay 272 Loggerhead Cay 283 Loggerhead Cay 301 Loggerhead Cay 312 Loggerhead Cay 333 Loggerhead Cay 363 Loggerhead Cay 371 Loggerhead Cay 413 Loggerhead Cay 414 Loggerhead Cay 423 Loggerhead Cay 431 Loggerhead Cay 432 Loggerhead Cay 452 Loggerhead Cay 453 Loggerhead Cay 512 Loggerhead Cay 521 Loggerhead Cay 522 Loggerhead Cay 531 Loggerhead Cay 551 Loggerhead Cay 561 Loggerhead Cay 571 Lovin' Spoonbill Lux Captiva House ML 6525-203 - Marbella Lakes MO AP1-510 - Admiralty Point I MO BC 303 - Condo in Bordeaux Club MO CC 318 - Coquina Club Condo MO COM 103 - Commodore Club at the Moorings MO COM 105 - Commodore Club II MO GP 2 - Grand Prix Apartments MO GP 3 - Grand Prix Apartments MO GP 8 - Grand Prix at Moorings MO GT 306 - Gulf Towers on the Beach MO GT 504 - Gulf Towers Beach Condo MO HC 207 - Harbour Cove MO JS 102 - Jennifer Shores MO NC 314 - Naples Continental Club MO STC 105 - St. Croix Club MO YHM S6 - Yacht Harbor Manor Maison de la Mer Manatees & Memories Mariner Pointe 121 Mariner Pointe 142 Mariner Pointe 223 Mariner Pointe 532 Mariner Pointe 612 Mariner Pointe 713 Mariner Pointe 1052 Mermaid Cottage Midnight Star Muirfield A NAP 3102 - Napoli NS 118-8 - Naples Sunrise OA 2626 - Oasis at Naples ON 780-306 - 780 Building at Olde Naples ON BC VG B11 - Bonaire Club at Village Green ON CG 112 - Central Garden at Olde Naples ON CG 119 - Condo in Central Gardens ON GE 514 - Gulf East ON IC 578 - Old Naples ON KG 202 S - Kensington Gardens at Olde Naples ON MC 1295 - Mariner at Olde Naples ON NF 365-307 -  Naples 5th Avenue 365 ON NS 2-303 - Naples Square II at Olde Naples ON NS 2-318 - Naples Square ON NS 2-411a - Naples Square ON NS 3-517 - Naples Square ON SW 341 - Sea Walk in Olde Naples ON WC 640-2 - Windward Cay in Olde Naples Oakmont A Oasis Inn the Dunes Oliva Cottage On The Rocks Osprey's View Otter Banks Main and Guest Our Happy Place PB BAR 8-202 - Barrington Club at Pelican Bay PB BAR 10-102 - Barrington Club at Pelican Bay PB CAL 401D - Calais at Pelican Bay PB CAL E-201 - Calais at Pelican Bay 201 PB CH 114 - Chanteclair of Pelican Bay PB CLA PHD - Claridge at Pelican Bay - PHD PB CRES 612 - The Crescent in Pelican Bay - 612 PB GC 102 - Glencove at Pelican Bay #102 PB LAM 4-206 - Condominium at L'Ambiance in Pelican Bay 206 PB LO 823-101 - Laurel Oaks at Pelican Bay PB LO 847-101 - Laurel Oaks at Pelican Bay PB MON 1008 - Montenero at Pelican Bay PB PC 15-201 - Pebble Creek at Pelican Bay PB PC 15-302 - Pebble Creek at Pelican Bay PB PC 16-203 - Pebble Creek at Pelican Bay PB SANC 225 - Sanctuary at Pelican Bay PB SER 563 - Serendipity in Pelican Bay PB SN 504 - St. Nicole at Pelican Bay PB SN 902 - St. Nicole at Pelican Bay PB SN 2004 - St. Nicole at Pelican Bay PB ST 4 - St. Thomas at Pelican Bay PB STL 1905 - St. Laurent at Pelican Bay PB STR 403 - St Tropez at Pelican Bay PB STR 1204 - St. Tropez at Pelican Bay PB STS 22 - St. Simone in Pelican Bay PB STV 7 - St. Vincents at Pelican Bay PB VAL F202 - Valencia at Pelican Bay PB WB 107 - Willowbrook at Pelican Bay PB WB 608 - Willowbrook at Pelican Bay 608 PB WB 1503 - Willowbrook at Pelican Bay PB WB A-1406 -  Willowbrook at Pelican Bay PG NG 2585-203 - Pipers Grove PL LC X-101 24821 Lakemont Cove at Pelican Landing PL MER 25-102 - Merano at The Colony at Pelican Landing PL MR-122 - Mystic Ridge at Pelican Landing PL N 503 - Navona at The Colony PL N 804 - Navona at The Colony at Pelican Landing PL N 904 - Navona at the Colony PL N 1602 - Navona at The Colony at Pelican Landing PL PC 24615-101 - Palm Colony at Pelican Landing PL P H-202 - The Pointe at Pelican Landing PL P N-102 - The Pointe at Pelican Landing PL SB 26-101 - Southbridge at Pelican Landing PL SB 29-102 Southbridge at Pelican Landing PL SI C-101 - Sandpiper Isle at Pelican Landing PL SP J-201 - Sawgrass Point PL T 504 - Condo in Treviso at the Colony PL T 1503 - Treviso at The Colony at Pelican Landing PM A 103 - Arielle at Pelican Marsh PM A 104 - Arielle at Pelican Marsh PM A 2103 - Arielle at Pelican Marsh PM A 2110 - Arielle at Pelican Marsh PM A 2306 - Arielle at Pelican Marsh PM CL M-202 - Clermont at Pelican Marsh PM EW 23-202 - Egret's Walk at Pelican Marsh PM EW 31-201 - Egrets Walk at Pelican Marsh PM SEV 2122 - Seville at Pelican Marsh PS BPNC 402 - Baypointe at Naples Cay PS BPNC 604 - Baypointe at Naples Cay PS BPNC 704 - Baypointe at Naples Cay PS BPNC 805 - Baypointe at Naples Cay PS BRIT 1804 - The Brittany at Park Shore PS BSP 1505 - Bayshore Place at Park Shore PSD SH 6-101 - Southern Hills at Pelican Sound PS HLV E-14 - Hidden Lake Villas PS HT 113 - Harborside Terrace at Park Shore PS HT 114 - Harborside Terrace at Park Shore PS MER 204 - Merdian Club at Park Shore PS PST 16D - Park Shore Tower PS PST 17A - Park Shore Tower PS SAV 301 - Savoy at Park Shore Beach PS SAV 606 - Savoy at Park Shore Beach PS SAV 1204 - Savoy at Park Shore Beach PS SAV 1601 - The Savoy at Park Shore Beach PS SE 607 - Park Shore Surfsedge PS SL 8A - Swan Lake in Park Shore PS VIS 504 - Vistas in Park Shore PS VIS 1805 - Vistas at Park Shore Beach Palm Breeze Park at Lakewoods II-107 Paseo - Rustic Palms Paseo - Villa Tortuga Pine Cove 302 Pine Cove 404D Pineland Park in Park Shore 109 Pipers Pointe 104 Plantation Village 221 Pointe Santo A 7 Pointe Santo A22 Pointe Santo A23 Pointe Santo A35 Pointe Santo A36 Pointe Santo B6 Pointe Santo B41 Pointe Santo C23 Pointe Santo D 2 Pointe Santo D24 Pointe Santo D32 Pointe Santo D34 Pointe Santo E1 Pointe Santo E33 Poolside Paradise Ports of Iona 302B Province Park 103 QUAR 6-201 - Ironstone at the Quarry RAP EN 66-101 - The Enclave at Rapallo RET 18-101 - The Retreat RL Sherman Oaks 8389 RP 10805 - Regent Park Rainbow's End Reel 'Em Inn Rendezvous By The Sea Riverside Retreat Riverwalk 325 Rosie's Place Royal Troon A Royal Troon B Rum N Reel SBC 14-102 - Carrington at Stonebridge S FS 502 - Feather Sound at The Strand S FS 806 - Feather Sound at The Strand S TC 2002 - Trophy Club at The Strand SW 41-101 - Sherwood S WW 1507 - Wedge Wood in the Strand Sabal Pointe 1605 Sail Harbour 101 Saltwind II Salty Sister San Mirage of Bonita Springs Sand Pointe 121 Sand Pointe 124 Sand Pointe 125 Sand Pointe 127 Sand Pointe 133 Sand Pointe 211 Sand Pointe 215 Sand Pointe 216 Sand Pointe 222 Sand Pointe 223 Sand Pointe 227 Sand Pointe 234 Sand Pointe 235 Sand Pointe 236 Sand Pointe 237 Sanddollar A102 Sanddollar A104 Sanddollar B101 Sanddollar C203 Sanddollar C301 Sanddollar C303 Sanddollar C304 Sandpiper Beach 106 Sandpiper Beach 201 Sandpiper Beach 204 Sandpiper Beach 206 Sandpiper Beach 301 Sandpiper Beach 302 Sandpiper Beach 303 Sandpiper Beach 402 Sandpiper Beach 406 SaniBelle Sanibay Sanibel Fitz You Sanibel Harbour Resort 214 - H Sanibel Harbour Resort 431-B Sanibel Harbour Resort 437 - B Sanibel Harbour Resort 514- H Sanibel Harbour Resort 517 - H Sanibel Harbour Resort 537 - B Sanibel Harbour Resort 1012 - H Sanibel Harbour Resort 1136 - B Sanibel Surfside 112 Sanibel Surfside 113 Sanibel Surfside 117 Sanibel Surfside 127 Sanibel Surfside 134 Sanibel Surfside 136 Sanibel Surfside 214 Sanibel Surfside 233 Sanibel View 107 Santa Fe Santa Maria Resort 3205 Sayana Of Sanibel 301 Sayana Of Sanibel 303 Seagrape Village 3 Second Floor End unit with pool views - C TP 328 328 Shell Basket 1 Shell Basket 2 Shell Island Beach Club 5A Shell Sanctuary Shell Seekers Sherman Oaks 525 Sherman Oaks 624 Sherman Oaks 625 Sherman Oaks 8105 Shore Beats Work Snook Villa at South Seas 3118 Somerset at the Reef B101 Sorrento Soulshine South Seas Bayside Villa 4124 South Seas Bayside Villa 4212 South Seas Bayside Villa 5220 South Seas Bayside Villa 5320 South Seas Bayside Villa 5326 South Seas Beach Cottage 1402 South Seas Beach Cottage 1407 South Seas Beach Cottage 1413 South Seas Beach Cottage 1416 South Seas Beach House 04 South Seas Beach House 09 South Seas Beach House 10 South Seas Beach House 16 South Seas Beach House 30 South Seas Beach Villa 2010 South Seas Beach Villa 2023 South Seas Beach Villa 2237 South Seas Beach Villa 2332 South Seas Beach Villa 2511 South Seas Beach Villa 2528 South Seas Beach Villa 2537 South Seas Blue Bayou South Seas Lands End 1602 South Seas Lands End 1625 South Seas Lands End 1634 South Seas Lands End 1638 South Seas Villas 3130 South Seas Villas 3216 Spanish Cay A7 Spanish Cay E1 Spanish Cay F4 St Andrews A St Andrews B Stunning Spanish-style 3/2/1 pool home in Historic Edison Park Sun & Fun Sun Daze SunSplashed Villa Sundial A405 Sundial B207 Sundial B208 Sundial D303 Sundial D401 Sundial E204 Sundial E301 Sundial E304 Sundial E308 Sundial F205 Sundial F301 Sundial G207 Sundial G405 Sundial G406 Sundial H306 Sundial H406 Sundial H407 Sundial I406 Sundial J204 Sundial K202 Sundial K308 Sundial L203 Sundial L304 Sundial L405 Sundial N301 Sundial N302 Sundial O204 Sundial P203 Sundial P304 Sundial P305 Sundial Q205 Sundial R201 Sundial R203 Sundial R305 Sundial R401 Sundial R402 Sundial R403 Sundial R406 Sundial S302 Sundial S403 Sundial T204 Sundial T305 Sundial T306 Sunflower Cottage Sunset Captiva 04 Sunset Captiva 07 Sunset Captiva 08 Sunset Captiva 12 Sunset Captiva 15 Sunset Captiva 20 Sunset Captiva 21 Sunset Captiva 27 Sunset Captiva 28 Sunset Captiva 29 Sunset Captiva 30 Sunset Captiva 31 Sunset Captiva 36 Sunset Captiva 39 Sunset Captiva 41 Sunset Captiva 44 Sunset Captiva 47 Sunset Captiva 53 Sunset Oasis Sunset South 9B TC BIM 11-202 - Bimini IV at Tarpon Cove TIB C 19-102 - Castillo at Tiburon Tarpon Beach 204 Tarpon Beach 205 Tarpon Beach 209 Tennisplace B31 The 1912 House The Ascot The Banyan House The Baymeadow The Blue Palm The Cape Escape The Green House The Hawthorne The Magic Blue House Tiki Time Retreat Tiki Too Turtlehouse Tuscan Estate V ARB 4665-104 - Villla in Arboretum VAS T4-101 - Trieste in Vasari VAS TO7-201 - Toscana in Vasari VB BFP 123 - Barefoot Pelican at Vanderbilt Beach VB BFP 155 - Barefoot Pelican at Vanderbilt Beach V BBKLB23821 - Lighthouse Bay at the Brooks V BL 174 - Villa in Berkshire Lakes VB SCI 103 - Vanderbilt Surf Colony V BSHV-320B - Hacienda Village V BSHW 26407 - Villa in Highland Woods VB VL 502 - Vanderbilt Landings II VB VL 601 - Vanderbilt Landings II V BW 549 - Villa in Beachwalk V BW 555 - Villa in Beachwalk V BW 736-30 - Villa in Beachwalk VEB D6-410 - Villages of Emerald Bay V EOB 400 - Villa in Eden on the Bay VIN SO 11201 - Silver Oaks at The Vineyards VL BI 4-104 - Bermuda Isles at Vanderbilt Lakes V ON SB 1080 - Spellbinder Villas V ON SB 1165 - Spellbinder Villas V PB BV667 - Bridgeway Villas at Pelican Bay V PB SP 6810 - Sand Pointe Villas in Pelican Bay V PL 25400 - Costa Del Sol at Pelican Landing V PL 25410 - Villa in Costa Del Sol at Pelican Landing Ventura Captiva 3A Ventura Captiva 3B Villa Cuquita Villa Jade Villa Sanibel 2C Villa Vinsetta WGLK 757-106 - Wiggins Lake Condo WL FS 3775-1402 - Condo in Wilshire Lakes WTC 3605 - Villa at World Tennis Center Waterfront Serenity Waterside 2-233 West Indies Home West Shore #1 West Shore 102 at Naples Cay Whaleview Whispering Palms in Cinnamon Cove Wine Down Zen Villa Florida Locations: Bonita Springs | Estero | Cape Coral | Captiva Island Fort Myers | Naples | Marco Island | Ocala | Sanibel Island North Carolina Locations: Cashiers/Lake Glenville | Highlands | Sapphire Valley/Lake Toxaway contact us find your rental Bonita Springs/Estero Office Location x Phone: 239.992.9100 Location: 26811 South Tamiami Trail | Bonita Springs, FL 34134 Captiva Island Office Location x Phone: 239.472.0078 Location: 15050 Captiva Drive | Captiva Island, FL 33924 Cape Coral Office Location x Phone: 239.322.5680 Location: 1105 Cape Coral Pkwy. East | Cape Coral, FL 33904 Fort Myers Office Location x Phone: 239.689.7653 Location: 1870 Clayton Ct. | Fort Myers, FL 33907 Naples / Marco Island Office Location x Phone: 239.261.9101 Location: 3000 Tamiami Trail North | Naples, FL 34103 Ocala Office Location x Phone: 352.369.6969 Location: 4090 NW 84th Ct. | Ocala, FL 34482 Sanibel Island Office Location x Phone: 239.472.9111 Location: 1547 Periwinkle Way | Sanibel Island, FL 33957 Cashiers Office Location x Phone: 828.743.9234 Location: Crossroads 17 Highway 64 E. | Cashiers, NC 28717 Highlands Office Location x Phone: 828.526.4663 Location: 225 Main St. | Highlands, NC 28741 Sapphire Valley/Lake Toxaway Office Location x Phone: 828.482.0986 Location: 19387 Rosman Highway | Sapphire, NC 28774 Type Property Name... 2 bedroom, 1 bath condo in Principia of Fort Myers - V PG 6112 1 2 bedroom, 2 bath, Sanibel View Condo 2 bedroom, 2 bath 7th floor Cape Harbour Furnished Condo 2 bedroom, 2 bath Whiskey Creek Condo 2/1 2nd floor Downtown Naples Condo 2/2 furnished Colonial Country Club Coach Home 2nd Floor Condo Intown Club - IC 1275 206 2nd floor condo Reflection Key - RK 14961 424 3 bedroom + loft, 2.5 bath, 2 car garage Bristol Pines Townhome 3 bedroom, 1.5 bath Pet Friendly Cape Coral Duplex 3 bedroom, 2 bath, 15th floor Mastique II High-rise Condo 3 bedroom, 2 bath, single car garage Oak Hammock II Condo 3 bedroom, 2 bath Vanderbuilt Place Townhome 3 bedroom, 2.5 bath, single car garage Marbella on Cypress Townhome 3 bedroom, 2.5 bath Riva Del Lago High-rise Condo 3 bedroom, 3 bath, 2 car garage remodeled pool home in The Forest 4 bedroom + den, 3 bath Sandoval Home in Cape Coral 4 bedroom, 3 bath, 2 car garage Bayview Park Home 4th Floor Condo at Bonita Beach and Tennis - BBT 5500 5408 A Coconut Hideaway A Peaceful Place A Splash of Water Aah!!! Poppys Paradise Absentminded Addy's Dream Aiden's Hideaway Almas Cove Angelfish Angels Crossing Angels Estate Angels On The Gulf Anhinga House At Sea Oats H O 5850 (Annual PS) - 5850 NW 75th Avenue At The Beach Atala Cottage Atrium 103 Augusta A Augusta B Avalon Preserve 503 Avalon Preserve 1902 Aviva Captiva Avoca BB BP A-203 - Bay Pointe at Bonita Bay BB BP H-102 - Bay Pointe in Bonita Bay BB BP P-201 - Bay Pointe in Bonita Bay BB BP T-101 - Bay Pointe at Bonita Bay BB BP X-202 - Bay Pointe at Bonita Bay BBC D-450 - Bonita Beach Club BBC E258 - Bonita Beach Club BBC E556 - Bonita Beach Club BB ESP S1204 - Esperia South at Bonita Bay BB HL 9-201 -Harbor Landings at Bonita Bay BBK CH 13-201 - Cypress Hammock in Shadowood at The Brooks BBK MS 31-101 - Morningside at Shadow Wood at The Brooks BB OW 27038 - Oakwood in Bonita Bay BB SP 223 - Sandpiper in Bonita Bay BB SP 312 - Sandpiper in Bonita Bay BB VIS 404 - Vistas at Bonita Bay BB VIS 1202 - Vistas in Bonita Bay BB W8-102 - Wedgewood in Bonita Bay BB W9-202 Condo in Wedgewood at Bonita Bay BB W 11-201 - Wedgewood at Bonita Bay BB WP 103E - Wild Pines at Bonita Bay BB WP 106B - Wild Pines at Bonita Bay BB WP 206A -Wild Pines at Bonita Bay BB WP 304D - Wild Pines in Bonita Bay BB WSP 1-201 - Whiskey Pointe at Bonita Bay BB WSP 1-210 - Whiskey Pointe in Bonita Bay BC BRI 1604 - Brighton at Bay Colony BC MRQ 301 - Marquesa at Bay Colony BC MRQ 1002 - Marquesa at Bay Colony BC MRQ 1203 - Marquesa at Bay Colony BC TR 305  - Trieste in Pelican Bay at Bay Colony BF 3-402 - Naples Walk BF BOT B-107 - Botanika at Bonita Fairways BR VLA  20121-201 - Villages on Lake Augusta at Breckenridge BS AMB 306 - Ambassador Club BS BF 15-104 - Bonita Fairways BS BF 18-202 - Bermuda Links at Bonita Fairways BS BF 24-303 - Bermuda Links at Bonita Fairways BS BL 1-102 - Bermuda Lago BS BL 3-105 - Bermuda Lago BS CB 1-204 - Casa Bonita One BS CBI-804 - Casa Bonita BS CPII 901 - Cypress Plantation II BS G 12-102 - Gardens at Bonita Springs BS HW 9-208 - St Andrews Verandas III in HW BS HW 16-1602 - St. Andrews Veranda's in Highland Woods BS HW 25-105 - St. Andrews Verandas at Highland Woods BS HW 2110 - Highland Woods BS HW 2205 - Heathermoor Condo BS P23-202 - Paloma Grande in Bonita Springs BS SC 505 - Seascape Bonita Beach BS SW 2-101 - Palmas Grandes BS SW 4-421 - Marbella at Spanish Wells II BS SW 36-3632 - Marbella at Spanish Wells BW 637-104 - Beachwalk BW 661 A-103 - Condo in Beachwalk Baltusrol A Baltusrol B Bandy Beach D201 Barletta at Bella Terra Batiki West 608 Bay Breeze Bay Cedar at Pelican Landing 25201 Beach Breeze Beach Therapy Beachcomber C202 Bella Casa 380 Bella Casa 1105 Bellativa Belle Bellini Bethpage A Birdie Haven Blind Pass B205 Blind Pass G101 Blue Gulf 101 Blue Heaven Blue Heron At Eagles Landing Blue Heron at the Dunes Bokeelia Breeze Breathing Space Brittany Estates 7554 By The Sea CBI 701 - Condo in Casa Bonita CG 403  - Cypress Glen CL OI U6-202  - Osprey Isle in Carlton Lakes COR 10835 - Townhome in Cordera CS DM 205 - Coquina Sands/ Del Mar Cape Harbour 509 Captains Walk A7 Captiva Escapade Captiva Hampton Captiva Memories Captiva Paradise Captiva Shores 5D Carpe Diem Casa Marina 124 Casa Salty Casa Tranquila Caspian Clubside 12 Clubside 14 Clubside 8051 Clubside 8095 Clubside 8109 Coastal Breeze Coastal Calm Compass Point 121 Compass Point 122 Compass Point 141 Compass Point 152 Compass Point 171 Compass Point 191 Compass Point 231 Conch Cottage Copa Captiva Coquina Beach 2E Coquina Beach 2G Coquina Beach 3B Coquina Beach 3F Coquina Beach 4E Coquina Beach 4G Coquina Beach 5B Coquina Beach 5D Coquina Beach 5F Coquina Beach 5G Coral Way Escape Cupcake Cypress Hall 8025 Cyprina Beach 9 DUN GP6-403  - Grande Phoenician in The Dunes Dolphin Cove Guest Houses Dolphin Cove Main House Dolphin House Dolphin View Donax Village 04 Double Clear 3165 EL D-201  - Villages of Emerald Lakes ES BT 8-821 - Barletta at Bella Terra ES BT 23-2313  - Barletta at Bella Terra Eagles Landing A-1 Eagles Landing A-2 Eagles Landing A-3 Eagles Landing A-4 Eagles Landing A-5 Eagles Landing A-6 Eagles Landing B-2 Eagles Landing B-3 Eagles Landing B-5 Eagles Landing B-6 Eagles Landing C-1 Eagles Landing C-2 Eagles Landing C-4 Eagles Landing C-5 Eagles Landing C-6 Eagles Landing D-2 Eagles Landing D-3 Eagles Landing D-4 Eagles Landing D-5 Eagles Landing D-6 Eagles Landing E-1 Eagles Landing E-2 Eagles Landing E-3 Eagles Landing E-4 Eagles Landing E-5 Eagles Landing F-2 Eagles Landing F-3 Eagles Landing F-5 Eagles Landing Lakeside #1 Eagles Landing Lakeside #8 Eagles Landing Lakeside #13 Eagles Landing Villa #2 Eagles Landing Villa #3 Eagles Landing Villa #4 Eagles Landing Villa #6 Eagles Landing Villa #7 Eagles Landing Villa #10 Eagles Landing Villa #11 Eagles Landing Villa #14 Eagles Landing Villa #15 Egrets Walk  204 Endless Summer Escape To The Cape Esperia South at Bonita Bay 504 FF BC REM 901  - Remington at Bay Colony FF H AW 6481 - House in Autumn Woods FF HC GW 12500 - House in Hammock Cove at Gateway FF H ES CS 23234 - Villa in Coconut Shores FF H FMB 135A - 135A Gulfview Avenue FF VER 16251 - Verona Pointe FF VWBS 28234 - House in Villagewalk FG 104  -  Forest Glen FM CC 2-209 - Annual Rental in Cross Creek FM CC 2-209  - Cross Creek FW RW 1695-8 - Rosewood at Falling Waters Ferry Landing Fishermans Cove 80-101 Forest Lakes 1085 Fun Casa Funbar Hall Furnished 2 bedroom, 2 bath Sanibel View Condo GCC 541-1 - Glades Country Club Gardens At Beachwalk 314 Ghantous Home Golfview Home Good Times & Tan Lines Grotto Park 2 Gulfside Place 101 Gulfside Place 122 H BB 3310  -  House in Bonita Bay H BB 3936  -  House in Bonita Bay H BBK OS 9407 - Oak Strand at Shadow wood H BBK SB 9799 - Sweet Bay at Shadow Wood at the Brooks H BBKTT23243  -  Tamarind Trace in the Brooks H BL 11293  -  Botanica Lakes H BN 17151 - House in Bonita National H BP 12914  -  House in Brynwood Preserve H BS 27091 - House in Bonita Springs H BS 27153 - House in Bonita Springs H BS 27165  - House with Pool Bonita Springs H BS CC 9590 - House in Cedar Creek H BSL 242  - House in Berkshire Lakes H BT 21008 - House in Bella Terra H BT 21267 - House in Bella Terra H BW 724 - Beach Walk House H ES 20591 - House on Estero River H ES BT 20528  -  House in Bella Terra H ES BT 21203 - House in Bella Terra H ES BT 21203a - House in Bella Terra H ES RP 20350 - Rookery Pointe H ES RP 20421 - Rookery Pointe H FC OH 3318 - Oyster Harbor at Fiddler's Creek H GH 9842 - House in Greyhawk at Golf Club of The Everglades H IGC 1961 - Schnepf Home HL 9-204 - Huntington Lakes H LP 714 - House in Lake Park H MO 1824 - House in The Moorings H MO 2201 - House in the Moorings 2201 (Seasonal Rental) H MP 7932 - House in Madison Park H MR 6653 - House in Mill Run H NAP 1521 - House in Nature Pointe H NP 793 - House in Naples Park H ON 44 - House in Olde Naples H ON 56 - Beachfront Pool Home in Olde Naples H ON 300 - Resort Style Olde Naples Pool Home H ON 359 - House in Olde Naples H ON 361 - House in Olde Naples H ON 476 - House in Olde Naples H ON 590 - Lakefront Pool Home in Olde Naples H ON 675 - House in Olde Naples H PAL 26120 - House in Paloma H PB 714 - House in Oakmont in Pelican Bay H PB 836 House in Pelican Bay H PB 6605 - Village at Pelican Bay H PB 6967 - House in Pelican Bay H PB CH 5916 - House in Chanteclair in Pelican Bay H PC 20385 - House in Preserve of Corkscrew H PL 3500 - House in Pelican Landing H PL 25221 - House in Pelican Landing H PL COT3628 - House in Pelican Landing H PL L 3510 - House in Lakemont at Pelican Landing H PL PP25094 - Pinewater Place at Pelican Landing H PM TI 1920 - Timarron at Pelican Marsh H PM TI 1959 - House in Timarron at Pelican Marsh H PM V 8780 - House in Ventura at Pelican Marsh H SAP 5901 - Ana's Place in The Strand H SOK 1511 - House in The Preserve at Sterling Oaks H SSG 5815 - Sawgrass in The Strand H STC 4126 - House in Stonecreek H STG 6702 - House in Stonegate 6702 H SW 28387 - House in Spanish Wells H SW 28417 - Home in Spanish Wells H SW 28440 - House in Spanish Wells H VAS 28243 - House in Bellino at Vasari H VB 15122 - Home in Vista Blue H VR 8484 - House in Verona Walk H VV 20213 - Home in Verdana Village H VW 28983 - House in Villagewalk H VWBS 28100 - House in Village Walk Halcyon Days Haven House Heritage Bay A Golfer's Dream Hibiscus Hideaway Homebase 2 Home in Bonita Springs 9755 House in Big Cypress Golf Club House in Golden Hills House in Olde Naples 678 IGE BG F-4 - Bermuda Greens at Imperial Golf Estates IMP BG-R8 - Bermuda Greens at Imperial Golf Estates IMP CS 1-201 - Charleston Square at Imperial Golf Estates Ibis Cottage Into the Mystic Island Beach Club 2PC Island Beach Club 210F Island Beach Club 230F Island Beach Club 310C Island Beach Club 310D Island Beach Club 320D Island Beach Club 330C Island Beach Club P2F Island Palm Island Times Isle-B-Back Jensen's Cottage #01 Jensen's Cottage #02 Jensen's Cottage #03 Jensen's Cottage #04 Jensen's Cottage #05 Jensen's Cottage #06 Jensen's Cottage #07 Jensen's Cottage #08 Jensen's Cottage #09 Jensen's Cottage #10 Jensen's Cottage #11 Jensen's Cottage #12 Jensen's Cottage #14 Jensen's Cottage #15 Jonathan's Bay 202 Just By Chance Kaspar Home Keepin' It Reel Kelly Greens Furnished Condo - C KG 12191 1523 Kings Crown 108 Kings Crown 218 Kings Crown 311 Kings Crown 314 Kings crown 213 LEM 1303 - Lemuria LR O 4903 - Ole at Lely Resort La Dolce Vita Lake View Condo at Pipers Pointe - C PP 109 205 Lazy Palm Lemon Drop Home Lighthouse Point 115 Lighthouse Point 214 Lighthouse Point 219 Lighthouse Point 220 Lighthouse Point 226 Loggerhead Cay 102 Loggerhead Cay 103 Loggerhead Cay 104 Loggerhead Cay 111 Loggerhead Cay 113 Loggerhead Cay 133 Loggerhead Cay 144 Loggerhead Cay 152 Loggerhead Cay 172 Loggerhead Cay 191 Loggerhead Cay 201 Loggerhead Cay 211 Loggerhead Cay 241 Loggerhead Cay 272 Loggerhead Cay 283 Loggerhead Cay 301 Loggerhead Cay 312 Loggerhead Cay 333 Loggerhead Cay 363 Loggerhead Cay 371 Loggerhead Cay 413 Loggerhead Cay 414 Loggerhead Cay 423 Loggerhead Cay 431 Loggerhead Cay 432 Loggerhead Cay 452 Loggerhead Cay 453 Loggerhead Cay 512 Loggerhead Cay 521 Loggerhead Cay 522 Loggerhead Cay 531 Loggerhead Cay 551 Loggerhead Cay 561 Loggerhead Cay 571 Lovin' Spoonbill Lux Captiva House ML 6525-203 - Marbella Lakes MO AP1-510 - Admiralty Point I MO BC 303 - Condo in Bordeaux Club MO CC 318 - Coquina Club Condo MO COM 103 - Commodore Club at the Moorings MO COM 105 - Commodore Club II MO GP 2 - Grand Prix Apartments MO GP 3 - Grand Prix Apartments MO GP 8 - Grand Prix at Moorings MO GT 306 - Gulf Towers on the Beach MO GT 504 - Gulf Towers Beach Condo MO HC 207 - Harbour Cove MO JS 102 - Jennifer Shores MO NC 314 - Naples Continental Club MO STC 105 - St. Croix Club MO YHM S6 - Yacht Harbor Manor Maison de la Mer Manatees & Memories Mariner Pointe 121 Mariner Pointe 142 Mariner Pointe 223 Mariner Pointe 532 Mariner Pointe 612 Mariner Pointe 713 Mariner Pointe 1052 Mermaid Cottage Midnight Star Muirfield A NAP 3102 - Napoli NS 118-8 - Naples Sunrise OA 2626 - Oasis at Naples ON 780-306 - 780 Building at Olde Naples ON BC VG B11 - Bonaire Club at Village Green ON CG 112 - Central Garden at Olde Naples ON CG 119 - Condo in Central Gardens ON GE 514 - Gulf East ON IC 578 - Old Naples ON KG 202 S - Kensington Gardens at Olde Naples ON MC 1295 - Mariner at Olde Naples ON NF 365-307 -  Naples 5th Avenue 365 ON NS 2-303 - Naples Square II at Olde Naples ON NS 2-318 - Naples Square ON NS 2-411a - Naples Square ON NS 3-517 - Naples Square ON SW 341 - Sea Walk in Olde Naples ON WC 640-2 - Windward Cay in Olde Naples Oakmont A Oasis Inn the Dunes Oliva Cottage On The Rocks Osprey's View Otter Banks Main and Guest Our Happy Place PB BAR 8-202 - Barrington Club at Pelican Bay PB BAR 10-102 - Barrington Club at Pelican Bay PB CAL 401D - Calais at Pelican Bay PB CAL E-201 - Calais at Pelican Bay 201 PB CH 114 - Chanteclair of Pelican Bay PB CLA PHD - Claridge at Pelican Bay - PHD PB CRES 612 - The Crescent in Pelican Bay - 612 PB GC 102 - Glencove at Pelican Bay #102 PB LAM 4-206 - Condominium at L'Ambiance in Pelican Bay 206 PB LO 823-101 - Laurel Oaks at Pelican Bay PB LO 847-101 - Laurel Oaks at Pelican Bay PB MON 1008 - Montenero at Pelican Bay PB PC 15-201 - Pebble Creek at Pelican Bay PB PC 15-302 - Pebble Creek at Pelican Bay PB PC 16-203 - Pebble Creek at Pelican Bay PB SANC 225 - Sanctuary at Pelican Bay PB SER 563 - Serendipity in Pelican Bay PB SN 504 - St. Nicole at Pelican Bay PB SN 902 - St. Nicole at Pelican Bay PB SN 2004 - St. Nicole at Pelican Bay PB ST 4 - St. Thomas at Pelican Bay PB STL 1905 - St. Laurent at Pelican Bay PB STR 403 - St Tropez at Pelican Bay PB STR 1204 - St. Tropez at Pelican Bay PB STS 22 - St. Simone in Pelican Bay PB STV 7 - St. Vincents at Pelican Bay PB VAL F202 - Valencia at Pelican Bay PB WB 107 - Willowbrook at Pelican Bay PB WB 608 - Willowbrook at Pelican Bay 608 PB WB 1503 - Willowbrook at Pelican Bay PB WB A-1406 -  Willowbrook at Pelican Bay PG NG 2585-203 - Pipers Grove PL LC X-101 24821 Lakemont Cove at Pelican Landing PL MER 25-102 - Merano at The Colony at Pelican Landing PL MR-122 - Mystic Ridge at Pelican Landing PL N 503 - Navona at The Colony PL N 804 - Navona at The Colony at Pelican Landing PL N 904 - Navona at the Colony PL N 1602 - Navona at The Colony at Pelican Landing PL PC 24615-101 - Palm Colony at Pelican Landing PL P H-202 - The Pointe at Pelican Landing PL P N-102 - The Pointe at Pelican Landing PL SB 26-101 - Southbridge at Pelican Landing PL SB 29-102 Southbridge at Pelican Landing PL SI C-101 - Sandpiper Isle at Pelican Landing PL SP J-201 - Sawgrass Point PL T 504 - Condo in Treviso at the Colony PL T 1503 - Treviso at The Colony at Pelican Landing PM A 103 - Arielle at Pelican Marsh PM A 104 - Arielle at Pelican Marsh PM A 2103 - Arielle at Pelican Marsh PM A 2110 - Arielle at Pelican Marsh PM A 2306 - Arielle at Pelican Marsh PM CL M-202 - Clermont at Pelican Marsh PM EW 23-202 - Egret's Walk at Pelican Marsh PM EW 31-201 - Egrets Walk at Pelican Marsh PM SEV 2122 - Seville at Pelican Marsh PS BPNC 402 - Baypointe at Naples Cay PS BPNC 604 - Baypointe at Naples Cay PS BPNC 704 - Baypointe at Naples Cay PS BPNC 805 - Baypointe at Naples Cay PS BRIT 1804 - The Brittany at Park Shore PS BSP 1505 - Bayshore Place at Park Shore PSD SH 6-101 - Southern Hills at Pelican Sound PS HLV E-14 - Hidden Lake Villas PS HT 113 - Harborside Terrace at Park Shore PS HT 114 - Harborside Terrace at Park Shore PS MER 204 - Merdian Club at Park Shore PS PST 16D - Park Shore Tower PS PST 17A - Park Shore Tower PS SAV 301 - Savoy at Park Shore Beach PS SAV 606 - Savoy at Park Shore Beach PS SAV 1204 - Savoy at Park Shore Beach PS SAV 1601 - The Savoy at Park Shore Beach PS SE 607 - Park Shore Surfsedge PS SL 8A - Swan Lake in Park Shore PS VIS 504 - Vistas in Park Shore PS VIS 1805 - Vistas at Park Shore Beach Palm Breeze Park at Lakewoods II-107 Paseo - Rustic Palms Paseo - Villa Tortuga Pine Cove 302 Pine Cove 404D Pineland Park in Park Shore 109 Pipers Pointe 104 Plantation Village 221 Pointe Santo A 7 Pointe Santo A22 Pointe Santo A23 Pointe Santo A35 Pointe Santo A36 Pointe Santo B6 Pointe Santo B41 Pointe Santo C23 Pointe Santo D 2 Pointe Santo D24 Pointe Santo D32 Pointe Santo D34 Pointe Santo E1 Pointe Santo E33 Poolside Paradise Ports of Iona 302B Province Park 103 QUAR 6-201 - Ironstone at the Quarry RAP EN 66-101 - The Enclave at Rapallo RET 18-101 - The Retreat RL Sherman Oaks 8389 RP 10805 - Regent Park Rainbow's End Reel 'Em Inn Rendezvous By The Sea Riverside Retreat Riverwalk 325 Rosie's Place Royal Troon A Royal Troon B Rum N Reel SBC 14-102 - Carrington at Stonebridge S FS 502 - Feather Sound at The Strand S FS 806 - Feather Sound at The Strand S TC 2002 - Trophy Club at The Strand SW 41-101 - Sherwood S WW 1507 - Wedge Wood in the Strand Sabal Pointe 1605 Sail Harbour 101 Saltwind II Salty Sister San Mirage of Bonita Springs Sand Pointe 121 Sand Pointe 124 Sand Pointe 125 Sand Pointe 127 Sand Pointe 133 Sand Pointe 211 Sand Pointe 215 Sand Pointe 216 Sand Pointe 222 Sand Pointe 223 Sand Pointe 227 Sand Pointe 234 Sand Pointe 235 Sand Pointe 236 Sand Pointe 237 Sanddollar A102 Sanddollar A104 Sanddollar B101 Sanddollar C203 Sanddollar C301 Sanddollar C303 Sanddollar C304 Sandpiper Beach 106 Sandpiper Beach 201 Sandpiper Beach 204 Sandpiper Beach 206 Sandpiper Beach 301 Sandpiper Beach 302 Sandpiper Beach 303 Sandpiper Beach 402 Sandpiper Beach 406 SaniBelle Sanibay Sanibel Fitz You Sanibel Harbour Resort 214 - H Sanibel Harbour Resort 431-B Sanibel Harbour Resort 437 - B Sanibel Harbour Resort 514- H Sanibel Harbour Resort 517 - H Sanibel Harbour Resort 537 - B Sanibel Harbour Resort 1012 - H Sanibel Harbour Resort 1136 - B Sanibel Surfside 112 Sanibel Surfside 113 Sanibel Surfside 117 Sanibel Surfside 127 Sanibel Surfside 134 Sanibel Surfside 136 Sanibel Surfside 214 Sanibel Surfside 233 Sanibel View 107 Santa Fe Santa Maria Resort 3205 Sayana Of Sanibel 301 Sayana Of Sanibel 303 Seagrape Village 3 Second Floor End unit with pool views - C TP 328 328 Shell Basket 1 Shell Basket 2 Shell Island Beach Club 5A Shell Sanctuary Shell Seekers Sherman Oaks 525 Sherman Oaks 624 Sherman Oaks 625 Sherman Oaks 8105 Shore Beats Work Snook Villa at South Seas 3118 Somerset at the Reef B101 Sorrento Soulshine South Seas Bayside Villa 4124 South Seas Bayside Villa 4212 South Seas Bayside Villa 5220 South Seas Bayside Villa 5320 South Seas Bayside Villa 5326 South Seas Beach Cottage 1402 South Seas Beach Cottage 1407 South Seas Beach Cottage 1413 South Seas Beach Cottage 1416 South Seas Beach House 04 South Seas Beach House 09 South Seas Beach House 10 South Seas Beach House 16 South Seas Beach House 30 South Seas Beach Villa 2010 South Seas Beach Villa 2023 South Seas Beach Villa 2237 South Seas Beach Villa 2332 South Seas Beach Villa 2511 South Seas Beach Villa 2528 South Seas Beach Villa 2537 South Seas Blue Bayou South Seas Lands End 1602 South Seas Lands End 1625 South Seas Lands End 1634 South Seas Lands End 1638 South Seas Villas 3130 South Seas Villas 3216 Spanish Cay A7 Spanish Cay E1 Spanish Cay F4 St Andrews A St Andrews B Stunning Spanish-style 3/2/1 pool home in Historic Edison Park Sun & Fun Sun Daze SunSplashed Villa Sundial A405 Sundial B207 Sundial B208 Sundial D303 Sundial D401 Sundial E204 Sundial E301 Sundial E304 Sundial E308 Sundial F205 Sundial F301 Sundial G207 Sundial G405 Sundial G406 Sundial H306 Sundial H406 Sundial H407 Sundial I406 Sundial J204 Sundial K202 Sundial K308 Sundial L203 Sundial L304 Sundial L405 Sundial N301 Sundial N302 Sundial O204 Sundial P203 Sundial P304 Sundial P305 Sundial Q205 Sundial R201 Sundial R203 Sundial R305 Sundial R401 Sundial R402 Sundial R403 Sundial R406 Sundial S302 Sundial S403 Sundial T204 Sundial T305 Sundial T306 Sunflower Cottage Sunset Captiva 04 Sunset Captiva 07 Sunset Captiva 08 Sunset Captiva 12 Sunset Captiva 15 Sunset Captiva 20 Sunset Captiva 21 Sunset Captiva 27 Sunset Captiva 28 Sunset Captiva 29 Sunset Captiva 30 Sunset Captiva 31 Sunset Captiva 36 Sunset Captiva 39 Sunset Captiva 41 Sunset Captiva 44 Sunset Captiva 47 Sunset Captiva 53 Sunset Oasis Sunset South 9B TC BIM 11-202 - Bimini IV at Tarpon Cove TIB C 19-102 - Castillo at Tiburon Tarpon Beach 204 Tarpon Beach 205 Tarpon Beach 209 Tennisplace B31 The 1912 House The Ascot The Banyan House The Baymeadow The Blue Palm The Cape Escape The Green House The Hawthorne The Magic Blue House Tiki Time Retreat Tiki Too Turtlehouse Tuscan Estate V ARB 4665-104 - Villla in Arboretum VAS T4-101 - Trieste in Vasari VAS TO7-201 - Toscana in Vasari VB BFP 123 - Barefoot Pelican at Vanderbilt Beach VB BFP 155 - Barefoot Pelican at Vanderbilt Beach V BBKLB23821 - Lighthouse Bay at the Brooks V BL 174 - Villa in Berkshire Lakes VB SCI 103 - Vanderbilt Surf Colony V BSHV-320B - Hacienda Village V BSHW 26407 - Villa in Highland Woods VB VL 502 - Vanderbilt Landings II VB VL 601 - Vanderbilt Landings II V BW 549 - Villa in Beachwalk V BW 555 - Villa in Beachwalk V BW 736-30 - Villa in Beachwalk VEB D6-410 - Villages of Emerald Bay V EOB 400 - Villa in Eden on the Bay VIN SO 11201 - Silver Oaks at The Vineyards VL BI 4-104 - Bermuda Isles at Vanderbilt Lakes V ON SB 1080 - Spellbinder Villas V ON SB 1165 - Spellbinder Villas V PB BV667 - Bridgeway Villas at Pelican Bay V PB SP 6810 - Sand Pointe Villas in Pelican Bay V PL 25400 - Costa Del Sol at Pelican Landing V PL 25410 - Villa in Costa Del Sol at Pelican Landing Ventura Captiva 3A Ventura Captiva 3B Villa Cuquita Villa Jade Villa Sanibel 2C Villa Vinsetta WGLK 757-106 - Wiggins Lake Condo WL FS 3775-1402 - Condo in Wilshire Lakes WTC 3605 - Villa at World Tennis Center Waterfront Serenity Waterside 2-233 West Indies Home West Shore #1 West Shore 102 at Naples Cay Whaleview Whispering Palms in Cinnamon Cove Wine Down Zen Villa ×"
    }
  ]
}