{
  "fuentes": [
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "andrew.robb@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "brodie.morcom@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "cade.webb@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "christian.puccini@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "daniel.scholz@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "david.oakley@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "gary.begg@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "getintogolf@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "luke.grinham@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "luke.woods@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "marc.pike@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "mark.ingrey@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "scott.simons@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "simon.weston@golf.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "tahnia.stalker@golfnsw.org.au"
    },
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "email": "tanya.smith@golfnsw.org.au"
    },
    {
      "url": "https://www.cregboy.ie/contactus",
      "email": "info@cregboy.ie"
    },
    {
      "url": "https://www.progressiongolfacademy.co.uk/contact-us/",
      "email": "coaching@pga-london-kent.co.uk"
    },
    {
      "url": "https://www.progressiongolfacademy.co.uk/contact-us/",
      "email": "coaching@progressiongolfacademy.co.uk"
    },
    {
      "url": "https://www.sweetbriargolfclub.com/instruction/",
      "email": "professionalkevin@sweetbriargolfclub.com"
    },
    {
      "url": "https://www.sweetbriargolfclub.com/instruction/",
      "email": "ciera@sweetbriargolfclub.com"
    },
    {
      "url": "https://www.sweetbriargolfclub.com/instruction/",
      "email": "faith@sweetbriargolfclub.com"
    },
    {
      "url": "https://www.sweetbriargolfclub.com/instruction/",
      "email": "jgrimm@sweetbriargolfclub.com"
    },
    {
      "url": "https://www.sweetbriargolfclub.com/instruction/",
      "email": "kevin@sweetbriargolfclub.com"
    },
    {
      "url": "https://www.sweetbriargolfclub.com/instruction/",
      "email": "nikki@sweetbriargolfclub.com"
    },
    {
      "url": "https://kevinperkinsgolfacademy.com/directions2/",
      "email": "dkperkins4@cs.com"
    },
    {
      "url": "https://www.manchesteracademy.org/contactus",
      "email": "apavatte@manchesteracademy.org"
    },
    {
      "url": "https://www.manchesteracademy.org/contactus",
      "email": "lbeildeman@manchesteracademy.org"
    },
    {
      "url": "https://www.manchesteracademy.org/contactus",
      "email": "ldixon@manchesteracademy.org"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-1024x1024.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-300x300.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-600x600.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1-768x768.jpg"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "email": "allan-@-the-masters-1.jpg"
    },
    {
      "url": "https://www.mdislander.com/sports/golf/new-pro-at-causeway-club/article_754f831b-7a4a-5192-b26d-ef8f9cc518e9.html",
      "email": "info@mdislander.com"
    },
    {
      "url": "https://www.mdislander.com/sports/golf/new-pro-at-causeway-club/article_754f831b-7a4a-5192-b26d-ef8f9cc518e9.html",
      "email": "news@mdislander.com"
    },
    {
      "url": "https://www.pgadevelopment.hk/contact",
      "email": "fo@pacificpinesports.com"
    },
    {
      "url": "https://www.pgadevelopment.hk/contact",
      "email": "info@pacificpinegolf.com"
    },
    {
      "url": "https://www.pgadevelopment.hk/contact",
      "email": "info@pacificpinesports.com"
    },
    {
      "url": "https://www.pgadevelopment.hk/contact",
      "email": "pgagolfacademy@pgayouth.cn"
    },
    {
      "url": "https://peakperformancegolfacademy.com/golf-instruction-about-us/",
      "email": "rogerio@peakperformancegolfacademy.com"
    }
  ],
  "mails": [
    "allan-@-the-masters-1-1024x1024.jpg",
    "allan-@-the-masters-1-300x300.jpg",
    "allan-@-the-masters-1-600x600.jpg",
    "allan-@-the-masters-1-768x768.jpg",
    "allan-@-the-masters-1.jpg",
    "andrew.robb@golfnsw.org.au",
    "apavatte@manchesteracademy.org",
    "brodie.morcom@golf.org.au",
    "cade.webb@golfnsw.org.au",
    "christian.puccini@golf.org.au",
    "ciera@sweetbriargolfclub.com",
    "coaching@pga-london-kent.co.uk",
    "coaching@progressiongolfacademy.co.uk",
    "daniel.scholz@golf.org.au",
    "david.oakley@golfnsw.org.au",
    "dkperkins4@cs.com",
    "faith@sweetbriargolfclub.com",
    "fo@pacificpinesports.com",
    "gary.begg@golfnsw.org.au",
    "getintogolf@golf.org.au",
    "info@cregboy.ie",
    "info@mdislander.com",
    "info@pacificpinegolf.com",
    "info@pacificpinesports.com",
    "jgrimm@sweetbriargolfclub.com",
    "kevin@sweetbriargolfclub.com",
    "lbeildeman@manchesteracademy.org",
    "ldixon@manchesteracademy.org",
    "luke.grinham@golfnsw.org.au",
    "luke.woods@golfnsw.org.au",
    "marc.pike@golf.org.au",
    "mark.ingrey@golfnsw.org.au",
    "news@mdislander.com",
    "nikki@sweetbriargolfclub.com",
    "pgagolfacademy@pgayouth.cn",
    "professionalkevin@sweetbriargolfclub.com",
    "rogerio@peakperformancegolfacademy.com",
    "scott.simons@golf.org.au",
    "simon.weston@golf.org.au",
    "tahnia.stalker@golfnsw.org.au",
    "tanya.smith@golfnsw.org.au"
  ],
  "nombre_sitio": "kevinperkinsgolfacademy.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golf.org.au/getintogolf/contact-us",
      "text": "Get Into Golf contacts | Golf Australia This app works best with JavaScript enabled. Sign up Log in Find a program Info for participants Get Into Golf for everyone Get Into Golf for women Get Into Golf for seniors Get Into Golf All Abilities Participant FAQs Info for venues Get your venue involved Login Download CoachMate App National Program Deliverer Contact us Golf Australia Log in or sign up to use Handicap Look-Up and view your profile. Search Golf Australia Contact Us - Get Into Golf Golf Australia (GA) are the owners of the Get Into Golf website and are responsible for its maintenance. If you have any queries about the website please get in touch with one of our friendly staff members. Golf Australia Golf Australia\nContact: Jack Macleod\nP: 0433 841 449\nE: getintogolf@golf.org.au New South Wales Golf New South Wales\n\nNewcastle/Hunter Region\nDavid Oakley\nEmail: david.oakley@golfnsw.org.au\n\nMurray Region\nCade Webb\nEmail: cade.webb@golfnsw.org.au\n\nCentral West Region\nAndrew Robb\nEmail: andrew.robb@golfnsw.org.au\n\nWestern Region\nGary Begg\nEmail: gary.begg@golfnsw.org.au\n\nSydney Metro North Region\nMark Ingrey\nEmail: mark.ingrey@golfnsw.org.au\n\nSydney Metro South Region\nTanya Smith\nEmail: tanya.smith@golfnsw.org.au\n\nIllawarra Region\nTahnia Stalker\nEmail: tahnia.stalker@golfnsw.org.au\n\nNorthern Region\nLuke Woods\nEmail: luke.woods@golfnsw.org.au\n\nSouth Coast/ACT\nLuke Grinham\nEmail luke.grinham@golfnsw.org.au Northern Territory Brodie Morcom\nP: 0498 631 983\nE: brodie.morcom@golf.org.au Queensland Scott Simons\nP: 07 3564 8914\nE: scott.simons@golf.org.au South Australia Christian Puccini \nP: 0412 401 534\nE: christian.puccini@golf.org.au Tasmania Simon Weston\nP: (03) 6244 3600\nE: simon.weston@golf.org.au Victoria Daniel Scholz\nP: 0411 663 565\nE: daniel.scholz@golf.org.au Western Australia Marc Pike\nP: (08) 9367 2490\nE: marc.pike@golf.org.au Get Into Golf Find a program near you Search Join our newsletter Get weekly updates on news, golf tips and access to partner promotions! Your Email Address * Subscribe Stay up to date Privacy Policy Terms of Use Ⓒ Golf Australia. All rights reserved"
    },
    {
      "url": "https://www.cregboy.ie/contactus",
      "text": "Contact Us — Cregboy Golf Academy Home Driving Range Book Group Lessons Par 3 Golf Course Coaching Services Contact Us Corporate Kids Parties MAP Employee Night Out Cregboy Golf Academy Home Driving Range Book Group Lessons Par 3 Golf Course Coaching Services Contact Us Corporate Kids Parties MAP Employee Night Out Thank you for visiting Cregboy Golf Academy Website! We’re here to help with any enquiries or assistance you may need. Whether you’re looking to book a round on our 9 Hole Par 3 course, reserve a bay at our 13 bay floodlit driving range, schedule a golf lesson, or require club hire or repair services, our team is ready to assist. EMAIL US CALL US Address - CREGBOY GOLF ACADEMY,  CREGBOY,  CLAREGALWAY,  CO.GALWAY, H91 4F38 ENQUIRY FORM Name * First Name Last Name Email * Subject * Message * Thank you! Contact: 091 798878 /  087 7792506 © Cregboy Golf Academy Back to Top Contact Us Powered by Squarespace"
    },
    {
      "url": "https://www.progressiongolfacademy.co.uk/contact-us/",
      "text": "Contact Us | Progressive Golf Academy in London & Kent Follow us on Instagram Find us on Facebook 0800 334 5435 coaching@progressiongolfacademy.co. uk Contact Book Now Home Coaching Coaching Golf Lessons Indoor Golf Custom Fitting Club Repairs Prices & Packages Contact Us CONTACT US Get in Touch with Progression Golf Academy Whether you have questions about our coaching programmes, want to book a lesson, or need more information about our facilities, we’re here to help. Make an enquiry IMPROVE YOUR GOLF Book a Lesson To book a golf lesson, visit our Prices & Packages page or contact us directly. Whether you’re interested in indoor coaching, on-course training, or specialist lessons, we have a range of options to suit your needs. Book your session today and start improving your game. Book a lesson GET IN TOUCH Contact Details Reach out to us using the details below, and a member of our team will be happy to assist you. Phone For bookings and general enquiries, call us at: 0800 334 5435 Email Send us an email with your query, and we’ll get back to you as soon as possible: coaching@progressiongolfacademy.co.uk WhatsApp For bookings and general enquiries on WhatsApp, call us at: 07359 312219 Location We have training facilities in Sevenoaks, Kent and London. Contact us to book an appointment and arrange a session. Phone For bookings and general enquiries, call us at: 0800 334 5435 Email Send us an email with your query, and we’ll get back to you as soon as possible: coaching@progressiongolfacademy.co.uk WhatsApp For bookings and general enquiries on WhatsApp, message us at: 07359 312219 Location We have training facilities in Sevenoaks, Kent and London. Contact us to book an appointment and arrange a session. Make an enquiry MAKE A BOOKING Enquiry Form Fill out the form below, and we’ll get back to you as soon as possible. Please leave blank: Full Name: Email Address: Phone Number: Interested In: Golf Lessons (Indoor) Golf Lessons (On-Course) Custom Club Fitting Club Repairs & Regripping General Enquiry Preferred Location: Sevenoaks, Kent London Additional Details: Send OUR SOCIAL MEDIA Follow Us Stay updated with our latest coaching programmes, events, and promotions by following us on social media. CONTACT m. 07359 312219 t. 0800 334 5435 e. coaching@progressiongolfacademy.co.uk SOCIAL Follow us on Instagram Find us on Facebook INFO Available Mon - Sat: 9am - 9pm Convenient locations in Sevenoaks, Kent, and London Golf Coaching in Sevenoaks Golf Lessons in London m. 07359 312219 t. 0800 334 5435 e. coaching@progressiongolfacademy.co.uk Follow us on Instagram Find us on Facebook Convenient locations in Sevenoaks, Kent, and London Available 7 days a week, 9am - 9pm. Golf Coaching in Sevenoaks Golf Lessons in London Home Coaching Golf Lessons Indoor Golf Custom Fitting Club Repairs Prices & Packages Contact Us Privacy | Cookies | © Progressive Golf Academy - All Rights Reserved Website design Gravesend — by it ’ s eeze Our site uses cookies. For more information, see our cookie policy . Accept cookies and close Reject cookies Manage settings"
    },
    {
      "url": "https://www.sweetbriargolfclub.com/instruction/",
      "text": "Instruction - Sweetbriar Golf Club - Legacy 18 Skip to main content Skip to primary sidebar Skip to footer Sweetbriar Golf Club - Legacy 18 Home Tee Times Legacy Course Tee Times Employee Tee Times Sweetbriar 9 Golf Book a Tee Time Driving Range Scorecards Golf Etiquette, Rules + Policies Golf Shop Club Fittings Courses Video Flyover Legacy 18 Sweetbriar 9 Legacy Hole by Hole Flyover Advertising Partnerships Instruction Instruction Kevin Moore Nikki St. Vincent Faith Egli Ciera Miller Golf Clinics Private Golf Lessons Restaurant Golf Outings Group Outings Request Event Information Contact Us Employment Application Buy Online Instruction Meet our Instructors Please call the golf shop at 440-933-9001 or email kevin@sweetbriargolfclub.com for Instruction staff availability and we will have a member of our staff contact you shortly. Kevin Moore, PGA | Director of Golf Course Operations/Head Golf Professional kevin@sweetbriargolfclub.com Kevin has been working at Sweetbriar since 2001. Kevin Started out working outside washing golf carts in Junior High School, worked inside in the proshop and then worked 5 seasons as the Assistant Golf Professional prior to taking the Head Golf Professional/Director of Golf Operations position he is in today. Golf has always been a passion of mine. At the age of 3, my father introduced and taught me the game of golf. I started playing competitively at the age of 10. At Avon Lake High School I was a 4 year varsity letterman and a three-time 1st team All-Conference member as well as Conference Player of the year in 2005. I took my love of golf with me to college where I earned a Bachelor of Science Degree in Sports Management at Cleveland State University in 2009. While attending CSU, I began working towards becoming a PGA Professional and in February 2012 I became a Class A PGA Professional. I reside in Avon Lake with my wife, Kristen, our son Brenden who was born on July 14th, 2016 and our Daughter Leah who was born January 24th 2019 Teaching Experience Previous to taking the Head Golf Professional/Director of Golf Course Operations position, I was the Assistant Golf Professional here at Sweetbriar for 4 years. Over this time, I have taught between 150-200 lessons annually and built up a large clientele base. I have extensive experience with teaching new, as well as experienced golfers, varying from men to juniors and women. My strengths as a teacher are my patience, my ability to communicate, and effectively relate to a wide range of individuals and experience levels. Teaching Philosophy “My goal in teaching is to give each one of my students the knowledge and skills necessary to make him or her the best golfer they can be, while improving the student’s fundamental understanding of the golf swing.” It is of the utmost importance to me that I tailor my teaching methodology to each student’s individual skill set and learning style. I also want to provide each student with a fun learning environment that helps him or her feel comfortable while exciting them when they come to the golf course. The most important thing to remember about this game is that it should always be about having fun. Nikki St. Vincent, LPGA | Teaching Professional nikki@sweetbriargolfclub.com Ever since I can remember, golf has always been in my life. I grew up working and playing golf at Twin Creeks Golf Course, which is owned and ran by my family in Illinois. I was taught by my dad and grandfather, both avid and accomplished golfers. At the age of eight, I played in my very first tournament, and went on to play competitive golf in high school and college. I played on scholarship at John A. Logan College and The University of Missouri at Kansas City, where I graduated with a Business Degree in 2004. I then moved to Arizona and had the privilege of working for The First Tee of Phoenix from 2007-2012. I was a Recognized Coach of The First Tee, where I taught Life Skills and Core Values to juniors locally and nationally. My love for the game came full circle when I met my husband. Our first date was 18 holes and we played every week after that. This ignited my desire to learn more, teach more and begin the process of becoming a member of the LPGA Teaching & Club Professionals. Soon thereafter, my husband and I moved back to the Midwest to be closer to our family. I’ve been an LPGA member since 2011 and have been teaching at Sweetbriar since 2013. I currently reside in Bay Village with my husband, Bobby, and my two sons, Wallace and August. My experience teaching has been extremely rewarding and I absolutely love what I do. I can think of nothing better than to help others learn and love the game as I have. My Teaching Philosophy: “Every student and every lesson is different from the last. Each student has their own goals, abilities, strengths and reasons for playing the game of golf. It’s my goal to discover the individuality of my student and create an effective, efficient and fun way for them to learn and be successful.” Faith Egli LPGA | Teaching Professional faith@sweetbriargolfclub.com Book a Lesson I have been playing golf for as long as I can remember, playing with my family and friends in Northern Michigan. I was fortunate to receive a scholarship to attend Michigan State University where I was honored with twice being named to the First Team All Big Ten team. From there, I went to play golf professionally, playing in the 1989 US Open and 12 LPGA tour events as well as 2 years on the mini tour. I joined the PGA of America and the LPGA Teaching division. My career has taken me where I have wore many hats from Head Golf Professional, General Manager, College Coach, and Golf Instructor. I was honored to earn a lifetime achievement award from the PGA and also being named a Top 50 LPGA Instructor and twice Professional of the Year. Teaching golf is my passion and what I choose to do as I have retired from the business side of the game. Four years teaching at Golftec helped me learn the modern ways of teaching which I have to admit have changed a lot as technology has changed. In my spare time I spend time with my family and 2 dogs, spend time relaxing at my cabin, hiking, boating, riding motorcycles, I’m a stock market junkie, and of course I love golfing. I look forward to helping you improve your golf game and reach your goals. Golfing Philosophy: Juniors: Have fun, start with solid fundamentals, play by the rules, keep improving Adults: Listen to determine what issues bother the student. Determine the root cause of what is happening, communicate the issue and explain why it is happening, show how to fix it, give drills and homework so they can progress. Ciera Rhodes | PGA | Assistant Professional ciera@sweetbriargolfclub.com I grew up in Bay Village, Ohio and attended their school system throughout my childhood. I played 4 years for the Bay Girls Varsity Team and decided I wanted to pursue golf further after High School. I attended Eastern Kentucky University and Majored in Marketing with a Concentration of PGA Professional Golf Management and graduated in 2017. I have been a full Class A PGA Member since May 2021. Since then, I have moved back to Ohio and live in the suburb of Lyndhurst with my husband and our dogs, cat and chickens. I have worked all around the Greater Cleveland Area at places such as Avon Oaks Country Club, Columbia Hills Country Club, Shaker Heights Country Club and Catawba Island Golf Club. All of which helped grow my knowledge teaching and how the golf world works! Teaching Philosophy: I have truly found my calling in life with growing the game golf to everyone who wants to learn. I have had the privilege of teaching and creating many lessons and clinics to Women, Men and Juniors over the past years at varying skill levels. I really focus on how my student’s bodies feel from the beginning to end of their swing as this can play into their limitations. I create each lesson plan according to each student’s goals and divide them into steps to get them there. My favorite part about teaching is whether or not the student is a beginner or advanced player, when they finally feel the connection of proper body rotation to impact their confidence for the whole game improves. John Grimm, PGA | Teaching Professional jgrimm@sweetbriargolfclub.com My entire adult life has been in the golf business. I stated as a PGA Apprentice at Chagrin Valley cc in 1974 and was elected to PGA Membership in 1978 and am now a Life Member of the PGA. In my 45 years of teaching golf I have worked successfully with men,women, seniors, and junior golfers from beginners to accomplished low handicap players. I have also taught many clinics at the clubs where I have worked and adult education and college classes at the University of Akron and Lorain County Community College. My teaching and coaching also includes high school golf. The schools where I have coached are Westlake, Strongsville, Medina, Copley, and ST. Vincent St Mary in Akron, coaching boys and girls varsity and junior varsity teams. Teaching Philosophy: My approach to teaching is straightforward teaching the fundamentals of the swing in the classical tradition and the short game. Drills and training aids are not part of my method as the time spent on drills and with aids is better spent practicing the actual swing the student is working on. Finally, let me say that I am pleased to be joining the staff at Sweetbriar and am looking forward to meeting and working my new students. Visit the Sweetbriar Driving Range & Practice Green Time spent at the driving range is a major part in developing your game. Our driving range offers several tees where lessons take place and we also have a large practice green to sharpen your putting skills before or after play. Primary Sidebar Footer About Us Prepare yourself for an unparalleled golfing experience. Our course is a pleasure for golfers of any skill level to play. Test your accuracy with our fairways, water hazards and sand traps; we have everything you need to challenge you and improve your game. Follow Us Facebook Instagram Phone (440) 933-9001 Address 750 Jaycox Rd. Avon Lake, OH 44012 Email kevin@sweetbriargolfclub.com Sweetbriar Golf Club – Legacy 18 | 750 Jaycox Rd. Avon Lake, OH 44012 | 440-933-9001 Copyright © 2025 Sweetbriar Golf Club – Legacy 18 All Rights Reserved. Powered by"
    },
    {
      "url": "https://kevinperkinsgolfacademy.com/directions2/",
      "text": "Directions/Stay & Play | Kevin Perkins Home Airports and Accommodations Partners and Affiliates Teaching & Training Aids Photos Kevin Perkins Golf Management Kevin's Bio Programs/Rates School Packages Private Lessons Corporate Events Weekly Clinics Junior After School Program Junior Christmas Holiday Golf Camp Junior Spring Break Golf Camp Junior Summer Golf Camp Gift Certificates/FaceTime Lessons Academy Location TrackMan Launch Monitor Club/Ball Fitting Kevin's Book/Column Directions/Stay & Play Contact Us How to Find  Kevin Perkins Golf Academy at Sailfish Sands Golf Course Kevin Perkins Golf Academy at the Sailfish Sands Golf Course 2000 SE St. Lucie Blvd. Stuart, FL 34996 Email: dkperkins4@cs.com Phone: 561 301-3783 Kevin Perkins Golf Academy is located at the Sailfish Sands Golf Course . Sailfish Sands, is located in eastern Stuart on SE St. Lucie Blvd., 1/8 of a mile west of the St. Lucie River, 1 mile east of US Federal Highway and seven miles east of  interstate I-95. The KPGA is a thirty minute minute drive south and east from the PGA Village in Port St. Lucie and a five minute  drive from downtown Stuart, Florida. From US Federal Highway in Stuart, take Indian St. east 1.1 miles and then turn left on St. Lucie Blvd. Sailfish Sands is 1/4 of a mile on the left. Traveling south on I-95, take the Stuart exit (exit 101). Go left (east) on Kanner Hwy. Proceed 2.5 miles and turn right on Indian Street. Proceed 2.5 miles to St. Lucie Blvd and turn left. Sailfish Sands is 1/4 of a mile on the left. Traveling north on I-95, take the Stuart exit (exit 101). Go right (east) on Kanner Hwy. Proceed 2.5 miles and turn right on Indian Street. Proceed 2.5 miles to St. Lucie Blvd and turn left. Sailfish Sands is 1/4 of a mile on the left. Stay & Play Packages-Florida Just in case you have been considering getting out of the cold and taking a trip to Florida to work on your game and maybe taking a Private, Group or Playing Lesson, CLICK HERE or taking a Half, One, Two or Three Day Golf School, CLICK HERE , I want to give you possibly that little nudge to make it a reality! As most of you know we are located on the southeast coast of South Florida approximately 30 miles north of West Palm Beach. To help you with your accommodations, KPGA has also secured great Corporate Rates with a two local hotels on the Treasure Coast. The first hotel is the Hutchinson Shores Resort & Spa , located on the beach on beautiful Hutchinson Island, and is located approximately 6 miles from the KPGA. The second is the Hutchinson Island Resort by Marriott and is located 4 miles from the KPGA. © 2025 Kevin Perkins | [ ADMIN LOGIN ]"
    },
    {
      "url": "https://www.manchesteracademy.org/contactus",
      "text": "Contact Us Skip to main content Login Register Main Navigation Menu About MA Administration Beliefs Board of Directors Contact Us Driving Directions Employment History Mission Portrait of a Graduate Admissions Admissions Policy Building Pledge Nondiscriminatory Policy Tuition & Fees Academics ACT Information Counselor's Corner Preschool Lower School Upper School Summer Reading Technology Athletics Baseball Basketball Cheer Football Pee Wee Basketball Shooting Team Soccer Softball Tennis Track Calendar Faculty School Life Bell Schedules Cafeteria Class of 2026 The Green Scene Donate Volunteer FACTS Staff Login Contact Us Office Staff Barbara Parks - Front Office, Receptionist Leah Beidleman and Laura Dixon - Business Office lbeildeman@manchesteracademy.org ldixon@manchesteracademy.org If you are interested in job opportunities at Manchester Academy, please download the MA Job Application and email to Allen Pavatte (apavatte@manchesteracademy.org) or deliver to the MA Business Office. Documents MA Job Application Manchester \nAcademy, a college preparatory school, actively seeks to ensure that \neach student develops in body, mind, and spirit in the pursuit of \nacademic excellence. Manchester Academy is fully accredited by MAIS. 2132 Gordon Avenue | Yazoo City, Mississippi 39194 Phone: (662) 746-5913 | Fax: (662) 746-5108 Search Copyright © 2025 Manchester Academy"
    },
    {
      "url": "https://www.premiergolf.com/about-us/",
      "text": "About Us | Premier Golf Click to call 866 260 4409 Call 866 260 4409 ( Mon-Fri 8:30-5:30pm ET ) Contact us Email Search Perform Search 0 $ 0 No products in the cart. Search Perform Search Contact us Click to call 866 260 4409 866 260 4409 Mon-Fri 8:30-5:30pm ET Toggle Menu USA Column Florida Orlando Tour TPC Sawgrass Ritz-Carlton Naples PGA National Innisbrook Bay Hill Trump Doral Alabama Robert Trent Jones Trail Column California Monterey Tour Pebble Beach Torrey Pines La Quinta Silverado Resort Oregon Bandon Dunes Sunriver Resort Juniper Preserve Arizona Scottsdale Column South Carolina Charleston Tour Kiawah Island Hilton Head Island Palmetto Dunes Wild Dunes Georgia Reynolds Lake Oconee Sea Island Utah St. George Column Wisconsin Wisconsin Golf Triangle Kohler Wisconsin SentryWorld Geneva National Resort Sand Valley Michigan Boyne Golf Pennsylvania Nemacolin Column Texas Texas Hill Country Tour PGA Frisco JW Marriott San Antonio Resort Horseshoe Bay Hawaii Kapalua Wailea Mauna Kea Mauna Lani UK&I Column Scotland St Andrews Carnoustie Kingsbarns Dumbarnie Ayrshire Tour Dundonald Prestwick Royal Troon Turnberry Column Edinburgh & East Lothian Tour Muirfield North Berwick Gullane Highlands Tour Cabot Highlands Royal Dornoch Aberdeen Tour Royal Aberdeen Trump International Column Ireland Northern Ireland Tour Royal County Down Royal Portrush Portstewart Castlerock Ardglass Dublin & The East Tour Portmarnock Royal Dublin The European Club Jameson Golf Links The Island Column South West Tour Ballybunion Adare Manor Lahinch Old Head Tralee Waterville North West Tour Enniscrone Rosapenna Ballyliffin Donegal Carne Column England England’s Golf Coast Tour Royal Birkdale Royal Lytham & St Annes Royal Liverpool Hillside Formby London & South East Royal St George’s Princes Royal Cinque Ports Sunningdale Swinley Forest Walton Heath The Berkshire St Georges Hill Europe Column Portugal Lisbon Tour Terras da Comporta Oitavos Dunes Penha Longa Praia D’El Rey Royal Óbidos West Cliffs Column Algarve Tour Monte Rei Quinta do Lago Ombria Vale do Lobo Vilamoura Ultimate Portugal Tour Column Spain Sotogrande & Andalucia Tour Valderrama Finca Cortesín La Hacienda Links La Reserva Real Sotogrande San Roque Camiral Catalunya Column Greece Athens & Costa Navarino Tour Costa Navarino France France Golf & Wine Tour 2026 Italy World Column Caribbean Dominican Republic Dominican Republic Tour Casa de Campo Puntacana Resort Eden Roc St. Regis Cap Cana Barbados Barbados Golf Tour Apes Hill Sandy Lane Column Mexico Cancún Tour Fairmont Mayakoba Pueblo Bonito Los Cabos Solmar Golf Links Diamante Cabo San Lucas Column Canada Canadian Rockies Tour Banff Springs Jasper Park Kananaskis Stewart Creek Silvertip Column Australia Australia Golf Tour Royal Melbourne Victoria Kingston Heath New South Wales Cape Wickham Barnbougle New Zealand New Zealand Golf Tour Cape Kidnappers Kauri Cliffs Te Arai Paraparaumu Column South Africa South Africa Golf Safari Arabella Fancourt Leopard Creek Pearl Valley St Francis Links Tournaments Augusta The Open The Ryder Cup The Solheim Cup WM Phoenix Open Pebble Beach & Super Bowl Vacations Column Hosted tours Canadian Rockies 2026 France Golf & Wine Tour 2026 Costa Navarino Odyssey Pro-Am 2026 South Africa Golf Safari Column Golf Packages Golf Vacation Packages Stay and Play Golf Packages About Blog Insights Careers Contact Home > About Us About Us Premier Golf – Delivering custom golf vacations since 1988 Headquartered in Alpharetta, Georgia, Premier Golf provides a tailored service to golfers looking to combine their passion for the game with their love of travel. We are experienced in providing tailored international and domestic golf vacation packages to various iconic locations around the world. Our experts share the same enthusiasm for golf as you, and we are committed to providing the best itineraries to suit your needs, saving you time and hassle when it comes to choosing your next golf vacation. Meet our team > Get in touch > Trusted team of golf enthusiasts Offering international golf vacations Years of experience planning tailored trips and packages Providing specialist advice to create your dream trip Offices and representatives located around the world Working in partnership with the PGA Premier Golf has worked in partnership with the PGA for more than ten years, serving as the PGA Magazine Ambassador Program’s official travel company. This is a program that provides exposure to some of the world’s greatest golfing destinations. Upon visiting, staying and playing, they will return to their home clubs with the experience and knowledge to create a return trip with their members. As the dedicated travel provider, we have served hundreds of PGA professionals and their members over the years. “We want you to know how much we enjoyed our Ryder Cup tour. We would highly recommend you to our friends.” A.P, California “The trip was absolutely fabulous! The personal service you provided gave it a special touch. You are at the top of our list when we consider any future trips” D.V, Arizona “I just wanted to say a huge thank you for helping us have such a wonderful trip. It really went smoothly and my members were happy which is my ultimate goal. Really, I am so in awe of the great care you take of your clients.” A.J. Brewster, MA Meet our team Our team is committed to providing excellent customer service and helpful information. Our specialists are experts in global golf destinations and can help you with any queries you may have, or information you require. We are friendly yet professional, giving you confidence that you will receive the best expertise, from booking to boarding and during your trip. We have dedicated teams at various destinations to assist you upon your arrival and to ensure you have a seamless golfing experience. Ann Mabry Managing Director Managing Director of Premier Golf, with over 30 years of experience in the Golf Travel industry. Ann’s wealth of knowledge in luxury travel is incorporated into each unique Premier Golf itinerary, ensuring our clients enjoy and experience the best each destination has to offer. Born in Scotland and raised in Ireland, many people love to call us just to hear her talk. Ann lives in Suwanee, Georgia with her husband David and son Douglas. Suzie Cusentino Director of Operations After several years in accounting and finance positions, Suzie joined Premier Golf in 2010 as our Accounting Specialist and now serves as our Director of Operations. A key factor in the seamless operations of Premier Golf, Suzie also oversees our accounting, sales reporting, technology and golf reservations system. Suzie lives in Atlanta, Georgia. Bill Hogan Business Development Manager Bill Hogan is based in Austin, TX and has over 30 years of experience in the luxury golf travel industry. He has played golf in 57 different countries to date, is a long-time panelist for GOLF Magazine World & USA Top 100 courses, and on the ranking panel for Platinum Clubs of the World. Tim Stolz Sales Manager Having worked in the golf industry and management for over 20 years, Tim joined Premier Golf in May 2023 to provide leadership and experience to the sales team. Living in Marietta, GA with his wife Sasha and 3 dogs, Tim is the father of two daughters who have adopted his passion for sports and travel. An avid golfer with a 4 handicap, he cites his round at the Old Course as the greatest golf experience of his life. A native of Ohio, Tim is a passionate fan of the Buckeyes, Reds and Bengals. Mike Eaton Marketing Director Having worked in agency-side marketing for over a decade, Mike joined Premier Golf in 2022 as Marketing Manager. With a passion for sports and travel and a background in premium branding and marketing, Mike is combining his expertize and experience across the marketing spectrum and passions, to develop Premier Golf’s marketing activity moving forward. Originally from the UK, Mike is now based in Michigan and is regularly at HQ in Alpharetta. Kara Guthrie Senior Golf Travel Specialist Kara joined Premier Golf in 2021 as a Domestic Golf Travel Specialist, providing expertise to our clients who wish to travel across the US. Now a Senior Golf Travel Specialist, Kara provides her expert knowledge to create the ideal bespoke trips to Premier Golf clients for Ireland, Spain, and Portugal. With a passion to travel, having traveled all across Europe, and the US, Kara loves to help others create travel memories of their own and live out their dreams. Kara is also a keen golfer, having played from a young age with friends and family. Connor Vogel Golf Travel Specialist Connor has an extensive travel background including the US, Mexico & Europe, and has been fortunate enough to attended each of the 4 major championships. He brings this wealth of knowledge and expertise to his role, ensuring Premier Golf clients enjoy the best possible golf travel experience. With a background in supply chain & logistics, Connor’s thorough planning and attention to detail lends itself to creating seamless golf experiences. Having worked in the golf industry for a number of years, including as an Assistant Pro and Caddie, Connor is able to bring a deep understanding of the game to his role. In addition to Golf, Connor is a passionate fan of UGA Football and the English Premier League (Come on Arsenal!). He lives in Atlanta, GA with his wife Anna. Carlee Talty Marketing Executive Carlee is a recent graduate from the University of South Carolina, where she found her passion for working in sports. She has versatile experience in the sports world, from working for a professional sports agency all the way to being on the sideline at Carolina football games. These opportunities help Carlee support Premier Golf’s brand as a whole. In her free time, Carlee enjoys playing pickleball and has picked up golfing. Stacey Mabry Administrative Assistant With over 16 years in customer service, Stacey is a pivotal part of the Premier Golf client experience. Heavily involved in communications from booking, until they return, she ensures a seamless process for all. Based in Atlanta, Georgia, she is one of many Bulldogs fans on the Premier Golf team, she is also an avid tennis player. At home, Stacey enjoys life with her two boys, husband, dog and cat. Tim Willerton Senior Golf Travel Specialist Tim has been a golf tour operator and caddied on the PGA and LPGA Tours. A devoted and passionate golfer, he’s well traveled with special expertise on Scotland and Ireland. Topping his bucket list is playing golf in South Africa. Euan Findlay Head of DMC Operations Euan has been with Premier Golf since 1999, managing all Scotland activities. Born and raised in Glasgow, Euan studied at University in Edinburgh before continuing his studies on a golf scholarship in Kansas. A Course Rater for Golf Digest, Euan has worked in the travel industry for Sheraton in Steamboat Springs, Colorado and Seabourn Cruise Line both onboard the ships and in London. Hugely popular with our clients, Euan now lives near St Andrews with his wife Hilary and three sons, Callum, Hamish and Corey. Allan O’Connor Ireland Operations Manager Our Ireland office in Killarney is managed by Allan O’Connor, who joined the Premier Golf Team in May 2021. Allan has a background in hospitality that stretches back almost 30 years. Out of college in 1993 he became Operations Manager at Kerry Coaches, one of Ireland’s largest private motorcoach operators and pioneers of golf tourism. Prior to taking up his current position he spent 7 years as Director of Sales at The Killarney Park, one of Ireland’s top 5-star hotels, where he spent 9 – 10 weeks a year in the US selling the hotel as perfect destination for all types of guests, but especially golfers. Billy Dunham Product Manager Growing up just miles from the Augusta National Golf Club, Billy’s exposure to golf came early in life when The Masters took over the city each year, and he still carries a (barely) single-digit handicap today. Billy recently completed bucket-list golf trips to Scotland and New Zealand, with golf including The Old Course, Muirfield and Tara Iti. A former airline employee and an avid traveler, he has a passion for aviation and touring the world. His logistics background lends itself to helping plan thoughtfully-created trips. He lives in Northeast Atlanta with his wife Jena and their cats, Gabby and Hazel. Connor Dorton Golf Travel Specialist Originally from Macon, Georgia, Connor moved to the Atlanta area in 2005. A keen golfer since the age of 8, he began working in the golf industry at 16, resulting in a deep and thorough knowledge of the game. Connor has traveled throughout United States to play and caddie at courses including Valhalla and Congressional, a recent highlight was working at the LPGA Drive-On Championship at Reynolds Lake Oconee in 2020. Connor now lives in Woodstock, he regularly caddies at the prestigious Peachtree Golf Club in Atlanta, and is an Atlanta Braves Fan. Chris Gurney Senior Golf Travel Specialist Chris Gurney makes his home in Belleair Florida and has been with Premier Golf since 2009.  Chris grew the company’s PGA Professional business as Director of Business Development and now works as a Golf Travel Specialist. Another of our staff who has traveled extensively, Chris specializes in highly customized group and club travel and escorts trips for our clients on a regular basis. Chris and his wife Daneen share a passion for the opportunity the global golf community offers to meet new people and share in their experiences. Graeme Fish Golf Travel Specialist Originally from North England, Graeme is now based in the Premier Golf St Andrews office. A member of the PGA of GB&I since 1994, Graeme now carries the advanced, accredited status of PGA Fellow Professional. Playing, Teaching, Coaching, Custom Fitting and organizing Golf Holidays are just some of the areas of expertise. With over 30 years in golf, Graeme has worked and played in several countries but specializes in Scotland, Ireland. Ben Baggett Operations Administrator Ben brings vast experience in the golf industry to the Premier Golf Team. He enjoyed over 20 years as a PGA Professional at clubs including; Atlanta National Golf Club, Druid Hills Golf Club, and Houston Lake Country Club. His awards during this time include the 1999 Georgia Section Assistant Professional of the Year. Ben has an Accounting Degree from Kennesaw State University and a Marketing Degree from Georgia College. With over 10 years in accounting roles, Ben now supports Premier Golf operations administration. Father of two, Ben now lives in Acworth and is often found enjoying music, his other great passion. Lucas Worth Sales Administrator Lucas is originally from Pittsburgh, PA, and brings over 12 years of customer service experience to the team. A graduate of West Virginia University, he has called Atlanta home for the past 9 years. Lucas is dedicated to providing exceptional service and building strong, lasting relationships with clients. Outside of work, he enjoys playing golf, spending time outdoors, and relaxing with his wife. He’s also a big Buffalo Bills fan! Jeff DeAngelus Golf Travel Specialist Originally from Rome, Georgia, Jeff has been in the Atlanta area for 25 years, since graduating from Georgia Tech. He brings over 25 years of sales/customer service experience to the team. When not working (or playing golf), he enjoys traveling or camping during any free weekends.  Born and raised to support Atlanta sports! Golf Tournament Experiences > Contact Us > Inquire now Please fill out the form and we’ll be in touch to help you. \" * \" indicates required fields First Name * Last Name * Phone Number * Email * Destination * Please select one USA UK&I Europe RoW Event Location * Location * Please select one Bandon Dunes Bay Hill Boyne Golf Charleston Geneva National Resort Hawaii Hilton Head Horseshoe Bay Innisbrook Juniper Preserve JW Marriott San Antonio Resort Kapalua Kiawah Island Kohler La Quinta Mauna Kea Mauna Lani Monterey Nemacolin Orlando Omni PGA Frisco Resort Palmetto Dunes Pebble Beach PGA National Lake Oconee Ritz-Carlton Naples RTJ Trail Texas Hill Country Torrey Pines Sawgrass Resort Trump Doral Scottsdale Sea Island Resort Sand Valley SentryWorld Sunriver Resort Wailea Wild Dunes Wisconsin Location * Please select one Scotland – Ayrshire Scotland – Edinburgh & East Lothian Scotland – Highlands Scotland – Aberdeen Scotland – St Andrews Northern Ireland Ireland – South West Ireland – North & West Coast Ireland – Dublin & The East England – North West Coast England – London & South East Location * Please select one Spain – Marbella & Sotogrande Spain – Catalunya Portugal – Lisbon & Area Portugal – Algarve Greece Italy France Location * Please select one Australia New Zealand South Africa Canada Dominican Republic Mexico Package * Please select one The Open 25 The Solheim Cup The Ryder Cup The Masters WM Phoenix Open How can we help you Contact Consent * I acknowledge and give my permission to be contacted by Premier Golf with regards to my request. * Newsletter consent Sign me up to receive the newsletter and latest news. This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Brand This field is hidden when viewing the form Agent This field is hidden when viewing the form VT Destination This field is hidden when viewing the form Created When Comments This field is for validation purposes and should be left unchanged. Submit You need to be 100% focused on your game to play a great round of golf by avoiding countless hazards on and off the course. That is why TravelSafe created a product specifically for the modern golfer – GolfSafe Travel Protection. Find out more > At Ship Sticks, we make getting your golf clubs to and from your destination easier than it’s ever been – allowing you to enjoy a hassle-free travel experience to anywhere in the world. Find out more > About Premier Golf Blog FAQ Contact Us Careers Terms & Conditions Privacy Policy Site Map International Destinations Australia Canada Caribbean England Greece France Ireland Italy Mexico Portugal Scotland South Africa Spain New Zealand USA Destinations Arizona Alabama California Florida Georgia Hawaii Michigan Oregon Pennsylvania South Carolina Texas Utah Wisconsin Tournaments The Open Augusta The Ryder Cup The Solheim Cup Stay connected with us: Go to Facebook Go to Instagram Go to Twitter Go to Youtube © 2025 Premier Golf. All rights reserved. Product Details × Loading product details..."
    },
    {
      "url": "https://www.mdislander.com/sports/golf/new-pro-at-causeway-club/article_754f831b-7a4a-5192-b26d-ef8f9cc518e9.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://www.pgadevelopment.hk/contact",
      "text": "Contact | PGA Development Hong Kong Golf Academy top of page About us            | Contact us FAQ            | HKGTA            | China     | PGA Development Center - Waterfall Fees Membership Coaches FAQs Contact Us Adult Golf Programs League / Societies / Clubs Youth Youth Lessons Camps China Summer Camps Overseas Camp 2023 Promotions Golf Programs PGA Superweekend - Green Grass Training Demo Day Events Parties + Events ISSFHK Golf Development Tournament 2024 PGA Junior Toptracer Golf League DSC Visit 2022 ISSFHK Golf Development Tournament 2022 OPEN DAY - May 28 School Programs KGV Toptracer Toptracer Competition More Use tab to navigate through the menu items. PGA Golf Academy - China Camps PGA Junior Golf Camps PGA Junior Group Class PGA Adult Group Class CONTACT US HONG KONG OPENING HOURS Effective from 29th August 2023 Monday - Thursda y & Sunday (except Public Holiday): 8am - 10pm Friday - Saturday & Public Holiday: 7am - 11pm ​ ​ Maintenance every Tuesday : Toptracer Premium Bay 9am - 11am, Standard Bay 11am - 1pm Operating Hours During Holidays in 2023 Severe Weather Arrangement ​ ADDRESS 2/F, Olympian City One, 11 Hoi Fai Road, Kowloon, Hong Kong 九龍海輝道11號奧海城一期2樓 ​ ​ Tel: +852 3526-0270 info@pacificpinegolf.com +852 9137-8386 ​ PGAWaterf all ​ ​ ​ CHINA CONTACT INFO Shenzhen Teaching Address: 703E, Block A, South Haide Building, Nanshan Street, Nanshan District, Shenzhen Tel: +86 (755) 2802 0888 EXT 88660 ​ Dongguan Teaching Address: Daping Linping Road, Tangxia Town, Dongguan, Guangdong Province (Dongguan Golf Academy) Tel: +86 (755) 2802 0888 EXT 88660 ​ Haikou Teaching Address: #368-1, Xindazhou Avenue, Fucheng Town, Qiongshan District, Haikou, Hainan Tel: +86 (898)6868 3888 EXT 615 88 ​ PGA YOUTH DEVELOPMENT（Nanshan Donglin Campus） No.1 Mission Hills Avenue, Longhua District, Haikou, Hainan Province, Shenzhen Nanshan District Modern City Huating Donglin Education 3rd Floor Golf Tel: +86 400 989 2558 ​ www.pgayouth.cn Tel: +86 (755) 2802 0888 EXT 88660 in fo@pacificpinesports.com ​ PGACHINA ​ @pgagolfacadem ychina 美国PGA高尔夫培训中心 ​联系我们 ​ 深圳泛太体育发展有限公司 深圳美国PGA学院地址（深圳总部）： 深圳市南山区南山街道南新路向南海德大厦 A 座 703E 深圳电话（总部） +86 (755)-28020888 转88660 ​ 东莞美国PGA学院地址（分公司）： 广东省东莞市塘厦镇大坪林坪路（东莞PGA高尔夫学院） 东莞电话（分公司） +86 769-87288888 转分机88660 ​ 海口美国PGA教学地址（分公司）： 海南海口琼山区府城镇新大洲大道368-1号（海口三公里国际高尔夫球会学院） 海口电话（分公司）+86 898-65503788 ​ 高尔夫培训中心（南山东林校区） 海南省海口市龙华区观澜湖大道1号深圳市南山区现代城华庭东林教育3层高尔夫 高尔夫培训中心电话（南山东林 校区）: +86 400 989 2558 ​ ​ ​ ​ REACH US / FEEDBACK CONTACT US If you have any questions, please check out our FAQs . Any additional questions or feedback, please reach out to us or simply share a feedback or two. We would like to hear from you! Let us know what you like, what could be improved on, or suggestions on products or services you would like to see us offer. ​ Thank you! ​ ~ Your Friends at PGA Development Hong Kong ​ First Name Last Name Email Phone Write a message Submit Thanks for submitting! PGA DEVELOPMENT CENTER - WATERFALL +852 3526 0270 +852 9137 8386 2/F, Olympian City One, 11 Hoi Fai Road, Kowloon, Hong Kong 九龍海輝道11號奧海城一期2樓 OUR BRANDS info@pacificpinesports.com ​ 2005 Block B, Xiangnan Ruifeng Commercial Plaza, Nanshan, Shenzhen, Guangdong, China +86-4009-909-500 ​ Suite 608, 41 Heung Yip Road, Wong Chuk Hang, Hong Kong SAR +852-3105-2913 CN HK CN GLOBAL CN & HK PacificPine Sports Limited ©2024. All rights reserved. The PGA of America name, logos, and marks are a trademark of The Professional Golfers’ Association of America. bottom of page"
    },
    {
      "url": "https://peakperformancegolfacademy.com/golf-instruction-about-us/",
      "text": "Golf Instruction – About Us | Peak Performance Golf Academy™ About Us Golf Lessons Adult Lessons Junior Lessons Private Lessons Summer Golf Camp Outings & Events Register Now Select Page Golf is a sport that you play for a lifetime. At Peak Performance Golf Academy we know that the game of golf requires as much from the physical body as it does the mind. Which is why we teach students of all ages how to achieve balance through learning the skills and techniques to improve their game. MEET THE INSTRUCTOR Rogerio Higa Owner & Titleist Certified Golf Instructor Born and raised in São Paulo, Brazil owner and golf trainer Rogerio Higa launched Peak Performance Golf Academy in 2015 with a mission to help students of the game improve their skills. Rogerio is Titleist Performance Institute Certified for Adult Level 1 and Junior Golf Levels 1 & 2. Over the last seven years Peak Performance Golf Academy has trained over 70 golfers including 50 junior athletes — 5 of which have gone on to become Junior PGA Tournament champions. Rogerio met his wife of 25 years Heidi Garis while living in Japan. They currently live in Sellersville where together they are raising their teenage daughter. MEET THE INSTRUCTOR Rogerio Higa Owner & Titleist Certified Golf Instructor Born and raised in São Paulo, Brazil owner and golf trainer Rogerio Higa launched Peak Performance Golf Academy in 2015 with a mission to help students of the game improve their skills. Rogerio is Titleist Performance Institute Certified for Adult Level 1 and Junior Golf Levels 1 & 2. Over the last seven years Peak Performance Golf Academy has trained over 70 golfers including 50 junior athletes — 5 of which have gone on to become Junior PGA Tournament champions. Rogerio met his wife of 25 years Heidi Garis while living in Japan. They currently live in Sellersville where together they are raising their teenage daughter. Our golf programs are designed to help you find your natural swing and improve your scores. Register Now Still have questions? Get in touch. Name Email Address Message 11 + 12 = Send Want the latest updates? Follow us. Follow Follow Follow 324 N Main St Unit 12, Sellersville, PA 18960 P 215 715 1307 About Us Our Team Registration Forms Contact US JUNIOR GOLF LESSONS ADULT GOLF LESSONS PRIVATE GOLF LESSONS SUMMER GOLF CAMP OUTINGS & EVENTS REGISTER ONLINE CAREERS PRIVACY POLICY TERMS & Conditions Get on the list Be the first to know about upcoming enrollment dates and events Thanks! Name Email Sign Up Get on the list Be the first to know about upcoming enrollment dates and events Thanks! Name Email Sign Up About Us Our Team Registration Forms Contact US JUNIOR GOLF LESSONS ADULT GOLF LESSONS PRIVATE GOLF LESSONS SUMMER GOLF CAMP OUTINGS & EVENTS REGISTER ONLINE CAREERS PRIVACY POLICY TERMS & Conditions 324 N Main St Unit 12, Sellersville, PA 18960 P 215 715 1307 Facebook X Instagram RSS ©2022 Peak Performance Golf Academy. All Rights Reserved."
    }
  ]
}