{
  "fuentes": [
    {
      "url": "https://annamariaislandchamber.org/directory/business-category/weddings-and-special-events/",
      "email": "info@annamariaislandchamber.org"
    },
    {
      "url": "https://www.royl.com/contact-us/",
      "email": "ir@royl.com"
    },
    {
      "url": "https://www.royl.com/contact-us/",
      "email": "ir@royl.com"
    },
    {
      "url": "https://royalpropertymgmt.com/about-us/",
      "email": "gina@royalpropertymgmt.com"
    },
    {
      "url": "https://royalpropertymgmt.com/about-us/",
      "email": "tracy@royalpropertymgmt.com"
    },
    {
      "url": "https://royalpropertymgmt.com/about-us/",
      "email": "wende@royalpropertymgmt.com"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "email": "info@clubspot.app"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "20jcowan@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "amarra@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "cmalone@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "epayamps@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "hmackenzie@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "info@envisionsuccess.net"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "kathleenhildebrand@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "kfarrier@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "mmurray@key.org"
    },
    {
      "url": "https://www.key.org/contactus",
      "email": "nanderson@key.org"
    },
    {
      "url": "https://royalkey.com/about-us/",
      "email": "info@royalkey.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "accounting@royalebusinessclub.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "businessdevelopment@royalebusinessclub.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "ethics@royalebusinessclub.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "humanresource@royalebusinessclub.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "info@royalebusinessclub.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "internationalaffairs@royalebusinessclub.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "sales@royalebusinessclub.com"
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "email": "sales@royalebusinessclub.combusiness"
    },
    {
      "url": "https://www.mikenormanrealty.com/island-info/golf-courses/key-royale-golf-club/",
      "email": "info@mikenormanrealty.com"
    },
    {
      "url": "https://thekeyhealthclub.co.uk/about-us/",
      "email": "enquiries@thekeyhealthclub.co.uk"
    }
  ],
  "mails": [
    "20jcowan@key.org",
    "accounting@royalebusinessclub.com",
    "amarra@key.org",
    "businessdevelopment@royalebusinessclub.com",
    "cmalone@key.org",
    "enquiries@thekeyhealthclub.co.uk",
    "epayamps@key.org",
    "ethics@royalebusinessclub.com",
    "gina@royalpropertymgmt.com",
    "hmackenzie@key.org",
    "humanresource@royalebusinessclub.com",
    "info@annamariaislandchamber.org",
    "info@clubspot.app",
    "info@envisionsuccess.net",
    "info@mikenormanrealty.com",
    "info@royalebusinessclub.com",
    "info@royalkey.com",
    "internationalaffairs@royalebusinessclub.com",
    "ir@royl.com",
    "kathleenhildebrand@key.org",
    "kfarrier@key.org",
    "mmurray@key.org",
    "nanderson@key.org",
    "sales@royalebusinessclub.com",
    "sales@royalebusinessclub.combusiness",
    "tracy@royalpropertymgmt.com",
    "wende@royalpropertymgmt.com"
  ],
  "nombre_sitio": "keyroyaleclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://annamariaislandchamber.org/directory/business-category/weddings-and-special-events/",
      "text": "Weddings and Special Events Directory - Anna Maria Island Chamber of Commerce Call us Anna Maria Island Chamber of Commerce Call today 941-778-1541 Facebook Twitter Instagram Youtube Pinterest LinkedIn Jobs Request Info Join Now MENU MENU Directory Where to Stay Where to Eat Where to Shop Fun & Leisure Weddings Special Events Home Services Professional Services Relocation Resources Community Resources View All Categories Events About our Island Events Community Events Chamber Events Submit Your Event Event & Scholarship Forms About Demographics, Climate, Wildlife Anna Maria Island History Volunteer Opportunities Job Listings Subscribe to Our Newsletter Community Coupons Island Trolley About the Trolley Track the Trolley Advertise on the Trolley Trolley Giving Back Program Membership Membership Account Become a Member Learn How We Can Help You Staff Ambassadors Board of Directors Contact Weddings and Special Events Home » Weddings and Special Events Keywords N/A Featured Gulf Drive Cafe & Kokonut Hut Venues Weddings and Special Events Our waterfront venue is one of Anna Maria Island’s most appealing sites for wedding celebrations. Located at the South end of the island, Gulf Drive Café overlooks sugar-white sand, the Gulf of Mexico’s turquoise-emerald waters and multi-colored horizon during sunset. Our team of experts will work with you on creating [...] Phone: 941-778-1919 Address: 900 Gulf Drive North ,  Bradenton Beach, FL 34217 Website: TheSunsetWeddings.com N/A Featured Love and Style Photography Photographers/Videographers/Framing Professional Services Weddings and Special Events Love and Style Photography is a small family owned, wedding and portrait photography team serving Anna Maria Island. We specialize in wedding photography, family photography, high school seniors, engagements, elopements, surprise proposals and maternity. Sunset at one of Anna Maria Island’s gorgeous beaches is our favorite photography backdrop. Our photography [...] Phone: 941-960-6485 Address: Serving Manatee & Sarasota Counties ,  Bradenton, FL, United States Website: LoveandStylePhotography.com N/A Featured Sandbar Restaurant Venues Weddings and Special Events Imagine walking down the aisle barefoot with your toes in the soft white sand. This is your wedding – island style – with every detailed handled for your perfect day. Phone: 941-778-0444 Address: 100 Spring Avenue ,  Anna Maria, FL 34216 Website: Sandbar.com N/A Featured Mote Marine Laboratory Aquarium Venues Weddings and Special Events Discover unforgettable venues at Mote Marine Laboratory & Aquarium for weddings, corporate events, and holiday celebrations. From elegant receptions to vibrant gatherings, find the perfect setting for your special occasion with us! Phone: 941-388-4441 Address: 1600 Ken Thompson Pkwy., Sarasota, FL , 34236 Website: Mote.org/venue-rentals N/A Featured Beach House Restaurant Venues Weddings and Special Events What could be more perfect than a wedding on the beach complete with your own private reception pavilion, superb dining, secret bridal suite, and personal concierge? Phone: 941-778-8712 Address: 200 Gulf Drive ,  Bradenton Beach, FL 34217 Website: BeachHouseRestaurant.com N/A Featured Chi Photography Photographers/Videographers/Framing Weddings and Special Events Hello All! I’ve been a local AMI photographer for over 15 years. I specialize in beach weddings, family portraits, and high school senior photos. I like to use a mix of natural light and flash to get a blend of styles. Thanks for supporting my small family business! Phone: 727-481-5737 Address: Serving Manatee, Sarasota, & Pinellas Counties , , United States Website: ChiPhotography.com N/A Featured gRUB Catering/Banquet Halls Restaurants/Bars/Delis/Markets Weddings and Special Events Where to Eat gRUB Tropical BBQ brings fresh flavors from familiar flairs to Anna Maria Island.  A fast, causal, modern atmosphere combined with a new spin on traditional “smoked BBQ” make gRUB the perfect “Place to Meat”! Phone: 941-900-2874 Address: 415 Pine Avenue ,  Anna Maria, FL 34216 Website: gRUBami.com N/A Featured Chef Melissa’s Kitchen Catering/Banquet Halls Weddings and Special Events Where to Eat Chef Melissa is an In-Home Personal Chef Service, providing the ultimate dining experience with a custom crafted menu full of creative & authentic foods sourced locally & from reputable markets. From intimate dinners to special events, let me elevate your dining expectations with memorable meals tailored to your taste preferences. Phone: 941-807-0844 Address: Serving Anna Maria Island, Longboat Key, Siesta Key, Sarasota, & Bradenton , , United States 34209 Website: SuncoastCuisine.com N/A Featured Mixon Fruit Farms Venues Weddings and Special Events The Pavilion at Mixon Farms, your dream wedding location, offers a vintage charm with a southern twist. Have your ceremony where the beautifully landscaped Koi pond and rock waterfall are your backdrop. When you are with Mixon you are with family! Phone: 941-748-5829 Address: 2525 27th St E ,  Bradenton, FL 34208 Website: ThePavilionatMixonFarms.com N/A Featured Plan My Beach Wedding Bridal Boutiques & Specialty Services Weddings and Special Events Weddings and Event Planning We specialize in beach wedding packages that include everything you need for your event: Arch, flowers, decorations, chairs, aisle decorations, Officiants, music, and much more. All of our packages are customizable, great for big or small weddings, anniversaries, vow renewals, and commitment ceremonies. We can help you chose the perfect [...] Phone: 941-302-4333 Address: Serving Anna Maria Island, Longboat Key, Sarasota, & Manatee County , , United States Website: PlanMyBeachWedding.com AMI Concert Chorus and Orchestra Community Resources Entertainment/Disc Jockeys Non-Profits/Churches/Clubs Weddings and Special Events Community chorus and orchestra performing live concerts for Anna Maria Island and beyond. Popular beloved and American classics, Broadway tunes and an invitation to the opera each season. AMICCO appears at Symphony on the Sand, a popular open air concert the second Saturday evening in November. Phone: 518-469-8516 Address: P. O. Box 1213 ,  Holmes Beach, FL 34217 Website: AMICCO.org Chuck Caudill Entertainment AKA The Tropicats Entertainment/Disc Jockeys Fun and Leisure Weddings and Special Events Live music/The Island’s most experienced DJ!  Specializing in Island-themed weddings, beach ceremonies! Phone: 941-778-5676 Address: 5804 Holmes Blvd ,  Holmes Beach 34217 Website: Chuck Caudill Entertainment C.I.T.I. Ministries Officiants Weddings and Special Events Call for more information Phone: 941-778-4579 Address: 503 70th St. ,  Holmes Beach 34217 Photography by Lisa E Photographers/Videographers/Framing Professional Services Weddings and Special Events Weddings and Event Planning Capture the memories of your West Coast Florida wedding, anniversary, vow renewal, birthday party or Gulf Coast beach vacation with photos by Lisa E. Phone: 941-243-1945 Address: Serving Anna Maria Island & all of Manatee County Website: PhotographyByLisaE.com Barefoot Weddings Officiants Weddings and Special Events Nancy J. Taussig, a Notary Public for the State of Florida since 1984, has officiated over 1,300 civil ceremonies at museums, country clubs, parks, resorts, gardens, private homes, backyards, on beaches or boats, and even McDonald’s and Starbucks. Phone: 941-952-1440 Address: Serving Manatee and Sarasota Counties ,  Sarasota 34236 Website: view our site Hometown Desserts Bakeries/Cakes/Desserts Weddings and Special Events Where to Eat Weddings and Event Planning Hometown Desserts creates custom wedding and special event cakes.  We also have delicious cakes, pies, scones, cupcakes and cookies available for purchase in our retail shop. Phone: 941-896-3167 Address: 507 B Pine Avenue ,  Anna Maria 34216 Website: view our site Blue Ribbon Events LLC Event Planners/Coordinators Weddings and Special Events Blue Ribbon Events promotes, organizes and coordinates boutique art/craft shows and unique festivals. Phone: 231-350-8277 Address: Serving Southwest Florida Website: BlueRibbonEvents.com Artist Series Concerts Entertainment/Disc Jockeys Weddings and Special Events Promoting excellence in live musical performances by presenting rising stars of the next generation to Florida’s Gulf Coast. Phone: 941-306-1200 Address: 1226 N Tamiami Trail, Ste 300 ,  Sarasota 34243 Website: artistseriesconcerts.org The Pops Orchestra Entertainment/Disc Jockeys Weddings and Special Events Comprised of more than 60 local musicians including some of our community’s finest professionals as well as non-professionals of all ages, reflecting the diversity of our audience and patrons. Committed to bringing music to all people. Phone: 941-926-7677 Address: P.O. Box 1622 ,  Sarasota 34230 Website: thepopsorchestra.org Chef Cheryl LLC Catering/Banquet Halls Weddings and Special Events Where to Eat Enjoy a personalized gourmet dining experience in the comfort of your own home. Every meal is made from scratch using high-end ingredients, sourced fresh from local farmer’s markets giving you the highest quality meal. Phone: 941-447-7381 Address: Serving Manatee & Sarasota Counties & Surrounding Areas Website: PersonalChefCheryl.com Mike Sales Presents, LLC Entertainment/Disc Jockeys Fun and Leisure Weddings and Special Events Mike Sales is one of the areas more sought after singers and musicians. Whether you’re planning a wedding, party or festival, for dining or dancing, Mike’s approach to Standards, Rock, Country and Beach Favorites will enhance any event. Phone: 941-448-5798 Address: P.O. Box 1231 ,  Anna Maria 34216 Website: MikeSalesSings.com Sheryl Renee Portraits Photographers/Videographers/Framing Weddings and Special Events The created portraits and documentation of ones memories is a priceless, precious gift that many of the families I photograph for treasure. Phone: 864-884-3380 Address: Serving Anna Maria, Longboat Key, Manatee & Sarasota Counties Website: SherylReneePortraits.com Key Royale Club, Inc Venues Weddings and Special Events A member-owned equity club, offering very affordable Summer Golf Memberships through October. Call 941.778-3055 ext 206 for information. Phone: 941-778-3055 Address: 700 Key Royale Dr ,  Holmes Beach 34217 Website: keyroyaleclub.com Gulf Beach Weddings Event Planners/Coordinators Professional Services Weddings and Special Events Just bring your Marriage License and Rings to the Ceremony – we take care of the rest! Phone: 941-479-6039 Address: 6655 Gulf Blvd ,  St Pete Beach 33706 Website: view our site Blooms By The Beach Florist Weddings and Special Events Your Island Florist! Weddings, elopements, anniversaries, custom gift baskets, wire service around the world, $5 delivery on the island. BBTB has lovely relationships with resorts on the island as well, so helping you plan your event will be a snap! Phone: 941-778-2555 Address: 2501 Gulf Drive N ,  Bradenton Beach 34217 Website: bloomsbythebeach.com Anna Maria Island 5313 Gulf Drive, Holmes Beach, FL 34217 941-778-1541 info@annamariaislandchamber.org Facebook Twitter Instagram Youtube Pinterest LinkedIn © Anna Maria Island Chamber of Commerce . All rights reserved. Digital marketing by Two Oceans Digital . Site Map | ADA Website Compliance | Privacy Policy Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.royl.com/contact-us/",
      "text": "Get In Touch With Royale Energy Inc - Contact Info - Royale Energy, Inc.  619-383-6600  ir@royl.com Follow Follow Follow Welcome Overview History Matrix Merger and RMX Resources Operations Alaska Acreage Summary Management Team Board of Directors News Media Releases Financials Annual Report & Proxy Investor Reports Investors Investments Why Invest in Wells Operations Video about Royale Governance Contact Us  619-383-6600  ir@royl.com Follow Follow Follow Welcome Overview History Matrix Merger and RMX Resources Operations Alaska Acreage Summary Management Team Board of Directors News Media Releases Financials Annual Report & Proxy Investor Reports Investors Investments Why Invest in Wells Operations Video about Royale Governance Contact Us k CONTACT INFO PHONE: 619-383-6600 INVESTOR RELATIONS: 800-447-8505 EMAIL: IR@royl.com Royale Drilling 2019 Rio Vista W CORPORATE ADDRESSES Royale Energy, Inc. Marketing, Finance + Administrative 1530 Hilton Head Rd Suite 205 El Cajon CA 92019  EMAIL US General Inquiries: IR@royl.com Marketing and Partnership Opportunities: IR@royl.com Royale Drilling 2020 Permian Basin Sign up to receive our newsletter When you sign up for our mailing list, you will receive updates on Royale Energy and our current offerings. Sign Up Now ABOUT US Royale Energy, (the Company) explores, develops, produces and markets crude oil and natural gas. Its assets include a diverse portfolio of wells throughout the United States. ⎯ Read More CONTACT INFORMATION PHONE: 619-383-6600 INVESTOR RELATIONS: 800-447-8505 EMAIL: IR@royl.com OTCMKTS:ROYL STOCK QUOTE © Royale Energy, Inc. | TEAMBLU Follow Follow Follow"
    },
    {
      "url": "https://royalpropertymgmt.com/about-us/",
      "text": "About Us - Royal Property Management Group, Inc. Home Maps Parallax Video Video Fullscreen Sliders Splash Video Fullscreen Slider Fullscreen Image Fullscreen Listing Listing v1 Listing v2 Listing v3 Listing v5 Listing v6 With Content Elementor Half Map Half Map – Search v1 Half Map – Search v2 Half Map – Search v3 Listing With Map Parallax Banner Video Banner Video Banner Fullscreen Sliders Property Single Property v1 Single Property v2 Single Property v3 Single Property v4 Single Property v5 Single Property v6 Property Layout Full Width Property Landing Page Single Property Tabs v1 Single Property Tabs v2 Property EU Energy Class Multi Units / Sub Lisitng Property Nav on Scroll Pages Agent Agent Profile Agencies Contact About Us Property Status For Rent For Sale Property Type Apartment Single Family Home Villa Property City Miami Los Angeles Property Features Swimming Pool WiFi Gym Laundry Blog 404 Page Elementor Properties Carousels Properties Cards Forms Testimonials Others Searches Search v1 – Header Search v1 – Below Banner Search v2 – Header Search v2 – Below Banner Search v3 – Header Search v3 – Below Banner Banner Search Search Widget Create a Listing Login Favorites 0 Home About Us News Portfolio Home About Us News Portfolio Facebook-f Instagram Linkedin-in Clients Careers Contact Clients Careers Contact Search Facebook-f Instagram Linkedin-in Home About Us Portfolio Clients Careers Contact Home About Us Portfolio Clients Careers Contact About Us Redefining Affordable Housing Royal Property Management Group (formerly Tarantino Property Management Company), was established in 1995 for the purpose of managing affordable housing communities for non-profit organizations. As the managing agent, we are responsible for HUD compliance and serve as the liaison between the ownership entity and HUD. We attend all board meetings, prepare Section 8 contract renewals, prepare annual operating budgets, submit all monthly financial reports, prepare Useful Life Analysis, ensure Fair Housing Compliance, coordinate REAC Inspections, attend Management & Occupancy Reviews (MOR’s), submit Budged Based and OCAF rent increases and Reserve for Replacement withdrawals. For our affordable housing portfolio, we pride ourselves in providing full service asset management for our owners. In this capacity, we have been instrumental in refinancing loans, coordinated major rehabilitation projects, participated in converting buildings into Tax Credit sites and applied for federal service coordinator grants on behalf of our clients for all of our senior buildings. Many of our sites offer transportation services, computer learning centers, ESL classes, food distribution, exercise classes, case management, arts & crafts and monthly socials. In addition, we have added for profit management to our portfolio as well as commercial sites. Our Mission Royal Property Management strives to provide high-quality affordable housing in Southern California communities. We specialize in providing resident services such as computer learning centers, transportation, on-site service coordinators, and English as a second language classes. We preserve older properties, while maintaining Superior Management Review and REAC scores. We work in partnership with our non-profit ownership entities to enhance their communities Our Team WENDE KING CEO | President License | 00900729 Wende King, founder, serves as President and CEO of Royal Property Management Group, Inc. Wende has been in the property management field for 35+ years. She is a licensed real estate broker, Fair Housing Specialist, (FHC), Certified Professional of Occupancy (CPO) and a National Compliance Professional Executive (NCPE). Her extensive knowledge in managing affordable housing and her experience in refinancing and rehabbing multi-family units earned her a Secretary’s Commendation Award for Top 50 in the Nation for Best Practices. Wende was a regional supervisor for two local management companies from 1986-1995 and then founded Royal Property Management Group in 1995. Wende has steadily grown the company through client referrals. In addition to operating the management company, Wende served on the board of AHMA (Affordable Housing Management Association) in the capacity of Treasurer. Wende is very hands-on and visits the sites Royal manages personally. JIM KING CFO License | 00900729 Jim King is a principal of Royal Property Management Group Inc. and holds the position of Chief Financial Officer and Vice President. Jim has an extensive background in the real estate and finance industry. He is a licensed real estate broker and received a Bachelor’s and Master’s Degree in finance. Jim manages the financial decisions of the company and negotiates vendor/client contracts as well as overseeing the property budgets and reports. ANTHONY BATTAGLIA Controller Anthony has been providing strong fundamentals in accounting, operations, presentations, and leadership skills acquired through 14 years of being a Controller for Royal. He has worked in this highly regulated field involving multiple business structures revolving around the low-income housing management industry. A background of restructuring accounting systems and procedures thereby strengthening the entities’ ability to capitalize on decisions through the use of more adequate and realistic data. An effective communicator and agent who has built relationships with both internal and external contacts (i.e. owners, the board of directors, outside auditors, Portfolio Managers, and Property Managers). Provides various tasks and information accurately and detailed to multiple entities and their various owners. Earlier experience with a medium sized public accounting firm adds a strong knowledge base of GAAP Reporting, outside audit support, and financial report writing in a fast-paced, multitasking environment, where profitability is based on budget. AIXA MOEN Chief Operating Officer Mrs. Aixa Moen has more than 25 years’ extensive experience in multifamily real-estate management with first-hand experience with various affordable housing programs, new property development and acquisition lease-ups of multiple communities within Southern California. Mrs. Moen joined Royal Property Management Group in 2016, as a Regional Compliance Director. Her focus is on analyzing property performance, maximizing productivity and accuracy as well as ensuring client expectations and needs are met and exceeded. Additionally, Mrs. Moen assist in implementing structured organization, monitoring all aspects of on-site affordable compliance and ensure programs development meets federal regulations and state requirements and oversees regional compliance team and onsite admin staff as well.  Mrs. Moen holds an Associate’s Degree in Business Leadership. In addition, Mrs. Moen has received designations for National Compliance Professional Designation (NCP®), Housing Credit Certified Professional (HCCP®), Specialist in Housing Credit Management (SHCM®), Blended Occupancy Specialist (BOS®), and Certified Professional of Occupancy (CPO®), Advance Certified Professional of Occupancy (ACPO), Management and Occupancy Review Specialist (MORS®), and Fair Housing Compliance™ (FHC™). GINA SABELLA Human Resources | Payroll Director Gina Sabella is our HR Director with over two decades of experience in employee management. Gina manages the recruitment and selection process for all Royal departments, screens potential new applicants, interviews and hires employees, onboards employee information, enrolls team members in their benefits programs, and schedules specialized training and seminars for each department. She also handles all aspects of our Payroll Department. Gina supports the human factor in the company by devising strategies for performance evaluation, staffing, training and development, etc. She develops and implements HR strategies and initiatives aligned with our overall business strategy. She is also responsible for bridging management and employee relations by addressing demands, grievances, and other issues. She is fair and honest and promotes a team-friendly work environment. Gina encourages all Royal team members to come to her with any work-related questions or concerns and is always happy to help. ROSIE TERRIQUEZ Regional Compliance Manager Ms. Rosie Terriquez has more than 27 years’ experience working in the affordable housing industry involving multi-family, Tax Credit, BOND, HOME, CalHfa, and various other housing programs. Ms. Terriquez joined the Royal Team in 2023 Her focus has been on maximizing productivity and compliance for more than 800 units she oversees, while continuously supporting and training the 39 on-site employees. She has firsthand knowledge of the onboarding of new sites along with the lease up process for new construction and acquisition rehabs. Ms. Terriquez holds an Associate Degree in Business Management in addition to having received certifications for Site Compliance Specialist (SCS), Certified Apartment Manager (CAM), Certified Apartment Portfolio Supervisor (CAPS) LOU ANN MAKIHELE Occupancy Compliance Director Lou Ann Makihele, Owner of Audit Ready Consulting a consulting business specializing in HUD and Section 42 LIHTC compliance. Active Designations: CPO, ACPO, AHM, SCHM, HCCP, MORS, EIV, FHC, RAM. With over 35 years of property compliance experience, Lou Ann provides owner/agents with high level consultation and successful development and management of HUD program properties. Her detailed approach to compliance monitoring will ensure your development meets federal regulations and state requirements. Additionally, her knowledge and years of experience will provide careful protection for payment of Section 8 Vouchers. Lou Ann is an approved trainer for nationally recognized industry organizations such as AHMA-PSW and AHMA-NCH. She provides training in EIV, HUD’s secure systems, file organization, basic and advanced occupancy, fair housing, and audit preparation. Lou Ann assists in training of new management and leasing staff to ensure proper compliance with HUD requirements. PETER BRONSDON Regional Staff Accountant Peter joined Royal in 2022. Peter graduated from Northeastern University in 2003 with a bachelor’s degree in Business Administration with an emphasis in accounting. He oversees the daily accounting for multiple properties at Royal. He prepares, analyzes and reports each property’s financial statements with thorough explanations to the owners on a monthly, quarterly and annual basis. He communicates and negotiates with vendors regarding costing of bid proposals and contracts. Prior to joining the Royal team, Peter was an auditor with two CPA firms since 2003. He conducted nonprofit audits in accordance with OMB’s Uniform Guidance as well as the affordable housing industry. In addition, he also prepared nonprofit information returns and partnership income tax returns. Candy Salas AHM, CPO Compliance Specialist Candy Salas has 24 years of property management and compliance experience in the multi-family affordable housing industry.  She currently oversees 853 units, provides staff support, and is an important part of our management team.  She conducts on-site inspections to monitor deficiencies and implements corrective action plans. In addition, she is responsible for site staff training and implementing HUD regulations. Her detailed approach to compliance monitoring ensures that the properties we manage achieve successful audit results. Ms. Salas joined Royal Property Management Group, Inc., in 2022 and holds CPO and AHM industry designations. TRACY SHERMAN Corporate Manager Tracy Sherman is responsible for overseeing all accounts payable and processing of payments in a timely manner. Tracy ensures all vendors meet our corporate minimum insurance requirements. She processes all year-end 1099’s and 1096 transmittals.  Tracy has been with Royal since 2016 and has specialized in accounts payable for 25+ years. DAVID BURGESS Chief Maintenance Officer David has been working with Royal since 2007, initially as a Maintenance Supervisor and currently as a Regional Maintenance Supervisor overseeing our San Diego portfolio. David has extensive experience with rehab and works with contractors to perform in-place rehabilitation. David performs all pre-REAC inspections, trains site personnel, assists with the maintenance portion of budgets, and is the Construction project liaison for portfolio properties. David has extensive experience in Electrical Maintenance, Plumbing Maintenance, Roofing Maintenance, and Construction Maintenance. David maintains our sites pristinely and always achieves a superior REAC score. NICOLE TARANTINO Regional Compliance Manager Ms. Nicole Tarantino has over 10 years of experience working within the multi-family/senior/disabled, affordable housing industry, with programs including but not limited to HUD, Tax Credit, CRL, VHHP, MHP, and HCD. She has grown within the Royal Property Management Company, initially beginning her career as an administrative assistant at the corporate office, then onto a Property Manager at multiple Royal communities, and ultimately coming back full circle to the corporate office as a Regional Compliance Manager. Ms. Tarantino has received TCS accreditation and holds a Bachelor of Science degree in Real Estate and Development at UCSD. EDWARD SNELGROVE Staff Accountant At the corporate office of RPMG, Eddie has filled the position of Accounts Payable Clerk since November 21st, 2022. He began his educational journey at Mesa Community College before transferring to Humboldt State University, where he received his B.S. in Accounting. He has taken on the responsibility of processing accounts payable invoices, assisting in preparing reports, and supporting the RPMG corporate office in a variety of ways. Our Properties Family Rentals View Listings Senior Rentals View Listings Supportive Housing View Listings Commercial View Listings Redefining Property Management Royal Property Management Group, Inc. Tel. 858. 312. 8170 Fax 858. 312. 8176 16456 Bernardo Center Drive, Suite 200, San Diego, CA 92128 License #01222095 © 2025 Site by Epicenter Advertising & Marketing Communities Served We are based in San Diego, California, serving San Diego, Orange County, Riverside and Los Angeles Counties. Including Downtown San Diego, North Park, Hillcrest, Normal Heights, University Heights Chula Vista, Lakeside, El Cajon, Clairemont, Escondido, Riverside, Los Angeles Complete property list Email us: Leasing Inquiries: Please contact each property directly. The direct contact Emails can be found on each property page in the Portfolio Section https://royalpropertymgmt.com/portfolio/ Administrative: Tracy@royalpropertymgmt.com Careers: Gina@Royalpropertymgmt.com Property Owners/Investor Inquiries: Wende@Royalpropertymgmt.com Site by Epicenter Advertising & Marketing ©2025 Compare listings Compare Close Login × Remember me Lost your password? Login User registration is disabled for demo purpose. Reset Password × Please enter your username or email address. You will receive a link to create a new password via email. Get new password Get in touch with us, to Inquire About Property Owners / Investor Submit"
    },
    {
      "url": "https://www.clubspot.app/contact-support",
      "text": "ClubSpot Club Management - Contact Us top of page Home Solutions Custom Club App Membership Management Online Club Lotto Data Security Club Communications Group Messaging Club Events Ticketing Customer Stories Contact Contact - Support Contact - Sales Blog Pricing Meet The Team How To Setup Guide Admin Tutorials User Tutorials More... Use tab to navigate through the menu items. Get a Demo Login Need support? Get in touch! For the quickest response time for general customer support or ticketing queries, contact us via our  live chat button at the bottom right of the screen. You can also reach us using the support email and contact number below where a member of our team will get in touch with you as soon as possible. Live Chat via orange button in right corner below Quickest Response ​ ​ Email: support@clubspo t.app Mob: 087 032 2866 ​ CAVAN DIGITAL HUB, KILMORE BUSINESS PARK, DUBLIN RD. CAVAN Enjoying your experience with ClubSpot? We'd love to hear from you! Click here to leave us a review! Company Home About Us Contact Us Careers FAQs Privacy Policy GDPR Club Referrals Terms of Service Contact Email: info@clubspot.app Mob: 087 032 2866 Stradone, Cavan, H12 Y066 © ClubSpot 2022 All Rights Reserved bottom of page"
    },
    {
      "url": "https://www.key.org/contactus",
      "text": "Key Program Inc. | Contact Us Site Navigation Close menu Call Email Visit About Us Our History Board of Directors Leadership Events Fundraising Fundraising Agencies Annual Report Program Successes Programs Community-Based Programs Residential Programs Outpatient Clinical and Behavioral Health Programs by Location Children’s Charter About Children's Charter Clinic Location, Hours and Multi-Disciplinary Team Outpatient Services Project WCTAI The Three Legged Stool Program (3LS) Forensic Services Resources Online Payment Information Privacy Notice Employment Employment Opportunities Professional Development Benefits Internships & Scholarships Internship Programs Applying for an Internship Scholarship Programs Contact Us Our Locations Executive/Administrative Office Western MA Key Central MA Key Southeast MA Key Northeast MA Key Berkshire Key Rhode Island Key Children's Charter Division Search Search Site Search Site Search Submit Search Close search window Skip to content Select your language English Español Português (Brasileiro) Join Our Team Donate Menu About Us Our History Board of Directors Leadership Events Fundraising Fundraising Agencies Annual Report Program Successes Programs Community-Based Programs Residential Programs Outpatient Clinical and Behavioral Health Programs by Location Children’s Charter About Children's Charter Clinic Location, Hours and Multi-Disciplinary Team Outpatient Services Project WCTAI The Three Legged Stool Program (3LS) Forensic Services Resources Online Payment Information Privacy Notice Employment Employment Opportunities Professional Development Benefits Internships & Scholarships Internship Programs Applying for an Internship Scholarship Programs Contact Us Our Locations Executive/Administrative Office Western MA Key Central MA Key Southeast MA Key Northeast MA Key Berkshire Key Rhode Island Key Children's Charter Division Search Search Contact Us Our Executive/Admin Office Key Program, Inc. 2000 West Park Drive, Suite 250 Westborough, MA 01581 Phone: 508-877-3690 Fax: 508-366-9524 For Employment Opportunities Location Contact Phone Email Berkshire MA & Western MA Area (Pittsfield, Springfield, Greenfield) John Cowan, Western Recruiter/Trainer (413) 781-6485 Email Central MA Area (Worcester) Ashley Marra, Recruiter/Trainer (508) 753-6263 Email Children's Charter Division (Waltham Area) Kathleen Hildebrand, Administrative Supervisor (781) 894-4307 Email Northeast MA Area (Methuen, Lawrence, Lowell) Howard Mackenzie, Recruiter/Trainer (978) 685-0194 Email Rhode Island (Providence and Greater Rhode Island) Evelyn Payamps, Recruiter/Trainer (774) 388-8973 Email Southeast MA (Attleboro, Fall River, New Bedford, Plymouth, Wareham, Taunton) Evelyn Payamps, Recruiter/Trainer (774) 388-8973 Email For Fundraising Please contact Kelly Farrier-Glennon, Executive Assistant to the President/HR Administrator (508) 877-3690 Email Kelly For Scholarships Please contact Susan Barry, Benefits and Workers Compensation Supervisor (508) 877-3690 Email Susan For Program Information/Administration Please contact Michael Murray, Chief Operating Officer (508) 877-3690 Email Michael For Recruitment and Training Please contact Carol Malone, Recruitment & Training Manager or Nicolette Anderson, Communications Coordinator and Recruitment Assistant (508) 877-3690 Email Carol Email Nicolette Contact Us Our Locations Executive/Administrative Office Western MA Key Central MA Key Southeast MA Key Northeast MA Key Berkshire Key Rhode Island Key Children's Charter Division Executive Office Key Program, Inc. 2000 West Park Drive, Suite 250 Westborough, MA 01581 P:\n\t\t\t\t\t\t\t\t508-877-3690 F:\n\t\t\t\t\t\t\t\t508-366-9524 Regional Offices Berkshire MA Central MA Northeast MA Rhode Island Southeast MA Western MA Children's Charter Division - Waltham, MA Connect Facebook Twitter LinkedIn Instagram ©\n\t\t\t\t\t\t2025\n\t\t\t\t\t\tKey Program, Inc. | Privacy | Site Map | ADA Policy"
    },
    {
      "url": "https://royalkey.com/about-us/",
      "text": ""
    },
    {
      "url": "https://www.royalebusinessclub.com/contact/",
      "text": "Contact — Royale Home Royale Blogs About Us Vision and Mission Company Policies History About the Chairman The Management Registrations SEC Registration FDA Registration Products Wellness Beauty Personal Care Package Deals Contact Talk to Us Find Us Login Cart Let's talk about your success! Emails General Inquiries & Concerns: info@royalebusinessclub.com I.T Concerns: support@royalebusinessclub.com Sales CRMS/RPC & Shipment of Royale Products: sales@royalebusinessclub.com Business Development Concern: businessdevelopment@royalebusinessclub.com International Subsidiaries & Distributorship Application: internationalaffairs@royalebusinessclub.com Accounting Concerns: accounting@royalebusinessclub.com Ethics Concern: ethics@royalebusinessclub.com HR Concerns: humanresource@royalebusinessclub.com Contact 0234102340, 0283740834, 0283740835, 0283740837 Work Hours Monday-Friday | 12 PM — 9PM Saturday | 12 PM — 10 PM Sunday | 1 PM — 8 PM Head Office 1363A Royale Centre, West Triangle, Quezon Avenue, Quezon City, Philippines support@royalebusinessclub.com"
    },
    {
      "url": "https://www.mikenormanrealty.com/island-info/golf-courses/key-royale-golf-club/",
      "text": "Key Royale Golf Club on AMI | Mike Norman Realty Skip to main content 800-367-1617 My Rentals Recently Viewed (0) Rentals Browse by Type Pet-Friendly Rentals with a Pool Waterfront Group Rentals Beachfront Rentals Browse by City Anna Maria Island Bradenton Beach City of Anna Maria Cortez Holmes Beach Longboat Key Browse By Bedrooms 1 Bedroom 2 Bedrooms 3 Bedrooms 4 Bedrooms 5 Bedrooms 6 Bedrooms Featured Rentals Rentals List Rentals Map All Rentals Sales Our Listings Search All Sales Meet Our Team Island Info About Meet Our Team Property Management FAQ Terms & Conditions Contact Key Royale Golf Club Key Royale Golf Club is the only golf course on Anna Maria Island. The course is private, with memberships offered both annually and seasonally. Designed by Jim Cochran, this 9-hole, par-32 executive length course is designed for every level of golfer. Located in Holmes Beach on Anna Maria Island, Key Royale Golf Club lies between Sarasota Bay and Bimini Bay at 700 Key Royale Drive. Amenities at Key Royale Golf Club include chipping and pitching area, two hitting cages, large putting green, lessons, clubhouse, and restaurant/snack bar/bar. Chef Robert Wasley is known for cooking some of the best food on the island! Breakfast and lunch are available Monday through Saturdays. There is an expanded breakfast menu on Sundays. Dinners are available Wednesday, Thursday, Friday and Saturday. Tuesday nights are fun with a casual Pub-Night menu and trivia! Social activities at the club include Bridge, a Book Club, Monthly Mixed Scramble, Luncheon Club Parties, and Clubhouse Events ( Happy Hour, Fashion Show, etc. ), and Special Theme Dinners. For more information, please visit: www.keyroyaleclub.com Or call: (941) 778-3055 Plan Your Stay Contact Mike Norman Realty today to book your Anna Maria Island vacation rental! View All Rentals Plan Your Anna Maria Island Vacation! View All Rentals Anna Maria Island Rentals See All Holmes Beach Rentals See All Bradenton Beach Vacation Rentals See All Waterfront Rentals See All Recent Posts A Nature Lover’s Retreat: 7 Nature Preserves Near Anna Maria Island Meet The Islanders For Clean Water Connect With Nature On An Eco Tour During Your AMI Vacation A Foodie’s Guide To Our Favorite Bradenton Beach Restaurants 4 Amazing Breakfast Restaurants In Bradenton Beach Categories Activities & Things To Do Area Attractions Beaches & Parks Events Restaurants & Dining Shopping & Rentals Mike Norman Realty, Inc. 3101 Gulf Drive Holmes Beach, Florida 34217 800-367-1617 941-778-6696 Owner Login Rentals Waterfront Rentals Pet-Friendly Rentals Rentals with a Pool Island Rentals Rentals A-Z Quick Search Properties For Sale About Us Island Info Rentals Map Newsletter Email * Email This field is for validation purposes and should be left unchanged. Δ © Copyright 2025  Mike Norman Realty Powered by Yapstone Inc. For disclosures and information about consumer complaints regarding your payments, please see: https://www.yapstone.com/legal/licenses Website Accessibility | Privacy Policy Website managed by RealTech Webmasters This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. ← Close Menu Rentals Browse by Type Pet-Friendly Rentals with a Pool Waterfront Group Rentals Beachfront Rentals Browse by City Anna Maria Island Bradenton Beach City of Anna Maria Cortez Holmes Beach Longboat Key Browse By Bedrooms 1 Bedroom 2 Bedrooms 3 Bedrooms 4 Bedrooms 5 Bedrooms 6 Bedrooms Featured Rentals Rentals List Rentals Map All Rentals Sales Our Listings Search All Sales Meet Our Team Island Info About Meet Our Team Property Management FAQ Terms & Conditions Contact"
    },
    {
      "url": "https://thekeyhealthclub.co.uk/about-us/",
      "text": "About Us | The Key Health Club Skip to content Video Tour (47secs) enquiries@thekeyhealthclub.co.uk 0115 846 3414 Gym Fitness Classes Swimming Swimming Lessons Membership About Us Beauty Rooms Baby and Child Activities Physio Studio and Room Hire Café Contact Video Tour Gym Fitness Classes Swimming Swimming Lessons Membership About Us Beauty Rooms Baby and Child Activities Physio Studio and Room Hire Café Contact So much more than just a gym An independent club offering a warm welcome and great facilities JOIN NOW! FREE TRIAL About Us The Key Health Club is a family-run, independent business, established in July 2017. It was purchased after a long association of swimming pool hire for our original swim school business Puddle Ducks. When the health club business came up for sale, we jumped at the chance to buy it, to secure a permanent base for our swimming classes, whilst relishing the opportunity to redevelop the Club into a modern, welcoming place for the local community to enjoy and stay healthy. We upgraded all the facilities and the equipment within the Club to restore it to its former glory, while retaining its inclusive and friendly heritage. From its' initial days as a Squash Club and setting for many birthday parties and functions through to the creche, call centre, exercise classes in the squash courts! Our members now enjoy a large well-equipped Gym, warm Swimming Pool and Sauna or their favourite Class in our studio, with flexible, great value memberships to suit all needs and pockets. The environment you work-out in is key to achieving your fitness potential, and so we were keen to nurture a non-intimidating, social atmosphere, with excellent support from our team of experienced instructors. Our cosy Café is the heart of the Club for that important post workout barista coffee and chat which is a huge part of being a member at The Key where everyone is a name, not just a number. We invite you to come and discover our fantastic facilities and find out why we are so much more than just a gym! Looking forward to seeing you soon. Phil & Liz Gabriel and all The Key Health Club team Our Team With a guaranteed warm welcome and a friendly smile every time! Harrison Manager Bayan Assistant Manager Andrea Marketing Vicky Fitness Instructor Zoe Fitness Instructor Maggie Cafe Supervisor Rachel Membership Emma Leisure Assistant Olga Leisure Assistant OPENING HOURS Monday to Friday: 7.30am to 8.00pm Saturday and Sunday: 8.00am to 4.00pm CONTACT Bunny Lane, Keyworth, NG12 5JU 0115 846 3414 enquiries@thekeyhealthclub.co.uk MEMBERSHIP All membership options include full access to all facilities and classes from a single visit to 12 months. No joining fee or any additional charges! JOIN NOW! Privacy Policy Terms & Conditions Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Scroll To Top"
    }
  ]
}