{
  "fuentes": [
    {
      "url": "https://www.myempireenergy.com/contact",
      "email": "sales@myempireenergy.com"
    },
    {
      "url": "https://www.yahoo.com/news/vero-pride-hosts-june-pride-132230347.html",
      "email": "app-store-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/vero-pride-hosts-june-pride-132230347.html",
      "email": "gianna.montesano@tcpalm.com"
    },
    {
      "url": "https://www.yahoo.com/news/vero-pride-hosts-june-pride-132230347.html",
      "email": "google-play-icon@3x.png"
    },
    {
      "url": "https://www.yahoo.com/news/vero-pride-hosts-june-pride-132230347.html",
      "email": "u003ebillhimself@yahoo.com"
    },
    {
      "url": "https://www.yahoo.com/news/vero-pride-hosts-june-pride-132230347.html",
      "email": "u003egianna.montesano@tcpalm.com"
    }
  ],
  "mails": [
    "app-store-icon@3x.png",
    "gianna.montesano@tcpalm.com",
    "google-play-icon@3x.png",
    "sales@myempireenergy.com",
    "u003ebillhimself@yahoo.com",
    "u003egianna.montesano@tcpalm.com"
  ],
  "nombre_sitio": "kiltedmermaid.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.myempireenergy.com/contact",
      "text": "Contact | Reach Out Today — Trusted Power Solutions 0 Skip to Content Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Folder: Services Back Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Folder: Service Area Back Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Contact Us If you’re interested in learning more about the potential savings solar can do for your home, fill out the information below and we’ll contact you! \"By providing your phone number and/or email, you consent to receive automated and non-automated marketing calls, texts, and account-related updates from Empire Energy (401)-336-6798 . Consent is not a condition of purchase. Message & data rates may apply. Reply STOP to opt out.\" Name * First Name Last Name Email * Message * Phone (###) ### #### Thank you! Or you can email us at: Sales@MyEmpireEnergy.com Contact us About us Services Reviews (401)-336-6798 Support@MyEmpireEnergy.com Address 1007 Waterman Ave. East Providence, RI 02914 Company Follow us!"
    },
    {
      "url": "https://www.yahoo.com/news/vero-pride-hosts-june-pride-132230347.html",
      "text": "Vero Pride hosts June Pride on the Block event at Kilted Mermaid in Vero Beach on June 26 Search query Search the web Skip to main News Finance Sports More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage Top Stories: Harris on Biden's decision to run Trump barred from firing Lisa Cook Trump: Epstein note a 'dead issue' 2 Americans fly to Tunisia by mistake 'Phillies Karen' viral drama 'Fake electors' case dismissed Apple debuts iPhone Air Oliver North weds Fawn Hall Supreme Court backs Trump Cracker Barrel halts renovations TCPalm | Treasure Coast Newspapers Vero Pride hosts June Pride on the Block event at Kilted Mermaid in Vero Beach on June 26 Gianna Montesano, Treasure Coast Newspapers Wed, June 22, 2022 at 1:22 PM UTC 4 min read Uncertainty has loomed over the LGBTQ community in Vero Beach since COVID-19 and the death of local drag queen Kelli Randell hit Vero Pride. For the past three years, the LGBTQ nonprofit's annual Pride celebrations were up in the air — until now. Pride on the Block will be the first June Pride event thrown by Vero Pride since 2019. The June 26 event will feature food, music and drag performers at the Kilted Mermaid. In 2021, when the bar owners realized no one was celebrating Pride on the Treasure Coast, they organized an event at the last minute. But for the past five months, six Vero Pride members in their 20s and 30s have been planning the event in their free time. The reason they've spent so much time on it is simple, organizer Pat Schlitt said: They wish to be the change they want to see in the world. Advertisement Advertisement Advertisement Advertisement Vero Beach: Local drag queen passes away Kilted Mermaid: Vero Beach bar and its ties to Pride Communities growing: Two groups working to revive Pride Fest “We really are big about educating, and education is one of our main pinnacles about why we continue to do Vero Pride,” Schlitt said. “Nobody from the original founding is still in it, but even just being there is monumental and is a time for people to learn.” An important aspect of this year’s Pride celebration is accessibility, which is why Pride on the Block has an age requirement for this first half of the day. The free event is open to all ages from 2-7 p.m. and restricted to 18 and older from 7-11 p.m., when there will be burlesque performers. Advertisement Advertisement Advertisement Advertisement “COVID [hit] two summers ago and we couldn’t even celebrate anything, and any other Pride event that has been held in Vero has been for 18 plus, 21 and up; and that’s not what Pride is,” Schlitt said. “It is accessible. It is inclusive. It is not exclusive.” Florida Gov. Ron DeSantis and the LGBTQ community LGBTQ rights have made headlines nationally this year, most notably with Florida Gov. Ron DeSantis pushing the \"Don’t Say Gay\" bill and banning transgender athletes from competing in sports that do not align with their sex assigned at birth. Rep. Anthony Sabatini of Howey-in-the-Hills urged DeSantis to call a special legislative session to propose a bill that would make it a felony to take children to drag shows and to terminate the parental rights of those who do. Sabatini's urgency to propose a bill was prompted by a June 5 event in West Palm Beach called \"Pride on the Block: Drag Show for Kids.\" Advertisement Advertisement Advertisement Advertisement Drag is a vessel of creativity, not an inappropriate event for children, said Vero Pride organizer Emily Fretwell. “Drag is expression, dressing up, playing with creativity and being a kid,” said Fretwell. “Who doesn’t love dancing to music, singing along, dressing up and having fun? If that’s not a kid’s event, I don’t know what is.” Vero Pride has hosted events at local Vero Beach businesses where patrons were upset because they did not want to be exposed to a “gay” event while dining out, Fretwell and Schlitt said. Pride Alliance of the Treasure Coast Pride Alliance of the Treasure Coast is a nonprofit LGBTQ organization founded in 2008 and located in Port St. Lucie. The nonprofit this year hosted its first Pride Fest since 2018 and will be present to support Vero Pride at its first event in three years. Advertisement Advertisement Advertisement Advertisement “Supporting Vero Pride is unity,” said Nikki Peyman, treasurer of Pride Alliance Treasure Coast. “We should all be supporting one another.” The LGBTQ community was not accepted when Fretwell and Schlitt were growing up in Vero Beach — and still is not, they said. Schlitt referenced experiences of \"gay bashing\" in Vero Beach bars, in which people have been attacked, abused or assaulted by someone who perceived them to be gay. “I think a lot of it is the lack of knowledge or willingness to open up,” Fretwell said. “I think they see kind of the rainbow colors and people being themselves and that is a little scary for some people.” Gianna Montesano is TCPalm's underserved communities reporter. You can contact me at gianna.montesano@tcpalm.com or at (772) 409-1429. This article originally appeared on Treasure Coast Newspapers: Vero Pride hosts its first June Pride event in Vero Beach since 2019 Advertisement About Our Ads Solve the daily Crossword 20,388 people played the daily Crossword recently. Can you solve it faster than others? 20,388 people played the daily Crossword recently. Can you solve it faster than others? Crossword Play on Yahoo Advertisement Advertisement Advertisement Yahoo! US Politics 2024 Election World Health Science The 360 Contact Us Originals Help Share Your Feedback About Us About Our Ads Site Map Follow us on Download our app © 2025 Yahoo. All rights reserved."
    }
  ]
}