{
  "fuentes": [
    {
      "url": "https://hu.linkedin.com/posts/barna-lászló-078a692b_el-tudja-képzelni-az-életét-facebook-instagram-activity-6951933474849107968-LVsk",
      "email": "info@paphoscreative.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "info.nairobi@skanem.com",
    "info@inzmo.com",
    "info@paphoscreative.com",
    "info@reception-plus.de",
    "jane@skanem.ke",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "kindercare.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://hu.linkedin.com/posts/barna-lászló-078a692b_el-tudja-képzelni-az-életét-facebook-instagram-activity-6951933474849107968-LVsk",
      "text": "El tudja képzelni az életét Facebook, Instagram vagy WhatsApp nélkül? Lehet, hogy elbúcsúzhat tőlük, az ír adatvédelmi bizottság ugyanis most megágyazhat a Meta kivonulásának. Vagy mégsem? Van okunk… | László Barna Elfogadás és csatlakozás a LinkedIn-hez Ha a Folytatás gombra kattint a csatlakozáshoz vagy a bejelentkezéshez, azzal elfogadja a LinkedIn Felhasználói megállapodását , Adatvédelmi szabályzatát és Sütiszabályzatát . Ugrás a fő tartalomra LinkedIn Cikkek Emberek Képzések Állások Játékok Bejelentkezés Csatlakozás László Barna Posta László Barna Barna László 3 é Bejegyzés bejelentése El tudja képzelni az életét Facebook, Instagram vagy WhatsApp nélkül? Lehet, hogy elbúcsúzhat tőlük, az ír adatvédelmi bizottság ugyanis most megágyazhat a Meta kivonulásának. Vagy mégsem? Van okunk félni? Szájbarágó az Indexen. https://lnkd.in/eYaeU8cn 3 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be Relevánsabb bejegyzések László Barna Barna László 1 hó Bejegyzés bejelentése Még nyár van… de szeptember már az ajtóban áll!\n\nAugusztus 10. A nyár csúcsa. Én is itt vagyok a ciprusi tengerparton mert itt lakom – nap, tenger, koktél – de közben dolgozom az ügyfeleim marketingjén és posztjain.\n\n🌞Tudom, te is  még lehet, hogy pihensz. Meg is érdemled! \nDe azt is tudom, hogy szeptemberben mindenki egyszerre fog visszakapcsolni üzleti üzemmódba… és akkor már nem lesz idő felkészülni.\n\n👉Az én ügyfeleim felületei nem álltak le a nyárral.\nSocial media oldalaik tele vannak friss, élő tartalommal, így akár most, a nyári pihenő alatt a mobiljukon görgető vevők, akár ősszel célzott kereséssel, könnyen megtalálják őket.\n\n☑ Ők nem szeptemberben kezdenek majd kapkodni – nekik már most épül az őszi lendületük.\n\n😆És ne felejtsd: a karácsony sincs messze. Kevin a Reszkessetek betörők-ből már számolja a napokat!\n\n👉Ezért mondom:  jelentkezz be már most a posztoló csomagomra, vagy a havi  marketing csomagomat veszed meg és rendet teszünk a kívánt területeken! \nSzeptember első hetében óriási rohamra számítok – a kicsit elaludt meglévő projektek és az új megkeresések egyszerre indulnak majd.\n\nRáadásul szeptembertől egy új, kiemelt projektem is startol: mint eddig is de kiemelten a szolgáltató vállalkozóknak segítek abban, hogy magasabb áron, jobb ügyfeleknek adják el a tudásukat. Erről hamarosan mesélek bővebben.\n\nMost még lazíthatsz… de ha okos vagy, már ma lépsz.\n\nBarna László – Brandesember www.brandesember.hu #nyarimarketing #posztkeszites #socialmedia #postmaker #brandepites #tartalommarketing #vallalkozasfejlesztes #szolgaltatasmarketing 3 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 2 hó Szerkesztve Bejegyzés bejelentése Piacot nyitottunk Cipruson – júliustól az EU-n belül, új helyszínen támogatjuk a helyi vállalkozásokat digitális marketinggel! 🇨🇾🚀\n\nA Brown and Partners Consulting csapataként örömmel jelentjük be, hogy 2025. júliustól Cipruson is aktív piaci jelenléttel dolgozunk, a Paphos Creative égisze alatt.\n\nMiért hittünk abban, hogy Cipruson helyünk van?\n\nMert a számok nem hazudnak – és mi adatvezérelten döntünk:\n\n📈 2024-ben Ciprus történelmi turisztikai rekordot döntött:\n→ több mint 4 millió látogató érkezett a szigetre\n→ a 2025-ös év első fele pedig újabb növekedést mutat\n\n🌍 A legtöbb látogató ezekből az országokból érkezik:\n→ Egyesült Királyság\n→ Izrael\n→ Lengyelország\n→ Németország\n\n💶 A turisták egy főre jutó költése:\n→ Átlagosan 726 euró/fő\n→ Bizonyos piacokon (pl. izraeli vendégek) a napi költés eléri a 140 eurót\n\nEz nem csak egy utazási statisztika – ez lehetőség a helyi szolgáltatóknak. Éttermeknek, autókölcsönzőknek, szépségszalonoknak, nyelviskoláknak és programkínálóknak. De csak akkor, ha láthatóak online.\n\n📲 Az aktív digitális jelenlét most kulcsfontosságú:\n→ Mobilra optimalizált, többnyelvű weboldal\n→ Rendszeres közösségi média posztolás\n→ Lokálisan célzott Google és Facebook kampányok\n→ Turisták számára is érthető, megbízható márkakommunikáció\n\nA Paphos Creative helyi bázisként, magyar szakmai háttérrel, de nemzetközi fókuszú tapasztalattal segíti a ciprusi vállalkozásokat – mert látjuk a lehetőséget, és tudjuk, hogyan lehet kiaknázni.\n\n📍 Paphosban élünk, a helyi vállalkozásokat képviseljük, és abban segítünk, hogy a turisták ne csak megérkezzenek, hanem el is költsék a pénzüket.\n\n☀️🇨🇾 ami fontos igazság, hogy 300 napig nincs eső, és minden nap olyan, mintha nyaralnánk, ami nekünk is jót tesz! 😎\n\n👉 Ha Cipruson vállalkozol, és szeretnél digitálisan láthatóbb lenni, írj nekünk bizalommal.\n\n📧 info@paphoscreative.com #cyprustourism #paphosbusiness #digitalmarketingcyprus #googleads #facebookads #socialmediaforbusiness #tourismmarketing #paphoscreative #visitcyprus #localbusinesssupport #marketingagencycyprus 23 3 hozzászólás Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 2 hó Bejegyzés bejelentése A Google AI Overview hatása: Elválik a megjelenés és a kattintás – iparági példák és következmények\n\nAz elmúlt időszakban a thepitch oldalán megjelent cikk rávilágított egy olyan keresőpiaci változásra, amely marketingesként engem is komoly elemzésre késztet: a Google AI Overview (AIO) funkció megjelenésére, és annak drasztikus hatására az organikus forgalomra.\n\nNálam már a Google keresések során is rendszeresen felbukkan az AI Overview a szponzorált és organikus találatok felett, ami alapjaiban írja át a keresőoptimalizálás (SEO) stratégiákat.\nUtánanéztem ennek az új jelenségnek.\n\nMi az AI Overview, és miért jelent kihívást?\nErről szól a legújabb blogbejegyzésem: https://lnkd.in/dJMbpBax #AIOverview #Googlekeresés #SEO #organikusforgalom #digitálismarketing #keresőoptimalizálás #kattintásiarány #analitika #marketingstratégia #iparágitrendek #tartalommarketing #zeroclicksearch #onlinemarketing #weboldalforgalom 5 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 2 hó Bejegyzés bejelentése Google Ads kisvállalkozóknak 2025-ben: nem a költség a kérdés, hanem a struktúra\n\nA legtöbb kisvállalkozás még mindig úgy tekint a Google Ads hirdetésekre, mint valami drága luxusra, amit csak a „nagyok” engedhetnek meg maguknak. Pedig valójában pont fordítva van: egy jól strukturált Google kampány már havi 20–30 ezer forintos költséggel is képes ügyfeleket hozni – ha tudatosan építjük fel.\n\n☑A kulcs: fókuszált kampányok, jól célzott kulcsszavak és automatizált konverziókövetés. \n\nErről szól legújabb blogbejegyzésem: https://lnkd.in/dGThqY2a #googleads #hirdetesistrategia #kisvallalkozas #konverziosoptimalizalas #landingoldal #magyarvallalkozas #marketingtrendek2025 #szolgaltatasmarketing #ugyszerzes 6 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 2 hó Bejegyzés bejelentése 🎯 Rakétapajzsok és marketingstratégiák – mit tanulhatunk belőlük?\n\nElőszóként fontosnak tartom elmondani:\nA világban zajló események – háborúk, rakétatámadások és emberi szenvedés – mindig mélyen megrendítenek. A napokban több cikket olvastam a Vaskupola és az Arrow rakétavédelmi rendszerekről, nem katonai érdeklődésből, hanem kíváncsiságból: hogyan működik egy ilyen komplex, több szintű védelmi mechanizmus?\n\nÉs ahogy olvastam róluk, egyszer csak átkattant bennem valami – rájöttem, mennyire hasonlít ez a rendszer egy jól felépített marketingstratégiára.\n\nA hasonlat talán szokatlan, de ha elvonatkoztatunk a szomorú valóságtól, és a stratégiai gondolkodást, reakcióidőt, valamint a rendszerszintű védekezést vizsgáljuk – akkor értékes tanulságokat vihetünk át a saját vállalkozásunk világába.\n\n🛡️ Vaskupola = gyors reakció marketingben\n\nA Vaskupola (Iron Dome) egy rövid hatótávú rakétavédelmi rendszer. Gyorsan észlel, kiszűr és semlegesít – pont olyan, mint egy jól beállított kríziskommunikációs rendszer:\n\t•\tHirtelen támadások = negatív kommentek, trollok, váratlan PR-balesetek\n\t•\tA rendszer automatikusan reagál – pl. automata válaszok, előre elkészített krízisprotokoll, social listening\n\t•\tNem építi fel a márkát, csak megóvja azt, ami már létezik\n\n🚀 Arrow = hosszútávú marketingvédelem\n\nAz Arrow rakétarendszer már a nagy hatótávolságú fenyegetéseket figyeli, sokkal korábban észlel, tervez és reagál – ez a stratégiai marketing világa:\n\t•\tSEO, brandépítés, tudatos tartalommarketing\n\t•\tHírnév- és közösségépítés, amely előbb tudja, mire számíthat\n\t•\tAutomatizált, több szinten működő rendszerek (CRM, értékesítési tölcsér, ügyfélélmény-tervezés)\n\n📡 A radarrendszer: piackutatás és monitoring\n\nMinden jó rakétapajzs alapja egy érzékeny radar, ami még a levegőbe kilőtt veszélyeket is érzékeli. A marketing világában ez lehet:\n\t•\tSocial listening (említések, vélemények figyelése)\n\t•\tÜgyfél-visszajelzések, értékelések, értékesítési adatok\n\t•\tVersenytársfigyelés – mi jön, honnan, és milyen irányba\n\n💬 Kommunikációs rakéták: célzott támadás helyett precíziós kampány\n\nA rakéta szónak van egy másik jelentése is: amikor üzenetet küldünk.\nNem mindegy, hogyan „lövünk ki” egy kampányt:\n\t•\tCéltalan lövöldözés = napi 10 poszt, érték nélkül\n\t•\tPrecíziós kommunikáció = jól célzott videó, funnel, Google Ads kampány\n\t•\t„One shot, one impact” – legyen értelme, hatása, és következménye\n\n🧠 Zárszó – stratégia háború nélkül\n\nA marketing nem háború, de stratégiai játék.\nNincs szükség áldozatokra, de felkészültségre igen.\nA világ, a piac és az ügyfelek is folyamatosan változnak. Ha nincs védelmed, ha nincs jól beállított radarod, ha nincs célzott üzeneted – akkor csak várhatod, hol csapódik be legközelebb valami.\n\n👉 Építs rendszert, gondolkodj több szinten, és legyél egy lépéssel előrébb!\n\nBÉKE!!!! 🙏 1 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 3 hó Bejegyzés bejelentése 🎯 Krízistérkép 2024 – Felkészültél a válságokra?\n\nA Magyar Public Relations Szövetség (MPRSZ) legfrissebb tanulmánya több mint 450 hazai krízisesetet elemez, iparági bontásban. Valós, megtörtént válsághelyzeteket láthatsz – hogyan kezelték a cégek, és mik voltak a legsúlyosabb hibák?\n\nA tanulmányból megtudhatod:\n• Milyen krízisek rázták meg a gazdaságot 2024-ben (egészségügy, energia, közlekedés, politika)?\n• Hogyan kezelték a vállalatok az adatlopásokat, botrányokat, termékhibákat vagy akár a közösségi médiás lejáratást?\n• Mi okozta a legnagyobb reputációs károkat – és mit lehetett volna másképp csinálni?\n\n📌 Kiemelt témák:\n– hazai példák: GVH-vizsgálatok, Mol és Paks kommunikációs hibái, sport- és egyházi botrányok\n– nemzetközi ügyek: pénzmosás, deepfake, mesterséges intelligencia általi reputációs válságok\n– konkrét tanulságok cégvezetőknek, kommunikációs szakembereknek\n\n💼 Miért érdemes elolvasni?\nMert a válságok nem csak a nagyokat érintik. A tanulmány gyakorlati útmutatót ad kis- és középvállalkozásoknak is arra, hogyan készüljenek fel, mit tegyenek, ha baj van, és hogyan építsenek válságálló márkát.\n\n🔗 Töltsd le most ingyenesen: https://lnkd.in/ddy-Zzht #krizisterkep2024 #mprsz #kríziskommunikáció #válságkezelés #vállalkozásfejlesztés #reputációvédelem C2PA-információk megtekintése 1 1 hozzászólás Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 3 hó Bejegyzés bejelentése A közélet átláthatóságáról szóló törvényjavaslat hatása a marketingre: hogyan tovább a KKV-knak?\nKommunikálni szeretnél? Előbb gondolkodj. Mostantól még jobban.\n\nA frissen benyújtott „a közélet átláthatóságáról” szóló törvényjavaslat új korszakot nyithat a hazai vállalkozói kommunikációban. Bár elsőre úgy tűnhet, hogy a politikai szereplőket célozza, valójában minden olyan kis- és középvállalkozást érinthet, amely rendszeresen kommunikál – legyen szó egy Facebook-posztról, külföldi partnerrel való együttműködésről vagy célzott adatgyűjtésről.\n\nMilyen poszt lehet kockázatos? Hogyan válhat egy marketingkampány „közélet befolyásolásává”? Milyen új szankciókra kell felkészülniük a cégeknek?\n\nEbben a cikkben összefoglaljuk a törvényjavaslat vállalkozásokra gyakorolt lehetséges hatásait, bemutatjuk a rejtett kockázatokat, és konkrét javaslatokat adunk arra, hogyan kommunikálhatsz biztonságosan és tudatosan ebben az új szabályozási környezetben.\n\nMost nem elég jónak lenni – tudatosnak is kell.\nOlvasd el a teljes cikket, és tudd meg, hogyan védheted meg a vállalkozásod kommunikációs szabadságát! https://lnkd.in/dTx5DYFk A közélet átláthatóságáról szóló törvényjavaslat hatása a marketingre: hogyan tovább a KKV-knak? - Brandesember https://brandesember.hu 2 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 4 hó Szerkesztve Bejegyzés bejelentése E-ker Nap 2025.\nA Szamlazz.hu teremben találkozunk!\nKezdünk! #ekernap #ekernap2025 11 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 4 hó Szerkesztve Bejegyzés bejelentése Revolut 2024: 1,4 milliárd dolláros profit, 15 millió új ügyfél – így vált Európa legértékesebb fintech cégévé!\n\nA Revolut 2024-ben lenyűgöző eredményeket ért el, amelyek új mércét állítanak a fintech szektorban. A cég 1,4 milliárd dolláros adózás előtti nyereséget könyvelhetett el, ami 149%-os növekedést jelent az előző évhez képest. A bevételek 72%-kal emelkedtek, elérve a 4 milliárd dollárt, miközben a felhasználói bázis 38%-kal nőtt, 52,5 millióra.\n\nBevételi diverzifikáció és termékinnováció\n\nA Revolut sikerének kulcsa a bevételi források sokszínűsége és a folyamatos termékfejlesztés. A Wealth szegmens, amely magában foglalja a kriptovaluta-kereskedelmet és a befektetési szolgáltatásokat, 298%-os növekedést mutatott, 647 millió dolláros bevételt generálva. Az előfizetéses szolgáltatásokból származó bevételek 74%-kal, 541 millió dollárra emelkedtek, míg a kártyás fizetésekből származó bevételek 43%-kal nőttek, elérve a 887 millió dollárt.  \n\nÜgyfélbázis és globális terjeszkedés\n\nA Revolut felhasználói bázisa 2024-ben 38%-kal bővült, közel 15 millió új ügyféllel, így összesen 52,5 millió felhasználót szolgál ki világszerte. A cég célja, hogy 100 millió napi aktív felhasználót érjen el 100 országban. A terjeszkedési tervek között szerepel a brit és mexikói banki szolgáltatások elindítása, valamint az indiai piacra lépés.\n\nBelső kultúra és munkavállalói ösztönzés\n\nA Revolut belső működésében is innovatív megközelítést alkalmaz. A “Karma” nevű rendszerrel a dolgozók bónuszait a csapatok kockázatkezelési és megfelelőségi teljesítménye alapján módosítják, ösztönözve a felelős munkavégzést.  Emellett a cég a jövőbeni tőzsdei bevezetésre készülve átalakította a javadalmazási struktúrát, bevezetve a készpénzes bónuszokat az eddigi részvényalapú juttatások mellé.\n\nJövőbeli kilátások\n\nA Revolut ambiciózus tervei között szerepel a brit banki szolgáltatások teljes körű elindítása 2025 végéig, valamint a hiteltermékek, például jelzáloghitelek és személyi kölcsönök bevezetése.  A cég továbbra is fókuszál a globális terjeszkedésre és a termékportfólió bővítésére, hogy megerősítse pozícióját a digitális pénzügyi szolgáltatások piacán.\n\nA Revolut 2024-es eredményei és stratégiái jól példázzák, hogyan lehet a technológiai innovációval és ügyfélközpontú megközelítéssel jelentős növekedést elérni a pénzügyi szektorban. A cég sikere inspirációt nyújthat más vállalkozások számára is, akik a digitális transzformáció és a globális piacok felé kívánnak nyitni.\n\nCsatlakozz hozzám és ahhoz a több mint 50 milliós ügyféltáborhoz, amelynek tagjai már felfedezték a Revolutban rejlő lehetőségeket. Regisztrálj az alábbi hivatkozással: https://lnkd.in/drq-jkDe forrás: https://lnkd.in/dMz-_Rbk 2 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be László Barna Barna László 4 hó Bejegyzés bejelentése Kattintás első vérig – amikor a konverziót nem a marketing, hanem az árak ölik meg https://lnkd.in/duGbgzHQ #marketingkampány #árstratégia #egészségügyiszolgáltatás #ppc #socialmedia #konverzió #onlinemarketing #googleads #versenytárselemzés #ügyfélszerzés #árverseny Kattintás első vérig – amikor a konverziót nem a marketing, hanem az árak ölik meg - Brandesember https://brandesember.hu 5 Kedvelés Hozzászólás Megosztás Másolás LinkedIn Facebook Twitter A megtekintés vagy hozzászólás érdekében jelentkezzen be 2 899 Követői 555 Profil megtekintése Követés LinkedIn © 2025 Rólunk Akadálymentesség Felhasználói megállapodás Adatvédelmi szabályzat Sütiszabályzat Szerzői jogokra vonatkozó szabályzat Márkaszabályzat Vendégengedélyek Közösségi irányelvek العربية (arab) বাংলা (bángla) Čeština (cseh) Dansk (dán) Deutsch (német) Ελληνικά (görög) English (angol) Español (spanyol) فارسی (perzsa) Suomi (finn) Français (francia) हिंदी (hindi) Magyar (Hungarian) Bahasa Indonesia (indonéz) Italiano (olasz) עברית (héber) 日本語 (japán) 한국어 (koreai) मराठी (maráthi) Bahasa Malaysia (maláj) Nederlands (holland) Norsk (norvég) ਪੰਜਾਬੀ (pandzsábi) Polski (lengyel) Português (portugál) Română (román) Русский (orosz) Svenska (svéd) తెలుగు (telugu) ภาษาไทย (thai) Tagalog (tagalog) Türkçe (török) Українська (ukrán) Tiếng Việt (vietnami) 简体中文 (egyszerűsített kínai) 正體中文 (hagyományos kínai) Nyelv További tartalom megtekintéséhez jelentkezzen be Hozza létre ingyenes fiókját, vagy jelentkezzen be a keresés folytatásához Bejelentkezés Üdv újra itt! E-mail-cím vagy telefonszám Jelszó Megjelenítés Elfelejtette a jelszavát? Bejelentkezés vagy Ha a Folytatás gombra kattint a csatlakozáshoz vagy a bejelentkezéshez, azzal elfogadja a LinkedIn Felhasználói megállapodását , Adatvédelmi szabályzatát és Sütiszabályzatát . Még nincs fenn a LinkedIn-en? Csatlakozzon most vagy Még nincs fenn a LinkedIn-en? Csatlakozzon most Ha a Folytatás gombra kattint a csatlakozáshoz vagy a bejelentkezéshez, azzal elfogadja a LinkedIn Felhasználói megállapodását , Adatvédelmi szabályzatát és Sütiszabályzatát ."
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Surname name Nachricht Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    }
  ]
}