{
  "fuentes": [
    {
      "url": "https://www.golflink.com/golf-courses/fl/port-charlotte/kings-gate-golf-club",
      "email": "customerservice@golflink.com"
    },
    {
      "url": "https://www.thegategolf.org/about-us/",
      "email": "info@thegategolf.com"
    },
    {
      "url": "https://www.thegategolf.org/about-us/",
      "email": "info@thegategolf.org"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://kingshillgolf.com/contact-us/",
      "email": "fbmanager@kingshillgolf.co.uk"
    },
    {
      "url": "https://kingshillgolf.com/contact-us/",
      "email": "office@kingshillgolf.co.uk"
    },
    {
      "url": "https://kingshillgolf.com/contact-us/",
      "email": "proshop@kingshillgolf.co.uk"
    },
    {
      "url": "https://business.charlottecountychamber.org/list/member/kings-gate-golf-club-109072",
      "email": "askus@charlottecountychamber.org"
    }
  ],
  "mails": [
    "askus@charlottecountychamber.org",
    "customerservice@golflink.com",
    "fbmanager@kingshillgolf.co.uk",
    "info@belfairsgolfclub.co.uk",
    "info@thegategolf.com",
    "info@thegategolf.org",
    "office@kingshillgolf.co.uk",
    "proshop@kingshillgolf.co.uk"
  ],
  "nombre_sitio": "kingsgategolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golflink.com/golf-courses/fl/port-charlotte/kings-gate-golf-club",
      "text": "Kings Gate Golf Club, Port Charlotte, FL - Scorecard & Overview Join Now Log In Book a Tee Time Find a Course Learn Equipment Instruction Lifestyle Tour Golf Travel All Articles Resources Find Driving Ranges Find Golf Simulators About Us Find golf lessons Newsletter Join Now Log In Newsletter Search Courses Enter Keyword Home Courses FL Port Charlotte Public N/A No Reviews Yet Kings Gate Golf Club Designed by Bill Murray and opened in 2006 Kings Gate - Port Charlotte , Florida Course Details Scorecard Flyover Views Yardage Maps Reviews Nearby Courses Course Details Holes: 18 Par: 60 Length: 3176 yards Driving Ranges: No The 18-hole \"Kings Gate\" course at the Kings Gate Golf Club facility in Port Charlotte , Florida features 3176 yards of golf from the longest tees for a par of 60. The course rating is 0 and it has a slope rating of 0. The estimated green fees for 18 holes is $55. Designed by Bill Murray, the Kings Gate golf course opened in  2006. Estimated Green Fees $55 These rates are an estimate of what you might expect to pay at Kings Gate with a cart. Actual rates may vary. Fees are typically lowest Monday through Thursday and during twilight (late afternoon and evenings). Expect to pay the highest rates on weekends. Scorecard for Kings Gate HOLE 1 2 3 4 5 6 7 8 9 OUT 10 11 12 13 14 15 16 17 18 IN TOT Blue 59.40/91 325 132 130 187 170 249 141 114 329 1777 301 157 168 326 128 143 120 103 293 1739 3516 White 58.10/91 311 128 117 147 135 226 134 107 318 1623 289 142 118 310 111 135 104 97 279 1585 3208 Red (L) 57.20/88 308 124 114 122 130 220 89 103 307 1517 281 130 104 297 102 130 97 92 267 1500 3017 Par 4 3 3 3 3 4 3 3 4 30 4 3 3 4 3 3 3 3 4 30 60 Swipe to See full table Kings Gate Flyover Experience the course like never before with our Flyover feature. Get a bird's-eye view of each hole, helping you strategize your round and navigate the course with precision. Kings Gate Yardage Maps Plan your shots effectively with our Yardage Maps. Click on the yardage maps for detailed measurements on every hole, including distances to hazards and key landmarks, ensuring you make the right decisions on every swing. FRONT 9 BACK 9 HOLE 1 HOLE 2 HOLE 3 HOLE 4 HOLE 5 HOLE 6 HOLE 7 HOLE 8 HOLE 9 Load More Holes HOLE 10 HOLE 11 HOLE 12 HOLE 13 HOLE 14 HOLE 15 HOLE 16 HOLE 17 HOLE 18 What Golfers are Saying N/A Be the first to leave a review Write a review Add a Photo Drop Photo Here or Click to Upload Submit View More Courses in Port Charlotte The Cove of Rotonda Golf Center, Cove Course Public Year Opened: 1999 12455 S Access Rd, Port Charlotte, FL, 33981-6206 8 miles from the center of Port Charlotte view course details book a tee time 18 Holes 59 Par 3,641 Yards Driving Range: Yes Maple Leaf Golf & Country Club, Maple Leaf Course Public Year Opened: 2018 2100 Kings Hwy, Port Charlotte, FL, 33980-4258 4 miles from the center of Port Charlotte view course details book a tee time 18 Holes 62 Par 3,920 Yards Driving Range: No Port Charlotte Golf Club, Port Charlotte Course Public Year Opened: 2006 22400 Gleneagles Ter, Port Charlotte, FL, 33952-5628 2 miles from the center of Port Charlotte view course details book a tee time 18 Holes 72 Par 6,754 Yards Driving Range: Yes Riverwood Golf Club, Riverwood Course Public Year Opened: 1992 4100 Riverwood Dr, Port Charlotte, FL, 33953-5655 6 miles from the center of Port Charlotte view course details book a tee time 18 Holes 72 Par 6,938 Yards Driving Range: Yes Nearby cities with courses Arcadia 2 Courses Boca Grande 1 Course Englewood 6 Courses Lake Suzy 1 Course North Fort Myers 1 Course North Port 5 Courses North Venice 1 Course Placida 1 Course Punta Gorda 9 Courses Rotonda West 10 Courses Venice 14 Courses 24000 Rampart Blvd, Port Charlotte, FL 33980-2738 (941) 625-0680 Visit course website Caption Join the GolfLink Newsletter! Sign up for golf news, information, and special offers. SUBSCRIBE By signing up you agree to receive communications from GolfLink and select partners in accordance with our Privacy Policy . You may opt out of email messages/withdraw consent at any time. FOLLOW US JOIN OUR NEWSLETTER Sign up for golf news, information and special offers SUBSCRIBE SUPPORT About GolfLink Partner With Us Contact GolfLink Support Privacy Policy Terms of Use Do Not Sell my Personal Information FOLLOW US Copyright © 1996-2025, LoveToKnow Media . All rights reserved. GolfLink™ is a trademark or registered trademark of LoveToKnow Media in the United States and or other countries."
    },
    {
      "url": "https://www.thegategolf.org/about-us/",
      "text": "About Us - The Gate Golf Club Skip to primary navigation Skip to main content Donate The Gate Golf Club Home About Us About Us The Course Practice Complex Donate Building the Vision Meet the Team Board of Directors Project Partners First Tee – Naples/Collier Career Opportunities Contact Us Contact Us Press Room FAQ About Us Opening in 2026, The Gate Golf Club will bring a fresh perspective to the golfing community in Naples, Florida. Led by a passionate team of local Neapolitans, this non-profit organization is driven by a shared love for golf and a commitment to creating a lasting impact on the community. Recognizing the limited availability of public golf courses in Southwest Florida, The Gate Golf Club is dedicated to making the sport more accessible and inclusive for families, children, and players of all skill levels. Here, guests will have the opportunity to learn and enjoy the game in a relaxed, welcoming environment. Our state-of-the-art practice facilities, complete with covered hitting bays, ensure players can sharpen their skills day or night, rain or shine. The Gate Golf Club will also be home to a modern restaurant and a community-focused Pavilion, offering spaces for gathering, dining, and enjoying the scenic surroundings. The Gate Golf Club is proud to support First Tee – Naples/Collier, a non-profit organization that teaches juniors important life skills, character, and values through golf. As the future headquarters of First Tee – Naples/Collier, we are committed to fostering a love for the game while inspiring the next generation. At the heart of The Gate Golf Club will be our dynamic 9-hole, par-35 course designed by legendary golfer Peter Jacobsen. Featuring top-tier TifEagle putting greens and Celebration Bermuda fairways, the course will offer a premier experience for golfers of all levels. Our cutting-edge driving range will feature 30 covered hitting bays outfitted with comfortable lounge seating and Trackman technology, providing an unparalleled practice environment. For an added challenge, players can enjoy an illuminated, 18-hole Himalayas-style putting course, making practice and play enjoyable day and night. Dining will be elevated with the Oakwood Grill, a 175-seat casual restaurant offering an upscale menu inspired by the flavors of Southwest Florida. Open-air wraparound seating will provide stunning views of the Himalayas putting green, Hole #9, and a tranquil water feature, creating the perfect backdrop for a memorable meal. The Gate Golf Club will be more than just a golf course—it will be a vibrant community hub where golf enthusiasts and newcomers alike can connect, improve their game, and make lasting memories. Join us in 2026 as we open the doors to an exciting new chapter in Naples’ golfing tradition. Page Footer About Us Privacy Policy The Gate Golf Club opens to the public in  2026! Contact Email: info@thegategolf.org Facebook Instagram Copyright © 2025 The Gate Golf Club All Rights Reserved. Powered by The Gate, Oakwood Grill, and the Tree Logo are trademarks of The Gate Golf Club, Inc. First Tee and associated logos are federally registered trademarks owned by PGA TOUR First Tee Foundation, Inc."
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://kingshillgolf.com/contact-us/",
      "text": "Contact Us - Kings Hill Golf Club Contact Us Contact Us Are you a golf enthusiast looking for a welcoming and enjoyable golfing experience? Look no further! Kings Hill Golf Club invites you to come and play as a visitor, enquire about membership or visit our clubhouse. To make an enquiry about Kings Hill Golf Club please complete the enquiry form or alternatively phone or send an email to the golf club. Kings Hill Golf Club, Fortune Way, Kings Hill, West Malling, Kent ME19 4GF BOOK A TEE TIME MEMBERS LOGIN Menu item Submenu item Submenu item Menu item Submenu item Submenu item HOME VISITORS GREEN FEES GOLF DAYS OPEN COMPETITIONS GOLF ACADEMY COURSE COURSE TOUR COURSE RATINGS CLUBHOUSE CLUBHOUSE SOCIAL EVENTS PRIVATE EVENTS MEETINGS MEMORIALS CHRISTMAS MEMBERSHIP GOLF MEMBERSHIP CONTACT US MEMBERS LOGIN Menu 0 items £ 0.00 Contact Us Contact Us Are you a golf enthusiast looking for a welcoming and enjoyable golfing experience? Look no further! Kings Hill Golf Club invites you to come and play as a visitor, enquire about membership or visit our clubhouse. To make an enquiry about Kings Hill Golf Club please complete the enquiry form or alternatively phone or send an email to the golf club. Club Contacts Clubhouse and General Enquiries Contact Number: 01732 875040 Email: office@kingshillgolf.co.uk Pro Shop Contact Number: 01732 842121 Email: proshop@kingshillgolf.co.uk Food and Beverage, Function and Event Enquiries Contact Number: 01732 875040 Email: fbmanager@kingshillgolf.co.uk Address Kings Hill Golf Club Fortune Way Kings Hill ME19 4GF Enquiry Form Your Name* your name Your Email* your email Contact Number Telephone Message Message ENQUIRE TODAY ENQUIRE TODAY THE CLUBHOUSE EAT, MEET, DRINK View more ENQUIRE TODAY GOLF MEMBERSHIP View more BOOK TODAY PRIVATE EVENTS View more Would you like to receive our latest news and promotions? Will be used in accordance with our Privacy Policy Leave this field empty if you're human: Your email address is exclusively for us to send occasional promotions and will not be shared or sold. Privacy Policy ADDRESS Kings Hill Golf Club, Fortune Way, Kings Hill, West Malling, Kent ME19 4GF office@kingshillgolf.co.uk Clubhouse: 01732 875040 Pro Shop: 01732 842121 VISITORS Green Fees Golf Days Open Competitions Golf Academy Membership CLUBHOUSE Clubhouse Social Events Private Events Meetings Memorials Christmas SOCIAL Design and Made by James Lee Design Privacy Policy | Safe Golf HOME VISITORS GREEN FEES GOLF DAYS OPEN COMPETITIONS GOLF ACADEMY COURSE COURSE TOUR COURSE RATINGS CLUBHOUSE CLUBHOUSE SOCIAL EVENTS PRIVATE EVENTS MEETINGS MEMORIALS CHRISTMAS MEMBERSHIP GOLF MEMBERSHIP CONTACT US Shopping cart Close"
    },
    {
      "url": "https://business.charlottecountychamber.org/list/member/kings-gate-golf-club-109072",
      "text": "Kings Gate Golf Club | GOLF COURSES/COUNTRY CLUBS - History - Charlotte County Chamber of Commerce The Chamber History Sustaining Partners Past Award Recipients Board of Directors Committees Staff Member Benefits Member Login Member To Member Deals Job Posting News Release Payments Member Marketing Opportunities Join Today Membership Information Membership Application Payment Leadership Charlotte Leadership 2026: Leadership Charlotte Application and Program Schedule Leadership Charlotte Class of 2025 Leadership Charlotte Hall of Fame Leadership Charlotte Alumni Junior Leadership Charlotte Business Online Member Directory Member Events for Business Online Member News for Business Online Non Profit Corner for Business Online New Members for Business Online Business Online Past Issues Business Start Up Chamber News & Events Community Guide Chamber Blog Chamber Event Calendar Local Events Calendar Hot Member Deals Quarterly Newsletter First Thursday Advertiser Member DIrectory Get in touch 555-555-5555 mymail@mailservice.com JOIN TODAY! The Chamber History Sustaining Partners Past Award Recipients Board of Directors Committees Staff Member Benefits Member Login Member To Member Deals Job Posting News Release Payments Member Marketing Opportunities Join Today Membership Information Membership Application Payment Leadership Charlotte Leadership 2026: Leadership Charlotte Application and Program Schedule Leadership Charlotte Class of 2025 Leadership Charlotte Hall of Fame Leadership Charlotte Alumni Junior Leadership Charlotte Business Online Member Directory Member Events for Business Online Member News for Business Online Non Profit Corner for Business Online New Members for Business Online Business Online Past Issues Business Start Up Chamber News & Events Community Guide Chamber Blog Chamber Event Calendar Local Events Calendar Hot Member Deals Quarterly Newsletter First Thursday Advertiser Member DIrectory Kings Gate Golf Club Categories GOLF COURSES/COUNTRY CLUBS 24000 Rampart Blvd. Port Charlotte FL 33980-2733 (941) 625-0680 (941) 625-1442 Visit Website About Us Award winning 18 hole executive golf course in an adult resort 55+ living community - open to the public. Phone Number (Pro Shop): (941) 625-0680 Phone Number (The Lion's Den Restaurant): (941) 625-0054 Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel 2702 Tamiami Trail Port Charlotte, Florida 941-627-2222 Fax: 941-627-9730 QUICK LINKS Home Chamber News & Events Home Location Payment FOLLOW US © 2025 Charlotte County Chamber of Commerce. All Rights Reserved. Site by GrowthZone Share by: // CM00330356"
    }
  ]
}