{
  "fuentes": [
    {
      "url": "https://www.restaurant-hospitality.com/restaurant-operations/taking-control-of-the-seafood-supply",
      "email": "holly.petre@informa.com"
    },
    {
      "url": "https://www.restaurant-hospitality.com/restaurant-operations/taking-control-of-the-seafood-supply",
      "email": "nancy.luna@informa.com"
    },
    {
      "url": "https://www.restaurant-hospitality.com/restaurant-operations/taking-control-of-the-seafood-supply",
      "email": "nancy.luna@knect365.com"
    },
    {
      "url": "https://www.cafishgrill.com/pages/contact-us",
      "email": "press@cafishgrill.com"
    },
    {
      "url": "https://thekingfishcompany.com/investors/",
      "email": "asset-1@2x-copy.png"
    },
    {
      "url": "https://thekingfishcompany.com/investors/",
      "email": "ir@thekingfishcompany.com"
    },
    {
      "url": "https://thekingfishcompany.com/investors/",
      "email": "info@thekingfishcompany.com"
    },
    {
      "url": "https://kingfishgrill.com/contact/",
      "email": "info@kingfishgrill.com"
    },
    {
      "url": "https://thekingfishcompany.com/news/new-ceo-for-the-kingfish-company/",
      "email": "asset-1@2x-copy.png"
    },
    {
      "url": "https://thekingfishcompany.com/news/new-ceo-for-the-kingfish-company/",
      "email": "info@thekingfishcompany.com"
    },
    {
      "url": "https://thekingfishcompany.com/news/new-ceo-for-the-kingfish-company/",
      "email": "ir@the-kingfish-company.com"
    },
    {
      "url": "https://thekingfishcompany.com/news/new-ceo-for-the-kingfish-company/",
      "email": "press@the-kingfish-company.com"
    },
    {
      "url": "https://www.kingfishermidlands.co.uk/contact/",
      "email": "sales@kingfishermidlands.co.uk"
    },
    {
      "url": "https://thekingfishcompany.com/contact-faqs/",
      "email": "asset-1@2x-copy.png"
    },
    {
      "url": "https://thekingfishcompany.com/contact-faqs/",
      "email": "info@thekingfishcompany.com"
    },
    {
      "url": "https://thekingfishcompany.com/contact-faqs/",
      "email": "order@thekingfishcompany.com"
    },
    {
      "url": "https://kingfisherdublin.com/eat/",
      "email": "info@kingfisherdublin.com"
    }
  ],
  "mails": [
    "asset-1@2x-copy.png",
    "holly.petre@informa.com",
    "info@kingfisherdublin.com",
    "info@kingfishgrill.com",
    "info@thekingfishcompany.com",
    "ir@the-kingfish-company.com",
    "ir@thekingfishcompany.com",
    "nancy.luna@informa.com",
    "nancy.luna@knect365.com",
    "order@thekingfishcompany.com",
    "press@cafishgrill.com",
    "press@the-kingfish-company.com",
    "sales@kingfishermidlands.co.uk"
  ],
  "nombre_sitio": "kingfishgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.restaurant-hospitality.com/restaurant-operations/taking-control-of-the-seafood-supply",
      "text": "Taking control of the seafood supply Restaurant Hospitality is part of the Informa Connect Division of Informa PLC Informa PLC | ABOUT US | INVESTOR RELATIONS | TALENT This site is operated by a business or businesses owned by Informa PLC and all copyright resides with them. Informa PLC's registered office is 5 Howick Place, London SW1P 1WG. Registered in England and Wales. Number 8860726. About us Advertise CREATE: For Emerging Restaurateurs Subscribe Subscribe Subscribe Restaurant Concepts & Chefs Related Topics New Restaurants Restaurant Profiles Chef Profiles Multiconcept Restaurant Groups Hotel Dining Recent in Restaurant Concepts & Chefs See All New Restaurants Highly anticipated contemporary French restaurant Mamani is now open in Dallas Highly anticipated contemporary French restaurant Mamani is now open in Dallas by Kevin Gray Sep 11, 2025 3 Min Read Multiconcept Restaurant Groups Morocco-inspired Ayah opens in New York City Morocco-inspired Ayah opens in New York City by Ron Ruggless Sep 11, 2025 2 Min Read Restaurant Operations Related Topics Restaurant Technology Growth & Expansion Tips Restaurant Marketing Employment & Staffing Delivery & Takeout Solutions Restaurant Finance Restaurant Design Restaurant Kitchens Recent in Restaurant Operations See All Policy & Regulation Congress introduces bipartisan American Franchise Act to end joint employer complications Congress introduces bipartisan American Franchise Act to end joint employer complications by Joanna Fantozzi Sep 11, 2025 2 Min Read Multiconcept Restaurant Groups Morocco-inspired Ayah opens in New York City Morocco-inspired Ayah opens in New York City by Ron Ruggless Sep 11, 2025 2 Min Read Menu Trends Related Topics Food Trends Drink Trends Menu Recipes Recent in Menu Trends See All Policy & Regulation ‘Make America Healthy Again’ report urges restaurants to provide healthier kids' meals ‘Make America Healthy Again’ report urges restaurants to provide healthier kids' meals Sep 11, 2025 2 Min Read Food Trends New on the Menu: Ceviche with sake lees and a Thai chicken sandwich New on the Menu: Ceviche with sake lees and a Thai chicken sandwich by Bret Thorn Sep 5, 2025 5 Slides Restaurant News Related Topics Chef News Consumer Trends Policy & Regulation Supplier News Recent in Restaurant News See all Policy & Regulation Congress introduces bipartisan American Franchise Act to end joint employer complications Congress introduces bipartisan American Franchise Act to end joint employer complications by Joanna Fantozzi Sep 11, 2025 2 Min Read Policy & Regulation ‘Make America Healthy Again’ report urges restaurants to provide healthier kids' meals ‘Make America Healthy Again’ report urges restaurants to provide healthier kids' meals Sep 11, 2025 2 Min Read Restaurant Insights Related Topics Expert Insights Best Sandwiches in America Best Cocktails in America Reports Best Desserts Recent in Restaurant Insights See all Policy & Regulation ‘Make America Healthy Again’ report urges restaurants to provide healthier kids' meals ‘Make America Healthy Again’ report urges restaurants to provide healthier kids' meals Sep 11, 2025 2 Min Read Expert Insights Dan Simons of Founding Farmers on why every issue is a restaurant issue Dan Simons of Founding Farmers on why every issue is a restaurant issue by Gloria Dawson Sep 11, 2025 Sponsored By Restaurant Operations Menu Trends Restaurant Concepts & Chefs Taking control of the seafood supply Taking control of the seafood supply Taking control of the seafood supply King’s Seafood keeps costs at bay by cutting out the middle man Nancy Luna , Senior editor, Nation's Restaurant News July 6, 2018 5 Min Read On a busy Wednesday morning, employees at King’s Seafood Distribution Co. unload dozens of fresh fish shipped from around the world to its Southern California warehouse. This time of year, the warehouse is overflowing with whole fish, oysters, clams and live crustaceans that come from as far away as New Zealand and Chile — and as close as Newport Beach, Calif., about 10 miles from the 15,000-square foot warehouse tucked in a nondescript industrial zone. More Direct to Source stories: Produce: The farmer as restaurant partner >> Meat: New York burger joint builds business around single-source meat >> On this day, a team of Food and Drug Administration employees have just left the Santa Ana, Calif. warehouse. They’re not inspecting. They’re training. The distribution center, which serves 21 restaurants owned by King’s Seafood Co., has proven to be a top-notch training facility for inspectors learning guidelines for similar facilities in Mexico. “What better validation than that,” said Sam King, owner of both the Santa Ana distribution center, and the family-run King’s Seafood Co., based in Costa Mesa, Calif. Local sanddabs from Newport Beach. For King, the distribution arm is proving ground for the old adage: If you want a thing done well, do it yourself. When the Great Recession hit in 2008, King’s Seafood halted growth of its main concepts, Water Grill and King’s Fish House. King, founder and CEO of the company, decided to pivot by opening up his own distribution center to supply his California, Arizona, Nevada and Texas restaurants. Plant operations director Juan Vargas holds fresh caught salmon. The advantage: Supplying 21 restaurants reduces kitchen labor costs, provides razor-sharp quality control, and keeps food costs in check. “This is a dream we’ve always had,” he said. King and his management crew gave Restaurant Hospitality an exclusive tour of the distribution center. The warehouse receives product four times a week from local fishmongers and large suppliers from around the world. On this day, fish cutters are filleting a 250-pound swordfish into about 100 portions that will be distributed to the company’s seafood restaurants. By centralizing the filleting in the 32-degree “Fin Fish Room,” King said he controls product quality and cost.  If he didn’t have the distribution center, each of his 21 restaurants would have to hire and train a cook to filet fish in-house. But, instead, he has nine employees cutting portions to specifications needed at each restaurant. “Our best fish cutters are right here,” King said. That saves on labor, but more importantly, the process means the seafood is handled by fewer people and is portioned in a controlled environment to maintain consistency. Santa Barbara spot prawns are in season, and served the King’s Seafood restaurants including Water Grill. That’s crucial for a high-volume seafood company, whose restaurants serve about 1 million pounds of fresh fish a year, he said. And that number continues to grow for the 34-year-old privately-held company. King and his cousin Jeff, who passed away last year, are next generation restaurant operators. Their fathers, Lou and Mickey King, were also restaurateurs. The cousins teamed up in 1984 to open 555 East Steakhouse in Long Beach, Calif. Sam and Jeff King went on to open seven concepts under the King’s Seafood Company umbrella. Company banners include Water Grill (5 locations in downtown Los Angeles; Costa Mesa, Calif.; Santa Monica, Calf.; San Diego and Dallas); casual-dining chain King’s Fish House (11 locations in California, Arizona and Nevada); Meat on Ocean in Santa Monica; Lou & Mickey’s in San Diego; 555 East American Steakhouse in Long Beach, Calif.; fast-casual Fish Camp in Sunset Beach, Calif.; and Pier Burger at the Santa Monica Pier. Over the last two years, the company has invested millions opening more locations of its premium fine-dining brand, Water Grill. New restaurants have opened in Dallas and Costa Mesa, Calif.  Two more are on the books for Las Vegas, in 2019, and Denver, in 2020. The Las Vegas restaurant will be in the high-profile spot previously held by Wolfgang Puck’s Spago at The Forum Shops at Caesars Palace. Water Grill’s menu is updated daily to reflect the freshest seafood delivered to the distribution center. Because the center buys at a large scale, King said he gets a better price and first choice of some exclusive catches, such as Pacific Sanddabs and oysters from as far away as Prince Edward Island, Canada. The seafood distribution center also acts as the company’s distribution center more broadly. Everything from soup crackers to oils and paper goods are delivered to the site, then re-distributed along with the fish, to each restaurant. This saves King’s Seafood from paying suppliers to truck the goods directly to stores. King’s Seafood Distribution Co. sources its fish from around the world. Its vast network means they can offer diners a wide range of seasonal seafood. “We want to get rid of the middle guy,” said Juan Vargas, director of plant operations. The consumer benefits in several ways. The supply-yourself model saves the restaurants about 10 percent on food costs. That helps keep menu prices reasonable as the company faces costs they can’t control, such as mandatory minimum-wage hikes, which vary from state to state and city to city, King said. Diners, King said, experience an unmatched choice of fresh fish from around the world because the company’s network is wide. The Water Grill menu in late June, for example, featured whole-fish options of wild Brittany Dover sole (priced at $46 a pound), wild Rhode Island black seabass ($39 a pound), farmed Loup de Mer European bass ($32 a pound) and wild New Zealand pink bream ($31 a pound). Tank options included jumbo wild Maryland soft-shell crabs, a main entrée dish, priced at $34 and wild Santa Barbara spot prawns for $50 a pound. With reports of rampant seafood fraud in recent years, King said transparency on the menu is part of the brand’s ethos of serving seafood responsibly. “We want people to trust they’re getting the seafood they are paying for,” King said. Contact Nancy Luna at [email protected] Follow her on Twitter: @FastFoodMaven About the Author Nancy Luna Senior editor, Nation's Restaurant News Nancy Luna is a senior editor at Nation's Restaurant News and a contributing editor at Supermarket News. She covers the industry's largest and most talked about fast-food brands including McDonald's, Starbucks, Chipotle Mexican Grill, Taco Bell, Pizza Hut, KFC and Subway. She is an award-winning journalist with more than 25 years reporting experience. As a veteran business reporter based in Southern California, Nancy has covered some of the country's most beloved food and retail brands including In-N-Out, Taco Bell, Trader Joe's, Aldi, Whole Foods Market, Target and Costco. Luna is a graduate of Cal State Fullerton. When she's not digging for news on her beat, you can find Nancy regaling her fans about her latest dining adventures on her Fast Food Maven social media channels. Contact [email protected] or follow her on Twitter at https://twitter.com/fastfoodmaven See more from Nancy Luna Subscribe to Our Newsletters Get the latest breaking news in the industry, analysis, research, recipes, consumer trends, the latest products and more. Sign Up Now You May Also Like Latest Podcasts Expert Insights Dan Simons of Founding Farmers on why every issue is a restaurant issue Dan Simons of Founding Farmers on why every issue is a restaurant issue Sep 11, 2025 Restaurant Operations Content Spotlight Curry House Japanese Curry and Spaghetti has shuttered, closing all 9 units in Southern California Employees learned of closure when arriving for work Monday Read More Explore About Restaurant Hospitality Subscribe to RH Company News Contact Us Partner With Us Our Capabilities Media Kit Conferences & Events Ad Specifications More From Informa Connect Foodservice CSP FoodService Director Nation’s Restaurant News Restaurant Business Supermarket News Technomic Join Us Subscribe Follow Us Copyright © 2025 Informa Connect Limited. Registered in England & Wales with number 01835199, registered office 5 Howick Place, London, SW1P 1WG. CCPA: Do not sell my personal info | Terms of Use | Code of conduct events | Privacy Policy | Cookie Policy"
    },
    {
      "url": "https://www.cafishgrill.com/pages/contact-us",
      "text": "Contact Us | California Fish Grill Skip to content Menu Locations Responsibly Sourced Nutrition Fundraising Catering About Careers Contact Us No Kids Hungry Socials Instagram Facebook X Youtube © 2024, California Fish Grill, LLC. All Rights Reserved Menu Locations Responsibly Sourced Nutrition Fundraising Catering Order Now Privacy and cookies We use cookies on our website. Your interactions and personal data may be collected on our websites by us and\n          our partners in accordance with our privacy policy. Privacy policy Dismiss contact us drop us a line Contact Us If you’d like to contact our corporate office email us at hello@cafishgrill.com or fill out the form below. For any press inquiries, please reach out to press@cafishgrill.com You can reach our corporate office at 714-525-5809 send us a message Name Email * Topic Recent Restaurant/Order Experience Gift Card Catering Menu General Inquiry Location Anaheim Gateway Anaheim Hills Arizona - Mesa Arizona - Phoenix Bakersfield Brea Burbank Carmel Mountain – San Diego Cerritos Citrus Heights Costa Mesa Culver City Cypress Daly City Downey El Cerrito El Segundo Fountain Valley Fresno Gardena Glendale Hastings Ranch Hollywood & Hillhurst Irvine La Habra Lake Forest Las Vegas – Centennial Las Vegas – Fort Apache Las Vegas - North Las Vegas Las Vegas – Rainbow Blvd Long Beach Los Feliz Mission Hills – Los Angeles North Hollywood Northridge Norwalk Palmdale Puente Hills Redlands Rialto Riverside Rosemead Sacramento - Arden Fair Sacramento - Citrus Heights San Diego - Balboa San Diego - Carmel Mountain San Diego - El Cajon San Diego - Escondido San Diego - Mira Mesa San Diego - Mission Valley San Jose - Almaden San Jose - El Paseo San Jose - Evergreen San Jose - North Park San Mateo Santa Clarita South Gate The Market Place Thousand Oaks Upland Visalia Walnut Creek West Covina Whittier Woodland Hills Comment Send JOIN OUR FIN CROWD Sign up and be the first to know about limited-time offers, new menu items, exclusive events and more! Full Name Email favorite location Favorite Location Anaheim Gateway Anaheim Hills Arizona - Mesa Arizona - Phoenix Bakersfield Brea Burbank Cerritos Costa Mesa Culver City Cypress Daly City Downey El Cerrito El Segundo Fountain Valley Fresno Gardena Glendale Hastings Ranch Hollywood & Hillhurst Irvine La Habra Lake Forest Las Vegas – Centennial Las Vegas – Fort Apache Las Vegas - North Las Vegas Las Vegas – Rainbow Blvd Long Beach Los Feliz Mission Hills – Los Angeles North Hollywood Northridge Norwalk Palmdale Puente Hills Redlands Rialto Riverside Rosemead Sacramento - Arden Fair Sacramento - Citrus Heights San Diego - Balboa San Diego -  Carmel Mountain San Diego - El Cajon San Diego - Escondido San Diego - Mira Mesa San Diego - Mission Valley San Jose - Almaden San Jose - El Paseo San Jose - Evergreen San Jose - North Park San Mateo Santa Clarita South Gate The Market Place Thousand Oaks Upland Visalia Walnut Creek West Covina Whittier Woodland Hills Submit Reach out Follow Us Policies Our App Careers Contact Us Gift\n                        Cards Instagram Facebook X Youtube Privacy Policy Terms of Services Your Privacy Choice © California Fish Grill 2025 Reach out Careers Contact Us Gift\n                            Cards Follow us Instagram Facebook X Youtube Policies Privacy Policy Terms of Services Your Privacy Choice Our App © California Fish Grill 2025 Choosing a selection results in a full page refresh."
    },
    {
      "url": "https://thekingfishcompany.com/investors/",
      "text": "INVESTORS - The Kingfish Company Home Product Sustainability News Investors Recipes Career FAQ/Contact English Dutch French German Italian Spanish Select Page Investors menu Investment Highlights Financial Calendar Share Information Corporate Governance Presentations Annual General Meeting Financial Reports Investors Contact Investment highlights RAS is well positioned to become the third pillar in global seafood supply Wild catch and traditional aquaculture face limitations in seafood supply The Kingfish Company consistent with RAS-sector performance leaders Deep in-house expertise enabling biological outperformance and cost leadership among land-based peers Leader in a highly attractive market with clear ESG angle Operating in the fundamentally strong Yellowtail Kingfish market with a first-mover position Proven unit economics On track to become profitable Unique business case maximizing the strategic advantage of RAS High value species that perform well in the RAS system, while being sold to import dependent markets Financial calendar 27 March 2025 FY 2024 Annual Report and Financial Results 8 May 2025 Q1 2025 Trading update 04 June 2025 Annual General Meeting 01 August 2025 Q2 2025 Trading Update 04 September 2025 H1 2025 Interim Report and Financial Results 06 November 2025 Q3 2025 Trading Update Share information Trading information Trading currency: NOK Quantity notation: Number of units Admitted shares : 110,849,291 Nominal value: 0.01 Share Price: Oslo Bors ICB sectorial classification Industry : 45, Consumer Staples SuperSector: 4510, Food, Beverage and Tobacco Sector: 451020, Food Producers Subsector: 45102010, Farming, Fishing, Ranching and Plantations Identification SYMBOL: KING ISIN CODE: NL00150001S5 LEI CODE:9845004WD3997B9F1061 EXCHANGE / MARKET: Euronext Growth TRADING LOCATION: Oslo ICB: 45102010 Farming, Fishing, Ranching and Plantations IPO IPO DATE: Wed 25/11/2020 IPO PRICE: NOK 20.56 IPO TYPE: Private placement Largest shareholders As of 1st September 2025 Edit Investor Name Holding Stake Creadev International S.A.S 31,502,502 22.1% ASR Nederland 21,419,870 15.0% Rabo Participaties B.V. 17,813,233 12.5% Stolt-Nielsen M.S. Ltd 17,552,236 12.3% Bank Julius Bär & Co. AG 8,426.559 5.9% Claris BV 8,248,957 5.8% Pershing LLC 4,072,138 2.9% Kleinfeld, N. 3,536,771 2.5% Silver Oak Investments Holding C.V 2,880,241 2.0% JPMorgan Chase Bank 2,692,983 1.9% BM Invest BV 2,171,331 1.5% Nutreco International B.V. 1,954,958 1.4% Grober, E. 1,866,108 1.3% Cibus Enterprises Fund LP 1,782,742 1.2% Selzer Investments 1,641,990 1.2% Corporate governance Management board Vincent Erenst Vincent Erenst brings a strong international, operational, and transformational track record with more than 35 years of experience leading aquaculture companies. Most recently, he worked as Chief Operating Officer at Barramundi Group. Prior to this role, he worked as COO of Avramar and for more than 10 years he worked as Managing Director of Mowi Canada West, where he was responsible for strong profit growth through an increase of harvest volumes, efficiency improvements and strengthening of the market position in North America. Jean-Charles Valette Jean-Charles Valette has held various financial leadership positions at food and production companies, both in listed and private environments. Most recently, he worked as the Vice-President Finance of Dott, a fast growing scale-up. Prior to this role, he worked as senior Vice-President Finance for CEVA Logistics, where he was directly involved in generating USD 1.2 billion through a successful IPO on the SIX Swiss stock exchange. Jean-Charles brings great added value towards building, growing and transforming companies. Furthermore, he has strong expertise in corporate finance, process optimizations and transformations. Supervisory board Jeroen Scheelbeek Mr. Scheelbeek (1968) is the Chairman of the Supervisory Board and served on the company’s 1-tier board of directors prior to the conversion of the company to a public limited liability company. Mr. Scheelbeek currently works at Bauhinia, an independent financial advisory boutique firm. In addition, he acts as senior financial advisor to the Dutch Ministry of Economic Affairs. He is also board member and chairman of the risk committee of Moza Banco, a regulated financial institution in Mozambique. Mr. Scheelbeek served, amongst other roles, as global head of structured finance, head of corporate clients and head of corporate finance Asia, in the Rabobank wholesale clients division. He has also acted as member of the highest credit risk committees of the bank. Mr. Scheelbeek has participated in executive management courses at Harvard, IMD, Insead and Kellogg University. He holds a Master’s degree in Business Administration from the Free University of Amsterdam. Mr. Scheelbeek is also a member of the Supervisory Board of Protix. Xavier Govare Mr. Govare is an accomplished senior executive with over three decades of experience in the food industry, including 15 years as Chairman and Chief Executive Officer of Labeyrie Fine Foods. Throughout his tenure, he successfully transformed the company into a leading international food group, increasing revenue from €30 million to €1.1 billion and completing 12 strategic acquisitions. He is recognized for his expertise in strategic vision, marketing, brand development, and financial and operational management. Mr. Govare has extensive experience in managing industrial operations across Europe and navigating complex shareholder structures, including listed companies, LBOs, and private ownership. He currently serves as a board director for several organizations in the agri-food and packaging sectors. Hans den Bieman Mr. Den Bieman (1959) served as the company’s former (interim) CEO and Chairman of the Board. He is currently a shareholder and director of Sealand – the largest smolt producer in Chile. Amongst various top management positions in the field, Mr. Den Bieman served as COO of Nutreco Aquaculture (2000–2005) and as CEO of the Netherlands-based Marine Harvest, the world’s largest fish-farming company, listed on Oslo Børs (now Mowi ASA) (2005–2007). He holds a Master’s degree in Aquaculture (Msc,) from Wageningen University. Via his personal holding company, Mr. Den Bieman held 2 171 331 shares in the capital of the company on 31 December 2024. Jordi Trias Fita Mr. Trias Fita (1977) became President of Stolt Sea Farm in January 2018 after joining the business as Managing Director in 2016. Prior to this he spent 14 years with GBFoods, where he held several positions in marketing, sales and business unit management, located in Spain, Kazakhstan, Russia, Ukraine and Senegal. Mr. Trias Fita holds a degree in Business Administration from the University of Barcelona, a Master’s degree in marketing, and an MBA from the Instituto de Empresa. He is a citizen of Spain. Mr. Trias Fita held no shares in the capital of the company on the Record Date. Mr. Trias Fita also serves as a President of Stolt Sea Farm, part of Stolt-Nielsen M.S. Ltd which owns ~8,3% of the shares in the capital of the company on 31 December 2024. Noam Kleinfeld Mr. Kleinfeld (1977) acted as Managing Director at HSBC Investment Bank, with over 16 years of experience in cross-border M&A, Corporate Finance, Equity/Debt Capital Markets, Leverage Acquisition Finance, Project Finance and Corporate/Debt Restructuring. Further, Mr. Kleinfeld is a co-founder of several businesses, including The Griffin Fund, a leading real estate player in Atlanta’s multifamily segment. Mr. Kleinfeld is an active venture capital investor in early-stage companies with a large TAM, unique technological edge, and strong execution capabilities. Mr. Kleinfeld holds a BA in Business Administration with a Major in Finance from Reichman University. Mr. Kleinfeld held 3 247 883 shares in the capital of the company on 31 December 2024. Articles of Association Rules for the Supervisory Board Updates Presentations Q2 and H1 2025 Financial Results Q4 and FY 2024 Financial Results Q3 2024 Financial Results Q2 and H1 2024 Financial Results Q1 2024 Financial Results Q4 and FY 2023 Financial Results Q3 2023 Financial Results Q2 and H1 2023 Financial Results Business update Q2 2023 Q1 2023 Business Update and 2022 annual report Strategy update & H1 2022 results Q4 and FY 2021 financial results & investor presentation H1 2021 Financial update Business update July 7, 2021 IPO Admission document Business update February 8, 2021 Business update April 14, 2021 Annual General Meeting Minutes of Annual General Meeting of Shareholders of The Kingfish Company N.V. June 4, 2025 Notice of Annual General Meeting of Shareholders – June 4, 2025 Minutes of Extraordinary General Meeting – January 24, 2025. Notice of Extraordinary General Meeting of Shareholders – January 24, 2025 Minutes of Annual General Meeting of Shareholders of The Kingfish Company N.V. June 19, 2024 Notice of General Meeting of Shareholders of The Kingfish Company N.V. June 19, 2024 Minutes of Extraordinary General Meeting of Shareholders of The Kingfish Company N.V. July 24, 2023 Notice of Extraordinary General Meeting of Shareholders of The Kingfish Company N.V. July 24, 2023 Minutes of Annual General Meeting of Shareholders of The Kingfish Company N.V. June 20, 2023 Notice of Annual General Meeting of Shareholders of The Kingfish Company N.V. June 20, 2023 Minutes of Extraordinary General Meeting of Shareholders of The Kingfish Company N.V. February 27, 2023 2022, 2021 Minutes of EGM 2022, November 16, 2022 – Notice of EGM 2022, November 16, 2022 _ Minutes of AGM 2022, June 9, 2022 – Notice of AGM 2022, June 9, 2022 _ Minutes of EGM 2021, November 4, 2021 _ Minutes of AGM 2021, June 10, 2021 _ Notice of AGM 2021, June 10, 2021 Financial Reports Financial Results H1 2025 Integrated Annual Report 2024 Financial Results H1 2024 Integrated Annual Report 2023 Financial Results H1 2023 Integrated Annual Report 2022 Financial Results H1 2022 Integrated Annual Report 2021 Financial Results H1 2021 Annual Report 2020 Financial Results H1 2020 Financial Report 2019 – Audited The team behind The Kingfish Company Vincent Erenst CEO Jean-Charles Valette CFO Bram Rohaan Head of Production The Kingfish Company Bob van Son Business Development Manager The Kingfish Company Lauren Enz VP of Sales The Kingfish Company Gudo klein Gebbink Head of Sales The Kingfish Company Sander Ruizeveld de Winter Head of Hatchery The Kingfish Company Christiaan de Wet Head of Design & Engineering The Kingfish Company Hope Kitterman Head of Marketing The Kingfish Company Martina Sponga Business Development Manager The Kingfish Company Els van Haelst Head of People and Culture The Kingfish Company Sign Up to Receive Investor News Releases from The Kingfish Company by sending an email to IR@thekingfishcompany.com Join our amazing team! Check open positions Homepage Product Methodology News Investors career FAQ/Contact Oost-zeedijk 13 4485 PM Kats The Netherlands info@thekingfishcompany.com +31 (0) 113 74 54 61 Terms and Conditions Privacy Notice Cookies Follow Follow Follow"
    },
    {
      "url": "https://kingfishgrill.com/contact/",
      "text": "Contact – Kingfish Grill in St. Augustine Florida Skip to content Home Our Menu Kingfish Drink menu Contact Main Menu Home Our Menu Kingfish Drink menu Contact Reservation Reservation Contact Us Dining In St. Augustine at the Kingfish Grill! Our Location 504 West Geoffery Street \nSt. Augustine, FL 32086 US You are the backbone of our business. Your suggestions and feedback are always welcome. Feel free to drop us a line at: info@kingfishgrill.com Call Us 904-824-2111 Join Our Mailing List We also invite you to become part of our Kingfish Crew. You’ll be the first to hear about special events & promotions and what’s happening here at the Kingfish Grill. We respect your privacy and your personal information will not be shared with any third party for any reason. Stay updated about promotions and events at Kingfish Grill. For a limited time,  join our mailing list and get a coupon for $10 OFF on your next visit to Kingfish Grill. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Would you like to join our email list? Yes, sign me up! Submit Kingfish Grill was established in June 2005 by owner Paul Mackey. Originally from coastal New England, the restaurateur has a passion for seafood, using his background & upbringing to contribute to the flare and spice at Kingfish Grill. The team at Kingfish Grill have made it a favorite restaurant among locals and visitors alike. Facebook Instagram Yelp Tripadvisor Our Location The Kingfish Grill 504 West Geoffery Street St. Augustine, FL 32086 US Get Driving Directions Quick Links Home About Us Menu Drink Menu Reviews Contact Us Our Hours Wednesday & Thursday 4PM - 9PM Friday 4PM - 10PM Saturday 11:30AM - 10:00PM Sunday 11:30AM - 9PM Monday & Tuesday Closed Copyright © 2025 Kingfish Grill in St. Augustine Florida Built by Microraptor Computer services"
    },
    {
      "url": "https://thekingfishcompany.com/news/new-ceo-for-the-kingfish-company/",
      "text": "New CEO for The Kingfish Company - The Kingfish Company Home Product Sustainability News Investors Recipes Career FAQ/Contact English Dutch French German Italian Spanish Select Page New CEO for The Kingfish Company The Kingfish Company 2 January 2023 The Kingfish Company [Euronext: KING], a pioneer in sustainable land-based aquaculture, has selected Vincent Erenst as Chief Executive Officer, effective February 6th, 2023. The Kingfish Company will recommend the appointment of Vincent Erenst as Chief Executive Officer at an Extraordinary General Meeting of Shareholders (EGM), to be held early 2023. “We are very pleased to propose Vincent Erenst as the new CEO of The Kingfish Company. He has an impressive track record in driving performance improvements and value creation across a broad range of businesses in the aquaculture sector. We are convinced that Vincent is a very suitable CEO to bring The Kingfish Company to the next level of performance. On behalf of the Supervisory Board, I welcome him as the next CEO of The Kingfish Company, and we wish him success in his new role to further shape The Kingfish Company while playing a key role in driving the strategy and reinforcing the market position of our company”, said Jeroen Scheelbeek, the Chairman of The Kingfish Company. a The Kingfish Company [Euronext: KING], a pioneer in sustainable land-based aquaculture, has selected Vincent Erenst as Chief Executive Officer, effective February 6th, 2023. The Kingfish Company will recommend the appointment of Vincent Erenst as Chief Executive Officer at an Extraordinary General Meeting of Shareholders (EGM), to be held early 2023. “We are very pleased to propose Vincent Erenst as the new CEO of The Kingfish Company. He has an impressive track record in driving performance improvements and value creation across a broad range of businesses in the aquaculture sector. We are convinced that Vincent is a very suitable CEO to bring The Kingfish Company to the next level of performance. On behalf of the Supervisory Board, I welcome him as the next CEO of The Kingfish Company, and we wish him success in his new role to further shape The Kingfish Company while playing a key role in driving the strategy and reinforcing the market position of our company”, said Jeroen Scheelbeek, the Chairman of The Kingfish Company. Vincent brings a strong international, operational and transformational track record with more than 35 years of experience leading aquaculture companies. Most recently, he worked as Chief Operating Officer at Barramundi Group. Prior to this role, he worked as COO of Avramar and for more than 10 years he worked as Managing Director of Mowi Canada West. “I am thrilled to take on this new challenge and responsibility. With a best-in-class product, cutting edge RAS technology and a strong and motivated team, The Kingfish Company is perfectly positioned to further implement its growth strategy. I am very proud to take the lead of a great team and will put all my efforts into getting The Kingfish Company to the next level in the coming years”, said Vincent Erenst. For media and investor inquiries, please contact: n press@the-kingfish-company.com ir@the-kingfish-company.com About The Kingfish Company N.V. n The Kingfish Company is a pioneer and leader in sustainable land-based aquaculture. Current annual production capacity at its Kingfish Zeeland facility in the Netherlands is 1,500 tons of high quality and high value Yellowtail Kingfish. Expansion is underway and capacity in the Netherlands is expected to reach 3,500 tons in Q1 2023. Kingfish Maine is now fully permitted by local, state and federal regulatory agencies. n Production is based on advanced recirculating aquaculture systems (RAS), which protect biodiversity and ensure biosecurity. Animal welfare is paramount, and the fish is grown without use of antibiotics and vaccines. Operations run on 100 percent renewable energy, sourced from wind, solar and biogas. The Company’s facilities operate on sea water, avoiding wasting of precious fresh water. The Kingfish Company’s main product at present, the Yellowtail Kingfish (also known as Ricciola/Hiramasa/Greater Amberjack) is a highly versatile premium fish species, well known in the Italian and Asian fusion cuisines. Its products are certified and approved as sustainable and environmentally friendly by Aquaculture Stewardship Council (ASC), Best Aquaculture Practices (BAP) and British Retail Consortium (BRC). It was the winner of the 2019 Seafood Excellence Award, and it is recommended as green choice by Good Fish Foundation. Vincent brings a strong international, operational and transformational track record with more than 35 years of experience leading aquaculture companies. Most recently, he worked as Chief Operating Officer at Barramundi Group. Prior to this role, he worked as COO of Avramar and for more than 10 years he worked as Managing Director of Mowi Canada West. “I am thrilled to take on this new challenge and responsibility. With a best-in-class product, cutting edge RAS technology and a strong and motivated team, The Kingfish Company is perfectly positioned to further implement its growth strategy. I am very proud to take the lead of a great team and will put all my efforts into getting The Kingfish Company to the next level in the coming years”, said Vincent Erenst. For media and investor inquiries, please contact: n press@the-kingfish-company.com ir@the-kingfish-company.com About The Kingfish Company N.V. n The Kingfish Company is a pioneer and leader in sustainable land-based aquaculture. Current annual production capacity at its Kingfish Zeeland facility in the Netherlands is 1,500 tons of high quality and high value Yellowtail Kingfish. Expansion is underway and capacity in the Netherlands is expected to reach 3,500 tons in Q1 2023. Kingfish Maine is now fully permitted by local, state and federal regulatory agencies. n Production is based on advanced recirculating aquaculture systems (RAS), which protect biodiversity and ensure biosecurity. Animal welfare is paramount, and the fish is grown without use of antibiotics and vaccines. Operations run on 100 percent renewable energy, sourced from wind, solar and biogas. The Company’s facilities operate on sea water, avoiding wasting of precious fresh water. The Kingfish Company’s main product at present, the Yellowtail Kingfish (also known as Ricciola/Hiramasa/Greater Amberjack) is a highly versatile premium fish species, well known in the Italian and Asian fusion cuisines. Its products are certified and approved as sustainable and environmentally friendly by Aquaculture Stewardship Council (ASC), Best Aquaculture Practices (BAP) and British Retail Consortium (BRC). It was the winner of the 2019 Seafood Excellence Award, and it is recommended as green choice by Good Fish Foundation. Homepage Product Methodology News Investors career FAQ/Contact Oost-zeedijk 13 4485 PM Kats The Netherlands info@thekingfishcompany.com +31 (0) 113 74 54 61 Terms and Conditions Privacy Notice Cookies Follow Follow Follow"
    },
    {
      "url": "https://www.kingfishermidlands.co.uk/contact/",
      "text": "Contact Us | Kingfisher Midlands : Kingfisher Midlands Search @kingfishermidlands Online ordering Close login Online ordering login Enter your login details below and start ordering today. User ID Password Login Register Here Forgot Password? Become a customer Menu Close Our seafood Explore our fish and seafood Back to main menu Our fishermen What's in season Preparation Become a customer Sustainability Work with us to make sustainable choices for your menu. Sustainability Our story Local fishmongers supplying national customers – learn more about us. Learn more Our story Find out more about us Back to main menu Why choose us?! Our delivery area Our team Our customers Our seafood Learn about all the fantastic species of fish & seafood available. Learn more What's in season Find out which fish is in season, to assist with your menu planning. Learn more Sustainability Our online shop Contact us Back to main menu Become a customer Join our team Become a customer Home » Contact us Contact us Get In Touch Notice: JavaScript is required for this content. Kingfisher Midlands Address: Unit E Austin Way Great Barr Birmingham B42 1DU ZIP / Address: Radius: 1mi 5mi 10mi 25mi 50mi 75mi 100mi 150mi 200mi 300mi No results found in this location. Please try again. Our office hours are 7am to 3pm Monday to Friday . Out of hours our voicemail service is available. Alternatively you can email us, order online or via the app. Enquiries tel: 0121 622 8830 Email: sales@kingfishermidlands.co.uk Learn more about our online ordering and app. Order Online Join our mailing list Subscribe today by letting us have your email address to receive info about our latest news & offers. By signing up to receive Kingfisher Midlands’ e-mails, you confirm that you are aware your personal data will be used in line with our website use terms and conditions and our privacy policy . Our story Our delivery area Join our team Our seafood What’s in season New customer credit application form Terms & conditions Privacy policy Cookies policy Trading terms & conditions Modern slavery & human trafficking statement Tax strategy Gender pay gap Contact us Kingfisher Midlands, Austin Way, Great Barr, Birmingham, West Midlands B42 1DU 0121 622 8830 sales@kingfishermidlands.co.uk @Kingfishermidlands © Copyright 2022 Kingfisher Midlands  |  Bidfresh Limited trading as Kingfisher Midlands |  Registered in England. |  Company number: 04227047  |  VAT number: GB 643994692. | Seabank House, Southport Business Park, Wight Moss Way, Southport, PR8 4HQ |  Phone: 01803 553 232 |  Email: sales@kingfishermidlands.co.uk Website by ExtraMile | Site map | Privacy policy We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Close GDPR Cookie Settings Privacy Overview Strictly Necessary & Functionality Cookies Analytics Cookies Powered by GDPR Cookie Compliance Privacy Overview This website uses cookies so that we can provide you with the best user experience possible. Cookie information is stored in your browser and performs functions such as recognising you when you return to our website and helping our team to understand which sections of the website you find most interesting and useful. Strictly Necessary & Functionality Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies If you disable this cookie, we will not be able to save your preferences. This means that every time you visit this website you will need to enable or disable cookies again. Analytics Cookies This website uses Google Analytics to collect anonymous information such as the number of visitors to the site, and the most popular pages. Keeping this cookie enabled helps us to improve our website. Enable or Disable Cookies Please enable Strictly Necessary Cookies first so that we can save your preferences! Enable All Save Settings"
    },
    {
      "url": "https://thekingfishcompany.com/contact-faqs/",
      "text": "Contact / FAQ's - The Kingfish Company Home Product Sustainability News Investors Recipes Career FAQ/Contact English Dutch French German Italian Spanish Select Page FAQs Is your fish safe to eat raw? Our processing plant is BRC certified and we have ASC, FoS and BAP Chain of Custody. We guarantee quality and cold chain from processing plant to retailer, but advise consumers to only eat raw fish when prepared by a qualified chef if the cold chain was not compromised. Is your fish fresh or frozen? We sell both fresh and frozen whole fish, fillets, and portions. Frozen fish should be placed in the fridge to thaw if being consumed at home. Please consume within two days of thawing. Does your fish contain any allergens? CONTAINS: FISH However, our fish does not share processing lines with any other allergens like shellfish or nuts. Is your fish healthy? CONTAINS: FISH Fish is a fantastic source of high-quality protein and heart-healthy omega 3 fatty acids. Raising fish in a well managed environment means no contaminants. Our fish can be enjoyed regulary as part of a healthy diet. Where can I buy your fish? Contact our sales team at order@thekingfishcompany.com for wholesale, distribution, and retail information. Does your fish contain GMOs, vaccines, or antibiotics? Our processing plant is BRC certified and we have ASC, FoS and BAP Chain of Custody. We guarantee quality and cold chain from processing plant to retailer, but advise consumers to only eat raw fish when prepared by a qualified chef if the cold chain was not compromised. Our locations The Kingfish Company is operating at the cutting edge of sustainable, land based, high value marine aquaculture in the EU and the US. Based in the Dutch province of Zeeland, Kingfish Zeeland taps into the pristine marine estuary water of the Eastern Scheldt, a Natura 2000 nature reserve, to deliver a healthy, antibiotic-free premium delicacy: The Kingfish Company Yellowtail (Seriola Lalandi / Dutch Yellowtail / Hiramasa / often used interchangeably with close cousin Hamachi). The Kingfish Company Zeeland, NL With an optimally located site near Chandler Bay, Jonesport, Kingfish Maine will be servicing the US market daily. The Kingfish Company is a first mover operating at the cutting edge of sustainable, land based, high value marine aquaculture in the EU and the US. The Kingfish Company Maine, US Get in touch! Want to know more about our products, farming system or history? Get in touch! Hi, my name is I am interested as an investor chef customer ... I’d like to pop over and learn more about The Kingfish Company! You can reach me on my phone number or my email address and I live in Submit Reach us Oost-Zeedijk 13 4485 PM Kats, The Netherlands info@thekingfishcompany.com +31 (0) 113 74 54 61 Homepage Product Methodology News Investors career FAQ/Contact Oost-zeedijk 13 4485 PM Kats The Netherlands info@thekingfishcompany.com +31 (0) 113 74 54 61 Terms and Conditions Privacy Notice Cookies Follow Follow Follow"
    },
    {
      "url": "https://kingfisherdublin.com/eat/",
      "text": "Dining | Kingfisher Best Price Guaranteed Kingfisher Rooms Dining Our History Gallery Explore Blog About Us Contact Us Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now Dining Book Now WE ARE OPEN! No table bookings are required—just walk in and enjoy! Opening Hours: Monday to Saturday: 12:00 PM – 9:00 PM (Kitchen closes at 9:00 PM) Summer hours:July- Sundays Open from 10:00am – 9:00pm August Sundays Open From 12:00pm  -9:00pm Stay updated with our latest news and specials by following us on Facebook and Instagram! A Family Tradition Since 1976 In 1976, our parents, Mike and Cathy, opened a small fish & chip shop on Dublin’s Parnell Street. Over the past 47 years, our family restaurant has grown into one of Dublin’s most beloved spots for traditional Irish food. As one of the last remaining family-run restaurants in the heart of the city, we take great pride in sourcing only the freshest ingredients, traveling across Ireland to hand-pick the finest produce for our dishes. We even grow our own potatoes on our family farm! We believe in fresh, homemade food: Our breads are baked fresh every morning. Our chips are hand-cut daily. We squeeze our own fresh orange juice. And of course, we bake our own delicious desserts! But what we truly pride ourselves on is our fish. For over 47 years, we’ve been perfecting our signature Fish & Chips, along with other classic dishes like salmon, plaice, ray, and sea bass, cooked in a variety of styles that have kept locals and tourists coming back for generations. Step inside, and you’ll find a warm and inviting space, filled with the comforting aroma of fresh, home-cooked food. Our restaurant is a place where everyone feels welcome—whether you’re a regular, a first-time visitor, or just passing through Dublin. With a friendly team, a relaxed atmosphere, and a passion for great food, we’ve created a genuine home-from-home dining experience where quality, tradition, and hospitality come together. We look forward to welcoming you soon! Opening Times We Are Open for Business! Join us for indoor dining or enjoy our newly opened outdoor terrace—both open from 12:00 PM to 9:00 PM, Monday to Saturday. Closed on Sundays & Bank Holiday Mondays Last kitchen orders at 9:00 PM No table bookings required, except for groups of 8 or more. For group reservations, please contact us: 📞 Phone: 01 872 8732 📧 Email: kingfisherdublin167@gmail.com We look forward to welcoming you! Facilities Children’s Menu Gluten friendly Menu Children of all ages Family Friendly WIFI Vegetarian / Vegan Menu Draught Beer & Wine selection Outdoor terrace in the sunshine. Our Menus Breakfast Dinner Desserts Drinks Takeaway Vegetarian / Vegan Menu Breakfast Freshly Squeezed Orange Juice €4.00 Fresh fruit bowl freshly prepared seasonal fruit €4.50 Homemade Odlums Porridge served with (Banana & Cinnamon) or (Sultanas & Honey) €5.00 The best scones in town fresh, fluffy and served with fresh cream and jams €3.50 The Full Irish 2 Pork sausages, Juicy Bacon, Egg as you like, grilled mushrooms, baked beans, Kelly’s Black & White pudding, rosemary diced potatoes and toast €13.00 The Veggie 2xEggs as you like, avocado, grilled mushrooms, rosemary diced potatoes, roasted tomato, baked beans and toast €13.00 Farmers Plate scrambled eggs, juicy bacon, Kelly’s black pudding, rosemary diced potatoes, sweet tomato relish, homemade brown soda bread €12.00 The Regular Juicy Bacon, 2 Pork sausages, Egg as you like and toast €9.50 The Skinny Mini 2 Poached eggs, Juicy Bacon, Tomato, homemade brown soda bread €9.50 Avocado & Scrambled Eggs w/ granary brown toast €10.50 The Healthy Platter homemade porridge, fresh fruit bowl, glass of freshly squeezed juice and homemade soda bread €9.50 Irish Smoked Salmon & Scrambled eggs w/ homemade brown soda bread €12.00 Breakfast Omelette 3 egg omelette with bacon, sausage, tomato, Ballymaloe tomato relish and homemade brown soda bread €10.00 Smoked fish of the day Served with poached egg and homemade brown soda bread €15.00 Bacon Butty Juicy bacon, Ballymaloe relish (on the side) on fresh white bread €9.50 Breakfast Sambo 2 pork sausages, juicy bacon, fried egg and Kelly’s white pudding served on white or brown bread €9.50 Fiery hot chicken wings tossed in franks hot sauce, garlic dip, celery sticks €15.00 Kiddies corner Bacon, egg and toast €8.00 Sausage, beans, toast €8.00 Scrambled egg and toast €8.00 Beans on toast €6.50 {Kids meals served with glass milk} The good old extras Juicy Bacon €1.50 2 Sausages €2.00 Fried or Poached egg €1.00 Scrambled egg €2.00 Mushrooms €1.50 Baked beans €1.50 Black or white pudding €1.50 Tomato €1.00 Brown or white toast €1.20 Homemade brown soda bread €1.50 Portion of Proper chips €6.50 Dinner Starters Homemade soup of the day (Vegetarian Option) Served w/ homemade brown soda bread €7.00 Seafood Chowder Creamy chowder with a selection of smoked and fresh fish with homemade soda bread €11.00 Hot and spicy chicken wings tossed in Franks hot sauce, garlic dip and celery sticks €11.00(S)/15.00(L) King Prawn Cocktail King prawns tossed in signature Marie rose sauce served on a bed of mixed green salad €11.00 Smoked Salmon Served w/ homemade brown soda bread, garden salad and our signature Marie rose sauce €11.00 Seafood platter Golden crisp scampi, smoked salmon on brown soda bread, king prawn cocktail, fish goujons served w/ our signature Marie rose and tartar sauce €21 (S)/ €26(L) Mixed Platter Franks hot sauce chicken wings, breaded chicken goujons, crispy onion rings,served w/ garlic mayo and sweet chili sauce €19 (S)/€26(L) From the Sea Our Famous Fish & Chips golden crisp Haddock,proper chips and homemade tartar sauce (on the side) €20 Golden Crisp Smoked Coley €17 Golden Crisp Scampi €20 Fresh Cod €21 Grilled fillet of Cajun Salmon-subject to availabilty €23 Whole Sea bass-subject to availabilty cooked on the bone, served w/ garden salad and creamy mashed potato €24 Old home favourites Beef Lasagne layers of pasta with tomato ragu, with Irish mince beef, béchamel sauce served with crunchy coleslaw and proper chips €15 Fishermans pie in a creamy white wine sauce, with smoked haddock, king prawns, fresh haddock and topped with puff pastry.Subject to availability €18 From the farm Mixed grill Pork chop, lamb’s liver, juicy bacon, 2 pork sausages, soft fried egg, baked beans, crispy onion rings,sauté onions, proper chips</td. €20 Grilled Pork Chop** served w/ sauté onions, creamy mashed potato and seasonal vegetables €15 Lambs Liver and crispy bacon ** served w/ sauté onions, proper chips and seasonal vegetables €13 Bangers & Mash 3 pork sausages, creamy mashed potato, crispy onions rings and homemade gravy €13 All Day Breakfast (Vegetarian Option Available) 2 pork sausages, 2 eggs as you like, juicy bacon, Kelly’s black and white pudding, rosemary diced potatoes, baked beans, grilled mushrooms, (2) toast and pot of tea or filter coffee €15 Breast of Chicken curry (Vegetarian Option) /strong> Served in a medium spicy curry sauce, with onions, mushrooms and served with boiled basmati rice or proper chips €17 Chicken goujons proper chips, baked beans and garlic mayo €14 Bacon, Egg, 2 Sausages served with proper chips €10 Salads & Sandwiches Peri Peri chicken ceaser salad (Vegetarian Option available) /strong> Juicy bacon, peri peri chicken, lettuce leaves, parmesan shavings, garlic and herb croutons, creamy ceaser dressing. €13 Add King prawns €7 Seafood Cobb Salad Grilled king prawns, smoked salmon, avocado, lettuce, red onions, olives, tomato, cucumber, tossed in our house dressing served with homemade soda bread (on the side). €20 The BLT (Vegetarian Option available) crispy bacon, lettuce, fresh tomato, mayo served on white or brown €8.50 The Supreme with crispy bacon, grilled chicken, lettuce, fresh tomato, cheddar cheese, mayo served on granary brown bread €8.50 Breakfast sambo crispy bacon, soft egg, 2 pork sausages, Kelly’s white pudding served on white bread with sweet tomato relish (on the side) €9.50 Open seafood sandwich smoked salmon, fresh king prawns, lettuce, tomato, red onion served on homemade soda bread w/ marie rose sauce €14 Open prawn sandwich fresh grilled king prawns, lettuce, red onion, cucumber served on homemade soda bread w/ marie rose sauce €13 all sandwiches served with proper chips add cup of soup for €3.00 Burgers 8oz Cheddar cheese & bacon Irish beef burger topped with fresh lettuce, tomato, fried onions, signature burger sauce served on a toasted brioche bun €17 8oz Premier Irish beef burger topped with juicy bacon, soft fried egg, fresh lettuce, tomato, fried onions, sweet tomato relish served on a toasted brioche bun €18 4oz Irish Beef burger topped with fresh lettuce, tomato, fried onion, tomato ketchup served on toasted brioche bun €14 6oz Peri Peri Free range Irish chicken fillet burger topped with juicy bacon, fresh lettuce, tomato, red onion, garlic mayo served on a toasted brioche bun €17 6oz free range Irish chicken ceaser topped with juicy bacon, fresh lettuce, parmesan cheese, ceaser sauce served on a toasted brioche bun €17 6oz Fillet O Fish Burger served with today’s catch of the day, fresh lettuce, tomato and homemade tartar sauce served on a toasted brioche bun €19 6oz Smokey Chiplote Veg Burger A hearty veggie patty topped with crisp lettuce, juicy tomato, and fresh red onion, all drizzled with a rich and smoky chipotle sauce. Served on a soft bun, with optional melted cheese/td> €15 **Choose from 1 side EXTRA TOPPINGS: Juicy Bacon 1.50 Fried egg 1.50 Gherkins FREE cheddar Cheese 1.00 Onion rings 1.50 Burger sauces: sweet tomato relish, garlic mayo, franks hot sauce, sweet chili, Secret burger sauce, BBQ Kids Menu (Under 12′) Baby Bowl w/ mash potato, carrots and gravy €5.00 Buzz & Woodie: Sausage, baked beans and proper chips includes dessert of ice-cream €8.00 Spongebob: Chicken tenders and proper chips Includes dessert of ice-cream €8.00 Richie Rich: cheese burger and proper chips Includes dessert of ice-cream €8.00 Popeye: Chicken curry served with boiled rice or proper chips, includes dessert of ice-cream €10.00 Captain Hooks Fish n’ Chips fillet of fish, proper chips, includes dessert of ice-cream €10.00 Desserts Tickle that sweet tooth Dark chocolate brownie sundae chunks of brownie, vanilla and chocolate ice-cream, chocolate sauce, topped with fresh cream €7.50 Knickerbockerglory strawberry and vanilla ice cream, raspberry coulis, fresh cream and cherry on top €7.00 Sticky toffee pudding w/ caramel and vanilla ice cream €6 Dark chocolate brownie w/ vanilla ice cream and chocolate sauce €6.50 Homemade of the day cheesecake w/ ice cream or fresh cream €7.50 Bread & butter pudding w/custard and fresh cream €6.00 Apple Crumble w/fresh cream or custard €6.00 Banana split banana boat with jelly and fresh cream, raspberry coulis €6.00 Drinks Cold drinks 300ml Coke (€2.50) ,Diet coke, Fanta orange, Sprite €2.50 Fresh squeezed orange Juice €3.50 Glass Milk €2.50 Pint Milk €3.00 Teas Pot of tea €2.50 Peppermint/ chamomile €3.00 Coffees Espresso/Americano €3.00 Flat white/ Latte/Cappuccino €3.50 Double Espresso €3.00 Hazelnut Latte/ Vanilla Latte €4.00 Mocha(chocolate, espresso, steamed milk) €4.00 Hot chocolate w/ fresh cream and marshmallows €4.00 Irish coffee w/ Irish whiskey and fresh cream €7.50 Baileys Coffee w/ baileys crème liquor and fresh cream €7.50 Bubbles, Beers,Cider & Wine Prosecco €7.00 Mimosa (Prosecco and freshly squeezed orange juice ) €8.00 Birra Moretti Draught beer €7.00 Murphys Draught beer €7.00 Bulmer’s cider €6.00 Galway bay full sail IPA €7.00 Wines CHILE:Glass/bottle-Terra Alta Sauvignon Blanc €7.5/25 CHILE: Glass/Bottle Terra Alta Cabernet Sauvignon €7.50/25 ITALY: Lucci Pinot grigio €8/30 FRANCE: Herbe Sante Chardonnay €8/30 FRANCE: Herbe Sante Merlot €8/30 CHILE:Terrannoble Reserva Pinot Noir €8/30 ITALY: Bosco prosecco frizzante €12/40 Takeaway FISH & CHIPS Fresh Haddock with Chips €13.00 Fresh Cod with Chips €13.50 Scampi with Chips €13.50 Plaice with Chips €11.50 Smoked Fish with Chips €13.00 Fish Goujons(4) with Chips €12.00 Our fish is freshly caught so it may contain small bones. All fish is served with homemade tartar sauce CHIPS FRESH CUT CHIPS €3.90 GARLIC CHIPS €5.50 CURRY CHIPS €5.50 GARLIC & CHEESE CHIPS €6.00 BEANS & CHIPS €6.00 GARLIC, CHEESE, BACON CHIPS €6.50 CHILLI CHEESE, BACON CHIPS €6.50 CHIP BUTTY Choice of sauce €4.50 TUB OF SAUCE €2.00 Garlic, Curry, Hot Sauce, TACO, BBQ, Mayo, Sweet Chili, Gravy OUR POTATOES ARE PEELED & PREPPED IN HOUSE! BURGERS 1/2 lb Burger Lettuce, tomato, onion, ketchup €5.70 1/4 lb Burger Lettuce, tomato, onion, ketchup €5.00 Double Cheese Burger Onions & ketchup €4.50 Cheese Burger Onions & ketchup €4.00 Regular Burger Onions & ketchup €3.50 Chicken Fillet Burger Salad, garlic mayo €6.00 Fillet O’ Fish Crispy fish fillet, lettuce, tartar sauce €7.50 Batter Burger Deep fried 4oz burger €4.50 Wurly Burger Deep fried burger, salad, cheese on a bun €5.00 Veggie Burger Veg pattie burger, salad, cheese on a bun with chiplote sauce €5.50 Add Cheese .80c Add bacon or egg €1.20, Jalapeno €0.50c Gherkins -free SIDES Sausages x2 €3.30 Batter Sausages x2 €3.60 Hot & Spicy Wings €6.00 Seafood Chowder €6.00 Homemade Soup €4.00 Chicken Goujons x5 €6.50 Onion Rings x5 €3.90 Coleslaw €2.50 Baked Beans / Peas €2.50 HOMEMADE DINNERS Lasange and Chips €10.50 Breast of Chicken & Chips €9.50 Chicken Curry & Chips or Boiled Rice €10.50 SANDWICHES Breakfast Sandwich 2sausages, bacon, egg €5.00 Breakfast Roll 2 sausages, bacon, egg €5.00 Jumbo Roll 2 sausages, bacon, egg, white pudding, potato slices and beans €7.00 Supreme Sandwich Bacon, chicken, cheese, crispy lettuce, tomato, red onion, mayo €8.00 The Club Chicken, ham, lettuce, tomato, red onion, cheese, cucumber mayo. €9.00 MADE FRESH WITH 100% IRISH PORK & CHICKEN Freshly Squeezed Orange Juice €3.50 Can Coke €2.00 Can Sprite, Fanta, Diet Coke, Coke Zero €2.00 Still or Sparkling Water €1.50 Tea €2.50 Americano €3.30 Cappuccino €3.30 Latte €3.30 PLEASE MAKE US AWARE OF ANY ALLERGIES AT THE TIME OF ORDERING. Vegetarian / Vegan Menu Starters Homemade soup of the day Served w/ homemade brown soda bread €7.50 Seasonal Salad (VG) Crisp blend of mixed salad leave, juicy tomatoes, red onion and refreshing cucumber with our house dressing €6.00 Tempura Mushrooms (VG) Golden, light- battered fresh mushrooms fried to perfection served with a choice of Garlic sauce or sweet chili sauce served with a green salad. €7.50 Crispy Onion Rings (VG) Golden light battered onion rings fried to perfection, served with a choice of sauce garlic or sweet chilli and a tossed green salad €7.50 MAINS Smokey Chipotle Burger A hearty veggie patty topped with crisp lettuce, juicy tomato and fresh red onion all drizzled with a rich and smokey chipotle sauce served on a toasted bun. (Melted cheese optional(VG)) €15 The Hearty Veggie Plate 2 eggs as you like, avocado, grilled tomato, sautéed mushrooms, baked beans, golden crisp onion rings, hand-cut proper chips, choice of brown or white toast €17 Sweet & Spicy Curry A vibrant medley of tender courgette, roasted carrots, peppers and onions simmered in a rich, aromatic sauce that is sweet with a touch of heat served with basmati rice or proper chips €17 Might Mushroom Spice Bowl Crispy battered mushrooms, golden hand cut chips, stir fried peppers and onions, tossed in our signature spice mix. Served with a choice of sauce, Hot sauce, Curry or Garlic. €10 The AVO-LT (VG) Avocado, Crispy lettuce, Juicy Tomatoes, served with creamy mayo on toasted brown bread served with proper chips €9 Vegan Sauces (VG) Korean BBQ, Sweet Chilli, Cajun, Vegan Mayo. WHAT OUR CUSTOMERS SAY It’s nice to have a quiet coffee at … It’s nice to have a quiet coffee at the family run Kingfisher and experience a bit of the friendly Dublin buzz Michael Buble, Canada The Best Fish n’ chips in Dublin! We loved this restaurant! we tried other fish and chips but this one beated them all! Very very recommended. Also the salmon was very good. Try the irish breakfast too! Pietro, Italy Went twice in one day! This place was so great! We went for breakfast and dinner in the same day. The service was great and both times we went it was packed. The prices are very reasonable and the resturant is very cute and has the homemade feel I love! Natalie Good Irish breakfast and great fish & chips We stayed at the Kingfisher townhouse and had breakfast and lunch at the restaurant. The full Irish breakfast my wife ordered was good and an omelette I ordered was also good. For lunch my wife and myself ordered the fish and chips and WOW… that was an amazing dish! Probably among the best fish & chips I’ve eaten. Patricio, USA Super place!! My wife and I stayed in the guest house while in Dublin for a concert and found it to be excellent. The room was clean and quiet and the staff were friendly and helpful even allowing us to leave our cases in reception for a few hours while we shopped. As for breakfast, Wow!! Kept us going for most of the day. Have ate here many times before and always try to go here when in Dublin as the food and service is first-class!! Would highly recommend both the guesthouse and restaurant to anyone who is visiting Dublin. Robert, Northern Ireland Great food, good value The KINGFISHER is spotless, very clean. The menu has a large range of food. Food is just beautiful, very tasty. Very good prices. 100% going back ! next time we will stay in their B&B. Sarah, Cork Liked it so much we ate there every day My grandson and I stayed in an apartment around the corner from The Kingfisher and ate there every day. The food was always fresh and delicious, and the service was friendly and efficient. In particular, the scones are exceptional, especially first thing in the morning when they’re still warm. Julie, USA Busy and Good Good food, clean and bright, full of lively people. The smoked fish fish and chips was really good. Todd, USA Amazing food It was so good, I love the new homemade lasange with the proper chipper chips. Suzanne, Limerick Freshly cooked food, especially daily fish menu! Super food, freshly cooked, very popular, almost always full, and excellent, caring, waitress service. Value for money too!! Micky, UK Great Food and Better Service My Husband and I went back to Dublin for a second time this year. We ate at the Kingfisher Restaurant last time and returned for several dinners this trip. The grilled trout was the best that I have ever eaten. The people in the Restaurant are Wonderful. Carole, USA Love this place This place is fantastic ! food is fabulous eat here every time i come to dublin and would advise anybody coming to dublin to try this place … everyting on the menu is fab Danielle, Tipperary Tutto perfetto Ambiente tipicamente irlandese, cibo ottimo e servizio eccellente, inoltre i dipendenti sono di una simpatia ed una gentilezza unici. Il rapporto qualità prezzo è veramente buono con 9 euro fai la all day breakfast che è assolutamente da provare almeno una volta comprende 2 uova funghi bacon patate salsicce fagioli pomodori 2 fette di pane tostato burro salse e a scelta the caffè o spremuta di arance fresche .. Ci tornerete di sicuro garantisco Amoriello, Italy Acceuil très chaleureux Le serveur nous a reçu très amicalement en partant et à conversé avec nous tout au long du service. Pour dessert, on a choisi le Triffle. On vous le recommande. Au comptoir alors que nous avons réglé la facture, la propriétaire nous a salué amicalement tout en nous remerciant d’être venu à son restaurant et nous a remis une carte d’affaires à donner à nos connaissances si jamais ceux-ci venaient à Dublin. Endroit très sympathique et la nourriture était, très bonne. Pierre, France Explore the area FAQ Contact Us Cancellations © Kingfisher 2016-2025 166 Parnell St, Dublin 1, Ireland. Phone: +353 1 872 8732 Fax: +353 1 8782 978 Email: kingfisherdublin167@gmail.com"
    }
  ]
}