{
  "fuentes": [
    {
      "url": "https://www.koapressroom.com/press/orourke-promoted-to-president-of-koa/",
      "email": "feedback@koa.net"
    },
    {
      "url": "https://www.koapressroom.com/press/orourke-promoted-to-president-of-koa/",
      "email": "feedback@koa.net"
    },
    {
      "url": "https://www.koapressroom.com/press/orourke-promoted-to-president-of-koa/",
      "email": "newsroom@koa.net"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "email": "info@eastbaydist.com"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "email": "sales@eastbaydist.com"
    },
    {
      "url": "https://koabay.surf/contact/",
      "email": "chad@devcon-enterprises.com"
    },
    {
      "url": "https://koabay.surf/invest/",
      "email": "chad@devcon-enterprises.com"
    },
    {
      "url": "https://www.koacapitalpartners.com/about-us",
      "email": "info@koacapitalpartners.com"
    },
    {
      "url": "https://www.koacapitalpartners.com/about-us",
      "email": "info@koacapitalpartners.com"
    },
    {
      "url": "https://www.danielkoabeaty.com/about/",
      "email": "info@danielkoabeaty.com"
    },
    {
      "url": "https://www.halekoa.com/contact-us",
      "email": "info@halekoa.zendesk.com"
    },
    {
      "url": "https://www.halekoa.com/contact-us",
      "email": "reservations@halekoa.zendesk.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://koa-foundation.com/about-us/",
      "email": "info@koa-foundation.com"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "beatrice.malle@skanem.com",
    "chad@devcon-enterprises.com",
    "feedback@koa.net",
    "info.nairobi@skanem.com",
    "info@danielkoabeaty.com",
    "info@eastbaydist.com",
    "info@halekoa.zendesk.com",
    "info@koa-foundation.com",
    "info@koacapitalpartners.com",
    "jane@skanem.ke",
    "newsroom@koa.net",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "reservations@halekoa.zendesk.com",
    "sachen.gudka@skanem.com",
    "sales@eastbaydist.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com"
  ],
  "nombre_sitio": "koabay.surf",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.koapressroom.com/press/orourke-promoted-to-president-of-koa/",
      "text": "O’Rourke Promoted to President of KOA - KOA Pressroom Toggle navigation Welcome KOA Digital Directory Map of Campgrounds Press Releases O’Rourke Promoted to President of KOA Home » Press Release » O’Rourke Promoted to President of KOA O’Rourke Promoted to President of KOA PDF March 12, 2018 KOA NEWS SERVICE (March 12, 2018) – Toby O’Rourke has been promoted to the role of President of Kampgrounds of America, Inc. The promotion was announced March 9 by the KOA Holdings Board of Directors. The Board also named Pat Hittmeier as KOA Chairman & CEO. O’Rourke has been with KOA since 2011 and most recently served as Chief Franchise Operations Officer for KOA, Inc. “Toby has been an integral part of KOA’s record success the past seven years,” said KOA Chairman and CEO Pat Hittmeier. “Her eye for detail and her drive for excellence in absolutely every area of our business makes her promotion to president a very obvious choice.” Kampgrounds of America, Inc. has experienced record growth in each of the seven years since O’Rourke joined the company. KOA is the world’s largest and most successful system of family campgrounds. It was founded in Billings, Montana, in 1962, and Billings is still the location of KOA’s Home Office.  O’Rourke is the first woman named to the position of President for KOA. “Leadership through strategically focused, clear direction while modeling effort, humility, knowledge and collaborative spirit defines some of Toby’s attributes that I find so invaluable to KOA,” Hittmeier said. “Her support of staff, and her unwavering expectations for quality execution at every level has made KOA a better brand, a better camping system, and a better company.” O’Rourke is a native of Sheridan, Montana. She came to KOA in 2011 as the Director of Digital Marketing. Soon after, she was promoted to the role of Vice President of Marketing for KOA before being named Chief Franchise Operations Officer in January 2016. Prior to coming to Kampgrounds of America, O’Rourke was the Digital Marketing Manager for Whitewave Foods (now DanoneWave) in Broomfield, Colorado.  She also worked in brand management on the Silk Soymilk brand while at WhiteWave Foods as well as on the Hillshire Farms brand for the Sara Lee Corporation (now Tyson Foods) in Downers Grove, Illinois.   O’Rourke worked in the software development and business consulting fields in Montana and Illinois from 2000 to 2007. O’Rourke earned a Bachelor of Arts Degree from the University of Notre Dame, as well as a Master of Business Administration Degree from the Kellogg School of Management at Northwestern University. Quick Search Advanced Search Search Connect With Us newsroom@koa.net | Media Contact KOA Newsroom Kampgrounds of America newsroom@koa.net FOR VENDOR-RELATED QUESTIONS: Please visit www.KOAsupplier.com FOR CAMPER ISSUES: Email feedback@koa.net FOR KOA REWARDS QUESTIONS: Call 888-562-0000 ©2025 Kampgrounds of America Website by Zee Creative Welcome Press Releases Map of Campgrounds KOA Digital Directory Research"
    },
    {
      "url": "https://eastbaydist.com/contact-us/",
      "text": "Contact East Bay Distributors | Get in Touch Facebook-f X-twitter Instagram Youtube Linkedin-in $ 0.00 0 Cart Shop Inventory Management Custom Manufacturing Resources About Us FAQs Contact Us Contact Us Home Contact Us Contact East Bay Get in Touch Have a question or need assistance? Fill out the form below, and our team will get back to you as soon as possible. We’re here to help! Contact Name Email Address Phone Number Message Send 401-254-2960 401-254-2962 sales@eastbaydist.com 400 Franklin Street Bristol, RI 02809 8a-4p M-F Explore Our Collection and Find The Best products We’ve built our business by providing fast, honest, and quality service backed by an extensive line of products at great prices. Shop Now Why choose an ISO company? |Prototype Development | Sub-Assembly | Inventory Management | Custom Machined Plastics |Inline Static Mixers Call Us 401.254.2960 Email Us info@eastbaydist.com Our Location 400 Franklin St, Bristol, RI 02809, USA East Bay © 2025 East Bay Distributors. All Rights Reserved Search Menu Categories Accessories Fashion Toys Shop Blog Portfolio Wishlist Compare Login / Register Shopping cart Close Sign in Close Username or email address * Password * Log in Lost your password? Remember me No account yet? Create an Account Shop 0 Wishlist 0 items Cart My account"
    },
    {
      "url": "https://koabay.surf/contact/",
      "text": "Contact | Koa Bay BREAKING GROUND ON THE LAKE AT KOA BAY: A new experience anchored in the world’s first floating surf pool Home Waves Resort Lifestyle About Contact Invest Select Page Get in on the next golden age of surfing \" * \" indicates required fields First Name * Last Name * Email * Phone inquiry type * inquiry type* General Information Surf Club Membership Media Inquiries Rent a Home Buy a Home Message Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Facebook This field is for validation purposes and should be left unchanged. FREQUENTLY ASKED QUESTIONS Have a question about Koa Bay? Select a topic to explore frequently asked questions. If you can’t find the question or answer you’re looking for, please reach out. What is Koa Bay? Koa Bay is a residential community featuring a Wavegarden Cove surfing lagoon and is designed for families and individuals who seek an active lifestyle. Where is Koa Bay? Koa Bay is located on Midway Road just off of I-95 on Florida’s Treasure Coast. Koa Bay enjoys year-round tropical temperatures and is within one hour of two major airports. Are membership deposits refundable? Yes. You may request a refund for any reason and 100% of your deposit will be refunded to the original form of payment. Do you have to be a surfer to enjoy Koa Bay? Absolutely not. Koa Bay was designed to support all types of residents. Our amenities and design will appeal to surfers and non-surfers alike. Many of our prospective members have one surfer in the family or kids who are interested in making surfing part of their lives. When will Koa Bay be ready for me to move in? We are breaking ground at Koa Bay in October of 2024 and the first residences are estimated to be completed by the 4th quarter of 2026. What other benefits are there to becoming a member at Koa Bay? See the amenities section . Every day, we are adding more exciting features for our members. What forms of payment are accepted for deposits? We accept ACH, credit, debit, or check payments. Our online payment portal allows for easy and secure transactions. Can I invest in Koa Bay without becoming a resident? Yes. See our Founding Members section for more information. Can I schedule a visit? Yes. Use our contact form and a Koa Bay representative will call to arrange a visit. Can non-members surf at Koa Bay? Yes. Koa Bay welcomes the public to surf at the facility. We offer a full line of discount packages , lessons, and camps. Is there any opportunity in the future to recoup the Initiation Fee if I move or no longer want to be a member? The Membership Initiation Fee is fully refundable on a one in, one out basis.  So, when you want or need to resign you notify the Club in writing and the Club will refund your initiation fee when a new member is admitted. If I’m a Surf Club Member is there an additional cost for surfing sessions? As a Surf Club member there is no additional fee on top of the annual dues for surf sessions. What is the expected range for the annual dues? The annual dues are based on the number of family members attributed to the Membership. First member: $7,000. Second member: $3,500. Subsequent members: $1,750. So, for a family of three the annual dues will be $12,500. Are the member benefits available to be shared with guests? Yes, members can have guests at the resort who will receive a discounted guest price for the activities of their choosing. And, of course, share in the member’s other benefits like discounts on F&B and merchandise at the surf shop. Can member benefits be shared with guests even if the member is not present at the property? Guests will not have to be accompanied by the member but, unaccompanied guest visits will be limited and unaccompanied guest will not get certain benefits from the members perks like the ability to book surf sessions in advance, as an example. What percentage of the wave pool time will be provided to members vs non-members / general public? Part of a member’s package of benefits is advance booking of surf sessions and member only surf times. So, a sufficient percentage of surf time will always be available to members (and their guests). We anticipate that when the residence and memberships are fully subscribed there will be limited access for the general public unless you are a guest of the hotel. Besides unlimited surf sessions, what other activities are included with my Membership? Members receive unlimited “beach access” which includes the PumpTrac Skate Park, the Free Solo Climbing Wall over water, beach volleyball and other games, the use of the UNIT Surf Pool and other activities on the Koa Bay lake. How does the Full Residential Membership work? Full Residential Membership requires you to own a home in Koa Bay. However, if the Wavegarden Cove is operational before your home is ready for occupancy you can still surf when you want. The benefit of reserving a membership spot now is it grants you priority to choose your preferred home site and floor plan when they become available. The initiation fee of $45,000 is a one-time fee that includes your household family members that want to surf. The initiation fee is returned if your family decides in the future to resign as a member of the surf club. For example, if you sell your home and move. The annual dues that you will pay is based on the number of surfers you will have in your household. For the first surfer it is $7,000, the second surfer is $3,500 and subsequent surfers are $1,750 each. So, for a family with three surfers the annual dues will be $12,500. This grants you unlimited surf at the Wavegarden Cove and the UNIT Surf Pool in Koa Bay’s lake. Also, you and your family will have priority access to all the other activities offered at the Club including kayaking, SUP and E-Foil surfing on the lake, use of the SURFtracks surfpark, solo climbing over water, beach volleyball and more. All details of the Full Residential Membership will be included in the forthcoming Membership Documents. How does the Fractional Residential Membership work? This is a shared ownership program that allows you and your family to purchase a 1/8th fraction of a resort residence at Koa Bay. (Note, you can purchase as many fractions as you want, up to 8). This grants you 40 days of use per year. While you are in residence you get unlimited surf sessions at the Wavegarden Cove and UNIT Surf Pool in Koa Bay’s lake. Also, you and your family will have priority access to all the other activities offered at the Club including kayaking, SUP and E-Foil surfing on the lake, use of the SURFtracks surfpark, solo climbing over water, beach volleyball and more. The one-time initiation fee for a 1/8th Membership is $5,650. The annual dues for the first household surfer is $875, the second surfer is $438 and subsequent surfers are $219 each. So, for a family of three surfers the total annual dues will be $1,532.. The great thing about the resort residence is they will be surfside offering ‘surf in, surf out’ ability to the Wavegarden Cove. Fractional Residence floor plans and pricing will be published soon. All details of the Fractional Residential Membership will be included in the forthcoming Membership Documents. Investor FAQ What exactly am I investing in? You are investing in Surf Koa Bay, LLC (SKB), the entity formed by the founders of Koa Bay to build, own, and operate the surf resort. SKB generates revenue from multiple sources, including: Surf sessions Food and beverage sales Membership dues Retail sales Lake and other recreational activities A share of the hotel’s profits When you invest, you own Units of SKB and share in the profits from these revenue streams. What is a Founding Member? Founding Member is one of the first 100 investors in the surf resort at Koa Bay. As both an investor and a member of the Surf Club, you receive a unique combination of financial benefits (through your ownership in Surf Koa Bay, LLC) and exclusive membership perks (including priority access to surf sessions, special events, and more). Do I need to be an accredited investor? Yes. All Founding Members must meet the requirements of an accredited investor as defined by the Securities and Exchange Commission (SEC). What is the minimum investment? The minimum investment is $200,000. As a Founding Member, are there any additional costs? Non-resident Founding Members: Pay discounted rates from 20-50% on surf sessions, food and beverage purchases, retail items, guest fees, and other services and optional amenities. Resident Founding Members: If you own a residence at Koa Bay, you will pay annual Surf Club dues, which cover all surf sessions and grant you full membership privileges (see details below). If I own a home at Koa Bay, what additional costs are there, if any? Annual Surf Club Dues: Resident Founding Members pay annual dues based on the number of family members on the membership. First member: $7,000 Second member: $3,500 Each additional member: $1,750 For example, a family of three would pay $12,500 per year. These dues include unlimited surf sessions and use of all other resort amenities. *Initiation Fee Waived: As a Founding Member, you do not pay the one-time Surf Club initiation fee. Does the Founding Membership include my spouse? As a Non-resident Founding Member your spouse and children under the age of 25 are included in your Founding Membership. However, all family members are subject to the same terms as the sponsoring Member. As a Resident member you and your family are subject to paying annual dues (see details below). Are there any homeowner association (HOA) fees at Koa Bay? Yes. If you own a home at Koa Bay, in addition to your Surf Club dues, there will be HOA fees to cover community-wide maintenance, security, and landscaping. Specific details and fee structures will be available in your homeowners’ documents when available. Do I have to own a home at Koa Bay to be a Founding Member? No. You can become a Founding Member without purchasing real estate at Koa Bay. However, if you do decide to live in the community, Founding Members get priority when selecting homes and home sites. Can I use my home at Koa Bay for rental income? Yes. However, there is a 30-day minimum on rentals. This policy helps maintain a healthy, close-knit community and ensures that all residents can fully enjoy the Koa Bay lifestyle without frequent turnover from short-term rentals. Does Koa Bay have an Investor Relations (IR) function? Yes. As a Founding Member, you will receive regular updates, news, and investor reports. Our investor relations professionals are also available to answer any questions you may have about your investment. What wave technology does Koa Bay use? We will be utilizing state-of-the-art wave-generating technology from Wavegarden designed to produce consistent, high-quality waves suitable for every skill level—from beginners to seasoned surfers. The property also includes a UNIT Surf Pool floating in the community’s lake which creates world-class standing waves. When is Koa Bay scheduled to open? Construction timelines can vary based on permitting and other factors. Some residential phases and the lake amenity, including the UNIT Surf Pool is anticipated to be available by the 4th quarter of 2025. We anticipate the Wavegarden surfing lagoon will open in mid to late 2027. Additional amenities and residential phases becoming available thereafter. Is Koa Bay open to the public or private for members only? Koa Bay is primarily a private community with membership-based access to the surf resort. However, in the early years of operations the resort will be open to the public until all the residence and surf club memberships are sold. After that certain amenities may be accessible to the public including select dining options, retail, spa and wellness offerings.  Founding Members, residents and their guests receive priority access and exclusive privileges. Who can I contact for more information or to schedule a visit? You can reach our team by: - Chad LaBonte - chad@devcon-enterprises.com We would be happy to discuss membership, investment details, or schedule a site tour. What if I need to transfer or sell my Membership? Membership transfers and sales are allowed however,  they are subject to certain terms and conditions outlined in the Membership Agreement. If you plan to sell or otherwise transfer your interest, please contact us so we can guide you through the appropriate process. Why does Koa Bay utilize Wavegarden and UNIT Surf Pool technologies? Each technology provides a distinct surf experience—giving surfers options with respect to how that want to progress their craft. It allows for less crowding, more surfing, and therefore greater revenue generation. Can you tell me more about UNIT Surf? There are 4 UNIT Surf Pools in operation worldwide, with 5 more in development. Standing waves are growing in popularity among surfers because of their consistency and ease of access. UNIT Surf Pool creates a focused environment for technical surf training and progression, making it an advantageous tool in Surf Park developments and complementary to larger traveling wave technologies. Learn more about UNIT at surf-pool.com/surf-it . Where can I learn more about Wavegarden? Learn more at wavegarden.com . Can I use the surf package I purchase for the UNIT Surf Pool and the Wavegarden Cove? Yes. The Bronze, Silver, Gold, and Centennial surf packages can be used for surf sessions on the UNIT Surf Pool or the Wavegarden Cove. What are the home types and prices of the homes at Koa Bay? There are a variety of proposed home types at Koa Bay. Including, 2 – 3 bedroom townhomes, 3 – 5 bedroom villas and estate homes, 2 – 3 bedroom condominium units in the lake front midrise buildings, and the surfside bungalows and resort residence. We do not have set prices yet for the homes but we anticipate starting prices will range from the low 400’s to the mid 900’s. Final floor plans and elevations will be published soon as well. © Devcon Enterprises, LLC Waves Resort Lifestyle About Contact Invest Privacy × Request Information Thank you for your interest in Koa Bay. \" * \" indicates required fields First Name * Last Name * Email * I’m Interested in * Please Select News & Updates Purchasing a Home Media Inquiries Surfing at Koa Bay Investor Materials Mailing List Consent * By clicking \"Continue,\" I am consenting to receive email communications & updates from Koa Bay and future Waterbourne properties. * Terms of Use Consent * I agree to the Terms of Use and acknowledge that my information will be used as described in Koa Bay’s Privacy Policy . * reCAPTCHA Name This field is for validation purposes and should be left unchanged. Request Investor Packet Request information on founding membership investments \" * \" indicates required fields First Name * Last Name * Email * Phone Message Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA LinkedIn This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Name This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Email This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. × Membership Signup Reserve your spot! \" * \" indicates required fields Name * First Last Email * Phone * Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which membership are you interested in? * Full Residential Membership Fractional Membership (Coming Soon) I’m unsure. Please send me more information. Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Email This field is for validation purposes and should be left unchanged. × Membership Signup Reserve your spot! \" * \" indicates required fields Name * First Last Email * Phone * Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which membership are you interested in? * Full Residential Membership Fractional Membership (Coming Soon) I’m unsure. Please send me more information. Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Phone This field is for validation purposes and should be left unchanged. ×"
    },
    {
      "url": "https://koabay.surf/invest/",
      "text": "Invest | Koa Bay BREAKING GROUND ON THE LAKE AT KOA BAY: A new experience anchored in the world’s first floating surf pool Home Waves Resort Lifestyle About Contact Invest Select Page Capitalize on the Power of Surf Generating 12.5x higher profit margins compared to golf-focused resorts, and aligning with macro trends around fitness, eating well, and holistic happiness among demographics with purchasing power—Koa Bay is unmatched in investment potential. Sign Up / Sign In Phased Development Plan Koa Bay is being developed—and invested in—in phases. It will ultimately include The Lake and floating UNIT Surf Pool, the Wavegarden Lagoon, 28 surfside bungalows, a skate park, curated food & beverage and retail options, and the resort hotel (all coming soon). PHASE 1 Taking reservations, securing permits, and breaking ground on The Lake at Koa Bay. Home builder selection process underway. Learn More PHASE 2 Developing the Wavegarden Lagoon—including the surf pool, surfside bungalows, pump track skate park and other amenities. Learn More PHASE 3 Building and launching the resort hotel and commercial properties. Learn More Investment Highlights Permitted for a 204-acre, architect-led surf resort grounded in Blue Zone principles—enticing key home-buying demographics Strategically located in one of the most visited regions in the world—drawing traffic from Orlando and Miami Experiential real estate commanding 20-40% higher prices, with surf-anchored resorts outperforming golf by 12.5X The resort will generate multiple sources of revenue including F&B sales, lessons, camps, corporate events, sponsorships, surf session presales. Projecting annual operating profit of $14MM, 35% IRR and 7X MOIC Access to future investment in the surf resort hotel Investment Highlights Permitted for a 204-acre, architect-led surf resort grounded in Blue Zone principles—enticing key home-buying demographics Strategically located in one of the most visited regions in the world—drawing traffic from Orlando and Miami Experiential real estate commanding 20-40% higher prices, with surf-anchored resorts outperforming golf by 12.5X The resort will generate multiple sources of revenue including F&B sales, lessons, camps, corporate events, sponsorships, surf session presales. Projecting annual operating profit of $14MM, 35% IRR and 7X MOIC Access to future investment in the surf resort hotel SINGLE FAMILY RESIDENTIAL Mediterranean-inspired and designed for wind and sun direction, residences at Koa Bay are thoughtfully crafted for intentional living. 123 lots at 40ʼ wide 21 lots at 50' wide [ SINGLE FAMILY RESIDENTIAL (VILLA) Mediterranean-inspired and designed for wind and sun direction, residences at Koa Bay are thoughtfully crafted for intentional living. 82 lots at 30ʼ wide 91 lots at 30' wide [ PARK & GREEN SPACES Koa Bay features linear parks with trails for walking, running, and biking—bringing the outdoors just steps from your home. [ NEIGHBORHOOD RETAIL From local businesses to established brands, Koa Bayʼs retail center provides convenient access to everyday essentials including a grocery store, pharmacy, select retailers, and private dining options. 195,115 square feet of retail space 1,133 parking spaces [ SINGLE FAMILY RESIDENTIAL (VILLA) Mediterranean-inspired and designed for wind and sun direction, residences at Koa Bay are thoughtfully crafted for intentional living. 82 lots at 30ʼ wide 91 lots at 30' wide [ MULTI FAMILY RESIDENTIAL Multifamily residences at Koa Bay are thoughtfully crafted for intentional living. 4 stories, 348 units 264 parking spaces [ CONDO BUILDINGS Two 7-story condominium buildings offer unmatched views of the Lake at Koa Bay. 12 units per floor 1,200 square feet average per unit [ THE STRAND A 136 key select-service hotel adjacent to the Cove. Landscaped and shaded pedestrian corridor with a collection of curated lifestyle retailers and offices. 136 keys 2 stories 86,100 square feet of retail 43,050 square feet of office space [ COMING SOON THE LAKE The expansive 25-acre lake will serve as Koa Bayʼs watersports hub, featuring UNITʼs 16-meter floating surf pool technology. The lake will offer a range of other beach activities beyond surf— including SUPs, kayaking, e-foils, and beach volleyball. White-sand beaches Grab-and-go food options Exclusive events [ THE HUB The Hub will serve as Koa Bayʼs central gathering area, home to reception, changing rooms, and the surf shop. Nestled between the lake and future Wavegarden Cove, The Hubʼs restaurant and bar will offer scenic views of the surf. The building includes private meeting space and a rooftop pavilion reserved exclusively for Koa Bay members. 3 stories 51,835 square feet [ RESORT HOTEL As a sanctuary for visitors inspired by the principals of Blue Zone living, Koa Bayʼs Resort Hotel includes several wellness-driven amenities. The hotel will include a boutique spa & fitness center, curated sundry, and world-class food & beverage offerings. 6 stories 108 keys 48 resort residences 28 surfside bungalows with surf-in, surf-out access [ WAVEGARDEN COVE Koa Bay will be home to the largest Wavegarden Lagoon installation— the most advanced and proven wave making technology to date. Delivering hundreds of perfect waves every hour the Wavegarden Cove can support 70+ surfers at once. 300+ waves/hour 2 sections for advanced surfers 2 sections for intermediate surfers Energy-efficient (~1 kwH/wave) [ TOWNHOMES Positioned in the heart of the property, Koa Bayʼs townhomes offer direct access to the main canal and walking paths. 75 units across 7 buildings [ Timeline & Milestones Securing the land COMPLETED Obtaining entitlements & approvals COMPLETED Securing Community Development District approval to access infrastructure bond financing COMPLETED Raising investment capital for Phase 1 of surf resort AUG 2025–OCT 2025 Accepting Surf Club Membership deposits Infrastructure construction permits secured DEC 2025–JUN 2026 First CDD bond issuance DEC 2025 Site Work (Mass grading, Water & Sewer, Roads, Landscaping) DEC 2025–SEPT 2027 The Lake at Koa Bay with UNIT Surf Pool & Sales Center Open DEC 2026 Lot sales and home construction DEC 2026–COMPLETION Wavegarden Cove construction JULY 2026–AUG 2027 Surf Lagoon Buildings & Amenities OCT 2026–OCT 2027 SKB operational planning MAY 2027–OCT 2027 SKB Private Events & Commissioning SEPT 2027–OCT 2027 Grand Opening OCT 2027 DISCOVER THE POWER OF  SURF-ANCHORED REAL ESTATE Real estate anchored in high-engagement activities delivers pricing power and long-term demand that standard development struggles to match. Within this category, surf is among the highest engagement sports in the world, attracting the active, affluent, and experience-driven. This translates into robust local spending and real estate preferences tied to lifestyle access. HIGHER PROFIT MARGINS Surf-focused resorts hold supreme investment potential and 12.5x higher profit margins compared to golf-focused resorts. CLIMBING REAL ESTATE VALUE Markets like Costa Rica, Encinitas, California, and Byron Bay, Australia have seen real estate values climb steadily, driven by lifestyle migration and demand for surf-accessible homes. INCREASED ECONOMIC ACTIVITY In a 2016 study, researchers used light emission to measure surfing’s economic effects, finding that individual surf breaks generate $18–$25MM in annual economic activity. STRATEGICALLY LOCATED In the heart of one of the most visited regions in the US (101 million visitors per year), our strategic location between Orlando and Miami capitalizes on an established tourism base from theme parks and beaches. Shovel ready Koa Bay has all the necessary entitlements and support from local government agencies for this project (land control and permitting are often the most challenging aspects of a new development). CDD Bond Koa Bay has been granted approval to form a community development district (CDD) enabling the raising and use of bond financing that will be used to cover a majority of its site work including roads, sewers, and water lines. This generates substantial cost advantages. Lack of hotels in surrounding area There are approximately 3,000 hotel rooms in Fort Pierce and Port St Lucie combined, with 88% built prior to 2010. By holding the newest inventory on the Treasure Coast, Koa Bay will take an above-market share of established demand for hotel stays in the region. Investing in Experience According to a recent report, 59% of millennials—our key home-buying demographic—preferred to spend on experiences vs things. These consumers see value in seeing new places, participating in activities, and building an inventory of memories. Koa Bay is built to deliver. Projected Returns (Aggregate over 10 year project term) Annual Profit Margin 35% Total Free Cash Flow $145.2 million Internal Rate of Return (IRR) 32% Return on Investment (ROI) 558% OUR FOUNDERS Bryant Grigsby Founder & Co-Chief Executive Officer Chad LaBonte Founder & Co-Chief Executive Officer Brandon Ripley Founder & Chief Commercial Officer Meet the Full Team Phase 1 The Lake at Koa Bay Phase 1 investments are underway. We are now taking reservations, securing permits, and breaking ground on The Lake at Koa Bay featuring the UNIT Surf Pool. This introductory resort experience, along with everything else to come at Koa Bay, aligns with macro trends around fitness, eating well, and holistic happiness that dominates the narrative among key home-buying demographics. Founders Round Raise: $15,000,000 UNIT SURF POOL CREATES A PROFIT CENTER WITH FAST ROI Koa Bay’s introductory amenity is a source of skill-based entertainment—creating repeat customers, low operating costs, and anchoring surrounding activation zones across the property. PROVEN  CONCEPT 4 operating worldwide with 5 in development Optimized  For broad use Adjustable waves allow for a breadth of surfers TWO-WEEK INSTALLation Fast to get up and running for quick ROI 200,000+  visitors Annually, projecting $2.6MM in revenue Phase 2 Wavegarden Lagoon Phase 2 investments will support the development of the Wavegarden Lagoon including the surf pool, surfside bungalows, pump track skate park and other amenities. This stage aims to broaden Koa Bay’s offerings and stake a claim in man-made wave technology. Residents will have on-demand access to world class waves and perfectly curated amenities that will increase time on-site, drive wallet share, and generate premiums for Koa Bay properties. Phase 2 Capital Raise: Up to $25,000,000 (Coming Soon) Video courtesy of: Wavegarden, Praia da Grama, Alaïa Bay, Wave Park and URBNSURF Melbourne. Wavegarden is the industry leader in man-made wave technology Waves are easily adjustable to fit all levels of surfers in a single session. The Lagoon is able to produce a range of waves from small grovelers for beginners, to barreling waves with air sections for experts. Wavegarden’s Wave Lagoon technology allows for up to 80 surfers per hour Waves are energy efficient with ~1 kWh per wave Average of 450 waves per hour Koa Bay will house Wavegarden’s largest Wave Lagoon installation Tailored to the surf lifestyle Koa Bay Surf Resort has the wave quality, climate, and select amenities that will welcome surfers from the East Coast and beyond to scratch the itch at a fraction of the cost and time of going to Rincon, Costa Rica, or Mexico. Koa Bay’s surf programming has been tailored to fit the habits of surfers and their desire for progression. Appealing to core surfers will secure predictable revenue streams and provide aspirational motivation to new populations. Aligning an active lifestyle with architecture-driven properties to win wallet share and generate returns. From Surf in-surf out bungalows designed to remind surfers of tropical locations from their travels. To a medley of thoughtful amenities to make for a frictionless extended stay. Phase 3 Resort Hotel & Residences Phase 3 investments will support the development of a resort hotel and branded residence offering extraordinary daily surf in, surf out experiences for guests and residents. Koa Bay will also offer co-working spaces, a full suite of fitness, recovery and spa treatments, and concierge services—all contributing to the diverse revenue streams at the resort and drawing high demand from surfers and non-surfers alike. Phase 3 Capital Raise: TBD (Coming Soon) Live your investment Learn more about all that becomes available to you as an investor in Koa Bay: Priority to purchase a residence at Koa Bay. Waived Membership initiation fee. Advanced booking of surf sessions, cabanas, and overnight accommodation at the Koa Bay resort hotel & bungalows. Retail, F&B and Hotel discounts. Exclusive invite and free admission to private events, including pre-opening surf commissioning and grand opening. Priority access to all activities and amenities at Koa Bay and future Waterbourne properties. Learn More Investor FAQ What exactly am I investing in? You are investing in Surf Koa Bay, LLC (SKB), the entity formed by the founders of Koa Bay to build, own, and operate the surf resort. SKB generates revenue from multiple sources, including: Surf sessions Food and beverage sales Membership dues Retail sales Lake and other recreational activities A share of the hotel’s profits When you invest, you own Units of SKB and share in the profits from these revenue streams. What is a Founding Member? Founding Member is one of the first 100 investors in the surf resort at Koa Bay. As both an investor and a member of the Surf Club, you receive a unique combination of financial benefits (through your ownership in Surf Koa Bay, LLC) and exclusive membership perks (including priority access to surf sessions, special events, and more). Do I need to be an accredited investor? Yes. All Founding Members must meet the requirements of an accredited investor as defined by the Securities and Exchange Commission (SEC). What is the minimum investment? The minimum investment is $200,000. As a Founding Member, are there any additional costs? Non-resident Founding Members: Pay discounted rates from 20-50% on surf sessions, food and beverage purchases, retail items, guest fees, and other services and optional amenities. Resident Founding Members: If you own a residence at Koa Bay, you will pay annual Surf Club dues, which cover all surf sessions and grant you full membership privileges (see details below). If I own a home at Koa Bay, what additional costs are there, if any? Annual Surf Club Dues: Resident Founding Members pay annual dues based on the number of family members on the membership. First member: $7,000 Second member: $3,500 Each additional member: $1,750 For example, a family of three would pay $12,500 per year. These dues include unlimited surf sessions and use of all other resort amenities. *Initiation Fee Waived: As a Founding Member, you do not pay the one-time Surf Club initiation fee. Does the Founding Membership include my spouse? As a Non-resident Founding Member your spouse and children under the age of 25 are included in your Founding Membership. However, all family members are subject to the same terms as the sponsoring Member. As a Resident member you and your family are subject to paying annual dues (see details below). Are there any homeowner association (HOA) fees at Koa Bay? Yes. If you own a home at Koa Bay, in addition to your Surf Club dues, there will be HOA fees to cover community-wide maintenance, security, and landscaping. Specific details and fee structures will be available in your homeowners’ documents when available. Do I have to own a home at Koa Bay to be a Founding Member? No. You can become a Founding Member without purchasing real estate at Koa Bay. However, if you do decide to live in the community, Founding Members get priority when selecting homes and home sites. Can I use my home at Koa Bay for rental income? Yes. However, there is a 30-day minimum on rentals. This policy helps maintain a healthy, close-knit community and ensures that all residents can fully enjoy the Koa Bay lifestyle without frequent turnover from short-term rentals. Does Koa Bay have an Investor Relations (IR) function? Yes. As a Founding Member, you will receive regular updates, news, and investor reports. Our investor relations professionals are also available to answer any questions you may have about your investment. What wave technology does Koa Bay use? We will be utilizing state-of-the-art wave-generating technology from Wavegarden designed to produce consistent, high-quality waves suitable for every skill level—from beginners to seasoned surfers. The property also includes a UNIT Surf Pool floating in the community’s lake which creates world-class standing waves. When is Koa Bay scheduled to open? Construction timelines can vary based on permitting and other factors. Some residential phases and the lake amenity, including the UNIT Surf Pool is anticipated to be available by the 4th quarter of 2025. We anticipate the Wavegarden surfing lagoon will open in mid to late 2027. Additional amenities and residential phases becoming available thereafter. Is Koa Bay open to the public or private for members only? Koa Bay is primarily a private community with membership-based access to the surf resort. However, in the early years of operations the resort will be open to the public until all the residence and surf club memberships are sold. After that certain amenities may be accessible to the public including select dining options, retail, spa and wellness offerings.  Founding Members, residents and their guests receive priority access and exclusive privileges. Who can I contact for more information or to schedule a visit? You can reach our team by: - Chad LaBonte - chad@devcon-enterprises.com We would be happy to discuss membership, investment details, or schedule a site tour. What if I need to transfer or sell my Membership? Membership transfers and sales are allowed however,  they are subject to certain terms and conditions outlined in the Membership Agreement. If you plan to sell or otherwise transfer your interest, please contact us so we can guide you through the appropriate process. Why does Koa Bay utilize Wavegarden and UNIT Surf Pool technologies? Each technology provides a distinct surf experience—giving surfers options with respect to how that want to progress their craft. It allows for less crowding, more surfing, and therefore greater revenue generation. Can you tell me more about UNIT Surf? There are 4 UNIT Surf Pools in operation worldwide, with 5 more in development. Standing waves are growing in popularity among surfers because of their consistency and ease of access. UNIT Surf Pool creates a focused environment for technical surf training and progression, making it an advantageous tool in Surf Park developments and complementary to larger traveling wave technologies. Learn more about UNIT at surf-pool.com/surf-it . Where can I learn more about Wavegarden? Learn more at wavegarden.com . Can I use the surf package I purchase for the UNIT Surf Pool and the Wavegarden Cove? Yes. The Bronze, Silver, Gold, and Centennial surf packages can be used for surf sessions on the UNIT Surf Pool or the Wavegarden Cove. What are the home types and prices of the homes at Koa Bay? There are a variety of proposed home types at Koa Bay. Including, 2 – 3 bedroom townhomes, 3 – 5 bedroom villas and estate homes, 2 – 3 bedroom condominium units in the lake front midrise buildings, and the surfside bungalows and resort residence. We do not have set prices yet for the homes but we anticipate starting prices will range from the low 400’s to the mid 900’s. Final floor plans and elevations will be published soon as well. If you have any further questions, feel free to reach out to our team. We look forward to welcoming you to Koa Bay! Disclaimer This overview is furnished on a confidential basis to a limited number of sophisticated investors to provide certain information about investing in membership interests (the “Interests”) in Surf Koa Bay, LLC, the company described herein (the “Company”). These materials are provided for informational purposes upon specific request of or in one-on-one meetings with sophisticated investors who meet certain financial requirements. They are not an offer to sell or a solicitation to buy Company interests, even if such interests may be currently offered to others. Any such offering will be made only in accordance with the Company’s Confidential Investment Materials (the “Investment Materials”). The Company may not be eligible for sale in some states or countries, nor suitable for all types of investors. Prior to investing, investors are strongly urged to review carefully the offering documents, including the risks described therein associated with investing in the Company, to ask additional questions and discuss any prospective investment with their own advisers. Additional information will be provided upon request. This information is strictly confidential and may not be reproduced or redistributed in whole or in part. The statements of investment objectives are statements of objectives only. They are not projections of expected performance nor guarantees of anticipated investment results. Actual performance and results may vary substantially from the stated objectives. An investment in the Company involves a high degree of risk and is suitable only for sophisticated and accredited investors. Investors should be prepared to suffer losses of their entire investments. The Investment Materials contain brief descriptions of certain of the risks associated with investing in the Company. Certain information contained in this document constitutes “forward- looking statements,” which can be identified by the use of forward-looking terminology such as “may,” “will,” “should,” “expect,” “anticipate,” “target,” “intend,” “continue” or “believe,” or the negatives thereof or other variations thereon or comparable terminology. Due to various risks and uncertainties, actual events or results or the actual performance of the Company described herein may differ materially from those reflected or contemplated in such forward-looking statements. None of the information contained herein has been filed with the U.S. Securities and Exchange Commission, any securities administrator under any state securities laws, or any other U.S. or non-U.S. governmental or self-regulatory authority. No governmental authority has passed on the merits of this offering or the adequacy of the information contained herein. Any representation to the contrary is unlawful. HAVE FURTHER QUESTIONS? Frequently Asked Questions © Devcon Enterprises, LLC Waves Resort Lifestyle About Contact Invest Privacy × Request Information Thank you for your interest in Koa Bay. \" * \" indicates required fields First Name * Last Name * Email * I’m Interested in * Please Select News & Updates Purchasing a Home Media Inquiries Surfing at Koa Bay Investor Materials Mailing List Consent * By clicking \"Continue,\" I am consenting to receive email communications & updates from Koa Bay and future Waterbourne properties. * Terms of Use Consent * I agree to the Terms of Use and acknowledge that my information will be used as described in Koa Bay’s Privacy Policy . * reCAPTCHA Email This field is for validation purposes and should be left unchanged. Request Investor Packet Request information on founding membership investments \" * \" indicates required fields First Name * Last Name * Email * Phone Message Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Facebook This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA LinkedIn This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. × Select Package Reserve your spot on the list with a fully refundable deposit. \" * \" indicates required fields Name * First Last Email * Phone Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which Package Would You Like to Purchase? * Surf Session Package Deposit - Bronze Surf Session Package Deposit - Silver Surf Session Package Deposit - Gold Surf Session Package Deposit - Centennial Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. × Membership Signup Reserve your spot! \" * \" indicates required fields Name * First Last Email * Phone * Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which membership are you interested in? * Full Residential Membership Fractional Membership (Coming Soon) I’m unsure. Please send me more information. Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Company This field is for validation purposes and should be left unchanged. × Membership Signup Reserve your spot! \" * \" indicates required fields Name * First Last Email * Phone * Address * Street Address City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Which membership are you interested in? * Full Residential Membership Fractional Membership (Coming Soon) I’m unsure. Please send me more information. Mailing List Consent Add me to the Koa Bay mailing list reCAPTCHA Facebook This field is for validation purposes and should be left unchanged. ×"
    },
    {
      "url": "https://www.koacapitalpartners.com/about-us",
      "text": "About Us | Koa Capital Partners top of page Portfolio Team About Us EIR Program More Use tab to navigate through the menu items. Investor Portal About Us: Welcome ABOUT US Founded and run by two of Hawaii’s most successful entrepreneurs, Chris Eldridge and Dustin Sellers, Koa seeks to preserve, enhance and grow local businesses that can both compete and beat out mainland competitors, while provide a proving ground for the next generation of Hawaii business leaders. The individuals who run our portfolio companies are either an industry standout, a returning Kama’aina looking for a foothold into the business community or an island entrepreneur ready to go to the next level of business management. The majority of our investment dollars come from Kama’aina investors who themselves have run, or continue to run, thriving businesses here in our islands. VALUE ENHANCING TENETS Often a business owner has reached a point in their lives where they are contemplating legacy and future fate of their business. They consider an ESOP, or selling to family members, but often there is no clear path to a sale that preserves and grows what they have spent so long to build. Koa Capital provides the local solution by combining quality local capital with exceptional local management to allow a business owner peace-of-mind that when they sell to Koa their legacy will be preserved and grow in stature. Many small, scrappy entrepreneurs have scratched their way into the mix with little more than a few dollars and their sheer will and tenacity. Koa Capital gives these future local business leaders the opportunity to rapidly expand their businesses by offering fresh capital to invest in things that they needed but presently cannot afford. New trucks, warehouse expansion, hiring of a CFO, purchasing a competitor, to name a few; Koa Capital becomes the investment partner the local entrepreneur always dreamed of having. For the small to medium size business owner, attracting A-level talent to their organization is all but impossible in this thriving economic market. Despite being a leader in their market niche, they are no match in recruiting to the larger more established local brands. Koa Capital, with a track record of success in the local business market, brings with its investment dollars a cadre of qualified individuals looking to be part of a Koa Capital portfolio company. INVESTMENT CRITERIA Koa invests in businesses with profitability greater than 10% over a 3-year period with revenues greater than $5M; the business does not need to be growing We predominantly focus on B2B businesses that may or may not have a consumer direct revenue stream Koa invests in businesses that already have a strong business culture, defined as caring about both their employees and their customer in equal parts Koa Capital Partners Address 1668 S. King St. Suite 300 Honolulu, HI 96826 Contact Info@koacapitalpartners.com Copyright 2023, Koa Capital Partners. All Rights Reserved. bottom of page"
    },
    {
      "url": "https://www.danielkoabeaty.com/about/",
      "text": "Biography | Daniel Koa Beaty BE BOLD. BE TRUE. info@danielkoabeaty.com Welcome Biography Work KOA Let’s Talk Daniel Beaty Productions Welcome Biography Work KOA Let’s Talk Daniel Beaty Productions Daniel Koa Beaty Biography About ABOUT Daniel Koa Beaty is a visionary actor, singer, writer, and social entrepreneur who lives at the intersection of art, spirit, and social change. Raised in Dayton, Ohio, Daniel grew up the child of a heroin addicted, incarcerated father, and younger sibling to a brother addicted to crack cocaine. Daniel learned early on that the arts can help heal childhood trauma, transform pain into power, and inspire a new generation of change makers to dismantle the systemic racism and oppression at the core of the challenges Daniel, his father, brother, and so many Americans face. Daniel Koa Beaty has spent his life telling stories that share both the truth of who we are as people and his hope for a better world. He believes these stories have the power to move us and inspire us, as individuals and as a society, to transform ourselves and the world: to confront our pain, imagine a better world, and work together to achieve it. Daniel has developed an awarding winning body of work that includes his plays Through the Night, Emergency, Mr. Joy, and The Tallest Tree in the Forest – Paul Robeson. These works have been performed at venues ranging from maximum security prisons to The Public Theater, Lincoln Center and White House. He has garnered numerous awards including an Obie award for writing and performance and five NAACP Theater Awards. A highly requested performer and keynote speaker, Daniel has worked throughout the U.S., Europe, and Africa. In these turbulent times of social change facing the nation, Daniel has continued to develop work that confronts, heals and nurtures us all. I see a new world. I see movement in the right direction. And I see something that’s going to give people hope at a time where everybody’s asking, how are we going to get out of this mess?” Daniel Koa Beaty About Artist Visionary Entrepreneur activist I DREAM In 2012, Daniel created I Dream, a nationally recognized social justice initiative. I Dream uses the tools of the arts, immersive group exercises, and trauma recovery to support young people to rewrite the story of race and class inequity in America, and create social justice projects to make that new story reality. I Dream has reached over 2000 young people in three cities across the nation, Watts, CA; Omaha, NE; and Boston, MA. activist An actor in full command of his instrument… variety Astonishing wit, grit, & piercing lyricism… New York Times The voice of a movement that needs to be heard… Ben Veeren Profound wisdom about life and healing… Susan Taylor A gifted and brave soul willing to share what he’s learned from struggling against ugly odds to craft a life of fierce loyalty to truth… Michael Eric Dyson A message of hope and healing to others working to overcome painful obstacles. Mariam Wright Edelman, Founder & President of Children’s Defense Fund LET'S MAKE A DIFFERENCE Daniel Beaty Productions Los Angeles | New York info@danielkoabeaty.com Let’s Get Social contact-section © Copyright Daniel Beaty. All Rights Reserved. Creative: Contact Designers ."
    },
    {
      "url": "https://www.halekoa.com/contact-us",
      "text": "Contact Us :: Halekoa Check In Check Out Book Now Close Book Now Book Now View Search View Navigation ROOMS DINING EXPERIENCES WELLNESS DEALS YOUR STAY SAFETY PHOTO GALLERY CONTACT US Close Navigation Contact Us Contact Information Mailing Address: Hale Koa Hotel 2055 Kalia Road Honolulu, Hawaii 96815 Phone numbers: 1-800-367-6027 or 808-955-0555 Email: Reservations reservations@halekoa.zendesk.com​​​​​​​ All other inquiries info@halekoa.zendesk.com How to get here Click here to view a map and get directions to Hale Koa Hotel. View Map CURRENT WEATHER 84° Thursday, 11 September 16 MPH We Are Here To Help Got a question? Get in touch with us and our staff will do their best to get the answer for you. Please view our FAQs to see if your questions have been answered.  If not please use the form below. Our normal response time is three business days. Thanks for your interest in Hale Koa Hotel. CONTACT US For Reservation inquiries please email reservations@halekoa.zendesk.com Lost and Found Form With so many guests coming and going around Hale Koa Hotel, we can rack up a range of lost items. If you’re missing something, please let us know so we can help you find it. Make sure you include your name, dates of stay, room number and a detailed description of your item(s). Please note that we charge a shipping and handling fee to return your item(s). CONTACT US Rooms Rooms Eligibility Rates & Policies Deals Special Offers Experiences Attractions Activities Tours Events Dining Restaurants Wellness Pool Massage Your Stay Can I Stay Here? Getting Here Traffic Advisory Parking Manage Reservation Waitlist Request About Us AFRC Resorts Employment FAQs History Safety Contact Us Hale Koa Hotel 2055 Kalia Road Honolulu, Hawaii 96815 1-800-367-6027 1-808-955-0555 © 2020 Hale Koa Hotel Site Policies FOIA Accessibility / Section 508 Date updated: 14 May 2024 We're taking you over to a different website. They might have a different privacy policy than we do. We just needed to let you know. Now’s a good time to check your eligibility requirements and website policies . If you want to head back, hit cancel. Continue Cancel We're taking you over to a different website. They might have a different privacy policy than we do. We just needed to let you know. Now’s a good time to check your eligibility requirements and website policies. If you want to head back, hit cancel. I have checked eligibility requirements and verified I am eligible. Continue Cancel Sign up for Vacation Specials! Over 300,000 service members and authorized guests like yourself get monthly vacation specials, discounted offers, and news from Hale Koa Hotel in their email inbox. Get inspired to take a well-deserved and much-needed vacation! To sign up, hit continue button below. You will be leaving our website and we have to let you know they may have a different privacy policy than we do. Continue Cancel Continue"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://koa-foundation.com/about-us/",
      "text": "About Us - KOA Foundation +447966074727 info@koa-foundation.com Facebook X Instagram Facebook X Instagram Home Our Services Gallery About Us Contact Us Donate Select Page About Us KOA Foundation KOA foundation is an NGO which focuses on supporting women, children, youths and families in area of; Fear, Anxiety, Low self-esteem, Depression, Mental Health, Sound mind, Stigmatizations, Achieving in Education, Poverty alleviation, Parenting and Prayer support. \n\nKOA team is passionate about promoting healthy lifestyles and has created platforms to transfer best practices in community healthcare from the United Kingdom and United States to Nigeria, advocating for specific changes to Nigeria’s healthcare policies in the area of mental health policies.\nKOA Foundation organizes seminars, symposiums, workshops and conferences to create awareness. KOA Foundation is a partner to Women Arise Ministry and Sacred Health Resources which provides charity aid to the less privileged children and families in Africa. Our team is made up of versatile and experienced public and motivational speakers who speak at events organized on mental health awareness.\n\nKOA is currently working with government agencies in Nigeria to provide resources and set up centers and access point for individuals and members of the public identified with mental illness. We have a call to passionately serve and be a voice for women, youths and children going through Mental Health challenges. \n\nMental Health is an area within health needs which I am very passionate about. I also firmly believe our great country Nigeria still needs a lot of support and resources to understand and manage this aspect of health. My robust knowledge, clinical skills and expertise in United Kingdom health sector has provided the much needed experience to support Nigeria in the area of mental wellness for its citizens. Hence I and my team of experts from UK & USA have decided to unveil KOA Foundation in Nigeria to partner with, and assist healthcare agencies in providing support for women, youths and families going through mental health challenges View  our services Home | Contact Us | Privacy & Usage Policy ©Copyright 2022 KOA Foundation | Designed and Developed by JBM Digital We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    }
  ]
}