{
  "fuentes": [
    {
      "url": "https://www.kolterhomes.com/aboutus/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/aboutus/",
      "email": "information@kolter.com"
    },
    {
      "url": "https://leadiq.com/c/kolter-homes/5a1dc6e02300005a00ca4c44/employee-directory",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/kolter-homes/5a1dc6e02300005a00ca4c44/employee-directory",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4893/floorplan/madeline/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4893/floorplan/madeline/",
      "email": "information@kolter.com"
    },
    {
      "url": "https://pre-constructionhomes.com/new/florida/port-saint-lucie/astor-creek-golf-country-club/",
      "email": "info@pre-constructionhomes.com"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "email": "rebecca@livinginstylehomes.com"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "email": "stephanie@thehubergroup.com"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4892/floorplan/leslie/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4892/floorplan/leslie/",
      "email": "information@kolter.com"
    },
    {
      "url": "https://www.kolter.com/",
      "email": "info@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/contactus/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/contactus/",
      "email": "information@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "reserveatvictoriacare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "altoncare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "artistrypalmbeachcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "artistrysarasotacare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "astorcreekcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "canopycreekcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "coveroyalecare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindcharlestoncare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindcharlottecare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswinddelandcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindlakelaniercare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindlakewoodranchcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindmyrtlebeachcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindpalmbeachcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindpeachtreecare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindspringhavencare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindtwinlakescare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindvictoriagardenscare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cresswindwesleychapelcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cwhammockoakscare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "cwlakeharriscare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "handsmillcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "information@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "lambianceatavenircare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "mosaiccare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "naturewalkcare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "oakhillreservecare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "pgaveranocare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "rivellacare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "victoriahillscare@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "email": "vizcayafallscare@kolter.com"
    },
    {
      "url": "https://www.kolter.com/astor-creek-golf-country-club-opens-new-sports-court-facilities/",
      "email": "info@kolter.com"
    },
    {
      "url": "https://www.newswire.com/news/kolter-homes-is-pleased-to-announce-astor-creek-golf-and-country-club-22461741",
      "email": "jmanrique@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/news/kolter-homes-unveils-progress-on-luxurious-astor-creek-clubhouse-in-port-st-lucie/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/news/kolter-homes-unveils-progress-on-luxurious-astor-creek-clubhouse-in-port-st-lucie/",
      "email": "information@kolter.com"
    },
    {
      "url": "https://dashhernandez.com/port-saint-lucie/port-saint-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "email": "dhernandez@khov.com"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/lifestyle/membership/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/lifestyle/membership/",
      "email": "information@kolter.com"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4890/floorplan/jordan/",
      "email": "verano_pool_global_header_new@1.5x.jpg"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4890/floorplan/jordan/",
      "email": "information@kolter.com"
    }
  ],
  "mails": [
    "altoncare@kolter.com",
    "artistrypalmbeachcare@kolter.com",
    "artistrysarasotacare@kolter.com",
    "astorcreekcare@kolter.com",
    "canopycreekcare@kolter.com",
    "coveroyalecare@kolter.com",
    "cresswindcharlestoncare@kolter.com",
    "cresswindcharlottecare@kolter.com",
    "cresswinddelandcare@kolter.com",
    "cresswindlakelaniercare@kolter.com",
    "cresswindlakewoodranchcare@kolter.com",
    "cresswindmyrtlebeachcare@kolter.com",
    "cresswindpalmbeachcare@kolter.com",
    "cresswindpeachtreecare@kolter.com",
    "cresswindspringhavencare@kolter.com",
    "cresswindtwinlakescare@kolter.com",
    "cresswindvictoriagardenscare@kolter.com",
    "cresswindwesleychapelcare@kolter.com",
    "cwhammockoakscare@kolter.com",
    "cwlakeharriscare@kolter.com",
    "dhernandez@khov.com",
    "handsmillcare@kolter.com",
    "info@kolter.com",
    "info@pre-constructionhomes.com",
    "information@kolter.com",
    "jmanrique@kolter.com",
    "lambianceatavenircare@kolter.com",
    "mosaiccare@kolter.com",
    "name@company.com",
    "naturewalkcare@kolter.com",
    "oakhillreservecare@kolter.com",
    "pgaveranocare@kolter.com",
    "rebecca@livinginstylehomes.com",
    "reserveatvictoriacare@kolter.com",
    "rivellacare@kolter.com",
    "sales@leadiq.com",
    "stephanie@thehubergroup.com",
    "verano_pool_global_header_new@1.5x.jpg",
    "victoriahillscare@kolter.com",
    "vizcayafallscare@kolter.com"
  ],
  "nombre_sitio": "kolterhomes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.kolterhomes.com/aboutus/",
      "text": "Find New Homes for Sale | Homebuilder | Kolter Homes Kolter Homes Toggle Mobile Menu Locations NC - Charlotte Area Cresswind Charlotte Charlotte's Best Located 55+ Community with great amenities & homes, priced from the $400s. Cresswind Wesley Chapel The Charlotte area's #1 selling 55+ community with new homes from the $400s. Handsmill on Lake Wylie The Gentry at Handsmill on Lake Wylie new move-in ready homes in York, SC from the mid $500s. Cresswind at Rocky River - OPEN 2026 COMING SOON - Cresswind Rocky River, a 55+ Community in Locust, North Carolina SC - Charleston Area Cresswind Charleston Active Adult Living with the most amenities in the area, convenient to Charleston from the $400s. The Ponds Single-family homes near the best schools in the Charleston area, from $400s GA - Atlanta Area Cresswind at Spring Haven Welcome to the 4th Cresswind in the Atlanta-area, located in Newnan, featuring completely new floorplans and a next generation Club Cresswind. Cresswind Georgia at Twin Lakes Georgia's #1 55+ community and home of the state's largest private Pickleball Center - New Homes from the $300s to over $1 Million. Oak Hill Reserve An intimate active adult community in Newnan, GA, offering new homes from the $600s, with easy access to shopping, dining, and local attractions. AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 OPENING 2026: debut Cresswind in Alabama, roughly 13 miles from the Gulf beaches FL - Panhandle NatureWalk at Watersound Origins Gated community located two miles from Alys Beach and 30A. Active, outdoor lifestyle with comfortable backyard living and 2- to 6-Bedroom homes from the $500s. Salt Grass at Ward Creek GRAND OPENING - Kolter Homes debut neighborhood in Panama City Beach offering a new collection of home designs. FL - Greater Orlando Area Cresswind at Hammock Oaks Gated, boutique 55+ community and lifestyle located just 3 miles from The Villages with 2- to 5-bedroom homes with optimal flexibility and personalization from the $300s. Cresswind at Lake Harris 55+ community with direct access to Lake Harris in Tavares, FL, \"America's Seaplane City\" offering 1-story homes with best-in-class personalization options from the $300s. Cresswind DeLand Award-winning 55+ homes and lifestyle with convenient access to Orlando from the $300s. NEW MOVE-IN READY HOMES AVAILBLE NOW. The Reserve at Victoria Kolter Homes in The Reserve at Victoria offers new homes ranging from 2- up to 5-Bedrooms from the $400s FL - South Florida Artistry Palm Beach In the heart of Palm Beach Gardens, this gated community features contemporary single-family homes priced from $1.8M to over $2M. Cove at Park Trace - COMING SOON Intimate new neighborhood in Stuart offering a variety of preserve and wooded views. Cove Royale Award-winning To-Be Built and Move-In Ready Homes located in the heart of Stuart—where style, comfort, and everyday convenience meet. Cresswind Palm Beach at Westlake Next generation active adult living and Club Cresswind amenities in Palm Beach County - from the $500s. L'Ambiance at Avenir Explore Kolter's newest Palm Beach Gardens community in Avenir, with beautifully designed 2-5 Bedroom homes from the $800's. Esprit at Avenir - FALL 2025 Gated, 55+ community with on-site dining, chic clubhouse and next-generation new homes in Palm Beach Gardens. FL - Port St Lucie Astor Creek Golf & Country Club Kolter Homes debuts a Golf Community on the Treasure Coast with an 18-hole course, clubhouse and new homes from the $550s to $2M+. Mosaic Explore new 2–5 bedroom homes in the heart of Port St. Lucie, a thriving location known for comfort, convenience, and charm. PGA Village Verano Neighboring PGA Golf Club, resort-style community in Port St. Lucie with new Single-Family Homes from the $300s. Rivella New collection of 2-4 bedroom homes from the upper $300s in the gated, riverside community of Rivella in Port St. Lucie. FL - Sarasota/Bradenton Artistry Sarasota Final Collection of Move-In Ready homes from the $800s, situated on large homesites with stunning water views. Cresswind Lakewood Ranch Gated, 55+ Active Adult village in Lakewood Ranch close to Sarasota & Bradenton with new homes from the upper $400s. Woodland Preserve Kolter's latest 55+ community in the Sarasota-Bradenton area is now open in Parrish with 2-5 Bedroom homes. Lifestyles & Photos Homes Free Brochure About Kolter Homes A trusted homebuilder in the Southeast U.S., creating communities in Florida, Alabama, Georgia, North Carolina, and South Carolina. We help you find and personalize your ideal home with more choices and expert guidance at every step. Explore Communities More Options. More Guidance. More You. At Kolter Homes, your home should reflect the way you live. Across our communities in the Southeast, we offer more personalization choices than many competitors, averaging 27 structural options per floorplan, plus curated design selections to help you create a home that feels right from day one. Our homebuying process is designed to be clear and supportive, so you can move confidently from discovery to design to move-in. And with professional Design Studio services, personalizing your space is both inspiring and straightforward. Explore the Design Studio Personalization Avg. 27 structural options per plan, plus rich finish selections to match your style. Guided Process Clear steps from first visit to closing, with experts by your side so decisions feel easy. Desirable Locations Communities in areas known for mild climates and low taxes across the Southeast. Cresswind: Award-Winning 55+ Lifestyle Our Cresswind communities are designed for active adults, with a lifestyle program built around four pillars that enrich daily life and build lasting connections. Fitness Wellness, training, and amenities that keep you moving. Relationships Clubs, events, and a welcoming community spirit. Entertainment Spaces and programs for fun, performances, and play. Education Lectures, workshops, and lifelong learning opportunities. See the Cresswind Lifestyle A Homebuying Experience Designed for You 1. Discover Explore communities and floorplans with a knowledgeable team ready to help. 2. Personalize Choose from structural options (avg. 27 per plan) and design selections. 3. Build Craftsmanship, quality checks, and clear communication throughout construction. 4. Move-In & Beyond Close with confidence, our team remains a resource long after move-in. Personalize a Home That’s Right for You Guided appointments make selections simple and enjoyable, bringing your vision to life with finishes, fixtures, and features that suit your style. See Design Inspiration Why the Southeast From the Atlantic coast to vibrant inland towns, our locations are chosen for mild climates, lower taxes, everyday convenience, and authentic local culture. Year-round outdoor living and recreation Growing job markets and thriving downtowns Access to beaches, parks, dining, and entertainment “The number of choices surprised us, in a good way. The team guided us through each step, and we ended up with a home that feels uniquely ours.” — Kolter Homebuyer Ready to Find Your Community? Compare locations, floorplans, and amenities to see what fits your lifestyle. Explore Communities Recognized for Excellence Our communities and lifestyle programs have earned national recognition for design, innovation, and quality of life. Kolter Homes, founded as Kolter Signature Homes LLC, is an affiliate of The Kolter Group LLC. The Kolter Group LLC, together with its affiliates, is a private investment firm focused on real estate development, investment and construction. The Kolter Group LLC, together with its affiliates, has invested in projects with expected value in excess of $30 billion of real estate transactions (both realized and in-process) across multiple asset classes and geographies. Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Home Page Locations NC - Charlotte Area SC - Charleston Area GA - Atlanta Area AL - Gulf Coast FL - Panhandle FL - Greater Orlando Area FL - South Florida FL - Port St Lucie FL - Sarasota/Bradenton Lifestyles & Photos Homes Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://leadiq.com/c/kolter-homes/5a1dc6e02300005a00ca4c44/employee-directory",
      "text": "Kolter Homes Employee Directory, Headcount & Staff | LeadIQ Learn more at LeadIQ.com Start free Kolter Homes Employee Directory Real Estate Florida, United States 51-200 Employees For over two decades, Kolter Homes has been committed to building exceptional residences and \"Creating Better Communities\"â for our residents throughout the southeastern United States.\n\nKolter's home building team strives to deliver the most exceptional value for our residents and surrounding community, and we work to make every aspect of your new home build as smooth and organized as possible. Adding personal touches to your new home includes working with the professionals at our our Design Galleries where you can choose from a wide variety of options to integrate healthy, smart and efficient features into your design.\n\nKolter Homes is an affiliate of The Kolter Group LLC. The Kolter Group LLC, together with its affiliates, is a private investment firm focused on real estate development, investment and construction. Since 1993, The Kolter Group LLC, together with its affiliates, has entered into over $12 billion of real estate transactions (both realized and in-process) across multiple asset classes and geographies. Sign up for free to view info Company overview Email format Find Kolter Homes employees' phone numbers or email addresses Find Employee Kolter Homes Global Highlights Location Employees North America 127 United States Of America 127 Kolter Homes 's Leadership M. C. Chief Financial Officer Mobile Phone Email B. M. Vice President Of Sales And Training Mobile Phone Email D. B. Vice President Of Development And Entitlement Mobile Phone Email N. S. Vice President Of Land Acquisition Mobile Phone Email M. F. Vice President Of Sales & Marketing Mobile Phone Email M. B. Division President Mobile Phone Email V. I. Division President Mobile Phone Email T. S. President At Kolter Mixed Use Mobile Phone Email Contact profiles from Kolter Homes Name Title Contact Info Location Last Update M. B. Division President Mobile Phone Email United States Florida Jul 20, 2025 V. I. Division President Mobile Phone Email United States Florida Aug 08, 2025 T. S. President At Kolter Mixed Use Mobile Phone Email Oct 23, 2024 M. C. Chief Financial Officer Mobile Phone Email United States Florida May 28, 2025 B. M. Vice President Of Sales And Training Mobile Phone Email United States Florida May 26, 2025 D. B. Vice President Of Development And Entitlement Mobile Phone Email United States Georgia Jun 06, 2025 J. W. Vp Of Purchasing Mobile Phone Email United States Florida Jul 20, 2025 K. M. Sr. Vice President Of Amenities Mobile Phone Email United States Florida Jul 31, 2025 M. M. Regional Vice President-Carolinas Region Mobile Phone Email United States North Carolina Jun 03, 2025 N. S. Vice President Of Land Acquisition Mobile Phone Email United States Florida May 27, 2025 1 2 3 â¦ Next > Frequently Asked Questions What is Kolter Homes known for? Kolter Homes operates in the Real Estate industry . The company's main headquarters is located in 4807 PGA Blvd Palm Beach Gardens, Florida 33418 US ; you can contact the main corporate office by phone at +1-561-682-**** . Explore Kolter Homes 's company overview page for more information. What is Kolter Homes 's most common email format? Kolter Homes employees' email format typically follows the pattern of . Trying to find reliable and up-to-date employee contact data? Find more Kolter Homes email formats with LeadIQ. How many employees does Kolter Homes have currently? Kolter Homes has approximately 51 employees as of December 2019 . These team members are located across 1 continents, including North America . Who are Kolter Homes 's key employees and leadership? As of December 2019 , Kolter Homes 's key employees include: Chief Financial Officer: M. C. Vice President Of Sales And Training: B. M. Vice President Of Development And Entitlement: D. B. Vice President Of Land Acquisition: N. S. Vice President Of Sales & Marketing: M. F. Looking for contact data? Unlock accurate emails and phone numbers for your ideal prospects with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4893/floorplan/madeline/",
      "text": "Madeline Model | Astor Creek Golf & Country Club Astor Creek Golf & Country Club Clubhouse & Lifestyle Astor Creek Clubhouse 18-Hole Championship Course Astor Creek Membership EGYM Circuit Training Site Plan & Location Site Plan Area Video & Information Area Points of Interest Homes Jordan 2 Bedroom (up to 4 Bedroom), Flex Room, 2 Bath, Great Room, 2-Car Garage 1,968 Living Area Sq. Ft. Katherine 3 Bedroom (up to 4 Bedroom), Flex Room, 2 Full and 1 Half Bath, Great Room, 2-Car Garage 1,983 Living Area Sq. Ft. Leslie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,129 Living Area Sq. Ft. Madeline 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,289 Living Area Sq. Ft. Natalie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,323 Living Area Sq. Ft. Priscilla 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 3-Car Garage 2,490 Living Area Sq. Ft. Rebecca 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car Garage 2,586 Living Area Sq. Ft. Sophia 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 2,776 Living Area Sq. Ft. Tori 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 2,876 Living Area Sq. Ft. Victoria 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 3,224 Living Area Sq. Ft. Waverly 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 3,265 Living Area Sq. Ft. Wynona 3 Bedroom (up to 6 Bedroom) 3 Full and 1 Half Bath, Great Room, Club Room and 3-Car Garage 3,874 Living Area Sq. Ft. Xena 4 Bedroom (up to 6 Bedroom) 4 Full and 1 Half Bath, Great Room, Club Room, 3-Car and 1-Car Split Garage 3,932 Living Area Sq. Ft. Zara 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room and 4-Car Split Garage 4,222 Living Area Sq. Ft. Photos Schedule Your Tour 4 of 14 Homes Return to Homes 33 PHOTOS Virtual Tour Madeline Starting Price: $608,990 Estimate Your Monthly Payment 4 of 14 Homes Return to Homes Bedrooms 3 Option for up to 4 Full Baths 3 Option for up to 4 Half Baths 1 Stories 1 Optional 2nd Floor Garage 2 Living Area Sq. Ft. 2,289 3,023 Total Sq. Ft. Structural Options 33 Build your home Video Included Features Floorplan Exteriors Floorplan Exteriors About this floorplan Flexibility is core to the layout of this one-story, 3-Bedroom home. The centrally located island Kitchen anchors the Madeline, and the Great Room, Dining area and Flex space can serve both casual and formal living. One example is to utilize the Flex space as a formal Dining Room, allowing you to expand the Great Room and use the Dining area for cards, games or billiards. The secondary bedrooms are located in the front of the Madeline, with the Owner’s Suite comfortably tucked off the Great Room in the rear. Highlights of this sanctuary include a tray ceiling, split vanities, and wrap-around Walk-In Closet that gives you the option to add a door from your Closet directly into the Laundry. You can personalize the Madeline floorplan with structural options that include three different exterior choices; second-floor Bonus Room variations; Fitness/Study or Bedroom 4 in lieu of Flex; In-Law Suite or second Owner’s Suite in lieu of Flex & Bedroom 2; four-foot rear extension of home, and if you're looking for more stow space, add light Attic storage and/or extend the Garage. To learn about all the ways you can have this home built around you, contact an Astor Creek New Home Guide. Homesites, given their appeal and location within the community, may carry an additional cost. This cost is not reflected in the base price of this floorplan. Please schedule an online or in-person tour for details. Interested in the Madeline? To speak with an Online Home Guide call (888) 476-3017 First Name Last Name E-mail Phone (Optional) Preferred method of contact Choose a preferred method of contact Phone Call Text Message By opting into SMS from a web form or other medium, you are agreeing to receive SMS messages from Kolter. This includes SMS messages for appointment scheduling and reminders. Message frequency varies. Message and data rates may apply. See privacy policy at https://www.kolter.com/privacy-policy/ . Message HELP for help. Reply STOP to any message to opt out. Questions and/or Comments: Leave this field empty Processing Submit Request I agree that the Kolter Group LLC and its affiliates (\"Kolter\") and certain third party service providers designated by Kolter may use the information submitted on this form for purposes of online and off-line marketing, which may include providing me with information, surveys, marketing materials, or offers that may be of value to me, which may be provided via mail, email, or phone call. I agree that such calls may be advertising or telemarketing messages and may be made using an automatic telephone dialing system or an artificial prerecorded voice. I understand that my consent to receive such calls is not a condition of purchasing any goods or services from Kolter. Kolter shall comply with their Privacy Policy or Terms of Use , which can be found at www.Kolter.com and by clicking on the link to Privacy Policy or Terms of Use . Add to Favorites 4 of 14 Homes Return to Homes Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title proudly presented by: Kolter Homes All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Community Home Page Clubhouse & Lifestyle Site Plan & Location Homes Photos kolterhomes.com NC - Charlotte Area Cresswind Charlotte Cresswind Wesley Chapel Handsmill on Lake Wylie Cresswind at Rocky River - OPEN 2026 SC - Charleston Area Cresswind Charleston The Ponds GA - Atlanta Area Cresswind at Spring Haven Cresswind Georgia at Twin Lakes Oak Hill Reserve AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 FL - Panhandle NatureWalk at Watersound Origins Salt Grass at Ward Creek FL - Greater Orlando Area Cresswind at Hammock Oaks Cresswind at Lake Harris Cresswind DeLand The Reserve at Victoria FL - South Florida Artistry Palm Beach Cove at Park Trace - COMING SOON Cove Royale Cresswind Palm Beach at Westlake L'Ambiance at Avenir Esprit at Avenir - FALL 2025 FL - Port St Lucie Mosaic PGA Village Verano Rivella FL - Sarasota/Bradenton Artistry Sarasota Cresswind Lakewood Ranch Woodland Preserve Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login Leave this field empty × Get a Quote Madeline - Port St. Lucie, Florida 34987 Your FREE Mortgage Pre-Qualification is compliments of CTC Mortgage, Kolter Homes' affiliated lender of choice. For more, visit CTCMortgage.com . First Name Last Name Credit History Excellent Good Fair Poor Preferred Method of Contact Select Phone Email Phone Number Email Thank you for your interest in our Madeline Model at . A Kolter-affiliated mortgage specialist will be in touch as soon as possible to provide your free pre-qualification and discuss your home financing needs and options. Processing Submit Close Mortgage Calculator Starting Price $ Estimated Homesite & Personalization Options % Estimated Total Price $ Interest Rate % Mortgage Length 40 30 25 15 Down Payment % Calculate Reset Calculation Results LOAN SUMMARY ESTIMATES Down Payment $ Loan to Value Ratio (LTV) % Loan Amount $ DETAIL ESTIMATES Monthly Expenses PRINCIPAL & INTEREST Mortgage Payment $ Tax Expense $ Insurance Expense $ Total Estimated Expense $ Close Calculator Get Pre-Qualified Figures on taxes and insurance are estimates - does not include utilities or HOA fees. Speak with a Kolter Homes Online Home Guide regarding all Down Payment requirements. Hi, Would you like a personalized brochure of Astor Creek Golf & Country Club ? Yes, please! No, thank you Closing this window will not prevent you from receiving a personalized brochure in the future. When you're ready, look for the \"Get your personalized brochure\" button and click it to request one. Get Your Personalized Brochure! Thank you for your interest in Astor Creek Golf & Country Club! To help us provide the most useful information possible for your new home search, please take a moment to answer a few questions. Based on your answers, a personalized PDF brochure will be built for you and a link to download it delivered to your email. Let's get started! Already have a favorites account? Great! You can log in to expedite the process and save your personalized brochure to your favorites collection. Creating an account is optional but offers the convenience of saving your personalized brochure for easy access in the future. Creating an account is not required to receive your personalized brochure. Email Password (forgot password) Login Cancel First Name Last Name E-mail Phone Preferred method of contact Choose a preferred method of contact Email Phone Call Text Message How many bedrooms are you interested in? Check all that apply 2 3 4 5 6 What is the minimum square footage you are looking for? ANY SQ. FT. 1000 sq. ft. + 1500 sq. ft. + 2000 sq. ft. + 2500 sq. ft. + 3000 sq. ft. + 3500 sq. ft. + 4000 sq. ft. + What structural and home options interest you? Check all that apply 3+ Car Garage Den/Study Great Room Island Kitchen Lanai/Outdoor Living Pool Single-story Bonus Room Move-In Ready Homes What amenities and lifestyle programs are important to you? Check all that apply Community Events Clubhouse Fitness Community Pool Golf Area - Retail | Dining | Entertainment Tennis Pickleball Pet Friendly Area - Medical Care Lifestyle Director Area – Travel | Commuting What additional resources would you like information about? Check all that apply New Home Features CTC Flyer Fly and Buy Program New vs Used Comparison Design Studio Experience Create a favorites account to save your personalized brochure for easy access and management in the future. Leave this field empty Processing ... Submit Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://pre-constructionhomes.com/new/florida/port-saint-lucie/astor-creek-golf-country-club/",
      "text": "Astor Creek Golf and Country Club in Port St Lucie FL | Taylor Morrison Home Builders CC Homes DiVosta Homes DR Horton Dream Home Finders GL Homes K Hovnanian Homes KB Homes Kolter Homes Label & Co Lennar Mattamy Homes Meritage Homes Minto Communities Pulte Richmond American Homes Ryan Homes Starlight Communities Toll Brothers Maps Florida Communities Map Cities Favorites Login Login Need an account? Register here! Forgot Password? Register I agree with terms & conditions Register Back to Login Reset Password Reset Password Return to Login Home Builders CC Homes DiVosta Homes DR Horton Dream Home Finders GL Homes K Hovnanian Homes KB Homes Kolter Homes Label & Co Lennar Mattamy Homes Meritage Homes Minto Communities Pulte Richmond American Homes Ryan Homes Starlight Communities Toll Brothers Maps Florida Communities Map Cities Favorites Home Port St. Lucie Astor Creek Golf and Country Club Astor Creek Golf and Country Club Your search results Community Single Family Astor Creek Golf and Country Club From $ 514,900 13032 SW Shinnecock Drive, Port St. Lucie , Astor Creek Golf and Country Club Facebook X - Twitter Pinterest WhatsApp Email Share Favorite Print Now Selling Overview Updated On: August 12, 2025 2 - 4 Bedrooms 2 - 3 Bathrooms 1,886 ft 2 Sqft 2 Garages Community Description Astor Creek Golf and Country Club a new pre-construction home community built by Taylor Morrison in Port St Lucie, FL – Treasure Coast – priced from $514,900. 6 single family models to choose from named the Azzurro,Farnese,Lazio,Ambra,Letizia,Pallazio. The Farnese and Pallazio models are now open daily.  Stop by for a tour! Taylor Morrison, America’s Most Trusted® Home Builder, is excited to offer new homes in the Astor Creek Golf and Country Club in Port St. Lucie, Florida. Located just a few miles from I-95, Astor Creek is convenient to the beautiful beaches of the Treasure Coast, abundant shopping and dining options, and unique cultural and entertainment venues. Astor Creek Golf & Country Club includes an 18-hole championship golf course designed by Chris Wilczynski. Energy Class: A+ Energy class  A+ A+ A B C D E F G H Property Details Property Id : 943726 Price: From $ 514,900 Property Size: 1,886 ft 2 Bedrooms: 2 Bathrooms: 2 Bedroom Range: 2 - 4 Bathroom Range: 2 - 3 SqFt Range: 1886 - 3004 Stories Range: 1 Garage Range: 2 Min Price: 514900 Max Price: 637900 Model Count: 6 Garages: 2 Builder: Taylor Morrison Master Community: Astor Creek Golf and Country Club Property Address Address: 13032 SW Shinnecock Drive City: Port St. Lucie Area: Astor Creek Golf and Country Club State/County: Florida Zip: 34987 Country: United States Open In Google Maps Map Models Astor Creek Golf and Country Club: Pallazio Model $ 637,900 Category: Single Family , Bedrooms: 3, Baths: 3, Size: 3,004 ft 2 Astor Creek Golf and Country Club: Farnese Model $ 531,900 Category: Single Family , Bedrooms: 2, Baths: 2.5, Size: 2,100 ft 2 Astor Creek Golf and Country Club: Letizia Model $ 590,900 Category: Single Family , Bedrooms: 4, Baths: 3, Size: 2,465 ft 2 Astor Creek Golf and Country Club: Azzurro Model $ 514,900 Category: Single Family , Bedrooms: 2, Baths: 2, Size: 1,886 ft 2 Astor Creek Golf and Country Club: Ambra Model $ 587,900 Category: Single Family , Bedrooms: 3, Baths: 3, Size: 2,296 ft 2 Astor Creek Golf and Country Club: Lazio Model $ 549,900 Category: Single Family , Bedrooms: 3, Baths: 3, Size: 2,275 ft 2 Taylor Morrison info@pre-constructionhomes.com Contact Astor Creek Golf and Country Club Specialist Schedule a showing? Time 7:00 7:15 7:30 7:45 8:00 8:15 8:30 8:45 9:00 9:15 9:30 9:45 10:00 10:15 10:30 10:45 11:00 11:15 11:30 11:45 12:00 12:15 12:30 12:45 13:00 13:15 13:30 13:45 14:00 14:15 14:30 14:45 15:00 15:15 15:30 15:45 16:00 16:15 16:30 16:45 17:00 17:15 17:30 17:45 18:00 18:15 18:30 18:45 19:00 19:15 19:30 19:45 I'm interested in [ Astor Creek Golf and Country Club ] Astor Creek Golf and Country Club Siteplan Astor Creek Golf and Country Club Siteplan Similar Listings 25 Port St. Lucie , Port St. Lucie Community Port St. Lucie From $ 422,000 Port St. Lucie new Single Family style homes in Port St. Lucie, FL. Prices starting at $42 ... Port St. Lucie new Single Family style homes in Port St. Lucie, FL. Prices starting at $422000 3 2 1,443 ft 2 details Maronda Homes 5 Central Park , Port St. Lucie Community Central Park From $ 397,000 Central Park new Single Family style homes in Port St. Lucie, FL. Prices starting at $3970 ... Central Park new Single Family style homes in Port St. Lucie, FL. Prices starting at $397000 3 2 1,562 ft 2 details Maronda Homes 39 Veranda Oaks , Port St. Lucie Community Model Open Veranda Oaks From $ 480,999 Veranda Oaks new   homes in Port St Lucie, FL by Taylor Morrison.  Prices starting at $480 ... Veranda Oaks new   homes in Port St Lucie, FL by Taylor Morrison.  Prices starting at $480,999 4 3 2,394 ft 2 details Taylor Morrison 40 Central Park , Port St. Lucie Community 2 Available Homes Central Park From $ 427,999 Central Park new   homes in Port St Lucie, FL by Taylor Morrison.  Prices starting at $427 ... Central Park new   homes in Port St Lucie, FL by Taylor Morrison.  Prices starting at $427,999 3 2 1,790 ft 2 details Taylor Morrison Pre-Construction Home Cities Alachua Alva Apalachicola Apollo Beach Apopka Auburndale Ave Maria Babcock Ranch Bartow Belleview Beverly Hills Boca Raton Bonita Springs Bradenton Brandon Brooksville Bunnell Callahan Callaway Cantonment Cape Coral Celebration ChampionsGate Chipley Citrus Springs Clearwater Clermont Cocoa Cooper City Crawfordville Crescent City Crestview Dade City Dania Beach Davenport Davie Daytona Beach Debary Deep Creek Deerfield Beach Defuniak Springs DeLand Delray Beach Deltona Doctor Phillips Dundee Dunnellon Eagle Lake Edgewater Ellenton Englewood Estero Fernandina Beach Flagler Beach Florida City Fort Myers Fort Pierce Freeport Ft. Pierce Gainesville Grant-Valkaria Greenacres Green Cove Springs Groveland Gulf Breeze Haines City Hastings Holly HIll Hollywood Homestead Homosassa Howey In The Hills Indian Lake Estates Jacksonville Jay Jensen Beach Jupiter Kissimmee Labelle Lake Alfred Lake City Lake Hamilton Lakeland Lake Mary Lake Wales Lakewood Ranch Lake Worth Land O Lakes Largo Lauderdale Lakes Lauderhill Laurel Hill Leesburg Lehigh Acres Lithia Longwood Loxahatchee Lutz Lynn Haven Mascotte Melbourne Merritt Island Mexico Beach Miami Middleburg Milton Mims Minneola Montverde Mount Dora Mt. Dora Naples Newberry New Port Richey New Smyrna Beach Nokomis North Fort Myers North Port North Venice Oakland Park Ocala Ocoee Odessa Okahumpka Orange City Orange Park Orlando Ormond Beach Osteen Oviedo Pace Palm Bay Palm Beach Gardens Palm City Palm Coast Palmetto Panama City Panama City Beach Parrish Pembroke Park Pembroke Pines Pensacola Pinellas Park Plantation Plant City Poinciana Pompano Beach Ponte Vedra Port Charlotte Port Labelle Port Orange Port Saint Lucie Port St Joe Port St. Lucie Punta Gorda Riverview Rockledge Rotonda West Ruskin Saint Augustine Saint Cloud Saint Johns San Antonio Sanford Santa Rosa Beach Sarasota Satellite Beach Sebastian Sebring Silver Spring Shores Sorrento Southport Spring Hill St. Augustine St. Cloud St. Johns St Marys St. Petersburg St Teresa Stuart Summerfield Sumterville Sun City Center Tallahassee Tamarac Tampa Tarpon Springs Tavares Temple Terrace Thonotosassa Titusville Umatilla Valrico Venice Vero Beach Viera Weeki Wachee Welaka Wesley Chapel West Melbourne Wildlight Wildwood Williston Wimauma Winter Garden Winter Haven Winter Park Winter Springs Yulee Zellwood Zephyrhills © Made with Love by PRE-CONSTRUCTIONHOMES.COM Terms and Coditions Privacy Policy Login here team HBG! Sign into your account Login Create an account I agree with terms & conditions Register Reset Password Reset Password Register here! Forgot password? Back to login Back to login Contact Us Use the form below to contact us! Send Cassia at Skye Ranch Esplanade Lake Club Compare Listings Compare Astor Creek Golf and Country Club Want to find out more? Contact Me Time 7:00 7:15 7:30 7:45 8:00 8:15 8:30 8:45 9:00 9:15 9:30 9:45 10:00 10:15 10:30 10:45 11:00 11:15 11:30 11:45 12:00 12:15 12:30 12:45 13:00 13:15 13:30 13:45 14:00 14:15 14:30 14:45 15:00 15:15 15:30 15:45 16:00 16:15 16:30 16:45 17:00 17:15 17:30 17:45 18:00 18:15 18:30 18:45 19:00 19:15 19:30 19:45 I'm interested in [ Astor Creek Golf and Country Club ] Call WhatsApp Taylor Morrison"
    },
    {
      "url": "https://www.thehubergroup.com/port-saint-lucie/port-st-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "text": "Astor Creek Golf & Country CLub | Port St Lucie Homes For Sale | Kolter Homes Home Port St. Lucie Selling Buying Featured Listings What's My Home Worth? Meet the Team Reviews Blog Contact Us 772-301-8524 Login (772) 301-8524 Sign in to your account Email Phone Number Need to reset your phone number? Log In Your browser does not support iframes. Don't have an account with us? Click here to sign up. Astor Creek Port St Lucie Home Search City All Atlantis Boca Raton Boynton Beach Coconut Creek Cooper City Coral Gables Coral Springs Dania Beach Davie Deerfield Beach Doral Fort Lauderdale Fort Pierce Greenacres Hialeah Hobe Sound Hollywood Homestead Hutchinson Island Jensen Beach Jupiter Jupiter Inlet Colony Key Largo Key West Lake Worth Lauderdale Lakes Lighthouse Point Loxahatchee Margate Melbourne Miami Miami Beach Miami Gardens Miami Lakes Miramar North Miami North Palm Beach Okeechobee Palm Bay Palm Beach Palm Beach Gardens Palm City Palm Springs Parkland Pembroke Pines Plantation Pompano Beach Port St. Lucie Riviera Beach Royal Palm Beach Saint Lucie West Sebastian Sewalls Point Southwest Ranches Stuart Sunrise Tamarac Vero Beach Wellington West Palm Beach Weston Development Name All Aero Acres Aspire At Hawks Ridg Aspire At Port St. L Astor Creek Ballantrae Golf And Bayshore Heights Becker Ridge Bedford Park Bedford Park At Trad Bedford Park In Trad Belmont Belterra Brystol At Wydler Brystol At Wylder Building Factor Llc Cadence Camelot Gardens Canal Pointe Cascades Cascades At Slw Cascades At St Lucie Cascades At St. Luci Castle Pines Castle Pines Condomi Central Park Clubside Clubside At Pga Vill Copper Creek Country Club  Estate Country Club Estates County Club Estates Cresswind At Pga Ver Cresswind/Pga Verano Crosstown Commons Del Webb Del Webb At Traditio Del Webb At Traditti Divosta At Tradition East Lake Village Emery Emery At Tradition Esplanade At Tradit Esplanade At Traditi Fairway Isles/Countr Fieldstone Floresta Gardens Four Seasons At Wyld Gatlin Gatlin/Savona Area Glynlea Country Club Golf Village Golf Villas Ii Hammock Cove Hammock Park Heatherwood Aka St L Heritage Oaks Heritage Oaks At Tra Heron Preserve Heron Preserve At Tr Hidden Oaks Holiday Builder Island Of Ravello Islands Of Ravello Isle Of Madeira Isle Of Madeira In T K. Hovnanian's Four Kings Isle Kings Isle - Isle Of Kings Isle, Isle Of Kings Isle/Isle Of C Kings Isle/Isle Of T La Buona Vita Lake Charles Lake Charles Phase 3 Lake Forest Lake Forest At St. L Lake Forest In St. L Lake Lucie Estates Lake Park Lake Park At Traditi Lakeforest Pointe Lakepark Lakepark At Townpark Lakepark At Traditio Lakes At Tradition Lakeside At The Lake Las Palmas Looks Like New!!! Lyngate Magnolia Lakes Manderlie Manderlie At Traditi Marrita Reserve Marsh Landing Midport Place Midport Place 1 Midport Place I Midport Place Ii Mosaic Motor Coach Resort Motor Coach Resorts Motorcoach Resort St Muirfield N N/A Newport Isles Newport Village Oak Hammock On The C-24 Canal Outdoor Resort Outdoor Resorts At S Palm Trails Parks Edge Parks Edge Poa Pga Pga Perfect Drive Go Pga The Reserve: Kin Pga Verano Pga Village Pga Village (Kingsmi Pga Village Verano Pga Village, Pinehur Pga Village/Cypress Pga Village/Spyglass Pine Trace Port Saint Lucie Port St Lucie Port St Lucie - Sect Port St Lucie Sec-41 Port St Lucie Sectio Port St. Lucie Port St. Lucie Secti Promenade Psl Psl Sec 13 Psl Sec 27 Psl Sec 48 Rainier Lakes Rivella River Park River Place River Place On The S River Vista Rivergreen Villas Riverland Riverland Valencia C Riverland Valencia G Riverland Valencia W Rosser Reserve Saint Lucie West Sanctuary At Sawgras Sandpiper Sandpiper Bay Savanna Club Savanna Club 55+ Sawgrass Lakes South Port St Lucie Southbend Southbend Lakes Spanish Lake Golf Vi Spanish Lake River F Spanish Lakes Spanish Lakes 1 Spanish Lakes Commun Spanish Lakes Golf Spanish Lakes Golf V Spanish Lakes Leaseh Spanish Lakes One Spanish Lakes One  5 Spanish Lakes One Le Spanish Lakes River Spanish Lakes Riverf St Andrews Townhomes St James Golf Club St Lucie Gardens Stockton Sun Terrace Telaro Telaro At Southern G Tesoro Tesoro Club Tesoro Preserve The Anchorage The Belmont The Belmont At St Lu The Club At St Lucie The Esplanade At Tra The Estates The Estates At Tradi The Estates At Windy The Estates Of Windy The Fountains The Lakes The Lakes At St Luci The Lakes At St. Luc The Lakes At Traditi The Preserve At St A The Preserve At St. The Preserve At The The Preserves At Tra The Vineyards The Vinyards Torino Town Park Town Park At Traditi Town Park, Stockton Townpark Townpark At Traditio Townpark Tradition Tradition Tradition Bedford Pa Tropical East Valencia Cay Valencia Cay At Rive Valencia Cay/Riverla Valencia Grove Valencia Grove At Ri Valencia Grove/River Valencia Parc At Riv Valencia Walk @ Rive Valencia Walk At Riv Veranao Veranda Gardens Veranda Landing Veranda Landings Veranda Oaks Veranda Preserve Verano Verano (Pga Village) Verano Pga Verano South Victoria Parc Victoria Parc At Tra Victoria Parc Manors Vikings Landing Villas Of Sandpiper Vineyards Vineyards Of St Luci Viscaya Falls Visconti Vista St Lucie Vista St Lucie Condo Vista St. Lucie Vitalia Vitalia At Tradition Vitalia Community Vizcaya Falls Vizcaya Falls Plat 3 Winterlakes Woodland Trails Wylder Wynne Bldg Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million TO Max List Price No Limit $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $550,000 $600,000 $650,000 $700,000 $750,000 $800,000 $850,000 $900,000 $950,000 $1 Million $1.5 Million $2 Million $2.5 Million $3 Million $3.5 Million $4 Million $4.5 Million $5 Million $6 Million $7 Million Beds Any 1+ 2+ 3+ 4+ 5+ 6+ Baths Any 1+ 2+ 3+ 4+ 5+ 6+ Property Type Home Condo Townhouse Advanced Search Address Search Astor Creek Golf & Country Club Astor Creek Golf & Country Club is an all new premier gated, golf course community located in Port St. Lucie, Florida located just west of PGA Verano, also a product of Kolter Homes. Astor Creek Port St Lucie Homes For Sale include new construction single family homes that are all one-story floor plans, with an optional second floor bonus room, situated on beautifully landscaped golf course and water views. Kolter focuses on personalization where there are over 40 structural options you can customize to fit you and your family's needs.In addition to Kolter Homes, new homes are coming soon to Astor Creek Golf & Country Club by Taylor Morrison . Currently, there is a $0 initiation fee when purchasing a home in Astor Creek with full access to the golf course, clubhouse with resort style amenities including a restaurant and bar. A lifestyle director is on site to coordinate social events along with a sports director with tennis and pickleball. The new 18-hole golf course is the first golf course community to be developed from the ground up by Kolter and designed by architect Chris Wilczynski. Residents have full family golf privileges to the golf shop, 15-acre grass driving range, 3-acre short game complex, and a 15,000 sq. ft. practice putting green. Memberships are available for non-residents. With a total of 682 acres, there will be roughly 900 new homes planned inside this exclusive community ranging from 2 to 6 bedrooms and 1,968 to 5,000+ living square feet. Astor Creek's clubhouse, The 1566 Club, will feature a full bar and restaurant, fitness center powered by EGYM, resort style pool, tennis, pickleball and more. Home prices start from $506,900 not including the homesite or design upgrades. Call 772-301-8524 to learn about $0 lot premiums and incentives towards upgrade options. Full Model Home Video Tours at Astor Creek If you are interested in similar communities or new construction communities starting now, contact us at 772-301-8524. Explore Port St Lucie Gated Communities Explore All Homes in Port St Lucie View Homes For Sale in PGA Verano Port St Lucie Golf Communities Move-In Ready Homes Available For Sale at Astor Creek Golf & Country Club, but are not listed below on the MLS. Contact us at 772-301-8524 for a list of inventory and current incentives! Astor Creek Golf & Country Club 9155 SW Shinnecock Drive, Port St. Lucie — Astor Creek $979,990 ▼ **NEW CONSTRUCTION **This home offers golf course views and has 3 Bedroom, a Study, 3 full and 1 half Bath, and a 3-car Garage. The gourmet Island kitchen features genero... 3 Beds 4 Baths R11111955 MLS Astor Creek Bldg. 9187 SW Shinnecock Drive, Port St. Lucie — Astor Creek $1,549,990 ▼ **New Construction** Introducing The Zara move-in ready home in the exclusive Astor Creek Golf and Country Club, offering the ultimate in upscale living and serene golf c... 4 Beds 5 Baths R11102829 MLS Astor Creek Bldg. 13129 SW Shinnecock Drive, Port St. Lucie — Astor Creek $689,900 Welcome to 13129 SW Shinnecock Drive, a stunning 2024-built extended ''Jordan'' model by Kolter Homes, nestled in the highly sought-after Astor Creek Golf & Country Club.... 2 Beds 2 Baths R11099795 MLS Astor Creek Bldg. 13352 SW Shinnecock Drive, Port St. Lucie — Astor Creek $985,990 NEW CONSTRUCTION''*MOVE IN READY-Astor Creek Golf and Country Club* This Victoria home is situated on an oversized homesite with over 70' of backyard space, giving plenty... 3 Beds 4 Baths R11077121 MLS Astor Creek Bldg. 13264 SW Shinnecock Drive, Port St. Lucie — Astor Creek $634,315 ***MOVE IN READY ***This 3-Bedroom layout is designed for maximum livability with a variety of personalization options. For those who love to host, the island Kitchen-fro... 3 Beds 3 Baths R11064792 MLS Astor Creek Bldg. 13144 SW Shinnecock Drive, Port St. Lucie — Astor Creek $655,460 The Madeline is a beautifully designed single-story, 3-bedroom home. The island kitchen is centrally located connecting the great room, dining area, and flex space, makin... 3 Beds 3 Baths R11057884 MLS Astor Creek Bldg. 9312 SW Bethpage Way, Port St. Lucie — Astor Creek Golf & C $1,003,200 Entered for statistical purposes 3 Beds 5 Baths R11004794 MLS Astor Creek Golf & C Bldg. 9163 SW Shinnecock Drive, Port St. Lucie — Astor Creek $800,000 *MOVE IN READY** GOLF COURSE COMMUNITY. This 3 Bedroom home boasts stunning golf course views and features a Study, 3 Bath, and a 3-car Garage. The centrally located Isla... 3 Beds 3 Baths R11001266 MLS Astor Creek Bldg. 13288 SW Shinnecock Drive, Port St. Lucie — Astor Creek $636,280 **New Construction. Move-in Ready** This stone-front home features 3 Bedroom, a Study, 3 Bath, and a 2-car side-load Garage. The Island Kitchen offers lots of space for f... 3 Beds 3 Baths R11001180 MLS Astor Creek Bldg. 13137 SW Shinnecock Drive, Port St. Lucie — Astor Creek $715,000 *MOVE IN READY** GOLF COURSE COMMUNITY. This single-story 3 Bedroom, 3 Bath Leslie floor plan with chef centrally located Kitchen, an island overlooking the Great Room an... 3 Beds 3 Baths R11000028 MLS Astor Creek Bldg. 9217 SW Bethpage Way, Port St. Lucie — Astor Creek $838,135 Entertainers love the Riley for its spacious open layout that accommodates gatherings of any size. The home welcomes in the natural light through its many large windows o... 4 Beds 4 Baths R10938893 MLS Astor Creek Bldg. 9240 SW Bethpage Way, Port St. Lucie — Astor Creek $1,263,795 Style and grandeur await in this 3 bedroom, 3 Full Bath and Half Bath home. Upon entry, the foyer welcomes you into the Dining and Great Room, a vestibule leads to the gu... 3 Beds 4 Baths R10935664 MLS Astor Creek Bldg. 9233 SW Bethpage Way, Port St. Lucie — Astor Creek $1,087,840 Style and grandeur await in this Whitney, 3 Bedroom, 3 Full and 1 Half Bath Home. Upon entry into the home, the Foyer welcomes guest into the Dining and Great Room. Just ... 3 Beds 4 Baths R10938895 MLS Astor Creek Bldg. 9216 SW Bethpage Way, Port St. Lucie — Astor Creek $950,000 * MOVE IN READY-GATED GOLF COURSE COMMUNITY* This welcoming courtyard home is thoughtfully designed with the Great Room as the center of the home. The western exposure go... 3 Beds 4 Baths R10938993 MLS Astor Creek Bldg. 13129 SW Shinnecock Drive, Port St. Lucie — Astor Creek $665,000 Model photos used for reference. Live the Country Club Lifestyle in Astor Creek Golf & Country Club. This double lake golf view western exposure Jordan features 2 Bedroom... 2 Beds 2 Baths R10985284 MLS Astor Creek Bldg. 9209 SW Bethpage Way, Port St. Lucie — Astor Creek $930,000 *Move in Ready* Live the Country Club Lifestyle at Astor Creek Golf and Country Club. This corner homesite with an east-facing garden view complete with 3 Bedroom, a Fitn... 3 Beds 4 Baths R10985198 MLS Astor Creek Bldg. 13296 SW Shinnecock Drive, Port St. Lucie — Astor Creek $669,010 Model photos used for reference. Live the country club lifestyle in Astor Creek Golf & Country Club. This home features 3 Bedrooms, 3 Full Bath, Study and a 2-car Garage.... 3 Beds 3 Baths R10985229 MLS Astor Creek Bldg. 9225 SW Bethpage Way, Port St. Lucie — Astor Creek $790,000 **MOVE IN READY**  The Kitchen is beautifully designed with 42'' upgraded white shaker cabinets with crown moulding, dark navy tile backsplash, quartz countertops with da... 3 Beds 4 Baths R10930238 MLS Astor Creek Bldg. 9232 SW Bethpage Way, Port St. Lucie — Astor Creek $868,490 **MOVE IN READY** GOLF COURSE COMMUNITY. This Priscilla floor plan is situated on an oversized homesite on the 9th fairway with beautiful golf course views. Home features... 3 Beds 3 Baths R10930235 MLS Astor Creek Bldg. 9208 SW Bethpage Way, Port St. Lucie — Astor Creek $899,000 *Move in Ready* Gated Community in Astor Creek Golf and Country Club, Kolter Homes newest community on the Treasure Coast. This home is situated on a corner homesite with... 3 Beds 4 Baths R10938916 MLS Astor Creek Bldg. Like or Share Loading likes... Share on Facebook Share on X (Twitter) Share on LinkedIn Address Search Astor Creek Golf & Country Club Astor Creek Homes For Sale Astor Creek Kolter Homes Astor Creek Taylor Morrison Astor Creek Kolter Model Home Tours Astor Creek Taylor Morrison Model Homes Astor Creek Home Prices & Floor Plans Astor Creek Jordan Model Astor Creek Leslie Model Astor Creek Madeline Model Astor Creek Priscilla Model Astor Creek Rebecca Model Astor Creek Sophia Model Astor Creek Tori Model Astor Creek Victoria Model Astor Creek Waverly Model Astor Creek Xena Model Astor Creek Zara Model Additional Navigation Home Advanced Search Selling Buying Meet the Team Blog Featured Properties Contact Us 772-800-6621 Huber Real Estate Group of Florida Office: 772-800-6621 Mobile: 772-301-8524 Email: stephanie@thehubergroup.com © All Rights Reserved | Privacy Policy Jensen Beach Palm City Stuart Port Saint Lucie Vero Beach IDX Real Estate Websites by • Accessibility • Terms • Privacy"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4892/floorplan/leslie/",
      "text": "Leslie Model | Astor Creek Golf & Country Club Astor Creek Golf & Country Club Clubhouse & Lifestyle Astor Creek Clubhouse 18-Hole Championship Course Astor Creek Membership EGYM Circuit Training Site Plan & Location Site Plan Area Video & Information Area Points of Interest Homes Jordan 2 Bedroom (up to 4 Bedroom), Flex Room, 2 Bath, Great Room, 2-Car Garage 1,968 Living Area Sq. Ft. Katherine 3 Bedroom (up to 4 Bedroom), Flex Room, 2 Full and 1 Half Bath, Great Room, 2-Car Garage 1,983 Living Area Sq. Ft. Leslie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,129 Living Area Sq. Ft. Madeline 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,289 Living Area Sq. Ft. Natalie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,323 Living Area Sq. Ft. Priscilla 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 3-Car Garage 2,490 Living Area Sq. Ft. Rebecca 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car Garage 2,586 Living Area Sq. Ft. Sophia 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 2,776 Living Area Sq. Ft. Tori 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 2,876 Living Area Sq. Ft. Victoria 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 3,224 Living Area Sq. Ft. Waverly 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 3,265 Living Area Sq. Ft. Wynona 3 Bedroom (up to 6 Bedroom) 3 Full and 1 Half Bath, Great Room, Club Room and 3-Car Garage 3,874 Living Area Sq. Ft. Xena 4 Bedroom (up to 6 Bedroom) 4 Full and 1 Half Bath, Great Room, Club Room, 3-Car and 1-Car Split Garage 3,932 Living Area Sq. Ft. Zara 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room and 4-Car Split Garage 4,222 Living Area Sq. Ft. Photos Schedule Your Tour 3 of 14 Homes Return to Homes 33 PHOTOS Virtual Tour Leslie Starting Price: $603,990 Estimate Your Monthly Payment 3 of 14 Homes Return to Homes Bedrooms 3 Option for up to 5 Full Baths 3 Option for up to 4 Half Baths 0 Option for up to 1 Stories 1 Optional 2nd Floor Garage 2 Living Area Sq. Ft. 2,129 2,871 Total Sq. Ft. Structural Options 35 Build your home Video Included Features Floorplan Exteriors Floorplan Exteriors About this floorplan Entertainers laud the Leslie for its large, centrally located Kitchen. The wide island overlooks the Great Room and Dining area with open views out to the Lanai with windows across the back of the home. The Kitchen also gives the chef in your family lots of space to work with and house their tools of the trade with ample countertop area, cabinetry and a walk-in pantry. The second and third Bedrooms and Baths are located at the front of the home to provide privacy from the Owner’s Suite which is comfortably tucked off the Great Room in the rear. Owner's Suite highlights include a tray ceiling, dual vanities in the Owner’s Bath and option to further expand the Owner’s Closet and create a Pocket Office in lieu of the Flex space. Other personalization options the Leslie offers include three different exterior choices; second-floor Bonus Room variations; Snore Room, Fitness/Study or Bedroom 4 in lieu of Flex; second Owner’s Suite or In-Law Suite in lieu of Bedroom 2 and Flex; four-foot rear extension of home, and if you're looking for more stow space, add light Attic storage and/or extend the Garage. To learn about all the ways you can have this home built around you, contact an Astor Creek New Home Guide. Homesites, given their appeal and location within the community, may carry an additional cost. This cost is not reflected in the base price of this floorplan. Please schedule an online or in-person tour for details. Interested in the Leslie? To speak with an Online Home Guide call (888) 476-3017 First Name Last Name E-mail Phone (Optional) Preferred method of contact Choose a preferred method of contact Phone Call Text Message By opting into SMS from a web form or other medium, you are agreeing to receive SMS messages from Kolter. This includes SMS messages for appointment scheduling and reminders. Message frequency varies. Message and data rates may apply. See privacy policy at https://www.kolter.com/privacy-policy/ . Message HELP for help. Reply STOP to any message to opt out. Questions and/or Comments: Leave this field empty Processing Submit Request I agree that the Kolter Group LLC and its affiliates (\"Kolter\") and certain third party service providers designated by Kolter may use the information submitted on this form for purposes of online and off-line marketing, which may include providing me with information, surveys, marketing materials, or offers that may be of value to me, which may be provided via mail, email, or phone call. I agree that such calls may be advertising or telemarketing messages and may be made using an automatic telephone dialing system or an artificial prerecorded voice. I understand that my consent to receive such calls is not a condition of purchasing any goods or services from Kolter. Kolter shall comply with their Privacy Policy or Terms of Use , which can be found at www.Kolter.com and by clicking on the link to Privacy Policy or Terms of Use . Add to Favorites 3 of 14 Homes Return to Homes Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title proudly presented by: Kolter Homes All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Community Home Page Clubhouse & Lifestyle Site Plan & Location Homes Photos kolterhomes.com NC - Charlotte Area Cresswind Charlotte Cresswind Wesley Chapel Handsmill on Lake Wylie Cresswind at Rocky River - OPEN 2026 SC - Charleston Area Cresswind Charleston The Ponds GA - Atlanta Area Cresswind at Spring Haven Cresswind Georgia at Twin Lakes Oak Hill Reserve AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 FL - Panhandle NatureWalk at Watersound Origins Salt Grass at Ward Creek FL - Greater Orlando Area Cresswind at Hammock Oaks Cresswind at Lake Harris Cresswind DeLand The Reserve at Victoria FL - South Florida Artistry Palm Beach Cove at Park Trace - COMING SOON Cove Royale Cresswind Palm Beach at Westlake L'Ambiance at Avenir Esprit at Avenir - FALL 2025 FL - Port St Lucie Mosaic PGA Village Verano Rivella FL - Sarasota/Bradenton Artistry Sarasota Cresswind Lakewood Ranch Woodland Preserve Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login Leave this field empty × Get a Quote Leslie - Port St. Lucie, Florida 34987 Your FREE Mortgage Pre-Qualification is compliments of CTC Mortgage, Kolter Homes' affiliated lender of choice. For more, visit CTCMortgage.com . First Name Last Name Credit History Excellent Good Fair Poor Preferred Method of Contact Select Phone Email Phone Number Email Thank you for your interest in our Leslie Model at . A Kolter-affiliated mortgage specialist will be in touch as soon as possible to provide your free pre-qualification and discuss your home financing needs and options. Processing Submit Close Mortgage Calculator Starting Price $ Estimated Homesite & Personalization Options % Estimated Total Price $ Interest Rate % Mortgage Length 40 30 25 15 Down Payment % Calculate Reset Calculation Results LOAN SUMMARY ESTIMATES Down Payment $ Loan to Value Ratio (LTV) % Loan Amount $ DETAIL ESTIMATES Monthly Expenses PRINCIPAL & INTEREST Mortgage Payment $ Tax Expense $ Insurance Expense $ Total Estimated Expense $ Close Calculator Get Pre-Qualified Figures on taxes and insurance are estimates - does not include utilities or HOA fees. Speak with a Kolter Homes Online Home Guide regarding all Down Payment requirements. Hi, Would you like a personalized brochure of Astor Creek Golf & Country Club ? Yes, please! No, thank you Closing this window will not prevent you from receiving a personalized brochure in the future. When you're ready, look for the \"Get your personalized brochure\" button and click it to request one. Get Your Personalized Brochure! Thank you for your interest in Astor Creek Golf & Country Club! To help us provide the most useful information possible for your new home search, please take a moment to answer a few questions. Based on your answers, a personalized PDF brochure will be built for you and a link to download it delivered to your email. Let's get started! Already have a favorites account? Great! You can log in to expedite the process and save your personalized brochure to your favorites collection. Creating an account is optional but offers the convenience of saving your personalized brochure for easy access in the future. Creating an account is not required to receive your personalized brochure. Email Password (forgot password) Login Cancel First Name Last Name E-mail Phone Preferred method of contact Choose a preferred method of contact Email Phone Call Text Message How many bedrooms are you interested in? Check all that apply 2 3 4 5 6 What is the minimum square footage you are looking for? ANY SQ. FT. 1000 sq. ft. + 1500 sq. ft. + 2000 sq. ft. + 2500 sq. ft. + 3000 sq. ft. + 3500 sq. ft. + 4000 sq. ft. + What structural and home options interest you? Check all that apply 3+ Car Garage Den/Study Great Room Island Kitchen Lanai/Outdoor Living Pool Single-story Bonus Room Move-In Ready Homes What amenities and lifestyle programs are important to you? Check all that apply Community Events Clubhouse Fitness Community Pool Golf Area - Retail | Dining | Entertainment Tennis Pickleball Pet Friendly Area - Medical Care Lifestyle Director Area – Travel | Commuting What additional resources would you like information about? Check all that apply New Home Features CTC Flyer Fly and Buy Program New vs Used Comparison Design Studio Experience Create a favorites account to save your personalized brochure for easy access and management in the future. Leave this field empty Processing ... Submit Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.kolter.com/",
      "text": "Kolter Group | Real Estate Development Company Condominiums Homes Multifamily Land Financial Services About Us History Leadership Community Initiatives Portfolio News Investor Login | Contact We use cookies to ensure you receive the best experience on our website.  By browsing our site, you agree to our use of cookies, our terms of use, and our privacy policy. Learn more GOT IT + + + + + + The Kolter Group is among the most experienced real estate investors in the Southeast, having executed investments across major asset classes and all stages of the development cycle. Our portfolio of complementary businesses drives an entrepreneurial culture and allows us to adapt to change and choose investments on a selective basis. Bobby Julien Chief Executive Officer - the Kolter Group As the CEO of Kolter, Bobby is responsible for the firm’s overall strategy as well as for support of the portfolio company leaders in the development of their sector-specific strategies. Read Bio... Naples Daily News, 07-06-25 The Ultimate Naples Address Read More... Austin Business Journal, 06-25-25 Charles Cochran Takes Leadership Post at Kolter Multifamily Read More... Multi-Housing News, 06-17-25 Kolter Multifamily Begins Newest Florida Project Read More... Palm Beach Post, 06-02-25 West Palm Commissioners OK 18-Story Tower Across from Mar-a-Lago But Worry What Comes Next Read More... Florida YIMBY, 05-15-25 51-Unit Twin-Tower Development 3300 Gulf Shore Slated to Break Ground in Naples this Fall Read More... Tampa Bay Business & Wealth, 05-01-25 Sales Gallery Opens for The Ritz-Carlton Residences, Sarasota Bay Read More... The Ultimate Naples Address As Featured in Naples Daily News Naples newest luxury condos don’t have a fancy name. It is simply called 3300 READ MORE ADDITIONAL NEWS Kolter Urban, the company's urban infill and residential condominium affiliate, has delivered in excess of over 5,600 residences and has more than 1,200 additional condos in various stages of development. From dynamic urban neighborhoods to spectacular ocean and Intracoastal settings, Kolter Urban has focused on developing properties in prime locations, many of which include a hotel property, restaurant and/or shopping destination, top-of-the-line amenities and concierge services. Visit Website... Kolter Homes is committed to building valued residences and in \"Creating Better Communities.\" Kolter Homes knows that homebuyers don't just purchase a home, they purchase a dream and a lifestyle. With that in mind, Kolter Homes' team strives to deliver the desirable finishes and amenities for today's demanding market. Kolter Homes' Design Studio offers a menu of finishes which are among the most sought after in the industry - including Green Builder Options so that customers can take advantage of the newest energy efficient home options. Visit Website.... Kolter Multifamily is focused on developing institutional quality rental communities throughout the Southeastern United States. The firm targets prime urban and suburban opportunities in high-growth markets creating exceptional communities of enduring value. Visit Website... Kolter Hospitality is a leader in the hotel development and management industry, owning and operating 14 hotels with 2 additional hotels in various stages of development. Our mission is to cultivate loyalty through ongoing relationship building between hotel guests and hospitality team members and to elevate the caliber of service by encouraging an environment of operational excellence and continuous improvement of best business practices within our portfolio of hotels. Visit Website.... Kolter Land is the land acquisition and development affiliate that typically invests in prime market locations in order to supply builders with finished lots at competitive prices. The firm targets closing on the acquisition of raw land with entitlements in-place which Kolter Land then develops and sells to third-party homebuilders. Visit Website.... At Kolter Financial Services, we recognize that the strength of our business is rooted in our relationship with customers. Whether you are purchasing or refinancing, CTC Mortgage Company and K Title Company offer customers a vast array of financial products and advice. Visit Website.... KOLTER URBAN | KOLTER HOMES | KOLTER MULTIFAMILY | KOLTER HOSPITALITY | KOLTER LAND KOLTER FINANCIAL SERVICES | ABOUT US | CAREERS | INVESTOR LOGIN | CONTACT US Corporate Headquarters The Kolter Group LLC 105 NE 1st St Delray Beach, FL 33444 T 561-682-9500 E info@kolter.com © 2025 The Kolter Group LLC | All Rights Reserved | Terms of Use | Privacy Policy | Site Map"
    },
    {
      "url": "https://www.kolterhomes.com/contactus/",
      "text": "Contact Us | Kolter Homes Kolter Homes Toggle Mobile Menu Locations NC - Charlotte Area Cresswind Charlotte Charlotte's Best Located 55+ Community with great amenities & homes, priced from the $400s. Cresswind Wesley Chapel The Charlotte area's #1 selling 55+ community with new homes from the $400s. Handsmill on Lake Wylie The Gentry at Handsmill on Lake Wylie new move-in ready homes in York, SC from the mid $500s. Cresswind at Rocky River - OPEN 2026 COMING SOON - Cresswind Rocky River, a 55+ Community in Locust, North Carolina SC - Charleston Area Cresswind Charleston Active Adult Living with the most amenities in the area, convenient to Charleston from the $400s. The Ponds Single-family homes near the best schools in the Charleston area, from $400s GA - Atlanta Area Cresswind at Spring Haven Welcome to the 4th Cresswind in the Atlanta-area, located in Newnan, featuring completely new floorplans and a next generation Club Cresswind. Cresswind Georgia at Twin Lakes Georgia's #1 55+ community and home of the state's largest private Pickleball Center - New Homes from the $300s to over $1 Million. Oak Hill Reserve An intimate active adult community in Newnan, GA, offering new homes from the $600s, with easy access to shopping, dining, and local attractions. AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 OPENING 2026: debut Cresswind in Alabama, roughly 13 miles from the Gulf beaches FL - Panhandle NatureWalk at Watersound Origins Gated community located two miles from Alys Beach and 30A. Active, outdoor lifestyle with comfortable backyard living and 2- to 6-Bedroom homes from the $500s. Salt Grass at Ward Creek GRAND OPENING - Kolter Homes debut neighborhood in Panama City Beach offering a new collection of home designs. FL - Greater Orlando Area Cresswind at Hammock Oaks Gated, boutique 55+ community and lifestyle located just 3 miles from The Villages with 2- to 5-bedroom homes with optimal flexibility and personalization from the $300s. Cresswind at Lake Harris 55+ community with direct access to Lake Harris in Tavares, FL, \"America's Seaplane City\" offering 1-story homes with best-in-class personalization options from the $300s. Cresswind DeLand Award-winning 55+ homes and lifestyle with convenient access to Orlando from the $300s. NEW MOVE-IN READY HOMES AVAILBLE NOW. The Reserve at Victoria Kolter Homes in The Reserve at Victoria offers new homes ranging from 2- up to 5-Bedrooms from the $400s FL - South Florida Artistry Palm Beach In the heart of Palm Beach Gardens, this gated community features contemporary single-family homes priced from $1.8M to over $2M. Cove at Park Trace - COMING SOON Intimate new neighborhood in Stuart offering a variety of preserve and wooded views. Cove Royale Award-winning To-Be Built and Move-In Ready Homes located in the heart of Stuart—where style, comfort, and everyday convenience meet. Cresswind Palm Beach at Westlake Next generation active adult living and Club Cresswind amenities in Palm Beach County - from the $500s. L'Ambiance at Avenir Explore Kolter's newest Palm Beach Gardens community in Avenir, with beautifully designed 2-5 Bedroom homes from the $800's. Esprit at Avenir - FALL 2025 Gated, 55+ community with on-site dining, chic clubhouse and next-generation new homes in Palm Beach Gardens. FL - Port St Lucie Astor Creek Golf & Country Club Kolter Homes debuts a Golf Community on the Treasure Coast with an 18-hole course, clubhouse and new homes from the $550s to $2M+. Mosaic Explore new 2–5 bedroom homes in the heart of Port St. Lucie, a thriving location known for comfort, convenience, and charm. PGA Village Verano Neighboring PGA Golf Club, resort-style community in Port St. Lucie with new Single-Family Homes from the $300s. Rivella New collection of 2-4 bedroom homes from the upper $300s in the gated, riverside community of Rivella in Port St. Lucie. FL - Sarasota/Bradenton Artistry Sarasota Final Collection of Move-In Ready homes from the $800s, situated on large homesites with stunning water views. Cresswind Lakewood Ranch Gated, 55+ Active Adult village in Lakewood Ranch close to Sarasota & Bradenton with new homes from the upper $400s. Woodland Preserve Kolter's latest 55+ community in the Sarasota-Bradenton area is now open in Parrish with 2-5 Bedroom homes. Lifestyles & Photos Homes Free Brochure Request Information The best way to get information on a specific community is to contact that community directly. Artistry Palm Beach 5513 Renoir Place Palm Beach Gardens, FL 33418 Phone 561-922-0348 Click here for directions Artistry Sarasota 8904 Bernini Place Sarasota, FL 34240 Phone 941-677-0518 Click here for directions Astor Creek Golf & Country Club 8975 SW Shinnecock Drive Port St. Lucie, FL 34987 Phone 772-303-2114 Click here for directions Cove Royale 6770 SE Haven Lane Stuart, FL 34997 Phone 772-266-7086 Click here for directions Cove at Park Trace - COMING SOON 6770 SE Haven Lane Stuart, FL 34997 Phone 888-476-3017 Click here for directions Cresswind Charleston 467 Hundred Oaks Pkwy Summerville, SC 29483 Phone 843-832-6100 Click here for directions Cresswind Charlotte 8913 Silver Springs Court Charlotte, NC 28215 Phone (980) 228-9044 Click here for directions Cresswind DeLand 1230 Club Cresswind Way DeLand, FL 32724 Phone 386-490-9616 Click here for directions Cresswind Georgia at Twin Lakes 118 Hartwell Court Hoschton, GA 30548 Phone 770-455-5844 Click here for directions Cresswind Lakewood Ranch 5063 Simons Court Lakewood Ranch, FL 34211 Phone (941) 217-7980 Click here for directions Cresswind Palm Beach at Westlake 5287 Siesta Key Lane Westlake, FL 33470 Phone 561-476-0051 Click here for directions Cresswind Wesley Chapel 4006 Cresswind Boulevard Monroe, NC 28110 Phone 704-248-4868 Click here for directions Cresswind at Hammock Oaks 420 Douglas Hill Drive Lady Lake, FL 32159 Phone 888-476-3017 Click here for directions Cresswind at Lake Harris 1400 Bellagio Loop Tavares, FL 32778 Phone (888) 476-3017 Click here for directions Cresswind at Rocky River - OPEN 2026 Locust, NC Click here for directions Cresswind at Sandy Creek - OPEN 2026 , FL Click here for directions Cresswind at Spring Haven 24 Catalina Court Newnan, GA 30263 Phone 678-952-2345 Click here for directions Esprit at Avenir - FALL 2025 14044 Dauphine Court Boca Raton, FL Click here for directions Handsmill on Lake Wylie 1043 Wylie Falls Lane York, SC 29745 Phone 803-830-6100 Click here for directions L'Ambiance at Avenir 13608 Le Christine Drive Palm Beach Gardens, FL 33412 Phone 561-323-6060 Click here for directions Mosaic 2309 SE Mosaic Blvd. Port St. Lucie, FL 34984 Phone 772-249-3141 Click here for directions NatureWalk at Watersound Origins 37 Pennekamp Lane Inlet Beach, FL 32461 Phone (850) 270-5277 Click here for directions Oak Hill Reserve 115 Oak Hill Court Newnan, GA 30265 Phone 678-534-8942 Click here for directions PGA Village Verano 9250 SW Visconti Way Port St. Lucie, FL 34987 Phone 772-345-5041 Click here for directions Rivella 132 SE Via Tirso Port St. Lucie, FL 34952 Phone 772-200-2915 Click here for directions Salt Grass at Ward Creek 573 Millbridge Dr Panama City Beach, FL 32413 Phone 888-476-3017 Click here for directions The Ponds 467 Hundred Oaks Pkwy Summerville, SC 29483 Phone 843-832-6100 Click here for directions The Reserve at Victoria 1627 Lake Reserve Drive DeLand, FL 32724 Phone 386-873-4680 Click here for directions Woodland Preserve 5035 Shade Forest Dr. Parrish, FL 34219 Phone 941-803-4950 Click here for directions Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Home Page Locations NC - Charlotte Area SC - Charleston Area GA - Atlanta Area AL - Gulf Coast FL - Panhandle FL - Greater Orlando Area FL - South Florida FL - Port St Lucie FL - Sarasota/Bradenton Lifestyles & Photos Homes Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.kolterhomes.com/owners/",
      "text": "Kolter Homes : Owner's Information Portal Kolter Homes Toggle Mobile Menu Locations NC - Charlotte Area Cresswind Charlotte Charlotte's Best Located 55+ Community with great amenities & homes, priced from the $400s. Cresswind Wesley Chapel The Charlotte area's #1 selling 55+ community with new homes from the $400s. Handsmill on Lake Wylie The Gentry at Handsmill on Lake Wylie new move-in ready homes in York, SC from the mid $500s. Cresswind at Rocky River - OPEN 2026 COMING SOON - Cresswind Rocky River, a 55+ Community in Locust, North Carolina SC - Charleston Area Cresswind Charleston Active Adult Living with the most amenities in the area, convenient to Charleston from the $400s. The Ponds Single-family homes near the best schools in the Charleston area, from $400s GA - Atlanta Area Cresswind at Spring Haven Welcome to the 4th Cresswind in the Atlanta-area, located in Newnan, featuring completely new floorplans and a next generation Club Cresswind. Cresswind Georgia at Twin Lakes Georgia's #1 55+ community and home of the state's largest private Pickleball Center - New Homes from the $300s to over $1 Million. Oak Hill Reserve An intimate active adult community in Newnan, GA, offering new homes from the $600s, with easy access to shopping, dining, and local attractions. AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 OPENING 2026: debut Cresswind in Alabama, roughly 13 miles from the Gulf beaches FL - Panhandle NatureWalk at Watersound Origins Gated community located two miles from Alys Beach and 30A. Active, outdoor lifestyle with comfortable backyard living and 2- to 6-Bedroom homes from the $500s. Salt Grass at Ward Creek GRAND OPENING - Kolter Homes debut neighborhood in Panama City Beach offering a new collection of home designs. FL - Greater Orlando Area Cresswind at Hammock Oaks Gated, boutique 55+ community and lifestyle located just 3 miles from The Villages with 2- to 5-bedroom homes with optimal flexibility and personalization from the $300s. Cresswind at Lake Harris 55+ community with direct access to Lake Harris in Tavares, FL, \"America's Seaplane City\" offering 1-story homes with best-in-class personalization options from the $300s. Cresswind DeLand Award-winning 55+ homes and lifestyle with convenient access to Orlando from the $300s. NEW MOVE-IN READY HOMES AVAILBLE NOW. The Reserve at Victoria Kolter Homes in The Reserve at Victoria offers new homes ranging from 2- up to 5-Bedrooms from the $400s FL - South Florida Artistry Palm Beach In the heart of Palm Beach Gardens, this gated community features contemporary single-family homes priced from $1.8M to over $2M. Cove at Park Trace - COMING SOON Intimate new neighborhood in Stuart offering a variety of preserve and wooded views. Cove Royale Award-winning To-Be Built and Move-In Ready Homes located in the heart of Stuart—where style, comfort, and everyday convenience meet. Cresswind Palm Beach at Westlake Next generation active adult living and Club Cresswind amenities in Palm Beach County - from the $500s. L'Ambiance at Avenir Explore Kolter's newest Palm Beach Gardens community in Avenir, with beautifully designed 2-5 Bedroom homes from the $800's. Esprit at Avenir - FALL 2025 Gated, 55+ community with on-site dining, chic clubhouse and next-generation new homes in Palm Beach Gardens. FL - Port St Lucie Astor Creek Golf & Country Club Kolter Homes debuts a Golf Community on the Treasure Coast with an 18-hole course, clubhouse and new homes from the $550s to $2M+. Mosaic Explore new 2–5 bedroom homes in the heart of Port St. Lucie, a thriving location known for comfort, convenience, and charm. PGA Village Verano Neighboring PGA Golf Club, resort-style community in Port St. Lucie with new Single-Family Homes from the $300s. Rivella New collection of 2-4 bedroom homes from the upper $300s in the gated, riverside community of Rivella in Port St. Lucie. FL - Sarasota/Bradenton Artistry Sarasota Final Collection of Move-In Ready homes from the $800s, situated on large homesites with stunning water views. Cresswind Lakewood Ranch Gated, 55+ Active Adult village in Lakewood Ranch close to Sarasota & Bradenton with new homes from the upper $400s. Woodland Preserve Kolter's latest 55+ community in the Sarasota-Bradenton area is now open in Parrish with 2-5 Bedroom homes. Lifestyles & Photos Homes Free Brochure New Home Warranty Homeowner Login NC - Charlotte Area Cresswind Charlotte cresswindcharlottecare@kolter.com 704-748-0356 Cresswind Wesley Chapel cresswindwesleychapelcare@kolter.com 704-944-2240 Handsmill on Lake Wylie handsmillcare@kolter.com 704-748-0356 SC - Charleston Area Cresswind Charleston cresswindcharlestoncare@kolter.com 843-800-1356 Cresswind Myrtle Beach cresswindmyrtlebeachcare@kolter.com 843-800-1356 The Ponds cresswindcharlestoncare@kolter.com GA - Atlanta Area Cresswind at Lake Lanier cresswindlakelaniercare@kolter.com 770-287-5693 Cresswind at Spring Haven cresswindspringhavencare@kolter.com 678-439-0888 Cresswind Georgia at Twin Lakes cresswindtwinlakescare@kolter.com 770-287-5693 Cresswind Peachtree City cresswindpeachtreecare@kolter.com 678-889-3589 Oak Hill Reserve oakhillreservecare@kolter.com 678-439-0888 FL - Panhandle NatureWalk at Seagrove naturewalkcare@kolter.com 850-805-4491 NatureWalk at Watersound Origins naturewalkcare@kolter.com 850-805-4491 FL - Greater Orlando Area Cresswind at Hammock Oaks cwhammockoakscare@kolter.com 352-835-0400 Cresswind at Lake Harris cwlakeharriscare@kolter.com 352-554-2700 Cresswind at Victoria Gardens cresswindvictoriagardenscare@kolter.com 386-279-7976 Cresswind DeLand cresswinddelandcare@kolter.com 386-279-7976 The Reserve at Victoria ReserveatVictoriaCare@kolter.com 386-279-7976 Victoria Hills victoriahillscare@kolter.com 386-279-7976 FL - South Florida Alton altoncare@kolter.com 561-805-3936 Artistry Palm Beach artistrypalmbeachcare@kolter.com 561-805-3936 Canopy Creek canopycreekcare@kolter.com 772-380-4727 Cove Royale coveroyalecare@kolter.com 772-214-1363 Cresswind Palm Beach at Westlake cresswindpalmbeachcare@kolter.com 561-571-7881 L'Ambiance at Avenir lambianceatavenircare@kolter.com (561) 990-3869 Vizcaya Falls vizcayafallscare@kolter.com 772-236-7005 FL - Port St Lucie Astor Creek Golf & Country Club astorcreekcare@kolter.com 772-236-7005 Mosaic mosaiccare@kolter.com 772-212-4120 PGA Village Verano pgaveranocare@kolter.com 772-236-7005 Rivella rivellacare@kolter.com 772-236-7005 FL - Sarasota/Bradenton Artistry Sarasota artistrysarasotacare@kolter.com 941-444-9356 Cresswind Lakewood Ranch cresswindlakewoodranchcare@kolter.com 941-444-9356 Owner Documents 2-10 Home Buyers Warranty New Home workmanship, systems, and structural Warranty. Interactive Reader Kolter Homeowner Guide Helpful tips and instructions to assist in maintaining your new home. Interactive Reader Kolter Homes Hurricane Guide The Atlantic hurricane season starts on June 1 and will run until Nov. 30. Most of these storms hit during peak hurricane season between August and October. Please be prepared. View PDF Utility Information Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Download PDF Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Home Page Locations NC - Charlotte Area SC - Charleston Area GA - Atlanta Area AL - Gulf Coast FL - Panhandle FL - Greater Orlando Area FL - South Florida FL - Port St Lucie FL - Sarasota/Bradenton Lifestyles & Photos Homes Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.kolter.com/astor-creek-golf-country-club-opens-new-sports-court-facilities/",
      "text": "Astor Creek Golf & Country Club Opens Sports Court Facilities Condominiums Homes Multifamily Land Financial Services About Us History Leadership Community Initiatives Portfolio News Investor Login | Contact We use cookies to ensure you receive the best experience on our website.  By browsing our site, you agree to our use of cookies, our terms of use, and our privacy policy. Learn more GOT IT Boston Herald, 08-08-2024 Astor Creek Golf & Country Club Opens New Sports Court Facilities Click here to read the full article . Ribbon-cutting ceremony and pickleball clinic mark the opening of the community’s pickleball, tennis and basketball courts. PORT SAINT LUCIE, FL / ACCESSWIRE / August 8, 2024 / Astor Creek Golf & Country Club, the Treasure Coast’s first new golf community in decades, hosted a ribbon-cutting ceremony to celebrate the opening of its new pickleball , tennis and basketball courts. The event was sponsored by Kolter Homes and attended by residents, staff, and other VIPs who enjoyed a pickleball clinic that followed the ribbon cutting. Astor Creek Ribbon Cutting Ribbon-cutting celebration for the new Sports Courts at Astor Creek Golf & Country Club. Astor Creeks’ new sports courts are part of the community’s continued growth. Since the community opened for new home sales last October, previous milestones include the opening of the championship golf course & practice facilities and construction start on the clubhouse that will open in 2025. “We are thrilled to unveil our new courts which reflect our commitment to providing a diverse lifestyle experience for our residents,” said Stuart Kennedy, Kolter Homes Community Director at Astor Creek Golf & Country Club. “These facilities are another step toward the clubhouse opening next year.” The 25,000-sq.-ft. Astor Creek Clubhouse will blend the contemporary stylings and features of a sophisticated country club with modern, in-demand amenities and experiences. The clubhouse will feature cutting-edge fitness facilities, dining, an indoor-outdoor full bar & grill, a resort-style pool, and event lawn and services that will offer residents the opportunity to enjoy a well-lived life without leaving the community. Kolter Homes offers 14 floorplans to build on a variety of golf and preserve homesites. Home plans range from two-six bedrooms and offer approximately 1,960 to over 5,000 square feet of living area. Homes are priced from the $500s to over $2 million and include golf membership. A collection of move-in-ready homes is currently available . To learn more about Astor Creek Golf & Country Club, visit AstorCreek.com or call 888-476-3017. Eleven decorated models are open daily to tour. The Kolter Group LLC (together with its affiliates, “Kolter”), based in Delray Beach, Florida, is a private investment firm focused on real estate development and investment. Led by CEO Robert “Bobby” Julien, Kolter operates four residential development business units and has sponsored over $29 billion of realized and in-process residential real estate projects throughout the southeastern United States. •\tKolter has completed 99 residential projects, delivering over 27,800 units. •\tKolter has current investments in 91 residential projects expected to deliver a total of over 65,500 units. Kolter Homes LLC (together with its affiliates, “Kolter Homes”), is focused on the development, construction, and sale of 500-1,500 for-sale single-family units, often as Cresswind branded, age-restricted, amenity-rich master-planned communities. Kolter Homes has sponsored over $16 billion of realized and in-process real estate projects throughout the southeastern United States. •\tKolter Homes has completed 22 projects, delivering over 8,300 residences. •\tKolter Homes has current investments in 29 projects expected to deliver a total of over 24,900 residences. Previous Next NEWS TO SHARE Naples Daily News, 07-06-25 The Ultimate Naples Address Read More... Austin Business Journal, 06-25-25 Charles Cochran Takes Leadership Post at Kolter Multifamily Read More... Multi-Housing News, 06-17-25 Kolter Multifamily Begins Newest Florida Project Read More... Palm Beach Post, 06-02-25 West Palm Commissioners OK 18-Story Tower Across from Mar-a-Lago But Worry What Comes Next Read More... Florida YIMBY, 05-15-25 51-Unit Twin-Tower Development 3300 Gulf Shore Slated to Break Ground in Naples this Fall Read More... Tampa Bay Business & Wealth, 05-01-25 Sales Gallery Opens for The Ritz-Carlton Residences, Sarasota Bay Read More... Newswire, 04-23-25 Kolter Homes Announces Grand Opening of Mosaic Amenity Center in Port St. Lucie Read More... Newswire, 04-03-25 Two Kolter Homes Active Adult Communities Recognized as Top 2025 PCR Communities Read More... TAMPA BAY BUSINESS & WEALTH, 03-31-25 Kolter Urban Unveils Ultra-Luxury Beachfront Residences in Naples Read More... The Real Deal, 03-28-25 Kolter Urban Doubles Down on Luxury Condo Streak in Buckhead Read More... Atlanta Business Chronicle, 03-27-25 Luxury Condo Developer Kolter Urban Pays $38 Million for Site of Next Atlanta Project Read More... Newswire, 03-25-25 Kolter Homes Announces Grand Opening of New Active Adult Community, Cresswind at Hammock Oaks in Lady Lake, FL Read More... Observer, 03-24-25 Developer Announces New Hotel on Hyatt Regency Site Read More... Newswire, 03-20-25 Homes Recognized as Top 5 Finalist in Multiple Categories by Eliant Read More... NEWSWIRE, 03-18-25 Kolter Homes Breaks Ground on Model Park at Esprit at Avenir Read More... NEWSWIRE, 03-03-25 Kolter Homes Announces 50% Sold Milestone for Cresswind Wesley Chapel, an Active Adult Community in the Greater Charlotte Area Read More... Naples News, 02-19-25 Kolter Urban Celebrates Groundbreaking of The Island at West Bay Club Read More... ST PETE RISING, 02-18-25 Renderings Revealed for 162-Unit Condo Development Proposed for Corey Avenue in St. Pete Beach Read More... City Biz, 02-11-25 Kolter Homes Now Building at Master-Planned Ward Creek Community in Panama City Read More... NEWSWIRE, 02-12-25 Kolter Homes Announces Grand Opening of Amenities at Cove Royale in Stuart, Florida Read More... Travel US News, 02-11-25 Hyatt Centric Las Olas has received a GOLD badge for being a Best Hotel in the USA Read More... Naples Daily News, 02-10-25 Pair of Luxury Condo Projects Unveiled for ‘Miracle Mile’ Gulf Shore North in Naples Read More... Newswire, 01-31-25 Kolter Homes Announces Grand Opening of the Lila Model at the Reserve at Victoria Read More... Tampa Bay Business Journal, 01-27-25 Power 100: Tampa Bay’s Most Influential Business Leaders of 2025 Named Read More... Newswire, 01-23-25 Kolter Homes Announces a New Homesite Release at PGA Village Verano Read More... Naples Daily News, 07-06-25 The Ultimate Naples Address Read More... Austin Business Journal, 06-25-25 Charles Cochran Takes Leadership Post at Kolter Multifamily Read More... Multi-Housing News, 06-17-25 Kolter Multifamily Begins Newest Florida Project Read More... Palm Beach Post, 06-02-25 West Palm Commissioners OK 18-Story Tower Across from Mar-a-Lago But Worry What Comes Next Read More... Florida YIMBY, 05-15-25 51-Unit Twin-Tower Development 3300 Gulf Shore Slated to Break Ground in Naples this Fall Read More... Tampa Bay Business & Wealth, 05-01-25 Sales Gallery Opens for The Ritz-Carlton Residences, Sarasota Bay Read More... Newswire, 04-23-25 Kolter Homes Announces Grand Opening of Mosaic Amenity Center in Port St. Lucie Read More... Newswire, 04-03-25 Two Kolter Homes Active Adult Communities Recognized as Top 2025 PCR Communities Read More... TAMPA BAY BUSINESS & WEALTH, 03-31-25 Kolter Urban Unveils Ultra-Luxury Beachfront Residences in Naples Read More... The Real Deal, 03-28-25 Kolter Urban Doubles Down on Luxury Condo Streak in Buckhead Read More... Atlanta Business Chronicle, 03-27-25 Luxury Condo Developer Kolter Urban Pays $38 Million for Site of Next Atlanta Project Read More... Newswire, 03-25-25 Kolter Homes Announces Grand Opening of New Active Adult Community, Cresswind at Hammock Oaks in Lady Lake, FL Read More... Observer, 03-24-25 Developer Announces New Hotel on Hyatt Regency Site Read More... Newswire, 03-20-25 Homes Recognized as Top 5 Finalist in Multiple Categories by Eliant Read More... NEWSWIRE, 03-18-25 Kolter Homes Breaks Ground on Model Park at Esprit at Avenir Read More... NEWSWIRE, 03-03-25 Kolter Homes Announces 50% Sold Milestone for Cresswind Wesley Chapel, an Active Adult Community in the Greater Charlotte Area Read More... Naples News, 02-19-25 Kolter Urban Celebrates Groundbreaking of The Island at West Bay Club Read More... ST PETE RISING, 02-18-25 Renderings Revealed for 162-Unit Condo Development Proposed for Corey Avenue in St. Pete Beach Read More... City Biz, 02-11-25 Kolter Homes Now Building at Master-Planned Ward Creek Community in Panama City Read More... NEWSWIRE, 02-12-25 Kolter Homes Announces Grand Opening of Amenities at Cove Royale in Stuart, Florida Read More... Travel US News, 02-11-25 Hyatt Centric Las Olas has received a GOLD badge for being a Best Hotel in the USA Read More... Naples Daily News, 02-10-25 Pair of Luxury Condo Projects Unveiled for ‘Miracle Mile’ Gulf Shore North in Naples Read More... Newswire, 01-31-25 Kolter Homes Announces Grand Opening of the Lila Model at the Reserve at Victoria Read More... Tampa Bay Business Journal, 01-27-25 Power 100: Tampa Bay’s Most Influential Business Leaders of 2025 Named Read More... Newswire, 01-23-25 Kolter Homes Announces a New Homesite Release at PGA Village Verano Read More... News Channel Nebraska, 01-23-25 Kolter Homes Announces Final Opportunity to Own in Premier Sarasota East Community Read More... Tampa Bay Business Journal, 01-22-25 One of Tampa Bay’s Most Active Condo Developers Drops $92M on Naples Site Read More... Naples Daily News, 01-21-25 Naples’ ‘Miracle Mile’ Sees Another Big Beachfront Property Sale, This Time for $92.5 Million Read More... SF Business Journal, 01-21-25 Nearly 800 apartments proposed in Palm Beach County Read More... Gulfshore Business, 01-21-25 Delray Beach Developer Purchases Naples Condo Project Site for $92.5M Read More... EB5AN, 01-20-25 Twin Lakes Developer Kolter Homes Wins Two Silver Nationals at the 2024 NAHB Awards Read More... Florida & Gulf Coast, 01-17-25 Kolter Urban Pays $92.5M for Naples Construction Site Read More... Newswire, 01-10-25 Kolter Homes Recognized With Two Silver Nationals Read More... PR Newswire, 12-12-24 Kolter Hospitality Promotes John Beaton to Executive Vice President of Operations and Sara Martinez to Senior Vice President of Commercial Sales Read More... The Real Deal, 12-16-24 Kolter Multifamily to Buy in on South St Pete’s Makeover Read More... CoStar, 12-10-24 Florida Developer Heads to Rapidly Growing Tennessee Area for Latest Multifamily Project Read More... EB5AN Investments, 11-21-24 Twin Lakes Developer Kolter Homes Wins Six OBIE Awards Read More... Stock Titan, 11-21-24 Brookfield Residential has Acquired an Ownership Position in Kolter Land to Expand Residential Land Development in Southeast U.S Read More... Know Atlanta, 11-19-24 Silver & Gold: ATL’s Top Choices for New Construction Read More... Luxury Real Estate Forum, 11-18-24 Cresswind Models Take Gold, Silver in 2024 Charlotte Parade of Homes Read More... City Biz, 11-18-24 Cresswind Georgia at Twin Lakes Hosts Honor Flight in Veterans Day Festivities Read More... St. Pete Rising, 11-14-24 42-story Art House Condo Tower Tops Out in Downtown St. Pete Read More... South Florida Agent Magazine, 11-12-24 Kolter Homes begins sales at L’Ambiance at Avenir in Palm Beach Gardens Read More... Tampa Bay Business Journal, 11-04-24 Kolter Buys Prime Development Site in St. Pete Beach Read More... Medium, 10-29-24 Kolter Homes’ Active Adult Communities In The Greater Charlotte Region: Small-Town Living Near Big City Conveniences Read More... Accesswire, 10-24-24 Kolter Homes Hosts Successful Construction Conference at Cresswind Georgia at Twin Lakes Read More... Newswire, 10-23-24 Kolter Homes Announces Estate Homes at Canopy Creek Are Now in Final Phase of Sales Read More... Newswire, 10-22-24 Kolter Homes Announces New Phase of Homesites at NatureWalk at the Watersound Origins Community Read More... The Real Deal, 10-22-24 Kolter Urban all in on luxury condos in market where rentals rule Read More... Hotel Management, 10-17-24 Hotel Management’s 2024 GMs to Watch Read More... Yahoo! Finance, 10-16-24 Kolter Homes Announces the Grand Opening of L’Ambiance at Avenir in Palm Beach Gardens Read More... Atlanta Business Chronicle, 10-15-24 Developer planning $1 billion data center in Monroe County Read More... Atlanta Business Chronicle, 10-15-24 Kolter Group proposes nearly 800 homes in Dawson County Read More... Yahoo! Finance, 09-13-24 Kolter Homes Announces Exciting Progress on Mosaic Community Clubhouse Read More... Urbanize Atlanta, 09-04-24 Deluxe Peachtree Road condo tower serves up first interior glimpses Read More... Accesswire, 09-04-2024 Kolter Homes Southwest Florida Donates Big to Habitat for Humanity Sarasota Read More... The Charlotte Weekly, 08-24-24 Cresswind Charlotte Sells 750th Home Read More... Boston Herald, 08-08-2024 Astor Creek Golf & Country Club Opens New Sports Court Facilities Read More... The Newnan Times-Herald, 08-02-24 Kolter Homes Unveils Revolutionary New Design Studio at Cresswind at Spring Haven Read More... Modern Luxury, 08-2024 Modern Luxury Interiors | South Florida Read More... Palm Beach Illustrated, 08-01-2024 The Palm Beach 100 Read More... Luxury Guide USA, 07-25-2024 First Look Renderings: Solana Bay Read More... Solana Bay, 07-22-24 Arquitectonica Reimagines Miami’s Biscayne Bay Shoreline Read More... Tampa Bay Times , 07-11-24 Crews Break Ground on One Tampa, The City’s Tallest Residential Tower Read More... DWELL, 07-2024 Solana Bay | Dwell Read More... Island West Bay, 06-22-24 Kolter Urban Advances Residence Contracts and Construction at The Island at West Bay Club Read More... Sarasota Magazine, 06-20-2024 These 26 Restaurants Have Extended Their Savor Sarasota Menus Read More... PROFILE Miami , 06-12-24 KOLTER URBAN TOPS OFF SELENE OCEANFRONT RESIDENCES FORT LAUDERDALE AS TALLEST TOWER ON FORT LAUDERDALE BEACH Read More... Chowhound, 06-04-24 13 US Speakeasy Bars That Actually Feel Scandalous Read More... Associated Press News , 05-14-24 Kolter Homes Celebrates Groundbreaking on Mosaic Clubhouse Pool Read More... Prevue Meetings & Incentives, 05-06-2024 Prevue Meetings & Incentives Magazine | May/June 2024 Issue Read More... Miami Herald , 05-03-24 Discover Fort Lauderdale’s Sophisticated Side as a Vacation Destination Read More... City Biz, 04-05-24 Active Adult Community Cresswind at Spring Haven Now Open for Sales Read More... The Wall Street Journal , 04-02-24 They Got a ‘Sleep Divorce’—and Their Marriage Has Never Been Better Read More... The Real Deal, 04-24-24 Kolter, BH launch sales for waterfront North Miami condo project Read More... Meetings Today Florida, 04-01-2024 Meetings TODAY Florida | April 2024 Issue Read More... BraseltonNews TODAY, 03-28-24 Club Cresswind celebrates one-year anniversary Read More... The Atlanta Journal-Constitution , 03-24-24 Active adult community residents feeling lighter with wearable tech Read More... Visit Sarasota, 03-22-2024 A Photographer’s Guide to Sarasota’s Picture-Perfect Spots Read More... Tampa Bay Business Journal , 02-21-24 South Florida developer breaks ground on Osprey apartments Read More... PR Newswire, 02-29-24 Astor Creek Golf & Country Club Begins Vertical Construction on New Clubhouse Read More... , 02-20-24 5 Benefits of Buying Condos Early in the Development Process Read More... The Planet D, 02-18-2024 Where to Stay in Sarasota, Florida in 2024: 5 Best Areas for First-Time Visitors Read More... Kolter, 01-29-24 Kolter & KAST Havana Nights Event Raises $2.0M South Florida Charities Read More... Your Observer , 01-27-24 Construction on Waterfront Ritz-Carlton Tower Begins This Summer Read More... St. Pete Catalyst , 01-02-24 Saltaire Luxury Tower’s Penthouses Sell for Over $7 Million Read More... Florida YIMBY , 01-21-24 Kolter Urban Announces The Ritz-Carlton Residences, Sarasota Bay’s West Tower And The Harbor Club Read More... SF Business Journal, 01-05-24 Related Group sells Miami-Dade County development site to BH Group, Kolter for $20 million Read More... The Real Deal, 01-05-24 BH teams up with Kolter to redevelop White House Inn site in North Miami Read More... Fifty Plus Housing, 2024 Top Active Adult Home Design Trends Read More... Know Atlanta , 01-04-24 Georgia Active 55+ Design Trends: Get More in 2024 Read More... US News, 01-01-24 The Westin Sarasota Read More... Island West Bay, 11-14-23 The Island at West Bay to Be Developed by Industry Leader Kolter Urban Read More... What Now Atlanta, 10-31-23 Kolter Urban Announces Topping Off of The Dillon Buckhead Read More... St. Pete Rising, 11-01-23 Downtown St. Petersburg’s skyline rises to new heights with new development, Art House Read More... Tampa Bay Business Journal, 10-25-23 Here’s who made our list of the Best Real Estate Deals of 2023 Read More... Florida YIMIBY, 08-24-23 Selene Oceanfront Residences Completes Foundation Pour, Initiating Vertical Construction Phase Read More... Atlanta Business Chronicle , 09-08-23 After success of Graydon and The Dillon, Kolter Urban eyes more condo developments in Buckhead Read More... ST. PETE RISING, 08-21-23 35-story luxury condo tower Saltaire is now complete in downtown St. Pete Read More... Real Estate Weekly, 07-27-23 Kolter Multifamily Begins Leasing of Alton Central Park Read More... Your Observer, 07-31-23 Pet-friendly apartment complex slated for SR 64, Lorraine Road Read More... Real Estate Weekly, 07-31-23 Cresswind Charlotte Celebrates 600th Closing as it Marks 6th Anniversary of Sales Read More... St. Pete Rising, 07-26-23 42-story condo tower Art House completes foundation pour in downtown St. Pete Read More... Hotel Business, 07-19-23 Kolter Acquires Two South Florida Hyatt hotels Read More... Tampa Bay Times, 05-17-23 One Tampa condos are selling fast — here’s a peek inside the tower Read More... Patch, 06-16-23 Building In Buckhead: Construction Continues On New Luxury Condos Read More... Tampa Bay Business Journal , 05-12-23 Developer of One Tampa condos preps for site work to begin Read More... The Real Deal, 04-08-23 Kolter buys 144 home lots at Avenir for $18M Read More... Tampa Bay Business Journal, 04-06-23 $43 million hotel approved in downtown St. Pete Read More... Tampa Bay Business Journal,  03-31-23 Kolter Urban’s new Ritz-Carlton Residences, Sarasota Bay sees strong start for reservations Read More... South Florida Business Journal, 01-06-23 The Kolter Group Voted Best Places to Work Read More... ATLANTA AGENT MAGAZINE, 12-27-22 Kolter Homes Breaks Ground on Cresswind at Spring Haven Read More... The Real Deal, 12-22-22 Kolter nabs $240M construction loan for Fort Lauderdale condo towers Read More... Haute Residence, 12-19-22 Kolter Urban Announces Development of The Ritz-Carlton Residences, Sarasota Bay Read More... Tampa Bay Business Journal, 12-16-22 Kolter Urban is a pioneering developer in Tampa Bay Read More... Tampa Bay Business Journal, 10-25-22 18-story luxury condo tower tops out in Sarasota Read More... South Florida Agent, 10-21-22 Fort Lauderdale’s highest penthouse hits the market for $6.3 million Read More... Tampa Bay 100, 09-14-22 Architecture redesign of Tampa’s largest condo tower to reflect city history Read More... ROBB REPORT, 08-25-2022 Inside Fort Lauderdale Beach’s Tallest Penthouses at Selene Read More... St Pete Rising, 06-22-22 42-story condo tower Art House breaks ground in downtown St. Pete Read More... St Pete Rising, 06-09-22 35-story condo tower Saltaire tops out in downtown St. Pete Read More... Coastal Star, 05-04-22 Delray Beach: Earth Day beach cleanup; Delray Municipal Beach — April 22 Read More... TAMPA BAY TIMES, 05-17-22 Plans filed for 54-story downtown Tampa tower, region’s tallest skyscraper Read More... PR NEWSWIRE, 04-25-22 Kolter Hospitality Acquires Sarasota’s Embassy Suites by Hilton Read More... ST PETE RISING, 04-19-22 35-Story Condo Tower Saltaire Sells Out in Downtown St Pete Read More... CATALYST, 04-14-2022 Inside Kolter’s 42-Story Residential Tower, Art House Read More... ATLANTA AGENT MAGAZINE, 04-07-22 Kolter Homes names regional vice president for Georgia and northwest Florida Read More... PATCH, 03-28-22 Cresswind Georgia Fosters Community Ahead of Clubhouse Completion Read More... THE REAL DEAL, 03-25-22 Kolter wants to build 563 townhouses near Homestead Read More... URBANIZE ATLANTA, 03-18-22 Buckhead condo tower aims for next-level lavish Read More... Globe Newswire, 02-24-22 Kolter Homes Approved to Develop New Golf Course and Lifestyle Community on Florida’s Treasure Coast Read More... Sarasota Magazine, 02-22-22 The Quay’s Luxury High-Rise, Bayso, Has Sold Out in Record Time Read More... St. Pete Rising, 02-01-22 Sales launch for Art House, a 42-story building planned for 200 Central Avenue Read More... Tampa Bay Business Journal, 12-08-21 South Florida condo developer Kolter buys prime block in downtown Tampa Read More... Atlanta Business Chronicle, 12-06-21 Kolter Urban buys site for second Buckhead condo tower, $110M project will rise 18 stories Read More... Patch, 11-01-21 Cresswind Georgia at Twin Lakes Wins Four OBIE Awards Read More... Tampa Bay Business Journal, 10-21-21 Developer of ONE, Saltaire plans a new 41-story luxury condo tower in downtown St. Pete Read More... Catalyst, 10-06-21 Kolter Group plans to build 41-story condo tower in downtown St. Pete Read More... PROFILEmiami, 09-16-21 Kolter Urban Announces Grand Opening of Selene Oceanfront Residences Presentation Sales Gallery Read More... Buckhead, 08-19-21 Graydon Buckhead Condo Tower Speeds Toward Early 2022 Opening Read More... PR Newswire, 07-20-21 Artistry Palm Beach Wins Gold as Residential Housing Community of the Year Read More... Island Magazine, 06-14-21 Tall and Tan and Young and Lovely Selene Rises on Fort Lauderdale Beach Read More... PR Newswire  , 05-05-21 PGA Village Verano is Honored as Outdoor Pickleball Facility of the Year Read More... Port Charlotte SUN, 04/28/21 Kolter Land Partners bullish on Charlotte County Read More... Patch, 04/26/21 EGYM Technology Coming to Upcoming Cresswind 55+ Communities Read More... South Flroida Agent Magazine, 04/21/21 Construction on Fort Lauderdale Beach’s Tallest Building to Begin in November Read More... The Real Deal, 04/14/21 Kolter Urban Launches Sales for Fort Lauderdale Beach Condo Towers Read More... BIZNOW, 04/14/21 Pair of 300-Foot Towers Will Be Tallest on Fort Lauderdale Beach Read More... Nashville Tennessean, 02-05-21 Gallatin to look at plan for 2,290 homes on Bowles property; commercial, office space included Read More... Business Observer, 02-05-21 Kolter Group Project Notches Nine-Figure Sales Read More... The Business Journal, 01-25-21 Kolter Urban tops out Buckhead condo tower early, reports strong sales Read More... St. Pete Catalyst, 12-05-20 St. Pete condo tower tops $100M in sales Read More... Sun Port Charlotte, 11-29-20 Model homes imminent in West Port Read More... Mulit-Housing News, 11-13-20 Behind the Project: Fort Lauderdale’s Newest, Tallest Condo-Hotel Mix Read More... Patch, 11-11-20 Kolter Homes Dominates at 2020 OBIE Awards with 17 Wins Read More... Tampa Bay Business Journal, 10-28-20 Even through Covid-19, construction projects in Tampa Bay hammer on, from luxury condos to office buildings Read More... Patch, 10-27-20 Cresswind Georgia Hosts Chamber Of Commerce For Ribbon Cutting Read More... Tampa Bay Business Journal, 10-16-20 Downtown St. Pete penthouse sells for more than $1,200 per square foot Read More... Charlotte Business Journal, 10-13-20 The Kolter Group purchases nearly 300 acres in Union County Read More... TRD Miami, 10-07-20 Kolter wins approval for oceanside Fort Lauderdale condo development Read More... Orlando Business Journal, 10-06-20 Kolter Hospitality shares inside look, more details on new downtown high-rise Marriott hotel Read More... Miami Herald, 10-01-20 Fort Lauderdale’s tallest building has 50 condos left. Here’s who will sell them Read More... Atlanta Business Chronicle, 09-25-20 Buckhead towers mean more opportunity for walkability Read More... PR Newswire, 09-24-20 EGYM and Kolter Homes Partner to Bring Innovative Smart Fitness Technology to Cresswind 55+ Communities Read More... Patch, 08-05-20 Construction Has Begun On Saltaire Condominium Tower In St. Pete Read More... Patch, 08-05-20 Work Gets Underway On Hyde Park House Condominium Tower Read More... Patch, 06-23-20 Cresswind Georgia Sells 60+ Homes Ahead of Official Opening Read More... YourObserver, 06-18-20 Developer plots another high-rise on Quay site Read More... Kolter Homes | Patch, 06-11-20 Kolter Homes Decorated Models in 2020 Atlanta Parade of Homes Read More... Port Charlotte Sun, 04-18-20 Major residential projects plowing ahead Read More... Patch, 04-16-20 Cresswind Peachtree City Top 2019 Atlanta 55+ Neighborhood Read More... St. Pete Rising, 04-13-20 35-story Saltaire condo tower breaks ground in Downtown St. Pete Read More... Curbed Atlanta , 04-07-20 Fresh renderings: Posh Buckhead condo tower breaks ground despite market uncertainty Read More... What Now Atlanta , 04-07-20 [Renderings] Kolter Urban Breaks Ground on Graydon Buckhead Condos Read More... Miami Agent Magazine, 04-01-20 Meet the women behind Fort Lauderdale’s tallest building Read More... Sarasota Magazine, 03-25-20 Downtown Sarasota’s Newest Luxury Condo Project Offers a Sneak Peek — Virtually Read More... Business Observer, 03-20-20 Kolter to develop new Sarasota condo tower Read More... Travel Daily News, 03-05-20 Hyatt Centric Las Olas Fort Lauderdale to welcome its first guests in April Read More... Business Observer, 01-17-20 Long-stalled Murdock Village to Get New Life as Westport Read More... Atlanta Curbed, 12-09-19 Renderings: Buckhead Condo Tower to Launch at Site Once Planned for Emerson Project Read More... Sarasota Magazine, 12-09-19 Kolter Group Announces Topping Out of The Ritz-Carlton Residences Read More... What Now Atlanta, 12-09-19 Kolter Urban Enters Atlanta Market with Graydon Buckhead Condos Read More... Atlanta Business Chronicle, 12-06-19 Florida Developer Enters Atlanta Market with New Buckhead Condo Tower (Renderings) Read More... BuilderOnline, 12-04-19 Robert Rademacher Rejoins Kolter Homes Read More... Patch.com, 11-27-19 Largest Pickleball Facility in Georgia Coming to Hoschton Read More... St. Pete Catalyst, 11-25-19 Take a Peek Inside One of the Highest-Priced Condos Ever Sold in St. Pete Read More... BuilderOnline, 11-25-19 Kolter Homes Plans Prime Pickleball Complex at Georgia 55+ Read More... Palm Beach Post, 11-25-19 Growth 2030: Expect over-55 Developments to Boom in Palm Beach County Read More... Tampa Bay Business Journal, 11-22-19 Real Estate Baron Buys ONE St. Pete Penthouse for Second Highest Price Ever Paid for a St. Pete Condo Read More... Business Observer, 11-15-19 Breathing in the Saltaire Read More... Patch.com, 11-12-19 Cresswind Georgia Creates New Destination in Hoschton Read More... YourObserver.com, 11-01-19 New 55-Plus Community Now Open in Lakewood Ranch Read More... Palm Beach Florida Weekly, 10-24-19 Water Club Offers The Best of Everything Read More... YourObserver.com, 10-18-19 Lakewood Ranch Block Party & Club Day Draws Huge Crowd Read More... Patch, 10-17-19 Cresswind Georgia Communities Experience Sales Success Read More... ReBusiness Online, 10-15-19 Kolter Group Buys Development Site in St. Petersburg for 35-Story Residential Tower Read More... Tampa Bay Business Journal, 10-01-19 Exclusive: With $30 Million in Condos Reserved, Kolter Opens Sales Gallery for New 22-Story Tower Read More... Hospitalitynet, 09-25-19 Katherine Beja-McLennan Appointed Director of Sales and Marketing at Hyatt Centric Las Olas Fort Lauderdale Read More... Sun Port Charlotte, 09-10-19 Cresswind Peachtree City Releases New Phase Read More... Sun Port Charlotte, 09-09-19 Murdock Village Flips to New Developer, To Be Called West Port Read More... St. Pete Catalyst, 08/16/19 Luxury Condos, Affordable Apartments Move Forward After City Council Votes Read More... St. Pete Rising, 08-16-19 35-Story Saltaire Moves Forward with Council Approval Read More... Coastal Breeze News, 08-15-19 Inaugural World Pickleball Beings Open Registration Read More... WPTV, 08-15-19 Alton Development Nearly Complete with Phase One Read More... Buckhead, 07-08-19 Florida-Based Kolter Buys Prime Buckhead Lot For $13.5M Read More... Bradenton Herald, 07-02-19 Lakewood Ranch Growth Continues. More Than 3,000 New Homes Coming To This Part of Town Read More... Orlando Sentinel, 06-24-19 Taxed to the Hilt, More Northern Homebuyers Are Migrating to Florida Read More... Tampa Bay Times, 05-03-19 Reservations Expected to Start Early Next Week for Proposed 35-Story St. Pete Condo Read More... The Real Deal, 05-02-19 Minto Communities Sells 270 Acres of Westlake Project to Kolter Homes Read More... Fort Lauderdale Daily, 04-05-19 100 Las Olas Sky-High Luxury Condominiums To Open In 2020 Read More... Tampa Bay Times, 01-23-19 Is yet another condo tower in downtown St. Petersburg’s future? Read More... 100 Las Olas, 01-07-19 Kolter Urban Celebrates Topping Off of 100 Las Olas Read More... Sarasota Herald-Tribune, 12-10-18 Downtown Sarasota luxury condomania: As tower projects rise, sales are brisk and mostly to local residents Read More... Architect Magazine, 09-18-18 The Ritz-Carlton Residences, Sarasota Read More... The Real Deal, 09-01-18 Kolter plans to build 466 homes in Florida’s Panhandle region﻿ Read More... Skyrise Cities, 01-18-18 Kolter Group’s ONE St. Petersburg to Become Florida City’s Tallest Building Read More... Bizjournals, 12-07-17 With nowhere to go but up, developers propose Miami’s tallest towers ever Read More... CLICK TO VIEW ALL NEWS Select your KOLTER Community of Interest for more Information Request Brochure Popup - Portfolio-Blog First Name Last Name Email Zip Code * Community of Interest * Community of Interest* 1000 Boulevard of the Arts 3300 Gulf Shore Art House Elyse Buckhead Olana Naples One Tampa Selene The Dillon Buckhead The Island at West Bay The Ritz-Carlton Residences, Sarasota Bay I am a Realtor I am a Realtor REQUEST BROCHURE Captcha If you are human, leave this field blank. KOLTER URBAN | KOLTER HOMES | KOLTER MULTIFAMILY | KOLTER HOSPITALITY | KOLTER LAND KOLTER FINANCIAL SERVICES | ABOUT US | CAREERS | INVESTOR LOGIN | CONTACT US Corporate Headquarters The Kolter Group LLC 105 NE 1st St Delray Beach, FL 33444 T 561-682-9500 E info@kolter.com © 2025 The Kolter Group LLC | All Rights Reserved | Terms of Use | Privacy Policy | Site Map ⤬ Select your KOLTER Community of Interest for more Information Request Brochure Popup - Portfolio-Blog First Name Last Name Email Zip Code * Community of Interest * Community of Interest* 1000 Boulevard of the Arts 3300 Gulf Shore Art House Elyse Buckhead Olana Naples One Tampa Selene The Dillon Buckhead The Island at West Bay The Ritz-Carlton Residences, Sarasota Bay I am a Realtor I am a Realtor REQUEST BROCHURE Captcha If you are human, leave this field blank. REQUEST BROCHURE"
    },
    {
      "url": "https://www.newswire.com/news/kolter-homes-is-pleased-to-announce-astor-creek-golf-and-country-club-22461741",
      "text": "Kolter Homes is Pleased to Announce Astor Creek Golf and Country Club Celebrates One-Year Anniversary With a Beatles Tribute Concert |\n                                    Newswire Products Press Release Distribution Press Release Optimizer Media Suite Media Database Media Pitching Media Monitoring Analytics Media Room Pricing Customer Stories Resources Education Blog PR & Earned Media Planner For Journalists RSS Feeds Support Newsroom Log In Sign Up Kolter Homes is Pleased to Announce Astor Creek Golf and Country Club Celebrates One-Year Anniversary With a Beatles Tribute Concert Press Release • Jan 23, 2025 Astor Creek Golf and Country Club in Port St. Lucie, FL PORT SAINT LUCIE, Fla., January 23, 2025 (Newswire.com)\n        - Astor Creek Golf and Country Club, Kolter Homes' premier golf community on the Treasure Coast, recently celebrated its one-year anniversary with a free concert featuring the Liverpool Legends Beatles tribute band. Over 300 residents, members, and guests attended the event, enjoying an evening of music, food, and camaraderie. \"The past year has been an incredible journey for Astor Creek,\" said Stuart Kennedy, Community Director at Astor Creek. \"We've watched this community grow and thrive, and it's been an honor to be a part of it. This concert was the perfect way to celebrate our first anniversary and thank our residents for making Astor Creek such a special place.\" Astor Creek, one of the premier new golf communities in Florida , offers a luxurious lifestyle with a signature 18-hole golf course designed by renowned golf course architect Chris Wilczynski. The community will also feature a state-of-the-art clubhouse , resort-style pool, fitness center, pickleball courts, and a variety of social activities. A key feature of Astor Creek is the opportunity for personalization. Each floorplan offers a minimum of 33 Kolter Structural Options (KSO), allowing homeowners to create a home that perfectly suits their lifestyle. Additionally, a selection of move-in ready homes is available, featuring designer-selected fixtures and finishes. Kolter Homes is committed to building exceptional communities and providing an unparalleled living experience. Astor Creek is a testament to this commitment, offering residents a beautiful place to call home. About Astor Creek Golf and Country Club Astor Creek is a premier golf community located in Port St. Lucie, Florida. Developed by Kolter Homes, the community offers luxurious homes, a championship golf course, and a variety of amenities. To learn more, please click here or call 888-476-3017. The Kolter Group LLC (together with its affiliates, \"Kolter\" ), based in Delray Beach, Florida, is a private investment firm focused on real estate development and investment. Led by CEO Robert \"Bobby\" Julien, Kolter operates four residential development business units and has sponsored over $29 billion of realized and in-process residential real estate projects throughout the southeastern United States (including Florida, Georgia, South Carolina, North Carolina, and Tennessee). Kolter has completed 99 residential projects, delivering over 27,800 units Kolter has current investments in 91 residential projects expected to deliver a total of over 65,500 units Kolter Homes LLC (together with its affiliates, \"Kolter Homes\" ), is focused on the development, construction, and sale of 500-1,500 for-sale single-family units, often as Cresswind-branded, age-restricted, amenity-rich master-planned communities, with additional focus on smaller, traditional and age-targeted add-on communities of 100-500 homes. Kolter Homes has sponsored over $16 billion of realized and in-process real estate projects throughout the southeastern United States. Source: Kolter Homes LLC Tags new construction homes port st lucie homes real estate About Kolter Homes Kolter Homes brings nearly three decades of experience in homebuilding to its master-planned communities throughout Florida, Georgia and the Carolinas that serve both active adult and primary home buyers. www.kolterhomes.com Kolter Homes 4807 PGA Blvd. Palm Beach Gardens, Florida 33418 Contacts John Manrique SVP Marketing jmanrique@kolter.com 561-515-4450 More Press Releases Kolter Homes Hosts Expert-Led Webinar With Realtor.com's Senior Economist: “Is Now the Right Time to Buy?” 3 weeks ago Kolter Homes Kolter Homes Announces New Community Coming Soon: The Cove at Park Trace 1 month ago A New Gated Community Offering Personalized Homes in Stuart, Florida Ribbon Cutting Ceremony Celebrates New Home Community in Panama City Beach 2 months ago Kolter Homes Free PR Guide Products Press Release Distribution Financial Distribution Media Suite Media Database Media Pitching Media Monitoring Analytics Media Room Customer Success Press Release Optimizer Company About Us Blog Customer Stories Our Media Room Resources Resource Center For Journalists Newsroom PR and Earned Media Planner RSS Feeds Media Outlets Support Contact Us Email Support © 2005 - 2025 Newswire Terms of Service Privacy Uptime"
    },
    {
      "url": "https://www.kolterhomes.com/news/kolter-homes-unveils-progress-on-luxurious-astor-creek-clubhouse-in-port-st-lucie/",
      "text": "Kolter Homes Unveils Progress on Luxurious Astor Creek Clubhouse in Port St. Lucie Kolter Homes Toggle Mobile Menu Locations NC - Charlotte Area Cresswind Charlotte Charlotte's Best Located 55+ Community with great amenities & homes, priced from the $400s. Cresswind Wesley Chapel The Charlotte area's #1 selling 55+ community with new homes from the $400s. Handsmill on Lake Wylie The Gentry at Handsmill on Lake Wylie new move-in ready homes in York, SC from the mid $500s. Cresswind at Rocky River - OPEN 2026 COMING SOON - Cresswind Rocky River, a 55+ Community in Locust, North Carolina SC - Charleston Area Cresswind Charleston Active Adult Living with the most amenities in the area, convenient to Charleston from the $400s. The Ponds Single-family homes near the best schools in the Charleston area, from $400s GA - Atlanta Area Cresswind at Spring Haven Welcome to the 4th Cresswind in the Atlanta-area, located in Newnan, featuring completely new floorplans and a next generation Club Cresswind. Cresswind Georgia at Twin Lakes Georgia's #1 55+ community and home of the state's largest private Pickleball Center - New Homes from the $300s to over $1 Million. Oak Hill Reserve An intimate active adult community in Newnan, GA, offering new homes from the $600s, with easy access to shopping, dining, and local attractions. AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 OPENING 2026: debut Cresswind in Alabama, roughly 13 miles from the Gulf beaches FL - Panhandle NatureWalk at Watersound Origins Gated community located two miles from Alys Beach and 30A. Active, outdoor lifestyle with comfortable backyard living and 2- to 6-Bedroom homes from the $500s. Salt Grass at Ward Creek GRAND OPENING - Kolter Homes debut neighborhood in Panama City Beach offering a new collection of home designs. FL - Greater Orlando Area Cresswind at Hammock Oaks Gated, boutique 55+ community and lifestyle located just 3 miles from The Villages with 2- to 5-bedroom homes with optimal flexibility and personalization from the $300s. Cresswind at Lake Harris 55+ community with direct access to Lake Harris in Tavares, FL, \"America's Seaplane City\" offering 1-story homes with best-in-class personalization options from the $300s. Cresswind DeLand Award-winning 55+ homes and lifestyle with convenient access to Orlando from the $300s. NEW MOVE-IN READY HOMES AVAILBLE NOW. The Reserve at Victoria Kolter Homes in The Reserve at Victoria offers new homes ranging from 2- up to 5-Bedrooms from the $400s FL - South Florida Artistry Palm Beach In the heart of Palm Beach Gardens, this gated community features contemporary single-family homes priced from $1.8M to over $2M. Cove at Park Trace - COMING SOON Intimate new neighborhood in Stuart offering a variety of preserve and wooded views. Cove Royale Award-winning To-Be Built and Move-In Ready Homes located in the heart of Stuart—where style, comfort, and everyday convenience meet. Cresswind Palm Beach at Westlake Next generation active adult living and Club Cresswind amenities in Palm Beach County - from the $500s. L'Ambiance at Avenir Explore Kolter's newest Palm Beach Gardens community in Avenir, with beautifully designed 2-5 Bedroom homes from the $800's. Esprit at Avenir - FALL 2025 Gated, 55+ community with on-site dining, chic clubhouse and next-generation new homes in Palm Beach Gardens. FL - Port St Lucie Astor Creek Golf & Country Club Kolter Homes debuts a Golf Community on the Treasure Coast with an 18-hole course, clubhouse and new homes from the $550s to $2M+. Mosaic Explore new 2–5 bedroom homes in the heart of Port St. Lucie, a thriving location known for comfort, convenience, and charm. PGA Village Verano Neighboring PGA Golf Club, resort-style community in Port St. Lucie with new Single-Family Homes from the $300s. Rivella New collection of 2-4 bedroom homes from the upper $300s in the gated, riverside community of Rivella in Port St. Lucie. FL - Sarasota/Bradenton Artistry Sarasota Final Collection of Move-In Ready homes from the $800s, situated on large homesites with stunning water views. Cresswind Lakewood Ranch Gated, 55+ Active Adult village in Lakewood Ranch close to Sarasota & Bradenton with new homes from the upper $400s. Woodland Preserve Kolter's latest 55+ community in the Sarasota-Bradenton area is now open in Parrish with 2-5 Bedroom homes. Lifestyles & Photos Homes Free Brochure Kolter Homes Unveils Progress on Luxurious Astor Creek Clubhouse in Port St. Lucie Email Astor Creek Clubhouse: A New Standard of Luxury and Community Living Port St. Lucie, FL – February 13, 2025 – Kolter Homes, a leading home builder , is pleased to provide an update on the construction of the Astor Creek Golf and Country Club clubhouse, a key feature of the premier new golf community on Florida’s Treasure Coast . Set to open in 2025, the Astor Creek Clubhouse promises to deliver an unparalleled experience with a range of luxurious amenities designed to enhance the lifestyle of its residents. Exciting Clubhouse Amenities The Astor Creek Clubhouse will feature a full-service restaurant and bar with both indoor and outdoor dining options, a state-of-the-art fitness center powered by EGYM, and a resort-style heated pool with lap lanes and a beach entry overlooking the golf course. Additional amenities include four tennis courts, sixteen pickleball courts, a basketball court, two bocce courts, and an event lawn. Click Here to Preview the Clubhouse Community Director's Insights Stuart Kennedy, Community Director at Astor Creek, shared his enthusiasm about the progress made on the clubhouse and the future of the community. \"We are thrilled with the advancements in the construction of the Astor Creek Clubhouse. This facility is set to become the heart of our community, offering residents a place to gather, stay active, and enjoy the beautiful surroundings. Our team is dedicated to ensuring that every detail meets the highest standards of quality and luxury.\" Kennedy added, \"The Astor Creek Clubhouse is more than just a building; it's a testament to our commitment to creating a vibrant and connected community. We look forward to welcoming our residents to this exceptional facility and seeing them enjoy all that it has to offer.\" Click Here to View Community Photos & Videos Kolter Homes' Debut Golf Community Astor Creek Golf and Country Club is Kolter Homes' debut golf community on the Treasure Coast, featuring a signature 18-hole golf course designed by renowned architect Chris Wilczynski. The community offers contemporary new home designs with a focus on personalization, providing each floorplan with a minimum of 33 structural options. Homebuyers can also choose from a selection of move-in ready homes , complete with fixtures and finishes selected by design professionals. For those seeking new construction homes in Port St. Lucie , Astor Creek offers an array of options to suit various preferences and timelines. Additionally, those interested in Port St. Lucie homes for sale will find a variety of choices within this vibrant community. Click Here to Preview the Golf Course Inclusive Club Membership Club membership and full golf privileges are included with the purchase of a new home at Astor Creek, making it an attractive option for golf enthusiasts and those seeking an active, luxurious lifestyle. The community's location in Port St. Lucie offers convenient access to the area's beaches, shopping, dining, and entertainment options. Click Here to Learn More About Memberships State-of-the-Art Fitness Center The fitness center at the Astor Creek Clubhouse will be powered by EGYM, a leading provider of smart fitness equipment and technology. Residents will have access to group fitness studios and personal training spaces, ensuring a comprehensive and personalized fitness experience. The resort-style heated pool, with its lap lanes and beach entry, will provide a perfect setting for relaxation and recreation, all while overlooking the stunning golf course. Click Here to Learn More About EGYM Variety of Recreational Options In addition to the fitness and dining amenities, the clubhouse will offer a variety of recreational options. The four tennis courts and sixteen pickleball courts will cater to both casual players and competitive athletes. The basketball court and two bocce courts will provide additional opportunities for residents to stay active and engaged. The event lawn will serve as a versatile space for community gatherings, celebrations, and outdoor activities. Click Here to View the Pickleball Opening Clinic Looking Ahead As construction progresses, Kolter Homes remains focused on delivering a clubhouse that exceeds expectations and sets a new standard for luxury living on the Treasure Coast. The Astor Creek Golf and Country Club is poised to become a sought-after destination for homebuyers seeking a unique blend of elegance, activity, and community. Click Here to Watch a Video Tour For those interested in Port St. Lucie homes for sale , Astor Creek offers a variety of options within this vibrant community. You might alse be interested in ... Communities with Pickleball Courts and Fitness Centers New Phase of Homesites Now Available at The Ponds Kolter Homes Announces Cresswind at Rocky River Coming Soon to Charlotte Area See all News Leave this field empty Have a Question? PROCESSING SUBMIT Disclaimer Disclaimer I agree that the Kolter Group LLC and its affiliates (\"Kolter\") and certain third party service providers designated by Kolter may use the information submitted on this form for purposes of online and off-line marketing, which may include providing me with information, surveys, marketing materials, or offers that may be of value to me, which may be provided via mail, email, or phone call. I agree that such calls may be advertising or telemarketing messages and may be made using an automatic telephone dialing system or an artificial prerecorded voice. I understand that my consent to receive such calls is not a condition of purchasing any goods or services from Kolter. Kolter shall comply with their Privacy Policy or Terms of Use , which can be found at www.Kolter.com and by clicking on the link to Privacy Policy or Terms of Use . Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title proudly presented by: Kolter Homes All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Home Page Locations NC - Charlotte Area SC - Charleston Area GA - Atlanta Area AL - Gulf Coast FL - Panhandle FL - Greater Orlando Area FL - South Florida FL - Port St Lucie FL - Sarasota/Bradenton Lifestyles & Photos Homes Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://dashhernandez.com/port-saint-lucie/port-saint-lucie-gated-communities/astor-creek-golf-country-club-kolter-homes/",
      "text": "Astor Creek Golf & Country Club | Golf community Port St Lucie Florida Kolter Skip to content Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans 305-3427413 ASTOR CREEK GOLF & COUNTRY CLUB Astor Creek Golf & Country Club: Premier Living in Port St. Lucie Astor Creek Golf & Country Club is an exclusive, gated community located in the heart of Port St. Lucie, Florida. This premier golf course community is designed for those who seek a modern, luxurious country club lifestyle with world-class amenities and beautiful surroundings. Community Overview Astor Creek is renowned for its picturesque landscapes and a challenging 18-hole championship golf course designed by Christopher Wilczynski. The community features approximately 900 homes, all crafted with contemporary designs and high-end finishes, providing residents with both comfort and elegance. Amenities Residents of Astor Creek Golf & Country Club enjoy an array of top-tier amenities, including: Clubhouse : The 1566 Club, which includes dining rooms, a bar, a golf shop, men’s and women’s locker rooms, and a state-of-the-art fitness center. Outdoor Pool : A stunning resort-style pool with cabanas for ultimate relaxation. Sports Courts : Tennis, pickleball, bocce, and basketball courts are available for all sports enthusiasts. Golf Course : A signature 18-hole golf course featuring forgiving fairways and a playable landscape, perfect for golfers of all skill levels. Practice Facilities : A 15-acre grass driving range, a 3-acre short game complex, and a 15,000 sq. ft. practice putting green Lifestyle and Activities Astor Creek fosters a vibrant community atmosphere with numerous activities and social events throughout the year. Whether you enjoy golfing, swimming, fitness classes, or social gatherings, there’s always something to do. The community also hosts tournaments and outings, making it a perfect place for both relaxation and active living. Location and Accessibility Located conveniently near I-95 and Florida’s Turnpike, Astor Creek provides easy access to the Treasure Coast’s best shopping, dining, and recreational options. The community is just 25 minutes from the beach and 40 minutes north of the Palm Beaches, offering residents both tranquility and convenience. Homes and Real Estate Astor Creek features a variety of luxurious homes with options for 2 to 6 bedrooms. The homes are designed with open floor plans, spacious family kitchens, and large windows that bring in plenty of natural light. Many models include flex rooms, ideal for home offices or playrooms, and second-floor bonus rooms that can be customized as home gyms, extra bedrooms, or in-law suites. Here are some of the popular models: Jordan : 2,732 Total Sq. Ft., 2 Bedroom (up to 4 Bedroom), Flex Room, 2 Bath, Great Room, 2-Car Garage. Starting Price $506,990. Katherine : 2,753 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 2 Full and 1 Half Bath, Great Room, 2-Car Garage. Starting Price $513,990. Leslie : 2,871 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $539,990. Madeline : 3,023 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $544,990. Natalie : 3,044 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $590,990. Priscilla : 3,511 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 3-Car Garage. Starting Price $621,990. Rebecca : 3,405 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage. Starting Price $639,990. Sophia : 3,932 Total Sq. Ft., 3 Bedroom (up to 6 Bedroom), 3 Full and 1 Half Bath, Great Room, Club Room, 3-Car Garage. Starting Price $966,990. Tori : 3,974 Total Sq. Ft., 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage. Starting Price $812,990. Victoria : 4,698 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage. Starting Price $861,990. Waverly : 4,540 Total Sq. Ft., 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage. Starting Price $869,990. Wynona : 5,401 Total Sq. Ft., 3 Bedroom (up to 6 Bedroom), 3 Full and 1 Half Bath, Great Room, Club Room, 3-Car Garage. Starting Price $966,990. Xena : 5,526 Total Sq. Ft., 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room, 3-Car and 1-Car Split Garage. Starting Price $987,990. Zara : 5,814 Total Sq. Ft., 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room, 4-Car Split Garage. Starting Price $1,030,990 ( Kolter Homes ) ( New Home Source ) ( PrivateCommunities ) . Plan a Visit to Astor Creek Step into the luxurious lifestyle of Astor Creek Golf & Country Club by planning a visit. Explore the beautifully designed homes and world-class amenities that make this community truly exceptional. To schedule your tour or to explore similar new construction communities, contact us at 305-342-7413 or email [email protected] . HOA Fees As of April 2024, the HOA fees in Astor Creek range from $260 to $280 per month. These fees cover a variety of services and amenities that help maintain the community’s high standards. For specific information on the current HOA fees, please get in touch with our team. ASTOR CREEK GOLF & COUNTRY CLUB Astor Creek Models Zara Model at Astor Creek Golf & Country Club Rebecca Model at Astor Creek Golf & Country Club EXPLORE PORT ST LUCIE GATED COMMUNITIES VIEW HOMES FOR SALE IN PGA VERANO EXPLORE ALL HOMES WITH POOL [showcaseidx_hotsheet name=\"HEATHERWOOD\"] Discover the Rebecca Model at Astor Creek Golf & Country Club. Nearby amenities include: Local Neighborhoods: Tradition Closest Beach: Jensen Beach Closest Hospital: Cleveland Clinic Tradition Hospital Four Seasons at Wylder Model Homes Four Seasons at Wylder Model Homes Taylor Kelly Franklin Morse Astaire Stanwyck Bogart Carver Bell New Construction Port St Lucie New Construction in Port St Lucie Four Seasons at Wylder Port St Lucie Guide Port St Lucie Guide Port St. Lucie Florida Map Hospitals in Port St. Lucie Things to Do in Port St. Lucie Port St. Lucie Neighborhood Map Restaurants in Port St. Lucie Port St. Lucie Weather Beaches Near Port St. Lucie Mortgage Calculator Schedule a Consultation or Property Tour Sign Up Free Home Valuation Mortgage Calculator Schedule a Consultation or Property Tour Sign Up Free Home Valuation DASHIL \"DASH\" HERNANDEZ License #: SL3605300 Dash Hernandez Privacy Terms of Use ✕ FREE DIGITAL GUIDE Discover Four Seasons at Wylder The most comprehensive 55+ community guide for Port St. Lucie. Floorplans, amenities, exclusive tips & more—yours instantly. I consent to be contacted for this request. ⬇️ Get My Free Guide 🎉 Thank you! Your guide is on its way. Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans Four Seasons at Wylder Floor Plans Spring Lake IV by K. Hovnanian Bell by K. Hovnanian Taylor by K. Hovnanian Kelly by K. Hovnanian Franklin by K. Hovnanian Morse by K. Hovnanian Astaire by K. Hovnanian Stanwyck by K. Hovnanian Bogart by K. Hovnanian Carver by K. Hovnanian Why Wylder Amenities & Lifestyle Gallery FAQ HOA fees Blog Video Tour Schedule a Tour Realtors Floorplans"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/lifestyle/membership/",
      "text": "Astor Creek Golf & Country Club Membership Astor Creek Golf & Country Club Clubhouse & Lifestyle Astor Creek Clubhouse 18-Hole Championship Course Astor Creek Membership EGYM Circuit Training Site Plan & Location Site Plan Area Video & Information Area Points of Interest Homes Jordan 2 Bedroom (up to 4 Bedroom), Flex Room, 2 Bath, Great Room, 2-Car Garage 1,968 Living Area Sq. Ft. Katherine 3 Bedroom (up to 4 Bedroom), Flex Room, 2 Full and 1 Half Bath, Great Room, 2-Car Garage 1,983 Living Area Sq. Ft. Leslie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,129 Living Area Sq. Ft. Madeline 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,289 Living Area Sq. Ft. Natalie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,323 Living Area Sq. Ft. Priscilla 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 3-Car Garage 2,490 Living Area Sq. Ft. Rebecca 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car Garage 2,586 Living Area Sq. Ft. Sophia 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 2,776 Living Area Sq. Ft. Tori 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 2,876 Living Area Sq. Ft. Victoria 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 3,224 Living Area Sq. Ft. Waverly 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 3,265 Living Area Sq. Ft. Wynona 3 Bedroom (up to 6 Bedroom) 3 Full and 1 Half Bath, Great Room, Club Room and 3-Car Garage 3,874 Living Area Sq. Ft. Xena 4 Bedroom (up to 6 Bedroom) 4 Full and 1 Half Bath, Great Room, Club Room, 3-Car and 1-Car Split Garage 3,932 Living Area Sq. Ft. Zara 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room and 4-Car Split Garage 4,222 Living Area Sq. Ft. Photos Schedule Your Tour Membership Return to Clubhouse & Lifestyle We understand a great golf experience is as much about the people as it is the course design and conditioning. Whether a Resident or Invitational member, the Astor Creek golf membership experience is grounded in hospitality with a goal to create camaraderie. Beyond great play, a full-time Lifestyle Coordinator is focused on planning and executing social events, activities and programs that create connection between members and fun for all. For Astor Creek new home buyers, club membership is included. Resident Membership • Unlimited Family Golf Privileges as outlined in Rules & Regulations • Unlimited Driving Range, Short Game Complex and Practice Green access • 14-day Advanced Tee Time Booking • Unlimited access to all Clubhouse amenities including Fitness Center, Pool, Dining, Pickleball, Tennis and Sports Courts • Membership INCLUDED with the Purchase of a New Home Invitational Membership • Unlimited Family Golf Privileges as outlined in Rules & Regulations • Unlimited Driving Range, Short Game Complex and Practice Green access • 10-day Advanced Tee Time Booking • Clubhouse Dining • Membership requires an initial Club Contribution and Annual Dues - click here to contact the Astor Creek Director of Golf for details Schedule Your Tour Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title proudly presented by: Kolter Homes All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Community Home Page Clubhouse & Lifestyle Site Plan & Location Homes Photos kolterhomes.com NC - Charlotte Area Cresswind Charlotte Cresswind Wesley Chapel Handsmill on Lake Wylie Cresswind at Rocky River - OPEN 2026 SC - Charleston Area Cresswind Charleston The Ponds GA - Atlanta Area Cresswind at Spring Haven Cresswind Georgia at Twin Lakes Oak Hill Reserve AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 FL - Panhandle NatureWalk at Watersound Origins Salt Grass at Ward Creek FL - Greater Orlando Area Cresswind at Hammock Oaks Cresswind at Lake Harris Cresswind DeLand The Reserve at Victoria FL - South Florida Artistry Palm Beach Cove at Park Trace - COMING SOON Cove Royale Cresswind Palm Beach at Westlake L'Ambiance at Avenir Esprit at Avenir - FALL 2025 FL - Port St Lucie Mosaic PGA Village Verano Rivella FL - Sarasota/Bradenton Artistry Sarasota Cresswind Lakewood Ranch Woodland Preserve Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login CALL HOMES DIRECTIONS Hi, Would you like a personalized brochure of Astor Creek Golf & Country Club ? Yes, please! No, thank you Closing this window will not prevent you from receiving a personalized brochure in the future. When you're ready, look for the \"Get your personalized brochure\" button and click it to request one. Get Your Personalized Brochure! Thank you for your interest in Astor Creek Golf & Country Club! To help us provide the most useful information possible for your new home search, please take a moment to answer a few questions. Based on your answers, a personalized PDF brochure will be built for you and a link to download it delivered to your email. Let's get started! Already have a favorites account? Great! You can log in to expedite the process and save your personalized brochure to your favorites collection. Creating an account is optional but offers the convenience of saving your personalized brochure for easy access in the future. Creating an account is not required to receive your personalized brochure. Email Password (forgot password) Login Cancel First Name Last Name E-mail Phone Preferred method of contact Choose a preferred method of contact Email Phone Call Text Message How many bedrooms are you interested in? Check all that apply 2 3 4 5 6 What is the minimum square footage you are looking for? ANY SQ. FT. 1000 sq. ft. + 1500 sq. ft. + 2000 sq. ft. + 2500 sq. ft. + 3000 sq. ft. + 3500 sq. ft. + 4000 sq. ft. + What structural and home options interest you? Check all that apply 3+ Car Garage Den/Study Great Room Island Kitchen Lanai/Outdoor Living Pool Single-story Bonus Room Move-In Ready Homes What amenities and lifestyle programs are important to you? Check all that apply Community Events Clubhouse Fitness Community Pool Golf Area - Retail | Dining | Entertainment Tennis Pickleball Pet Friendly Area - Medical Care Lifestyle Director Area – Travel | Commuting What additional resources would you like information about? Check all that apply New Home Features CTC Flyer Fly and Buy Program New vs Used Comparison Design Studio Experience Create a favorites account to save your personalized brochure for easy access and management in the future. Leave this field empty Processing ... Submit Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://www.kolterhomes.com/new-homes/port-st-lucie-florida-golf-astor-creek-country-club/4890/floorplan/jordan/",
      "text": "Jordan Model | Astor Creek Golf & Country Club Astor Creek Golf & Country Club Clubhouse & Lifestyle Astor Creek Clubhouse 18-Hole Championship Course Astor Creek Membership EGYM Circuit Training Site Plan & Location Site Plan Area Video & Information Area Points of Interest Homes Jordan 2 Bedroom (up to 4 Bedroom), Flex Room, 2 Bath, Great Room, 2-Car Garage 1,968 Living Area Sq. Ft. Katherine 3 Bedroom (up to 4 Bedroom), Flex Room, 2 Full and 1 Half Bath, Great Room, 2-Car Garage 1,983 Living Area Sq. Ft. Leslie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,129 Living Area Sq. Ft. Madeline 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,289 Living Area Sq. Ft. Natalie 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 2-Car Garage 2,323 Living Area Sq. Ft. Priscilla 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Bath, Great Room, 3-Car Garage 2,490 Living Area Sq. Ft. Rebecca 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car Garage 2,586 Living Area Sq. Ft. Sophia 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 2,776 Living Area Sq. Ft. Tori 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 2,876 Living Area Sq. Ft. Victoria 3 Bedroom (up to 5 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 2-Car and 1-Car Split Garage 3,224 Living Area Sq. Ft. Waverly 3 Bedroom (up to 4 Bedroom), Flex Room, 3 Full and 1 Half Bath, Great Room, 3-Car Garage 3,265 Living Area Sq. Ft. Wynona 3 Bedroom (up to 6 Bedroom) 3 Full and 1 Half Bath, Great Room, Club Room and 3-Car Garage 3,874 Living Area Sq. Ft. Xena 4 Bedroom (up to 6 Bedroom) 4 Full and 1 Half Bath, Great Room, Club Room, 3-Car and 1-Car Split Garage 3,932 Living Area Sq. Ft. Zara 4 Bedroom (up to 6 Bedroom), 4 Full and 1 Half Bath, Great Room, Club Room and 4-Car Split Garage 4,222 Living Area Sq. Ft. Photos Schedule Your Tour 1 of 14 Homes Return to Homes 25 PHOTOS Virtual Tour Jordan Starting Price: $570,990 Estimate Your Monthly Payment 1 of 14 Homes Return to Homes Bedrooms 2 Option for up to 4 Full Baths 2 Option for up to 3 Half Baths 0 Option for up to 2 Stories 1 Optional 2nd Floor Garage 2 Living Area Sq. Ft. 1,968 2,732 Total Sq. Ft. Structural Options 26 Build your home Video Included Features Floorplan Exteriors Floorplan Exteriors About this floorplan The Kitchen serves as the command center of the Jordan floorplan. For the chef in the family, there's lots of space to work and house your tools of the trade with substantial countertop area, cabinetry and pantry. From the island, the view opens up light & bright across the Dining area and Great Room out to the covered Lanai. Owner's Suite highlights include a tray ceiling, spacious walk-in closet and separate vanities in the Owner’s Bath. You can personalize the Jordan floorplan with structural options that include three different exterior choices; second-floor Bonus Room variations; Snore Room, Fitness/Study or Bedroom 3 in lieu of Flex; In-Law Suite in lieu of Flex & Bedroom 2; four-foot rear extension of home, and if you're looking for more stow space, add light Attic storage and/or extend the Garage. To learn about all the ways you can have this home built around you, contact an Astor Creek New Home Guide. Homesites, given their appeal and location within the community, may carry an additional cost. This cost is not reflected in the base price of this floorplan. Please schedule an online or in-person tour for details. Interested in the Jordan? To speak with an Online Home Guide call (888) 476-3017 First Name Last Name E-mail Phone (Optional) Preferred method of contact Choose a preferred method of contact Phone Call Text Message By opting into SMS from a web form or other medium, you are agreeing to receive SMS messages from Kolter. This includes SMS messages for appointment scheduling and reminders. Message frequency varies. Message and data rates may apply. See privacy policy at https://www.kolter.com/privacy-policy/ . Message HELP for help. Reply STOP to any message to opt out. Questions and/or Comments: Leave this field empty Processing Submit Request I agree that the Kolter Group LLC and its affiliates (\"Kolter\") and certain third party service providers designated by Kolter may use the information submitted on this form for purposes of online and off-line marketing, which may include providing me with information, surveys, marketing materials, or offers that may be of value to me, which may be provided via mail, email, or phone call. I agree that such calls may be advertising or telemarketing messages and may be made using an automatic telephone dialing system or an artificial prerecorded voice. I understand that my consent to receive such calls is not a condition of purchasing any goods or services from Kolter. Kolter shall comply with their Privacy Policy or Terms of Use , which can be found at www.Kolter.com and by clicking on the link to Privacy Policy or Terms of Use . Add to Favorites 1 of 14 Homes Return to Homes Homeowner Portal Favorites Account All Communities All Move-In Ready Homes About Us The Kolter Group Trade Partners Kolter Contacts Page Mortgage Title proudly presented by: Kolter Homes All floorplans, elevations, specifications, square foot calculations, prices, amenities and product offering are subject to change without notice, errors and/or omissions. Renderings are artist's concept for illustrative purposes only and should not be relied upon when making decisions to the purchase of property. CRC057817/CGC1514916 © 2025 Kolter Homes LLC Equal Housing Opportunity facebook instagram youtube Realtor Portal Realtor Policy Kolter News Careers Kolter Hospitality Kolter Urban Privacy Policy Terms of Use Accessibility Site Map Community Home Page Clubhouse & Lifestyle Site Plan & Location Homes Photos kolterhomes.com NC - Charlotte Area Cresswind Charlotte Cresswind Wesley Chapel Handsmill on Lake Wylie Cresswind at Rocky River - OPEN 2026 SC - Charleston Area Cresswind Charleston The Ponds GA - Atlanta Area Cresswind at Spring Haven Cresswind Georgia at Twin Lakes Oak Hill Reserve AL - Gulf Coast Cresswind at Sandy Creek - OPEN 2026 FL - Panhandle NatureWalk at Watersound Origins Salt Grass at Ward Creek FL - Greater Orlando Area Cresswind at Hammock Oaks Cresswind at Lake Harris Cresswind DeLand The Reserve at Victoria FL - South Florida Artistry Palm Beach Cove at Park Trace - COMING SOON Cove Royale Cresswind Palm Beach at Westlake L'Ambiance at Avenir Esprit at Avenir - FALL 2025 FL - Port St Lucie Mosaic PGA Village Verano Rivella FL - Sarasota/Bradenton Artistry Sarasota Cresswind Lakewood Ranch Woodland Preserve Save your favorite communities, homes and home plans. Your easy, home-shopping organizer. Full Name Email Password Confirm Password Processing ... Create Already have a Favorites file? Login Leave this field empty × Get a Quote Jordan - Port St. Lucie, Florida 34987 Your FREE Mortgage Pre-Qualification is compliments of CTC Mortgage, Kolter Homes' affiliated lender of choice. For more, visit CTCMortgage.com . First Name Last Name Credit History Excellent Good Fair Poor Preferred Method of Contact Select Phone Email Phone Number Email Thank you for your interest in our Jordan Model at . A Kolter-affiliated mortgage specialist will be in touch as soon as possible to provide your free pre-qualification and discuss your home financing needs and options. Processing Submit Close Mortgage Calculator Starting Price $ Estimated Homesite & Personalization Options % Estimated Total Price $ Interest Rate % Mortgage Length 40 30 25 15 Down Payment % Calculate Reset Calculation Results LOAN SUMMARY ESTIMATES Down Payment $ Loan to Value Ratio (LTV) % Loan Amount $ DETAIL ESTIMATES Monthly Expenses PRINCIPAL & INTEREST Mortgage Payment $ Tax Expense $ Insurance Expense $ Total Estimated Expense $ Close Calculator Get Pre-Qualified Figures on taxes and insurance are estimates - does not include utilities or HOA fees. Speak with a Kolter Homes Online Home Guide regarding all Down Payment requirements. Hi, Would you like a personalized brochure of Astor Creek Golf & Country Club ? Yes, please! No, thank you Closing this window will not prevent you from receiving a personalized brochure in the future. When you're ready, look for the \"Get your personalized brochure\" button and click it to request one. Get Your Personalized Brochure! Thank you for your interest in Astor Creek Golf & Country Club! To help us provide the most useful information possible for your new home search, please take a moment to answer a few questions. Based on your answers, a personalized PDF brochure will be built for you and a link to download it delivered to your email. Let's get started! Already have a favorites account? Great! You can log in to expedite the process and save your personalized brochure to your favorites collection. Creating an account is optional but offers the convenience of saving your personalized brochure for easy access in the future. Creating an account is not required to receive your personalized brochure. Email Password (forgot password) Login Cancel First Name Last Name E-mail Phone Preferred method of contact Choose a preferred method of contact Email Phone Call Text Message How many bedrooms are you interested in? Check all that apply 2 3 4 5 6 What is the minimum square footage you are looking for? ANY SQ. FT. 1000 sq. ft. + 1500 sq. ft. + 2000 sq. ft. + 2500 sq. ft. + 3000 sq. ft. + 3500 sq. ft. + 4000 sq. ft. + What structural and home options interest you? Check all that apply 3+ Car Garage Den/Study Great Room Island Kitchen Lanai/Outdoor Living Pool Single-story Bonus Room Move-In Ready Homes What amenities and lifestyle programs are important to you? Check all that apply Community Events Clubhouse Fitness Community Pool Golf Area - Retail | Dining | Entertainment Tennis Pickleball Pet Friendly Area - Medical Care Lifestyle Director Area – Travel | Commuting What additional resources would you like information about? Check all that apply New Home Features CTC Flyer Fly and Buy Program New vs Used Comparison Design Studio Experience Create a favorites account to save your personalized brochure for easy access and management in the future. Leave this field empty Processing ... Submit Please ensure Javascript is enabled for purposes of website accessibility"
    }
  ]
}