{
  "fuentes": [
    {
      "url": "https://www.krisatravels.com/contact-us",
      "email": "contact@krisatravels.com"
    },
    {
      "url": "https://krushbraupark.com/pic-menu",
      "email": "contact@krushbrau.com"
    },
    {
      "url": "https://krushbraupark.com/pic-menu",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://krushbraupark.com/",
      "email": "contact@krushbrau.com"
    },
    {
      "url": "https://krushbraupark.com/",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://krushbraupark.com/portal-immersion-center",
      "email": "contact@krushbrau.com"
    },
    {
      "url": "https://krushbraupark.com/portal-immersion-center",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://krushbraupark.com/oktoberfest",
      "email": "contact@krushbraupark.com"
    },
    {
      "url": "https://krushbraupark.com/oktoberfest",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://krushbraupark.com/about",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://www.centralfloridalifestyle.com/event-location/krush-brau-park-portal-immersion-center/",
      "email": "contact@lifestylescfl.com"
    },
    {
      "url": "https://www.orlandosentinel.com/2022/10/02/krush-brau-park-in-kissimmee-brings-lively-oktoberfest-aims-for-future-as-mini-epcot/",
      "email": "pconnolly@orlandosentinel.com"
    },
    {
      "url": "https://krushbraupark.com/faq",
      "email": "contact@krushbrau.com"
    },
    {
      "url": "https://krushbraupark.com/faq",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://krushbraupark.com/location",
      "email": "filler@godaddy.com"
    },
    {
      "url": "https://summertoberfest.com/",
      "email": "contact@krushbrau.com"
    },
    {
      "url": "https://summertoberfest.com/",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://summertoberfest.com/",
      "email": "filler@godaddy.com"
    }
  ],
  "mails": [
    "contact@krisatravels.com",
    "contact@krushbrau.com",
    "contact@krushbraupark.com",
    "contact@lifestylescfl.com",
    "eben@eyebytes.com",
    "filler@godaddy.com",
    "pconnolly@orlandosentinel.com"
  ],
  "nombre_sitio": "krushbraupark.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.krisatravels.com/contact-us",
      "text": "Contact us How to book custom tour package | KRISA TRAVELS KRISA TRAVELS Home Services Contact Hotel's Activities Explore India International Destinations KRISA TRAVELS Home Services Contact Hotel's Activities Explore India International Destinations Contact Krisa Travels Get in touch for customized itineraries, tour packages, and travel assistance for your dream vacations. Contact Us Enter your first name Provide your email address* Share your travel inquiry* Submit your travel request Reach out for customized itineraries, tour packages, visa assistance, and bookings for your dream vacations. Contact Us Visit us for customized travel packages and assistance with flights, visas, and sightseeing tickets for your dream vacations. Location Country Club, B Lane,Northmain Road, Near Gulmohar court, Koregaon Park, Pune, Maharashtra, Pin- 411001 Hours 10:00 AM - 11:30 PM Popular Destinations Services Contact Enter your email address here Submit your travel request Â© 2025. All rights reserved. Privacy p olicy Refund  policy Policy's Agra, Rajasthan, Goa, Kerala, Varanasi Dubai, Bali , Thailand, Paris, Rome, New York city Address B Lane, 6 Raghvilash Society ,North Main Road , Above One8 Commune, Koregoan Park, Pune, Pin-411001 ,Maharashtra, IN Mob - 7498491832 / 9146867279 E-Mail-contact@krisatravels.com Domestic and international airline tickets, Budget to luxury hotels, resorts, and boutique stays, Customized and fixed itinerary packages, Tourist, business, and transit visas, Emergency assistance services Search Amazon.in Quick Pay"
    },
    {
      "url": "https://krushbraupark.com/pic-menu",
      "text": "PIC Menu | Krush Brau Park Krush Brau Park is The Largest German Beer Garden in the US and Veteran Owned Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner More Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Signed in as: filler@godaddy.com Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Account Orders My Account Sign out Sign In Orders My Account Food Menu Food Menu Food Menu Food Menu Food Menu Food Menu Bar Menu Special Menu Special Menu Special Menu Special Menu Special Menu Contact Us Krush Brau Park Portal Immersion Center 2198 Four Winds Blvd, Kissimmee, FL 34746 World Event Center (Temporarily Closed) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 Biergarten (Under Construction-Coming Soon) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 (855) 49KRUSH / (855)-495-7874 contact@krushbrau.com Drop us a line! Drop us a line! Name Email* This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Drop us a line! Copyright © 2023 Krush Brau Park - All Rights Reserved. Powered by Dogtoberfest Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Location Contact Us Privacy Policy Terms and Conditions beer/pilsner This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://krushbraupark.com/",
      "text": "Krush Brau Park - Home Krush Brau Park is The Largest German Beer Garden in the US and Veteran Owned Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner More Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Signed in as: filler@godaddy.com Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Account Orders My Account Sign out Sign In Orders My Account Celebrating Oktoberfest 360 days a year on over 10 Acres! Prost! Welcome to Krush Brau Park. Here on our website, you'll find all the information you need to plan your next Krush Brau Park visit. Check out our Calendar of Events to find out what's happening all year long! We have many festivals, celebrations and truly unique things happening here! Calendar of Events Did you know? Portal Immersion Center (PIC) We are open 5 days a week. Monday- 4 pm to 2 am Thurs: 4 pm to Midnight Friday  4 pm to midnight Saturday  4 pm to midnight Sunday 4 pm to midnight Located at 2198 Four Winds Blvd. Kissimmee, Florida 34746 Find out more Upcoming Events Trop-Toberfest Featuring Mike Nash -Sept 7th - 2PM - $25🦜🍺 Parrotheads + Early Oktoberfest + German Beer Drinking Extravaganza = PURE FUN!   🎶 Live music 🍺 Cold German beer 🌴 Tropical vibes with a Bavarian twist  Come party with us — it’s Oktoberfest meets Margaritaville!  #KrushBrauPark #ParrotheadParty #OktoberfestVibes #GermanBeerLovers #BiergartenFun #KissimmeeEvents Tickets Get ready to ride for a reason! Join us for Rolltoberfest at Krush Brau Park on Saturday, September 27, 2025, as we team up with the American Cancer Society’s Making Strides Against Breast Cancer to drive hope forward! Bring your Jeep, car, bike—or just yourself—for a powerful day filled with vehicles, vendors, food, drinks, music, and a mission that matters. Proceeds go toward the fight against breast cancer. Let’s make strides—one ride at a time. Register now at: https://mondaycom.page.link/9EFgCYdiR7makzBj7 Tag a Jeep lover. Share the cause. Join the movement. Sign Up 🎉🍺 Get Ready for the Most Authentic Oktoberfest in Florida! 🍺🎉  Join us at Krush Brau Park for our Annual Oktoberfest Celebration — happening every weekend from September 27 through Nov. 2! ✨  📍 Location: 2198 Four Winds Blvd, Kissimmee, FL 📅 Fridays & Saturdays & Sundays| ⏰ Live Music, German Food, Beer, Games & More!  🎶 Authentic German bands 🍖 Bratwurst, pretzels, schnitzels & more 🍻 Imported German beer & local craft favorites 👗 Lederhosen & dirndls welcome (and encouraged!) 👨‍👩‍👧‍👦 Family-friendly fun during the day – adults-only party at night!  Whether you're looking to raise a stein with friends, dance to polka in our new Oktoberfest Tent, or enjoy a unique fall festival with your family — Krush Brau Park is the place to be this Oktoberfest season!  🕺 Don’t miss our stein-holding contests, keg rolls, costume prizes, and epic Krampus sightings 👹 (he’s always early…).  👉 Mark your calendars and PROST with us this Fall! 🎉🍺 Get Ready for the Most Authentic Oktoberfest in Florida! 🍺🎉  Join us at Krush Brau Park for our Annual Oktoberfest Celebration — happening every weekend from September 27 through Nov. 2! ✨  📍 Location: 2198 Four Winds Blvd, Kissimmee, FL 📅 Fridays & Saturdays & Sundays| ⏰ Live Music, German Food, Beer, Games & More!  🎶 Authentic German bands 🍖 Bratwurst, pretzels, schnitzels & more 🍻 Imported German beer & local craft favorites 👗 Lederhosen & dirndls welcome (and encouraged!) 👨‍👩‍👧‍👦 Family-friendly fun during the day – adults-only party at night!  Whether you're looking to raise a stein with friends, dance to polka in our new Oktoberfest Tent, or enjoy a unique fall festival with your family — Krush Brau Park is the place to be this Oktoberfest season!  🕺 Don’t miss our stein-holding contests, keg rolls, costume prizes, and epic Krampus sightings 👹 (he’s always early…).  👉 Mark your calendars and PROST with us this Fall! Tickets Come join us on Friday, October 17 to enjoy live music from the \"Good Bellows\" from 6 - 10 pm 🎉🍺 Get Ready for the Most Authentic Oktoberfest in Florida! 🍺🎉  Join us at Krush Brau Park for our Annual Oktoberfest Celebration — happening every weekend from September 27 through Nov. 2! ✨  📍 Location: 2198 Four Winds Blvd, Kissimmee, FL 📅 Fridays & Saturdays & Sundays| ⏰ Live Music, German Food, Beer, Games & More!  🎶 Authentic German bands 🍖 Bratwurst, pretzels, schnitzels & more 🍻 Imported German beer & local craft favorites 👗 Lederhosen & dirndls welcome (and encouraged!) 👨‍👩‍👧‍👦 Family-friendly fun during the day – adults-only party at night!  Whether you're looking to raise a stein with friends, dance to polka in our new Oktoberfest Tent, or enjoy a unique fall festival with your family — Krush Brau Park is the place to be this Oktoberfest season!  🕺 Don’t miss our stein-holding contests, keg rolls, costume prizes, and epic Krampus sightings 👹 (he’s always early…).  👉 Mark your calendars and PROST with us this Fall! Dwarfenators Saturday, July 19 | Starts at 6:00 PM | 2198 Four Winds Blvd, Kissimmee  Think you’ve sipped the best? Think again. 🍹  Join us for a night of bold flavors, and ice-cold fun.  🎤 What to Expect:  🍻 Chug Challenges & Beer Games: Test your skills, speed, and stomach – or just cheer on the brave souls who dare!  🎶 Live Music, DJs, and Drink Specials all night long  🍔 German Beer Garden Favorites to fuel your evening  🎁 Prizes, giveaways, and surprises throughout the night  🍸 Want to Compete? Come join the fun! Nov. 1, 2026 Buy Now Saturday, July 19 | Starts at 6:00 PM | 2198 Four Winds Blvd, Kissimmee  Think you’ve sipped the best? Think again. 🍹  Join us for a night of bold flavors, and ice-cold fun.  🎤 What to Expect:  🍻 Chug Challenges & Beer Games: Test your skills, speed, and stomach – or just cheer on the brave souls who dare!  🎶 Live Music, DJs, and Drink Specials all night long  🍔 German Beer Garden Favorites to fuel your evening  🎁 Prizes, giveaways, and surprises throughout the night  🍸 Want to Compete? Come join the fun! Saturday, July 19 | Starts at 6:00 PM | 2198 Four Winds Blvd, Kissimmee  Think you’ve sipped the best? Think again. 🍹  Join us for a night of bold flavors, and ice-cold fun.  🎤 What to Expect:  🍻 Chug Challenges & Beer Games: Test your skills, speed, and stomach – or just cheer on the brave souls who dare!  🎶 Live Music, DJs, and Drink Specials all night long  🍔 German Beer Garden Favorites to fuel your evening  🎁 Prizes, giveaways, and surprises throughout the night  🍸 Want to Compete? Come join the fun! 🎉 FAMILY FUN FEST – AUGUST 9 🎉 Join us at Krush Brau Park for one last summer hurrah before school kicks off! 📚☀️ 🛍️ Vendors 🍔 Food & Drinks 🎁 Giveaways 🐶 Pet-Friendly – Bring the whole family, including your dog! It’s the perfect day to shop, eat, play, and make memories with your crew. Don’t miss out on this end-of-summer celebration! 📍 Krush Brau Park 🕛 Noon to 6 PM Tag your friends and bring the whole fam! 💥 Join us for an unforgettable evening at our \"Best Dressed\" event, celebrating the rich cultural heritage of Germany! Dust off your dirndls and lederhosen as you prepare to step out in your finest traditional German attire. Whether you're channeling Bavarian charm or Prussian elegance, this is your chance to shine. Fabulous prizes await those who capture the spirit of Germany with authenticity and style, and winners will be crowned in a festive ceremony. Enjoy an evening filled with music, dance, and camaraderie, as we come together to honor and enjoy the vibrant traditions of Germany. Don’t miss out on this exciting opportunity to showcase your flair and creativity—see you there! HallowsFall Fest Prost to the New Year at Krush Brau! This is an adult 21+ Party This year. Free as always but please book tickets or reserve areas for groups larger than 10. Upgrade options available. Tickets / more info Dogtoberfest 2026 - We invite everyone including your owners to our 3rd annual KB Dogtoberfest! Dog Races, Dog Vendors, Dog Beer - Dog Everything! March Is your company or product a perfect match for one of our unique events? Join us as a sponsor or vendor and connect directly with your ideal customers! Our dynamic themed events provide the perfect opportunity to showcase your brand to an engaged and enthusiastic audience. Don’t miss the chance to make a memorable impact – partner with us today! LET'S PAWTY! Tickets Is your company or product a perfect match for one of our unique events? Join us as a sponsor or vendor and connect directly with your ideal customers! Our dynamic themed events provide the perfect opportunity to showcase your brand to an engaged and enthusiastic audience. Don’t miss the chance to make a memorable impact – partner with us today! Is your company or product a perfect match for one of our unique events? Join us as a sponsor or vendor and connect directly with your ideal customers! Our dynamic themed events provide the perfect opportunity to showcase your brand to an engaged and enthusiastic audience. Don’t miss the chance to make a memorable impact – partner with us today! Missed booking for 2024 we have so Many More Events in 2025! Book to become a Sponsor or Vendor Now! Current and Upcoming Events EXTREME DWARFANATORS WRESTLING - Lucha Live in Kissimmee, FL at Krush Brau Park - All Ages! – Krush Brau Park Saturday, Nov 1, 2025 7:00 PM - 9:00 PM 2025/2026 Ticketed and Free Events - Veterans Visit https://www.vettix.org/ to claim your tickets! Annual Passholders - please see newsletter for pricing and availability of events and tickets Tickets 2025/2026 Ticketed and Free Events - Veterans Visit https://www.vettix.org/ to claim your tickets! Annual Passholders - please see newsletter for pricing and availability of events and tickets 2025/2026 Ticketed and Free Events - Veterans Visit https://www.vettix.org/ to claim your tickets! Annual Passholders - please see newsletter for pricing and availability of events and tickets Events Calendar / Tickets Eventbrite KB Annual European Christmas Market - (Christkindlesmarkt) - Kissimmee Sunday, December 7 · 12 - 5pm Note: Previously Sold Out - We have added additional tickets and rooms for more vendors. This event is free to attend. Vendors please reach out to us. Tickets Starts Krampus Tag December 5th -                 1. Krampus Parade        2. Krampus Haunt         3. Krampus Ball             4. Krampus Games        5. Krampus themed food, cocktails, and vendors      6. Kakes with Krampus    7. Krampus Art Show! Tickets / more info Starting the Dec 7th - at 10am until 2pm (Sat/Sun) Come Enjoy weekend brunch with Santa's Austrian Brother - Krampus. He loves to eat with the kids - or eat kids - whatever, the whole family will enjoy this experience. For bad kids - Coal, thatches, and trips to the Lair of Krampus extra... Starting the Dec 7th - at 10am until 2pm (Sat/Sun) Come Enjoy weekend brunch with Santa's Austrian Brother - Krampus. He loves to eat with the kids - or eat kids - whatever, the whole family will enjoy this experience. For bad kids - Coal, thatches, and trips to the Lair of Krampus extra... Tickets Maybe you missed our Kakes with Krampus Brunch, Maybe you are still mad at Krampus for putting coal in your stocking, or you just want to have a few drinks with Santa's not so friendly brother - either way we have you covered. Starting the Dec 7th - at 10am until 2pm (Sat/Sun) Come Enjoy weekend brunch with Santa's Austrian Brother - Krampus. He loves to eat with the kids - or eat kids - whatever, the whole family will enjoy this experience. For bad kids - Coal, thatches, and trips to the Lair of Krampus extra... Indulge in a delicious Drinks inspired by Krampus Tickets Come join us for an evening of Krampus Art from around the US and World. Enjoy special food and drinks while you talk with the Artists. Krampus Nacht Dec 5th! Get tickets Now! Warning: This Art DID Not Make Santa's Good List! Tickets Dec 8th - Come Join Us fot the Annual Krampus Mystery Dinner! This will be a themed dinner with special Krampus Food and Drinks Tickets Krush Brau Park Attractions Portal Immersion Center (PIC) The Salty Pretzel - Food Trailer NOW OPEN The Portal Immersion Center (PIC) is where our immersive experiences are located. Check out our events calendar for upcoming events. PIC Hours of Operation: We are open 5 days a week. Monday- 4 pm to 2 am Thurs: 4 pm to Midnight Friday  4 pm to midnight Saturday  4 pm to midnight Sunday 4 pm to midnight PIC Address: 2198 Four Winds Blvd Kissimmee, Florida 34746 Find out more The Salty Pretzel - Food Trailer The Salty Pretzel - Food Trailer NOW OPEN The Salty Pretzel is our mobile food trailer that serves authentic German food. Hours of Operation: Check the Salty Pretzel Schedule for dates and locations of events Home Base Address: 2198 Four Winds Blvd Kissimmee, Florida 34746 Find out more World Event Center (WEC) Opening for Events September 7th! The WEC is our outdoor festival tent where we host various festivals throughout the year to include our annual Oktoberfest and Weihnachtsfest. WEC Hours of Operation: (Sat/Sun 12-10pm -when events are posted) WEC Address: 4580 W Irlo Bronson Memorial Hwy Kissimmee, Florida 34746 Find out more Biergarten & Brewery Biergarten & Brewery COMING SOON (Update: we are making progress and plan to open next Spring) The Biergarten, still under construction, is our authentic German restaurant and bar. With a wide selection of German and house brewed beers, and a unique German show, you are bound to leave with a full belly and a huge smile on your face! World Adventure Biergarten & Brewery World Adventure FUTURE ATTRACTION The World Adventure is our showcase of the world. Experience different cultures through art, entertainment, technology, and cuisine in this 5 acre park; featuring a kids play center, petting zoo, animatronic animals, and more! An adventure the whole family will enjoy! Our Reviews Subscribe Sign up to receive our newsletter about upcoming festivals, specials, sales, as well as our progress on our Biergarten, and World Adventure park! Email Sign up Contact Us Krush Brau Park Portal Immersion Center 2198 Four Winds Blvd, Kissimmee, FL 34746 We are open 5 days a week. Monday- 4 pm to 2 am Thurs: 4 pm to Midnight Friday  4 pm to midnight Saturday  4 pm to midnight Sunday 4 pm to midnight World Event Center (Temporarily Closed) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 Biergarten (Under Construction-Coming Soon) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 (855) 49KRUSH / (855)-495-7874 contact@krushbrau.com Drop us a line! Drop us a line! Name Email* This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Drop us a line! Copyright © 2023 Krush Brau Park - All Rights Reserved. Powered by Dogtoberfest Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Location Contact Us Privacy Policy Terms and Conditions beer/pilsner This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://krushbraupark.com/portal-immersion-center",
      "text": "Portal Immersion Center | Krush Brau Park Krush Brau Park is The Largest German Beer Garden in the US and Veteran Owned Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner More Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Signed in as: filler@godaddy.com Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Account Orders My Account Sign out Sign In Orders My Account Portal Immersion Center (PIC) The Portal Immersion Center is a multi use space where we host immersive dining and entertainment experiences, special events, and private events. When we are not hosting special events you may simply come and enjoy delicious German cuisine in a unique German themed space. If you are looking for a unique room to host your next event feel free to reach out. contact@krushbrau.com 1-855-49KRUSH (7874) Portal Immersion Center Address 2198 Four Winds Blvd., Kissimmee, Florida 34746 Portal Immersion Center Hours of Operation Oktoberfest: Fri-Sunday 6 pm-9pm live entertainment. We are open 4 days a week. Monday-Wednesday Closed Thursday 4 pm to 10 pm Friday  4 pm to midnight Saturday  noon until midnight Sunday noon to 10 pm European Brunch 12pm-3pm Sat/Sun PIC Events Snow White: Mystery Escape Dinner Snow White: Mystery Escape Dinner Snow White: Mystery Escape Dinner October 8th & 29th, 7pm-9pm The Great Krampus Ball Snow White: Mystery Escape Dinner Snow White: Mystery Escape Dinner December 30th Photo Gallery Krush Brau Park Portal Immersion Center 2198 Four Winds Blvd, Kissimmee, FL 34746 Oktoberfest: Fri-Sunday 6 pm-9pm live entertainment. We are open 4 days a week. Monday-Wednesday Closed Thursday 4 pm to 10 pm Friday  4 pm to midnight Saturday  noon until midnight Sunday noon to 10 pm European Brunch 12pm-3pm Sat/Sun World Event Center (Temporarily Closed) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 Biergarten (Under Construction-Coming Soon) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 (855) 49KRUSH / (855)-495-7874 Copyright © 2023 Krush Brau Park - All Rights Reserved. Powered by Dogtoberfest Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Location Contact Us Privacy Policy Terms and Conditions beer/pilsner This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://krushbraupark.com/oktoberfest",
      "text": "Oktoberfest | Krush Brau Park Krush Brau Park is The Largest German Beer Garden in the US and Veteran Owned Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner More Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Signed in as: filler@godaddy.com Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Account Orders My Account Sign out Sign In Orders My Account Countdown to Oktoberfest 2025! It's PARTY time!!! PROST! 0 0 Days Days 0 0 Hrs Hours 0 0 Mins Minutes 0 0 Secs Seconds Celebrate Oktoberfest at Krush Brau Park PROST! Get ready for an authentic Oktoberfest experience right here in Kissimmee, Florida, at Krush Brau Park! While the traditional Oktoberfest festivities are held in Munich, Germany, you don't have to travel across the Atlantic to immerse yourself in the rich traditions and Bavarian charm. Join us at Krush Brau Park and indulge in all the beer, food, music, and fun that make Oktoberfest a beloved global celebration. A Taste of Bavaria in the Heart of Florida At Krush Brau Park, we've recreated the spirit of Munich's Oktoberfest to bring you an unforgettable experience. Adorned with traditional Bavarian décor and vibrant Oktoberfest colors, sets the perfect backdrop for a memorable celebration. The aroma of freshly baked pretzels, bratwurst, and sauerkraut fills the air, transporting you straight to the heart of Bavaria. Oktoberfest  @PIC Photo Gallery More Information Oktoberfest Ticket Information General Admission - $0 General Admission - $0 General Admission - $0 General Admission ticket includes: One admission to Oktoberfest Live music and entertainment Authentic German food and beer for purchase Family and dog friendly atmosphere Patriot Package - $10 General Admission - $0 General Admission - $0 Patriot Package ticket includes: General Admission and One Beverage (choice of a non-alcoholic drink or 16 oz draft beer) and one Germ Pretzel *This package is available for Veterans, Active Duty Military, First Responders, and Teachers. Proper identification will be verified upon arrival.* Prost Package - $30 General Admission - $0 Cheers Package - $40 Prost Package ticket includes: General Admission and One Beverage (choice of 16 oz draft beer, house wine, cider, or well drink) and One Festival Entree Cheers Package - $40 Cheers Package - $40 Cheers Package - $40 Cheers Package ticket includes: General Admission and Prost Package and One commemorative Oktoberfest stein VIP Experience - $50 Cheers Package - $40 VIP Experience - $50 VIP Experience ticket includes: General Admission and Prost Package and Cheers Package and Additional beverage (2 total) and One Festival Dessert and Access to exclusive VIP seating area with table service and Oktoberfest Souvenir Logo Kids Ticket - Free Cheers Package - $40 VIP Experience - $50 Kids under 12 years of age are FREE with the purchase of an adult ticket. Group Packages Tickets (Free - $50 First Come First Serve) Tickets (Free - $50 First Come First Serve) Discounted group packages are available for groups of 20 persons or more. Please email us at contact@krushbraupark.com or call Jennifer at 1-855-495-7874 x 1 for more information. Tickets (Free - $50 First Come First Serve) Tickets (Free - $50 First Come First Serve) Tickets (Free - $50 First Come First Serve) Click Here for Tickets Oktoberfest Events and Weekly Specials Oktoberfest Kick Off Party Sept. 27th - 4pm-midnight Live Entertainment Fri-Sunday - Beer Games throughout all hours Oktoberfest Kick Off Party Sept. 27th - 4pm-midnight Happy Hour Weekdays -Thurs/Friday Live Entertainment Fri-Sunday - Beer Games throughout all hours Oktoberfest Kick Off Party Sept. 27th - 4pm-midnight Live Entertainment Fri-Sunday - Beer Games throughout all hours Live Entertainment Fri-Sunday - Beer Games throughout all hours Nightly Keg Tappings at 5pm! / Reach out if you have a German Band! Nightly Keg Tappings at 5pm! / Reach out if you have a German Band! Nightly Keg Tappings at 5pm! / Reach out if you have a German Band! Nightly Keg Tappings at 5pm! / Reach out if you have a German Band! Trachten Thursdays Nightly Keg Tappings at 5pm! / Reach out if you have a German Band! Trachten Thursdays Fest Haus Fridays Nightly Keg Tappings at 5pm! / Reach out if you have a German Band! Trachten Thursdays Keg tapping: Unleashing the liquid joy! A time-honored ritual where the keg's secrets are unlocked, releasing the golden nectar that brings friends together, sparking laughter and unforgettable memories. Herb explains what keg tapping is. Fine Print When purchasing tickets and General Admission is listed as sold out, please call us on the day you wish to visit to verify if tickets are available at the ticket counter on-site. Veterans / Active Duty - Please obtain your tickets via vettix.org Call us at 1-855-49KRUSH (1-855-495-7874) if you have questions Oktoberfest 2021-2022  @WEC Photo Gallery Live Music and Traditional Entertainment No Oktoberfest is complete without lively music and traditional entertainment. At Krush Brau Park, our stage comes alive with a mix of local bands and authentic German oompah bands, ensuring you dance and sing along to your heart's content. Take part in the traditional folk dances and games, and be prepared for spontaneous bursts of laughter and joy as the festivities unfold. Delicious German Cuisine Indulge your taste buds with a scrumptious array of German delicacies and comfort food. From mouthwatering schnitzels and savory bratwursts to delectable apple strudels, our Oktoberfest menu showcases the best of German cuisine. Don't forget to try the giant pretzels and pair your dishes with a variety of mustards and sauces, just like they do in the tents of Munich. Family-Friendly Fun At Krush Brau Park, Oktoberfest is a celebration for everyone, including families. We've curated a family-friendly atmosphere where children can enjoy their own dedicated play area, face painting, and engaging activities. Parents can relax and soak up the festivities, knowing their little ones are having a blast in a safe and enjoyable environment. Shop 'til You Drop Looking for unique souvenirs and Oktoberfest memorabilia? Our marketplace features a range of vendors selling traditional German clothing, beer steins, trinkets, and more. Take home a piece of Oktoberfest magic and cherish the memories for years to come. Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Krush Brau Park Portal Immersion Center 2198 Four Winds Blvd, Kissimmee, FL 34746 Oktoberfest Schedule: Fri-Sunday live entertainment. We are open 4 days a week. Monday-Wednesday Closed Thursday 4 pm to 10 pm Friday  4 pm to midnight Saturday  noon until midnight Sunday noon to 10 pm European Brunch 12pm-3pm Sat/Sun World Event Center (Temporarily Closed) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 Biergarten (Under Construction-Coming Soon) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 Copyright © 2023 Krush Brau Park - All Rights Reserved. Powered by Dogtoberfest Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Location Contact Us Privacy Policy Terms and Conditions beer/pilsner This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://krushbraupark.com/about",
      "text": "About Krush Brau Park is The Largest German Beer Garden in the US and Veteran Owned Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner More Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Signed in as: filler@godaddy.com Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Account Orders My Account Sign out Sign In Orders My Account About Us Veteran Owned Small Business Krush Brau Park is a Veteran Owned Small Business. Our founder, Waylon Krush, served in the US Army and was stationed at Bad Aibling, Germany for 3 years. Ever since, it has been a dream of his to build a German-inspired beer garden to share with the American people. We welcome and give discounts to all our veterans and first responders. German influenced with American flair! Built on the abandoned 'Jungleland Zoo', we have revitalized this land to be a fun-filled experience for the whole family with food, beverages, live music and more! Read more about the history of the property below. Giving Back Knowing the history of the property, Krush Brau Park is all about giving back to the community and supporting animal charities. Please contact us if your organization would like to be included in our giving family. “We can do no great things, only small things with great love.” – Mother Teresa History of the Property Back in the late 1970s, Alligatorland Safari Zoo opened and featured over 1600 exotic animals and birds. Proving that competition was tough, in 1982, Gatorland Zoo filed suit against Alligatorland for attempting to build a strikingly similar entryway to theirs that resembled a gator’s open jaws, which Gatorland had since the 1960s. In 1990, Alligatorland Safari Zoo came under attack after they received a surprise inspection from the USDA and were charged with keeping inaccurate records, having poor sanitation and structural conditions in some of the cages, and having poor veterinary care for its animals. Darren Browning, the owner of Alligatorland, refused to acknowledge the USDA’s right to regulate his business, claiming the violations never existed or were quickly corrected and refused to pay a $1,500 fine. He characterized the fine as nothing more than a ploy by the USDA to punish them for refusing to erect a $20,000, 8-foot tall security fence to keep the wild animals from escaping. Browning chose to fight the fine at a two-day USDA hearing in November 1992, representing himself because he said he knows as much about exotic animal care as USDA inspectors, and it would have cost too much to hire an attorney. After losing consequent battles in court against the USDA, the Browning’s sold the property in 1995. Jungleland Zoo opened in 1995 and housed over 300 exotic animals, a large drop from Alligatorland which featured 1600 animals. The zoo was best known for its big cat shows which showcased different species of cats, from bobcats and lynxes to Bengal and Siberian tigers. During the winter of 1997, days of rainfall flooded the swamp, making it a dangerous situation for the caged animals. On December 15, while handlers tried to raise the cage of their 450-pound lioness above flooded ground, it escaped into the marsh. A search for Nala, named after a character from “The Lion King”, was quickly initiated, ranging over the swamp along Hwy 192. Though wildlife agents were equipped with an infrared sensor attached to a helicopter and over 20 agents on the ground with tranquilizer guns and rifles, a canopy of lush vegetation and 4-foot-deep water, made it difficult to track her. Residents and tourists were put on alert, but Jungleland officials claimed that lioness was “hand-raised, declawed and very sociable”. Finally, after two days, Nala was spotted just a few hundred yards from her cage at the zoo. Dr. James Barnett, a veterinarian, moved in but upon being spotted, Nala hissed and tried to hide under some bushes. Dr. Barnett fired two tranquilizer shots, missing with the first shot but finding its mark on the second. It took five minutes for Nala to become sedated, where Dr. Barnett injected her with more tranquilizer. In late-2002, Jungleland Zoo removed its animals from public view and had set all their gift shop stock at 50% off. The owners claimed they were another victim to the post-9/11 economy, but the local Channel 6 News reported the zoo was being investigated by the Florida Fish and Wildlife Conservation Commission and the U.S. Department of Agriculture for possible violations of the Animal Welfare Act. A surprise inspection in June by state inspectors said the “facility is suffering from a severe drainage issue,” noting rotted cages and inadequate fence heights. The inspectors also reported that “the animals looked healthy.” The property was purchased by Patrick Clancy, founder, and owner of Jungle Habitat Preserve, an exotic animal sanctuary that cares for unwanted animals due to lack of funds or other reasons. Unfortunately, further money was needed to repair and modernize the property. The property was foreclosed in 2017 and later sold again at the end of 2018 to Jungleland Zoo Partners, LLC. In September 2020, Krush Acquisitions, a veteran owned company by Waylon and Katie Krush, purchased the property and will be revitalizing the former Jungleland Zoo to be a vibrant German-inspired biergarten (beer garden) and park. It will include a brewery, eateries, live music and attractions for families and kids alike with an outdoor theater, playgrounds, and a petting zoo. Waylon Krush, a veteran of the US Army, was stationed at Bad Aibling, Germany for 3 years. He traveled throughout all of Germany during his service and fell in love with the different beers, bakery goods, and festivals each state had to offer, especially attending Oktoberfest 3 years in a row. Ever since, it has been a dream of his to build a German-inspired beer garden to share with the American people. Krush Brau Park will have a beautiful 9,000+ square foot main building along with several container buildings to support food, beverage and entertainment. The facility and garden will be broken up to feature different countries around the world  to highlight its cuisine, beers, and more. -- Source: https://www.abandonedfl.com/jungleland-zoo/ Copyright © 2023 Krush Brau Park - All Rights Reserved. Powered by Dogtoberfest Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Location Contact Us Privacy Policy Terms and Conditions beer/pilsner This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.centralfloridalifestyle.com/event-location/krush-brau-park-portal-immersion-center/",
      "text": "Krush Brau Park – Portal Immersion Center – Central Florida Lifestyle Select a Region: - Central Florida - Altamonte Springs Brevard County College Park DeSoto County Flagler County Horizon West Hardee County Hernando County Highlands County Hillsborough County Lake County Lake Nona Metro West Manatee County Osceola Oakland Park Pasco County Polk County Pinellas County Sarasota County Sumter County Seminole County Windermere Winter Garden Winter Park Distro Locations Contribute Subscribe instagram facebook linkedin twitter youtube 2025 Cutest Pet Contest Teacher Shoutout Best of Hotels Contest Digital Edition CFL Lifestyle Lifestyle Local Beauty Education Shopping DIY Community Conversations Entertainment This or That Movies Music Sports Travel Food & Drink Foodie Recipes Health Fitness & Wellness Medical News Events About Us News Corner Search Search for: Search Select a Region: - Central Florida - Altamonte Springs Brevard County College Park DeSoto County Flagler County Horizon West Hardee County Hernando County Highlands County Hillsborough County Lake County Lake Nona Metro West Manatee County Osceola Oakland Park Pasco County Polk County Pinellas County Sarasota County Sumter County Seminole County Windermere Winter Garden Winter Park Menu Distro Locations Contribute Subscribe Follow us instagram facebook linkedin twitter youtube Search Search for: Search Events at this location Krush Brau Park - Portal Immersion Center 2198 4 Winds Boulevard Kissimmee, FL 34746 United States Events at this location Current Month september Rolltoberfest with Krush Brau Park Krush Brau Park - Portal Immersion Center 2198 4 Winds Boulevard Kissimmee, FL 34746 United States 27 sep All Day Rolltoberfest with Krush Brau Park Event Details Get ready to ride for a Event Details Get ready to ride for a reason! Join us for Rolltoberfest at Krush Brau Park on Saturday, September 27, 2025, as we team up with the American Cancer Society’s Making Strides Against Breast Cancer to drive hope forward! Bring your Jeep, car, bike—or just yourself—for a powerful day filled with vehicles, vendors, food, drinks, music, and a mission that matters. Proceeds go toward the fight against breast cancer. Let’s make strides—one ride at a time. Register now. Time All Day (Saturday) Location Krush Brau Park - Portal Immersion Center 2198 4 Winds Boulevard Kissimmee, FL 34746 United States Calendar GoogleCal Recent Comments HECTOR SALCEDO on Melrose in the Mix: Marc With a C ROSE FRAWLEY on Enzian And Annie Russell Theatre Present Season of National Theatre Live Productions Amber on Celebration, Florida’s World Famous Now Snowing Event Celebrates 19 years of Snow Bill Heneghan on Spring Training With Scott Horns Mike Ruedisueli on Spring Training With Scott Horns instagram facebook linkedin twitter youtube Newsletter Don’t miss out on new posts Enter your email to subscribe to our newsletter. Email address: Leave this field empty if you're human: Don't worry, we don't spam.Enter your email to subscribe to our newsletter. About Us Lifestyles CFL, LLC is a diversiﬁed multimedia company committed to delivering innovative experiences across all media platforms. At the heart of its portfolio is Central Florida Lifestyle® publications. Lifestyles CFL has served Central Florida for over 20 years. Lifestyles CFL, LLC is a Service-Disabled Veteran-Owned Small Business. Learn more about us . Contact Us Email: contact@lifestylescfl.com Phone: (407) 449-2022 Still interested in our physical magazine? Click here to let us know, yes or no. © 2025 Lifestyles CFL, LLC. All rights reserved. Home Advertise With Us Privacy Policy Back to Top Close 2025 Cutest Pet Contest Teacher Shoutout Best of Hotels Contest Digital Edition CFL Lifestyle Lifestyle Local Beauty Education Shopping DIY Community Conversations Entertainment This or That Movies Music Sports Travel Food & Drink Foodie Recipes Health Fitness & Wellness Medical News Events About Us News Corner Distro Locations Contribute Subscribe instagram facebook linkedin twitter youtube Search for: Search Log In Sign In Username or Email Address Password Forgot password? Forgot password? Enter your account data and we will send you a link to reset your password. Username or Email Address Back to Login Your password reset link appears to be invalid or expired. Log in Privacy Policy To use social login you have to agree with the storage and handling of your data by this website. %privacy_policy% Accept Close Add to Collection Add new or search Public collection title Private collection title No Collections Here you'll find all collections you've created before. X Newsletter Want more stuff like this? Get the best local stories straight into your inbox! Enter your email to subscribe to our newsletter. Email address: Leave this field empty if you're human: Don't worry, we don't spam.Enter your email to subscribe to our newsletter. Close"
    },
    {
      "url": "https://www.orlandosentinel.com/2022/10/02/krush-brau-park-in-kissimmee-brings-lively-oktoberfest-aims-for-future-as-mini-epcot/",
      "text": "Krush Brau Park in Kissimmee brings lively Oktoberfest, aims for future as ‘mini Epcot’ – Orlando Sentinel Skip to content All Sections Subscribe Now 81°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Home Page Daily e-Edition Evening e-Edition News News Latest Headlines Politics Education National News Local News Local News Lake County Orange County Osceola County Seminole County Health Health Medicare Sports Sports High School Sports UCF Knights Orlando Magic Mike Bianchi Commentary Florida Gators Business Business Tourism Economy Real Estate GrowthSpotter Consumer Reviews Weather Weather Conditions and Forecasts Hurricanes Hurricane preparedness Hurricane Tracks Opinion Opinion Letters to the Editor Scott Maxwell Commentary Editorials Endorsements Entertainment Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Events Travel Travel Theme Parks Epic Universe Explore Florida Cruises Florida & Caribbean Experiences Obituaries Obituaries News Obituaries Place an Obituary Branded Content Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classifieds Services About the Orlando Sentinel Manage Subscription Subscriber Benefits Sign up for Newsletters Buy an advertisement Sign up for email newsletters Sign Up Krush Brau Park in Kissimmee brings lively… Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Subscribe Login Account Settings Contact Us Log Out Spoof a user Sign up for email newsletters Sign Up Subscribe Login Search 81°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Hurricanes News Sports Business Opinion Entertainment Restaurants, Food & Drink Weather Puzzles Obituaries Trending: ☹️ Ticked off! 🚀 Launch schedule 🔍 Restaurant Inspections 🏠 Homeless Camping Ban 💻 Donate to Sentinel News Fund ❓🧔🏾‍♂️❓Read Asking Eric Breaking News Charlie Kirk’s killer blended in on Utah university campus, and a high-powered rifle is recovered Things To Do Travel Krush Brau Park in Kissimmee brings lively Oktoberfest, aims for future as ‘mini Epcot’ Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Patrick Connolly/Orlando Sentinel German-themed entertainment takes the stage during Oktoberfest at Krush Brau Park in Kissimmee on Friday, Sept. 23, 2022. Patrick Connolly/Orlando Sentinel Waylon Krush, owner of Krush Brau Park, shows off a plate of German-inspired cuisine in Kissimmee on Sept. 23, 2022. Patrick Connolly/Orlando Sentinel \"Disco fries\" include bratwurst pieces and a cheese sauce at Krush Brau Park in Kissimmee on Sept. 23, 2022. Patrick Connolly/Orlando Sentinel Stein hoisting is part of the festivities at Krush Brau Park in Kissimmee on Sept. 23, 2022. Patrick Connolly/Orlando Sentinel German-themed entertainment gets guests dancing at Krush Brau Park in Kissimmee on Sept. 23, 2022. Show Caption Patrick Connolly/Orlando Sentinel 1 of 5 German-themed entertainment takes the stage during Oktoberfest at Krush Brau Park in Kissimmee on Friday, Sept. 23, 2022. Expand By Patrick Connolly | pconnolly@orlandosentinel.com | Orlando Sentinel UPDATED: October 2, 2022 at 9:30 AM EDT The sounds of accordion music and yodeling waft through the air along U.S. 192, drawing visitors into an experience that transports them to Munich, Germany , all without ever leaving Kissimmee. Oktoberfest is in full swing all month at Krush Brau Park, a new attraction that aims to highlight German cuisine and culture. The experience was dreamed up by Waylon Krush, a Washington, D.C., transplant who was inspired by a deployment overseas in the U.S. Army. “I was stationed right outside Munich, Germany, and I went to Oktoberfest three years in a row,” he said. “It was the most amazing thing I’ve ever felt. I had to replicate that here.” Waylon Krush, owner of Krush Brau Park, shows off a plate of German-inspired cuisine in Kissimmee on Sept. 23, 2022. Krush’s biergarten is set under a tent with imported brews, German cuisine, stein hoisting, lederhosen, shot skis and plenty of entertainment. The venue is what formerly served as home to the Jungleland Zoo, a gem found by Krush’s real estate agent, who advertised it as a real garden — and a fairly overgrown one at that. But the German-inspired experience is just the start and the jumping-off point for what Krush hopes will become a larger cultural experience. In phases, Krush Brau Park is slated to take shape as a cross between Epcot and Boxi Park Lake Nona . The plan is for the attraction to have 13 distinct countries with shops, eateries and structures made  from shipping containers. Stein hoisting is part of the festivities at Krush Brau Park in Kissimmee on Sept. 23, 2022. “Our mission is to create a place where families can come and have a theme park that doesn’t cost a lot of money,” Krush said. “I love Disney, but not everyone can afford it.” Renderings and plans for developing the 10 acres include the Taj Mahal, French and Italian spaces and scenes from China, Japan and Korea. In the Brazilian area, Krush hopes to build a “Christ the Redeemer” statue out of containers. When this future phase comes to fruition, guests can also visit Canada and indulge in a poutine bar. In paying homage to the former zoo, Krush Brau Park will have animatronic animals. In the meantime, the park’s phase one will host patrons in the Oktoberfest tent, a space that will transform to entertain guests during the 2022 FIFA World Cup and events such as the Christmastime Weihnachten and “Silvester Fest” for New Year’s. “Disco fries” include bratwurst pieces and a cheese sauce at Krush Brau Park in Kissimmee on Sept. 23, 2022. While crafting his new attraction, Krush brought in seasoned chefs and entertainment professionals from far and wide to support the guest experience. Michael Gogolin, the park’s executive chef, moved from the Atlanta area and spent time researching German cuisine before his arrival. Now the park features creative dishes such as “disco fries” — featuring cheese sauce and pieces of bratwurst — and doner kebab. “Everybody eats meat and potatoes, it’s just how they’re prepared. What do they use and why?,” he said. “I like to spin it. I’m not a traditionalist, classic chef.” German-themed entertainment takes the stage during Oktoberfest at Krush Brau Park in Kissimmee on Friday, Sept. 23, 2022. While Krush and his team have big ambitions for the future attraction, for now, he’s focusing on throwing the best, most authentic Oktoberfest he can. “People get together, you put a tent up. We’ve got good beer, good food, good service and entertainment, and that’s it,” Krush said. If you go Krush Brau Park is open 4-11 pm Thursday-Friday, noon-11 p.m. Saturday and noon-8 p.m. Sunday through Oct. 30 at 4580 W. Irlo Bronson Memorial Highway in Kissimmee. General admission is $5 per person; children ages 12 and younger enter for free. Veterans can receive free tickets. For more information, visit krushbraupark.com . Find me @PConnPie on Twitter and Instagram or send me an email: pconnolly@orlandosentinel.com . For more fun things, follow @fun.things.orlando on Instagram , Facebook and Twitter . Originally Published: October 2, 2022 at 5:30 AM EDT Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X RevContent Feed Most Popular Most Popular Orange schools to reassign over 100 school teachers amid enrollment drops Orange schools to reassign over 100 school teachers amid enrollment drops 7 Central Florida restaurants shut down last week 7 Central Florida restaurants shut down last week DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida Florida’s ban on open carry of guns is unconstitutional, appeals court rules Florida’s ban on open carry of guns is unconstitutional, appeals court rules Conservative activist Charlie Kirk assassinated at Utah university Conservative activist Charlie Kirk assassinated at Utah university UCF offensive line coach Shawn Clark hospitalized for medical emergency UCF offensive line coach Shawn Clark hospitalized for medical emergency Orange judge reprimanded by Florida Supreme Court over rude comments Orange judge reprimanded by Florida Supreme Court over rude comments TV, kickoff time set for UCF’s home game vs. Bill Belichick and North Carolina TV, kickoff time set for UCF’s home game vs. Bill Belichick and North Carolina Bianchi: Why losing its biggest investor could be the best thing for Orlando’s baseball dream Bianchi: Why losing its biggest investor could be the best thing for Orlando's baseball dream Orlando mourns Tom Moench, 64, founder of Orange Blossom Brewing Orlando mourns Tom Moench, 64, founder of Orange Blossom Brewing More in Travel Royal Caribbean’s next 2 Icon-class ships hit construction milestones Orlando theme parks: What’s closed and what’s coming Run away with the new issue of ‘Explore Florida & the Caribbean’ Spring Hammock Preserve unveils new ADA-accessible trail, Lake Jesup boardwalk 2022 October 2 Tribune Publishing Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News South Florida Sun-Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company Info Archives Contact Us at the Orlando Sentinel Community News Fund Careers Manage Account Newsletters Daily e-Edition Evening Edition Help Advertise with Us Place an Ad Auto Listings Find a Job About the Orlando Sentinel Photo requests, reprints Send us a News Tip Subscriber Services & Help Site Map Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Policy Cookie Preferences CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Orlando Sentinel Close"
    },
    {
      "url": "https://krushbraupark.com/faq",
      "text": "FAQ Krush Brau Park is The Largest German Beer Garden in the US and Veteran Owned Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner More Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Signed in as: filler@godaddy.com Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Account Orders My Account Sign out Sign In Orders My Account Frequently Asked Questions (FAQs) Please reach us at contact@krushbrau.com if you can't find an answer to your question. When will the biergarten be open? We are currently working on the biergarten now. Fingers crossed, we will be up and running by the end of this Year. How do I find information on events? We will continually update our website and Facebook page as we schedule new events. Are pets/dogs allowed? Yes. We are a dog friendly establishment in all of our outdoor areas. We ask that you to please pick up after your pet and ensure they are on a leash at all times. Will the biergarten have live entertainment? Yes. We hire authentic German musicians, dancers, and artists. Do you have special discounts and tickets for Veterans? Yes. Veterans will receive a 10% discount in our gift shop, as well as a 20% discount on food. Simply show us your ID. Discounted tickets will be available for special events through Vet Tix . What is available in the gift shop? We have German gifts, Krush Brau Park memorabilia, and children's plushies. I see children are allowed - what things are available for them? We are truly a family establishment. Our live entertainment shows in the biergarten and event center are interactive and include fun songs and dances for the children, like the chicken dance. We also provide activity books for all children as they arrive at the biergarten. And our event center has several activities for children including oversized outdoor games. Will you have a Stein Club? Yes - we are currently developing our Stein Club. We will provide additional information about the club and benefits as we get closer to our biergarten grand opening. Do you cater, host special occasions, and provide private events? Yes - please check out our events tab for contact@krushbrau.com with what you need and our sales team will contact you shortly. For all catering needs please visit www.krushcaters.com My question is not listed or wasn't answered. What do I do? Please email us at contact@krushbrau.com if you can't find an answer to your question. Krush Brau Park Portal Immersion Center 2198 Four Winds Blvd, Kissimmee, FL 34746 We are open 4 days a week. Monday-Wednesday Closed Thursday 4 pm to 10 pm Friday  4 pm to midnight Saturday  noon until midnight Sunday noon to 10 pm European Brunch 12pm-3pm Sat/Sun World Event Center (Temporarily Closed) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 Biergarten (Under Construction-Coming Soon) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 (855) 49KRUSH / (855)-495-7874 Copyright © 2023 Krush Brau Park - All Rights Reserved. Powered by Dogtoberfest Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Location Contact Us Privacy Policy Terms and Conditions beer/pilsner This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://krushbraupark.com/location",
      "text": "Location Krush Brau Park is The Largest German Beer Garden in the US and Veteran Owned Sign In Create Account Orders My Account Signed in as: filler@godaddy.com Orders My Account Sign out Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner More Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Signed in as: filler@godaddy.com Home Happening Now Dogtoberfest Hansel and Gretel Eggtoberfest Eggsploration Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Tickets Location Menu PIC Menu The Salty Pretzel Menu WEC Food Menu WEC Drink Menu Attractions Portal Immersion Center The Salty Pretzel World Event Center Biergarten World Adventure Events Public Events Calendar Host An Event Event Sponsors Become a Vendor CATERING Shop About About Blog and Press Gallery FAQ Careers Contact Us German Braus and Cocktail beer/pilsner Account Orders My Account Sign out Sign In Orders My Account Krush Brau Park Location Location Addresses: Portal Immersion Center (Now Open) 2198 Four Winds Blvd., Kissimmee, FL 34746 World Event Center & Biergarten (Coming Soon) 4580 W Irlo Bronson Memorial Hwy., Kissimmee, FL 34746 Additional Parking for Portal Immersion Center 4580 W Irlo Bronson Memorial Hwy., Kissimmee, FL 34746 Contact Us Drop us a line! Name Email* Send This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Krush Brau Park Portal Immersion Center 2198 Four Winds Blvd, Kissimmee, FL 34746 PIC Hours of Operation: We are open 5 days a week. Monday- 4 pm to 2 am Thurs: 4 pm to Midnight Friday  4 pm to midnight Saturday  4 pm to midnight Sunday 4 pm to midnight World Event Center (Temporarily Closed) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 Biergarten (Under Construction-Coming Soon) 4580 W Irlo Bronson Mem Hwy., Kissimmee, FL 34746 (855) 49KRUSH / (855)-495-7874 Copyright © 2023 Krush Brau Park - All Rights Reserved. Powered by Dogtoberfest Summertoberfest KrampusCon KrampusCon Oktoberfest All Hallows Fest Location Contact Us Privacy Policy Terms and Conditions beer/pilsner This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://summertoberfest.com/",
      "text": "Summertoberfest Summertoberfest at Krush Brau Park Summertoberfest\nat Krush Brau Park Summertoberfest\nat Krush Brau Park Summertoberfest\nat Krush Brau Park Home Contests Keg Tapping German Costume Contest Wurst Eating Contest Grape Stomping Contest Bier Games Yodeling Contest Private Events Dogtoberfest Krush Brau Park More Home Contests Keg Tapping German Costume Contest Wurst Eating Contest Grape Stomping Contest Bier Games Yodeling Contest Private Events Dogtoberfest Krush Brau Park Sign In Create Account My Account Signed in as: filler@godaddy.com My Account Sign out Summertoberfest at Krush Brau Park Summertoberfest\nat Krush Brau Park Summertoberfest\nat Krush Brau Park Summertoberfest\nat Krush Brau Park Signed in as: filler@godaddy.com Home Contests Keg Tapping German Costume Contest Wurst Eating Contest Grape Stomping Contest Bier Games Yodeling Contest Private Events Dogtoberfest Krush Brau Park Account My Account Sign out Sign In My Account 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight Enjoy Summertoberfest at Krush Brau Park Portal Immersion Center and World Entertainment Center 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight 2025 Dates\nJune 7 - Aug 30\nFriday and Saturdays\n4pm-midnight Enjoy Summertoberfest at Krush Brau Park Portal Immersion Center and World Entertainment Center Summertoberfest 2025 Info When and Where June 7 - Aug 30, 2025 Open Hours 4pm to 10pm Special Events: Friday and Saturdays Friday and Saturday - open until midnight! Krush Brau Park Portal Immersion Center 2198 Four Winds Blvd, Kissimmee, FL 34746 Krush Brau Park World Entertainment Center 4580 W Irlo Bronson Mem Parkway, Kissimmee, FL 34746 Admission Fee: Free Additional registration fee applies for special concert series,  workshops and contests Keg Tapping Ceremony at 5pm Contests and Workshops Each Saturday we feature a contest or workshop. See details below. Summertoberfest Contests and Workshops 2025 dates Keg Tapping Ceremony Every Saturday at 5pm Keg Tapping Ceremony Every Saturday at 5pm Keg Tapping Ceremony Every Saturday at 5pm Free to attend Learn more German Costume Contest Keg Tapping Ceremony Every Saturday at 5pm Keg Tapping Ceremony Every Saturday at 5pm Registration Fee: Free Learn more Beer Art Painting Workshop Keg Tapping Ceremony Every Saturday at 5pm Beer Art Painting Workshop Registration Fee: TBD Learn more Wurst Eating Contest Keg Tapping Ceremony Every Saturday at 5pm Beer Art Painting Workshop Registration Fee: Free Learn more \"Grape\" Stomping Contest Register Now for Contests and Workshops! \"Grape\" Stomping Contest Registration Fee: Free Learn more Krush Brau Bier Games Register Now for Contests and Workshops! \"Grape\" Stomping Contest Registration Fee: Free Learn more Yodeling Contest Register Now for Contests and Workshops! Register Now for Contests and Workshops! Registration Fee: Free Learn more Register Now for Contests and Workshops! Register Now for Contests and Workshops! Register Now for Contests and Workshops! Free but Spaces are limited, sign up now! REGISTER NOW About Summertoberfest Embrace Authentic German Culture Embrace Authentic German Culture Embrace Authentic German Culture At Krush Brau Summertoberfest, we strive to recreate the authentic atmosphere of a traditional Oktoberfest celebration. Immerse yourself in German culture as you explore the vibrant decorations, Bavarian flags, and cheerful staff dressed in traditional attire. From the moment you step through the doors, you'll be transported to the heart of Munich's Oktoberfest, right here in Central Florida - right off 192 close to Disney World! Join us for Happy Hour every Saturday from 12pm-3pm! Raise Your Stein to Live Music Embrace Authentic German Culture Embrace Authentic German Culture Get ready to tap your feet and dance to the lively beats of authentic German music! Our Summertoberfest event will showcase talented musicians who will keep the energy high and the party going all day long. Grab your friends, hit the dance floor, and join in the traditional dances like the Chicken Dance and the Polka. It's a fantastic opportunity to let loose, make unforgettable memories, and experience the joy of Oktoberfest right in the heart of Florida. We will also have the traditional stein holding contests with the winner going to an all expenses paid trip to New York for the world championship. Savor Delightful German Cuisine Embrace Authentic German Culture Savor Delightful German Cuisine No Oktoberfest is complete without indulging in the mouth watering flavors of German cuisine. Krush Brau Summertoberfest will feature a range of delicious traditional dishes that will make your taste buds dance with joy. From hearty bratwursts and pretzels to delectable schnitzels and sauerkraut, there's something to satisfy every craving. Don't forget to pair your food with a Krush Brau stein of our exceptional German beers for the perfect combination! Bring or buy a Krush Brau Stein and enjoy $10 refills all day. Contact Us Don't Just Read About Us, Come Visit Us! Get on down to enjoy German Beer, Food, and Live Music this summer! Summertoberfest brought to you by Krush Brau Park Call us at: 1-855-49KRUSH Email us at: contact@krushbrau.com Summertoberfest Location 2198 Four Winds Boulevard, Kissimmee, Florida 34746, United States Summertoberfest Hours of Operation June 7  to Aug 30, 2025 7 days a week: 4PM-10PM 4PM-12AM Friday and Saturday European Brunch 10am-2pm Sat/Sun Drop us a line! Drop us a line! Name Email* Sign up for our email list for updates, promotions, and more. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Send Cancel Drop us a line! Get directions Copyright © 2024 Summertoberfest - All Rights Reserved. Powered by Krush Brau Park This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}