{
  "fuentes": [
    {
      "url": "https://shop.kush.com/contact/",
      "email": "info@kush.com"
    },
    {
      "url": "https://kushhospitality.com/locations/stephens/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/team/",
      "email": "cristina@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/team/",
      "email": "jen@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/team/",
      "email": "matt@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/team/",
      "email": "tracey@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/team/",
      "email": "zuni@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://kushhospitality.com/locations/kush-wynwood/team/",
      "email": "chris@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/kush-wynwood/team/",
      "email": "dre@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/kush-wynwood/team/",
      "email": "myles@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/kush-wynwood/team/",
      "email": "zuni@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/kush-wynwood/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://kushhospitality.com/about/team/",
      "email": "cristin@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/about/team/",
      "email": "cristy@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/about/team/",
      "email": "matt@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/about/team/",
      "email": "myles@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/about/team/",
      "email": "tina@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/about/team/",
      "email": "zuni@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/tobacco-road/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://kushhospitality.com/events/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://kushhospitality.com/menus/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://www.linkedin.com/posts/emerson-lima-luxury-real-estate-45061632_st-regis-miami-brickell-new-construction-activity-6958020228538585088-OCSs",
      "email": "emersonlima@cervera.com"
    },
    {
      "url": "https://kushhospitality.com/locations/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://hotspotsmagazine.com/2024/05/31/kush-drag-queen-trivia-saturdays/",
      "email": "info@hotspots.lgbt"
    },
    {
      "url": "https://kushhospitality.com/shop/policies/",
      "email": "info@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/tobacco-road/press/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://brickellpsychology.com/contact/",
      "email": "info@brickellpsychology.comcontact"
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/",
      "email": "kush@brustmancarrinopr.com"
    },
    {
      "url": "https://www.brickellbuickgmc.com/contact.htm",
      "email": "brickellbuickgmc@eleadtrack.net"
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/team/",
      "email": "amanda@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/team/",
      "email": "dave@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/team/",
      "email": "erika@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/team/",
      "email": "spider@kushhospitality.com"
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/team/",
      "email": "zuni@kushhospitality.com"
    }
  ],
  "mails": [
    "amanda@kushhospitality.com",
    "brickellbuickgmc@eleadtrack.net",
    "chris@kushhospitality.com",
    "cristin@kushhospitality.com",
    "cristina@kushhospitality.com",
    "cristy@kushhospitality.com",
    "dave@kushhospitality.com",
    "dre@kushhospitality.com",
    "emersonlima@cervera.com",
    "erika@kushhospitality.com",
    "info@brickellpsychology.comcontact",
    "info@hotspots.lgbt",
    "info@kush.com",
    "info@kushhospitality.com",
    "jen@kushhospitality.com",
    "kush@brustmancarrinopr.com",
    "matt@kushhospitality.com",
    "myles@kushhospitality.com",
    "spider@kushhospitality.com",
    "tina@kushhospitality.com",
    "tracey@kushhospitality.com",
    "zuni@kushhospitality.com"
  ],
  "nombre_sitio": "kushhospitality.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://shop.kush.com/contact/",
      "text": "Contact Us – Get In Touch With Customer Support | Kush.com Skip to content New Kush.com Gummies – Try them today ! Shop Close Shop Open Shop Best Sellers Shop All by Occasion Sleep Better Mood Relaxation Euphoria by Product Beverages Gummies By Brand Kush.com Coral Reefer 3Chi Beboe Cool Out Dayzed Enzone hmu OFFGRID9 Señorita Subculture Tempter’s Zagga Zoltann All Brands Search products, brands... × Learn Log In $ 0.00 0 Cart $ 0.00 0 Cart Search products, brands... × Contact Us – Get In Touch With Customer Support Contact us Don’t hesitate to contact us if you need help. We are here to help you find the products you'll love. Please feel free to reach out and ask any questions. [contact-form-7 id=\"6367\"] ALL THE FUN. NO WORRY. Join Kush.com and find out about our great deals on great products. create an account today Need any help? Contact Us 844-420-KUSH Chat With Us FOLLOW US Join our newsletter Get all the latest news and first access to offers right to your inbox. Email receive discounts 802 E Whiting St,\nTampa, FL 33602\nUnited States About FAQ My Account Learn Shipping Privacy Policy Terms of Service WARNING: These statements have not been evaluated by the Food and Drug Administration (FDA). The products listed on this website contain cannabidiol(CBD). These products should be kept out of reach of children and animals. If you are pregnant, nursing, taking medications, or have a medical condition, consult with your physician before using these products. Representations regarding the efficacy and safety of CBD have not been evaluated by the FDA. These products are not intended to diagnose, prevent, treat, or cure any disease. These products may contain less than 0.3% THC by dry weight. ©2024 Kush.com | KDC LLC | All rights reserved. Shopping cart 0 There are no products in the cart! Continue shopping Best Sellers By Occasion Sleep Better Mood Relaxation Euphoria By Product Beverages Gummies By Brand Kush.com Coral Reefer 3Chi Beboe Cool Out Dayzed Enzone HMU OFFGRID9 Señorita Subculture Tempter’s Zagga Zoltann All Brands Shop All"
    },
    {
      "url": "https://kushhospitality.com/locations/stephens/",
      "text": "Kush By Stephen's Hialeah Restaurant | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards Order Online Read The Kush Times Read The Kush Times Read The Kush Times the oldest operating deli in miami-dade open since 1954 the oldest operating deli in miami-dade open since 1954 Kush Hialeah Matt Kuscher and the team behind LoKal, Kush by LoKal, Kush by Spillover, and Vicky’s House establish a new home in Hialeah by combining the oldest Deli in Florida and the first cocktail bar in Hialeah. Kush by Stephens formerly known as Stephen's Delicatessen dishes out classic deli-style sandwiches like their signature hand-cut pastrami and corned beef in an old-school meets new-school setting. Continuing the legacy of Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group re-opened Stephen’s Delicatessen on Wednesday, June 19, 2019, specializing in its original menu from the 50s, but when the pandemic arrived we knew we had an opportunity to rebrand and combine the two for a mind-blowing fusion of Kush and Stephen's Deli. As of August 2020, it became Kush by Stephens and we are truly proud of what we created. “In this process, I love that I’ve discovered Hialeah, and I really think both Hialeah and South Florida residents will be proud of the authenticity we made of the space here,” said Kush. “I tried to keep the deli as similar to the original as possible. My grandpa owned a deli and I used his place as a model for the elements from the menu to the decor while still keeping the classics Stephen’s is loved for.” Kuscher remains committed to authenticity and Kush by Stephens will remain as close to its roots as possible with its original signage framing the entrance. Key elements remain consistent at Stephen’s: both the hand-sliced smoked meats and the person who’s been slicing them for over 60 years, Henderson “Junior” Biggers. Stephen’s Deli was Junior’s first job in 1957 and he’s still slicing corned beef and making the matzohs the same way he learned back in the 50s. Junior’s second job was at Kush Restaurant while waiting for Stephen’s Deli to reopen after its remodel. A carving station called “Junior’s Station” is the cornerstone of the space featuring Junior himself who has been with Stephen’s Deli for 62 years and is one of the most loyal and understated culinary professionals in South Florida. Upon entering, guests will see him hand-slicing the pastrami and corned beef to order while also learning more about this living legacy who has no intentions of slowing down. Henderson “Junior” Biggers, now 83, is full of vitality and enthusiasm for the next iteration of Stephen’s Deli who has been through several owners since it first opened in 1954. “Junior is the heart and soul of this operation,” Kuscher says. “He’s the one who’s kept this alive and has been with the operation since 1957 when he was only 20 years old. If it wasn’t for him hand-slicing meat for more than 60 years, all of this would probably be long gone. He’s responsible for keeping up one of the most historic places in Miami.” A major focus of the menu is the deli-classics like Bubbie’s Matzoh Ball Soup, or what is popularly known as “Jewish penicillin”, traditionally gifted to a loved one. Also found on the menu are a hefty Bagel & Lox Platter (smoked salmon from their neighbors St. James Smokehouse); NY Style Deli Sandwiches (on rye or challah, served with a Batampte pickle); Kush Hospitality’s Chicken n’ Waffles (voted Best in Miami by Miami New Times) Reuben Sandwiches with hand-sliced corned beef, made-to-order Egg Salad Sandwiches, and freshly-fried latkes. Guests can expect Kush and LoKal’s key lime pie (named Best in Miami by Travel + Leisure) on Stephen’s menu, including Hialeah’s own Unbranded Brewing Company; Stephen’s signature Hialeah Bars (homemade sugar cookie with shaved coconut, chocolate chips, granola, and walnuts); NY Egg Cream (topped with U-Bet chocolate syrup); and the classic deli favorite Dr. Brown’s soda to pair along with their Irish Coffee made with  Irish Whiskey. Kush pays homage to his own childhood memories of matzoh ball soup by including family photos on the walls of Stephen’s Deli, like his dad’s bar mitzvah and his grandfather’s wedding day. The menu is designed to be an exact duplicate of the menu at The Plantation Nook, his grandfather’s deli which burned down years ago in Plantation, Broward County. A saved original of the menu is on display paying tribute to Kuscher’s restaurant roots. Kush by Stephens displays artistic and traditional elements of Jewish and Hialeah culture. Adding to the New York-style deli aesthetic, the dining space features neon signs by Camilo Rojas of CR-eate Studios and an art installation paying tribute to Henderson “Junior” Biggers which tells his story. \"The deli culture is dying in this country and especially in Miami,\" says Kush. “Here is one that's been doing the same thing for 60 plus years and was about to go away. As a lover of this place and a lover of delis, I'm so proud to help bring it back stronger than before.” Stephen’s Deli originally opened in 1954 when Hialeah was predominantly a Jewish neighborhood surrounded by the garment industry. According to history, it was named after the first owner’s son. It has had several owners over the years but its glory days were in the 70s and 80s when Shelley Nadelman and his son Scott ran it for over 30 years, even after the neighborhood showed no resemblance to its Jewish beginnings. In 2011, Jack Frisch from New Jersey took it over bringing back some life into it. Although the menu kept tradition and hadn’t changed much, its current Cuban neighbors knew little about Jewish delis. At the time, Kush frequented Stephen’s for comfort in pastrami sandwiches. “It reminded me so much of my childhood and I felt obligated to try to bring it back to its glory days,” he said. Order Now View Menu Learn More Kush Hialeah Matt Kuscher and the team behind LoKal, Kush by LoKal, Kush by Spillover, and Vicky’s House establish a new home in Hialeah by combining the oldest Deli in Florida and the first cocktail bar in Hialeah. Kush by Stephens formerly known as Stephen's Delicatessen dishes out classic deli-style sandwiches like their signature hand-cut pastrami and corned beef in an old-school meets new-school setting. Continuing the legacy of Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group re-opened Stephen’s Delicatessen on Wednesday, June 19, 2019, specializing in its original menu from the 50s, but when the pandemic arrived we knew we had an opportunity to rebrand and combine the two for a mind-blowing fusion of Kush and Stephen's Deli. As of August 2020, it became Kush by Stephens and we are truly proud of what we created. “In this process, I love that I’ve discovered Hialeah, and I really think both Hialeah and South Florida residents will be proud of the authenticity we made of the space here,” said Kush. “I tried to keep the deli as similar to the original as possible. My grandpa owned a deli and I used his place as a model for the elements from the menu to the decor while still keeping the classics Stephen’s is loved for.” Kuscher remains committed to authenticity and Kush by Stephens will remain as close to its roots as possible with its original signage framing the entrance. Key elements remain consistent at Stephen’s: both the hand-sliced smoked meats and the person who’s been slicing them for over 60 years, Henderson “Junior” Biggers. Stephen’s Deli was Junior’s first job in 1957 and he’s still slicing corned beef and making the matzohs the same way he learned back in the 50s. Junior’s second job was at Kush Restaurant while waiting for Stephen’s Deli to reopen after its remodel. A carving station called “Junior’s Station” is the cornerstone of the space featuring Junior himself who has been with Stephen’s Deli for 62 years and is one of the most loyal and understated culinary professionals in South Florida. Upon entering, guests will see him hand-slicing the pastrami and corned beef to order while also learning more about this living legacy who has no intentions of slowing down. Henderson “Junior” Biggers, now 83, is full of vitality and enthusiasm for the next iteration of Stephen’s Deli who has been through several owners since it first opened in 1954. “Junior is the heart and soul of this operation,” Kuscher says. “He’s the one who’s kept this alive and has been with the operation since 1957 when he was only 20 years old. If it wasn’t for him hand-slicing meat for more than 60 years, all of this would probably be long gone. He’s responsible for keeping up one of the most historic places in Miami.” A major focus of the menu is the deli-classics like Bubbie’s Matzoh Ball Soup, or what is popularly known as “Jewish penicillin”, traditionally gifted to a loved one. Also found on the menu are a hefty Bagel & Lox Platter (smoked salmon from their neighbors St. James Smokehouse); NY Style Deli Sandwiches (on rye or challah, served with a Batampte pickle); Kush Hospitality’s Chicken n’ Waffles (voted Best in Miami by Miami New Times) Reuben Sandwiches with hand-sliced corned beef, made-to-order Egg Salad Sandwiches, and freshly-fried latkes. Guests can expect Kush and LoKal’s key lime pie (named Best in Miami by Travel + Leisure) on Stephen’s menu, including Hialeah’s own Unbranded Brewing Company; Stephen’s signature Hialeah Bars (homemade sugar cookie with shaved coconut, chocolate chips, granola, and walnuts); NY Egg Cream (topped with U-Bet chocolate syrup); and the classic deli favorite Dr. Brown’s soda to pair along with their Irish Coffee made with  Irish Whiskey. Kush pays homage to his own childhood memories of matzoh ball soup by including family photos on the walls of Stephen’s Deli, like his dad’s bar mitzvah and his grandfather’s wedding day. The menu is designed to be an exact duplicate of the menu at The Plantation Nook, his grandfather’s deli which burned down years ago in Plantation, Broward County. A saved original of the menu is on display paying tribute to Kuscher’s restaurant roots. Kush by Stephens displays artistic and traditional elements of Jewish and Hialeah culture. Adding to the New York-style deli aesthetic, the dining space features neon signs by Camilo Rojas of CR-eate Studios and an art installation paying tribute to Henderson “Junior” Biggers which tells his story. \"The deli culture is dying in this country and especially in Miami,\" says Kush. “Here is one that's been doing the same thing for 60 plus years and was about to go away. As a lover of this place and a lover of delis, I'm so proud to help bring it back stronger than before.” Stephen’s Deli originally opened in 1954 when Hialeah was predominantly a Jewish neighborhood surrounded by the garment industry. According to history, it was named after the first owner’s son. It has had several owners over the years but its glory days were in the 70s and 80s when Shelley Nadelman and his son Scott ran it for over 30 years, even after the neighborhood showed no resemblance to its Jewish beginnings. In 2011, Jack Frisch from New Jersey took it over bringing back some life into it. Although the menu kept tradition and hadn’t changed much, its current Cuban neighbors knew little about Jewish delis. At the time, Kush frequented Stephen’s for comfort in pastrami sandwiches. “It reminded me so much of my childhood and I felt obligated to try to bring it back to its glory days,” he said. Order Now View Menu Learn More Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press contact us ADDRESS & PHONE 1000 E 16th StreetHialeah, Florida 33010 305-887-8863 HOURS Monday-Tuesday: 11:30-4pm Wednesday-Thursday: 11:30am-9pm Friday-Saturday: 11:30am-10pm Sunday: 11:30am-9pm Contact Information ADDRESS & PHONE 1000 E 16th Street Hialeah, Florida 33010 305-887-8863 HOURS Monday-Tuesday: 11:30-4pm Wednesday-Thursday: 11:30am-9pm Friday-Saturday: 11:30am-10pm Sunday: 11:30am-9pm Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/team/",
      "text": "Coconut Grove, Miami, Restaurant Team | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards meet our team ▸ Matt Kuscher | Owner Matt Kuscher’s (better known as Kush) childhood dream has always been to develop restaurant concepts. He grew up spending every summer in his grandfathers breakfast spot, The Plantation Nook. It’s why he worked every position at his father’s Washington D.C. cafeterias from age 7 on up and after that attended Florida International University’s Chaplin School of Hospitality, graduating in 2000. That landed him in Miami where he’d fulfill his destiny as a third generation restaurateur. Send Matt An Email ▸ Zuni Melendez | Director Of Operations Born in San Francisco, CA raised in Miami, FL, this little spitfire started working as a hostess at LoKal when she was 17 years old. She found herself craving more responsibility, and saw herself growing with the company's expanding opportunities. She has since been groomed in every position, both in the kitchen and front of the house. Her ambitious nature, creativity, and tenacity landed her titles such as the General Manager at KUSH in Wynwood, and most recently, Director of Operations for the company. Zuni is truly remarkable in her ability to lead, and sets the highest of standards for herself and her staff. Outside the restaurant she's a lover of craft beer, fishing, and a perfect pair of shoes. Send Zuni An Email ▸ Cristina Suarez | Beverage Manager Cristina Suarez, a real Miamian , born and raised in Miami-Dade County. She got her first bartending job at 18 and never looked back. For the past decade, she’s been climbing the food and beverage ladder, always finding herself wanting to learn something new and willing to share with others her knowledge about the industry. Cristina’s passion for cocktails, combined with her go-getting attitude, lead her to the role of Beverage Manager at KUSH COCONUT GROVE. In her spare time, this self-proclaimed foodie and dog mom loves to check out the newest bars and restaurants, especially if they are dog-friendly. You can count on her for a good recommendation. Send Cristina An Email ▸ Tracey Nieroda-Kraus | General Manager Tracey is originally from Massachusetts and attended Northeastern University to earn her BS degree in Criminal Justice. But her passion for great food brought her to take on the Miami food scene and leave cold winters behind. In her spare time she loves to cook and experiment with different cuisines, sip on craft ales, and discover new restaurants. Send Tracey An Email ▸ Daisy Jean | Shift Leader Daisy started working with Kush Hospitality at LoKal when she was 15 years old, fast forward several years later; she is now working at KUSH COCONUT GROVE. Currently, she works in many positions, such as a server, bartender, and shift leader, and she has big dreams to use this knowledge to level up in the industry. Daisy is getting her education in Tourism and Hospitality Management at Miami-Dade, and hoping to turn her passion into a career. Daisy is passionate about meeting new people from all over the world. Diversity and culture are her main interests, and the hospitality industry offers a path to both. Her biggest loves are her son, traveling, and enjoying the most authentic food experiences available. ▸ Albert Collado | Executive Chef ▸ Jenifer Sarmiento | Kitchen Manager Born and raised in Miami, Florida and has been in hospitality for 9 years on team LoKal. Jen is a veteran with the company and with us since day one, working every position at LoKal from greeter, expediter and now in the kitchen. The kitchen is where she’s made her mark on the company with her inventive dishes. Combined with her tenacious attitude Jen has become known as a force to be reckoned with amongst her peers. Send Jenifer An Email meet our team ▸ Matt Kuscher | Owner Matt Kuscher’s (better known as Kush) childhood dream has always been to develop restaurant concepts. He grew up spending every summer in his grandfathers breakfast spot, The Plantation Nook. It’s why he worked every position at his father’s Washington D.C. cafeterias from age 7 on up and after that attended Florida International University’s Chaplin School of Hospitality, graduating in 2000. That landed him in Miami where he’d fulfill his destiny as a third generation restaurateur. Send Matt An Email ▸ Zuni Melendez | Director Of Operations Born in San Francisco, CA raised in Miami, FL, this little spitfire started working as a hostess at LoKal when she was 17 years old. She found herself craving more responsibility, and saw herself growing with the company's expanding opportunities. She has since been groomed in every position, both in the kitchen and front of the house. Her ambitious nature, creativity, and tenacity landed her titles such as the General Manager at KUSH in Wynwood, and most recently, Director of Operations for the company. Zuni is truly remarkable in her ability to lead, and sets the highest of standards for herself and her staff. Outside the restaurant she's a lover of craft beer, fishing, and a perfect pair of shoes. Send Zuni An Email ▸ Cristina Suarez | Beverage Manager Cristina Suarez, a real Miamian , born and raised in Miami-Dade County. She got her first bartending job at 18 and never looked back. For the past decade, she’s been climbing the food and beverage ladder, always finding herself wanting to learn something new and willing to share with others her knowledge about the industry. Cristina’s passion for cocktails, combined with her go-getting attitude, lead her to the role of Beverage Manager at KUSH COCONUT GROVE. In her spare time, this self-proclaimed foodie and dog mom loves to check out the newest bars and restaurants, especially if they are dog-friendly. You can count on her for a good recommendation. Send Cristina An Email ▸ Tracey Nieroda-Kraus | General Manager Tracey is originally from Massachusetts and attended Northeastern University to earn her BS degree in Criminal Justice. But her passion for great food brought her to take on the Miami food scene and leave cold winters behind. In her spare time she loves to cook and experiment with different cuisines, sip on craft ales, and discover new restaurants. Send Tracey An Email ▸ Daisy Jean | Shift Leader Daisy started working with Kush Hospitality at LoKal when she was 15 years old, fast forward several years later; she is now working at KUSH COCONUT GROVE. Currently, she works in many positions, such as a server, bartender, and shift leader, and she has big dreams to use this knowledge to level up in the industry. Daisy is getting her education in Tourism and Hospitality Management at Miami-Dade, and hoping to turn her passion into a career. Daisy is passionate about meeting new people from all over the world. Diversity and culture are her main interests, and the hospitality industry offers a path to both. Her biggest loves are her son, traveling, and enjoying the most authentic food experiences available. ▸ Albert Collado | Executive Chef ▸ Jenifer Sarmiento | Kitchen Manager Born and raised in Miami, Florida and has been in hospitality for 9 years on team LoKal. Jen is a veteran with the company and with us since day one, working every position at LoKal from greeter, expediter and now in the kitchen. The kitchen is where she’s made her mark on the company with her inventive dishes. Combined with her tenacious attitude Jen has become known as a force to be reckoned with amongst her peers. Send Jenifer An Email Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://kushhospitality.com/",
      "text": "Kush Hospitality: Miami Restaurant Group Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Kush Shop Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Kush Shop Kush Shop Gift Cards Read The Kush Times Read The Kush Times Read The Kush Times Who We Are We are a hospitality group focusing on one-of-a-kind concepts. We have won every food award possible from best restaurant, burger, key lime pie, chicken n waffles, veggie burger just to name a few, and we're proud to be known in the community as a leader in eco-friendly practices and our focus on dog friendliness. Our goal will always be top service, sourcing local, making food from scratch and having unique artwork. We strive to provide cutting edge concepts with fresh initiatives to help make Miami a top dining destination. Working with local artisans and award winning artists each restaurant creates its own slice of Miami life. Matt and Priscilla started this company with a dream and commitment to be the best in the biz and they continue to strive forward as innovators and game changers in the restaurant industry. Order Now Lokal Coconut Grove, FL View Details Order Now View Details Victoria's Coconut Grove, FL View Details Order Now Kush Wynwood Wynwood, FL View Details Order Now Order Now Kush Coconut Grove Coconut Grove, FL View Details Order Now Order Now Kush Hialeah Hialeah, FL View Details Order Now View Details La Cocina Hialeah, FL View Details View Details Kush Clevelander South Beach View Details Order Now Tobacco Road Brickell, FL View Details Order Now Who We Are We are a hospitality group focusing on one-of-a-kind concepts. We have won every food award possible from best restaurant, burger, key lime pie, chicken n waffles, veggie burger just to name a few, and we're proud to be known in the community as a leader in eco-friendly practices and our focus on dog friendliness. Our goal will always be top service, sourcing local, making food from scratch and having unique artwork. We strive to provide cutting edge concepts with fresh initiatives to help make Miami a top dining destination. Working with local artisans and award winning artists each restaurant creates its own slice of Miami life. Matt and Priscilla started this company with a dream and commitment to be the best in the biz and they continue to strive forward as innovators and game changers in the restaurant industry. Order Now Lokal Coconut Grove, FL View Details Order Now View Details Victoria's Coconut Grove, FL View Details Order Now Kush Wynwood Wynwood, FL View Details Order Now Order Now Kush Coconut Grove Coconut Grove, FL View Details Order Now Order Now Kush Hialeah Hialeah, FL View Details Order Now View Details La Cocina Hialeah, FL View Details View Details Kush Clevelander South Beach View Details Order Now Tobacco Road Brickell, FL View Details Order Now View Details Don's 5 Star Dive Bar MiMo District View Details Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email. View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email. View All Press subscribe to our newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Subscribe To Our Newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies"
    },
    {
      "url": "https://kushhospitality.com/locations/kush-wynwood/team/",
      "text": "Wynwood Miami Restaurant Team | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards meet our team ▸ Matt + Priscilla Kuscher | Owners Matthew Kuscher, also known as \"Kush\", is the owner of LoKal, Kush, Vicky's House, Stephen’s Delicatessen, La Cocina, and Kush by Spillover. LoKal was his first venture on his own, but he's been in the restaurant business since he was a young boy. Kush is a 3rd generation restaurateur—his father successfully owned several cafeterias and a Dunkin' Donuts shop for decades in Washington D.C. His grandfather owned restaurants and bars from the 50s through the 80s in New York and Broward County. After fifteen years of living the corporate life, he hung up his suit and tie and traded it for a T-shirt, jeans, and a life long dream of doing what he loves most—creating restaurant concepts. He is extremely passionate about buying local, and making sure his ingredients and products are top quality. To accomplish this, he visits all his purveyors' businesses to ensure they are aligned with his values. Kush has visited and inspected several farms, such as Fort McCoy Ranch in Marion County, FL and is a proud supporter of grass-fed and free range farming. Other local partners he gushes about are Clewiston Farms in Clewiston, Florida (home of fresh Florida alligators for LoKal's famous Alligator Strips), and all the local breweries—they were some of the first to be part of Matt's vision. From the inception of his brainchild LoKal, sustainability was at the top of his list of priorities. This is evident in the upcycled decor and art murals which provide seating and visual aesthetics as well as waste management and recycling services provided to his establishments. Born and raised in Washington D.C. to a Jewish father and Puerto Rican mother, Kush received his Bachelor's in Hospitality from Florida International University in 2000, and earned his chops while working for two industry leaders—Levy Restaurant Group and Hillstone Restaurant Group—but a lifetime of education imparted by his father has truly molded his success. His spent eleven years working at a number of east coast Houston's locations until finally landing in the Miami location.  Kush's philosophy is simple: \"Give guests the freshest and best quality ingredients in a cool, clean environment; and always make them leave happier than when they arrived. Kush married his long time darling Priscilla—a well-versed foodie and adventure junkie. Together, they take on the Miami food scene with a unique sense of family and grassroots conviction. Priscilla keeps him grounded in many ways and is an integral part of LoKal's day-to-day activities. She studied nutrition and dietetics at FIU and is a big believer in the old adage, \"You are what you eat.\" Eager to show Miami that eating well and living well can happen symbiotically— she looks forward to welcoming every guest into LoKal just as she would if it were her home. They are driven to spread the message of nutritious dining, active lifestyle and balanced living along with their daughter, Mila, and fur-babies, Yeyo and Chichi—two of the most adorable French bulldogs the world has ever seen. ▸ Zuni Melendez | Director Of Operations Born in San Francisco, CA raised in Miami, FL, this little spitfire started working as a hostess at LoKal when she was 17 years old. She found herself craving more responsibility, and saw herself growing with the company's expanding opportunities. She has since been groomed in every position, both in the kitchen and front of the house. Her ambitious nature, creativity, and tenacity landed her titles such as the General Manager at KUSH in Wynwood, and most recently, Director of Operations for the company. Zuni is truly remarkable in her ability to lead, and sets the highest of standards for herself and her staff. Outside the restaurant she's a lover of craft beer, fishing, and a perfect pair of shoes. Send Zuni An Email ▸ Chris Atesiano | Beverage Manager Chris was born and raised a Miami native, but proudly claims his Cuban and Spanish roots. He got his start working in restaurants ten years ago with Zuma in downtown Miami, but when he joined Kush Hospitality, he felt at home. Chris fell in love with the industry because he realized that no matter what's going on in the world, a good meal always brings people together. Through his travels, he's seen this principle in action and prides himself on experiencing new cultures as often as possible. When he's not working or traveling, Chris enjoys playing basketball, discovering new watering holes, restaurants, and mainly, craft beer breweries. Send Chris An Email ▸ Myles MuÑoz | General Manager Born in Pasadena, California, and raised in Winter Park, Florida. He has over 20 years of hospitality experience in South Florida and worked his way from the bottom to the top. His exceptional leadership skills and attention to detail have paved the way to where he stands in the industry. He's a firm believer that hospitality requires being focused on quality and service as the number one goal daily. Most importantly, he's a proud father and mentor, loves doing anything outdoors from beaches to mountains and everything in between. Send Myles An Email ▸ Andres Bello | Head Chef Andres – a.k.a. 'Dre' – is a Nicaraguan born chef raised in the states. He inherited his skills in the kitchen from his grandmother and aunt, but his passion for food was the driving force for making it a career. Creativity in his dishes and preparations set him apart from all the rest and has a certain 'joie de vivre' or cheerful and infectious spirit. Dre is a multi-talented individual, and when he's not in the Kush kitchen, he is producing music, songwriting, designing graphics, or on the hunt for the perfect pair of Jordans. Music is a lifelong passion for him, and he uses both the kitchen and fresh beats as his canvas for expression. Send Andres An Email meet our team ▸ Matt + Priscilla Kuscher | Owners Matthew Kuscher, also known as \"Kush\", is the owner of LoKal, Kush, Vicky's House, Stephen’s Delicatessen, La Cocina, and Kush by Spillover. LoKal was his first venture on his own, but he's been in the restaurant business since he was a young boy. Kush is a 3rd generation restaurateur—his father successfully owned several cafeterias and a Dunkin' Donuts shop for decades in Washington D.C. His grandfather owned restaurants and bars from the 50s through the 80s in New York and Broward County. After fifteen years of living the corporate life, he hung up his suit and tie and traded it for a T-shirt, jeans, and a life long dream of doing what he loves most—creating restaurant concepts. He is extremely passionate about buying local, and making sure his ingredients and products are top quality. To accomplish this, he visits all his purveyors' businesses to ensure they are aligned with his values. Kush has visited and inspected several farms, such as Fort McCoy Ranch in Marion County, FL and is a proud supporter of grass-fed and free range farming. Other local partners he gushes about are Clewiston Farms in Clewiston, Florida (home of fresh Florida alligators for LoKal's famous Alligator Strips), and all the local breweries—they were some of the first to be part of Matt's vision. From the inception of his brainchild LoKal, sustainability was at the top of his list of priorities. This is evident in the upcycled decor and art murals which provide seating and visual aesthetics as well as waste management and recycling services provided to his establishments. Born and raised in Washington D.C. to a Jewish father and Puerto Rican mother, Kush received his Bachelor's in Hospitality from Florida International University in 2000, and earned his chops while working for two industry leaders—Levy Restaurant Group and Hillstone Restaurant Group—but a lifetime of education imparted by his father has truly molded his success. His spent eleven years working at a number of east coast Houston's locations until finally landing in the Miami location.  Kush's philosophy is simple: \"Give guests the freshest and best quality ingredients in a cool, clean environment; and always make them leave happier than when they arrived. Kush married his long time darling Priscilla—a well-versed foodie and adventure junkie. Together, they take on the Miami food scene with a unique sense of family and grassroots conviction. Priscilla keeps him grounded in many ways and is an integral part of LoKal's day-to-day activities. She studied nutrition and dietetics at FIU and is a big believer in the old adage, \"You are what you eat.\" Eager to show Miami that eating well and living well can happen symbiotically— she looks forward to welcoming every guest into LoKal just as she would if it were her home. They are driven to spread the message of nutritious dining, active lifestyle and balanced living along with their daughter, Mila, and fur-babies, Yeyo and Chichi—two of the most adorable French bulldogs the world has ever seen. ▸ Zuni Melendez | Director Of Operations Born in San Francisco, CA raised in Miami, FL, this little spitfire started working as a hostess at LoKal when she was 17 years old. She found herself craving more responsibility, and saw herself growing with the company's expanding opportunities. She has since been groomed in every position, both in the kitchen and front of the house. Her ambitious nature, creativity, and tenacity landed her titles such as the General Manager at KUSH in Wynwood, and most recently, Director of Operations for the company. Zuni is truly remarkable in her ability to lead, and sets the highest of standards for herself and her staff. Outside the restaurant she's a lover of craft beer, fishing, and a perfect pair of shoes. Send Zuni An Email ▸ Chris Atesiano | Beverage Manager Chris was born and raised a Miami native, but proudly claims his Cuban and Spanish roots. He got his start working in restaurants ten years ago with Zuma in downtown Miami, but when he joined Kush Hospitality, he felt at home. Chris fell in love with the industry because he realized that no matter what's going on in the world, a good meal always brings people together. Through his travels, he's seen this principle in action and prides himself on experiencing new cultures as often as possible. When he's not working or traveling, Chris enjoys playing basketball, discovering new watering holes, restaurants, and mainly, craft beer breweries. Send Chris An Email ▸ Myles MuÑoz | General Manager Born in Pasadena, California, and raised in Winter Park, Florida. He has over 20 years of hospitality experience in South Florida and worked his way from the bottom to the top. His exceptional leadership skills and attention to detail have paved the way to where he stands in the industry. He's a firm believer that hospitality requires being focused on quality and service as the number one goal daily. Most importantly, he's a proud father and mentor, loves doing anything outdoors from beaches to mountains and everything in between. Send Myles An Email ▸ Andres Bello | Head Chef Andres – a.k.a. 'Dre' – is a Nicaraguan born chef raised in the states. He inherited his skills in the kitchen from his grandmother and aunt, but his passion for food was the driving force for making it a career. Creativity in his dishes and preparations set him apart from all the rest and has a certain 'joie de vivre' or cheerful and infectious spirit. Dre is a multi-talented individual, and when he's not in the Kush kitchen, he is producing music, songwriting, designing graphics, or on the hunt for the perfect pair of Jordans. Music is a lifelong passion for him, and he uses both the kitchen and fresh beats as his canvas for expression. Send Andres An Email Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://kushhospitality.com/locations/kush-wynwood/",
      "text": "Kush By Lokal In Wynwood, Miami | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards Order Online Read The Kush Times Read The Kush Times Read The Kush Times good beer ain't cheap, cheap beer ain't good 18 taps, rare finds, aged beers, rotating list and local food made from scratch good beer ain't cheap, cheap beer ain't good 18 taps, rare finds, aged beers, rotating list and local food made from scratch kush wynwood Hoping to educate and help grow the craft beer community in South Florida, Matt decided to open an exclusive craft beer bar unlike any other in the State of Florida. With the focus on beer knowledge and Matt’s restaurant experience, plus extensive research, planning, and hard work, KUSH was born. At KUSH we believe that a properly crafted beer is a work of art no different than a Purvis Young painting. With that in mind, KUSH’s mission is to unite quality craft beers, locally sourced food, and engaging works created by visionary local artists all under one roof. Our beer menu consists of eighteen taps, one nitro tap, an occasional cask, and an aged and reserve bottle list – a beer menu the likes of which the Florida beer community has never seen. We also offer an exclusive selection of small production wines. KUSH collaborates with local breweries to offer rare releases and exclusive craft beers made just for KUSH. If you’re interested in the actual craft of beer brewing, we invite you to meet the pioneers of Miami’s burgeoning craft beer industry at one of our many special events or participate in our monthly home brewers series. We are determined to offer you only high-quality craft beers and that is what we are committed to serving. We know we will attract the beer geeks, but educating beginners will be a big focus of ours as well. We also staunchly believe that quality, not quantity, is what people truly crave, and our limited-selection food menu demonstrates that principle. You’ll recognize some menu items from our brothers at LoKal, recipes that embody KUSH’s mission and complement our ales. We also offer several dishes specifically created and served only at KUSH. All our dishes are made from the freshest ingredients we can find. Our food is sourced from Florida farms and we make everything from scratch every single day – right down to our ketchup and key lime pie. Even our beef is delivered from a farm in Fort McCoy, Florida every week, and we grind it in-house. And like LoKal, voted the “Most Green Restaurant in Florida” by the Nature Conservancy, KUSH believes that ‘green is good’ and strives to be as eco-friendly as possible. Our hood is the most art-centric neighborhood in the world and our walls reflect that. While drinking and dining at KUSH you will always be surrounded by works of art created by premiere local artists. We take our mission seriously and aim to provide our patrons with the absolute best beer list in the State of Florida; fresh, delicious food every single day; and compelling visual stimuli. KUSH is more than a pub, more than a bar, more than a restaurant – it’s an experience. Come by for one of our rare keg tastings, visit us during one of our weekly beer events, or stop by for lunch and see for yourself. Cheers! Order Now View Menu Learn More Book Now kush wynwood Hoping to educate and help grow the craft beer community in South Florida, Matt decided to open an exclusive craft beer bar unlike any other in the State of Florida. With the focus on beer knowledge and Matt’s restaurant experience, plus extensive research, planning, and hard work, KUSH was born. At KUSH we believe that a properly crafted beer is a work of art no different than a Purvis Young painting. With that in mind, KUSH’s mission is to unite quality craft beers, locally sourced food, and engaging works created by visionary local artists all under one roof. Our beer menu consists of eighteen taps, one nitro tap, an occasional cask, and an aged and reserve bottle list – a beer menu the likes of which the Florida beer community has never seen. We also offer an exclusive selection of small production wines. KUSH collaborates with local breweries to offer rare releases and exclusive craft beers made just for KUSH. If you’re interested in the actual craft of beer brewing, we invite you to meet the pioneers of Miami’s burgeoning craft beer industry at one of our many special events or participate in our monthly home brewers series. We are determined to offer you only high-quality craft beers and that is what we are committed to serving. We know we will attract the beer geeks, but educating beginners will be a big focus of ours as well. We also staunchly believe that quality, not quantity, is what people truly crave, and our limited-selection food menu demonstrates that principle. You’ll recognize some menu items from our brothers at LoKal, recipes that embody KUSH’s mission and complement our ales. We also offer several dishes specifically created and served only at KUSH. All our dishes are made from the freshest ingredients we can find. Our food is sourced from Florida farms and we make everything from scratch every single day – right down to our ketchup and key lime pie. Even our beef is delivered from a farm in Fort McCoy, Florida every week, and we grind it in-house. And like LoKal, voted the “Most Green Restaurant in Florida” by the Nature Conservancy, KUSH believes that ‘green is good’ and strives to be as eco-friendly as possible. Our hood is the most art-centric neighborhood in the world and our walls reflect that. While drinking and dining at KUSH you will always be surrounded by works of art created by premiere local artists. We take our mission seriously and aim to provide our patrons with the absolute best beer list in the State of Florida; fresh, delicious food every single day; and compelling visual stimuli. KUSH is more than a pub, more than a bar, more than a restaurant – it’s an experience. Come by for one of our rare keg tastings, visit us during one of our weekly beer events, or stop by for lunch and see for yourself. Cheers! Order Now View Menu Learn More Book Now Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press contact us ADDRESS & PHONE 2003 N Miami AvenueMiami, Florida 33127 305-576-4500 HOURS Sunday -Tuesday 12pm-10pm Wednesday-Saturday 12pm-11pm Contact Information ADDRESS & PHONE 2003 N Miami Avenue Miami, Florida 33127 305-576-4500 HOURS Sunday -Tuesday 12pm-10pm Wednesday-Saturday 12pm-11pm Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://kushhospitality.com/about/team/",
      "text": "Meet Our Miami, FL, Hospitality Team | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Kush Shop Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Kush Shop Kush Shop Gift Cards kush fam FUN FACT: \"I was voted most likely to get arrested in high school.\" Meet Our Crew Matthew Kuscher Owner, Kush Hospitality Send An Email FUN FACT: \"I once wanted to be an architect, but now I’m living the dream building restaurant concepts.\" Meet Our Crew Zuniel Melendez Director of Operations, Kush Hospitality Send An Email FUN FACT: \"I can probably lift heavier than you.\" Meet Our Crew Cristin Hebert Corporate Controller, Kush Hospitality Send An Email FUN FACT: \"I'm a musicphile and go to concerts religiously.\" Meet Our Crew Tina Rodriguez Catering & Events Manager, Kush Hospitality Send An Email FUN FACT: \"My nickname is 'Bob The Builder.'\" Meet Our Crew Myles Muñoz Director of Projects & Maintenance, Kush Hospitality Send An Email FUN FACT: \"Prior to marketing, I wanted to be an organic farmer.\" Meet Our Crew Cristy Cernuda Marketing Director, Kush Hospitality Send An Email kush fam FUN FACT: \"I was voted most likely to get arrested in high school.\" Meet Our Crew Matthew Kuscher Owner, Kush Hospitality Send An Email FUN FACT: \"I once wanted to be an architect, but now I’m living the dream building restaurant concepts.\" Meet Our Crew Zuniel Melendez Director of Operations, Kush Hospitality Send An Email FUN FACT: \"I can probably lift heavier than you.\" Meet Our Crew Cristin Hebert Corporate Controller, Kush Hospitality Send An Email FUN FACT: \"I'm a musicphile and go to concerts religiously.\" Meet Our Crew Tina Rodriguez Catering & Events Manager, Kush Hospitality Send An Email FUN FACT: \"Prior to marketing, I wanted to be an organic farmer.\" Meet Our Crew Cristy Cernuda Marketing Director, Kush Hospitality Send An Email Now Hiring At Kush Hospitality, there is no limit to how successful you can be. Apply today and join a team of hard-working creatives! Join The Kush Fam Now Hiring At Kush Hospitality, there is no limit to how successful you can be. Apply today and join a team of hard-working creatives! Join The Kush Fam subscribe to our newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Subscribe To Our Newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies"
    },
    {
      "url": "https://kushhospitality.com/locations/tobacco-road/",
      "text": "Tobacco Road | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards Order Online Read The Kush Times Read The Kush Times Read The Kush Times This Ain't The Real Kush Brickell It's a tribute to what was, by Kush Hospitality This Ain't The Real Tobacco Road It's a tribute to what was, by Kush Hospitality Kush Brickell It was an inarguable loss for Miami when Tobacco Road – the Magic City’s oldest bar with a liquor license dating back to pre-Prohibition – closed its doors in the fall of 2014. In a city blessed with the power of reinvention and driven to deliver “the new,” the Road was a holdover from a bygone era of bootleggers and gangsters, barflies and brawlers. And though Tobacco Road’s glory days are gone, a new chapter is being written and, not surprising, its author is one of Miami’s foremost proctors of pop culture, Matt Kuscher of Kush Hospitality Group, well-known ‘round these parts as “Kush”. On Monday, March 1, 2021, Kush’s tribute to Tobacco Road – 50% pop up, 50% homage and 100% dive bar chic – opens its doors to the public in the former River Oyster Bar space in downtown Miami’s Brickell area. Our slogan is simple, “This ain’t the real Tobacco Road.” The goal here is not to recreate Tobacco Road, surely you can’t replicate something with so much history. What was created is a tribute to the spirit of that place, a spot people can come to eat, drink, reminisce and indulge in a little nostalgia— and have some fun in the process. Available at lunch, dinner and delivery daily, the menu at Kush Brickell reads like a “greatest hits” compilation of American bar food, with just the right amount of elevation. The menu is everything you’d want to eat at a great bar with the twists you’d expect from a Kush Hospitality. Order Now View Dining Menu View Happy Hour Menu Learn More Book Now Tobacco Road By Kush It was an inarguable loss for Miami when Tobacco Road – the Magic City’s oldest bar with a liquor license dating back to pre-Prohibition – closed its doors in the fall of 2014. In a city blessed with the power of reinvention and driven to deliver “the new,” the Road was a holdover from a bygone era of bootleggers and gangsters, barflies and brawlers. And though Tobacco Road’s glory days are gone, a new chapter is being written and, not surprising, its author is one of Miami’s foremost proctors of pop culture, Matt Kuscher of Kush Hospitality Group, well-known ‘round these parts as “Kush”. On Monday, March 1, 2021, Kush’s tribute to Tobacco Road – 50% pop up, 50% homage and 100% dive bar chic – opens its doors to the public in the former River Oyster Bar space in downtown Miami’s Brickell area. Our slogan is simple, “This ain’t the real Tobacco Road.” The goal here is not to recreate Tobacco Road, surely you can’t replicate something with so much history. What was created is a tribute to the spirit of that place, a spot people can come to eat, drink, reminisce and indulge in a little nostalgia— and have some fun in the process. Available at lunch, dinner and delivery daily, the menu at Tobacco Road by Kush reads like a “greatest hits” compilation of American bar food, with just the right amount of elevation. The menu is everything you’d want to eat at a great bar with the twists you’d expect from a Kush\nHospitality. Order Now View Dining Menu View Happy Hour Menu Learn More Book Now Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Event Gallery Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Event Gallery Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View Press contact us ADDRESS & PHONE 650 S Miami AvenueMiami, Florida 33130 786-703-3120 HOURS Sunday-Thursday: 11:30am-2:00am Friday-Saturday: 11:30am-3:00am Contact Information ADDRESS & PHONE 650 S Miami Avenue Miami, Florida 33130 786-703-3120 HOURS Sunday-Thursday: 11:30am-2:00am Friday-Saturday: 11:30am-3:00am Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://kushhospitality.com/events/",
      "text": "Miami Events At Our Restaurants & Bars | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Kush Shop Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Kush Shop Kush Shop Gift Cards events At Kush Hospitality, we’re always looking for a reason to celebrate. Check out our multi-location event calendar to view a full list of our event line-up! View Calendar View Gallery Learn More Book Now Events At Kush Hospitality, we’re always looking for a reason to celebrate. Check out our multi-location event calendar to view a full list of our event line-up! View Calendar View Photos Learn More Book Now Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658. View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658. View All Press subscribe to our newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Subscribe To Our Newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies"
    },
    {
      "url": "https://kushhospitality.com/menus/",
      "text": "Miami Food & Drink Menus From Kush Hospitality | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Kush Shop Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Kush Shop Kush Shop Gift Cards menus View Menu View Menu View Menu View Dining Menu View Brunch Menu View Menu View Menu View Dining Menu View Dining Menu View Happy Hour Menu View Late Night Menu View Menu menus View Menu View Menu View Menu View Dining Menu View Brunch Menu View Menu View Menu View Dining Menu View Dining Menu View Happy Hour Menu View Late Night Menu View Menu Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658. View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658. View All Press subscribe to our newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Subscribe To Our Newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies"
    },
    {
      "url": "https://www.linkedin.com/posts/emerson-lima-luxury-real-estate-45061632_st-regis-miami-brickell-new-construction-activity-6958020228538585088-OCSs",
      "text": "St Regis Miami Brickell - New Construction - For more information contact me via email emersonlima@cervera.com | Emerson Lima Luxury Real Estate Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Emerson Lima Luxury Real Estate’s Post Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 3y Report this post St Regis Miami Brickell - New Construction - For more information contact me via email emersonlima@cervera.com +4 3 Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in More Relevant Posts Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 1w Report this post If you’d like deeper insights into Miami real estate, feel free to reach out — I’m always happy to share market updates. View C2PA information 4 Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 3w Report this post Housing affordability will depend on a mix of factors: interest rates, housing supply, construction innovation, and smarter policies. I think the biggest shifts will come from new building methods and alternative ownership models that make entry easier for buyers. 1 1 Comment Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 4w Report this post Miami’s rental market is proving its strength again. View C2PA information 1 Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 1mo Report this post Smart buyers are focusing on neighborhoods with walkability, long-term appreciation, and solid rental yields. I help clients evaluate both current value and future upside—with over 35 years in Miami’s evolving market. View C2PA information Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 2mo Report this post View C2PA information 2 Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 3mo Report this post Tips for Miami's Competitive Housing Market! Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 4mo Report this post Experience the Pinnacle of Luxury Living at 888 Brickell\n\nIntroducing the Dolce & Gabbana Residences—a harmonious blend of Italian craftsmanship and Miami's vibrant energy. Nestled in the heart of Brickell, this 90-story architectural marvel stands as Miami's tallest tower, offering unparalleled elegance and sophistication.\n\nKey Highlights:\nResidences: 259 fully furnished units ranging from 1 to 4 bedrooms, including exclusive duplexes and penthouses, all curated by Dolce & Gabbana. \n\nAmenities: Indulge in over 115,000 sq. ft. of amenities, including a 44-foot lap pool, wellness spa, fitness center, golf simulator, private theater, and a signature restaurant. \n\nPrime Location: Situated in Miami's dynamic Brickell neighborhood, residents enjoy proximity to world-class dining, shopping, and cultural experiences.\n\nStarting at $1.6 million, these residences offer a unique opportunity to own a piece of Dolce & Gabbana's legacy in one of Miami's most sought-after locales.\n\n📩 Interested in learning more or scheduling a private tour? Contact me directly to explore this unparalleled living experience.\n\nemail: emersonlima@cervera.com #DolceGabbanaResidences #888Brickell #LuxuryLiving #MiamiRealEstate #BrandedResidences #ItalianDesign #BrickellLifestyle 4 3 Comments Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 4mo Report this post A Max Strang Waterfront Masterpiece in Coconut Grove\n\nWhere luxury, innovation, and tranquility converge.\n\nThis 10,556 SF architectural gem sits in the heart of Coconut Grove’s ultra-exclusive Four Way Lodge. Designed by acclaimed architect Max Strang, this residence blends bold modernity with warm natural textures — Italian Basaltina stone, Balinese limestone, and fine Ipe wood.\n\n🌊 Nearly 150 feet of direct waterfront\n🛥 50’ dock + boat lift\n🔥 Kalamazoo summer kitchen\n🏊♂️ Saline lap pool\n🍷 1,000-bottle wine room\n🚘 8+ car garage + EV charger\n🖼 Separate guest house with 2BD, 1.5BA & art studio\n📱 Full smart home integration (Lutron, Sonos, Kreon, Generator)\n\nThis property redefines quiet prestige. A perfect retreat for decision-makers, entrepreneurs, and visionary leaders seeking privacy, timeless design, and lifestyle excellence.\n\n🔑 Private tours available by appointment.\nLet’s connect if you're ready to own a piece of architectural history in one of Miami’s most coveted waterfront communities. #LuxuryRealEstate #CoconutGrove #WaterfrontLiving #MaxStrang #MiamiMansions #CLevelLifestyle #ArchitecturalDesign #ModernLuxury #RealEstateForExecutives #DreamHome #PrivateEstate #SmartHomeLiving #LuxuryRetreat …more 7 1 Comment Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in Emerson Lima Luxury Real Estate For over 34 years in the Real Estate Services Business in Miami | NY | Brasil 5mo Report this post 🚨 Investment Opportunity: Walgreens in Kissimmee, Orlando! 🚨\n📍 Prime Retail Asset – Corporate-backed Walgreens with a 100% occupancy rate and absolute NNN lease! Secure your investment in a high-traffic location with a national credit tenant.\n💰 Investment Highlights:\n✅ Single-tenant Walgreens – Corporate Guarantee\n✅ Absolute NNN Lease – Zero Landlord Responsibilities\n✅ Remaining Term: 3.6 years + (9) Five-Year Extension Options\n✅ Cap Rate: 7.28% 📈\n✅ Square Footage: 16,169 SF\n✅ Lot Size: 1.71 acres\n✅ Net Operating Income (NOI): $274,800\n🏢 Zoning: OPD | 🏗 Built in: 2003\n📅 Lease Expiration: 10/31/2028 – Long-term stability with structured rent bumps!\n🔑 Perfect for 1031 exchange buyers & investors looking for a passive income stream.\n📩 DM me for details or to schedule a tour! #CommercialRealEstate #InvestmentProperty #NNNLease #Walgreens #RetailInvestment #1031Exchange #RealEstateInvesting #PassiveIncome 2 Like Comment Share Copy LinkedIn Facebook Twitter To view or add a comment, sign in 1,309 followers 203 Posts 1 Article View Profile Follow More from this author Miami Real Estate Market Insights - December 2024 Emerson Lima Luxury Real Estate 9mo Explore content categories Career Productivity Finance Soft Skills & Emotional Intelligence Project Management Education Technology Leadership Ecommerce Show more Show less LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Sign in to view more content Create your free account or sign in to continue your search Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://kushhospitality.com/locations/",
      "text": "Restaurants In Miami By Kush Hospitality | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Kush Shop Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Kush Shop Kush Shop Gift Cards Locations Order Now Lokal Coconut Grove, FL View Details Order Now View Details Victoria's Coconut Grove, FL View Details Order Now Kush Wynwood Wynwood, FL View Details Order Now Order Now Kush Coconut Grove Coconut Grove, FL View Details Order Now Order Now Kush Hialeah Hialeah, FL View Details Order Now View Details La Cocina Hialeah, FL View Details View Details Kush Clevelander South Beach View Details Order Now Tobacco Road Brickell, FL View Details Order Now Locations Order Now Lokal Coconut Grove, FL View Details Order Now View Details Vicky's House Coconut Grove, FL View Details Order Now Kush Wynwood Wynwood, FL View Details Order Now Order Now Kush Coconut Grove Coconut Grove, FL View Details Order Now Order Now Kush Hialeah Hialeah, FL View Details Order Now View Details La Cocina Hialeah, FL View Details View Details Kush Clevelander South Beach View Details Order Now Tobacco Road Brickell, FL View Details Order Now View Details Don's 5 Star Dive Bar MiMo District View Details Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658. View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658. View All Press subscribe to our newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Subscribe To Our Newsletter Don't worry, we're not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and\noffers from Kush Hospitality. Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://hotspotsmagazine.com/2024/05/31/kush-drag-queen-trivia-saturdays/",
      "text": "Kush Drag Queen Trivia Saturdays | Hotspots Magazine Facebook Instagram Twitter Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Search 86.2 F Fort Lauderdale Advertise with Us Contact Us Facebook Instagram Twitter Sign in Welcome! Log into your account your username your password Forgot your password? Get help Privacy Policy Password recovery Recover your password your email A password will be e-mailed to you. Magazine South Florida: Current Issue Magazine Archives: 2024 Magazine Archives: 2023 Magazine Archives: 2022 Magazine Archives: 2021 Magazine Archives: 2020 Magazine Archives: 2019 What’s Hot South Florida’s Hot Entertainment Hotspots Hotties Hot Advice Hot Beats Hot Bodies Hot Eats Women Press Play Women’s Events Must See Must Read Must Watch Women’s History Month Articles Feature Stories Deep Inside Hollywood Discover Gay FL Queens We Love DJs We Love Photos Hot Shots PHOTOS: The 25th Annual Black Fort Lauderdale Festival at The Manor Hot Shots PHOTOS – PrideFête: An LGBTQ+ Caribbean Festival 2025 Hot Shots PHOTOS: 10th Annual FlockFest Beach Party Hot Shots PHOTOS: Lez Chic Monthly Brunch: May 2025 Hot Shots PHOTOS – Wilton Manors Stonewall Pride Parade & Street Festival 2025… TV Happening Out Television Network The Bobby Blair Show The FayWhat?! Show Queer News Tonight Queer God Squad Events About Hotspots! Events Monthly Events Art Gallery Opening Reception Pride Skate Nights Art Walk Wilton Manors Artists Showcase Annual Events Stonewall Pride Parade & Festival Black History Month Events The Cookout: Black History Month Pride On The Drive Women’s History Month HOTtopics: Town Hall Series (Quarterly) July 4th Fireworks Cruise PrideFête: An LGBTQ Caribbean Festival The South Florida Men’s Wellness Conference Taste of the Island Art HOTspots Art About HOTspots Art Art Walk Wilton Manors Sculpture Walk Art Gallery with Dennis Dean Classifieds About Join Us Contact Us Advertise Hotspots Magazine Home Happening Out Television Network Queer News Tonight Kush Drag Queen Trivia Saturdays Queer News Tonight Kush Drag Queen Trivia Saturdays By Happening Out Television Network - May 31, 2024 585 Facebook Twitter Pinterest WhatsApp Advertisement This is tonight’s lead anchor Bonnie Builder. She is the premier South Florida bodybuilding drag queen and the current reigning Mx Mary’s. A recent graduate of FIU, Bonnie Builder is a trainer and comes to life with a microphone and a spotlight. Bonnie Bilder, every Saturday, you are at KUSH Brickell for Drag Queen Trivia. Happening Out Television Network See Full Bio Facebook Twitter Pinterest WhatsApp Previous article Siudy Garrido Flamenco Company and the South Florida Symphony Orchestra comes to Miami on June 15 Next article National HIV Testing Day June 27 Happening Out Television Network RELATED ARTICLES MORE FROM AUTHOR Queer News Tonight BOSFL Pool Party Returns to Grand Resort, September 13 Queer News Tonight North Beach LGBTQ+ And Friends Weekly Social at Twice Removed, Every Tuesday Queer News Tonight Stonewall Museum to Screen Eytan Fox’s “The Bubble” September 11 Queer News Tonight Hotspots Shines Spotlight on Hispanic Art & Culture in Fort Lauderdale in Its New Issue, coming September 11 Queer News Tonight Trans Flag Creator Monica Helms Plans to Flee U.S. Amid Rising Persecution Queer News Tonight Compass Earns Triple Nod at Nonprofit Awards Advertisement ABOUT US © HOTspots Happening Out - Non-Profit (501c3) LGBTQ+ Media Network  \r\n2025 - Privacy Policy - Hotspots Magazine Contact us: info@hotspots.lgbt FOLLOW US Facebook Instagram Twitter © Hotspots! - Copyright 2024 - By 7Elements Web Design This website uses cookies to ensure you get the best experience on our website. Yes, I accept Read More Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT MORE STORIES BOSFL Pool Party Returns to Grand Resort, September 13 Happening Out Television Network - September 10, 2025 Go to mobile version"
    },
    {
      "url": "https://kushhospitality.com/shop/policies/",
      "text": "Shop Policies | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Kush Shop Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Kush Shop Gift Cards Kush Shop Kush Shop Gift Cards Kush Shop Policies ▸ Returns & Refunds Kush Hospitality Apparel will accept returns for refund within 30 days of purchase. Items must be returned undamaged and unworn. Please fill out the Request For Refund Form and we will email you a pre-paid return shipping label upon confirmation of the request. Once your request for a return is approved, returns can also be done in person. You must call ahead to ensure someone is on-site before coming to drop-off a return. Kush Hospitality Group 2911 Grand Avenue, Suite 400D Miami, Florida 33133 In person returns can be made from 10am until 5pm, Monday through Friday (excluding holidays). *Please allow up to 14 days for the refund to appear on your bank statement. Returning An Item Originally Picked Up In-Store: Our 30 day return policy remains the same for in store pick ups - 30 days begin from the day your order is fulfilled and is ready for pickup (you will receive an email confirming your pick up location). If your order is picked up after 30 days, the return period will have expired, therefore you won't be able to return for exchange or store credit. Customer service and inquiries can be sent to info@kushhospitality.com . ▸ Shipping Free UPS Ground shipping on all USA orders over $200. UPS Ground Shipping starts at $10 based on your location and order size. Expedited shipping is available for $30. Once you've entered your shipping address, your shipping will be calculated. UPS Shipping for continental USA. USPS Priority Mail for Puerto Rico, Hawaii, Alaska, Islands + territories). UPS does not ship to PO Boxes. If you have a PO Box, your order will automatically be shipped via USPS. UPS Ground: All orders ship out Miami, FL. Orders are processed Monday through Friday. If you want your order shipped out same day, please complete your order by 12PM EST. Once your order ships, you will receive a shipping notification and tracking number via email. All express shipments (2nd day, 1 day air express or 3 day select) must be placed by 12pm EST to ship out same day. If received after 12pm EST, it will ship out the following business day (weekends not included). USPS Priority Mail: Puerto Rico, Alaska, Hawaii, and territories ship via USPS Priority Mail. All USA orders with PO Boxes also ship via USPS, not UPS. We ship out your order within 48 hours, but USPS is experiencing some delays when already en route to destination. We recommend just staying up to date with the tracking information and your local post office. Local Pickup: You can pick up your merchandise in person at either Kush Coconut Grove or Kush Hialeah. Please confirm with a staff member that your item(s) are ready and that someone will be available to meet you prior to going to pick up your order. ▸ Tracking Your Package To track your Kush goods, refer to your shipping confirmation email and find the tracking number. Then simply go to www.usps.com and track your package. If you have any additional questions, please don't hesitate to email us at info@kushhospitality.com . ▸ Exchanges At this time, Kush Hospitality can only accommodate requests for exchanges if done in person at one of our pick-up locations with prior notice and confirmation from our team. The initial items can be refunded within 30 days of purchase. Items must be returned undamaged and unworn. Please note that a new order will need to be placed for the replacement item. Kush Hospitality Group 2911 Grand Avenue, Suite 400D Miami, Florida 33133 In person excahnges can be made from 10am until 5pm, Monday through Friday (excluding holidays). *Please allow up to 14 days for the refund to appear on your bank statement. ▸ Shipping Schedule We process and ship orders Monday through Friday excluding weekends and holidays from 10am to 4pm. We do our best to ship all orders within 1 business day of being placed. All in stock orders ship immediately. For orders to ship same day, they must be received by 2pm EST that day. If you need to make a change to your order or address, it can only be done if order has not been fulfilled. Once an order ships, unfortunately, we cannot modify the order. If you PREORDER an item, it will ship on the approximate date stated in description. Shipping Schedule: Express Priority (Overnight, 1-2 days) We process and ship express orders Monday thru Friday excluding weekends and holidays, from 10am to 2pm. Priority Shipping (Domestic): Please allow between 1-3 business days once you receive the shipping confirmation email. ▸ Need To Contact Us? Email us at info@kushhospitality.com if you have any questions or comments. We will get back to you within 1 business day. Kush Shop Policies ▸ Returns & Refunds Kush Hospitality Apparel will accept returns for refund within 30 days of purchase. Items must be returned undamaged and unworn. Please fill out the Request For Refund Form and we will email you a pre-paid return shipping label upon confirmation of the request. Once your request for a return is approved, returns can also be done in person. You must call ahead to ensure someone is on-site before coming to drop-off a return. Kush Hospitality Group 2911 Grand Avenue, Suite 400D Miami, Florida 33133 In person returns can be made from 10am until 5pm, Monday through Friday (excluding holidays). *Please allow up to 14 days for the refund to appear on your bank statement. Returning An Item Originally Picked Up In-Store: Our 30 day return policy remains the same for in store pick ups - 30 days begin from the day your order is fulfilled and is ready for pickup (you will receive an email confirming your pick up location). If your order is picked up after 30 days, the return period will have expired, therefore you won't be able to return for exchange or store credit. Customer service and inquiries can be sent to info@kushhospitality.com . ▸ Exchanges At this time, Kush Hospitality can only accommodate requests for exchanges if done in person at one of our pick-up locations with prior notice and confirmation from our team. The initial items can be refunded within 30 days of purchase. Items must be returned undamaged and unworn. Please note that a new order will need to be placed for the replacement item. Kush Hospitality Group 2911 Grand Avenue, Suite 400D Miami, Florida 33133 In person excahnges can be made from 10am until 5pm, Monday through Friday (excluding holidays). *Please allow up to 14 days for the refund to appear on your bank statement. ▸ Shipping Free UPS Ground shipping on all USA orders over $200. UPS Ground Shipping starts at $10 based on your location and order size. Expedited shipping is available for $30. Once you've entered your shipping address, your shipping will be calculated. UPS Shipping for continental USA. USPS Priority Mail for Puerto Rico, Hawaii, Alaska, Islands + territories). UPS does not ship to PO Boxes. If you have a PO Box, your order will automatically be shipped via USPS. UPS Ground: All orders ship out Miami, FL. Orders are processed Monday through Friday. If you want your order shipped out same day, please complete your order by 12PM EST. Once your order ships, you will receive a shipping notification and tracking number via email. All express shipments (2nd day, 1 day air express or 3 day select) must be placed by 12pm EST to ship out same day. If received after 12pm EST, it will ship out the following business day (weekends not included). USPS Priority Mail: Puerto Rico, Alaska, Hawaii, and territories ship via USPS Priority Mail. All USA orders with PO Boxes also ship via USPS, not UPS. We ship out your order within 48 hours, but USPS is experiencing some delays when already en route to destination. We recommend just staying up to date with the tracking information and your local post office. Local Pickup: You can pick up your merchandise in person at either Kush Coconut Grove or Kush Hialeah. Please confirm with a staff member that your item(s) are ready and that someone will be available to meet you prior to going to pick up your order. ▸ Shipping Schedule We process and ship orders Monday through Friday excluding weekends and holidays from 10am to 4pm. We do our best to ship all orders within 1 business day of being placed. All in stock orders ship immediately. For orders to ship same day, they must be received by 2pm EST that day. If you need to make a change to your order or address, it can only be done if order has not been fulfilled. Once an order ships, unfortunately, we cannot modify the order. If you PREORDER an item, it will ship on the approximate date stated in description. Shipping Schedule: Express Priority (Overnight, 1-2 days) We process and ship express orders Monday thru Friday excluding weekends and holidays, from 10am to 2pm. Priority Shipping (Domestic): Please allow between 1-3 business days once you receive the shipping confirmation email. ▸ Tracking Your Package To track your Kush goods, refer to your shipping confirmation email and find the tracking number. Then simply go to www.usps.com and track your package. If you have any additional questions, please don't hesitate to email us at info@kushhospitality.com . ▸ Need To Contact Us? Email us at info@kushhospitality.com if you have any questions or comments. We will get back to you within 1 business day. Kush Shop Policies ▸ Returns & Refunds Kush Hospitality Apparel will accept returns for refund within 30 days of purchase. Items must be returned undamaged and unworn. Please fill out the Request For Refund Form and we will email you a pre-paid return shipping label upon confirmation of the request. Once your request for a return is approved, returns can also be done in person. You must call ahead to ensure someone is on-site before coming to drop-off a return. Kush Hospitality Group 2911 Grand Avenue, Suite 400D Miami, Florida 33133 In person returns can be made from 10am until 5pm, Monday through Friday (excluding holidays). *Please allow up to 14 days for the refund to appear on your bank statement. Returning An Item Originally Picked Up In-Store: Our 30 day return policy remains the same for in store pick ups - 30 days begin from the day your order is fulfilled and is ready for pickup (you will receive an email confirming your pick up location). If your order is picked up after 30 days, the return period will have expired, therefore you won't be able to return for exchange or store credit. Customer service and inquiries can be sent to info@kushhospitality.com . ▸ Exchanges At this time, Kush Hospitality can only accommodate requests for exchanges if done in person at one of our pick-up locations with prior notice and confirmation from our team. The initial items can be refunded within 30 days of purchase. Items must be returned undamaged and unworn. Please note that a new order will need to be placed for the replacement item. Kush Hospitality Group 2911 Grand Avenue, Suite 400D Miami, Florida 33133 In person excahnges can be made from 10am until 5pm, Monday through Friday (excluding holidays). *Please allow up to 14 days for the refund to appear on your bank statement. ▸ Shipping Free UPS Ground shipping on all USA orders over $200. UPS Ground Shipping starts at $10 based on your location and order size. Expedited shipping is available for $30. Once you've entered your shipping address, your shipping will be calculated. UPS Shipping for continental USA. USPS Priority Mail for Puerto Rico, Hawaii, Alaska, Islands + territories). UPS does not ship to PO Boxes. If you have a PO Box, your order will automatically be shipped via USPS. UPS Ground: All orders ship out Miami, FL. Orders are processed Monday through Friday. If you want your order shipped out same day, please complete your order by 12PM EST. Once your order ships, you will receive a shipping notification and tracking number via email. All express shipments (2nd day, 1 day air express or 3 day select) must be placed by 12pm EST to ship out same day. If received after 12pm EST, it will ship out the following business day (weekends not included). USPS Priority Mail: Puerto Rico, Alaska, Hawaii, and territories ship via USPS Priority Mail. All USA orders with PO Boxes also ship via USPS, not UPS. We ship out your order within 48 hours, but USPS is experiencing some delays when already en route to destination. We recommend just staying up to date with the tracking information and your local post office. Local Pickup: You can pick up your merchandise in person at either Kush Coconut Grove or Kush Hialeah. Please confirm with a staff member that your item(s) are ready and that someone will be available to meet you prior to going to pick up your order. ▸ Shipping Schedule We process and ship orders Monday through Friday excluding weekends and holidays from 10am to 4pm. We do our best to ship all orders within 1 business day of being placed. All in stock orders ship immediately. For orders to ship same day, they must be received by 2pm EST that day. If you need to make a change to your order or address, it can only be done if order has not been fulfilled. Once an order ships, unfortunately, we cannot modify the order. If you PREORDER an item, it will ship on the approximate date stated in description. Shipping Schedule: Express Priority (Overnight, 1-2 days) We process and ship express orders Monday thru Friday excluding weekends and holidays, from 10am to 2pm. Priority Shipping (Domestic): Please allow between 1-3 business days once you receive the shipping confirmation email. ▸ Tracking Your Package To track your Kush goods, refer to your shipping confirmation email and find the tracking number. Then simply go to www.usps.com and track your package. If you have any additional questions, please don't hesitate to email us at info@kushhospitality.com . ▸ Need To Contact Us? Email us at info@kushhospitality.com if you have any questions or comments. We will get back to you within 1 business day. Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Browse Shop Cart Checkout My Account Shop Policies"
    },
    {
      "url": "https://kushhospitality.com/locations/tobacco-road/press/",
      "text": "Tobacco Road Press | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658 . \"Dive Bar Tobacco Road Brought Back To Life\" 7 News Miami \"Tobacco Road To Pop Up In Brickell\" Miami New Times \"Tobacco Road Pop Up Coming To Brickell\" Ground News \"Plans In Works For Tobacco Road Tribute\" iHeart Radio \"New Tobacco Road Pop Up To Open In Brickell\" Newsbreak.com press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email or calling 305-573-0658 . \"Dive Bar Tobacco Road Brought Back To Life\" 7 News Miami \"Tobacco Road To Pop Up In Brickell\" Miami New Times \"Tobacco Road Pop Up Coming To Brickell\" Ground News \"Plans In Works For Tobacco Road Tribute\" iHeart Radio \"New Tobacco Road Pop Up To Open In Brickell\" Newsbreak.com Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/",
      "text": "Lokal Miami Restaurant & Bar | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards Order Online Read The Kush Times Read The Kush Times Read The Kush Times Bringing Locally Sourced Burgers & beers paired with an industrial, raw edginess We Are A Dog-Friendly Environment Bringing Sustainably & Locally Sourced Burgers & beers paired with an industrial, raw edginess We Are A Dog-Friendly Environment [lo-ka’l] LoKal, pronounced [lo-ka’l], in Coconut Grove opened its doors on December 24, 2011. Stemming from the German word for restaurant and meeting place, LoKal lives up to its definition of being a meeting place but exceeds all of its guests’ expectations by bringing sustainably and locally sourced ingredients paired with an industrial, raw edginess. Particularly suited to the Grove’s personality and bohemian reputation, Grovites now have a place where they can satiate their comfort food cravings. Owner Matthew Kuscher’s commitment was to create a place people could connect to. LoKal is a local's haven. We like the tradition of butchering your own beef, and LoKal uses whole sides of beef, and primal cuts of clean proteins and processes them in-house. Hand-grinding our meats daily and pressing each and every patty will result in LoKal’s distinctive signature flavor. LoKal’s entire menu signals an unparalleled approach to quality and integrity. Order Now View Menu Learn More [lo-ka’l] LoKal, pronounced [lo-ka’l], in Coconut Grove opened it's doors on December 24, 2011. Stemming from the German word for restaurant and meeting place, LoKal lives up to its definition of being a meeting place but exceeds all of its guests’ expectations by bringing sustainably and locally sourced ingredients paired with an industrial, raw edginess. Particularly suited to the Grove’s personality and bohemian reputation, Grovites now have a place where they can satiate their comfort food cravings as well as their ideological inclinations. Owner Matthew Kuscher’s commitment to quality is unmatched as he will be tapping Floridian farmers, dairies and brewers in order to highlight the bounty of products, goods and ingredients available in the Sunshine State. In plain English, LoKal will be as local as local gets. LoKal is the 1st restaurant in Miami-Dade County to use 100% clean, renewable energy sourced from wind and solar power! Using Florida grass-fed beef and Floridian-raised clean proteins for their burgers, sandwiches and salads, LoKal will be purchasing whole sides of beef, and primal cuts of clean proteins and processing them in-house. Hand grinding their meats daily and pressing each and every patty will result in LoKal’s distinctive signature flavor. Whether made of grass-fed beef, free range chicken or local fish, one thing is for sure, LoKal’s entire menu signals an unparalleled approach to quality and integrity. Order Now View Menu Learn More Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press contact us ADDRESS & PHONE 3190 Commodore PlazaMiami, Florida 33133 305-442-3377 HOURS Sunday-Tuesday:11:30am-10pm Wednesday-Saturday: 11:30am-11pm Contact Information ADDRESS & PHONE 3190 Commodore Plaza Miami, Florida 33133 305-442-3377 HOURS Sunday-Tuesday:11:30am-10pm Wednesday-Saturday: 11:30am-11pm Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://brickellpsychology.com/contact/",
      "text": "Contact - Brickell Psychology Skip to content Skip to footer 2730 SW 3rd Ave. Suite 305, Miami, FL 33129 [email protected] +1 786.475.8151 Make an Appointment Home About Dr. Samantha M. Behbahani Dr. Gustavo A. Benejam Dr. Kristin Borracci-Pastiu Dr. Jacqueline Pablos Dr. Rachel Keitelman Services Depression Anxiety Burnout Phobias Trauma Couples Therapy Family Therapy Grief & Loss Psychological Testing Resources Blog FAQ Our Offices Contact Contact Close Home About Dr. Samantha M. Behbahani Dr. Gustavo A. Benejam Dr. Kristin Borracci-Pastiu Dr. Jacqueline Pablos Dr. Rachel Keitelman Services Depression Anxiety Burnout Phobias Trauma Couples Therapy Family Therapy Grief & Loss Psychological Testing Resources Blog FAQ Our Offices Contact Address 2730 SW 3rd Ave. Suite 305 Miami, FL 33129 Get Directions Get in Touch Telephone: (786) 475-8151 Email: [email protected] Contact Form Open Hours Mon-Fri: 9 AM – 6 PM Saturday: 9 AM – 4 PM Sunday: Closed Address 2730 SW 3rd Ave. Suite 202 Miami, FL 33129 Get Directions Get in Touch Telephone: (786) 475-8151 Email: [email protected] Contact Form Have Questions? Get in Touch! Make a booking with our online form 2730 SW 3rd Ave. Suite 305 , Miami , FL 33129 Phone: 1.786.475.8151 Email: [email protected] Brickell Psychology © 2024. All Rights Reserved. | Web Design by Accodelades. Brickell Psychology © 2024. All Rights Reserved. Web Design by Accodelades. Brickell Psychology © 2024. All Rights Reserved. | Web Design by Accodelades. Privacy Policy | Terms of Service Brickell Psychology © 2024. All Rights Reserved. Privacy Policy | Terms of Service Web Design by Accodelades. Our site uses cookies. Learn more about our use of cookies: cookie policy Accept"
    },
    {
      "url": "https://kushhospitality.com/locations/spillover/",
      "text": "Kush By Spillover In Coconut Grove, Miami | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards Make A Reservation Order Online Read The Kush Times Read The Kush Times Read The Kush Times BRINGING YOU THE BEST OF KUSH AND SPILLOVER UNDER ONE ROOF LOCAL INGREDIENTS, LOCAL SEAFOOD, OYSTERS, CRAFT BEER AND CRAFT COCKTAILS EVERYTHING AT KUSH BY SPILLOVER IS MADE FROM SCRATCH BEST HAPPY HOUR IN THE GROVE (MONDAY TO FRIDAY, 5-7PM) ANNOUNCING THE RETURN OF THE MOOSE JUICE! BRINGING YOU THE BEST OF KUSH AND SPILLOVER UNDER ONE ROOF LOCAL INGREDIENTS, LOCAL SEAFOOD, OYSTERS, CRAFT BEER AND CRAFT COCKTAILS EVERYTHING AT KUSH BY SPILLOVER IS MADE FROM SCRATCH BEST HAPPY HOUR IN THE GROVE (MONDAY TO FRIDAY, 5-7PM) ANNOUNCING THE RETURN OF THE MOOSE JUICE! Kush Coconut Grove There has been no shortage of change in the South Florida food scene these past several months. Trying times for all and challenges aplenty; with them, opportunities as well. And with the temporary closure of his sea-centric Spillover restaurant in Coconut Grove and an eventual reopening planned, owner/operator Matthew Kuscher (the “Kush” in Kush Hospitality) saw just that: an opportunity to revamp the restaurant and bring his eponymous, and wildly successful, Kush concept to Coconut Grove. “Spillover had an amazing run and certainly had its fans,” Kuscher noted.“But looking at how the market is changing and what customers want in these crazy, stressful times it was evident to me that the spirit of Kush–fun, casual, not taking itself seriously–was what was needed now. The ‘time off’ afforded us the chance to work on everything, from the menu to bar program and even décor. I’m excited for fans to see it and happy that we have something positive to look forward to. We all need that.”Kush Coconut Grove also referred to as Kush by Spillover, will open to the public on Wednesday, June 17, 2020. And like its sibling concepts–Stephen’s Delicatessen and Kush Wynwood, among others–it will maintain all occupancy and social distancing protocols. And in addition to safety and service, Kuscher promises an exciting new experience for both Spillover fans and newcomers. “Anyone who knows me knows I don’t do things in half measures,” Kuscher says, inarguably a truism for a man who doubles as the costumed Kaptain Kush, self-proclaimed Miami superhero and protector of all that makes Miami great and special.“This is far more than a new name and some menu items. It truly is a rebirth of the space and the concept. First, the menu, which overflows with options and reads like a greatest-hits from both Spillover and Kush with new temptations in the mix. Kush favorites now on offer in Coconut Grove run the gamut, from must-have burgers and sandwiches such as the famous Farm-Style Chicken Sandwich andHobo Frito Pie. New to the mix, Fish & Chips, Spicy Chicken Sandwich, Chili Burger, and Juanita’s Tortilla Soup. Spillover favorites making the transition include Snapper Scraps, Fish Tacos, and the Grouper Reuben as well as oysters, crab cakes, among others. The expanded “Veggie Corner” will include a Black Bean Burger, Vegan Jambalaya, and a Vegan Crab Cake Sandwich. Changes will also be found in the restaurant’s bar program. In keeping with Kush’s well-earned rep as a beer lover’s paradise, the beer menu will be expanded, resplendent with locally-brewed and hard-to-find craft selections. This includes the third in the proprietary Kaptain Kush Series called Dime Piece, a blonde ale made by Unbranded in Hialeah. Anyone who knows about the bar programs Kuscher creates knows that the “wow factor” is a founding principle; this will be no different at Kush Coconut Grove. The Peanut Butter Old Fashioned(bourbon, Screwball whiskey, grape jam) will be served in a Smucker’s jar andPurple Drank(Fords gin, Giffard Crème de Violette) in a CapriSun bag. Most notable,120K, a drink created “to honor” the now-infamous banana-taped-to-a-wall art installation from Art Basel Miami Beach 2019. Kush Coconut Grove will be as much a feast for the eyes as the palate. All Kush Hospitality concepts are painstakingly designed and dressed by Kuscher himself, with no detail left unattended. Most offer a cornucopia of pop culture references as well as hidden Easter eggs begging for discovery, many from his personal collection of memorabilia, knickknacks, and tchotchkes. The newly-designed Kush Coconut Grove will feature a number of new art pieces, many composed of reclaimed wood, echoing the original Kush’s look in Wynwood. Kaptain Kush will be on-hand in several incarnations, from an official security guard (mannequin) ensuring everyone adheres to safe distance practices to a renovated, vintage Zoltar machine that will disperse custom fortunes, wisdom, and scorn in equal amounts. In keeping with its original seafaring concept, the bar at Spillover consisted of hundreds of Old Bay cans. Now, a more pop culture sentiment is at play with a bar made up of more than two hundred VHS cassettes. A new mural–Miami vs. Everyone by Camilo Rojas–has popped up on the dining room wall and the Florida room, the restaurant’s lounge, is staying put but expanding to include a beer-only package store. Order Now View Dining Menu View Brunch Menu Book A Table Book Now Kush Coconut Grove There has been no shortage of change in the South Florida food scene these past several months. Trying times for all and challenges aplenty; with them, opportunities as well. And with the temporary closure of his sea-centric Spillover restaurant in Coconut Grove and an eventual reopening planned, owner/operator Matthew Kuscher (the “Kush” in Kush Hospitality) saw just that: an opportunity to revamp the restaurant and bring his eponymous, and wildly successful, Kush concept to Coconut Grove. “Spillover had an amazing run and certainly had its fans,” Kuscher noted.“But looking at how the market is changing and what customers want in these crazy, stressful times it was evident to me that the spirit of Kush–fun, casual, not taking itself seriously–was what was needed now. The ‘time off’ afforded us the chance to work on everything, from the menu to bar program and even décor. I’m excited for fans to see it and happy that we have something positive to look forward to. We all need that.”Kush Coconut Grove also referred to as Kush by Spillover, will open to the public on Wednesday, June 17, 2020. And like its sibling concepts–Stephen’s Delicatessen and Kush Wynwood, among others–it will maintain all occupancy and social distancing protocols. And in addition to safety and service, Kuscher promises an exciting new experience for both Spillover fans and newcomers. “Anyone who knows me knows I don’t do things in half measures,” Kuscher says, inarguably a truism for a man who doubles as the costumed Kaptain Kush, self-proclaimed Miami superhero and protector of all that makes Miami great and special.“This is far more than a new name and some menu items. It truly is a rebirth of the space and the concept. First, the menu, which overflows with options and reads like a greatest-hits from both Spillover and Kush with new temptations in the mix. Kush favorites now on offer in Coconut Grove run the gamut, from must-have burgers and sandwiches such as the famous Farm-Style Chicken Sandwich andHobo Frito Pie. New to the mix, Fish & Chips, Spicy Chicken Sandwich, Chili Burger, and Juanita’s Tortilla Soup. Spillover favorites making the transition include Snapper Scraps, Fish Tacos, and the Grouper Reuben as well as oysters, crab cakes, among others. The expanded “Veggie Corner” will include a Black Bean Burger, Vegan Jambalaya, and a Vegan Crab Cake Sandwich. Changes will also be found in the restaurant’s bar program. In keeping with Kush’s well-earned rep as a beer lover’s paradise, the beer menu will be expanded, resplendent with locally-brewed and hard-to-find craft selections. This includes the third in the proprietary Kaptain Kush Series called Dime Piece, a blonde ale made by Unbranded in Hialeah. Anyone who knows about the bar programs Kuscher creates knows that the “wow factor” is a founding principle; this will be no different at Kush Coconut Grove. The Peanut Butter Old Fashioned(bourbon, Screwball whiskey, grape jam) will be served in a Smucker’s jar andPurple Drank(Fords gin, Giffard Crème de Violette) in a CapriSun bag. Most notable,120K, a drink created “to honor” the now-infamous banana-taped-to-a-wall art installation from Art Basel Miami Beach 2019. Kush Coconut Grove will be as much a feast for the eyes as the palate. All Kush Hospitality concepts are painstakingly designed and dressed by Kuscher himself, with no detail left unattended. Most offer a cornucopia of pop culture references as well as hidden Easter eggs begging for discovery, many from his personal collection of memorabilia, knickknacks, and tchotchkes. The newly-designed Kush Coconut Grove will feature a number of new art pieces, many composed of reclaimed wood, echoing the original Kush’s look in Wynwood. Kaptain Kush will be on-hand in several incarnations, from an official security guard (mannequin) ensuring everyone adheres to safe distance practices to a renovated, vintage Zoltar machine that will disperse custom fortunes, wisdom, and scorn in equal amounts. In keeping with its original seafaring concept, the bar at Spillover consisted of hundreds of Old Bay cans. Now, a more pop culture sentiment is at play with a bar made up of more than two hundred VHS cassettes. A new mural–Miami vs. Everyone by Camilo Rojas–has popped up on the dining room wall and the Florida room, the restaurant’s lounge, is staying put but expanding to include a beer-only package store. Order Now View Dining Menu View Brunch Menu Book A Table Book Now Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Gallery St. Patrick's Day at Tobacco Road by Kush is the place to be when celebrating in Miami! Enjoy green beer, drink specials, live bands, and a night of frivolity celebrating our one-year anniversary. 0 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41NkI0NEY2RDEwNTU3Q0M2 Kush Tobacco Road St. Patricks Day 2021 March 14, 2022 5:07 pm Hospitality titans come together one day a year to celebrate the industry and compete in what we coined the \" Chancleta Olympics\" sponsored by Jim Beam. For those wondering, a 'chancleta' is the Cuban colloquial term for a flip flop. Hospitality teams perform rigorously to beat out their local competition in events like the chancleta toss for distance and accuracy, bobbing for chancletas, and relay race. The winning team in 2021 was none other than Finka Table and Tap representing West Kendall. Who will win the 2022 games remains to be seen, but it's a spectacle you won't want to miss. Follow us TikTok and Instagram @kushhospitality to stay tuned for all our upcoming events. 2 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4yODlGNEE0NkRGMEEzMEQy Pata Sucia Palooza 2021 Hosted by Kush Hospitality March 16, 2022 7:50 pm On the night before Noche Buena, La Cocina in Hialeah throws an annual Noche Noche Buena party and charity event! It’s a night of frivolity and holiday spirit that will spill over into your family’s Noche Buena party and set the tone for your holiday weekend. This festivity is brought to you by Kush Hospitality. The event takes place on December 23rd every year. Follow us on Instagram & TikTok @kushhospitality and get to know our hyper-Miami hospitality group. 0 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wMTcyMDhGQUE4NTIzM0Y5 Noche Noche Buena at La Cocina Cocteleria in Hialeah, Florida March 8, 2022 7:31 pm On November 25th, 2020, we commemorated the anniversary of Fidel Castro's last day on earth con tremenda pachanga at La Cocina Coctelería in Hialeah, Florida. This is event is to honor the Cuban struggle against communism and recognize that the world is a better place without Fidel! It's a night of drinking, dancing, and celebrating freedom. 3 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci41MjE1MkI0OTQ2QzJGNzNG La Cocina in Hialeah, Florida Presents: F*ck Fidel Day January 6, 2021 4:18 pm The made for locals Hialeah-themed bar opens inside Florida’s oldest deli: Stephen’s in The Leah Arts District HIALEAH, FL (August 23, 2019) – The people behind LoKal, Kush, The Spillover, Vicky’s House, and now Kush by Stephens are doing it yet again! As they continue the legacy of reopening Florida’s oldest deli, Matt “Kush” Kuscher of Kush Hospitality Group pays tribute to Hialeah’s roots by connecting the institution to Hialeah’s first cocktail bar, La Cocina Coctelería, paying homage to the city, its deep history, and culture. 5 0 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4wOTA3OTZBNzVEMTUzOTMy La Cocina Coctelería—Hialeah's First Proper Cocktail Bar! December 4, 2020 8:01 pm Stephens Delicatessen in Hialeah Florida was taken over by Kush Hospitality Group in 2019 and revamped this classic NY-Style Deli into a new-classic haven offering something for every foodie and classic deli fan alike. 9 1 YouTube Video UExXZUY2LW1VMHJTZU5mUmZTZXRpLVVEak1ETmkwNHRrci4xMkVGQjNCMUM1N0RFNEUx Kush Hospitality Takes Over Iconic Stephens Delicatessen in Hialeah Florida December 4, 2020 7:58 pm Subscribe View Gallery Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press Press Press inquires for Kush Hospitality can be directed to Brustman Carrino Public Relations by sending an email View All Press contact us ADDRESS & PHONE 2911 Grand Ave., Suite 400Miami, Florida 33133 305-456-5723 HOURS Monday, Tuesday & Wednesday: 11:30am-10pm Thursday & Friday: 11:30am-11pm Saturday & Sunday:10:00am-10pm Contact Information ADDRESS & PHONE 2911 Grand Ave., Suite 400 Miami, Florida 33133 305-456-5723 HOURS Monday, Tuesday & Wednesday: 11:30am-10pm Thursday & Friday: 11:30am-11pm Saturday & Sunday:10:00am-10pm Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    },
    {
      "url": "https://www.brickellbuickgmc.com/contact.htm",
      "text": "Contact Us | Auto Dealership and Maintenance Center in Miami Skip to main content 665 SW 8TH ST Directions Miami , FL 33130 Contact : (877) 844-1641 Service : (786) 245-4932 Parts : (855) 662-8985 Home New Inventory Shop New Inventory Shop New Inventory New Vehicle Specials HUMMER EV vs Cybertruck Auto Loan Savings Program Sierra EV vs Cybertruck Value Your Trade Shop By Make New Buick New GMC Shop Popular Models Sierra EV Sierra 1500 Enclave Encore GX Pre-Owned Inventory All Pre-Owned Models Shop Pre-Owned Buick Shop Pre-Owned GMC Shopping Tools Finance and Trade Apply For Financing Value Your Trade Get An Offer On Your Car Specials & Incentives New Vehicle Specials Manufacturer Offers Service & Parts Specials Pre-Owned Specials Trade/Sell Service Service Schedule Service Service Specials Service Hours Parts Parts Order Parts Online GM Accessories Tire Finder Parts Warranty Information New Tires Parts Hours About Us Our Dealership Hours & Directions Meet Our Staff Careers Why Buy With Brickell GMC Contact Us Showroom Hours The Price You See Is the Price You Pay For Pre-Owned Inventory — No Hidden Fees. Period | Shop Now Contact Us Get in Touch with Brickell Buick & GMC in MIAMI Get in touch with Brickell Buick & GMC. Use this form to inquire about a test drive, or ask any questions about our inventory. If you are curious about a specific model or trim style, you can use this form to find out if we have it, or if we can order it to be brought to the store for your convenience. We are available to answer your questions about financing, leasing and specials options here. Just shoot us a quick note and we will get back to you as soon as we can. We are also reachable at (786) 245-4889 during our regular business hours. We are also open to your feedback! You can use this form to reach us about the content on our site or your experience in the store. We look forward to serving you. * Indicates a required field First Name * Last Name * Contact Me by * Email Phone Email Phone Comments Submit By submitting your information, you consent to share your details with our dealership and receive emails from our team and representatives. You agree to receive calls and texts (including automated messages) if you provide your phone number. You may opt-out at any time. Consent is not a condition of purchase, and message/data rates may apply. You also agree to our Terms and Privacy Policy outlining how your data is used. Related Links About Directions Contact Contact 665 SW 8TH ST Directions Miami , FL 33130 Contact : (877) 844-1641 Hours Monday 9:00 am - 9:00 pm Tuesday 9:00 am - 9:00 pm Wednesday 9:00 am - 9:00 pm Thursday 9:00 am - 9:00 pm Friday 9:00 am - 8:00 pm Saturday 9:00 am - 8:00 pm Sunday 11:00 am - 7:00 pm Share Facebook Twitter Website by Dealer.com Contact About Privacy Sitemap Accessibility ;\n;"
    },
    {
      "url": "https://kushhospitality.com/locations/lokal/team/",
      "text": "Lokal Miami Restaurant Team | Kush Hospitality Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Gift Cards ORDER NOW Kush Shop Gift Cards Kush Shop Gift Cards Home Our Locations Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus Lokal Kush Wynwood Victoria’s Kush Coconut Grove Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road Main Dining Menu Happy Hour Late Night Menu Events Event Calendar Gallery Catering Host An Event About Our Story Kush Fam Hospitality Consulting Media YouTube Channel Press Kush Times Newsletter Now Hiring Contact Kush Shop Gift Cards Kush Shop Gift Cards meet our team ▸ Matt + Priscilla Kuscher | Owners Matthew Kuscher, also known as \"Kush\", is the owner of LoKal, Kush, Vicky's House, Stephen’s Delicatessen, La Cocina, and Kush by Spillover. LoKal was his first venture on his own, but he's been in the restaurant business since he was a young boy. Kush is a 3rd generation restaurateur—his father successfully owned several cafeterias and a Dunkin' Donuts shop for decades in Washington D.C. His grandfather owned restaurants and bars from the 50s through the 80s in New York and Broward County. After fifteen years of living the corporate life, he hung up his suit and tie and traded it for a T-shirt, jeans, and a life long dream of doing what he loves most—creating restaurant concepts. He is extremely passionate about buying local, and making sure his ingredients and products are top quality. To accomplish this, he visits all his purveyors' businesses to ensure they are aligned with his values. Kush has visited and inspected several farms, such as Fort McCoy Ranch in Marion County, FL and is a proud supporter of grass-fed and free range farming. Other local partners he gushes about are Clewiston Farms in Clewiston, Florida (home of fresh Florida alligators for LoKal's famous Alligator Strips), and all the local breweries—they were some of the first to be part of Matt's vision. From the inception of his brainchild LoKal, sustainability was at the top of his list of priorities. This is evident in the upcycled decor and art murals which provide seating and visual aesthetics as well as waste management and recycling services provided to his establishments. Born and raised in Washington D.C. to a Jewish father and Puerto Rican mother, Kush received his Bachelor's in Hospitality from Florida International University in 2000, and earned his chops while working for two industry leaders—Levy Restaurant Group and Hillstone Restaurant Group—but a lifetime of education imparted by his father has truly molded his success. His spent eleven years working at a number of east coast Houston's locations until finally landing in the Miami location.  Kush's philosophy is simple: \"Give guests the freshest and best quality ingredients in a cool, clean environment; and always make them leave happier than when they arrived. Kush married his long time darling Priscilla—a well-versed foodie and adventure junkie. Together, they take on the Miami food scene with a unique sense of family and grassroots conviction. Priscilla keeps him grounded in many ways and is an integral part of LoKal's day-to-day activities. She studied nutrition and dietetics at FIU and is a big believer in the old adage, \"You are what you eat.\" Eager to show Miami that eating well and living well can happen symbiotically— she looks forward to welcoming every guest into LoKal just as she would if it were her home. They are driven to spread the message of nutritious dining, active lifestyle and balanced living along with their daughter, Mila, and fur-babies, Yeyo and Chichi—two of the most adorable French bulldogs the world has ever seen. ▸ Zuni Melendez | Director Of Operations Born in San Francisco, CA raised in Miami, FL, this little spitfire started working as a hostess at LoKal when she was 17 years old. She found herself craving more responsibility, and saw herself growing with the company's expanding opportunities. She has since been groomed in every position, both in the kitchen and front of the house. Her ambitious nature, creativity, and tenacity landed her titles such as the General Manager at KUSH in Wynwood, and most recently, Director of Operations for the company. Zuni is truly remarkable in her ability to lead, and sets the highest of standards for herself and her staff. Outside the restaurant she's a lover of craft beer, fishing, and a perfect pair of shoes. Send Zuni An Email ▸ Amanda Edwards | Beverage Manager Largo Florida native, Amanda Edwards graduated with a B.S in Fine Arts in 2014 from New World School of the Arts. Since her involvement & passion in the craft beer community in 2015, she has landed a home with Kush Hospitality as the Beverage Director or should we say \"Craft Beer Guru\" at LoKal & Vicky's Beer Store. When she's not running Coconut Grove’s first beer store, she's sipping at breweries, jamming to old school tunes and imprinting her green thumb into upcycled beer cans. Send Amanda An Email ▸ Spider Harris | Executive Chef Spider has been cooking up a storm at LoKal since day one. Originally from food haven New Orleans, raised in California, and with ample time spent in Georgetown, Spider brings us his 40 years of corporate kitchen experience. His diverse flavors and laidback vibe are both very well represented in his dishes. Like him, his food isn’t over complicated, but focuses on simplicity and bold flavors to take you on a culinary journey. Spider is seasoned to perfection just like his reciepes and menus. Send Spider An Email ▸ Erika Guardiola | Shift Leader Born and raised in the '305', this Cuban-American’s sweet exterior epitomizes the “tip of the iceberg” ideology. She is unquestionably equal parts genuine, kind, light-hearted, and fun, but don’t let that fool you into overlooking her undeniable hustle and focus. This girl has some serious goals and has every intention of smashing them! Erika gives every guest that walks through our doors the best experience possible. Outside our doors, she loves spending quality time with her adorable Blue Heeler pup, Gypsy, and her family. Send Erika An Email ▸ Dave Swain | Kitchen Manager Dave has been with Kush Hospitality since 2009, where he started humbly as a dishwasher. Very quickly, he worked his way through every position in the kitchen. His talent and work ethic earned him his current title as Lokal’s Kitchen Manager. Dave has always had a passion for cooking from scratch. This combined with his creativity and detail-oriented nature creates the perfect storm for incredibly delicious cooking. In his spare time, Dave spends every minute he can with his children making memories and watching them grow. Send Dave An Email meet our team ▸ Matt + Priscilla Kuscher | Owners Matthew Kuscher, also known as \"Kush\", is the owner of LoKal, Kush, Vicky's House, Stephen’s Delicatessen, La Cocina, and Kush by Spillover. LoKal was his first venture on his own, but he's been in the restaurant business since he was a young boy. Kush is a 3rd generation restaurateur—his father successfully owned several cafeterias and a Dunkin' Donuts shop for decades in Washington D.C. His grandfather owned restaurants and bars from the 50s through the 80s in New York and Broward County. After fifteen years of living the corporate life, he hung up his suit and tie and traded it for a T-shirt, jeans, and a life long dream of doing what he loves most—creating restaurant concepts. He is extremely passionate about buying local, and making sure his ingredients and products are top quality. To accomplish this, he visits all his purveyors' businesses to ensure they are aligned with his values. Kush has visited and inspected several farms, such as Fort McCoy Ranch in Marion County, FL and is a proud supporter of grass-fed and free range farming. Other local partners he gushes about are Clewiston Farms in Clewiston, Florida (home of fresh Florida alligators for LoKal's famous Alligator Strips), and all the local breweries—they were some of the first to be part of Matt's vision. From the inception of his brainchild LoKal, sustainability was at the top of his list of priorities. This is evident in the upcycled decor and art murals which provide seating and visual aesthetics as well as waste management and recycling services provided to his establishments. Born and raised in Washington D.C. to a Jewish father and Puerto Rican mother, Kush received his Bachelor's in Hospitality from Florida International University in 2000, and earned his chops while working for two industry leaders—Levy Restaurant Group and Hillstone Restaurant Group—but a lifetime of education imparted by his father has truly molded his success. His spent eleven years working at a number of east coast Houston's locations until finally landing in the Miami location.  Kush's philosophy is simple: \"Give guests the freshest and best quality ingredients in a cool, clean environment; and always make them leave happier than when they arrived. Kush married his long time darling Priscilla—a well-versed foodie and adventure junkie. Together, they take on the Miami food scene with a unique sense of family and grassroots conviction. Priscilla keeps him grounded in many ways and is an integral part of LoKal's day-to-day activities. She studied nutrition and dietetics at FIU and is a big believer in the old adage, \"You are what you eat.\" Eager to show Miami that eating well and living well can happen symbiotically— she looks forward to welcoming every guest into LoKal just as she would if it were her home. They are driven to spread the message of nutritious dining, active lifestyle and balanced living along with their daughter, Mila, and fur-babies, Yeyo and Chichi—two of the most adorable French bulldogs the world has ever seen. ▸ Zuni Melendez | Director Of Operations Born in San Francisco, CA raised in Miami, FL, this little spitfire started working as a hostess at LoKal when she was 17 years old. She found herself craving more responsibility, and saw herself growing with the company's expanding opportunities. She has since been groomed in every position, both in the kitchen and front of the house. Her ambitious nature, creativity, and tenacity landed her titles such as the General Manager at KUSH in Wynwood, and most recently, Director of Operations for the company. Zuni is truly remarkable in her ability to lead, and sets the highest of standards for herself and her staff. Outside the restaurant she's a lover of craft beer, fishing, and a perfect pair of shoes. Send Zuni An Email ▸ Amanda Edwards | Beverage Manager Largo Florida native, Amanda Edwards graduated with a B.S in Fine Arts in 2014 from New World School of the Arts. Since her involvement & passion in the craft beer community in 2015, she has landed a home with Kush Hospitality as the Beverage Director or should we say \"Craft Beer Guru\" at LoKal & Vicky's Beer Store. When she's not running Coconut Grove’s first beer store, she's sipping at breweries, jamming to old school tunes and imprinting her green thumb into upcycled beer cans. Send Amanda An Email ▸ Spider Harris | Executive Chef Spider has been cooking up a storm at LoKal since day one. Originally from food haven New Orleans, raised in California, and with ample time spent in Georgetown, Spider brings us his 40 years of corporate kitchen experience. His diverse flavors and laidback vibe are both very well represented in his dishes. Like him, his food isn’t over complicated, but focuses on simplicity and bold flavors to take you on a culinary journey. Spider is seasoned to perfection just like his reciepes and menus. Send Spider An Email ▸ Erika Guardiola | Shift Leader Born and raised in the '305', this Cuban-American’s sweet exterior epitomizes the “tip of the iceberg” ideology. She is unquestionably equal parts genuine, kind, light-hearted, and fun, but don’t let that fool you into overlooking her undeniable hustle and focus. This girl has some serious goals and has every intention of smashing them! Erika gives every guest that walks through our doors the best experience possible. Outside our doors, she loves spending quality time with her adorable Blue Heeler pup, Gypsy, and her family. Send Erika An Email ▸ Dave Swain | Kitchen Manager Dave has been with Kush Hospitality since 2009, where he started humbly as a dishwasher. Very quickly, he worked his way through every position in the kitchen. His talent and work ethic earned him his current title as Lokal’s Kitchen Manager. Dave has always had a passion for cooking from scratch. This combined with his creativity and detail-oriented nature creates the perfect storm for incredibly delicious cooking. In his spare time, Dave spends every minute he can with his children making memories and watching them grow. Send Dave An Email Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Kush Hospitality is food service certified by Ken Kuscher Click here for more Information © Kush Hospitality 2023 | All Rights Reserved Web Design by District Maven Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact Home Our Locations ← Back Lokal Victoria’s Kush Wynwood Kush Coconut Grove Kush Hialeah La Cocina Kush Clevelander Kush Brickell Menus ← Back Lokal Kush Wynwood Victoria’s Kush Coconut Grove ← Back Main Dining Menu Brunch Menu Kush Hialeah La Cocina Kush Clevelander Tobacco Road ← Back Main Dining Menu Happy Hour Late Night Menu Events ← Back Event Calendar Gallery Catering Host An Event About ← Back Our Story Kush Fam Hospitality Consulting Media ← Back YouTube Channel Press Kush Times Newsletter Now Hiring Contact SUBSCRIBE TO OUR NEWSLETTER & STAY UPDATED WITH OUR LATEST NEWS Don’t worry, we’re not spammy. Email * Phone Submit By clicking “submit” I agree to receive news, promotions, information and offers from Kush Hospitality."
    }
  ]
}