{
  "fuentes": [
    {
      "url": "https://www.golfify.io/courses/lago-mar-country-club",
      "email": "anthony@lagomarcc.com"
    },
    {
      "url": "https://lagomar.com/new-food-and-beverage-director/",
      "email": "reservations@lagomar.com"
    },
    {
      "url": "https://www.fsga.org/Tournament/Details/ad2d6ff7-5244-4d0b-94e4-61b1ad7ce3f3",
      "email": "onedays@fsga.org"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "berna.marketing@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "daisy.raquel@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "golf@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "info@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "mohammad.rashed@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "raymond.sandoval@acci.com.ph"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "ashley@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "brandon@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "contact@bigskyeconomicdevelopment.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "deanna@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "dianne@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "heatherk@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "jrigby@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "katelyn@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "keith@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "lorene@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "lynnette@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "marcell@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "nik@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "nina@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "paul@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "reann@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "richard@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "tami@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "tereza@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "thom@bigskyeda.org"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "email": "tylerw@bigskyeda.org"
    },
    {
      "url": "https://bluetoad.com/article/New+ownership+has+energized+Lago+Mar+Country+Club.+We+think+this+is+going+to+be+the+jewel+of+South+Florida./3728066/668042/article.html",
      "email": "ellen@lagomarcc.com"
    },
    {
      "url": "https://bluetoad.com/article/New+ownership+has+energized+Lago+Mar+Country+Club.+We+think+this+is+going+to+be+the+jewel+of+South+Florida./3728066/668042/article.html",
      "email": "nsportscom5@aol.com"
    },
    {
      "url": "https://bluetoad.com/article/New+ownership+has+energized+Lago+Mar+Country+Club.+We+think+this+is+going+to+be+the+jewel+of+South+Florida./3728066/668042/article.html",
      "email": "sportscom5@aol.com"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://lagomar.com/",
      "email": "reservations@lagomar.com"
    },
    {
      "url": "https://lagomar.com/about/contact/",
      "email": "reservations@lagomar.com"
    },
    {
      "url": "https://lagomar.com/about/our-story/",
      "email": "reservations@lagomar.com"
    }
  ],
  "mails": [
    "anthony@lagomarcc.com",
    "ashley@bigskyeda.org",
    "berna.marketing@acci.com.ph",
    "brandon@bigskyeda.org",
    "contact@bigskyeconomicdevelopment.org",
    "contact@clubcarwash.com",
    "daisy.raquel@acci.com.ph",
    "deanna@bigskyeda.org",
    "dianne@bigskyeda.org",
    "ellen@lagomarcc.com",
    "golf@acci.com.ph",
    "heatherk@bigskyeda.org",
    "info@acci.com.ph",
    "jrigby@bigskyeda.org",
    "katelyn@bigskyeda.org",
    "keith@bigskyeda.org",
    "lorene@bigskyeda.org",
    "lynnette@bigskyeda.org",
    "marcell@bigskyeda.org",
    "mohammad.rashed@acci.com.ph",
    "nik@bigskyeda.org",
    "nina@bigskyeda.org",
    "nsportscom5@aol.com",
    "onedays@fsga.org",
    "paul@bigskyeda.org",
    "raymond.sandoval@acci.com.ph",
    "reann@bigskyeda.org",
    "reservations@lagomar.com",
    "richard@bigskyeda.org",
    "sportscom5@aol.com",
    "tami@bigskyeda.org",
    "tereza@bigskyeda.org",
    "thom@bigskyeda.org",
    "tylerw@bigskyeda.org"
  ],
  "nombre_sitio": "lagomarcc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.golfify.io/courses/lago-mar-country-club",
      "text": "Lago Mar Country Club, Florida - Full Scorecard and Ratings GOLFIFY Courses Pricing Knowledge Base Blog Log In Playing Lago Mar Country Club soon? Experience it like the pros, try our realtime leaderboards free today. Lago Mar Country Club 500 NW 127th Avenue Plantation Florida, United States of America +1 (954) 472-7044 anthony@lagomarcc.com Lago Mar Designer / Architect: Bill Watts Type by: Parkland Opened: 1972 Guest Policy: Closed Course & Slope Ratings Color Tee Course Rating Slope Rating Distance 1 74.1 139 7053 2 71.9 136 6590 Member 71.2 134 6436 3 69.8 129 6142 4 68.1 126 5803 4 (L) 73.7 129 5803 Member 71.5 127 5444 5 70 124 5179 Full Scorecard Hole 1 2 Member 3 4 SI Par 4 (L) Member 5 SI Par 1 410 375 375 368 334 5 4 334 334 304 9 4 2 383 355 355 288 277 9 4 277 277 254 11 4 3 462 443 443 388 378 1 4 378 348 348 1 4 4 568 530 503 503 485 15 5 485 450 450 3 5 5 135 129 129 117 108 17 3 108 108 92 17 3 6 359 344 344 316 305 11 4 305 277 277 7 4 7 551 512 512 463 453 13 5 453 453 380 13 5 8 187 178 178 164 152 7 3 152 130 130 15 3 9 459 433 371 371 353 3 4 353 321 321 5 4 OUT 3514 3299 3210 2978 2845 36 2845 2698 2556 36 10 544 520 508 508 478 14 5 478 443 443 4 5 11 440 410 386 386 353 8 4 353 291 291 16 4 12 451 409 380 380 352 6 4 352 343 343 6 4 13 529 509 509 498 482 16 5 482 482 422 14 5 14 211 176 176 163 146 12 3 146 146 135 8 3 15 373 350 350 343 336 4 4 336 336 301 2 4 16 408 368 368 354 319 18 4 319 319 302 12 4 17 169 161 161 151 137 10 3 137 98 98 18 3 18 414 388 388 381 355 2 4 355 288 288 10 4 IN 3539 3291 3226 3164 2958 36 2958 2746 2623 36 Total 7053 6590 6436 6142 5803 72 5803 5444 5179 72 Download the Golfify app to score your round with live leaderboards and update tee information instantly, or send us an email at support@golfify.io . We will be happy to help! Lightning Fast Live Scoring, Leaderboards and More. Get Started for Free. Good to Know Privacy Terms of Use Deleting Your Account Resources Bulk Upload Template Blog Contact Us support@golfify.io Golfify Ltd © 2024"
    },
    {
      "url": "https://lagomar.com/new-food-and-beverage-director/",
      "text": "Meet Our New Food & Beverage Director - Official Site of Lago Mar Beach Resort & Club : Official Site of Lago Mar Beach Resort & Club 1700 South Ocean Lane, Fort Lauderdale, FL 33316 • 954.523.6511 • reservations@lagomar.com Lago Mar Logo - returns to home page Reservations Stay Gallery Specials Play Activities The Resort Shop The Spa Local Events Dine Events Meetings Meeting RFP Meeting and Conference Facilities About Blog Our Story Property Map Contact Careers Getting Here Members × Stay Gallery Play Dine Meetings Blog Our Story Members Meet Our New Food & Beverage Director May 29, 2019 6:48 pm Hi! I hope everyone had a great Memorial Day Weekend! We sure did here at Lago Mar! The weather was perfect, which attracted many of our local club members and, of course, the resort was sold out! The Promenade Bar was definitely one of our hot spots, catering to our adult guests/members celebrating the three day weekend. All ages enjoyed listening to Craig Fitch play on the Lagoon Island Saturday evening and then our steel drummer on Sunday. Our food and beverage outlets were so busy that we actually hit record numbers! Speaking of, I want to introduce our new Food and Beverage Director, Joe Nesselt, to all of you. Many of you might already know Joe, as he was the GM of Bistro Mezzaluna before he joined us. Fun fact: Joe is a native Floridian. He graduated from St. Thomas Aquinas High School and then attended St. Thomas University, where he studied Hospitality Management. He has experience in both the “back of the house” as well in the front. Back in the late ’80s, Joe managed Chuck’s Steak House and then went on to manage Macaroni Grill, where he was responsible for opening several Macaroni Grill’s around the state. We are so excited to welcome Joe to the Lago Mar Family and look forward to his new ideas coming to fruition in our different F&B outlets. Some of you already might have seen me post about our new wine glasses at the Promenade Bar. I am sure many of you appreciated the fun drink/food specials we ran for St. Patrick’s Day and Mother’s Day. Those are just a few examples of Joe’s new additions. When I asked Joe what is his favorite part of the Hospitality Business, he answered: “Every day is different!”. As I have spent my whole life in this business I can definitely attest to that. Fortunately for us, we have an amazing staff and wonderful, loyal members/guests so most days are happy! Can’t wait to find out what specials Joe has planned for all of the dads who choose to spend Father’s Day with us! Hope to see you soon! Deb Categorised in: Eats | Events ← Prev Next → Categories All Amenities Eats Events Family Recreation Shopping Spa & Beauty Get Exclusive Offers & News › Connect With Us #MyLagoMar Our Story Reservations Amenities Gallery Blog Members Property Map Contact Us 1700 South Ocean Lane, Fort Lauderdale, FL 33316 855.209.5677 • 954.523.6511 • reservations@lagomar.com Copyright ©2025 Lago Mar Beach Resort & Club All rights reserved. Lago Mar Website Accessibility Statement Privacy Policy Sitemap Open toolbar Accessibility Tools Accessibility Tools Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.fsga.org/Tournament/Details/ad2d6ff7-5244-4d0b-94e4-61b1ad7ce3f3",
      "text": "Lago Mar CC - FSGA Processing your payment, please wait. Create an Account Post A Score Store About Us Log in Search X TOURNAMENTS TOURNAMENTS Men's Championships Home Schedule Tee Times & Info Results Policies Rankings Players of the Year Past Results Men's Interclub SW Series Women's Championships Home Schedule Tee Times & Info Results Policies Rankings Players of the Year Past Results One-Days Women's Interclub The LinkUp USGA Qualifying Home Schedule Tee Times & Info Results FAQs Enter One-Day Events Home Schedule Tee Times & Info Results Rankings About Southwest Amateur Series Armed Forces Appreciation Hickory Golf Member Travel Juniors - FJT Home Schedule Tee Times & Info Results Path to College Golf Policies Rankings Players of the Year Past Results Records About Youth on Course Winter Series Home Schedule Tee Times & Info Results Player Rankings Points Champions About - Men About - Women Quick Links: All Tournaments Withdraw All Tee Times MEMBERSHIP My Account Join the FSGA Buy/Renew a Handicap Online About the FSGA Member Benefits FSGA Club Membership HANDICAPS Buy/Renew a Handicap Online Post a Score Course Handicap Calculator World Handicap System™ FAQ's 2024 World Handicap System™ Hub 2024 Rules of Handicapping Manual Handicapping & The Rules of Golf Handicap Committee Guide Stroke Index Allocation 2025 WHS Seminar Slides Four Ball Match Play off the Low (2024) Handicap Review Tool - Phase 2 CLUBS Search Clubs Course Rating & Measurement Services FSGA Club Membership Remote Access Support JUNIORS Florida Junior Tour 9-12 Division Player Grants College Scholarships Find a Junior Program High School Golf Junior Golf Links Junior Coordinator Resources College Golf Team Florida Youth on Course VOLUNTEER Volunteer Central Want to Volunteer? Committee Assignments Rules Officials Certified Rules Officials Rules Training and Certification USGA Rules Certification Test Rules of Golf Archived Stories Fall Volunteer Appreciation Days Course Raters Board of Directors Volunteers of the Year Volunteer Policies SEMINARS Introduction to Volunteering Fall Volunteer Appreciation Days USGA Rules Certification Test Rules of Golf Workshops Rules & Officiating Workshops Rules of Golf Resources World Handicap System™ FOUNDATION Give a Gift Now Planned Giving Future of Golf Foundation College Scholarships Barry Masters Golf Foundation Player Grants Executives & Board Team Florida Past Presidents Hall of Fame Annual Awards One-Day Events MORE + Home Tee Times & Info Full Results Course Info Lago Mar CC Lago Mar Country Club, Plantation, FL September 16, 2024 Tournament Results Under 50 Division 50-59 Division 60-69 Division 70 & Over Division Women's Division Pos Position Name Rd.1 Total Total Score Points 1 Mitchel Perez 69 69 60 2 Mark Bernhardt Jr 71 71 40 3 Daniel Raffo 73 73 25 4 Nicholas Smith 73 73 0 5 Diego Fernandez 74 74 0 Pos Position Name Rd.1 Total Total Score Points 1 Jay Slazinski 70 70 55 2 Michael Reitermayer 75 75 40 3 Michael Hermiller 76 76 20 4 Roberto Schuback 76 76 0 5 Brian Balluff 76 76 0 Pos Position Name Rd.1 Total Total Score Points 1 Bill Byrd 71 71 70 2 Warren Eaton 72 72 60 3 Michel Buhler 73 73 45 4 Joseph Swierczek 74 74 35 5 Walt Taormina 74 74 25 Pos Position Name Rd.1 Total Total Score Points 1 Michael Csoka 73 73 45 2 Gary Keidel 74 74 25 3 Keith Thompson 78 78 0 4 Gus Quiros 78 78 0 5 Larry Brooks 79 79 0 Pos Position Name Rd.1 Total Total Score Points 1 Debra Rosmarin 83 83 10 + View Full Results Tournament Results Hole by Hole Results Starting Time & Entry Fee 8:30 AM shotgun $75 - Includes: Cart, golf, range balls and prizes ($10 per person, from the entry fee, is in the gift certificate pot) Any late entrant that gains acceptance into the field will be subject to a $10 late entry fee Pairings Request - \"Email onedays@fsga.org\" Players can request their own groupings Send an email request for pairings to onedays@fsga.org All pairings requests must be received at least 5 days prior to the event to guarantee your pairing In the email, please specify the event and the players with whom you wish to play All other groupings are made randomly within flights Age Divisions & Approximate Yardages **All players must compete in the age division commensurate with their age as of the event day. No players are allowed to play out of their age division ** Men's Under 50 Age Division - 6,300 - 6,500 yards (Gross & Net) Men's 50-59 Age Division - 6,000 yards - 6,200 yards (Gross & Net) Men's 60-69 Age Division - 5,600 - 5,800 yards (Gross & Net) Men's 70 & Over Age Division - 5,600 - 5,800 yards (Gross & Net) Women's Division - 4,900 yards - 5,100 yards (Gross & Net) Men's Format 18 holes of net and gross stroke play within flights Each player will use their playing handicap for the day (95%) Handicap Indexes will be taken from the close of entry date Payout will be NET, then Gross. Payouts will vary based on division size. Points will be awarded based on Net scores only. Maximum score of 10 per hole is in effect Local Rule: E-5 Alternative to Stroke & Distance for Lost Ball or Ball Out of Bounds is in effect Women's Format 18 holes of net and gross stroke play Each player will use their playing handicap for the day (95%) Handicap Indexes will be taken from the close of entry date Payout will be NET, then Gross. Payouts will vary based on division size. Points will be awarded based on Net scores only. Maximum score of 10 per hole is in effect Local Rule: E-5 Alternative to Stroke & Distance for Lost Ball or Ball Out of Bounds is in effect Eligibility Men and Women amateur golfers (18 years of age or older) FSGA/GHIN handicap required for ALL players (24.0 or less for men and 34.0 or less for women) Golfers who do not have a FSGA/GHIN handicap index from a FSGA member club may purchase a handicap online at fsga.org . Live Scoring Requirements For all One-Day events, live scoring will be required through the Golf Genius mobile app. Only one person per group will need to type in the gross scores for each player, and more communication will be sent to the field a few days prior to the event. For convenience purposes, please download the Golf Genius mobile app before arriving to the course. Click here for further information regarding the One-Day events One-Day Event Information About Page Hard Card Pace of Play Code of Conduct Point Standings Host Site Lago Mar Country Club Click Here for Directions Preserving & Protecting the Game Since 1913 TOURNAMENTS MEMBERSHIP HANDICAPS CLUBS VOLUNTEER SEMINARS FOUNDATION ABOUT US Copyright © 2025 Florida State Golf Association. All rights reserved. Powered by nopCommerce"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "text": "Contact Us - Alabang Country Club, Inc. Skip to content Menu Facebook-f Instagram Search Contact Us Home Contact Us GET IN TOUCH For inquiries, please feel free to send us a message or reach us on the contact details provided below. clubhouse OPERATIONS Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph GOLF OPERATIONS Felicita V. Mallari 0998 587 9420 8842-3530 loc 157 golf@acci.com.ph corporate services Daisy C. Raquel 0998 587 9422 8842-3530 loc 176 daisy.raquel@acci.com.ph member relations Berna D. Malolos 0917 568 5764 8842-3530 loc 152 berna.marketing@acci.com.ph DINING & BANQUETS Mohammad Rashed Jr. 0918 239 4898 8842-3530 loc 226 mohammad.rashed@acci.com.ph data privacy officer Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph Contact Form \" * \" indicates required fields Full Name * Email * Contact Number * Subject * Subject * Membership Golf Operations Dining & Banquets Events Message Name This field is for validation purposes and should be left unchanged. ACCI started its operation in 1981 with a Member-base of 1,646. Our primary objective is to provide Members excellent leisure facilities designed for the whole family. Quick Links About Facilities Events Membership Careers Contact Us Contact Us 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines Follow Us Facebook-f Instagram © Copyright 2025 Alabang Country Club. All Rights Reserved. © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines Privacy Policy Facebook-f Instagram Home About Us History of the Club Mission & Vision Board of Directors The Committees Club Management Events Social Activities Monthly Newsletter Golf Course Tour Golf Tournaments Facilities Member Services Sports and Recreation Dining and Banquets Members Corner Contact Us Career"
    },
    {
      "url": "https://bigskyeconomicdevelopment.org/about-bsed/team-board/",
      "text": "Team & Board – Big Sky Economic Development Book Our Space! • Business Assistance • Business Relocation • 406-256-6871 Search… About BSED Mission / Service Team & Board Careers Book Our Space Contact Us Member Investors Business Advising and Lending Overview SBA 504 Loan Other Loan Programs Business Advising Veteran/Military Spouse Business Counseling Government Procurement Rock31 Community Development Community Development Overview Brownfield Program New Business Recruitment Strategic Priorities Resources News The Vault at 201 North Broadway Video Library Impacts Public Notices Public Meeting Notices Board Documents Request for Proposals / Request for Qualifications Reports / Publications Montana Business Assets and Opportunities Calendar / Events contact@bigskyeconomicdevelopment.org Search… Team & Board Team & Board Staff All Admin Business Finance Leadership Team Marketing & BillingsWorks Member Investors MT APEX Accelerator Recruitment/Community Development Rock31 SBDC VBOC Paul Green Executive Director Learn More Paul Green Executive Director 406-869-8401 paul@bigskyeda.org Tami Fleetwood Senior Director of Finance Learn More Tami Fleetwood Senior Director of Finance 406-869-8402 tami@bigskyeda.org Marcell Bruski Senior Director of Engagement Learn More Marcell Bruski Senior Director of Engagement 406-869-8408 marcell@bigskyeda.org Project & Program Management Event Management Workforce Development Marketing/Communication strategies and execution Group Facilitation Podcast Host on The Vault at 201 N Broadway Ashley Kavanagh Senior Director of Recruitment & Community Development Learn More Ashley Kavanagh Senior Director of Recruitment & Community Development 406-869-8420 ashley@bigskyeda.org Brandon Berger Director of Business Finance Learn More Brandon Berger Director of Business Finance 406-869-8403 brandon@bigskyeda.org SBA 504 Lending Program – Commercial Real Estate and Equipment Financing Small Business Lending SBA Policy and Procedures Business Financial Analysis Katelyn Harmon Marketing Manager Learn More Katelyn Harmon Marketing Manager 406-869-8417 katelyn@bigskyeda.org Reann Keller Executive Assistant & Operations Lead Learn More Reann Keller Executive Assistant & Operations Lead 406-869-8400 reann@bigskyeda.org Nik Pedersen Operations Support Specialist Learn More Nik Pedersen Operations Support Specialist 406-869-8411 nik@bigskyeda.org Conference Room Specialist Medium to High Tech Expertise Safety & Emergency Management Handy Man Relationship Builder Laughing & Smiling Connoisseur Heather Kirpach Loan Officer Learn More Heather Kirpach Loan Officer 406-869-8421 heatherk@bigskyeda.org Small Business Financial Statement Expertise Gateway to SBA 504 loans SBA Consultant to Commercial Lending Teams Tyler Wink Business Development Manager Learn More Tyler Wink Business Development Manager 406-896-6305 tylerw@bigskyeda.org Nina Philpott Loan Closing Officer Learn More Nina Philpott Loan Closing Officer 406-869-8406 nina@bigskyeda.org SBA Policies and Procedures expertise SBA Documentation expertise SBA Consultant to Commercial Lending Teams SBA 504 Loan Closing Coordinator and Closer Commercial Loan Documentation Knowledge Deanna Langman Statewide Program Manager Learn More Deanna Langman Statewide Program Manager 406-869-8410 deanna@bigskyeda.org Procurement Business Management Financial and Consulting Expertise Government Contracting Technical Support Customized Market Strategies Tereza Brownell Government Contracting Advisor Learn More Tereza Brownell Government Contracting Advisor 406-869-8413 tereza@bigskyeda.org Government Contracting Technical Support Procurement SAM Registration Consulting Lynnette Engelhardt Government Contracting Advisor Learn More Lynnette Engelhardt Government Contracting Advisor 406-869-8413 lynnette@bigskyeda.org Procurement Processes and Opportunities Government Contracting Technical Support SAM (System for Award Management) Registration Business and Financial management Rick Brown Director - Veteran Business Outreach Center Learn More Rick Brown Director - Veteran Business Outreach Center richard@bigskyeda.org Justin Rigby VBOC Project Manager Learn More Justin Rigby VBOC Project Manager 406-272-3254 ext. 422 jrigby@bigskyeda.org Keith Hart Director of Entrepreneurship-Rock31 Learn More Keith Hart Director of Entrepreneurship-Rock31 406-869-8416 keith@bigskyeda.org Lorene Hintz, ASBC SBDC Regional Director Learn More Lorene Hintz, ASBC SBDC Regional Director 406-254-6014 lorene@bigskyeda.org No Cost One-On-One Consultation Retail Ownership and Management Cash Flow Development Projections Business Resources and Trainings Dianne Lehm Director of Community Development Learn More Dianne Lehm Director of Community Development 406-869-8409 dianne@bigskyeda.org Project Planning & Development Grant Writing and Administration Placemaking Fundraising and Donor Relationships Redevelopment Thom MacLean Senior Project Manager Learn More Thom MacLean Senior Project Manager 406-869-8407 thom@bigskyeda.org Project Administration Research and Data Placemaking Tax Increment Financing Board The Economic Development Authority (EDA) is a quasi-public, TradePort authority, whose board members are appointed by the Yellowstone County Commissioners. The EDA has 11 appointed board members. The Economic Development Corporation (EDC) is a not-for-profit corporation made up of 140-Member Investor companies. The EDC has 22 board members elected who are elected by the Member Investor companies. The boards meet together to set policy and economic development strategy for the community. All EDA EDC Nick Pancheau Chair Collaborative Design Architects Jennifer Kobza Vice Chair TKI Jennifer Weaver Kondracki Secretary/Treasurer Weave Companies Andy Gott Immediate Past Chair First Interstate Bank Stefani Hicswa Member At Large MSU Billings Debbie Desjarlais Chair Keya Advertising Lucy Aspinwall Vice Chair Aspinwall Mountain Wear Bryan Wood Secretary/Treasurer Wood’s Power-Grip Riley Bennett Immediate Past Chair Dick Anderson Construction Kate Vogel Member At Large North 40 Ag Dave Ballard Ballard Petroleum Holdings LLC DJ Clark Sanbell Cole Derks Karell Kimmet Beddow PLLP Spencer Frederick Stockman Bank Keagan Harsha KTVQ Communications, LLC Mike Marsh Midland Claims Service Kim Jakub PAR Montana Nichole Mehling Billings Clinic Foundation Mark Morse Yellowstone County Commissioner Judi Powers Montana Fly-Fishing Lodge Michael Phillips Little Horn State Bank Matt Robertson NAI Business Properties Molly Schwend Northwestern Energy Jerry Simonson Western Security Bank George Warmer Coldwell Banker Commercial CBS Dr. Bob Wilmouth Rocky Mountain College Tyler Wiltgen St. Vincent Healthcare Foundation Zachary Dunn Yellowstone Bank Aaron Redland Redland Realty Brokered by eXp Realty, LLC Vince Mistretta United Properties Inc. Turk Stovall Stovall Ranches, LLC Ken Lutton Technology by Design Darin Uselman Faith E Church Mike Boyett Ex-Officio City of Billings John Brewer Ex-Officio Billings Area Chamber of Commerce Katy Schreiner Ex-Officio Downtown Billings Dr. Erwin Garcia Ex-Officio Billings Public Schools Kurt Markegard Ex-Officio City of Laurel Mike Waters Ex-Officio Yellowstone County Commissioners © 2025 Big Sky Economic Development 201 N. Broadway Billings, MT 59101 P 406.256.6871 contact@bigskyeconomicdevelopment.org Newsletter Signup Home Careers Contact Us Privacy Newsletter Signup Thank you for your interest in BSED! Please fill out the information below and we will add you to our mailing list."
    },
    {
      "url": "https://bluetoad.com/article/New+ownership+has+energized+Lago+Mar+Country+Club.+We+think+this+is+going+to+be+the+jewel+of+South+Florida./3728066/668042/article.html",
      "text": "The Tee Times August 2020, Vol. 13, No. 8: New ownership has energized Lago Mar Country Club. We think this is going to be the jewel of South Florida. The Tee Times - August 2020, Vol. 13, No. 8 New ownership has energized Lago Mar Country Club. We think this is going to be the jewel of South Florida. Gary Curreri 2020-07-25 04:16:20 Richard Martino had played golf at Lago Mar Country Club in Plantation numerous times. “I always thought the course was beautiful,” Martino said. “The club needed some work, but I thought it had a lot of potential. The membership is amazing and you will never thirst for a game. If you want to make friends, this is the place to be.” Martino, who has been Lago Mar general manager since December 2015, believes the club has great potential. With new ownership in place, Martino already has begun plans for capital improvements to the private country club located at 500 NW 127th Avenue. “I think it has a great opportunity to be one of the best clubs in the area,” Martino said. “The footprint … the fact that we are in a gated community. If you drive around the golf course, none of the holes are touching homes. They are all separate. “It is almost like an oasis,” he continued. “You don’t see a lot of homes; you see a lot of nature. You don’t see that in any type of club, especially one in Broward or even South Florida. The new owners have a great vision of where they want us to go and what they want us to be. Our emphasis now is to make the rest of the footprint match that experience.” Martino, who has lived in Plantation since 2000 and has been in the industry for 30 years, said the club has a happy mix of members. “The club has needed a capital infusion to make it better, improve the facilities, and improve the look,” Martino said. The club was in negotiations in the fall with the Seminole Tribe and Hard Rock to purchase the club before Mary Chris Smith and Sharon Keefe stepped in and bought it. Keefe’s father, Burke Hart, was a founding member of the club. Martino said the sale was unanimously approved by the members because this deal wouldn’t change the name, history or culture of Lago Mar. The new owners simply want to restore the Club to its original beauty, increase the amenities offered and enhance the membership experience. “Right now, we have to find the best place to invest that capital,” he said. “Where can we make the biggest impact on the member experience? Our ownership is onsite and wants to move fairly quickly, but they want to do it properly. It’s a great property and we are excited to have new owners. We think this is going to be the jewel of South Florida. “We want people to think of Lago Mar as your destination for everything, not just golf. It is a given that we have to be a great golf course and have it in pristine condition. Our focus is creating a club lifestyle for the entire family. We believe there is a need in Broward County for a true country club experience.” In 2010 Lago Mar spent $8 million for an overhaul of the existing course, overseen by noted golf architect Kipp Schulties. Lago Mar averages about 30,000 rounds each year and also has an outstanding junior program developed by Director of Golf Ernie Ruiz and Director of Instruction Emma Leonardi. Ellen Singer, director of marketing & membership, has been at the club collectively for 13 years. She lauded the pristine course conditions and said they have limited trial memberships as well as new annual memberships. Those members will enjoy weekly dinners and social events, such as ladies night out, social and competitive golf and tennis and family programming. “With the family (atmosphere) and the culture, it is exciting times at the club,” Singer said. “The social camaraderie is really great. We put a lot of events on the calendar. The west side of the county, in my opinion, hasn’t had everything as far as a pristine golf course and all of the other offerings of a private country club for the family. “We have different levels of memberships, from full golf to social. All the members are excited about the new ownership and it has created a great buzz in the community about the Club.” Call Singer at 954.445.5000 or send e-mail to ellen@lagomarcc.com for further details and to schedule a tour of the facilities. sportscom5@aol.com ©The Tee Times. View All Articles . New ownership has energized Lago Mar Country Club. We think this is going to be the jewel of South Florida. https://bluetoad.com/article/New+ownership+has+energized+Lago+Mar+Country+Club.+We+think+this+is+going+to+be+the+jewel+of+South+Florida./3728066/668042/article.html Menu Page View Contents View Advertisers Issue List May 2023 April 2023 March 2023 February 2023 January 2023 December 2022 November 2022 October 2022 September 2002 Tee Times August 2022 July 2022 May 2022, Vol. 15, No. 8 April 2022, Vol. 15, No. 7 March 2022, Vol. 15, No.6 Feb 2022, Vol. 15, No. 5 January 2022, Vol. 15, No. 4 December 2021, Vol. 15, No. 3 November 2021, Vol. 15, No. 2 October 2021, Vol. 15, No. 1 September 2021, Vol. 14, No. 12 August 2021, Vol. 14, No. 11 July 2021, Vol. 14, No. 10 June 2021, Vol. 14, No. 9 May 2021, Vol. 14, No. 8 April 2021, Vol. 14, No. 7 March 2021, Vol. 14, No. 6 February 2021, Vol. 14, No. 5 January 2021, Vol. 14, No. 4 December 2020, Vol. 14, No. 3 November 2020, Vol. 14, No. 2 October 2020, Vol. 14, No. 1 September 2020, Vol. 13, No. 9 August 2020, Vol. 13, No. 8 June/July 2020, Vol. 13, Issue 7 March 2020, Vol. 13, Issue 6 February 2020, Vol. 13, Issue 5 January 2020, Vol. 13, No. 4 December 2019, Vol. 13, No. 3 November 2019, Vol. 13, No. 2 October 2019, Vol. 13, Issue 1 August/September 2019, Vol. 12, Issue 10 June/July 2019, Vol. 12, Issue 9 May 2019, Vol. 12, Issue 8 April 2019, Vol. 12, No. 7 March 2019, Vol. 12, Issue 6 February 2019, Vol. 12, Issue 5 January 2019, Vol. 12, No. 4 December 2018, Vol. 12, No. 3 November 2018, Vol. 12, No. 2 October 2018, Vol. 12, Issue 1 August/September 2018, Vol. 11, Issue 10 June/July 2018, Vol. 11, Issue 9 May 2018, Vol. 11, Issue 8 April 2018, Vol. 11, Issue 7 March 2018, Vol. 11, Issue 6 February 2018, Vol. 11, Issue 5 January 2018, Vol. 11, Issue 4 December 2017, Vol. 11, No. 3 November 2017, Vol. 11, Issue 2 October 2017, Vol. 11, Issue 1 August/September 2017, Vol. 10, Issue 10 June/July 2017, Vol. 10, Issue 9 May 2017, Vol. 10, Issue 8 April 2017, Vol. 10, No. 7 March 2017, Vol. 10, No. 6 February 2017, Vol. 10, No. 5 January 2017, Vol. 10, No. 4 December 2016, Vol. 10, No. 3 November 2016, Vol. 10, No. 2 October 2016, Vol. 10, No. 1 August/September 2016, Vol. 9, No. 10 June/July 2016, Vol. 9, No. 9 May 2016, Vol. 9, No. 8 April 2016, Vol. 9, No. 7 Library"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://lagomar.com/",
      "text": "Home - Official Site of Lago Mar Beach Resort & Club : Official Site of Lago Mar Beach Resort & Club 1700 South Ocean Lane, Fort Lauderdale, FL 33316 • 954.523.6511 • reservations@lagomar.com Lago Mar Logo - returns to home page Reservations Stay Gallery Specials Play Activities The Resort Shop The Spa Local Events Dine Events Meetings Meeting RFP Meeting and Conference Facilities About Blog Our Story Property Map Contact Careers Getting Here Members × Stay Gallery Play Dine Meetings Blog Our Story Members Due to the heavy parking demand, we can only permit 1 vehicle per room. Parking permits will be issued to you at time of check-in. Please have your license plate number available if needed at time of check-in. Our Security Staff will be monitoring the south entrance gate. Experience Lago Mar in All Its Dimensions Welcome To Lago Mar Beach Resort & Club The Fort Lauderdale beachfront resort that is decidedly, and purposefully, different. Understated, not loud. Gracious, not pretentious. Deferential, not presumptuous. In short, a sophisticated retreat where you can appreciate the enduring traditions of genuine hospitality. Lago Mar has recently been recognized by Condé Nast Traveler , Travel + Leisure , U.S. News & World Report, Veranda, and TripAdvisor , which named Lago Mar the No. 1 family hotel in the U.S. and No. 18 overall hotel in the U.S. Discover Transcript Of Video Ten lush acres. Largest private beach. Stately rooms and suites. All for you. Complimentary Wi-Fi No Resort Fee Free Valet and Self-Parking One car per room please. LAGO MAR BEACH RESORT & CLUB'S BLOG The Beach Life Debbie Banks Snyder represents the third generation of the Banks family who helps run Lago Mar in a marketing executive capacity. “Deb,” as she’s known to most, is a part owner of the resort who literally grew up on the hotel grounds with her brother Lee. Learn More Experience Lago Mar In every Lago Mar experience, there is one constant—your comfort and satisfaction. Stay Relax Dine Two day pre-cruise visit Can't say enough about this great place. When deciding on a hotel before the cruise I had only 2 requirements 1. on the beach 2. 2 queen beds. So happy to arrive here after a brutal Ohio winter. Received stellar customer service from everyone we came in contact with from Jerry at the front desk, to everyone in the restaurant to those we just happened to pass. Everyone was just so friendly and incredibly helpful. Was upgrated to a one bedroom suite with 2 queen beds. And I cannot tell you how happy that made us and what a great first impression. Spent time out at the beach and the pools. there is so much to do on the grounds, but I was happy with the pools and beach. Beds were super comfy and bathroom had a tub, and the suite was just huge. Love the place and wish we were staying longer. Next time in Fort Lauderdale will definitely stay here again. The resort just had a nice, genuine Florida feel to it, which I adored. Very easy to get to nearby restaurants and stores by using Uber and Lyft, everything was 5 to 15 mins away. Port Everglades and airport are also not to far away making transit very easy. Highly recommend! FYI great view from the beach of ships leaving and entering the channel in/out of port. -Jules801 Perfect! This resort is perfect. Great location, great service, can't say enough. So much to offer. Loved the chance to get away from the major chains. Met some nice people that are members. Everyone is friendly. LOVE the one bedroom suite!! Love. The bathroom was amazing. Easy to take a Uber or Lyft to get into downtown nightlife area. Will definitely return and can't wait to do so. -49KS Wonderful 5 Days We stayed at Lago Mar Resort before and after our cruise out of Port Everglades.We enjoyed relaxing at the pools,and using all the great amenities.The mini-golf,shuffleboard,basketball and hammocks were all put to good use.The food at the resort is unbelievably good,and the service is 5 star.They have transportation to the cruise port and airport.The steel drum show by the pool was excellent as well.Your every request was met and exceeded.I enjoyed their private beach with palm trees and plenty of chairs and towels.The water was 78 degrees in the ocean.Will return again next year. Room Tip: All Rooms Were Great. Spring for a suite,they are sweet. -dinom Get Exclusive Offers & News › Connect With Us #MyLagoMar Our Story Reservations Amenities Gallery Blog Members Property Map Contact Us 1700 South Ocean Lane, Fort Lauderdale, FL 33316 855.209.5677 • 954.523.6511 • reservations@lagomar.com Copyright ©2025 Lago Mar Beach Resort & Club All rights reserved. Lago Mar Website Accessibility Statement Privacy Policy Sitemap Open toolbar Accessibility Tools Accessibility Tools Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://lagomar.com/about/contact/",
      "text": "Contact - Official Site of Lago Mar Beach Resort & Club : Official Site of Lago Mar Beach Resort & Club 1700 South Ocean Lane, Fort Lauderdale, FL 33316 • 954.523.6511 • reservations@lagomar.com Lago Mar Logo - returns to home page Reservations Stay Gallery Specials Play Activities The Resort Shop The Spa Local Events Dine Events Meetings Meeting RFP Meeting and Conference Facilities About Blog Our Story Property Map Contact Careers Getting Here Members × Stay Gallery Play Dine Meetings Blog Our Story Members We'd Love to Hear From You! Blog Our Story Property Map Sister Properties Contact Fill out my online form . Get Exclusive Offers & News › Connect With Us #MyLagoMar Our Story Reservations Amenities Gallery Blog Members Property Map Contact Us 1700 South Ocean Lane, Fort Lauderdale, FL 33316 855.209.5677 • 954.523.6511 • reservations@lagomar.com Copyright ©2025 Lago Mar Beach Resort & Club All rights reserved. Lago Mar Website Accessibility Statement Privacy Policy Sitemap Open toolbar Accessibility Tools Accessibility Tools Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://lagomar.com/about/our-story/",
      "text": "Our Story - Official Site of Lago Mar Beach Resort & Club : Official Site of Lago Mar Beach Resort & Club 1700 South Ocean Lane, Fort Lauderdale, FL 33316 • 954.523.6511 • reservations@lagomar.com Lago Mar Logo - returns to home page Reservations Stay Gallery Specials Play Activities The Resort Shop The Spa Local Events Dine Events Meetings Meeting RFP Meeting and Conference Facilities About Blog Our Story Property Map Contact Careers Getting Here Members × Stay Gallery Play Dine Meetings Blog Our Story Members The Lago Mar Story Blog Our Story Property Map Sister Properties Contact The Early Years Renowned as one of the best oceanfront resorts in Fort Lauderdale, Florida, Lago Mar Beach Resort & Club has been proudly owned and operated by the Banks family for 60 years. The Lago Mar Story The story begins in 1960 when Mr. Sidney Banks, a native of Bland County, Virginia, purchased the 110-room Fort Lauderdale Beach Hotel. Mr. Banks was a consummate hotelier, having worked during his boyhood in Roanoke, Virginia, hotels as a managing director of the prestigious Cavalier Beach and Cabana Club in Virginia Beach, Virginia, at the age of 31. Upon relocating to Fort Lauderdale with his wife Florence and son Walter, Mr. Banks set about creating the gracious, family-friendly atmosphere consistently rated as an American Automobile Association (AAA) Fort Lauderdale Four Diamond Resort. Mr. Banks also played an active role in the Fort Lauderdale community. He was responsible for the donation of Banks Field, the athletic grounds of Fort Lauderdale’s Pine Crest School, and in 1967 the Sales and Marketing Executives of Fort Lauderdale proclaimed him as one of the “Top Eight Businessmen of the Year.” PRESENT DAY LAGO MAR EMERGES With a beach resort in Fort Lauderdale that was like a second home to him, it’s only natural that Walter Banks, Lago Mar’s present owner and president, would follow in his father’s footsteps. The Banks family’s commitment to constant improvement resulted in the removal of the property’s outdated buildings throughout the 1980s and 1990s and their replacement with all-new structures. The South Florida luxury oceanfront resort you see today offers 204 rooms (164 suites and 40 resort rooms) plus dining, a full-service spa, and meetings and special event space on ten acres of land with 500 feet of beautiful sandy beach – one of the largest private ocean beaches in Broward County. Named “Hotelier of the Year” in 2003, Walter Banks shares the credit for Lago Mar’s success with his wife Debbie, who is responsible for directing the design and selecting the furnishings of the resort’s rooms and public space, as well as overseeing the Resort Shop and the Soda Shop. Their son Lee Banks and their daughter Debbie Banks, who make up the third generation of Lago Mar, are also personally involved in resort operations. AN AWARD-WINNING GEM OF MANY FACETS While Lago Mar is first, last and always a bastion of traditional hospitality, it offers many interpretations of that most endearing quality. It is the quintessential Fort Lauderdale beach resort. It is one of the finest private clubs in Fort Lauderdale. It is a favored destination for family beach vacations in Florida. It is an exceptional Fort Lauderdale meetings resort. Lago Mar is also a renowned location for weddings in Fort Lauderdale. Lago Mar’s list of awards is both lengthy and enviable. It was the first resort chosen in Broward County to be on the Condé Nast Gold List Edition of the “World’s Best Places to Stay.” The City of Fort Lauderdale has presented Lago Mar with two awards for “Best Architectural Design.” The Fort Lauderdale Garden Club has recognized the resort with an award for its beautiful landscaping and plant life. Lago Mar has been honored with the AAA Four Diamond Award every year since 2001. Recently named one of the top resorts in Fort Lauderdale by U.S. News & World Report, Lago Mar also ranks among the highest-rated resorts in the area on TripAdvisor. Get Exclusive Offers & News › Connect With Us #MyLagoMar Our Story Reservations Amenities Gallery Blog Members Property Map Contact Us 1700 South Ocean Lane, Fort Lauderdale, FL 33316 855.209.5677 • 954.523.6511 • reservations@lagomar.com Copyright ©2025 Lago Mar Beach Resort & Club All rights reserved. Lago Mar Website Accessibility Statement Privacy Policy Sitemap Open toolbar Accessibility Tools Accessibility Tools Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    }
  ]
}