{
  "fuentes": [
    {
      "url": "https://lakesretirement.com.au/contact/",
      "email": "info@lakesretirement.com.au"
    },
    {
      "url": "https://www.lakeregion.coop/",
      "email": "lakeregion@lakeregion.coop"
    },
    {
      "url": "https://www.lakeamerica.com/aboutus.aspx",
      "email": "appointment@lakeamerica.com"
    },
    {
      "url": "https://villageenterprise.org/about-us/our-board-and-advisors/",
      "email": "logo-13@2x.png"
    },
    {
      "url": "https://villageenterprise.org/about-us/our-board-and-advisors/",
      "email": "logo-14@2x.png"
    },
    {
      "url": "https://locustlakevillage.org/board-of-directors/board-of-director-meeting-minutes/",
      "email": "administration@locustlakevillage.org"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "customerservice@encorepack.com"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "email": "sales@encorepack.com"
    },
    {
      "url": "https://www.lcvillage.org/about-us/",
      "email": "ertymanager@lcvillage.org"
    },
    {
      "url": "https://www.lcvillage.org/about-us/",
      "email": "propertymanager@lcvillage.org"
    },
    {
      "url": "https://www.lcvillage.org/about-us/",
      "email": "randyl@lcvillage.org"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/46996-lake-region-village-31850-u-s-highway-27-south-haines-city-fl-33844",
      "email": "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/46996-lake-region-village-31850-u-s-highway-27-south-haines-city-fl-33844",
      "email": "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/46996-lake-region-village-31850-u-s-highway-27-south-haines-city-fl-33844",
      "email": "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/46996-lake-region-village-31850-u-s-highway-27-south-haines-city-fl-33844",
      "email": "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png"
    },
    {
      "url": "https://reneesresales.com/lake-region-village/",
      "email": "kelley@reneesresales.com"
    }
  ],
  "mails": [
    "administration@locustlakevillage.org",
    "appointment@lakeamerica.com",
    "customerservice@encorepack.com",
    "ertymanager@lcvillage.org",
    "ic-check@3x-5a3e2144a9a4acf45458273b69b15bbaa81ecbe06f309c300d93a895399c26f7.png",
    "ic-keyboard-arrow-left@3x-08f6b0510226b0efcfdc2666cba73263553b72f2d32e5f011c9c98784c76587c.png",
    "ic-keyboard-arrow-right@3x-7946a10e2ef7d450d52e62227f39f8caec9bffc3c60879d9a44778ef5e31e5c8.png",
    "ic-phone@3x-4e4130ef14f1e4dbef232698ad04bf6ffcd9c9f1b9b1500598e1580f86f28fdb.png",
    "info@lakesretirement.com.au",
    "kelley@reneesresales.com",
    "lakeregion@lakeregion.coop",
    "logo-13@2x.png",
    "logo-14@2x.png",
    "propertymanager@lcvillage.org",
    "randyl@lcvillage.org",
    "sales@encorepack.com"
  ],
  "nombre_sitio": "lakeregionvillage.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://lakesretirement.com.au/contact/",
      "text": "Contact Us – Lakes Retirement Village Home The Town The Village The Villas News The Team FAQs Contact Us Home The Town The Village The Villas News The Team FAQs Contact Us Register Contact Us Contact We’d love to hear from you! Whether you have questions about Lakes Entrance Retirement Village or just want to get in touch, fill out the form below or use our contact details. Address 46 Palmers Rd, Lakes Entrance, VIC 3909 Phone 03 5100 7702 Email info@lakesretirement.com.au Get in touch Feel free to reach out with any questions or inquiries. We’re here to assist you! Name (Required) First Last Phone (Required) Email (Required) Postcode How did you hear about us? How did you hear about us? TV Radio Word of Moutn Signage Other Untitled Choose a request General enquiry Send me an e-brochure Send me a printed brochure Keep me in the loop Other Leave us a message (Required) Δ Join the Lakes Entrance family today Don’t miss out on the opportunity to be part of this vibrant coastal community. Whether you’re looking for an active lifestyle or a peaceful retreat, Lakes Entrance Retirement Village will have something for everyone. Contact us to learn more about how you can make this stunning seaside village your new home. We’re excited to welcome you to the future of coastal living. Learn More Register your interest Whether you’re looking for an active lifestyle or a peaceful retreat, Lakes Entrance Retirement Village will have something for everyone. Contact us to learn more about how you can make this stunning seaside village your new home. We’re excited to welcome you to the future of coastal living. Menu The Town The Village The Villas News The Team Contact Latest News Introducing the Waverider 🌊🏄🏼‍♂️ Introducing the Beach House LERV – 13.01.2025 Address 46 Palmers Rd, Lakes Entrance, VIC 3909 Phone 03 5100 7702 Email info@lakesretirement.com.au Follow All rights reserved © 2025 Lakes Retirement Village Privacy Policy Built by"
    },
    {
      "url": "https://www.lakeregion.coop/",
      "text": "Home | Lake Region Electric Association Skip to main content Search Make Payment -South Dakota LREA Only Smarthub Login Live Outage Map My Account My Cooperative About My Cooperative Service Area Board Of Directors District Map Staff Cooperative Connections Newsletter & YouTube Channel Capital Credits Cooperative Mission and Guiding Principles LREA Community Basin Trip for Members (Adults) REED Fund Contact Us Services Electrical Department Rebates Water Heaters Heat Savings Security Lights Cable Locating Kids & Teens Kids & Teens Scholarship Opportunities Scholar of The Week Youth Tour Youth Excursion to Bismarck, ND NEWS News Cooperative Connections Newsletter Cooperative Connections Plus Video Channel Together We Save Energy Efficiency & Money Saving Tips Latest Lake Region Electric, serving members in northeast South Dakota We’d like to hear from you. Click here for our survey.  1 / 2  Previous Next Pay Bill Online Manage Your Account Make payments, view bills and manage your account. LOGIN TO YOUR ACCOUNT Register for Online Access Password Reset Download the Mobile App Pay Now SmartHub Login Outage Map Contact Us Newsletter Load Control Status - East River Welcome Welcome to Lake Region Electric Association, Inc., Your local Touchstone Energy® Cooperative. Lake Region Electric is a member-owned electric cooperative located in northeastern South Dakota in the beautiful Coteau Hills. We are a distributor of low-cost electric service to our member-owners. We do business with accountability, integrity, innovation, and commitment to community. As an electric co-op, we are motivated by service to our members, not by profit. Lake Region Electric is a member-owned electric cooperative that distributes electricity to homes, businesses and farmsteads in northeastern South Dakota. Our Service territory. We do business with accountability, integrity, innovation, and commitment to community. As an electric cooperative, we are motivated by service to our members, not by profit. Lake Region Conducts ACSI Survey Thursday | February 1, 2024 Read more > Contact us Office Location: 1212 Main Street Webster, SD Hours: 8:00 A.M. until 4:30 P.M. (Mon-Fri) Phone: 605-345-3379 or 1-800-657-5869 24 Hour Dispatch / 7 Days a Week LREA functions to safely purchase, transmit and distribute electric energy and provide services to its members. 1212 Main St . Webster, SD 57274 Quick Links Contact Us News Legal Info Employee Login Follow us online ©2025  Lake Region Electric Association. A Touchstone Energy Cooperative. Powered by Co-op Web Builder Dismiss mobile overlay area Clear keys input element Submit search Open mobile overlay area"
    },
    {
      "url": "https://www.lakeamerica.com/aboutus.aspx",
      "text": "About Us Impact due to coronavirus Covid-19 Office Hours Monday-Friday: 8 AM - 5 PM 301 Frontage Road, Suite G Clermont, FL 34711 Phone : (352) 432-3939 Fax : (352) 432-3908 Pay Bill Online Toggle navigation HOME ABOUT US MEET THE TEAM PATIENT RESOURCES APPOINTMENTS EDUCATIONAL OPPORTUNITY CONTACT US About Lake America Family Physicians ABOUT US Lake America Family Physicians is dedicated to\r\n                providing high quality, comprehensive health care in the\r\n                Central Florida region. We strive to forge a special\r\n                relationship with each and every patient we see. As\r\n                primary care doctors, we are here to take care of people\r\n                of all ages and circumstances. Our goal is to be your\r\n                partner on the road to wellness and excellent health. CONVENIENT LOCATION We are located conveniently near the intersection of US Hwy 27 and Grand Hwy. Our address: 301 Frontage Road Suite G Clermont FL 34711. PHOTOS Call us at (352) 432-3939 or Email at appointment@lakeamerica.com to book an appointment. Quick Links Home About Us Meet The Team Contact Us Patient Resources New Appointment Patient Portal A FAMILY OF DOCTORS... ...FOR YOUR FAMILY All Rights Reserved Privacy Policy Terms of Use Website designed by Rimage Solutions ; your \"one-stop shop for Healthcare software requirements\"."
    },
    {
      "url": "https://villageenterprise.org/about-us/our-board-and-advisors/",
      "text": "Our Board and Advisors - Village Enterprise What We Do What We Do Overview Our Model Where We Work Who We Serve Partnerships for Scale DREAMS for Refugees Impact First Initiative Technology and Innovation Our Impact Our Impact Overview Theory of Change Research & Evidence Monitoring & Evaluation Recognition for Impact About About Us Overview Our Story Team Board & Advisors Partners and Funders Financials & Reports Careers Press Room Blog Take Action Take Action Overview Ways to Give Donate What We Do Overview Our Model Where We Work Who We Serve Partnerships for Scale DREAMS for Refugees Impact First Initiative Technology and Innovation Our Impact Overview Theory of Change Research & Evidence Monitoring & Evaluation Recognition for Impact About Overview Our Story Team Board & Advisors Partners and Funders Financials & Reports Careers Press Room Blog Take Action Overview Ways to Give Blog Press Room Join Our Team Contact Us Subscribe to News Search Our Board & Advisors Working toward our vision of a world free of extreme poverty, our Board of Directors and Advisory Council are integral to this goal Our Board of Directors and Advisory Council are made up of industry leaders, innovators, and founders who are highly respected in their fields. Board of Directors Advisory Council Board of Directors Emeka Ajoku Board Treasurer; Director of Product at Netflix Jamie Austin Board Secretary; Former Senior Director of Impact at Tipping Point Community Pat Brown Business Trainer and Management Consultant Dianne Calvi CEO and President U.S. Mary Dosunmu Associate Director, Scientific Review at Sage Therapeutics Jay Friedrichs General Partner of the Cyprus Growth Fund Lisa Guerra Silicon Valley Social Venture Fund Partner Debbie Hall Board Vice Chair; Management Consultant Serah Kimani Founder and Managing Partner of Ascend Group Michael Mithika CEO and Founder of Mizizi Partners Evelyn Namara Senior Partnerships Manager and Researcher at the Global Digital Inclusion Partnership, Founder and CEO of Vouch Aleksandra Peters Chief People Officer at Brightline Alexis Rwabizambuga Managing Director at TestandCare Medical Technologies Ltd. Bruce Sewell Board Chair; Former Senior Vice President and General Counsel at Apple Advisory Council Tralance Addy Founder and President, Plebys International; Former Founding Executive Director at SEED Brian Boland Co-founder of the Delta Fund Charlie Bresler Board Member and former Executive Director of The Life You Can Save Joe Dougherty Partner at Dalberg Advisors Ermias Eshetu CEO of Financial Sector Deepening (FSD) Ethiopia Jessica Jackley Founder of Alltruists, General Partner at Untapped Capital, and Co-founder of KIVA Amit Maheshwari SaaS Entrepreneur and Founder, Social Technology Partners Our Team Learn about the people that continue the legacy of Village Enterprise Our Team Discover how entrepreneurship can end extreme poverty. Sign up today. What We Do Our Impact About Get Involved Contact Donate Village Enterprise is a 501(c)3 nonprofit. © 2025 | Privacy Policy"
    },
    {
      "url": "https://locustlakevillage.org/board-of-directors/board-of-director-meeting-minutes/",
      "text": "Board of Director Meeting Minutes – Locust Lake Village Property Owners Association Locust Lake Village Property Owners Association Home Community Amenities Lakes The Chalet Ski Slope Turkey Trot Golf Clubs Archery Club Angler’s Club Feathered Friends Ski Club Gallery Nearby Board of Directors & Staff Resources For Owners 2025 Property Owner Registration Governing Docs Owner Rental Registration MDRV Safety Permits Staff, cOMMITTEE & Board Member Directory Request for Resale Admin & Compactor Hours Communtiy rEPORTS Board of Director Meeting Minutes Manager’s Reports Ranger Reports Treasurer Reports Finance Reports Account Definitions Audits Committees Area Resource Links Employment Rentals Contact Us Profile MEMBER LOGIN My Info Change Password Log Out Ski Hill Web Cam TOWNSQUARE APP Board of Director Meeting Minutes Sorry, but you do not have permission to view this content. You must be logged in and have appropriate permissions to view this page. Click here to register for an account or Click here to log in if you already have an account. Locust Lake Village Property Owners Association 1778 Lake Lane Pocono Lake, PA 18347 administration@locustlakevillage.org Admin Phone: (570) 646-3616 Admin Fax: (570) 694-6690 Security Emergencies Only: (570) 646-3532 Office Hours Labor Day Weekend – Memorial Day Weekend 8am – 4:30pm : Monday-Friday 8am – 2pm : Saturday Closed Sunday Memorial Day Weekend – Labor Day Weekend 8am – 5pm : Monday-Thursday 8am – 6pm : Friday & Saturday Closed : Sunday Compactor Hours 7:30am – 3:30pm : Monday, Friday, Saturday 9am – 5pm : Wednesday & Sunday 9:30am – 5:30pm : Monday Holiday Closed Tuesday & Thursday Brush Pit Hours Closed : Monday & Tuesday 8am – 5pm : Wednesday – Sunday"
    },
    {
      "url": "https://www.encorepack.com/contactus.php",
      "text": "Encore Packaging LLC -Contact Us! Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal/Privacy Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Thank you for sending us a message! We will get back to you shortly Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Do you consent to our Privacy Policy / Terms of Use and Standard Terms and Conditions of Sale ? Yes Logout Please check in later. This feature coming soon! (847) 735-8105 Call Us | Email Us | Log-In Products News Special Offers Events About Us Strapping Stretch Strapping and Accessories Kits Battery Tools and Accessories Tensioners Pneumatic Tools Sealers Accessories Sealless Tools Cutters Strapping Trucks Strap Dispensers Edge Protectors Strapping Coils Buckles Pre-Cuts Seals Combination Tools Material Dispensers & Holders Storage Solutions Peanut Dispensers Kraft Paper Dispensers Bubble, Foam, Poly and Corrugated Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stretch Film Dispensers Honeycomb Paper Dispensers Slide Cutters Utility Knives & Cutters Replacement Blades Retractable T-Style Hook Style Sliding Accessories Specialty Tape Dispensers Table-Top Rubber Bands Standard Moving Pallet Distribution Central Log-In **Login Failed!** Username: Password: Forgot Password? Forgot Username? Legal Password Reset **Please enter the username and email associated with your account. You'll receive an email to activate your new password.** **Invalid Email or Userame!** **Your Passwords Don't Match!** **Email Not In Valid Format!** Username: Email: New Password: Confirm Password: Back to Login Legal Forgot Username? Username Reset **Please enter the Email and Password associated with your account. We'll send your username.** **Invalid Email or Userame!** **Email Address Does Not Match Our Records!** **Email Not In Valid Format!** Email: Password: Back to Login Legal Forgot Password? Terms and Conditions •\tBy clicking \"login\" you consent to the following legal terms and conditions of Distribution Central.\nPictures, videos, schematics and products flyers within Distribution Central are provided as a service to you as a valued distributor of our products. Please use them accordingly. We appreciate your efforts to purchase and sell our products. Pictures and other support material are the property of Encore Packaging, LLC and can be used exclusively for the promotion and sale of Encore Packaging’s products. Any person and/or company using materials to promote non-Encore Packaging LLC. products and/or misuse or misrepresentation of our product images will be subject to all available remedies. Products, information and specifications are provided for informational purposes only based on our understanding of the industrial standards. Every application is unique. It is the distributors responsibility to understand the needs of each and every application on hand and make the proper recommendation to their end-users. Encore Packaging is in no way liable nor can it be held accountable for any interpretation, reliance and recommendation based on the information presented. By clicking login, you agree to said terms and conditions. •\tBy clicking \"login\" you consent to our Terms of Use and Privacy Policy, which outlines our use of cookies on this website to facilitate in your user experience. Click here to view more information on our use of cookies. •\tBy clicking \"login\" you consent to our Standard Terms and Conditions of Sale. Click here to view. ← Back to Login Email us: sales [at] encorepack.com Email Form First Name * Last Name * Phone # * Email * Message: Strapping Stretch Strapping and Accessories Eco-Friendly Kits For Woven Polyester For Polypropylene For Polyester For Steel For Woven Cord Battery Tools and Accessories For Polypropylene For Polyester For Cord Strapping Tensioners For Polypropylene For Polyester For Cord For Steel For Stainless Steel Pneumatic Tools For Cord For Steel Sealers For Polypropylene For Polyester For Steel Accessories Sealless Tools For Steel Cutters For Steel and Poly For Steel Strapping Trucks Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Steel or Poly Strap Dispensers For Steel For Cord For Poly For Steel or Poly For Poly and Steel Oscillated Wound Ribbon Wound Oscillated or Ribbon Wound For Poly Edge Protectors Standard Duty Heavy Duty Strapping Coils Buckles For Cord For Poly For Stainless Steel Pre-Cuts Seals For Poly For Steel Combination Tools For Steel For Stainless Steel Material Dispensers & Holders Storage Solutions Trays Mobile Hooks Carton Stands Peanut Dispensers Kraft Paper Dispensers Wall Mountable Table/Wall Mountable Floor Unit Accessory Table Mountable Bench Mountable Table/Bench Mountable Mobile Units Battery Powered Bubble, Foam, Poly and Corrugated Dispensers Wall/Table Mount Mobile Dispensers Battery Powered Horizontal Dispensers Wrapping Units Poly, Tubing and Bag Dispensers Stationary Mobile Stretch Film Dispensers Honeycomb Paper Dispensers Table/Wall Mountable Slide Cutters Wall/Table Mount Mobile Dispensers Battery Powered Utility Knives & Cutters Replacement Blades Retractable Light Duty Standard Duty Heavy Duty T-Style Light Duty Standard Duty Hook Style Standard Duty Heavy Duty Sliding Standard Duty Accessories Specialty Standard Duty Heavy Duty Tape Dispensers Replacement Blades & Wiper Plates Hand-Held Table-Top Rubber Bands Standard Large Moving Pallet Phone: 847-735-8105 Fax: 847-735-8297 Email: customerservice [at] encorepack sales [at] encorepack Headquarters: Encore Packaging LLC 201 Park Ave Lake Villa, IL 60046 Remit Payment to: P.O. Box 595 Winnetka, IL 60093 Ask An Agent Our Customer Service Agents are ready to help! (847) 735-8105 Email Home Contact Site Map Catalog Legal encorepack.mx"
    },
    {
      "url": "https://www.lcvillage.org/about-us/",
      "text": "About Us - Lake Country Village Skip to content Lake Country Village Search for: Home LCV News Calendar Gallery Documents Agendas Board Minutes Last 10 years 2025 Board Minutes 2024 Board Minutes 2023 Board Minutes 2022 Board Minutes 2021 Board Minutes 2020 Board Minutes 2019 Board Minutes 2018 Board Minutes 2017 Board Minutes 2016 Board Minutes 2015 Board Minutes 2014 Board Minutes Older than 10 years 2013 Board Minutes 2012 Board Minutes 2011 Board Minutes 2010 Board Minutes 2009 Board Minutes 2008 Board Minutes 2007 Board Minutes 2006 Board Minutes 2005 Board Minutes 2004 Board Minutes 2003 Board Minutes 2002 Board Minutes Policies and Procedures Common Area Tree and Shrub Policy Contract Guidelines Elections Ethics and Code of Conduct Policy Expense Authorization Policy HOA Dues Kiosks Records Retention Water Use Work Requests Declaration and Other Legal Documents Declaration By Laws and Regulations Prospectus Resolutions Building Communications Contracts Insurance Landscaping Rules and Regulations Homeowners Dues Outside Storage Parking Rentals Website Work Requests Other Utilities Other Documents Annual Reports and Newsletters Insurance Documents HOA Dues Maps COVID-19 Your HOA About Us Maps Your Board Committees/Duties Current Committee Members Join a Committee?? Buildium Owners Handbook Contact Us Candidate Application Certifications Contact Us Homeowner or Maintenance Request (Hard Copy) Request Reimbursement Links Help! Certifications Home LCV News Calendar Gallery Documents Agendas Board Minutes Last 10 years 2025 Board Minutes 2024 Board Minutes 2023 Board Minutes 2022 Board Minutes 2021 Board Minutes 2020 Board Minutes 2019 Board Minutes 2018 Board Minutes 2017 Board Minutes 2016 Board Minutes 2015 Board Minutes 2014 Board Minutes Older than 10 years 2013 Board Minutes 2012 Board Minutes 2011 Board Minutes 2010 Board Minutes 2009 Board Minutes 2008 Board Minutes 2007 Board Minutes 2006 Board Minutes 2005 Board Minutes 2004 Board Minutes 2003 Board Minutes 2002 Board Minutes Policies and Procedures Common Area Tree and Shrub Policy Contract Guidelines Elections Ethics and Code of Conduct Policy Expense Authorization Policy HOA Dues Kiosks Records Retention Water Use Work Requests Declaration and Other Legal Documents Declaration By Laws and Regulations Prospectus Resolutions Building Communications Contracts Insurance Landscaping Rules and Regulations Homeowners Dues Outside Storage Parking Rentals Website Work Requests Other Utilities Other Documents Annual Reports and Newsletters Insurance Documents HOA Dues Maps COVID-19 Your HOA About Us Maps Your Board Committees/Duties Current Committee Members Join a Committee?? Buildium Owners Handbook Contact Us Candidate Application Certifications Contact Us Homeowner or Maintenance Request (Hard Copy) Request Reimbursement Links Help! Certifications Search for: Lake Country Village Providing a well-maintained community with sound fiscal management and open communications. BOARD PLACES MORATORIUM ON NEW LEVEL II EV CHARGERS EFFECTIVE 1/9/2023! Click here for more information About Us LAKE COUNTRY VILLAGE is the largest homeowners association in Clinton County with 326 homes. Constructed in 1959 by the United States Air Force for use as personal housing, our homes were extensively renovated and upgraded at the time of the PAFB closing in 1995. Located minutes from the Plattsburgh International Airport , the Adirondack Northway and Lake Champlain .  LCV is composed of townhouse and villa style homes.  Situated ideally within the City of Plattsburgh , LCV is easily accessible to shopping, schools, restaurants, bike paths and all the Lake City has to offer. HOMEOWNERS ASSOCIATION BOARD OF DIRECTORS The Lake Country Village HOA is guided by a group of dedicated homeowners who sit on its Board of Directors.  The Board works earnestly to ensure residents’ needs are addressed, our community life is safe, clean and consistently improving.  Please join our monthly meetings- generally the 2nd and 4th Monday of each month.  Dates, times and locations are posted on the website calendar page. Our Board members support LCV on a volunteer basis. All elected Board members serve 2 yr. terms, and may opt to run again once their commitment is up. Special skills or past experience is helpful but certainly not required.  Many Board members have never served on a Board before and are just regular residents who care about their neighborhood. While good organizational skills are important, patience and open-mindedness are the most important qualities of a board member as we deal with homeowners questions, concerns and complaints. Board business requires a minimum of approximately a 3-5 hr. commitment each month, which can increase as issues or changes arise. Board Members are expected to attend all Board Meetings and are encouraged to serve as a Board Liaison to one of our HOA committees. COMMITTEES In addition to the Board, homeowners are encouraged to volunteer to help by joining one of our committees that are organized to study, research and advise the Board in a variety of specialized areas.  If you feel you can contribute your time and talent to help out in this way, please visit our Join a Committee page and fill out the form. Committee involvement is extremely valuable and appreciated – the more people we have dedicated to helping the community proactively, the better we are today and in the future. MEETINGS Our Board meetings are generally held the 2nd and, when needed, the 4th Monday of each month.  Dates, times and locations are posted on the website calendar page.  All homeowners are encouraged to attend to stay informed and to lend your voice in the decisions for your community. HOA FEES Currently, the monthly member fees are $245.  This amount covers (but is not limited to) homeowners’ water and sewer charges, roof replacements, structure insurance and common area maintenance including lawn care, and snow removal.  The Board tries to maintain this amount as low as possible by continuously looking for ways to save expenses without compromising the quality of the neighborhood.  We use our various committees to investigate ways to save such as Utilities Committee to monitor water usage.  The day-to-day operation of the HOA is handled by a professional Property Manager, which as of April 1, 2024 is : Michael Mckinno n ( prop ertymanager@lcvillage.org ) QUESTIONS? Usually, questions should be directed to our property manager.  However, you can contact the Board members at any time at:  board@lcvillage.org.  Or you can use the Contact Us form by clicking here .  The entire Board receives this form when submitted.  We are elected to represent your interests and concerns. Tammy Favro, President Ron Deragon, Vice President Jody Erickson, Treasurer Judy Barcomb, Secretary Dale Holzer, MAL Gerry Eagan, MAL Home LCV News Calendar Gallery Documents Agendas Board Minutes Last 10 years 2025 Board Minutes 2024 Board Minutes 2023 Board Minutes 2022 Board Minutes 2021 Board Minutes 2020 Board Minutes 2019 Board Minutes 2018 Board Minutes 2017 Board Minutes 2016 Board Minutes 2015 Board Minutes 2014 Board Minutes Older than 10 years 2013 Board Minutes 2012 Board Minutes 2011 Board Minutes 2010 Board Minutes 2009 Board Minutes 2008 Board Minutes 2007 Board Minutes 2006 Board Minutes 2005 Board Minutes 2004 Board Minutes 2003 Board Minutes 2002 Board Minutes Policies and Procedures Common Area Tree and Shrub Policy Contract Guidelines Elections Ethics and Code of Conduct Policy Expense Authorization Policy HOA Dues Kiosks Records Retention Water Use Work Requests Declaration and Other Legal Documents Declaration By Laws and Regulations Prospectus Resolutions Building Communications Contracts Insurance Landscaping Rules and Regulations Homeowners Dues Outside Storage Parking Rentals Website Work Requests Other Utilities Other Documents Annual Reports and Newsletters Insurance Documents HOA Dues Maps COVID-19 Your HOA About Us Maps Your Board Committees/Duties Current Committee Members Join a Committee?? Buildium Owners Handbook Contact Us Candidate Application Certifications Contact Us Homeowner or Maintenance Request (Hard Copy) Request Reimbursement Links Help! Certifications Powered by - Designed with the Hueman theme"
    },
    {
      "url": "https://www.mhbo.com/mobile-home-park/46996-lake-region-village-31850-u-s-highway-27-south-haines-city-fl-33844",
      "text": "Lake Region Village | 31850 U.S. Highway 27 South, Haines City, FL 33844 | MHBO.com SEARCH Buy Rent Explore Parks My Property Feed favorite_border Favorites Sign Up or Login COMMUNITY PROFILE Lake Region Village 31850 U.S. Highway 27 South location_on Map It Haines City, FL 33844 | ID: 46996 hotel_class Review this Park Inquire About Homes Lot Rent Info Inquire About Homes Lot Rent Info ROC 55 + PHOTOS VIDEO STREET VIEW 28.0651687 -81.6466036 944909 31850 U.S. Highway 27 South, Haines City, FL 33844 Details Name Lake Region Village Type of community Age-restricted community ? Lot rent range $360 - $740 Office Phone (863) 439-1623 Total # of lots 611 Pet policy close Pet friendly Community owner type Co-op Property manager on site check Water type City Sewer type City provided Street width Wide Parking Off-street Street type Paved Climate Zone Rating HOT-HUMID Security check Gated community MORE Schedule a Visit Check out Lake Region Village Call Us (863) 439-1623 Sales & Leasing input SEND TO MY PHONE About lot rent The lot rent ranges from $360 - $740 per month and includes: check Trash pickup check Water check Sewer Disclaimer Lot rent and other fees can change at any time without notice. MHBO is not responsible for quoting current monthly fees,\n          lot rent, or any dues/fees associated with the community or home. Additional fees for certain amenity privileges may apply.\n          All applicable community fees are the responsibility of the buyer to obtain and community manager/owner to disclose prior to ownership or occupancy. Description Lake Region Village is an age-restricted (55+) manufactured home community located in 31850 U.S. Highway 27 South, Haines City, FL 33844. Lake Region Village is a land-lease community and has a total of 611 home sites. Home site lot rent ranges from $360 - $740 per month and includes the following: Trash pickup Water Sewer The streets in the community are paved, and are of an wide street width. The water in the community is sourced from the city and the sewer system is city provided. Parking is off-street The community has 0 parking spaces available for RVs. Lake Region Village is an affordable housing choice for active, friendly, age-qualified living. This well-maintained retirement community has easy access to local recreation, shopping and entertainment. Equal Housing Opportunity Amenities check Basketball court check Billiards check Bingo check Boat storage check Fitness center check Horseshoes check Clubhouse check Recreation facilities check Shuffleboard courts check Swimming pool check Laundry facilities check Library check Fishing check Kitchen check Picnic area check Cards check RV Storage Area check Putting Green check Meeting Rooms check Planned Activities check On-Site Sales Office check On-Site Staff check Potluck MORE Local Climate HOT-HUMID Lake Region Village is located in Climate Zone 1.\n      A HOT-HUMID climate is defined as a region that receives more than 20 inches (50 cm) of annual precipitation, and where the monthly average outdoor temperature remains above 67°F (19.5°C) throughout the year. Knowing your area’s climate zone (as assigned by the U.S. Department of Energy’s Building America Program into one of eight zones), can help you predict your heating and cooling needs. Humidity and temperature can of course vary, even by county. The Building America HOT-HUMID climate zone corresponds to the portions of IECC zones 2 and 3 in the dry category. READ MORE ABOUT CLIMATE ZONES > Inquire about this Community I was searching on MHBO.com and found your community. Please send me more information about Lake Region Village at 31850 U.S. Highway 27 South, Haines City, FL 33844 Send Message Share Share Email email Share on Facebook Share on Twitter Information Requested A detailed information sheet has been sent to your email. CLOSE Similar Mobile Home Parks You might be interested in these nearby communities. The Landings at L... Haines City, FL Homes Ranging From $20K - $87K Royal Palm Village Haines City, FL Features pool Pool Central Park Haines City, FL Features pool Pool About Contact Accessibility Services Terms & Privacy Blog Sitemap © 2025 MHBO.com Equal Housing Opportunity Send Inquiry to Plant Prefab Model Type One Two Three Status One Two Three Create an alert for new models like this Send Message × Send to Your Phone"
    },
    {
      "url": "https://reneesresales.com/lake-region-village/",
      "text": "Lake Region Village - Renees Resales Affordable Living…Offering Pre-owned Manufactured Homes in Sunny Central Florida Listings Agents Tammy Barnhart Kelley Donofrio Evie Dooley Stephanie Goldsmith Beverly Hopkins Nancy Hux Bette Johnson Pam Pullen Keith Saunders Kathy Sutak Central Florida Communities – View All – Auburndale, FL Central Leisure Lake Mobile Home and RV Park The Hamptons Golf & Country Club Dundee, FL Dell Lake Village Haines City Area Heartland Estates Lake Hammock Village The Landings at Lake Henry Ridge Manor Royal Palm Village Lake Alfred Area Cypress Greens Kings Pointe Palm Shores Mobile Village Woodland Lakes Lake Wales Area Pedaler’s Pond Tower Lakes TowerWood Lakeland Area Georgetown Mobile Manor Schalamar Creek Golf & Country Club Ocala, FL The Arbors of Ocala The Villas at Spanish Oaks Winter Haven Area Cypress Creek Village Four Lakes Golf Club Hammondell Campsites & RV Hidden Cove Hidden Cove East Hidden Cove West Hidden Golf Club Lake Fox Village Lucerne Lakeside Orange Manor East Orange Manor West Shipp Reck Harbor MHP Swiss Golf & Tennis Swiss Village Winter Haven Oaks Winter Haven MHC Resources For Buyers For Sellers News & Tips Must Sell Contact 863-514-3425 Affordable Living…Offering Pre-owned Manufactured Homes in Sunny Central Florida Listings Agents Tammy Barnhart Kelley Donofrio Evie Dooley Stephanie Goldsmith Beverly Hopkins Nancy Hux Bette Johnson Pam Pullen Keith Saunders Kathy Sutak Central Florida Communities – View All – Auburndale, FL Central Leisure Lake Mobile Home and RV Park The Hamptons Golf & Country Club Dundee, FL Dell Lake Village Haines City Area Heartland Estates Lake Hammock Village The Landings at Lake Henry Ridge Manor Royal Palm Village Lake Alfred Area Cypress Greens Kings Pointe Palm Shores Mobile Village Woodland Lakes Lake Wales Area Pedaler’s Pond Tower Lakes TowerWood Lakeland Area Georgetown Mobile Manor Schalamar Creek Golf & Country Club Ocala, FL The Arbors of Ocala The Villas at Spanish Oaks Winter Haven Area Cypress Creek Village Four Lakes Golf Club Hammondell Campsites & RV Hidden Cove Hidden Cove East Hidden Cove West Hidden Golf Club Lake Fox Village Lucerne Lakeside Orange Manor East Orange Manor West Shipp Reck Harbor MHP Swiss Golf & Tennis Swiss Village Winter Haven Oaks Winter Haven MHC Resources For Buyers For Sellers News & Tips Must Sell Contact 863-514-3425 City Community Property Type Double-Wide Park Model Single-Wide Triple-Wide Property Status Any For Sale Motivated Must Sell Open House Pending Reduced Sold Agent Renee Krabbe Kathy Sutak Michelle Gentile Tammy Barnhart Stephanie Goldsmith Beverly Hopkins Kelley Donofrio Bette Johnson Pam Pullen Min Beds Any 1 2 3 4 5 6 7 8 9 10 Min Baths Any 1 2 3 4 5 6 7 8 9 10 Min Price Any $1,000 $5,000 $10,000 $20,000 $30,000 $40,000 $50,000 Max Price Any $10,000 $20,000 $30,000 $40,000 $50,000 $60,000 $70,000 $80,000 $90,000 $100,000 Min Price Any $500 $1,000 $2,000 $3,000 $4,000 $5,000 $7,500 $10,000 $15,000 $20,000 $25,000 $30,000 $40,000 $50,000 $75,000 $100,000 Max Price Any $1,000 $2,000 $3,000 $4,000 $5,000 $7,500 $10,000 $15,000 $20,000 $25,000 $30,000 $40,000 $50,000 $75,000 $100,000 $150,000 Min Area (sq ft) Max Area (sq ft) Min Garages Any 1 2 3 4 5 6 7 8 9 10 Keywords 2 Carports (0) 2 Community Clubhouses (1) 2 Community Hot Tubs (1) 2 Community Pools (21) 2 Detached Storage Sheds (0) 2 Driveways (0) 2 En-Suite Baths (0) 2 Enclosed Porches (0) 2 Fishing Ponds (0) 2 Four-Season Rooms (0) 2 Garages (0) 2 Glass-Windowed Lanais (2) 2 Golf Carts Included (0) 2 Grills (0) 2 Ovens (0) 2 Pantries (4) 2 Patios (0) 2 Screened Porches (2) 2 Sheds (2) 2 Step-In Showers (0) 2 Walk-In Closets (35) 2 Window Heat/Air Units (0) 2 Windowed Lanais (0) 3 Screened Lanai's (0) 3 Sheds (0) 3 Walk-In Closets (6) 3-Wheel Bicycle Included (0) 3-Wheel Bike (0) 4 Season Room (31) 4-Point Home Inspection (July 2023) (0) 55+ Community (92) 9-Hole Golf Course (0) Access Lift (0) Access Ramp (4) Access To Canal System Connecting To Chain Of Lakes (8) Air Fryer In Range (0) All Gray Pipe Replaced (0) All New Bathroom (1) All New Blinds (0) All New Kitchen Cabinets (0) All New Stainless Appliances (1) Automatic Door (Golf Cart Garage) (4) Automatic Door To Shed (0) Automatic Garage Door (1) Awnings (38) Back Porch (0) Background Check Required (0) Bicycles Included (0) Bidets (0) Boat Included (0) Boat Ramp (0) Boat Slips Available (4) Boat/RV Storage Available (30) Bonus Room (0) Canal View (0) Cedar Closet (0) Chair Height Commodes (0) Citrus Trees (0) Community 5-Acre Lake, Stocked (0) Community Ballroom (0) Community Bank (1) Community Baseball/Softball Field (0) Community Basketball Court (0) Community Billiards Room (94) Community Boat Launch (3) Community Bocce Ball Court (27) Community Church Services (1) Community Covered Pavillion (0) Community Fishing Lake (3) Community Fishing Pier (8) Community Fishing Pond (11) Community Fitness Center (61) Community Free Wi-fi (0) Community Garden (0) Community Golf Pro Shop (21) Community Grill (0) Community Horseshoes Court (69) Community Hot Tub (48) Community Lake Access (2) Community Lake Access + Dock (9) Community Laundry Facilities (2) Community Mini Golf (4) Community Movie Theater (4) Community Natural Preserves (0) Community Pickleball Courts (34) Community Picnic Tables (0) Community Pool (69) Community Private Boat Docks (4) Community Putting Green (4) Community Restaurant (23) Community Shuffleboard Courts (82) Community Tennis Courts (26) Comunity Wifi Hotspots (0) Concrete Curbing (19) Corner Lot (16) Covered Patio (3) Covered Porch (3) Deck (3) Dedicated Office Space (0) Den/Family Room (13) Den/Office (3) Detached Shed (1) Dishwasher (85) Dishwasher (May Need Repair) (1) Dog Park (7) Doggie Door (0) Double Driveway (0) Double-Pane Windows (38) Drinking Water System (4) Drinking Water System (RO) (1) Driveway (Deco) (46) Driveway (XL) (0) Dryer Hookup (0) Drywall On All Walls (1) En-Suite Bath (0) Extended Golf Cart Drive (1) Exterior Electrical Receptacles (73) Extra Fridge (10) Extra Mini Fridge (1) Family Community (0) Family Room (2) Faux Wood Blinds (0) Fire Pit (2) Fireplace (2) Fireplace (Electric) (3) Floors: Bamboo (0) Floors: Carpet (0) Floors: Carpet, Hardwood, Laminate (0) Floors: Carpet, Hardwood, Laminate, Tile (0) Floors: Carpet, Hardwood, Laminate, Vinyl (0) Floors: Carpet, Hardwood, Tile (0) Floors: Carpet, Hardwood, Tile, Vinyl (0) Floors: Carpet, Hardwood, Vinyl (0) Floors: Carpet, Laminate (5) Floors: Carpet, Laminate, Tile (10) Floors: Carpet, Laminate, Tile, Vinyl (1) Floors: Carpet, Laminate, Tile, Vinyl Plank (2) Floors: Carpet, Laminate, Vinyl (7) Floors: Carpet, Laminate, Vinyl Plank (5) Floors: Carpet, Tile (2) Floors: Carpet, Tile, Vinyl (1) Floors: Carpet, Tile, Vinyl Plank (5) Floors: Carpet, Tile, Wood Parquet (0) Floors: Carpet, Vinyl (15) Floors: Carpet, Vinyl Plank (8) Floors: Carpet, Vinyl, Vinyl Plank (9) Floors: Cork, Laminate, Tile (0) Floors: Hardwood (1) Floors: Hardwood Parquet (0) Floors: Hardwood, Laminate, Vinyl Plank (0) Floors: Hardwood, Tile (0) Floors: Hardwood, Vinyl (0) Floors: Hardwood, Vinyl, Vinyl Plank (1) Floors: Laminate (11) Floors: Laminate, Tile (8) Floors: Laminate, Tile, Vinyl (1) Floors: Laminate, Tile, Vinyl Plank (0) Floors: Laminate, Vinyl (4) Floors: Laminate, Vinyl Plank (2) Floors: Need Repair (0) Floors: Tile (1) Floors: Tile, Vinyl Plank (3) Floors: Vinyl (2) Floors: Vinyl Plank (18) Floors: Vinyl Plank & Tile (1) Floors: Vinyl Plank & Vinyl (2) Floors: Vinyl Tile (1) Florida Room/Lanai (62) Freezer (1) Fresh Paint (Exterior) (0) Fresh Paint (Interior) (0) Front Porch (7) Furnishings Negotiable (0) Garage (2) Garbage Disposal (54) Gas Cooktop & Oven (0) Gas Dryer (0) Gas Dryer Hookup (0) Gas Range (1) Gas Range Hookup (0) Gated Community (43) Generator (2) Generator (5000 Watt) (0) Generator (Whole House) (1) Generator Hookup (0) Generator Switch And Transfer Switch (Whole House) (0) Glass-Windowed Lanai (9) Golf Cart (2nd GC Negotiable) (0) Golf Cart (Negotiable) (1) Golf Cart & Mower Negotiable (0) Golf Cart Carport (0) Golf Cart Garage (37) Golf Cart Included (11) Golf Cart Pad (1) Golf Course Community (26) Golf Course View (6) Golf Nearby (4) Grab Bars (20) Granite Countertops (0) Great Fishing (0) Gutters (112) Handicap-Accessible (0) Hardwood (0) Home Sold AS IS (0) Home Warranty Included (0) Horse Stable View (0) Hurricane Shutters (12) Hurricane Windows (1) Inside Laundry (32) Inside Laundry Hookup (5) Kitchen Island (18) Laminate (0) Laundry Hookups (29) Lawn Mower (0) Lawncare Paid Thru 2024 (0) Library/Office (2) Many Community Amenities (1) Many Upgrades (0) Metal Roofover (0) Microwave (Built In) (57) Microwave (Countertop) (48) Mini Dishwasher (0) Mini Fridge (0) Mower Negotiable (0) Near Bus Line (0) New AC Ducts (0) New Ceiling Fans (0) New Electric Panel (0) New Floors (1) New Furniture (0) New Landscaping (0) New Light Fixtures (0) New Plumbing (0) New Roof (0) New Roof Coming Soon (0) New Subfloors (0) New Subfloors In Kitchen And Dining (0) New Vapor Barrier (1) New Windows (0) Newly Remodeled (0) No Carpet (0) No Pet Community (2) No Popcorn Ceilings (44) Office Desk Area (0) On Canal (1) On Cul-de-sac (1) On Golf Course (5) Outdoor Cooking Area (0) Oversized Lot (0) Painted Driveway (1) Pantry (80) Parquet (0) Patio (33) Pergo (0) Perimeter Lot (26) Perimeter Lot (Oversized) (1) Pet Friendly (76) Playground (0) Private Back Yard (27) Propane Stove (0) Protected Carport (0) Retractable Awning (0) Riding Mower (0) Riverfront (0) Roof Turbines (0) RV Storage (0) Screened Lanai (8) Screened Porch (12) Security Camera (0) Security Screen Door (0) Security System (1) Shed (69) Shed (Air Conditioned) (0) Smoke Alarms (82) Solar Panels (0) Split Floor Plan (40) Sprinkler System (52) Stainless Kitchen Appliances (3) Stand Alone Freezer (2) Surge Protector (Whole House) (0) Textured Drywall Throughout (2) Tie-Downs (105) Tie-Downs W/Certificate (0) Tile (0) Tinted Windows (0) Trash Compactor (0) Triple-Pane Windows (0) Updated Bathrooms (0) Updated Cabinets (0) Updated Landscaping (0) Updated Subfloors (14) Updated Subfloors - Both Baths (0) Updated Subfloors In 1 Bath (0) Updated Subfloors In Kitchen (0) Upgraded Countertops (3) Upgraded Electric (0) Upgraded Kitchen Appliances (1) Upgraded Plumbing (0) Utility Sink (10) View Of Park (0) View Of Sports Areas (0) Vinyl (0) Vinyl Plank (1) Walk-in Closet (44) Walk-In Pantry (6) Walk-Thru Closet (0) Walking/Bike Path Along Lake (2) Washer & Dryer Included (105) Washer & Dryer Included (Stacked) (0) Washer Included (0) Water Conditioner (Under Sink) (3) Water Feature View (0) Water Heater (Gas) (0) Water Heater (New) (0) Water Heater (On Demand) (0) Water Heater (Tankless) (0) Water Heater-(Tankless For Kitchen) (0) Water Purification System (0) Water Softener (0) Water View (15) Waterfront (10) Wet Bar (0) Whirlpool Spa (2) Window AC (0) Wine Fridge (0) Wired For Generator & Surge Protector (0) Workbench (30) Workshop (17) World Class Bass Fishing Lake (0) Looking for certain features Search Lake Region Village Dundee, FL If you go to Dundee, Florida and turn east off US Highway 27, you will find a true Florida “hidden treasure.” Far enough away from the hubbub of traffic for a quiet, peaceful, pet-friendly community, you’ll find extra wide streets, lots of friendly neighbors, and a quiet place to fish. Dell Lake Village is a 55+ community with its own lake. Our many amenities include a great club house, a large heated pool, shuffleboard courts and billiards. There are several nearby golf courses and plenty of shopping. The clubhouse and pool overlook the lake. This is a very social active community. Near by is a regional shopping mall, restaurants, Home Depot, and a large flea market. There are many outstanding golf courses and driving ranges close by. Disney and the other Orlando theme parks are 45 minutes away. Orlando International Airport is an hour away as are the Tampa Bay area beaches. The park is located just off Route 27 North of Dundee Rd. Turn right onto Frederick Ave. off Rt. 27 and drive approximately one half mile. You will find the park on the right at 314 Frederick Ave. Community Features Clubhouse Bingo Shuffleboard Heated Pool Planned Community Activities Pool Table Library Boat and Camper Storage Area Lake for Boating & Fishing Around the Town Things to do Disney World Universal Studios Sea World Places to Shop Winn-Dixie Family Dollar Wal-Mart Supercenter Services Nearby Winter Haven Hospital Moffit Cancer Center Dundee Walk-in Clinic Agents Serving this Community Listings in this Community View Property 223 Green Haven: Perfect Snowbird Living! PERFECT SNOWBIRD LIVING…..PARTIALLY FURNISHED and lovingly maintained, the OPEN-CONCEPT layout… Bedrooms 2 Bathrooms 2 Area 840 For Sale $38,900 View Property 171 Juniper Dr West: SPACIOUS Living! MODERN Comfort & SPACIOUS Living on a Prime CORNER… Bedrooms 3 Bathrooms 2 Area 1056 sq ft Pending $68,500 View Property 183 Juniper Dr: Comfort & Style! LIVE LARGE IN COMFORT & STYLE! Bedrooms 2 Bathrooms 2 Area 1152 sq ft For Sale Lower Price $34,900 View Property 65 Juniper Dr: Unbeatable Price! Your Perfect Oasis at an Unbeatable Price Awaits! Bedrooms 2 Bathrooms 2 Area 840 sq ft For Sale $25,900 We are waiting to hear from you. Use the contact form below or call 863-514-3425. Name Email Phone Number Message I'm interested in hearing more about the 'Lake Region Village' community. Renees Resales / Pre-owned Manufactured Homes on Lot Lease Land Copyright Renee's Resales 2019. All Rights Reserved. | Disclaimer: All listing information is deemed reliable but not guaranteed and should be independently verified through personal inspection by appropriate professionals. This home is sold \"as is.\" Renee’s Resales LLC cannot guarantee or warrant the accuracy of this information or condition of this property. The buyer assumes full responsibility for obtaining all current rates of lot rent, fees, or pass-on costs associated with the community, park, or home from the community/park manager. Renee’s Resales LLC is not responsible for quoting of said fees. Owning a home is a keystone of wealth… both financial affluence and emotional security. Suze Orman September 11, 2025 Thursday! Renees Resales Login Username Password Forget Password? Login Reset Password"
    }
  ]
}