{
  "fuentes": [
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "email": "membership@lhymca.com"
    },
    {
      "url": "https://lakelandpigfest.org/applications-for-pig-fest/",
      "email": "judges@lakelandpigfest.org"
    },
    {
      "url": "https://pigfesttn.com/",
      "email": "agilley@hvilletn.org"
    },
    {
      "url": "https://lakelandpigfest.org/pigfest-questions/",
      "email": "sponsorships@lakelandpigfest.org"
    },
    {
      "url": "https://callingallcontestants.com/contest/2025-lakeland-pig-festival-pro-division/",
      "email": "prodivision@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "20bill@tinsleycreative.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "20donovan@tinsleycreative.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "20gpizzuti@tampabay.rr.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "20hannah@tinsleycreative.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "20jprevite@hpsadvisors.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "20kaitlyn@tinsleycreative.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "backyarddivision@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "donovan@tinsleycreative.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "donovan@tmrcreative.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "gpizzuti@tampabay.rr.com"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "info@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "judges@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "judgingschool@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "kidsq@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "prodivision@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "sponsors@lakelandpigfest.org"
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "email": "volunteers@lakelandpigfest.org"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "email": "bbooth@eaglebrooke.com"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "email": "madeline.gray@eaglebrooke.com"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "email": "myoungblood@eaglebrooke.com"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "email": "rroberts@eaglebrooke.com"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "email": "rweber@eaglebrooke.com"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "email": "slodovico@eaglebrooke.com"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "email": "wparker@eaglebrooke.com"
    }
  ],
  "mails": [
    "20bill@tinsleycreative.com",
    "20donovan@tinsleycreative.com",
    "20gpizzuti@tampabay.rr.com",
    "20hannah@tinsleycreative.com",
    "20jprevite@hpsadvisors.com",
    "20kaitlyn@tinsleycreative.com",
    "agilley@hvilletn.org",
    "backyarddivision@lakelandpigfest.org",
    "bbooth@eaglebrooke.com",
    "donovan@tinsleycreative.com",
    "donovan@tmrcreative.com",
    "gpizzuti@tampabay.rr.com",
    "info@lakelandpigfest.org",
    "judges@lakelandpigfest.org",
    "judgingschool@lakelandpigfest.org",
    "kidsq@lakelandpigfest.org",
    "madeline.gray@eaglebrooke.com",
    "membership@lhymca.com",
    "myoungblood@eaglebrooke.com",
    "prodivision@lakelandpigfest.org",
    "rroberts@eaglebrooke.com",
    "rweber@eaglebrooke.com",
    "slodovico@eaglebrooke.com",
    "sponsors@lakelandpigfest.org",
    "sponsorships@lakelandpigfest.org",
    "volunteers@lakelandpigfest.org",
    "wparker@eaglebrooke.com"
  ],
  "nombre_sitio": "lakelandpigfest.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.lakelandhillsymca.net/contact/",
      "text": "Contact - Lakeland Hills Family YMCA Skip to content LAKELAND HILLS FAMILY Y LAKELAND HILLS FAMILY Y MENU LAKELAND HILLS FAMILY Y Search for: JOIN REGISTER GIVE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login X CLOSE Toggle Navigation About Who We Are Leadership Team Employment at the Y Financial Reports Facility Information Child Protection Privacy Policy Join Join the Y Membership Benefit Corporate Membership Financial Assistance Give Give Fit For The Future Endowment Volunteer Donors & Partners Programs Programs Overview Adult Sports Adult Sports Overview Adult Basketball Adult Pickleball Adult Sports Leagues Adult Volleyball Certification Courses Childcare & Camps Childcare and Camps Child Watch (Babysitting) Infant & Toddler Care Kids Club Before and After School Care Preschool & Pre-K Summer Camp Rockaway River Country Club Camp Health & Wellness Health & Wellness Overview Active Older Adults Adaptive Programs Group Exercise Adult Healthy Living Programs Personal Training Swimming Swim Overview Adaptive Swim Adult Swim Lessons & Aquatic Exercise Competitive Swim Team Drowning Elimination Parent & Child Water Safety Youth Swim Lessons Youth & Teen Programs Youth & Teen Programs Overview Fit Kids Personal Training Fun & Fitness Preschool Youth Gaming Club STEM Teen Leaders Youth & Teen Special Events Teen Programs Youth & Teen Sports Youth & Teen Sports Overview Basketball Soccer Indoor Youth Leagues Dance Snowboarding Parkour Schedules Events Special Events Youth & Teen Special Events Kids Night Out Annual Golf Outing Annual Dinner Meeting Birthday Parties Turkey Trot Contact More Annual Dinner Meeting Community Engagement Rentals at the Y Vendors & Suppliers News & Media Member Login REGISTER HERE Give Search for: Contact 2025-08-25T10:48:20-06:00 Contact Us Lakeland Hills YMCA is community-centered, bringing people of all ages and backgrounds together, to nurture potential and mobilize local communities to effect lasting and meaningful change. We look forward to helping you with your needs and answering any questions you may have. Feel free to contact us via the form below or through a membership representative at one of our local YMCAs. Contact Us Form × Contact Lakeland Hills Family Y Name * First Last Email * Who do you want to contact? * President and Chief Executive Officer, Alex Martinez Fund Development Associate, Dante Gonzalez Health & Wellness Director, Kelly Najjar Assistant Camp and Program Director, Quentin Pickering Camp & Youth Program Director, Linnea Berry Website Manager, Carmen Fritsch HR Director, Renee Dorn Chief Operating Officer, Devon Maloney Assistant Aquatics Director & Swim Lesson Coordinator, Yash Kothari Controller, Gail Shelby Fitness Director, Gerry Gessie Member Services Coordinator, Hope Hornick IT Director, Jonathan Ogintz Aquatics Manager/Lifeguard Coordinator, Sydney Jasinski Vice President Fund Development, Kaite Burke Community Engagement Manager, Kelly Horvath Early Childhood Learning Center Director, Michele Leaman Buildings and Grounds Assistant Director, Mika Newman Buildings and Grounds Director, Mike Ambrosi Membership Administrator/Day Camp Bookkeeper, Nancy Dunham Member Services Director, Reneé Welch Vice President Marketing and Membership, Rosemary Linder Day Competitive Swim Team & HR Administrator, Sarah Gulbin Senior Program Director, Shannon Bujoreanu Chief Financial Officer, Robert Marzan Early Childhood Learning Center Program Specialist & I-SWAP Manager, Cynthia Rodriguez Message * CAPTCHA Phone This field is for validation purposes and should be left unchanged. Δ Close Lakeland Hills Family YMCA 100 Fanny Road Mountain Lakes, NJ Phone: 973-334-2820 membership@lhymca.com Frequently Asked Questions What are your facility hours? Our hours are: Monday – Friday 5:00 A.M – 10:30 P.M. Saturday – Sunday 7:00 A.M. – 6:00 P.M. Directions Can I access other YMCA’s with my Lakeland Hills YMCA membership? Yes. We are proud to offer our members access to YMCA facilities across the United States and Canada that participate in Nationwide Membership. This way, our members can use the Y as often as they like, making it easier to achieve their health and wellness goals. Are group exercise classes available? Yes. We have over 65 weekly classes offered from Yoga to HIT. These classes offer a great workout in a class setting, and are all included with your membership. Can I bring a friend? Yes. As a member, you are given 3 guest passes per year. You can bring a friend up to 3X for free. After that there is a fee. Guests/friends can use facility a max of 3X per year and then must become a member. Is there a trial membership to try out the Y? Yes. We have a 1-Week Trial Membership for free.  After that, we have several options that you can choose as a new member. What benefits do I get with my membership? Full Privilege Membership entitles you to use the pool, basketball gymnasium, Health and Fitness Training Center, general membership locker rooms, as well as group fitness, yoga, spinning classes, and all aqua exercise classes. Plus, three free guest passes per year and a fitness orientation. Some age restrictions apply. Long Term Locker Membership offers full privilege membership plus an assigned locker and towel service in an adult only locker room which includes steam room, sauna and TV. What are the pool hours? For Pool Hours and available swim times, please visit our schedules page where you can download swim times as well as gymnasium and group fitness class times. Do you offer financial assistance? Yes. We offer financial aid to ensure that no one is turned away from a Y program or service due to an inability to pay. Visit our Financial Assistance page for more information. STAY CURIOUS Want to know more about how you can make an impact in the community? Fill out this simple form to learn how to get involved. About Us Join Give Volunteer Test Contact Leadership Team Register Privacy Policy Member Login Facility Hours Y Hours Mon-Fri: 5:00am-10:15pm Sat-Sun: 7:00am – 5:45pm Desk Hours Mon-Fri: 8:00am-8:00pm Sat-Sun: 8:00am – 4:00pm Learn more >> CONNECT WITH US Copyright © Lakeland Hills YMCA Lakeland Hills YMCA | 100 Fanny Road | Mountain Lakes, NJ 07046 | 973.334.2820 Site designed by Daxko Toggle Sliding Bar Area Page load link Both Tai Chi classes will be cancelled Thursday, September 11. Last chance this week to register for fall classes, which begin Monday, September 8. Registration available 24/7 online. + +"
    },
    {
      "url": "https://lakelandpigfest.org/applications-for-pig-fest/",
      "text": "applications for pig fest - Lakeland Pigfest Home About Community Map FAQ Entertainment Results 2025 2025 anything butt competition winners 2025 kinder’s pro division winners 2025 publix backyard division winners 2025 applegate kids-q winners 2024 2024 anything butt, anything butt appetizer, sauce, dessert, and steak winners 2024 kingsford pro division winners 2024 publix backyard division winners 2024 kids-q winners 2023 2023 anything butt, anything butt sides, sauce, dessert, and steak winners 2023 kingsford pro division winners 2023 publix backyard division winners 2023 kids-q winners 2022 2022 anything butt, sauce and dessert winners 2022 kingsford pro division winners 2022 kids-q winners 2022 publix backyard division winners 2020 2020 anything butt, sauce and dessert winners 2020 kingsford professional contest winners 2020 publix backyard division winners 2020 badcock & more kidsQ winners 2019 2019 kingsford professional contest winners 2019 publix backyard division winners 2019 badcock & more kidsQ winners 2018 2018 Kingsford Professional Contest Winners 2018 Publix Backyard Division Winners 2018 Badcock & More KidsQ Winners 2017 2017 Kingsford Professional Contest Winners 2017 Publix Backyard Winners 2017 Badcock & More KidsQ Winners 2016 2016 kingsford professional contest winners 2016 Publix Backyard Results 2015 2015 Kingsford Professional Contest Results 2015 Publix Backyard Results 2015 Side Contest Results Applications Sponsors Contact Donate Menu Menu applications for pigfest 2026 Rules and Applications will be available October 2025. 2025 Rules Professional Application Rules and KCBS Rules for Professional Teams Backyard Application Rules Kids-Q Rules Team Information Vendor Rules 2025 Team Applications Kingsford Professional Application *We are no longer accepting Kingsford Professional applications for the 2025 event. Publix Backyard Application *We are no longer accepting Publix Backyard applications for the 2025 event. Kids-Q Application *We are no longer accepting Kids-Q applications for the 2025 event. 2025 Lakeland PigFest Kinder’s Professional Application 2025 Lakeland PigFest Publix Backyard Presented by Kingsford Application 2025 Lakeland PigFest Kids-Q Presented by Applegate Application 2025 Lakeland PigFest Kinder’s Professional Application 2025 Lakeland PigFest Publix Backyard Presented by Kingsford Application 2025 Lakeland PigFest Kids-Q Presented by Applegate Application 2025 General Applications KCBS Certified Table Captain Class *We are no longer accepting registrations for the KCBS Certified Table Captain Class for the 2025 event. Non-BBQ Vendor Application *We are no longer accepting applications for Non-BBQ vendors for the 2025 event. 2025 Lakeland PigFest KCBS Certified Table Captain Class Application 2025 Lakeland PigFest Non-BBQ Vendor Application 2025 Lakeland PigFest KCBS Certified Table Captain Class Application 2025 Lakeland PigFest Non-BBQ Vendor Application Judging Applications Any questions or inquiries regarding Judging at the 2025 Lakeland Pigfest please contact Nick Nicholas at judges@lakelandpigfest.org Judges Application *We are no longer accepting Judges applications for the 2025 event. KCBS Certified Barbecue Judging Class *We are no linger accepting registrations for the KCBS Certified Barbecue Judging Class for the 2025 event. 2025 Lakeland PigFest Judges Application 2025 Lakeland PigFest KCBS Certified Barbecue Judge Class Application 2025 Lakeland PigFest Judges Application 2025 Lakeland PigFest KCBS Certified Barbecue Judge Class Application Sponsorship Application Sponsorship Application *We are no longer accepting Sponsorship Applications for the 2025 event. 2025 Lakeland PigFest Sponsorship (General Donation) Pigfest Dates! Friday, January 23, 2026 5:00PM – 10:00PM Saturday, January 24, 2026 10:00AM – 5:00PM Past Results 2025 anything butt competition winners 2025 kinder’s pro division winners 2025 publix backyard division winners 2025 applegate kids-q winners Mailing Address Lakeland Pigfest P.O. Box 8814 Lakeland, Florida 33806 © Copyright Lakeland Pigfest. All Rights Reserved. Scroll to top"
    },
    {
      "url": "https://pigfesttn.com/",
      "text": "PigFest TN | BBQ Competition & Concert Hendersonville, TN 615-822-3898 pigfesttn@gmail.com Home Competitors Sponsors Vendors Past Results Community Partners Media Become A Judge Select Page DATE OCTOBER 23 – OCTOBER 25, 2025 LOCATION 140 SCOTCH STREET, VETERANS PARK HENDERSONVILLE, TN 37075 Three Great Days, More Great Causes, All in Hendersonville, TN! THURSDAY, OCT 23rd Steak Dinner | Silent Auction Trivia | Parking Palette BUY TICKETS HERE! THURSDAY, OCT 23rd Jeff Jarrett, “The Last Outlaw” All-Star Super Slam! BUY TICKETS HERE! FRIDAY, OCTOBER 24th Hendersonville Hometown Jam Kick-off Concert! BUY TICKETS HERE! SATURDAY, OCT 25th BBQ Competition | College Football KidzZone | Pig Races & more… FREE TO ATTEND The Countdown Has Begun to Pigfest 2025! Day(s) : Hour(s) : Minute(s) : Second(s) About The Event The 5th Annual Hendersonville Pig Fest returns to Veterans Park October 23–25, 2025! This three-day celebration brings the community together to support local charities with nonstop fun for the whole family. Enjoy an ALL-STAR Wrestling Match , the Hendersonville Hometown Jam Friday Night Concert , and Saturday’s sizzling Backyard BBQ Competition . Plus, don’t miss food trucks, local vendors, live music, pig races, kidz zone fun, and even The Parking Palette community painting project. Mark your calendars for October 23–25, 2025 —you don’t want to miss Hendersonville’s biggest backyard party! Thursday Night ALL-STAR SUPER SLAM with Jeff Jarrett! 🔥Get ready to RUMBLE, Hendersonville!🔥 Grab your crew and join us on Thursday, October 23rd, for an action-packed night of body slams when Double J “The Last Outlaw” Hall of Famer – Jeff Jarrett comes home to Hendersonville and brings his All Star Super Slam with him! And, for the first time in his career, he will be in the wrestling rink at PigFest! Tickets go on sale Friday, August 22nd, at 10:00 AM! GET YOUR TICKETS HERE! Steak Dinner, Trivia & Parking Palette 🔥Bring Your Appetite, Your Smartest Friends, and Your Imagination!🔥 Get ready for the first unforgettable evening of PigFest 2025 happening at Veterans’ Park on Thursday, October 23rd! Join us for a fantastic night filled with trivia, delicious steaks, and amazing giveaways from our generous sponsors. Plus, don’t miss the chance to make your mark on this year’s Parking Palette, courtesy of Servpro Sumner County ! We’re thrilled to have ExS Group (Exterior Solutions Group – Pool Leak Detection and Repair), Candee Potter , One Stop Realty , Main Street Pub , Tailgate Nashville , and Pub Peril partnering with us to bring you a spectacular night of fun, food, and fabulous prizes! All proceeds from this exciting night will benefit local non-profit organizations, Live Love Nashville , Grace Place , Christmas 4Kids , and Mary’s Magical Place . PARKING PALETTE DETAILS: Event Guidelines: – You can repaint or refresh your parking spots anytime within a year after the event. – Assigned parking spots do not come with special parking privileges. – Artists must leave about a four-inch unpainted border between the white parking lines and their artwork. – All designs must be approved by the Parks Department. – Supplies are generously provided by SERVPRO Sumner County. – PROHIBITED PAINTS: Please refrain from using oil-based paints, reflective paint, spray paint, fluorescent paint, paint sprayers, or clear coats. Don’t miss out on this incredible night at PigFest — mark your calendars! TIME: 5:30-10:00 PM PURCHASE TICKETS THIS YEAR’S CHARITY BENEFICIARIES HENDERSONVILLE HOMETOWN JAM CONCERT LIVE with Country Music Royalty The Oak Ridge Boys! FRIDAY NIGHT, OCTOBER 24, 2025 | GATES OPEN AT 5:00 PM PigFest 2025 kicks off with a legendary BANG! as The Oak Ridge Boys take the stage! With decades of chart-topping hits, Grammy-winning harmonies, and unforgettable energy, these icons are bringing their signature sound to Hendersonville, TN’s PigFest for an epic night of music and memories. From “Elvira” to “American Made,” their timeless classics have been the soundtrack of generations—and now, they’re headlining the PigFest 2025 Kickoff Concert ! Whether you’re a lifelong fan or discovering their magic for the first time, get ready for a night filled with foot-stompin’, hand-clappin’, soul-liftin’ country goodness. The legends are live. The crowd will be electric. The memories…Unforgettable! Don’t miss The Oak Ridge Boys at PigFest 2025. Get Your Tickets Now! PURCHASE TICKETS Friday Night Music Continues With More Dynamic Performers! Exile Eric Blankenship DINKVILLE PICKLE N’ PIG CHARITY PICKLEBALL TOURNAMENT Saturday, October 25th & Sunday, October 26th Drinks Dinner Concert BBQ Competition For more information or to register a booth for the Backyard BBQ Competition, click the button underneath. SPACE IS LIMITED. REGISTER EARLY! Register Here Become a Vendor For more information or to register a booth for an opportunity to become a vendor at PigFest, click the button underneath. SPACE IS LIMITED. REGISTER EARLY! Sold Out Sponsor The Event For more information on being an event sponsor, view the Sponsorship Page or contact Andy Gilley with the Hendersonville Parks Department. Sponsor Here Become A Judge Have some fun and enjoy great BBQ. Apply to become a PigFest Volunteer Judge! Register Here Check Out Last Year’s Pig Fest! The activities from this event go to support local non-profits and charities in Hendersonville, TN CONTACT US FOR QUESTIONS OR TO BECOME A SPONSOR Complete the form here or call: (615) 822-3898 Name Email Address Phone Message Submit Copyright © 2025 HolidayFest TN | All Rights Reserved | Site Created by Navarro Creative Group"
    },
    {
      "url": "https://lakelandpigfest.org/pigfest-questions/",
      "text": "pigfest questions - Lakeland Pigfest Home About Community Map FAQ Entertainment Results 2025 2025 anything butt competition winners 2025 kinder’s pro division winners 2025 publix backyard division winners 2025 applegate kids-q winners 2024 2024 anything butt, anything butt appetizer, sauce, dessert, and steak winners 2024 kingsford pro division winners 2024 publix backyard division winners 2024 kids-q winners 2023 2023 anything butt, anything butt sides, sauce, dessert, and steak winners 2023 kingsford pro division winners 2023 publix backyard division winners 2023 kids-q winners 2022 2022 anything butt, sauce and dessert winners 2022 kingsford pro division winners 2022 kids-q winners 2022 publix backyard division winners 2020 2020 anything butt, sauce and dessert winners 2020 kingsford professional contest winners 2020 publix backyard division winners 2020 badcock & more kidsQ winners 2019 2019 kingsford professional contest winners 2019 publix backyard division winners 2019 badcock & more kidsQ winners 2018 2018 Kingsford Professional Contest Winners 2018 Publix Backyard Division Winners 2018 Badcock & More KidsQ Winners 2017 2017 Kingsford Professional Contest Winners 2017 Publix Backyard Winners 2017 Badcock & More KidsQ Winners 2016 2016 kingsford professional contest winners 2016 Publix Backyard Results 2015 2015 Kingsford Professional Contest Results 2015 Publix Backyard Results 2015 Side Contest Results Applications Sponsors Contact Donate Menu Menu pigfest questions? Frequently Asked Questions About Pigfest 1. How Do I Get to Pigfest? 4175 Medulla Rd Lakeland, FL 33811 Phone: 863-644-2431 I-4 East – Exit 22 South Continue South on Park Rd. At third light, turn East (left) on Coronet Rd. Follow Coronet, turn East (left) on Medulla Rd. At the light turn South (right) on County Line Rd. and then East (left) on W. Pipkin Rd. and proceed to the Public Parking Area I-4 East / West – Exit 25 Proceed South on County Line Road and turn East (left) on West Pipkin Rd. and proceed to the Public Parking Area. I-4 East / West – Exit 27 Polk County Parkway – Hwy 570 East (Toll – 50 cents) Exit South (right) onto Waring Rd. exit. Continue South to Pipkin Road and turn West (right) on to Pipkin Rd. Turn West (right) again on W. Pipkin Rd. Pass GEICO and proceed to the Public Parking Area. I-4 East/ West – Exit 41 Polk County Parkway – Hwy 570 West (Toll – $3.00) Take Waring Rd. exit and turn South (left) at the light. Continue South on Waring Rd. to stop light and turn West (right) on Pipkin Road. Pass GEICO and proceed to the Public Parking Area. State Road 60 East / West North on County Line Rd. – East (right) on W. Pipkin Rd. and proceed to the Public Parking Area. 2. I plan on attending the Lakeland Pigfest, so where do I park? Once you arrive at the Lakeland Pigfest, the public parking is clearly marketed and FREE of charge , simply follow the signage to available parking and the entry. 3. How much does it cost to attend Pigfest? Admission into Lakeland Pigfest is just $5 per person and kids 12 and younger can enter at no charge with an adult. Once inside the gates, stop by a Pig Bucks booth (located near the entrance and various locations throughout) and exchange your cash for Pig Bucks, the official currency of the Lakeland Pigfest. By purchasing food from competition teams, you are supporting their efforts and local charities. Trust us…the food is worth it! 4. I cannot volunteer or attend, but would like to support the charitable interests Pigfest supports – how can I help? Pigfest welcomes members of the community who would like to donate or sponsor this year’s event and help support the ongoing charitable efforts of our organization. If you or your organization would like to help, please visit our sponsors’ page on this website or contact our sponsorships coordinator, Bob Wabbersen, at sponsorships@lakelandpigfest.org for more information. 5. I am a part of a competition BBQ team and would like to compete – what is the process for entering? Pigfest gives returning teams the opportunity to return to each year’s competition prior to opening entry for new BBQ Teams.  In rare instances, we have a limited number of spots open up to new competition teams.  Find the applications located here. 6. I am interested in becoming a certified KCBS BBQ Judge.  What is the process for applying? KCBS will offer a Judging School at the Lakeland Pigfest location in Lakeland, FL.  You must apply prior to attending this class.  Applications are available here . KCBS teams are known for cooking some of the best barbeque in the world, but it takes a dedicated team of judges to decide which is truly the best-of-the-best. Being a Certified Barbeque Judge (CBJ) means more than just getting to taste award-winning barbeque – and deciding which barbeque wins those awards. It’s about representing and spreading the message of KCBS, which is to promote America’s cuisine – barbeque.  To become a CBJ, just attend this class conducted by KCBS. In just four hours, you’ll learn how to grade world-class chicken, pulled pork, ribs and brisket – and taste them during the process! By the time you’re finished, you’ll be ready to sign up for the next competition in your area! And remember: your CBJ fee also includes one year’s membership to KCBS. It’s a win-win! Pigfest Dates! Friday, January 23, 2026 5:00PM – 10:00PM Saturday, January 24, 2026 10:00AM – 5:00PM Past Results 2025 anything butt competition winners 2025 kinder’s pro division winners 2025 publix backyard division winners 2025 applegate kids-q winners Mailing Address Lakeland Pigfest P.O. Box 8814 Lakeland, Florida 33806 © Copyright Lakeland Pigfest. All Rights Reserved. Scroll to top"
    },
    {
      "url": "https://callingallcontestants.com/contest/2025-lakeland-pig-festival-pro-division/",
      "text": "2025 Lakeland Pig Festival (Pro Division) | CAC Skip to content Search ... Results See all results Recipe Contests Cooking Competitions BBQ Competitions Wine Competitions Spirits Competitions Beer Competitions MISC Competitions Search ... Results See all results Recipe Contests Cooking Competitions BBQ Competitions Wine Competitions Spirits Competitions Beer Competitions MISC Competitions Search ... Results See all results Recipe Contests Cooking Competitions BBQ Competitions Wine Competitions Spirits Competitions Beer Competitions MISC Competitions 2025 Lakeland Pig Festival (Pro Division) Entry Deadline: January 23, 2025 Categories: BBQ Competitions Contact Information prodivision@lakelandpigfest.org 863-245-8078 Venue / Location Sun ‘n Fun 4175 Medulla Road Lakeland, FL 33811 General Information Competition – January 24-25, 2025 This is a State Championship. We are proud to announce that the 28th Annual Lakeland Pigfest will again be held at the SUN n’ FUN Expo Campus in Lakeland, Florida, on January 24th and January 25th, 2025. Join the Lakeland Pigfest Board of Directors and the over 150 competition barbecue teams for a weekend of good eatin’, good friends, and good tunes to benefit Lakeland-area charities as we kick off the 28th Annual Lakeland Pigfest! Entry Fees Per Entry Fee – $325.00 (Team) Per Entry Fee – $25.00 (Sauce) Per Entry Fee – $25.00 (Dessert) Per Entry Fee – $25.00 (Anything Butt) Prizes / Awards / Medals / Ribbons Prize Money – $25,000.00 Grand Champion – $6,500.00 Reserve Grand Champion – $3,000.00 Third Overall – $1,000.00 Fourth Overall – $650.00 Fifth Overall – $550.00 Category Winners Chicken – Pork Ribs – Pork and Beef Brisket 1st Place – $850.00 2nd Place – $650.00 3rd Place – $550.00 4th Place – $350.00 5th Place – $250.00 6th Place – $175.00 7th Place – $150.00 8th Place – $125.00 9th Place – $110.00 10th Place – $100.00 Trophies will be awarded for 1st – 5th Place in all four meat categories. Ribbons will be awarded for 6th – 10th Place in all four meat categories. Governor’s Award – Trophy to the highest overall scoring team from Florida Plus Grand Champion 1. Entry fee for following year waived 2. Qualified to American Royal Invitational 3. Lottery entry for the Jack Daniel’s World of Barbeque Dessert, Sauce & Anything Butt 1st Place – 30% of Entries 2nd Place – 20% of Entries 3rd Place – 10% of Entries How To Enter / Competition Information Rules & Regs / Contest Information THE gateway to an ever expanding world of contests and competitions. Written on behalf of, and devoted to, the Contestant. Facebook X Instagram Pinterest Youtube Envelope About Us Contact News Briefs Trade/Expos Privacy Disclosure Sitemap Archive / Past Contests Study Contests From Years Past Recipe Contests Wine Competitions Cooking Competitions Spirits Competitions BBQ Competitions Beer Competitions Misc Competitions Copyright © 2018 – 2025 Calling All Contestants. All Rights Reserved. All other trademarks and trade names are properties of their respective owners. Manage Cookie Consent This website uses cookies and similar technologies to provide functionality that supports your browsing experience, to analyze site traffic, to personalize content, and to serve targeted advertisements to you. By clicking the \"I accept\" button, you consent to the use of cookies and similar technologies and the sharing of the information collected as described in our Privacy Policy Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes I Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Contest News delivered to your inbox By Clicking “Sign Me Up”, you confirm you have read, understand and agree to our Privacy Policy ."
    },
    {
      "url": "https://lakelandpigfest.org/contact-pigfest/",
      "text": "contact pigfest - Lakeland Pigfest Home About Community Map FAQ Entertainment Results 2025 2025 anything butt competition winners 2025 kinder’s pro division winners 2025 publix backyard division winners 2025 applegate kids-q winners 2024 2024 anything butt, anything butt appetizer, sauce, dessert, and steak winners 2024 kingsford pro division winners 2024 publix backyard division winners 2024 kids-q winners 2023 2023 anything butt, anything butt sides, sauce, dessert, and steak winners 2023 kingsford pro division winners 2023 publix backyard division winners 2023 kids-q winners 2022 2022 anything butt, sauce and dessert winners 2022 kingsford pro division winners 2022 kids-q winners 2022 publix backyard division winners 2020 2020 anything butt, sauce and dessert winners 2020 kingsford professional contest winners 2020 publix backyard division winners 2020 badcock & more kidsQ winners 2019 2019 kingsford professional contest winners 2019 publix backyard division winners 2019 badcock & more kidsQ winners 2018 2018 Kingsford Professional Contest Winners 2018 Publix Backyard Division Winners 2018 Badcock & More KidsQ Winners 2017 2017 Kingsford Professional Contest Winners 2017 Publix Backyard Winners 2017 Badcock & More KidsQ Winners 2016 2016 kingsford professional contest winners 2016 Publix Backyard Results 2015 2015 Kingsford Professional Contest Results 2015 Publix Backyard Results 2015 Side Contest Results Applications Sponsors Contact Donate Menu Menu contact pigfest The continued success of the Lakeland Pigfest is in no small part due to the unwavering support of its organizers. When the seeds for the festival were first planted in 1994, the small group of local businessmen knew that in order to put on a Kansas City Barbecue Society (KCBS) sanctioned event in Lakeland, dedication was a must. Almost 30 years later, the commitment could not be stronger and we welcome you to contact our event coordinators with questions, comments, or suggestions. To e-mail any of the following members, please click on their name. mailing address Lakeland Pigfest P.O. Box 8814 Lakeland, Florida 33806 pigfest executive committee Donovan Tinsley │ President Larry Holmes │ 1st Vice President Bob Wabbersen │ 2nd Vice President Coleen Pizzuti │  Secretary James Previte │ Treasurer Bill Tinsley | Immediate Past President email us info@lakelandpigfest.org │ General Inquiries to Pigfest sponsors@lakelandpigfest.org │ Sponsorships judgingschool@lakelandpigfest.org │ Judging School volunteers@lakelandpigfest.org │ Volunteer Support prodivision@lakelandpigfest.org │  Kingsford Professional Division judges@lakelandpigfest.org │ Kingsford Professional Judging backyarddivision@lakelandpigfest.org │ Publix Backyard Division kidsq@lakelandpigfest.org │ Kids-Q Website or Marketing inquiries can be made to info@lakelandpigfest.org . Pigfest Dates! Friday, January 23, 2026 5:00PM – 10:00PM Saturday, January 24, 2026 10:00AM – 5:00PM Past Results 2025 anything butt competition winners 2025 kinder’s pro division winners 2025 publix backyard division winners 2025 applegate kids-q winners Mailing Address Lakeland Pigfest P.O. Box 8814 Lakeland, Florida 33806 © Copyright Lakeland Pigfest. All Rights Reserved. Scroll to top"
    },
    {
      "url": "https://www.eaglebrooke.com/contact-us",
      "text": "Contact Us, Driving Directions | The Club at Eaglebrooke 863.701.0101 | CONTACT US Skip to main content Golf Book a Tee Time The Course Mobile APP Practice Facility Golf Instruction Junior Golf New to Golf? Book a Tee Time The Course Mobile APP Practice Facility Golf Instruction Junior Golf New to Golf? Events Weddings & Showers Banquets & Parties Outings & Tournaments Calendar of Events Weddings & Showers Banquets & Parties Outings & Tournaments Calendar of Events Membership Member Resources Join Eaglebrooke Men's Golf Association Member Resources Join Eaglebrooke Men's Golf Association Dine Contact Us Contact Us Contact Us Store Community Pages Homeowners Association Community Development Homeowners Association Community Development Search Close Search Keyword Search Search Keyword Search 87° Thu 09/11 clear sky 90°/73° Fri 09/12 overcast clouds 86°/74° Sat 09/13 light rain 87°/71° BOOK A TEE TIME Contact Us Get in touch or find driving directions to The Club at Eaglebrooke X CONTACT INFORMATION ADDRESS 1300 Eaglebrooke Blvd Lakeland, Florida 33813 PHONE 863.701.0101 FEEDBACK Comments & suggestions: Please call 888-986-0699 GET IN TOUCH OR FIND US Please submit your inquiry and a member from our team will in touch. You may also contact us by other means below; utilize the map below for directions. We hope to see you soon! CONTACT US FORM First Name Last Name Email Phone Subject Message Submit MEET THE TEAM RYAN ROBERTS General Manager 863.701.0101 Ext 9 Email RICK WEBER Head Golf Professional 863.701.0101 Ext 7 Email WESLEY PARKER Superintendent 863.701.0101 Email MADELINE GRAY Membership Sales & Billing 863.701.0101 Ext 5 Email MONICA YOUNGBLOOD Banquet Sales & Event Coordinator 863.701.0101 Ext. 6 Email BRANDY BOOTH Food & Beverage Manager 863.701.0101 Ext 2 Email SAM LODOVICO Executive Chef 863.701.0101 ext. 8 Email LET'S GET SOCIAL FOLLOW US ON FACEBOOK Follow us on Facebook to know what events and specials are happening. TAG US ON INSTAGRAM Let's share photos! Check in on Instagram on your next visit. READ OUR REVIEWS See what others are saying about the course. Read reviews from past guests. BOOK A TEE TIME Don't pay fees! Book direct through our website. Book A Round MANAGED BY QUICK LINKS The Course Calendar of Events Golf Outings Online Store Careers CONTACT US 863.701.0101 Submit an Inquiry facebook instagram ADDRESS 1300 Eaglebrooke Blvd Lakeland, Florida 33813 Get Driving Directions PLAY GOLF CALL 863.701.0101 OR Book A Tee Time NEWSLETTER SUBSCRIBE TO GET THE LATEST NEWS AND OFFERS I consent to receive emails from The Club at Eaglebrooke. I can unsubscribe anytime. Email Thank you for subscribing. Enter Another Email Subscribe Copyright © 2025. The Club at Eaglebrooke. All Rights Reserved. Privacy Policy Terms of Use Accessibility Sitemap"
    }
  ]
}