{
  "fuentes": [
    {
      "url": "https://www.lakecitychamber.com/",
      "email": "info@lakecitychamber.com"
    },
    {
      "url": "https://www.mylakealfred.com/205/City-Manager",
      "email": "rleavengood@mylakealfred.com"
    },
    {
      "url": "https://www.lcfla.com/hr/page/city-manager",
      "email": "hr@lcfla.com"
    },
    {
      "url": "https://www.lakecityfl.com/privacy-policy/",
      "email": "tdc@columbiacountyfla.com"
    },
    {
      "url": "https://www.lakecityfl.com/privacy-policy/",
      "email": "digital@paradiseadv.com"
    },
    {
      "url": "https://www.lakecityfl.com/partners/",
      "email": "ccoleman@columbiacountyfla.com"
    },
    {
      "url": "https://www.lakecityfl.com/partners/",
      "email": "kmathis@columbiacountyfla.com"
    },
    {
      "url": "https://www.lakecityfl.com/partners/",
      "email": "mmoore@columbiacountyfla.com"
    },
    {
      "url": "https://www.visitlakecitysc.com/contact-us",
      "email": "info@visitlakecitysc.com"
    },
    {
      "url": "https://www.visitlakecitysc.com/contact-us",
      "email": "visituga@uga.edu"
    },
    {
      "url": "https://iamlakelandflorida.com/about_us/",
      "email": "info@iamlakeland.com"
    },
    {
      "url": "https://www.lakecitystorage.com/contact-us",
      "email": "47@lakecitystorage.com"
    },
    {
      "url": "https://www.lakecitystorage.com/contact-us",
      "email": "one@lakecitystorage.com"
    },
    {
      "url": "https://www.lakecitystorage.com/contact-us",
      "email": "stephen@lakecitystorage.com"
    },
    {
      "url": "https://www.lakecitystorage.com/contact-us",
      "email": "two@lakecitystorage.com"
    },
    {
      "url": "https://corallyus.com/contact/",
      "email": "sales@corallyus.com"
    }
  ],
  "mails": [
    "47@lakecitystorage.com",
    "ccoleman@columbiacountyfla.com",
    "digital@paradiseadv.com",
    "hr@lcfla.com",
    "info@iamlakeland.com",
    "info@lakecitychamber.com",
    "info@visitlakecitysc.com",
    "kmathis@columbiacountyfla.com",
    "mmoore@columbiacountyfla.com",
    "one@lakecitystorage.com",
    "rleavengood@mylakealfred.com",
    "sales@corallyus.com",
    "stephen@lakecitystorage.com",
    "tdc@columbiacountyfla.com",
    "two@lakecitystorage.com",
    "visituga@uga.edu"
  ],
  "nombre_sitio": "lakecityfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.lakecitychamber.com/",
      "text": "Home - Lake City-Columbia County Chamber of Commerce Skip to content Login Email (386) 752-3690 Facebook Twitter Instagram LinkedIn Menu About Us Who We Are Our Team Board of Directors Success Stories Contact Membership Why Join FAQ & Resources Member News Join the Chamber Job Postings Member Login Get Involved Calendar of Events Signature Events Programs Committees Job Board Join Today! WELCOME TO THE Lake City – Columbia County Chamber of Commerce Connect Join the Chamber Apply Now! Search Find a Member View Members Network Calendar of Events See Events Thank You to Our Chamber Builders Advanced Project Solutions Anderson Columbia Busy Bee Cape City of Lake City Circle of Life Columbia County Core Civic Florida Power & Light First Federal Bank Florida Gateway College HCA Florida Lake City Hospital Lake City Hotels Lettering.com Millennium Bank North Florida Mega Industrial Park Nutrien Odom, Moses & Company/Raymond James Renant Bank Titan MRI TMT Roofing VyStar Credit Union Next Previous Your Community Chamber We’re here for you. We are the forefront of business support, guiding enterprises through the ups and downs of the corporate world. As the ultimate facilitator, connector, and enthusiastic supporter, we take pride in celebrating your successes and offering assistance during challenging times. Whether you're a budding startup or an established industry titan, our members are granted unparalleled opportunities to develop connections that propel their business to new heights. By engaging in our diverse range of events, participating actively in our committee work, and even stepping up as a sponsor, businesses of all sizes can unlock the key to attracting and retaining top-tier talent, as well as reaping the multitude of rewards that come with active involvement. Get Connected Get plugged in and start to watch your business grow View Calendar Mark Your Calendar Upcoming Events View all Events © 2025 Lake City-Columbia County Chamber of Commerce | Site by GrowthZone Resources Facebook Twitter Instagram LinkedIn Business card icon Member Directory Lock icon Member Login Get in touch Lake City Columbia County Chamber of Commerce Address & Map 875 SW SR 47 | Lake City, FL 32025 Phone icon (386) 752-3690 Envelope icon info@lakecitychamber.com © 2025 Lake City-Columbia County Chamber of Commerce. All Rights Reserved. Site by GrowthZone"
    },
    {
      "url": "https://www.mylakealfred.com/205/City-Manager",
      "text": "City Manager | Lake Alfred, FL Skip to Main Content Phone: 863-291-5270 Search Your Government City Departments Doing Business Our Community How Do I... Home Your Government City Manager City Manager Mr. Ryan Leavengood has been Lake Alfred's City Manager since March of 2012. He was formerly the Assistant City Manager for the City of Auburndale. Ryan has a Master's Degree in Public Administration and a Bachelor's Degree of Science in Environmental Policy and Science. He was inducted into Pi Alpha Alpha, the national honor society for students of public administration and was the 2007 recipient of the B. Harold Farmer Scholarship. Mr. Leavengood is a member of the International City/County Management Association (ICMA) and the Florida City/County Management Association (FCCMA). He currently sits on the Board of Directors for the FCCMA as the District 8 Director and is also the Chair of the Polk County Manager's Group. Message The City of Lake Alfred is proud and welcomes you to a dynamic community that is well-positioned for the future. As we develop the path of Lake Alfred's future; we celebrate its past and embrace the present. The City administration is guided by the concept of stewardship and understands that the decisions today will have a lasting impact on tomorrow. Each decision that impacts the community must be carefully considered and our staff is working diligently to provide residents and future generations with an outstanding quality of life. Contact Us Ryan Leavengood City Manager Email Ryan Leavengood Phone: 863-291-5270 Agendas & Minutes Boards & Committees Application for Board Appointment (PDF) Community Redevelopment Agency (CRA) Board General Employees’ Retirement Board Parks & Recreation Board Planning & Zoning Board Police & Fire Retirement Board Special Magistrate City Commission City Manager Schedules & Notices Agendas & Minutes Meeting Schedule Pay My Bill Employment Report a Concern Building Permits Agendas & Minutes Library Contact Us City of Lake Alfred 155 E Pomelo Street Lake Alfred FL Phone: 863-291-5270 Staff Directory Quick Links City Commission Parks & Facilities Garbage & Recycling Unified Land Development Code (PDF) Public Records Requests /QuickLinks.aspx Helpful Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.lcfla.com/hr/page/city-manager",
      "text": "City Manager | City of Lake City, FL Skip to main content Navigation Video Tour Your Government Column 1 Boards and Committees City Council and Charter Officers Agendas and Minutes Youtube Channel Ordinances & Business Impact Estimates City Department Column 2 Administration Airport Customer Service Finance Fire Human Resources Column 3 City Events/City Parks Utilities Growth Management Police Procurement Public Works Our Community Column 1 Downtown BBQ Showdown Fire Station 2 Project I-75/SR47 Wastewater Improvement Project Gwen Lake Restoration Project Natural Gas Hydro Test Opens in new window PDF Download Word Download Excel Download PowerPoint Download Document Download Search form Search Website Human Resources City Manager Job Status: Closed - no longer accepting applications Job Reference Number: City Manager Back to Job Openings City of Lake City, FL (approx. pop. 12,352) City Manager Incorporated in 1859, the City of Lake City is a warm, friendly hometown community located in central northern Florida, 60 miles west of Jacksonville, 45 miles northwest of Gainesville, and 95 miles east of the state capital, Tallahassee.  Situated near the intersection of two of Florida’s most highly traveled interstates, I-10 and I-75, Lake City is known as the Gateway to Florida.  It has a uniquely pristine natural beauty, including its many crystal-clear freshwater springs, lakes, and rivers, making for spectacular outdoor adventures, among other attractions.  The City of Lake City has a Council-Manager form of government that includes a Mayor, elected at-large, and four elected Council members, elected in non‐partisan district races, all serving four-year terms.  The Council appoints the City Manager to oversee the administration of the City’s day-to-day personnel and operational activities.  The City provides a full range of municipal services, including fire, police, public works, recreation, utilities (natural gas, water, and wastewater), and a general aviation municipal airport.  The City has an approved FY2022 total budget of $60.6 million, including a General Fund of $17.4 million, and employs a workforce of 197 full-time employees.  Requirements include a Bachelor’s degree in Public or Business Administration or a closely related field, along with ten (10) years of executive-level municipal or corporate management experience or an equivalent combination of training and experience.  Experience in growth management, economic development, utilities, budgeting, strategic planning, and performance management is a plus.  Starting salary is dependent on qualifications.  The City offers an excellent benefits package, including participation in the Florida Retirement System (FRS).  Resume review will begin November 18, 2021; the position is open until filled.  For more information or to apply, visit www.srnsearch.com .  If you have questions, please contact S. Renée Narloch, President, S. Renée Narloch & Associates, 850.391.0000 or info@srnsearch.com .  The City of Lake City is an Equal Opportunity Employer.  Under Florida’s Public Records/Sunshine Laws, applications and resumes are subject to public disclosure. Supporting Documents city_manager_-_no_jat_02262018.doc (64 KB) Current Job Openings Financial Reporting - Section 112.664 (Oct. 2022) Hiring Process with Billie Jo Bible Contact Information Human Resources, City Hall BillieJo Bible, HR Director 205 North Marion Avenue Lake City, FL 32055 386-719-5804 hr@lcfla.com View Full Contact Details Home Staff Login Contact Us 205 N. Marion Ave. Lake City, FL 32055 | (386)752-2031 City Hall Hours: Monday-Friday 8:00am – 5:00pm ADA Compliance Disclaimer & Privacy Policy Notice of Nondiscrimination a municode design"
    },
    {
      "url": "https://www.lakecityfl.com/privacy-policy/",
      "text": "Privacy Policy - Lake City , FL Skip to content Search… Instagram Facebook Weddings and Groups Media Sports Partners Menu Close Lake City Things to Do Open menu Activities and Attractions Culture and History Parks and Outdoors Dining Shopping Springs and Lakes Where to Stay Events Open menu Calendar Signature Events Plan Your Trip Open menu Stories Weather Map Weddings and Groups Media Sports Partners Request a Visitor Guide Instagram Facebook Search… Things to Do Activities and Attractions Culture and History Parks and Outdoors Dining Shopping Springs and Lakes Where to Stay Events Calendar Signature Events Plan Your Trip Stories Weather Map Lake City Events Calendar Signature Events Plan Your Trip Stories Weather Map Thank you for visiting the official website of the Columbia County Tourist Development Council (the “Council”). Our website, lakecityfl.com, springsrus.com and other domains, subdomains, portals and any related online content (collectively, the “sites” or “online services”) controlled by the Council are offered as a service to the citizens of Columbia County and to the general public. Terms of Use By accessing this site and its contents, you hereby agree to accept the following terms and conditions and to not use this site for any unlawful activity. Public Records & E-Mail Under Florida law e-mail addresses communicated to or held by a state agency are public records. If you wish to avoid any possibility of your e-mail address being released in response to a public records request to the Council, you should not send electronic mail to the Council or otherwise provide it through our online services. Instead, you may contact the Council or another appropriate agency of Columbia County, Florida, by calling 386-758-1005 or writing to 135 NE Hernando Avenue, Suite 203 Lake City, FL 32056-1529. Any e-mail communications by you made through e-mail or messaging system links contained on this or any other site controlled by the Council shall in no way constitute legal notice to the Council, its members, or staff. E-mail direct to appropriate Columbia County or Council staff should be used to address any specific business issues or site content. Comments, questions or recommendations may be directed to the webmaster via email by clicking here. Photo Use and Copyright Notice All photographs, images, videos, and other visual content appearing on the Council’s websites and online services are protected by copyright and are the exclusive property of the Columbia County Tourist Development Council, unless otherwise noted. These materials may not be copied, reproduced, republished, downloaded, posted, transmitted, or distributed in any form without the prior written permission of the Council. Unauthorized use of any content, especially for commercial purposes, may constitute copyright infringement and is strictly prohibited. The Council reserves the right to pursue legal action against any individual or entity found using Council-owned visual content without permission. For licensing requests or questions about image use, please contact TDC@columbiacountyfla.com . Rights to Use Content – Terms and Conditions We’re excited to share your social content. By replying to the Council’s consent request to participate in CrowdRiff (a content aggregation tool) with the hashtags #sharespringlands or #springsrus, you grant the COLUMBIA COUNTY TOURIST DEVELOPMENT COUNCIL and its affiliates, subsidiaries, successors, assigns, licensees, sub-licensees, agents, contractors and officials an irrevocable, worldwide, royalty-free, unrestricted, perpetual sub-licensable (through multiple tiers) and transferable right and license to use, copy, transmit, publish or otherwise distribute, modify, create derivative works based upon, incorporate into other works, publicly perform and display the content or any portion thereof, in or through any medium, whether now known or hereafter created (including, but not limited to, on the Council’s Facebook pages, other websites owned or controlled by the Council, its affiliates or anyone acting on the Council’s authority, and in e-mails, Facebook, Twitter or Instagram communications), for any and all lawful purposes without compensation to you, and agree to execute documents, instruments or agreements confirming such right and license at the Council’s reasonable request. You agree that any and all content posted by you on any form of social media (“Content”) is non-confidential and represent that you are the sole owner of the Content and that Council’s use of the content will not violate the rights of any third party, including, but not limited to, copyright rights, and that you will defend and hold harmless the Council from any and all claims arising therefrom. You are at least 18 years of age, you have the legal right to enter into this agreement and you are not impersonating anyone else. You own all rights in and to your Content including without limitation, all rights to the audio, video and or digital recording and performance contained in your Content (if any) and/or you have acquired all necessary rights to the elements appearing in your Content to enable you to grant the same rights to Council as described herein. Your Content is wholly original and does not infringe on the copyright, trademark, patent, trade secret or any other intellectual property rights, privacy rights, or any other legal or moral rights of any third party individual or entity. You agree to release and allow all creative license and creative treatment in the use and production of your Content at the discretion of Council and its affiliate agents. You voluntarily agree to waive all “moral rights” that you may have to your Content. Any information contained in your Content is not known to you to be false, inaccurate or misleading. Your Content does not violate any law. You were not and will not be compensated or granted any consideration by the Council or any other third party for submitting your Content. You will not be compensated or granted any consideration in any way by the Council or any other third party for the use of your Content. Your Content does not incorporate materials from a third party website, copyright protected materials or personally identifiable information of anyone other than yourself. You agree to irrevocably release and forever discharge the Council and its agents, contractors, officials and employees from any and all actions, claims, damages, liabilities and demands, whether absolute or contingent and of any nature whatsoever, which you now have or hereafter can, shall or may have against the Council, its agents, contractors, officials or employees without limitation resulting from the use of your Content or anything contained therein. Indemnification You agree to indemnify, defend and hold harmless the Council and its agents, contractors, officials and employees from and against any and all claims, liabilities, damages, losses, costs, expenses or fees (including a reasonable amount of attorney’s fees) that such parties may incur as a result of or arising from your breach of these terms and conditions. The Council reserves the right in its sole discretion to assume the exclusive defense and control of any matter otherwise subject to indemnification by you and you agree to cooperate with the Council’s defense of such claims. Modifications to These Terms and Conditions The Council may, at its sole discretion, change these Terms and Conditions at any time. Any such changes will be posted on lakecityfl.com along with the new effective date. Takedown Should you want your Content removed from the Council’s website, you will need to send an email message to TDC@columbiacountyfla.com. Once the Council acknowledges receipt of your email request, please allow 30 days for any action to take place. Non-Confidentiality You understand and agree that your Content will be publicly displayed and it will not be treated in confidence. In fact, many people from around the world will be able to view your Content and by replying to the Council’s request for consent you provide the Council with the right to use and share your Content on its current or future websites including but not limited to lakecityfl.com and in all of their social media channels including, but not limited to, Facebook, Twitter and Instagram, and in all their advertising and marketing including, but not limited to, print and digital as well as in printed brochures. Credit for Content The Council shall exercise reasonable efforts to include credit to you when using the content, provided that the details such as your name and/or social media identity (i.e., Twitter handle) are included by you. You voluntarily agree to waive all moral rights in favor of the Council, and under no circumstance shall a failure to include credit by the Council, its agents, contractors, employees, officials or sub-licensees constitute a breach of these Terms or Conditions or otherwise subject such parties to liability. General These Terms and Conditions and the Privacy Statement together with any additional terms to which you agree when using particular elements of the website(s) constitute the entire and exclusive agreement between you and Council. Governing Law These Terms and Conditions shall be governed by the laws of the state of Florida. Privacy Policy All records of the state or political subdivisions of the state are open for public inspection and copying, subject to certain exemptions. This policy, together with the right of individuals to be free from unauthorized governmental intrusion into their private lives, as provided in Article 1, Section 23, of the Florida Constitution, is the basis for this Privacy Policy. When you use lakecityfl.com , you are acknowledging that any personal information you provide is subject to Florida’s public records law as stated in Chapter 119, Florida Statutes, and Article I, Section 24, of the Florida Constitution. You do not have to provide personal information to visit this site, download its publications, or use e-mail communications, or any other feature. The Council collects no personal information about you when you visit this site unless you choose to provide this information. The Council does, however, collect statistical data to track visitor use and site activity. Information about your visit The servers for this site automatically record your visits to this site. Like all other website servers, the Council’s servers compile a log that records the date, time, browser (i.e., Firefox), device type (i.e., iPhone), operating system (i.e. Android) and originating IP address of each site page request. Your IP address is not personally identifiable information. This site uses cookies to collect the following information about your visit to this site: which website or ad you visited right before this site, which pages you visited on this site, and how much time you spent on each section of this site. This site may also collect other data about your visit, such as search requests and results. The Council uses this information to track usage of this site, to measure the number of unique visitors to the different sections of this site, and to help us make this site more useful. The use of this information is called “analytics.” The Council may build interest profiles based on page visits. “Cookies” are data files, which often include an anonymous unique identifier, sent to your hard drive from a website. Cookies can only be read by the party placing the cookie. They cannot erase or alter any of your data. When you visit the website again using the same browser (Google Chrome or Safari, for example), the cookie allows that website to recognize your computer. Cookies may store user preferences and other information. Cookies allow us to anonymously identify and track users as they move around this site. You can reset your browser to refuse all cookies or to indicate when a cookie is being sent. However, some of this site’s features may not function properly without cookies. Most browsers accept cookies automatically but allow you to disable them. It is recommended that you leave cookies enabled so that we can offer the best experience on this site. For more information about cookies, visit http://www.allaboutcookies.org . Information About Your Location From your IP address, the Council can tell generally which city you are in when you are accessing this site. Information Third Parties Collect Electronically Automatically Third-Party Cookies for Site Use Analysis The Council uses third parties such as Google to help analyze how people are using this site. The Council also uses the Google Analytics service to provide demographic data about users, such as age and gender, on an anonymous basis. Google service uses a cookie that can be recognized by Google or its affiliate DoubleClick when you visit other websites. Opting Out of Google Analytics To prevent your data from being used by Google Analytics, click here https://tools.google.com/dlpage/gaoptout/ for instructions. Opting Out of Google Advertising To opt out of Google behavioral advertising, click here https://support.google.com/ads/answer/7395996 to see your Google ad settings. Opting Out Generally The Council does not have access to, nor does this Privacy Policy govern, the use of cookies or other tracking technologies that may be placed on your computer, mobile phone, or other devices by non-affiliated, third-party ad technology, ad servers, ad networks or any other non-affiliated third parties. If you would like to learn more about behavioral advertising or to opt-out of having this information used by companies that are part of the Network Advertising Initiative to deliver targeted ads, please visit http://www.networkadvertising.org . Many of the same companies are members of the Self-Regulatory Program for Online Behavioral Advertising. You can learn more and opt-out of receiving targeted ads from them at http://www.aboutads.info/choices . Choices you make are both browser and device-specific. This means that if you opt-out when using Safari on your computer at work, you will not be opted out on Chrome or on your home computer. Please note that when you opt out of an ad network, you may receive an “opt-out” cookie so that the network will know not to assign you new cookies in the future. You will continue to receive ads from that network, but not behaviorally targeted ads. If you erase your browser’s cookies, you may need to perform this process again. Deleting cookies To manage or delete browser cookies, please see your browser’s privacy setting. Do Not Track Some browsers have a ‘do not track’ feature that lets you tell websites that you do not want to have your online activities tracked. These features are not yet uniform, so this site is not currently set up to respond to those signals. With Whom Will the Collected Information be Shared? Personal Information The Council shares the information that you voluntarily provide with our tourism partners and with business partners that fulfill your requests for information, such as companies that mail our print brochures. The Council also shares your e-mail address with trusted business partners who provide tourism services and have also agreed to use your information only to promote their own products and services. The Council may disclose the information that you voluntarily provide as required by law, in conjunction with a government inquiry, or in litigation or dispute resolution. Anonymous Information The Council may disclose statistical information to third parties in an aggregate form without revealing any personal details about this site’s users (for example, 35% of the site’s visitors live in the Snowbelt). Third-Party Cookies Used to Target Ads to You When You are on Other Websites The Council works with other companies who use their cookies or beacons to target ads to you when you visit other websites. This is called retargeting and is a common practice. You may also see third-party ads on this site that are targeted to you based on your prior visits to that third party’s website. Other companies the Council works with target other Florida vacation ads to you on other websites. This is called behavioral advertising because you receive ads based on your prior online behavior. For example, when you visit this site, you may receive a cookie on your browser that is read when you visit Facebook using that same browser so that during your visits to the Facebook website you might receive advertising based on the pages you visited on this site. “Beacons” are transparent pixel images that are used in collecting information about website usage across websites and over time. Cookies This site applies the use of cookies to track, authenticate, and monitor web traffic only. The cookie does not contain any personally identifiable information. Choice You may decline participation in any activity that asks for information (i.e., surveys or e-mails). Your choice to not participate will have no effect on your ability to access information on this site. Disclaimer Regarding Accuracy of Information Visitors to, and users of, this site are advised that information contained here is believed to be accurate. However, errors can occur. The Council makes no representation regarding the completeness, accuracy, or timeliness of such information and the data or that such information and data will be error-free. In the event that the information on the Council’s official printed documents differ from the information contained on this site, information on the Council’s official printed documents will take precedence. Visitors are encouraged to review the official version of all documents upon which they plan to rely. External Links Policy The Council links to external websites to provide users with additional information on related topics. The Council has no control and disclaims any responsibility for the accuracy of the information contained on such linked websites, any privacy policies of the websites or any content of the websites that may affect your computer. Furthermore, providing a link does not imply any endorsement by the Council or any of its officers, agents, or affiliates of the persons or organizations on linked websites and does not imply any endorsement of the views they express or the products or services offered. Although the Council tries to ensure broken links do not exist, links to other Internet sites may have changed. If you encounter broken links, please report it to digital@paradiseadv.com so that it may be corrected. Protection of Minors The Council is concerned about protecting children’s privacy. In accordance with the Children’s Online Privacy Protection Act, children under the age of 13 should obtain their parents’ permission before providing any information through this site. Most importantly, when children do provide information through this site, it is only used to enable us to respond to the writer, and not to create profiles of children. Accessibility In accordance with the requirements of Title II of the Americans with Disabilities Act (ADA) of 1990, Lake City, Florida’s Springlands and the Columbia County Tourist Development Council does not discriminate on the basis of disability in the admission, access, or operations of its programs, services, activities or facilities. In accordance with Title II of the ADA, when viewed in their entirety, programs, services, and activities are readily accessible to and usable by qualified individuals with disabilities. Section 508 Law (29 U.S.C. ‘794d) In 1998, Congress amended the Rehabilitation Act to require federal agencies to make their electronic and information technology accessible to people with disabilities. Inaccessible technology interferes with an individual’s ability to obtain and use information quickly and easily. Section 508 was enacted to eliminate barriers in information technology, to make available new opportunities for people with disabilities, and to encourage development of technologies that will help achieve these goals. The law applies to all federal agencies when they develop, procure, maintain, or use electronic and information technology. Under Section 508 (29 U.S.C. ‘794d), agencies must give disabled employees and members of the public access to information that is comparable to the access available to others. It is recommended that you review the laws and regulations listed below to further your understanding about Section 508 and how you can support implementation. °Americans With Disabilities (ADA) Public Notice °Section 508 Standards Things to Do Where to Stay Events Stories Lake City Connect with Us Instagram Facebook Sports Weddings and Groups Media Partners © Lake City - Florida's Springlands | Ph. 386-758-1312 | Columbia County Tourist Development Council | 971 W. Duval Street, Suite 145 | Lake City, FL 32055 Privacy Policy / GDPR Things to Do Where to Stay Events Stories Sports Weddings and Groups Media Partners Lake City Connect with Us Instagram Facebook © Lake City - Florida's Springlands | Ph. 386-758-1312 | Columbia County Tourist Development Council | PO Box 1847 Lake City, FL 32056 Privacy Policy / GDPR Things to Do Where to Stay Events Stories Lake City Connect with Us Instagram Facebook Sports Weddings and Groups Media Partners © Lake City - Florida's Springlands | Ph. 386-758-1312 | Columbia County Tourist Development Council | PO Box 1847 Lake City, FL 32056 Privacy Policy / GDPR"
    },
    {
      "url": "https://www.lakecityfl.com/partners/",
      "text": "Partners - Lake City , FL Skip to content Search… Instagram Facebook Weddings and Groups Media Sports Partners Menu Close Lake City Things to Do Open menu Activities and Attractions Culture and History Parks and Outdoors Dining Shopping Springs and Lakes Where to Stay Events Open menu Calendar Signature Events Plan Your Trip Open menu Stories Weather Map Weddings and Groups Media Sports Partners Request a Visitor Guide Instagram Facebook Search… Lake City Meet the Team Notices Media Affiliations Columbia County Tourist Development Council You can always find something to dive into in the heart of Lake City – Florida’s Springlands, because there’s a team of dedicated, experienced people at the Columbia County Tourist Development Council to help make ideal experiences a reality. Meet the Team Michelle Moore Marketing Coordinator mmoore@columbiacountyfla.com 386-758-1312 Chris Coleman Sports and Small Group Sales ccoleman@columbiacountyfla.com 386-719-1453 Kilee Mathis Office Manager kmathis@columbiacountyfla.com 386-758-1312 Event Funding Requests CLICK HERE Notices 2022 – 2023 Vacation Guide VISIT FLORIDA Vacation Guide for all your travel needs. View the Guide 2025 Visit Florida Partner Financial Report 2025 Visit Florida Partner Financial Report View the Report Media Request Logos Brand Guidelines Affiliations Proud Partners of VISIT FLORIDA Plan on sharing your good times on social media? Here's a hashtag. Share the love. We'll do the same! #ShareSpringlands Things to Do Where to Stay Events Stories Lake City Connect with Us Instagram Facebook Sports Weddings and Groups Media Partners © Lake City - Florida's Springlands | Ph. 386-758-1312 | Columbia County Tourist Development Council | 971 W. Duval Street, Suite 145 | Lake City, FL 32055 Privacy Policy / GDPR Things to Do Where to Stay Events Stories Sports Weddings and Groups Media Partners Lake City Connect with Us Instagram Facebook © Lake City - Florida's Springlands | Ph. 386-758-1312 | Columbia County Tourist Development Council | PO Box 1847 Lake City, FL 32056 Privacy Policy / GDPR Things to Do Where to Stay Events Stories Lake City Connect with Us Instagram Facebook Sports Weddings and Groups Media Partners © Lake City - Florida's Springlands | Ph. 386-758-1312 | Columbia County Tourist Development Council | PO Box 1847 Lake City, FL 32056 Privacy Policy / GDPR"
    },
    {
      "url": "https://www.visitlakecitysc.com/contact-us",
      "text": "Visit Lake City, SC - Contact Us Dine. Shop. Stay. Things to Do. Festivals & Events. Event Venues. Search the site Downtown Map Visitors Center Meetings & Special Occasions Blog Contact Us Contact Us Dine. Shop. Stay. Things to Do. Festivals & Events. Event Venues. MEETINGS & SPECIAL OCCASIONS. Downtown Map Visitor Center Meetings & Special Occasions Our Blog Contact Us MENU Contact Us Home / Contact Us Visiting On Assignment Thank you for your interest in visiting Lake City. The Visit Lake City SC Staff assists journalists with travel stories about Lake City by suggesting attractions, restaurants and other points of interest. To schedule your visit or to learn more about Lake City contact us at info@visitlakecitysc.com . Email â info@visitlakecitysc.com Get in Touch First Name Last Name Email Address How Can We Help You? Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Tag Your Experience #Visitlakecitysc Discover Small Town Culture â VISITÂ LAKEÂ CITY We have art museums, live music, local shopping, amazing venues, the best hotels, and some of the state's best festivals and events. Sign up For Our Email List! are you a robot? Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Visit Lake City, SC has a wide array of services for more successful, stress-free events. We can help you from start to finish with all of your planning, and our free services eliminate the tedious work of calling hotels and booking things tours! Contact Us Contact Us info@visitlakecitysc.com Get Directions From Greenville/Spartanburg From Columbia From Florence From Myrtle Beach From Charleston Your Location Hours of Operation Monday â Friday 9:00am â 5:00pm Resources: ArtFields Moore Farms Botanical Gardens Lake City Chamber City of Lake City Community Resource Center VIEWÂ UPCOMINGÂ EVENTS Copyright Â© 2019 - Lake City Creative Alliance. Privacy Policy . Web Design by Crowdedbox Digital."
    },
    {
      "url": "https://iamlakelandflorida.com/about_us/",
      "text": "About Us – I Am Lakeland Florida Skip to content Home About Us Community Charities Churches Education Murals Public Service Sculptures Veterans’ & Heros Social Media Accounts, Videos & Podcasts Local Artists Authors Food & Restaurants Services Shopping Things To Do Social Media Accounts, Videos & Podcasts Home About Us Community Charities Churches Education Murals Public Service Sculptures Veterans’ & Heros Social Media Accounts, Videos & Podcasts Local Artists Authors Food & Restaurants Services Shopping Things To Do Social Media Accounts, Videos & Podcasts Instagram Linkedin Tiktok Youtube Threads Facebook Apple X-twitter Heart Zhihu Vimeo Lemon Amazon Patreon Comments Cloud Spotify Our Shop Say Hello. We are the Burns family of Lakeland. We only want to support this wonderful community. We welcome all requests to join our site or be a guest on our podcast, please contact us. Thank you and God Bless. Contact Us lkldnow article on Don Burns runs for Lakeland City Commissioner. lkldnow article on Don Burns ends campaign. The Ledger article on Don Burns runs for Lakeland City Commissioner. The Ledger article on Don Burns ends campaign. MSN article. On Facebook Lakeland Gazette article on Don Burns. On Facebook @gazettelakeland Yahoo News article. On Facebook @yahoo Newsbreak article. On Facebook @msn Facebook lkldnow @lkldnow Facebook The Ledger @theledger Instagram lkldnow @lkldnow Threads lkldnow @lkldnow X Gary White The Ledger @garywhite13 Also visit our network of websites at I Am Florida® info@iamlakeland.com (863) 660-3039 Burns family through the years in Lakeland. Copyright © 2025 I Am Lakeland®. Florida Veteran Certified Business (FVCBE). I Am Lakeland and this site has no affiliation with the City of Lakeland. Your privacy is very important to us. Our policy is to collect no personal information about you when you visit our web site. Refund & Return Policy or Privacy Policy"
    },
    {
      "url": "https://www.lakecitystorage.com/contact-us",
      "text": "Contact Us | Mini-Storage of Lake City Locations group Storage Resources group Contact Us Pay Online Contact Us How can I contact my storage facility? Step 1: Discover your Mini-Storage of Lake City facility on this page. Step 2: Locate the phone number displayed at the top. Step 3: Reach out by phone or through the contact form above! Each location page provides address details for the storage facility, along with office and gate hours. Feel free to reach out with any inquiries. Mini-Storage of Lake City - Saint Margaret Office - one@lakecitystorage.com Mini-Storage of Lake City - Highway 90 West Office - two@lakecitystorage.com Mini-Storage of Lake City - Highway 47 South Office - 47@lakecitystorage.com First Name Last Name Email Phone Facility Questions or Comments To continue, please complete the CAPTCHA below. This helps us prevent automated programs (bots) from accessing the site. If you are having trouble, refresh the CAPTCHA to try a different one. CAPTCHA TEXT * Apply Submit Please Call us for unit availability and pricing! Mini-Storage of Lake City - Highway 47 South Office 2529 FL - 47 Lake City, FL 32025 (386) 752-2529 Prices start at $65 Mini-Storage of Lake City - Highway 90 West Office 5919 W US Highway 90 Lake City, FL 32055 (386) 755-7062 Prices start at $65 Mini-Storage of Lake City - Saint Margaret Office 442 SW Saint Margaret Street Lake City, FL 32025 (386) 752-7092 Prices start at $65 Powered by © Mini-Storage of Lake City Terms Privacy All sizes are approximate Some restrictions may apply Admin"
    },
    {
      "url": "https://corallyus.com/contact/",
      "text": "Contact – Team Corally USA Skip to content Search × Home Car & Trucks Batteries Motors & ESC’s Replacement Parts Upgrades USA Dealer Locator Cart Menu View shopping cart View Cart 0 Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch 2034 S 3850 W Salt Lake City , UT 84104 USA sales@corallyus.com 844-622-7223 Instagram Facebook Twitter WordPress Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Message (required) Warning Warning. Submit Δ 2034 S 3850 W Salt Lake City, UT 84104 USA sales@corallyus.com 844-622-7223 GENERAL INFO About Us Contact Us Returns Policy & Form Company info General Conditions Frequently Asked Questions Privacy Statements Help SHOP BY Vehicles Batteries Brushless Motors & ESCs Replacement Parts SUPPORT Warranty Info & Claim Form Wholesale Dealer App Dealer Locator Facebook Instagram Twitter YouTube © CorallyUS 2021. All rights reserved."
    }
  ]
}