{
  "fuentes": [
    {
      "url": "https://mylakeviewvillage.com/contact-us",
      "email": "info@mylakeviewvillage.com"
    },
    {
      "url": "https://www.lakeviewgolf.net/legends-bar-and-grill/",
      "email": "proshop@lakeviewgolf.net"
    },
    {
      "url": "https://lakeviewbarandgrille.com/menu-1",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://lakeviewbarandgrille.com/event-calendar-1",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "alicia@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "carolina@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "chloe@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "jaynee@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "jessica@visitfingerlakes.com"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "email": "tracey@visitfingerlakes.com"
    },
    {
      "url": "https://www.lakeview-golf.com/grill/",
      "email": "20info@lakeview-golf.com"
    },
    {
      "url": "https://www.lakeview-golf.com/grill/",
      "email": "info@lakeview-golf.com"
    },
    {
      "url": "https://www.lakeviewhotelmotel.com.au/contact/",
      "email": "accommodation@lakeviewhotelmotel.com.au"
    },
    {
      "url": "https://www.lakeviewhotelmotel.com.au/contact/",
      "email": "enquiries@lakeviewhotelmotel.com.au"
    },
    {
      "url": "https://www.iheartlakeview.org/contact",
      "email": "info@iheartlakeview.org"
    },
    {
      "url": "https://www.iheartlakeview.org/contact",
      "email": "info@lakeviewmcc.org"
    },
    {
      "url": "https://www.chateau-lake-louise.com/dine/lakeview-lounge/",
      "email": "cll.diningreservations@fairmont.com"
    },
    {
      "url": "https://lakeviewbarandgrille.com/",
      "email": "eben@eyebytes.com"
    }
  ],
  "mails": [
    "20info@lakeview-golf.com",
    "accommodation@lakeviewhotelmotel.com.au",
    "alicia@visitfingerlakes.com",
    "carolina@visitfingerlakes.com",
    "chloe@visitfingerlakes.com",
    "cll.diningreservations@fairmont.com",
    "eben@eyebytes.com",
    "enquiries@lakeviewhotelmotel.com.au",
    "info@iheartlakeview.org",
    "info@lakeview-golf.com",
    "info@lakeviewmcc.org",
    "info@mylakeviewvillage.com",
    "jaynee@visitfingerlakes.com",
    "jessica@visitfingerlakes.com",
    "proshop@lakeviewgolf.net",
    "tracey@visitfingerlakes.com"
  ],
  "nombre_sitio": "lakeviewbarandgrille.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mylakeviewvillage.com/contact-us",
      "text": "contact | My Lakeview Village The Project The Lakeview Experience The Lakeview Experience Pier & Waterfront Lakeview Square Arts & Culture Innovation District Smart & Sustainable Parks & Outdoor Spaces Our Stories & Articles Discovery Centre Our Stories and Articles Contact Us Thank you for your interest in Lakeview Village. Please use this form to get in touch with us. We will respond as soon as we can. First Name Last Name Email Phone Inquiry Type General Info Sales Opportunities Community Events & Discovery Centre Media/PR Retail & New Business Opportunities Message Maximum message length is 255 characters. If your request is longer, please email us directly at info@mylakeviewvillage.com Yes, I would like to receive email communications from Lakeview Village and their partners. Get In Touch Your Waterfront Transformed Connected where would you like to go next? - Smart And Sustainable - Innovation District - Arts & Culture - Lakeview Square - Parks & Outdoor Spaces - Pier & Waterfront See & Experience The Project The Discovery Centre Live At Lakeview Branthaven Caivan Greenpark Group DECO Opus Homes Tridel Learn & Connect Our Stories & Articles News & Media Electronic Press Kit Team Contact 985 Jim Tovey Boulevard, Mississauga, ON L5E 0A8 MON-FRI 11:00am - 3:00pm Closed Weekends & Holidays ©2024 Lakeview Community Partners Limited. All Rights Reserved Privacy Legal Terms & Conditions"
    },
    {
      "url": "https://www.lakeviewgolf.net/legends-bar-and-grill/",
      "text": "Legends Bar and Grill - Lakeview Golf Club Home Memberships Season Passes College Rates Daily Rates Practice Range Play Lakeview Play the Course Simulator Golf Calendar Lessons Instruction John Rogers Ryan Hite Juniors Junior Golf Jr Camps High School Prep Week Jr Tour TPS Drive, Chip, and Putt Meet The Team Legends Bar and Grill Leagues Skip to primary navigation Skip to main content Skip to footer Lakeview Golf Club Harrisonburg, VA Legends Bar and Grill Stop in before or after your round to enjoy a drink and freshly cooked food while watching the NFL, PGA Tour, and other popular sporting events. Learn the Game Instruction Junior Golf Footer Contact Us Pro Shop 540-434-8937 proshop@lakeviewgolf.net Hours of Operation Follow Us Find Us 4101 Shen Lake Drive Harrisonburg, VA 22801 Meet The Team Ryan Hite – General Manager Kurt Hellenga – Superintendent John Rogers – Director of Instruction Mark Smith – Food & Beverage Manager Lynn McNett – Pro Shop Manager Chris Rowe – Carts Manager Subscribe Sign-up today and stay updated with events, course closings, and special offers! Please enable JavaScript in your browser to complete this form. Name: Email * Subject: Message: Name Submit Search Our Site Search this website Copyright © 2025 Lakeview Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://lakeviewbarandgrille.com/menu-1",
      "text": "Menu | Lakeview Bar & Grille 772-342-2105 Home Menu & Event Calendar Menu Event Calendar More Home Menu & Event Calendar Menu Event Calendar 772-342-2105 Home Menu & Event Calendar Menu Event Calendar menu weekly specials & Events Lakeview Bar & Grille 951 SW Country Club Drive Port Saint Lucie, FL 34986 772-342-2105 Copyright © 2025 Lakeview Bar & Grille - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://lakeviewbarandgrille.com/event-calendar-1",
      "text": "Event Calendar | Lakeview Bar & Grille 772-342-2105 Home Menu & Event Calendar Menu Event Calendar More Home Menu & Event Calendar Menu Event Calendar 772-342-2105 Home Menu & Event Calendar Menu Event Calendar Events 9/02/2025 Prime Rib Night 5pm Grille Event Details 9/02/2025 Prime Rib Night Prime Rib Special served with your choice of soup or salad a baked potato and fresh vegetables. 5pm Grille 9/03/2025 Musical Bingo 7pm Grille Event Details 9/03/2025 Musical Bingo Full menu available- Dinner & drink specials! 7pm Grille 9/04/2025 Trivia 7pm Grille Event Details 9/04/2025 Trivia Full menu available- Dinner & drink specials! 7pm Grille 9/05/2025 Paws on the Patio & live Music 5:30PM - 8:30PM Grille/Patio Event Details 9/05/2025 Paws on the Patio & live Music Bring your four legged friends and enjoy live music and delicious dinner specials! Live music with Maddie & John Full menu available- Happy H... Event Details 5:30PM - 8:30PM Grille/Patio 9/09/2025 Prime Rib Night 5PM Grille Event Details 9/09/2025 Prime Rib Night Prime Rib Special served with your choice of soup or salad a baked potato and fresh vegetables. 5PM Grille More Events special Events Weekly Events Lakeview Bar & Grille 951 SW Country Club Drive Port Saint Lucie, FL 34986 772-342-2105 Copyright © 2025 Lakeview Bar & Grille - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.visitfingerlakes.com/about-us/board-of-directors-and-staff/",
      "text": "Visit Finger Lakes Staff & Board of Directors | Meet the Team Your browser is not supported for this experience. We recommend using Chrome, Firefox, Edge, or Safari. Skip navigation Skip to main content MENU SEARCH View Maps Maps View Guides Guides Join Our Newsletter Subscribe View Maps Maps View Guides Guides Join Our Newsletter Subscribe Things To Do FLXperience Passes On The Lakes Finger Lakes Beaches & Swimming Finger Lakes Kayaking & Paddleboarding Boat Rentals & Boat Tours Marinas & Boat Launches Fishing Roseland Waterpark & Wake Park Outdoors Trail Maps Hiking Biking Parks & Playgrounds Aerial Adventures & Zip Line Tours Skiing & Snowboarding Golf Bristol Mountain Roseland Waterpark & Wake Park Aerial Adventures & Zipline Tours Skiing & Snowboarding Spas & Wellness Yoga, Gyms & Fitness Centers FLX Well-Being Passport Shopping Locally Made Antiques Eastview Mall Gifts And Souvenirs Farmers Markets Downtowns & Districts Arts & Entertainment Nightlife Theater Art Galleries & Exhibits Movie Theaters Finger Lakes Gaming & Racetrack Hands On and Educational Classes Farms & Markets Farm Tours & Events Farmers Markets & U-Pick Farms Museums & History Museums & Landmarks Women's Rights Sonnenberg Gardens & Mansion Historic Park Ganondagan State Historic Site & Seneca Art & Culture Center Path Through History Scenic Drives & Vistas Top 9 Photography Locations Top 9 \"Leaf Changing\" Experiences Gardens Day Trips Corning And Southern Tier Niagara Falls And Buffalo Ithaca And Aurora Rochester And The Erie Canal Things To Do With Kids Top 10 Family Fun Finger Lakes Activities On A Rainy Day Events & Festivals Annual Events Summer Fourth Of July Ring Of Fire Fall Colors Naples Grape Festival Maple Weekend Concerts & Live Music CMAC Experience Holiday Events 5ks, Marathons & Triathlons FLXperience Passes Well-Being Passport Discover Downtown Geneva Passport Canandaigua Lake Wine Tasting Passport Restaurants Top Finger Lakes Restaurants Finger Lakes Restaurants On The Water Cuisine Types American Bakeries And Coffee Shops Breakfast & Brunch Brewpubs & Taverns Chinese Diners German Ice Cream & Desserts Indian International Italian Mexican Pizza Sushi Thai Vegan / Vegetarian Farm To Table Local Specialities Take Out & Delivery Wineries & Vineyards Wine Tours Canandaigua Lake Wine Trail Seneca Lake Wine Trail How To Wine & Beer Trail Take Out & Delivery Craft Beverages Breweries & Craft Beer Cideries & Distilleries ROC/FLX Craft Beverage Trail How To Beer And Wine Trail Tours Take Out & Delivery Places To Stay Hotels Lakefront Hotels Resorts Bed & Breakfasts Campgrounds & RV Parks Cabins Vacation Rentals Unique Places To Stay Motels Plan Your Trip Packages & Deals Visitors Guide Trails & Trip Ideas How To Beer And Wine Trail Canandaigua Wine Trail Seneca Lake Wine Trail Top Things To Do Top 10 Winter Activities Top 10 Winter Activities To Keep Warm Indoors Top 10 Ways To Find Comfort On A Rainy Day Top 10 Places To Read A Book In The Finger Lakes A Girls Getaway Top 10 Romantic Ways to Propose in the Finger Lakes Family Fun Family Time Outdoor Recreation History Women's History Trail Sightseeing & Arts Roadside Attractions and Routes 5 & 20 Trail The Picture Perfect Trail Arts & Photo Trail Culinary Castles, Lakes And Grapes Galore Colors Of The Season Must Do For Groups In The Finger Lakes Pet Friendly Hotels Restaurants Wineries & Craft Beverages Blog FAQs Newsletter Finger Lakes Maps Transportation Getting To The Finger Lakes Finger Lakes Facts Canandaigua Lake Seneca Lake Honeoye Lake Canadice Lake Hemlock Lake Conesus Lake Keuka Lake Cayuga Lake Owasco Lake Skaneateles Lake Otisco Lake New York State Erie Canal Ontario County NY Geneva Hotels Restaurants Wineries Shopping Canandaigua Hotels Restaurants Wineries Shopping Naples Hotels Restaurants Shopping Wineries Bristol & South Bristol Victor & Farmington Hotels Restaurants Shopping Bloomfield & West Bloomfield Manchester & Shortsville Richmond, Honeoye & Canadice Phelps & Clifton Springs Hopewell, Seneca, Gorham Historic Port Gibson Colleges & Universities Weather & Webcams What To Pack Things To Do Events & Festivals FLXperience Passes Restaurants Wineries & Vineyards Craft Beverages Places To Stay Plan Your Trip Things To Do Events & Festivals FLXperience Passes Restaurants Wineries & Vineyards Craft Beverages Places To Stay Plan Your Trip Meetings Meet In The FLX Resources Regions Of Ontario County Travel Guide Meet the FLX Team Venues Meeting & Event Space Hotel Meeting Space Creative Meeting Space Meeting Planner Tools Catering & Dining Services Entertainment & Attractions Transportation Services Team Building Maps Meet and Retreat Newsletter Meetings Profile Sheet Submit RFP Quick Submit RFP Groups Group Profile Sheet Meet the Team Uniquely FLX Sample Itineraries FLX Classic FLX Foodies FLX Seasonal FLX Wine & Craft Beverage FLX Knowledge Seekers FLX Active FLX Wellness FLX Youth Destination Resources Maps About the Region Tour Support Services Submit RFP Weddings Planning Tips & Ideas Proposals Top 10 Romantic Ways To Propose In The Finger Lakes Before The Big Day Wine Tours In The Finger Lakes Spa Treatments Transportation Wedding Venues Event Spaces Rehearsal Dinners Great Photo Spots Vendors Transportation Services Honeymoons Partners Industry Updates Visit Confidently Resources E-Learning Signage & PPE Industry Resources FLVC Industry Newsletter Industry Events Upcoming Dates Legacy Awards National Travel & Tourism Week Tourism Thursdays Education & Training FLVC University Marketing Academy Ambassador Program E-learning Tourism Destination Training Partner Portal Training Partner Portal Training Manage Your Google Listing Coop Marketing Joint Marketing Partner Benefits Research and Resources FLVC Strategic Plans Annual Report Visitor Profiles, Visitation, Economic Impact NYS and National Resources Why Visitors Matter (infographics, etc.) Brand Resources & Logos Diversity / Accessibility Partner Portal Login About Us Seminars Media Online Media Kit Video & Images Gallery Press Releases Big Industry News Story Ideas Research & Reports About Us Blog Meetings Groups Weddings Partners Media Blog Meetings Groups Weddings Partners Media Blog About Us Mission & Vision Board of Directors & Staff Join Our Team History & Location Results & Recognition Local Development Corporation Archives FLVC Strategic Plans Contact Us Privacy Policy Sitemap About Us Contact Us Privacy Policy Sitemap Finger Lakes Visitors Connection, Canandaigua Home About Us Board of Directors & Staff Share Finger Lakes Visitors Connection Team Alicia Richie Quinn, CDME President & CEO Leads FLVC as the destination marketing management organization for Ontario County. Oversees the strategic direction and long-term vision for promoting the region. Alicia@VisitFingerLakes.com (585) 394-3915 ext. 356 Tracey Burkey, CDME Vice President of Destination Development Leads meetings, conventions, and group sales efforts to attract business to the region. Supports destination development initiatives that enhance visitor offerings. Tracey@VisitFingerLakes.com (585) 394-3915 ext. 353 Jessica VanDeMar Marketing Director Develops and implements innovative marketing strategies to drive tourism and brand visibility. Jessica@VisitFingerLakes.com (585) 394-3915 Carolina Taylor PR & Communications Manager Manages media relations to build awareness and engagement, and creates content to tell the Ontario County's story. Carolina@VisitFingerLakes.com (585) 394-3915 Chloe Davis Partner Engagement Coordinator Acts as the primary point of contact for community and tourism partners. Develops and delivers partnership programs, training, and educational resources. Chloe@VisitFingerLakes.com (585) 394-3915 Jaynee Straw Administrative Assistant Provides support for daily operations and visitor services. Jaynee@VisitFingerLakes.com (585) 394-3915 Board of Directors Members of our Board of Directors complete a self-evaluation annually. David Hutchings Chairperson Sonnenberg Gardens Lisa FitzGerald 1st Vice Chairperson Finger Lakes Winery Tours Charles Parkhurst Secretary Lyons National Bank Steve Fuller Treasurer Bristol Mountain Michael Kauffman Immediate Past Chairperson EASTVIEW Christopher Vastola Rep. Board of Supervisors Town of Canadice Lenore Friend Finger Lakes Community College Sherry Brahm-French Arbor Hill Grapery and ExploreNaplesNY Sheryl Mordini 1795 Acorn Inn Mark Gilbride Lazy Acre Alpacas Lori Proper The Lake House on Canandaigua Russ Kenyon Kenyon & Kenyon Mike Roeder Todd Plouffe Indus Hospitality Group Naved Amed Geneva on the Lake Jim Cecere Vinifera / Finger Lakes Goods About Us | Contact Us | Privacy Policy | Sitemap Finger Lakes Visitors Connection 19 Susan B. Anthony Lane, Canandaigua, NY 14424 (585) 394-3915 ® I LOVE NEW YORK is a registered trademark and service mark of the New York State Department of Economic Development; used with permission View Our Guides Looking for some Finger Lakes inspiration? Join Our Newsletter For all your Finger Lakes information and deals © 2025 Finger Lakes Visitors Connection"
    },
    {
      "url": "https://www.lakeview-golf.com/grill/",
      "text": "Grill - Lakeview Golf Course Hit enter to search or ESC to close Home Golf About Us Course Usage Rates Season Passes Golf Instruction Adult Programs Junior Programs Lakeview Ladies Golf Tee Times Tournaments Schedule Ladies’ Association Tournaments Men’s Association Tournaments Golf Genius Event Hub Camps & Clinics Bar & Grill Contact Us Contact Us Employment Opportunities News Club Calendar Roosters Tavern on the Green Hours: Monday – Sunday:  7:30 am to 9 pm Breakfast Menu Lunch/Dinner Menu Wine Menu Available 7:30 am to Noon, Friday, Saturday & Sunday Traditional Breakfast Sub hash browns and toast for a small pancake or slice of French toast One Egg, Any Style $7.95 Served with hash browns and one slice of toast Add Sausage, Bacon or Ham - $2.02 (Half) or $4.43 (Whole) Two Eggs, Any Style $9.15 Served with hash browns and one slice of toast Add Sausage, Bacon or Ham - $2.02 (Half) or $4.43 (Whole) Burritos Classic $8.55 Fresca tortilla lightly grilled and stuffed with scrambled eggs, cheddar cheese, crispy bacon, sausage or ham, hash browns and our house made salsa. Twice grilled for extra crispiness! Buckaroo $9.55 Fresca tortilla lightly grilled and loaded with scrambled eggs, tri-tip steak, jalapenos, havarti cheese, hash browns and our house made salsa Sandwiches Breakfast Sandwich $7.25 Your choice of sausage, bacon, or ham, with cheddar cheese and fluffy scrambled eggs, nestled between toasted stone ground hearty wheat bread or an English muffin Breakfast Pita $7.23 A warm grilled pita wrapped around crispy bacon, an over medium egg and American & Swiss cheese, with mayo, lettuce, and tomato More Options Biscuits & Gravy Half - $5.63 / Whole - $8.15 House made morning comfort food! Fresh country gravy flavored with chopped sausage Pancakes Single - $5.75 / Short Stack - $7.19 Plate sized fluffy buttermilk pancakes, grilled golden brown Add Meat Bacon $4.79 / $2.51 Four slices / two slices Sausage $4.79 / $2.51 Two Patties / One Patty Ham $3.83 / $2.03 4 oz. slice / 2 oz. slice Appetizers Homemade Chips N Salsa $4.99 House made chips and salsa Mini Corn Dogs $6.99 15 mini corn dogs served with mustard Spicy Mozzarella Sticks $9.99 Served with a side of ranch dressing Chicken Quesadilla $10.99 Grilled chicken, melted cheese, red onion, cilantro, salsa and sour cream Wing Dings Basket $13.99 Served with ranch dressing, blue cheese dressing or BBQ Nachos $13.99 Served with melted cheese, carne asada, tomatoes, sour cream, onions and jalapenos Steamer Clams (Sat. & Sun. Only) $18.99 Clams in garlic wine butter broth, with baguette slices Salads Dressings: Ranch, Blue Cheese, Honey Mustard, Italian, Raspberry Vinaigrette, or 1000 Island Chicken Caesar Salad $12.99 Crispy romaine lettuce, parmesan cheese, grilled chicken, and homemade croutons Tri Tip Salad $13.99 Juicy beer marinated tri tip on a bed of romaine with shredded cheddar cheese, olives, tomatoes, red onions, cucumber and garlic croutons BBQ Chicken Ranch Salad $12.99 Crispy romaine lettuce topped with shredded cheese, tomatoes, red onion, tortilla strips, corn, black beans, grilled chicken, with strips of BBQ and ranch dressing Fruit Balsamic Chicken Salad $13.99 Grilled chicken, glazed walnuts, seasonal fruit, blue cheese crumbles, and red onions served on a bed of lettuce with balsamic dressing House Salad Side - $3.99 / Whole - $8.99 Romaine lettuce topped with red onions, olives, parmesan cheese, diced tomatoes and croutons Specialty Pitas Served with your choice of chips, tots, fries, sweet potato fries or salad. Substitute onion rings for $1.79. House Marinated Tri Tip $12.99 Grilled tri tip and onions with melted crumbled blue cheese on top of a soft warmed pita with garlic mayo Chicken & Cheese $12.99 Grilled chicken and onions with melted cheese n top of a soft warmed pita with garlic mayo Turkey Bacon $11.49 Layers of lettuce, Swiss cheese, tomato, house ranch, and mayo, with a pile of turkey & bacon BLTA $11.99 4 pieces of Daily's bacon layered with tomatoes, avocado and lettuce on a warmed pita with mayo Char-Broiled Served with your choice of chips, tots, fries, sweet potato fries or salad. Substitute onion rings for $1.79. Lakeview Burger $14.49 1/2 lb angus chuck burger charbroiled to a nice pink center, topped with pickles, red onion, tomato and lettuce served on a toasted bun Add cheese - $15.49 Add bacon & cheese $17.49 Par 3 Burger $9.99 1/4 lb beef patty with lettuce, tomato, and onion Add cheese - $10.99 Add bacon & cheese $11.99 Chicken Sandwich $12.99 Crispy or grilled chicken breast cooked to a tender juiciness, topped with pickles, red onion, tomato, and lettuce Add cheese - $13.99 Add bacon & cheese $14.99 Hot Dog $6.99 All beef dog lightly charred served on a toasted bun with onions upon request Sandwiches Served with your choice of chips, tots, fries, sweet potato fries or salad. Substitute onion rings for $1.79. Boise's Best Reuben $12.99 Thinly sliced corned beef served on marbled rye bread with a house made garlic mayo, 2 slices melted Swiss cheese and toasted to perfection Rooster's Bomb $13.99 Beer & signature spice marinated tri tip steak, Italian salami, grilled onions, provolone cheese, garlic spiked mayo, lettuce and tomatoes, with a drizzle of tangy vinaigrette on a French roll Tri Tip Melt $12.99 Our signature roast tri tip under a blanket of rich melty blue cheese with garlic spiked mayo grilled onions on a grilled French roll French Dip $12.99 Piled high with prime rib slices topped with provolone, served with au jus, grilled onions upon request Grilled Tuna $12.99 Grilled Albacore tuna layered between honey oat bread and melted Swiss cheese. Try it as a cold sandwich or on salad BLT $12.49 Smokey Daily's bacon layered on sourdough or honey oat bread, with lettuce and tomato. Add avocado for $1.49 Adult Grilled Cheese $8.99 2 slices of cheddar cheese and Swiss cheese melted on our sourdough bread Add ham or turkey - $11.99 Blackberry Bacon Grilled Cheese $11.99 Savory and sweet, sourdough bread with melted havarti cheese, bacon and fresh grilled jalapeno rounds smothered with blackberry jam Crispy Fish Filet Sandwich $12.99 Cod served on a toasted bun with cheddar, tartar sauce, lettuce, tomato and red onion with choice of side House Favorites Idaho Finger Steaks $15.99 Served with cocktail sauce, a roll and your choice of side Fish-N-Chips $13.99 Three battered fish served with tartar sauce, lemon and choice of fries or tots Street Tacos $12.99 Choice of chicken or beef on three flour shells and topped with lime, pico, creme and served with slaw Chicken Strip Basket $11.99 Deep fried to a golden tan served with ranch, honey mustard or BBQ, and choice of side. Enjoy our wines by the glass or bottle. Everyday from 3-6pm our house wines are $1 off. House Red - Trinity Oak Cabernet $6 Glass / $13 Bottle House White - La Terre Chardonnay $5 Glass / $12 Bottle Barefoot Spritzer Can $5.50 Beringer White Zin $5.50 glass / $12 bottle Winemakers Champagne $5 Glass / $12 Bottle Chianti Classico $6 Glass / $13 Bottle Cupcake Moscato $6.50 Glass / $14 Bottle Eco Domani Pinot Grigio $7.50 Glass / $17.50 Bottle Heritage Chardonnay $6 Glass / $13 Bottle Josh Merlot $7.50 Glass / $17.50 Bottle Kendall Jackson Chardonnay $7 glass / $16 bottle Alamos Malbec $7 glass / $16 bottle Pendulum Red Wine $7.50 Glass / $17.50 Bottle Mark West Pinot Noir $7 Glass / $16 Bottle Browne Rose $7.50 Glass / $17.50 Bottle Michael David Sauvignon Blanc $7.50 Glass / $17.50 Bottle Ste. Chappelle Special Harvest Riesling $6.50 Glass / $14 Bottle Ste. Chappelle Sparkling Huckleberry $6.50 Glass / $14 Bottle Indian Creek Cabernet $6.50 Glass / $14 Bottle LAKEVIEW GOLF COURSE 4200 W. Talamore Blvd. Meridian, ID 83646 CONTACT INFO 208.888.4080 Hours of Operation Pro Shop 7 days a week 7am-9pm Roosters 7 days a week 8am-9pm © 2025 Lakeview Golf Course. \nPowered by foreUP Marketing Services Home Golf About Us Course Usage Rates Season Passes Golf Instruction Adult Programs Junior Programs Lakeview Ladies Golf Tee Times Tournaments Schedule Ladies’ Association Tournaments Men’s Association Tournaments Golf Genius Event Hub Camps & Clinics Bar & Grill Contact Us Contact Us Employment Opportunities News Club Calendar LAKEVIEW GOLF COURSE 4200 W. Talamore Blvd. Meridian, ID 83646 CONTACT INFO info@lakeview-golf.com 208.888.4080 Employment Opportunities"
    },
    {
      "url": "https://www.lakeviewhotelmotel.com.au/contact/",
      "text": "Contact Us | Get In Touch | The Lakeview Hotel Motel Open From 10am Daily m 4 Government Road Oak Flats NSW 2529 Book Table n (02) 4256 1822 f i e Home $15 Classics Eat & Drink What’s On Live Sports Accommodation Bottle Shop Community Contact Book Now Home $15 Classics Eat & Drink What’s On Live Sports Accommodation Bottle Shop Community Contact n (02) 4256 1822 f i y CONTACT US LAKEVIEW HOTEL MOTEL Lakeview Hotel 4 Government Road Oak Flats NSW 2529 ​ (02) 4256 1822 enquiries@lakeviewhotelmotel.com.au Hotel Monday to Saturday 10am – 12am Sunday 10am – 10pm Bistro Monday to Thursday 11:30am – 2:30pm 5pm – 9pm Friday to Sunday 11:30am – 9pm Bottle Shop Sunday to Tuesday 10am – 10pm Wednesday to Saturday 9am – 11:30pm Contact Us Book Table ﻿ ﻿ f i e QUICK LINKS Home $15 Classics Eat & Drink What’s On Live Sports Accommodation Bottle Shop Community Contact Book Now Privacy Policy Responsible Service CONTACT m 4 Government Road Oak Flats NSW 2529 n (02) 4256 1822 e enquiries@lakeviewhotelmotel.com.au Accommodation enquiries e accommodation@lakeviewhotelmotel.com.au f i e GET IN TOUCH Name (Required) Email (Required) Subject (Required) Message (Required) Copyright 2025 - 2029 Designed by Daily Press Group 2025"
    },
    {
      "url": "https://www.iheartlakeview.org/contact",
      "text": "Get in Touch: Contact Lakeview for Inquiries and Information top of page New around here? HOME ABOUT US WHAT WE OFFER EVENTS MAKE AN IMPACT CONTACT More Use tab to navigate through the menu items. Plan Your Event! ABOUT US OUR STORY MEET OUR TEAM JOIN OUR TEAM Directions Standards of Conduct General Policies Campus Map Our Story Join Our Team Lakeview News MAKE A DIFFERENCE GIVE ONLINE VOLUNT EER (Lakeview Crew) PRAYE R TEAM Donate Today! Volunteer Prayer Team Capital Needs Service Projects GROUP RETREATS, MEETINGS, & CAMPS PERSONAL RETREATS TEAM BUILDING LAKEVIEW BUCKS Lakeview Camps Group Retreats, Meetings, & Camps Team Building Personal Retreats Facilities Activities UPCOMING SCHEDULED EVENTS FAMILY CAMP CAMP MID-WINTER View All Events Family Camp Mid-Winter Camp EVENT PAYMENTS CONTACT US 400 Private Road 6036, Palestine, TX 75801 info@iheartlakeview.org (903) 538-2711 Mon - Fri       8:00 am – 4:30 pm Office Hours: First Name Last Name Email Phone Message Send Thanks for submitting! LAKEVIEW A unique environment for experiencing God's love. CONTACT (903) 538-2711 ​ 400 Private Road 6036 Palestine, TX 75801 info@iheartlakeview.org SUBSCRIBE FOR EMAILS Enter your email here* Subscribe Now Thanks for submitting! Share Your Testimonial! © 2024 by Lakeview Methodist Conference Center. Privacy Policy bottom of page"
    },
    {
      "url": "https://www.chateau-lake-louise.com/dine/lakeview-lounge/",
      "text": "Lakeview Lounge Lobby Restaurant & Bar - Chateau Lake Louise Skip to main content We’re putting the finishing touches on the exciting new addition of BASIN Glacial Waters , our state-of-the-art, eco-friendly thermal bathing experience. While major construction is now complete, guests may notice some remaining work in progress—including final landscaping—through early fall. Please note, while renovations are in progress, our team is working diligently to minimize any disruption to your stay. We appreciate your understanding and patience as we work to make Fairmont Chateau Lake Louise an even more exceptional destination. Your Menu ( 0 ) Your Menu Total | $ 0.00 CAD Submit RFP Review Menu * Prices are for estimates only and are subject to change. Search for: X Close Stay Guest Rooms Suites Gold Explore All Accommodations Signature Collection Couples Getaway Family Travel Pet-Friendly Accessibility Guest Services View Offers Renovations Update Dine Restaurants Bars & Lounges Unique Experiences Dine at Chateau Lake Louise In-Room Dining Afternoon Tea Dine Offers Wellness Fairmont Spa Resort Pool Basin Glacial Waters Wellness at Chateau Lake Louise Spa Menu Book A Treatment Fitness & Movement Wellness Offers Gather Weddings Social Events Meetings Gather With Us Our Venues Banquet Menus Events Team Experience Christmas Ski Activities Activities & Events The Boathouse Seasonal Activity Guide Mountain Adventure Guide Event Calendar Offers Best Resort Offers Seasonal Offers Holidays & Events View All Offers Spa & Wellness Dine 1  403  522 3511 Gallery 1  403  522 3511 Stay Main Menu Stay Explore All Accommodations Guest Rooms Suites Gold Signature Collection Couples Getaway Family Travel Pet-Friendly Accessibility Guest Services View Offers Renovations Update Dine Main Menu Dine Dine at Chateau Lake Louise Restaurants Bars & Lounges Unique Experiences In-Room Dining Afternoon Tea Dine Offers Wellness Main Menu Wellness Wellness at Chateau Lake Louise Fairmont Spa Resort Pool Basin Glacial Waters Spa Menu Book A Treatment Fitness & Movement Wellness Offers Gather Main Menu Gather Gather With Us Weddings Social Events Meetings Our Venues Banquet Menus Events Team Experience Main Menu Experience Activities & Events Christmas Ski Activities The Boathouse Seasonal Activity Guide Mountain Adventure Guide Event Calendar Offers Main Menu Offers View All Offers Best Resort Offers Seasonal Offers Holidays & Events Spa & Wellness Dine Gallery Reservations Close Check In Check Out Guests Adults - 2 + Children - 0 + Accessible Room Required Add A Promo Code Check Rates Check Rates Close Check In Check Out Guests Adults - 2 + Children - 0 + Accessible Room Required Add A Promo Code Check Rates Search Check In Check Out Guests Adults - 2 + Children - 0 + Accessible Room Required Check Rates Check Rates Close Check In Check Out Guests Adults - 2 + Children - 0 + Accessible Room Required Add A Promo Code Check Rates Lakeview Lounge & Summer Patio Experience our iconic lobby lounge and summer patio. Wine, dine, mix, and mingle in style over Rocky Mountain-infused craft cocktails. Lakeview Lounge is the resort’s iconic restaurant and bar. Enjoy delicious foods as you take in world-famous views of Lake Louise and Victoria Glacier. During the summer months, soak up the fresh mountain air and surrounding beauty from one of the most scenic patios in the Canadian Rockies. Please note: Destination visitors to Lake Louise are able to join us in The Lakeview Lounge for lunch, with reservations required. Tel: 403-522-1817 | Email: [email protected] | Book Online: OpenTable LOCATION 111 Lake Louise Drive Lake Louise, Alberta T0L 1E0 HOURS All Day Dining Menu | Daily 11:00am - 10:00pm Food service until 9:00 PM Dining hours are subject to change, please contact our Dining Reservations team for the most up to date information CONTACT +1 403 522 1817 [email protected] Book Now Lunch Menu Dinner Menu Kid's Menu Dessert Cocktail Master Wine List Lunch Menu Dinner Menu Kid's Menu Dessert Cocktail Master Wine List Starters & Salads The Scotch Egg (D) (G) (P) | $26 fennel sausage, hot mustard emulsion Prawn Cocktail (S) | $34 whiskey cocktail sauce Burrata & Co Pizzette (D) (G) (N) (P) | $32 prosciutto ham, fig, cippolini onion jam, pistachio, fontina cheese, basil pistou Saffron Seafood Soup (G) (S)  | $28 saffron lobster broth, shrimp, mussels, fish, white bean, summer vegetable, herb butter crostini Smoked Albacore Tuna Niçoise (D)  | $35 west coast ocean wise albacore tuna, nicoise olive, BC hot house tomato, organic egg, green bean, yukon potato Lakeview Salad (D) (N) (VEG) | $26 Alberta-grown organic greens & herbs, dried mulberries, hemp seed, quinoa, pumpkin seed, whipped feta, sumac cranberry dressing Lakeview Special Montreal Style Rotisserie Chicken with Tableside Caesar Salad (D) (G) (S) (P)  | $58 per guest | minimum 2 slow cooked organic chicken & chili garlic crunch 12-Hour Smoked AAA Alberta Beef Brisket French Dip (D) (G)  | $48 gruyère cheese, crispy sweet onion, homemade sourdough baguette, dijonnaise, au jus Entrées Nova Scotia Buttered Lobster Roll (D) (G) (S) | $72 drawn butter, jalapeño, avocado, brioche roll, old bay aioli Alberta BBQ Elk Ribs (D) (G)  | $66 elderberry bbq sauce, grits & gruyère fritter, whipped potato, purple endive & radicchio AAA Alberta Beef Striploin | 12 oz (D) (G) | $68 shoestring potatoes, summer green salad, cowboy butter, au jus Spaghetti Squash (G) (N) (V) | $42 tomato fondu, tofu croutons, beluga lentil, basil & pistachio pesto Walleye Fish & Chips (G) (D) | $47 prosecco batter, garlic & rosemary salt, summer green salad, dill pickle tartar Chili Crab Ravioli (D) (G) (S) (P) (N) | $49 rosé butter sauce, herb crumbs, crème fraîche, nduja crumble, pistachio Sides French Fries & Aioli | Summer Green Salad | Buttermilk Baguette & Butter | Grits & Gruyère Fritter | $14 (G) Contains Gluten / (D) Contains Dairy / (VEG) Vegetarian / (V) Vegan / (N) Contains Nuts / (P) Contains Pork / (S) Contains Shellfish Please note our menus change regularly and the most up-to-date menu is the one at the restaurant. All of our menu items are regionally sourced, where applicable, our seafood is caught using sustainable methods. 2 Course Menu | $68 per person Appetizers | Choose one French Onion Soup (D) (G) fennel sausage, hot mustard emulsion Lakeview Salad (D) (N) (VEG) Alberta-grown organic greens & herbs, dried mulberries, hemp seed, quinoa, pumpkin seed, whipped feta, sumac cranberry dressing Mains | Choose one Walleye Fish & Chips (G) (D) prosecco batter, garlic & rosemary salt, summer green salad, dill pickle tartar Roast Chicken Mafaldine Pasta (D|G) wild mushroom, rosemary crumbs, wilted kale, crème fraîche, shaved pecorino Flat Iron Steak 8 oz (D) (G) yukon potato purée, cowboy butter, grilled asparagus, onion rings, bone marrow jus Entrées Montreal Style Rotisserie Chicken with Tableside Caesar Salad (D) (G) (S) (P)  | $58 slow-cooked organic chicken, chicken salt, chili garlic crunch AAA Alberta Beef Striploin | 12 oz (D) (G) | $68 shoestring potatoes, summer green salad, cowboy butter, au jus Chili Crab Ravioli (D) (G) (S) (P) (N) | $49 rosé butter sauce, herb crumbs, crème fraîche, nduja crumble, pistachio Smoked Albacore Tuna Niçoise (D)  | $35 west coast ocean wise albacore tuna, nicoise olive, BC hot house tomato, organic egg, green bean, yukon potato Alberta BBQ Elk Ribs (D) (G)  | $66 elderberry bbq sauce, grits & gruyère fritter, whipped potato, purple endive & radicchio Spaghetti Squash (G) (N) (V) | $42 tomato fondu, tofu croutons, beluga lentil, basil & pistachio pesto Sides French Fries & Aioli | Summer Green Salad | Buttermilk Baguette & Butter | Grits & Gruyère Fritter | $14 (G) = Contains Gluten / (N) Contains Nuts / (D) Contains Dairy / (S) Contains Shellfish / (VEG) = Vegetarian / (V) = Vegan / (P) Contains Pork Please note our menus change regularly and the most up-to-date menu is the one at the restaurant. All of our menu items are regionally sourced, where applicable, our seafood is caught using sustainable methods. Main | $18 Choice Of: The Best Grilled Cheese Sandwich (D) (G) Seared Salmon (G) with french fries and steamed broccoli Cheese & Tomato Flatbread (D) (G) Roast Chicken with steamed vegetables Fresh Pasta (G) with tomato sauce & vegetables Dessert | Complimentary Choice Of: Rainbow Cake (G) (D) with lots of sprinkles Ice Cream (D) Fruit Plate Kids Drinks | $7.50 Choice Of: Tropical Punch mango, pineapple, chai, lime, sprite, grenadine Watermelon Cucumber Crush watermelon, cucumber, mint, lemon, sprite Blueberry Ginger Fizz blueberry puree, lime, ginger beer (G) contains gluten | (VEG) vegetarian | (V) vegan | (N) contains nuts | (D) contains dairy Please note our menus change regularly and the most up-to-date menu is the one at the restaurant. All of our menu items are regionally sourced, where applicable, our seafood is caught using sustainable methods. Dessert Traditional Cheesecake (G) (D) (N) | $18 wrapped in a lemon blueberry sponge served with chantilly cream & poached huckleberry sauce Homemade Donuts (G) (D) | $18 powdered poppy donut & cinnamon toast crunch donut (perfect with a coffee) Classic Crème Brûlée | $18 infused with tahitian vanilla bean, served with summer raspberry shortbread cookie Triple Chocolate Mousse (D) (P) | $18 white, milk, & dark chocolate, with fudge brownie centre, over a bed of cookie crumble Tropical Sorbet (V) | $18 mango, piña colada, & watermelon sorbet, served with exotic fruit Warm Peach Strudel (G) (D) | $18 okanagan peach, vanilla, & brown sugar, baked in flaky pastry, served à la mode with vanilla ice cream Neapolitan Ice Cream (D) | $18 strawberry, chocolate & vanilla ice cream, served with whipped cream & a cherry on top Strawberry & Rhubarb Shortcake (G) (D) (P) | $18 summer strawberries & local rhubarb, with vanilla sponge & raspberry powder Specialty Coffee Cappuccino $6.5 Latte $6.5 Flat White $6.5 Mocha $6.5 Americano $6.5 Lot 35 Teas Earl Grey $6.5 English Breakfast $6.5 Decaf English Breakfast $6.5 Oregon Mint $6.5 Egyptian Chamomile $6.5 Jasmine Gold Dragon Green $6.5 Ports Taylor Fladgate Tawny 10 Yrs Port $15 Taylor Fladgate Tawny 20 Yrs Port $19 (VEG) Vegetarian / (G) Contains Gluten / (N) Contains Nuts / (V) Vegan / (D) Contains Dairy Please note our menus change regularly and the most up-to-date menu is the one at the restaurant. All of our coffee beans are regionally sourced. Our tea suppliers are dedicated to environmental and social sustainability. Lakeview Signatures Lakeview $22 2oz | citadelle gin, cucumber, lemon Iconic $23 2oz | smoked tea, bitters, untamed signature rye Tatemada $22 2oz | ilegal mezcal, charred jalapeños, agave, egg whites, yellow chartreuse, cointreau Grapefruit $21 2oz | ketel one vodka, apple, grapefruit, lime, st. germain It's 5 O'Clock Somewhere $19 2.5oz | citadelle gin, raspberry, lemon, egg white, noilly prat, cocchi di torino Lakeview Classics Espresso Martini  | $23 2.75oz | chili-infused espolòn blanco, ojo de dios café, galliano, fresh espresso, chocolate Vesper Martini  | $25 3.25oz | citadelle gin, tito's vodka, cocchi americano, lemon zest Boulevardier | $26 3oz | woodford reserve bourbon, market fresh tea, infused campari, cocchi di torino, orange zest French 75  | $32 3.5oz | empress gin, violet liqueur, lemon, sugar, billecart-salmon réserve brut Margarita | $28 2.5oz | patrón blanco, hibiscus syrup, orange liqueur, lime, smoked paprika, chili salt Summer Collection Hurricane  | $23 2.5oz | plantation 3-star, royal jamaican spiced rum, orange liqueur, fassionola syrup, passionfruit, lime Lazy Emerald  | $22 2oz | coconut vodka, blanco vermouth, cocounut water, yuzu, matcha Banana Daquiri  | $21 2oz | plantation 3-star, st. james agricole, banana liqueur, lime, sugar Zero Proof Cocktails Spicy Mango Paloma $15 seedlip grove 42, mango, agave infused with jalapeño, grapefruit, lime, hopped soda Cucumber Cooler $15 seedlip garden 108, cucumber, acid adjusted pineapple, chamomile Fin Soda Refreshers $14 let fin soda's small-batch craft sodas be your starting point. Ask your server about today's refreshing, alcohol-free creations made just for you Beer & Cider Draught 16oz Peroni Lager, Italy | $14 Microburst Hazy IPA, Banded Peak, Alberta  | $13 Backcountry Blonde Ale, Chateau Lake Louise | $13 Big Rock Dry Apple Cider, Alberta | $13 Can 355ml Grumpy Bear Honey Wheat Ale, Grizzly Paw, Alberta | $9 Pegasus American Pale Ale, Ol'Beautiful, Alberta | $9 Can | $10 473ml New England Pale Ale, Blindman Brewing, Alberta | $10 Btl | $9 330ml Bud Light, USA | $9 Kokanee, Canada | $9 Stella Artois, Belgium | $9 Corona, Mexico | $9 Zero Proof Beer btl 330ml 0.0% | Peroni, Italy | $10 Specialty Coffee Cappuccino $6.5 Latte $6.5 Flat White $6.5 Mocha $6.5 Americano $6.5 Lot 35 Tea Earl Grey $6 English Breakfast $6 Decaf English Breakfast $6 Oregon Mint $6 Egyptian Camomile $6 Jasmine Gold Dragon Green $6 Sparkling Wine & Champagne 5oz Btl Procecco | Giusti \"Rosalia\" Prosecco | Veneto Italy | NV $16 $80 Benjamin Bridge \"Brut\" | Nova Scotia, Canada I NV $27 $135 Billecart-Salmon | Champagne, France | NV $30 $150 Champagne | Verve Cliquot Brut \"Yellow Label\" | Reims, France | NV $32 $160 White Wine 5oz BTL House White $15 $75 Chardonnay | Meyer Family | Okanagan, BC | 2024 $19 $95 citrus, green apple, white peach, subtle oak spice, creamy texture Pinot Gris | Mission Hill “Reserve” | Okanagan, BC | 2022 $22 $110 citrus, peach, ginger spice, toasty oak & honey Sauvignon Blanc | Château de Sancerre | France | 2023 $16 $80 grapefruit, green apple, lime zest, flinty minerality, crisp and vibrant finish Grüner Veltliner | Hiedler | Kamptal, Austria | 2023 $20 $100 green apple, white pepper, lemon zest, crisp mineral finish Red Wine 5oz BTL House Red $15 $75 Shiraz | Wynns ‘Black Label’ | Coonawarra, Australia | 2021 $25 $125 ripe blackberry, plum, peppercorn, dark chocolate, elegant oak spice finish Pinot Noir | Little Engine ‘Silver’ | Naramata Bench, BC | 2021 $25 $125 strawberry, raspberry, red cherry & soft herbs Cabernet Sauvignon | Black Stallion | Napa Valley, USA | 2021 $27 $135 cherry, raspberry, blackberry, dry Bordeaux Blend | Culmina R&D | Okanagan, BC | 2022 $17 $85 blackberries, plums, cherries, pepper & hint of tobacco Rosé 5oz BTL Rosé Blend | Mission Hill Estate | Okanagan, BC, Canada | 2021 $16 $80 red berries, pink grapefruit, watermelon, strawberries in cream Pinot Noir Gamay | JoieFarm | Naramata Bench, BC | 2023 $20 $100 crisp and dry, with wild strawberry, rhubarb, and refreshing citrus lift *Our master wine list is available upon request* Gin Fairview Gin $12 Bombay Sapphire $11 Hendrick’s $12 Tanqueray No. TEN $13 The Botanist $13 Citadelle $11 Wild Life Rhubarb Gin $12 Roku $12 Monkey 47 $22 Vodka Ketel One $11 Belvedere $13 Grey Goose $13 Tito's $10 Absolut Elyx $11 Park Vodka $11 Park Vanilla Vodka $11 Rum Mount Gay Eclipse $11 Mount Gay XO $16 Flor De Caña 7 Year $11 Ron Zacapa 23 Year $16 Flor De Cana 5 Year $11 Planteray 3 Stars $10 Planteray Pineapple $11 Royal Jamaican Spiced $10 Leblon Cachaça $11 Canadian Whisky Park Glacier Rye $11 Bearface Triple Oak $10 Lot 40 Rye $11 Forty Creek Confederation Oak $16 American Whiskey Rittenhouse Rye $11 Maker’s Mark $13 Woodford Reserve $13 Michter's Sour Mash Bourbon $17 Basil Hayden’s $13 Jack Daniel’s $11 Mitchter's American Whiskey $15 Bib & Tucker 6 Year $16 Buffalo Trace $12 Around the World Santury Toki | Japan $11 The Irishman Single Malt | Ireland $18 The Irishman Carribean Cask | Ireland $15 Tullamore D.E.W. | Ireland $11 Jameson | Ireland $11 Nikka Coffey Grain $16 Hibiki Japanese Harmony | Japan $32 Scotch Glenkinchie 12 Years Old $15 Auchentoshan American Oak $12 The Macmillan 12 Year $22 Oban 14 Year $19 Glenmorangie 10 Year $16 The Balvenie Carribean Cask $19 Glenfiddich 12 Year $17 Glenlivet 21 Year $62 Lagavulin 16 Year $27 Laphong 10 Year $16 Ardbeg 10 Year $18 Bowmore 12 Year $14 Talisker 10 Year $17 Johnnie Walker Black $12 Johnnie Walker Blue $38 Monkey Shoulder $12 Agave Casamigos Blanco $14 Casamigos Añejo $18 Casamigos Reposado $16 Casamigos Mezcal $18 Patrón Reposado $16 Patrón Añejo $23 Patrón Silver $14 Espolón Blanco $11 Don Julio Blanco $14 Don Julio Añejo $20 Don Julio 1942 $55 Cognac & Brandy Rémy Martin VSOP $15 El Gobernador Pisco $10 Courvoisier VS $11 Hennessy VS $11 Hennessy XO $30 Rémy Martin 1738 $19 Remy Martin Louis XIII $315 Port Taylor Fladgate Tawny 10 yrs $12 Taylor Fladgate Tawny 20 yrs $19 Please note our menus change regularly and the most up-to-date menu is the one at the restaurant. All of our coffee beans are regionally sourced. Our tea suppliers are dedicated to environmental and social sustainability. Bubbly Champagne 375ml 750ml Taittinger Brut | NV $85 $140 Taittinger \"Comtes de Champagne\" Blanc de Blancs | 2011 -- $525 Veuve Clicquot-Ponsardin \"Yellow Label\" Brut | NV $85 $160 Veuve Clicquot-Ponsardin \"Rose\" Brut | NV -- $175 Veuve Clicquot-Ponsardin 'La Grande Dame' | 2012 -- $740 Moët & Chandon \"Imperial\" Brut $75 $190 1500ml | $310 Moët & Chandon \"Rosé Imperial\" Brut -- $225 Moët & Chandon Dom Pérignon I 2012 -- $550 Moët & Chandon Dom Pérignon \"Lady Gaga Limited Edition\" I 2010 -- $570 Moët & Chandon \"Dom Pérignon\" Rose | 2006 -- $650 Louis Roederer \"Collection 242\" -- $240 Louis Roederer Cristal Brut | 2014 -- $1400 Louis Roederer Cristal Rose | 2013 -- $1500 Krug \"Grand Cuvee\" Brut -- $600 Krug Brut I 2008 -- $900 Pol Roger Brut I 2013 -- $215 Pol Roger Rosé Brut I 2012 -- $230 Pol Roger Blanc de Chardonnay | 2015 -- $300 Pol Roger \"Sir Winston Churchill Cuvee\" Brut I 2013 -- $600 Billecart-Salmon Brut | NV -- $195 Billecart-Salmon Rosé Brut | NV -- $280 Billecart-Salmon Blanc de Blanc | NV -- $300 Billecart-Salmon Brut Sous Bois | NV -- $300 Billecart-Salmon \"Cuvee Nicolas Francis\" Brut I 2002 -- $600 JM Sélèque \"Solessence\" Brut Nature -- $180 Laurent Perrier Rosé Brut | NV -- $240 Domaine Henriot 'Millésime' | 2008 -- $250 Delamotte Brut | NV -- $180 Delamotte Rosé Brut | NV -- $270 Delamotte Blanc de Blanc | 2014 -- $290 Salon 'Le Mesnil' Blanc de Blanc | 2012 -- $2000 Bollinger Special Cuvee | NV -- $215 Bruno Paillard Premiere Cuvee | NV -- $230 Grower Champagne Chartogne-Taillet \"Cuveé Sainte Anne\" Merfy -- $145 Bruno Paillard 'Premiere Cuvee' Brut | NV -- $190 Jean Josselin 'Aux Origins' I 2015 -- $195 J.L Vergnon 'Conversation' Blanc de Blanc | NV -- $230 Egly-Ouriet 'Grand Cru' Extra Brut | NV -- $350 Champagne Methode Franciacorta I Ca'del Bosco I Italy I NV $150 Franciacorta I Marchese Antinori 'Cuvee Royale' I Italy I NV $120 Sparkling Wine Blanc de Blanc I Schramsberg I California | 2021 $165 Blanc de Noir I Schramsbery I California | 2020 $165 Prosecco Prosecco | \"Rosalia\" Giusti | Veneto, Italy $80 Canada Frizzante | Benjamin Bridge 'Nova 7' | NV $80 Benjamin Bridge Brut | Nova Scotia | NV $135 Henry of Pelham 'Cuvée' Catherine Rose Brut' | Niagara, Ontario | NV $130 Henry of Pelham 'Cuvée' Catherine Brut' | Niagara, Ontario | NV $135 White Wine | Chardonnay Canada Henry of Pelham I Niagara, Ontario I 2023 $85 Flat Rock \"Foundation\" | Niagara, Ontario | 2021 $85 Cave Springs 'Estate Grown' | Niagara, Ontario | 2023 $90 Upper Bench Winery | Okanagan, BC | 2022 $130 Tantalus | 'Bear' | Okanagan, BC | 2022 $125 Little Engine | 'Gold' | Okanagan, BC | 2019 $150 CheckMate Artisinal Winery 'Attack' | Okangan, BC | 2019 $250 CheckMate Artisinal 'Fools mate' | Okangan, BC | 2020 $285 CheckMate 'Queen Taken' | Okangan, BC | 2020 $250 Blue Mountain | Okanagan, BC | 2022 $115 United States Ridge | Estate St. Cruz Mountains Chardonnay, Santa Cruz Mountains, California | 2020 $260 Buehler | Russian River Valley, Sonoma County, California | 2019 $100 Ramey I Russian River Valley, California I 2019 $180 Kistler | Carneros, California | 2022 $235 Cuvaison | Carneros, California | 2020 $155 Starmont Merryvale | Mendocino, Monterrey, Nappa Valley California | 2021 $160 Cakebread Cellars | Napa Valley, California | 2021 $190 Dumol Estate Vineyard | Sonoma, County | 2020 $350 Mays Canyon 'Littorai' | Sonoma, California | 2022 $250 Chardonnay le Puits Sec | Evesham Wood | Willamette, Oregon | 2023 $200 Haakon/Lenai | Purple Hands | Willamette Valley, Oregon | 2022 $195 Prince Hill Vineyards | Willamette, Oregon | 2022 $240 Lingua Franca 'Avni' | Willamette, Oregon | 2021 $160 Riesling Canada Henry of Pelham | Niagara, Ontario | 2022 $85 Martin's Lane 'Simes Vineyard' | Okanagan, BC | 2022 $140 Monte Creek | 'Living Land' | Okanagan, BC | 2021 $85 Synchromesh | 'Thorny Vines' | Okanagan, BC | 2022 $110 Synchromesh | 'Gold Digger' | Okanagan, BC | 2022 $160 Tantalus | 'Old Vines' | Okanagan, BC | 2019 $150 Synchromesh | 'Longs View' | Okanagan, BC | 2022 $110 Tanatalus | 'Old Vines' | Okanagan, BC | 2019 Rosé Canada Rose Blend I Mission Hill Estate I Okanagan, BC I 2022 $80 Rose Blend | Culmina R&D | Okanagan, BC | 2021 $85 Pinot Noir/Gamay | Joie Farm | Okanagan, BC | 2021 $110 Red Wine Canada Merlot | Mission Hill Estate 'Reserve' | Okangan Valley, BC | 2021 $100 Merlot | Upper Bench Winery | Okanagan Valley, British Columbia | 2020 $140 Merlot | Gray Monk ‘Odyssey’ | Okanagan Valley, British Columbia | 2018 $125 Merlot | CheckMate ‘End Game’ | Okanagan Valley, British Columbia | 2019 $225 Merlot | Bench 1775 | Okanagan Valley, British Columbia | 2018 $90 Cabernet-Merlot | Mission Hill Estate Series | Okanagan Valley, British Columbia | 2021 $85 Cabernet Franc | Synchromesh ‘Storm Haven Vineyard’ | Okanagan Valley, British Columbia | 2022 $125 Meritage | Black Hills ‘Bona Fide’ | Okanagan Valley, British Columbia | 2021 $110 Meritage | Poplar Grove ‘The Legacy’ | Okanagan Valley, British Columbia | 2018 $100 Meritage | Poplar Grove ‘CSM’ | Okanagan Valley, British Columbia | 2019 $120 Meritage | Gray Monk ‘Odyssey’ | Okanagan Valley, British Columbia | 2020 $125 Meritage | Orofino ‘Beleza’ | Okanagan Valley, British Columbia | 2018 $125 Meritage | Synchromesh ‘Tertre Rouge’ | Okanagan Valley, British Columbia | 2021 $110 Meritage | Laughing Stock ‘Blind Trust’ | Okanagan Valley, British Columbia | 2021 $120 Meritage | Mission Hill Family Estate ‘Quatrain’ | Okanagan Valley, British Columbia | 2019 $230 Meritage | Clos du Soleil ‘Signature’ | Similkameen Valley, British Columbia | 2020 $165 Meritage | Mission Hill Family Estate ‘Compendium’ | Okanagan Valley, British Columbia | 2019 $220 Syrah | Laughing Stock | Okanagan Valley, British Columbia | 2021 $150 Syrah Blend | Daydreamer ‘Amelia’ | Okanagan Valley, British Columbia | 2022 $160 Syrah | Le Vieux Pin ‘Cuvee Violette’ | Okanagan Valley, British Columbia | 2021 $165 Syrah I Laughing Stock I Okanagan, BC I 2021 $150 Pinot Noir | Little Engine ‘Silver’ | Naramata Bench, Okanagan Valley, British Columbia | 2019 $125 Pinot Noir | Little Engine ‘Gold’ | Naramata Bench, Okanagan Valley, British Columbia | 2019 $160 Pinot Noir | Upper Bench Winery | Okanagan Valley, British Columbia | 2022 $130 Pinot Noir | Stag’s Hollow ‘Shuttleworth Creek Vineyard’ | Okanagan Valley, British Columbia | 2022 $120 Pinot Noir | Martins Lane ‘Dehart’ | Okanagan Valley, British Columbia | 2018 $250 Pinot Noir | Martins Lane ‘Simes’ | Okanagan Valley, British Columbia | 2018 $250 Pinot Noir | Tantalus | Okanagan Valley, British Columbia | 2021 $160 United States Merlot | Emmolo | Napa Valley, California | 2020 $180 Merlot | Paloma | Napa Valley, California | 2013 $275 Meritage (Merlot) | Vérité 'La Muse'| Sonoma, California | 2009 $775 Meritage (Cabernet Franc) | Vérité 'Le Désir' | Sonoma, California | 2012 $775 Meritage (Cabernet Sauvignon) | Vérité 'La Joie' | Sonoma, California | 2012 $775 Meritage | Joseph Phelps 'Insignia' | Napa Valley, California | 2015 $750 Meritage | Joseph Phelps 'Insignia' | Napa Valley, California | 2019 $850 Meritage | Screaming Eagle \"The Flight\" | Napa, California | 2014 $2400 Syrah | Sine Qua Non | Central Coast, California | 2015 $625 Zinfandel Blend | 'The Prisoner' | Napa Valley, California | 2021 $180 Cabernet Sauvignon | Kiona | Red Mountain, Washington | 2018 $125 Cabernet Sauvignon | Kiona 'Old Block' | Red Mountain, Washington | 2021 $295 Cabernet Sauvignon | Domaine Eden | Santa Cruz, California | 2017 $250 Cabernet Sauvignon | Mt. Eden | Santa Cruz, California | 2017 $350 Cabernet Sauvignon | Bon Anno | Napa Valley, California | 2022 $135 Cabernet Sauvignon | Truchard | Carneros, Napa Valley, California | 2020 $125 Cabernet Sauvignon | Louis M. Martini | Napa Valley, California | 2018 $140 Cabernet Sauvignon | Joseph Phelps 'Innisfree' | Napa Valley, California | 2019 $160 Cabernet Sauvignon | Honig | Napa Valley, California | 2019 $195 Cabernet Sauvignon | Stag's Leap Wine Cellars 'Artemis' | Napa Valley, California | 2020 $280 Cabernet Sauvignon | Grgich Hills Estate | Napa Valley, California | 2013 $250 Fox Glove | Cabernet Sauvignon | Edna Valley, California | 2021 $95 Cabernet Sauvignon | Joseph Phelps | Napa Valley, California | 2021 $290 Cabernet Sauvignon | Joseph Phelps | Napa Valley, California | 2019 $290 Cabernet Sauvignon | Black Stallion | Napa Valley, California | 2021 $135 Cabernet Sauvignon | Silver Oak | Alexander Valley, California | 2020 $530 Cabernet Sauvignon | Faust 'The Pact' | Napa Valley, California | 2021 $425 Cabernet Sauvignon | Silver Oak 'Timeless'| Napa Valley, California | 2019 $625 Cabernet Sauvignon | Caymus | Napa Valley, California | 2021 $250 Caymus 'Special Selection' | Napa Valley, California | 2018 $425 Cardinale | Napa Valley, California | 2010 $590 Cardinale | Napa Valley, California | 2012 $590 Mayacamas Vineyards | Mount Veeder, California | 2019 $550 Mayacamas Vineyards | Mount Veeder, California | 2007 $600 Mayacamas Vineyards | Mount Veeder, California | 2006 $600 Lokoya | Mt Veeder, California | 2010 $850 Lokoya | Howell Mountain, California | 2010 $850 Heitz Cellars 'Martha's Vineyard' | Napa Valley, California | 2014 $850 Cabernet Sauvignon | Silver Oak | Alexander Valley, California | 2020 $330 Cabernet Sauvignon | Silver Oak | Alexander Valley, California | 2014 $460 Cabernet Sauvignon | Justin | Paso Robles, California | 2019 $130 Malbec | Kiona | Red Mountain, Washington | 2019 $140 Sangiovese | Kiona | Red Mountain, Washington | 2021 $140 Pinot Noir | Stoller Family Vineyards | Oregon | 2022 $115 Pinot Noir | Ken Wright | Williamette Valley, Oregon | 2023 $120 Pinot Noir | Ken Wright | Williamette Valley, Oregan | 2022 $120 Pinot Noir | Evesham Wood | Willamette, Oregon | 2022 $120 Pinot Noir | 'Avni' Lingua Franca | Willamette, Oregon | 2021 $160 Pinot Noir | Evesham Wood 'Sojeau Vineyard' | Eola-Amity Hills, Oregon | 2021 $175 Pinot Noir | Evesham Wood 'Illahe Vineyard' | Eola-Amity Hills, Oregon | 2021 $175 Pinot Noir | Littorai 'Roman Vineyard'| Sonoma County, California | 2017 $225 Pinot Noir | Arnot-Roberts 'Peter Martin Ray Vineyard' | Santa Cruz, California | 2017 $240 Pinot Noir | Dumol RRV | Russian River Valley, California | 2021 $300 Pinot Noir I Pont Neuf \"La Vouge\" I Russian River Valley, California I 2018 $300 Please note our menus change regularly and the most up-to-date menu is the one at the restaurant. Full master wine list Savour Summer on a Patio Indulge in lakeside dining with million-dollar views of Lake Louise and the Victoria Glacier on our iconic Lakeview Patio. Perfect for intimate meals or gatherings with friends, sit back and relax and take in the sites on the shore of Lake Louise. Exclusive Offers and Updates from Chateau Lake Louise Subscribe Today With humility and deep respect, we acknowledge that we live and work within the present-day territories of Treaty 6, 7 and 8, as well as the Métis Homeland. The lands and waters of Banff National Park have been used for millennia by Indigenous Peoples for sustenance, ceremony, trade and travel. We thank them for their continuous stewardship and for sharing this land. 111 Lake Louise Drive Lake Louise, Alberta T0L 1E0, Canada US & CAN: 1 (866) 540-4413 International: 1 (403) 522 3511 [email protected] Contact Us Getting Here Blog About Loyalty Program Webcam Awards & Accolades Our Commitment Press Room FAQs Sitemap Web Accessibility Terms & Conditions Privacy Policy California Collection Notice Cookie Policy Your Privacy Choice Find your adventure on the Accor All App Fairmont is a part of Accor. Copyright 2025. All Rights Reserved. Terms & Conditions Privacy Policy California Collection Notice Cookie Policy Your Privacy Choice Call Check Rates Close Endless Summer Memories – Save Up To 25% Immerse yourself in endless summer adventures and create memories that last a lifetime. Learn More"
    },
    {
      "url": "https://lakeviewbarandgrille.com/",
      "text": "Lakeview Bar & Grille 772-342-2105 Home Menu & Event Calendar Menu Event Calendar More Home Menu & Event Calendar Menu Event Calendar 772-342-2105 Home Menu & Event Calendar Menu Event Calendar Open \nto the public Open \nto the public Open \nto the public Open \nto the public Indoor and outdoor seating About us Happy Hour Join us for Happy Hour Monday & Saturday 3pm-5pm Tuesday-Friday 3pm-6pm $1 off House Wines/Well Drinks/Draft Beers Events At Lakeview Bar & Grille, we love hosting events! From live music to trivia nights, we have something for everyone. Lakeview Bar & grille                Private rental Lakeview Bar & grille                Private rental We offer a private event space for parties, rehearsal dinners, showers, corporate events & meetings, and more. Contact us to learn more about our event packages and availability. Call 772-336-2507 For More Rental Information Social We're Hiring! Join our team! Apply Now Name Phone Email* Attach Resume Attachments (0) This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Submit Application hours & directions Family owned & operated Come check out our daily specials! Lakeview Bar & Grille St. Lucie Trail Golf Club, 951 SW Country Club Dr, Port Saint Lucie, Florida 34986, United States 772-342-2105 Hours Monday & Saturday: 9am - 5pm Tuesday: 10am-9pm Wednesday - Friday: 9am - 9pm Sunday: Closed (Kitchen opens at 10:30AM) Get directions Lakeview Bar & Grille 951 SW Country Club Drive Port Saint Lucie, FL 34986 772-342-2105 Copyright © 2025 Lakeview Bar & Grille - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}