{
  "fuentes": [
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "admin@bhpgc.co.uk"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "carlpcross@aol.com"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "house@bhpgc.co.uk"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "sec@bhpgc.co.uk"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.lakeviewgolf.net/meet-the-team/",
      "email": "proshop@lakeviewgolf.net"
    },
    {
      "url": "https://www.lakeview-golf.com/contact-us/",
      "email": "20info@lakeview-golf.com"
    },
    {
      "url": "https://www.lakeview-golf.com/contact-us/",
      "email": "info@lakeview-golf.com"
    },
    {
      "url": "https://lakeviewgolf.co.nz/contact/",
      "email": "info@lakeviewgolf.co.nz"
    },
    {
      "url": "https://lakeviewgolf.co.nz/contact/",
      "email": "lakeview@golf.co.nz"
    },
    {
      "url": "https://www.lakeviewwvgolf.com/contact-us/",
      "email": "info.lakeview@ailhospitality.com"
    },
    {
      "url": "https://www.lakeviewwvgolf.com/contact-us/",
      "email": "info.lakeview@ailhotels.com"
    },
    {
      "url": "https://www.lakeviewgolf.net/about-us/",
      "email": "proshop@lakeviewgolf.net"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "bherrick@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "chef@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "dfabbri@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "eventscoordinator@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "fachour@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "operations@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "rfabbri@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "email": "tfabbri@lakeviewhills.com"
    },
    {
      "url": "https://www.lakeviewgolf.net/",
      "email": "proshop@lakeviewgolf.net"
    }
  ],
  "mails": [
    "20info@lakeview-golf.com",
    "admin@bhpgc.co.uk",
    "bherrick@lakeviewhills.com",
    "carlpcross@aol.com",
    "chef@lakeviewhills.com",
    "dfabbri@lakeviewhills.com",
    "eventscoordinator@lakeviewhills.com",
    "fachour@lakeviewhills.com",
    "house@bhpgc.co.uk",
    "info.lakeview@ailhospitality.com",
    "info.lakeview@ailhotels.com",
    "info@belfairsgolfclub.co.uk",
    "info@lakeview-golf.com",
    "info@lakeviewgolf.co.nz",
    "lakeview@golf.co.nz",
    "operations@lakeviewhills.com",
    "proshop@lakeviewgolf.net",
    "rfabbri@lakeviewhills.com",
    "sec@bhpgc.co.uk",
    "tfabbri@lakeviewhills.com"
  ],
  "nombre_sitio": "lakeviewgcdelray.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "text": "Contact Us | Buxton and High Peak Golf Club Members Login Buxton and High Peak Golf Club Menu Home Course Tour of the Course Scorecard Course Record Holders Local Rules Rules of Golf - Etiquette Greens Our Greens, Fairways and Staff.... How To Repair A Pitch Mark How To Rake A Bunker Tips On Avoiding Slow Play How To Read Greens Better Sponsorship Opportunities Sponsorship Packages Our Current Sponsors Club History The Club History A message from a Centenary golf ball. The Spirit Of Christmas Early Days Jack Simpson - The First Professional The Debenture Records Golf Club Archaeology Old Map of BHPGC The Clubhouse - A Tale of Two Clocks Centenary News A who's who of Club Competitions & Cups The Buxton and High Peak Golf Club Ball In The Bag POEM Buxton & High Peak Golf Club A Who's Who of Competitions (Ladies Section) The 9th Hole 'Standside' Golf Ilustrated Sid Green Golf Clubs Reflections on the Club Motto 'By Hook Or By Crook' Standside 2 Metamorphosis Golf History Bogey to Blow-Up Why 18 Holes? Emergency Procedures/Club Contacts and telephone Numbers Course Conditions LEAVE YOUR REVIEW OF OUR CLUB HERE Opens Open Competitions Overview Open Online Bookings Visitors Visitors Welcome Visitors Information Buggy Guidance Visitor Online Tee Bookings WINTER GREEN FEES 2025/2026 SUMMER GREEN FEES 2025 Stay & Play Deals 9 Green Lane Membership Rates 1st June 2025 - 31st May 2026 Application Form Trial Membership Trial Membership 2025 Application Form for Trial Membership Visitors and  Societies Programme Notes For Visitors Including Dress Regulations On The Course and Clubhouse eNewsletter Subscription Twitter Activity Facebook Activity Professional Members General Club Noticeboard Members Online Tee Bookings Mens A message from Mr Captain 2024 Mens Competition Overview Untitled Resource Ladies Ladies Welcome Ladies Competition Overview Ladies Match Overview Untitled Resource Message from the Lady Captain 2023 Seniors Seniors Welcome Seniors Competition Overview Seniors Dinner Photos Seniors Contacts Seniors Results Juniors Juniors Welcome Juniors Competition Overview Junior Contacts Junior Presentation 2019 Members Only Area Competition Results Council 2024 Our Dignitaries Captains Honour Board Ladies Captains Honour Board Presidents Honour Board Ladies Presidents Honour Board Junior Captains Honour Board Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Mixed Honours Board Juniors Honours Board Reciprocal Golf Safe Golf Club Welfare Officer England Golf Disciplinary Regulations Equality, Diversity & Inclusion Policy Clubhouse Welcome to our Club House... Clubhouse Staff Clubhouse Noticeboard Social Programme Meeting  & Training Room for Hire Captain's Charity Diary Find Us Contact Us Members' Login Contact Us Buxton & High Peak Golf Club 27 Town End, Fairfield, Buxton, Derbyshire, SK17 7EN Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. For map and directions, please click here . Office Administrator - Mrs Tracey Hannah Tel: 01298 26263 (opt1) Email: admin@bhpgc.co.uk Club Secretary, Mr Garry Bagguley Tel: 01298 26263 (opt1) Email: sec@bhpgc.co.uk Professional, Mr Carl Cross Tel:01298 26263 (opt2) Email: carlpcross@aol.com Reach Catering Services (Bar & Catering) - Mr Stuart Dale Tel: 01298 26263 (opt3) Email: house@bhpgc.co.uk Course conditions: Tel: 01298 26263 (opt2) You may complete this form to contact Buxton and High Peak Golf Club. Alternatively, you can send an email to: carlpcross@aol.com. Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Pro Shop Visitor Review Club/Course Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Recent Site Updates Course Conditions 10-Sep-2025 08:21 Seniors Stamford Match Report 03-Sep-2025 14:21 Seniors Reddish Vale Match Report 03-Sep-2025 14:15 Contact phone: 0129 826263 email: admin@bhpgc.co.uk Links RSS Feed Cookie and Privacy Contact Us Find Us Follow Us Members Login Copyright © Buxton and High Peak Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS Switch to Desktop View Switch to Mobile View Scroll"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.lakeviewgolf.net/meet-the-team/",
      "text": "Meet The Team - Lakeview Golf Club Home Memberships Season Passes College Rates Daily Rates Practice Range Play Lakeview Play the Course Simulator Golf Calendar Lessons Instruction John Rogers Ryan Hite Juniors Junior Golf Jr Camps High School Prep Week Jr Tour TPS Drive, Chip, and Putt Meet The Team Legends Bar and Grill Leagues Skip to primary navigation Skip to main content Skip to footer Lakeview Golf Club Harrisonburg, VA Meet The Team Ryan Hite – General Manager Kurt Hellenga – Superintendent John Rogers – Director of Instruction Mark Smith – Food & Beverage Manager Lynn McNett – Pro Shop Manager Chris Rowe – Carts Manager Learn the Game Instruction Junior Golf Footer Contact Us Pro Shop 540-434-8937 proshop@lakeviewgolf.net Hours of Operation Follow Us Find Us 4101 Shen Lake Drive Harrisonburg, VA 22801 Meet The Team Ryan Hite – General Manager Kurt Hellenga – Superintendent John Rogers – Director of Instruction Mark Smith – Food & Beverage Manager Lynn McNett – Pro Shop Manager Chris Rowe – Carts Manager Subscribe Sign-up today and stay updated with events, course closings, and special offers! Please enable JavaScript in your browser to complete this form. Name: Email * Subject: Message: Comment Submit Search Our Site Search this website Copyright © 2025 Lakeview Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lakeview-golf.com/contact-us/",
      "text": "Lakeview Golf Course | Boise Golf Courses | Boise Golf Hit enter to search or ESC to close Home Golf About Us Course Usage Rates Season Passes Golf Instruction Adult Programs Junior Programs Lakeview Ladies Golf Tee Times Tournaments Schedule Ladies’ Association Tournaments Men’s Association Tournaments Golf Genius Event Hub Camps & Clinics Bar & Grill Contact Us Contact Us Employment Opportunities News Club Calendar 4200 W. TALAMORE BLVD. MERIDIAN, ID 83646 Hours of Operation: Pro Shop: 7 days a week 7am-9pm Rooster’s Tavern on the Green: 7 days a week 8am-9pm (208) 888-4080 We are currently hiring for multiple positions! Click here to apply today Sign up for our e-club! Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Phone Layout Message Name * First Last Email * Phone * Message Submit LAKEVIEW GOLF COURSE 4200 W. Talamore Blvd. Meridian, ID 83646 CONTACT INFO 208.888.4080 Hours of Operation Pro Shop 7 days a week 7am-9pm Roosters 7 days a week 8am-9pm © 2025 Lakeview Golf Course. \nPowered by foreUP Marketing Services Home Golf About Us Course Usage Rates Season Passes Golf Instruction Adult Programs Junior Programs Lakeview Ladies Golf Tee Times Tournaments Schedule Ladies’ Association Tournaments Men’s Association Tournaments Golf Genius Event Hub Camps & Clinics Bar & Grill Contact Us Contact Us Employment Opportunities News Club Calendar LAKEVIEW GOLF COURSE 4200 W. Talamore Blvd. Meridian, ID 83646 CONTACT INFO info@lakeview-golf.com 208.888.4080 Employment Opportunities"
    },
    {
      "url": "https://lakeviewgolf.co.nz/contact/",
      "text": "Contact Us - Lakeview Golf & Country Club Tournaments Helix Lakeview Classic Registration Form Our Club Holes Fees & Subscriptions Helix Lakeview Golf Classic Junior Golf Community News Attractions & Accommodation Contact Us Advertise Tournaments Helix Lakeview Classic Registration Form Our Club Holes Fees & Subscriptions Helix Lakeview Golf Classic Junior Golf Community News Attractions & Accommodation Contact Us Advertise Home Contact Us Get in touch and we’ll get back to you as soon as we can.  We look forward to hearing from you! Lakeview Golf & Country Club Inc 704 State Highway 5, Tarukenga, Rotorua 3072 Postal Address: P.O. Box 968, Rotorua 3040 Please use the contact form or call us: Golf Shop +64 (07) 357 2341 Sue Falconer +64 27 201 0940 Email: info@lakeviewgolf.co.nz For groups of 6+ people, please phone us to book your tee time. Your Name (required) Your Email (required) Arrival Date Preferred Tee Time Number of Adults Your Message WELCOME Lakeview Golf and Country Club is a unique free-draining 18 hole, par 72 course with undulating fairways and challenging greens. View our fees here or contact us to book a tee time. OUR LATEST NEWS Lake View Golf and Country Club Constitution – 2025 2025 CLUB PROGRAMME APRIL- AUGUST 2025. TREE PLANTING. NEW CLUBHOUSE NOW OPEN! ROTORUA ARCHERY CLUB. OUR LOCATION © Lake View Golf and Country Club 2017 | Website by Redspot"
    },
    {
      "url": "https://www.lakeviewwvgolf.com/contact-us/",
      "text": "Contact Us - Lakeview Golf Resort Skip to primary navigation Skip to main content Skip to footer Lakeview Golf Resort Morgantown, WV Lakeview Tee Times Mountainview Tee Times Lakeview Golf Resort Home Tee Times Lakeview Tee Times Mountainview Tee Times Lakeview Course Rates Scorecard Lakeview Photo Gallery Mountainview Course Rates Scorecard Mountainview Photo Gallery Golf Specials Weekly Specials Plan an Outing Memberships Membership Login Stay & Play Packages Contact Us Review Contest Online Gifts Contact Us Lakeview Golf Resort One Lakeview Dr. Morgantown, WV 26508 Lakeview Golf Course (304) 594-2011 Mountainview Golf Course (304) 594-5902 Email: ​ info.lakeview@ailhospitality.com Sorry - your browser does not support iframes. Footer Follow Us Instagram Twitter Facebook Visit Us Lakeview Course One Lakeview Dr. Morgantown, WV 26508 Mountainview Course 4008 Greystone Drive Morgantown, WV 26508 Contact Us Lakeview Golf Course Phone: ( 304) 594-2011 ​Mountainview Golf Course Phone: (304) 594-5902 Email: ​ info.lakeview@ailhotels.com Copyright © 2025 Lakeview Golf Resort All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lakeviewgolf.net/about-us/",
      "text": "About Us - Lakeview Golf Club Home Memberships Season Passes College Rates Daily Rates Practice Range Play Lakeview Play the Course Simulator Golf Calendar Lessons Instruction John Rogers Ryan Hite Juniors Junior Golf Jr Camps High School Prep Week Jr Tour TPS Drive, Chip, and Putt Meet The Team Legends Bar and Grill Leagues Skip to primary navigation Skip to main content Skip to footer Lakeview Golf Club Harrisonburg, VA About Us Lakeview Golf Course is an outstanding 27 hole golf facility awaiting you just east of Harrisonburg, VA. Each of our nines, Lake, Forest, and Mountain offer varied characteristics that make play fairly designed, playable and challenging. There are unique opportunities for all golfers of all skill levels. The Lake nine, completed in 1967, and lying on the south side of Shenlake Drive offers views of two spring fed irrigation ponds from three different holes and a small pond fronts the ninth green. On the Forest nine, utilizing holes completed in 1976 and 1987, and as the name implies, features trees and woods in prominent positions on each of the nine holes.   The fairways are fair in every respect, and the tee locations offer reasonable challenges for all golfers. The Mountain nine, completed in 2001, offers wide fairways, large greens, and spectacular views of the Shenandoah Valley. The blue championship tees on this nine offer the longest hitters the opportunity to let the ball fly. Other tees are certainly available on the Mountain nine. Lakeview offers a great product at reasonable green fees and cart fees, and we offer course memberships and cart plans to our frequent customers. Subtle undulating greens and a well-maintained rolling landscape are just some of the reasons Lakeview Golf Club is widely recognized at the best 36-hole facility in the Shenandoah Valley.  Winning the award “Best of the Valley” for golf by the readers of the Daily News-Record in 2013 and 2014 surely solidifies Lakeview standing as one of the best for many years to come. The service-friendly atmosphere and professional staff foster enjoyment of the game at any level.  Lakeview plays host to many of the area’s top golf events and has an outstanding practice complex for long game, short game and putting practice.  Get ready for the complete golf experience at the jewel of golf in the Valley.  Lakeview is located just a few miles of I-81 at exits 245 & 247. Lakeview provides a professional shop, grill, year round play, hosts many golf events, and has a full service practice facility for driving, chipping, and putting. Our friendly, professional staff provides a warm and inviting atmosphere. Widely recognized as the best golf facility in the region, we look forward to your patronage. Policies and Information Dress Code – Proper golf attire is required on property. All players must check in with the Pro Shop. All golfers must have their own set of golf clubs. Begin play at the nine holes assigned and rotate to the proper back nine. Singles & Twosomes are prohibited until 2 p.m. unless authorized by the Pro Shop. No Fivesomes allowed from April 1 to November 1. Maximum of 2 bags and 2 riders per golf cart. ABC Regulations: Alcohol purchased off-site is prohibited on property. Violations will be confiscated. Personal coolers are prohibited. Metal spikes and rubber cleats are not permissible. All golf carts must remain on property and remain on cart paths by tee boxes and greens. Please replace divots, repair ball marks, and rake bunkers after use. Do not pick up or play practice range golf balls. Tee Times may be cancelled up to 24 hours in advance. Lakeview reserves the right to waive tee time privileged for anyone found to misuse the reservation system. Tee Time Cancellation and Rain Check Policy Lakeview requires a 24 hour notice of any cancellation.  All cancellations must be made by phone calling (540) 434-8937.  No shows may be charged a full green.  Rain Checks are issued for only extreme weather situations that includes but not limited to severe storms and lightning.  In the event the course is deemed unplayable by the Course Superintendent Rain Checks will be issued.  Rain Checks are issued based on your position of play at the point of interruption and are equal to a pro-rated position of the fees paid.  There are no rain checks offered to golfers on holes 16, 17, & 18. To receive a rain check golfers must present starter receipt to the golf shop. All Rain Checks carry a 60 day expiration. Golfers are requested to evacuate the golf course in they feel threatened by lightning. The golf course may blow a horn to signal evacuation. All golfers are subject to play at their own risk and cannot hold Lakeview Golf Club responsible for any injury or accident. Learn the Game Instruction Junior Golf Footer Contact Us Pro Shop 540-434-8937 proshop@lakeviewgolf.net Hours of Operation Follow Us Find Us 4101 Shen Lake Drive Harrisonburg, VA 22801 Meet The Team Ryan Hite – General Manager Kurt Hellenga – Superintendent John Rogers – Director of Instruction Mark Smith – Food & Beverage Manager Lynn McNett – Pro Shop Manager Chris Rowe – Carts Manager Subscribe Sign-up today and stay updated with events, course closings, and special offers! Please enable JavaScript in your browser to complete this form. Name: Email * Subject: Message: Email Submit Search Our Site Search this website Copyright © 2025 Lakeview Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lakeviewhills.com/more-info/our-team",
      "text": "Our Team Tee Times Book Lodging Dining Reservations Directions Mobile Menu Toggle Golf Tee Times About Our Courses Golf Rates Golf Instruction E-Club Sign Up Golf Packages League Sign Up Outings Membership League Central Lodging Packages Book a Room Room Packages Stay & Play Packages Room Types Amenities Dining Health Club Events & Sports Center New Weddings & Banquets Weddings & Receptions Banquets & Parties Dining Emilio’s & Virginia’s The San Marino Lounge The Tin Cup Bar Group Dining Packages FAQ News Events Calendar E-Club Sign Up Media Our History Blog Contact Contact Us / Directions Employment Our Team About Us Mobile Menu Toggle Golf Tee Times About Our Courses Golf Rates Golf Instruction E-Club Sign Up Golf Packages League Sign Up Outings Membership League Central Lodging Packages Book a Room Room Packages Stay & Play Packages Room Types Amenities Dining Health Club Events & Sports Center Weddings & Banquets Weddings & Receptions Banquets & Parties Dining Emilio’s & Virginia’s The San Marino Lounge The Tin Cup Bar Group Dining Packages FAQ News Events Calendar E-Club Sign Up Media Our History Blog Contact Contact Us / Directions Employment Our Team About Us Meet Our Team Meet the men and women that make Lakeview Hills Country Club happen Tom Fabbri CEO & President tfabbri@lakeviewhills.com Rick Fabbri Chief Operating Officer (COO) rfabbri@lakeviewhills.com (810) 359-7333 ext. 1503 Fadi Achour, General Manager fachour@lakeviewhills.com (810) 359-7333 Ext. 1520 Dennis Fabbri PGA Head Golf Professional dfabbri@lakeviewhills.com (810) 359-7333 ext. 1514 Chris Notestine Greens Superintendent notesti6@gmail.com (810) 359-7333 Bethany Herrick Director of Sales and Catering, AGM bherrick@lakeviewhills.com 810-359-7333- ext 1599 Hai Ying Bushey Executive Chef chef@lakeviewhills.com (810) 359-7333 ext. 1500 Nicole Kade Director of Human Resources/Front Desk Manager eventscoordinator@lakeviewhills.com (810) 359-7333 Sara Green Food and Beverage Manager operations@lakeviewhills.com (810) 359-7333 Our Team Bios Fadi Achour, General Manager Fadi Achour is our General Manager at Lakeview Hills Country Club & Resort. He has embarked on transforming and rebranding the resort into a world class destination for golf, weddings, dining, and lodging. Achour has paired his desire to wine & dine guests with a penchant for connecting with people into a successful hospitality career that spans over 35 years. After graduating from Saint Mary’s College of California, Fadi started his career as a Maître D’ in Carmel by the Sea working at Anton & Michel Restaurant where he would serve celebrities like Clint Eastwood and Stevie Wonder. Over the years, Achour’s career path expanded to include developing hotels and restaurants in major cities around the world, including Los Angeles, Manhattan, Washington D.C., Dubai, and more. Eventually Achour settled in Michigan, working for both the Hilton and Marriott Hotel brands. His most recent position was General Manager at the Delta Hotel by Marriott at the Detroit Metro Airport, where in 2022 D Business Magazine and AAA Travel named it one of the best hotels in Michigan. Achour is a winner of the distinguished American Dreamer Award by Crains Business Journal, and most recently Achour was interviewed twice by Wall Street Journal (Barron’s) in 2021 to hear his insights on the challenges hospitality companies faced post the pandemic. Follow Us Clubhouse Hours Sunday - Thursday 7am - 9pm Friday - Saturday 7am - 10pm Quick Links Tee Times Lodging Golf Rates Golf Packages Weddings Banquets Resources Contact Us / Directions Call Us Pro Shop - (810) 359-8901 Hotel - (810) 359-7333 Address 6560 East Peck Road Lexington, MI 48450 Directions At Lakeview Hills Country Club  & Resort, all the beauty and tranquility of Northern Michigan is yours to enjoy. Two exceptional golf courses, dining featuring Emilio's Prime Steakhouse, The San Marino Lounge & The Tin Cup Lounge . Website designed & hosted by CourseLogix Dashboard |  \r\n© Lakeview Hills Golf & Resort - Lexington, MI 2025. Mobile Menu Toggle Golf Tee Times About Our Courses Golf Rates Golf Instruction E-Club Sign Up Golf Packages League Sign Up Outings Membership League Central E-Club Sign Up Lodging Packages Book a Room Room Packages Stay & Play Packages Room Types Amenities Dining Health Club Events & Sports Center New Weddings & Banquets Weddings & Receptions Banquets & Parties Dining Emilio’s & Virginia’s The San Marino Lounge The Tin Cup Bar Group Dining Packages FAQ News Events Calendar E-Club Sign Up Media Our History Blog Contact Contact Us / Directions Employment Our Team About Us"
    },
    {
      "url": "https://www.lakeviewgolf.net/",
      "text": "Home - Lakeview Golf Club Home Memberships Season Passes College Rates Daily Rates Practice Range Play Lakeview Play the Course Simulator Golf Calendar Lessons Instruction John Rogers Ryan Hite Juniors Junior Golf Jr Camps High School Prep Week Jr Tour TPS Drive, Chip, and Putt Meet The Team Legends Bar and Grill Leagues Skip to primary navigation Skip to main content Skip to footer Lakeview Golf Club Harrisonburg, VA Welcome to Lakeview Golf Club Book Now Rates HD Golf Learn More Legends Bar and Grill Learn More Events See Calendar Best of the Valley Lakeview Golf Club is an outstanding 27-hole golf facility just east of Harrisonburg, VA. Each of our 9-hole courses — Lake, Peak, and Mountain — offers varied characteristics that make the experience fun, fair, playable, and challenging for golfers of all skill levels. Memberships What You Can Expect The service-friendly atmosphere and professional staff foster enjoyment of the game at any level.  Lakeview plays host to many of the area’s top golf events and has an outstanding practice complex for long game, short game and putting practice.  Get ready for the complete golf experience at the jewel of golf in the Valley.  Lakeview is located just a few miles off I-81 at exits 245 & 247. - Learn the Game Instruction Junior Golf Footer Contact Us Pro Shop 540-434-8937 proshop@lakeviewgolf.net Hours of Operation Follow Us Find Us 4101 Shen Lake Drive Harrisonburg, VA 22801 Meet The Team Ryan Hite – General Manager Kurt Hellenga – Superintendent John Rogers – Director of Instruction Mark Smith – Food & Beverage Manager Lynn McNett – Pro Shop Manager Chris Rowe – Carts Manager Subscribe Sign-up today and stay updated with events, course closings, and special offers! Please enable JavaScript in your browser to complete this form. Name: Email * Subject: Message: Phone Submit Search Our Site Search this website Copyright © 2025 Lakeview Golf Club All Rights Reserved. Powered by Close Rules Information Packet"
    }
  ]
}