{
  "fuentes": [
    {
      "url": "https://www.lansbrook-golf.com/contact/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/special-events-meetings/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "admin@bhpgc.co.uk"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "carlpcross@aol.com"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "house@bhpgc.co.uk"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "email": "sec@bhpgc.co.uk"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "email": "info@clubcaddie.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/tournaments-outings/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/pga-instruction/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/pga-instruction/",
      "email": "jejohnson@pga.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/book-a-tee-time/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/directions-hours/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/site_map/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/player-development-programs/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520707836633738",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.lansbrook-golf.com/current-golf-rates/",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://ladybankgolf.co.uk/contact-us/",
      "email": "info@ladybankgolf.co.uk"
    },
    {
      "url": "https://lansbrook-golf.com/-home",
      "email": "gm7333@lansbrook-golf.com"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/2250-lansbrook-golf-club/search",
      "email": "nbc-golf-white@2x.png"
    }
  ],
  "mails": [
    "admin@bhpgc.co.uk",
    "carlpcross@aol.com",
    "gm7333@lansbrook-golf.com",
    "house@bhpgc.co.uk",
    "info@belfairsgolfclub.co.uk",
    "info@clubcaddie.com",
    "info@ladybankgolf.co.uk",
    "jejohnson@pga.com",
    "nbc-golf-white@2x.png",
    "sec@bhpgc.co.uk"
  ],
  "nombre_sitio": "lansbrook-golf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.lansbrook-golf.com/contact/",
      "text": "Contact Us - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Contact Us Contact Form Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Social Media Facebook Twitter Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lansbrook-golf.com/",
      "text": "Home - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Lansbrook eClub Signup Register to receive specials on golf, dining & upcoming events at the Club Sign Up Book Your Tee Time To book your tee times over the phone, call us at (727) 784-7333 Book Now Lansbrook Pizzeria & Grille Relax after your round with an ice cold beverage and specialty pizza Read More PDP Membership “The Secret to Improve Your Golf” Unlimited Range and More! More Informationon Welcome to Lansbrook Experience Year-Round Outstanding Course Conditions & the Best Greens in Tampa Bay Nestled among tall Cypress in traditional Florida wetlands, Lansbrook Golf Club has been the long-time favorite of residents and visitors alike, including the likes of Pro athletes Larry Bird, Reggie Jackson and members of the Toronto Blue Jays. Lansbrook’s 18-hole, par-72 Lane Marshall designed course was redesigned by acclaimed golf course architect Ron Garl in 1991. Players remark about the great variety of challenging holes that make up this traditional Florida layout. Bordered by majestic trees, Lansbrook’s championship course has no parallel fairways and water on 16 holes. By offering a fun yet challenging layout, CHAMPION Dwarf Bermudagrass greens, and outstanding course conditions throughout the year. Lansbrook has carved out a niche as one of Tampa Bay’s favorite daily fee golf clubs. In addition to championship golf, Lansbrook offers tour-quality practice facilities and PGA Professional instruction. A fully stocked Golf Shop, great food and drinks in our Bar & Grille, and outstanding service complete the Lansbrook experience. If you are planning a corporate, charity or social golf outing, Lansbrook is one of Tampa Bay’s favorite tournament destinations so reserve your preferred date today. Our championship course, comprehensive outing services, and PGA Professional staff will provide a seamless golf experience for you and your outing participants making it both enjoyable and successful. Learn More Surrounded by Florida’s lush scenery (which includes the occasional alligator), Lansbrook is conveniently located just minutes from all of Tampa’s major attractions in Palm Harbor. Florida golf doesn’t get any better than Lansbrook ~ Come out and play! Click Here for Lansbrook Rules & Regulations To Book a Tee Time, call (727) 784-7333 or Book Online As part of an ongoing Accessibility Initiative, Lansbrook Golf Club is using EZLinks Golf LLC to help identify and prioritize accessibility issues on our website. Watch Club Video Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lansbrook-golf.com/special-events-meetings/",
      "text": "Special Events & Meetings - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Special Events & Meetings A Great Clubhouse and Scenic Views Provide the Perfect Backdrop for Your Event From casual celebrations to corporate meetings, community events and receptions, Lansbrook Golf Club is the perfect venue to host your next event. Lansbrook’s friendly and professional staff combined with beautiful surroundings and a casual event space with an inviting outdoor patio which can accommodate events for up to 150 guests make the Lansbrook the perfect choice for your meeting or event. Lansbrook offers affordable packages and personalized breakfast, lunch and dinner menus for any size budget. For information on hosting your next event at Lansbrook, please call (727) 784-7333 . Click here for text version of menu Special Event Information Request Please enable JavaScript in your browser to complete this form. Name * First Last eMail Address * Phone No. * What Type of Event Are You Planning? * What is your Preferred Event Date? What is Your Preferred Time? Please Select One Morning Afternoon Evening No Preference How Many Guests (Approximately)? How Did You Hear About Us? Comment Submit Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.bhpgc.co.uk/contact-us",
      "text": "Contact Us | Buxton and High Peak Golf Club Members Login Buxton and High Peak Golf Club Menu Home Course Tour of the Course Scorecard Course Record Holders Local Rules Rules of Golf - Etiquette Greens Our Greens, Fairways and Staff.... How To Repair A Pitch Mark How To Rake A Bunker Tips On Avoiding Slow Play How To Read Greens Better Sponsorship Opportunities Sponsorship Packages Our Current Sponsors Club History The Club History A message from a Centenary golf ball. The Spirit Of Christmas Early Days Jack Simpson - The First Professional The Debenture Records Golf Club Archaeology Old Map of BHPGC The Clubhouse - A Tale of Two Clocks Centenary News A who's who of Club Competitions & Cups The Buxton and High Peak Golf Club Ball In The Bag POEM Buxton & High Peak Golf Club A Who's Who of Competitions (Ladies Section) The 9th Hole 'Standside' Golf Ilustrated Sid Green Golf Clubs Reflections on the Club Motto 'By Hook Or By Crook' Standside 2 Metamorphosis Golf History Bogey to Blow-Up Why 18 Holes? Emergency Procedures/Club Contacts and telephone Numbers Course Conditions LEAVE YOUR REVIEW OF OUR CLUB HERE Opens Open Competitions Overview Open Online Bookings Visitors Visitors Welcome Visitors Information Buggy Guidance Visitor Online Tee Bookings WINTER GREEN FEES 2025/2026 SUMMER GREEN FEES 2025 Stay & Play Deals 9 Green Lane Membership Rates 1st June 2025 - 31st May 2026 Application Form Trial Membership Trial Membership 2025 Application Form for Trial Membership Visitors and  Societies Programme Notes For Visitors Including Dress Regulations On The Course and Clubhouse eNewsletter Subscription Twitter Activity Facebook Activity Professional Members General Club Noticeboard Members Online Tee Bookings Mens A message from Mr Captain 2024 Mens Competition Overview Untitled Resource Ladies Ladies Welcome Ladies Competition Overview Ladies Match Overview Untitled Resource Message from the Lady Captain 2023 Seniors Seniors Welcome Seniors Competition Overview Seniors Dinner Photos Seniors Contacts Seniors Results Juniors Juniors Welcome Juniors Competition Overview Junior Contacts Junior Presentation 2019 Members Only Area Competition Results Council 2024 Our Dignitaries Captains Honour Board Ladies Captains Honour Board Presidents Honour Board Ladies Presidents Honour Board Junior Captains Honour Board Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Mixed Honours Board Juniors Honours Board Reciprocal Golf Safe Golf Club Welfare Officer England Golf Disciplinary Regulations Equality, Diversity & Inclusion Policy Clubhouse Welcome to our Club House... Clubhouse Staff Clubhouse Noticeboard Social Programme Meeting  & Training Room for Hire Captain's Charity Diary Find Us Contact Us Members' Login Contact Us Buxton & High Peak Golf Club 27 Town End, Fairfield, Buxton, Derbyshire, SK17 7EN Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. For map and directions, please click here . Office Administrator - Mrs Tracey Hannah Tel: 01298 26263 (opt1) Email: admin@bhpgc.co.uk Club Secretary, Mr Garry Bagguley Tel: 01298 26263 (opt1) Email: sec@bhpgc.co.uk Professional, Mr Carl Cross Tel:01298 26263 (opt2) Email: carlpcross@aol.com Reach Catering Services (Bar & Catering) - Mr Stuart Dale Tel: 01298 26263 (opt3) Email: house@bhpgc.co.uk Course conditions: Tel: 01298 26263 (opt2) You may complete this form to contact Buxton and High Peak Golf Club. Alternatively, you can send an email to: carlpcross@aol.com. Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Pro Shop Visitor Review Club/Course Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Recent Site Updates Course Conditions 10-Sep-2025 08:21 Seniors Stamford Match Report 03-Sep-2025 14:21 Seniors Reddish Vale Match Report 03-Sep-2025 14:15 Contact phone: 0129 826263 email: admin@bhpgc.co.uk Links RSS Feed Cookie and Privacy Contact Us Find Us Follow Us Members Login Copyright © Buxton and High Peak Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS Switch to Desktop View Switch to Mobile View Scroll"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "text": "Contact Club Caddie: Get In Touch for Support & Demos Skip to content About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT WITH US REQUEST A DEMO About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT REQUEST A DEMO contact We are available by chat, 24 hours a day, 7 days a week. Just click on the chat message icon in the lower corner of your screen or at the top of the menu and we can answer any question, get you login credentials, provide support, or even give you a full demo of our software. Full Name Email Phone Course or Organization Name Which Best Describes Your Role? -Select- Owner General Manager Director of Golf Head Golf Professional Other Golf Staff Food and Beverage Director Message SUBMIT testimonials What Our Clients Say see more testimonials Start Growing Revenue with Club Caddie Golf Course Solutions Today With tools to streamline every aspect of your golf facility’s operation and a 24/7 support team excited to help you out, improving your course, club or golf business management software has never been easier. Golf operations software is our forte. GET STARTED today Don’t have time right now? Send us a message and we’ll get back to you right away. send us a message Award Winning, All-In-One, Golf Facility Management Software. Menu About Features Contact Privacy Policy Terms & Conditions About Features Contact Privacy Policy Terms & Conditions Resources Services Mission Testimonials About Contact Services Mission Testimonials About Contact Support Knowledge Base Submit Tickets Chat With Us Club Caddie Holdings, Inc. info@clubcaddie.com 18720 Mack Ave, Suite 210, Grosse Pointe, MI 48236 Copyright © 2025 by Club Caddie Holdings, Inc, Powered by Club Caddie Privacy Policy Terms and Conditions Facebook Footer [main Template] Linkedin Scroll to Top We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. I agree"
    },
    {
      "url": "https://www.lansbrook-golf.com/tournaments-outings/",
      "text": "Tournaments & Outings - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Tournaments & Outings Golf Digest’s “Best Places to Play” Are you looking for a golf club with a great course and friendly service that will make an outstanding location for your next golf outing, and also one that is among the best values in Tampa Bay? You will find all that and more at Lansbrook Golf Club in Palm Harbor. Here are a few reasons why you will be glad you selected Lansbrook Golf Club: Championship Golf – Your golfers will enjoy playing a relaxing round on our championship course, lined with mature trees, filled with Florida wildlife and water on 16 holes. Lansbrook is a place where every player will have a great time. We’re on Golf Digest’s list of “Best Places to Play” and joined 12 PGA Tour venues in re-grassing our greens to CHAMPION Dwarf Bermudagrass ~ the BEST greens! Attention to Detail – At Lansbrook, we love hosting golf events at our course and have a PGA staff that knows what it takes to stage a fun-filled outing that will run smoothly regardless of size. Whether you are planning a corporate, charity, or social golf tournament, our Club takes pride in giving you special attention to meet your golfing needs from 20 to 144 players. Great Food – Lansbrook will provide delicious food and can host an awards banquet in the clubhouse or on the outdoor patio overlooking the course. We will customize a menu for you, ranging from hot dogs and hamburgers, to BBQ pork and chicken, or even a Prime Rib buffet. You can have gourmet or casual food served for buffets, box lunches and continental breakfasts. Outstanding Service – The professional team at Lansbrook will provide outstanding service to your golfers. Among the special touches we can include personalized scorecards and cards on carts, PGA professional scoring, and great golf contests. For Golf Tournament & Outing pricing and information, please contact: Outing Sales – General Manager (727) 784-7333 GM7333@Lansbrook-Golf.com Outing Information Request Please enable JavaScript in your browser to complete this form. Name * First Last eMail Address * Phone No. * Address Address Line 1 Address Line 2 City — Select state — Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming State Zip Code Event Date Group Size What is most important to your group? Please Select One Cost per player Location Dining/Catering Facilities Quality of Overall Facility Contribution of value added items Would you like a morning or afternoon start time? Please Select One Morning Afternoon No Preference What type of Outing are you planning Please Select One Charity/Non-Profit Fundraiser Corporate Social Vacation Group Other Have you held an Outing at Lansbrook before? Please Select One Yes No Is your date flexible? Please Select One Yes No Comment Submit Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lansbrook-golf.com/pga-instruction/",
      "text": "PGA Instruction - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours PGA Instruction JON JOHNSON, PGA A member of the PGA since 1982, Jon has over 35 years of Golf Instruction which includes both private club and public practice facilites. For 18 years he served as both General Manager and Instructor at The Downs Golf Practice and Facility. He is a past president of the West Central Chapter NFPGA and was the 2013 WCC NFPGA Professional of the Year. Some highlights of his teachings include: The Golf Swing “7 Laws” –  The basic seven laws of motion in the swing. Putting “8 Corrects” – The eight correct “musts” in the putting game. Chipping “Triangle Tracking” –  Lower your score around the green. Private Lessons and Weekly Clinics Available Click Here for details and pricing To register for a clinic or for more information on golf instruction, please contact: Jon Johnson, PGA (813) 610-9029 jejohnson@pga.com Lesson Information Request Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone * Comment Submit Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lansbrook-golf.com/book-a-tee-time/",
      "text": "Book a Tee Time - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Book a Tee Time Thanks for choosing Lansbrook Golf Club for your next round! Please use the buttons below to book your tee time online, or call the Golf Shop at (727) 784-7333 . Public Tee Times CANCELLATIONS: * The Club has a 24-hour cancellation policy. If you wish to cancel or change your tee time, contact the Club 24 hours prior to your day of play to avoid cancellation fees. * If you do not cancel 24 hours prior to your day of play, and you do not show for your tee time, your credit card will be charged the full amount of the reservation for all no-show golfers in your group. Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lansbrook-golf.com/directions-hours/",
      "text": "Directions & Hours - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Directions & Hours From Tampa-Hillsborough Avenue Hillsborough Avenue, head west (turns into Tampa Road in Pinellas County) through Oldsmar. Stay on Tampa Road, do not take S.R. 580. Take Tampa Road to East Lake Road, make a right (Boot Ranch Shopping Center on corner). Go to fourth traffic light (Village Center Drive on left, Ridgemoor on right). Turn left on Village Center Drive. Lansbrook is about three blocks on right, across from YMCA. From Tampa – S.R. 60 Take S.R. 60 to Courtney Campbell Causeway. Exit on to McMullen Booth Road (heading North). Stay on McMullen Booth, pass Curlew Road, over Tampa Road. At this point, McMullen Booth changes to East Lake Road. Go to third traffic light (Village Center Drive on left, Ridgemoor on right). Turn left on Village Center Drive, Lansbrook Golf Club is located three blocks on the right, across from the YMCA. From Clearwater Highway 19 North to Curlew Road, make a right, go to McMullen Booth Road, turn left. Go over Tampa Road. At this point, McMullen Booth changes to East Lake Road. Turn left on Village Center Drive. Lansbrook Golf Club is located three blocks on the right, across from the YMCA. From St. Petersburg Take Bayside Bridge from Ulmerton Road. The name of the road changes to McMullen Booth when you come over the bridge. Take McMullen Booth Road (heading North). Stay on McMullen Booth, pass Curlew Road, over Tampa Road. At this point, McMullen Booth changes to East Lake Road. Go to third traffic light (Village Center Drive on the left, Ridgemoor on the right). Turn left on Village Center Drive. Lansbrook Golf Club is located three blocks on the right, across from the YMCA. From Tarpon Springs From U.S. 19, turn left (East) on Tarpon Ave. Go three miles to East Lake Road. Take a right on East Lake Road and go 3.3 miles. Go past the first Lansbrook entrance to the second entrance. Take right on Village Center Drive. The club is two-tenths of a mile on the right, across from YMCA. Hours of Operation Golf Shop Monday – Sunday: 6 AM – 7 PM Pizzeria & Grille Monday – Thursday: 10 AM – 7 PM Friday – Saturday: 9 AM – 8 PM Sunday: 9 AM – 7 PM Range Monday – Sunday: 6 AM – 7 PM Beverage Cart Wednesday & Friday: 9 AM – 5 PM Saturday – Sunday: 9 AM – 5 PM Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Facebook Twitter Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lansbrook-golf.com/site_map/",
      "text": "Site Map - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Site Map Pages Home Golf Book A Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop At Lansbrook Current Golf Rates Outings Tournaments & Outings Request Outing Information Dining & Events New Pizzeria & Grille At Lansbrook Special Events & Meetings Memberships Player Development Program Member Statements Contact Contact Us Directions & Hours Social Media Facebook Twitter Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.lansbrook-golf.com/player-development-programs/",
      "text": "Player Development Programs - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Player Development Programs Practice Makes Perfect – Improve Your Game To become a Lansbrook PDP Member, call (727) 784-7333 or sign up in the Golf Shop. If you would like more information, please email GM7333@Lansbrook-Golf.com We look forward to helping you become a better golfer at Lansbrook! Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.mscorecard.com/mscorecard/showcourse.php?cid=141520707836633738",
      "text": "Lansbrook Golf Club - Lansbrook | mScorecard Login Sign Up home Home flag Courses contact_support Contact menu Courses Contact Login Sign Up Login Sign Up Home Courses Show Course Lansbrook Golf Club 4605 Village Center Dr 34685 Palm Harbor, FL USA phone (727) 784-7333 email gm7333@lansbrook-golf.com desktop_windows http://www.lansbrook-golf.com/-home Course: Lansbrook course type Golf measurement Yards Please login to view full course information Login Sign Up for Free Men Tees Ladies Hole Par SI Gold Blue Red White Par SI 1 4 -- 410 360 340 345 -- -- 2 5 -- 518 492 374 477 -- -- 3 3 -- 180 143 115 122 -- -- 4 4 -- 365 350 313 336 -- -- 5 4 -- 440 390 320 340 -- -- 6 5 -- 571 504 441 483 -- -- 7 3 -- 196 180 119 144 -- -- 8 4 -- 420 370 315 340 -- -- 9 4 -- 410 360 332 345 -- -- Out 36 3510 3149 2669 2932 36 10 4 -- 368 345 290 333 -- -- 11 3 -- 186 173 139 148 -- -- 12 4 -- 383 335 268 325 -- -- 13 5 -- 512 477 420 440 -- -- 14 4 -- 400 327 233 307 -- -- 15 4 -- 343 330 282 310 -- -- 16 5 -- 580 570 510 540 -- -- 17 3 -- 186 173 115 155 -- -- 18 4 -- 378 370 339 354 -- -- In 36 3336 3100 2596 2912 36 Total 72 6846 6249 5265 5844 72 Men CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- Women CR/Slope front 9 back 9 --- --- --- --- --- --- --- --- --- --- --- --- Coordinates 90 points stored on 18 holes Your Stats Rounds Played: 0 Average Score: - Best Score: - Worst Score: - First Round: - Last Round: - This page shows golf course information for Lansbrook Golf Club in Palm Harbor, USA. The golf course has 18 holes and its total par is 72 If the information is incorrect, please let us know using the contact form . © 2025 Velocor Ltd | Terms & Privacy Policy"
    },
    {
      "url": "https://www.lansbrook-golf.com/current-golf-rates/",
      "text": "Current Golf Rates - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Current Golf Rates Lansbrook Golf Club Rates – Effective October 1, 2023 Call the Lansbrook Golf Shop for great specials at (727) 784-7333 . Golf Rates Public Play Rates Regular PDP Regular Mon – Fri Sat,Sun + Hol Mon – Fri Sat,Sun + Hol Open – 10:52 $59 $69 $36 $46 11 am- 2 pm $49 $57 $32 $36 2 pm – Close $39 $39 $11 $11 9 Holes before 8am $11 $11 Other Fees and Rates Handicap fee – $40 – Florida State Golf Association Rental Sets – $40 – Callaway woods and irons Nine Hole am – $34 Nine Hole pm – $28 Rates include cart, exclude tax and are subject to change. Tee times available seven days in advance. Call (727) 784-7333 to Book a Tee Time or Book Online Range Balls: $6 Small | $9 Medium | $12 Large ($2 warm-up bucket with purchase for INsider Plus Members only) Please note: Each player must have one golf bag and one set of clubs Proper golf attire is required No personal coolers are allowed on the Lansbrook Golf Club property Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://ladybankgolf.co.uk/contact-us/",
      "text": "Contact Us - Ladybank Golf Club Skip to content Visitor Booking Member Booking Members Hub Visitor Booking Member Booking Members Hub Contact Us admin-flintriver 2023-01-05T10:07:13+00:00 About History Course Clubhouse Membership Junior Golf Professional Contact Ladybank Golf Club If you would like to ask us a question or send us any comments, please complete the form below. Alternatively, you can get in touch with us by: Ladybank Golf Club Annsmuir, Ladybank, Fife, KY15 7RA Tel: 01337 830814 / Email: info@ladybankgolf.co.uk PERSONAL DETAILS Title * First name * Last name * CONTACT DETAILS House number / name * Street name * Town / city * Post code * Phone number Email address * NATURE OF ENQUIRY Nature of enquiry Membership enquiry Golf booking enquiry Catering enquiry Professional services Testimonials Message * By submitting this form you agree to us contacting you regarding this particular enquiry. Submit Sign up for latest updates and offers. Leave this field empty if you're human: Copyright © 2025, Ladybank Golf Club Limited. All Rights Reserved. Site By Flintriver Privacy Policy | Terms & Conditions | Cookies Page load link Home Visitors Join The Club The Course & Club Carlucci Bar and Restaurant Contact Us Professional Go to Top"
    },
    {
      "url": "https://lansbrook-golf.com/-home",
      "text": "Home - Lansbrook Golf Club Skip to primary navigation Skip to main content Facebook Twitter Book a Tee Time Lansbrook Golf Club Home Golf Book a Tee Time Course Overview Scorecard Practice Facilities PGA Instruction Golf Shop at Lansbrook Current Golf Rates Outings Tournaments & Outings Dining & Events Pizzeria & Grille at Lansbrook Special Events & Meetings Memberships Player Development Programs Member Statements Contact Contact Us Directions & Hours Lansbrook eClub Signup Register to receive specials on golf, dining & upcoming events at the Club Sign Up Book Your Tee Time To book your tee times over the phone, call us at (727) 784-7333 Book Now Lansbrook Pizzeria & Grille Relax after your round with an ice cold beverage and specialty pizza Read More PDP Membership “The Secret to Improve Your Golf” Unlimited Range and More! More Informationon Welcome to Lansbrook Experience Year-Round Outstanding Course Conditions & the Best Greens in Tampa Bay Nestled among tall Cypress in traditional Florida wetlands, Lansbrook Golf Club has been the long-time favorite of residents and visitors alike, including the likes of Pro athletes Larry Bird, Reggie Jackson and members of the Toronto Blue Jays. Lansbrook’s 18-hole, par-72 Lane Marshall designed course was redesigned by acclaimed golf course architect Ron Garl in 1991. Players remark about the great variety of challenging holes that make up this traditional Florida layout. Bordered by majestic trees, Lansbrook’s championship course has no parallel fairways and water on 16 holes. By offering a fun yet challenging layout, CHAMPION Dwarf Bermudagrass greens, and outstanding course conditions throughout the year. Lansbrook has carved out a niche as one of Tampa Bay’s favorite daily fee golf clubs. In addition to championship golf, Lansbrook offers tour-quality practice facilities and PGA Professional instruction. A fully stocked Golf Shop, great food and drinks in our Bar & Grille, and outstanding service complete the Lansbrook experience. If you are planning a corporate, charity or social golf outing, Lansbrook is one of Tampa Bay’s favorite tournament destinations so reserve your preferred date today. Our championship course, comprehensive outing services, and PGA Professional staff will provide a seamless golf experience for you and your outing participants making it both enjoyable and successful. Learn More Surrounded by Florida’s lush scenery (which includes the occasional alligator), Lansbrook is conveniently located just minutes from all of Tampa’s major attractions in Palm Harbor. Florida golf doesn’t get any better than Lansbrook ~ Come out and play! Click Here for Lansbrook Rules & Regulations To Book a Tee Time, call (727) 784-7333 or Book Online As part of an ongoing Accessibility Initiative, Lansbrook Golf Club is using EZLinks Golf LLC to help identify and prioritize accessibility issues on our website. Watch Club Video Book Your Tee Time Online For tee times over the phone, please call (727) 784-7333 . Book Now Contact Info Address : 4605 Village Center Drive Palm Harbor, FL 34685 Email : GM7333@Lansbrook-Golf.com Phone : (727) 784-7333 Click Here for Directions Accessibility Policy Site Map Owned and operated by PGA Professionals Accessibility Policy Site Map Lansbrook Golf Club | 4605 Village Center Drive, Palm Harbor, FL 34685 | (727) 784-7333 Copyright © 2025 Lansbrook Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.golfnow.com/tee-times/facility/2250-lansbrook-golf-club/search",
      "text": "Lansbrook Golf Club Tee Times - Palm Harbor FL Log In / Sign Up Hot Deals Courses Near Me Destinations Best Courses Rewards Join GolfPass Gift Cards Search Hot Deals Near Me Off Sort Distance Time Price Golfers Holes Facility Type Reset Filters League Available Lansbrook Golf Club 4605 Village Center Dr , Palm Harbor , Florida , 34685-1224 Holes 18 Par 72 Length 6862 yards Slope 131 Rating 73.2 Lansbrook Golf Club offers a great challenge, great conditions and service.  Established in 1975 and located in Tampa's North Pinellas.  Lansbrook's greens are Tifdwarf Bermuda and are in excellent condition.  Lansbrook prides itself on constant improvements.  Recently, the clubhouse was renovated, a new irrigation system was installed and greens #10 and #14 were rebuilt.  Water come into play on many of the holes but do not worry, there are four sets of tees to accommodate players.  There are no parallel holes at Lansbrook and many are nestled within forest areas.  Hole #11 is a replica of the famous 26th at Augusta North Golf Club.  Lansbrook is challenging for the good player and fun to average or beginning golfers.  Friendly courteous staff, a complete practice facility (including driving range), chipping and putting green, bag pickup at your car, are all great reasons to make your next tee time at Lansbrook Golf Club. Read More... Directions Course Details Review Leagues Available Social golf leagues available at this course Join Now Powered by Spark Golf We partnered up with Spark Golf to bring you social, competitive 9-hole leagues at your favorite courses. Each round has a 2-person team & individual game with end of league champs. Compete in a laid-back atmosphere over 9-holes Play with friends and meet like-minded new ones. Join the League × Last Modified: 9/8/2025 8:24:01 PM +00:00 Policies Metal spikes allowed: No Credit cards accepted: VISA, MasterCard, Discover Welcomed Dress Code: No cutoffs or tee shirts permitted; Proper golf attire is preferred at all times Rentals/Services Carts: Yes - included in green fees Clubs: Yes Caddies available: No Practice/Instruction Driving range: Yes Pitching/chipping area: Yes Putting green: Yes Teaching pro: Yes Read More... View Full Map Directions More Hot Deals Searching next 3 days... × There are no Hot Deals available for the date selected. Fetching more results... Unable to Complete Search We're sorry, there was an error completing your search. Try changing locations, changing the date, expanding your distance, or updating your filters. How About a Mulligan? We’re sorry, there are currently no available tee times for your search. Try changing locations, changing the date, expanding your distance, or updating your filters. In the cabbage. There are no Daily Deal options on this date. Please check back again for another shot at Daily Deals. Check Next Day View All Nearby Tee Times Search Hot Deals Get your golf on Information About Us Careers Contact Us Help Gift Cards Rewards Premier Card Ad Choices Privacy Policy Cookie Preferences CA Notice Terms of Service - New Resources Destinations Best Tee Time Deals Weekend Tee Times Course Directory Private Club Directory GolfNow Reviews Mobile Apps Promotions Blog Simulators Private Clubs Featured Courses GolfNow Spotlights Club Champion Fittings Businesses Partner Support Golf Facilities GolfNow for Courses List My Facility on GolfNow Other Partnership Requests Partner Brands NBC Sports Golf Channel GolfPass GolfNow Compete TeeOff SportsEngine HQ SportsEngine Motion Don't miss out on great golf deals, special offers and more! Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Stay Connected Yes! Please send me offers and news from GolfNow and GolfPass by email about products and services offered by us and our Partners Subscribe Our Mobile Apps © Copyright 2025 GolfNow. All rights reserved."
    }
  ]
}