{
  "fuentes": [
    {
      "url": "https://pearllemonleads.com/get-in-touch/",
      "email": "info@pearllemongroup.com"
    },
    {
      "url": "https://lemonjuicesolutions.com/executive-team/",
      "email": "solutions@lemonjuice.biz"
    },
    {
      "url": "https://www.news4jax.com/news/local/2025/05/12/jags-owner-shad-khan-planning-redevelopment-of-seahorse-oceanfront-inn-and-lemon-bar-in-neptune-beach-documents-state/",
      "email": "tminor@wjxt.com"
    },
    {
      "url": "https://www.evanandlemon.com/aboutus",
      "email": "info@evanandlemon.com"
    },
    {
      "url": "https://thehairylemon.ie/about-us/",
      "email": "bookings@thehairylemon.ie"
    },
    {
      "url": "https://thehairylemon.ie/about-us/",
      "email": "info@thehairylemon.ie"
    },
    {
      "url": "https://lemonleaf.ie/contact",
      "email": "eat@lemonleaf.ie"
    },
    {
      "url": "https://lemonleaf.ie/contact",
      "email": "stay@lemonleaf.ie"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/gurugram/sector-60-gurugram/contact-us",
      "email": "hi.l60@lemontreehotels.com"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/gurugram/sector-60-gurugram/contact-us",
      "email": "marketing@lemontreehotels.com"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/gurugram/sector-60-gurugram/contact-us",
      "email": "reservations@lemontreehotels.com"
    },
    {
      "url": "https://www.lemoncontactcentre.co.uk/contact-us",
      "email": "dss@2x.png"
    },
    {
      "url": "https://www.lemoncontactcentre.co.uk/contact-us",
      "email": "iso27001-cn-new@2x.png"
    },
    {
      "url": "https://www.lemoncontactcentre.co.uk/contact-us",
      "email": "iso9001-cn-new@2x.png"
    },
    {
      "url": "https://www.lemoncontactcentre.co.uk/contact-us",
      "email": "iwfm@2x.png"
    },
    {
      "url": "https://www.lemoncontactcentre.co.uk/contact-us",
      "email": "lemon-logo@2x.png"
    },
    {
      "url": "https://www.lemoncontactcentre.co.uk/contact-us",
      "email": "zest@no-sour-business.co.uk"
    },
    {
      "url": "https://pearllemon.com/our-founder/",
      "email": "info@pearllemongroup.com"
    },
    {
      "url": "https://pearllemon.com/our-founder/",
      "email": "info@pearllemongroup.com"
    },
    {
      "url": "https://www.lemontreehotels.com/about-us",
      "email": "reservations@lemontreehotels.com"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/portblair/hotel-port-blair/contact-us",
      "email": "hm.hpb@lemontreehotels.com"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/portblair/hotel-port-blair/contact-us",
      "email": "marketing@lemontreehotels.com"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/portblair/hotel-port-blair/contact-us",
      "email": "reservations@lemontreehotels.com"
    }
  ],
  "mails": [
    "bookings@thehairylemon.ie",
    "dss@2x.png",
    "eat@lemonleaf.ie",
    "hi.l60@lemontreehotels.com",
    "hm.hpb@lemontreehotels.com",
    "info@evanandlemon.com",
    "info@pearllemongroup.com",
    "info@thehairylemon.ie",
    "iso27001-cn-new@2x.png",
    "iso9001-cn-new@2x.png",
    "iwfm@2x.png",
    "lemon-logo@2x.png",
    "marketing@lemontreehotels.com",
    "reservations@lemontreehotels.com",
    "solutions@lemonjuice.biz",
    "stay@lemonleaf.ie",
    "tminor@wjxt.com",
    "zest@no-sour-business.co.uk"
  ],
  "nombre_sitio": "lemonbarjax.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://pearllemonleads.com/get-in-touch/",
      "text": "Get In Touch | Call us on 020 8064 1849 | Pearl Lemon Leads Skip to content US: +16502784421 UK: +442071833436 UK: +447454539583 info@pearllemongroup.com Services Close Services Open Services Lead Generation Services B2B Lead Generation B2C Lead Generation Inbound Lead Generation Outbound Lead Generation Pay Per Lead Industry-Specific Auto Insurance Leads Annuity Leads Credit Card Leads Debt Consolidation Leads Health Insurance Leads Mortgage Leads Training and Consulting Cold Email Consulting Email Marketing Training Telesales and Telemarketing Training About Close About Open About About Us Get in Touch Lead Generation Team Our Rankings Press Testimonials & Reviews Video Case Studies Why Pearl Lemon Leads Contact Us Blog BOOK A CALL BOOK A CALL Is your sales team hungry for more qualified leads? Let’s Chat! Hey! We’re Business Development Team here! Feel free to reach out to us directly on: +44 207 183 3436 or schedule a call at a time that is convenient for you! Alternatively, drop me a line in the contact form below and I’ll get back to you ASAP! BOOK A CALL NOW Contact Us. We’d love to hear from you! If you have any questions, please do get in touch with us! If you’d prefer to speak directly to a consultant, book a call ! Full Name Email Phone What you are Interested in Cold Email (£2,497+ Per Month) Cold Calling (£2,997+ Per Month) End to End Sales (£6,697+ Per Month) Facebook Lead Gen (£1,497+ Per Month) LinkedIn Lead Generation (£2,497+ Per Month) Multi-Channel Lead Gen (£3,497+ Per Month) Podcast Outreach (£1,497+ Per Month) PPC Lead Gen (£1,497+ Per Month) Seo Lead Gen (£2,997+ Per Month) PPL B2B (£250+ Per Lead) What Keyword Did You Use To Find Us? What Can We Help You With? Send Pearl Lemon Leads is an award-winning lead generation agency headquartered in London, with additional offices in New York and San Francisco. Meet The Team Why Pearl Lemon Leads Client Testimonials Blog We're Hiring! Contact Us Company Address: United Kingdom Pearl Lemon Leads Ltd. International House, 24 Holborn Viaduct London, EC1A 2BN United Kingdom United States of America 100 Park Ave #16, New York, NY 10017, United States Contact Details: UK: +442071833436 US: +16502784421 UK: +447454539583 info@pearllemongroup.com Full Name Email Phone What you are intrested in Appointment Setting ( £4,497 Per Month ) Cold Calling (£2,997+ Per Month) End to End Sales (£6,697+ Per Month) Facebook Lead Gen (£1,497+ Per Month) LinkedIn Lead Generation (£2,497+ Per Month) Multi-Channel Lead Gen (£3,497+ Per Month) Podcast Outreach (£1,497+ Per Month) PPC Lead Gen (£1,497+ Per Month) Seo Lead Gen (£2,997+ Per Month) Rank on Chatgpt £6,497 What Keyword Did You Use To Find Us? Please Choose Google (Organic + Ads) Youtube Linkedin ChatGpt Claude Gemini Perplexity other What Can We Help You With? Send Birmingham Leeds Liverpool Brighton Sheffield Southampton New York Los Angeles Houston Boston We’re an awesome bunch of Lead Gen experts! Book a Call With Us. Also Affiliated with Lead Generation Agency Canada and Pay Per Lead Services . © 2025. All Rights Reserved | Company Number: 10411490 |  VAT Number: 252 7124 23 Sitemap Privacy Policy Term and Conditions We Accept Crypto Payments 🪙 BOOK A CALL Your Competitors Are Generating Leads—Are You? Don’t let competitors take the lead. Our proven cold email, LinkedIn outreach, and appointment setting strategies drive high-converting leads. Let’s grow your customer base—before they do. Yes, I Want More Leads! I’ll Be Back Later, Thanks!"
    },
    {
      "url": "https://lemonjuicesolutions.com/executive-team/",
      "text": "Our Team | Lemonjuice Solutions Skip to content Toggle Navigation HOME SERVICES Strategic Management Future Planning Revenue Optimization Technology Resorts Reimagined Disaster Recovery ABOUT US Our Team The Lemonjuice Story NEWS CAREERS CONTACT OWNERS Our Team 2025-08-07T13:59:52+00:00 The Lemonjuice Team Our team members are industry experts with many years of professional experience to guide Boards and decision makers through crucial choices. Lemonjuice’s executive leadership includes industry veterans who have worked in the resort and timeshare industry, or commercial real estate, for 25+ years. Our key staff – who oversee resort management, customer service, legal research, and other essential functions – give us the breadth and depth to strategically manage and deliver the best solutions for resorts. Alex Krakovsky Founder & CEO About Alex Alex is the Founder and CEO of Lemonjuice Capital and Solutions, which was established to help timeshare owners and associations realize the true value and best governance of their properties. He is a seasoned business leader and entrepreneur. Alex is experienced in commercial real estate and mortgage management, venture capital, mergers and acquisitions, government-sponsored investment funds, and the energy sector. He co-founded a power company that operates power plants around the world and grew from five to over 1,400 employees. Scott MacGregor Executive Vice President & COO About Scott Scott has 40 years of executive experience in project planning, development, marketing, and finance. As Executive VP and COO of Lemonjuice Solutions, he oversees corporate and resort operations and develops strategic management plans to enhance long-term resort sustainability. An active member of the American Resort Development Association (ARDA), Scott has held leadership roles, including co-chairing the Legislative and Regulatory Oversight Committee and chairing ARDA’s International Timeshare Foundation Thinktank series. He is a strong advocate for consumer rights and industry legislation. Jan Barrow Senior VP of Business Development About Jan Jan has 30 years of experience in the vacation ownership and resort timeshare industry. At Interval International, she held leadership roles focused on driving growth and revenue, working closely with developers on all aspects of the development process, from design to operations. A skilled communicator and consensus builder, Jan has been active in ARDA for 30 years and TBMA since 2010, supporting consumer protections, board education, and legislative advocacy. Richard Cunningham Senior VP of Operations About Richard Richard is a partner, broker, and manager at Cunningham Property Management Corp. A Miami University graduate with honors, he launched his career in vacation ownership and now oversees eight resorts along Florida’s Gulf Coast. With hands-on experience in resort operations and a CAM license, Richard ensures his resorts consistently earn top industry awards. He also serves on the local Chamber of Commerce Board of Directors. Jeff Ingram Senior VP of Real Estate Redevelopment About Jeff Jeff has nearly 40 years of experience in the hospitality and leisure industry, His background includes all aspects of timeshare and whole-ownership property management. Jeff He has held leadership roles at major organizations where he served over 300,000 timeshare owners. Jeff also held executive roles at Vacation Innovations before joining the American Resort Coalition. An active industry participant, Jeff is a longtime ARDA member. He is also a board member of SKAL Orlando, an international association of travel industry executives. Keith Organ Senior VP of Accounting and Treasury About Keith Keith is an accounting and finance leader with expertise in driving the growth and optimization of businesses across technology, SaaS, construction, and hospitality. He has held senior roles at Marriott International, focusing on mergers, acquisitions, and due diligence, and at Travel and Leisure, overseeing corporate accounting. Keith manages financial strategy, treasury, tax, audits, and reporting in compliance with GAAP. He also oversees corporate and association accounting operations. Richard Winkler General Counsel About Richard Richard is a results-oriented businessman and licensed attorney in Rhode Island and Massachusetts. With more than 40 years of experience in acquiring, developing, marketing, selling, and operating complex real properties and companies, he oversees Lemonjuice’s legal department. Richard’s experience includes strategy, risk mitigation, dispute resolution, and legal consulting and compliance services. Elizabeth D'Ambro VP of Human Resources About Elizabeth Elizabeth is the Vice President of Human Resources for Lemonjuice Solutions, developing impactful business solutions aligned with HR strategies. Known for adaptability and a people-first approach, she excels in decision-making, team development, time management, and upholding high performance standards. Miisha Brown Senior Executive Assistant About Miisha Miisha joined Lemonjuice Solutions in 2022 as Executive Assistant to the Executive Leadership Team, helping them achieve their organizational goals. Since coming on board, she has streamlined the administrative processes, enabling executives to focus on the high-level priorities. Prior to Lemonjuice, she had 19 years of property management experience in New England and New York before moving to Florida where she managed HOA’s and still holds a Florida CAM license. Outside of Lemonjuice, she enjoys travel, writing, water activities, and spending quality time with family and friends. Mike Elliot VP of Facilities & Risk Management About Mike Mike supports Lemonjuice’s resort maintenance teams, ensuring adherence to operating standards and the upkeep of buildings, equipment, and amenities. He works with project and resort managers to meet operational and renovation goals. Before Lemonjuice, Mike served as Wicomico County’s Deputy Director of Administration and Facilities Director, following a career in law enforcement with the Wicomico County Sheriff’s Office. Aubrey Vaczi VP of Operations About Aubrey Aubrey Vaczi, Vice President of Operations, brings extensive experience in business management and coastal resort operations. A Florida native, she has held roles as resort manager, regional manager, and director of operations, gaining expertise in property management, business development, and rental marketing. Known for her commitment to integrity and innovation, Aubrey excels at adapting to market trends and fostering a collaborative work environment. Jarvis Phillips Director of Owner Support About Jarvis Jarvis Phillips, Director of Owner Support at Lemonjuice Capital Solutions since September 2022, brings over 25 years of call center experience. He excels in recruiting, training, and managing teams, as well as improving call performance and quality assurance. Jarvis’s career spans roles in customer service, compliance, and training at major organizations. Outside of work, he enjoys baking, singing, and spending time with his wife and two daughters. Amy Dobson Creative Services Manager About Amy Amy joined the Lemonjuice Business Development Department in 2023 as Creative Services Manager. With a background in photography and marketing, she manages web and graphic design projects, marketing strategy, digital and print marketing campaigns, and social media for multiple departments. In her free time she enjoys pilates, playing the piano, and spending time with friends and family. Lee Rushin Business Development Account Executive About Lee Lee has nearly 35 years experience in the vacation ownership and resort timeshare industry. At RCI, he held leadership roles focused on driving customer fulfillment and retention satisfaction. As a skilled communicator and longtime member of ARDA, Lee has supported developers as well as HOA’s on all aspects of their business – from sales to operations to providing quality improvement direction and training. Lee is also a member of ARDA-ROC/TBMA and holds a Florida Real Estate license. Amy Rhodes Rental Inventory Manager About Amy With 20 years of experience in the timeshare industry and a degree in Travel & Hospitality Management, Amy is a seasoned leader and subject matter expert. She joined Lemonjuice in 2024 after nearly two decades in exchange operations, bringing a passion for team building, data-driven decision-making, and process improvement. Known for her clear, consistent communication and talent for building strong relationships across teams and stakeholders, she thrives on driving meaningful change. Outside of work, she enjoys exploring new destinations, learning about different cultures, and advocating for the autistic community. Kris Johnson Project Manager About Kris Kris is a Project Manager at Lemonjuice, known for crafting strategic, innovative plans that deliver exceptional results for diverse stakeholders. A Georgia State University graduate with a Business Administration degree, Kris has over 15 years of experience in technology, marketing, and real estate. He is also a certified Project Management Professional (PMP). Outside of work, Kris enjoys basketball, golf, traveling, and time with family and friends. Brian Miller Project Manager About Brian Brian is a Project Manager for Lemonjuice Capital Solutions. He holds a degree in Project Management from Cornell University and is both a South Carolina Notary and a licensed South Carolina Property Manager. With over 15 years of experience in the hospitality industry, Brian has focused primarily on resort operations in the Myrtle Beach market. Lina Rocha-Perez Project Manager About Lina Lina is a bilingual Project Manager with 17+ years of experience in real estate, legal services, and operations. At Lemonjuice Capital Solutions, she leads multimillion-dollar property transformations and resolves complex title issues. Lina’s skills span project planning, legal documentation, and AI-driven process improvements. She’s an active member of the Project Management Institute and mentors future leaders. Thomas Wood Technical Implementation Manager About Thomas Thomas joined Lemonjuice in 2022 as our Technical Implementation Manager and oversees Technical Operations. After serving 5 years in the US Army, he earned an MBA from Rollins College in 2020 and a Master’s in Data Analytics from Nova Southeastern University the following year. He is also a certified Black Belt in Lean Six Sigma and is very passionate about process improvement and the role of new technologies that drive efficiency. Experience the Difference with Lemonjuice Solutions. 7380 W. Sand Lake Rd., Suite 130 | Orlando, FL 32819 (321) 754-1033 SOLUTIONS@LEMONJUICE.BIZ Privacy Policy | Accessibility Statement © Copyright 2015 - 2025 | All Rights Reserved Page load link"
    },
    {
      "url": "https://www.news4jax.com/news/local/2025/05/12/jags-owner-shad-khan-planning-redevelopment-of-seahorse-oceanfront-inn-and-lemon-bar-in-neptune-beach-documents-state/",
      "text": "Jags owner Shad Khan planning redevelopment of Seahorse Oceanfront Inn and Lemon Bar in Neptune Beach, documents state Skip to main content Open Main Menu Navigation Open Search Partly Cloudy icon 82 º Go to the WJXT homepage Join Insider Sign In Open the WJXT News4JAX Help Desk Search News Watch Live Local News Florida Georgia National Politics & Power Politics I-Team Trust Index Community Health Money Education Consumer Entertainment Weird News Weather Weather News Traffic SnapJAX Skycams Alerts Hurricanes Plan and Prepare Georgia St. Augustine Environment Forecasting Change News4JAX+ Watch Live News4JAX Insider How To Watch News4JAX+ Download News4JAX Apps The Morning Show River City Live Podcasts This Week In Jacksonville Business Edition NEXTGEN TV TV Listings Florida Justice Sports Sports Videos Jaguars Jaguars Stats News4JAGS Podcast Gators Breakdown Gators Stats High School Sports Varsity 4 Going Ringside Podcast V4rsity Podcast All Star Athlete Olympics Features News4JAX Insider JAXBest Florida Justice 4 Your Neighborhood Events Calendar Positively JAX River City Live News4JAX+ Women’s History Month Look Local Travel Jacksonville Image Awards Food & Recipes Live Healthy Contests & Rules Talking Health Pets uSay Voting Branded Content River City Live Watch River City Live River City+ Eats & Treats Beats Wellness Local Spotlight Pets Shopping SnapJAX SnapJAX Stories Breaking News Photos Weather Photos Newsletters Sign Up For Newsletters WJXT Contact Us Help Center Careers at WJXT/WCWJ SnapJAX Meet the Team Advertise with us CW17 CW Program Guide Bounce News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 News Weather News4JAX+ Sports Features River City Live SnapJAX Newsletters WJXT CW17 WEATHER ALERT 8 advisories in effect for 4 regions in the area Show Breaking News Bar Close Local News Tarik Minor , Anchor, I-TEAM reporter Published: May 12, 2025 at 4:00 PM Updated: May 12, 2025 at 7:28 PM Tags: Neptune Beach , Duval County , Seahorse Oceanfront Inn , Lemon Bar , Shad Khan Sign up for our Newsletters Sign Up LATEST NEWS All is quiet in the tropics during the peak of hurricane season. 1 hour ago The quiet peak to hurricane season is here Read full article: The quiet peak to hurricane season is here Experience the Final Months of WWII Through Music, Film, and History | The Eyes of the World: From D-Day to VE Day Sponsored The Eyes of the World: Experience the Final Months of WWII Through Music, Film, and History Read full article: The Eyes of the World: Experience the Final Months of WWII Through Music, Film, and History Deputy-involved shooting in St. Johns County 4 hours ago 2 deputies shoot, kill man holding gun after neighbor called 911 to report ‘suspicious person’ in yard: SJCSO Read full article: 2 deputies shoot, kill man holding gun after neighbor called 911 to report ‘suspicious person’ in yard: SJCSO #FluVaxJax campaign offers free vaccination vouchers 5 hours ago #FluVaxJax: How to get a voucher for a free flu shot if you don’t have health insurance Read full article: #FluVaxJax: How to get a voucher for a free flu shot if you don’t have health insurance Recommended Videos Local News Jags owner Shad Khan planning redevelopment of Seahorse Oceanfront Inn and Lemon Bar in Neptune Beach, documents state Tarik Minor , Anchor, I-TEAM reporter Published: May 12, 2025 at 4:00 PM Updated: May 12, 2025 at 7:28 PM Tags: Neptune Beach , Duval County , Seahorse Oceanfront Inn , Lemon Bar , Shad Khan NEPTUNE BEACH, Fla. – Jaguars owner Shad Khan’s development company, Iguana Investments Florida LLC, acquired the Seahorse Oceanfront Inn and Lemon Bar in Neptune Beach in August 2023 for $36.95 million, marking Khan’s first project outside downtown Jacksonville. Now, documents obtained by News4JAX indicate that plans for the properties may include a private beach club, spa, fitness center, restaurant, improved Lemon Bar, parking, and retail space, transforming the area into a boutique resort hotel. Lemon Bar and Grille in Neptune Beach (lemonbarjax.com) And residents have expressed mixed reactions to the proposed redevelopment. Jake Mitchum, a Neptune Beach local, voiced concerns about potential overcrowding and the loss of the community’s local charm. “We’ve got enough traffic already coming through here... I don’t think that’s anything we are worried about from the moment,” Mitchum said. Conversely, some residents welcome the changes. Pashent Robinson believes the development will bring excitement and attract younger visitors to the area. “I think Neptune Beach is definitely ready for that... this will bring new fresher faces,” Robinson stated. At this time, no final redevelopment plans have been submitted to the city of Neptune Beach. Iguana Investments has stated that business will continue at both the Seahorse Oceanfront Inn and the Lemon Bar under the management of Remington Hospitality, a national hotel management company. As the community awaits further developments, Iguana Investments sent News4JAX the following statement: Iguana Investments is currently operating the Seahorse Oceanfront Inn and Lemon Bar as is, with investments in capital improvements underway in the hotel rooms and the bar for our guests and patrons. There are no immediate plans for changes to the property. Once there are plans for the site, we will make a formal announcement and go through proper protocol with the city of Neptune Beach. Spokesperson for Iguana Investments Copyright 2025 by WJXT News4JAX - All rights reserved. About the Author Tarik Minor headshot Tarik Minor Tarik anchors the 4, 5:30 and 6:30 p.m. weekday newscasts and reports with the I-TEAM. email facebook twitter Click here to take a moment and familiarize yourself with our Community Guidelines. Loading... Recommended Videos BACK TO TOP TV Listings Email Newsletters RSS Feeds Contests and Rules Contact Us Careers at WJXT / WCWJ Closed Captioning / Audio Description WJXT Public File WJXT EEO Report WCWJ Public File WCWJ EEO Report Terms of Use Privacy Policy Do Not Sell My Info FCC Applications Cookie Preferences Follow Us Visit our YouTube page (opens in a new tab) Visit our Facebook page (opens in a new tab) Visit our Instagram page (opens in a new tab) Visit our X page (opens in a new tab) Visit our RSS Feed page (opens in a new tab) Get Results With Omne If you need help with the Public File, call (904) 393-9801 At WJXT, we are committed to informing and delighting our audience. In our commitment to covering our communities with innovation and excellence, we incorporate Artificial Intelligence (AI) technologies to enhance our news gathering, reporting, and presentation processes. Read our article to see how we are using Artificial Intelligence. Copyright © 2025 News4JAX.com is managed by Graham Digital and published by Graham Media Group, a division of Graham Holdings."
    },
    {
      "url": "https://www.evanandlemon.com/aboutus",
      "text": "About Us | Join Our Journey — Evan and Lemon 0 Skip to Content Travel Tips Money Trip Planning Packing Destinations Bali Thailand Italy Japan Ireland UK Czech Republic Vietnam Türkiye Croatia Slovenia Bosnia & Herzegovina Bulgaria Romania Serbia South Korea North Macedonia Hungary Slovakia Poland France Spain Portugal Germany Taiwan Singapore Malaysia USA Videos Work With Us About Us Contact Support Us Open Menu Close Menu Travel Tips Money Trip Planning Packing Destinations Bali Thailand Italy Japan Ireland UK Czech Republic Vietnam Türkiye Croatia Slovenia Bosnia & Herzegovina Bulgaria Romania Serbia South Korea North Macedonia Hungary Slovakia Poland France Spain Portugal Germany Taiwan Singapore Malaysia USA Videos Work With Us About Us Contact Support Us Open Menu Close Menu Folder: Travel Tips Back Money Trip Planning Packing Folder: Destinations Back Bali Thailand Italy Japan Ireland UK Czech Republic Vietnam Türkiye Croatia Slovenia Bosnia & Herzegovina Bulgaria Romania Serbia South Korea North Macedonia Hungary Slovakia Poland France Spain Portugal Germany Taiwan Singapore Malaysia USA Videos Work With Us About Us Contact Support Us Who we are We’re Evan & Lemon — mid-range international travelers, content creators, and professional “work, save, travel, repeat” experts. For the past four years, we’ve been proving that you don’t need to be rich, retired, or remote workers to see the world. We work hard in the U.S., live frugally at home, and then take off for months at a time—exploring new countries, diving into local food and drink scenes, and sharing it all with our audience. We create content for people who want to travel better—not just cheaper. Through our YouTube channel, Instagram, and blog, we share practical tips, honest recommendations, and behind-the-scenes stories from over 30 countries (and counting). We want you to skip the guesswork, eat the BEST food, and experience the kind of travel that stays with you long after you’ve unpacked. Our love for travel goes far beyond sightseeing. For us, it’s about immersing ourselves in the culture —wandering neighborhood markets, trying the dishes locals grew up eating, tasting regional spirits, and sipping coffee in corner cafés. We believe these moments are where the real magic of travel happens. Whether you’re here for destination guides, travel planning tips, packing hacks, or just a bit of inspiration for your next trip, we’re glad you found us. Stick around—we’ve got a lot more of the world to explore together. Come with us! Explore our adventures with us! Tap here to visit our YouTube channel, where we share captivating videos showcasing our travel experiences. Follow Our Journey On Instagram MADE WITH SQUARESPACE Connect with us! Some of the links on our website are affiliate links which means we may make a small commission if you purchase something, book an accommodation or tour. These are at no cost to you and they help us to continue to travel and bring you free content."
    },
    {
      "url": "https://thehairylemon.ie/about-us/",
      "text": "About Us | The Hairy Lemon About Us Menus Breakfast Menu Bar Menu Reserve Areas Merch Contact About Us Menus Breakfast Menu Bar Menu Reserve Areas Merch Contact The Hairy Lemon One of Dublin’s Trendiest Pubs! The Hairy Lemon is just about as unconventional as it’s a namesake. The 19th-century house in which it resides is a little ‘outside-the-box’ as well. Painted with years of memorabilia, with a sitting room suspended in mid-air. With High Nellie’s, Wellies and even Granny’s Kitchen. The blockbuster film, “The Commitments” also lives on in the Hairy Lemon Pub. Many scenes were filmed using the snug and bar counter from the pub. With that said, just a few of the reasons why “The Hairy Lemon” has become one of Dublin’s best known pubs. Lovingly painted with years of memorabilia, suspended in mid-air. Private Event Hire Book A Table Try some Irish Whiskey Why not ask the bar staff about your favourite whiskey or maybe try something new? We have a great selection of Irish whiskies, there is definitely something you’ll enjoy! Watch your favourite sport Looking for somewhere to watch your favourite sport? Look no further. We show all major sporting events, from Irish GAA, Premier League, Golf or Rugby… (we’re big Rugby fans!) Listen and enjoy live music With a mix of traditional Irish music and live bands played throughout the week, you’ll be spoilt for choice. Grab a pint of the good stuff, pull up a chair and sit back and enjoy the atmosphere. One of Dublin’s greatest characters This “mysterious” Pub was christened in memory of one of Dublin’s great characters who most likely got his name from his odd appearance! His face was lemon-shaped with the complexion of his skin akin to that particular fruit, and stubble resembling that which grows on a gooseberry. “Hairy” was to be seen roaming the streets of Dublin in the 1940s, catching stray dogs for the police! Opening Hours Mon-Thurs: 10am – 11:30pm Fri-Sat: 10am – 12:30am Sun: 10am – 11pm Visit Us 41-42 Stephen Street Lower, Dublin 2 T: (01)6718949 E: info@thehairylemon.ie Website Design by EscalateWebDesign.ie Reservations At present, we are only accepting booking enquiries for groups of 10 or more. For less then 10 people, we are accommodating walk-ins only. If you would like to make a booking for 10 or more people, please send us an email with details of your party, number of people, date and time to: bookings@thehairylemon.ie"
    },
    {
      "url": "https://lemonleaf.ie/contact",
      "text": "Contact Us - Lemon Leaf Bar Café & Townhouse (021) 470 9792 de en es fr it Select language Book Now Our Menu Brunch Menu Bottomless Brunch Menu Kids Menu Late at the Leaf Menu Home Our Story Come Sleep with us Snug Double Room Cosy Double Room Cosy Twin Room Roomy Double Single Room Special Offers Loading offers… Winter Escape Package Golden Years Package Come Eat with us Book a Table Bottomless Brunch Reviews Gallery Location Vouchers Contact de en es fr it Select language Contact Scroll Available Tonight Book your stay Check In Check Out Adults - + Children - + Promo Code ( Optional ) Home Contact Contact Lemon Leaf Cafe Bar & Townhouse 70 Main St Kinsale Co Cork Ireland P17 PN28 Phone: (021) 470 9792 Email: Accommodation: stay@lemonleaf.ie Restaurant: eat@lemonleaf.ie General Enquiries: hello@lemonleaf.ie Thank you for visiting us. If you have a question for us, or would like to purchase a Gift Voucher or make a reservation, complete the following form and we will get back to you as quickly as possible. Name * Email * Message * Human Verification Send Email * indicates required field Contact Address Lemon Leaf Cafe Bar & Townhouse 70 Main St Kinsale Co Cork Ireland P17 PN28 Phone (021) 470 9792 Email stay@lemonleaf.ie Location Call Us (021) 470 9792 Contact Us Lemon Leaf Cafe Bar & Townhouse 70 Main St Kinsale Co Cork Ireland P17 PN28 Phone : (021) 470 9792 Email : stay@lemonleaf.ie Language Deutsch English Español Français Italiano Select language Pages Our Menu Home Our Story Come Sleep with us Special Offers Come Eat with us Reviews Gallery Location Vouchers Contact Subscribe * indicates required Email Address * Copyright © Lemon Leaf Bar Café & Townhouse 2025 Cloud Diary PMS, Website, Booking Engine & Channel Manager by GuestDiary.com | Sitemap | Cookie Policy | Terms And Conditions Select language Deutsch English Español Français Italiano Dansk Ελληνικά Eesti العربية Suomi Gaeilge Lietuvių Latviešu Македонски Bahasa melayu Malti Български Беларускі Čeština हिंदी Magyar Hrvatski Bahasa indonesia עברית Íslenska Norsk Nederlands Türkçe ไทย Українська 日本語 한국어 Português Polski Tiếng việt Русский Română Svenska Српски Shqipe Slovenščina Slovenčina 中文 Cookie Settings Cookies are used to ensure you get the best experience on our website. This includes showing information in your local language where available, and e-commerce analytics. Cookie Policy Necessary Cookies Necessary cookies are essential for the website to work. Disabling these cookies means that you will not be able to use this website. Preference Cookies Preference cookies are used to keep track of your preferences, e.g. the language you have chosen for the website. Disabling these cookies means that your preferences won't be remembered on your next visit. Analytical Cookies We use analytical cookies to help us understand the process that users go through from visiting our website to booking with us. This helps us make informed business decisions and offer the best possible prices. Allow Cookies Reject All Cookies are used to ensure you get the best experience on our website. This includes showing information in your local language where available, and e-commerce analytics. Cookie Policy Manage Allow Cookies Reject All"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/gurugram/sector-60-gurugram/contact-us",
      "text": "Get in touch with us - Lemon Tree Hotel Sector 60, Gurugram - Contact Address Lemon Tree Hotels accepts payments through UPI, net banking, debit, and credit card that are processed through Cashfree. Please confirm authenticity through the formal channels before acting. Beware of recent fraudulent activities that have been misusing the brand to ensure your protection. Home Destinations Offers & Promotions Rewards Program Our Brands Sustainability Main Menu Home Hotels Offers & Promotions Rewards Program Our Brands Sustainability Property Menu Book Now Sign In Join Sign In Book Now Menu Overview Offers Rooms Restaurants Events Facilities Gallery Contact us Namaste Sign In Join Sign In Book Now Select your destination X 10 am to 5 pm Day Rooms Lemon Tree Hotel  Agra Keys Select by Lemon Tree Hotels  Gandhi Ashram  Ahmedabad Lemon Tree Premier  The Atrium  Ahmedabad Lemon Tree Hotel  Ahmedabad Lemon Tree Hotel  Aligarh Lemon Tree Vembanad Lake Resort  Alleppey Lemon Tree Hotel  Alwar Red Fox by Lemon Tree Hotels  Alwar Lemon Tree Hotel  Aurangabad Lemon Tree Hotel  Baddi Lemon Tree Wildlife Resort Bandhavgarh Keys Lite by Lemon Tree Hotels  Banswara Lemon Tree Premier  Ulsoor Lake  Bengaluru Keys Select By Lemon Tree Hotels  Hosur Road  Bengaluru Keys Select By Lemon Tree Hotels  Whitefield  Bengaluru Lemon Tree Hotel  Whitefield  Bengaluru Lemon Tree Hotel  Electronics City  Bengaluru Lemon Tree Suites  Whitefield  Bengaluru Red Fox by Lemon Tree Hotels  Bhiwadi Lemon Tree Hotel  Bhopal Lemon Tree Premier  Bhubaneswar Lemon Tree Hotel  Chandausi Lemon Tree Hotel  Chandigarh Lemon Tree Hotel  Shimona  Chennai Keys Prima by Lemon Tree Hotels  Katti-Ma  Chennai Lemon Tree Hotel  Chennai Lemon Tree Hotel  Coimbatore Lemon Tree Premier  Corbett Lemon Tree Hotel  Dapoli Keys Lite by Lemon Tree Hotels  Dapoli Lemon Tree Hotel  Dehradun Red Fox by Lemon Tree Hotels  Dehradun Lemon Tree Premier  Delhi Airport Red Fox by Lemon Tree Hotels  East Delhi Red Fox by Lemon Tree Hotels  Delhi Airport Lemon Tree Hotel  East Delhi Mall  Kaushambi Lemon Tree Hotel  Jumeirah  Dubai Lemon Tree Premier  Dwarka Lemon Tree Hotel  Erode Lemon Tree Hotel  Gangtok Lemon Tree Hotel  Candolim  Goa Lazy Lagoon  Baga - A Lemon Tree Resort  Goa Lemon Tree Amarante Beach Resort  Goa Lemon Tree Hotel  Anjuna  Goa Lemon Tree Hotel  Arpora  Goa Lemon Tree Hotel  Sector 68  Sohna Road  Gurugram Keys Lite By Lemon Tree Hotels  Mayfield  Gurugram Lemon Tree Premier-1  Leisure Valley  Gurugram Lemon Tree Premier-2  Leisure Valley  Gurugram Lemon Tree Premier  City Center  Gurugram Lemon Tree Hotel  Udyog Vihar  Gurugram Lemon Tree Hotel  Sector 60  Gurugram Red Fox by Lemon Tree Hotels  Sector 60  Gurugram Lemon Tree Hotel  Haridwar Lemon Tree Hotel  Hisar Lemon Tree Hotel  Hubli Lemon Tree Hotel  Gachibowli  Hyderabad Lemon Tree Hotel  Banjara Hills  Hyderabad Lemon Tree Premier  HITEC City  Hyderabad Red Fox by Lemon Tree Hotels  Hyderabad Lemon Tree Hotel  Indore Lemon Tree Premier  Jaipur Red Fox by Lemon Tree Hotels  Jaipur Lemon Tree Hotel  Jammu Lemon Tree Hotel  Jamnagar  Gujarat Lemon Tree Hotel Centre Point Jamshedpur Lemon Tree Hotel  Jhansi Lemon Tree Wildlife Resort  Kanha Lemon Tree Hotel  Kasauli Lemon Tree Hotel  Katra Keys Select By Lemon Tree Hotels  Kochi Lemon Tree Premier  New Town  Kolkata Keys Prima by Lemon Tree Hotels  Kota  Rajasthan Keys Select By Lemon Tree Hotels  Malabar Gate  Kozhikode Keys Select by Lemon Tree Hotels  Kufri  Himachal Pradesh Lemon Tree Resort  Kumbhalgarh Lemon Tree Hotel  Lucknow Keys Select By Lemon Tree Hotels  Ludhiana Lemon Tree Hotel  Tarudhan Valley Lemon Tree Hotel  McLeodganj Lemon Tree Hotel  Mukteshwar Lemon Tree Hotel  Kalina BKC   Mumbai Keys Select By Lemon Tree Hotels  Nestor  Mumbai Lemon Tree Premier  Mumbai International Airport Aurika  Mumbai International Airport Lemon Tree Premier  Malad  Mumbai Lemon Tree Hotel  Mira road  Mumbai Lemon Tree Resort  Mussoorie Lemon Tree Premier  Budhanilkantha  Kathmandu  Nepal Tigerland Safari - A Lemon Tree Resort  Chitwan  Nepal Sandal Suites  Operated by Lemon Tree Hotels  Noida Lemon Tree Hotel  Noida Lemon Tree Premier  Patna Lemon Tree Hotel  Port Blair Lemon Tree Premier  City Center  Pune Keys Prima by Lemon Tree Hotels  Pimpri Pune Lemon Tree Hotel  Viman Nagar  Pune Lemon Tree Hotel  Hinjawadi  Pune Lemon Tree Hotel  Chinchwad  Pune Lemon Tree Hotel  Rajkot Lemon Tree Premier  Rishikesh Lemon Tree Hotel  Rishikesh Lemon Tree Hotel  Siliguri Lemon Tree Resort  Somnath Lemon Tree Hotel  Sonmarg Lemon Tree Hotel  Srinagar Keys Prima by Lemon Tree Hotels  Thekkady Lemon Tree Hotel  Thimphu  Bhutan Lemon Tree Resort  Thimphu  Bhutan Keys Select By Lemon Tree Hotels  Thiruvananthapuram Red Fox by Lemon Tree Hotels  Tiruchirappalli Aurika  Udaipur - Luxury by Lemon Tree Hotels Keys Select by Lemon Tree Hotels  Udaipur Keys Lite by Lemon Tree Hotels  Urban Square  Udaipur Lemon Tree Hotel  Vadodara Keys Lite by Lemon Tree Hotels  Vadodara Red Fox by Lemon Tree Hotels  Vijayawada Lemon Tree Premier  Vijayawada Keys Lite By Lemon Tree Hotels  Sreekanya  Visakhapatnam Keys Select By Lemon Tree Hotels  Visakhapatnam Delhi Corbett Alwar Agra Goa Hyderabad Aurangabad Baddi Pune Bengaluru Chennai Lucknow Kolkata Patna Siliguri Gangtok Ludhiana Dehradun Rishikesh Vijayawada Srinagar Kochi Jhansi Aligarh Dwarka Bhubaneswar Portblair Neelkanth Mumbai Gurugram Mukteshwar Coimbatore Visakhapatnam Ahmedabad Katra Jammu Jaipur Manesar Bhiwadi Thekkady Alleppey Vadodara Thiruvananthapuram Tiruchirappalli Indore Bandhavgarh Dubai Coorg Noida Chandigarh Manali Thimphu Bhopal Kozhikode Udaipur Mussoorie Hubli Dapoli McLeodganj Sonmarg Rajkot Kumbhalgarh Haridwar Nepal BALAGHAT Hisar Kasauli Somnath Meerut Jamshedpur Kanha Kota Jamnagar Erode Banswara Kufri Chandausi Room 1 1 Adults, 0 Children Edit Remove Adult(s): - + Child (0-6 years): - + + Add Another Room Apply Book Now Home Destination Hotels Lemon Tree Hotel, Sector 60, Gurugram Contact Us Contact Us Address Ullavas Urban Complex, Sector – 60, Gurugram, Haryana - 122011, India Hotel Reception +91 1247142323 Central Reservation Centre +91 9911701701 Email hi.l60@lemontreehotels.com Download Factsheet Things to do in Gurugram Culture Aravali Biodiversity Park, Gurugram 11 km Sultanpur National Park 26 km Leisure Valley Park, 9.6 km Health Care Aryan Hospital 14.7 km Max Hospital 8.8 km Medanta Hospital Gurgaon 9.5 km Shopping Sahara Mall 10 km Ambience Mall, Gurugram 14.4 km MGF Megacity Mall 9.7 km Book Now Our Presence + HOTELS IN Agra HOTELS IN Ahmedabad HOTELS IN Aligarh HOTELS IN Alleppey HOTELS IN Alwar HOTELS IN Aurangabad HOTELS IN Baddi HOTELS IN Bandhavgarh HOTELS IN Banswara HOTELS IN Bengaluru HOTELS IN Bhiwadi HOTELS IN Bhopal HOTELS IN Bhubaneswar HOTELS IN Chandausi HOTELS IN Chandigarh HOTELS IN Chennai HOTELS IN Coimbatore HOTELS IN Corbett HOTELS IN Dapoli HOTELS IN Dehradun HOTELS IN Delhi HOTELS IN Dubai HOTELS IN Dwarka HOTELS IN Erode HOTELS IN Gangtok HOTELS IN Goa HOTELS IN Gurugram HOTELS IN Haridwar HOTELS IN Hisar HOTELS IN Hubli HOTELS IN Hyderabad HOTELS IN Indore HOTELS IN Jaipur HOTELS IN Jammu HOTELS IN Jamnagar HOTELS IN Jamshedpur HOTELS IN Jhansi HOTELS IN Kanha HOTELS IN Kasauli HOTELS IN Katra HOTELS IN Kochi HOTELS IN Kolkata HOTELS IN Kota HOTELS IN Kozhikode HOTELS IN Kufri HOTELS IN Kumbhalgarh HOTELS IN Lucknow HOTELS IN Ludhiana HOTELS IN Manesar HOTELS IN McLeodganj HOTELS IN Mukteshwar HOTELS IN Mumbai HOTELS IN Mussoorie HOTELS IN Nepal HOTELS IN Noida HOTELS IN Patna HOTELS IN Portblair HOTELS IN Pune HOTELS IN Rajkot HOTELS IN Rishikesh HOTELS IN Siliguri HOTELS IN Somnath HOTELS IN Sonmarg HOTELS IN Srinagar HOTELS IN Thekkady HOTELS IN Thimphu HOTELS IN Thiruvananthapuram HOTELS IN Tiruchirappalli HOTELS IN Udaipur HOTELS IN Vadodara HOTELS IN Vijayawada HOTELS IN Visakhapatnam Awards About us Careers Contact us Privacy Policy Blogs Day Use cookies Policy Non Affiliation Terms & Conditions Media Site Map Travel Guidelines Investor relations Nidhi utsav Saathi Loyalty Program Join our newsletter I agree to the privacy policy. Follow us ©2025 by Lemon Tree Hotels Ltd. All Rights Reserved. Restaurant Form × Submit Disclaimer × We are an alliance partner with the brand. This page directs you to our partner websites for offers listed on the brand. Lemon Tree Hotels Limited shall not be responsible for any malfunction, changes in the offers or unavailability of items on the directed sites. I agree Disclaimer × We are an alliance partner with the brand. This page directs you to our partner websites for offers listed on the brand. Lemon Tree Hotels Limited shall not be responsible for any malfunction, changes in the offers or unavailability of items on the directed sites. “Use the code lemonvital50 on the payment option page and enjoy the exclusive rate on the packages” I agree Aurika, Mumbai Skycity × × Explore More"
    },
    {
      "url": "https://www.lemoncontactcentre.co.uk/contact-us",
      "text": "Contact Us - Lemon JavaScript is disabled for this site or you are not using a modern browser. This site relies on JavaScript for some of its functionality. Please consider enabling it in settings or using a modern browser. What we do What we do Business Call Answering Email Management Messaging Apps & SMS Web Messaging Business Process Outsourcing Sectors Sectors we specialise in Absence Management EV Charge Points Facilities Management Fire Sprinkler Funeral Directors Healthcare Heating Oil Suppliers Housing Associations Law Firms Lift & Escalators Medical Equipment Pension Providers Security Services Telecoms & Broadband Service packages Service packages Bronze Package Silver Package Gold Package Platinum Package Resources Resources Brochures Case Studies White Papers About us About us Why Choose Lemon Mobilisation Made Easy System Integration Diagnostic Tools & Knowledgebase ISO Certifications PCI DSS Compliance FAQs 0800 612 7595 Contact us Contact Us Contact us Talk to the Lemon team today and discover how we can help with business call answering, out-of-hours call handling and other call centre service needs. 0800 612 7595 Chat with us on WhatsApp Find us Lemon Contact Centre Unit 1, Lockheed Court Preston Farm Business Park Stockton-on-Tees TS18 3SH Connect with us Speak with our team today I agree to the Terms & Conditions and Privacy Policy Send Get in touch Lemon Contact Centre Unit 1, Lockheed Court Preston Farm Business Park Stockton-on-Tees TS18 3SH Services Why choose Lemon Customer stories About us Contact us Blog FAQs 0800 612 7595 zest@no-sour-business.co.uk Chat with us on WhatsApp Follow us Carbon Reduction Plan Privacy Policy Terms & Conditions © 2025 Lemon Business Solutions | Lemon Business Solutions Ltd is a company registered in England and Wales with Company Number 05941029 and VAT registration number GB 986 0005 20. Cookies on Lemon We use cookies on our website to give you a better experience, improve performance and for analytics. By using this website you agree to our privacy policy and the use of cookies Error setting cookie preference Accept essential Accept all How can we help? For fresh outsourcing ideas, talk to us today. 0800 612 7595 Chat with us on WhatsApp I agree to the Terms & Conditions and Privacy Policy Send"
    },
    {
      "url": "https://pearllemon.com/our-founder/",
      "text": "Meet Our Trusted Founder Deepak Shukla Leading The Way Skip to content UK: +442071833436 UK: +447454539583 US: +16502784421 info@pearllemongroup.com SEO Close SEO Open SEO Core SEO Services Consultant Services Enterprise SEO Services Local SEO Off-Page SEO On-Page SEO SEO Automation Consultancy Service-Based Businesses Technical SEO See More SEO For Platforms BigCommerce SEO E-commerce SEO Shopify SEO Wix SEO Services WordPress SEO YouTube SEO See More Industries We Serve Architects Coaches & Consultants Fashion Brands Home Renovators Law Firms Luxury Brands Pension Fund Companies Professional Services Firms Retailers See More Link Building Services Editorial Link Building Enterprise Link Building High-Quality Backlinks Manual Link Building Premium Backlinks See More PPC Close PPC Open PPC PPC Services Advanced Remarketing Google Ads for Nonprofits PPC for E-commerce PPC for Franchises PPC for Real Estate PPC for Small Businesses See More About Close About Open About About Us About Us Blog Careers Case Studies Head of SEO Meet Our Team Our Founder Testimonials Reviews Why Pearl Lemon Contact Us Get My Free SEO Audit! BOOK MY CALL Meet the Man Behind Pearl Lemon Deepak Shukla Give us 90 days. Deepak and the Pearl Lemon team will rank your website higher in the search results Â & double yourÂ organic traffic . Pearl Lemon – led by Deepak Shukla, Award-Winning SEO Consultant in London ,Â serving clients all over the world. Letâs chat about yourÂ organic search Â growth. Book My Call Recognised In The Industry As SEO Specialists By: Meet Deepak Shukla, Founder of Pearl Lemon Deepak understands what it takes to scale fast. He built Pearl Lemon from scratch, turning it into an award-winning, internationally recognised agency in record time. Work with Deepak to SKYROCKET your organic traffic , click-through rate and conversions . Book My Call SEO Consulting Services From An Experienced Professional Deepak has almostÂ 15 years of experience in search engine optimisation and internet marketing. He started this journey by offeringÂ freelance SEO services before rapidly scaling and building Pearl Lemon, our agency, from the ground up. Over the years, Deepak has worked withÂ hundreds of clients Â from start-ups and small businesses to large corporations that generate 7-figure revenues.Â If you need serious results fast ,Â work with Deepak . Rise Up The Rankings With Search Engine Optimisation Services Deepak Shukla is the founder of Pearl Lemon, aÂ full-service Â organic search agency. Here are a few of the areas he specialises in: Local SEO Get more qualified leads from your local target audience. Learn more Technical SEO Build a solid foundation for your site to rank highly in the SERPs. Learn more WordPress SEO Implement a long term search marketing strategy for your site. Learn more E-commerce SEO Smash your sales targets. Get more organic traffic to your online store. Learn more YouTube SEO Expert Boost your visibility on YouTube and get more views & engagement. Learn more International SEO Reach more of your international audience through organic search. . Learn more Keyword Research Expert Strategically target multiple keywords with buyer intent. Link Building Consultant Generate leads from authoritative, high-domain websites. Website Migration Expert Migrate your site without experiencing a drop in rankings. Some Of Our Clients Evidence Of Successful SEO Campaigns We have over 20 video case studies that demonstrate Pearl Lemon’s ability to get results. To see more, check out this playlist. You Count On Deepak Shukla To Deliver Results Having featured in SEMrush, Woorank, Digital Olympus BrightTalk, Markedu, and more, Deepak has built up a name as being a trusted Â search engine optimisation consultant based in London and influencer within the industry. As an organic search specialist, Deepak has been able to combine his extensive knowledge of optimising webpages for search engines with his entrepreneurial flair to help several of his clients to achieve their digital growth goals â and he has severalÂ verified reviews and clientÂ case studies Â to back this up. Deepak has delivered a 5-star service to 100+ clients globally! Feel free toÂ talk to Deepak Â directly to discuss your digital growth goals! Watch Deepak Shukla Share His Knowledge And Insights! Hereâs a selection of videos featuring Deepak sharing his knowledge! For more, check out the Pearl Lemon YouTube channel. And also Hereâs a non-traditional content strategy to drive more traffic to your website. The importance of having a solid link building strategy to improve rankings. Benefits of optimising your ecommerce website to rank higher in search engines. Deepak teaches via his SEO courses and videos on YouTube â check out the âQuick Winsâ course. Deepak Featured On The Industry Angel Podcast! Deepak Shukla featured on an episode of the Industry Angel Podcast hosted by Ian Farrar, where he shares some of his expertise and lead generation techniques! Get To Know Deepak Before Hiring Him! One of our core values is to build long-lasting client relationships. We know that youâre not just looking for a search engine optimisation service â youâre looking for a trustworthy consultant and the human touch. When heâs not running Pearl Lemon , youâll find Deepak running marathons, watching horror films, getting tattoos, spending time with his partner, Daniela or playing with his cat Jenny! Find Out More! Connect With Us Socially! Facebook Linkedin X-twitter Youtube Alumni Of: We have over 20 video case studies that demonstrate Deepakâs ability to get results. To see more, check out this playlist. Despite attending one of the worst primary schools in the country, Deepak went on to achieve 4As in his A-levels. Graduated from Warwick University (1 of the top 10 universities in the UK) with a 2:1 in BA English Literature (hons). Worked as an Advertising Campaign Manager at WaveMaker (formally MEC) the 2nd largest media agency in the world. Selected during the recession to work at Deloitte (1 of the Big 4 Consulting firms) as a Tax Consultant. Claim Your FREE SEO Audit, No Strings Attached We'd Love To Hear From You! If you have any questions, please do get in touch with us! If youâd prefer to speak directly to a consultant,Â Book A Call! 1. Submit 2. We Review 3. You Get a Call First Name Email Phone/Mobile What Keyword Did You Use To Find Us? Which Of These Platforms Did You Use To Find Us? Please Choose Google (Organic + Ads) Youtube Linkedin ChatGpt Claude Gemini Perplexity other What Can We Help You With? Send My Message No spam. No hard sell. Weâll never sell your data. Promise. Check out some of our awards from the last few years âºï¸ Meet The Team Why Pearl Lemon Weâre Hiring! B2B Lead Generation Client Testimonials Office Address: Pearl Lemon Ltd. Kemp House, 152 â 160 City Road London,Â EC1V 2NX United Kingdom Contact Details: UK: +442071833436 UK: +447454539583 US: +16502784421 info@pearllemongroup.com Manchester 28 Fountain St #163 Manchester, M2 2BE, United Kingdom UK: +442071833436 US: +16502784421 Email: Info@pearllemongroup.com Cardiff Pearl Lemon Ltd. 30 Richmond Rd, #174, Cardiff, CF24 3AS, United Kingdom UK: +442071833436 US: +16502784421 Email: Info@pearllemongroup.com Glasgow 35 Glassford St, #26, Glasgow G1 1UG, United Kingdom UK: +442071833436 US: +16502784421 Email: Info@pearllemongroup.com San Francisco 3060 Fillmore St, San Francisco, CA 94123, USA UK: +442071833436 US: +16502784421 Email: Info@pearllemongroup.com First Name Email Phone/Mobile What Keyword Did You Use To Find Us? Which Of These Platforms Did You Use To Find Us? Please Choose Google (Organic + Ads) Youtube Linkedin ChatGpt Claude Gemini Perplexity other What Can We Help You With? Send My Message London Manchester Leeds Liverpool Spain Germany France Netherlands Sweden Italy Very Professional and Very Productive. The best in the SEO Industry. – Zeno Music Pearl Lemon Group delivers top-tier PR , Lead Generation , Web Development , and Game Development solutions to accelerate your business growth. Youtube Facebook X-twitter Linkedin Sitemap | Privacy Policy | Term of Services | We Accept Crypto Payments ðª Â© 2025. All Rights Reserved | Serving Clients Since 2017 | Company Number: 10411490 |Â  VAT Number: 252 7124 23 BOOK A CALL Missing Out on SEO? Itâs Time to Catch Up and Take the Lead Donât miss out on the opportunity to rank higher. Your competitors are optimizing their SEOâwhy arenât you? Weâll help you target the keywords that drive real traffic. If youâre not acting, youâre falling behind. Letâs get started on a strategy that delivers results. Yes, Letâs Get Started! Thanks, I'll Be Back Later!"
    },
    {
      "url": "https://www.lemontreehotels.com/about-us",
      "text": "Lemon Tree Hotels - About Us, Management, Vision, Mission, Awards & CSR Lemon Tree Hotels accepts payments through UPI, net banking, debit, and credit card that are processed through Cashfree. Please confirm authenticity through the formal channels before acting. Beware of recent fraudulent activities that have been misusing the brand to ensure your protection. Book Now Main Menu Home Destinations Offers & Promotions Rewards Program Our Brands Sustainability Sign In Sign-in/join Join Sign In Book Now Enjoy exclusive member discount & more Join Select your destination X 10 am to 5 pm Day Rooms Lemon Tree Hotel  Agra Keys Select by Lemon Tree Hotels  Gandhi Ashram  Ahmedabad Lemon Tree Premier  The Atrium  Ahmedabad Lemon Tree Hotel  Ahmedabad Lemon Tree Hotel  Aligarh Lemon Tree Vembanad Lake Resort  Alleppey Lemon Tree Hotel  Alwar Red Fox by Lemon Tree Hotels  Alwar Lemon Tree Hotel  Aurangabad Lemon Tree Hotel  Baddi Lemon Tree Wildlife Resort Bandhavgarh Keys Lite by Lemon Tree Hotels  Banswara Lemon Tree Premier  Ulsoor Lake  Bengaluru Keys Select By Lemon Tree Hotels  Hosur Road  Bengaluru Keys Select By Lemon Tree Hotels  Whitefield  Bengaluru Lemon Tree Hotel  Whitefield  Bengaluru Lemon Tree Hotel  Electronics City  Bengaluru Lemon Tree Suites  Whitefield  Bengaluru Red Fox by Lemon Tree Hotels  Bhiwadi Lemon Tree Hotel  Bhopal Lemon Tree Premier  Bhubaneswar Lemon Tree Hotel  Chandausi Lemon Tree Hotel  Chandigarh Lemon Tree Hotel  Shimona  Chennai Keys Prima by Lemon Tree Hotels  Katti-Ma  Chennai Lemon Tree Hotel  Chennai Lemon Tree Hotel  Coimbatore Lemon Tree Premier  Corbett Lemon Tree Hotel  Dapoli Keys Lite by Lemon Tree Hotels  Dapoli Lemon Tree Hotel  Dehradun Red Fox by Lemon Tree Hotels  Dehradun Lemon Tree Premier  Delhi Airport Red Fox by Lemon Tree Hotels  East Delhi Red Fox by Lemon Tree Hotels  Delhi Airport Lemon Tree Hotel  East Delhi Mall  Kaushambi Lemon Tree Hotel  Jumeirah  Dubai Lemon Tree Premier  Dwarka Lemon Tree Hotel  Erode Lemon Tree Hotel  Gangtok Lemon Tree Hotel  Candolim  Goa Lazy Lagoon  Baga - A Lemon Tree Resort  Goa Lemon Tree Amarante Beach Resort  Goa Lemon Tree Hotel  Anjuna  Goa Lemon Tree Hotel  Arpora  Goa Lemon Tree Hotel  Sector 68  Sohna Road  Gurugram Keys Lite By Lemon Tree Hotels  Mayfield  Gurugram Lemon Tree Premier-1  Leisure Valley  Gurugram Lemon Tree Premier-2  Leisure Valley  Gurugram Lemon Tree Premier  City Center  Gurugram Lemon Tree Hotel  Udyog Vihar  Gurugram Lemon Tree Hotel  Sector 60  Gurugram Red Fox by Lemon Tree Hotels  Sector 60  Gurugram Lemon Tree Hotel  Haridwar Lemon Tree Hotel  Hisar Lemon Tree Hotel  Hubli Lemon Tree Hotel  Gachibowli  Hyderabad Lemon Tree Hotel  Banjara Hills  Hyderabad Lemon Tree Premier  HITEC City  Hyderabad Red Fox by Lemon Tree Hotels  Hyderabad Lemon Tree Hotel  Indore Lemon Tree Premier  Jaipur Red Fox by Lemon Tree Hotels  Jaipur Lemon Tree Hotel  Jammu Lemon Tree Hotel  Jamnagar  Gujarat Lemon Tree Hotel Centre Point Jamshedpur Lemon Tree Hotel  Jhansi Lemon Tree Wildlife Resort  Kanha Lemon Tree Hotel  Kasauli Lemon Tree Hotel  Katra Keys Select By Lemon Tree Hotels  Kochi Lemon Tree Premier  New Town  Kolkata Keys Prima by Lemon Tree Hotels  Kota  Rajasthan Keys Select By Lemon Tree Hotels  Malabar Gate  Kozhikode Keys Select by Lemon Tree Hotels  Kufri  Himachal Pradesh Lemon Tree Resort  Kumbhalgarh Lemon Tree Hotel  Lucknow Keys Select By Lemon Tree Hotels  Ludhiana Lemon Tree Hotel  Tarudhan Valley Lemon Tree Hotel  McLeodganj Lemon Tree Hotel  Mukteshwar Lemon Tree Hotel  Kalina BKC   Mumbai Keys Select By Lemon Tree Hotels  Nestor  Mumbai Lemon Tree Premier  Mumbai International Airport Aurika  Mumbai International Airport Lemon Tree Premier  Malad  Mumbai Lemon Tree Hotel  Mira road  Mumbai Lemon Tree Resort  Mussoorie Lemon Tree Premier  Budhanilkantha  Kathmandu  Nepal Tigerland Safari - A Lemon Tree Resort  Chitwan  Nepal Sandal Suites  Operated by Lemon Tree Hotels  Noida Lemon Tree Hotel  Noida Lemon Tree Premier  Patna Lemon Tree Hotel  Port Blair Lemon Tree Premier  City Center  Pune Keys Prima by Lemon Tree Hotels  Pimpri Pune Lemon Tree Hotel  Viman Nagar  Pune Lemon Tree Hotel  Hinjawadi  Pune Lemon Tree Hotel  Chinchwad  Pune Lemon Tree Hotel  Rajkot Lemon Tree Premier  Rishikesh Lemon Tree Hotel  Rishikesh Lemon Tree Hotel  Siliguri Lemon Tree Resort  Somnath Lemon Tree Hotel  Sonmarg Lemon Tree Hotel  Srinagar Keys Prima by Lemon Tree Hotels  Thekkady Lemon Tree Hotel  Thimphu  Bhutan Lemon Tree Resort  Thimphu  Bhutan Keys Select By Lemon Tree Hotels  Thiruvananthapuram Red Fox by Lemon Tree Hotels  Tiruchirappalli Aurika  Udaipur - Luxury by Lemon Tree Hotels Keys Select by Lemon Tree Hotels  Udaipur Keys Lite by Lemon Tree Hotels  Urban Square  Udaipur Lemon Tree Hotel  Vadodara Keys Lite by Lemon Tree Hotels  Vadodara Red Fox by Lemon Tree Hotels  Vijayawada Lemon Tree Premier  Vijayawada Keys Lite By Lemon Tree Hotels  Sreekanya  Visakhapatnam Keys Select By Lemon Tree Hotels  Visakhapatnam Delhi Corbett Alwar Agra Goa Hyderabad Aurangabad Baddi Pune Bengaluru Chennai Lucknow Kolkata Patna Siliguri Gangtok Ludhiana Dehradun Rishikesh Vijayawada Srinagar Kochi Jhansi Aligarh Dwarka Bhubaneswar Portblair Neelkanth Mumbai Gurugram Mukteshwar Coimbatore Visakhapatnam Ahmedabad Katra Jammu Jaipur Manesar Bhiwadi Thekkady Alleppey Vadodara Thiruvananthapuram Tiruchirappalli Indore Bandhavgarh Dubai Coorg Noida Chandigarh Manali Thimphu Bhopal Kozhikode Udaipur Mussoorie Hubli Dapoli McLeodganj Sonmarg Rajkot Kumbhalgarh Haridwar Nepal BALAGHAT Hisar Kasauli Somnath Meerut Jamshedpur Kanha Kota Jamnagar Erode Banswara Kufri Chandausi Room 1 1 Adults, 0 Children Edit Remove Adult(s): - + Child (0-6 years): - + + Add Another Room Apply Book Now Sign up now & avail instant discount Sign Up Choose Your Destination X Overnight Stays Yes No ||| Day Rooms 10 am to 5 pm X Room 1 1 Adults, 0 Children Edit Remove Adult(s): - + Child (0-6 years): - + + Add Another Room Apply Book Now About Us Our Story Our Brands Awards Vision, Mission, Values CSR Eco-Friendly Practices Safety And Security Management Pooch Policy In the early 2000s, 80% of the branded hotel supply in India\r\n                  was in the upscale/luxury segment. There was clearly enormous\r\n                  latent demand in the midscale and economy segments, which were\r\n                  then unmet needs. Lemon Tree Hotels was founded as the\r\n                  category creator for the branded mid-market hotel space in\r\n                  India. Today, Lemon Tree Hotels Limited (LTHL) is one of the largest\r\n                  hotel chains in India, and owns/leases/operates/franchises\r\n                  hotels across the upscale, upper-midscale, midscale and\r\n                  economy segments. LTHL delivers differentiated yet superior\r\n                  service offerings, with a compelling value proposition. The\r\n                  group offers seven brands to meet guests’ needs across all\r\n                  levels, viz. Aurika Hotels & Resorts, Lemon Tree Premier,\r\n                  Lemon Tree Hotels, Red Fox Hotels by Lemon Tree Hotels, Keys\r\n                  Prima by Lemon Tree Hotels, Keys Select by Lemon Tree Hotels\r\n                  and Keys Lite by Lemon Tree Hotels. LTHL opened its first hotel with 49 rooms in May 2004. Today,\r\n                  the company has a portfolio of 160+ hotels, which includes\r\n                  over 100+ operational hotels and more than 60 hotels set to\r\n                  open in India and internationally. Lemon Tree Hotels are\r\n                  located across metro regions, including the NCR, Mumbai,\r\n                  Kolkata, Bengaluru, Hyderabad and Chennai, as well as numerous\r\n                  tier I, II and III cities such as Pune, Ahmedabad, Chandigarh,\r\n                  Jaipur, Indore, Aurangabad, Udaipur, Vishakhapatnam, Kochi,\r\n                  Ludhiana, Thiruvananthapuram, Vijayawada etc. The company\r\n                  expanded internationally with hotels opening in Dubai in\r\n                  December 2019 and in Bhutan in February 2020. New hotels are\r\n                  also set to open internationally in Bhutan and Nepal. The group offers seven brands to meet guests’ needs across all\r\n                  levels: Aurika Hotels and Resorts Upscale Lemon Tree Premier Upper\r\n                    Midscale Lemon Tree Hotels Midscale Red Fox by Lemon Tree Hotels Economy Keys Prima by Lemon Tree Hotels Upper\r\n                    Midscale Keys Selectby Lemon Tree Hotels Midscale Keys Lite by Lemon Tree Hotels Economy The group offers seven brands to meet guests’ needs across all\r\n                  levels. At our hotels across all brands, our guests bond with\r\n                  our open hearted, inclusive culture and our environmentally\r\n                  sensitive ethos 1. Aurika Hotels & Resorts Aurika Hotels & Resorts are upscale properties that offer\r\n                  exclusive experiences in an extraordinary ambience. With an\r\n                  emphasis on sustainable design inspired by local culture and\r\n                  history, these properties combine beauty and elegance with\r\n                  comfortable informality. Our efficient service goes beyond the unusual and is\r\n                  anticipatory yet unobtrusive. Inspiring spaces, unexpected\r\n                  dining experiences, innovative technological solutions and\r\n                  seamless delivery ensure that you can work, play and relax\r\n                  effortlessly. The brand offers: New-age dining options: Mirasa, the all-day dining restaurant Ariva, the bar Specialty restaurant* Invigorating fitness and wellness facilities, including\r\n                    Araya, the rejuvenating spa, a fitness center, a swimming\r\n                    pool and a recreation room* Extensive banquet and event spaces Luxury amenities 2. Lemon Tree Premier Lemon Tree Premier is a chain of sustainably designed upper\r\n                  midscale hotels and resorts that welcome you with their\r\n                  stylish and contemporary interiors. These refreshingly\r\n                  different properties offer warm, friendly and attentive\r\n                  service in a fresh and inviting ambience. Lemon Tree Premier pampers the style conscious traveller with\r\n                  personalized experiences, award winning restaurants and\r\n                  rejuvenating recreational options in a relaxed atmosphere. The brand offers: An exciting range of dining options: Citrus Café, the bright and inviting coffee shop offers an\r\n                    eclectic Indian and international menu Slounge, the recreation bar, offers a fun memorable way to\r\n                    chill and have a spirited night out Republic of Noodles*, the award winning pan Asian restaurant Kebab Theater* brings you traditional mouth-watering kebab\r\n                    delicacies from across India A fitness center, a refreshing swimming pool and a\r\n                    rejuvenating spa* Banquet halls*, meeting rooms* and business facilities* Premium amenities 3. Lemon Tree Hotels Lemon Tree Hotels are sustainably designed midscale hotels and\r\n                  resorts that uplift your spirits at the end of a long day.\r\n                  These refreshingly different properties bring the outdoors in\r\n                  and delight guests with their fresh, vibrant interiors, fun,\r\n                  quirky elements and spirited environment. Warm greetings, friendly smiles and a whiff of our signature\r\n                  lemon fragrance welcome you here. These hotels make you feel\r\n                  close to home with their bright, comfortable rooms and service\r\n                  that goes the extra mile. The brand offers: An exciting range of dining options: Citrus Café, the bright and inviting coffee shop offers an\r\n                    eclectic Indian and international menu Slounge*, the recreation bar, offers a fun memorable way to\r\n                    chill and have a spirited night out A fitness center and a refreshing swimming pool* Banquet halls*, meeting rooms* and business facilities* Refreshing amenities 4. Red Fox by Lemon Tree Hotels Red Fox Hotels are sustainably designed economy hotels. These\r\n                  unbeatably cool properties welcome you with their fun, bold\r\n                  interiors, and crisp and clean rooms. Red Fox Hotels are young at heart and let you be yourself.\r\n                  Here, friendly smiles, professional service, and reliable\r\n                  safety standards go hand in hand with an unmatched value\r\n                  proposition. The brand offers: A cool range of dining options: Clever Fox Café, the casual restaurant Tipsy Fox*, the trendy bar A fitness center Banquet halls*, meeting rooms* and a cyber kiosk* Fun amenities 5. Keys Prima by Lemon Tree Hotels Keys Prima Hotels are sustainably designed upper-midscale\r\n                  hotels and resorts. These properties delight guests with their\r\n                  bright and trendy design and welcoming ambiance. At Keys Prima Hotels, the tasteful interiors and thoughtful,\r\n                  anticipatory service coupled with the brand’s signature warm\r\n                  welcome and fond farewell make for a truly memorable\r\n                  experience. The brand offers: An smart range of dining options: Keys Café, the attractive multi-cuisine coffee shop Unlock Bar*, the relaxed restobar Specialty restaurant* A fitness center, a swimming pool* and a spa* Banquet halls*, meeting rooms* and business facilities* Thoughtful amenities 6. Keys Select By Lemon Tree Hotels Keys Select Hotels are sustainably designed midscale hotels.\r\n                  These properties delight guests with their chic interiors,\r\n                  comfortable rooms, convenient business facilities and\r\n                  pleasing, dependable service. At Keys Select Hotels, the lively ambiance and cheerful smiles\r\n                  go hand in hand with the brand’s signature warm welcome and\r\n                  fond farewell. All this, at a sensible price. The brand offers: A smart range of dining options: Keys Café, the attractive multi-cuisine restaurant Unlock Bar*, the relaxing restobar A fitness center and a swimming pool* Banquet halls*, meeting rooms* and business facilities* Select amenities 7. Keys Lite by Lemon Tree Hotels Keys Lite Hotels are sustainably designed economy hotels.\r\n                  These properties delight guests with their impeccably clean\r\n                  interiors, efficient, agreeable service and easy going\r\n                  atmosphere. The enhanced safety, security and hygiene measures, combined\r\n                  with the brand’s signature warm welcome and fond farewell,\r\n                  make for a stress free stay at an affordable price The brand offers: A smart range of dining options: Keys Café, the attractive multi-cuisine restaurant A fitness center Meeting rooms* and business facilities* Essential amenities *Available at certain properties only 2023 BW Hotelier Awards 2023 Winners ❖ BW Hotelier awarded Patanjali Govind Keswani, Chairman &\r\n                    MD – Lemon Tree Hotels Ltd. with The Hall of Fame Award ➢ General Manager Upscale (East) - Abhishek Bairagi - Lemon\r\n                    Tree Premier, Bhubaneswar ➢ Head of HR (National) - Monalisa Samantaray, Lemon Tree\r\n                    Premier, Patna ➢ Head of Housekeeping (North) - Manish Kumar, Lemon Tree\r\n                    Premier, Leisure Valley 2, Gurugram Recognized by Great Place To Work® for Top 50 India's Best\r\n                    Companies To Work For™ 2023 Recognized by Great Place To Work® for Best Workplaces™ in\r\n                    Industry 2023 Recognized by Great Place To Work® for India's Best\r\n                    Workplaces™ for Millennials 2023 Recognized by Great Place To Work® for Top 100 (large) Best\r\n                    India’s Workplaces for Women 2023 Recognized by Great Place To Work® for India’s Best\r\n                    Workplaces in Diversity, Equity, Inclusion And Belonging\r\n                    (large) 2023 Recognized by Great Place To Work® for Accreditation for\r\n                    Inclusive Practices™ 2023 Received the Award for Excellence by H&RA – Lemon Tree\r\n                    Hotels awarded as Best Hotel Chain CSR TripAdvisor Travellers Choice Awards 2023 72 out of 84 eligible hotels awarded Traveller’s Choice\r\n                    Award by TripAdvisor ➢ Aurika Hotels & Resorts – 2 ➢ Lemon Tree Premier –14 ➢ Lemon Tree Hotels – 36 ➢ Red Fox Hotels – 10 ➢ Keys Prima by Lemon Tree Hotels - 1 ➢ Keys Select by Lemon Tree Hotels –8 Received the Gold Certification by the Indian Green Building\r\n                    Council (I.G.B.C.) ➢ Lemon Tree Premier, Ulsoor Lake, Bengaluru ➢ Lemon Tree Hotel, Electronics City, Bengaluru ➢ Lemon Tree Hotel, Gachibowli 2022 Hotelier India Awards 2022 Winners ➢ Unsung Hero Award - Santosh Jha –Lemon Tree Premier,\r\n                    Rishikesh ➢ Housekeeper of the Year - Prasun Kumar – Red Fox Hotel,\r\n                    Delhi Airport ➢ F&B person the Year - Vijay Kumar - Red Fox Hotel, Delhi\r\n                    Airport BW Hotelier Awards 2022 Winners ➢ BW Hotelier Anil Bhandari Chef of the Year in the East\r\n                    Zone - Mr. Amit Bose – Lemon Tree Premier, Bhubaneswar\r\n                    (currently at Lemon Tree Hotel, Sohna Road, Gurugram) ➢ DOSM of the Year Award in the East Zone - Mr. Agnijeet\r\n                    Ghosh –Lemon Tree Premier, New Town, Kolkata Awarded Chief Minister’s Excellence Award for Labour Welfare\r\n                    - Keys Select By Lemon Tree Hotels, Thiruvananthapuram Received the Gold Certification by the Indian Green Building\r\n                    Council (I.G.B.C.) ➢ Lemon Tree Premier, Mumbai International Airport ➢ Aurika, Udaipur – Luxury by Lemon Tree Hotels Lemon Tree Premier, Dwarka, Gujarat – Awarded by Asia’s\r\n                    Biggest Tourism Awards, organized by the Ministry of Tourism\r\n                    Gujarat: ➢ Best 4 Star Hotel in Dwarka ➢ Best Restaurant in Dwarka ➢ Best MICE Venue in Dwarka TripAdvisor Travellers Choice Awards 2022 61 out of 80 eligible hotels awarded Traveller’s Choice\r\n                    Award by TripAdvisor ➢ Aurika Hotels & Resorts – 1 ➢ Lemon Tree Premier –14 ➢ Lemon Tree Hotels – 31 ➢ Red Fox Hotels – 8 ➢ Keys Select by Lemon Tree Hotels –7 Awarded HRANI Award of Excellence during the 7th HRANI\r\n                    Conclave ➢ Lemon Tree Hotel, East Delhi Mall, Kaushambi awarded as\r\n                    “Best MICE Hotel – Ghaziabad” ➢ General Manager of the Hotel awarded as the “Best General\r\n                    Manager – Midscale” 2021 Hotelier India Awards 2021 8 LTH team members made it to the finalist positions in\r\n                    different categories/regions, with 4 winners and 4 runners\r\n                    up Winners ➢ Abhiram Menon - Lemon Tree Premier, Mumbai International\r\n                    Airport ➢ Umesh Sachdev - Red Fox Hotel, Sector 60, Gurugram ➢ Wasim Sheikh - Lemon Tree Premier, Mumbai International\r\n                    Airport ➢ Gurmeet Bajaj - Lemon Tree Hotel, Banjara Hills, Hyderabad TripAdvisor Travellers Choice Awards 2021 68 out of 79 hotels awarded Traveller’s Choice Award by\r\n                    TripAdvisor ➢ Aurika Hotels & Resorts – 1 ➢ Lemon Tree Premier –12 ➢ Lemon Tree Hotels – 36 ➢ Red Fox Hotels – 12 ➢ Keys Select by Lemon Tree Hotels –7 2020 TripAdvisor Travellers Choice Awards 2020 62 out of 80 hotels awarded Traveller’s Choice Award by\r\n                    TripAdvisor ➢ Lemon Tree Premier – 10 ➢ Lemon Tree Hotels – 31 ➢ Red Fox Hotels – 9 ➢ Keys Prima by Lemon Tree Hotels – 1 ➢ Keys Select by Lemon Tree Hotels – 10 ➢ Keys Lite by Lemon Tree Hotels – 1 BW Hotelier Indian Hospitality Awards 2020 26 LTH team members made it to the finalist position in\r\n                    different categories/regions 5 won in their categories and\r\n                    there were 2 runners up Winners ➢ Midscale General Manager of the Year: Bipendra Gupta -\r\n                    Lemon Tree Premier, Ulsoor Lake, Bengaluru ➢ Budget & Economy General Manager of the Year – National:\r\n                    Kashif Aziz - Red Fox Hotel, Delhi Airport ➢ Hotel Manager of the Year – East Zone: Koushik Pandit -\r\n                    Lemon Tree Hotel, Gangtok ➢ Hotel Manager of the Year – North Zone: Rohit Bhandari -\r\n                    Lemon Tree Premier, Delhi Airport ➢ Executive Housekeeper of the Year – South Zone: Sanjiv\r\n                    Kumar Thakur - Lemon Tree Premier, HITEC City, Hyderabad 2019 Key Awards Investing in People Award during Tourism for Tomorrow Awards\r\n                    2019 organized by World Travel & Tourism Council in Seville,\r\n                    Spain Best Differently Abled Friendly Hotel at FICCI Travel &\r\n                    Tourism Excellence Awards 2019 Best 3-star Hotel at FICCI Travel & Tourism Excellence\r\n                    Awards 2019 Awarded BW Pure: Purpose-Led Brand Award 2019 Won IT Excellence Award by The Indian Express group Felicitated by Schneider Electric with the 'Best Responsive\r\n                    Award' Other Awards Amity Corporate Excellence Awards for Best CSR Practices,\r\n                    2019 by Amity School of Science and Technology 47 hotels out of 55 operating hotels (over 1 year) awarded\r\n                    TripAdvisor’s Certificate of Excellence2019 2018 Key Awards Green Champion Award 2018 under the category ‘Organization\r\n                    Leading the Green Building Movement in India (Commercial)’\r\n                    during 5th Green Champion Award 2018 organized by IBGC (a\r\n                    part of CII formed in2001) Best 3 Star Hotel Award Category during National Tourism\r\n                    Award2016-17 Ranked 12th amongst the Best Large Workplaces in Asia by the\r\n                    Great Place To Work Survey,2018 Financial Times Arcelor Mittal Boldness in Business Award\r\n                    for Corporate Responsibility/ Environment Other Awards Amity Leadership Awards for Business Excellence by\r\n                    Leveraging IT, 2018 by Amity School of Science and\r\n                    Technology Customer Loyalty Awards for the category of \"Best Loyalty\r\n                    Program in Services Sector” 2018 26 hotels out of 41 operating hotels (over 1 year) awarded\r\n                    TripAdvisor’s Certificate of Excellence 2018 ➢ Lemon Tree Premier Ahmedabad ➢ Lemon Tree Premier 1, Leisure Valley, Gurugram ➢ Lemon Tree Premier 2, Leisure Valley, Gurugram ➢ Lemon Tree Premier, City Center, Gurugram ➢ Lemon Tree Premier, Jaipur ➢ Lemon Tree Hotel, Baddi ➢ Lemon Tree Hotel, Electronics City, Bengaluru ➢ Lemon Tree Wildlife Resort, Bandhavgarh ➢ Lemon Tree Hotel, Chandigarh ➢ Lemon Tree Hotel, Shimona, Chennai ➢ Lemon Tree Hotel, Dehradun ➢ Lemon Tree Hotel, East Delhi Mall, Kaushambi ➢ Lemon Tree Hotel, Candolim, Goa ➢ Lemon Tree Hotel, Gachibowli, Hyderabad ➢ Lemon Tree Hotel, Indore ➢ Lemon Tree Hotel, Katra ➢ Red Fox Hotel, Bhiwadi ➢ Red Fox Hotel, Chandigarh ➢ Red Fox Hotel, East Delhi Mall, Kaushambi ➢ Red Fox Hotel, Jaipur ➢ Red Fox Hotel, Trichy Vision Lemon Tree Hotels shall be the largest and most preferred\r\n                  Indian chain of upscale, upper-midscale, midscale and economy\r\n                  hotels and resorts. Mission We shall be committed to: Ensuring the well-being and self-worth of our colleagues,\r\n                    who are of the utmost importance to us. Enhancing this by\r\n                    also building a culture of diversity, inclusion and equal\r\n                    opportunity. Contributing to the community we live in and to India in\r\n                    general. Delighting our guests, whose comfort, safety, security and\r\n                    well-being is our main reason for being. Rewarding our stakeholders, whose trust motivates us to\r\n                    excel further. Protecting the environment Maximizing the efficiency of our processes, to enable us to\r\n                    be the most cost-effective company offering the greatest\r\n                    value, which our customers have every right to expect Core Values (Has To Rise): H ealth A nd S afety: We will\r\n                  always focus on ensuring the health, safety, security and\r\n                  well-being of all our stake holders including the communities\r\n                  within which we operate our business. T eamwork – We recognize that superlative\r\n                    performance is always the result of teamwork. O wnership – We always take responsibility\r\n                    for our actions. R espect and Empathy – We always exhibit\r\n                    respect and concern for colleagues, guests and partners. I ntegrity – We always maintain the\r\n                    highest standards of fairness and transparency in all our\r\n                    dealings. S pirited Fun – We create an exciting and\r\n                    spirited work environment encouraging our colleagues to\r\n                    think freely. E xcellence – We always drive excellence\r\n                    in what we do. Learning And Development The company has implemented a detailed plan for learning and\r\n                  development in order to deliver on its brand promise and has\r\n                  developed customized content and training processes for LTH\r\n                  that are world class as well as benchmarked across industries. Corporate Social Responsibility Lemon Tree believes that the brand should stand for more than\r\n                  ‘just profit’. We have focused our efforts on creating a\r\n                  socially inclusive work environment which seeks to bring in\r\n                  people of different backgrounds, abilities and ethnicities and\r\n                  offer them work as a unified team with a common goal. We believe that persons with disabilities (which can be\r\n                  physical, social or economic disabilities leading to an\r\n                  opportunity deprivation) must be provided the same\r\n                  opportunities as others to realize their full potential and\r\n                  live with dignity. By creating a supportive environment in the\r\n                  organization that allows them to deliver their best, we are\r\n                  able to play a part, however small, in social inclusiveness,\r\n                  opportunity/livelihood creation and therefore nation building. Lemon Tree has defined the goal as mainstreaming ‘Opportunity\r\n                  Deprived Indians’ i.e. ODIs into its workforce. ODIs include: A. Employees With Disability (EwD): Physical Disability Speech and Hearing Impaired (SHI) Orthopedically Handicapped (OH) Acid Survivors (AS) Going forward, also Visually Impaired (VI), Low Vision (LV) Intellectual Disability Down Syndrome Autism People who belong to marginalized sections of society or are\r\n                  from the Economically/ Socially (EcoSoc) weak segment: Below Poverty Line (BPL) individuals Widowed or abandoned/battered/destitute/divorced women Orphans/abandoned girls Individuals from economically weak families Communities who do not get education and employment\r\n                    opportunities easily i.e. North Eastern States, Bihar,\r\n                    Jharkand, Chhattisgarh, Orissa, tribal/interior areas of any\r\n                    state, etc. For any of the above segments (except #2), we consider those\r\n                  who have studied upto Class 9 and not beyond that. Evolution of the EWD Initiative | Disability Types In the early stages, we inducted EwD only in back-end roles\r\n                  like Kitchen Stewarding and Housekeeping, where direct guest\r\n                  interaction was minimal. Also the focus was only on SHI\r\n                  employees. This gave us an opportunity to develop standard\r\n                  operating procedures and training modules in an iterative\r\n                  manner. Subsequently we extended this initiative to guest\r\n                  contact areas such as our restaurants. Here, interaction with\r\n                  guests is an integral part of the job role. We then\r\n                  re-engineered the relevant service process to enable EwD to\r\n                  interact with guests. We also engaged with people with\r\n                  orthopaedic impairment where their disability did not come in\r\n                  the way of their job performance. We have now done six trials\r\n                  with Down Syndrome in Delhi/NCR at the coffee shop. As we are\r\n                  building sufficient learning and experience from this\r\n                  exercise, we will start hiring such candidates across other\r\n                  hotels in the group and slowly ramp up to a national scale.\r\n                  Autism trials (two) and Acid Survivor trials have started too\r\n                  and the learnings are being assimilated. This initiative was started in 2007. As on May, 2018,\r\n                  approximately 21% of our own employees are Indians who are\r\n                  opportunity deprived in some way. Summary of Awards 2018 FT ArcelorMittal Boldness in Business Award for Corporate\r\n                    Responsibility/ Environment 2018 Business Excellence by Leveraging IT, 2018 by Amity School\r\n                    of Science and Technology 2017 Dr. Anji Reddy Memorial Award for Model Employer for Persons\r\n                    with Disabilities 2017 NCPEDP Helen Keller Awards for Role\r\n                    Model Companies 2017 Ranked #4 Best Company in India by Great Places to Work For\r\n                    Institute 2017 Ranked #19 Best Company in Asia by Great Places to Work For\r\n                    Institute 2017 Recognition for being among the best in the Special Category\r\n                    – Employer Branding, 2017; Utilizing Analytics to Drive\r\n                    Great Place to Work Initiative, 2017 People Matters Talent Acquisition League 2017:’ Best in\r\n                    Diversity’ Award People Matters Total Rewards 2017: 'Best in Building Career'\r\n                    Award 2016 Ministry of Social Justice and Empowerment, Government of\r\n                    India: Best Employer – National Award, 2016. Award received\r\n                    from the President of India Ranked #9 Best Company in India by Great Places to Work For\r\n                    Institute 2016 Ranked the Best Company in India for Workplace Culture\r\n                    Transformation 2016 Overall Winners World Responsible Tourism Award 2016 at\r\n                    WTM®, London Gold Winner-'Best Accommodation for Responsible Employment'\r\n                    category’ 2016,WTM®, London HR Innovation Award for Excellence in Diversity and\r\n                    Inclusion,2016 2015 HICAP Sustainable Hotel Award 2015 for Sustainable\r\n                    Communities Asian Human Capital Award 2015 for Innovative and Impactful\r\n                    People Practices by Ministry of Manpower, Singapore and the\r\n                    Human Capital Leadership Institute Hotel Investment Conference Asia Pacific (HICAP) 2015\r\n                    Sustainable Hotel Awards: for Sustainable Communities NASSCOM Social Innovation Award 2015 for Corporate\r\n                    (Responsible Business). This award is for our training AV in\r\n                    Indian Sign Language (ISL) for our Speech & Hearing Impaired\r\n                    (SHI) employees Ranked #30 in the Top 50 Great Places to Work For 2015 Ranked #2 Best Company in India with Unique Initiative/\r\n                    Programme 2015 BW Hotelier HR Excellence Award 2015 for being an equal\r\n                    opportunity employer 2014 Cornell University Exemplary Practice Award 2014 for Lemon\r\n                    Tree Hotels’ ccompanywide inclusion program and initiative\r\n                    of hiring and supporting People with Disabilities. National Tourism Award 2012-13: Best Classified hotel under\r\n                    2 Star Category - Red Fox Hotel, East Delhi Nipman Foundation ‘Equal opportunity Award’ 2014 Ranked #86 in the Top 100 Great Places to Work For in India\r\n                    2013 by the Great Place to Work Institute & the Economic\r\n                    Times 2013 Aaj Tak Care Awards 2013 for CSR (Corporate Social\r\n                    Responsibility) in the Empowerment category. This award is\r\n                    for our Employees with Disabilities (EwD) initiative. Ranked #67 in the Top 100 Great Places to Work For in India\r\n                    2013 by the Great Place to Work Institute & the Economic\r\n                    Times. 2012 Ministry of Social Justice and Empowerment, Government of\r\n                    India: National Award: Outstanding Work in the Creation of a\r\n                    Barrier-free Environment for Persons with Disabilities,\r\n                    2012. Award received from the President of India. Ranked in the Top 50 large organizations (>1000 employees)\r\n                    in the 2012 study of Best Companies to Work For in India by\r\n                    the Great Place to Work Institute & the Economic Times. NCPEDP (National Center for Promotion of Employment for\r\n                    Disabled People)-Shell Helen Keller Award 2012: Category C:\r\n                    Role Model Organizations, for the work towards promoting\r\n                    employment opportunities for people with disabilities. NCPEDP-Shell Helen Keller Award 2012: Category B: Role Model\r\n                    Non-Disabled Individuals, for your work towards promoting\r\n                    employment opportunities for people with disabilities. Svayam Accessibility and Universal Design Award, 2012 2011 Ministry of Social Justice and Empowerment, Government of\r\n                    India: Best Employer – National Award, 2011. Award received\r\n                    from the President of India. Ranked in the Top 100 in the 2011 study of Best Companies to\r\n                    Work For in India by the Great Place to Work Institute & the\r\n                    Economic Times MphasiS Universal Design Award, 2011: from NCPEDP (National\r\n                    Center for Promotion of Employment for Disabled People) 2010 NCPEDP (National Center for Promotion of Employment for\r\n                    Disabled People, a nonprofit organization working as an\r\n                    interface between government, industry, international\r\n                    agencies and the voluntary sector) – Shell Helen Keller\r\n                    Award, 2010 for exemplary beliefs and practices in employing\r\n                    Differently Enabled People. B.TRIBAL ART Lemon Tree Hotels is the largest buyer nationally of tribal\r\n                  art from Bastar, Madhya Pradesh. This enables the group to\r\n                  support poor tribal craftsmen in this region and allows the\r\n                  chain to showcase their art extensively across its hotels. C. GIVING BACK TO SOCIETY LTH supports and partners these NGOs and societies: Goonj: which provides clothes and utensils to the\r\n                    impoverished. Suniye: that runs a school for Speech and Hearing Impaired\r\n                    children from economically weaker sections of society. It\r\n                    provides extensive life skills support to these children. Akshaya Patra: whose focus is to eliminate hunger in the\r\n                    city. It regularly provides a free meal to approximately\r\n                    2000 destitute people in Delhi, across the city. Muskaan: which provides comprehensive education, vocational\r\n                    training and work opportunities to young people who are\r\n                    intellectually challenged. Ramanujan Society: where LTH has donated gifts to students\r\n                    for successfully clearing the IIT entrance exam. D. Art Objects Through People For Animals LTH is a large supporter of art objects promoted by People for\r\n                  Animals. This money helps support the initiatives undertaken\r\n                  by PFA for the welfare and care of animals across India. Lemon Tree Hotels - Eco-Friendly Practices Committed to a healthy and happy earth, Lemon Tree Hotels has\r\n                  implemented many eco-friendly processes for energy saving and\r\n                  water preservation, responsible waste management as well as\r\n                  measures to control water, noise and environmental pollution. Caring for the Environment Our existing and upcoming hotels are designed and constructed\r\n                  to qualify for the L.E.E.D Gold Standard. Leadership in Energy\r\n                  and Environment Design (L.E.E.D) is the internationally\r\n                  recognized eco-friendly building certification standard\r\n                  awarded by the United States Green Building Council (USGBC)\r\n                  and the Indian Green Building Council (IGBC) to buildings\r\n                  designed for energy savings, efficient use of water, reduction\r\n                  of CO2 emission and overall improvement in environmental\r\n                  quality. Our Lemon Tree Premier, Delhi Airport, Red Fox Hotel, Delhi\r\n                  Airport and Lemon Tree Hotels, City Centre Gurugram hotels,\r\n                  have been built in accordance with the U.S. Green Building\r\n                  Council’s Gold LEED standards and the Indian Green Building\r\n                  Council’s standards. Energy Conservation Heat Recovery Ventilators (HRV) with thermal enthalpy\r\n                    wheels: for heat recovery from washroom exhausts Chilled water reset through building automation: to reduce\r\n                    power consumption required for cooling building Heat pumps: for heat recovery, for heating domestic water. LED lighting and CFL Lighting: both consume far less energy\r\n                    than traditional lighting Key Tag Energy Saver System: conserves energy in unoccupied\r\n                    rooms Natural/day lighting: reduces power consumption dramatically Double Glazed Vacuum Sealed Windows: conserves energy and\r\n                    reduces noise Auto Time Management (for lighting, air-conditioning and\r\n                    ventilation fans) through timers and motion sensors: helps\r\n                    conserve energy Energy-Efficient Hydro-Pneumatic System with\r\n                    Variable-frequency Drive (VFD) motors for water supply:\r\n                    ensures constant pressure and reduces load on pumps LT Voltage Stabilizer: is energy saving and prevents damage\r\n                    to equipment due to sudden power fluctuations Thermal Insulation: increases room comfort and conserves\r\n                    energy Use of BEE certified equipment e.g. air-conditioner,\r\n                    refrigerator, fans, etc.: reduces energy consumption Solar Panel for hot water: alternative, renewable energy Water Conservation Sewage Treatment Plant (STP): recycles water used across the\r\n                    hotel and this recycled water is used in the garden and\r\n                    flush systems Aerators/Flow Restrictors including Duel Flush System:\r\n                    maintains water force and yet reduces outflow, hence saving\r\n                    water Rain Water Harvesting: protects and replenishes the ground\r\n                    water table Auto Flush For Public Urinals: minimizes water wastage Guest engagement program – water saving poster placed in all\r\n                    rooms that quantifies the saving of water each guest can do\r\n                    by not getting their linen changed daily – encourages them\r\n                    to do their small bit to save precious water when they are\r\n                    travelling. Green Fuels and Green Materials Use of CNG instead of LPG: leads to reduction of pollution Use of Green Building Material for example recycled wood,\r\n                    medium density fiberboard, rubber wood, particle board,\r\n                    sawmill shavings or saw dust, AAC blocks. Waste Management Sewage Treatment: prevents pollution Noise Pollution Management Double Glazed Vacuum Sealed Windows: reduces external noise\r\n                    level below 50 decibels Environmental Seals: prevents entry of noise and smoke (in\r\n                    case of fire) into the room Noiseless Generators: acoustically insulated, the sound\r\n                    level is dampened to a minimal level Operational Practices Laundry Paper/Cloth bags instead of plastic: environmentally\r\n                    friendly Recycled Garbage Bio-degradable Bags: environmentally\r\n                    friendly Water Glasses inverted and placed on a cork surface: thereby\r\n                    doing away with plastic covers Pencils not plastic pens MoEF Report MoEF Report Month of June 2024-Compliance MoEF Report Month of June 2024-Batteries Return MoEF Report Month of June 2024-E-waste Return MoEF Report Month of June 2024-Return Annual MoEF Report June-2016 MoEF Report Dec-2016 MoEF Report Dec-2017 MoEF Report June-2017 Part-1 MoEF Report June-2017 Part-2 MoEF Report June-2017 Part-3 MoEF Report June-2018 MoEF Report December-2018 MoEF Report December-2019 MoEF Report June-2020 HALF YEARLY EC & CTO COMPLIANCE-DEC 2020 MoEF Report June-2021 MoEF Report December-2021 Part-1 MoEF Report December-2021 Part-2 MoEF Report December-2021 Part-3 MoEF report month of June. 2022-E waste MoEF report month of June. 2022-Form 4 MoEF report month of June. 2022-Lemon Tree Compliance MoEF report month of June. 2022-Used Batteries MoEF report month of December. 2024-Battery Return MoEF report month of December. 2024-Environment\r\n                      Clearance Safety and Security: At Lemon Tree Hotels, safety and security of our guests,\r\n                  employees and assets is paramount to us. Our security\r\n                  department has invested in updated technology and equipment\r\n                  for all our recent hotels and evaluates ways to upgrade\r\n                  security measures in our older hotels. For example, our hotel, Lemon Tree Premier, Delhi Airport has\r\n                  adopted face recognition software together with cameras, a\r\n                  video wall in the security control room, a 3D walkthrough and\r\n                  bio-metric access control. Some key security arrangements in\r\n                  our recent hotels include crash bollards and boom barriers at\r\n                  each entrance, under-vehicle surveillance systems, baggage\r\n                  x-ray scanners, CCTV coverage of all public areas, intruder\r\n                  alarm system and panic buttons at key locations such as the\r\n                  main gate, reception and swimming pool areas. Some of the measures in practice are: Baggage scanners to ensure that all guest baggage is\r\n                    screened on arrival CCTVs located in all public areas especially at strategic\r\n                    points Individual fire indicators outside each room to expedite\r\n                    emergency response in case of a fire emergency Wide angle (110 degrees) peephole on room entrance doors Safety chain and double lock facility in the main room door\r\n                    interactions Emergency procedures notice displayed behind the entrance\r\n                    door Fire resistant room door (up to a limited extent) All entrance doors are lined with an environmental seal to\r\n                    minimize noise and protect the room from external smoke, in\r\n                    case of fire Smoke detector in each room Water sprinklers in each room for enhanced fire safety Entrance door and bathroom doors can be double locked from\r\n                    the inside Low level signage on all our buildings A public address system (in most hotels) to help evacuate\r\n                    guests and employees during an emergency 24x7 power backup LTH is run by a group of experienced hotel professionals who\r\n                  have worked with leading luxury hotel brands and across\r\n                  industries including Consulting, FMCG, Banking and Insurance,\r\n                  Telecom, Automobiles and offshore business processing. Patanjali Govind Keswani Chairman & Managing Director Patanjali (Patu) is a B. Tech. in Electrical Engineering\r\n                      from IIT Delhi and holds a Post Graduate Diploma Degree in\r\n                      Management from IIM Kolkata. He was presented the\r\n                      Distinguished Alumni Award by IIT Delhi in 2011 and by IIM\r\n                      Kolkata in 2012. Prior to promoting Lemon Tree Hotels, he\r\n                      has worked with Tata Administrative Services, Taj Hotels\r\n                      and A.T. Kearney Limited. Patu is considered not just a\r\n                      pioneer in the midscale hospitality space in India, but\r\n                      also a leader in fostering diversity and inclusion in the\r\n                      industry, by spearheading Lemon Tree’s robust D&I\r\n                      initiatives, including hiring of Persons With Disability.\r\n                      He has been the founding Chairman of the Skill Council for\r\n                      Persons with Disability and a founding member of the\r\n                      Sector Skill Council for the Hospitality, Travel and\r\n                      Tourism industry. Vishvapreet Singh Cheema President Vishvapreet Singh Cheema is a seasoned hospitality professional with over 27 years of experience. He holds a Bachelor's Degree in Commerce, a Diploma in Hotel Management and Catering Technology and Applied Nutrition from IHM CT&N, Lucknow, and completed the INSEAD Leadership Program for Senior Executives from Singapore. He began his career with Oberoi Hotels & Resorts and has held leadership roles in global brands like Marriott, Radisson, and IHG, where he led South West Asia as Director of Operations. Currently with Lemon Tree Hotels, he brings a strong track record in executive leadership, strategic planning, and managing hotel operations across India and international markets including Nepal, Bhutan, Bangladesh, Sri Lanka, and the UK. Davander Tomar Executive Vice President - Corporate Affairs Davander is a B. Com, M.A. and an L.L.B. from University\r\n                      of Delhi. He has 18 years of experience with Taj Hotels\r\n                      where he worked as the Area Security Manager of Taj Palace\r\n                      Hotel, New Delhi. He has over 35 years of experience in\r\n                      the hospitality industry. Kapil Sharma Executive Vice President - Finance & Chief Financial\r\n                    Officer Kapil is a qualified Chartered Accountant with B.Com (H)\r\n                      degree from Hans Raj College, University of Delhi. His\r\n                      diverse experience spans across businesses from Investment\r\n                      Banking, Financial services, Logistics services,\r\n                      Manufacturing to Hospitality Industry. He joined Lemon\r\n                      Tree from Leroy Somer & Controls India Private Limited\r\n                      where he worked for several years as Head-Finance and\r\n                      Accounts. Kapil has more than 25 years of experience in\r\n                      the finance and commercial functions covering mergers\r\n                      & acquisitions, private equity, debt instruments,\r\n                      project financing, joint venture and capital market\r\n                      listing etc. He has previously worked with Onida Finance\r\n                      Limited and AFL Limited. Sanjay Rai Chief Revenue Officer With over 40 years of experience in hospitality and\r\n                      manufacturing, Sanjay Rai is a stalwart in the Indian\r\n                      hospitality industry. Currently, he serves as the Chief\r\n                      Revenue Officer at Lemon Tree Hotels. He comes to Lemon\r\n                      Tree Hotels with a proven track record in the areas of\r\n                      Brand Management, Customer Acquisition, Sales Promotions,\r\n                      Alliances & Partnerships and Stakeholder Management.\r\n                      Sanjay started his professional journey with ITC Ltd.,\r\n                      handling multiple businesses, including hotels. This was\r\n                      followed by an association of close to two decades with\r\n                      The Oberoi Group, leading their sales function globally,\r\n                      across two stints. Sanjay also worked with Max Healthcare,\r\n                      and his last assignment was Senior Vice President of Sales\r\n                      & Marketing at Sarovar Hotels. Aradhana Lal Sr. Vice President - Sustainability & ESG Aradhana is a TedX speaker and an MBA from IIM Ahmedabad\r\n                      with 29 years of experience in Sales, Marketing, Corporate\r\n                      Communications and ESG/Sustainability at Hindustan\r\n                      Unilever, Taj Group and Lemon Tree Hotels. Today, Aradhana\r\n                      leads ESG/Sustainability which includes Planet/Environment\r\n                      (renewal energy, water recycling and reuse, etc.) and\r\n                      People/Diversity, Equity and Inclusion (hiring Employees\r\n                      With Disabilities – deaf, low vision, Acid Survivor, Down\r\n                      Syndrome, Autism and Economically & Socially Marginalized\r\n                      – transgender, school dropouts, orphans,\r\n                      widows/divorcees). Aradhana was awarded the Role Model\r\n                      Supporter of Increased Employment Opportunities for\r\n                      Persons With Disabilities by NCPEDP in 2018. Sareena Kochar Senior Vice President – Housekeeping A Post Graduate in Hotel Management from All India\r\n                      Institute of Management Studies, Chennai, Sareena has\r\n                      almost four decades of experience in the Industry. An\r\n                      expert in hotel openings, she has launched several brands\r\n                      for Lemon Tree Hotels and hotels for the Lalit Group. She\r\n                      has previously worked with VLCC, IHG Hotels & Resorts and\r\n                      Hilton Hotels & Resorts. She has launched eco-friendly\r\n                      practises in the company. A certified mentor from XLRI\r\n                      Jamshedpur, she has nurtured talent in the organisation. A\r\n                      key member of the ‘Swachya Bharat Swasthya Bharat’\r\n                      campaign, she also trains Speech and Hearing Impaired\r\n                      (SHIs) team members in Housekeeping. Sumant Jaidka Sr. Vice President - Ops & Chief Operations Officer Sumant is a graduate of the Salzburg School of Hotel\r\n                      Management, Austria. He has over 30 years of experience in\r\n                      the hospitality industry. He started his career with the\r\n                      Hyatt Regency New Delhi in the F&B department, before\r\n                      moving to the Intercontinental Hotel and later Taj Palace,\r\n                      New Delhi. After a short tenure with Crowne Plaza, he\r\n                      joined the Lemon Tree Hotels. He has been with the company\r\n                      for over 15 years and has played an instrumental role in\r\n                      its growth. Rajesh Kumar Senior Vice President – Human Resources & Vigilance\r\n                    Officer Rajesh is a Post Graduate of Personnel Management and\r\n                      Industrial Relations as well as Public Administration from\r\n                      Himachal Pradesh University. In a career spanning over 20\r\n                      years, Rajesh has been associated with Oberoi Hotels and\r\n                      Resorts, Select Holiday Resorts and Mahindra Holidays &\r\n                      Resorts, where he experimented with and implemented new HR\r\n                      initiatives. He joined Lemon Tree Hotels over 15 years\r\n                      ago, and has been awarded the Margdarshak Award from\r\n                      FOSTIIMA Business School for his initiatives at the\r\n                      company. Ajai Kumar Sr. Vice President & Chief Information Officier An MCA from Madan Mohan Malviya Engineering College,\r\n                      Gorakhpur & MBA (Information Systems) from Sikkim Manipal\r\n                      University, Ajai has over 30 years of experience in IT\r\n                      Strategy, Digital Enablement, Technology Management and\r\n                      Operations. He has worked in Senior IT Management roles\r\n                      with BAX Global India Pvt Ltd, Gati Ltd, Central Cottage\r\n                      Industries Corp of India Ltd, Anand Automotive Systems Ltd\r\n                      and Blue Dart Express Ltd. At Lemon Tree Hotels, he leads\r\n                      the evaluation, priority setting, deployment and\r\n                      management of current and future technology products,\r\n                      services and systems for the company. Rajeev Janveja Senior Vice President & Corporate Chef Chef Rajeev started his culinary journey with Taj Hotels\r\n                      after completing his studies from IHM Lucknow. Over the\r\n                      years, he has honed his skills at various Taj Hotels\r\n                      across the country as well as with some other leading\r\n                      retail food businesses. As the Senior Vice President &\r\n                      Corporate Chef of Lemon Tree Hotels, Chef Rajeev is\r\n                      directly responsible for F&B (Production) and F&B\r\n                      (Service) across all brands and hotels in the company. He\r\n                      also researches and plans menus for new, upcoming hotels\r\n                      and develops new and innovative food concepts for the\r\n                      company’s F&B brands. Ritu Ranjan Sr. Vice President - Aesthetics & Design Ritu, a graduate from Lady Shri Ram College, New Delhi,\r\n                      has been working with Lemon Tree Hotels for over 10 years.\r\n                      She works closely with the Interior designers, Architects\r\n                      and the Chairman’s office to develop and execute the\r\n                      design vision of the group across its brands. She leads\r\n                      the design conceptualization and implementation for new\r\n                      hotels and also works on the upgradation of the older\r\n                      hotels in the group. Vilas Pawar CEO - Managed & Franchise Division Vilas is a hotel management graduate of IHM, Mumbai, and\r\n                      has worked for over 35 years with marquee brands including\r\n                      Taj Hotels, Hyatt Hotels and Resorts, Radisson Hotels,\r\n                      Edenpark Hotels and TGI Fridays. In his last assignment,\r\n                      as Director and Chief Executive Officer, he was\r\n                      responsible for establishing the operations and franchise\r\n                      business for Choice Hotels International in India, Nepal,\r\n                      Sri Lanka and the Maldives. Niket Sood Vice President – Commercial Strategy With an illustrious career spanning nearly two decades,\r\n                      Niket brings a rich legacy of leadership across global\r\n                      hospitality giants like Accor and Marriott International.\r\n                      In his most recent role as Regional Director – Topline\r\n                      Performance at Accor India & South Asia, he led commercial\r\n                      strategy across Sales, Revenue, Distribution and Loyalty,\r\n                      helping to deliver above-market performance across a\r\n                      diverse portfolio. Earlier, during his 8+ year stint with\r\n                      Marriott International, he played an instrumental role in\r\n                      shaping the revenue strategy for North India, having\r\n                      worked across multiple leadership roles and markets. His\r\n                      career arc spans everything from front-office operations\r\n                      to leading commercial strategy for multi-brand portfolios.\r\n                      His journey reflects deep expertise, innovation, and a\r\n                      forward-forward approach to hospitality. Rajiv Tyagi Vice President – Finance Rajiv is a commerce graduate from the University of Delhi.\r\n                      During a career spanning over 25 years, he has worked with\r\n                      ITC Hotels and Taj Hotels, prior to joining Lemon Tree\r\n                      Hotels. He was previously the Assistant Vice President -\r\n                      Finance, of Lemon Tree Hotels. Naresh Kumar Vice President – Materials Naresh is a postgraduate in Commerce from the University\r\n                      of Shimla, Himachal Pradesh. During a career spanning more\r\n                      than 25 years, he has worked with Grand Hyatt, Park Royal,\r\n                      Imperial Hotel and Shangri-la Hotel. He has worked with\r\n                      Lemon Tree Hotels since 2007 in the Purchase Department.\r\n                      His last assignment was Assistance Purchase Manager at\r\n                      Shangri-la Hotel. Geeta Jetley Vice President – Operations Geeta Jetley is an alumna of the Oberoi Centre for\r\n                      Learning and Development and has spent over 25 years\r\n                      working in the hotel business in India and overseas.\r\n                      Before joining Lemon Tree Hotels in a leadership role at\r\n                      Carnation Hotels (the management subsidiary of Lemon Tree\r\n                      Hotels), Geeta headed operations for Wyndham Hotels in\r\n                      India. She has been associated with Oberoi Hotels and\r\n                      Resorts as well as Starwood Hotels and Resorts, and has\r\n                      extensive experience in hotel openings and re-brands. As a\r\n                      part of Carnation Hotels, Geeta has driven the asset light\r\n                      growth strategy of the company. Mayank Sharma Vice President - Finance Mayank is a Member of the Institute of Chartered\r\n                      Accountants of India. He also holds a Bachelor's degree in\r\n                      Commerce from Delhi University. He has been associated\r\n                      with Lemon Tree Hotels since 2012 and is a key member of\r\n                      finance team with excellent analytical skills and results\r\n                      driven attitude. Prior to joining Lemon Tree Hotels, he\r\n                      was working with the assurance arm of Ernst & Young. Pooch Policy - Canines (K9) We love dogs, which is why we have adopted a street dog across\r\n                  almost all of our 100+ hotels. We name the dog, inoculate it\r\n                  and feed it well. Watch the video for a typical day in the\r\n                  life of a K9 at Lemon Tree Hotels. Enjoy! Youtube Video Artificer Polytechnus Keswani aka Street Arthur Assistant Manager, Chairman’s Office Lemon Tree Hotels Artificer, who was earlier serving as Executive Assistant\r\n                      to the Vice Chairdog, has been elevated to the position of\r\n                      Assistant Manager, Chairman’s Office with immediate\r\n                      effect, on account of the sad demise of Sparky Keswani\r\n                      (who was also our Company Mascot) on 1st August, 2017.\r\n                      Artificer, will be personally inducted into his new role\r\n                      by the Chairman himself, as he steps into the illustrious\r\n                      paw-th of his predecessor. Knotty aka Not-Yet-A-Tree Associate, K9 squad Knotty, a honey blonde Indian dog, thrives at the Lemon\r\n                      Tree Hotel, Ahmedabad. The alcohol-free, mostly vegetarian\r\n                      environment of the city appears to suit his spiritual\r\n                      nature, demonstrated by his deep desire to meditate for\r\n                      prolonged periods, in absolute silence. Curious guests may\r\n                      however spot him vociferously loitering just outside the\r\n                      coffee shop kitchen at lunch time only (1 pm to 2 pm,\r\n                      daily). Potty aka Pot Tree Training Associate Pot Tree, a male dog, resides at the Lemon Tree Hotel,\r\n                      Aurangabad. His aimless (to the ignorant) scampering\r\n                      fueled by his incredibly high metabolism has led to a\r\n                      prophetic nickname. Due to his swift intake, speedy\r\n                      throughput and copious output, Potty represents our core\r\n                      value of \"Excellence\". S'Paw Spouse of Potty S'Paw, a female dog, cohabits with Potty in the sylvan\r\n                      surrounds of the Lemon Tree Hotel, Aurangabad. A confident\r\n                      and affectionate dog, s'Paw can normally be found\r\n                      gamboling in the front lawns of the hotel or hanging about\r\n                      near the greenhouse in the backyard. Ouch Associate, K9 Squad Ouch, a white Indian dog of male persuasion, lives in the\r\n                      Lemon Tree Hotel, Chandigarh. With his charming yet\r\n                      playful nature and propensity to jump in and out of nearby\r\n                      bushes, he has already acquired a female fan following in\r\n                      the neighborhood. S'leepee Canine Resource Associate, K9 squad S'leepee, a multi-hued Indian dog, resides at the south\r\n                      east corner of the Lemon Tree Hotel, Chennai. An ascetic\r\n                      by inclination, S'leepee prefers a simple meal of curd\r\n                      rice or on Sundays, idli and coconut chutney. Byte Associate, K9 Squad Byte, a silky tan and white female dog lives in the\r\n                      basement of the Lemon Tree Hotel, Electronics City,\r\n                      Bengaluru. Her focus on 3 principles: eat, love and play\r\n                      symbolizes Lemon Tree Hotels yearning for simplicity. Nip'n'run aka Nipper Accounts Associate, K9 squad Nipper a brainy blonde male dog, resides at the south west\r\n                      corner of Lemon Tree Hotel, Indore, adjoining the staff\r\n                      entrance gate. Nipper would embody our core value of\r\n                      \"Inquisitiveness\", had we such a value. Lottery aka Lot Tree Associate, K9 squad Lot Tree, a black and white female dog of indeterminate\r\n                      origin, frisks around the Lemon Tree Hotel, UdyogVihar,\r\n                      Gurgaon. As far as we can tell, her skill set indicates a\r\n                      marked preference for games-of-chance and somnolence.\r\n                      Lottery embodies our core value of 'Fun'. Snippy aka Snippet-Of-A-Tree Associate, K9 squad Snippy, a richly bewhiskered chocolate brown dog presently\r\n                      frolics at the Lemon Tree Vembanad Lake Resort, Alleppey,\r\n                      Kerala. Snippy may symbolize our core value of 'Integrity'\r\n                      as she never shirks any of her self-assigned duties, no\r\n                      matter how inscrutable these may appear to be. Tommy aka Tom Tree Top Dog, Guest Protection Services, Pune Region Tom Tree, a male tan and white Indian dog, is located at\r\n                      the Lemon Tree Hotel, Hinjawadi, Pune. Tom Tree embodies\r\n                      our core value of \"Respect and Concern for others\" and is\r\n                      responsible for guarding. Update: Subsequent to his\r\n                      confirmation and assurance of a steady job at the hotel,\r\n                      Tommy has started a family. Lemon Tree is delighted to\r\n                      introduce these three new additions to the group: Tic, Tac\r\n                      and Toe. Lemo Deputy Associate In keeping with our mantra to reduce bureaucracy, Lemo has\r\n                      been hired as Deputy Assistant Associate to the Assistant\r\n                      Deputy Manager reporting to the Executive Assistant to the\r\n                      Chairman. His purview is to make management lean. Blotch Horticulture Associate Blotch, a white, tan and brown Indian dog lives in the\r\n                      Rock Garden of the Lemon Tree Premier, HITEC City,\r\n                      Hyderabad. In spite of the natural camouflage offered by\r\n                      his coat, he may occasionally be glimpsed from guest rooms\r\n                      facing the South West. Foxy Foxy, a black and beige pup resides in Red Fox Hotel, East\r\n                      Delhi and can often be spotted at the perimeter of the\r\n                      hotel slightly recumbent. Having acquired a gourmet’s\r\n                      taste for bread, she now enjoys a position among the ranks\r\n                      (and hearts) of the neighborhood bakers. Pixy Pixy is an angelic white dog with gentle eyes who lives in\r\n                      Red Fox Hotel, Jaipur. Playful by nature, she is\r\n                      frequently seen bouncing outdoors with sudden bursts of\r\n                      inexplicable intensity. Roxy Training Associate Roxy is the cutest kid on the block. This cuddly beige\r\n                      ball of joy is often seen basking in the sun and rolling\r\n                      around in the lush green grass of Red Fox Hotel,\r\n                      Hyderabad’s Heritage Garden. With the classiest bowtie\r\n                      around, this bonny hound is the apple of everyone’s eye. Snuggles aka Eat Tree K9 Squad Snuggles, a black and white Indian dog resides in the\r\n                      Lemon Tree Premier at St. Johns road, Bengaluru. Snuggles\r\n                      seems to like snuggling and cuddling. Pointy Assistant Administrative Officer Pointy, a beige Indian dog of female gender resides all\r\n                      over the Lemon Tree Hotel, Shimona, Chennai. Her name is\r\n                      derived from her ability to always face North, no matter\r\n                      what the temptation to turn elsewhere. Geek Customer Analytics Specialist Geek, a yellow Labrador Retriever typically lounges within\r\n                      a 14.35 meter radius of the coffee shop kitchen. His\r\n                      ability to collect, analyse and review customer behaviour\r\n                      helps the hotel to anticipate the changing needs of\r\n                      customers and deliver guest delight. Battery a.k.a Bat Tree K9 security squad Battery a.k.a Bat Tree is an Indian male dog who generally\r\n                      resides in the North West quadrant of the Lemon Tree\r\n                      Hotel, Gachibowli, Hyderabad. His nocturnal habit of\r\n                      stealthy patrolling is greatly aided by his pitch black\r\n                      color. Queen Mala aka Ma’ lady Wellness Associate All dressed in charcoal grey and white, Queen Mala is as\r\n                      exquisite as her name. Perfectly sculptured and with deep\r\n                      pristine eyes, this charmer with a slightly husky bark,\r\n                      can be found engaging with the hotel staff as if to check\r\n                      on every ones well-being and health. Book Now Our Presence + HOTELS IN Agra HOTELS IN Ahmedabad HOTELS IN Aligarh HOTELS IN Alleppey HOTELS IN Alwar HOTELS IN Aurangabad HOTELS IN Baddi HOTELS IN Bandhavgarh HOTELS IN Banswara HOTELS IN Bengaluru HOTELS IN Bhiwadi HOTELS IN Bhopal HOTELS IN Bhubaneswar HOTELS IN Chandausi HOTELS IN Chandigarh HOTELS IN Chennai HOTELS IN Coimbatore HOTELS IN Corbett HOTELS IN Dapoli HOTELS IN Dehradun HOTELS IN Delhi HOTELS IN Dubai HOTELS IN Dwarka HOTELS IN Erode HOTELS IN Gangtok HOTELS IN Goa HOTELS IN Gurugram HOTELS IN Haridwar HOTELS IN Hisar HOTELS IN Hubli HOTELS IN Hyderabad HOTELS IN Indore HOTELS IN Jaipur HOTELS IN Jammu HOTELS IN Jamnagar HOTELS IN Jamshedpur HOTELS IN Jhansi HOTELS IN Kanha HOTELS IN Kasauli HOTELS IN Katra HOTELS IN Kochi HOTELS IN Kolkata HOTELS IN Kota HOTELS IN Kozhikode HOTELS IN Kufri HOTELS IN Kumbhalgarh HOTELS IN Lucknow HOTELS IN Ludhiana HOTELS IN Manesar HOTELS IN McLeodganj HOTELS IN Mukteshwar HOTELS IN Mumbai HOTELS IN Mussoorie HOTELS IN Nepal HOTELS IN Noida HOTELS IN Patna HOTELS IN Portblair HOTELS IN Pune HOTELS IN Rajkot HOTELS IN Rishikesh HOTELS IN Siliguri HOTELS IN Somnath HOTELS IN Sonmarg HOTELS IN Srinagar HOTELS IN Thekkady HOTELS IN Thimphu HOTELS IN Thiruvananthapuram HOTELS IN Tiruchirappalli HOTELS IN Udaipur HOTELS IN Vadodara HOTELS IN Vijayawada HOTELS IN Visakhapatnam Awards About us Careers Contact us Privacy Policy Blogs Day Use cookies Policy Non Affiliation Terms & Conditions Media Site Map Travel Guidelines Investor relations Nidhi utsav Saathi Loyalty Program Join our newsletter I agree to the privacy policy. Follow us ©2025 by Lemon Tree Hotels Ltd. All Rights Reserved. Restaurant Form × Submit Disclaimer × We are an alliance partner with the brand. This page directs you to our partner websites for offers listed on the brand. Lemon Tree Hotels Limited shall not be responsible for any malfunction, changes in the offers or unavailability of items on the directed sites. I agree Disclaimer × We are an alliance partner with the brand. This page directs you to our partner websites for offers listed on the brand. Lemon Tree Hotels Limited shall not be responsible for any malfunction, changes in the offers or unavailability of items on the directed sites. “Use the code lemonvital50 on the payment option page and enjoy the exclusive rate on the packages” I agree Aurika, Mumbai Skycity × × Explore More"
    },
    {
      "url": "https://www.lemontreehotels.com/lemon-tree-hotel/portblair/hotel-port-blair/contact-us",
      "text": "Get in touch with us - Lemon Tree Hotel Port Blair | Contact Address Lemon Tree Hotels accepts payments through UPI, net banking, debit, and credit card that are processed through Cashfree. Please confirm authenticity through the formal channels before acting. Beware of recent fraudulent activities that have been misusing the brand to ensure your protection. Home Destinations Offers & Promotions Rewards Program Our Brands Sustainability Main Menu Home Hotels Offers & Promotions Rewards Program Our Brands Sustainability Property Menu Book Now Sign In Join Sign In Book Now Menu Overview Offers Rooms Restaurants Events Facilities Gallery VR Tour Contact us Namaste Sign In Join Sign In Book Now Select your destination X 10 am to 5 pm Day Rooms Lemon Tree Hotel  Agra Keys Select by Lemon Tree Hotels  Gandhi Ashram  Ahmedabad Lemon Tree Premier  The Atrium  Ahmedabad Lemon Tree Hotel  Ahmedabad Lemon Tree Hotel  Aligarh Lemon Tree Vembanad Lake Resort  Alleppey Lemon Tree Hotel  Alwar Red Fox by Lemon Tree Hotels  Alwar Lemon Tree Hotel  Aurangabad Lemon Tree Hotel  Baddi Lemon Tree Wildlife Resort Bandhavgarh Keys Lite by Lemon Tree Hotels  Banswara Lemon Tree Premier  Ulsoor Lake  Bengaluru Keys Select By Lemon Tree Hotels  Hosur Road  Bengaluru Keys Select By Lemon Tree Hotels  Whitefield  Bengaluru Lemon Tree Hotel  Whitefield  Bengaluru Lemon Tree Hotel  Electronics City  Bengaluru Lemon Tree Suites  Whitefield  Bengaluru Red Fox by Lemon Tree Hotels  Bhiwadi Lemon Tree Hotel  Bhopal Lemon Tree Premier  Bhubaneswar Lemon Tree Hotel  Chandausi Lemon Tree Hotel  Chandigarh Lemon Tree Hotel  Shimona  Chennai Keys Prima by Lemon Tree Hotels  Katti-Ma  Chennai Lemon Tree Hotel  Chennai Lemon Tree Hotel  Coimbatore Lemon Tree Premier  Corbett Lemon Tree Hotel  Dapoli Keys Lite by Lemon Tree Hotels  Dapoli Lemon Tree Hotel  Dehradun Red Fox by Lemon Tree Hotels  Dehradun Lemon Tree Premier  Delhi Airport Red Fox by Lemon Tree Hotels  East Delhi Red Fox by Lemon Tree Hotels  Delhi Airport Lemon Tree Hotel  East Delhi Mall  Kaushambi Lemon Tree Hotel  Jumeirah  Dubai Lemon Tree Premier  Dwarka Lemon Tree Hotel  Erode Lemon Tree Hotel  Gangtok Lemon Tree Hotel  Candolim  Goa Lazy Lagoon  Baga - A Lemon Tree Resort  Goa Lemon Tree Amarante Beach Resort  Goa Lemon Tree Hotel  Anjuna  Goa Lemon Tree Hotel  Arpora  Goa Lemon Tree Hotel  Sector 68  Sohna Road  Gurugram Keys Lite By Lemon Tree Hotels  Mayfield  Gurugram Lemon Tree Premier-1  Leisure Valley  Gurugram Lemon Tree Premier-2  Leisure Valley  Gurugram Lemon Tree Premier  City Center  Gurugram Lemon Tree Hotel  Udyog Vihar  Gurugram Lemon Tree Hotel  Sector 60  Gurugram Red Fox by Lemon Tree Hotels  Sector 60  Gurugram Lemon Tree Hotel  Haridwar Lemon Tree Hotel  Hisar Lemon Tree Hotel  Hubli Lemon Tree Hotel  Gachibowli  Hyderabad Lemon Tree Hotel  Banjara Hills  Hyderabad Lemon Tree Premier  HITEC City  Hyderabad Red Fox by Lemon Tree Hotels  Hyderabad Lemon Tree Hotel  Indore Lemon Tree Premier  Jaipur Red Fox by Lemon Tree Hotels  Jaipur Lemon Tree Hotel  Jammu Lemon Tree Hotel  Jamnagar  Gujarat Lemon Tree Hotel Centre Point Jamshedpur Lemon Tree Hotel  Jhansi Lemon Tree Wildlife Resort  Kanha Lemon Tree Hotel  Kasauli Lemon Tree Hotel  Katra Keys Select By Lemon Tree Hotels  Kochi Lemon Tree Premier  New Town  Kolkata Keys Prima by Lemon Tree Hotels  Kota  Rajasthan Keys Select By Lemon Tree Hotels  Malabar Gate  Kozhikode Keys Select by Lemon Tree Hotels  Kufri  Himachal Pradesh Lemon Tree Resort  Kumbhalgarh Lemon Tree Hotel  Lucknow Keys Select By Lemon Tree Hotels  Ludhiana Lemon Tree Hotel  Tarudhan Valley Lemon Tree Hotel  McLeodganj Lemon Tree Hotel  Mukteshwar Lemon Tree Hotel  Kalina BKC   Mumbai Keys Select By Lemon Tree Hotels  Nestor  Mumbai Lemon Tree Premier  Mumbai International Airport Aurika  Mumbai International Airport Lemon Tree Premier  Malad  Mumbai Lemon Tree Hotel  Mira road  Mumbai Lemon Tree Resort  Mussoorie Lemon Tree Premier  Budhanilkantha  Kathmandu  Nepal Tigerland Safari - A Lemon Tree Resort  Chitwan  Nepal Sandal Suites  Operated by Lemon Tree Hotels  Noida Lemon Tree Hotel  Noida Lemon Tree Premier  Patna Lemon Tree Hotel  Port Blair Lemon Tree Premier  City Center  Pune Keys Prima by Lemon Tree Hotels  Pimpri Pune Lemon Tree Hotel  Viman Nagar  Pune Lemon Tree Hotel  Hinjawadi  Pune Lemon Tree Hotel  Chinchwad  Pune Lemon Tree Hotel  Rajkot Lemon Tree Premier  Rishikesh Lemon Tree Hotel  Rishikesh Lemon Tree Hotel  Siliguri Lemon Tree Resort  Somnath Lemon Tree Hotel  Sonmarg Lemon Tree Hotel  Srinagar Keys Prima by Lemon Tree Hotels  Thekkady Lemon Tree Hotel  Thimphu  Bhutan Lemon Tree Resort  Thimphu  Bhutan Keys Select By Lemon Tree Hotels  Thiruvananthapuram Red Fox by Lemon Tree Hotels  Tiruchirappalli Aurika  Udaipur - Luxury by Lemon Tree Hotels Keys Select by Lemon Tree Hotels  Udaipur Keys Lite by Lemon Tree Hotels  Urban Square  Udaipur Lemon Tree Hotel  Vadodara Keys Lite by Lemon Tree Hotels  Vadodara Red Fox by Lemon Tree Hotels  Vijayawada Lemon Tree Premier  Vijayawada Keys Lite By Lemon Tree Hotels  Sreekanya  Visakhapatnam Keys Select By Lemon Tree Hotels  Visakhapatnam Delhi Corbett Alwar Agra Goa Hyderabad Aurangabad Baddi Pune Bengaluru Chennai Lucknow Kolkata Patna Siliguri Gangtok Ludhiana Dehradun Rishikesh Vijayawada Srinagar Kochi Jhansi Aligarh Dwarka Bhubaneswar Portblair Neelkanth Mumbai Gurugram Mukteshwar Coimbatore Visakhapatnam Ahmedabad Katra Jammu Jaipur Manesar Bhiwadi Thekkady Alleppey Vadodara Thiruvananthapuram Tiruchirappalli Indore Bandhavgarh Dubai Coorg Noida Chandigarh Manali Thimphu Bhopal Kozhikode Udaipur Mussoorie Hubli Dapoli McLeodganj Sonmarg Rajkot Kumbhalgarh Haridwar Nepal BALAGHAT Hisar Kasauli Somnath Meerut Jamshedpur Kanha Kota Jamnagar Erode Banswara Kufri Chandausi Room 1 1 Adults, 0 Children Edit Remove Adult(s): - + Child (0-6 years): - + + Add Another Room Apply Book Now Home Destination Hotels Lemon Tree Hotel, Port Blair Contact Us Contact Us Address Opposite Airport exit gate, Lamba Line, Junglee Ghat, Port Blair - 744103, India Hotel Reception 7695072436 Central Reservation Centre +91 9911701701 Email hm.hpb@lemontreehotels.com Download Factsheet Things to do in Portblair Culture Naval Marine Museum Samudrika 3 km Kalapani Museum 5.8 km Health Care Chakraborty Hospital 2.5 km The Govind Ballabh Pant Hospital 3.9 km Landmark The Aaryan?s craft outlet 0.4 km Shopping Maurya Lok, Patna 1.6 km Aberdeen Bazar, Aberdeen 2.5 km Aaryan's Craftistics 2.6 km Book Now Our Presence + HOTELS IN Agra HOTELS IN Ahmedabad HOTELS IN Aligarh HOTELS IN Alleppey HOTELS IN Alwar HOTELS IN Aurangabad HOTELS IN Baddi HOTELS IN Bandhavgarh HOTELS IN Banswara HOTELS IN Bengaluru HOTELS IN Bhiwadi HOTELS IN Bhopal HOTELS IN Bhubaneswar HOTELS IN Chandausi HOTELS IN Chandigarh HOTELS IN Chennai HOTELS IN Coimbatore HOTELS IN Corbett HOTELS IN Dapoli HOTELS IN Dehradun HOTELS IN Delhi HOTELS IN Dubai HOTELS IN Dwarka HOTELS IN Erode HOTELS IN Gangtok HOTELS IN Goa HOTELS IN Gurugram HOTELS IN Haridwar HOTELS IN Hisar HOTELS IN Hubli HOTELS IN Hyderabad HOTELS IN Indore HOTELS IN Jaipur HOTELS IN Jammu HOTELS IN Jamnagar HOTELS IN Jamshedpur HOTELS IN Jhansi HOTELS IN Kanha HOTELS IN Kasauli HOTELS IN Katra HOTELS IN Kochi HOTELS IN Kolkata HOTELS IN Kota HOTELS IN Kozhikode HOTELS IN Kufri HOTELS IN Kumbhalgarh HOTELS IN Lucknow HOTELS IN Ludhiana HOTELS IN Manesar HOTELS IN McLeodganj HOTELS IN Mukteshwar HOTELS IN Mumbai HOTELS IN Mussoorie HOTELS IN Nepal HOTELS IN Noida HOTELS IN Patna HOTELS IN Portblair HOTELS IN Pune HOTELS IN Rajkot HOTELS IN Rishikesh HOTELS IN Siliguri HOTELS IN Somnath HOTELS IN Sonmarg HOTELS IN Srinagar HOTELS IN Thekkady HOTELS IN Thimphu HOTELS IN Thiruvananthapuram HOTELS IN Tiruchirappalli HOTELS IN Udaipur HOTELS IN Vadodara HOTELS IN Vijayawada HOTELS IN Visakhapatnam Awards About us Careers Contact us Privacy Policy Blogs Day Use cookies Policy Non Affiliation Terms & Conditions Media Site Map Travel Guidelines Investor relations Nidhi utsav Saathi Loyalty Program Join our newsletter I agree to the privacy policy. Follow us ©2025 by Lemon Tree Hotels Ltd. All Rights Reserved. Restaurant Form × Submit Disclaimer × We are an alliance partner with the brand. This page directs you to our partner websites for offers listed on the brand. Lemon Tree Hotels Limited shall not be responsible for any malfunction, changes in the offers or unavailability of items on the directed sites. I agree Disclaimer × We are an alliance partner with the brand. This page directs you to our partner websites for offers listed on the brand. Lemon Tree Hotels Limited shall not be responsible for any malfunction, changes in the offers or unavailability of items on the directed sites. “Use the code lemonvital50 on the payment option page and enjoy the exclusive rate on the packages” I agree Aurika, Mumbai Skycity × × Explore More"
    }
  ]
}