{
  "fuentes": [
    {
      "url": "https://historiccoastculture.com/organization/limelight-theatre/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/organization/limelight-theatre/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.limelighttheatrecompany.org/about/",
      "email": "info@oswegolandpd.org"
    }
  ],
  "mails": [
    "info@oswegolandpd.org",
    "sjcc@historiccoastculture.com",
    "x@2x.png"
  ],
  "nombre_sitio": "limelight-theatre.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://historiccoastculture.com/organization/limelight-theatre/",
      "text": "Limelight Theatre - HistoricCoastCulture.com Limelight Theatre - HistoricCoastCulture.com English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 SEARCH Advanced Filters Home Organization Limelight Theatre Facebook Twitter Linkedin Print Limelight Theatre Co-founded by Anne Kraft and Jean Rahner, the Limelight Theatre staged its first production, I Ought To Be in Pictures , on August 28, 1992, in the Monson Bayfront Inn. It provided entertainment at this location for almost two years. In 1994, the Theatre achieved not-for-profit status as a 501(c)3 organization, and it continued to offer productions for a number of years at a wide variety of local venues, including the Art Association, churches, the St. Augustine Amphitheatre, Marineland, Flagler College and a small rented building on U.S. Highway 1. In 2001, through a generous grant from the Joukowsky Family Foundation, the Limelight purchased a 10,000 square foot building at 11 Old Mission Avenue, converted it to a 125- seat theater and moved into its first permanent home. Proudly celebrating over 20 years in the community, the Limelight Theatre has produced well over one hundred different shows in its history, from classics to new works, tragedies to musical comedies. The working Board of Directors, Advisory Board and Limelight Theatre Guild continue to improve and help the theatre to flourish. Attendance has continued to grow, and today the Theatre is widely respected as one of North Florida’s top cultural organizations. Co-founded by Anne Kraft and Jean Rahner, the Limelight Theatre staged its first production, I Ought To Be in Pictures , on August 28, 1992, in the Monson Bayfront Inn. It provided entertainment at this location for almost two years. In 1994, the Theatre achieved not-for-profit status as a 501(c)3 organization, and it continued to offer productions for a number of years at a wide variety of local venues, including the Art Association, churches, the St. Augustine Amphitheatre, Marineland, Flagler College and a small rented building on U.S. Highway 1. In 2001, through a generous grant from the Joukowsky Family Foundation, the Limelight purchased a 10,000 square foot building at 11 Old Mission Avenue, converted it to a 125- seat theater and moved into its first permanent home. Proudly celebrating over 20 years in the community, the Limelight Theatre has produced well over one hundred different shows in its history, from classics to new works, tragedies to musical comedies. The working Board of Directors, Advisory Board and Limelight Theatre Guild continue to improve and help the theatre to flourish. Attendance has continued to grow, and today the Theatre is widely respected as one of North Florida’s top cultural organizations. View less Subscribe You may subscribe to a feed of events for either the organization presenting this event or to this website's entire calendar of events. Note that this subscription only includes 3 months of current and upcoming events at any given time. This Organization Entire Calendar SUBSCRIBE TO GOOGLE CALENDAR SUBSCRIBE TO ICAL/OUTLOOK CALENDAR MORE ABOUT THIS ORGANIZATION Organization Type: Theatre UPCOMING EVENTS PAST EVENTS Nunsense Presented by Limelight Theatre at Limelight Theatre Sep 11 - Oct 5, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION Our Town Presented by Limelight Theatre at Limelight Theatre Oct 23 - Nov 9, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION Annie Presented by Limelight Theatre at Limelight Theatre Dec 4 - Dec 21, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION I Love You, You're Perfect, Now Change Presented by Limelight Theatre at Limelight Theatre Jan 29 - Feb 15, 2026 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION God of Carnage Presented by Limelight Theatre at Limelight Theatre Mar 5 - Mar 15, 2026 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION SHOW MORE Hairspray Presented by Limelight Theatre at Limelight Theatre Jul 17 - Aug 10, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION Spamalot Young@Part Presented by Limelight Theatre at Limelight Theatre Jun 27 - Jun 29, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION Kaleidoscope June 2025 Presented by Limelight Theatre at Limelight Theatre Jun 29, 2025 Accessibility Info Facebook Twitter Linkedin Six: Teen Edition Presented by Limelight Theatre at Limelight Theatre Jun 27 - Jun 29, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION Rhinoceros Presented by Limelight Theatre at Limelight Theatre May 30 - Jun 15, 2025 Accessibility Info Facebook Twitter Linkedin TICKETS / REGISTRATION SHOW MORE Contact information Email / Website / Facebook / Twitter / Donate / Primary address: 11 Old Mission Ave., St. Augustine, FL 32084 904.825.1164 Find An Organization Search by Keyword Organization Type Association/Club/Group Commercial Business Corporation Dance Educational Environmental Faith Based/Religious Festivals Film/Video Food/Drink Foundation Gallery/Museum Gift Shop Government History/Heritage Kids/Family Library Literature/Poetry Lodging Media Music Nonprofit Performing Arts Retail Sports/Outdoor Theatre Tours Traditional Arts Travel Visual Arts State / Province FL City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Zip/Postal Code 32004 32033 32080 32081 32082 32084 32085 32086 32092 32095 32135 32137 32142 32145 32164 32259 Featured Organizations EMMA Concert Association Presenting beautiful music in beautiful St. Augustine at the Lewis Auditorium at Flagler College! EMMA’s mission is to offer quality music and dance performances by national and international artists. They also aim to encourage interest in classical music and to provide opportunities for the youth of St. Johns County. EMMA accomplishes this by offering school concerts in local schools and funding requests from music teachers for instruments and equipment. Historic Florida Militia The Historic Florida Militia (HFM) is a non-profit umbrella organization supporting re-created historic interpretive units and representing a number of cultures and time periods. \"We are not street performers, we are educators. We are not parades, we are historic programs. This is not an exercise in free speech, this is an opportunity to educate. We are not promoting a political agenda, we are promoting the city's history through a practical and factual teaching method\". Crisp-Ellert Art Museum at Flagler College Built in honor of Dr. JoAnn Crisp-Ellert and her husband, Dr. Robert Ellert, the Crisp-Ellert Art Museum offers Flagler College students and the Northeast Florida community a venue for fostering knowledge and a deep appreciation of contemporary art. As an educational resource for the College, the Museum exhibits regional, national and international artists, and provides opportunities for critical engagement and exposure to a variety of exhibitions and personal interactions with visiting artists. The Museum challenges students, the Flagler community and the public to cultivate individual creativity, critical reflection, historical consciousness and respect for the free exchange of ideas. In this spirit, the Museum also hosts public programs, including artist talks, readings, panel discussions and film series that provide a platform for vital interdisciplinary dialogue. DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.limelighttheatrecompany.org/about/",
      "text": "About the Limelight Theatre Company - The Limelight Theatre Company Facebook YouTube Flickr Buy Tickets Plays & Events Show Menu Close Menu Radio Play Series Main Stage Plays Get Involved Show Menu Close Menu Classes Auditions Volunteers Donate About Us Show Menu Close Menu Staff Mission Production History Oswegoland Park District Theatre Company Facebook YouTube Flickr Show Search Bar Search Go Buy Tickets Search Go Menu Plays & Events Radio Play Series Main Stage Plays Get Involved Classes Auditions Volunteers Donate About Us Staff Mission Production History About the Limelight Theatre Company Limelight is the theatre company for the Oswegoland Park District. We offer theatrical experiences for participants ranging from kindergarten through high school, college, and beyond. We serve several communities in the Fox Valley area, including Oswego, Montgomery, Yorkville, Plainfield, Aurora, and Naperville. We offer a wide range of opportunities including productions (full-length, one-acts, radio dramas, and more), and skill-based classes and workshops throughout the year. The process that we go through as we teach, learn, create, and share is just as important as the final product. When you grow and improve with each class or production, it is very easy to have an end product/production that you can be proud of. Over the years we have added numerous directors, designers, and volunteers to our ever-expanding company, but as our numbers grow, so does the variety and depth of our productions, in order to allow participants the greatest possible role in creating a show. Above all, Limelight is a family, and whether you are a young newcomer or a wise veteran of many years, everyone is welcome. Mission: To teach, to learn, to create, and to share through theatre Philosophy: The Limelight Theatre Company follows five simple rules when working creatively: 1) Be Original- Limelight has always stressed the importance of story, and the value of creating original works as a team. Since our inception, we have produced at least one original production or adaptation per year. These works have been penned by staff members and participants, alike. Inspiration for some of our most beloved shows and moments has come from a box of flannel shirts, a love of The Godfather, the current socioeconomic climate, and a zombie slaying Ronald Regan. Original productions allow us to celebrate and encourage the ideas and creative contributions of the dreamers and the writers in our company, in addition to the talented actors, designers, and crew members. As a company, producing original works gives us endless creative freedom. Our writers get to set the stage and see their words brought to life. Our actors get to create roles and be the first ones to ever perform them. Our designers get to imagine and create places that have never been on the stage before. We get to collaborate on something that is truly unique and truly ours. 2) Be Gracious- We try to follow the golden rule and play well with others. Someone who is gracious is characterized by charm, good taste, kindness, and generosity of spirit. That is the kind of artist and person that we want to work with. 3) Be “We”- We are firm believers that theatre is about collaboration, not competition. We work together to accomplish things that none of us could do alone. The actor is no more important than the person running the light board or moving the set. The veteran and the newcomer are both expected to work their hardest, and do their best. We encourage everyone to help out in any way that they can and support each other on stage and off. Our challenges are faced as a team, and our successes are shared as a family. 4) Be Bold- In Limelight, we encourage big, bold choices. We want each person to step outside their comfort zone. We work to help our Limelighters develop confidence. Take ownership, invest yourself in your work. You get out what you put in. 5) Be Challenging- Like the characters in the stories that we love to tell, our actors and crew always rise to meet the challenge of difficult material. The challenge could lie in the text itself. We have never been shy of tackling Shakespeare or classic literature. The challenge may lie in the casting. We will not always cast an actor in the role that we know that she can play, because we would rather see her dig into a role that makes her work to explore a different type of character or employ different skills and abilities. We also choose to challenge our audiences with many different styles of productions and subject matter. Official Limemight Motto: Where Everyone Plays a Part Original Limelight Motto: Do-it-Yourself Theatre. A Very Brief History The Limelight Theatre Company was founded in the summer of 2000 by Artistic Director Brian Fauth. Borne out of a need in the Oswego community for a quality and diverse youth theatre program, Limelight has grown from a dozen middle-school children writing their own plays to a larger organization involving over a hundred participants of all ages tapping into their creativity and sharing it. Send me information about... Plays & classes I can be in Performances I can go see Email Address * Sign Up 313 E. Washington St. Oswego, \n                                            IL \n                                            60543 Phone: 630-554-1010 Email Us The limelight theatre company is owned and operated by the oswegoland park district © Copyright 2025 The Limelight Theatre Company All Rights Reserved"
    }
  ]
}