{
  "fuentes": [
    {
      "url": "https://www.snapchat.com/place/limn-rooftop-bar/3dbc0f7e-761c-11ee-a75e-478cab4d3c63",
      "email": "nightclub_glyph_dark@2x.png"
    },
    {
      "url": "https://www.snapchat.com/place/limn-rooftop-bar/3dbc0f7e-761c-11ee-a75e-478cab4d3c63",
      "email": "restaurant_glyph_dark@2x.png"
    },
    {
      "url": "https://augusthomegroup.com/elevate-your-dining-experience-at-limon-rooftop-bar-in-naples/",
      "email": "20group@2x.png"
    },
    {
      "url": "https://www.giftly.com/gift-card/lim%C3%B3n-rooftop-bar-naples-2",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/lim%C3%B3n-rooftop-bar-naples-2",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://barlimon.co.uk/contact-us/",
      "email": "alf@freshcom.co.uk"
    },
    {
      "url": "https://www.limonrooftop.com/events",
      "email": "kimberly.hilty@marriott.com"
    },
    {
      "url": "https://linarooftop.com.au/contact/",
      "email": "reservations@linarooftop.com.au"
    },
    {
      "url": "https://www.sabinelondon.co.uk/contact-us/",
      "email": "sabine@sohocommunications.co.uk"
    },
    {
      "url": "https://www.sabinelondon.co.uk/contact-us/",
      "email": "sabinestpauls@leonardohotels.co.uk"
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-vienna/limon.html",
      "email": "restaurant@cucinalimon.com"
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-lisbon/limao-rooftop-bar.html",
      "email": "h10.duque.deloule@h10hotels.com"
    },
    {
      "url": "https://blockclubchicago.org/2025/06/16/chicagos-ultimate-2025-rooftop-guide-70-open-air-bars-lounges-and-restaurants/",
      "email": "newsroom@blockclubchi.org"
    },
    {
      "url": "https://www.thelexingtonbar.co.uk/contact/",
      "email": "48406743_269851506970524_4076521346610233344_o-3@2x-2000x800.png"
    }
  ],
  "mails": [
    "20group@2x.png",
    "48406743_269851506970524_4076521346610233344_o-3@2x-2000x800.png",
    "alf@freshcom.co.uk",
    "corporate@giftly.com",
    "h10.duque.deloule@h10hotels.com",
    "kimberly.hilty@marriott.com",
    "merchants@giftly.com",
    "newsroom@blockclubchi.org",
    "nightclub_glyph_dark@2x.png",
    "reservations@linarooftop.com.au",
    "restaurant@cucinalimon.com",
    "restaurant_glyph_dark@2x.png",
    "sabine@sohocommunications.co.uk",
    "sabinestpauls@leonardohotels.co.uk"
  ],
  "nombre_sitio": "limonrooftop.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.snapchat.com/place/limn-rooftop-bar/3dbc0f7e-761c-11ee-a75e-478cab4d3c63",
      "text": "Limón Rooftop Bar Features Stories Spotlight Lenses Accounts Snapchat Plus Support Ads Download Cookie Policy Privacy Policy Consumer Health Privacy Privacy and Safety Your Privacy Choices Language العَرَبِية বাংলা(বাংলাদেশ) বাংলা (ভারত) Dansk Deutsch Ελληνικά English (UK) English (US) Español Español (Argentine) Español (España) Español (México) Suomi Filipino Français ગુજરાતી हिंदी Bahasa Indonesia Italiano 日本語 ಕನ್ನಡ (India) 한국어 മലയാളം मराठी Bahasa Melayu Norsk Nederlands ਪੰਜਾਬੀ Polski Português (Brasil) Português (Portugal) Română Русский Svenska தமிழ் తెలుగు ภาษาไทย (ประเทศไทย) Türkçe اردو Tiếng Việt 中文（简体） 中文（繁體） Explore More Sites Business For Business Ads Manager Snap Publisher Business Support Public Profiles for Business Snap AR Business Lens Studio Lens Web Builder Camera Kit Pixy Shop Pixy Pixy Support Snap Inc. Snap Inc. Investors Careers News Safety & Impact CitizenSnap Bitmoji Creators Creator Hub Post to Spotlight Developers For Developers PlayCanvas Marketing API Spectacles Spectacles Creators Spectacles Support Watch Snapchat Stories Historias Watch Snapchat Spotlight videos Spotlight Try the new Snapchat on web to chat Chatear Try out Lenses and Filters on Snapchat Lentes Try out Snapchat+ Snapchat+ Snapchat.com Resumen Cuentas Snapchat+ Ayuda Privacidad y seguridad Tus opciones de privacidad Privacidad de la salud de los consumidores Empresa Para empresas Administrador de anuncios Ayuda a empresas Snap AR Lens Studio Creador Para creadores Desarrolladores Para desarrolladores Playcanvas Spectacles Resumen Creador Spectacles Ayuda Descargar United States / Florida / Naples / Ac Hotel Naples 5th Avenue / Limón Rooftop Bar Limón Rooftop Bar $$ $ 40 calificaciones 🥰 Date Night Historias tyesun 6/21/2025 keelin 🖤 3/27/2025 Jennifer Abate-Bonetti 1/13/2025 Anthony DeMarino 10/15/2024 5/31/2024 Cora Bora 4/26/2024 Stephanie ❤️‍🔥 2/3/2024 Stephanie ❤️‍🔥 2/3/2024 Laura Altitonante 12/31/2023 Laura Altitonante 12/31/2023 Jesse FL Real Estate Broker 12/29/2023 Jesse FL Real Estate Broker 12/29/2023 Laura Altitonante 12/20/2023 Dirección 455 12th St S, Naples, Florida Copiar enlace Sitio web limonrooftop.com Llamar (239) 944-3755 Copiar enlace Reseñas Tripadvisor 09/06/2025 Had an amazing time at Limon Rooftop Bar in Naples, and I have to say—Daniel is hands down the best bartender I've had in a long time! From the moment we sat down, he made us feel right at home. Not only did he mix up some of the best cocktails we’ve... Tripadvisor 08/21/2025 We had a wonderful breakfast with Kenny and a wonderful dinner with Andres . Highly recommend this hotel ! It is so clean and the food /drinks amazing !!!! Tripadvisor 08/20/2025 Great food and wonderful experience. Noel and Aaron went out of their way to make us feel welcome and special. \nAC is now our “go to” hotel in Naples. Tripadvisor 08/17/2025 Had a great breakfast, and our server Jenica was efficient and very pleasant! \nThe rooftop pool is right next to the bar as well. Tripadvisor 08/10/2025 Booked a last minute weekend trip with the family.  Stayed at the AC Marriott 5th Ave. The hotel was just what we needed.  Clean, updated & very comfortable. Had breakfast at Limon one morning.  We tried the open face toast & cazuela, both were very... You May Also Like Sidebar Bar Abierto ahora chris🤍 5/31/2025 Blue Martini Lounge $$ $ Cerrado 9/7/2025 Justin 8/31/2025 Tyten Larsen 7/5/2025 Ladybarber239 Sager 5/15/2025 Ladybarber239 Sager 5/15/2025 Dave C ☀️ 12/29/2024 Eren 🇹🇷🇺🇸 12/1/2024 Eren 🇹🇷🇺🇸 11/24/2024 Eren 🇹🇷🇺🇸 11/24/2024 Cora Bora 4/27/2024 It’s Not Me♑ 4/2/2024 Nancy 🤍 3/16/2024 3/11/2024 Cora Bora 2/25/2024 Cora Bora 2/25/2024 1/21/2024 Doug Leto 1/6/2024 🖤 12/24/2023 🖤 12/24/2023 Daddy 12/23/2023 Daddy 12/23/2023 Daddy 12/23/2023 North Naples Country Club Bar $ $$ Abierto ahora Jacque Wood 8/31/2025 Jacque Wood 8/28/2025 Trista Lane 7/24/2025 Trista Lane 7/24/2025 Trista Lane 7/24/2025 Trista Lane 7/24/2025 Trista Lane 7/24/2025 Trista Lane 7/24/2025 Ladybarber239 Sager 4/28/2025 Ladybarber239 Sager 4/28/2025 Ladybarber239 Sager 4/28/2025 Ladybarber239 Sager 4/28/2025 Ladybarber239 Sager 4/28/2025 Ladybarber239 Sager 4/28/2025 Ladybarber239 Sager 4/28/2025 Ladybarber239 Sager 4/28/2025 Devan 4/27/2025 Trista Lane 1/30/2025 Trista Lane 1/30/2025 Trista Lane 1/30/2025 10/19/2024 District Naples Cocktail Bar Dora Gallegos, DR Horton 7/18/2025 Johnnie💋 4/30/2025 A 4/27/2025 A 4/27/2025 Mario Walguarnery 2/7/2025 11/3/2024 Alex 💕 10/29/2024 Mel 9/14/2024 Mel 7/13/2024 Midnight Tavern Bar $$ $ Abierto ahora Tabitheena 3/5/2025 Tabitheena 3/5/2025 2/17/2025 T_CHUCK 12/9/2024 T_CHUCK 12/9/2024 T_CHUCK 12/9/2024 T_CHUCK 12/9/2024"
    },
    {
      "url": "https://augusthomegroup.com/elevate-your-dining-experience-at-limon-rooftop-bar-in-naples/",
      "text": "Lofty Solution Suite Skip to content Chime is now Lofty! Click here to Learn More Who We Help For Agents Automate your marketing programs, capture and convert more leads\n              into deals. For Teams Streamline your sales process, maximize collaboration, and\n              increase sales volume. For Brokers Boost agent productivity, lower operating costs, and accelerate\n              profitable growth. Solutions Lead Generation Lofty offers more than 33 different ways to generate real estate\n                leads. Platform Our award-winning, AI-powered platform for real estate\n                professionals. Lofty AI Put your business growth on auto-pilot with Lofty AI. 360° Marketing Boost advertising performance with targeted cross-platform\n                  marketing campaigns. Brand Advertising Establish and grow your market presence with high-impact brand\n                  awareness campaigns. Google PPC Target a high-volume, high-intent audience with Google Search\n                  PPC. Direct Mail Maximize brand awareness and dominate your local market with\n                  targeted direct mailers. Google LSA Capture local leads on a pay-per-lead basis (PPL) with\n                  Google’s local search ads. Lofty Bloom Fully automated, hyper-local lead generation with zip code exclusivity. Real Estate CRM Powered by AI, our Smart CRM is designed to identify and\n                  develop sales opportunities. Power Dialer Easily scale outbound communications to your leads, team\n                  members, and loyal customers. Agent Websites #1 Rated, SEO optimized, stunning IDX websites for real estate\n                  professionals. WordPress IDX Plugin Lofty’s IDX Plugin provides a seamless integration between\n                  WordPress websites and our award-winning AI-powered platform. Social Studio Put social on autopilot with a fully automated social media\n                  marketing tool. Transaction Management Streamline transactions from start to finish with paperless\n                  tools, and a full reporting suite. Mobile Apps All the power of our award-winning platform in the palm of\n                  your hand. Closely App Deliver an elevated, mobile-optimized home search experience\n                  for your customers. Overview Flexible and scalable AI solutions that save time and boost\n                  productivity. AI Copilot Streamline daily business operations and maximize\n                  productivity. AI Sales Essentials Your very own virtual ISA, working 24/7 to capture and convert more leads into appointments. Resources Blog Stay informed with the latest on real estate technology, growth\n              strategies, marketing, and more. Success Stories Hear directly from top real estate teams and brokers who have\n              found success with Lofty. Lofty Legends Each year we recognize customers who have best leveraged the Lofty\n              Platform to grow their business! Lofty LIVE Training Customers have access to over 50 LIVE training sessions a week. Partners Customer Referrals Lofty customers can earn up to $1000 in instant rewards for every\n              successful referral. Marketplace Integrations Join us in bringing value to a community of over 70,000 tech-savvy\n              real estate professionals. Company About The Lofty origin story. Mission The vision, mission, and values that guide us. Leadership Based in Phoenix, AZ our team is committed to driving customer\n              success. Chime to Lofty What’s new? What’s different? What’s next? News Stay up to date with Lofty company news. Sign In Request a Demo Interested in Lofty? Try now! Login Request a Demo Email My Account Logout Close More Deals Faster With Mobile With Lofty, the award-winning, AI-powered platform for real estate\n      professionals. Take Me To App Close More Deals Faster With Lofty, the\n                      award-winning, AI-powered platform for real estate\n                      professionals. Let's Go! Put your Business Growth on\n                      Auto-Pilot with Lofty AI Get more appointments and\n                      more listings with less effort. It's that simple. Let's Go! For Agents To automate your marketing programs,\n          capture and convert more leads into transactions. Learn More For Teams To streamline your sales process, maximize\n          collaboration, and close more team deals. Learn More For Brokers To accelerate profitable growth by\n          boosting agent productivity and lowering operational costs. Learn More The Lofty Platform Rated #1 for \"Ease-of-Use\",\n        Lofty is the all-in-one platform that real estate professionals love!\n        Automate marketing campaigns, boost your brand awareness, capture and\n        convert more leads, all in ONE intuitive platform. Request a Demo Lofty Features Customers Love With innovative features like Social Studio, AI\n      Assistant, Dynamic CMA, Video Messaging, and more, Lofty customers have a\n      competitive edge, empowering them to capture and convert more leads into\n      transactions. Agent Websites Intelligent IDX that attracts and\n                captures more leads. Smart CRM AI-Powered to maximize efficiency and keep you in front of your clients. Lead Generation 360° Marketing programs combine\n                multiple ad channels to maximize your ROI. Social Media Marketing Automatically generate posts from\n                your listings, landing pages, and blogs. Marketing Automation “Smart Plans” nurture leads to\n                maximize conversion and uncover new opportunities. Dynamic CMA Win the listing with a\n                custom-branded and interactive CMA. Lofty AI\n        Features ☎️ AI Copilot Meet your new real estate\n      partner, and soon to be best friend! Lofty AI Copilot works 24/7 to\n      streamline daily business operations and maximize agent productivity. 💰 AI\n      Sales Essentials Multi-talented and hard-working, Sales\n      Assistant is the ISA you’ve always dreamed of! From lead capture and\n      qualification to appointment setting and call screening, Sales Assistant\n      does it all. 📊 AI Marketer Automate your social media\n      marketing to grow brand awareness and drive lead generation. Social Media\n      Manager can create and schedule posts while generating new content\n      ideas. Trusted by Top Agents,\n      Teams and Brokers Lofty Benefits Lofty customers enjoy time saving\n          automation, cutting-edge mobile apps, flexible contracts, world class\n          customer support, and with new innovative features added every month\n          are confident that they're always one step ahead of the competition. With Lofty onboard you'll - Boost productivity Maximize team collaboration Increase lead generation Spend less on tech tools Save time on marketing Simplify sales & marketing process Ready to see Lofty in Action? Book your personalized demo today... Schedule a Demo Lofty Success Stories Case Study We provide our team the best CRM on\n                        the market at no charge. Agents who have never used a CRM before\n                        are adopting... Read More > Case Study Lofty is a true partner to our team,\n                        dedicated to helping our agents harness the power of the\n                        platform to better ser... Read More > Case Study Lofty was the platform that checked\n                        every single box for us. It is easy to use and incredibly\n                        intuitive which means ... Read More > Ready to Accelerate your Business Growth? Complete the form to schedule a demo and one of our solution specialists will reach out to confirm your appointment. We’ll make sure you receive - A personalized tour and guidance from one of our top solutions advisors Guaranteed lowest price on new subscriptions and add-ons Instant access to your new Lofty account upon sign-up Request a Demo  🎉 Team Size 1-2 3-14 15-49 50-99 100+ Which best describes your role? Agent Team Leader Broker Executive Other LoftyBlast is Lofty's flagship product, trusted by thousands of real estate agents. Join the journey and amplify your listing exposure with ease. Get More Leads Who We Help Agents Teams Brokers Resources Blog Success Stories Partners Customer Referrals Marketplace Integration Contact 855-981-7557 support@lofty.com 7 Days a Week 8 am to 8 pm Eastern Time Lead Generation 360 Marketing Google PPC Google LSA Brand Advertising Direct Mail Platform Real Estate CRM Agent Websites Social Studio AI Assistant Mobile Apps Power Dialer Transaction Management Company About Mission Chime to Lofty News Contact Us Lofty Inc. Copyright 2025. All Rights Reserved. Terms of Use Privacy Policy Accessibility Security Platform Status"
    },
    {
      "url": "https://www.giftly.com/gift-card/lim%C3%B3n-rooftop-bar-naples-2",
      "text": "Limón Rooftop Bar Gift & Greeting Cards - Email, Text or Print - 455 12th St S, Naples, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Naples Restaurants Limón Rooftop Bar Limón Rooftop Bar Gift Card Limón Rooftop Bar Giftly A beautiful gift card alternative for Limón Rooftop Bar Limón Rooftop Bar 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Limón Rooftop Bar (79) (239) 944-3755 Categories Mediterranean Location 455 12th St S, Naples, FL Gift Tips Try the Margarita Flatbread if you're looking for a delicious tapas option. Don't miss the crispy Churros filled with Bavarian cream – a perfect dessert treat. Ask for recommendations from the attentive staff like Tamar or David for a personalized dining experience. Enjoy the view of the sunset from the rooftop, it's a memorable part of the experience. The Greek salad has received high praise and is a must-try dish when visiting. Click here to send a gift up to $1,000 with the suggestion to use it at Limón Rooftop Bar. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Limón Rooftop Bar Ambience Casual, Trendy Limón Rooftop Bar is a stylish new venue located in Naples, FL 34102. Just a short stroll from Downtown, this Mediterranean-inspired bar provides a unique dining experience with its rooftop views and relaxed ambiance. Ambiance : A modern rooftop bar atmosphere with a beautiful view, great for relaxing and socializing. Cuisine : Offers a menu of Mediterranean-inspired tapas and drinks, focusing on fresh ingredients and vibrant flavors. Highlights : Friendly staff that provides excellent service; unique dishes like the Greek salad and Margarita Flatbread. Whether guests are stopping in for drinks, enjoying a full meal, or celebrating a special occasion, the attentive service and carefully crafted dishes create a pleasant experience. The rooftop setting is perfect for enjoying the Naples sunset, enhancing the overall dining experience. With a fantastic menu and inviting atmosphere, Limón Rooftop Bar is quickly becoming a favorite spot for locals and visitors alike. Customer Reviews Lorraine N. 03/16/2025 Decent service, interesting view but the food was delicious\n\nOur server was kind and helpful read review Athena B. 03/25/2025 Really cute rooftop bar and restaurant with delicious small plates that are easy to share! read review Whiskey S. 05/04/2025 Listen if you can jump off the top floor and survive , it's NOT a rooftop ! Which I wanted to do after dining here . \nService - TERRIBLE   \nAtmosphere -... read review Great Alternatives Gift $100 for Vourla Mediterranean Grill & Cafe : Indulge in the vibrant flavors of the Mediterranean at Vourla Mediterranean Cafe & Grill in Naples, where every bite captures the essence of traditional cuisine with a modern twist. Buy a Gift & Greeting Card for Mediterrano : Nestled in the heart of Naples, Mediterrano invites diners to savor a taste of the Mediterranean with its delightful blend of flavors and warm, inviting ambiance. Updated: September 08, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Limón Rooftop Bar gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Limón Rooftop Bar. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Limón Rooftop Bar or anywhere else they like! Top Related Gifts Fuego Comida & Tequila Taste the Essence of Coastal Mexico 11615 Florida 70 E, Lakewood Ranch, FL 4.0 (112) • Mexican Dry Dock Waterfront Grill Fresh Flavors, Stunning Views 412 Gulf Of Mexico Dr, Longboat Key, FL 4.5 (2.2k) • $$$ • Seafood Deep Lagoon Seafood and Oyster House Seafood Bliss with a Waterfront View 14040 Mcgregor Blvd, Fort Myers, FL 3.8 (532) • $$$ • Seafood Spizzigo Sweet Meets Savory in Doral 11402 NW 41st St, Doral, FL 3.4 (229) • $$ • Italian Buck's Pizza Satisfy your pizza craving Brand 651 reviews • Pizza Poke Bros Build your dream poke bowl Brand 3.1k reviews • Hawaiian Catullo’s Italian Authentic Italian flavors Brand 734 reviews • Italian Rocket Fizz Sweet nostalgia in every bite Brand 1.8k reviews • Candy Stores The Bowl Bazaar Fresh Bowls with a Waterfront View 1100 6th Ave S, Naples, FL 4.8 (40) • Mediterranean Estia Mediterranean Delights in Naples 8990 Fontana Del Sol Way, Naples, FL 4.2 (31) • Mediterranean Shabo’s Bistro Mediterranean Flavors, Bright Nights 15215 Collier Blvd, Naples, FL 4.1 (37) • Mediterranean SOFRA Savor the Essence of the Mediterranean 280 Vanderbilt Beach Rd, Naples, FL 4.5 (20) • Mediterranean More Nearby Businesses Paella's Mediterranean Fusion 3861 Tamiami Trl E, Naples, FL 5.0 (5) • Mediterranean Vergina 700 5th Ave S, Naples, FL 2.9 (764) • $$$ • Italian Amfora Mediterranean Restaurant 8076 Mediterranean Dr, Estero, FL 4.3 (139) • Mediterranean Tesoro 400 S Collier Blvd, Marco Island, FL 3.3 (94) • $$$ • Mediterranean Wynn’s Market 141 9th St N, Naples, FL 4.0 (111) • $$$ • Bakeries Grouper & Chips 338 9th St N, Naples, FL 4.5 (800) • $$ • Seafood The Continental 1205 3rd St S, Naples, FL 3.9 (377) • $$$ • Steakhouses PJK Neighborhood Chinese 835 4th Ave S, Naples, FL 3.6 (114) • Chinese Sushi Thai Too 898 5th Ave S, Naples, FL 3.6 (238) • $$ • Sushi Bars Tavern On The Bay 489 Bayfront Pl, Naples, FL 3.4 (221) • $$ • New American Jane's Cafe on 3rd 1209 3rd St S, Naples, FL 3.9 (571) • $$ • Breakfast & Brunch Food & Thought 2132 Tamiami Trl N, Naples, FL 4.0 (241) • $$ • Grocery Captain & Krewe Seafood Market and Raw Bar 629 8th St S, Naples, FL 4.4 (649) • $$ • Seafood Markets La Pescheria 474 5th Ave S, Naples, FL 4.5 (152) • Seafood The Med 3929 Bayshore Dr, Naples, FL 3.7 (52) • Mediterranean Sails Restaurant 301 5th Ave S, Naples, FL 4.1 (286) • $$$$ • Seafood Kabab Spot 4805 S Cleveland Ave, Fort Myers, FL 4.2 (767) • $$ • Mediterranean Figs Grille 25987 S Tamiami Trl, Bonita Springs, FL 4.3 (246) • $$ • Mediterranean Osteria Tulia 466 5th Ave S, Naples, FL 4.3 (637) • $$$ • Italian EJ's Bayfront Cafe - Naples 469 Bayfront Pl, Naples, FL 4.4 (713) • $$ • New American The Boathouse On Naples Bay 990 Broad Ave S, Naples, FL 2.8 (569) • $$$ • Seafood Grappino 90 9th St N, Naples, FL 4.2 (116) • Italian Bar Tulia 462 Fifth Ave S, Naples, FL 4.4 (260) • $$$ • Italian The Brick Coffee & Bar 531 5th Ave S, Naples, FL 3.8 (105) • $ • Desserts Napoli On The Bay 820 12th Ave S, Naples, FL 3.4 (151) • $$ • Pizza The Rooster 600 Goodlette Rd N, Naples, FL 4.6 (488) • $$ • American Mino 1100 6th Ave S, Naples, FL 4.1 (318) • $$ • Pizza Lake Park Diner 944 7th Ave N, Naples, FL 4.3 (416) • $$ • New American Simit 1230 Airport Pulling Rd N, Naples, FL 5.0 (3) • Mediterranean Ceno Grille 1715 Cape Coral Pkwy W, Cape Coral, FL 4.2 (273) • $$ • Mediterranean De Adriatico Restaurant 9908 Gulf Coast Main St, Fort Myers, FL 4.5 (160) • $$ • Mediterranean Gyros2Go 16371 Corporate Commerce Way, Fort Myers, FL 4.3 (8) • Mediterranean Turco Taco 410 9th St N, Naples, FL 4.4 (337) • $ • Tacos Molto Trattoria 368 5th Ave S, Naples, FL 3.8 (409) • $$ • Italian Cosmos Ristorante & Pizzeria 536 Tamiami Trl N, Naples, FL 4.1 (338) • $$ • Italian Keewaydin's on Fifth 711 5th Ave S, Naples, FL 4.0 (63) • Seafood Brooks Burgers 330 9th St S, Naples, FL 4.4 (1.0k) • $$ • Hot Dogs The Dock At Crayton Cove 845 12th Ave S, Naples, FL 3.7 (876) • $$ • Seafood Barbatella 1290 3rd St S, Naples, FL 3.6 (335) • $$ • Italian Riverwalk At Tin City 1200 5th Ave S, Naples, FL 3.3 (409) • $$ • Seafood Jimmy P's Charred 1833 Tamiami Trl N, Naples, FL 4.2 (727) • $$ • Steakhouses Bambu Tropical Bar and Grille 1221 5th Ave S, Naples, FL 3.6 (38) • Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Mediterranean 3.7 70-79 3 single place gcdp gift_and_greeting_card_in_title_tag Naples, FL XL S Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://barlimon.co.uk/contact-us/",
      "text": "Contact us - Bar Limon 01684 438663 Menu Home Menu Pre-Theatre Weddings and Celebrations Your perfect wedding Food & Drinks Menu Optional extras Other celebrations Events Gallery Contact us Request a table Date Time Party 1 2 3 4 5 6 7 8 9 10 Contact Details Name Email Phone Occasion Select an occasion (optional) Birthday Graduation Anniversary Pre-Theatre Message Add a Message Request Booking let’s hear from you Contact Us We love to hear from our existing customers or do you have a question? to Contact us fill in the form below and we will be back in touch pronto! Name (Required) First Last E-mail address (Required) Phone number Subject (Required) Your message (Required) *=required CAPTCHA Contact us 8 Church Street, Malvern, Worcester WR14 2AY 01684 438663 info@barlimon.co.uk Site Home Menu Events Gallery Contact us Opening Hours Monday – Closed Tuesday – 5pm – Late (Last Food Orders 9.00pm) Wednesday – 5pm – Late (Last Food Orders 9.00pm) Thursday – 12pm – Late (Last Food Orders 9.00pm) Friday – 12pm – Late (Last Food Orders 9.00pm) Saturday – 12pm – Late (Last Food Orders 9.00pm) Sunday – Closed but we have pop ups and special events! Bar Limon is available for Private Hire for Events  & Weddings please contact us for more info Follow us on © Bar Limon 2025 Website designed by Fresh Ad Communications Ltd. E: alf@freshcom.co.uk W: www.freshcom.co.uk"
    },
    {
      "url": "https://www.limonrooftop.com/events",
      "text": "Events | Limon Rooftop Bar top of page Home Menus Events More Use tab to navigate through the menu items. Events & Catering Elevate your expectations for Naples event venues – with a view! Limon Rooftop Bar accommodates a variety of gatherings, from large group reservations in the lounge or rooftop terrace to private social and corporate events. CATERING & EVENTS MENU Private Party Venue Come up with your guest list – then come up to Limon for cocktail parties, holiday gatherings, social get-togethers and other private events in our downtown Naples rooftop venue. CONTACT US Corporate Meeting Venue Move business meetings to a higher level … on our rooftop. We take the work out of hosting corporate events. CONTACT US 239.944.3755 455 12th St South, Naples, FL 34102 Monday – Thursday 6:30 AM – 10:00 AM 11:00 AM – 10:00 PM ​ Friday 6:30 AM – 10:00 AM 11:00 AM – 11:00 PM ​ ​ Saturday 7:00 AM – 11:00 AM 11:30 AM – 11:00 PM ​ Sunday 7:00 AM – 11:00 AM 11:30 AM – 10:00 PM ​ SIGN UP FOR TASTY UPDATES, EVENTS & NEWS HERE LIMON ROOFTOP BAR • ALL RIGHTS RESERVED • PRIVACY POLICY bottom of page"
    },
    {
      "url": "https://linarooftop.com.au/contact/",
      "text": "Get In Touch – Lina Rooftop Skip to main content Gift Cards Book Now Menu Home Menu Functions What’s On Reservations Location Contact Close Search Get in touch Phone 07 3187 4590 Address 74-80 Tribune Street South Brisbane The pool deck is strictly an 18+ zone. All ages are welcome in the restaurant. Opening Hours Monday Closed Tuesday Closed Wednesday 11am–10pm Thursday 11am–10pm Friday 11am–12am Saturday 11am–12am Sunday 11am–7pm Heated Pool Access 11am–6pm Questions? Join our newsletter L: 74-80 Tribune Street, South Brisbane T: 3187 4590 E: reservations@linarooftop.com.au Amazon Instagram Facebook OPEN Monday & Tuesday: 11am–6pm Wednesday & Thursday: 11am–10pm Friday & Saturday: 11am–12am Sunday: 11am–7pm Pool Access: 11am–6pm DRESS CODE Smart Casual, No Face & Neck Tattoos, No Baseball Caps, No Flip Flops, No Football Shirts The pool deck is strictly an 18+ zone. All ages are welcome in the restaurant. © 2025 Lina Rooftop. Close Menu Home Menu Functions What’s On Reservations Location Contact ×"
    },
    {
      "url": "https://www.sabinelondon.co.uk/contact-us/",
      "text": "Reserve a Spot | Cocktail Bar Near St Pauls | Sabine Menus What’s On Events & Private Hire Gallery Contact Us Book Now Contact Us Carter Lane, London, EC4V 5AJ Opening Hours Sun-Wed: 12pm – Midnight Thurs-Sat: 12pm – 1am Sabine Enquiries: SabineStPauls@leonardohotels.co.uk Press and Media Enquiries: Sabine@sohocommunications.co.uk book Now SUNDAY – WEDNESDAY: 12PM -12AM THURSDAY – SATURDAY: 12PM – 1AM LUNCH: MONDAY – THURSDAY: 12PM – 4PM BRUNCH: DAILY: 12PM – 3PM Carter Lane,  London, EC4V 5AJ Privacy Policy FAQs Press by Propeller Close"
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-vienna/limon.html",
      "text": "LimÃ³n - Rooftop Bar in Vienna | The Rooftop Guide Rooftop Bars Europe North America Central America & Caribbean South America Asia Middle East Oceania Africa Rooftop Pools Inspiration Sign up Europe Rooftop bars in Vienna Vienna rooftop bar LimÃ³n $ $ $ $ $ 8th floor Stadtpark Images belong to the bar Last updated: February 8, 2024 LimÃ³n Rooftop Bar in Vienna Vienna skyline Mediterranean Year round Yes Overview Riviera-inspired rooftop with a spectacular city view. One of the most beautiful places on Vienna's famous RingstraÃe is the rooftop venue LimÃ³n, a Mediterranean rooftop restaurant & bar, found on the last floor of the hotel Grand Ferdinand . The lush, elegant and vibrant rooftop blends a colorful interior with a charming outdoor terrace, where you get some truly spectacular views over the Vienna rooftops. Up on the 8th floor, you are invited to embark on an evening journey from the CÃ´te dâAzur to the Amalfi Coast, then on to Mallorca and back. The rooftop menu is filled with culinary delights from Italy, France, and Spain, best enjoyed Ã  la Family-Style, indulging in numerous taste explosions. Over at the bar, offerings are specialized in the Italian cult drink and Aperitivo culture. Sip a spritz, digestif or creative signature drink, or choose something from the fine selection of wines. An oasis exclusive to hotel guests for breakfast, drinks, and poolside enjoyment during the day, LimÃ³n opens its doors to everyone from Tuesday to Saturday night, perfect to celebrate the Mediterranean way of life high above the rooftops of Vienna. Watch Location & Map Grand Ferdinand, Schubertring 10-12, 1010 Vienna Contact +43 1 90211 restaurant@cucinalimon.com Visit website Facebook Instagram Opening Hours Monday: Closed Tuesday: 17.00 - 00.00 Wednesday: 17.00 - 00.00 Thursday: 17.00 - 00.00 Friday: 17.00 - 00.00 Saturday: 17.00 - 00.00 Sunday: Closed FAQ What is the LimÃ³n dress code? The LimÃ³n dress code is smart casual. What food does LimÃ³n serve? LimÃ³n serves culinary delights of Italy, France, and Spain. Rating By: Hans Ebenman Hans has visited over 500 rooftop bars, 200 rooftop pools and 300 rooftop restaurants since 2015. This vast experience has made Hans a true rooftop expert, and one of the most knowledgeable in the field. Today, numerous of travel magazines, bloggers and media websites contact Hans to get his expertise on rooftops. Hot Read Elevated swims Dive into the best rooftop pools around the globe Dazzling heights Head sky-high and explore the tallest rooftop bars in the world Explore Browse all the cities & articles at The Rooftop Guide Follow The Rooftop Guide More rooftop bars in Vienna Atmosphere Rooftop Bar & Lounge Perched on top of the fantastic Ritz-Carlton, Atmosphere offers a spectacular view of Vienna, its skyline and surroundings. Absolutely magical. On top of that, the rooftop bar also serve cocktails matching the view. Located right by the Stadtpark... Dachboden at 25hours Hotel An urban and vibrant rooftop bar, located on top of 25hours Hotel in the MuseumsQuartier. Mixing great views with a great atmosphere, the indoor lounge at Dachboden is trendy, fun and colorful and leads out to a spacious terrace decorated with... Aurora Rooftop Bar Aurora Rooftop Bar is a modern, bright and very stylish lounge and bar, perched on top of the Andaz Vienna Am Belvedere, right by the Schweizer Garten. The spacious rooftop terrace takes inspiration from... View All You may also like Article 10 best rooftop bars for a beautiful sunset Guide Dive into the best rooftop pools in the world Article Highest rooftop bars in the world Article 8 amazing hotels with rooftop bar Complete guide 22 best rooftop bars Paris Complete guide 24 best rooftop bars Rome Complete guide 37 best rooftop bars London Complete guide 10 best rooftop bars Amsterdam Collaboration Timeless watches for timeless views Everything is better with a nice view! Explore Top 10 Popular cities Book your hotel Features Swedish version Follow Facebook Instagram YouTube TikTok Pinterest Snapchat X LinkedIn Threads Newsletter Business About us Collaborate with us Contact us Collaborations Legal Privacy Policy © Copyright 2015-2025 | by therooftopguide.com | All Rights Reserved."
    },
    {
      "url": "https://www.therooftopguide.com/rooftop-bars-in-lisbon/limao-rooftop-bar.html",
      "text": "ï»¿ LimÃ£o Rooftop Bar - Rooftop bar in Lisbon | The Rooftop Guide Rooftop Bars Europe North America Central America & Caribbean South America Asia Middle East Oceania Africa Rooftop Pools Inspiration Sign up Europe Rooftop bars in Lisbon Lisbon rooftop bar LimÃ£o Rooftop Bar $ $ $ $ $ 10th floor MarquÃªs de Pombal Images belong to the bar Last updated: May 25, 2025 LimÃ£o Rooftop Bar Rooftop Bar in Lisbon Panoramic over Lisbon Bar bites Year round No Overview Comfy and charming rooftop bar, with perfect sunset views over Lisbon. LimÃ£o Rooftop Bar really brings the beach and summer vibe right to the city, with its blue and white tile floor, a white bar and stylish and modern lounge furniture. Located on the 10th floor of the luxurious H10 Duque de LoulÃ©is , the rooftop offers a fantastic panoramic view over the Lisbon city and the Tagus. There is both indoor seating and an intimate and cosy outdoor terrace. One of the most romantic rooftop bars Lisbon has to offer, and front row seats to one of the best views in the city as well. Particularly impressive just as darkness begins to fall in and the city lights up in beautiful colors. The rooftop bar at LimÃ£o Chill-Out Terrace offers classic cocktails, a large set of Gin & Tonics, bubbles, wines and some really fresh and tasty Portuguese tapas. All in a relaxing, intimate and harmonious atmosphere, with a great and friendly service. During summer, the terrace is open throughout the day, so you can just pop up for some very relaxing afternoon drinks. For nightly visits, try to be in good time, since the terrace has a quite limited selection of seats. Note: LimÃ£o Rooftop Bar used to close during winter, but starting 2024 they now stay open all year round. Watch Location & Map Av. Duque de LoulÃ© 83, 1050-089 Lisbon Contact +351 213 182 000 h10.duque.deloule@h10hotels.com Visit website Facebook Instagram Opening Hours Monday: 12.00 - 22.00 Tuesday: 12.00 - 22.00 Wednesday: 12.00 - 22.00 Thursday: 12.00 - 22.00 Friday: 12.00 - 22.00 Saturday: 12.00 - 22.00 Sunday: 12.00 - 22.00 FAQ What is the LimÃ£o Rooftop Bar dress code? The LimÃ£o Rooftop Bar dress code is casual chic. What food does LimÃ£o Rooftop Bar serve? LimÃ£o Rooftop Bar serves bar bites. Rating By: Hans Ebenman Hans has visited over 500 rooftop bars, 200 rooftop pools and 300 rooftop restaurants since 2015. This vast experience has made Hans a true rooftop expert, and one of the most knowledgeable in the field. Today, numerous of travel magazines, bloggers and media websites contact Hans to get his expertise on rooftops. Hot Read Rooftop pools Refreshing swims with fantastic views over Lisbon Hot-spots Most hyped Lisbon rooftops in 2025 Explore Browse all the cities & articles at The Rooftop Guide Follow The Rooftop Guide More rooftop bars in Lisbon Memmo Alfama Terrace A rooftop bar with breathtaking views of the sea, the beach and all the boats that go by Lisbon. The roof terrace is equipped with a pool and sun loungers. The rooftop bar has a nice cocktail... Park A trendy rooftop bar located on the 6th floor of a parking garage. Not the easiest place to find, but as a reward, you will get a roof terrace with one of Lisbon's best views, and a sunset that is absolutely breathtaking... Silk Club The ultimate rooftop bar in Lisbon, both for those who like fine Japanese cuisine and those searching for rooftops with a good party. At night this rooftop transform into an awsome nightclub with great... View All You may also like Article 10 best rooftop bars for a beautiful sunset Article 7 proven tips for the ultimate rooftop experience Article Swim at the best rooftop pools in the world Article 9 amazing hotels with rooftop bar Article Amazing spots to mix a refreshing swim with fantastic views over Lisbon Complete guide 11 best rooftop bars Porto Complete guide 32 best rooftop bars Madrid Complete guide 30 best rooftop bars Barcelona Collaboration Timeless watches for timeless views Everything is better with a nice view! Explore Top 10 Popular cities Book your hotel Features Swedish version Follow Facebook Instagram YouTube TikTok Pinterest Snapchat X LinkedIn Threads Newsletter Business About us Collaborate with us Contact us Collaborations Legal Privacy Policy © Copyright 2015-2025 | by therooftopguide.com | All Rights Reserved."
    },
    {
      "url": "https://blockclubchicago.org/2025/06/16/chicagos-ultimate-2025-rooftop-guide-70-open-air-bars-lounges-and-restaurants/",
      "text": "Chicago's Ultimate 2025 Rooftop Guide: 70+ Open-Air Bars, Lounges And Restaurants Real Chicago stories start in your neighborhood Get a daily digest of stories from all neighborhoods across Chicago. On Sundays, you'll get our reporters’ best of the week, highlighting the people and places that make our neighborhoods home. Sign up Sign up for our free, weekly newsletter covering all things food (and drink!) in Chicago. Sign up Sign up for our free, weekly newsletter covering all things food (and drink!) in Chicago. Sign up Sign up for our free, weekly newsletter covering all things food (and drink!) in Chicago. Sign up Close SUBSCRIBE Sign In Search for: Search Latest Stories Neighborhoods Open dropdown menu Austin, Garfield Park, North Lawndale Belmont Cragin, Hermosa Beverly, Mount Greenwood, Morgan Park Bridgeport, Chinatown, McKinley Park Open dropdown menu Gage Park, Brighton Park McKinley Park Bronzeville, Near South Side Downtown Open dropdown menu Loop River North, Gold Coast, Near North Side South Loop West Loop Edgebrook, Edison Park, Sauganash Englewood, Chatham, Auburn Gresham Open dropdown menu Ashburn Hyde Park, Woodlawn, South Shore Jefferson Park, Portage Park, Norwood Park Open dropdown menu O’Hare Lakeview, Wrigleyville, Northalsted Open dropdown menu Roscoe Village Lincoln Park, Old Town Lincoln Square, North Center, Irving Park Open dropdown menu Albany Park Ravenswood Logan Square, Humboldt Park, Avondale Midway, West Lawn Pilsen, Little Village, Back of the Yards Open dropdown menu Back of the Yards Roseland, Pullman South Chicago, East Side Open dropdown menu Hegewisch Uptown, Edgewater, Rogers Park Open dropdown menu Andersonville Wicker Park, Bucktown, West Town Arts & Culture Investigations Podcasts Newsletters Donate Shop Open dropdown menu Merch Photos Facebook Page Instagram Twitter Bluesky Threads TikTok Close Search Latest Stories Neighborhoods Austin, Garfield Park, North Lawndale Belmont Cragin, Hermosa Beverly, Mount Greenwood, Morgan Park Bridgeport, Chinatown, McKinley Park Gage Park, Brighton Park McKinley Park Bronzeville, Near South Side Downtown Loop River North, Gold Coast, Near North Side South Loop West Loop Edgebrook, Edison Park, Sauganash Englewood, Chatham, Auburn Gresham Ashburn Hyde Park, Woodlawn, South Shore Jefferson Park, Portage Park, Norwood Park O’Hare Lakeview, Wrigleyville, Northalsted Roscoe Village Lincoln Park, Old Town Lincoln Square, North Center, Irving Park Albany Park Ravenswood Logan Square, Humboldt Park, Avondale Midway, West Lawn Pilsen, Little Village, Back of the Yards Back of the Yards Roseland, Pullman South Chicago, East Side Hegewisch Uptown, Edgewater, Rogers Park Andersonville Wicker Park, Bucktown, West Town Arts & Culture Investigations Podcasts Newsletters Donate Shop Merch Photos Our Mission Board of Directors Our Team Contact Us Twitter Facebook Instagram Skip to content Menu Facebook Page Instagram Twitter Bluesky Threads TikTok Block Club Chicago Your Neighborhood News Site SUBSCRIBE Sign In Open Search Search for: Search SUBSCRIBE Menu Sign In Latest Stories Neighborhoods Open dropdown menu Austin, Garfield Park, North Lawndale Belmont Cragin, Hermosa Beverly, Mount Greenwood, Morgan Park Bridgeport, Chinatown, McKinley Park Open dropdown menu Gage Park, Brighton Park McKinley Park Bronzeville, Near South Side Downtown Open dropdown menu Loop River North, Gold Coast, Near North Side South Loop West Loop Edgebrook, Edison Park, Sauganash Englewood, Chatham, Auburn Gresham Open dropdown menu Ashburn Hyde Park, Woodlawn, South Shore Jefferson Park, Portage Park, Norwood Park Open dropdown menu O’Hare Lakeview, Wrigleyville, Northalsted Open dropdown menu Roscoe Village Lincoln Park, Old Town Lincoln Square, North Center, Irving Park Open dropdown menu Albany Park Ravenswood Logan Square, Humboldt Park, Avondale Midway, West Lawn Pilsen, Little Village, Back of the Yards Open dropdown menu Back of the Yards Roseland, Pullman South Chicago, East Side Open dropdown menu Hegewisch Uptown, Edgewater, Rogers Park Open dropdown menu Andersonville Wicker Park, Bucktown, West Town Arts & Culture Investigations Podcasts Newsletters Donate Shop Open dropdown menu Merch Photos Topics Business Block Club Eats LGBTQ+ News Weather Things To Do Openings & Closings Neighborhood Maps Posted in Citywide Chicago’s Ultimate 2025 Rooftop Guide: 70+ Open-Air Bars, Lounges And Restaurants Block Club rounded up more than 70 rooftops around the city where you can bask in the sunshine while dancing, eating, drinking and more. by Block Club Chicago Staff , Jennifer Billock , Leen Yassine and Kelly Bauer June 16, 2025 June 16, 2025 Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Click to share on Reddit (Opens in new window) Reddit Click to share on WhatsApp (Opens in new window) WhatsApp Click to email a link to a friend (Opens in new window) Email Credibility: Original Reporting On the Ground Sources Cited Original Reporting This article contains new, firsthand information uncovered by its reporter(s). This includes directly interviewing sources and research/analysis of primary source documents. On the Ground Indicates that a Newsmaker/Newsmakers was/were physically present to report the article from some/all of the location(s) it concerns. Sources Cited As a news piece, this article cites verifiable, third-party sources which have all been thoroughly fact-checked and deemed credible by the Newsroom. Celeste Chicago, 111 W. Hubbard St. Credit: Provided Jump to rooftops by neighborhood Beverly • Bronzeville • Bucktown • Chatham • Downtown • Fulton Market • Gladstone Park • Gold Coast • Hyde Park • Lakeview • Lincoln Park • Lincoln Square • Logan Square • The Loop • Morgan Park • Near South Side • Northalsted • Norwood Park • Old Town • Palmer Square • River North • South Loop • West Loop • West Town • Wicker Park • Wrigleyville CHICAGO — Great views, good food and plenty of cold drinks — there’s a lot to love about Chicago’s rooftop bars and restaurants. Block Club has mapped more than 70 rooftops where you can enjoy the warm weather this summer. See a business missing from our guide? Click here to submit it . Here are 70+ rooftop bars and restaurants around Chicago: Patios Beverly And Morgan Park Open Outcry Brewing Co. 10934 S. Western Ave. • Website • 773-629-6055 11 a.m.-10 p.m. Tuesday-Thursday, 11 a.m.-11 p.m. Friday-Saturday, 11 a.m.-8 p.m. Sundays South Side brewery Open Outcry boasts a rooftop beer garden through the spring, summer and fall with deck chairs, couches, music and food and drink service. Bronzeville And Near South Side VU Rooftop Bar 133 E. Cermak Road • Website • 312-256-2990 6 a.m.-10 a.m. Monday-Friday and 7 a.m.-3 p.m. Saturday-Sunday for breakfast and brunch; 4 p.m.-11 p.m. Sunday-Thursday and 4 p.m.-1 a.m. Friday-Saturday for dinner At 22 stories high, VU Rooftop features city vistas, three bars, two patios, fire pits and retractable windows for cold seasons. Visitors can sip cocktails and enjoy sweeping views of Downtown and Lake Michigan. Chatham The Woodlawn 1200 E. 79th St.  • Website • 708-986-3008 3-10 p.m. Tuesday-Thursday, 11 a.m.-11 p.m. Friday-Saturday. 12:30 p.m.-6 p.m. Sunday Launched in 2018, The Woodlawn in Chatham is a restaurant, internet cafe, event space, podcast studio, rooftop and more, all in one. This innovative community hub also offers rooftop yoga and gardening, and residents can even rent out the open-air space for $200 per hour for up to 30 people. Downtown And The Loop Aire Rooftop Bar 100 W. Monroe St. • Website • 312-236-1234 3-10 p.m. Sunday-Thursday, 3 p.m.-11 p.m. Friday-Saturday Sitting 24 stories high atop the Hyatt Centric, this rooftop bar offers bird’s-eye views of the city and serves up cocktails, wine, beer and shareable platters. Boleo 122 W. Monroe St. • Website • 312-750-9007 3-10 p.m. Tuesday-Thursday, 3-11 p.m. Friday-Saturday Named after an Argentinian tango move, Boleo offers a Latin American-inspired menu reminiscent of Peruvian and Argentinian street food. The 15th-floor rooftop in the Loop sits atop The Kimpton Gray Hotel. With a retractable roof, you can visit regardless of the season. Cerise Rooftop 203 N. Wabash Ave. • Website • 855-946-6600 4-10 p.m. Monday-Wednesday, 4 p.m.-midnight Thursday, 3 p.m.-2 a.m. Friday-Saturday, 3-10 p.m. Sunday Grab dinner and drinks at this indoor-outdoor rooftop in the Virgin Hotel, where DJs spin records through the evening. At 26 stories high, you also get a fantastic view of the city. Château Carbide 230 N. Michigan Ave. • Website • 312-985-0942 5-11 p.m. Wednesday-Friday, 2-11 p.m. Saturday Château Carbide sits 24 stories above Chicago’s Magnificent Mile, offering a “botanical-driven” cocktail bar, absinthe-focused drinks, craft cocktails and live music on Fridays and Saturdays. Its menu features upscale bites, weekend French flatbreads and decadent small plates by its executive chef. Cindy’s Rooftop 12 S. Michigan Ave. • Website • 312-792-3502 11 a.m.-11 p.m. Monday-Thursday, 11 a.m.-midnight Friday, 10 a.m.-midnight Saturday, 10 a.m.-11 p.m. Sunday With an open-air terrace, restaurant and bar, Cindy’s offers an extensive cocktail menu, seasonal cuisine and panoramic views of the city year-round. It’s perched atop the historic Chicago Athletic Association, 13 stories above ground. LH Rooftop 85 E. Wacker Drive • Website • 312-229-0631 11 a.m.-midnight daily At 22 stories high, you’ll get unbeatable views of the city and the Chicago River from the LondonHouse rooftop. The tri-level space has both indoor and outdoor seating, where visitors can enjoy American cuisine and cocktails. NoMI Garden 800 N. Michigan Ave. • Website • 312-239-4030 11 a.m.-midnight daily A sophisticated breezy rooftop seven floors above Michigan Avenue, NoMi serves up flatbreads, hearty side dishes, sushi, cocktails and more. Offshore Rooftop 1000 E. Grand Ave. • Website • 312-535-6660 11 a.m.-9 p.m. Sunday-Tuesday and Thursday, 11 a.m.-10 p.m. Wednesday and Friday, 11 a.m.-11 p.m. Saturday Did you know the world’s largest rooftop is at Navy Pier? With 36,000 square feet of indoor and outdoor space, this multi-seasonal restaurant and bar offers views of the city’s iconic skyline and Lake Michigan. Raised | An Urban Rooftop Bar 1 W. Upper Wacker Drive • Website • 312-795-3308 4-midnight Monday-Thursday, 2 p.m.-midnight Friday-Saturday Located on the corner of State and Wacker just steps away from the Red Line, Raised is a third-floor rooftop bar offering an impressive view of Chicago’s cityscape and the Chicago River. The venue offers cocktails and wine, as well as twists to classic American fare — like BBQ chips, truffle frites, spring rolls, bacon-wrapped pickle spears and more. ROOF On theWit 201 N. State St. • Website • 312-239-9502 4-11 p.m. Monday-Tuesday, 4-midnight p.m. Wednesday-Thursday, 4 p.m.-2 a.m. Friday, 11:30 a.m.-2 a.m. Saturday, 1 p.m.-7 p.m. Sunday With skyline views from 27 stories above ground, theWit’s rooftop has previously been named one of the top three rooftop bars in the world by Travel + Leisure. It serves up hand-crafted cocktails and cuisine and regularly hosts DJs, acoustic music series and live runway shows. Shanghai Terrace 108 E. Superior St. • Website • 312-573-6744 Lunch: 11:30 a.m.-2:30 p.m. Friday-Sunday. Dinner: 5-10 p.m. Sunday, Wednesday and Thursday, 5-11 p.m. Friday-Saturday In The Peninsula Hotel Chicago is a Chinese restaurant serving contemporary iterations of Shanghainese, Cantonese and Sichuanese dishes. Alongside indoor dining spaces is a chic outdoor terrace lined with greenery. Starbucks Reserve Roastery 646 N. Michigan Ave. • Website • 312-283-7100 6:30 a.m.-8 p.m. Monday-Thursday, 6:30 a.m.-9:30 p.m. Friday-Sunday Above four stories of coffee and cocktail bars, bakeries and cafes is the Starbucks Reserve Roastery’s 5th-floor rooftop. Overlooking Downtown’s bustling Michigan Avenue, the open-air terrace is open seasonally as weather permits. Terrace 16 401 N. Wabash Ave. • Website • 312-588-8030 7 a.m.-11 p.m. daily Trump International Hotel and Tower’s 16th-floor dining experience features an indoor bar and dining room, plus a 200-seat outdoor patio overlooking Downtown and the Chicago River. Upstairs At The Gwen 521 N. Rush St. • Website • 312-645-1500 Find varying breakfast/brunch, lunch/dinner/cocktail and bar hours here . This fifth-floor, Art Deco-inspired rooftop offers skyline vistas and sunrise-to-sundown dining with breakfast, brunch, lunch, dinner and cocktail menus. You can enjoy the open-air terrace on hot, sunny afternoons in the summer, but it also transitions into the winter with fire pits, warm drinks and curling. Sky Terrace 233 E. Ontario St. • Website • 312-335-5444 3-9 p.m. Monday-Thursday, 3-10 p.m. Friday-Saturday, noon-8 p.m. Sunday On Ivy Hotel’s 16th floor, you’ll find a rooftop lounge with light bites, like Italian flatbread and grilled shrimp street tacos, craft cocktails and scenic views of Downtown Chicago. Streeterville Social 455 N. Park Drive • Website • 312-840-6617 4-11 p.m. Monday-Thursday, 4 p.m.-midnight Fridays, noon-midnight Saturdays, noon-11 p.m. Sundays Serving up a globally inspired seasonal menu and handcrafted cocktails, the Loews Chicago Hotel’s Streeterville Social also hosts a variety of events on its third-floor terrace. There are social hours, “We Drink Pink” nights, live music evenings, trivia nights and tailgates. Z Bar 108 E. Superior St. • Website • 312-573-6888 4 p.m.-midnight Monday-Thursday, 2 p.m.-1 a.m. Friday-Saturday, 2 p.m.-midnight Sundays The Peninsula’s luxurious rooftop lounge, Z Bar, features city views, an extensive menu of booze and a variety of global cuisines, from tuna tartare and daikon frites to Cajun crab and caviar potato bites. Miru 401 E. Wacker Drive • Website • 312-725-7811 Find varying breakfast, brunch, lunch, dinner, and lounge hours at this link . Miru sits on the 11th-floor terrace of the St. Regis hotel, with expansive views of all your favorite city landmarks. Even the name “miru” means “view” in Japanese. Avli on the Park 180 N. Field Blvd. • Website • 312-600-9997 11 a.m.-10 p.m. Monday-Friday, 10:30 a.m.-10 p.m. Saturday, 10:30 a.m.-9 p.m. Sunday IAvli’s rooftop is a great spot for happy hour, cocktails and special celebrations. Gladstone Park The Garage Bar & Sandwiches 6154 N. Milwaukee Ave. • Website • 833-998-6752 4 p.m.-midnight Monday-Thursday, 4 p.m.-1 a.m. Friday, 11 a.m.-2 a.m. Saturday, 11 a.m.-10 p.m. Sunday The Garage Bar & Sandwiches is a neighborhood hangout spot featuring bar fare — like sandwiches and giant pretzels — beer galore, TVs and a rooftop deck. Hyde Park The Promontory Rooftop Terrace 5311 S. Lake Park Ave. West • Website • 312-801–2100 Open during select events. A space celebrating Hyde Park’s musical legacy and community, The Promontory is a music venue and cultural hub with a stunning rooftop. Check out upcoming shows and parties online. Lakeview The Piggery Restaurant & Rooftop 1625 W. Irving Park Road • Website • 773-281-7447 3-11 p.m. Monday-Wednesday, 11 a.m.-11 p.m. Thursday, 11 a.m.-midnight Friday, 10 a.m.-11 p.m. Saturday, 10 a.m.-10 p.m. Sunday Sports bar The Piggery is a great place to catch a game on a big screen. The family-friendly venue prides itself on its Cuban sandwich, bottomless brunch on weekends and an open-air rooftop deck. Lincoln Park And Old Town Castaways Beach Club 1603 N. Lake Shore Drive • Website • 773-281-1200 11 a.m.-10 p.m. daily Embrace Summertime Chi while lounging on Castaways Beach Club’s boathouse bar and grill, which features an open-air deck overlooking Lake Michigan. Harvest At Lakeshore Sport & Fitness 1320 W. Fullerton Ave. • Website • 773-348-6377 4-9 p.m. Wednesday-Friday, 11 a.m.-3 p.m. and 4-9 p.m. Saturday, 11 a.m.-3 p.m. Sunday Harvest is a full-service restaurant and bar with indoor and al fresco dining options. Its rooftop overlooks the Chicago skyline and is open to both members and non-members. Joe’s On Weed Street 940 W. Weed St. • Website • 312-273-5118 10 p.m.-2 a.m. Tuesday, 4 p.m.-midnight Thursday, 4 p.m.-2 a.m. Friday, noon-2 a.m. Saturday For football fans and country music lovers, Joe’s on Weed Street is the spot. The bar and music venue has dozens of TVs and hosts a variety of spring and summer events on its rooftop bar and patio, including live concerts, doggie happy hours and more. Sully’s House Bar 1501 N. Dayton St. • Website • 773-244-1234 5 p.m.-midnight Wednesday-Thursday, 4 p.m.-2 a.m. Friday, 1 p.m.-2 a.m. Saturday, noon-10:30 p.m. Sunday Sully’s House is a casual Irish sports bar with a main bar area, lounge and dining room. It also features two open-air spaces: a second-floor private bar that guests can reserve and rooftop deck with couches and TVs. Guests can enjoy dozens of beers, including more than 20 on tap and 30 in bottles, and comfort food like wraps, burgers, tacos, wings and pizza. The J. Parker 1816 N. Clark St. • Website • 312-254-4747 4-11 p.m. Monday-Thursday, 11 a.m.-midnight Friday, 10 a.m.-midnight Saturday, 10 a.m.-10 p.m. Sunday Sitting on the 13th floor of the Lincoln Hotel, this rooftop bar and restaurants offers views of Lake Michigan, Downtown and the Lincoln Park Zoo. It’s also open year-round, with a retractable glass roof for colder days. Utopian Tailgate 1608 N. Wells St. • Website • 312-210-7799 4-11 p.m. Monday-Thursday, noon-1 a.m. Friday, 11-2 a.m. Saturday, 11 a.m.-10 p.m. Sunday Located at Pipers Alley Mall in Old Town, rooftop deck Utopian Tailgate lives up to its name with cornhole, drinking games, disco dance parties, super-sized Jenga, beer coolers and more. Lincoln Square Gene’s Sausage Shop & Delicatessen Rooftop 4750 N. Lincoln Ave. • Website • 773-728-7243 11 a.m.-8 p.m. Friday-Saturday, 11 a.m.-4 p.m. Sunday Gene’s European-style beer and wine garden isn’t your average Chicago rooftop. The menu features smoked sausages and bratwurst cooked on an open wood grill, potato salad, mixed greens and more, plus rotating beers on tap and wines by the glass. As long as the weather permits, Gene’s opens its rooftops three days per week through the summer. Logan Square And Palmer Square BiXi Beer 2515 N. Milwaukee Ave. • Website • 773-904-7368 3-10 p.m. Monday-Tuesday and Thursday, 3-11 p.m. Friday, 10 a.m.-11 p.m. Saturday, 10 a.m.-8 p.m. Sunday A modern, Asian-inspired brewpub, this Logan Square establishment serves up Chinese, Korean and Vietnamese cuisine and original beer on its rooftop terrace. Lonesome Rose 2101 N. California Ave. • Website • 773-770-3414 11 a.m.-9 p.m. Monday-Thursday, 11 a.m.-11 p.m. Friday, 10 a.m.-11 p.m. Saturday, 10 a.m.-9 p.m. Sunday Tex-Mex bar and restaurant Lonesome Rose is known for its plant- and light-filled open design, which extends to its rooftop patio. The Logan Square staple offers breakfast tacos, queso, nachos, burritos, margaritas and more. Lonesome Rose unveiled a second location in Andersonville last year, but it doesn’t have a rooftop space. Masada 2206 N. Milwaukee Ave. • Website • 773-697-8397 4 p.m.-midnight Tuesday, 4 p.m.-2 a.m. Wednesday-Friday, 9 a.m.-3 p.m. Saturday, 9 a.m.-2 p.m. Sunday Masada is a popular Logan and Palmer Square nightclub. Complete with a lush rooftop patio and garden, the Middle Eastern venue regularly hosts dance parties, live DJs and music events. The Black Lion 2434 N. Milwaukee Ave. • Website 6 p.m.-2 a.m. Friday, 6 p.m.-3 a.m. Saturday Neighborhood bar The Black Lion serves up Latin American spirits and cockails alongside regular live music shows. Northalsted Sidetrack 3349 N. Halsted St. • Website • 773-477-9189 3 p.m.-2 a.m. Monday-Friday, 1 p.m.-3 a.m. Saturday, noon-2 a.m. Sunday This multi-level gay bar hosts a wide variety of events celebrating the LGBTQ+ community. Visitors can lounge on the rooftop while sipping specialty cocktails, or plan a visit for one of Sidetrack’s dance parties, RuPaul’s Drag Race screenings, storytelling sessions and other entertainment programs. Ravenswood Arriba 4405 N. Damen. Ave • Website 4-9 p.m. Monday-Thursday, 11:30 a.m.-10 p.m. Friday-Saturday, 11:30 a.m.-9 p.m. Sunday The team from Farm Bar runs this rooftop, which offers Mexican bites and cocktails. River North Celeste 111 W. Hubbard St. • Website • 312-828-9000 9 p.m.-4 a.m. Wednesday-Friday, 9 p.m.-5 a.m. Saturday This multi-level River North establishment offers a pub serving American cuisine and a Deco Room with craft cocktails. Head to the fourth floor for Celeste’s rooftop garden, complete with Victorian decor, tropical greenery and a retractable glass rooftop for year-round enjoyment. Joy District 112 W. Hubbard St. • Website • 708-320-3696 4 p.m.-2 a.m. Monday and Wednesday-Friday, 11 a.m.-3 a.m. Saturday, 11 a.m.-midnight Sunday Across from Celeste is another multi-level drinking and dining establishment, Joy District. It features a first-floor sports parlor, a second-floor club and a rooftop bar, where visitors can dance the night away while looking out at the city’s skyline. Pandan 1112 N. State St. • Website • 312-632-9316 5-11 p.m. Tuesday-Thursday, 5 p.m.-midnight Friday-Saturday Share baos and buns in the heart of Gold Coast at Pandan, a botanical 18th-floor bar at Viceroy Chicago with a “cocktail menu is as vast as the skyline itself.” The rooftop was previously called Devereaux. Tanta 118 W. Grand Ave. • Website • 312-222-9700 5-9 p.m. Monday-Thursday, 5-10 p.m. Friday, 11 a.m.-2:30 p.m. and 5-10 p.m. Saturday, 11 a.m.-2:30 p.m. and 5-9 p.m. Sunday Tanta brings a taste of Peru to Chicago with empanadas, cebiches and a variety of grilled seafood dishes and more, served in the restaurant’s indoor dining room and second-floor rooftop. Enjoy a meal alongside with a cocktail, including Peru’s national cocktail, Pisco Sour. SIFR 660 N. Orleans St. • Website • 464-204-8711 4-10 p.m. Sunday-Thursday, 5-11 p.m. Friday-Saturday From the owners of Indienne, enjoy an all-season rooftop terrace at Middle Eastern restaurant SIFR. Most dishes are cooked over an open hearth. bar avec 640 N. La Salle Drive • Website • 312-736-1778 5 p.m.-midnight Monday-Thursday, 2 p.m.-midnight Friday-Saturday, 2-10 p.m. Sunday Bar Avec is an open-air rooftop on the eighth floor, and it serves Mediterranean dishes and drinks. South Loop Panchos Rooftop & Cantina 327 S. Plymouth Court • Website • 312-362-1212 4 p.m.-11 p.m. Monday-Tuesday, 4 p.m.-midnight Wednesday-Friday, 1 p.m.-midnight Saturday, 1 p.m.-11 p.m. Sunday Formerly Plymouth Restaurant & Bar, this rebranded rooftop opened this spring. Diners can enjoy nachos, burgers, tacos, salads, asada and barbacoa fries, margaritas and more. Portillo’s 520 W. Taylor St. • Website • 312-667-4560 6:30 a.m.-12:45 a.m. daily Beloved Chicagoland hot dog chain Portillo’s has an open-air rooftop patio where diners can enjoy Chicago-style wieners and a classic shake. Reggies Rooftop Deck 2105 S. State St. • Website • 312-949-0120 11-2 a.m. Monday-Friday, 11-3 a.m. Saturday Neighborhood bar and music joint Reggies also has a “Trainwreck Rooftop Deck” with eight flat screen TVs, a pool table, pro basketball pop-a-shot, bags games and more. Take a seat, sip some booze and enjoy the South Side club’s classic menu items. West Loop And Fulton Market Aba 302 N. Green St. • Website • 773-645-1400 4-10 p.m. Monday-Thursday, 11 a.m.-3:30 p.m. and 4-11 p.m. Friday, 10 a.m.-11 p.m. Saturday, 10 a.m.-10 p.m. Sunday Aba serves up Israeli, Lebanese, Turkish and Greek cuisine and rare Mediterranean-inspired wines and spirits. Visitors can sit indoors for a traditional dining experience or take advantage of the eatery’s year-round rooftop patio, which is fully enclosed and heated during the winter months. Cabra 200 N. Green St. • Website • 312-761-1717 4-10 p.m. Monday-Wednesday, 11 a.m.-3 p.m. and 4-10 p.m. Thursday, 11 a.m.-3 p.m. and 4-11 p.m. Friday, 11 a.m.-3:30pm and 4-11 p.m. Saturday, 11 a.m.-3:30 p.m. and 4-10 p.m. Sunday Enjoy panoramic views of the city while sipping on cocktails and wines and tasting shareable plates of Peruvian cuisine, meant to be enjoyed family-style. With indoor and outdoor space atop The Hoxton Chicago Hotel, you can visit the rooftop year-round. La Josie 740 W. Randolph St. • Website • 312-929-2900 4-11 p.m. Monday-Wednesday, noon-11 p.m. Thursday, noon-midnight Friday, 11 a.m.-midnight Saturday, 11 a.m.-10 p.m. Sunday Amidst Chicago’s cityscape in West Loop sits La Josie, a modern and casual Mexican restaurant and agave bar with an open-air rooftop. Visitors can dine on tacos and ceviches, sip on cocktails and more while string lights twinkle overhead. Parlor Pizza Bar 108 N. Green St. • Website • 312-600-6090 11:30 a.m.-11:30 p.m. Monday-Wednesday, 11:30 a.m.-12:30 a.m. Thursday-Friday, 10:30 a.m.-12:30 a.m. Saturday, 10:30 a.m.-11:30 p.m. Sunday Parlor’s first location in the heart of West Loop is known for its unique ‘za and craft beer and cocktails. Diners can enjoy a casual meal on its open-air patio and rooftop spaces. Parlor also has a patio in Wicker Park and an indoor restaurant in River North. Puttery 932 W. Randolph St. • Website • 773-915-6040 11 a.m.-10 p.m. Sunday-Thursday, 11 a.m.-1 a.m. Friday-Saturday After playing some indoor mini golf, you can head to Puttery’s patio for drinks, pizza and upscale bites like potato flautas and charcuterie boards. This indoor-outdoor space offers lounge spaces, bar tops and communal tables so you can chill after tee time. Rooftop At Nobu Hotel 155 N. Peoria St. • Website • 312-779-8800 5-9:30 p.m. Sunday-Wednesday, 5-10:30 p.m. Thursday, 5-11 p.m. Friday-Saturday Nobu’s global luxury hotel in West Loop features an 11th-floor outdoor terrace, distinguished by its minimalistic, Japanese-inspired decor and menu items. Sip on booze and snack on wagyu dumplings or nigiri while looking out at the city’s skyline. Selva 311 N. Morgan St. • Website • 312-764-1934 6 p.m.-midnight Thursday-Saturday This Mexican nights-inspired bar on the seventh floor of The Emily Hotel is a moody and intimate indoor-outdoor venue. You can try out its handcrafted cocktails, like a Blackberry Mojito or Oaxaca Old Fashioned, plus casual fare like tacos, quesadilla and chips and salsa. Soho House Chicago 113-125 N. Green St. • Website • 312-521-8000 7 a.m.-midnight Sunday-Tuesday, 7 a.m.-1 a.m. Wednesday, 7 a.m.-2 a.m. Thursday-Saturday Soho House Chicago spans five floors and 108,000 square feet. Alongside a chic rooftop for drinks and lounging, there’s a rooftop pool, indoor screening room, gym, spa and music and arts programs. Tetto Chicago 406 N. Sangamon St. • Website • 773-453-8228 4-11 p.m. Wednesday-Thursday, 4 p.m.-midnight Friday-Saturday, 4-11 p.m. Sunday Tetto Chicago opened one year ago and sits atop the building that houses taco spot Tabu. Alongside city views, it serves up za slices and pies from Professor Pizza and a lineup of summer cocktails. Texan Taco Bar 942 W. Randolph St. • Website • 312-291-8133 4-11:15 p.m. Monday-Wednesday, 4 p.m.-12:30 a.m. Thursdays, 11:30 a.m.-2 a.m. Friday, 10:30 a.m.-3 a.m. Saturdays, 10:30 a.m.-11:15 p.m. Sundays In the heart of West Loop overlooking Randolph Street is Texan Taco Bar. It comes from the owners of Parlor Pizza, and it’s known for its fresh-squeezed margaritas, hardshell tacos and more Tex-Mex favorites. Tony’s Rooftop Bar 916 W. Fulton Market • Website 4-10 p.m. Monday-Friday, 11 a.m.-11 p.m. Saturdays, 11 a.m.-10 p.m. Sundays Time Out Market’s rooftop bar, named after the magazine’s late founder Tony Elliot, features a cozy, all-season venue decorated in vintage Time Out London covers and twinkling lights. Catch views of the Willis Tower and other architectural gems while sipping on a curated selection of wines, beers and signature cocktails. Gibson’s Italia 233 N. Canal St. • Website • 312-414-1100 11 a.m.-11 p.m. daily Visit the rooftop deck of famous Gibson’s Steakhouse for your red meat fix. West Town Homestead On The Roof 1924 W. Chicago Ave. • Website • 773-904-1149 5-9 p.m. Sunday and Wednesday-Thursday, 5-11 p.m. Friday-Saturday Touting itself Chicago’s “secret garden,” Homestead on the Roof is a cozy rooftop above Roots Handmade Pizza. Diners can enjoy a seasonal pop-up menu while surrounded by flowers, vertical hanging gardens, string lights and a decorative outdoor fireplace. Twisted Spoke 501 N. Ogden Ave. • Website • 312-666-1500 Noon-2 a.m. Monday-Friday, 10 a.m.-3 a.m. Saturday, 10 a.m.-midnight Sunday For 28 years, Twisted Spoke has been West Town’s “burger, booze and biker bar.” Enjoy fish fried tacos, jalapeno poppers and more late-night bar foods with a margarita, mint julep or two-for-one whiskey special. There’s also refreshing salads, like the popular Anarchy Greens with seared avocado, pear, garbanzos, dried black olives, blue cheese and more. Wicker Park And Bucktown Chop Shop 2033 W. North Ave. • Website • 773-537-4440 5-9 p.m. Monday-Wednesday, 11 a.m.-4 p.m. and 5-9 p.m. Thursday-Saturday, 11 a.m.-4 p.m. Sunday Housed in a 100-year-old former auto body shop, Chop Shop is a butcher, deli, restaurant, bar and music venue all in one. It also has an open-air rooftop patio where guests can enjoy a meal, drinks or summer concert. Etta 1840 W. North Ave. • Website • 773-730-2277 3-10 p.m. Monday-Thursday, 5-10 p.m. Friday, 10:30 a.m.-10 p.m. Saturday-Sunday New American restaurant Etta is all about rustic, wood-fired cooking, serving up pizzas, housemade pastas and salads which patrons can enjoy on a rooftop terrace. Kennedy Rooftop 1551 W. North Ave. • Website • 773-270-6770 4-10 p.m. Monday-Wednesday, 4-11 p.m. Thursday-Saturday, 11 a.m.-8 p.m. Sunday Atop the seventh floor of the Hyatt Place Wicker Park, you’ll find the Kennedy Rooftop, an open-air lounge complete with fire pits, oversized Jenga sets and panoramic skyline views. Enjoy craft cocktails, shareable mezze platters and flatbreads and dishes like harissa chicken kabobs and Mahi Mahi tacos. Royal Palms Shuffleboard Club 1750 N. Milwaukee Ave. • Website 5-10 p.m. Monday-Thursday, 5 p.m.-midnight Friday, noon-midnight Saturday, noon-7 p.m. Sunday Tropical drinks, rotating food trucks, board games, DJs and 11 shuffleboard courts are just some of the things you’ll find at this May-October shuffleboard club. Walk-ins are always welcome to join in the shuffle boarding or to simply lounge on the roof deck with a pina colada in hand. Taxim Chicago 1558 N. Milwaukee Ave. • Website • 773-252-1558 5:30-10 p.m. Monday-Thursday, 5:30-11 p.m. Friday, 5-11 p.m. Saturday, 5-9 p.m. Sunday Greek cuisine and wine abound at Taxim Chicago, a Byzantine-inspired venue that regularly hosts live Greek music, dancing and food events. Enjoy a meal on the rooftop terrace, which is now open for dinner service. The Up Room 2018 W. North Ave. • Website • 872-315-3060 5 p.m.-midnight Sunday-Thursday, 5 p.m.-1 a.m. Friday-Saturday Thirteen floors above the Wicker Park’s bustling Milwaukee Avenue, you can sit atop this Robey Hotel cocktail bar, lounge around and sip booze while looking out at the breathtaking cityscape. Solana 1616 N. Milwaukee Ave. • Website • 872-315-3083 11 a.m.-10 p.m. Sunday-Thursday, 11 a.m. to 11 p.m. Friday-Saturday You’ll find Wicker Park’s only public rooftop pool bar at the Robey. You can enjoy frozen tropical cocktails and street-style tacos. Wrigleyville Alma 3630 N. Clark St. • Website • 773-302-2326 6-10 a.m. daily for breakfast, 3-11 p.m. Sunday-Wednesday, 3 p.m.-midnight Thursday, 3 p.m.-1 a.m. Friday-Saturday Hidden in plain sight on Wrigleyville’s Hotel Zachary, Alma is a second-floor rooftop bar and lounge offering Mediterranean-inspired bites. The neighborhood social hub offers indoor and outdoor seating, a DJ booth and views of Wrigley Field and Gallagher Way. Old Crow Smokehouse 3506 N. Clark St. • Website • 773-537-4452 3 p.m.-1 a.m. Thursday, 10 a.m.-1 a.m. Friday, 10 a.m.-2 a.m. Saturday, 10 a.m.-midnight Sunday For country music, whiskey, Southern brunch and game-day celebrations in the heart of Wrigleyville, Old Crow Smokehouse is the spot. The indoor-outdoor restaurant and bar features a second-floor rooftop to bask in the sunlight. The Dugout 950 W. Addison St. • Website • 773-520-2883 5 p.m.-2 a.m. Tuesday-Wednesday, 2 p.m.-2 a.m., 5 p.m.-2 a.m. Friday, 2 p.m.-3 a.m. Saturday, 5 p.m.-2 a.m. Sunday Laidback spots bar The Dugout has a rooftop patio that offers views of the Chicago skyline and Wrigley Field, which is just steps away. Wrigley Rooftops 11 rooftop venues along Waveland and Sheffield avenues • Website • 773-248-7663 Select dates and times with reservations. Catch a Chicago Cubs game from rooftop bleachers. You can make single or group reservations, and food and drinks are included. Wrigley View Rooftops 1050 W. Waveland Ave. • Website • 773-362-1050 Select dates and times with reservations. If you’re planning on catching a Cubs home game, Wrigley View has a multi-level facility with a rooftop to watch the game from. Vines On Clark 3554 N. Clark St. • Website • 773-327-8572 4 p.m.-midnight Tuesday-Wednesday, 3 p.m.-midnight Thursday, 10 a.m.-midnight Friday-Sunday Steps away from Wrigley Field is Vines On Clark, a popular bar and neighborhood hangout. Enjoy drinks and comfort food in an indoor-outdoor venue, which includes a patio and second-floor rooftop. Submit A Business Support Local News! Subscribe to Block Club Chicago , an independent, 501(c)(3), journalist-run newsroom. Every dime we make funds reporting from Chicago’s neighborhoods. Already subscribe? Click here to gift a subscription , or you can support Block Club with a tax-deductible donation. Listen to the Block Club Chicago podcast: Listen On Apple Podcasts Listen On Google Podcasts Listen On Spotify Could AI Data Centers Drain Lake Michigan? Episode play icon Could AI Data Centers Drain Lake Michigan? Episode play icon How The West Side’s ‘Shine King’ Keeps Going Even As Shoe Shining Disappears Episode play icon A Look Inside What Some Call Chicago’s “Death Hospital” Episode play icon Meet The Watermelon Man, A South Side Legend With The Sweetest Melons In Town Episode play icon Are Your Kids Sick? Pediatricians Still Battling ‘Illness Of The Summer’ As School Starts Load More Search Results placeholder Previous Episode Show Episodes List Next Episode Show Podcast Information Tagged: Arts , Bars , Business , Guide to Chicago , Restaurants Block Club Chicago Staff newsroom@blockclubchi.org Twitter @blockclubchi More by Block Club Chicago Staff Post navigation Previous Juneteenth 2025: How To Celebrate In Chicago This Year Next My Pi, Deep-Dish Pioneer, To Serve Its Final Pizzas After More Than 5 Decades Community Send News Tips FAQ Our Team Board of Directors Free Text Alerts Staff Diversity Report 2024 Annual Report Support Us! Donate to Block Club Chicago More Ways to Give Manage My Account Advertise Our Supporters Jobs Media Kit EIN: 82-3844275 Block Club Chicago is a nonprofit news organization dedicated to delivering reliable, nonpartisan and essential coverage of Chicago’s diverse neighborhoods. © 2025 Block Club Chicago Powered by Newspack Privacy Policy Facebook Page Instagram Twitter Bluesky Threads TikTok Sign in Close Enter the code sent to your email. Email address Enter your password Sign in by entering the code we sent to , or clicking the magic link in the email. Continue Resend code Email me a one-time code instead Forgot password Create an account Sign in to an existing account Go back Continue Set a password (optional) Terms of Service . Sign up for newsletters Close Get the best of Block Club Chicago directly in your email inbox. Sending to: Citywide Morning Newsletter A daily digest of the top news from across all neighborhoods of Chicago: our best coverage from every corner of the city and the most important stories for all residents and guests. Continue"
    },
    {
      "url": "https://www.thelexingtonbar.co.uk/contact/",
      "text": "Contact Us | The Lexington Rooftop Bar & Terrace | Hull Lexington Logo toggle menu MENU MENU Lexington Logo MAKE A RESERVATION Home What’s On Up Coming Events Tipsy Afternoon Tea Tipsy Afternoon Tea Celebration Packages Hen Party Package Baby Shower Package Cocktail Master Classes Wine Tasting VIP Packages More About Marco Pierre White Steakhouse Double Tree by Hilton Hull Hotel Newsletter Blog Gift Vouchers Contact Us Drinks Menu MAKE A RESERVATION Get in touch Contact Us Tel – 01482947458 Email – [email protected] ⇑ Your Name Email Address Phone Number Select your occasion —Please choose an option— Private Hire Birthday Baby Shower Hen Party Wine Tasting Cocktail Masterclass Tipsy Afternoon Tea Other Preferred Date of Booking Any other details This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Become a member BE THE FIRST TO HEAR ABOUT OUR LATEST OFFERS Sign up Enter your email address to receive our newsletter. You can read our privacy policy by clicking here INSTAGRAM Follow Us SEE WHAT WE'VE BEEN UP TO... Celebrate your hen party in style at The Lexington Cocktail Masterclass at The Lexington. \n\nShake, st Negroni lovers! 🥃 This one is for you. The clas There’s nothing quite like a cocktail with a vie SEE MORE Lexington Logo Contact https://www.google.co.uk/maps/place/The+Lexington/@53.7476536,-0.3492398,17z/data=!3m1!4b1!4m5!3m4!1s0x4878be30555875ff:0x12546d88b15d6f60!8m2!3d53.7476504!4d-0.3470511 Directions mailto: [email protected] Email us tel: 01482 947458 Call us Call - 01482 947 458 Opening Times Opening hours: Wednesday – 5pm – 12am Thursday – 5pm – 12am Friday – 12pm – 12am Saturday 12pm – 1am Sunday 12pm – 6pm (City Lounge open daily ground floor) Address DoubleTree by Hilton, 24 Ferensway, Hull, HU2 8NH Menus Drinks Menu MAKE A RESERVATION CALL OUR TEAM Day Drinks Night Drinks What's On What’s On More Newsletter Gift Vouchers Double Tree by Hilton Hull Hotel Marco Pierre White Steakhouse About Contact Us Cookie Policy https://www.facebook.com/thelexingtonhull/ https://twitter.com/lexingtonhull?lang=en https://www.instagram.com/lexingtonhull/ © The Lexington 2025. All rights reserved. Website Design & Build by Epix Media."
    }
  ]
}