{
  "fuentes": [
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "alice.toynbee@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "ben.pearce@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "declan.ford@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "hayley.gregory@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "jake.longworth@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "jake.park@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "kirsty.dixon@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "luke.craggs@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "nick.hanson@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "owen.hardwick@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "stuart.houlton@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "tom.padden@lincolnshirefa.com"
    },
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "email": "zack.leader@lincolnshirefa.com"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "email": "crasmith@lincoln.ac.uk"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "email": "clea@lincoln.ac.uk"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "email": "granderson@lincoln.ac.uk"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "email": "kmacdonald@lincoln.ac.uk"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "email": "mbagley@lincoln.ac.uk"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "email": "plabiche@lincoln.ac.uk"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "email": "remills@lincoln.ac.uk"
    },
    {
      "url": "https://www.tes-property.co.uk/contact/",
      "email": "admin.louth@tes-property.co.uk"
    },
    {
      "url": "https://investinnorthlincolnshire.com/contact-us",
      "email": "businessinfo@northlincs.gov.uk"
    },
    {
      "url": "https://investinnorthlincolnshire.com/contact-us",
      "email": "example@company.com"
    },
    {
      "url": "https://investinnorthlincolnshire.com/contact-us",
      "email": "investinnlc@northlincs.gov.uk"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/comments-feedback/contact-us",
      "email": "csc_socialcare@lincolnshire.gov.uk"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/comments-feedback/contact-us",
      "email": "news@lincolnshire.gov.uk"
    },
    {
      "url": "https://www.lincolnshiremgmt.com/lincolnshire-management-adds-four-to-growing-investment-team/",
      "email": "info@lmi780.com"
    },
    {
      "url": "https://www.lincolnshiremgmt.com/lincolnshire-management-adds-four-to-growing-investment-team/",
      "email": "tzadvydas@stantonprm.com"
    },
    {
      "url": "https://www.lincolnshiremgmt.com/leadership/",
      "email": "info@lmi780.com"
    },
    {
      "url": "https://integrity-fl.com/properties/j.smith/",
      "email": "lance@integrity-fl.com"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/directory-record/81098/contact-information-for-heads-of-services",
      "email": "andy.gutherson@lincolnshire.gov.uk"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/directory-record/81098/contact-information-for-heads-of-services",
      "email": "chris.miller@lincolnshire.gov.uk"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/directory-record/81098/contact-information-for-heads-of-services",
      "email": "chris.yorston@lincolnshire.gov.uk"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/directory-record/81098/contact-information-for-heads-of-services",
      "email": "nicole.hilton@lincolnshire.gov.uk"
    }
  ],
  "mails": [
    "admin.louth@tes-property.co.uk",
    "alice.toynbee@lincolnshirefa.com",
    "andy.gutherson@lincolnshire.gov.uk",
    "ben.pearce@lincolnshirefa.com",
    "businessinfo@northlincs.gov.uk",
    "chris.miller@lincolnshire.gov.uk",
    "chris.yorston@lincolnshire.gov.uk",
    "clea@lincoln.ac.uk",
    "crasmith@lincoln.ac.uk",
    "csc_socialcare@lincolnshire.gov.uk",
    "declan.ford@lincolnshirefa.com",
    "example@company.com",
    "granderson@lincoln.ac.uk",
    "hayley.gregory@lincolnshirefa.com",
    "info@lmi780.com",
    "investinnlc@northlincs.gov.uk",
    "jake.longworth@lincolnshirefa.com",
    "jake.park@lincolnshirefa.com",
    "kirsty.dixon@lincolnshirefa.com",
    "kmacdonald@lincoln.ac.uk",
    "lance@integrity-fl.com",
    "luke.craggs@lincolnshirefa.com",
    "mbagley@lincoln.ac.uk",
    "news@lincolnshire.gov.uk",
    "nick.hanson@lincolnshirefa.com",
    "nicole.hilton@lincolnshire.gov.uk",
    "owen.hardwick@lincolnshirefa.com",
    "plabiche@lincoln.ac.uk",
    "remills@lincoln.ac.uk",
    "stuart.houlton@lincolnshirefa.com",
    "tom.padden@lincolnshirefa.com",
    "tzadvydas@stantonprm.com",
    "zack.leader@lincolnshirefa.com"
  ],
  "nombre_sitio": "lincolnshire-estates.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.lincolnshirefa.com/about/board-and-staff",
      "text": "Board and Staff - Lincolnshire FA Lincolnshire FA Skip to main content WGS Full-Time TheFA.com Search Lincolnshire FA.com Players Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back Players Male Pathway Back Male Pathway 11v11 Boys Football Man v Fat Football Small sided - 5, 6, 7-a-side leagues Veterans Futsal Walking Football Just Play Find Football Kick On Programme Female Pathway Back Female Pathway Competitive Recreational Football Volunteering Disability Pathway Back Disability Pathway Ability Counts League Comets Kick On Programme Para Talent Pathway Turn Up and Play Player Support Back Player Support Dispensation Insurance Lincolnshire FA Benevolent Fund Safety Eyewear Fund Retirement Opportunities Inclusion FIND FOOTBALL Safeguarding & Welfare Coaches Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back Coaches Get into Coaching England Football Courses Coaching Support Back Coaching Support CPD and In-Service Matchday App England Football Learning Opportunities CPD and In-Service Safeguarding & Welfare Referees Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back Referees Get into Refereeing Courses Back Courses The FA Referees Course The FA Futsal Referee Course Promotion and Development Back Promotion and Development Promotion Mentoring The FA Centre of Refereeing Excellence Referee Support and Guidance Back Referee Support and Guidance Guidance Documents Emergency Helpline Registration National Refereeing Strategy Rules and Regulations Temporary Dismissals Online CPDs Mental Health Champions Find a course Safeguarding & Welfare Whole Game Cups Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back Cups County Cup Round Dates County Cup Final Tickets Rules & Documents Honours List Safeguarding & Welfare Leagues & Clubs Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back Leagues & Clubs Volunteers Kick On Programme Facilities Back Facilities Grants and Funding Grass Pitch Improvement Programme Local Football Facility Plans National League System Resources Affiliation Grants and Funding Report It Back Report It Reporting a Match Official Reporting by non-qualified Referees Reporting Discipline Reporting Discrimination Discipline County Leagues Back County Leagues Grimsby Futsal League England Football Accreditation Opportunities Players & People Back Players & People Player registration Volunteers Roles School Club Links Club Management Back Club Management FA Resources and Guidance Health & Safety Lincolnshire FA - Early Warning System Rules and Regulations Online Club Administration Football Leadership Diversity Code Finance Back Finance Debt Recovery Club Accounts Grants & Funding Fundraising Rainbow Laces Veo Goal of the Month Award Dispensation Safeguarding & Welfare Player registration Whole Game System Safeguarding Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back Safeguarding DBS Checks Mental Health Hub Policies Safeguarding in Open Age Football Safeguarding in Lincolnshire FA Safeguarding Document Library Child Exploitation and Online Protection Social Media Guidance Whistle Blowing Policy Lincolnshire Safeguarding CPD Library Inclusion Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back Inclusion Discrimination Back Discrimination Reporting Discrimination Tackling Discrimination Discrimination Posters Inclusion Advisory Group Equality Standard for Sport Rainbow Laces LGBTQ Accredited Programme About Expand navigation Alternatively press \"Enter\" or \"Spacebar\" Back About Governance Partnerships Back Partnerships Our Partnerships Partnerships Brochure Testimonials Newsletter Sign-Ups We Are The One Podcast Visit Our Helpdesk Alzheimer's Society History Contact Board & Staff Back Board & Staff Council Members Vacancies Respect Back Respect 21 Days of Positivity Rules and Regulations The FA Playmaker News Governance Partnerships Newsletter Sign-Ups We Are The One Podcast Visit Our Helpdesk Alzheimer's Society History Contact Board & Staff Vacancies Respect Rules and Regulations The FA Playmaker Lincolnshire FA Board & Staff Governance Partnerships Newsletter Sign-Ups We Are The One Podcast Visit Our Helpdesk Alzheimer's Society History Contact Vacancies Respect Rules and Regulations The FA Playmaker Home About Board & Staff Board and Staff Meet the Lincolnshire FA team The Lincolnshire FA Board of Directors are responsible for the business affairs of the Association and determine the strategy, plans, policies and financial investment required to achieve the Association’s aims. As such, individually and collectively, the directors are accountable to the Membership. The Lincolnshire FA Board currently meet every six weeks, with relevant Board Sub-Committees meeting on regular occasions throughout the year. BOARD MEMBERS Professor Sir Jonathan Van-Tam Chair of the Lincolnshire Football Association Professor Sir Jonathan Van-Tam (JVT) graduated in Medicine from the University of Nottingham in 1987 and has spent nearly 40 years working in medicine and public health. From October 2017 until March 2022 Professor Sir Jonathan was seconded to the Department of Health and Social Care, England as Deputy Chief Medical Officer where his portfolio was vaccines, pharmaceuticals, health protection, and biosecurity. In that role he has been extensively involved in domestic vaccines policy, seasonal influenza, infectious disease incidents (Ebola, Monkey Pox), the Novichok attack, and the Covid-19 pandemic. He was a member of the UK Scientific Advisory Group for Emergencies and co-Chair of the Global Health Security Advisory Group  Pandemic Influenza Working Group. He has received multiple awards and accolades for his public communication of science and was awarded a Knighthood for services to Public Health in 2022. “I am passionate about football. Football has been a big part of my life since childhood as a participant, a fan and now as a parent whose children play football in Lincolnshire. Participation in sport has a positive impact on our communities and for those individuals involved supports  health, fitness and wellbeing and teaches teamwork, leadership and confidence.” Shan Jaehrig (She/Her) Shan is the Senior Independent Director, FA Rep, and Director for Organisational Development. Shan is a Partner in the local law firm Sills & Betteridge, specialising in employment and data protection. Shan advises local, national and international clients on all aspects of employment law, including discrimination and compliance with the Equality Act 2010. Shan was a child protection lawyer at Lincolnshire County Council for 12 years in which capacity she sat on the local Safeguarding Board, advised independent enquiries into serious cases involving child abuse and implemented joint training with the Lincolnshire Police Force in relation to child online exploitation. Shan is the Lincolnshire Football Association’s representative on the FA Council where she sits on its Judicial Panel and is also a committee member of the Disability Football Committee. Shan is a Governor at Queen Elizabeth High School in Gainsborough and she is also a Trustee of the Disability Network West Lindsey. Nick Hanson Nick is the Lincolnshire FA's CEO. Nick is responsible for shaping and leading the strategic direction and culture of Lincolnshire FA, and for leading the day to day running of the organisation - ensuring the effective delivery of its business plan and strategy. He works with the Board of Directors on matters relating to workforce, finance, corporate governance, football development and services, marketing, communications, public relations and risk management. He also ensures the Association effectively implement and maintains the FA’s Safeguarding 365 Operating Standard within Football. Mark Pover Mark is the Director for Football Growth & Retention. Mark has over 30 years in sports and leisure management with a genuine enthusiasm for sport and a belief in its ability to break down barriers and strengthen communities. Mark played football in a semi-professional capacity and also coached football at Huddersfield Town and Leeds United. Mark was the England Deaf Team Manager and still enjoys playing football being a regular participant in the Lincolnshire walking football league. Mark is a Director of the Northern Premier League and worked for the Football Association for 17 years as the National Facilities & Investment Manager delivering over £1B of capital projects via the Football Foundation. This investment included schools, football clubs and local authority sites that have since benefitted millions of people. Mark also procured and delivered frameworks for 3G pitches (£150M), grass pitches (£10M) and modular buildings (£20M) and was also part of the FIFA technical advisory group. Leanne Mayo Leanne is the Director for Finance. Leanne is the former Chief Executive and Board Director at Scunthorpe United Football Club, as well as being the former Senior Safeguarding Lead for the club. Leanne’s background is in finance, with extensive experience as a qualified accountant and Chartered Tax Adviser in accountancy and audit practice, manufacturing and banking She has worked in elite sport since 2010. Tony Reynolds Tony is the Director for Partnerships. Tony has built a 30-year career in Financial Services, with the last two decades as a Senior Director in Corporate and Commercial Banking for a major UK Bank. He brings extensive Commercial knowledge and experience to the Board to support growth and prosperity of the association. Despite working across the UK and based in London for a number of years, Tony has always maintained his home and family in Lincoln, where he was born and spent his childhood. In 2021, he decided to step away from his corporate career to focus on using these skills to add value to businesses and organisations in Lincolnshire, most recently working with Lincolnshire County Council on inward investment. An avid Lincoln City supporter and season ticket holder, his love for the game started as a youngster watching Lincoln City with his father in the 1970s. Additionally, having spent many Sundays watching his children play local football from under 6 to under to under 15, he has seen for himself the excellent work and guidance young people experience from parents and volunteers involved in playing grassroots football. Tony says having the opportunity to put something back into the community, which contributes to the health and wellbeing of Lincolnshire people, is compelling and looks forward to contributing to making a difference. Angela Westley Angela is the Director for Inclusion. Angela has a background in research, insight and strategy, previously in the private sector and now within the sports sector, currently heading up the Insight & Strategy Team at British Rowing. Diversity & Inclusion is a big part of what Angela does day-to-day and she is passionate about tackling any inequalities within any sport. She has recently undertaken a large research study on the issues and challenges within the diversity and inclusion space, and believes it is critical to listen to the lived experiences of those who do not feel included. Angela has lived in Lincolnshire since 2008 and has been part of the football community through her sons playing at grassroots level and within development programmes. She has lived and breathed football all her life and has enjoyed many moments in football grounds all over the country or on the touchline at the local field. Andrew Whitham Andrew is the Director for Commercial. Andrew Whitham has a career spanning 20 years across all levels of professional football in the English football pyramid. He has held a position at Lincoln City Football Club as Director of Sales for 5 years, with his role within the club including managing commercial revenue, communications, marketing, supporter services, CRM and data. He was influential in Lincoln City’s recent investment in new technology to improve communication and marketing through new software. He started his journey in football with Sheffield United, enjoying promotion to the English Premier League in his first season. Another string to his bow is he is a qualified WSET sommelier and delivers wine tasting events. Outside work, he enjoys football at all levels, cycling and badminton. Chris Cook OBE Chris is the Director for Safeguarding. Chris worked for Lincolnshire Police for thirty-two years and retired as a senior police officer. Since November 2009, he has been the Independent Chair of the Lincolnshire Safeguarding Children Partnership. Chris has also gained experience as the Independent Chair of the Nottingham City, Derbyshire and North East Lincolnshire Safeguarding Children Partnership. He is also currently the Chairman of the Lincolnshire Police and Crime Panel. Chris has a keen interest in all levels of football and is a supporter of both Boston United and Tottenham Hotspur. He has formerly played grassroots football in Lincolnshire and currently supports his two grandsons who play for local teams in the Boston area. He also has a keen interest in tennis and is Chairman of Boston Tennis Club. Oliver Tasker Oliver is the Director for HR & People. Oliver Tasker is a Partner and the Head of the Employment law team at Wilkin Chapman LLP, the largest law firm in Lincolnshire and East Yorkshire with 4 offices and over 400 staff. On a day to day basis, he provides strategic and commercial advice on all types or employment law and HR issues to businesses around the UK including a number of professional sports clubs and bodies. Oliver was also a Non-Executive Director / Trustee of Active Lincolnshire for six years sitting on their main board, acting as Chair of the governance and standards committee and latterly sat on the finance committee. Oliver is from Lincolnshire and now lives in Lincoln with his wife and young daughter, with number two due to arrive shortly. Oliver is passionate about all things football, sport, health and wellbeing and is a strong advocate for Lincolnshire. He is a life-long Imps fan and has played football at various levels from an early age, throughout University and after returning to Lincolnshire he mainly played in the former Lincoln Saturday League. LINCOLNSHIRE FA STAFF MEMBERS Meet the team... Nick Hanson (he/him) CEO, and Senior Safeguarding Lead As CEO, Nick leads the strategic direction, culture, and daily operations of Lincolnshire FA. He works closely with the Board to oversee key areas including workforce, finance, governance, football development, marketing, communications, and risk management. Nick ensures the successful delivery of the Association’s business plan and the ongoing implementation of The FA’s Safeguarding 365 Operating Standard across grassroots football in Lincolnshire. Click here to email Nick Development Team Responsible for supporting the growth and development of football in Lincolnshire. To speak to a member of the team, reach out via their email address or call 01522 596580 Jake Park (he/him) Head of Football Development and Facilities & Investment Lead Jake leads the Development Team and all pathway areas, including Women & Girls’, Male & Mixed, Disability & Inclusion football, and Refereeing. As Strategic Lead for Inclusion and Deputy Senior Safeguarding Lead, he also plays a key role in shaping a safe and inclusive game. Jake’s core focus is on improving football facilities across Lincolnshire - driving investment through the Football Foundation to deliver new 3G pitches, pavilions, and grass pitch improvements, while ensuring existing facilities are protected and sustainable. He also provides strategic direction for the wider Football Development department. Click here to email Jake Tom Padden (He/Him) Football Development Manager (Disability and Inclusion) Tom leads on developing and growing disability football across Lincolnshire, ensuring inclusive opportunities exist for all, regardless of disability or impairment, through both pan-disability and impairment-specific formats. He also drives the Association’s inclusion work, overseeing the Diversity and Inclusion Action Plan, supporting the team on EDI matters, and working toward achieving the Equality Standard for Sport. Tom plays a key role in the Lincolnshire Ability Counts League, helping to shape and support its continued development. Click here to email Tom Declan Ford Referee Development Manager Dec is responsible for leading the development and support of referees across Lincolnshire. His role includes recruiting new referees through FA Referee Courses, creating an inclusive and supportive environment, and guiding trainee referees to qualification. He oversees a dedicated team of Observers, Coaches, and Mentors, supports New Referee Support Leads, and works closely with leagues to help ensure match coverage. Dec also provides clear development pathways for referees across all formats of the game - such as Walking Football, Futsal, and Disability Football - and focuses on the ongoing retention and progression of referees at every level. Click here to email Dec Kirsty Dixon (She/Her) Football Development Officer (Women & Girls) Kirsty leads the strategic development of Women’s & Girls’ football across Lincolnshire. Her role focuses on creating and promoting an inclusive player pathway that spans education, recreation, competition, and talent development - supporting the growth and retention of female players at all levels. She works closely with key partners and local clubs to achieve strategic goals, helps expand and sustain the county’s Women & Girls’ League, and supports clubs in creating female-friendly environments through The FA’s Equal Game Programme. Click here to email Kirsty Luke Craggs (He/Him) Football Development Officer (Male Pathway) & Grass Pitch Programme Support Luke is responsible for using data and insight to shape local solutions that support the male football pathway in Lincolnshire. He monitors how adult football is played across both the affiliated and recreational game, identifying opportunities to grow participation and improve access. Luke leads on recreational programmes to engage new audiences, supports the delivery of quality pitches for affiliated fixtures, and helps grassroots clubs access funding through advice on grants and funding opportunities. Click here to email Luke OPERATIONS Team Responsible for supporting the running and governance of football in Lincolnshire. To speak to a member of the team, reach out via their email address or call 01522 596580 Ben Pearce (He/Him) Head of Safeguarding & Football Operations Ben leads Lincolnshire FA’s safeguarding and discipline work, ensuring compliance with legislation and FA safeguarding policies. He manages safeguarding concerns and child protection matters in line with FA guidance, and plays a key role in delivering the FA’s Safeguarding Operating Standard. Ben works closely with The FA, statutory agencies, and clubs to ensure concerns are handled effectively and efficiently. He also supports clubs and leagues by providing training and guidance to help them manage complaints and concerns appropriately and in a timely manner. Click here to email Ben Hayley Gregory Business Support Officer (Discipline) Hayley manages investigations into reported cases of misconduct, providing comprehensive support to all stakeholders involved, including clubs, players, referees, victims, accused parties, and parents when applicable. She also assists with player registrations, club affiliations, and league and tournament affiliations. In addition, Hayley serves as a member of the Association’s Rules Committee, contributing to the development and enforcement of governance standards. Click here to email Hayley Alice Toynbee Business Support Officer (Part Time) Alice plays a key role in the day-to-day operations of Lincolnshire FA, supporting our governance, events, and key football services. Her responsibilities include managing FA systems such as Full-Time and the Clubs & Competitions Portal, processing payments for discipline, affiliations, and County Cup entries, and overseeing the Benevolent Fund. She also coordinates FA ticket allocations, supports our Governance Structure, and helps deliver major events like the Grassroots Football Awards and County Cup Finals. In addition, Alice manages the sanctioning of tournaments and competitions, and assists with the affiliation and registration of referees, clubs, and leagues. Click here to email Alice Partnerships & Engagement Team Responsible for managing both commercial and community partnerships to benefit the game in Lincolnshire, engaging our stakeholders including through Media, Marketing & Communications and the Thriving Community Clubs programme. To speak to a member of the team, reach out via their email address or call 01522 596580 Jake Longworth (He/Him) Head of Partnerships & Engagement As a Senior Leadership Team member, Jake leads the implementation of The FA National Game Strategy alongside the Lincolnshire Football Association’s Business Strategy. He supports England Football Accredited clubs in enhancing their sustainability by promoting community club engagement, aligning support services, and fostering collaboration among stakeholders. Jake is also responsible for identifying new corporate sponsorships and partnerships, maximising existing opportunities to generate revenue that is reinvested into grassroots football. Additionally, he develops and executes the Association’s commercial strategy and leverages data insights to drive commercial growth. Click here to email Jake Stuart Houlton Football Development Officer (Clubs & Workforce) Stuart Houlton is the Clubs & Workforce Football Development Officer for the Lincolnshire Football Association, and leads on developing and supporting England Football Accredited clubs across Lincolnshire, helping them grow, sustain participation, and enhance player experiences. He also coordinates coach development, delivering learning opportunities and supporting the recruitment and progression of diverse coaching talent. Stuart plays a key role in volunteer development, offering practical support, guidance, and access to funding, while also ensuring clubs meet safeguarding standards. He line-manages the Competitions Officer to support the delivery of County Cups and contributes to maintaining a safe, inclusive football environment. His work helps clubs, coaches, and volunteers thrive across the grassroots game. Click here to email Stuart Zack Leader (He/Him) Media, Marketing & Events Officer Zack leads the development, implementation, and ongoing review of the Association’s media, marketing, and communications strategies. He is responsible for enhancing the Association’s image, profile, and reputation while maintaining brand integrity. Zack oversees the Association’s website, email marketing and social media channels, ensuring they serve as key information hubs for all stakeholders. He coordinates the design and publication of printed materials, builds relationships with local media to secure regular coverage of the Association’s work, and manages commercial partnerships to ensure mutual objectives are met. Click here to email Zack Owen Hardwick (He/Him) Media & Volunteer Engagement Assistant Owen plays a vital role at Lincolnshire FA by delivering high-quality media coverage and promotional activities to strengthen the organisation’s brand and stakeholder engagement. He supports live coverage and media coordination for County Cup Finals, supports promotional campaigns and event coverage for the Grassroots Football Awards, and helps organise and promote volunteer recognition initiatives that celebrate local football heroes. Click here to email Owen Related News View All News Rueben Padbury Crowned Veo Goal of the Season Winner The votes are in – and we’re delighted to announce that Rueben Padbury has been named the… News Referees Honoured at 2025 Lincolnshire FA Referee Celebration Evening Lincolnshire FA was delighted to welcome referees from across the county to the 2025 Referee… News Lincolnshire Referee Gavin Sartain Awarded International Cap Current Level 5 official, Gavin Sartain, has been formally recognised with an international… News Celebrating Dedication: Lincolnshire FA Service Recognition Award Winners… We're proud to announce the 2025 Service Recognition Award winners, celebrating the… News Join TeamWalk: Helping to Shape the Future of Walking Football in… TeamWalk is The FA’s national network of organising groups for Walking Football. It exists to… News Updated measures introduced to improve behaviours in grassroots football The Football Association has announced an updated set of measures for the 2025-26 season to… News Veo Goal of the Month Returns for 2025/26 Season The Veo Goal of the Month competition is giving players across Lincolnshire the chance to… News Steve Rowley Wins Bobby Moore Award at the 2025 Grassroots Football Awards Lincolnshire FA is thrilled to announce Steve Rowley from Long Bennington FC as the winner of… News First Round Draws Confirmed for County Junior Cup and County Sunday Cup The opening round fixtures for two of our most historic competitions – the County Junior Cup… Contact Us Terms of use Privacy Policy Copyright Cookie Policy Follow us Facebook Twitter YouTube One Lincolnshire Community: United and Inspired by the Power of Football One Lincolnshire Community: United and Inspired by the Power of Football Lincolnshire FA © 2001 - 2025. All Rights Reserved Our website uses cookies to help improve your experience A functional cookie (which expires when you close your browser) has already been placed on your machine. More details Accept cookies"
    },
    {
      "url": "https://estates.lincoln.ac.uk/services/about/",
      "text": "About Us – Estates The University of Lincoln offical logo Staff Students Alumni Jobs Support Us Explore University of Lincoln Resources For Students For Staff Estates Support Desk Academic Support Health and Wellbeing Careers and Employability Sports Centre Student Services Accommodation IT Help Learning at Lincoln Cost of Living Support Student Life Library Room Booking Explore More One Uni Portal My View Student Attendance Portal Room Booking Library IT Help Staff Directory Estates Support Desk University Calendar Staff Appraisals Staff News PPC Home Page Explore More Estates Search Estates : Search Estates : About Us About Us Awards and Accreditations Support Desk Campus Information Campus Information Brayford Campus Campus Maps Holbeach Campus Lawress Hall Library Learning Lounges Property Management Riseholme Park Riseholme Park Farm Parking, Travel and Transport Authorised Driver Campus Linc, Buses and Trains Visitors Cycling Parking Walking / Running on Campus News Services Contractor Management Incident Management Maintenance Planned Works Policies & Implementation Standard Specifications Service Level Agreement Development Development Current Projects Estates Change Request Masterplanning & Strategy Project Archive Space Sustainability Sustainability at Lincoln Biodiversity Community Engagement & Partnerships Education for Sustainable Development Energy and Carbon Management Energy and Environmental Management System (EEMS) Environmental Policy Get Involved Recycling and Waste Management Sustainability Team and Governance Sustainability News Sustainable Transport Staff Students Alumni Jobs Support Us About Us The Estates department is responsible for maintaining and developing the University’s physical environment. We provide facilities and services which support every campus user, every day. Our Vision To provide a class leading estate for all with core values of sustainability, innovation, and safety. We aim to develop a vibrant, sustainable, and accessible campus which meets the needs of students, staff, and the wider community. Our objectives sit under four main headings, University Experience , Place , Net Zero and Financial Innovation . You can read more about our objectives in our Estates Strategy . View our Estates Annual Report below: Estates Annual Report 23-24 Our  Team The department is led by the Director of Estates, Mr Grant Anderson. The Director reports to the Chief Operating Officer. The department employs over 50 staff in various service teams: Operations Estates Support (Planon and Support Desk) Compliance Facilities Management Riseholme Park Farm Sustainability Energy & Carbon Management Sustainability projects and engineering Communications Maintenance Building Fabric Engineering Contract Management Minor Works Development Project Management Space Management Cost Management Property Management Estates Senior Leadership Grant Anderson Director of Estates granderson@lincoln.ac.uk Kevin Macdonald Deputy Director of Estates kmacdonald@lincoln.ac.uk Craig Smith Head of Development CraSmith@lincoln.ac.uk Paul Labiche Head of Maintenance plabiche@lincoln.ac.uk Rebecca Mills Head of Sustainability remills@lincoln.ac.uk Claire Lea Interim Head of Sustainability clea@lincoln.ac.uk Matt Bagley Farm & Estate Manager (Riseholme) mbagley@lincoln.ac.uk Estates Strategy The strategic objectives for the development of the University Estate View more about this article titled Estates Strategy . Campus Information Campus maps, opening times, travel and transport View more about this article titled Campus Information . Estates Riseholme Park Lawress Hall, Riseholme Lincoln, LN2 2LG 01522 886777 Email us Facebook Instagram LinkedIn The University of Lincoln offical logo Instagram X Facebook TikTok YouTube LinkedIn University of Lincoln Brayford Pool Lincoln LN6 7TS UK +44 (0)1522 882000 Maps and Directions Contact Us Staff Directory Term Dates Jobs Policies The University of Lincoln offical logo Accessibility Privacy Freedom of Information Anti-Slavery Statement Admissions Terms and Conditions Transparency Information Access and Participation Plan ©  Estates Viewing Message: 1 of 1. Notice We use cookies to understand how visitors use our website and to improve the user experience. To find out more, see our Cookies Policy . >Dismiss this notice."
    },
    {
      "url": "https://www.tes-property.co.uk/contact/",
      "text": "Contact Us | Property Agents in Louth, Lincolnshire | TES Property Commercial Residential → 01507 601 633 admin.louth@tes-property.co.uk Home Services Commercial Residential About News Commercial Residential Surveys Valuations EPCs Complaints Procedure Contact Us Telephone 01507 601 633 Address 6-8, Cornmarket, Louth, Lincolnshire LN11 9PY Email admin.louth@tes-property.co.uk You can reach us in a variety of ways, the easiest is to drop us a message using the form below – alternatively get in touch with one of many branches where we’ll be able to assist you further. Name Email Telephone Message This form collects your details so that our team can communicate with you and provide assistance. Please check our Privacy Policy to see how we protect your submitted data. I consent to having TES Property (Lincolnshire) Ltd collect my details via this form Send Enquiry Commercial Residential Surveys Valuations EPCs Complaints Procedure Property Services About Contact Privacy Policy 01507 601 633 admin.louth@tes-property.co.uk 6-8, Cornmarket, Louth, Lincolnshire LN11 9PY © 2025 TES Property (Lincolnshire) Ltd. All Rights Reserved. | Privacy Policy Website by Yello"
    },
    {
      "url": "https://investinnorthlincolnshire.com/contact-us",
      "text": "Get in touch | Invest in North Lincolnshire Why here Why North Lincolnshire? North Lincolnshire's strategic location provides a world-class business destination to set up and grow your business. Best place To live, work, visit and invest Our location Perfectly placed, perfectly balanced Key sectors The key industries in North Lincolnshire Business support Business support From pre start-ups to multinationals we are here to support your business needs. Business support Pre start-ups Advice for an initial business concept Start-ups Information on setting up your own business Business advice Helping your business grow Grants and funding Financing your business growth Skills support Labour Market Briefing North Lincolnshire's labour market overview Skills and education Skills support for your business. Apprenticeships Boosting skills, productivity, and future talent. News and events News and events Find business related news and events in North Lincolnshire. News Business focus Latest business news Roadworks Current roadworks in North Lincolnshire Events Upcoming events Upcoming business events Space to grow Get in touch Open main menu Why here Best place To live, work, visit and invest Our location Perfectly placed, perfectly balanced Key sectors The key industries in North Lincolnshire Business support Business support Pre start-ups Advice for an initial business concept Start-ups Information on setting up your own business Business advice Helping your business grow Grants and funding Financing your business growth Skills support Labour Market Briefing North Lincolnshire's labour market overview Skills and education Skills support for your business. Apprenticeships Boosting skills, productivity, and future talent. News and events News Business focus Latest business news Roadworks Current roadworks in North Lincolnshire Events Upcoming events Upcoming business events Space to grow Get in touch Home Get in touch Get in touch Let us know how we can help grow your business. Contact us We are here to assist you with any business related enquiries, whether you have general questions, need support setting up your business, or want to discuss potential funding opportunities. Please feel free to reach out to us, and our team will get back to you promptly. +44 (0)1724 297330 investinNLC@northlincs.gov.uk for inward investment enquiries businessinfo@northlincs.gov.uk for all other enquiries Social media Business newsletter Sign up to our business newsletter to receive emails with related news, events and funding opportunities. Business newsletter Web enquiries Name* Company Email* Phone* Message* Submit Meet the team Matthew Collinson Lead Officer – Economic Growth Project Cheryl Smith Business Engagement Officer Sector Lead for Energy & Chemicals Abdi Farah Economic Growth Specialist Amy Robinson Inward Investment Business Specialist Justine Duhrkoop Inward Investment Business Specialist Russell Hardy Business Advisor Susan Doherty Business Advisor Stevie Joynson Business Support Ambassador Sector Lead for Food, Drink, Manufacturing & Engineering Laura Valentino Business Support Ambassador Sector Lead for Construction & Steel Georgia Simpson Business Support Ambassador Assistant Why not make North Lincolnshire your next investment. Grow North Lincolnshire. Be part of it. Useful links Why here? Grants and funding Business focus Events Get in touch Cookie policy Privacy policy Terms and conditions Business newsletter Sign up to our business newsletter to receive emails with related news, events and funding opportunities. Business newsletter Follow us Copyright © North Lincolnshire Council 2025. Business newsletter Sign up to our business newsletter to receive emails with related news, events and funding opportunities. Email Company By checking this box, you consent to our data privacy policy . Submit Cancel Thank you for signing up to our business newsletter. We use cookies This website uses cookies in order to enhance the overall user experience. Take a look at our cookie policy for more information. Only essentials Accept all Customize Essential cookies There are some cookies that we have to include in order for certain web pages to function. For this reason, they do not require your consent. invest_in_north_lincolnshire_cookie_consent 1 year 1 month 1 day Used to store the user's cookie consent preferences. invest_in_north_lincolnshire_session 2 hours Used to identify the user's browsing session. XSRF-TOKEN 2 hours Used to secure both the user and our website against cross-site request forgery attacks. More details Analytics cookies We use these for internal research on how we can improve the service we provide for all our users. These cookies assess how you interact with our website. _ga 2 years 2 months 2 days Main cookie used by Google Analytics, enables a service to distinguish one visitor from another. _ga_C7DKG6FQ3J 2 years 2 months 2 days Used by Google Analytics to persist session state. _gid 1 day Used by Google Analytics to identify the user. _gat 1 minute Used by Google Analytics to throttle the request rate. _clck 1 year 1 month 1 day Persists the Clarity User ID and preferences, unique to that site is attributed to the same user ID. _clsk 1 month 2 days Connects multiple page views by a user into a single Clarity session recording. CLID 1 year 1 month 1 day Identifies the first-time Clarity saw this user on any site using Clarity. ANONCHK 1 year 1 month 1 day Indicates whether MUID is transferred to ANID, a cookie used for advertising. Clarity doesn't use ANID and so this is always set to 0. MR 1 year 1 month 1 day Indicates whether to refresh MUID. MUID 1 year 1 month 1 day Identifies unique web browsers visiting Microsoft sites. These cookies are used for advertising, site analytics, and other operational purposes. SM 1 year 1 month 1 day Used in synchronizing the MUID across Microsoft domains. More details Save settings"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/comments-feedback/contact-us",
      "text": "Contact us – Lincolnshire County Council Skip to content Skip to navigation Lincolnshire County Council Search Search My Account Account Menu Close menu Schools and education Roads and transport Jobs and careers Births, deaths and ceremonies Recycling and waste Council and councillors Childcare and family support Libraries and leisure Environment and planning Social care and health Fire, emergencies and crime Business and consumer Latest news Translation View menu Home Council and councillors Your comments and feedback Contact us Contact us To help find services and information, you can use the site search or the following interactive form. Show all sections Births Show Use our online service to: Amend or cancel your appointment Order a birth certificate Register a birth Re-register a birth Visit our births section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Blue Badge Show Use our online service to: Apply for a blue badge Report a lost or stolen blue badge Report misuse of a blue badge Visit our blue badge page for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Marriages and civil partnerships Show Use our online service to: Book a marriage or civil partnership ceremony Book a citizenship ceremony Find information on religious ceremonies Find a licenced venue for civil ceremonies Give notice of marriage or civil partnership Obtain a certificate of no impediment (opens external website) Order a certificate Pay for a ceremony Visit our marriages and civil partnerships section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Childcare and family support Show Report a safeguarding concern Use our online service to find information about: Adopting and fostering Early years education Keeping children safe Special educational needs and disabilities (SEND) Young people Visit our Childcare and family support homepage for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Deaths Show Use our online service to: Book, amend or cancel a death registration appointment Claim for inquest expenses Find an inquest Order a death certificate Register a death Request information about deceased individuals Visit our deaths section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Early years education Show Use our online service to: Access children’s health services Find a children’s centre Get help with childcare costs Get information for support for childcare providers Get information for Working in childcare Join a children’s centre Search for childcare Visit our early years education section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Environment and planning Show Use our online service to: Find a planning application Find information on flood risk management Find information on Historic Environment Make a planning application Visit our environment and planning page for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Highways Show Use our online service to: Apply for licences and permits Check progress of a fault Find a traffic regulation order Make a highways claim Report a flooding or drainage problem Report a pothole Report a problem at roadworks Report an obstruction Report a street lighting problem Report overgrown trees or hedges Report other faults Visit our roads and transport homepage for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Libraries Show Use our online service to: Check activities available at libraries Check facilities available at libraries Check library opening hours Connect to a library Renew a library book Renew membership Reserve a library book Reset PIN Search the catalogue View archives Contact the library service directly for any other account queries. Visit our libraries and archives section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Parking Show Use our online service to: Pay a parking fine Challenge a parking fine Visit our pay or challenge a parking fine page for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Public transport Show Use our online service to: Apply for a free buss pass Renew a buss pass Replace a lost, damaged or stolen bus pass Visit our public transport section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Recycling and waste Show Use our online service to: Apply for a recycling centre permit Book, amend or cancel an asbestos booking Check eligible waste types Find details of your bin collections Find recycling centre opening hours Report a missed bin collection Report fly-tipping Request a new bin Visit our recycling and waste homepage for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Road safety Show Use our online service to: Book, amend or cancel a speed awareness course Find costs, times and duration of speed awareness courses Visit our Lincolnshire Road Safety Partnership section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Schools and education Show Use our online service to: Apply for a school place Apply for free school meals Find information about school admissions Find School term times Find information about school and pupil support Find information about early years education Visit our schools and education homepage for more information about this service. Alternatively, use our general enquiries form if you need further assistance. School and college transport Show Use our online service to: Apply for concessionary transport Apply for home to school transport Apply for transport for children with special educational needs and disability (SEND) Cancel transport permanently Change transport arrangements (reapply for transport) Confirm a school's designated transport area Order and/or pay for replacement school travel pass Pay for concessionary transport Reapply for transport following a house move Report a school transport incident Report frequently late running transport Report missing transport Report non arrival of school bus pass Request a bus swap Request your PAY number Request your TRA number Submit appeal (reception to year 11) Submit appeal (post 16) Visit our school and college transport section for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Social Care and Health Show Report a safeguarding concern Use our online service for information about: Adult social care Children's care Disability Health and wellbeing Support for carers Support to live independently Safeguarding Visit our social care and health homepage for more information about this service. Alternatively, use our general enquiries form if you need further assistance. Other enquiries Show You can use our general enquiries form if you need further assistance. Note that we may take longer to respond to enquiries using this form as they must be manually passed to the correct service. Alternatively, you can: write to Lincolnshire County Council, County Offices, Newland, Lincoln, LN1 1YL chat to Impy online through the 'Ask Impy' button across our website. Impy digital assistant Some telephone calls will first direct to our digital assistant, Impy, who can help you with routine enquiries. If Impy is not able to help, you will then be put through to an advisor. Impy is not designed to deal with safeguarding concerns or take reports of emergencies. If your call is about these you will be directed to the right advisor straight away. By letting Impy deal with routine questions, we can free up time for our call handlers to support our more vulnerable residents, and deal with sensitive enquiries. If you have any issues with the Impy digital assistant, please get in touch . Social care enquiries Email csc_socialcare@lincolnshire.gov.uk For adults, call 01522 782155 For children's, call 01522 782111 Call 01522 782333 (emergency out of hours) Deaf or hard of hearing If you are deaf or have profound hearing difficulties use the Next Generation Text service to access our services . Media enquiries For press requests please email news@lincolnshire.gov.uk . For filming enquiries please view Filming in Lincolnshire . Print this document Safeguarding Report a safeguarding concern Complaints Make a complaint Freedom of Information Submit an FoI request Information about deceased individuals Request information County catch-up Sign up to our newsletter and get all the latest updates direct. Sign up to our newsletter Follow us on Facebook (opens in new window) Follow us on X (opens in new window) Follow us on Linked In (opens in new window) Follow us on Instagram (opens in new window) Privacy Cookies Accessibility Contact us Modern slavery Lincolnshire County Council All content © 2025  Lincolnshire County Council. All Rights Reserved. Designed and Powered by Jadu ."
    },
    {
      "url": "https://www.lincolnshiremgmt.com/lincolnshire-management-adds-four-to-growing-investment-team/",
      "text": "Lincolnshire Management Adds Four to Growing Investment Team - Lincolnshire Management About Leadership Portfolio News Contact About Leadership Portfolio News Contact Lincolnshire Management Adds Four to Growing Investment Team May 24, 2022 Firm invests in additional resources and capabilities to continue to source and close attractive investments NEW YORK – May 24, 2022 – Lincolnshire Management, Inc. (“Lincolnshire”) a private equity firm focused on investing in and acquiring growing middle-market companies across various industry sectors, today announced the addition of four professionals to its investment team.  Matt Landolphi joins Lincolnshire Management as a Senior Associate, Chris Kostoglou joins as an Associate, and Michael Morris and Stephen Dawson join as Analysts. “We are pleased to add these up-and-coming investors and operations-minded professionals to our growing team,” said T.J. Maloney , Chairman and CEO of Lincolnshire Management.  “They will be instrumental in adding to our sourcing efforts and helping us close attractive investments in founder-owned businesses and corporate carve-outs, which has been our long-standing, successful model.” Lincolnshire Management’s 36-year track record of investing successfully through multiple business and economic cycles has honed a hands-on operational focus that creates value in its portfolio companies.  The firm has a long history and track record of success investing across various industries, especially niche manufacturing, distribution, and service businesses. The firm’s current investment portfolio includes Allison Marine , Barrier , CrossCom , Dalbo Holdings Inc. , Desch Plantpak , Latite Roofing , Nursery Supplies Inc. , Powerhouse and True Sports . 4 New Additions to Investment Team Matt  Landolphi joins as a Senior Associate and member of the Deal Execution and Diligence Team at Lincolnshire.  Previously, he was a Senior Associate in Conway MacKenzie’s Private Fund Services group where he provided portfolio management and advisory services to private capital funds’ stakeholders.  Earlier in his career, Matt was an investment banking Associate at Sandler O’Neill + Partners, L.P., where he worked on M&A, capital raising and asset sale processes.  Matt holds a B.S. in Mechanical Engineering from Vanderbilt University. Chris Kostoglou joins as an Associate and member of the firm’s Deal Execution and Diligence Team.  He was previously a Manager in EY’s Strategy & Transactions practice specializing in providing due diligence and M&A advisory services to private equity and strategic corporate clients on transactions valued from $15 million to $2 billion.  Chris holds a Bachelor of Business from the University of Technology, Sydney, where he graduated with distinction, and a Graduate Diploma of Chartered Accounting from the Institute of Chartered Accountants Australia & New Zealand. Michael Morris joins the firm as an Analyst from Calex Partners, a healthcare services focused M&A investment bank, where he advised on a number of sell-side transactions.  Previously, Michael was an Associate in the management consulting group at KPMG and he worked as an Analyst at Raytheon Company (now known as Raytheon Technologies).  He graduated from James Madison University with a B.B.A. in Finance. Stephen Dawson joins Lincolnshire as an Analyst after serving as an Assistant Manager in the Foreign Direct Investments and Consumer Markets Departments of PwC.  Stephen graduated from the Dublin Institute of Technology with a Bachelor of Science in Accounting and Finance and the PwC – Chartered Accountants training program focusing on Financial Reporting, Strategic Finance, Business Advisory, Risk Management & Sustainability. “This is an apprentice business, and we are excited to bring in and mentor this next group of professionals who will have opportunities to work alongside our seasoned investors to build companies and create value,” said Phil Kim , Managing Director About Lincolnshire Management, Inc. Lincolnshire Management, founded in 1986, is a private equity firm focused on investing in and acquiring growing middle-market companies across an array of industries. Headquartered in New York and an office in Chicago, Lincolnshire invests in acquisitions of private companies, recapitalizations, corporate divestitures, management buyouts and growth equity for public and private companies. Lincolnshire has $2.0 billion under management, completing over 100 transactions across the lower middle market. For more information: www.lincolnshiremgmt.com . Media Contact: Thomas Zadvydas Stanton tzadvydas@stantonprm.com 646-502-3538 Download this Press Release in PDF Lincolnshire Management, Inc. 780 Third Avenue, 40th Floor New York, NY 10017 212-319-3633 info@lmi780.com About Leadership Portfolio News Contact Copyright © 2025 Lincolnshire Management, Inc."
    },
    {
      "url": "https://www.lincolnshiremgmt.com/leadership/",
      "text": "Leadership - Lincolnshire Management About Leadership Portfolio News Contact About Leadership Portfolio News Contact Lincolnshire Management is led by a team of executives that combine investment acumen, operational know-how, and the experience required to build strong and durable companies. Leadership The diverse backgrounds of each member of the team brings a unique value-add to every investment, and the firm’s executives understand how to compliment and build upon on one another’s strengths to create the best outcomes for the firm’s portfolio companies, partners, and investors. Lincolnshire Management creates teams that truly understand how to provide the support and resources companies need to grow, how to align the interests of various stakeholders, and how to deliver lasting strategic value. Investment Committee Philip Kim Co-Managing Partner / Execution Tad Nedeau Co-Managing Partner / Origination T.J. Maloney Chairman and CEO Michael J. Lyons President / Operations George J. Henry Managing Director Investment Professionals John Comino Managing Director Ottavio Serena Managing Director Matt Nacier Principal Nicolas Vega Llona Principal Matt Landolphi Principal Michael Morris Associate Ritik Patel Associate Kira Bigelow Analyst Stephen Dawson Analyst Betsy Corbin Investor Relations and Sustainability Officer Kevin Nappi Controller Jared Margulies Assistant Controller Senior Operating Partners David Corbin Senior Operating Partner John Waldron Senior Operating Partner Senior Advisors Vineet Pruthi Senior Managing Director Thomas R. Callahan Managing Director Pieter Kodde Managing Director Philip Jakeway Managing Director Doug Bagin Advisor James G. Binch Senior Advisor James McLaughlin Managing Director John O’Connor Managing Director Lincolnshire Management, Inc. 780 Third Avenue, 40th Floor New York, NY 10017 212-319-3633 info@lmi780.com About Leadership Portfolio News Contact Copyright © 2025 Lincolnshire Management, Inc."
    },
    {
      "url": "https://integrity-fl.com/properties/j.smith/",
      "text": "James Smith Listings 8405 US-301 Suite 102, Parrish, FL 34219 (941) 345-5583 Facebook Twitter Youtube Instagram For Sale For Sale For Rent New Build Mortgage 21st Mortgage Approved Credit Services South State Bank Tammac Holding Corporation CountryPlace Mortgage Park Lane Financing Priority Funding Loan Company MLS Listings Parks All Age Parks Pet Friendly Parks Communities Boat and RV Storage Sell Your Home Get Started, Sell Your Home About Us About Integrity About the Team Locations Integrity South (Main Office) Integrity North Blog More Info Contact Us Contact Find an Agent Agents by County Locations Integrity South (Main Office) Integrity North Realtor Agents For Sale For Sale For Rent New Build Mortgage 21st Mortgage Approved Credit Services South State Bank Tammac Holding Corporation CountryPlace Mortgage Park Lane Financing Priority Funding Loan Company MLS Listings Parks All Age Parks Pet Friendly Parks Communities Boat and RV Storage Sell Your Home Get Started, Sell Your Home About Us About Integrity About the Team Locations Integrity South (Main Office) Integrity North Blog More Info Contact Us Contact Find an Agent Agents by County Locations Integrity South (Main Office) Integrity North Realtor Agents CALL NOW Properties James Smith Mobile: (813) 767-9583 Email: Counties of Operation: Hillsborough, Pasco, Pinellas Representing the Tampa bay area for your mobile home needs. James has been a resident of the Tampa bay area since 1980 when his family relocated from New York city. Growing up in Clearwater and living in Riverview for the last 20 years. James Understands all the benefits of living in the bay area and all it has to offer its residents. James is a customer service expert providing customer service for over 30 years of his work life. James has 2 wonderful kids Jamie and Anthony that are true Floridians born and raised in Tampa Bay area. James is an active in the community playing over 50 softball and enjoying everything the bay area has to offer James goal is to provide you with exceptional customer service selling or buying your mobile home with integrity mobile homes. Going that extra mile for you and your family! Sort Option Highest ID Number Built up Area Price (Most Expensive) Lot Rent (Highest) Date (Newest) Featured Bedrooms Bathrooms Pet-Friendly Year Built Highest ID Number Lowest ID Number Built up Area descending Built up Area ascending Price (Most Expensive) Price (Cheapest) Lot Rent (Highest) Lot Rent (Cheapest) Date (Newest) Date (Oldest) Featured descending Featured ascending Bedrooms descending Bedrooms ascending Bathrooms descending Bathrooms ascending Pet-Friendly descending Pet-Friendly ascending Year Built descending Year Built ascending Grid List More Details Remodeled 2-Bed, 2-Bath in Teakwood Village – Pond View & $705 Lot Ren 498 Red Wing Circle, Largo, Florida 33770 2 Bedroom(s) 2 Bathroom(s) 36 Picture(s) 1,056 Sqft Come see this beautiful remodeled 2 bedroom 2 bathroom home in Teakwood village price to sell. Home has been upgraded with high end flooring ,Quartz countertops, beautiful tile showers and brand new Ac.Enjoy your view of the pond on the screen in the Florida room as well. $69,999 More Details Waterfront Community Living on the Manatee River! 30700 US Hwy 19 N, Lot 102, Palm Harbor, Florida 34684 4 Bedroom(s) 2 Bathroom(s) 32 Picture(s) 867 Sqft Newly renovated 4 bedroom 2 bath home in a family park in palm harbor one of the best school districts in the state !!! New windows, sub floor, lighting, dry wall and mini split air system. move in ready all new appliances as well.Frontier Village, this residence features a monthly lot rent of just $650, covering essential services like lawn care, trash removal, and water/sewer. $89,999 More Details Affordable 2-Bed/2-Bath Doublewide in Teakwood Village! 318 Molokai Drive, Largo, Florida 33770 2 Bedroom(s) 2 Bathroom(s) 29 Picture(s) 1,080 Sqft Come see this fantastic doublewide mobile home in Teakwood Village! This home features two bedrooms and two bathrooms, and boasts a sizable kitchen and ample living room space. The bedrooms have closets and built in dressers, perfect to store your items in. At the front of the home, large windows let in plenty of natural light. Best of all is this home's affordable price. $34,999 More Details Great Investment or Personal Retreat in Paradise Island! 1001 Starkey Road, Lot 149, Largo, Florida 33771 2 Bedroom(s) 2 Bathroom(s) 41 Picture(s) 936 Sqft Great investment property currently a renter that is willing to stay at 1600 a month or she will vacate and you can move in ! 1995 updated 2-bedroom, 2-bathroom mobile home located in a premier community in Largo, Florida. This residence offers a comfortable and stylish living space, ideal for those seeking quality and convenience in a distinguished neighborhood. $57,500 More Details Peace of Mind in Paradise – Updated 3-Bed Home in Amenity-Rich Amber G 3113 State Road 580, Lot 416, Safety Harbor, Florida 34695 3 Bedroom(s) 2 Bathroom(s) 58 Picture(s) 1,248 Sqft Come see this beautiful 2002 skyline home. This 3 bed 2 bath with a split floor plan has been updated with brand new flooring this year ! Ac was replaced in 2022, Roof in 2019 and hot water heater 2023 All the important stuff is done for you ! Plus the amazing landscaping done by the homeowner ! The base Lot rent is 855.57 which is avg in pinellas county. $99,000 More Details Charming 1BD + Bonus Room in Family Park! 1 Month Free Lot Rent! 2266 Gulf to Bay Blvd, Lot 452, Clearwater, Florida 33765 1 Bedroom(s) 1 Bathroom(s) 40 Picture(s) 0 Sqft One month free rent! Come see this charming mobile home in Boulevard Estates Mobile Home Park, a family community. This cozy home features one bedroom and one bathroom with a tub. Home has a closed in patio room that could be used for a 2nd bedroom This home has a new water heater, Roof, electric panel and recently replaced floors. $35,000 Featured More Details Beautifully Remodeled 2-Bedroom, 2-Bathroom Home in Premier 55+ Commun 29081 US Hwy 19 N, Lot 55, Clearwater, Florida 33761 2 Bedroom(s) 2 Bathroom(s) 30 Picture(s) 1,104 Sqft https://www.youtube.com/watch?v=LK4E2-vBmDc&feature=youtu.be3 Months Free Lot Rent!We are pleased to present a beautifully remodeled 2-bedroom, 2-bathroom home located in a highly sought-after 55 and over community. This residence has been meticulously updated to offer both comfort and modernity. $94,500 More Details Flexible Floor Plan in Sought-After Dunedin Village! 17 Sophie Avenue, Dunedin, Florida 34698 3 Bedroom(s) 2 Bathroom(s) 32 Picture(s) 720 Sqft https://www.youtube.com/watch?v=LVcd6Hmyx04&t=5sCome see this unique single wide, and Dunedin Village this home can be a three bedroom one and a half bath or a two bedroom one and a half bath with a den or a pantry however, you feel you'd like to use that extra room. Previous owners used it for a pantry Large enough to put a small twin bed in or a desk with a computer. $25,999 More Details Sturdy & Stylish 2-Bed, 2-Bath Home in Pet-Friendly Grand Bay! 3300 Alt 19 N, Lot 31, Dunedin, Florida 34698 2 Bedroom(s) 2 Bathroom(s) 32 Picture(s) 1,128 Sqft https://www.youtube.com/watch?v=NO7A0TKZ5GQ&feature=youtu.beCome see this beautiful 2018 Jacobsen home. This home is built, hurricane ready. With wind loaded, rated roof, impact resistant windows, reinforce wall systems, fiberglass shingle roofs, trust, roofing system, vinyl, lap, siding, and fiberglass interior wall insulation. Its two bedroom two bath home features 1128 ft. $159,900 More Details Amazing Affordable Florida Gem! Call Today! 2381 Gulf to Bay Blvd, Lot 306, Clearwater, Florida 33764 1 Bedroom(s) 19 Picture(s) 0 Sqft This affordable home has been renovated with plenty of improvements. First, you can see the brand new windows and fresh paint outside the home. Inside, check out the brand new floors, with replaced subfloor as well. This home features a bathroom with a tub and newer vanity countertop. The breaker panel has also been replaced, giving you peace of mind. $13,999 More Details Waterfront 2-Bedroom Home in Shoreline Palms – Remodeled! 12100 Seminole Blvd, Lot 285, Largo, Florida 33778 2 Bedroom(s) 2 Bathroom(s) 54 Picture(s) 1,152 Sqft https://www.youtube.com/watch?v=Dz3rIm0J83cDownsizing for retirement ? This RECENTLY remodeled mobile home is perfect for you!! Located on a quiet lake with a stunning water view. This spacious and bright home features 2 bedrooms, 2 bathrooms, and a very open floor plan with plenty of natural light coming in through the 6 windows facing the lake. $97,000 More Details Cozy 2-Bed, 2-Bath Home with Front Porch in Serendipity MHC! 29081 US Hwy 19 N, Lot 256, Clearwater, Florida 33761 2 Bedroom(s) 2 Bathroom(s) 36 Picture(s) 960 Sqft https://www.youtube.com/watch?v=6WkEzBjYtQECome see this lovely mobile home for sale in Serendipity MHC. This two bedroom two bathroom home has a lovely front porch area with plenty of windows for you to sit, relax, and enjoy the Florida sun. Inside, this home features vinyl plank flooring throughout, with carpeting in the bedrooms. $58,500 Previous 1 2 Next 19 Results returned. Per Page 6 12 18 24 30 100 Facebook Twitter Youtube Instagram At Integrity, we are committed to providing unparalleled service and expertise in helping you find the perfect mobile or manufactured home. Our extensive inventory across Florida ensures you find the best selection to suit your lifestyle and budget. Contact us to learn more and get started. For Sale For Sale For Rent New Build Mortgage 21st Mortgage Approved Credit Services South State Bank Tammac Holding Corporation CountryPlace Mortgage Park Lane Financing Priority Funding Loan Company MLS Listings Parks All Age Parks Pet Friendly Parks Communities Boat and RV Storage Sell Your Home Get Started, Sell Your Home About Us About Integrity About the Team Locations Integrity South (Main Office) Integrity North Blog More Info Contact Us Contact Find an Agent Agents by County Locations Integrity South (Main Office) Integrity North Realtor Agents For Sale For Sale For Rent New Build Mortgage 21st Mortgage Approved Credit Services South State Bank Tammac Holding Corporation CountryPlace Mortgage Park Lane Financing Priority Funding Loan Company MLS Listings Parks All Age Parks Pet Friendly Parks Communities Boat and RV Storage Sell Your Home Get Started, Sell Your Home About Us About Integrity About the Team Locations Integrity South (Main Office) Integrity North Blog More Info Contact Us Contact Find an Agent Agents by County Locations Integrity South (Main Office) Integrity North Realtor Agents Lance@Integrity-FL.com (941) 345-5583 Parrish, FL 34219 Copyright © 2023 Integrity Mobile Home Sales Sitemap"
    },
    {
      "url": "https://www.lincolnshire.gov.uk/directory-record/81098/contact-information-for-heads-of-services",
      "text": "Contact information for heads of services - Find a freedom of information request – Lincolnshire County Council Skip to content Skip to navigation Lincolnshire County Council Search Search My Account Account Menu Close menu Schools and education Roads and transport Jobs and careers Births, deaths and ceremonies Recycling and waste Council and councillors Childcare and family support Libraries and leisure Environment and planning Social care and health Fire, emergencies and crime Business and consumer Latest news Translation View menu Home Council and councillors Your comments and feedback Find a freedom of information request Contact information for heads of services - Find a freedom of information request Contact information for heads of services - Find a freedom of information request Request 1. Can you please advise the names and contact details for the following: • Chief Executive Officer (CEO) of council • Leader of council • The Mayor • Member for the environment. • Member for Climate Change • Member for communities • Director of waste Services • Head of Food waste • Head of Street Team • Head of Waste • Head of Parks • Head of Highways • Head of communities/Neighbourhoods • Head of environment/Climate Change • Director of Place Decision 1. • Debbie Barnes - Debbie.Barnes@lincolnshire.gov.uk • Councillor Martin Hill • Lincolnshire County Council (LCC) does not hold this post. • Councillor C J Davie (Executive Councillor: Economic Development, Environment and Planning) • This is included in the above portfolio. • This will consist of several Councillors for different services. Details of these Councillors can be found here: https://lincolnshire.moderngov.co.uk/mgMemberIndex.aspx?bcr=1 • This is covered by the Director of Place and comes under the Assistant Director for Communities (Nicole Hilton) and Head of Service (Chris Yorston) - Nicole.Hilton@lincolnshire.gov.uk and Chris.Yorston@lincolnshire.gov.uk • LCC does not hold this post. Household waste collection will fall to District and City Councils. • LCC does not hold this post. This will fall under the Assistant Director for Highways (Karen Cassar) - Karen.Cassar@lincolnshire.gov.uk. • Chris Yorston - Chris.Yorston@lincolnshire.gov.uk • LCC do not hold this post. This would come under the Head of Environment (Chris Miller) - Chris.Miller@lincolnshire.gov.uk. • Richard Fenwick (Head of Highways Asset and Local Management Services) – Richard.Fenwick@lincolnshire.gov.uk. • Nicole Hilton (Assistant Director - Communities) - Nicole.Hilton@lincolnshire.gov.uk • Chris Miller - Chris.Miller@lincolnshire.gov.uk • Andy Gutherson - Andy.Gutherson@lincolnshire.gov.uk Contact details for all Councillors can be found on the LCC website: https://lincolnshire.moderngov.co.uk/mgMemberIndex.aspx?bcr=1 Reference number 11996321 Date request received 17 March 2025 Date of decision 14 April 2025 Follow us on Facebook (opens in new window) Follow us on X (opens in new window) Follow us on Linked In (opens in new window) Follow us on Instagram (opens in new window) Privacy Cookies Accessibility Contact us Modern slavery Lincolnshire County Council All content © 2025  Lincolnshire County Council. All Rights Reserved. Designed and Powered by Jadu ."
    }
  ]
}