{
  "fuentes": [
    {
      "url": "https://linksofsandpiper.com/contact/",
      "email": "dtavlin@linkssp.com"
    },
    {
      "url": "https://linksofsandpiper.com/contact/",
      "email": "mtavlin@linkssp.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "aanderson@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "asheridan@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "carter.rise2@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "crise@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "jaustin@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "jdarter@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "nanders@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "ned@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "pburke@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "email": "wrise@sandpiper.us.com"
    },
    {
      "url": "https://sandpiperbrands.com/about-us/",
      "email": "info@sandpiperbrands.com"
    },
    {
      "url": "https://new-sandpiper.co.uk/contact/",
      "email": "enquiries@new-sandpiper.co.uk"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "ahowland@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "bbellamy@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "bgarrett@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "cjohnson@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "creynolds@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "jdarter@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "tlewis@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "vcruz@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "email": "wdaniels@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/contact",
      "email": "info@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/contact",
      "email": "ned@sandiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/contact",
      "email": "ned@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpiperhospitality.com/contact",
      "email": "sales@sandpiperhospitality.us.com"
    },
    {
      "url": "https://www.sandpiperstinsonbeach.com/contact",
      "email": "info@sandpiperstinsonbeach.com"
    },
    {
      "url": "https://www.sandpiperstinsonbeach.com/contact",
      "email": "info@sandpiperstinsonbeach.com"
    },
    {
      "url": "https://sandpiperbrands.com/team/",
      "email": "info@sandpiperbrands.com"
    },
    {
      "url": "https://sandpipercomms.com/",
      "email": "energy@3x.png"
    },
    {
      "url": "https://sandpipercomms.com/",
      "email": "shutterstock-1643087659@2x-2.png"
    },
    {
      "url": "https://sandpipercomms.com/",
      "email": "sky@3x.png"
    },
    {
      "url": "https://www.sandpipercompanies.com/about",
      "email": "aanderson@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpipercompanies.com/about",
      "email": "crise@sandpiper.us.com"
    },
    {
      "url": "https://www.sandpipercompanies.com/about",
      "email": "jaustin@sandpiper.us.com"
    },
    {
      "url": "https://www.polkcountygolf.com/golf-course/links-of-sandpiper/",
      "email": "dtavlin@linkssp.com"
    },
    {
      "url": "https://www.sandpipershoes.com/about-us",
      "email": "sales@sandpipershoes.co.uk"
    }
  ],
  "mails": [
    "aanderson@sandpiper.us.com",
    "ahowland@sandpiper.us.com",
    "asheridan@sandpiper.us.com",
    "bbellamy@sandpiper.us.com",
    "bgarrett@sandpiper.us.com",
    "carter.rise2@sandpiper.us.com",
    "cjohnson@sandpiper.us.com",
    "creynolds@sandpiper.us.com",
    "crise@sandpiper.us.com",
    "dtavlin@linkssp.com",
    "energy@3x.png",
    "enquiries@new-sandpiper.co.uk",
    "info@sandpiper.us.com",
    "info@sandpiperbrands.com",
    "info@sandpiperstinsonbeach.com",
    "jaustin@sandpiper.us.com",
    "jdarter@sandpiper.us.com",
    "mtavlin@linkssp.com",
    "nanders@sandpiper.us.com",
    "ned@sandiper.us.com",
    "ned@sandpiper.us.com",
    "pburke@sandpiper.us.com",
    "sales@sandpiperhospitality.us.com",
    "sales@sandpipershoes.co.uk",
    "shutterstock-1643087659@2x-2.png",
    "sky@3x.png",
    "tlewis@sandpiper.us.com",
    "vcruz@sandpiper.us.com",
    "wdaniels@sandpiper.us.com",
    "wrise@sandpiper.us.com"
  ],
  "nombre_sitio": "linksofsandpiper.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://linksofsandpiper.com/contact/",
      "text": "Contact – Links of Sandpiper Golfing Dining Course Gallery Contact Tee Times Contact The Links of Sandpiper Play. Eat. Relax. Repeat Book Your Tee Time Contact & Connect with Us If you have any questions, please feel free to reach out to us using one of the methods below, Thank you! PHONE: 863-859-5461 EVENTS: mtavlin@linkssp.com GENERAL: Dtavlin@linkssp.com ADDRESS: 6001 Sandpipers Drive CITY: Lakeland, Florida 33809 Operating Hours Monday – Sunday: 6:00AM – 8:30PM \"\" CONTACT INFO The Links of Sandpiper 6001 Sandpipers Drive Lakeland, 33809 Book Tee Times: 863-859-5461 OPERATING HOURS Monday – Sunday 6:00AM – 8:30PM Quick Links Tee Times Golfing Homesites Contact © 2022 Links of Sandpiper | Designed and Managed by Cohen Creek"
    },
    {
      "url": "https://www.sandpiperlodgingtrust.com/about",
      "text": "About Us - Sandpiper Investments About us Portfolio Investment The latest Investor Portal The Investor Experience Contact us Sandpiper 7200 Glen Forest Drive, Ste 200 Richmond, VA 23226 804.775.2200 Follow us Â©2024. All rights reserved. About US 18 Years of Leadership in Extended Stay Investments Sandpiper Lodging Trust is a real estate investment trust specializing in extended stay hotels. Â With 30 properties and operational excellence, our goal is to grow SLTâs portfolio of best-in-class extended stay hotel assets, with a focus in our target markets across the United States, to create current income and capital appreciation, and to ultimately provide liquidity for shareholders through the sale of assets, a recapitalization, or via a public listing of our common shares. Investment Thesis Our focus on the extended stay hotel market is driven by its unmatched investment potential. This segment stands out for its strong guest value, few entrenched competitors, and positive balance between supply and demand. Proven resilient during economic downturns, including the COVID-19 pandemic, extended stay hotels cater to work-related travelers, long-term guests, and value-conscious customers. By prioritizing our focus on this segment, we are able to deliver consistent cash flow, attractive shareholder returns, and long-term capital appreciation, ensuring sustainable growth and differentiation in the hospitality sector. Our History & Past Performance Our extended stay hotel strategy thrives because it addresses specific guest needs: Mandatory work-related travel, alternatives to traditional housing, and value-driven choices during challenging economic times. This resilience has been a cornerstone of our continued performance and investor satisfaction. Explore Sandpiper Vehicles, Performance, and Portfolio MEET OUR TEAM At Sandpiper, our strength lies in our people. Each member of our team brings a unique blend of skills, expertise, and passion that drives our success and innovation. We pride ourselves on assembling a group of talented professionals who are not only leaders in their fields but also dedicated to our vision of providing exceptional service and solutions for The Sandpiper Companies. The Company is managed by the Managing Member and sponsor, Sandpiper, LLC, which is wholly-owned by P. Carter Rise. Mr. Rise has been successfully developing and managing extended stay hotels since his initial foray into the hospitality business in 2008. Over the past 17 years, he has built a very successful platform of high-performing hotels consisting of 39 assets, 16 of which we developed from the ground-up. LEADERSHIP ASSOCIATES Carter Rise President, Chief Executive Officer, and Chairman Carter Rise has served as President, CEO, and Chairman of the Board of Sandpiper since its inception. Mr. Rise is the founder and sole member of Sandpiper, LLC, the Managerâs majority owner and controlling member, and the sole common shareholder and a significant preferred shareholder in each of the Sandpiper funds. Mr. Rise also is the majority owner of Sandpiper Hospitality, a hotel management company. Since 2012, Mr. Rise has served on WoodSpring Suites Franchise Advisory Council, and is currently serving his fourth term as its Chairman. From 2001 to 2008, Mr. Rise was a Founder and Managing Partner of Scura, Rise & Partners, LLC, an investment banking boutique based in New York, NY. Prior to 2001, Mr. Rise was an investment banker for 13 years with Prudential Securities, Inc. and its predecessor company, Prudential-Bache, Inc., where he served as Managing Director and Group Head of the Financial Services Group. Mr. Rise has an MBA from the Wharton School at the University of Pennsylvania and a B.S. from the McIntire School of Commerce at the University of Virginia. John Austin Chief Financial Officer John Austin has served as the Chief Financial Officer, Treasurer, and Secretary of Sandpiper since its inception in June 2018 after serving as a consultant of Sandpiper. Mr. Austin is responsible for managing all financial functions for the Sandpiper affiliates. Prior to Sandpiper, Mr. Austin was the Chief Financial Officer of The Chefâs Warehouse, Inc., a publicly traded foodservice distributor, from 2012 to 2017, after having served on the Board of Directors from 2011 to 2012. From 2009 to 2012, Mr. Austin was a founder and former Chief Financial Officer of the HILB Group, LLC, an insurance broker in Richmond, Virginia. Mr. Austin worked at Performance Food Group Company (âPFGâ), a Richmond-based publicly traded foodservice distributor, for over 14 years, serving a portion of his time as their CFO. Mr. Austin was integrally involved in leading the company through the process of going private and the divestiture of a major business segment that created significant shareholder value. Mr. Austin holds a B.S. in Accounting from the University of Delaware. Andy Anderson Chief Acquisition Officer Andy Anderson joined Sandpiper in June 2018 as Chief Acquisitions Officer, after serving as a consultant to the company. Mr. Anderson focuses on identifying and completing strategic hotel acquisitions for Sandpiper and assists with legal and capital market requirements. Mr. Anderson most recently served as the Executive Vice President of Corporate Development for WoodSpring Suites Hotels, where he was responsible for the activities of the brandâs large-scale developers nationwide and internal and external acquisitions. Mr. Anderson has more than 30 years of real estate transactional experience derived from his roles as a partner at Sandman and Savrann, a national law firm specializing in the hospitality industry, General Counsel of Mid America Real Estate Companies, Granite Golf, and his years in private practice. He also leverages over 20 years of business development in the hospitality industry and has been a critical part of business development teams for GE Capital Solutions â Hospitality Finance, Citi Hospitality Finance, Troon Golf and WoodSpring Suite Hotels. Mr. Anderson graduated with honors from the University of Tulsa College of Law and graduated Cum Laude from Northern Illinois University. Ned Sinnott Managing Director, Capital Markets, Equity Investments & Investor Relations Ned Sinnott joined Sandpiper in September 2012 as Managing Director. Mr. Sinnott oversees investor relations and equity investments for the Company. Mr. Sinnott is a key member of our management team and has been responsible for overseeing capital raising efforts that have resulted in over $260 million in equity investments for the Company and other Sandpiper entities. Further, he was responsible for identifying and securing all real estate sites for Sandpiper Hospitality IV, LLC and Sandpiper Hospitality V, LLC. Mr. Sinnott has held several sales and management positions over his 25-year career. Most recently, from 2006 to 2012, he was a Senior Vice President in Institutional Equity Sales with Davenport & Company and Wunderlich Securities, covering major institutional accounts in New York, Connecticut, North Carolina, Tennessee and Virginia. Mr. Sinnott has a B.A. in History from the University of Virginia. Carter Rise Jr. Vice President of Development Carter Rise Jr. joined Sandpiper in February 2022 as Vice President of Development. Mr. Rise is responsible for identifying and managing the development of new hotel opportunities for the company on a national basis. Prior to Sandpiper, Mr. Rise served as a Managing Consultant within IBM Global Business Services. During his 5 years at IBM, Mr. Rise focused primarily on providing data analytics, process automation, and asset management work to clients in the Federal Government and Healthcare sectors, including the DOD and DOJ. Mr. Rise holds a B.A. in Political Economy with a minor in Business Administration from Georgetown University. Peter Burke Senior Vice President of Construction & Capital Expenditures Peter Burke joined Sandpiper in May 2023 as the Senior Vice President â Construction and Capital Expenditures. Mr. Burke is responsible for new hotel construction projects on a national basis with emphasis on the new ECHO brand properties for Wyndham and Embassy Suites for Hilton. Mr. Burke is also a key member of the Sandpiper Hospitality senior management team coordinating all Capital Expenditures and PIPâs (Product Improvement Plans) for existing hotel renovations across the entire national portfolio. Prior to Sandpiper, Mr. Burke most recently spent 17 years as the Director of Facilities for Gold Key/ PHR Hotels and Resorts based in Virginia Beach, VA and was instrumental in the completion of the Cavalier Resort Complex on the Virginia Beach Oceanfront. This three-hotel complex consisted of the newly renovated historic Cavalier Hotel circa 1927 (which is part of the Marriott Autograph brands), the new 305 room full-service Marriott Virginia Beach Oceanfront Resort and the new 157 room Embassy Suites Virginia Beach by Hilton along with the Cavalier Beach Club. Throughout those 17 years, Mr. Burke was involved in the construction and renovations of multiple hotels and timeshare properties to include two 300 room, full-service Hiltonâs (Virginia Beach Oceanfront and Hilton Norfolk The Main), as well as several mixed use retail locations, apartments, warehouse, central laundry facility and IT Data Centers along with 17 restaurants. Mr. Burke is a graduate of Villanova University and received his masterâs degree in management from Troy University. He achieved the following professional designations: CHFE (Certified Hospitality Facility Executive), FMA (Facility Management Administrator) and FMP (Facility Management Professional). Additionally, Mr. Burke is a military veteran having served in the Navy on several Amphibious Ships, Naval Special Warfare and a tour in the Pentagon. Nick Anders Vice President of Acquisitions Nick Anders joined Sandpiper in July 2021 as a Financial Analyst. His responsibilities include providing analytical support for the acquisition, development, and financing activities of the companyâs portfolio. Nick started his career in commercial real estate at the CoStar Group here in Richmond, VA, serving as a market researcher for the CRE information provider. From there, he moved to Atlantic Union Bank where he served on the credit side, helping underwrite prospective loans and providing maintenance and due diligence on existing facilities. Nick graduated from Washington & Lee University with a B.A. in Economics in 2019. Walker Rise Vice President of Corporate Finance Ashley Sheridan Executive Administrative Assistant 1 Jim Darter Sandpiper Hospitality President & CEO Experts in property management The Sandpiper Companies built its own world class property management company in 2012 because no third-party manager in the economy and midscale space could deliver the combination of guest experience, employee satisfaction and retention, asset preservation, and financial performance that The Sandpiper Companies expected. SLTâs 30 hotels are managed by Sandpiper Hospitality (âSHâ), our affiliated hotel management company. SH also manages 35+ additional hotels for affiliated and non-affiliated third-party owners. Learn more about Sandpiper Hospitality Our partners in hospitality are the best in the business See our portfolio of properties learn more about our hotel portfolio Sandpiper Lodging Trust 7200 Glen Forest Drive, Suite 200 Richmond, VA 23226 | 804.775.2200 Follow us Â©2024. All rights reserved. Jim Darter President & CEO As a lifelong hotelier and business leader, Jim takes great pride in his ability to effectively utilize and balance strategic thinking, or IQ, and resonant leadership, or EQ, to lead Sandpiper Hospitality. These complimentary abilities combine to provide Sandpiper with the horsepower, collectively through his team and his strategies, it needs to maximize returns for its investors. At the end of the day, Jim knows that, âOur strategic decisions must drive our hotels to earn better than expected returns for our investors. Period.â â Jimâs leadership of the organization takes many forms, including; a resolute focus on adding and keeping genuine talent with the right abilities and mindset, setting a vision that inspires and energizes the leaders in the organization, nailing the strategic planning for the company and the individual hotels and obsessing over results, returns and the related trends. The ROI is clear and evidentâ¦â¦internally with associate growth and development, customer-facing through guest satisfaction, and financially for the investors and owners. âWe have to earn it every day, in every way,â according to Jim â Before joining Sandpiper, Jimâs perpetual drive served him well in Denver, CO as a Senior Vice President with Sage Hospitality for fourteen years and more recently as Chief Operating Officer for Gold Key/PHR. Jim also served as a Regional Director with IHG franchise operations after learning the hotel business on property with various leadership positions at a number of award-winning hotels in Toronto, Ontario, Canada, Washington DC and South Florida. At home, he is perpetually surrounded by his âgirls,â including his wife and two teenage daughters. â Tasked with executing the companyâs growth plans, Jim is equally focused on todayâs results and tomorrowâs opportunities. These parallel paths have set Sandpiper up for an explosive growth period in the coming years. âOur continued growth and expansion of brands and geography is coming as a result of our ability to perform. According to Jim, âOur dedication to excellence in people, strategy and performance is our formula to success. We play to win!â"
    },
    {
      "url": "https://sandpiperbrands.com/about-us/",
      "text": "About Us | Sandpiper Productions LLC Home Gallery Services Brand Ambassadors WaveMakers Elevated Specialists Models About us Join Our Team Booking Form Client Portal Client Intro Your #1 Choice for Event Staffing and Management We can't wait to show you what makes Sandpiper different At Sandpiper , we're all about crafting unforgettable moments Our goal is for Sandpiper Productions to be your number one choice for event staffing and management. We select brand ambassadors and promotional models who not only align with your brand, but also share our passion for branding, marketing, consumer engagement and sales. We work relentlessly to ensure we are delivering the best possible ROI for your consumer engagement activations. We can’t wait to show you what makes Sandpiper different. You are getting a team with over 20+ years of industry experience at your side. We are a full-service experiential marketing agency. We can help you develop your brand and execute your marketing strategy from start to finish. Our Vision Our Vision is for Sandpiper Productions to be your number one choice for event staffing and management. We select brand ambassadors and promotional models who not only align with your brand, but also share our passion for branding, marketing, consumer engagement and sales. Christine Jameson Founder & CEO We work relentlessly to ensure we are delivering the best possible ROI for your consumer engagement activations. We can’t wait to show you what makes Sandpiper different. Meet The Team Behind Sandpiper Dedicated individuals working every day to deliver the best service, ensuring our clients' happiness remains our top priority. Colleen Carey Event & Talent Manager Shane Belcher Director of Business Development Luis Dizon Talent Acquisition Specialist Mae Balmes Talent Acquisition Specialist Fernanda B. Business Support Specialist Brendan Anthony Business Support Specialist Need Your Event Staffed? Let Sandpiper Lead the Way! Get In Touch +1 207-292-2588 info@sandpiperbrands.com Quick Links About us Gallery Our Services Join Our Team FAQs Privacy Policy Service Area Map Connect With Us Copyright ©2024 Sandpiper Productions LLC. All Rights Reserved"
    },
    {
      "url": "https://new-sandpiper.co.uk/contact/",
      "text": "Get in Touch with Sandpiper Apartments: Contact Us Today Skip to main content facebook phone email The New Sandpiper Holiday Apartments Close Search Get In Touch Menu Home About Our Apartments Arctic Tern The Little Tern Salty Puffin The Oyster Catcher The Sandpiper Kittywake Contact Get In Touch Menu Contact Us Contact us today to find out more about our services. Got a question? No problem. If you want to know more about any of our services, contact us below. 01253 876515 enquiries@new-sandpiper.co.uk Drop us a message Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Full Name * Email * Phone Number Enquiry Submit Reviews Get In Touch Contact Us Apartments The Sandpiper The Oyster Catcher Salty Puffin The Little Tern Kittywake More Information About Contact Privacy Policy Phone: 07752 721344 Email: enquiries@new-sandpiper.co.uk © 2025 Sandpiper Holiday Apartments. facebook phone email Close Menu Home About Our Apartments Arctic Tern The Little Tern Salty Puffin The Oyster Catcher The Sandpiper Kittywake Contact facebook phone email Manage Cookie Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.sandpiperhospitality.com/our-team",
      "text": "Sandpiper Leadership Team | Sandpiper Hospitality ABOUT US OUR TEAM CAREERS News HOTELS INVESTORS CONTACT US At Sandpiper Hospitality, our strength lies in our people. Each member of our team brings a unique blend of skills, expertise, and passion that drives our success and innovation. We pride ourselves on assembling a group of talented professionals who are not only, but also leaders in their fields but also dedicated to our vision of providing exceptional service and solutions for Sandpiper Hospitality. learn more about careers EXECUTIVE LEADERSHIP LEADERSHIP Jim Darter President & Chief Executive Officer As a lifelong hotelier and business leader, Jim takes great pride in his ability to effectively utilize and balance strategic thinking, or IQ, and resonant leadership, or EQ, to lead Sandpiper Hospitality. These complimentary abilities combine to provide Sandpiper with the horsepower, collectively through his team and his strategies, it needs to maximize returns for its investors. At the end of the day, Jim knows that, âOur strategic decisions must drive our hotels to earn better than expected returns for our investors. Period.â Jimâs leadership of the organization takes many forms, including; a resolute focus on adding and keeping genuine talent with the right abilities and mindset, setting a vision that inspires and energizes the leaders in the organization, nailing the strategic planning for the company and the individual hotels and obsessing over results, returns and the related trends. The ROI is clear and evidentâ¦â¦internally with associate growth and development, customer-facing through guest satisfaction, and financially for the investors and owners. âWe have to earn it every day, in every way,â according to Jim. Before joining Sandpiper, Jimâs perpetual drive served him well in Denver, CO as a Senior Vice President with Sage Hospitality for fourteen years and more recently as Chief Operating Officer for Gold Key/PHR. Jim also served as a Regional Director with IHG franchise operations after learning the hotel business on property with various leadership positions at a number of award-winning hotels in Toronto, Ontario, Canada, Washington DC and South Florida. At home, he is perpetually surrounded by his âgirls,â including his wife and two teenage daughters. Tasked with executing the companyâs growth plans, Jim is equally focused on todayâs results and tomorrowâs opportunities. These parallel paths have set Sandpiper up for an explosive growth period in the coming years. âOur continued growth and expansion of brands and geography is coming as a result of our ability to perform. According to Jim, âOur dedication to excellence in people, strategy and performance is our formula to success. We play to win!â Amy Howland Senior Vice President of Operations Amy first started her career in Hospitality 21 years ago as a part-time front desk weekend associate and fell in love with the industry. She found her passion to be in operations and began her journey in roles such as Executive Housekeeper, Assistant General Manager, and General Manager before progressing to above property support. She has worked for many of the Hospitality Industry leaders as Aimbridge, Naples Hotel Group, Hawkeye Hotels, and most recently with Shaner Hotel Group as Regional Vice President of Operations. As leader of Sandpiper Hotel and Operations Team, she is All In for delivering consistent results and driving strong ROI for our investors by supporting our leaders to be the best of the best. She is new to Sandpiper Hospitality leadership and brings energy to her role and strategic thinking to challenge us in taking better to best. Her passion is investing in people and challenging them to have the confidence to believe in themselves and continue to grow their career in hospitality. When Amy is not at work she enjoys spending time with her husband and fur dogs, Gnocchi & Millie. You can oftentimes find her on an adventure with her three beautiful Grandchildren whom she is known to as Nana. She has proudly served on the Board of Directors for the American Cancer Society and looks forward to getting involved in the Richmond Relay for Life and giving back to her new Community. â Victor Cruz Senior Vice President Of Business Development & Transitions Victor Cruz joined Sandpiper in 2016, bringing a broad range of hospitality revenue knowledge to the organization. Â His previous experience includes Winegardner & Hammons, Shaner Hotels, Highgate Hotels, Interstate Hotels & Resorts, Sage Hospitality and The Prococcianti Group. Â In 2011 and 2012, he was named Marriottâs Revenue Leader of the Year for the Eastern Region. Â His brand experience also includes Hilton, Starwood, IHG and WoodSpring brands. In Victorâs first year with the company, Sandpiper was recognized with the Highest RevPAR Award for all the management companies in the WoodSpring Suites brand, a feat no doubt due to Victorâs leadership and capability. Victor focuses on maximizing revenue, profits and market share penetration through aggressive yield management strategies and tactics. His genuine likeability and smarts have earned high marks for Sandpiper, as he gives GMs and owners the âA-Ha!â moment that result in increased revenue AND profit. Those are the type of results that make for happier investors, associates and guests. â John Barrar Senior Vice President of IT and Systems Integration John has a deep background in technology that started in the fifth grade, writing video games in BASIC on a TI-99/4A computer. John received a Bachelor of Science in Computer Science from Stephen F. Austin State University and serves on the Advisory Board for that department today. Before joining Sandpiper Hospitality, John helped Capital One grow from an unknown company to become the 6th largest bank in the United States. Most recently, he shifted his focus to Managed Services for small to medium-sized businesses. With each step, John aimed to get closer to the individual users of technology. As a technology evangelist, John gets satisfaction from helping others use and enjoy technology, trying to fulfill the promise of the Information Age. As a Board Member of the Richmond Technology Council rvatech, John actively promotes technology in the community and never misses an opportunity to share his passion Candace M. Reynolds Vice President of Human Resources Candace leads our Corporate Human Resources team, leveraging her fabulous people skills and knack for finding the right people to joinâand grow withinâthe organization. She is well-versed in hospitality HR, bringing over 25 years of experience from brands such as Marriott Vacation Worldwide, Starwood Hotels & Resorts, HEI, and Interstate Hotels. Candace was drawn to Sandpiper because of the unique opportunity to use her years of know-how to put her own thumbprint on the entire organization during its growth phase. She focuses on bringing in the perfect complement of talent, from GenX to XYZ to Baby Boomers. She aims for diversity and inclusion and always keeps in mind how Sandpiper associates create a successful bond to each other, guests, partners and investors. Her aim is to have significant, positive impact on those who spend their time with SANDPIPER HOSPITALITY so that they can in turn impact the lives of those we serve â our guests and our investors. When sheâs not at work or with her teenage son, sheâs at work in the community, often cooking for a rehabilitation center. In her words, âIt allows me to show people seeking help that they will not be judged.â â Carrie Johnson Vice President of Revenue Management Carrie graduated from the University of Lynchburg in 2003, and shortly thereafter started her career in hospitality. Spending the next 15 years in Washington, DC, Carrie worked her way through the hotel industry with Marriott, Starwood and several independent hotels in the City. She recently joined Sandpiper and will oversee the portfolio of Extended Stay America hotels from a Revenue Management standpoint. In her spare time, she spends time with her dog Clover hiking, camping and exploring the outdoors near Richmond, VA. â Tiffany Lewis Vice President of Sales & Marketing Tiffany Lewis joined Sandpiper in 2023 after having a successful 20+ years in sales within the hospitality industry. She has experience with various Marriott, Hilton, Hyatt and IHG brands including full-service, select service and extended stay. As an award-winning Hospitality Sales Professional, she credits her successes to the contributions of her teams and commits her leadership efforts to developing her fellow team members. Tiffanyâs teams have come to know her as being an innovative, engaging and supportive leader who fosters a culture of excellence and achieves outstanding results William Daniels Vice President of Finance William has over 25 years of accounting, operational, and financial management experience with independent luxury brands, as well as brands such as Hilton, Holiday Inn, Marriott, Omni, and Sheraton. Previously, heâs held a Regional Director of Finance and General Manager position for Meristar and Sage Hospitality. As a Regional Director of Finance, William oversaw the accounting departments for properties in the state Indiana; Tennessee, where he oversaw the opening of the Marriott Vanderbilt hotel; and Kentucky at the famous historic Hilton Seelbach. During his time at Sage Hospitality, William was responsible for hotel openings, regional accounting, and the PMS and POS conversion of 11 indoor water-resort hotels. Later on, his experience grew again at the Hotel Madeline Resort and Inn at Lost Creek in Telluride, CO and Omni Montelucia Resort in Scottsdale, AZ. For the past four years, William has enjoyed the opportunity to work as a General Manager for the Courtyard Marriott and Four Points brand where he received awards in both Financial Performance and Brand Standards. Now at Sandpiper, William is proud to be a part of a family that never stops adding innovation to the hospitality industry. â Operations Sales & Marketing Revenue Management Talent Acquisition Other Support Select Team Category Operations Sales & Marketing Revenue Management Talent Acquisition Other Support Operations Sales & Marketing Revenue Management Construction & Capital Human Resources Brad Garrett Regional Sales Manager Brad started his career as a sales manager for Sunburst Hospitality in 1998. In 2000, he joined Wyndham Vacation, where he sold and managed sales lines. Brad also served as the Program Manager for Wyndham Vacationâs $50 million dollar Exit Program called Discovery. Later, in 2010, he became a Regional Sales Director at Extended Stay America, and there, he created the GSR Superstar Sales Program, which evolved into the companywide Reach for Rewards Program. This program became the largest revenue-producing initiative in Extended Stay Americaâs history, generating over $350 million a year in qualified leads. In 2012, Brad was promoted to Director, National Account Sales, overseeing an $80 million dollar portfolio. Subsequently, in 2018, he joined Hotel Management Services as a Regional Sales Director, responsible for 12 hotels in the Southeast. Brad furthered his journey in 2023 by becoming a Regional Sales Manager at Sandpiper Hospitality. An ambitious sales leader, Brad passionately embraces the art of sales. He collaborates with hotel teammates to devise strategies that drive new revenue, consistently exceeding budgets for hotel owners. Working with people and ensuring clear goal comprehension, he executes plans of action with precision. Brad adopts various sales styles to prospect, manage, and achieve goals that surpass budgeted expectations. With over twenty-five years of experience in the hospitality industry, Bradâs expertise and dedication continue to shine. â Brandon Bellamy Area Director of Sales Brandon began his hospitality journey back in 2011 working as a front desk agent for Woodspring Suites (formally known as Value Place) in Columbus, Ga. He worked his way up to property manager, and after a few years he found his calling with Sandpiper Hospitality in late 2013 in the role of General Manager for the newly constructed WoodSpring Suites Manassas, VA location. Throughout his journey with the hospitality company, he has been awarded numerous awards within the brand; these include WoodSpring Suites hotel brand champion, Mentor of the Year, and Sandpiper Cup Champion. Takingadvantage of opportunities in the Atlanta, GA market, Brandon has transitioned from the General Manager role into the Area Director of Sales role. Daniel Bustos Regional Manager Daniel was born and raised in the great state of Nevada. Having grown up in Vegas, it was very natural to begin in the service industry. Daniel did so while in school, prior to joining the military, and when he returned from military service. Daniel joined the Army National Guard in 2008 and trained as a Military Police officer in Fort Leonard Wood, MO. He deployed with the 137th Military Police Detachment to Afghanistan in 2010 in support of Operation Enduring Freedom. After his year-long deployment and making his way back home to Vegas, Daniel rejoined the team at the Holiday Inn. He has embraced the hospitality industry ever since. Daniel is proud to have worked in all line level positions for both the Front & Back of the house, later developing as a leader. He has worked with IHG, Wyndham, Marriott, and Choice branded hotels, becoming a General Manager in 2016. Daniel was welcomed into the Sandpiper Family in the beginning of 2024 as a Task Force General Manager, and later in 2024 he was promoted to Regional Manager. Daniel takes great joy in making memorable experiences for guests and is excited to apply this experience and skillset to his career with Sandpiper Hospitality! â About us hotels Our Team Investors Careers Privacy Policy News contact us 7200 Glen Forest Drive, Suite 200 Richmond, VA 23226 804.775.2200 Follow us Â | Â©2024 Sandpiper Hospitality. All rights reserved. Jim Darter President & CEO As a lifelong hotelier and business leader, Jim takes great pride in his ability to effectively utilize and balance strategic thinking, or IQ, and resonant leadership, or EQ, to lead Sandpiper Hospitality. These complimentary abilities combine to provide Sandpiper with the horsepower, collectively through his team and his strategies, it needs to maximize returns for its investors. At the end of the day, Jim knows that, âOur strategic decisions must drive our hotels to earn better than expected returns for our investors. Period.â â Jimâs leadership of the organization takes many forms, including; a resolute focus on adding and keeping genuine talent with the right abilities and mindset, setting a vision that inspires and energizes the leaders in the organization, nailing the strategic planning for the company and the individual hotels and obsessing over results, returns and the related trends. The ROI is clear and evidentâ¦â¦internally with associate growth and development, customer-facing through guest satisfaction, and financially for the investors and owners. âWe have to earn it every day, in every way,â according to Jim â Before joining Sandpiper, Jimâs perpetual drive served him well in Denver, CO as a Senior Vice President with Sage Hospitality for fourteen years and more recently as Chief Operating Officer for Gold Key/PHR. Jim also served as a Regional Director with IHG franchise operations after learning the hotel business on property with various leadership positions at a number of award-winning hotels in Toronto, Ontario, Canada, Washington DC and South Florida. At home, he is perpetually surrounded by his âgirls,â including his wife and two teenage daughters. â Tasked with executing the companyâs growth plans, Jim is equally focused on todayâs results and tomorrowâs opportunities. These parallel paths have set Sandpiper up for an explosive growth period in the coming years. âOur continued growth and expansion of brands and geography is coming as a result of our ability to perform. According to Jim, âOur dedication to excellence in people, strategy and performance is our formula to success. We play to win!â"
    },
    {
      "url": "https://www.sandpiperhospitality.com/contact",
      "text": "Contact Us | Sandpiper Hospitality ABOUT US OUR TEAM CAREERS News HOTELS INVESTORS CONTACT US Letâs connect Sandpiper Hospitality 7200 Glen Forest Drive, Suite 200â¨ Richmond, VA 23226â¨ 804.775.2200 General Inquiries: Â Â info@sandpiper.us.com âInvestor Inquiries: Â Â ned@sandpiper.us.com GROUP SALES INQUIRIES: sales@sandpiperhospitality.us.com Join Our Team! About us hotels Our Team Investors Careers Privacy Policy News contact us 7200 Glen Forest Drive, Suite 200 Richmond, VA 23226 804.775.2200 Follow us Â | Â©2024 Sandpiper Hospitality. All rights reserved."
    },
    {
      "url": "https://www.sandpiperstinsonbeach.com/contact",
      "text": "Sandpiper Lodging | Contact Us top of page HOME ABOUT POLICIES Accessibility Statement ACCOMMODATIONS ONLINE RESERVATIONS SEE AND DO WHERE TO EAT MUIR WOODS MOUNT TAMALPAIS CONTACT More Use tab to navigate through the menu items. CONTACT US FOR GENERAL ENQUIRIES & FURTHER INFORMATION PLEASE CONTACT US: 415.868.1632 1 Marine Way, Stinson Beach, CA 94970 INFO@SANDPIPERSTINSONBEACH.COM SANDPIPERSTINSONBEACH.COM Success! Message received. Send ON LINE RESERVATIONS Sandpiper Lodging at the Beach is steps away from Stinson Beach, nestled at the base of Mt. Tamalpais. Enjoy hiking local trails, surfing, kayaking, and mountain biking, quaint restaurants, and shops. Comfortable updated rooms, kitchenettes, and cabins. Located in Marin County, convenient to San Francisco, Muir Woods, Bolinas, Mill Valley, and Point Reyes National Seashore. ​ ​ 415.868.1632 Sandpiper Lodging at the Beach 1 Marine Way Stinson Beach, CA 94970 info@sandpiperstinsonbeach.com Accessibility Statement bottom of page"
    },
    {
      "url": "https://sandpiperbrands.com/team/",
      "text": "Welcome to the Team! - Sandpiper Productions Home Gallery Services Brand Ambassadors WaveMakers Elevated Specialists Models About us Join Our Team Booking Form Client Portal Client Intro Welcome to the Sandpiper Team! By moving forward with this process, you are agreeing that you understand our Brand Ambassador expectations: Be Punctual : You are paid for the time you work for the client. You’ll log in and out via geolocation to indicate your arrival at the event. The timestamp and location of these timestamps is shared with our clients. Our expectation is that you are always on time for your events. Most clients expect our Brand Ambassadors to arrive on site to start your shift 15 minutes prior to the scheduled event start time. This is considered on-time, so please keep this in mind when you organize your schedule. Our brand ambassadors never leave their events prior to the scheduled end of shift without management and client approval. Be Communicative : If you have ANY questions or concerns, please message us! Be Prepared : Take the time to study the brands you’re promoting or selling prior to your tastings. We will either assign you to a brand course on this platform or we will send you a sell sheet. Be Engaging : We ask that, regardless of the store or bar traffic, you are being attentive, inviting, enthusiastic, and not on your phone or eating. We hold ourselves to high standards because we believe that’s what sets us apart. If any of these standards don’t align with your aspirations, now is the time to reassess if our team is the right fit for you. Our brand ambassadors stand out, ensuring our clients receive top-notch professionalism at every event. Required applications The apps that you’ll need to download in order to complete events (and get paid!) are the following. You can download these now, but please wait for an invitation to come via email for Bill and Paychex. next steps Brand Ambassador Onboarding Please visit our onboarding page at www.sandpiperbrands.com/welcome . This page is on our Reference Desk, which is a portal full of information that you’ll want to have access to! The initial article linked her will walk you through the process and tell you more about this. You will need to register as a user on this site. Once you’re registered you’ll have access to all the training materials. Click “Sign Up” on the top right corner. You will also have access to the team forums on this site where you can engage with your fellow Sandpiper Brand Ambassadors! Once you’re logged in, please read each of the articles linked in this onboarding document. Feel free to browse around the site to get familiar with where the content is for future use as well. Upon review of this material, please send us a text message to let us know you’re ready to move forward. Event Spreadsheet We will send your events spreadsheet link. This spreadsheet is a live sheet that contains continously up to date event details for open events and the events that you sign up to work! In the next month we will be launching our Pour Portal app where all of event details will be available and you’ll use this to sign up and complete your events. Stay tuned for the big announcement when this launches! The first tab is “Staffing Needed” These are the events we have open that need to be staffed. Please text us if you see any events you’d like to work! Once you’re added on, this event will appear in the “Upcoming Events” tab and you will see all event details, ex: spend, brands, address, attire, etc. Upcoming Events is available in a version that is optimized for mobile viewing or computer. Please switch between the tabs based on where you’re viewing the events. Alcohol safe server-seller​ At Sandpiper, we require all of our brand ambassadors to be certified as Alcohol Safe Server-Sellers. This could mean a TIPS certification, a state-mandated certification or a general state certification. For more information on requirements, please go to this link and choose your state from the dropdown menu: https://www.360training.com/learn2serve/alcohol-training If a specific state course is not required, a generalized certificate will still be required to pick up events. Here is an example: https://www.360training.com/course/off-premises-alcohol-seller-server Action needed Please send a text back to us letting us know that you reviewed this information and will be moving forward with onboarding! Thank You Let me just take one more minute of your time to say thank you again for your interest in joining the Sandpiper team. We are really proud of what we do, and our awesome team members are what make us stand out among our competitors. I hope you are as excited to be here as we are to have you, and I look forward to working with you! Cheers, Christine Jameson Founder & CEO Sandpiper Productions +1 207-292-2588 info@sandpiperbrands.com Quick Links About us Gallery Our Services Join Our Team FAQs Privacy Policy Service Area Map Connect With Us Copyright ©2024 Sandpiper Productions LLC. All Rights Reserved"
    },
    {
      "url": "https://sandpipercomms.com/",
      "text": "Sandpiper | Reputation and Policy Management Consultancy Expertise People Careers News & Insights Events Contact ✕ Inform. Create. Shape. Introducing Sandpiper Financial Sandpiper Global Reputation Capital Index Toolkit for Turbulent Times Sandpiper Opens in Dubai Subscribe to our collection of newsletters to stay informed of reputation management insights, ESG & sustainability trends, and China policy updates. Informing audiences, creating conversations and shaping debates in the digital era. Sandpiper is an award-winning reputation and policy management consultancy group headquartered in Asia Pacific and operating globally We use our shared experience to make sense of the challenges our clients face in times of change. We draw on rich, data-driven insights and research to inform our advice and deliver measurable value. We work as a single, global team, with one P&L. This allows us to serve our clients flexibly wherever they are in the world. Our expertise Our multinational team combines expertise in communications, public affairs and research, with a deep understanding of industry sectors. Read More Aviation Consumer Brands Education Energy & Environment Financial Government Health Primary Industries Professional Services Property & Infrastructure Technology Travel & Hospitality Our expertise Our multinational team combines expertise in communications, public affairs and research, with a deep understanding of industry sectors. Learn More Aviation Consumer Brands Education Energy & Environment Financial Government Health Primary Industries Professional Services Property & Infrastructure Technology Travel & Hospitality News & insights News & insights Read our latest news and insights on industry trends, market intelligence, and policy updates. Read More Careers with Sandpiper Careers with Sandpiper We are always on the lookout for seasoned professionals and newcomers to the industry to join our growing team. If you believe Sandpiper could be the right place for you, please get in touch. Let's Chat Get in touch Let's Chat OUR LOCATIONS Auckland Abu Dhabi Bangkok Beijing Dubai Hong Kong Kuala Lumpur Melbourne Perth Shanghai Singapore Sydney Taipei Tokyo OUR AFFILIATE NETWORK Amman Amsterdam Athens Berlin Buenos Aires Cairo Doha Frankfurt Hanoi Hamburg Ho Chi Minh City Istanbul Jakarta Johannesburg Lagos London Madrid Manama Manila Milan Mumbai New Delhi New York Oslo Paris Phnom Penh Riyadh Rome San Francisco Sao Paulo Seoul Stockholm Toronto Vienna Zurich Copyright © Sandpiper Terms of Use Privacy Policy"
    },
    {
      "url": "https://www.sandpipercompanies.com/about",
      "text": "Sandpiper Companies OUR CoMPANIES Extended Stay PORTFOLIO & Vehicles Get in Touch our companies Learn more about our commitment to delivering returns, growing portfolios, and redefining hospitality standards. Why Extended Stay? Who we are The Sandpiper Companies (âSandpiperâ) specialize in the development, acquisition, and management of extended stay hotels. Sandpiper has been successfully developing, acquiring, and managing extended stay hotels since our initial foray into the hospitality business. Since 2007, we have built our company into a best-in-class platform of 65+ high-performing hotels. Sandpiper has a large, experienced team in place to continue our growth. Sandpiper created its own property management company in 2012 because no third-party manager in the economy and midscale space could deliver the combination of guest experience, employee satisfaction and retention, asset preservation, and financial performance that we expected. Sandpiper's affiliated hotel management company, Sandpiper Hospitality (\"SH\"), manages 65+ hotels for both Sandpiper and non-affiliated third-party owners, across 16 states. go to our website Sandpiper Lodging Trust (âSLTâ) is a privately held real estate investment trust specializing in extended stay hotels. Â With 30 hotels across 10 states and operational excellence, our goal is to grow SLTâs portfolio of best-in-class extended stay hotel assets, with a focus in our target markets, to create current income and capital gains, and to ultimately provide liquidity for shareholders through the sale of assets, a recapitalization, or via a public listing of our common shares. go to our website In addition to Sandpiper Lodging Trust (\"SLT\"), Sandpiper has sponsored ten successful hospitality-focused investment vehicles. Our extended stay hotel strategy thrives because it addresses specific guest needs: mandatory work-related travel, alternatives to traditional housing, and value-driven choices during challenging economic times. This resilience has been a cornerstone of our continued performance and investor satisfaction. Our extended stay portfolio spans 13 states. Highlights include Residence Inn by Marriott Gainesville and Lakeland, FL, Extended Stay America Premier Suites Reno-Sparks, NV and Bradenton, FL and ECHO Suites Extended Stay by Wyndham Richmond, VA. We're developing additional ECHO Suites in Virginia, Nevada and Arizona to meet rising demand, and are constantly researching value-add acquisition opportunities. Discover how our properties deliver value and align with market needs. go to our website MEET OUR TEAM At Sandpiper, our strength lies in our people. Each member of our team brings a unique blend of skills, expertise, and passion that drives our success and innovation. We pride ourselves on assembling a group of talented professionals who are not only leaders in their fields but also dedicated to our vision of providing exceptional service and solutions for the Sandpiper Companies. The Company is managed by the Managing Member and sponsor, Sandpiper, LLC, which is wholly-owned by P. Carter Rise. Mr. Rise has been successfully developing and managing extended stay hotels since his initial foray into the hospitality business in 2007. Over the past 18 years, he has built a very successful platform of 39 hotels, 16 of which we developed, with another 3 under construction and 2 in pre-construction. LEADERSHIP Carter Rise Founder and Chairman, The Sandpiper Group of Companies Carter Rise has served as President, CEO, and Chairman of the Board of Sandpiper since its inception. Mr. Rise is the founder and sole member of Sandpiper, LLC, the Managerâs majority owner and controlling member, and the sole common shareholder and a significant preferred shareholder in each of the Sandpiper funds. Mr. Rise also is the majority owner of Sandpiper Hospitality, a hotel management company. Since 2012, Mr. Rise has served on WoodSpring Suites Franchise Advisory Council, and is currently serving his fourth term as its Chairman. From 2001 to 2008, Mr. Rise was a Founder and Managing Partner of Scura, Rise & Partners, LLC, an investment banking boutique based in New York, NY. Prior to 2001, Mr. Rise was an investment banker for 13 years with Prudential Securities, Inc. and its predecessor company, Prudential-Bache, Inc., where he served as Managing Director and Group Head of the Financial Services Group. Mr. Rise has an MBA from the Wharton School at the University of Pennsylvania and a B.S. from the McIntire School of Commerce at the University of Virginia. John Austin Chief Financial Officer John Austin has served as the Chief Financial Officer, Treasurer, and Secretary of Sandpiper since its inception in June 2018 after serving as a consultant of Sandpiper. Mr. Austin is responsible for managing all financial functions for the Sandpiper affiliates. Prior to Sandpiper, Mr. Austin was the Chief Financial Officer of The Chefâs Warehouse, Inc., a publicly traded foodservice distributor, from 2012 to 2017, after having served on the Board of Directors from 2011 to 2012. From 2009 to 2012, Mr. Austin was a founder and former Chief Financial Officer of the HILB Group, LLC, an insurance broker in Richmond, Virginia. Mr. Austin worked at Performance Food Group Company (âPFGâ), a Richmond-based publicly traded foodservice distributor, for over 14 years, serving a portion of his time as their CFO. Mr. Austin was integrally involved in leading the company through the process of going private and the divestiture of a major business segment that created significant shareholder value. Mr. Austin holds a B.S. in Accounting from the University of Delaware. Andy Anderson Chief Acquisition Officer Andy Anderson joined Sandpiper in June 2018 as Chief Acquisitions Officer, after serving as a consultant to the company. Mr. Anderson focuses on identifying and completing strategic hotel acquisitions for Sandpiper and assists with legal and capital market requirements. Mr. Anderson most recently served as the Executive Vice President of Corporate Development for WoodSpring Suites Hotels, where he was responsible for the activities of the brandâs large-scale developers nationwide and internal and external acquisitions. Mr. Anderson has more than 30 years of real estate transactional experience derived from his roles as a partner at Sandman and Savrann, a national law firm specializing in the hospitality industry, General Counsel of Mid America Real Estate Companies, Granite Golf, and his years in private practice. He also leverages over 20 years of business development in the hospitality industry and has been a critical part of business development teams for GE Capital Solutions â Hospitality Finance, Citi Hospitality Finance, Troon Golf and WoodSpring Suite Hotels. Mr. Anderson graduated with honors from the University of Tulsa College of Law and graduated Cum Laude from Northern Illinois University. Our Current Portfolio 38 Hotels 2 Hotels 2 Hotels 3 Hotels 6 Hotels 2 Hotel 1 Hotel 2 Hotel 1 Hotel 2 Hotel 2 Hotel 2 Hotel 2 Hotel 1 Hotel Coming Soon / Under contract 5 Hotels CONTACT US 7200 Glen Forest Drive, Ste 200 Richmond, VA 23226 Â  | 804.775.2200 Â©2025 Sandpiper. All rights reserved. Jim Darter President & CEO As a lifelong hotelier and business leader, Jim takes great pride in his ability to effectively utilize and balance strategic thinking, or IQ, and resonant leadership, or EQ, to lead Sandpiper Hospitality. These complimentary abilities combine to provide Sandpiper with the horsepower, collectively through his team and his strategies, it needs to maximize returns for its investors. At the end of the day, Jim knows that, âOur strategic decisions must drive our hotels to earn better than expected returns for our investors. Period.â â Jimâs leadership of the organization takes many forms, including; a resolute focus on adding and keeping genuine talent with the right abilities and mindset, setting a vision that inspires and energizes the leaders in the organization, nailing the strategic planning for the company and the individual hotels and obsessing over results, returns and the related trends. The ROI is clear and evidentâ¦â¦internally with associate growth and development, customer-facing through guest satisfaction, and financially for the investors and owners. âWe have to earn it every day, in every way,â according to Jim â Before joining Sandpiper, Jimâs perpetual drive served him well in Denver, CO as a Senior Vice President with Sage Hospitality for fourteen years and more recently as Chief Operating Officer for Gold Key/PHR. Jim also served as a Regional Director with IHG franchise operations after learning the hotel business on property with various leadership positions at a number of award-winning hotels in Toronto, Ontario, Canada, Washington DC and South Florida. At home, he is perpetually surrounded by his âgirls,â including his wife and two teenage daughters. â Tasked with executing the companyâs growth plans, Jim is equally focused on todayâs results and tomorrowâs opportunities. These parallel paths have set Sandpiper up for an explosive growth period in the coming years. âOur continued growth and expansion of brands and geography is coming as a result of our ability to perform. According to Jim, âOur dedication to excellence in people, strategy and performance is our formula to success. We play to win!â"
    },
    {
      "url": "https://www.polkcountygolf.com/golf-course/links-of-sandpiper/",
      "text": "Links of Sandpiper – Polk County Golf Courses Polk County Golf Courses Home Golf Courses All 41 Courses Top 10 Courses Best Courses For The Price Courses Near Disney Map of all Courses Details Facebook Twitter LinkedIn Report Abuse × Your Complaint * Submit $ $ $ $ 3 1 Review Featured Popular Golf Course Lakeland Links of Sandpiper The Links of Sandpiper golf course is a par 71 course offering 4 sets of tees ranging from the blue tees at 6,000 yards to the forward gold tees just over 4,000 yards. The golf course is a Links style course with rolling terrain, setting up some blind shots and doglegs. The undulating greens are protected by bunkers and the fairways are lined with oaks and pines. Water can come into play with an errant shot on most of the back nine holes. (adsbygoogle = window.adsbygoogle || []).push({}); While both challenging and fair, The Links of Sandpiper golf course is definitely user friendly and allows players the chance to use every club in their bag. From par 3’s that start at 120 yards from the back tees and stretch to 215, it allows for all shot types. The par 4’s offer a variety of challenges from short with small greens to long with larger greens. The golf course allows players to test every part of their game, and while the par 5’s are definitely birdie opportunities, you can’t take them too lightly. From out of bounds just off of the green to water strategically placed, you could walk away with a large number if you’re not careful. Additional Information Driving Range No Year Opened 1987 Public/Private Public Holes 18 Location Contact Information Address 6001 Sandpipers Dr Lakeland, FL 33809 Phone (863) 859-5461 Email Dtavlin@linkssp.com Website http://www.linksofsandpiper.com/ Video Links of Sandpiper 1 review Write Your Review 3 1 review midfloridagolfer 8 October, 2020 Short course, but fun and always in good shape. Restaurant / Bar is nice an priced right. Owners and staff are nice and customer service is up to par (no pun intended). If you play this course, regardless of player ability, you will be satisfied. Reply Write Your Review Your email address will not be published. Required fields are marked * Rating * Rate… Very poor Not that bad Average Good Perfect Comment * Name * Email * Save my name, email, and website in this browser for the next time I comment. Submit Review Cancel Reply Related Listings Popular Anglers Green Golf Course 0.0 $ $ $ $ Mulberry (863) 425-4332 Anglers Green offers its residents a private, 9-hole executive course within the community. This par 30 is a beautiful place… Read More 41237 Popular ChampionsGate Country Club 4.0 $ $ $ $ ChampionsGate (407) 507-2756 Using the beautiful elevation changes and contours of the natural landscape, George Clifton has created Central Florida's newest golf gem.… Read More 15835 Popular Imperial Lakes Country Club 2.0 $ $ $ $ Mulberry (863) 425-1153 The 18-hole Imperial Lakes Country Club in Mulberry, FL is a private golf course that opened in 1975. Designed by… Read More 44140 Search Rating Select Ratings 5 Star 4 Star & Up 3 Star & Up 2 Star & Up 1 Star & Up Driving Range Yes No Reset Filters Apply Filters Search Rating Select Ratings 5 Star 4 Star & Up 3 Star & Up 2 Star & Up 1 Star & Up Driving Range Yes No Reset Filters Apply Filters Golf Courses by City Lakeland Winter Haven Davenport Lake Wales Haines City Fort Meade Mulberry ChampionsGate Bowling Green Bartow Auburndale Frostproof Polk County Golf Courses Golf in the Heart of Florida About Team History Careers Privacy Privacy Policy Terms and Conditions Contact Us Social Facebook Instagram Twitter/X Designed with WordPress"
    },
    {
      "url": "https://www.sandpipershoes.com/about-us",
      "text": "Find Out More About Us | Sandpiper Shoes The store will not work correctly when cookies are disabled. JavaScript seems to be disabled in your browser. For the best experience on our site, be sure to turn on Javascript in your browser. We use cookies to make your experience better. To comply with the new e-Privacy directive, we need to ask for your consent to set the cookies. Learn more . Allow Cookies Request a Catalogue Find a Stockist Footwear for extra wide or swollen feet. Discover real comfort with Sandpiper. Toggle Nav Helpline 0800 822 3133 Search Search Advanced Search Search Menu New Arrivals Ladies Shoes Sandals Boots Slippers Extra Wide Ultra Wide Gentlemen Shoes Sandals Boots Slippers Extra Wide Ultra Wide Socks Accessories Purses & Bags Foot Care Shoe Care Mobility Aids Sale Shoe Offers Sandal Offers Slipper Offers Boots Offers Gentlemens Offers Extra Wide Offers CLEARANCE Account Skip to Content Sign In My Wish List My Cart Home About Us About Sandpiper Shoes Welcome to Sandpiper Shoes and welcome to comfortable feet! We feel you should know who we are and who you are dealing with online, to give you the confidence to try our range and experience our fantastic service. Sandpiper is one of the brands of Oakley Healthcare , a successful family business, established over 40 years ago and now based in Northampton. Being firmly committed to the interests of suppliers, employees and customers has given the business great strength in service. With renowned attention to detail and an outstanding in stock and delivery service, this puts the business at the forefront of the market, giving an excellent back up to the quality product range. We are a modern, dynamic and forward thinking company with a strong focus on leadership and sustainable business growth. Sandpiper is an innovative organization committed to helping people find comfort for their feet, while maintaining an aesthetically pleasing design and appearance. Award-winning customer service Customer service is our priority and we are proud to have recently been awarded the title of \"Best Wide Fitting Footwear Brand 2020\" and \"Fashion Customer Service Excellence Award 2020\" in the SME UK Enterprise Awards. Previously, Sandpiper were awarded the \"Feefo Gold Trusted Customer Service\" award in both 2017 and 2018. Sandpiper Footwear Sandpiper consists of a carefully designed range of comfort footwear and our products are known for their softness and flexibility; our shoes are built up to a standard – not down to a price. The common denominator is that everything we do should be comfortable, well fitting and easy to wear. We ensure that our customers will find the comfort they crave and happy customers with comfortable feet are our best reward. Get in touch If you wish to get in touch please call 0800 822 3133, email us at sales@sandpipershoes.co.uk or contact us using our online contact form . Sign up for our Newsletter Don't miss out! Sign up to our weekly email newsletter to keep up to date with product news and special offers from Sandpiper Extra Wide Footwear Sign up Products New Arrivals Ladies Footwear Gentlemen's Footwear Current Season About Home About Us Blog Testimonials Request our Catalogue Delivery and Returns Terms of Sale / Privacy Policy Help FAQ How to Order VAT Relief Feather Points Find a Stockist Find a Podiatrist/Chiropodist Contact Us Advice Foot Measurement Guide Shoe Size Table (UK-EUR) Shoes for diabetics Shoes for bunions Shoes for swollen feet Caring for feet Sandpiper Shoes is a trading name of Oakley Healthcare, Oakley House, Monkspond Street, Northampton, NN1 2LF. TRADE LOGIN © 2025 - Sandpiper Shoes. All Rights Reserved Crafted with by Rak Design"
    }
  ]
}