{
  "fuentes": [
    {
      "url": "https://keywest.floridaweekly.com/articles/little-room-jazz-club-to-host-lillian-baxter/",
      "email": "info@fringetheater.org"
    },
    {
      "url": "https://keywest.floridaweekly.com/articles/little-room-jazz-club-to-host-lillian-baxter/",
      "email": "jdickerson@floridaweekly.com"
    },
    {
      "url": "https://www.cntraveler.com/bars/little-room-jazz-club",
      "email": "help@newyorker.com"
    },
    {
      "url": "https://www.smallslive.com/",
      "email": "foundation@smallslive.com"
    },
    {
      "url": "https://www.smallslive.com/",
      "email": "musician@smallslive.com"
    },
    {
      "url": "https://www.usaswimming.org/home/find-a-team?format=json",
      "email": "masinfo@usaswimming.org"
    },
    {
      "url": "https://www.clubroomnyc.com/",
      "email": "reservations@clubroomnyc.com"
    },
    {
      "url": "https://www.nightflow.com/little-room-jazz-club-key-west/",
      "email": "admin@littleroomjazzclub.com"
    },
    {
      "url": "https://www.nightflow.com/little-room-jazz-club-key-west/",
      "email": "scott@scottkanacher.com"
    },
    {
      "url": "https://thevendry.com/venue/255201/little-room-jazz-club-key-west-fl",
      "email": "admin@littleroomjazzclub.com"
    },
    {
      "url": "https://www.revroom.com/contact-us/",
      "email": "chris@lovelivemusic.com"
    },
    {
      "url": "https://www.revroom.com/contact-us/",
      "email": "suzon@lovelivemusic.com"
    },
    {
      "url": "https://www.mishcon.com/jazzshapers/tim-little-26-10-2019",
      "email": "contactus@mishcon.com"
    },
    {
      "url": "https://route1views.com/travel/little-jazz-room-key-west/",
      "email": "guest@domain.com"
    },
    {
      "url": "https://jazzhousekids.org/about-us/who-we-are/",
      "email": "info@jazzhousekids.org"
    },
    {
      "url": "https://keysthrive.com/dt_listing/little-room-jazz-club/",
      "email": "admin@littleroomjazzclub.com"
    },
    {
      "url": "https://keysthrive.com/dt_listing/little-room-jazz-club/",
      "email": "info@keysthrive.com"
    },
    {
      "url": "https://www.jazzleadershipproject.com/contact-us",
      "email": "gj@jazzleadershipproject.com"
    }
  ],
  "mails": [
    "admin@littleroomjazzclub.com",
    "chris@lovelivemusic.com",
    "contactus@mishcon.com",
    "foundation@smallslive.com",
    "gj@jazzleadershipproject.com",
    "guest@domain.com",
    "help@newyorker.com",
    "info@fringetheater.org",
    "info@jazzhousekids.org",
    "info@keysthrive.com",
    "jdickerson@floridaweekly.com",
    "masinfo@usaswimming.org",
    "musician@smallslive.com",
    "reservations@clubroomnyc.com",
    "scott@scottkanacher.com",
    "suzon@lovelivemusic.com"
  ],
  "nombre_sitio": "littleroomjazzclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://keywest.floridaweekly.com/articles/little-room-jazz-club-to-host-lillian-baxter/",
      "text": "Little Room Jazz Club to host Lillian Baxter - Key West Florida Weekly Search for: Search Submit Key West Florida Weekly Key West Home News A&E Events Real Estate Marketplace Print Editions Business Directory Archives Choose Your Community Bonita Springs Charlotte County Fort Myers Key West Naples Palm Beach Florida Weekly Home About Us Advertising Solutions Newsstand Locations Frequently Asked Questions Careers Contact Us Report Website Accessibility Problems Pay Your Advertising Invoice Obituaries Place An Obituary Log In Privacy Policy Florida Weekly Home Fort Myers Bonita Springs Charlotte County Key West Naples Palm Beach Popular Categories Dining and Entertainment (168) Real Estate (35) Shopping (23) Health and Beauty (20) Professional Services (18) Automotive and Marine (6) Select search type Places Events Search for City or Zip Search Search Search Search {\"hide_search_input\":\"\",\"hide_near_input\":\"\",\"show\":\"\",\"filters_pos\":\"\",\"input_size\":\"\",\"bar_flex_wrap\":\"\",\"bar_flex_wrap_md\":\"\",\"bar_flex_wrap_lg\":\"\",\"input_border\":\"\",\"input_border_opacity\":\"\",\"input_rounded_size\":\"\",\"btn_bg\":\"\",\"btn_rounded_size\":\"\",\"btn_rounded_size_md\":\"\",\"btn_rounded_size_lg\":\"\",\"bg\":\"\",\"mt\":\"\",\"mr\":\"\",\"mb\":3,\"ml\":\"\",\"pt\":\"\",\"pr\":\"\",\"pb\":\"\",\"pl\":\"\",\"border\":\"\",\"rounded\":\"\",\"rounded_size\":\"\",\"rounded_size_md\":\"\",\"rounded_size_lg\":\"\",\"shadow\":\"\",\"css_class\":\"\"} Loading... No Records Found Sorry, no records were found. Please adjust your search criteria and try again. Maps failed to load Sorry, unable to load the Maps API. Thursday, September 11, 2025 Search Newsletter Events Photos Classifieds Subscribe Marketplace Home News A&E What To Do, Where To Go Key West Happy Hours Cuisine Events Add Event Real Estate Special Sections Staycations & Getaways 2024 Breast Cancer 2024 Veterans 2025 Pet Obituaries Place An Obituary Little Room Jazz Club to host Lillian Baxter By Florida Weekly Staff on May 19, 2022 John Vessels is Lillian Baxter, who appears in Fringe Theater’s production of “A FABULOUS Evening with Lillian Baxter,” at the Little Room Jazz Club. COURTESY PHOTO Fringe Theater announces the return of Lillian Baxter to the Little Room Jazz Club, June 1-4, in the all-new “A FABULOUS Evening with Lillian Baxter,” starring John Vessels and Jay Schwandt. Musical theater meets cabaret when these two guys perform their one-woman show. “Our Key West audience fell in love with Lillian, when we first introduced her in 2016,” Fringe Managing Artistic Director Rebecca Tomlinson said. “I think it was a combination of her knockout voice and upbeat approach to life’s little foibles. So we keeping asking John and Jay to write new shows for us so we can keep bringing her back!” This year’s show is a one-woman musical Pride parade of show tunes, gay anthems and disco. So who is this Lillian Baxter? Lillian is a fictional character created by actor and writer John Vessels. “She was almost huge in the 1960s. Her voice took her places that her looks, perhaps, could not,” Vessels said. He clarified something: “Lillian isn’t a drag act, beyond the obvious fact that I’m wearing a frock or two. Lillian is a fully realized human being living in a comedy format.” “Lillian never gives up,” said Jay Schwandt, the show’s pianist and musical arranger. “She might mope, but she always picks herself up and carries on!” Vessels and Schwandt came to theater by way of music. Schwandt’s degrees are in music composition, and Vessels’ degree is in opera. On the rare occasion when Vessels is not performing professionally, he teaches voice and acting in Indianapolis, and Schwandt is an associate professor of musical theater at Ball State University. “A FABULOUS Evening with Lillian Baxter” runs 7 p.m. June 1-4 at the Little Room Jazz Club, at 821 Duval St. Doors will open nightly at 6, so patrons can dine from the Little Room’s menu and full bar. Little Room’s regularly scheduled musical entertainment is at 9 p.m. Tickets are $35 general admission and $50 reserved seating and are available online at www.fringetheater.org or by calling 305-731-0581. Seating is limited, so advanced ticket purchase is encouraged. Fringe Theater is Key West’s community focused theater. Fringe is a 501(c)3 nonprofit with an outreach and education program. For more information about Fringe, contact info@fringetheater.org . ¦ Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Current ye@r * Leave this field empty Δ Loading Contact Us! Click Here for Our Offices Home Map It Out Arts and Entertainment News What To Do Where To Go Events Real Estate Business Directory Past Print Editions Newsletter Newsstands Website Accessibility Our Hometown DMCA Notices Newspaper website content management software and services If you have any problems, questions, or comments regarding www.FloridaWeekly.com , please contact our Webmaster .\nFor all other comments, please see our contact section . For more information on this site please read our Terms and Conditions , Privacy Policy , and Ad Choices . Copyright © 2007 - 2025  Florida Media Group LLC Change Location Find awesome listings near you! Change Location"
    },
    {
      "url": "https://www.cntraveler.com/bars/little-room-jazz-club",
      "text": "Little Room Jazz Club — Bar Review | Condé Nast Traveler Skip to main content Newsletter Sign In Search Search Newsletter Inspiration Destinations Places to Stay News & Advice Curated Escapes Shopping Cruise Women Who Travel Video North America Chevron United States Chevron Florida Chevron Key West Chevron Review: Little Room Jazz Club Grab a Champagne cocktail and settle in for a night of first-rate performances. Chevron Chevron Photos Save Story Save this story Save Story Save this story Reviewed by Jennifer M. Wood What's your first impression of this place? You’ll know you’ve arrived at the Little Room Jazz Club by the blue-lit stairs that guide you inside to this intimate space, which has everything you want in a music club: talented performers, an above-average cocktail menu, sleek seating, and a sexy, candlelit look that fits the sultry sounds onstage. If you prefer your music in the background, there are a couple of little nooks farther from the stage, as well as some outdoor seating—if you can nab it. What's the crowd like? Lots of regulars, many of whom come a couple times a week to kick back with a drink and immerse themselves in a lineup of talented musicians from around the world. But newcomers are equally welcome. How are the drinks? While the wine and beer lists are extensive, most patrons order cocktails. Hemingway’s Death By Champagne—a Champagne cocktail with absinthe bitters, lemon, and Lillet Blanc—is a house specialty. Worth ordering something to eat, too? Small bites like charcuterie and cheese boards are superbly executed, and the menu will appeal to a variety of palates. The Jazzy fried chicken bites come with a spicy apricot jam for dipping; deviled eggs, shrimp and grits, and cheese-and-lemon lobster cakes are also hits. How's the service? The staff here knows the menu as well as they do their music; our server seemed to know the biographies of everyone who's ever played on this stage. So why would you recommend this place, and what for? With its romantic vibe and hidden little nooks, the Little Room Jazz Club makes for a superb date night in Key West . And you don’t have to be a jazz virtuoso to feel right at home. The music will certainly keep your attention, but it’s not so loud or overwhelming that you can’t carry on a proper conversation. Location Map Contact 821 Duval St, Key West, Florida 33040 United States More To Discover Hotel Eden House $$ | United States, Key West, 1015 Fleming St. Skip the resorts and experience the real Key West. Book Now at Expedia Powered By: Expedia Resort Casa Marina Key West, Curio Collection by Hilton $$ | United States, Key West, 1500 Reynolds St The place to stay for nearly a century, and now, this grande dame hasn’t lost any of her luster. Book Now at Expedia Powered By: Expedia Resort Hyatt Centric Key West Resort & Spa $$ | United States, Key West, 601 Front St If there was ever a place to forget your worries in postcard-worthy seclusion, it’s here. Book Now at Expedia Powered By: Expedia Hotel La Concha Key West, Autograph Collection $$ | United States,  Key West,  430 Duval St. An unbeatable mix of style and substance Book Now at Expedia Powered By: Expedia Resort Ocean Key Resort & Spa $$ | United States, Key West, Zero Duval St. Slushy frozen drinks and sunsets on the Pier are classic Key West, and it’s right outside your door here. Book Now at Expedia Powered By: Expedia Resort Sunset Key Cottages $$$ | United States, Key West, 245 Front St A private island escape Book Now at Expedia Powered By: Expedia Read More The 10 Best Bars in Key West Pinterest Facebook Snapchat Instagram X As the most discerning, up-to-the-minute voice in all things travel, Condé Nast Traveler is the global citizen’s bible and muse, offering both inspiration and vital intel. We understand that time is the greatest luxury, which is why Condé Nast Traveler mines its network of experts and influencers so that you never waste a meal, a drink, or a hotel stay wherever you are in the world. About Condé Nast Traveler Subscribe Manage Account Newsletter Sign Up Readers' Choice Awards Archive Contact the Editors Careers User Agreement Privacy Policy Your California Privacy Rights RSS Feeds Condé Nast Store © 2025 Condé Nast. All rights reserved. Condé Nast Traveler may earn a portion of sales from products that are purchased through our site as part of our Affiliate Partnerships with retailers. The material on this site may not be reproduced, distributed, transmitted, cached or otherwise used, except with the prior written permission of Condé Nast. Ad Choices Select international site United States LargeChevron India Spain United Kingdom Middle East Germany"
    },
    {
      "url": "https://www.smallslive.com/",
      "text": "Smalls Jazz Club - SmallsLIVE Welcome to SmallsLIVE Musician Login Forgot Your Password? If you have performed at Smalls and Mezzrow and do not have an artist account, please send an email to musician@smallslive.com Welcome to SmallsLIVE Become a Member Already a Member? Sign In Subscribe to Our Newsletter Are you a musician who has performed at Smalls or Mezzrow in the past and doesn’t have an artist account then please contact us directly at musician@smallslive.com. Donate by BitCoin To donate in Bitcoin, please contact us directly at foundation@smallslive.com . Donate by Check or Wire By check: Please make checks payable to the SmallsLIVE Foundation, Inc. c/o The SmallsLIVE Foundation 183 West 10th Street, basement New York City, NY 10014 By wire: The SmallsLIVE Foundation, Inc Tax ID: 38-4083862 c/o M & T Bank 95 Madison Ave New York City, NY 10016 Checking Account #986-273-5256 Routing# 022-0000-46 Tickets Info Archive Livestream Contact About Musician Login Musician Login Tickets Info Archive Livestream Contact About Here is the modal dummy body text. Go to New Foundation site. Please use this Smalllive for your future useage. ARCHIVE ACCESS Please become a Supporting Member of The SmallsLIVE Foundation with a tax-deductable donation to access this content. More Info Foundation The SmallsLIVE Foundation for Jazz Art & Education is a not-for-profit arts organization.  \n             Our mission is to subsidize the operation of our venues, recording projects, tours and educational initiatives.  \n             During this Covid-19 pandemic our mission is to keep the clubs floating until business can be restored.  \n             We will also sponsor live-streamed concerts from the club that will keep the musicians working during this period.  \n             We will also be offering emergency aid for Jazz musicians in need due to this calamity. Archive The SmallsLIVE Archive is an audio/video library of all the shows at Smalls & Mezzrow.\n          Royalties are paid directly to the musicians by The SmallsLIVE Foundation.\n          Members sponsor their favorite musicians by listening to their music. Live Stream Smalls Jazz Club has been a pioneer in live streaming and began streaming shows live from the venue in 2007.  \n             There is no cost to watch our live streams.  During normal operating times the entire evening is streamed.  \n             During this Covid-19 pandemic period there will be special live concerts scheduled in advance. SmallsLIVE Catalog The SmallsLIVE Catalog is a collection of individually produced artist projects.\n          SmallsLIVE Members may sponsor artists of their choice and receive their music as downloads or CDs.\n          Sponsorships directly support the artist. Today + Tomorrow \\ Sep 11 Thu - Sep 12 Fri Click on an event to purchase tickets Live Now Dan Wilkins Quartet Live at Smalls Thu Sep 11 Sets at 6:00 PM & 7:30 PM Dan Wilkins / Tenor Sax Jon Ballantyne / Piano Adrian Moring / Bass Byron Landham / Drums Live Now Dena DeRose Quartet Live at Mezzrow Thu Sep 11 Sets at 6:00 PM & 7:30 PM Dena DeRose / Piano Ed Neumeister / Trombone Martin Wind / Bass Matt Wilson / Drums Live Now Adam Larson Quartet Live at Smalls Thu Sep 11 Sets at 9:00 PM & 10:30 PM Adam Larson / Tenor Sax Chris McCarthy / Piano Matt Penman / Bass Ari Hoenig / Drums Live Now Theo Hill Trio Live at Mezzrow Thu Sep 11 Sets at 9:00 PM & 10:30 PM Theo Hill / Piano Dezron Douglas / Bass Kush Abadey / Drums Live Now After Hours Happy Hour Live at Mezzrow Thu Sep 11 From 11:30 PM - 12:45 AM Live Now Jam Session Hosted By Matt Snow Live at Smalls Thu Sep 11 From 11:45 PM - 4:00 AM Matt Snow / Bass Caleb Curtis / Alto Sax Yago Vazquez / Piano Ocie Davis / Drums Live Now Smalls Afternoon Jam Session Hosted By Marc Devine Live at Smalls Fri Sep 12 From 2:00 PM - 5:30 PM Marc Devine / Piano Hide Tanaka / Bass Fukushi Tainaka / Drums Live Now Gilad Hekselman & Trio Grande Live at Smalls Fri Sep 12 Sets at 6:00 PM & 7:30 PM Gilad Hekselman / Guitar Will Vinson / Alto Sax Nate Wood / Drums Live Now Ted Rosenthal Trio Live at Mezzrow Fri Sep 12 Sets at 6:00 PM & 7:30 PM Ted Rosenthal / Piano Noriko Ueda / Bass Quincy Davis / Drums Live Now Jonathan Barber & Vision Ahead Live at Smalls Fri Sep 12 Sets at 9:00 PM & 10:30 PM Jonathan Barber / Drums Matt Knoegel / Tenor Sax Tony Davis / Guitar Luther S. Allison / Piano Matt Dwonszyk / Bass Live Now David Berkman Trio Live at Mezzrow Fri Sep 12 Sets at 9:00 PM & 10:30 PM David Berkman / Piano John Hebert / Bass Allan Mednard / Drums Live Now Eric Wyatt Quartet Live at Smalls Fri Sep 12 From 11:55 PM - 4:00 AM Eric Wyatt / Tenor Sax Tyler Bullock / Piano Guilio Xavier Cetto / Bass David Hawkins / Drums Live Now Round Midnight Solo Piano with Ian MacDonald Live at Mezzrow Fri Sep 12 From 11:55 PM - 1:00 AM Ian Macdonald / Piano Upcoming Shows \\ sep 11 - nov 1 All Smalls Mezzrow Date Click for more Support musician You have chosen to sponsor the live show of on .\n          This is a tax deductible donation to the SmallsLIVE Foundation. The minimum donation amount is $ , all of which is paid to the musicians on this show.\n          You may choose to donate more. Anything donated over the minimum is divided by the musicians and the foundation. Your name or dedication will be included on our site, in our newsletter and announced at the live concert.\n          You may also choose to make this sponsorship anonymously. Your dedication (leave blank for an anonymous donation): If you prefer to sponsor a band with a check or transfer, please contact us directly, foundation@smallslive.com Cancel Confirm Copyright ®2025 SmallsLIVE All rights reserved. Subscribe to our newsletter"
    },
    {
      "url": "https://www.usaswimming.org/home/find-a-team?format=json",
      "text": "Find A Team Events & Tickets Fan Shop Swim Shop Find A Team Block Party Membership Login / Register Times Times Home Popular Resources Individual Times Search Top Times / Event Rank Power Point Calculator Time Standards National Age Group Records All-Time Top 100 Age Group Scholastic All-America Virtual Offerings IMX/IMR Virtual Club Championship Block Party Leaderboard Club Excellence Data Hub Record Progressions All-Time Top Performers Yearly Top Performers All-Time Relay Splits World Rankings Powered by USA Swimming Continental Lists Meet Results Other Organizations NCAA Information NCAA Division I NCAA Division II NCAA Division III International School Swimming Competitions - China Swimmers & Parents Swimmers & Parents Home Popular Resources Register & Renew Membership USA Swimming University Mental Training & Wellness Anti-Doping Diversity, Equity & Inclusion Disability Nutrition & Recovery Learn the Basics Learn-to-Swim Find a Swim Team & Lessons Rules & Policies Swimmers Athlete Videos Training & Technique Open Water Swim Camps Parents Safe Sport for Parents Become an Official Coaches & Team Leaders Coaches & Team Leaders Home Coaches Coach Requirements Coach Safety Requirements American Development Model Coach Certification Program Coaches Community Coach Mental Health & Wellness Team Leaders Start a New Club Managing Your Team Block Party Grants Marketing Toolkit SWIMS Alerts Swim Camps Connect & Learn Diversity, Equity & Inclusion Disability Programs & Services Resources Registration & Renewal Team Services USA Swimming University Online Meet Entry (OME) Job Board Health Coverage Financial Advising Officials Officials Home Popular Resources Officials Tracking System National Certification & Evaluation National Meet Applications Rules & Policies Online Testing Recognition & Incentive Programs Officials Documents Open Water Officials Getting Started USA Swimming University How to Become an Official LSC Officials Chairs Safe Sport Safe Sport Home Club Tool Kit Report a Concern Complete a Background Check Safe Sport Club Recognition Minor Athlete Abuse Prevention Policy Athlete Protection Training Individuals Suspended or Ineligible Meet the Team Meet the Team Home National Team National Jr. Team Rosters National Team Alumni Athlete Videos 2024 Olympic Team About About Home Organization Overview Leadership Team Board of Directors Staff Directory Contact Us Careers Governance Board Governance Bylaws Rules & Policies Committees Board Meeting Minutes Financials USA Swimming Annual Summit LSC Resources LSC Services LSC Websites LSC Governance LSC Treasurer Operational Risk Resources Media Information Marketing Partners Marketing Resources Insurance Online Member Registration SWIMS Database Newsletter Archive Stakeholder Engagement Foundation DONATE Times Swimmers & Parents Coaches & Team Leaders Officials Safe Sport Meet the Team About Foundation MEMBERSHIP VIDEOS EVENTS & TICKETS SWIM SHOP FAN SHOP FIND A TEAM Donate BACK Times Popular Resources Individual Times Search Top Times / Event Rank Power Point Calculator Time Standards National Age Group Records All-Time Top 100 Age Group Scholastic All-America Virtual Offerings IMX/IMR Virtual Club Championship Block Party Leaderboard Club Excellence Data Hub Record Progressions All-Time Top Performers Yearly Top Performers All-Time Relay Splits World Rankings Powered by USA Swimming Continental Lists Meet Results Other Organizations NCAA Information NCAA Division I NCAA Division II NCAA Division III International School Swimming Competitions - China BACK Swimmers & Parents Popular Resources Register & Renew Membership USA Swimming University Mental Training & Wellness Anti-Doping Diversity, Equity & Inclusion Disability Nutrition & Recovery Learn the Basics Learn-to-Swim Find a Swim Team & Lessons Rules & Policies Swimmers Athlete Videos Training & Technique Open Water Swim Camps Parents Safe Sport for Parents Become an Official BACK Coaches & Team Leaders Coaches Coach Requirements Coach Safety Requirements American Development Model Coach Certification Program Coaches Community Coach Mental Health & Wellness Team Leaders Start a New Club Managing Your Team Block Party Grants Marketing Toolkit SWIMS Alerts Swim Camps Connect & Learn Diversity, Equity & Inclusion Disability Programs & Services Resources Registration & Renewal Team Services USA Swimming University Online Meet Entry (OME) Job Board Health Coverage Financial Advising BACK Officials Popular Resources Officials Tracking System National Certification & Evaluation National Meet Applications Rules & Policies Online Testing Recognition & Incentive Programs Officials Documents Open Water Officials Getting Started USA Swimming University How to Become an Official LSC Officials Chairs BACK Safe Sport Club Tool Kit Report a Concern Complete a Background Check Safe Sport Club Recognition Minor Athlete Abuse Prevention Policy Athlete Protection Training Individuals Suspended or Ineligible BACK Meet the Team National Team National Jr. Team Rosters National Team Alumni Athlete Videos 2024 Olympic Team BACK About Organization Overview Leadership Team Board of Directors Staff Directory Contact Us Careers Governance Board Governance Bylaws Rules & Policies Committees Board Meeting Minutes Financials USA Swimming Annual Summit LSC Resources LSC Services LSC Websites LSC Governance LSC Treasurer Operational Risk Resources Media Information Marketing Partners Marketing Resources Insurance Online Member Registration SWIMS Database Newsletter Archive Stakeholder Engagement BACK Foundation Dive In Find A Team & Lessons Join USA Swimming Today Find a Team or Learn to Swim Welcome to the new Find A Team! Here you can find one of 2,800+ USA Swimming clubs and hundreds of Learn to Swim programs to join the competitive side of the sport (indicated by blue pins on the map). Contact these programs directly to learn about the many options about how to join USA Swimming and enjoy swimming at any level! For more information on this map, please click here Finder Type USA Swimming Club Learn To Swim Club Excellence Level None Bronze Silver Gold Safe Sport Recognized Yes No FILTER HIDE FILTERS SWIM LESSON PROVIDER NETWORK To distinguish these providers, we designate them as part of USA Swimming’s Swim Lesson Provider Network, as these swim lesson providers go above and beyond to provide a safe environment and facility by using trained and certified instructors and\n        lifeguards, low student to teacher ratios, and proven techniques and curricula to ensure a quality learning experience for every child. The benefits of being a part of USA Swimming’s Swim Lesson Provider Network are endless! Swim Lesson Providers are connected to local Water Safety Coalition networks and supporting organizations, and provided access to discounted or free materials\n            and resources to use when hosting water safety events. Additionally, the USA Swimming Foundation has an annual grant fund for learn-to-swim providers who offer services to children who, otherwise, would not have the opportunity to participate\n            swimming lessons. Are you providing youth learn-to-swim services and interested in joining our network of  Swim Lesson Providers? To learn more about the program check out our Swim Lesson Provider Network Requirements. READY TO JOIN OUR NETWORK Are you providing youth learn-to-swim services and interested in joining our network of Swim Lesson Providers? Questions? Contact us via email . Our Community Swimmers Coaches Officials Team Leaders Resources SafeSport Club Portal Find a Team Find Swim Lessons Diversity, Equity & Inclusion Rules & Policies About Overview Board of Directors Careers Contact The Foundation About the Foundation Support the Foundation Ambassadors News & Events Follow DONATE © Copyright 2025 USA Swimming. All Rights Reserved. Privacy Policy Terms of Use Personal Data Request Form"
    },
    {
      "url": "https://www.clubroomnyc.com/",
      "text": "Club Room | Cocktail Bar & Live Music in SoHo | Soho Grand Hotel Skip to Main Content Schedule About Menu Photos Stories Groups Private Events Wednesday thru Saturday from 6:00pm 'til late 212.965.3588 310 West Broadway New York, NY 10013 Schedule About Menu Photos Stories Groups Private Events Reservations Live Music & Dining Late Night Tables Be a Part of the Downtown Scene by Having Your Own Party Within It Get in touch by sending us the details below! Please fill out your First and Last Name Full Name Title Please fill out your Company Company Please fill your Emil Address Email address Please fill out your Phone Number Phone number Please fill out the Date and Time Date* Please fill the Event Type Type of Event* Brunch Dinner Party Reception Filming Corporate Event Other Event type Please fill out the Number of Guests Number of guests Comments Submit Thank you for your inquiry! Your request has been received, and we look forward to connecting with you in the next 24-48 hours. Wednesday thru Saturday\nfrom 6:00pm 'til late | 212.965.3588 | 310 West Broadway New York, NY 10013 Schedule View Line Up Leah Rich Wednesday, September 10 7:30PM | 9:00PM Details Reserve Leah Rich Wednesday, September 10 7:30PM | 9:00PM Reserve Add to Calendar Leah Rich is a New York City–based singer whose warm, expressive voice combines classic traditions with a contemporary, cosmopolitan flair. Leah’s authentic, urban style bridges the gap between her Soviet Azeri roots, and her metropolitan upbringing. \r\n\r\nHer performances are marked by a refined sense of swing, fluid phrasing, and a natural storytelling ability that draws audiences in with both intimacy and sophistication. Whether in an intimate club setting or on a larger stage, Leah Rich captivates listeners with a style that feels timeless yet distinctly her own. Wayne Tucker Quartet Thursday, September 11 7:30PM | 9:00PM Details Reserve Wayne Tucker Quartet Thursday, September 11 7:30PM | 9:00PM Reserve Add to Calendar Wayne Tucker is a dynamic New York City trumpeter, composer, and vocalist whose music seamlessly fuses jazz, soul, R&B, and pop. Known for his warm, lyrical trumpet tone and soulful improvisations, he brings a modern sensibility to the jazz tradition while appealing to a wide range of listeners. Tucker has performed with an impressive roster of artists, including Taylor Swift, Kurt Elling, Dee Dee Bridgewater, and Jazz at Lincoln Center, and he is also the leader of his own band, Wayne Tucker & The Bad Mothas. Whether on stage as a sideman or fronting his group, Tucker captivates audiences with his charisma, versatility, and emotionally charged performances. N'Kenge Friday, September 12 7:30PM | 9:00PM Details Reserve N'Kenge Friday, September 12 7:30PM | 9:00PM Reserve Add to Calendar N’Kenge is a dazzling, genre-defying singer and performer whose powerful voice and magnetic stage presence have earned her acclaim on Broadway, in opera houses, and with symphony orchestras worldwide. A Juilliard and Manhattan School of Music graduate, she effortlessly moves between classical, jazz, gospel, pop, and soul, bringing both virtuosity and emotional depth to every performance. On Broadway, she has starred in productions such as Motown: The Musical and the revival of Caroline, or Change, and she frequently appears as a soloist with major orchestras, showcasing her remarkable vocal versatility. Dolly Lowe Saturday, September 13 7:30PM | 9:00PM Details Reserve Dolly Lowe Saturday, September 13 7:30PM | 9:00PM Reserve Add to Calendar Dolly Lowe is an 20 year old French/British singer-songwriter, actress and model performing in LA, NY, London and Paris. Trained by the Franco Iranian opera/folk singer Ariana Vafadari Dolly directed her exceptional voice to the singing of jazz and blues. Melaner Wednesday, September 17 7:30PM | 9:00PM Details Reserve Melaner Wednesday, September 17 7:30PM | 9:00PM Reserve Add to Calendar Brooklyn-based Afro-Latina singer-songwriter Melaner is celebrated for her genre-spanning sound that fuses Afro-Latinx rhythms with modern pop, neo-soul, and jazz sensibilities. A Berklee College of Music alumna, she brings refined musicality and storytelling to every performance. Known for delivering bilingual (English and Spanish) sets that boldly embrace her heritage, she rose to wider recognition as a top-nine finalist on Univision’s Reina De La Canción. Melaner is also a powerful advocate for Afro-Latina representation in Latin music, aiming to open doors and challenge industry norms through both her art and her voice. D'Nasya Thursday, September 18 7:30PM | 9:00PM Details Reserve D'Nasya Thursday, September 18 7:30PM | 9:00PM Reserve Add to Calendar Brooklyn native D’Nasya is a versatile vocalist and performer whose work spans Broadway, opera, and international stages. A proud LaGuardia High School alum, she went on to star in leading roles in several operas during college. Her Broadway credits include Summer: The Donna Summer Musical, Hairspray, and Sister Act. When she’s not touring abroad, D’Nasya headlines with her own band in NYC and performs regularly with Broadway Sings. Sonny Step Quartet Friday, September 19 7:30PM | 9:00PM Details Reserve Sonny Step Quartet Friday, September 19 7:30PM | 9:00PM Reserve Add to Calendar Sonny Step is an jazz/RnB/Soul singer-songwriter and multi-instrumentalist born and raised in Philadelphia. Based in New York City, he has played with a large array of top acts in notable venues such as Rihanna at the 2016 VMA’s, Shawn Mendes and Ricky Martin at the Prudential Center, Solange Knowles at her powerful performance at the Guggenheim, and Diplo at Governor’s Ball playing in front of a crowd of thousands. Darnell White Quartet Saturday, September 20 7:30PM | 9:00PM Details Reserve Darnell White Quartet Saturday, September 20 7:30PM | 9:00PM Reserve Add to Calendar Darnell White is a dynamic Harlem-born singer-pianist, composer, and musical director who stands as a pillar of NYC’s jazz and cabaret scene. A LaGuardia High School and Juilliard alumnus, he’s garnered acclaim for his heartfelt renditions of pop and jazz standards, inventive covers—like his crowd‑pleasing take on Radiohead’s “Creep”—and engaging stage presence that regularly earns standing ovations thedjangonyc.com. A 2025 MAC Award winner, White leads his trio and quartet at top venues like The Club Room, The Django, Roxy Bar, 54 Below, Birdland, and Lincoln Center, while also working as a sought-after vocal coach, arranger, and music director for off‑Broadway shows (Revelation The Musical, Gospel at Colonus), Broadway artists (Melba Moore, Brian McKnight), and churches and opera choruses across the region the djangonyc.com. His performances are celebrated for their soulful sophistication, blend of genres, and his seamless shift between pianist and vocalist—making each show an inspiring, emotionally immersive experience. Anita Donndorff Quartet Wednesday, September 24 7:30PM | 9:00PM Details Reserve Anita Donndorff Quartet Wednesday, September 24 7:30PM | 9:00PM Reserve Add to Calendar Argentinian vocalist and composer Anita Dondorff is one of the most influential jazz artists in her native Buenos Aires. Earlier this year she moved to New York, where she performs regularly with some of the most renowned musicians from the local scene, while working on her second studio album. ELEW Trio Thursday, September 25 7:30PM | 9:00PM Details Reserve ELEW Trio Thursday, September 25 7:30PM | 9:00PM Reserve Add to Calendar ELEW (Eric Lewis) is an innovative pianist and composer who redefines the boundaries of jazz by blending virtuosic technique with the raw energy of rock, hip-hop, and pop. A former winner of the Thelonious Monk International Piano Competition, he has performed with jazz greats like Wynton Marsalis, Cassandra Wilson, and Elvin Jones, but is best known for pioneering “Rockjazz,” a high-octane style where he transforms contemporary rock and pop hits into explosive, percussive piano performances. Often playing standing up and reaching inside the instrument to create bold new sounds, ELEW captivates audiences with both his musicianship and theatrical flair. His fearless approach bridges genres and generations, making him a singular presence on today’s music scene. Madelyn Hicks Quartet Friday, September 26 7:30PM | 9:00PM Details Reserve Madelyn Hicks Quartet Friday, September 26 7:30PM | 9:00PM Reserve Add to Calendar Madelyn Hicks is a New York City-based vocalist, born and raised in Dallas, Texas. Known for her dynamic presence across the NYC club scene, she offers a fresh and engaging take on live music. Her sets blend inventive covers of soulful '70s and '80s classics, folk-rock flavors, the Great American Songbook, and reimagined modern hits. She’s joined by her talented quartet for a groovy, genre-blending set featuring the sounds of Amy Winehouse, Aretha Franklin, and more. Tyreek McDole Quartet Saturday, September 27 7:30PM | 9:00PM Details Reserve Tyreek McDole Quartet Saturday, September 27 7:30PM | 9:00PM Reserve Add to Calendar Tyreek McDole is a Haitian-American baritone vocalist based in New York City, whose soulful warmth and masterful command of jazz tradition have rapidly marked him as one of the most promising new voices in the genre. He first captured attention by winning the Outstanding Vocalist Award at Jazz at Lincoln Center’s 2018 Essentially Ellington Competition. In 2023, he further solidified his reputation by winning first place in the prestigious Sarah Vaughan International Jazz Vocal Competition, becoming only the second male vocalist to do so in the competition’s history. In 2025, he released his debut album Open Up Your Senses on Artwork Records—a beautifully crafted and spiritually resonant project that earned him acclaim, including four stars in DownBeat and praise as a bold and thoughtful debut. View Line Up Dinner Cocktails Wine & Beer Starters Olives and Marcona Almonds 12 Dressed Oysters 26 white balsamic mignonette, cucumber, peppercorns\r\n\r\nadd caviar +45 Crisp Endive 21 hazelnut, aged gouda, soft herb vinaigrette Parmesan Crusted Asparagus 23 preserved lemon remoulade Club Fries 21 truffle fondue, smoked chili aioli Caviar Service 135 1 oz Kristal Caviar, brioche toast points, traditional accompaniments Main Grilled Cheese Toasts 23 three cheese blend, dijonnaise, roasted tomato, frisée Truffled Stracciatella 28 honeycomb, grilled sourdough Petite Lobster Rolls 34 brown butter mayo, gaufrette potatoes Baked Stuffed Pasta Arrabiata 29 ricotta, basil, smoked pecorino Herb Roasted Chicken Breast 35 grilled romaine caesar Club Burger 26 8oz dry aged patty, taleggio, caramelized onions, black garlic mayo Grilled Club Steak 46 7oz sliced filet mignon, watercress, crispy fries, hotel butter Dessert Grand Sundae 16 salted caramel ice cream, candied popcorn & peanuts, warm chocolate sauce Cocktails The Club Room Old Fashioned 28 jefferson's very small batch bourbon, whistle pig, 10 yr rye, black cherry mace, angostura and black lemon bitters The Club Room Martini Service 28 no. 3 London dry gin, dry vermouth rinse, assorted garnish, lemon-infused olive oil Champagne Cocktail 28 rose, cardamom, champagne Magnificent Dance 22 Jamaican rum, overproof rum passionfruit, lime, orange, peach, ginger, cinnamon, absinthe, angostura bitters The Nitehawk 19 old forester bourbon, campari, sweet vermouth, mr. black coffee liqueur, orange bitters Looks Tequila 20 jalapeño infused tequila blanco, yellow chartreuse, lime, cucumber bitters Gin Blossom 19 dorothy parker rose gin, singani, grapefruit, lemon, raspberry Whiskey Sour 20 bourbon, honey, ancho chile, lemon, aromatic bitters Classics The Spritz 20 amante 1530 aperitivo, lime, sparkling wine, grapefruit soda French 75 20 hennessy vs cognac, lemon, sugar, champagne Last Word 22 tanqueray 10, green chartreuse, maraschino, lime The Tonic 20 St. George green chili vodka, pineapple, lime, agave, fever tree tonic Aviation 20 no. 3 London dry gin, maraschino, violette, lemon Naked & Famous 24 del maguey chichicapa mezcal, aperol, yellow chartreuse, lime Espresso Martini 20 grey goose vodka, mr. black cold brew liqueur, espresso, cinnamon Old Cuban 24 zacapa 23 rum, lime juice, mint, angostura bitters, champagne Oaxacan Old Fashioned 20 casamigos reposado tequila, mezcal, agave, angostura bitters The Manhattan 28 sir davis rye whiskey, sweet vermouth, angostura bitters Sazerac 26 whistle pig 10 yr rye, absinthe, demerara sugar, peychaud bitters Godfather 20 macallan 12 yr scotch, adriatico amaretto, angostura bitters Select Scotch Glengoyne 175 Scotch 25 year Mortlach 80 20 year old cowie's blue single malt Craigellachie 55 17 year Bruichladdich 195 Art Edition 10.1 Limited Edition 2022, 29 years aged unpeated islay barley islay single malt Free-Spirited Non-Alcoholic Cocktails Pitch Perfect 16 martini & rossi vibrante, gifford na elderflower liqueur, lime juice, fever tree tonic Hot Child 16 almave amber blue agave, giffard na pineapple liqueur, jalapeno, agave nectar, passion fruit I Got Cha 16 ghia berry aperitif, ginger, lemon, club soda Sparkling Cava, Cune Cava Brut, SP NV 17/76 Champagne, Lanson, Pere & Fils Brut, FR NV 34/150 Champagne, Billecarte-Salmon, Brut Réserve, Fr, NV 250 Champagne Rosé, Billecarte-Salmon Brut Rosé 375 Champagne, Dom Pérignon, 2013 595 Blanc de Blancs, Wölffer, Spring in a Bottle, NY 17/68 Non-Alcoholic White Chenin Blanc, Domaine Filliatreau, FR 2023 17/76 Pinot Grigio, Castelfeder, IT 2023 19/76 Sauvignon Blanc, Lauverjat Sancerre, FR 2024 22/90 Chardonnay, Drouhin-Vaudon Chablis, FR 2022 24/100 NON 3, Toasted Cinnamon & Yuzu, AU 16/64 Non-Alcoholic Rosé & Orange Rosé, Minuty Prestige, Côtes de Provence, FR 2023 18/80 Rosé, Arnot-Roberts, CA 2024 20/90 Albarino, Lagar de Costa 'Naranjo' 2023 17/76 NON 1, Salted Raspberry & Chamomile, AU 16/64 Non-Alcoholic Red Pinot Noir, Brooks, Willamette Valley, OR 2023 18/80 Rioja, Muga \"El Anden de la Estacion\", SP 2021 19/76 Sangiovese, Caprili Rosso di Montalcino 2023 20/90 Cabernet Sauvignon, Domaine de Chevalier L'Esprit 2020 25/115 Barolo, Nebbiolo, Silvio Grasso, IT 2021 30/135 Pinot Noir, Navarro Vineyards, CA 16/64 Non-Alcoholic Red Blend, La Madura, Alternative, FR 16/64 Non-Alcoholic Draft Coney Island Mermaid Pilsner 10 Catskill Nightshine Lager 10 Brooklyn Brewery Amber Lager 10 Allagash White 10 Threes Logical Conclusion Hazy IPA 12 Bottled Troeg' Sunshine Pilsner 10 Abita Light 9 Allagash White 12 Aval Cider 10 Non-Alcoholic Athletic Brewing Upside Dawn Ale 10 Cocktail Bar The iconic Soho Grand Hotel presents cocktails and live music at The Club Room. The show is about to begin. This decadent two-room cocktail bar ushers old New York into a bold new era, mixing uptown elegance with downtown edge. The bartenders craft an array of decadent cocktails that takes guests on a journey through mixology history. From the 19th-century old fashioned to a modernized espresso martini, each drink is meticulously prepared using premium spirits and elegant glassware Every night, a vibrant array of musical talent takes the stage. Stylings ranging from electric pianists to sultry vocalists lend a touch of musical charm that pairs beautifully with our supper club-inspired dinner menu. Our chefs invite you to sit down and savor a bevy of delights designed for sharing, from dressed oysters and club fries to petite lobster rolls and caviar service. As dusk turns to disco, tunes and tail feathers are known to shimmy and shake as Manhattan’s most coveted DJs spin for the city’s most stylish denizens. Step into the Club Room, where timeless glamour is up to new tricks, and every night is a performance to remember at Soho Grand Hotel. Open Wednesday thru Saturday from 6:00PM ’til late. Begin your evening in the Parlor with our classic supper menu, or in the Bar Room for cocktails and lite bites. Live performers take the stage from 7:30PM to 8:30PM and again from 9:00PM to 10:00PM. There is a $25 cover charge on Wednesday & Thursday and a $35 cover charge on Friday & Saturday. Cover charge is waived for guests of Soho Grand Hotel. Reserve dinner and live music on Resy . For late night tables, reserve on SevenRooms . Stories Club Room Groove with Tyreek McDole Open your senses and experience a new sound. Read More Club Room Groove with Alma Micic A dynamic performer on the rise. Read More Club Room Groove with Ollice Spaulding Newcomer Ollice Spaulding creates her own wonderland in Club Room this spring. Read More Read All Stories Reservations Live Music & Dining Late Night Tables Wednesday thru Saturday\nfrom 6:00pm 'til late | 212.965.3588 | 310 West Broadway New York, NY 10013 310 West Broadway New York, NY 10013 212.965.3588 reservations@clubroomnyc.com Press Group Dining Terms & Conditions Privacy Policy Visit our other properties Grandlife Soho Grand Roxy Hotel Soho Diner Django Roxy Bar Club Room Roxy Cinema Gilligan's Thank You For Signing up. You Will Be Receiving A Confirmation Email Shortly. Notes From Club Room Please enter a valid email address* Sign Up"
    },
    {
      "url": "https://www.nightflow.com/little-room-jazz-club-key-west/",
      "text": "Little Room Jazz Club Key West | Tickets, Dress Code, Reviews [2025 September] Add Your Venue Signup/Login Find Someone To Party With I am raw html block. Click edit button to change this html Little Room Jazz Club Key West Nightclub Key West Invite your Friends: Useful Links: Get on the Guest List Bottle Service Booking Get Tickets Private or Business Events | Celebrate your Birthday Venue Hire Birthday Reservations Check Independent Reviews Contents show Little Room Jazz Club Key West Little Room Jazz Club Key West Little Room Jazz Club Key West, Guide & Review Location: Little Room Jazz Club Key West 821 Duval St Key West, FL, US 33040 phone: +1 305-741-7515 email: admin@littleroomjazzclub.com website: www.littleroomjazzclub.com/ Get directions From: Photos of Little Room Jazz Club Key West Offical Facebook Photos A Video of Little Room Jazz Club Key West Little Room Jazz Club Key West, Guide & Review You’ll be able to get to the Little Room Jazz Club with the brightly lit stairs leading you inside this intimate venue, with everything you need for the music club: talented dancers, a cocktail menu above, fun seats, and a sexy, candlelit-sized look of sultry sounds on stage. If you like your music in the background, there are a few nooks long from the scene, as well as outdoor seating – if you can find it. The wine and beer list are extensive, though most sponsors order cocktails: Hemingway’s Death By Champagne – a Champagne cocktail with absinthe bitters, lemons, and Lillet Blanc – a unique item of the house. But it is best absorbed by small bites of the bar, such as well-executed charcuterie boards or Jazzy fried chicken, served with the side of apricot jam for sauces. Click the button to discover other venues in: Key West Leave a Review: Your review Your overall rating Select a Rating 5 Stars 4 Stars 3 Stars 2 Stars 1 Star Title of your review Your review Your name Your email This review is based on my own experience and is my genuine opinion. ​ Submit Review Read the Latest Reviews: There are no reviews yet. Be the first one to write one. Keep Exploring! Bobby’s Monkey Bar Key West Nightclub Fat Tuesday Key West Nightclub Teasers Key West Nightclub VIP Gentlemen’s Club Key West Nightclub Hogs breath Key West Nightclub Virgilio’s Key West Nightclub Rick’s bar Key West Nightclub Smoking Tuna Key West Nightclub Schooner Wharf Key West Nightclub The Dating Site For People Who Love To Party Find someone to party with, sign up here , and meet other single members looking to go out. Find Someone To Party With COMPANY About Terms Privacy Sitemap DO BUSINESS Work With Us Investor Relations CONNECT Contact Facebook Instagram INTERNATIONAL English Spanish Italian German French Menu"
    },
    {
      "url": "https://thevendry.com/venue/255201/little-room-jazz-club-key-west-fl",
      "text": "Little Room Jazz Club - Bar / Club in Key West, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Press Nearby Hotels Little Room Jazz Club Bar / Club 821 Duval St, Key West, FL 33040, USA Little Room Jazz Club 821 Duval St, Key West, FL 33040, USA Request Pricing A posh intimate listening room with live jazz performances by top artists five nights a week. \n \nOur full liquor bar features a refreshing array of craft signature cocktails, wine and beer.\n \nOn our menu, you'll find delectable, artisanal “Little bites\" inspired by traditional America soul food, to accompany our world class performers. \n \nAn elevated musical Key West experience venue for music lovers. Show more Request Pricing 821 Duval Street, Key West, FL Show on the map Spaces Unfortunately, Little Room Jazz Club hasn't added any spaces to their profile on The Vendry. Request info from Venue Press GETTING STAMPED Top 20 Best Bars in Key West - 2023 Nightlife Guide Sep 27, 2023 Florida Keys Camping 18 Best Bars in Key West May 31, 2023 Mallory Square Key West Bars | Best Bars in Key West Mar 29, 2023 Cabana Inn The 7 Best Bars and Clubs in Key West Nov 14, 2022 GETTING STAMPED Top 20 Best Bars in Key West - 2023 Nightlife Guide Sep 27, 2023 Florida Keys Camping 18 Best Bars in Key West May 31, 2023 Mallory Square Key West Bars | Best Bars in Key West Mar 29, 2023 Cabana Inn The 7 Best Bars and Clubs in Key West Nov 14, 2022 AvantStay The 20 Best Bars in Key West Sep 14, 2022 Noble House Hotels Resorts Classy Key West Bars That Break the Mold Apr 16, 2021 Show more Do you work for Little Room Jazz Club ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Key West for Your Event Key West Breweries / Distilleries Key West Hotels Key West Event Spaces Key West Restaurants Key West Bars / Clubs Key West Museums / Galleries Key West Performance Spaces Key West Breweries / Distilleries Key West Hotels Key West Event Spaces Key West Restaurants Key West Bars / Clubs Key West Museums / Galleries Key West Performance Spaces"
    },
    {
      "url": "https://www.revroom.com/contact-us/",
      "text": "CONTACT US - Rev Room ↓ JAVASCRIPT IS DISABLED. Please enable JavaScript on your browser to best view this site. HOURS MAP CONTACT US STICKYZ 300 President Clinton Ave. Little Rock, AR HOURS MAP CONTACT US STICKYZ CONTACT US Get in touch!  Fill out the form below, or email us below. Your Name (required) Your Email (required) Your Question is about? (example - reservations, show info, lost & found, etc) Tell Us More For Questions, Comments, Complaints: [email protected] [email protected] For Band Booking Inquiries: [email protected] For Special Party Event Information (including reunions, corporate events, wedding parties, bachlorette parties, etc) [email protected] revolution music room revroom.com • 501-823-0090 Sidebar Area Add Some Widgets! This theme has been designed to be used with sidebars. This message will no longer be displayed after\nyou add at least one widget to one of the Sidebar Widget Areas using the Appearance → Widgets control panel. You can also change the sidebar layout for this page using theme options. Note: If you have added widgets, be sure you've not hidden all sidebars on the Per Page options. You could switch this page to One Column. Log in Where We Are 300 President Clinton Ave, Little Rock, AR 72201 Facebook Posts Revolution Music Room (The Rev Room) updated their cover photo. 6 days ago Revolution Music Room (The Rev Room)'s cover photo ... See More See Less Photo View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Revolution Music Room (The Rev Room) 1 week ago Last call Onionheads! First time back in LR since 2022 so let's get the weekend started Friday n #WPS #wps ... See More See Less Photo View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Revolution Music Room (The Rev Room) 1 week ago Throwin' it back with a reminder to never miss a Sunday show! Who all was at this one a few years back? Pretty solid lineup, wasn\u0000 #tbt #revroomremembers mremembers ... See More See Less Photo View on Facebook · Share Share on Facebook Share on Twitter Share on Linked In Share by Email Our Other Sites Stickyz Rock N’ Roll Chicken Shack Love Live Music © Rev Room.  Website Management by Quartzlight Marketing ↑"
    },
    {
      "url": "https://www.mishcon.com/jazzshapers/tim-little-26-10-2019",
      "text": "Tim Little | Jazz Shapers on Jazz FM Mishcon de Reya page structure Site header Related sites Related sites SELECT FROM Karas So LLP MDRi MDR Lab MDR Mayfair MDR ONE Mishcon Academy Mishcon Graduates Jazz Shapers Karas So LLP Karas So LLP's disputes and investigations practice focuses on high value, complex issues including those arising from corporate collapses, audit and other professional negligence, shareholder disputes and commercial fraud. MDRi Our team of insights and analytics experts collect and analyse data about markets, industries and consumer behaviours to help businesses thrive. MDR Lab For early-stage startups transforming the Legal sector. MDR Lab incubates and invests in the most promising early stage legaltech companies. MDR Mayfair MDR Mayfair was created to provide private advisory services for a select group of families by bringing together a broad range of highly qualified professionals to seamlessly manage their affairs. MDR ONE MDR ONE provides centralised global employment law support and data-led insights to multinational companies, putting in-house counsel in control of their global legal operations. Mishcon Academy The Academy is Mishcon de Reya's in-house place of learning, our driver for growth and a platform for thought leadership. Here we will bring together urgent societal issues and industry experts to deliver innovative thought leadership on issues that matter to us and to our clients. Mishcon Graduates The future has never been more unpredictable, demanding or challenging. Never before has there been so much information to absorb, so many social and business networks to navigate, and so many economic, political and social issues to confront. And the role of law has never been more pivotal in all of this. Jazz Shapers Jazz Shapers is presented by Mishcon de Reya's Chief Brand Officer and former LBC presenter Elliot Moss. During each show, Elliot will be interviewing shapers of the business world, people who, like the musicians in the show, have defied convention and gone on to achieve great success. Social media links Subscribe It's business. But it's personal. Main site navigation Services Services sub-menu Corporate Dispute Resolution Employment Impact Innovation Private Real Estate Hong Kong Singapore MDR Group Sectors Corporate Blockchain, Crypto and Digital Assets Competition Law Corporate Advisory: Singapore Corporate Lending Corporate Real Estate Emerging Companies and Venture Capital Family Businesses Financial Services, Funds and Asset Management Foreign Direct Investment & National Security Advisory Impact Investment Insurance Limited Liability Partnerships Merger Control Mergers and Acquisitions Private Equity Public Company Regulatory Reorganisations Reputation Protection and Crisis Management Shareholder Activism Special Situations Tax Technology Transfer: Spin-Outs and Social Ventures US market entry for scaling businesses Venture Debt Financing Data We defend the data rights of businesses and individuals. Investigations Intelligent and incisive, minimising disruption in high-stakes situations. Regulatory We understand the high stakes involved in building the right regulatory strategy for you and your business. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. Dispute Resolution Anti Money Laundering Civil Fraud Civil Fraud Defence Commercial Litigation Competition Law Complex Investigations Construction Cyber Risk Debt Finance Director and Shareholder Disputes Extradition Finance and Banking Disputes Group Litigation Health and Safety Inquests and Inquiries Insolvency and Restructuring Insurance International Arbitration Maritime Services MDR Discover Mediation Politics and Law Private Prosecutions Private Wealth Disputes Professional Discipline Professional Negligence Project Disputes Protecting People Internationally Regulatory Reputation Protection and Crisis Management Reshaping Businesses and Relationships Sanctions Supervising Solicitors Tax Disputes and Investigations White Collar Crime and Investigations Data We defend the data rights of businesses and individuals. Investigations Intelligent and incisive, minimising disruption in high-stakes situations. Regulatory We understand the high stakes involved in building the right regulatory strategy for you and your business. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. Employment Bonus Disputes Discrimination, Bullying and Harassment Education Employment Arbitration Employment Services to Start-up/Scale-up Gender Pay Gap Reporting High Court Litigation - Employment HR Advisory and Employment Documentation HR Consultancy Immigration Incentives and Remuneration Inquests and Inquiries LLPs and Partnerships Recruitment Services Redundancy and Restructuring Tax Team Moves and Restrictive Covenants The Senior Managers and Certification Regime - SMCR Transactional Support and TUPE Whistleblowing Worker Status and the Gig Economy Workplace Investigations Data We defend the data rights of businesses and individuals. Investigations Intelligent and incisive, minimising disruption in high-stakes situations. Regulatory We understand the high stakes involved in building the right regulatory strategy for you and your business. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. Impact Biodiversity Charity mergers, collaborations and partnerships Charity set up, governance and regulatory Climate, Nature and Human Rights Litigation Corporate charitable giving and grant making ESG Regulation, Compliance and Reporting ESG Strategy and Governance Greenwashing and reputation Impact Investment Incident management, investigations and complaints International strategic, technical and operational assistance Mishcon Purpose: ESG and Sustainability Philanthropic strategy and foundation set up Social and impact ventures Supply chain advice and investigations Charities and Social Ventures At the forefront of legal innovation, providing bespoke services to those who strive to make a difference. Mishcon Purpose We advise corporates, boards and leaders on Environmental, Social and Governance (ESG) issues. Innovation Advertising and Marketing Anti-counterfeiting and Piracy Artificial Intelligence and Machine Learning Betting and Gaming Brands Commercial Contracts Competition Law Confidential Information and Trade Secrets Copyright and Design Data Digital Transformation Intellectual Property Interactive Entertainment International Franchising and Brand Extension Mishcon Tulip Patents Sports Technology Technology Transfer: Spin-Outs and Social Ventures The Metaverse, NFTs and Cryptoassets Data We defend the data rights of businesses and individuals. Investigations Intelligent and incisive, minimising disruption in high-stakes situations. Regulatory We understand the high stakes involved in building the right regulatory strategy for you and your business. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. Private Accessing deal flow Art Law Creators + Collectors Education Estate and Trust Administration Family Family Businesses Family Offices Immigration Inquests and Inquiries International Immigration and Tax Planning Landed Estates LGBTQIA+ Community Politics and Law Pre and Post Exit services Private Commercial Litigation Private Members' Clubs & Social and Professional Associations Private Wealth and Tax Private Wealth Disputes Protecting People Internationally Recruitment Services Reputation Protection and Crisis Management Residential Property Rural Property Data We defend the data rights of businesses and individuals. Investigations Intelligent and incisive, minimising disruption in high-stakes situations. Regulatory We understand the high stakes involved in building the right regulatory strategy for you and your business. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. Real Estate Alternative Asset Classes Construction Corporate Occupiers Corporate Real Estate Debt Finance Planning and Environment Private Real Estate Property Litigation PropTech Real Estate Development Real Estate Investment Residential Property Tax Data We defend the data rights of businesses and individuals. Investigations Intelligent and incisive, minimising disruption in high-stakes situations. Regulatory We understand the high stakes involved in building the right regulatory strategy for you and your business. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. Hong Kong Aviation Services Corporate Advisory: Singapore Family Offices Family: Hong Kong Finance: Singapore Immigration International Arbitration Maritime Services Mergers and Acquisitions: Singapore Private Wealth and Tax Private Wealth: Asia Professional Negligence Mishcon Academy - Asia The Mishcon Academy ethos of Explore, Learn, Debate delivers more than training. Karas So LLP Our association in Hong Kong. Singapore Aviation Services Corporate Corporate Advisory: Singapore Debt Finance Family Offices Finance: Singapore Immigration International Arbitration Maritime Services Mergers and Acquisitions: Singapore Private Wealth: Asia Mishcon Academy - Asia The Mishcon Academy ethos of Explore, Learn, Debate delivers more than training. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. MDR Group MDR Discover MDRi MDR Lab MDR Mayfair MDR ONE Mishcon Academy We gather, discuss and share knowledge from our experts and others, providing valuable learning experiences for the people who will shape a better world. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. Sectors Aviation Services Betting and Gaming Defence, Security and Resilience Technology Education Energy and Natural Resources esports Financial Services Food and Beverage Hospitality and Leisure Life Sciences Maritime Services Media Mobility and Automotive Recruitment Services Retail Sports Technology Video Games Data We defend the data rights of businesses and individuals. Investigations Intelligent and incisive, minimising disruption in high-stakes situations. Regulatory We understand the high stakes involved in building the right regulatory strategy for you and your business. Mishcon Purpose Managing risk, creating value, transitioning to sustainability. About us We now employ more than 1400 people with over 650 lawyers offering a wide range of legal services to companies and individuals. About us It’s business. But it’s personal International An international community of clients Equity, Diversity and Inclusion Embracing a diverse and inclusive culture Responsible Business Delivering a material positive impact Innovative Client Service Technology, efficient processes and client care Mishcon Purpose Managing risk, creating value, transitioning to sustainability. People Mishcon de Reya has over 220 Partners and Legal Directors and over 650 fee-earners in total. Corporate Key contact: Kevin McCarthy Dispute Resolution Key contact: Hugo Plowman Employment Key contact: Daniel Naftalin Hong Kong Key contact: Wei Zhang , Jonathan Mok , Timothy Burns , Mark Davis Impact Key contact: Chris Willis Pickup Innovation Key contact: Jeremy Hertzog Private Key contact: Nick Davis Real Estate Key contact: Stephen Hughes Singapore Key contact: Tahirah Ara Search for a name: Our central switchboard, available 24 hours a day, can be reached on +44 20 3321 7000 Latest Get the latest updates about Mishcon and insights on things that matter straight to your inbox Subscribe now News Latest news from Mishcon Our Work Latest work from Mishcon Events Happening in and around Mishcon Guides Latest insights from Mishcon Podcasts Podcasts, interviews and insights Publications In house publications from Mishcon Video Videos, interviews and event highlights Mishcon Academy We gather, discuss and share knowledge from our experts and others, providing valuable learning experiences for the people who will shape a better world. The history and the future of Mishcon de Reya All stories have a beginning Ours started in a small office above a bank in Brixton, with a man named Victor Mishcon. Join us We foster a culture that embraces diversity, respect for the individual and the expression of talent. Careers at Mishcon de Reya Graduates Solicitor Apprenticeships Mishcon Graduates We believe successful lawyers are great shapers Contact us If you have an enquiry you can telephone us on +44 20 3321 7000 , e-mail us or use our online enquiry form . Contact Us One firm. Five locations. Key Contacts Crisis Hotline Call +44 80 0260 0546 for our 24-hour emergency legal hotline. For international calls please dial +44 800 060 0546 . Search Mishcon de Reya Menu Main content section Breadcrumb Home Jazz Shapers on Jazz FM Tim Little Jazz Shaper: Tim Little Posted on 26 October 2019 Tim Little is the Founder and CEO of classic luxury shoe brand, Tim Little, and the Owner and Creative Director of 150-year-old shoemakers, Grenson. Read the full transcript Elliot Moss Welcome to the Jazz Shapers podcast from Mishcon de Reya.  What you are about to hear was originally broadcast on Jazz FM however music has been cut or shortened due to rights issues. Good morning, I am Elliot Moss, this is Jazz Shapers.  It’s where the Shapers of Business join the Shapers of Jazz, Soul and Blues.  Our guest today is Tim Little, Founder and CEO of classic luxury shoe brand, Tim Little and the Owner and Creative Director of 150 year old shoemakers, Grenson.  I confess to having pairs of both.  Tim fell in love with footwear as a child in the Co-Op in Long Eaton when his mum took him to buy new school shoes, he would make the assistant fetch almost every pair in the shop so he could try them on, hooked by the smell of new shoes and unwilling to make a choice until he had found the perfect style.  A decade long career in advertising including 5 years working for the client Adidas, only sharpened his passion.   “My dad was a lace maker”, he says “with a factory in Nottingham where I grew up.  I think the mix of shoes, marketing and manufacturing collided in my head and created a direction for me.”  He quit advertising to launch his own eponymous brand, Tim Little which he still runs from a small shop in Chelsea and in 2005 Tim agreed to buy struggling Northampton shoemakers, Grenson which has used the same techniques and site to make its shoes since 1895.  Despite each pair of shoes taking around 3 weeks to craft, the business has grown three fold and now includes both women’s shoes and accessories.  We will be talking to Tim in a few minutes about preserving classic manufacturing, about where he finds inspiration and his love for the Blues.  We’ve also got brilliant music from amongst others, The Dave Brubeck Quartet, Professor Longhair and the Robert Glasper Experiment.  That is today’s Jazz Shapers.  Here as a Blues fanfare for Tim, it’s Albert King with Born Under A Bad Sign. That was Albert King with Born Under A Bad Sign, a good way to start for my Business Shaper, Tim Little, the Founder of Tim Little and the Co-Owner and Creative Director at Grenson and also a Blues fan. Tim Little Good morning, how are you? Elliot Moss I am alright, how are you? Tim Little Yeah really good thanks.  Very good. Elliot Moss It’s lovely to have you here, partly because as I mentioned earlier, I wear your shoes, partly because you with me at my wedding, thank you. Tim Little It’s a pleasure. Elliot Moss You’ve been with me… Tim Little Not personally obviously. Elliot Moss …no but, but you made something I was wearing. Tim Little Yeah. Elliot Moss And you were with me on many, many days and many nights actually wearing fabulous shoes. Tim Little Oh er. Elliot Moss You are a shoemaker which is a wonderful thing to do, not many people end up doing it successfully.  How do you think you have managed to get where you are now?  Why has Tim Little managed to do what many other people haven’t? Tim Little I think probably my background.  I think you mentioned in the introduction that my background is a mixture of several things.  My dad was a manufacturer, my real kind of, my first 10 years of working was in advertising and working with you know, big brands and promoting brands and what have you, in particular Adidas and so I think those things came together and I had an initial love of shoes right from when I was a child.  I am not a shoemaker in the sense that I sit in a little workshop knocking nails into the sole of a shoe.  It is very much about a brand and it’s about design and it’s about that kind of thing.  So yeah it’s about the background I think. Elliot Moss And talking about that background so you mentioned advertising and we both share, not just advertising but indeed the same advertising agency at Leagas Delaney and Tim Delaney was on this programme many years ago.  What is it about the advertising trade do you think at its core that has helped you be able to create this brand, understand what consumers are like and so on?  What do you think is at the essence, centre of it? Tim Little I think it is about always understanding who you are making shoes for, who you know, what your audience is and it is about understanding this thing about the brand itself and everything should come from and through the brand.  So when we design shoes we are always, we have a very acute sense of what Grenson is about, what people like about Grenson, what they don’t like about Grenson even but everything we do goes through this kind of filter of what we believe the Grenson brand is about and that has very much come from my days in advertising and Leagas Delaney in particular where it was drilled in to us this belief and this understanding first about the brand that you are working with and then from that, once you’ve got that, you can do all kinds of things. Elliot Moss And how did you stumble across advertising because you were born in Long Eaton in Nottingham. Tim Little Yes. Elliot Moss It is not a Mecca for advertising. Tim Little No it certainly isn’t. Elliot Moss No.  But it is a Mecca for many things actually, it is a very interesting place once you know it. Tim Little Yeah.  Textiles yeah. Elliot Moss Textiles and things that’s right, materials and so on, it’s in that classically central part of England and it has lots of history to it but how did you end up in the world of advertising and in London and all those things? Tim Little Well I started completely the wrong direction so at the age of kind of 16/18 I had no clue what to do and the only thing that I had done at school was I had got a reasonable A level result, or GCSE result in Maths so my dad said to me and teacher said ‘oh you should be an account then you can do anything’.  So I went to University and did accountancy which was a complete disaster but then rather than realising it was a disaster and changing immediately I came out and got a job with a big accountancy firm in London, KPMG as it is now, lasted 7 weeks but I was sharing a flat with my sister and she was at an ad agency called Lowes in London and every night I was coming home with more and more books to study and she was coming home and getting ready for another trip, another event, another ball, another whatever and I thought ‘hang on a minute I am on the wrong train here’ so I switched then and went into… and got a job at Leagas Delaney. Elliot Moss So you go along, you get this job and you are an accountant. Why do you think they hired you at that moment if you can cast your mind back to why Tim Little, the 7 week old accountant was hired by a creative agency? Tim Little Well the first thing I did was I thought I am not going to be able to get into the creative department because that’s far too much of a leap so I went in via media.  So I thought… my sister said to me ‘there’s a job called media and it’s kind of advertising, well it’s advertising but it’s numbers and what have you so that could be perfect’.  So I think they probably thought yeah this could be quite useful, you know, somebody who’s got an accountancy Degree and what have you. It wasn’t really but… Elliot Moss At all. Tim Little …it was a way in and it was like I did a year, a year and a half in media before I switched into account management. Elliot Moss And then again for those people that don’t know the account management piece is when you look after clients and essentially manage the process as it were and think about strategy for clients and the like.  But that movement into that role then, did you think ‘oh this is kind of what I want to do’ or were you still feeling your way because many people in advertising; there are two types, one that stay forever and there’s others that use it as a spring board and you’ve obviously used it as a spring board.  Were you pretty clear early on that it wasn’t going to be forever? Tim Little No not at all, I think I was in heaven at that point.  I mean I had gone from accountancy and also doing accountancy in holidays from University and stuff and trying to get my head around it, and walking into an ad agency, especially Leagas Delaney which at the time was probably 50/60 people, very creative, very sociable, very young, lots of very bright people, it was just wonderful.  I loved it and it wasn’t until quite a long time later that I ever thought about moving on.  I thought this is it forever, I’ve found my dream job. Elliot Moss So let’s talk about that movement into doing your own thing because that came about sort of I guess 8 to 10 years later or so. Tim Little Yeah. Elliot Moss Were you formulating the business plan before you left or was there a kind of ‘I’ve just got to move’.  What precipitated the final jump from advertising into doing your own thing? Tim Little I had been, yeah I had, I had probably 8 years in to my life in advertising, I’d started to think… to start with you start to look around and you notice that there aren’t very many older people in advertising which… so you think well either I am going to push on and try and become, run the agency or run an agency or it is going to be struggle and I thought I don’t really want to do that ultimately so I started to think about starting my own business and I just had this thing about I came home from a trip from Adidas once and we had sat around in these meetings talking about the most exciting, creative projects around making, designing, selling shoes and I came back and I needed a pair of shoes for a wedding, a smart black pair of English made shoes and went into a shop in Knightsbridge and it was the dullest, most appallingly old fashioned experience and I just thought you know, why can’t there be a bit of creativity and interest in design and involved in that type of shoemaking as well, or that type of shoe and so a little light went on in my head and I started formulating a plan from there. Elliot Moss And from that moment, that little light going on in your head to actually opening your doors of your shop in Chelsea, Kings Road, just on the brow of the hill. Tim Little Yeah. Elliot Moss I like, there is a quote every so often that changes around Almeda Markus and pairs of shoes and all the things. Tim Little That’s it. Elliot Moss I am a geek, you do, I mean you realise I have been stalking you for years Tim. Tim Little Good. Elliot Moss It has taken a long time to get you here. Tim Little I don’t mind that. Elliot Moss But what was it like when you found that spot and you opened the doors? Tim Little It was really scary, I mean it was really scary from driving around in a Porsche 911, I was actually, the Porsche account was an account that I was running so. Elliot Moss You chose well Tim.  Can I just say, Adidas and Porsche.  This is hardly a lad that’s not well heeled or, or got a nice motor. Tim Little Yeah. Well absolutely it was the business at the time, Leagas Delaney was all premium brands which was yeah, very nice to work on but it was really scary opening the doors.  We opened the doors on a Saturday morning in I think it was, well it was April in 1997 and I’d literally walking around an hour before making sure that the logo’s on the tins of polish were straight and the, every speck of dust, it was absolutely immaculate.  Opened the doors, this walked in who was about 60 odd and she looked around for a bit and then she said “how much are the chairs?” and I said “well the chairs aren’t for sale” and she said “why not?” and I said “because it’s a shoe shop” and she said “oh how ridiculous” and walked out.  So it wasn’t a great start but it was very scary but I knew it was the right thing to do so it felt good. Elliot Moss And the context is of course along that strip there is a lot of furniture shops. Tim Little Yeah absolutely. Elliot Moss The poor person who got it wrong.  And at what moment post opening the shop did you go ‘I think I am going to be alright, this is going to work’?  If indeed you felt that? Tim Little Well you know I gave myself 2 years.  I thought if I leave advertising and I am out for 2 years I might be able to get a job back in somewhere else later and what happened was you just get so heavily involved in it when it is your own business and you are fighting to pay the bills and you know, the bank is knocking on the door that it just… time disappears and you never ever really, even today, you never get to a point when  you think ‘that’s it, it’s sorted’ because there is always something round the corner and there is always a problem, an issue, and there is always cash issues, that’s the biggest… with any business there is always a cash issue so the answer really is I never, I never knew, I just drifted on and drifted on and here I am today. Elliot Moss He’s drifting in here, it’s Tim Little at Jazz Shapers at Jazz FM as well and we will be having a lot more chat with Tim and hearing a lot more from him in a couple of minutes but first we will hear from one of our partners at Mishcon de Reya with some words of advice for your business. There are absolutely tons of ways for you to enjoy all our former Jazz Shapers and indeed hear this very programme again with Tim.  You can ask Alexa to play Jazz Shapers and there you can hear many of the recent programmes, or if you pop Jazz Shapers into iTunes or your preferred podcast platform, you can enjoy the full archive but back to today and Tim, he is the Founder and CEO of classic luxury shoe brand Tim Little and the Owner and Creative Director of 150 year old shoemakers, Grenson.  So your own business as you set it up and as you said you sort of drifted very humbly, you drifted on and drifted on.  It strikes me that there is a consistency that a person like you craves but also you like to innovate.  How have you managed those two competing forces through your working life?  Because there is definitely something that ties every single, literally there is a thread through every shoe that you are involved with but there is something quite surprising as well along that journey? Tim Little Well yeah I mean that’s that’s really the crux of the Grenson brand for example and when I started Tim Little the idea was English shoes without the cobwebs so it was keeping the old what’s good about tradition but updating it and making it relevant and that’s exactly what Grenson is about and that balance is everything, the success or failure to me of the brand is about that mix.  If we are too traditional, if we just talk about how we make the shoes in an old factory in Northamptonshire and we do pictures of guys with half-moon glasses knocking nails in and all that, all the time we become like a museum brand,  a brand that people just buy for nostalgia.  On the other hand if we go too far the other way and don’t keep a foot in that camp, we become just another shoe brand and there are billions in the world and nobody needs another one so it is that mix of keeping hold of the bits from our heritage that are important and valuable but making them relevant and keeping it on an even keel. Elliot Moss You mention your dad saying ‘listen do accountancy so you can do anything you like’ and then you talked briefly before about the issue that pretty much every business faces which is a cash issue.  How useful has it been to have been trained and even if you didn’t continue at KMPG after the 7 weeks, but you did a Degree in it; how useful has that been in terms of all the different things that you have to think about running a business? Tim Little Yeah really useful actually.  I think a lot of friends of mine have got similar businesses but don’t necessarily have that background and they have to rely on other people and that can be difficult.  It is very, very useful.  It’s almost like a language you know, reading the books of a company and sitting down every month and looking at the numbers and the things that you can see in the numbers if you know what you are looking for very, very important so that, it has been huge actually.  I think, I think without that I might not be around doing this right now because that’s the kind of bedrock of what I do. Elliot Moss And in terms of your own skill set, it sounds quite wide to me in the sense that you are comfortable with numbers, you utterly understand brand.  Is there a weakness?   Has Tim Little got a soft spot where he has to get other people – I talk to lots of people and they go ‘I am rubbish with people Elliot’ or ‘I am terrible with the numbers’.  What’s your, your kryptonite as it were? Tim Little Oh God so many, so many things.  I think the biggest worry that you have is that you can do a bit of everything and you don’t do anything you know, you don’t one thing well enough.  I’ve got a fantastic team at Grenson so I can rely on people to do stuff that I am not very good at.  I am not very good at concentrating for a long time on one particular subject. I love to kind of jump around and have different things going on.  Like a day like today, doing this, talking to you and then going off and doing something completely different is what I absolutely love.  So I think where we have something where I have to focus for two days on one particular subject, I find that very, very difficult.  So yeah, but I’ve got, trust me, I’ve got… there are a lot of faults. Elliot Moss How would they describe Tim Little if Tim Little wasn’t in the room at Grenson and indeed…? Tim Little The people, what who work at Grenson? Elliot Moss Yeah. Tim Little Well I can’t really swear on the radio but I don’t know really.  I think… Elliot Moss You seem easy going, almost cuddly. Tim Little No they wouldn’t, they certainly wouldn’t say that, they certainly wouldn’t say that.  I think probably my thing is I don’t get cross or annoyed or hassled until I get to a certain point and then I go for it.  So I kind of let a lot of things go and then when it gets to the point where I think this needs to be sorted out, then probably I change a little bit.  That might be an understatement but… Elliot Moss There is a flash in his eye, there’s a lot in the room when he is changing a little bit. Tim Little Yeah exactly. Elliot Moss Hulkian view of the world over here, he’s gone green actually.  Okay well that’s good, don’t change on me. Tim Little No, no, I am okay. Elliot Moss I hope I won’t annoy you.  We’ve got some more music coming up, it’s a brilliantly named artist, I hadn’t heard of him before, it’s Professor Longhair with Mardi Gras In New Orleans.  Here we go. That was Professor Longhair with Mardi Gras In New Orleans and Tim and I liked that.  I mean music is a funny old thing in terms of moving between one genre and another and I was thinking about that I was thinking about having set up your own business and then being pulled in to say ‘listen we are in trouble can you help us, can you buy us’.  This was a long while ago if indeed they were in trouble – you can tell me they weren’t but now you are straddling two worlds where there is a brand that was established and a business many years ago and you are now in charge and you’ve got skin in the game and then there was the other one which you set up from scratch.  Is it a bit like adopting a child?  I mean do you feel the same love for Grenson that you feel for Tim Little? Tim Little Yeah very much so actually, if anything I feel, I feel the same amount of love but I feel more responsibility for Grenson.  If something goes wrong at Tim Little, that’s fine, that’s my thing I started it you know whatever.  But Grenson it’s a bit like having a house almost, you feel like you own it for a period of time, you know, it’s your house but only for a period of time. Somebody had it before you, somebody will have it after you and on my screen saver on my phone, so every time I look at my phone I’ve got the Founder of Grenson who is a guy called William Green and I kind of feel all the time just responsible, when you have an old brand like this you think I want to do what’s the right thing for the brand and for the history and the heritage of that brand and it is very important and I kind of really bought into that at the beginning and it still  kind of is an important thing for me every day. Elliot Moss I remember interviewing Emma Bridgewater a few years ago and we were talking about the potteries in Stoke and that incredible tradition of making pottery, of ceramics.  Northampton is likewise the same for shoes in this country as I understand it. Tim Little Yeah. Elliot Moss Is there also, I mean what is your feeling, without being too emotional, we could start you know getting some tissues out, it’s quite warm anyway.  What is your feeling as you walk around that factory and you see people doing things or the… do you connect with that? Tim Little Yeah 100%. I mean I grew up walking round a factory with my dad, a textile factory but 100% you know, they are incredible people, they are all crafts people, most of them have probably spent up to 5 years learning to do what they do properly and they are very rare skills these days and every day I can walk in to that factory and see them actually making a shoe and you see the, the leather come in one end and it goes out the other end as a pair of shoes, it is literally skin to box so it, yeah it is an amazing thing to watch and to have that around you all the time and to know the characters who are making those shoes and know that they’ve got skills that have been handed down from people 150 years ago originally, all the way down to the present day.  So yeah, it’s the heart and soul of the business. Elliot Moss And is making stuff really nice as juxtaposition to talking about stuff which was the world of advertising, is that something also that you’ve felt very comfortable with and enjoyed? Tim Little Very much, very much.  It was the one thing I missed at Adidas was that by the time we got involved in a project the shoe had been designed, everything had kind of been formed and doing everything right from the beginning for me is really important and starting off by… because you start, when you have a marketing background you sit down to design a shoe and you don’t just have a piece of paper let’s design a nice shoe, you’ve got all kinds of things going on in your head about what would be a great shoe, what would be a good story, what if we used this special kind of leather that nobody’s used before, what if we use a vegan leather which we are using at the moment, all kinds of different things go on but it is lovely to be there right at the beginning where you sit down with a blank piece of paper and just say ‘let’s do something’. Elliot Moss Well also that though you say you know, I wasn’t going to enter the credit department of an advertising agency because they, you know, that wasn’t going to happen.  You are essentially now a credit director.  Your influences I read somewhere are quite wide and varied in terms of what influences the design.  Just tell me a little bit about where those come from? Tim Little Well as you, I am sure you know as well, every account man in advertising is a frustrated creative. Elliot Moss No, that can’t be true Tim. Tim Little And we, you know you spend 10 years kind of thinking ‘oh I could have done that’ but no I think the design side is really important to me, personally.  I absolutely love it and it is very, very much part and I think starting my original business was about me saying to myself, I think there is a better way of designing a shoe like that.  Take a classic English shoe, I think there is a nicer way.  I don’t think they are that well designed, I think there could be a more interesting… so it was having a point of view rather than having a skill, a design skill.  I didn’t have any background but that point of view about how things could be designed better was very important and as time has gone on I have just been more and more and more involved in the design process, probably come away from it a little bit more now because I have people, designers who work for us but very, very much involved as a creative director and briefing things in. Elliot Moss Stay with me for my final chat with my guest today, that’s Tim Little, plus we will be playing a track from Robert Glasper Experiment.  That’s in just a moment, don’t go anywhere. Another one I love here in Jazz Shapers, that was Robert Glasper Experiment with Calls.  Just for a few more minutes I’ve got the pleasure of Tim Little’s company. You’ve now been working in the Grenson business, been owning the Grenson business for 9 years or so, is that right? Tim Little Yeah. Elliot Moss Yeah.  What is the next 9 years or the next phase hold for you in terms of how you are going to grow the business? Tim Little We’ve got various things that we always look at in terms of things that we think are going to grow, could grow really quickly.  Generally you know, my bedrock is always more of the same because the business is doing very well and it is kind of more of the same is the starting point and then to say what are the things that we think are big opportunities.  I think the biggest one at the moment that’s been taking off is women’s so we introduced women’s probably 4/5 years ago and we are a very masculine kind of brand and we’ve been a menswear brand for 150 years, it’s a factory, it’s all of that traditional English shoe kind of thing so launching women’s was a stretch at the beginning but in the last kind of year, 18 months it has really taken off and I think that’s a huge opportunity and we’ve got to be very careful how we manage that.  But it is really exciting. Elliot Moss Which bit gives you the most joy, it is obvious you love what you do and you have since you probably took the plunge and did it yourself but are there moments when it is sort of that in flow feeling, where you are just going I am not even working, this is just going really well.  Is it the design bit?  Is it the watching consumers actually purchase stuff? Tim Little Yeah there are little things like seeing somebody on the tube in a pair of our shoes and thinking that’s exciting and remembering two years ago when that was on a piece of paper.  But I think really for me it is that thing again about the mix of everything, being able to be sitting in a design meeting one minute, the next minute being in the factory talking to somebody about how a certain element of the shoe isn’t working because of the seam, they need to change the seam and is it okay to do it… All the way through to you know, talking about a shop lease you know on a new store in Soho or whatever.  I don’t want to do a lot of that but I do like it as a distraction, I do find it interesting.  So I think for me it is having the whole thing together, the mix of it all but also having a hand in every little bit of the business and feeling responsible for it all.  So yeah, it’s the whole thing. Elliot Moss There is one actually not far from this building, Meard Street? Tim Little Meard Street, a little cut through yeah. Elliot Moss A little cut through and I walk past it on my way here every time. Tim Little Very pretty shop. Elliot Moss I stop had a little peep and go ‘not today, hold on’.  I can’t afford another pair.  And tell me about money, I mean these shoes, the shoes you sell are not cheap, we haven’t spoken about money once in this conversation which in itself is quite revealing. Tim Little Good. Elliot Moss Good.  Do you care about it?  Is it nice to make more each year? Tim Little Personally? Elliot Moss Yeah. Tim Little Yeah I think, well there is two sides to money I think.  There’s money in a business and money in a business is about making enough money that the business can then evolve and grow.  I think what people don’t realise, a lot of people who don’t have a business think that if you make a profit then you put that profit in your pocket and go and buy a boat and that’s it and then next year if you make a profit again you do the same.  But you don’t do that.  To grow you need the money up front because you pay for everything up front before you get paid for it.  So if we want the business to be 20% bigger next year, we have to make a certain amount of profit this year to be able to do that and that’s choices.  So money is very important in the business for that reason, for growth and to be able to do things we want to do.  Personally, yeah I am the same as anybody else.  I don’t have a particularly extravagant lifestyle but it is as somebody once said, badly paraphrased you know it’s better to be rich than poor.  You know it’s, I’ve been both and it is more fun to be you know, it’s nice… Elliot Moss The Porsche was more fun than the tube? Tim Little Yeah.  Exactly.  Well I am on a scooter now so yeah those days have gone.  I actually like it but… yeah no it’s not the be all and end all for me but it is certainly very important in the business to make a healthy profit to be able to grow the business and push it on and hire new people and do all those kind of things. Elliot Moss It’s been a pleasure talking to you, Tim - good luck with Grenson, with Tim Little.  Have fun.  Continue to make lovely shoes which I like to buy. Tim Little Thank you. Elliot Moss I am looking forward to my next pair.  Just before I let you go, what’s your song choice and why have you chosen it? Tim Little Song choice is an old classic that I’ve always loved by John Lee Hooker, he’s probably my all-time favourite Blues musician, I am a big Blues fan.  It is called Whisky and Women and the reason I chose it was when I first started making shoes and opened that store in Chelsea, I decided because he was my hero to send him a pair of shoes, got in touch with his agent, he said send a pair of shoes and we sent them over and then we got this message back, they were a pair of loafers and all of my Tim Little shoes are named after Blues songs and this was a pair of loafers and they were called by chance, Whiskey and Women which is one of his songs and he apparently, his agent said, as he pulled them on he saw inside it said Whiskey and Women and he thought I’d done that especially for him and thought that was very funny and laughed it so yeah, it is very special to me as a song. Elliot Moss That was Whiskey and Women by John Lee Hooker, the song choice of my Business Shaper today, Tim Little; someone who has applied the basic principles of building a brand with great effect; someone who has a point of view, he talked about the importance of having one of those when you are actually making a product; and someone who loved the mix of everything he does, whether it is looking at the numbers, whether it is dealing with people or whether indeed it is creating the next brilliant pair of shoes. You can hear our conversation with Tim all over again whenever you would like to as a podcast, just search Jazz Shapers or ask your smart speaker to play Jazz Shapers or if you are up bright and early Monday morning you can catch this programme again just before the Business Breakfast at 5.00am.  We are back next Saturday from 9.00 with our next Business Shaper, Claudine Adeyemi, Founder and CEO of Career Ear, a careers advice and recruitment platform enabling employers to engage with young, diverse, quality talent.  Up next after the news at 10.00 it’s Nigel Williams, he’s got more music, interviews and live sessions too.  That’s it from Jazz Shapers and me, have a great weekend. We hope you enjoyed that edition of Jazz Shapers.  You will find hundreds more guests available for you to listen to in our archive.  To find out more, just search Jazz Shapers and iTunes or your favourite podcast platform or head over to mishcon.com/jazzshapers. Tim Little is the Founder and CEO of classic luxury shoe brand, Tim Little , and the Owner and Creative Director of 150-year-old shoemakers, Grenson . Having left a career in advertising in 1997 to follow his dream of designing his own ‘English shoes without the cobwebs’ shoe collection, Tim opened his first shop on Kings Road with a small collection and a fledgling bespoke business. In 2005 he was approached by the owner of old Northampton shoemaker, Grenson, to help turn around the struggling brand. After five years of trying to persuade people that English brogues were cool, Tim took the opportunity to buy the company outright and since then the business has grown three fold and now includes both women’s and accessories. Follow Tim on Twitter @timlittlecom . Highlights I had an initial love of shoes from when I was a child. There is always something round the corner. You need to understand who you are making shoes for. When we design shoes we always have a very acute sense of what Grenson is about and what people like about Grenson. I started in completely the wrong direction. I thought this is it forever, I’ve found my dream job. I walked into a shop in Knightsbridge to buy a pair of shoes and it was the dullest, most appallingly old fashioned experience I'd ever had. It made me think why can’t there be a bit of creativity and interest in design involved in shoemaking? I just drifted on and on, and here I am today. It's all about keeping what's good with tradition but updating it and making it relevant. I love to jump around and have different things going on. I've got the Founder of Grenson as my screensaver. It is lovely to be there right at the beginning where you sit down with a blank piece of paper and just say ‘let’s do something’. Share Footer menu Top Navigate It's business. But it's personal. Navigate About Us Services People Latest Join Us Contact Us Locations United Kingdom London Cambridge Oxford Hong Kong Singapore Browse MDRi MDR Lab MDR Mayfair MDR ONE Mishcon Academy Mishcon Graduates Jazz Shapers Accessibility Cookies Frauds and Scams Legal Privacy RSS Feed Site Map Statement on Slavery and Human Trafficking Tax Strategy Terms of Use Staff Mishcon de Reya LLP is an alternative business structure. It became a limited liability partnership on 9 October 2015. Copyright ©2025\r\n            Mishcon de Reya LLP Subscribe now Show Footer Search Mishcon de Reya Search the Site Loading... How can we help you? Help How can we help you? Crisis Hotline I'm a client I'm looking for advice Something else Subscribe: I'd like to keep in touch If your enquiry is urgent please call +44 20 3321 7000 Crisis Hotline Please wait... I'm a client Please wait... I'm looking for advice Please wait... Something else Please wait..."
    },
    {
      "url": "https://route1views.com/travel/little-jazz-room-key-west/",
      "text": "Little Jazz Room Key West, FL - Route 1 Views Home Travel Articles Create About FAQ About Shop Login/ Signup Search for: Home Travel Articles Create About FAQ About Shop Sign in Sign up Search for: On route and almost there ! Previous Next Little Jazz Room Key West, FL Just a short walk down from the Duval House to the quieter end of Duval Street is the Little Jazz Room what a surprise to find a classy place with great sounds in Key West.   Jazz or Blues every night. Musicians that played with Tommy Dorsey, Glenn Miller and Nelson Riddles orchestras often show up here. Fun Piano Bar happy hour with two for one drinks.   Amazing wine selection and the food is the yummiest. Learn more at https://www.littleroomjazzclub.com/home . Awesome Talent playing the classics off Route 1. David Garland FL Key West Dec 09, 2022 Bars Music Retro/Nostalgia Next Location: Key West FL Get Directions David Garland Dec 09, 2022 Share Little Jazz Room Key West, FL SHARE 0 Like 0 'been there 0 Comment 0 Share Submit Comment Timeline David created this post 3 years ago Related Experiences Have you had an experience at this place? Share your own experience here! Share Your Experience More Views For You! Have another story to tell? Create an account and get started . It's free! Top Show List See Map reset Posts View History Loading Views . . . Looking for something different? Go on a journey through East Coast States Go back destination: Current Screen: Browsing History Close FOLLOW US GET IN TOUCH Question? Request? Issues? Get in touch with us here. Contact Name * Last * Email * Message * Captcha Submit If you are human, leave this field blank. About FAQS Login Shop Register Travel RT1 Privacy Notice Terms of Use About Route 1 © 2025 Double Ohs Music, LLC. All Rights Reserved. Route1Views Loading Close Save changes"
    },
    {
      "url": "https://jazzhousekids.org/about-us/who-we-are/",
      "text": "Who we are - Jazz House Kids Skip to content OUR STORY WHAT WE DO WHO WE ARE Our Leadership Our Team Our Teaching Artists Meet Our Kids OUR ALUMNI Our Mentors IMPACT STEINWAY & SONS + CONN-SELMER JAZZ EDUCATION SCHOLARSHIPS 2022 MCDONALD’S OF PATERSON SCHOLARSHIP R.S. Berkeley Musician of Distinction Award 2025 James Moody Jazz Scholarship for New Jersey CAREERS ADA STATEMENT CONTACT PROGRAMS SUMMER MONTCLAIR (NJ) NEW YORK (NY) MONTCLAIR (NJ) SUMMER WORKSHOP MONTCLAIR JAZZ FESTIVAL YOUTH CLASSES CHiCA POWER EMERGING MUSICIANS JAZZ HOUSE GOES TO COLLEGE NEW YORK (NY) CHICA POWER LEADERSHIP SUMMIT SUMMER IN NYC YOUTH CLASSES JAZZ ACADEMY GIVE AN INSTRUMENT JAZZ ICONS JAZZ AT ONE IN – SCHOOL FAQs Events MONTCLAIR JAZZ FEST MCBRIDE’S WORLD AT SEA JAZZ ICONS SERIES JAZZ AT ONE RALPH PUCCI JAZZ SET JAZZ HOUSE GOES TO COLLEGE BOOK A BAND PAST EVENTS [iNSIDE] THE JAZZ NOTE SOUNDCHECK SERIES 2021 Annual Spring Benefit JAZZ BY STARLIGHT HANG @ HOME LISTENING SERIES Support MID-YEAR APPEAL GIFTS THAT GIVE RAISE THE ROOF Give An Instrument Program NEWS ROOM VIDEOS + LIVE PERFORMANCES Press Releases Newsletters OUR STORY WHAT WE DO WHO WE ARE Our Leadership Our Team Our Teaching Artists Meet Our Kids OUR ALUMNI Our Mentors IMPACT STEINWAY & SONS + CONN-SELMER JAZZ EDUCATION SCHOLARSHIPS 2022 MCDONALD’S OF PATERSON SCHOLARSHIP R.S. Berkeley Musician of Distinction Award 2025 James Moody Jazz Scholarship for New Jersey CAREERS ADA STATEMENT CONTACT PROGRAMS SUMMER MONTCLAIR (NJ) NEW YORK (NY) MONTCLAIR (NJ) SUMMER WORKSHOP MONTCLAIR JAZZ FESTIVAL YOUTH CLASSES CHiCA POWER EMERGING MUSICIANS JAZZ HOUSE GOES TO COLLEGE NEW YORK (NY) CHICA POWER LEADERSHIP SUMMIT SUMMER IN NYC YOUTH CLASSES JAZZ ACADEMY GIVE AN INSTRUMENT JAZZ ICONS JAZZ AT ONE IN – SCHOOL FAQs Events MONTCLAIR JAZZ FEST MCBRIDE’S WORLD AT SEA JAZZ ICONS SERIES JAZZ AT ONE RALPH PUCCI JAZZ SET JAZZ HOUSE GOES TO COLLEGE BOOK A BAND PAST EVENTS [iNSIDE] THE JAZZ NOTE SOUNDCHECK SERIES 2021 Annual Spring Benefit JAZZ BY STARLIGHT HANG @ HOME LISTENING SERIES Support MID-YEAR APPEAL GIFTS THAT GIVE RAISE THE ROOF Give An Instrument Program NEWS ROOM VIDEOS + LIVE PERFORMANCES Press Releases Newsletters GIVE TODAY GIVE TODAY WHO WE ARE Born out of a collaboration of mutual admiration, respect, and “a little strife,” the duo of Melissa Walker and Christian McBride head up JAZZ HOUSE KiDS . The couple not only have a shared musical sensibility, but a belief in the importance of building a legacy and being a part of something bigger than yourself. Melissa is a constant presence at the jazz house she built nearly 20 years ago; hiring a village of professional jazz musicians who educate and mentor kids from New Jersey, New York, and around the world. Every day the people of JAZZ HOUSE KiDS create unique creative programs and initiatives that provide a safe, nurturing, extraordinary musical home for anyone who is lucky enough to be a part of it. LEADERSHIP Meet the dedicated and innovative leadership behind the doors of JAZZ HOUSE KiDS . LEADERSHIP OUR TEAM Meet the tremendous band of professionals who keep the Jazz House humming each and every day. OUR TEAM TEACHING ARTISTS Meet the accomplished musicians who lead ensembles, classes and big bands at JAZZ HOUSE KiDS . TEACHERS OUR KiDS Meet the dedicated and innovative leadership behind the doors of JAZZ HOUSE KiDS . Learn More Our Mentors Let us introduce our mentors who help pave the way for kids at JAZZ HOUSE to find their own beat with in the American art form and an important, uniting voice for our collective story and experience. Learn More \"One of the most successful and respected jazz education programs in the country.\" ~ Jazz TImes Be An Instrument for Change Give TOday JAZZ HOUSE KiDS 347 Bloomfield Avenue Lower Level Montclair, NJ 07042 973-744-2273 info@jazzhousekids.org JAZZ HOUSE KiDS is a 501(c)(3) nonprofit organization. FEIN No. 56-2303577 Charities Reg. No 26049-00 MONTCLAIR JAZZ FESTIVAL MID-YEAR APPEAL SUMMER PROGRAMS DONATE ABOUT US CAREERS At the JAZZ HOUSE Our ensembles, big bands, and Vocal Jazz Academy transform players and singers of all ages into swinging jazz musicians. Sign up below to stay in tune with the JAZZ HOUSE. Email (required) * Select list(s) to subscribe to Constant Contact Use. Please leave this field blank. Copyright © 2025 Jazz House Kids Designed & Managed by MEL WALL"
    },
    {
      "url": "https://keysthrive.com/dt_listing/little-room-jazz-club/",
      "text": "Little Room Jazz Club - KeysThrive Info@KeysThrive.com Advertise Blog Contact Us Home About Keys Thrive Listings Pricing Advertise Blog Contact Us Submit a Listing Little Room Jazz Club 821 Duval Street  Key West FL 33040 Category Restaurant Others About Little Room Jazz Club 305-741-7515 Admin@littleroomjazzclub.com Click to Visit Website Tuesday-Thursday : 11:21 pm - 11:21 pm Real Jazz Happens Here ​A posh intimate listening room with live jazz performances by top artists five nights a week. Our full liquor bar features a refreshing array of craft signature cocktails, wine and beer. On our menu, you'll find delectable, artisanal “Little bites\" inspired by traditional America soul food, to accompany our world class performers. An elevated musical Key West experience venue for music lovers. Our Address 821 Duval Street  Key West FL 33040 Claim Listing:  Little Room Jazz Club × Please Login or Register an Account to Claim Listing Login Close Get Listed On Keys Thrive SPECIAL OFFER Contact Keys Thrive helps local businesses to be seen and encourages people to shop locally and support their community. Info@KeysThrive.com Key West, FL 33040"
    },
    {
      "url": "https://www.jazzleadershipproject.com/contact-us",
      "text": "Drop Us A Message - The Jazz Leadership Project Skip to main content Home Our Services The JLP Experience Workstyle Assessment Ensemble Accelerator Digital Learning Platform About About-Us What We Do JLP Video Introduction Privacy Policy How We Can Help Testimonials Newsletter Contact Us Free Consultation More Home Our Services The JLP Experience Workstyle Assessment Ensemble Accelerator Digital Learning Platform About About-Us What We Do JLP Video Introduction Privacy Policy How We Can Help Testimonials Newsletter Contact Us Free Consultation contact us reach out Write to us below or reach out to us by email: gj@jazzleadershipproject.com Form submitted successfully. × Please provide the required field. × Name Email Subject Message Submit The Jazz Leadership Project © 2025 back to top a mopro website"
    }
  ]
}