{
  "fuentes": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "ayoo@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "bcutts@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "boxoffice@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "cdungca@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dht@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "dmatlin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "doshima@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "elane@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "emcfadden@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "jmartin@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "kmatsuno@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "productions@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "rtandal@diamondheadtheatre.com"
    },
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "email": "vgreen@diamondheadtheatre.com"
    },
    {
      "url": "https://havanakl.com/contact-us/",
      "email": "datokenneth@havanakl.com"
    },
    {
      "url": "https://www.vnews.com/new-restaraunts-in-hanover-58383686",
      "email": "circulation@vnews.com"
    },
    {
      "url": "https://www.vnews.com/new-restaraunts-in-hanover-58383686",
      "email": "erothwells@vnews.com"
    }
  ],
  "mails": [
    "ayoo@diamondheadtheatre.com",
    "bcutts@diamondheadtheatre.com",
    "boxoffice@diamondheadtheatre.com",
    "cdungca@diamondheadtheatre.com",
    "circulation@vnews.com",
    "datokenneth@havanakl.com",
    "dht@diamondheadtheatre.com",
    "dmatlin@diamondheadtheatre.com",
    "doshima@diamondheadtheatre.com",
    "elane@diamondheadtheatre.com",
    "emcfadden@diamondheadtheatre.com",
    "erothwells@vnews.com",
    "jmartin@diamondheadtheatre.com",
    "kmatsuno@diamondheadtheatre.com",
    "productions@diamondheadtheatre.com",
    "rtandal@diamondheadtheatre.com",
    "vgreen@diamondheadtheatre.com"
  ],
  "nombre_sitio": "littlehavanabarandgrill.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.diamondheadtheatre.com/team/",
      "text": "Staff & Board of Directors - Diamond Head Theatre Skip to content Box Office: (808) 733-0274 | Business Office: (808) 733-0277 Facebook Instagram YouTube LinkedIn Email Search for: Shows & Tickets Buy Tickets Season Subscriptions Seat Map Show Archive Subscriber Login Donate Annual Giving Capital Campaign Producer’s Club Sponsorship ‘Ilima Awards Auditions Show Auditions Shooting Stars Classes Year-Round Classes Summer Musical Theatre Experience Shooting Stars Instructors Scholarships About Staff & Board of Directors Instructors Volunteer Rentals News Show Archive Your New Theatre Theatrical Arts Building Make a Gift Sponsor a Seat Photos News Capital Campaign Donors Contact BUY TICKETS Staff & Board of Directors Jacque Vaughn 2025-07-23T06:29:51-10:00 STAFF & BOARD OF DIRECTORS We bring the magic of theatre to all Trevor Tamashiro, Executive Director Trevor joined Diamond Head Theatre as Executive Director in April 2023. Born and raised in Hawaii, and a graduate of Punahou School, he brings nearly 20 years of experience in nonprofit executive leadership. Trevor started his journey in New York City working for Broadway Dance Center. Other positions include: Chief Advancement Officer of The Diller-Quaile School of Music; Deputy Director of Saratoga International Theater Institute; and Deputy/Program Director for The Drama League of New York. Trevor is a member of the Association of Fundraising Professionals and is a Certified Fund Raising Executive (CFRE). He holds a degree in Theatre Arts from University of Miami, a Master of Business Administration degree from Pace University, and a Master of Science degree in Nonprofit Management from Columbia University. John Rampage, Artistic Director John Rampage is a performer, actor, choreographer, and director who has served as Diamond Head Theatre’s Artistic Director since 1995. He is the creative mastermind behind all of the theatre’s productions and programs, overseeing the curation of two or more shows each season and selects directors, musical directors, and set designers. His relationship with the theatre began in 1975 where he performed as Tommy Gilas in the 1975 production of Music Man. In the 1980s, Rampage danced and sang his way across the U.S. and Europe and returned in 1991 as choreographer of Evita. More than 120 productions have been shared with the community under his oversight. A 47-time Po‘okela Award winner for excellence in the theatre, John is also the recipient of the Hawaii State Theatre Council 2006 Pierre Bowman Award. OUR TEAM Dana Matlin Business Manager & Capital Campaign Coordinator 808.733-0277 (ext. 303) Krysta Matsuno Individual & Corporate Gifts Manager 808.733-0277 (ext. 306) Erin McFadden Director of Education & Shooting Stars 808.733-0277 (ext. 308) Brando Cutts Facilities & House Manager Volunteer Inquiries 808.733-0277 (ext. 310) Chandler Converse Production & Special Events Coordinator 808.733-0277 (ext. 304) Jamie Martin Box Office Manager 808.733-0277 (ext. 312) Mary Meinel Assistant Box Office Manager Kyle Sombrero Box Office Assistant & Concession Manager Skye Tonokawa Box Office Assistant Andrea Yoo Box Office & Admin Assistant 808.733-0277 (ext. 321) Emily Lane Costume Shop Manager 808.733-0277 (ext. 320) Candy Dungca Lead Stitcher 808.733-0277 (ext. 321) Kanani Sato Stitcher 808.733-0277 (ext. 321) Quinn Curammeng Stitcher 808.733-0277 (ext. 321) Dawn Oshima Lighting Supervisor, Master Stage Electrician 808.733-0277 (ext. 331) Brian Sullivan Technical Director Vincent Green Production Associate 808.733-0277 (ext. 333) Randy Tandal Production Associate 808.733-0277 (ext. 333) Kyle Conner Scene Shop Assistant Ryan Sullivan Scene Shop Assistant Cheyne Nomura House Manager Rochelle Uchibori House Manager Amy Sato Showtime Box Office Assistant Malia Connor Concession Manager Olga Moroz Concession Manager BOARD OF DIRECTORS Officers Colin Miwa CHAIR Trevor Bracher VICE CHAIR, Chair-Elect Mike Ching VICE CHAIR Matthew Pennaz VICE CHAIR Mark Wong VICE CHAIR Jennifer Tanabe SECRETARY Gabe Lee TREASURER Rick Chong IMMEDIATE PAST CHAIR Board Members Cathy Camp Sidney C. L. Char Wayne Chi Rick Ching Jennifer Diesman Uson Y. Ewart Elisia Flores Dennis Francis Candes Meijide Gentry Kay Hampton Randy Harris Todd Iacovelli Kathleen Lin-Hurtubise Mariko Lyons John Magauran, M.D. Tony Mizuno David Okabe Karyn R. Okada Laurence Paxton Nigel Pentland Richard M. Rand Paul M. Saito Kelly Sanders Dean Shigemura Travis Tanaka Sharen Wago Indru Watumull Carolyn A. Berry Wilson Wendell J. Wo Steven Wong Vernon Wong Anna Steenerson Young Diamond Head Theatre is America’s third oldest continuously running community theatre. We are an independent nonprofit that relies on community support. Diamond Head Theatre recognizes the use of diacritical markings in the modern orthography of Hawaiian language. These markings may be omitted to give you the best experience with our website. 520 Makapuu Avenue Honolulu, Hawaii 96816 Box Office Hours: Monday through Friday 10 am to 4 pm Box Office: (808) 733-0274 Business Office: (808) 733-0277 Click Here to Email Us SIGN UP FOR E-NEWS Subscriber Login FOLLOW US © 2024 Diamond Head Theatre | All Rights Reserved | Privacy Policy | About Accessibility | Site created by Transcendence Pacific. Toggle Sliding Bar Area Our Community Giving Campaign needs your kokua to build a new arts complex. Diamond Head Theatre is a 501(c)(3) nonprofit organization. FEIN 99-0073495 Page load link Go to Top"
    },
    {
      "url": "https://havanakl.com/contact-us/",
      "text": "Havana Bar and Grill Changkat  » Contact Us Home Menus Bar Grill Upstairs About Us Private Functions Contact Us Photos Changkat Bukit Bintang Kuala Lumpur 50200 Tel: +603-2142-7170 Paolo +6018-276-1796 Email: datokenneth@havanakl.com Havana Bar and Grill Changkat Just another WordPress site Home Bar Grill Club Upstairs About Us Events Private Functions Contact Us Photos Book a Table now! Via Phone Call Paolo : +6018-276-1796 Call Jovi : +6011-245-95990 Call Adeq : +6017-345-8567 Call the Landline : +603-2142-7170 : For enquiries relating to bookings for functions call Paolo : +6011-108-50074 Via Email To make a reservation please use the form here. Alternatively you can email datokenneth@havanakl.com , with any questions or use the form below. Fields marked with a * are required. ( Note : email addresses will only be used to reply to your email and will not be shared with any outside parties or used to send you unsolicited email). Name * Email * Phone Number * Subject Line * Text * Please complete the validation to prove you are not a spambot"
    },
    {
      "url": "https://www.vnews.com/new-restaraunts-in-hanover-58383686",
      "text": "Two new restaurants bring fresh and familiar flavors to downtown Hanover - Valley News Enjoying the Valley News? You can now receive the latest newsletter from the Valley News directly in your inbox and never miss a headline. Sign up Close LOG IN LOG OUT e-EDITION NEWSLETTERS SUBSCRIBE MANAGE ACCOUNT Search for: Search News Opinion Sports Photos Arts & Life Obituaries Puzzles Search LOG IN LOG OUT SUBSCRIBE NOW! Manage Your Account Newsletters Today’s e-Paper Latest News Opinion Photos Arts & Life Events Business Sports Puzzles Classifieds Contact Us Close Search LOG IN LOG OUT SUBSCRIBE NOW! Manage Your Account Newsletters Today’s e-Paper Latest News Opinion Photos Arts & Life Events Business Sports Puzzles Classifieds Contact Us Skip to content THANK YOU FOR VISITING OUR NEW WEBSITE! Menu Valley News LOG IN LOG OUT e-EDITION NEWSLETTERS SUBSCRIBE MANAGE ACCOUNT Open Search Search for: Search Menu News Opinion Sports Photos Arts & Life Obituaries Puzzles Topic Highlight A Life A Look Back Readers Choice Calendar Classifieds Submit An Obituary Advertise Home » Two new restaurants bring fresh and familiar flavors to downtown Hanover Posted in Dining Out Two new restaurants bring fresh and familiar flavors to downtown Hanover by Valley News Staff Writer December 16, 2024 Share this: Click to share on Facebook (Opens in new window) Facebook Click to email a link to a friend (Opens in new window) Email Click to print (Opens in new window) Print Sign up for the Valley News' morning newsletter and get essential news each day. Sign up Mariella Cubillet prepares ropa vieja, Spanish for old clothes, a Cuban braised, shredded roast beef dish in the kitchen at Little Havana in Hanover, N.H., on Saturday, Dec. 14, 2024. Cubillet, her daughter Maylena Chaviano, son Ernesto Medina and family friend Yuniesky Miyar opened the restaurant featuring Cubilletâs Cuban home cooking on Dec. 3. (Valley News – James M. Patterson) Chef Martin Murphy sautees garlic and chorizo on an induction range for gambas y chorizo in the Casa Brava Tapas Bistro’s all-electric kitchen in Hanover, N.H., on Saturday, Dec. 14, 2024. Murphy, the former owner of Ariana’s Restaurant, partnered with James Van Kirk, former owner of Candella Tapas Lounge to open Casa Brava this month. Sous chef Isaiah Johnson is at right. (Valley News – James M. Patterson) Maylena Chaviano, right, and Yuniesky Miyar, left, arrange tables before opening Little Havana, a new Cuban restaurant in Hanover, N.H., for the evening on Saturday, Dec. 14, 2024. The restaurant is in the former Duende space on Currier Place.  (Valley News – James M. Patterson) Jaime Gomez, of Bellows Falls, pulls an appetizer of ham croquetas closer at Little Havana in Hanover, N.H., on Saturday, Dec. 14, 2024. The family run restaurant opened on Dec. 3 and showcases Mariela Cubillet’s Cuban home cooking. (Valley News – James M. Patterson) Ernesto Medina, left, talks with Malyn Gomez, 5, after getting him a toy car to play with at the table with his dad Jaime, and mom Ziang, right, at Little Havana in Hanover, N.H., on Saturday, Dec. 3, 2024. The Gomez family traveled from Bellows Falls to sample the food at the Cuban restaurant. (Valley News – James M. Patterson) Shredded beef and other ingredients for ropa vieja, meaning old clothes in Spanish, wait to be combined on the stove in the kitchen of Little Havana in Hanover, N.H., on Saturday, Dec. 14, 2024. (Valley News – James M. Patterson) Casa Brava bar manager Austin Junker prepares to open the restaurant off the lobby of Six South Street Hotel in Hanover, N.H., on Saturday, Dec. 14, 2024. (Valley News – James M. Patterson) Chicken tinga empanadas, foreground, and gambas y chorizo, background are on the menu of Casa Brava Tapas Lounge at Six South Street Hotel in Hanover, N.H., on Saturday, Dec. 14, 2024.(Valley News – James M. Patterson) Casa Brava bar manager Austin Junker mixes a smoky quartz cocktail, named for the New Hampshire state gem at the restaurant in Hanover, N.H., on Saturday, Dec. 14, 2024. (Valley News – James M. Patterson) HANOVER — Two recent additions to the downtown dining scene bring fresh flavors and old favorites. A building located at 15 Lebanon St. in Hanover is now home to Little Havana, a Cuban restaurant, while a previous tenant of the space has opened a tapas spot a block away in the Six South Street Hotel. “We’ve seen a nice resurgence since we came out of COVID of some new places opening up,” said Kieran Campion, the owner of Sawtooth Kitchen located on Allen Street. “I think anything that’ll bring more interest and more people into downtown Hanover is a good thing for everybody.” Little Havana, which opened Dec. 3, serves up traditional Cuban comfort food. “These are dishes you’ll always find in Havana,” co-owner Maylena Chaviano said. Join your neighbors and subscribe! Award-winning coverage on breaking news and today’s top stories in and around the Upper Valley. Whether it's arts, sports, opinion, world news,  or our archives and e-editions, you’ll have unlimited access to the Valley News' content. Subscribe Today! Chaviano left Cuba 18 years ago when she moved to Canada for school. The other three owners, her mother, Mariela Cubillet; her brother, Ernesto Medina Cubillet; and close family friend, Yuniesky Miyar, moved to the Upper Valley from Cuba 2½ years ago, and Chaviano met them here. “This is our place to reunite,” Chaviano said. Chaviano came across the floor above the restaurant at 15 Lebanon St. while searching for locations for the Upper Valley Salsa club to use and fell in love. Then, in September, the four Little Havana owners bought the assets of the previous restaurant, Duende, and began renting the space, with the hope of eventually acquiring the floor above as well for fiestas and salsa nights. It was never any of the four’s plan to open a restaurant. “I wanted to do a coffee shop but apparently mojitos are better,” Chaviano said. The owners decided to open a restaurant with their “own food and identity,” she said. The menu includes ropa vieja, a dish of shredded beef cooked in a rich tomato sauce with peppers and spices, served over congri rice and sweet plantains. Also on the menu is a classic Cuban sandwich layered with roasted pork, ham, Swiss cheese, pickles, and mustard, on homemade bread. Cubillet cooks all the food. She has no previous professional cooking experience, but often cooked at home. Her a professional background is in chemical engineering. “I hope enough people will appreciate our way of eating and who we are as people,” Chaviano said. One of the biggest challenges they’ve faced is sourcing the “right ingredients for the tropical taste,” Chaviano said. They tried many different plantains before landing on the ones with the right taste and texture. With the exception of Mariela Cubillet, all of the owners still have day jobs. There are only three staff members besides the four owners, to serve up to 49 people. “It’s very hard when you have responsibilities at your other job and then you have to figure out how to fix everything here,” Miyar, who works at Upper Valley Haven, said. “Every day we try to smile even if we feel tired.” Chaviano is grateful for the positive response from the community so far and hopes she and her co-owners can serve as an inspiration for other immigrants in the area. “We are risk-takers, otherwise we wouldn’t even be here,” Chaviono said. “Immigrants are presented as working in certain sectors but there are so many different pathways.” Tapas on South Street A three-minute walk away inside the Six South Street Hotel is Casa Brava Tapas Bistro, which opened Dec. 6. The bistro is a collaboration of James Van Kirk, the owner of the former Candela Tapas Lounge, which opened in 2013 and closed in 2022 in the space now occupied by Little Havana, and Martin Murphy, the previous owner and chef of Ariana’s Restaurant located in the Lyme Inn. Born and raised in Puerto Rico, Van Kirk’s parents bought a place in Quechee in the ‘90s to escape the heat of the summer and fall on the island. After his father died in 2009, Van Kirk came to Quechee to decide whether to sell the place or not. He’s been in the Upper Valley ever since. For his part, Murphy moved to the Upper Valley 18 years ago from Florida, “I love it up here,” he said. “It’s been the longest address of my life.” The two men met when Van Kirk dined at Ariana’s shortly after it opened in 2011. “We just clicked,” Van Kirk said. “We’ve been friends for a long time and have always wanted to do something together,” Van Kirk said. “I have a following and he has a following and it’s like Ariana’s and Candela got together.” Casa Brava Tapas Bistro emerged from a confluence of events. Most Read Driver injured in single-vehicle crash on I-91 in White River Junction Jennifer Hauck A Look Back: How the disappearance of steam locomotives changed the Upper Valley Steve Taylor Witnesses: Police fatally shot man in Springfield during operation targeting someone else John Lippman In 2022, Van Kirk decided not to renew his lease at 15 Lebanon Street and planned to leave the restaurant business. He had been traveling and was even considering moving out of the Upper Valley when Murphy also decided not to renew his lease at Ariana’s. Meanwhile, the management team at Six South Street Hotel had been brainstorming options for their restaurant space since it re-opened after renovations in the spring of 2022. Etna resident Jim Rubens, a former New Hampshire state senator, knows Murphy personally and connected him with the team at the hotel. In terms of downtown Hanover, the duo’s rent at the hotel is “reasonable,” Murphy said. He also appreciated that the kitchen was a “turn-key situation.” To top it all off, the dining room has the “perfect” capacity, according to Van Kirk. “It’s a win-win situation for both of us,” Van Kirk said. The restaurant can seat up to 57 people, including the bar. There’s also a patio, with an additional 25 seats, which the team plans to open in warmer weather. Kathy Decker, general manager of the hotel, said once people caught wind of the partnership they were stopping her in the streets to ask about it. “The response has been incredible,” she said. “It’s their following.” When it came to the menu, Van Kirk always knew he wanted to do tapas, and Murphy agreed. “I’ve always loved the idea of a tapas restaurant,” Murphy said. “People are willing to be more adventurous, so I can be much more creative.” The menu ranges from tomato soup and grilled cheese, to chicken empanadas, to bao buns. “I love doing food from lots of different cultures. We’ll have flavors from all over the world,” Martin said. “And just when everyone’s comfortable, we’ll mix it up.” Little Havana is open 5 to 10 p.m., Tuesday through Saturday. Casa Brava Tapas Bistro is open 4:30 to 10 p.m., Tuesday through Saturday. Emma Roth-Wells can be reached at erothwells@vnews.com or 603-727-3242. Is there something you would like us to cover? Tell us about it - click here to send us a note. What to Read Next Tagged: Hanover NH Emma Roth-Wells Staff Writer Emma Roth-Wells is a staff writer at the Valley News. She can be reached at erothwells@vnews.com or 603-727-3242. More by Emma Roth-Wells Latest News Lebanon casino gets green light for additional parking spaces by Lukas Dunford Severe drought hits Upper Valley by Clare Shanahan Financial woes could force Bluff Elementary to close, students would be reassigned by Patrick O'Grady Police: Newbury electric bike rider dies after collision with pickup by Clare Shanahan Windsor County resident tests positive for Jamestown Canyon virus by Clare Shanahan For Vermont survivors of orphanage abuse, the restorative justice process is over. The journey is not. By Kevin OConnor VtDigger Customer Service 603-298-7739 circulation@vnews.com 24 Interchange Dr West Lebanon, NH 03784 Facebook X Instagram About Us Contact Us Meet Our Team Corrections Policy Editorial Independence AI Policy Submit a Letter to the Editor Submit a News Tip Sign up for our Newsletter Subscriptions Advertise The Newspapers of New England Family Amherst Bulletin Athol Daily News Concord Monitor Daily Hampshire Gazette Greenfield Recorder Monadnock Ledger-Transcript Valley Advocate Valley News Around Concord Concord Insider NNEdigital We continue to need local support from our readers Help support your local news source! Support Now Terms of Service Privacy Policy Accessibility © 2025 Valley News Powered by Newspack Sign in Close Email address Password Forgot password / Create account Continue"
    }
  ]
}