{
  "fuentes": [
    {
      "url": "https://www.westlodge.org.uk/staff",
      "email": "office@westlodge.org.uk"
    },
    {
      "url": "https://lodge2193.org/",
      "email": "elks@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/",
      "email": "secretary@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/about/",
      "email": "elks@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/about/",
      "email": "secretary@lodge2193.org"
    },
    {
      "url": "https://floridaelks.org/district-ec",
      "email": "r.king@floridaelks.org"
    },
    {
      "url": "https://lodge2193.org/event/bingo/",
      "email": "elks@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/event/bingo/",
      "email": "secretary@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/become-a-member/",
      "email": "elks@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/become-a-member/",
      "email": "secretary@lodge2193.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://lodge2193.org/enf-fidelity-club/",
      "email": "elks@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/enf-fidelity-club/",
      "email": "enf@elks.org"
    },
    {
      "url": "https://lodge2193.org/enf-fidelity-club/",
      "email": "secretary@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/facility-rental/",
      "email": "elks@lodge2193.org"
    },
    {
      "url": "https://lodge2193.org/facility-rental/",
      "email": "secretary@lodge2193.org"
    }
  ],
  "mails": [
    "elks@lodge2193.org",
    "enf@elks.org",
    "gabe@journeysherwood.org",
    "info@journeysherwood.org",
    "leadershipboard@journeysherwood.org",
    "office@westlodge.org.uk",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "r.king@floridaelks.org",
    "scott@journeysherwood.org",
    "secretary@lodge2193.org"
  ],
  "nombre_sitio": "lodge2193.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.westlodge.org.uk/staff",
      "text": "West Lodge School - Staff Skip to content ↓ Close Home About Us Aims and Values Statement Inspection Report Secondary Destinations Pastoral and Wellbeing What makes West Lodge special? Staff Facilities Policies Vacancies Wraparaound Care Fees Admissions Process Our Admissions Process Open Morning Friday 26th September 2025 Book a Tour Make an Admissions Enquiry Fees Curriculum English Mathematics Science and Engineering Computing A Growth Mindset School Geography History Business Enterprise Programme Food Technology Art Spanish Music PE Design Technology Religious Education PSHE and Citizenship Nursery / Pre-School Class Special Educational Needs Gifted and Talented Beyond the Classroom Sport Music School Trips School Journey Public Speaking Drama Leadership Opportunities Clubs Lunch Our Houses Our Wider Community Eco Council West Lodge Stories Story Wall Meet Our Community West Lodge Story Video What our Parents Say Latest News Alumni Stories Photo Gallery Parents Term Dates Uniform Wraparound Care Latest News West Lodge Parents' Association Lunch West Lodge Key Dates Calendar Recommended Reading Lists Contact Us Contact Our Governors Read our Inspection Report Read more Watch our School Video Read more What makes West Lodge special? Read more Parents Open Morning 26th September Contact Us Menu W est L odge S chool A co-educational prep school for 3-11 year olds Parents Open Morning 26th September Building confidence Having fun Encouraging growth mindsets Sparking curiosity Teaching & learning for the 21st century Admissions Admissions Process Attend our Open Day on 26th September 2025 Book a Tour Home About Us Staff Staff Meet our dedicated teaching and support teams: Senior Leadership Team Mr Francis Head Teacher Mr Weighill Deputy Head Teacher Mrs Collins Assistant Head Teacher Mrs Whyte Bursar Teaching Team Year 6 Mr Weighill - Deputy Head Teacher, Miss Johnson (HLTA) Year 5 Mrs Calland, Miss Johnson (HLTA) Year 4 Mrs Coleman - Head of English, Mrs Pruden (HLTA) Year 3 Mrs Bartholomew, Mr Staggs, Mrs Staples (TA) Year 2 Mrs Collins - Assistant Head, Mrs Ford (HLTA) Year 1 Mrs Clary, Mrs Bensley (TA) Reception Mrs Chelton, Mrs Aysal (TA), Mrs Elsley (TA) Nursery Mrs Doherty, Mrs Rose (TA), Mrs Talluri Miss Barrett Teacher Miss Charlton 1:1 Teaching Assistant Mrs Z Murray 1:1 Teaching Assistant Ms N Murray 1:1 Teaching Assistant Specialist Teachers Ms Austin LAMDA Teacher Mrs Fletcher Head of Music Mrs Hessling-Diffey Dance Mrs Jones Food Technology Mrs Knights SENDCo Mrs Kowal French Mr McCabe PE Co-ordinator & Sports Coach Mr Peebles Computing Mr Staggs Computing Teacher & Science Co-ordinator Instrumental Teachers Mr Ashdown Piano and Guitar Ms Bartlett Piano Miss Berreen Violin Mrs Holmes Singing Mrs Wildey Flute Management & Administration Ms Hamlyn Communications Manager Mrs Holloway Finance Officer Mrs Stoyles Administrative Assistant Mrs Vernon Office Manager Wraparound Care Mrs Aysal After School Club Supervisor Mrs Murray After School Club Supervisor Mrs Pruden Breakfast Club and After School Supervisor Catering Team Chef Paul Chef Mrs Curran Assistant Cook Mrs Bolton Catering Team Mrs Busby Catering Team Miss Easton Catering Team Lunchtime Supervision Ms Fegan Lunchtime Supervisor Mrs Hailes Lunchtime Supervisior Mrs Murray Lunchtime Supervisior Mrs Williams Lunchtime Supervisior Facilities Mrs Busby Domestic Team Mrs Curran Domestic Team Mrs Gurnett Domestic Team Mr Ironside Caretaker Mr Underwood Domestic Team Board of Governors Mrs Christine Head-Rapson Chair of Governors Christine has extensive teaching and educational leadership experience in a variety of settings including independent, grammar and state schools. Mrs Jane Davies Chair of Education Committee Mrs Nicolette Gaskin Governor Mr Christopher Heayberd, BA, ACA Chair of Finance Committee Chris was educated at Alleynâs School, read economics at university and is a Chartered Accountant. Mrs Margot Rohan Chair of Welfare Governor Committee A West Lodge governor since 1988, Margot is a committed, knowledgeable and organised administrator with extensive experience in the private and public sector, having managed a diverse range of meetings and led a number of successful ICT, change management and community engagement projects. Â Mr Gerald Standing Chair of Health & Safety Committee Mr Mark Jones Mrs Dinah Gately Dinah's association with West Lodge began in 2003 when her daughter started at West Lodge School.  Having recently retired from work, she brings skills and experience gained during her career in the City of London to the Board. Mrs Gillian Murray Governor In this section Aims and Values Statement Inspection Report Secondary Destinations Pastoral and Wellbeing What makes West Lodge special? Staff Facilities Policies Vacancies Wraparaound Care Fees W est L odge S chool Contact Us West Lodge School 36 Station Road Sidcup DA15 7DU Tel: 020 8300 2489 Email: office@westlodge.org.uk Head Teacher: Mr Robert Francis Founded 1940 Educational Trust Accredited by the Independent Schools Council Useful Links Term Dates About Us Parents Admissions Vacancies West Lodge Stories Contact Us West Lodge School Ltd . Registered with Charity Commissioners . No. 283627 . Company No. 1590162. VAT Registration Number 479 0630 68 © 2025  West Lodge School | Website design by Juniper Websites | High Visibility | Accessibility Statement | Sitemap | Privacy Policy | Cookies Cookie Policy This site uses cookies to store information on your computer. Click here for more information Allow Cookie Settings"
    },
    {
      "url": "https://lodge2193.org/",
      "text": "Home - Ormond Beach Elks Lodge 2193 SEARCH 285 Wilmette Ave, Ormond Beach secretary@lodge2193.org + 1 (386) 677-7180 Login / Register Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Become a Member Become a Member Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Scholarships Support systems can be hard to gain—especially ones that understand the challenges of transitioning to college. An Elks scholarship is more than financial aid; it’s an invitation to join a strong, supportive community: the #ElksFamily. Veterans Programs Elks pledge \"So long as there are veterans, the Benevolent and Protective Order of Elks will never forget them.\" The Elks National Veterans Service Commission takes that pledge one step further, and promises service to our nation's veterans and military members, with a special focus on service to those in need. Children Services The Florida Elks Youth Camp is dedicated to enriching the lives of children from the state of Florida. The camp staff presents a safe camp experience that contributes to each camper's mental, physical, and social growth. Welcome to fraternal order of Elks The Best Non-Profit\nOrganization We’re committed to providing our community, children and veterans with service and support. Our Mission To inculcate the principles of Charity, Justice, Brotherly Love and Fidelity; to recognize a belief in God; to promote the welfare and enhance the happiness of its Members; to quicken the spirit of American patriotism; to cultivate good fellowship; to perpetuate itself as a fraternal organization, and to provide for its government, the Benevolent and Protective Order of Elks of the United States of America will serve the people and communities through benevolent programs, demonstrating that Elks Care and Elks Share. Discover More Discover More m+ Total Donations Upcoming Events Join us for our upcoming events We’re inspiring and helping our community to live a better lifestyle View All Events View All Events 25 June 6:00 PM Ormond Beach Elks Lodge #2193 Kards for Kids 26 June 5:30 PM 285 Wilmette Ave. Ormond Beach, FL 32174 Country Night with music by 3’s Company 27 June 6:30 PM 285 Wilmette Ave. Ormond Beach, FL 32174 Bingo 28 June 6:00 PM 285 Wilmette Ave. Ormond Beach, FL 32174 Wing Night with Karaoke 29 June 6:00 PM 285 Wilmette Ave. Ormond Beach, FL 32174 Veterans Dinner 30 June 2:00 PM 285 Wilmette Ave. Ormond Beach, FL 32174 Bar Bingo 20 July 11:00 AM 285 Wilmette Ave. Ormond Beach, FL 32174 Shuffleboard Tournament 20 September 11:00 AM 285 Wilmette Ave. Ormond Beach, FL 32174 3rd Annual Duck Drop News & Articles 04 Sep Joe Zarro – Celebration of Life 04 Sep Rummage Sale 04 Sep Bellows September 2025 03 Sep Elks Riders 30 Jul Bellows August 2025 24 Jul Hope Scholarship Elks Care, Elks Share Links About us Events Terms of Use/Privacy Policy Contact elks@lodge2193.org + 1 (386) 677-7180 285 Wilmette Ave, Ormond Beach, FL 32174 United States of America © All Copyright 2023 by Terra"
    },
    {
      "url": "https://lodge2193.org/about/",
      "text": "About - Ormond Beach Elks Lodge 2193 SEARCH 285 Wilmette Ave, Ormond Beach secretary@lodge2193.org + 1 (386) 677-7180 Login / Register Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Become a Member Become a Member Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental About us Home About About us About us... To inculcate the principles of Charity, Justice, Brotherly Love and Fidelity; to recognize a belief in God; to promote the welfare and enhance the happiness of its Members; to quicken the spirit of American patriotism; to cultivate good fellowship; to perpetuate itself as a fraternal organization, and to provide for its government, the Benevolent and Protective Order of Elks of the United States of America will serve the people and communities through benevolent programs, demonstrating that.\n\nWith more than 1.1 million members in more than 2,100 local lodges nationwide, the Elks are one of the largest and most active fraternal organizations in the world! Organized on February 16, 1868, we are the largest American Benevolent Organization in the United States of America, consisting of American Citizens of the United States and its Territories.\n\n\nThe Order of the Elks is a benevolent organization, not a “Social-Business Club”. It is dedicated to Service to our Communities and our Country. The various phases of our work, whether it be with the fortunate or unfortunate youths, care of the needy, Veterans Service, furtherance of Americanism, or other Benevolent activities,… offer you a wide choice from which you may choose areas of interest.\n\n\n\nUpon attaining membership in our Order, you will become part of a National Organization, which has members from every prominent city of our Country, who are respected Citizens in their Communities and are proud to say that they belong to the Benevolent and Protective Order of Elks of the United States of America. Call Anytime +1 (386) 677-7180 Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Like this: Like Loading... Elks Care, Elks Share Links About us Events Terms of Use/Privacy Policy Contact elks@lodge2193.org + 1 (386) 677-7180 285 Wilmette Ave, Ormond Beach, FL 32174 United States of America © All Copyright 2023 by Terra %d"
    },
    {
      "url": "https://floridaelks.org/district-ec",
      "text": "Florida Elks - East Central MEMBERS Home About Join Us Projects Back Youth Camp Children's Therapy Services Florida Elks for Autism Veterans Scholarships Harry-Anna Gallery Back Events Officers Contact News Features The Front Page _______________ Our Military & Veterans _______________ DISTRICT NEWS Central East Central North North Central Northeast Northwest South Southeast Southeast Central South Southeast South Southwest Southwest Southwest Central West Central Florida Elks News Editor: Rachael King r.king@floridaelks.org Entire contents copyright 2023 by the Florida State Elks Association Inc. P.O. Box 49 Umatilla, FL 32784-0049 352-669-9443 Share Your Story We'd love to see & share your Lodge & District Events! Let's promote what our Florida Elks are doing to support your community SUBMIT YOUR STORY Preserve any person, event, or memory with a personalized brick at your Florida Elks Youth Camp in Umatilla, Florida. Learn More Florida Elks News Online East Central District Ormond Beach Elks Present $6,000 Grant to Jerry Doliner Food Bank Details Written by Debbie Brozyna Hits: 78 On July 30, Ormond Beach Elks Lodge #2193 donated $6,000 from its Elks National Foundation Spotlight Grant to the Jerry Doliner Food Bank, which serves those in need in Volusia and Flagler counties. The Social Service Council of the Jewish Federation maintains a well-stocked food bank for people who “fall through the cracks” of the system. Pictured are Steve Brozyna, trustee; Michael Chandler, FSEA State President; Peggie Sue McClellan, PER, Lecturing Knight; Joseph Brozyna, PER, Exalted Ruler; Debbie Brozyna, Secretary; Sherman Burres, trustee; and Rabbi Dr. Robert Lennick, executive director. Palm Coast Elks Provide Refreshments for Law Enforcement Memorial Service Details Written by David Valinski Hits: 54 Palm Coast Elks Lodge #2709 provided several trays of refreshments to the Flagler County Sheriff’s Office for the annual law enforcement memorial service held May 14 at the Sheriff’s Operations Center in Bunnell. The FCSO honored six fallen heroes who lost their lives while on duty. Pictured are FCSO Commander George Bender, Exalted Ruler Pete Lenhertz, FCSO Chief and Elks member Mark Strobridge, and Loyal Knight Jerry DiMenna. Port Orange Elks Coordinate Grocery Distribution with Freedom Health Details Written by Frank Kuczkowski Hits: 44 On April 16, Port Orange Elks Lodge members distributed bags of groceries, which were donated by Freedom Health, to local residents. Lodge members coordinated the activity and the lodge was the distribution site. The bags contained nonperishable pantry items. Freedom Health is a Medicare health care provider through Blue Cross & Blue Shield. Pictured are Brandi Hardy, Freedom advisor; Byron Senff, Esquire; Lois Place, Exalted Ruler; Gordon Place, Leading Knight; Lou Greci, Inner Guard; Stephen West, Lecturing Knight; and Debbi Keyes, Activity Chair. Titusville Elks Lodge Awards Three Scholarships Details Written by Linda Trawle Hits: 254 Each week, Titusville Elks Lodge’s bingo players raise money for scholarships for three local students. On April 14, the lodge presented $1,500 scholarships to Brayden Hunt of Titusville High School, Grayce Meredith of Astronaut High School, and Jamaris White of Edgewater Junior/Senior High School. They are each pictured with Heather Heineman, Exalted Ruler. Titusville Elks Lodge Supports Children's Hunger Project Details Written by Titusville Elks Hits: 325 Titusville Elks Lodge #2113 donated $2,000 from its Elks National Foundation Spotlight Grant to the Children's Hunger Project March 3. This project helps elementary students in need by providing them with food to take home for weekends and during school breaks. Their goal is to ensure that children have access to basic nutrition when they may not have access to school meals. Pictured are Cheryl Cominsky, Children's Hunger Project executive director, and Pete DeMonte, Exalted Ruler. Titusville Elks Knit and Crochet Blankets for Crescent Wood Senior Living Residents Sanford Elks Show Up for Little League's Opening Day Celebration Ormond Beach Elks Donate Grant to Jerry Doliner Food Bank Port Orange Elks Donate to Atlantic High School Pantry Page 1 of 27 Start Prev 1 2 3 4 5 6 7 8 9 10 Next End Florida State Elks Association, Inc. P.O. Box 49 Umatilla, FL 32784 Toll free: 800-523-1673 Members Only Officers & Committees Lists ENF & HATF Donor Reports About Us What it means to be an Elk Join Us Lodge Information Staff Find Us Lodge Locator Driving Directions Area Lodging Youth Antlers The Antlers are back! More Tampa Bay Rays Tampa Bay Lightning Tampa Bay Bucs Brotherhood Ride Lodge PR Materials Resource Center Videos GL Sharables GL Florida Shareables Scholarships Rack Cards FEYC FECTS Army of Hope Smith Center Brochures Hope Scholarship Bags Drug Awareness Program Banners Lodge Specific Banners Community $$ Raised Projects & Awards More Florida Chambers of Commerce Florida Cities & Municipalities Florida High Schools Coffee Mugs Mission/Vision Cards News Center Florida Elks Media Inquiries Florida Elks News Submit Your Story FEN Archives Grand Lodge Newsletter Business Practices Business Practices Resources Forms Member Contact Info President's Pin Recognition Certificates Therapist Request General Lodge Remittance Lodge Remittance Walkway Bricks Drug Awareness DAP Program Reference FSEA By-laws Community Grants Encyclopedia of Elkdom State Membership Program Membership Development Guide Accident Prevention Lodge Planning Calendar Training & Education Lodge Training Training Triva Elks Training Course Orientation OT Presentations Contests & Awards Americanism Essay Drug Awareness Enrique Camarena Award Hoop Shoot Lodge Bulletin Lodge Scrapbook Ritual Soccer Shoot First Responders VAVS Volunteer Website ©\n    2021 -     2025\n    Florida State Elks Association, Inc. Privacy Policy Terms & Conditions"
    },
    {
      "url": "https://lodge2193.org/event/bingo/",
      "text": "Bingo - Ormond Beach Elks Lodge 2193 SEARCH 285 Wilmette Ave, Ormond Beach secretary@lodge2193.org + 1 (386) 677-7180 Login / Register Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Become a Member Become a Member Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Bingo Home Bingo Open to the public. We start serving food at 5PM. /*! elementor – v3.22.0 – 17-06-2024 */\n.elementor-heading-title{padding:0;margin:0;line-height:1}.elementor-widget-heading .elementor-heading-title[class*=elementor-size-]>a{color:inherit;font-size:inherit;line-height:inherit}.elementor-widget-heading .elementor-heading-title.elementor-size-small{font-size:15px}.elementor-widget-heading .elementor-heading-title.elementor-size-medium{font-size:19px}.elementor-widget-heading .elementor-heading-title.elementor-size-large{font-size:29px}.elementor-widget-heading .elementor-heading-title.elementor-size-xl{font-size:39px}.elementor-widget-heading .elementor-heading-title.elementor-size-xxl{font-size:59px} Bingo Food Menu /*! elementor – v3.22.0 – 17-06-2024 */\n.elementor-widget-image{text-align:center}.elementor-widget-image a{display:inline-block}.elementor-widget-image a img[src$=”.svg”]{width:48px}.elementor-widget-image img{vertical-align:middle;display:inline-block} Hot Dog Hamburger Chicken Tenders Basket of Fries Basket of Onion Rings Canned Soda Bottled Water Jalapeno Poppers Mozzarella Sticks Canned Sodas Bottled Water No outside food or drinks are permitted Related Related Elks Care, Elks Share Links About us Events Terms of Use/Privacy Policy Contact elks@lodge2193.org + 1 (386) 677-7180 285 Wilmette Ave, Ormond Beach, FL 32174 United States of America © All Copyright 2023 by Terra"
    },
    {
      "url": "https://lodge2193.org/become-a-member/",
      "text": "Become a Member - Ormond Beach Elks Lodge 2193 SEARCH 285 Wilmette Ave, Ormond Beach secretary@lodge2193.org + 1 (386) 677-7180 Login / Register Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Become a Member Become a Member Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Become a Member Home Become a Member Fill in the Form to Join Us Become a Member Elks Lodges bring so much more to their communities than just a building, golf course or pool. They are places where neighbors come together, families share meals, and children grow up. Elks invest in their communities through programs that help children grow up healthy and drug-free, meet the needs of today’s veterans, and improve the quality of life. elks@lodge2193.org + 1 386-677-7180 Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Like this: Like Loading... Elks Care, Elks Share Links About us Events Terms of Use/Privacy Policy Contact elks@lodge2193.org + 1 (386) 677-7180 285 Wilmette Ave, Ormond Beach, FL 32174 United States of America © All Copyright 2023 by Terra %d"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://lodge2193.org/enf-fidelity-club/",
      "text": "ENF Fidelity Club - Ormond Beach Elks Lodge 2193 SEARCH 285 Wilmette Ave, Ormond Beach secretary@lodge2193.org + 1 (386) 677-7180 Login / Register Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Become a Member Become a Member Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental ENF Fidelity Club Home ENF Fidelity Club The ENF Fidelity Club The Foundation’s Monthly Giving Program The easiest way to support the ENF all year round! Do you contribute to the Elks National Foundation often? What if you could donate without having to think about it? Well, you can! Enroll today and become a member of the Fidelity Club—the ENF’s monthly giving program. Why Join the Fidelity Club? Ease: The ENF Fidelity Club recognizes automatic, regularly scheduled donations through your bank account or credit card. These donations can occur monthly (minimum $5) or quarterly (minimum $15). Eco-Friendly: Save a tree and save time with paperless donations! Convenience: No need to purchase stamps or mail a check. It takes just five minutes to sign up, and you’re good to go! Flexibility: You can increase, modify or cancel your gift at any time. Security: It’s safe, reliable and allows the ENF to spend less time on administration and more time on our charitable mission. Ready to Join? Becoming a member of the Fidelity Club is simple! Enroll online at enf.elks.org/recurring and start your gift today! If you prefer to sign up through the mail, click here for an enrollment form. Questions? Contact enf@elks.org or 773/755-4728 for additional information about starting a recurring gift and joining the ENF Fidelity Club. Already a member? If you have an active recurring gift agreement with the ENF, you have automatically been enrolled in the ENF Fidelity Club! Click here to learn more about your recurring gift. Designate Your Gift A designated gift directly supports the ENF program you select. You can choose to designate your gift to one program or select all programs and make an immediate difference in the lives of youth, veterans and Elks communities. Selecting the ENF Endowment Fund means your donation will be invested in a permanent fund where its interest will be distributed over time, ensuring the ongoing success of the ENF. What are the Benefits? The longer you are a member of the Fidelity Club, the more benefits you’ll receive! Fidelity Club Sticker: Following your first recurring gift, you’ll receive a special Fidelity Club sticker for your membership card, and your name will appear in the online Fidelity Club Honor Roll . At the end of each calendar year, you’ll receive a new sticker with your annual statement. Fidelity Club Pin: Once you’ve made 12 recurring gifts, you’ll receive the ENF Fidelity Pin! Pin Attachments: Each time you reach an additional benchmark—starting at 25 recurring gifts—you’ll receive a pin attachment to wear with your Fidelity pin. Featured Fidelity Club Donors The Muns are the Ones for Fidelity Club Team Ingraham: The ENF’s Maine Squeeze “You pay your bills every month because you have to, but you can give to the ENF every month because you WANT to.”—Matthew Holmy, Long Beach, Wash., Lodge No. 1937. “I like knowing that every month, I am helping support the ENF programs that build strong communities. And the recurring gift is easy to budget monthly!”—Melanie Barr, Arvada, Colo., Lodge No. 2278. “It’s so easy. Sometimes life gets busy, and you can forget to give. With the Fidelity Club, it will always be taken care of.”—Thomas Boulch, St. Charles, Mo., Lodge No. 690. “The more you give, the more we can give back to the community. Make it easy on yourself and set up an automatic donation so you never forget to give.”—Rita Mika, Elmhurst, Ill., Lodge No. 1531. Fidelity Club Honor Roll The following members of the ENF Fidelity Club support the ENF on a regular basis via direct debit or recurring credit card donations. Not only are these members supporting an important cause, they’re also helping the ENF reduce administrative expenses. We thank them for their ongoin g commitment! Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Like this: Like Loading... Elks Care, Elks Share Links About us Events Terms of Use/Privacy Policy Contact elks@lodge2193.org + 1 (386) 677-7180 285 Wilmette Ave, Ormond Beach, FL 32174 United States of America © All Copyright 2023 by Terra %d"
    },
    {
      "url": "https://lodge2193.org/facility-rental/",
      "text": "Facility Rental - Ormond Beach Elks Lodge 2193 SEARCH 285 Wilmette Ave, Ormond Beach secretary@lodge2193.org + 1 (386) 677-7180 Login / Register Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Become a Member Become a Member Members Committee Chairpersons ENF Fidelity Club Newsletter Sickness and Distress Events Facility Rental Facility Rental Home Facility Rental Planning an event, consider Ormond Beach Elks Lodge spacious dining room facilities with a mini bar. We also have a lounge area for members and their guests, and a porch for smokers. Contact Michelle Berardi at 407-399-3794 to schedule a tour or inquire about rental rates. Hall Location 285 Wilmette Avenue Ormond Beach, Fl 32174 Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Like this: Like Loading... Elks Care, Elks Share Links About us Events Terms of Use/Privacy Policy Contact elks@lodge2193.org + 1 (386) 677-7180 285 Wilmette Ave, Ormond Beach, FL 32174 United States of America © All Copyright 2023 by Terra %d"
    }
  ]
}