{
  "fuentes": [
    {
      "url": "https://www.looseys.com/contact-us/",
      "email": "contact@looseys.com"
    },
    {
      "url": "https://www.mainstreetdailynews.com/local-living/its-about-the-burgers-not-the-coronavirus-at-looseys_id_3f373ec8-6fb3-11ea-9875-e7f4ddc278b3",
      "email": "editor@mainstreetdailynews.com"
    },
    {
      "url": "https://gainside.com/contact-us/",
      "email": "20info@gainside.com"
    },
    {
      "url": "https://gainside.com/contact-us/",
      "email": "info@gainside.com"
    },
    {
      "url": "http://ldt.looseys.com/looseys-loves/booking/",
      "email": "booking@looseys.com"
    }
  ],
  "mails": [
    "20info@gainside.com",
    "booking@looseys.com",
    "contact@looseys.com",
    "editor@mainstreetdailynews.com",
    "info@gainside.com"
  ],
  "nombre_sitio": "looseys.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.looseys.com/contact-us/",
      "text": "Contact Us – Loosey's Downtown Skip to content Menu Menu At the Bar Contact Us Gift Certificates Events Music Booking Monday Night Trivia Thursday Indie Demolition Night Saturday Karaoke Party Full Calendar Loosey's Downtown Beer | Burgers | Live Music Contact Us Loosey’s 120 SW 1st Avenue Gainesville, Fl 32601 352-672-6465 Contact@Looseys.com Hours & Info 120 SW 1st Avenue Gainesville, FL 32601 352-672-6465 CLOSED TUESDAYS Sun-Mon & Wed-Thur 11am - 10pm + 1hr bar service only (11pm) Fri & Sat 11am - 11pm + 1hr bar service only (12am) Site Map Menu At the Bar Contact Us Gift Certificates Events Music Booking Monday Night Trivia Thursday Indie Demolition Night Saturday Karaoke Party Full Calendar Follow Us Facebook Twitter Instagram Search for: Proudly powered by WordPress | Theme: Argent by Automattic ."
    },
    {
      "url": "https://www.mainstreetdailynews.com/local-living/its-about-the-burgers-not-the-coronavirus-at-looseys_id_3f373ec8-6fb3-11ea-9875-e7f4ddc278b3",
      "text": "It's about the burgers (not the coronavirus) at Loosey's Skip to content Become a Member Become a Member Home Jobs 27 News All News Local News Business Government + Politics Elections Covid-19 Education Health Crime National News Sports All Sports News All Area Teams Athlete of the Week Local Sports Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month All Local Living Events Outdoors History Florida Finds Faith + Inspiration Obituaries Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print edition locations Newspaper Delivery Search Jobs 27 News Local News Business Government + Politics Elections Education Covid-19 Health Crime National News Sports All Area Teams Athlete of the Week Sports Live Stream High School Scoreboard The Prep Zone Local Living Food + Drink Citizens of the Month Events Outdoors Health Faith + Inspiration History Florida Finds Obits Legals Browse Notices Place Notices Video Help Marketplace Cars For Sale Keepsakes About Us Meet the Team Advertise Become A Member Careers Contact E-Edition Print Edition Locations Newspaper Delivery Menu Jobs 27 Events News Sports Obits Cars close Get Our Free Newsletter Local Living It’s about the burgers (not the coronavirus) at Loosey’s Mainstreet Daily News Mar 29, 2020 12:00 pm The patio outside Loosey's is quiet these days, but the bar and restaurant remains open for carryout business. atLoosey's - Downtown Gainesville. Editor’s Note Mainstreet Daily News, in a collaboration with Noel Leroux, founder of Gainesville Downtown , is spotlighting downtown businesses to learn how each one is coping with the ever-evolving COVID-19 situation. Become A Member Mainstreet does not have a paywall, but pavement-pounding journalism is not free. Join your neighbors who make this vital work possible. See Member Benefits Wednesday night is forever Burger Night at Loosey’s – Downtown Gainesville — and no threat of coronavirus is going to stop that! Although patrons couldn’t enjoy the signature, half-pound angus-beef burgers (or Impossible Burgers) while sitting inside the establishment, they gladly picked up their discounted burgers in paper bags at the carryout window on Wednesday night to enjoy at home. “This is my Wednesday night routine,” said a satisfied customer nam ed Norman. “In my opinion, it’s the best burger in town. The sauces are where it’s at!” Another customer suggested “Upgrade to the truffle fries. They’re the best!” Loosey’s, 120 SW 1st Ave., is currently offering takeout Monday through Saturday from 11 a.m.-2 p.m. for lunch and 5-9 p.m. for dinner. The phone number for ordering ahead is 352.672.6465 or through 352delivery.com at 352.225.5555. In addition to build-your-own burgers, the Loosey’s menu includes fish and chips, wings, Italian beef sandwiches and side dishes. (For the full menu, go to http://ldt.looseys.com/menu/ ). “It’s been a lot slower than normal, but we’re rolling with the punches,” said Joy Hughes, whose husband Danny opened the bar and music venue 10 years ago. “We’re really anticipating getting back to normal and dreaming of the next show we’ll have.” Loosey’s is also selling its inventory of bottled beers and liquor. Hughes said the pub is operating with a skeleton crew, but still wants to feed hungry customers. “We’re just trying to be creative and think of ways to keep generating revenue,” she said. About the Author Noel Leroux is the publisher of gainesvilledowntown.com , a website dedicated to covering all things downtown. His mission is to inform, entertain and engage readers with compelling articles about arts, entertainment, and the foodie scene in Gainesville. Share this post: Share on X (Twitter) Share on Facebook Share on Email Tags: By Noel Leroux Downtown Gainesville Mainstreet Daily News View all posts Subscribe Notify of new follow-up comments new replies to my comments Label Name* Email* Website Label Name* Email* Website 0 Comments Oldest Newest Most Voted Inline Feedbacks View all comments Featured Local Savings Sign Up Local news in your inbox. Newsletter Form (#3) Newsletter Email Join Free Got a news tip or story? Let us know Recent Job Openings Senior Environmental Specialist (Land Conservation) Alachua County Board of County Commissioners Pretrial Officer – Pretrial Services Alachua County Board of County Commissioners Conestogas – Night Grill Cook Conestogas Restaurant Part-time Police Officer Santa Fe College Sustainability Manager Alachua County Board of County Commissioners Post A Job | View All Jobs Events Most Read High Springs teenager dies after motorcycle collides with car Certain, Democrats criticize antisemite ‘on pedestal’ UF/IFAS to aid Florida farmers switching to bamboo crops High Springs withdraws criticism of Alachua County Fire Rescue, cites misinformation Gainesville votes to demolish Thelma Boltin Center after price spike Chiefland teen dies in collision with semi Alachua County has 6 official scenic roads, Newnans Lake residents want another High Springs man sentenced to 10 years for child pornography distribution Motor Marketplace 2023 Volvo XC40 B5 AWD Plus Dark Theme $ 34,985 24K Miles Tomlinson Motor Company View Vehicle 2023 GMC Terrain FWD 4dr SLT $ 24,685 41K Miles Tomlinson Motor Company View Vehicle 2021 Jeep Cherokee 80th Anniversary FWD $ 19,985 62K Miles Tomlinson Motor Company View Vehicle 1 2 3 … 69 Next » View All Inventory Member-supported Mainstreet Daily News keeps you informed about news, sports and events, so you can stay safe, cast informed votes, and be a better neighbor in Alachua County and the surrounding area mainstreetdailynews.com 100 NW 76th Drive #2 Gainesville, FL 32607 Phone: 352-313-3150 Email: editor@mainstreetdailynews.com Discussion and Submission Guidelines Terms of Use Privacy Policy Contest Rules Cookie Notice 2024 Community Impact Report Public Notice Certification X Get Our Daily Newsletter Local news delivered right to your inbox Mobil Modal Newsletter Form Subscribe Email Submit Become a Member! Mainstreet does not have a paywall, but journalism is not free. Join your neighbors who make this work possible. See Member Benefits close arrow-circle-o-down chevron-left chevron-right facebook-square angle-down ellipsis-v instagram square-x-twitter cross menu wpDiscuz Insert"
    },
    {
      "url": "https://gainside.com/contact-us/",
      "text": "Contact Us | Managed IT Services | GainSide Phone: (833) THE-GAIN / (833) 843-4246 Why GainSide Areas Served Pricing Our IT Solutions Managed IT Services IT Support 24/7 Virtual CIO Services IT Compliance Simplified IT Security Solutions Endpoint Protection Managed Firewall Penetration Testing Vulnerability Scanning Password Management Managed XDR Managed Detection and Response Email Security Device Security Web Filtering Security Awareness Training Data Management Solutions Cloud Backup Solutions Microsoft 365 Backup Managed Cloud Hosting Apple Device Management Who We Serve Resources Contact Us Contact Us Contact Us How Can We Help You? Have an IT issue? Need support or just want to ask a question? We’re here to help with any IT questions or support you need. Get in touch today, and we’ll take care of the rest. Contact Info Address : 5237 Summerlin Commons Blvd, Suite 312, Fort Myers, FL 33907 Phone : (833) THE-GAIN Email : info@gainside.com Check Out Our IT Services Take a look at what we offer and see how we can help your business Managed IT Services Get 24/7 IT support and management to keep things running smoothly. IT Security Solutions Keep your business protected from cyber threats with endpoint protection, email security and more. Data Management & Backup Solutions Keep your data safe with cloud backup, hosting and recovery options. Frequently Asked Questions How do I get in touch with GainSide? You can contact us by phone at (833) THE-GAIN, via email, or simply fill out the contact form on this page. We’ll get back to you as soon as possible. What services do you offer? We provide managed IT services, IT security solutions, and data management & backup. If you need help with anything IT-related, we’re here to assist ! How fast will you respond to my inquiry? We strive to respond to all inquiries as quickly as possible. If it’s urgent, feel free to call us directly. Do you provide IT support for small businesses? Yes, we specialize in helping small businesses with their IT needs. Whether you need ongoing IT support or help with a specific project, we’re here to make IT easier for you. Can you help with cybersecurity? Absolutely! Our IT security solutions are designed to protect your business from cyber threats, including endpoint protection and email security. Do you offer support for businesses outside of Florida? Yes, while we’re based in Fort Myers, FL, we provide IT support to businesses across the U.S. We can support both local and remote teams. How can I get started with GainSide? Simply reach out via the contact form, give us a call, or email us to set up a consultation. We’ll talk through your IT needs and get you started with the right solutions. With over 30 years of industry experience, we’ve been helping businesses protect their data and avoid cyber threats with simple, affordable IT and cybersecurity services. Our mission is to make your security as high-level as possible, so you can focus on running your business. Follow Follow Sitemap Home IT Solutions Managed IT IT Security Data Management & Backup Who We Serve Why Gainside Resources Pricing Contact Us Contact Us  (833) THE-GAIN  info@gainside.com Copyright © 2025 GainSide . All Rights Reserved. Privacy Policy Privacy Policy Copyright © 2024 Gainside . All Rights Reserved. Stress-Free IT Solutions GainSide delivers flexible managed IT solutions that make your day-to-day operations easier. Learn more about our IT Solutions. Explore Our Solutions IT Security Solutions - Endpoint Protection - Managed Firewall - Penetration Testing - Vulnerability Scanning - Password Management - Managed XDR - Managed Detection & Response - Email Security - Device Security - Web Filtering - Security Awareness Training Managed IT Services - IT Support 24/7 - Virtual CIO Services - IT Compliance Services Data Management Solutions - Cloud Backup Solutions - Microsoft 365 & Google Workspace Backup - Managed Cloud Hosting - Apple Device Management × Book a Consultation"
    },
    {
      "url": "http://ldt.looseys.com/looseys-loves/booking/",
      "text": "Booking – Loosey's Downtown Skip to content Menu Menu At the Bar Contact Us Gift Certificates Events Music Booking Monday Night Trivia Thursday Indie Demolition Night Saturday Karaoke Party Full Calendar Loosey's Downtown Beer | Burgers | Live Music Booking BOOKING YOUR BAND Contact form at bottom . Please read over info here before contacting us. Loosey’s is known for booking great live music, and we’re always willing to hear what your band has to offer. Please email our booking agent at booking@looseys.com or fill out the contact form below. We book bands for Thursdays, Fridays, and Sundays usually. But arrangements can sometimes be made for other nights. We usually give 100% of the door collections to the bands, unless the show is booked as a benefit and other arrangements are made. You suggest the cover and we hold right to veto. We also have facility to sell tickets online, but this service charges fees . TIPS AND TRICKS When you contact us to book a show, have a date or a few dates already picked out. We book Approximately 45 days in advance, so please keep that in mind when selecting dates. If you’re from out of town, it helps to have one or two local ‘anchor’ bands lined up. We can help making contact or confirming bands if you need help. Most of our shows are 21+, but we make some exceptions. Please be clear if your audience is <21. As for under 18, we leave it to our door guys to make exceptions to our age requirements. Don’t change the line-up or dates on us too often once your booking is confirmed. We’re gun shy about bookings falling apart. Contact us as soon as you know a change is happening. We are all about marketing your show to our audience. We do posters, Facebook events, social media promos, and more. BUT we suggest you get involved and make sure YOUR friends and followers get the word, too. A FEW THINGS TO KNOW There’s no designated loading area, but you can park temporarily near the front of the building to move your gear. There is a parking garage directly across the street, and often street parking and surface parking available within a few blocks. We cannot hold your payout. One of your band members must be present at the end of the night to collect. You are more than welcome to sell your merch on site during your show evening. If you need space to do this, please let us know ahead of time so arrangements can be made. Name (required) Email (required) Name of Band or Act (required) Date Choice 1 (please request dates at least 45 days from today) (required) Date Choice 2 (please request dates at least 45 days from today) Date Choice 3 (please request dates at least 45 days from today) Tell us about your act: Send Booking Request Hours & Info 120 SW 1st Avenue Gainesville, FL 32601 352-672-6465 CLOSED TUESDAYS Sun-Mon & Wed-Thur 11am - 10pm + 1hr bar service only (11pm) Fri & Sat 11am - 11pm + 1hr bar service only (12am) Site Map Menu At the Bar Contact Us Gift Certificates Events Music Booking Monday Night Trivia Thursday Indie Demolition Night Saturday Karaoke Party Full Calendar Follow Us Facebook Twitter Instagram Search for: Proudly powered by WordPress | Theme: Argent by Automattic ."
    }
  ]
}