{
  "fuentes": [
    {
      "url": "https://everymilesamemory.com/have-you-ever-wanted-to-live-and-work-in-paradise-we-have-it-waiting-for-you/",
      "email": "contactus@ucsmith.com"
    },
    {
      "url": "https://www.wcjb.com/2025/05/16/hes-got-such-big-heart-community-gives-back-hospitalized-cedar-key-business-owner/",
      "email": "kayla.lewis@wcjb.com"
    },
    {
      "url": "https://www.wcjb.com/2025/05/16/hes-got-such-big-heart-community-gives-back-hospitalized-cedar-key-business-owner/",
      "email": "publicfile@wcjb.com"
    },
    {
      "url": "https://guidetoflorida.com/cedar-key/food-drink/tiki-bar-behind-low-key-hideaway",
      "email": "directory@guidetoflorida.com"
    },
    {
      "url": "https://guidetoflorida.com/cedar-key/food-drink/tiki-bar-behind-low-key-hideaway",
      "email": "name@yoursite.com"
    }
  ],
  "mails": [
    "contactus@ucsmith.com",
    "directory@guidetoflorida.com",
    "kayla.lewis@wcjb.com",
    "name@yoursite.com",
    "publicfile@wcjb.com"
  ],
  "nombre_sitio": "lowkeyhideaway.info",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://everymilesamemory.com/have-you-ever-wanted-to-live-and-work-in-paradise-we-have-it-waiting-for-you/",
      "text": "Have you ever wanted to live and work in paradise? We have it waiting for you! | Every Miles A Memory Pat’s Facebook Cindy’s Facebook Blog Archive ☰ Navigation Every Miles A Memory Wandering Through the Camera Lens Home About Us Blog Past Blogs Galleries Contact Us Search for: Have you ever wanted to live and work in paradise? We have it waiting for you! Posted on May 23, 2015 by Pat Bonish in Cedar Key 46 Comments Cindy and I like to take things that don’t work too well and turn them into well-oiled machines. December of 2009 landed us in Cedar Key with a monumental task in front of us. Turn a run-down motel/rv park into something that people would actually want to visit. Along the way we built a Tiki Bar out of left over items washed up along the shore and bottles we put back with friends and visitors. Looking at it from the outside, you’d have thought it was impossible. But we like a serious challenge and accepted it with open arms. Cedar Key is a diamond in the rough and was the perfect location to allow our artistic talents to bloom. It took us over 5 years to accomplish our goal, and now that we’ve brought it up to our standards, it’s time to move onto something more challenging. (We don’t know what that next challenge is yet, we’ll have to go find it 🙂 ) Call us crazy, call us insane, call us stupid (We’ve been called all of those time and time again) but don’t call us a couple that likes to sit still or isn’t up for a challenge. We tend to pull the rug out from under our own feet every 5-8 years and have done just that continuously since we’ve met. Neither of us can figure out why we do these antics, but we keep doing them, and for us, it keeps life a never ending adventure. So with a very heavy heart and after weeks of second guessing ourselves, we’ve put the Low-Key Hideaway on the real estate market. We’re selling it as a Turn-Key business…… Motel/RV Park/Tiki Bar which includes the liquor license and our Subaru Outback Wagon for you to roll around town in. If you throw in a little bit more, you can have the houseboat. All you need to do is bring your ‘A’ Game to Cedar Key, sit back and enjoy the good life. We’ve done all the hard work for you. The rooms are 100% remodeled and kept up to date with top-notch furnishings, artwork and fixtures. Everything runs like a top, we’re not selling this to run away from anything, if we are to stay, it’ll run this way for years to come. The business has earned numerous awards from Trip Advisor, been rated at the top for 5 years in a row, won business of the year from the Cedar Key Chamber of Commerce, been featured in numerous national and international travel magazines and articles….you name it, we’ve put it on a platter for you. We have a fully functioning Website that receives an enormous amount of traffic. We’re the top rated motel in Cedar Key. We have a very loyal customer base and we still have travel pieces waiting to be aired which will further strengthen our tourism presence. The Tiki Bar is an attraction of its own. It brings visitors from all around the country/world to bathe in the monumental sunsets it offers. It has loads of potential to grow….for the right buyer, the sky is the limit (When you buy it, I will gladly tell you how I’d expand if I were to stay). We’ve always kept it small simply because it’s only the 3 of us running the entire business. Bring on some more employees and you can grow to whatever your potential might be. If you want to live comfortably like we do, then stay this size and just sit back and ride the gravy train. We’ve bought the empty piece of property beside us so your RV’s sites can be more than doubled. All the permitting and hard part has been done for you. What are you waiting for? Florida is booming right now and breaking records each year with its tourism numbers. We’ve built your next business for you, come live and work in paradise. Please do not contact me for details. We have listed the property with Brad Smith whose contact info is listed below. Brad Smith Smith & Assoc. United Country Trenton Phone: 352-221-5256 / 352-463-7770 Email: contactus@ucsmith.com Such an Amazing Sunset with the SS Minnow as a foreground Subject Big Lightning Storm behind the Low-Key Hideaway Secret Garden Tags: Brad Smith , cedar key , Cedar Key Florida , Commercial Real Estate , For Sale , LKH , Low-Key Hideaway , Selling Florida About Pat Bonish Pat Bonish is a photographer, writer and lover of anything artistic.  He is married to the love of his life and works from home in Cedar Key Florida where they run a small Studio. The studio showcases their art, antiques and oddities all while operating as a full bar too View all posts by Pat Bonish → Subscribe Subscribe to our e-mail newsletter to receive updates. Related Posts: ReCedarKey – A Grassroots Coastal Community Manifest Distillery Is It Really That Unique? Dodging a Bullet – Hurricane Irma Hurricane Harvey ← Bonish Photography Housboatin’ On The Suwannee River → 46 Responses to “Have you ever wanted to live and work in paradise? We have it waiting for you!”"
    },
    {
      "url": "https://www.wcjb.com/2025/05/16/hes-got-such-big-heart-community-gives-back-hospitalized-cedar-key-business-owner/",
      "text": "‘He’s got such a big heart’: Community gives back to hospitalized Cedar Key business owner Skip to content Download Apps Newsletter Tell Us Something Good Be Our Guest Meet the Team Advertise with Us Submit Photos and Videos Watch Live Video News First Alert Weather Sports Features Hurricane HQ Telemundo Contact Us Community InvestigateTV Home Watch Live News Gainesville Ocala Lake City State National Crime Politics Education Health Good News Sponsored First Alert Weather Hurricane HQ 24/7 Live Weather Radar Weather Maps Forecast Graphics Tropics Graphics First Alert Explained Weather 101 Sports Florida Gators High School Scholar Athlete Russell Report TV20 Coaches Spotlight Junior College Chomp List Submit Your Sports Photos Español Contact Us News Tips Meet the Team Download Our Apps Advertise Employment Advertise Features Bright Futures One Class at a Time Hometown Heroes Paige's Kitchen Tech Tuesday FL Man Adventures Adopt A Pet Wildlife Wednesday Fitness Community Community Calendar Contests TV20 Newsletter Sign-Up Submit Photos and Videos Tell Us Something Good Programming Schedule Zeam - News Streams Gray DC Bureau NextGen TV Zeam - News Streams InvestigateTV Watching Your Wallet Be Our Guest Sky20 Drone Your Local Chamber Your Local Experts HealthCARES Watch ABC Online PowerNation Circle Country Digital Marketing ‘He’s got such a big heart’: Community gives back to hospitalized Cedar Key business owner ‘He’s got such a big heart’: Community gives back to hospitalized Cedar Key business owner By Kayla Lewis Published : May 16, 2025 at 6:13 PM EDT Email This Link Share on Facebook Share on X (formerly Twitter) Share on Pinterest Share on LinkedIn CEDAR KEY, Fla. (WCJB) - Residents are rallying around one of their own as he undergoes many surgeries due to an unexpected complication during surgery. “I said what the hell man, you haven’t answered in a couple of days, and he said I’m in the hospital, I don’t know if I’ll be alive,‘” shared business owner Patrick Bonish. That’s what the owner of the Lowkey Hideaway and Tiki Bar, Scott Larsen, told Bonish earlier this month when he ended up at the hospital after he felt like his stomach was going to burst, leaving all who know him praying for his recovery. “Scott’s just an incredible person. He’s got such a big heart, and he cares so deeply for not only the people who work for him, but for everyone in this community,” said Laura Gregory, General Manager of Lowkey Hideaway and Tiki Bar. He had a small bowel obstruction and needed emergency surgery. However, his fiancée says that during surgery, his large intestine was accidentally punctured. They switched hospitals when they noticed a foul odor coming from his sutures. They believe this decision saved his life. “When you have a challenge, you break glass and you call in the marines. Well, Scott was kind of like that guy for the island. When the emergency dropped and the disaster hit, Scott did whatever it took to help the people on the island,” shared Cedar Key Mayor Jeff Webb. On Friday, May 16, he had his third surgery to fix the faulty connection between his intestines. During a devastating 2024 hurricane season, Larsen played a key role in helping others prepare their businesses as well as helping rebuild after. “Organized volunteers and donations to help us get drywall in and installed, drywall mudded, and painted. I mean we would probably be months behind and a few thousand dollars more in debt,” shared Hannah Hoffman, owner of Prickly Palm. Larsen was instrumental in getting volunteers back onto the island to help with recovery efforts. “I mean helping everyone. It didn’t matter, never at any point asked who’s going to pay for this? How is this going to be done? He just made sure it got done,” Bonish said. Now, people in the community say they want to rally around him the same way he has for many others. “It’s incredible to have so much love and support coming in,” shared Carrie Sager, Larsen’s fiancée. Sager tells TV20 it’s unclear if he’ll need more surgeries, but he should recover normally; it just might take some time. If you would like to donate to the GoFundMe to help with medical expenses and more, click here. Click here to subscribe to our newsletter. Copyright 2025 WCJB. All rights reserved. Most Read 3 killed after semi-truck does U-turn on Florida Turnpike 9-year-old arrested for bringing loaded gun on school bus in Ocala 16-year-old girl dies after crashing into semi-truck on US Highway 19 Deputies break up fights after hundreds crowd Dixie County bar, investigation underway Columbia County firefighter, wife arrested on child porn, bestiality charges Students walk out in support of Gainesville High School teacher accused of bullying Accident on US Highway 19 claims life of 16-year-old Dixie County student Class action lawsuit against UF will now proceed after the University withdrew its request for an appeal Latest News Girl Scouts reveal new rocky road-inspired cookie Girl Scouts share brand new cookie flavor with TV20 Texas Roadhouse employee threatens boss with scissors after being fired 13-year-old arrested for bringing BB gun to Bradford High School football stadium 8-year-old Motocrosser makes top 4 in Youth Athlete of the Year Man stabbed to death in Ocala, deputies search for suspect Man stabbed to death in Ocala, deputies search for suspect Texas Roadhouse employee threatens boss with scissors after being fired News First Alert Weather Sports Livestream Contests Contact Us WCJB E-News WCJB 6220 NW 43rd Street Gainesville, FL 32653 (352) 377-2020 Public Inspection File publicfile@wcjb.com -  (352) 416-0610 Terms of Service Privacy Policy EEO Statement FCC Applications Advertising Digital Marketing Closed Captioning/Audio Description Click here to learn more about our approach to artificial intelligence. A Gray Local Media Station © 2002-2025"
    },
    {
      "url": "https://guidetoflorida.com/cedar-key/food-drink/tiki-bar-behind-low-key-hideaway",
      "text": "Tiki Bar Behind Low Key Hideaway - Guide to Florida www.guidetoflorida.com - Guide to Florida Search Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Menu Home Best of Florida Best of Florida Results 2025 Best of Florida Results 2024 Best of Florida Results 2023 Best of Florida Results Best of Florida Print Annual 2024 Best of Florida Print Annual 2023 Best of Florida Print Annual Nominate a Business Vote for Your Faves How It Works Campaign Kit Stories Directory Browse Categories Browse Regions Big Bend Coastal Region Bradenton & Sarasota Region Central Panhandle Region Destin & Fort Walton Beach Region Florida Keys Region Greater Fort Lauderdale Region Greater Gainesville Region Greater Miami & Miami Beach Region Greater Orlando Region Heartland Region Jacksonville Metro & Beaches Region Lakeland & Polk County Region Nature Coast Region North Central Countryside Region Ocala, Lake & Sumter Region Palm Beach County Region Panama City & Panama City Beach Region Pensacola & Western Panhandle Region Port St. Lucie & Treasure Coast Region Southwest Florida Coast Region Space Coast Region St. Augustine Historic Coast Region St. Petersburg & Clearwater Peninsula Region Suwannee River Region Tallahassee Region List Your Business About Us Advertise Contact Us Member Login Home United States Florida Cedar Key Food & Drink Tiki Bar Behind Low Key Hideaway Tiki Bar Behind Low Key Hideaway Share 2025 Best of Florida Winner Bars 12050 FL-24, Cedar Key, Florida, 32625 Send Message 352-543-0700 Vote for Us! | Bars Best of Florida Vote Confirmation × Don't show this confirmation for the next 24 hours First Name Last Name Email Address Save my information and enable one-click voting for future votes on this device. I want to receive the Guide to Florida newsletter. Please complete the reCAPTCHA challenge below. Cancel Submit Your Vote! You are voting with the email Click here to switch users. Close Overview Get Directions View On Larger Map Company Name Tiki Bar Behind Low Key Hideaway Visit Website https://www.lowkeyhideaway.info/ Online Social Profiles Phone Number 352-543-0700 Location 12050 FL-24 Cedar Key , Florida , 32625 United States About Tiki Bar Behind Low Key Hideaway Nestled along the serene shores of Cedar Key, the Tiki Bar at Low-Key Hideaway offers an exclusive 21+ retreat where guests can savor handcrafted cocktails while basking in breathtaking waterfront sunsets. With its laid-back ambiance, live music, and panoramic views, it's the quintessential spot to unwind and experience the true essence of Florida's Gulf Coast. × Map View Get Directions Cancel FEATURED LISTINGS! Pink Fire Pizza North Port, FL 34287 Website 9415646151 Loyd Have Mercy Restaurant Titusville, FL 32780 Website 321-223-0107 Bella Napoli Pizzeria & Restaurant Port Charlotte, FL 33980 Website 941-764-8000 READ AND REAP! Saltwater Startups Are Making Waves! Harvest the Fun at Flamingo Gardens! Where to Find the Claws This Season MORE TO EXPLORE! Best of Florida Voting Best Bars in Florida Guide to Alabama Georgia Business Journal Guide to Florida Get the Newsletter! Click to Subscribe Guide to Florida Subscribe Submit Story Idea Contact Us 904-515-5640 Directory List Your Company Advertise Your Company Member Login Browse Categories Best of Florida Vote For Your Favorites Download Campaign Kit Nominate a Business How it Works × Member Login * Email Address * Password Need to retrieve your password? Click Here × Get the Newsletter! The security check was not completed successfully."
    }
  ]
}