{
  "fuentes": [
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://launchpadlive.com.au/contact-us/",
      "email": "launchpad@westernsydney.edu.au"
    },
    {
      "url": "https://www.lpgcbrevard.com/Contact-Us",
      "email": "info@launchpadgolfclub.com"
    },
    {
      "url": "https://www.thelaunchpad.africa/contact-us",
      "email": "info@thelaunchpad.africa"
    },
    {
      "url": "https://www.mint-valley.com/contactus/",
      "email": "golfproshop@ci.longview.wa.us"
    },
    {
      "url": "https://www.mint-valley.com/contactus/",
      "email": "golfproshop@mylongview.com"
    },
    {
      "url": "https://www.startribune.com/launchpad-golf-topgolf-puttery-puttshack-mystic-lake-casino-driving-range/600352343",
      "email": "burl.gilyard@startribune.com"
    },
    {
      "url": "https://www.startribune.com/launchpad-golf-topgolf-puttery-puttshack-mystic-lake-casino-driving-range/600352343",
      "email": "cgonzalez@startribune.com"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "costerfelt@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "ainslee@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "ana@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "catherine@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "costerfelt@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "hannah@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "jai@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "jake@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "joy@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "jz@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "nikki@thelaunchpadteencenter.org"
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "email": "wryn@thelaunchpadteencenter.org"
    },
    {
      "url": "https://maplehillgolf.com/wilson-staff-launch-pad-2-irons/",
      "email": "teeitup@maplehillgolf.com"
    },
    {
      "url": "https://launchclubgolf.com/",
      "email": "jasongillis@launchclubgolf.com"
    }
  ],
  "mails": [
    "ainslee@thelaunchpadteencenter.org",
    "ana@thelaunchpadteencenter.org",
    "burl.gilyard@startribune.com",
    "catherine@thelaunchpadteencenter.org",
    "cgonzalez@startribune.com",
    "costerfelt@thelaunchpadteencenter.org",
    "golfproshop@ci.longview.wa.us",
    "golfproshop@mylongview.com",
    "hannah@thelaunchpadteencenter.org",
    "info@belfairsgolfclub.co.uk",
    "info@launchpadgolfclub.com",
    "info@thelaunchpad.africa",
    "jai@thelaunchpadteencenter.org",
    "jake@thelaunchpadteencenter.org",
    "jasongillis@launchclubgolf.com",
    "joy@thelaunchpadteencenter.org",
    "jz@thelaunchpadteencenter.org",
    "launchpad@westernsydney.edu.au",
    "nikki@thelaunchpadteencenter.org",
    "teeitup@maplehillgolf.com",
    "wryn@thelaunchpadteencenter.org"
  ],
  "nombre_sitio": "lpgcbrevard.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://launchpadlive.com.au/contact-us/",
      "text": "Contact Us - Launch Pad Explore upcoming events and programs Membership Parramatta Incubator Penrith Incubator Become a member Existing Members Who am I? Startup Startup Programs Masterclasses Launch Pad Women & Multicultural Program Side Hustle Series CoLAB Past Accelerators SydWest Global Connections 2021 Be a mentor Urban Futures Program 2020 Urban Futures Program – Expressions of Interest Urban Futures Program – Be a mentor SME Factory of the Future Essentials of Metal Additive Manufacturing Short Course Training Program Micro-credential: Introduction to Manual Composite Layup Techniques Advanced Manufacturing Forum CoLAB India Trade Mission Innovation Districts Challenges Student Venture Makers Innovation Challenge 9 Launch Pad Club Connect Launch Pad Ambassador Program Startup Year at Western Microcredentials Side Hustle Series BUSM 2049: Creative and Innovative Thinkers Bachelor of Entrepreneuship Venture Makers Innovation Challenge Launch Pad Women & Multicultural Program Venture Makers Global Exchange Program in Japan Our Community Our Team & Mentors Our Businesses Be a Mentor, Speaker or Investor Contact Us News Launch Pad Media Case Studies Startup Stories Opinion Events Newsletter Subscribe Subscribe Home Contact Us Contact Us Please use the contact form below or email us. We want to help you with your startup, so drop us a line. Let’s chat Who do you need to get in touch with? Membership Interested in learning more about Launch Pad? Contact our product experts at launchpad@westernsydney.edu.au General Questions Have a general question for us? Contact us at launchpad@westernsydney.edu.au . Fill the form Drop us a line Fill in this form or send us an e-mail with your inquiry. Or come visit us at: Parramatta: Level 1, 6 Hassall St, Parramatta NSW 2150 Penrith: Suite 12, 14 Great Western Highway, Werrington NSW 2747 Home Contact Us Our Team Penrith: Suite 12, 14 Great Western Highway, Werrington NSW 2747 Parramatta: Level 1, 6 Hassall St, Parramatta NSW 2150 Terms & Conditions Privacy Policy Subscribe Follow Us Western Sydney University Copyright © 2004-2021 ABN 53 014 069 881 CRICOS Provider No: 00917K Membership Parramatta Incubator Penrith Incubator Become a member Existing Members Who am I? Startup Startup Programs Masterclasses Launch Pad Women & Multicultural Program Side Hustle Series CoLAB Past Accelerators SydWest Global Connections 2021 Be a mentor Urban Futures Program 2020 Urban Futures Program – Expressions of Interest Urban Futures Program – Be a mentor SME Factory of the Future Essentials of Metal Additive Manufacturing Short Course Training Program Micro-credential: Introduction to Manual Composite Layup Techniques Advanced Manufacturing Forum CoLAB India Trade Mission Innovation Districts Challenges Student Venture Makers Innovation Challenge 9 Launch Pad Club Connect Launch Pad Ambassador Program Startup Year at Western Microcredentials Side Hustle Series BUSM 2049: Creative and Innovative Thinkers Bachelor of Entrepreneuship Venture Makers Innovation Challenge Launch Pad Women & Multicultural Program Venture Makers Global Exchange Program in Japan Our Community Our Team & Mentors Our Businesses Be a Mentor, Speaker or Investor Contact Us News Launch Pad Media Case Studies Startup Stories Opinion Events Newsletter +61 2 9678 7200 Suite 12, Ground Floor, 14 Great Western Highway, Werrington NSW 2747 Subscribe"
    },
    {
      "url": "https://www.lpgcbrevard.com/Contact-Us",
      "text": "Contact Us 321.423.1783 About Our Story About Trackman Photos & Videos Our Golf Club Available Courses Family Fun VG3 Online Play MyBag Trackman Combine TM University FAQs Memberships Individual Corporate / Groups Golf Industry Professionals Seasonal Memberships Events Host an Event Next Golf Tour PAD Sponsored Events Gift Cards Contact Us Member Portal Contact Us Contact Information (321) 423-1783 info@launchpadgolfclub.com 3650 Murrell Rd Suite 116 Rockledge, FL 32955 Follow Us Online! Stay Up to Date with Launch Pad Golf Club Sign Me Up This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. GOLF ON-DEMAND 24x7 2023 Launchpad Golf Club || Powered by USchedule"
    },
    {
      "url": "https://www.thelaunchpad.africa/contact-us",
      "text": "Contact Us | The Launch Pad top of page Home About Us Products & Services Contact Us Gallery More Use tab to navigate through the menu items. Let's Connect Contact Us We're conveniently located just steps away from Gordon's Bay Village Plaza, making it easy for you to reach us. Get in touch, or stop by for a visit. We look forward to connecting with you! ​ OFFICE HOURS Monday - Friday 8h00-17h00 Closed on South African public holidays Register now Address Email Phone Social Media 180 Lancaster Rd, Gordon’s Bay Village Plaza info@thelaunchpad.africa 021 300 5593 © 2023 by The Launch Pad bottom of page"
    },
    {
      "url": "https://www.mint-valley.com/contactus/",
      "text": "Contact Us - Mint Valley Golf Course Skip to primary navigation Skip to main content Mint Valley Golf Course Longview, WA Tee Times Book Online Rates Pass Sales Lessons/Services Instruction/Lessons The First Tee Affiliation First Tee Coaches About About Us Scorecard Club Membership Email Club Area Information Facilities Mint Valley Golf Course Longview, WA Tournaments/Events Tournament & Event Schedule Tournament Flyer Hold A Tournament Moe’s Grill Contact Contact Us Hold A Tournament Book Now Contact Us Mint Valley Golf Course 4002 Pennsylvania St, Longview, WA 98632 Phone 360.442.5442 Open seven days a week year round Summer Pro-Shop Hours: Monday-Sunday: 6am-8pm Moes Grill hours: Thursday-Saturday: 11am- 6pm Join our eClub! Mint Valley Course Email GolfProShop@ci.longview.wa.us Ron Freem and Associates Course Architect 1976 How to Find Us Traveling South on I-5 Take Kelso Exit 40 off I-5. Follow signs to Highway 4. Travel six miles west on Highway 4, turning right on 38th, then left on Pennsylvania. Traveling North on I-5 Take Longview Exit 36 off I-5. Follow signs to Highway 4 west, turning right on 38th, then left on Pennsylvania. Sorry - your browser does not support iframes. Page Footer Contact Us Address : 4002 Pennsylvania St Longview, WA 98632 Email : GolfProShop@mylongview.com Phone : (360) 442-5442 Follow Us Facebook Twitter Mint Valley Golf Course | 4002 Pennsylvania Street | 360-442-5442 Copyright © 2025 Mint Valley Golf Course All Rights Reserved. Powered by Write a review today!"
    },
    {
      "url": "https://www.startribune.com/launchpad-golf-topgolf-puttery-puttshack-mystic-lake-casino-driving-range/600352343",
      "text": "Topgolf competitor LaunchPad Golf coming next to Mystic Lake casino in 2025 Subscribe Log In Minnesota News You Can Use Subscribe The Latest 1 Hour ago Teenager on dirt bike is hit by pickup and killed on Coon Rapids street 1 Hour ago Former Twins stars Torii Hunter, Eddie Guardado enjoying their stints as L.A. Angels coaches 2 Hours ago South Korea says a charter plane carrying South Korean workers will leave Atlanta at Thursday noon 2 Hours ago Prince Harry has tea with his father, King Charles III, in their first meeting in over a year 2 Hours ago Nepal's army tries to restore order as protesters seek former chief justice as interim leader 3 Hours ago 3 fired FBI officials sue Patel, saying he bowed to Trump administration's 'campaign of retribution' 3 Hours ago Twins' James Outman delivers big moments, but Los Angeles Angels get the win with late comeback 4 Hours ago NATO scrambles jets to shoot down Russian drones in Poland, raising fears of war spillover 4 Hours ago Musk loses crown as the world's richest person to Larry Ellison and then snatches it back. 4 Hours ago Man shot to death over small drug debt in St. Paul homeless encampment, charge says 4 Hours ago Jean Havlish, who played professional baseball and was state’s best bowler, dies at age 89 5 Hours ago Qatar digs through the rubble of Israel's attack on Hamas leaders in Doha 5 Hours ago US stocks inch to more records as inflation slows and Oracle soars 5 Hours ago New Orleans mayor pleads not guilty on corruption charges tied to alleged affair 6 Hours ago Harris says leaving reelection decision to Biden was 'recklessness,' but she defends his abilities 6 Hours ago Cannabis shop sues Albert Lea over City Council’s rejection of license 6 Hours ago Rapper D4vd not believed to be involved in death of woman found in his Tesla in L.A. 7 Hours ago Israeli airstrikes on Yemen kill at least 35, Houthi officials say 7 Hours ago Reusse: Which version of Cal will greet P.J. Fleck and the Gophers on Saturday? 7 Hours ago Previous charges, delayed mental health evaluation were missed opportunities in Charlotte stabbing Business Topgolf competitor LaunchPad Golf coming next to Mystic Lake casino in 2025 The driving range-like entertainment venue will complement the 18-hole course already on the casino property. By Burl Gilyard The Minnesota Star Tribune March 19, 2024 at 3:45PM Canadian company LaunchPad Golf is opening its first U.S. location next to Mystic Lake casino. (LaunchPad Golf) Comment Gift Share Listen A Topgolf competitor is coming to the southwest suburbs to provide another game-like driving range to the Twin Cities metro. LaunchPad Golf, a Canadian company, will open its first U.S. location next to Mystic Lake Casino Hotel in Prior Lake, per the Shakopee Mdewakanton Sioux Community (SMSC). It will include a driving range, 40 heated golf suites, two bars and a restaurant. That will add to the casino’s abundance of eating, drinking and recreational draws, including its own 18-hole Meadows at Mystic Lake golf course. Thad Hellman, economic development administrator for the SMSC, said the tribe has been looking for an addition like this as golf is a growing sport in the area. The National Golf Federation released data last year showing 40% of people picking up and swinging golf clubs were not doing it on a golf course but rather at indoor simulators and driving ranges. “It is a huge category,” Hellman said. “We’ve seen a lot of interest in golf across the board.” Plans call for starting construction in late spring or early summer, and the facility should open in late summer or early fall of 2025. Hellman declined to disclose the project budget, and because the site is on tribal sovereign land, SMSC does not need to seek project approvals from the city. Prominent U.S. chain Topgolf — which shares a very similar concept with LaunchPad — has more than 80 locations in the country and plans to open its second metro location in Woodbury. Construction should start this spring on the 68,000-square-foot, three-story project and be completed in late summer or early fall of 2025. Its much-anticipated Brooklyn Center location opened in 2018 on the site of a former 20-screen movie theater, and the company hired 500 people to staff the business. Former Minnesota Vikings defensive end Everson Griffen takes a swing at the then-new TopGolf in Brooklyn Center in 2018. (Carlos Gonzalez/The Minnesota Star Tribune) “I think Topgolf is unique use that attracts visitors from across the Twin Cities metropolitan area,” said Eric Searles, assistant community planning director for Woodbury. Another golf entertainment chain has also recently come to the Twin Cities in Dallas-based Puttery, which touts itself as a modern, indoor version of mini golf. It opened in downtown Minneapolis in July 2023 on the ground floor of the 270 Hennepin apartment tower. The 20,265-square-foot venue includes three nine-hole courses, a bar, lounge, art museum and library. There’s another new putt-putt venue called Puttshack — from the same creators of Topgolf — opening in Minneapolis’ North Loop late this year with a location in Edina’s Southdale Center mall opening this spring. Hellman said the SMSC did not consider any other golf entertainment options at Mystic Lake. “LaunchPad Golf is not your average driving range,” said Barry Ehlert, owner and CEO of LaunchPad Golf, in a statement. “We offer the most innovative technology to elevate your golf experience.” Canadian company LaunchPad Golf is coming to Mystic Lake casino in Prior Lake. (LaunchPad Golf) Share Comment about the writer Burl Gilyard Medtronic/medtech reporter Burl Gilyard is the Star Tribune's medtech reporter. See More More from Business See More Retail Faribault Mill launches sustainable, budget-friendly blanket line Retail Faribault Mill launches sustainable, budget-friendly blanket line The company also is opening a new store at the Galleria. Business Controversial provider opens St. Paul hospital, expanding mental health access Business Controversial provider opens St. Paul hospital, expanding mental health access Approved by Minnesota regulators despite “significant concerns,” the Capitol Park hospital aims to increase access to mental health care, reduce ER burden. Business Cannabis shop sues Albert Lea over City Council’s rejection of license Business Cannabis shop sues Albert Lea over City Council’s rejection of license The owner of the Smoking Tree argues the City Council defied state law when it voted to reject his cannabis license. The city denies his claims. Retail Faribault Mill launches sustainable, budget-friendly blanket line Retail Faribault Mill launches sustainable, budget-friendly blanket line The company also is opening a new store at the Galleria. Company About Us Contact Us Work for Us Donate News in Education Minnesota's Best Strib Varsity Mobile and Tablet Apps Policies and Standards Advertise Get in Touch Advertising Opportunities Media Kit Classifieds Public Notices Obituaries Buy Strib Store Photo Reprints Full Page Archive: 150+ years Back Copies Commercial Reprints Licensing Support Help and Feedback Manage Your Account Newspaper Subscriptions Digital Access eEdition Text to Speech Website Terms of Use Privacy Policy Cookie Settings Accessibility Statement Site Index RSS © 2025 StarTribune. All rights reserved."
    },
    {
      "url": "https://thelaunchpadteencenter.org/our-staff/",
      "text": "Our Staff - Launch Pad Volunteer Employment Contact Home Our Organization Our Story Youth Driven Space Our Staff FAQ For Teens Drop-In, Clubs, and Camps Workforce Development Leadership Academics One-n-Ten Events Special Events Event Calendar Our Supporters Shop Social Hub Blog Podcast Donate Registration/Log In Select Page — Our leaders — Meet the people who give their heart to this cause staff members Courtney Osterfelt Executive Director and Founder Costerfelt@thelaunchpadteencenter.org My name is Courtney Osterfelt and I am the director of The Launch Pad. I have a bachelor’s degree in Education, a Master of Arts degree in Social Change and Community Development, and I have been working with teens for the past 13 years. I founded Women’s Empowerment Breakthrough, a non-profit educational organization for teenage girls in Yavapai County in 2003 and started working on developing The Launch Pad in 2011. I love working with teens because I remember my teenage years being particularly challenging and I want to support teens in becoming who they want to be. I also believe teens are powerful people who can inspire and create great change in our community and it is an honor to support them in realizing their own potential. Catherine Robbins Director of Fund Development Catherine@ thelaunchpadteencenter.org Hello, I’m Catherine Robbins, Director of Fund Development for The Launch Pad and mother of three. I hold a Bachelor of Science in Business Administration with a focus in Marketing Management. I am originally from the small mountain town of Felton, California, which is in Santa Cruz County, about 75 miles south of San Francisco. When my husband brought me to Prescott in 2015, I fell in love with this city. Just under one year later, we moved here with our two youngest children. As a parent, I recognize the importance of providing teens with safe places to gather and opportunities to learn life skills that will help them become involved, successful, confident and empowered young adults. I am honored to have the opportunity to take part in the mission of The Launch Pad Teen Center. In my free time I enjoy spending time with family and friends, hiking, kayaking, practicing Yoga, and crafting. Hannah Mailand Director of Operations hannah@thelaunchpadteencenter.org I’m Hannah Mailand, the Operations Director at The Launch Pad. I moved from Colorado to Prescott over 12 years ago and have loved raising my 3 boys here. With a background in bookkeeping and administration, I’ve been lucky to work with several non-profits, fueling my passion for empowering people and making a positive impact. I am happiest working behind the scenes with my laptop and a spreadsheet, but at my core, I’m all about intentional living and connecting with those around me. Beyond my office role, I’ve had a blast working with the teens at TLP, adding an extra layer of excitement to my professional journey. I’m excited to continue the adventure at The Launch Pad, combining my knack for smooth operations with a genuine drive to create positive change. Wryn Capps Deputy Program Director wryn@thelaunchpadteencenter.org My name is Wryn Capps and I am grateful to be our Full Time Program Coordinator. I am from Colorado and have lived here in Prescott since the summer of 2021. I joined TLP in the Spring of 2022. I have a Bachelor of Science in Environmental Education. I’ve worked as a preschool teacher, Park Ranger, summer camp counselor, paraprofessional, and wrangler. But let me tell you, this is by far the most dynamic, engaging, and fulfilling work I’ve ever had the joy of doing! What I love most about working here is witnessing the transformation of teens as they walk through our doors for the very first time, often a bit anxious, and then delighting in their journey as they blossom into their true selves, discover a sense of belonging, and dive into new passions. I am especially passionate about taking them outdoors, whether it’s a trip to the beautiful Granite Creek Park or an exhilarating multi-day river adventure. You would be amazed at how many teens discover a newfound love for insects, plants, and rocks after they see me light up about them! Their innate curiosity is truly inspiring, and being able to nurture that curiosity and encourage them to explore their questions feels nothing short of magical. Outside of work, you can find Ripley and me hiking, hammocking, on the river, creating art, and making meals with my community. I love the town of Prescott and am very appreciative to have found a place to make a positive change in the lives of our youth and their families! I am the person to contact for daily clubs, workshops, adventure trips, summer camps, being a facilitator, and tours! We are excited to see you here. Joy Goff Youth Leadership & Opportunities Director joy@thelaunchpadteencenter.org Hello! My name is Joy Goff. For the past three years, I’ve led our mentorship program at TLP, recruiting and coordinating volunteers to inspire and be inspired by teens. With 15 years in child welfare, including roles in foster care licensing, program direction, and behavioral health case management, I bring a deep passion for supporting young people and families. At The Launch Pad, I oversee our Teen Advisory Council and their Better Together Project, focusing on community impact and civil discourse. I also manage Project Launch, which connects teens with apprenticeship, internship, and employment opportunities in partnership with local businesses. As the on site Kolbe Consultant at TLP, I use the Kolbe A Index to enhance teamwork and personal growth among staff and volunteers. And I assist young people to learn about their strengths and innate talents through the Student Aptitude Quiz. Curious about Kolbe? Check out their website: https://www.kolbe.com At The Launch Pad, I oversee our Teen Advisory Council, a group of motivated and inspired teens who are making a difference in our community and beyond. Check out their last project at: https://bettertogethertalks.com/ Outside of work, I’m a Prescott native, a proud mom, and enjoy exploring the desert southwest with my family. I love art and cherish creating in my free time. Thank you for taking the time to learn about The Launch Pad Teen Center and our vibrant community. I look forward to welcoming you to our space! Kei’Ana Nabor Public Relations & Marketing Coordinator kei’ana@thelaunchpadteencenter.org My name is Kei’Ana Nabor, and I’m the Public Relations and Marketing Coordinator at The Launch Pad Teen Center. I’ve been with The Launch Pad for over two years, and as an Arizona native, I’ve called Prescott home since 2020. I live here with my wonderful wife and our two beautiful dogs. I have a deep passion for working with youth and over a decade of experience in the field. My mission is to empower young people to embrace their true selves, spark creativity, and help them share their stories. Outside of work, I love spending time outdoors, whether I’m at the lake, hiking, or just enjoying nature. If I’m not out spending time with friends, you can find me at home crafting and listening to podcasts. I’m also a musician and love writing and creating music. I make time for Pilates and yoga every week, and one of my favorite things to do is explore local coffee shops and discover new spots around town. Ainslee O’Donnell Wellness Educator & Program Coordinator ainslee@ thelaunchpadteencenter.org Blessings! My name is Ainslee O’Donnell, I am The Launch Pad’s Wellness Educator and Program Coordinator. Previously, I was a Drop-in Facilitator at The Launch Pad for 4 months, I especially enjoyed leading clay work in our 2024 Summer Art Camp. I am a Prescott College Alumni with a Bachelor’s in Counseling Psychology and (2 courses away from) a Master’s in Mental Health Counseling focused on trauma and systems healing. I enjoyed my practicum in White River working with the Fort Apache Indigenous peoples; completing intakes, individual and family therapy, home visits, and creating a teen 2SLGPBTQIA+ group under supervision. As a childhood violence survivor, I live for being a safe person to talk to and resource for support. I am collaborating on enjoyable and educational workshops to support our teens and parents to feel more positive and connected in our community, towards each other, and about themselves. I love spending time with my 7 year old in nature, finding water in our desert, cooking, baking, reading and learning new things. Please email me if you need support, have a topic idea for a workshop, would like to collaborate on a workshop, etc.! Nikki Gallegos Volunteer & Community Events Coordinator nikki@thelaunchpadteencenter.org Hi, my name is Nikki Gallegos and I began my journey at The Launch Pad as an AmeriCorps VISTA and quickly fell in love with everything about this organization. As the Volunteer and Community Events Coordinator, I thrive on connecting with teens and volunteers, bringing them together in meaningful ways. I’m passionate about being a helping hand in the lives of teens, who are in such a fascinating stage of their lives, and enjoy bridging the gap between them and the Prescott locals. I’m currently pursuing degrees in Psychology, Human Development, and Critical and Community Psychology, which fuel my dedication to this work. When I’m not at The Launch Pad, you can find me soaking up live music, exploring anywhere near water, or hitting the road in a fast car with my loyal road dog, Biggie. Jai Blakely Program Coordinator jai@thelaunchpadteencenter.org Hello, I’m Jai Blakeley, and Event Coordinator for The Launch Pad Teen Center!  I am originally from Prescott Valley so it feels great being able to help the community I belong to. I started working at The Launch Pad in 2023 and instantly felt a great  connection here. I love being able to help teens get out of their comfort zones whether that be by learning a new instrument or going on fun adventures! The Launch Pad offers so much and I can not wait to keep working and learning here. Jacob Morris Mentorship Coordinator jake@ thelaunchpadteencenter.org Hello everyone! My name’s Jake Morris and you can find me in the Learning Lab at TLP. I grew up outside of Boulder, Colorado so I spent a lot of time hiking the mountains of the Front Range. Alongside hiking I also had the privilege of being close to nature preserves near my parents house. The critters, hills and fields in these preserves shaped much of my life today! Since then I’ve obtained a college degree, worked many seasonal jobs, and moved out to Prescott. I’ve been here for five years and have loved it! Alongside my love for nature, you could sum me up with a comfy couch, my notebook, and a good book. Justin “JZ” Zych Program Director jz@ thelaunchpadteencenter.org Hi! My name is Justin Zych (“JZ”). With over two decades of experience in empowering youth and fostering their growth, I have been a dedicated leader committed to creating safe and supportive environments for adolescent development. Throughout my career, I have held numerous leadership roles, advocating for holistic approaches to healing, learning and healthy relationships. I hold a Master’s degree in Education Leadership and a Master’s degree in Community Development. I firmly believe in the transformative power of relationships, recognizing them as the cornerstone for building personal resilience and personal development. My philosophy centers on cultivating environments where students feel valued, heard, and empowered to explore their unique strengths and capabilities. Integrating mindfulness and collaborative problem-solving into educational journeys, I am passionate about nurturing the academic, emotional, and social well-being for ALL of our young people. I am dedicated to shaping a brighter future for generations to come by unlocking the potential of youth and guiding them toward a healthy future. Board Members Andrew Baird President I grew up in Prescott and recently moved back with my wife (Brittany, also a Prescott native) and two girls, Noe and Daisy. I received my degree in Civil Engineering from Arizona State and now work locally here in Prescott. In my free time I enjoy playing with my kids, hiking with my wife, coaching youth sports, and playing any outdoor sport that my now 34 year old body will allow me to play, which let’s face it, is now horse shoes. Ryan Glennan Treasurer I grew up in Prescott and moved back to the area in 2007 after college and beginning my career in Phoenix and Milwaukee.  I currently reside here with my wife, Christen, and two girls.  I have a Bachelor’s Degree in Business Administration from Arizona State University and an MBA from the University of Florida.  I’m currently a commercial banker with Foothills Bank.  In my free time I enjoy camping, four wheeling in my Jeep, watching sports, and spending time with my family. Chuck Schwartz Board Member I moved to Prescott from Virginia and have resided here for over 25 years. BA and PhD from Vanderbilt University. Financial advisor with Ameriprise Financial for over 27 years. I Have served on the following Boards of Directors: United Way of Yavapai County, Prescott Sunrise Lions Club, Boys to Men Mentoring of North Central AZ, and The Launch Pad Teen Center. I also enjoy outside activities such as travel, hiking, golf and chocolate (which is more of an inside thing). Cindy Rollins Cindy spent her early childhood moving a lot, attending thirteen schools by age fourteen in multiple countries over three continents. This sparked a love of traveling and interacting with new people but also made her aware of the importance of good self-care practices. Cindy also recognized early on in her life that she was passionate about helping others and has been involved in service work throughout her life such as soup kitchen volunteer, Big Sister youth mentor, Girl Scout leader, nonprofit board member, and youth sports coach.  She currently works as a Child and Adolescent Psychologist and enjoys promoting mental health and emotional wellness in her community. She is an avid reader, a board game nerd, and a Star Trek geek. In her free time, Cindy enjoys traveling, hiking/trailing running, and attending live theater productions Sophia Brown Hi! My name is Sophia Brown, and I joined The Launch Pad board in 2022 in my sophomore year of high school. I am currently a junior at Prescott High School. At PHS I am on Student Council and work as the Community Liaison to create connections between students and the whole Prescott community. As well as being on the board, I am a part of The Launch Pad’s Teen Advisory Council (TAC) and have been working on the Better Together Program for 3 years now. I love the opportunity to help make a difference within our town as a teen leader!  I love being involved in my community and spend a lot of my time volunteering around the Prescott Area as well as gardening and being outdoors with my family. I have been coming to The Launch Pad ever since I was in 6th grade and want to help spread the acceptance and support that I feel every day at The Launch Pad to everyone in Prescott! Asher Lynch Asher Lynch is currently a Sophomore at Tri-City College prep high school. He is an active member of multiple clubs including the International Club and Math Honors as well as being the president of the photography club. He is a member of the Teen Advisory Council at the Launch Pad Teen Center and is currently serving as the community coordinator. He joined the board in August 2024. In his free time, he enjoys running, watching movies, and traveling. Matt Hart Hi there!  I’m Matt Hart and I started working with The Launch Pad at the end of 2023 after doing the Trek for Teens for the first time.  I moved to Prescott in 2006 to attend Prescott College where I got my BA in Educational Use of Adventure & Wilderness. I fell in love with the town and the amazing access to nature through trails and everything that surrounds Prescott.  I’ve worked as a teacher and guide with groups from Kindergarten all the way through college Freshmen using the outdoors as a classroom. I currently work as the Director of Operations for Vivili Hospitality based here in Prescott. Malia Hirasa Malia is a senior at Prescott High school where she will graduate in 2025. At PHS she is involved in student council, interact club, national honor society and the varsity volleyball team. She joined the board of the The Launch Pad in October of 2022 with the goal of becoming more involved in her community after participating in The Launch Pad events as a volunteer. Malia additionally joined the The Launch Pad’s teen advisory council to work towards unifying the tri city area through effective communication. The launch pad has helped her recognize her passion for social justice and has taught her many leadership skills. Malia hopes to go to university out of state and major in political science. In her free time she spends time outdoors and with friends and family. Home Our Story Our Staff Youth Driven Space FAQ Employment Contact Us Camps + Clubs Workforce Development Leadership Academics One-n-Ten Special Events Volunteer Trainings Blog Register Donate Follow Follow Follow Follow Follow Follow Privacy & Donation Policy Copyright © 2023 The Launch Pad | Web Design: Sadie Sarti Design Co. X"
    },
    {
      "url": "https://maplehillgolf.com/wilson-staff-launch-pad-2-irons/",
      "text": "Wilson Staff Launch Pad 2 Irons - Maple Hill Golf SEPTEMBER SAVINGS > 15% OFF Your Order* Code: SAVESEP15 > DETAILS SENIOR WEEK DEALS > VIEW SPECIALS FREE Shipping on Orders $75+ Skip to main content 800-219-1113 teeitup@maplehillgolf.com Gift Cards Book a Tee Time Login or Sign up Contact Toggle menu Search Store Locations Cart Search Golf Clubs Golf Clubs Shop Clubs by Type Drivers Fairway Woods Hybrids Irons Wedges Putters Mens Complete Sets Womens Complete Sets Junior Complete Sets Pre-Owned Shop Clubs by Player Mens Clubs Womens Clubs Junior Clubs Left-Handed Clubs Club Closeouts Full Set Closeouts Driver Closeouts Fairway Wood Closeouts Iron Closeouts Hybrid Closeouts Wedge Closeouts Putter Closeouts Bags Bags Shop Bags by Type Stand Bags Cart Bags Staff | Tour Bags Travel Bags Team Bags Shop Bags by Player Mens Bags Women's Bags Junior Bags Bag Closeouts Balls Balls Shop Balls by Type Novelty Balls Personalized Balls Yellow Balls Colorful Balls Womens Balls View All Balls Ball Closeouts Accessories Accessories Shafts Grips & Club Repair Headcovers Tees Push & Pull Carts Cart Accessories Towels Practice Aids Umbrellas Ball Retrievers Divot Tools & Ball Markers Coolers Gloves Cold Weather Accessories Sunglasses Bag Accessories Club Brushes & Cleaners Just For Fun Off The Course Team Gear Electronics Electronics GPS Watches Handheld GPS Rangefinders Launch Monitors Apparel Apparel Shop Apparel by Type Hats Outerwear Belts Shorts Pants Shirts Socks Shop Apparel by Player Mens Apparel Womens Apparel Junior Apparel Apparel Closeouts Footwear Footwear Men's Shoes Womens Shoes Junior Shoes Footwear Accessories Footwear Closeouts Facilities Facilities Golf Course Golf Membership Driving Range Trackman Simulators Leagues, Lessons, & Deals Junior Programs Custom & Repair Shop 2025 Golf Show Schedule Fitting Events Fitting Center The Launch Kitchen The Kitchen Sync Leader Board Fitting Promotion Virtual Fitting Current Promotions Senior Week Sale Featured Deals Sitewide Discount Golf Season Giveaway Contest Winners Closeouts Gift Cards Login or Sign up Home All Golf Clubs Shop Clubs by Player Left-Handed Clubs Wilson Staff Launch Pad 2 Irons Facebook Email X Linkedin Pinterest MSRP: Was: $771.42 Now: $299.99 - $379.99 (You save ) Wilson Staff Launch Pad 2 Irons SKU: WILSIRONSLAUNCHPAD2-PARENT UPC: Gender: Men Dexterity: Right-Handed Set Composition: Required Choose Options 5-PW+GW (7 Clubs) 5-PW (6 Clubs) Flex: Required Choose Options A Flex Regular Shaft: Required Choose Options Project X Evenflow Graphite Hand: Required Choose Options Right-Handed Cancel Preview Show Preview Current Stock: Quantity: Decrease Quantity of Wilson Staff Launch Pad 2 Irons Increase Quantity of Wilson Staff Launch Pad 2 Irons MSRP: Was: $771.42 Now: $299.99 - $379.99 (You save ) Adding to cart… The item has been added Add to Wish List Create New Wish List Overview The Launch Pad 2 irons bring Super Game Improvement\nperformance to anyone’s game. Featuring a\ngenerative designed turf interaction sole and\ntuned to help players hit the ball cleanly and\nget it airborne more consistently, Launch\nPad 2 irons put the enjoyment back in golf. Features: LEAVE THE GRASS TO THE GREENSKEEPER:  The sole of Launch Pad has been optimized\nto keep the club head out of the grass and\non the ball, preventing chunking and delivering\nunmatched consistency, swing after swing EASY DOES IT:  Weight has been removed and mass lowered,\ncreating an iron that launches the ball higher\nand helps it fly farther with less effort BUILT TO GO THE DISTANCE:  New paint and finishing techniques\nresist scuffing and chipping, for irons\nthat are built to hit long, and last long Condition: New Close × Close × ! OK Cancel SAVINGS CLUB MAPLE HILL GOLF Footer Start teeitup@maplehillgolf.com (616) 538 0290 800-219-1113 Store Locations Maple Hill Golf About us Facilities Special Events VIP Rewards Program Donation Requests Site Credits Employee Login Employment Podcast Equipment & Offers Golf Clubs Bags Apparel Balls Footwear Gift Cards Accessories Customer Service Contact Us My Account Privacy Policy Store Policies Terms of Use Refunds & Returns Price & Play Guarantees Shipping Info Book a Tee Time © 2025 Maple Hill Golf"
    },
    {
      "url": "https://launchclubgolf.com/",
      "text": "Premier Golf Simulator | TrackMan Facility | Maple Grove, MN Skip to content Club Info Membership Book Hourly Event Space Gallery Join Us today Join Us today Main Menu Club Info Membership Book Hourly Event Space Gallery Join Us today Join Us today WELCOME TO LAUNCH CLUB MAPLE GROVE’S  24/7/365 TRACKMAN SIM GOLF FACILITY Book Hourly Become a Member Club info Facebook-f Youtube Instagram Linkedin Getting Started Launch Club is a 24/7, member based, sim golf facility with two completely private 20x20ft rooms, Trackman iO launch monitors, Titliest pro-V1 balls, and the most “grass-like” hitting strip on the market. If you have decided that you can’t wait to start improving your game and want to become a LC member sight unseen, click here . Simply pick the membership type that works for you, download the Launch Club app and call/text 612-759-1610 to set up your first session. After you have learned how everything works, you can access the club independently. For those of you that would like more information, call/text 612-759-1610 to set up a 20 minute demo where you will get a chance to use the technology and see for yourself how everything works. If you decide that membership is not for you, but would like to use the TrackMan studio, click here and follow the process. NOTE: To use Launch Club by the hour you must call/text 612-759-1610 to confirm that a staff member is available to let you in and show you how to use the technology A Day in the Life This video does a nice job of showing you a typical experience at Launch Club. The member uses the Launch Club app and door reader to get in the club independently. He feels free to bring his daughters (12 under are free at LC) because of the private nature of the club. This member is able to use the TrackMan technology and feed his offspring with some PIZZA from the snack bar at Launch Club . What Makes Us Different Launch Club was designed to be different from the typical golf simulator experience. Hover the cursor over the pictures below for a brief description of some features that make Launch Club a superior Twin Cities indoor golfing experience. TrackMan iO Launch Club has the latest Technology from TrackMan, the most trusted launch monitor on the PGA tour. The TrackMan iO has all of the features that have made TrackMan the leader in the field. 24/7/365 Launch Club has an app that allows members to book their time and let themselves in via bluetooth technology. This allows members  to have access to LC 24hrs a day. Private 20'x20' Rooms LC has two 20'x20', 4 walled, completely private bays. Each room is equipped with the largest impact screen on the market. Launch Club Venue LC is an excellent venue for your next private party. Kids don't know how much they like golf until they play TrackMan's video games. Event Space What Our Customers Think Get 24/7/365 Access to Minnesota’s Premier TrackMan Indoor Golf Studio Become a Member Have a question? Call or text and you will get a rapid response! (612)-759-1610 Call or Text Club Info Membership Book Hourly Event Space Gallery Club Info Membership Book Hourly Event Space Gallery 612 759 1610 Email jasongillis@launchclubgolf.com 9650 63rd Ave N Maple Grove, MN 55369 Facebook-f Youtube Linkedin-in Instagram © Copyright 2024 Launch Club Golf. All Rights Reserved. Scroll to Top"
    }
  ]
}