{
  "fuentes": [
    {
      "url": "https://lyric.co.uk/our-home/about-us/history/",
      "email": "enquiries@lyric.co.uk"
    },
    {
      "url": "https://lyric.co.uk/our-home/about-us/history/",
      "email": "tickets@lyric.co.uk"
    },
    {
      "url": "https://thelyrictheatre.co.uk/contact/",
      "email": "boxoffice@nimaxtheatres.com"
    },
    {
      "url": "https://thelyrictheatre.co.uk/contact/",
      "email": "general@nimaxtheatres.com"
    },
    {
      "url": "https://www.lyricbroadway.com/box-office/contact-us/",
      "email": "lyriclounge@atgentertainment.com"
    },
    {
      "url": "https://www.lyricbroadway.com/box-office/contact-us/",
      "email": "u003elyriclounge@atgentertainment.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "adele_traub@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "alex_chisholm@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "alex_smith@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "boardpresident@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "boxoffice@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "courtney_oconnor@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "david_dagostino@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "elizabeth_carsley@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "heather_darrow@lyricstage.com"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "email": "kandyce_whittingham@lyricstage.com"
    },
    {
      "url": "https://www.lyrictheatre.org/contact",
      "email": "patterpost@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/contact",
      "email": "tickets@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/contact",
      "email": "volunteers@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/contact",
      "email": "web@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/leadership",
      "email": "annb@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/leadership",
      "email": "info@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/leadership",
      "email": "marketing@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/leadership",
      "email": "sharonm@lyrictheatre.org"
    },
    {
      "url": "https://www.lyrictheatre.org/leadership",
      "email": "stevea@lyrictheatre.org"
    }
  ],
  "mails": [
    "adele_traub@lyricstage.com",
    "alex_chisholm@lyricstage.com",
    "alex_smith@lyricstage.com",
    "annb@lyrictheatre.org",
    "boardpresident@lyricstage.com",
    "boxoffice@lyricstage.com",
    "boxoffice@nimaxtheatres.com",
    "courtney_oconnor@lyricstage.com",
    "david_dagostino@lyricstage.com",
    "elizabeth_carsley@lyricstage.com",
    "enquiries@lyric.co.uk",
    "general@nimaxtheatres.com",
    "heather_darrow@lyricstage.com",
    "info@lyrictheatre.org",
    "kandyce_whittingham@lyricstage.com",
    "lyriclounge@atgentertainment.com",
    "marketing@lyrictheatre.org",
    "patterpost@lyrictheatre.org",
    "sharonm@lyrictheatre.org",
    "stevea@lyrictheatre.org",
    "tickets@lyric.co.uk",
    "tickets@lyrictheatre.org",
    "u003elyriclounge@atgentertainment.com",
    "volunteers@lyrictheatre.org",
    "web@lyrictheatre.org"
  ],
  "nombre_sitio": "lyrictheatre.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://lyric.co.uk/our-home/about-us/history/",
      "text": "History - Lyric Hammersmith History - Lyric Hammersmith Skip to content Toggle navigation What's on About us What's on Shows Classes About us About us Your visit Eat & Drink Access Hires & Events Lyric Life Partners Support us Support us Individuals Corporate Support Trusts & Foundations Our Supporters Young Lyric Young Lyric Young Lyric Membership Classes Education Resources Education Inclusion Talent Development SPRINGBOARD Opportunities Search Your visit My account Basket Search for: History About us Our Impact Commitment to change School Tickets Application For the Culture Free First Night Team Work with us History Press Partners Lyric Life The Lyric Hammersmith Theatre is one of London‘s leading producing theatres. For 130 years, we have welcomed some of the world’s finest writers, directors, actors and theatre companies to our stage. From Harold Pinter to Tanika Gupta; Sir John Gielgud to Sheila Hancock; Complicite to Frantic Assembly. Find out about the journey the theatre has been on and the people who have made the theatre what it is today by scrolling through the timeline below. Pre 1895 1895 1897 1904 1918 1945 1950s 1960s 1970s 1979 1981 1994 2004 2009 2015 2018 2019 Pre 1895: The first Lyric Plans for a theatre in Hammersmith were first put forward in 1886 by a local businessman, Charles Cordingly and it existed as a much smaller venue from 1888, on Bradmore Grove in Hammersmith. 1895: The New Lyric Opera House In 1895, the Lyric as we now know it was opened with the name: The New Lyric Opera House. The opening of the building was accompanied by an address from the famous actress, Lille Langtry, and was followed by a performance of a one-act play, Dora. 1897: Pantomime The Lyric has been performing Pantomimes since conception. John M. East, the Lyric’s General Manager from 1895, put on at least 10 Pantomimes during his time heading up the buildings programming (until 1904), which he wrote and produced himself. The first recorded Panto was Cinderella in 1897. 1904: ‘The blood and flea pit’ The Lyric suffered following the departure of John. M East in 1904, who produced 361 dramas and performed in over 100 performances during his tenure. At this time the theatre was known locally as ‘the blood and flea pit’. The decline in audience numbers was not Lyric specific, rather an industry wide issue. Pre-war audiences had stopped attending the theatre as much, and had instead turned their attention to the Motion Picture industry. By the time the First World War arrived in 1914, the Lyric was closed more often than open. “After an unsuccessful attempt to revive a stock company following John East’s departure, the Lyric became a receiving house for touring companies.” – John M. East (Jr.) 1918: The Playfair Era John M. East, taken from The Stage (3 Sept. 1970) said: “In 1918, Nigel Playfair took a long lease. In the 1920s, productions at the Lyric made theatrical history. Edith Evans was Millamant in The Way of the World. Marie Tempest played in Midsummer Madness, and Ellen Terry made her final appearance on any stage.” 1945: Company of Four and H. M. Tennent Following the departure of Nigel Playfair in 1932, the Lyric’s output did not decrease, with notable productions from Ballet Rambert. Following the war, ownership changed hands once again. This time the Company of Four (H.M Tennent Company) took over the building, tasked with a brief to produce new plays with new creatives – and to provide jobs for actors returning from overseas following the war. “The most important phase in the Lyric’s history began with J. Baxter Somervillt’s sublease, dating from 1944. For the decade that a Tennent company held an under-lease, the Lyric became Britain’s most exciting experimental theatre. The early work of Peter Brook and a host of other notable productions […] cast lists would fill a “Who’s Who”: Peggy Ashcroft, Richard Burton, Dirk Bogarde, Dora Bryan, Ian Carmichael, John Gielgud, Alec Guiness, Trevor Howard, Flora Robson, Paul Scofield, Dorothy Tutin, Peter Ustinov, Emlyn Williams, Donald Wolfit and Irene Worth.” – John M. East in The Stage, 03 Sept 1970, In 1949, the Lyric’s production of The Seagull – with Paul Scofield - transferred to St James’. The very same year, John Gielgud directs a J.M Barrie and Chrisopher Fry double bill with Richard Burton in the cast. 1950s: The birth of the Royal Exchange & The Birthday Party The 1950s saw many big names perform. Marie Rambert brought her repertoire of ballet, John Gielgud led a season, the London debut of Harold Pinter’s The Birthday Party - a commercial and critical failure. In 1959, the 59 Theatre Company arrived, when they leave, they create the Manchester Royal Exchange. 1960s: The Lyric is sold to the highest bidder In the early to mid-60s, the Lyric went through a renovation. Audiences, especially local audiences, were attending the theatre frequently enough for sustained success. The Shepherd’s Bush Gazette even wrote “[the Lyric is] a must visit in the Metropolis”. But despite the success early in the decade, the Lyric noticed dwindling numbers as the 60s went by. Eventually, the building went up for auction in 1965. Three years later, it was sold. According to some sources, the auction was won by “Mr. Richards”, who brought the theatre for £26,000. But there were complications… the council also thought they’d won the building in the same auction, for the same price. As a result, the Lyric went back on sale and was eventually won by the council for £37,500. Everything pointed towards the closure of the theatre – and in 1969 demolition of the building began… but not the theatre. Interestingly, John M. East’s written piece in The Stage (and other West London papers) was published on 03 Sept.1970. By then, his aim was not to stop the demolition of the building but to save the interior of the theatre, East wrote: “Local Government states ‘the Minister accepts the Inspectors recommendation that he should permit the demolition of the building’. This is subject to the fibrous plasterwork of the auditorium being taken down and stored and where that is impossible, moulds shall be made and stored.” 1970s: A decade long battle The demolition started in 1969 and a local campaign began to save the Lyric. The Vice-Chairman of the Hammersmith Society said “a revived Lyric, because of its acknowledged merits, has a far greater chance of making the new Hammersmith Centre a landmark in London.” The campaign was a success and the Lyric was reopened by The Queen and His Royal Highness, Prince Phillip in 1979. 1979: Bill Thomley and Michael Blakemore The newly reopened Lyric’s first Artistic Director, Bill Thomley, appointed Michael Blakemore as the resident director, Blakemore’s first play being Michael Frayn’s Make and Break. Sadly, due to ill health Bill had to resign from post, leaving Michael to oversee all productions. 1981: Peter James Artistic Director Peter James led the company until 1992. Notable productions included David Freeman’s production of Morte d’Arthur performed in four parts over two evenings and the Olivier award winning production of The House of Bernarda Alba with Glenda Jackson and the debut of Michael Frayn’s Noises Off with Patricia Routledge. The Studio also continued to thrive with a season curated by Anne Lambton. Photo: Donald Cooper/Photostage 1994: Neil Bartlett, Simon Mellor & Sue Storr ‘Our artistic policy was simple; make beautiful shows, with brilliant people - and keep the tickets cheap.’ Neil Bartlett & Simon Mellor. Neil Bartlett became Artistic Director in 1994, along with Simon Mellor as Administrative Producer + Sue Storr as Chief Executive. Bartlett directed productions of classic British plays, foreign classics, which he translated or adapted, and a series of notable Christmas shows, including his adaptation of Charles Dicken’s Oliver Twist and A Christmas Carol. Sue Storr in this period oversaw the development of local partnerships in support of the theatre’s capital development to create new education and rehearsal spaces and to relocate the theatre’s entrance from King Street onto a newly built public Square for West London - Lyric Square. She also worked closely with a number of producing consortia to present a wide range of International work. 2004: David Farr & Jessica Hepburn ‘The Lyric for me was about two things. First it was about working together. The whole spirit of the place was collaboration…Second it was about young people. My incredible Executive Director, Jessica Hepburn, drove a remarkable campaign to bring art & young people in the community into direct contact with work.’ David Farr When Neil Bartlett and Simon Mellor left the Lyric in 2004, David Farr and Jessica Hepburn replaced them. The same year, saw the completion of the Lyric capital project – with the entrance moved to Lyric Square. The refurb created a new ticket office, street level cafe, and rehearsal and workshop spaces. The project was designed by the internationally acclaimed architect, Rick Mather. David Farr invited many companies to collaborate with the Lyric including Vesturport, Kneehigh, Filter, Frantic Assembly, Gecko, Vanishing Point, and individuals like Lemn Sissay, Mark Ravenhill, Sophie Woolley and Lisa Hammond. Notable productions included Metamorphosis, Ramayana, Angels in America, The Bacchae, the stage adaptation of Absolute Beginners, the 50th anniversary revival of Pinter’s The Birthday Party and David Rosenberg’s Hitchcock style thriller Contains Violence, which was performed in windows opposite the theatre with audiences using earphones and binoculars. The theatre also began to establish its reputation for pioneering work with young people across West London, providing pathways into theatre for those from disadvantaged backgrounds. 2009: Sean Holmes & Jessica Hepburn From spring 2009, Sean Holmes took over at the Lyric with Jessica Hepburn continuing as Executive Director until 2015.  Holmes’ reintroduced Panto, other notable productions included The Seagull, Saved,Three Kingdoms, Ghost Stories, Sarah Kane’s Blasted and the Secret Theatre project. 2015: The Reuben Foundation Wing In 2015, Rick Mather Architects completed a new re-development. This expansion allowed the Lyric to build a new cultural & education space – the Reuben Foundation Wing. Sean Holmes’ production of Bugsy Malone reopened the theatre to great critical and audience acclaim. Following the reopening of the theatre, Jessica Hepburn left the Lyric, with Sian Alexander becoming the new Executive Director in October 2015. 2018: Theatre Refurbishment The Frank Matcham Main House is refurbished for the first time in 40 years restoring and redecorating the plasterwork. Plus a full refurbishment and rewiring of the Studio Theatre to create a flexible and fully LED theatre space. 2019: Rachel O’Riordan Rachel O’Riordan joined the Lyric as Artistic Director in February 2019, with her first programmed season beginning in September 2019 with Tanika Gupta’s adaptation of A Doll’s House. Keep in touch Sign up Lyric Hammersmith Theatre, Lyric Square, King St, London W6 0QL Your visit Work with us Accessibility Registered Charity, No. 278518 Registered company No. 1443809 © Copyright 2025, Lyric Hammersmith Theatre, all rights reserved. Designed and built by Cog Design Box Office 020 8741 6850 tickets@lyric.co.uk Open 9am-6pm Lyric Offices 020 8741 6822 enquiries@lyric.co.uk Open 10am-6pm Contact us Facebook Twitter Instagram YouTube Environmental Policy Fundraising Policy Ethics Policy Safeguarding Policy Fundraising Involving Vulnerable People Social Media Community Guidelines Customer Complaints & Feedback Policy Privacy statement Cookies Policy Terms and conditions"
    },
    {
      "url": "https://thelyrictheatre.co.uk/contact/",
      "text": "Contact Us | Lyric Theatre London share facebook twitter youtube instagram What's on About Your Visit Contact Contact For all ticket related enquiries please use the information below. If you have booked your tickets online and have a query, please contact Customer Services on: 0330 333 4815 or boxoffice@nimaxtheatres.com . For all other enquiries please contact us at: Nimax Theatres Limited, 11 Maiden Lane, London WC2E 7NA 020 7395 0780 or general@nimaxtheatres.com Book Tickets Book Now In Person Lyric Theatre,  29 Shaftesbury Avenue, London, W1D 7ES By Phone 0330 333 4812 Groups 0330 333 4817 Access 0330 333 4815 Sign up for our newsletter Get information on our latest news and priority booking on new shows. Thank you for signing up! We appreciate your interest and will be in touch soon. Lyric Theatre Lyric Theatre,  29 Shaftesbury Avenue, London, W1D 7ES Box Office Hours 12pm until the evening show starts (on performance days) Keep in touch facebook twitter youtube instagram Terms and Conditions Privacy Policy Ticketing T&Cs All Rights Reserved | Nimax Theatres"
    },
    {
      "url": "https://www.lyricbroadway.com/box-office/contact-us/",
      "text": "Contact Us | Phone Number & Address | The Lyric Theatre Skip to content Search ​ Search ​ Harry Potter and the Cursed Child Box Office Down Ticketing Information Seating Chart Friday Forty Contact Us Visitors Down Your Visit Food & Drink Access Getting Here About Us Down History Our Team Employment Gallery Newsletter Box Office Home Box Office Contact Us Contact Us We’d love to hear from you! If you’d like to contact us about your tickets, or to purchase by phone, you can find our phone number below. Alternatively, you can find more information about your upcoming visit online, including performance schedules, accessibility and seating. Box Office Operating Hours Monday: 10am – 6pm Tuesday – Saturday: 10am-7pm Sunday: 10am-6pm Tickets will be available 48 hours prior to your performance. You can find directions by visiting our Getting Here page. Ambassador Lounge To upgrade your ticket to include Ambassador Lounge access, contact: ‍ [email protected] Ticketing Inquiries (855) 551-9777 Address Lyric Theatre 214 West 43rd Street New York, NY 10036 Get connected Box Office Ticketing Information Seating Chart Friday Forty Contact Us Visitors Your Visit Food & Drink Access Getting Here About Us History Our Team Employment Gallery Legal Cookies Terms of Use Privacy Policy Terms of Sale Ticket Protection Program © 2025 - ATG Entertainment Holdings, Inc. Manage Cookies"
    },
    {
      "url": "https://www.lyricstage.com/about/staff-board/",
      "text": "Staff & Board - Lyric Stage Boston 243 BOWERY STREET\r\nNEW YORK CITY,\r\n\tNY 10002: What’s On: 2025/26 Season Our Town A Sherlock Carol Penelope Angry, Raucous, and Shamelessly Gorgeous Something Rotten! Tickets Buy Tickets Now Subscriptions Membership Program Single Tickets Seating Chart Lyric For All: Affordable Price Options 30 under $35 Student Tickets Senior Tickets Groups Accessibility Volunteer Ushering Education Overview of Programs Lyric First Page Playwriting Festival Lyric Backstage Senior Year Project/Envy & Hope The Walking Plays Tutorials About Our Anti-Racism and Inclusion Plan Staff & Board Get to Know Courtney O’Connor News Lyric For All: Affordable Price Options Accessibility Our History The History of the Land and Building at 140 Clarendon Street Awards Past Productions Work With Us Auditions Employment & Internships Volunteer Ushering Listen to our Spotify Rent Our Space Contact Us Your Visit COVID-19 Policy and FAQ Contact Us & Hours Parking & Directions Lyric For All: Affordable Price Options Accessibility Take a Virtual Tour Frequently Asked Questions Restaurant Partners Support Us Donate Today Plan a Legacy Gift Become a Corporate Sponsor Sign-Up for Our Newsletter What’s On: 2025/26 Season Our Town A Sherlock Carol Penelope Angry, Raucous, and Shamelessly Gorgeous Something Rotten! Tickets Buy Tickets Now Subscriptions Membership Program Single Tickets Seating Chart Lyric For All: Affordable Price Options 30 under $35 Student Tickets Senior Tickets Groups Accessibility Volunteer Ushering Education Overview of Programs Lyric First Page Playwriting Festival Lyric Backstage Senior Year Project/Envy & Hope The Walking Plays Tutorials About Our Anti-Racism and Inclusion Plan Staff & Board Get to Know Courtney O’Connor News Lyric For All: Affordable Price Options Accessibility Our History The History of the Land and Building at 140 Clarendon Street Awards Past Productions Work With Us Auditions Employment & Internships Volunteer Ushering Listen to our Spotify Rent Our Space Contact Us Your Visit COVID-19 Policy and FAQ Contact Us & Hours Parking & Directions Lyric For All: Affordable Price Options Accessibility Take a Virtual Tour Frequently Asked Questions Restaurant Partners Support Us Donate Today Plan a Legacy Gift Become a Corporate Sponsor Sign-Up for Our Newsletter Staff & Board Home » About » Staff & Board Courtney O’Connor ( Producing Artistic Director ) Lyric Stage Boston Board of Directors Board of Directors Ron Sudol | President Tim Holiner | Vice President Patricia Aronson | Treasurer Sharon Parisi | Clerk Nina Berk Jazzmin G. Bonner Sasha Castroverde Richard Daynard Amanda Eckhoff Glenda Fishman Kristina Lukas David Miller Stuart Rose Elyse Schuerman Daniel Sternberg Janetta Stringfellow Susan Wilchins Advisory Council Laura Conrad Mandel Barry Chaiken, MD Carmen Chan Christopher Cook Wendy Gutterson Martha Hayward Jo-An Heileman Michelle Landers Jo Frances Meyer Baron Pugh Shwetha Ravi Joe Richard Dick Rousseau Janet Spitz Emily Stidsen Ruth Whitney Administration Producing Artistic Director / Courtney O’Connor Managing Director / Alex Chisholm Audience Engagement Manager / Elizabeth Carsley Production Manager / David D’Agostino Director of Marketing / Heather Darrow Community & Artistic Programs Manager / Alexandra Smith General Manager / Adele Nadine Traub Marketing & Digital Content Associate / Kandyce Whittingham Longtime Producing Artistic Director of Lyric Stage, Spiro Veloudos passed away on October 2, 2023. Spiro’s passion and unbridled dedication to the Lyric Stage, its artists, and his remarkable way of telling stories on stage is a legacy that will live long in the city of Boston and in our hearts. Read more about the life of Spiro Veloudos in The Boston Globe. Polly Hogan , Lyric Stage co-founder, passed away on April 15, 2023. Polly was fierce and fearless. Countless Boston theatrical artists trace their first professional opportunity back to Polly and Lyric Stage. Polly was essential in the creation of NEAT (New England Area Theatres), a collective of 12 theatre companies who share a contract with Actors Equity Association. Polly also helped create the Theatre Community Benevolent Fund (TCBF), a resource for artists in crisis. During the first year of the pandemic, TCBF distributed over $250,000 to unemployed artists. The creation of Lyric Stage predated the Huntington Theatre Company and the American Repertory Theatre by almost a decade. After her retirement from the company in 1998, Polly continued to check in on the Lyric Stage as a proud parent. We are committed to a Board that reflects the diversity of our communities and welcomes your inquiries. If you have a passion for the Lyric Stage, would like to make an investment in our future, and are interested in learning about becoming a member of the Lyric Stage Boston’s Board of Directors, contact the Board President . BOX OFFICE & FRONT OF HOUSE BOX OFFICE & HOUSE MANAGERS / Madeline Finkleman , Eva Levin, Caleb Palmer, El Segall, Lindsey Weaver BOX OFFICE & FRONT OF HOUSE ASSISTANTS / Regina Ashley, Carlisle Robbins, Jillian Sullivan ADMINISTRATIVE ASSISTANTS MARKETING ASSOCIATES/ Amanda Li, Jillian Sullivan ADMINISTRATIVE ASSOCIATES/ Angelina DeMonte STAGE MANAGERS 2025/26 Season Charlie Berry* Lisette van den Boogaard Lucas Bryce Dixon* Polly Feliciano* Emma Hunt Thomas M. Kauffman* Nerys Powell* Al Shea DiBiase * Denotes Member Of Actors’ Equity Association MONDAY: CLOSED TUESDAY: CLOSED WEDNESDAY: 12PM-5PM THURSDAY: 12PM-5PM FRIDAY: 12PM-5PM SATURDAY: CLOSED SUNDAY: CLOSED 2025/26 Season Sponsors: Tim & Linda Holiner Diana Humphrey Paul Kastner Sharon & John Parisi Guests are advised that the only authorized sales agents for Lyric Stage Boston tickets are the Lyric Stage Boston Box Office at 617-585-5678 or lyricstage.com. The only authorized ticket vendor services used by Lyric Stage Boston are with ArtsBoston . Tickets purchased from any other sources are not valid. Lyric Stage Boston is not able to honor, replace, or refund invalid tickets. ﻿ JOIN OUR NEWSLETTER PRIVACY 617.585.5678 boxoffice@lyricstage.com 140 Clarendon St, 2nd floor, Boston, MA 02116"
    },
    {
      "url": "https://www.lyrictheatre.org/contact",
      "text": "CONTACT US | Lyric Theatre top of page HOME ABOUT LYRIC THEATRE MISSION STATEMENT LEADERSHIP AND STAFF INTERN PROGRAM VICTORIAN CAROLERS HISTORY AND PREVIOUS SEASONS OUR PATTER POST NEWSLETTER CONTACT US SHOWS The Great Gilbert and Sullivan Sing-Off Digital MainStage Garden of Treasures JOIN US AUDITIONS & PERFORMING BEHIND THE SCENES DONATE MORE Use tab to navigate through the menu items. Contact Us Box Office: tickets@lyrictheatre.org ​ Donor and Patron Information: donorsupport@lyrictheatre.org ​ Volunteering: volunteers@lyrictheatre.org ​ Patter Post Newsletter: patterpost@lyrictheatre.org ​ Notice anything out of date or incorrect on our website or any of our social media? ​ Please contact us at web@lyrictheatre.org and we'll make sure to fix it! Lyric Theatre / The Gilbert and Sullivan Society of San Jose   |   PO Box 6741, San Jose, CA 95150 bottom of page"
    },
    {
      "url": "https://www.lyrictheatre.org/leadership",
      "text": "LEADERSHIP AND STAFF | Lyric Theatre top of page HOME ABOUT LYRIC THEATRE MISSION STATEMENT LEADERSHIP AND STAFF INTERN PROGRAM VICTORIAN CAROLERS HISTORY AND PREVIOUS SEASONS OUR PATTER POST NEWSLETTER CONTACT US SHOWS The Great Gilbert and Sullivan Sing-Off Digital MainStage Garden of Treasures JOIN US AUDITIONS & PERFORMING BEHIND THE SCENES DONATE MORE Use tab to navigate through the menu items. Leadership & Staff Lyric Theatre is committed to expanding our network of Bay Area artists and patrons. At this time we are searching for additional members of our Board of Directors who can bring special skills and underrepresented perspectives to our group. ​ If you are interested in learning more about joining our board, please contact our Nominations Chair, Steve Austin, at stevea@lyrictheatre.org . KIM VAN TRAN Acting President, Board Member kimvt @l yri ctheatre.org Kim calls Lyric Theatre her first acting home, and has savored every brilliant G & S, choir and Broadway show in which she has been an enthusiastic chorus member since 2019. She appreciates the heart of a company that keeps on giving with generosity, ingenuity, musicality and true friendship. Above all, she sees Lyric as an incubator of inclusivity for people of all ages, abilities and backgrounds. Kim believes that the arts remain a haven for people to gather meaning and hope, especially now. When she’s not pontificating for arts organizations’ survival, she sings alto with the San Jose Symphonic Choir and West Bay Opera, and performs in musical cabarets at the Pear Theatre. STEVE AUSTIN Treasurer, Board Member, Venues Manager stevea@lyrictheatre.org Steve first learned about Gilbert & Sullivan by listening to a children's record of G&S favorite songs, and when he arrived at Stanford as a freshman was fortunate to be involved in lighting design for dorm-based theatrical productions. He helped found the Stanford Savoyards and lit their first 4 productions. Joining GSSSJ in 1980 as Master Electrician for Ruddigore, he has since designed the lighting for over 40 Lyric Theatre productions. Steve has served as president (1999-2005), producer for several shows, secretary, and supertitles designer. He is currently our vice-president, manages our relationships with theater venues and the IT committee, and serves as chair of the Organization and Nominations committees. By day he performs business systems analysis. ​ Ask Steve about:  Board candidacy, theater venues, IT, lighting design, company history PAUL ZAWILSKI Secretary, Board Member info@lyrictheatre.org Paul has been a member of Lyric Theatre since singing Lord Mountararat in their 1984 production of Iolanthe. A public school music teacher for 31 years, he continues serving kids and families as an accompanist and organist for the Unitarian Universalists of San Mateo and two high school choirs. Paul has performed and conducted for companies across the Bay Area including Lamplighters, Berkeley Opera, Oakland Opera, SF Opera, Pocket Opera, South Bay Musical Theatre, Tabard Theatre. ​ Ask Paul about: Pianos, vocal coaching, and virtual choirs and orchestras ANN BYLER Board Member, Orchestra Manager annb@lyrictheatre.org Ann is a long time board member and Orchestra Manager, she chaired the Repertoire committee for 7 years, and then the Production Staffing Committee, and was President of the Board from 2013 to 2019.  Ann is a violinist from childhood taught by her violinist father. With 38 years at Lyric Theatre, she loves playing in the orchestra and bringing this beloved music to life. ​ Ask Ann about: Orchestra, Lyric Theatre history CHRIS FRYE Board Member, Box Office & Database Manager info@lyrictheatre.org Originally from Chicago, Chris found Lyric Theatre in the phone book in 1988 and ever since has (sometimes simultaneously) been a performer, an asst. stage manager, a stage manager, an asst. music director, a producer, a production consultant, a Board member and now spends time assigning the audience to their seats. Currently working in the Theatre Department at Foothill College and directs the St. Luke Lutheran Church choir. ​ Ask Chris about: Advice on producing a show, Lyric Theatre history SHARON MARTIN Board Member , Grants and Repertoire Manager sharonm@lyrictheatre.org Sharon has served on the Lyric Board since March 2019. She is a long-time supporter of the Lyric theatre community as a volunteer and performer, and has sung with the Lyric Theatre Victorian Carolers, and is also a past President of the Lyric Board of Directors.  Her late son, Jim Martin, was a performer and print graphics designer for Lyric Theatre for many years.  Her background is in instructional design and project and program management. She is retired from Apple and works part-time for a non-profit educational institute in Cupertino, where she manages grant programs and marketing. In her spare time, she gardens, reads, quilts, sings, and plays with family and friends. ​ Ask Sharon about: grants, repertoire BRUCE HERMAN Board Member , Digital Policy Manager info@l yri ctheatre.org Bruce's love of Gilbert & Sullivan propelled him to join up with Lyric Theater in 1990 as an accompanist for shows. He has worn many hats with the company over the years, including accompanist, treasurer, producer, music director, newsletter editor, and dramaturg. His enjoyment of operetta genre has led him to restore many shows for presentation in our Discovery series. He is currently also the president of the Victor Herbert Renaissance Project, LIVE! Ask Bruce about: The Patter Post, operetta, Victor Herbert Website: http://vhrplive.org/ LARRY TOM Board Member , HR Manager info@lyrictheatre.org Larry caught the performing bug following his 2000 Lyric Theatre debut in The Mikado and has appeared in more than twenty Lyric Theatre productions. Larry is a past President of the Lyric Board of Directors. In addition, he has been involved as producer, set designer, and master carpenter. A former board trustee and president of the Berryessa Union School District in San José, he is now retired from a career in the biotechnology profession. ​ Ask Larry about: Set design, grants TIMOTHY TSANG Board Member , Health Policy Manager info@lyrictheatre.org Tim has been a long-time patron of Lyric Theatre and enjoys Gilbert and Sullivan operettas.  He started to perform as a cast member two years ago in G&S’s “The Sorcerer” after he retired from his Urology practice.  Currently he serves as a volunteer Urology consultant at The Second Opinion, giving free consultations to patients with cancer diagnoses.  He is also a member of the San Jose Symphonic Choir and serves on their board of directors as well.  Besides music, Tim enjoys golf, cooking and traveling. ​ Ask Tim about: Musical theater, operettas ​ DAN ZULEVIC Board Member, Volunteer Corps Manager info@lyrictheatre.org After Dan sold his 25 year-old manufacturing business, he toyed with retirement—but failed!….  Did some consulting. It was fun, but not structured enough…. Meanwhile, his cover band ended a 23-year run of good times and foolishness, leaving its lead vocalist with time and energy to dive into community theater—so Dan has settled on Lyric Theatre as his artistic home. And now he’s our friendly neighborhood Volunteer Manager (and of course, continues to sing in our shows!). DENNIS GAUSHELL Marketing Manager marketing@lyrictheatre.org Dennis debuted in his first performance on stage with Lyric Theatre’s Iolanthe in 2007. Since then he has appeared in 14 chorus roles for Lyric Theatre, Opera San Jose, West Bay Opera, Mission City Opera, and Woodside Community Theater. Highlights include comprimario roles as Street Sweeper in OSJ’s La Boheme, Notary in La Perichole, Franz the Butler in Sound of Music, and Guccio in Gianni Schicchi. Dennis also enjoys hiking, golf, travel, and spending time with wife and families. ​ Ask Dennis about: Marketing KATHLEEN O'BRIEN C ostume Designer info@lyrictheatre.org Kathleen is an artist, costume designer, and seamstress who works with theatre companies all over the South Bay. She is also Lyric Theatre’s costume shop manager. Kathleen loves to bring the excitement of opera to the stage. Kathleen’s credentials include a 2017 costume design award from San Francisco Bay Area Theatre Critic’s Circle, and a 2018 nomination for costume design from Bay Area Theatre. Ask Kathleen about: Costume rentals Lyric Theatre / The Gilbert and Sullivan Society of San Jose   |   PO Box 6741, San Jose, CA 95150 bottom of page"
    }
  ]
}