{
  "fuentes": [
    {
      "url": "https://surgetechak.com/contact/",
      "email": "sgoodwin@surgetechak.com"
    },
    {
      "url": "https://gnv.co.in/GNV/ContactUs",
      "email": "kiruthik@gnvcommodities.com"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "email": "contact@guttercleaningsouthlondon.co.uk"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "email": "quote@guttercleaningsouthlondon.co.uk"
    },
    {
      "url": "https://macdintons.com/vip-tables-special-events/",
      "email": "brandon@macdintons.com"
    },
    {
      "url": "https://macdintons.com/vip-tables-special-events/",
      "email": "vip@macdintons.com"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "email": "jeni@getvows.com"
    },
    {
      "url": "https://www.gnv.it/en/gnv/the-company/gnv-passengers-and-freight",
      "email": "cargo@gnv.it"
    },
    {
      "url": "https://www.gnv.it/en/gnv/the-company/gnv-passengers-and-freight",
      "email": "info@gnv.it"
    }
  ],
  "mails": [
    "brandon@macdintons.com",
    "cargo@gnv.it",
    "contact@guttercleaningsouthlondon.co.uk",
    "info@gnv.it",
    "jeni@getvows.com",
    "kiruthik@gnvcommodities.com",
    "quote@guttercleaningsouthlondon.co.uk",
    "sgoodwin@surgetechak.com",
    "vip@macdintons.com"
  ],
  "nombre_sitio": "macdintons.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://surgetechak.com/contact/",
      "text": "Get in Touch with Surge Tech - Contact Us Today Skip to content HOME MANAGED SERVICES NETWORK SUPPORT AND MONITORING Monitored Security Disaster Recovery HIPAA Compliance IT SERVICES Chief Information Officer Cloud Services VoIP Phone Services Training and Consulting CONTACT Contact Us Contact SurgeTechAK 2023-08-24T10:13:42-08:00 Get In Touch! Complete the form below and a representative from Surge Technologies will be in touch to discuss your organizational needs. Thank you for your message. It has been sent. × There was an error trying to send your message. Please try again later. × Let's talk Phone 907-947-2744 Get In Touch Email sgoodwin@surgetechak.com Get In Touch Contact Info Anchorage Mobile: 907-947-2744 Email: mailto: sgoodwin@surgetechak.com Managed Services Network Support and Monitoring Monitored Security Disaster Recovery HIPAA Compliance IT Services CIO (Chief Information Officer) Cloud Services VoIP Phone Services Training and Consulting © Copyright | Surge Technologies of Alaska | All Rights Reserved | Anchorage Alaska Web Design by Bianca Frank Design Page load link Go to Top"
    },
    {
      "url": "https://gnv.co.in/GNV/ContactUs",
      "text": "GNV | Contact Us Home Who We Are Brands where to buy Contact Us × Modal Header Some text in the modal. Close Get in touch Submit Talk To Us +91-9755098668 +91-7607502222 +91-9600149494 Contact Us kiruthik@gnvcommodities.com Location Survey No. 120-14A, Plot Nos- 1,2,3,4,23,24,25&26, Raj Nagar Layout, Sendrambakkam Village, Chennai - 600052 Opening Hours Monday to Saturday 10:00 am to 7pm Chennai GNV COMMODITIES PVT LTD Prateek Raj Singh(Director) Survey No. 120-14A, Plot Nos- 1,2,3,4,23,24,25&26, Raj Nagar Layout, Sendrambakkam Village, Chennai - 600052 NOIDA GNV COMMODITIES PVT LTD Prateek Raj Singh(Director) C-201, Ground Floor, B Block, Sector 63, Noida, Uttar Pradesh - 201301 MUMBAI GNV COMMODITIES PVT LTD Prateek Raj Singh(Director) F-7, Hatkesh Udyog Nagar, Kashi Mira-Bhayandar Road, Mira Road (East), Thane - 401104 × About Us First and foremost, we are pet lovers. It is this emotion that drives us to bring the best of global pet care to our furry friends here in India. Contact Us Registered Office: K-1/124, LGF, Chittranjan Park, New Delhi-110019 GNV Commodities Pvt Ltd Prateek Raj Singh(Director) Chennai:9755098668 Delhi:7607502222 Mumbai:9600149494 Quick Link Home Who We Are Where to buy Contact Us Legal Terms and Condition Jurisdiction GNV Commodities Pvt.Ltd© 2018"
    },
    {
      "url": "https://guttercleaningsouthlondon.co.uk/contact/",
      "text": "Contact Skip to content Home Services About Blog Contact Get a Quote Get a Quote Main Menu Home Services About Blog Contact Get in touch Connect with Gutter Cleaners South London Contact Us Let’s Discuss Your Gutter Cleaning Needs Reach out to our team for professional gutter cleaning services. Phone 020 8150 7886 Email quote@guttercleaningsouthlondon.co.uk Address South London Follow Us Contact Form First Name Email Message Submit The form has been submitted successfully! There has been some error while submitting the form. Please verify all form fields again. Reliable Gutter Care Swift Solutions for Gutter Maintenance Choose us for quick, efficient gutter cleaning and maintenance services. 020 8150 7886 About Us Gutter Cleaners South London specialises in top-notch gutter cleaning services, preserving your property's integrity and appeal. Menu Home Services About Blog Contact Contact Info A: South London P: 020 8150 7886 E: contact@guttercleaningsouthlondon.co.uk Copyright © 2025 Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny Preferences Save preferences Preferences {title} {title} {title} Manage consent Scroll to Top"
    },
    {
      "url": "https://macdintons.com/vip-tables-special-events/",
      "text": "VIP Tables & Special Events - MacDinton's Irish Pub skip to Main Content Locations SoHo Gainesville Menu Daily Specials Daily Specials Online Order Events Event Calender VIP Tables & Special Events Soccer Schedule Bookings Soho Gainesville Gallery Soho Gallery Gainesville Gallery Work with us Contact Us VIP Tables & Special Events MacDinton’s offers private event services filled with customary cuisine and unique entertainment. Between our indoor and outdoor spaces, MacDinton’s is an accommodating event space for any special occasion. For VIP Table Bookings, email vip@macdintons.com , or call/text 727-295-5714 . For Brandon, VIP Table Bookings, email Brandon@macdintons.com , or call/text (941) 782-7125 . For large or private events, please fill out the form below. Consider celebrating your next private event with a memorable experience for everyone! Customize our space with an array of additional themed entertainment, live music, and personalized decor to commemorate any special occasion. Get in contact with a representative to live it up at MacDinton’s for your next private event! Private Events at MacDintons To enter an Event Request, please fill out the following form. First Name * Last Name Phone # * Your Email * Company * Contact Preference Phone Email Text Your Event Details Nature of this Event (e.g., Social or Corporate) * Event Date * Start Time 12:00am 12:30am 1:00am 1:30am 2:00am 2:30am 3:00am 3:30am 4:00am 4:30am 5:00am 5:30am 6:00am 6:30am 7:00am 7:30am 8:00am 8:30am 9:00am 9:30am 10:00am 10:30am 11:00am 11:30am 12:00pm 12:30pm 1:00pm 1:30pm 2:00pm 2:30pm 3:00pm 3:30pm 4:00pm 4:30pm 5:00pm 5:30pm 6:00pm 6:30pm 7:00pm 7:30pm 8:00pm 8:30pm 9:00pm 9:30pm 10:00pm 10:30pm 11:00pm 11:30pm End Time 12:00am 12:30am 1:00am 1:30am 2:00am 2:30am 3:00am 3:30am 4:00am 4:30am 5:00am 5:30am 6:00am 6:30am 7:00am 7:30am 8:00am 8:30am 9:00am 9:30am 10:00am 10:30am 11:00am 11:30am 12:00pm 12:30pm 1:00pm 1:30pm 2:00pm 2:30pm 3:00pm 3:30pm 4:00pm 4:30pm 5:00pm 5:30pm 6:00pm 6:30pm 7:00pm 7:30pm 8:00pm 8:30pm 9:00pm 9:30pm 10:00pm 10:30pm 11:00pm 11:30pm Number of People * Which MacDinton's location are you interested in (Tampa or Gainesville)? * How did you hear about us? Select an option EventUp Instagram Facebook Venues by Tripleseat Search Engine Email Other he Knot/Wedding Wire Wedding Venue Map aVenue Team Member aVenue Client Referral Vendor Referral Functional Launch leads Email Other Δ MacDinton’s Soho (Tampa) 405 S Howard Ave. Tampa, FL (813) 251-8999 MacDinton’s Gainesville 1728 West University Avenue Gainesville, FL 32603 Facebook Instagram tiktok tiktok CAREERS CONTACT PRIVACY POLICY TERM OF SERVICE ©2025 SunPubs Group. All Rights Reserved. Search Submit Back To Top"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "text": "Contact Us - Get Vows Skip to content Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar New Jersey/New York Area (732) 763-2730 jeni@getvows.com Facebook Twitter Pinterest Flipboard Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar CONTACT US Send Message GET IN TOUCH If you’re interested in our services or have any questions, please reach out to us thru the contact information below or fill out our form on the right. jeni@getvows.com (732) 763-2730 New Jersey/New York Area CONTACT INFO jeni@getvows.com (732) 763-2730 New Jersey/New York Area SOCIAL Facebook Twitter Pinterest Flipboard NEED TO MAKE A PAYMENT? Payment Options Copyright © All Rights Reserved"
    },
    {
      "url": "https://www.gnv.it/en/gnv/the-company/gnv-passengers-and-freight",
      "text": "Ships and Ferries for Passengers and Freight : Company History | GNV My Booking myGNV Departures Calendar GNV Groups Mice Cargo Request Invoice Agencies Area en English Deutsch español français italiano shqip Toggle navigation en de es fr it sq Ferry Offers BEFORE DEPARTURE ON BOARD GNV DESTINATIONS PORTS Info Point Ferry Offers Offers to Sicily Experience Sicily in September from €35 Offers to Sardinia September in Sardinia from €35 BEFORE DEPARTURE Adavantages Payment methods Advance Booking Late Check-Out Priority Disembarking Food Pass Offers Onboard Dining Presale Vehicle insurance Passenger assistance: BOOK SAFE Active Agreements Travel Tips Pregnant Women People with Reduced Mobility Onboard Services Travelling with pets Oversized Luggage Vehicles on board At the port Check-in, embarking and disembarking Maps, Ticket Offices and Ports ON BOARD Accomodations Pullman Seat And Deck Ticket Suites and cabins onboard Food Restaurant Self-service Pizzeria Bar Halal Food Steakhouse Leisure Time Children Internet Free time on board Shopping Prayers' room GNV GNV Fleet GNV Polaris GNV Orion La Suprema Excellent Excelsior Fantastic Splendid Majestic Rhapsody Caroline Russ Elizabeth Russ Forza Tenacia GNV Sirio GNV Auriga GNV Azzurra GNV Cristal GNV Antares GNV Bridge GNV Spirit GNV Sealand Golden Bridge GNV Allegra GNV Atlas GNV Blu The company The MSC Group and GNV GNV: passengers and freight Rapporto di comunità General terms and conditions of purchase for the provision of goods and services Agencies Area Escola Europeas de short sea DESTINATIONS Sicily All destinations Sicily Genoa - Palermo (city) Genova - Palermo (T.Imerese) Civitavecchia - Palermo (city) Civitavecchia - Palermo (Termini Imerese) Naples - Palermo (city) Naples - Palermo (Termini Imerese) Sardinia All destinations Sardinia Civitavecchia - Olbia Genoa - Olbia Genoa - Porto Torres Morocco All destinations Morocco Civitavecchia - Tangier Genoa - Tangier Sète - Tangier Sète - Nador Barcelona - Tangier Barcelona - Nador Genoa - Barcelona Almería - Nador Tunisia All destinations Tunisia Genoa - Tunis Civitavecchia - Tunis Palermo (city) - Tunis Balearic Islands All Balearic destinations Barcelona - Mahón (Minorca) Barcelona - Palma de Mallorca Barcelona - Ibiza Valencia - Ibiza Valencia - Palma de Mallorca Albania All destinations Albania Bari - Durres Algeria Sète-Algiers Sète-Béjaïa PORTS Liguria Genoa Algeria Algiers Béjaïa Balearic Islands Ibiza Mahón (Menorca) Palma de Mallorca Latium Civitavecchia Sicily Palermo Termini Imerese Sardinia Olbia Porto Torres Campania Naples Tunisia Tunis Morocco Nador Tangier France Sète Spain Barcelona Valencia Apulia Bari Albania Durres Info Point Contacts Still book Book with a consultant Information and bookings Claims Site Info General Conditions of Passenger Transportation Rules for use Rights of Passengers Cookie policy Unsubscription Procedure for Promotions ETS (Emission trading system) FAQ GNV Upgrade Documentation for Balearic residents Luggages Travel documents Embarking and check-in Special needs Changes and cancellations Time changes and cancellations myGNV Bookings Food service on board Disembarking Additional services Accommodations on board Vehicles Travelling with pets Travelling with children My Booking myGNV Departures Calendar GNV Groups Mice Cargo Request Invoice Agencies Area Offers to Sicily Experience Sicily in September from €35 Offers to Sardinia September in Sardinia from €35 Adavantages Payment methods Advance Booking Late Check-Out Priority Disembarking Food Pass Offers Onboard Dining Presale Vehicle insurance Passenger assistance: BOOK SAFE Active Agreements Travel Tips Pregnant Women People with Reduced Mobility Onboard Services Travelling with pets Oversized Luggage Vehicles on board At the port Check-in, embarking and disembarking Maps, Ticket Offices and Ports Accomodations Pullman Seat And Deck Ticket Suites and cabins onboard Food Restaurant Self-service Pizzeria Bar Halal Food Steakhouse Leisure Time Children Internet Free time on board Shopping Prayers' room GNV Fleet GNV Polaris GNV Orion La Suprema Excellent Excelsior Fantastic Splendid Majestic Rhapsody Caroline Russ Elizabeth Russ Forza Tenacia GNV Sirio GNV Auriga GNV Azzurra GNV Cristal GNV Antares GNV Bridge GNV Spirit GNV Sealand Golden Bridge GNV Allegra GNV Atlas GNV Blu The company The MSC Group and GNV GNV: passengers and freight Rapporto di comunità General terms and conditions of purchase for the provision of goods and services Agencies Area Escola Europeas de short sea Sicily Genoa - Palermo (city) Genova - Palermo (T.Imerese) Civitavecchia - Palermo (city) Civitavecchia - Palermo (Termini Imerese) Naples - Palermo (city) Naples - Palermo (Termini Imerese) Sardinia Civitavecchia - Olbia Genoa - Olbia Genoa - Porto Torres Morocco Civitavecchia - Tangier Genoa - Tangier Sète - Tangier Sète - Nador Barcelona - Tangier Barcelona - Nador Genoa - Barcelona Almería - Nador Tunisia Genoa - Tunis Civitavecchia - Tunis Palermo (city) - Tunis Balearic Islands Barcelona - Mahón (Minorca) Barcelona - Palma de Mallorca Barcelona - Ibiza Valencia - Ibiza Valencia - Palma de Mallorca Albania Bari - Durres Algeria Sète-Algiers Sète-Béjaïa Liguria Genoa Algeria Algiers Béjaïa Balearic Islands Ibiza Mahón (Menorca) Palma de Mallorca Latium Civitavecchia Sicily Palermo Termini Imerese Sardinia Olbia Porto Torres Campania Naples Tunisia Tunis Morocco Nador Tangier France Sète Spain Barcelona Valencia Apulia Bari Albania Durres Contacts Still book Book with a consultant Information and bookings Claims Site Info General Conditions of Passenger Transportation Rules for use Rights of Passengers Cookie policy Unsubscription Procedure for Promotions ETS (Emission trading system) FAQ GNV Upgrade Documentation for Balearic residents Luggages Travel documents Embarking and check-in Special needs Changes and cancellations Time changes and cancellations myGNV Bookings Food service on board Disembarking Additional services Accommodations on board Vehicles Travelling with pets Travelling with children +39 0102094591 Book your trip with us We are available Mon-Sun 9 am- 8 pm. GNV England +39 0102094591 GNV Italy +39 0102094591 GNV France +33186261018 GNV Spain +34 931842499 GNV Germany +496996759093 GNV Morocco +212531887010 GNV Switzerland +41565880068 GNV Belgium +3232315650 GNV Albania +35552900400 Log in to MyGnv to earn points and get a discount on upcoming trips. Did you forget your password? Don’t have an account? Register Hello, do you know when you wish to go? Select your trip Outward trip only Round Trip GNV GNV Fleet GNV Polaris GNV Orion La Suprema Excellent Excelsior Fantastic Splendid Majestic Rhapsody Caroline Russ Elizabeth Russ Forza Tenacia GNV Sirio GNV Auriga GNV Azzurra GNV Cristal GNV Antares GNV Bridge GNV Spirit GNV Sealand Golden Bridge GNV Allegra GNV Atlas GNV Blu The company The MSC Group and GNV GNV Agents Agencies' Contacts GNV Agents GNV Agents GNV Agents GNV: passengers and freight Rapporto di comunità General terms and conditions of purchase for the provision of goods and services Agencies Area Agencies' Contacts GNV Agents Escola Europeas de short sea At GNV, every moment of the journey matters. Founded in 1992, GNV (Grandi Navi Veloci SpA) is today one of the leading shipping companies in the passenger and freight transport sector. With a fleet of 26 ships and 33 routes, it connects 8 countries: Italy, Spain, France, Albania, Tunisia, Morocco, Algeria, and Malta. Part of the MSC Group, GNV is pursuing an ambitious growth plan, supported by a strategic vision focused on innovation, sustainability, and fleet renewal. Alongside passenger services, GNV has historically promoted the development of the Motorways of the Sea, supporting more sustainable mobility. Maritime freight transport offers an efficient and competitive alternative to road transport, helping reduce road congestion and environmental impact, in line with the company's commitment to increasingly responsible and environmentally conscious logistics solutions. Our History 1992: GNV is founded. 1993: the first ship of the fleet , M/n Majestic, is launched. 1999: GNV – the only one at the time among Italian shipping companies – is listed on the Stock Exchange to finance the development of its fleet, the most modern and innovative in Europe. 2003: GNV arrives in the Maghreb and inaugurates the Genoa – Tunis line. 2004: the Grimaldi family and the Private Equity funds managed by Permira reach an agreement for the further development of the company, with Permira acquiring 80% of Grandi Navi Veloci and Grimaldi Holding retaining 20%. 2006: a new shareholding structure is established; shortly before the end of the year, new partners Investitori Associati, De Agostini, Charme, and part of the management join the share capital of Grandi Navi Veloci. 2007: GNV is chosen as Best Shipping Company by travel agents, receiving the Bit Tourism Award 2007. In June, Ariodante Valeri joins the company as General Manager. 2008: the Genoa – Barcelona – Tangier line is inaugurated, starting connections with Morocco. The same year, an ad hoc service for pet owners is developed and offered to passengers on board the ships La Superba, La Suprema, Fantastic, Excellent, and Majestic. 2009: the Grimaldi family permanently leaves the shareholding structure and management of GNV. The shareholding is divided into Investitori Associati (67.1%), IDeA Co-Investment Fund (20.1%), Charme (9.2%), management (2.1%), other shareholders (1.5%). 2010: Roberto Martinoli becomes CEO of GNV. 2011: on May 2, the Extraordinary Shareholders' Meeting of GNV approves a capital increase reserved for Marinvest Srl, which is allocated a 50% shareholding in GNV. Marinvest joins the shareholding of GNV through a capital increase consisting of a mixed contribution, in cash and three ships (SNAV Toscana, SNAV Lazio, SNAV Sardegna). The new shareholding is divided between Marinvest (50%), Investitori Associati (35%), IDeA (9.2%), Charme (4.6%), and other shareholders (1.2%). 2012: on May 26, GNV inaugurates two new maritime connections between the French port of Sète and the Moroccan ports of Tangier and Nador. On August 2, 2012, the Shareholders' Meeting of GNV approves a capital increase worth 30 million euros; during the meeting, the Board of Directors is also delegated the power to carry out a possible subsequent increase of up to 20 million euros. The Company is thus owned by Marinvest (50%), Investitori Associati (43.40%), IDeA Co-Investment Fund (3.66%), Charme (1.83%), and other shareholders (1.11%). On December 20, Roberto Martinoli is appointed Chairman of the Company; Giovanni Battista Vacchi joins the Board and becomes CEO. 2013: on board GNV, the project \"SailOr, the Ship for Career and Maritime Professions Guidance\" is launched, promoted by the Liguria Region, in collaboration with the Regional School Office and supported by the Nautical Institute San Giorgio and the Hospitality Institutes Bergese and Marco Polo; the training activity involves the University of Genoa, the Italian Academy of the Merchant Marine, the Port Authority-Coast Guard, and the Auxiliary Coast Guard. On December 11, 2013, a capital increase to €169,999,988.97 is approved. The shareholding percentages are divided among Marinvest S.r.l. (57.39%), Investitori Associati (36.97%), Idea Capital Funds s.g.r. S.p.a (3.12%), Charme Investment S.C.A. (1.56%), and others (0.96%). 2014: GNV launches a project to define a new branding strategy during its repositioning process, begun with expansion into foreign markets. The project leads to a redefinition of the logo, thanks to which the Company wins two awards at the Brand Identity GrandPrix. In November, GNV presents on board the ship La Superba the 2014 Community Report, a document providing a detailed and precise analysis, in quantitative and qualitative terms, of the Company's social, economic, environmental, and cultural presence in Genoa, highlighting the deep bond between the Company and the Genoese territory. 2015: in June, GNV presents the new fleet livery to the press in the port of Genoa; the ship Rhapsody joins the fleet, and the Company inaugurates the Bari-Durrës route, GNV's first in the Adriatic. 2016: the company’s ownership changes and Pierfrancesco Vago becomes Chairman of GNV . In June, the Company wins the \"Best Ferry Company\" award at the Italia Travel Awards. 2017: GNV strengthens its offer for Morocco and in June inaugurates the new Barcelona – Nador line. The Company joins the plastic-free campaign for environmental protection promoted by the MAREVIVO association. In May, GNV again wins the \"Best Ferry Company\" award at the Italia Travel Awards. 2018: GNV is the main sponsor of Palermo Italian Capital of Culture 2018, a cross-sector project that, throughout 2018, hosts art, music, theatre, major events, meetings, conferences, and sports in the Sicilian capital. For the third consecutive year, GNV is acclaimed by travel agents and wins the \"Best Ferry Company\" award at the Italia Travel Awards. 2019: in May, GNV resumes operating the historic seasonal Genoa – Olbia line. 2020: on Monday, March 23, the M/n Splendid is delivered to the Liguria Region, ready to welcome the first COVID patients discharged from hospital: from March to June, around 200 people were hosted on board – both those in ‘protected discharge’ from hospitals, for a convalescence period before returning home, and those who had to carry out quarantine in complete isolation. The project was developed together with RINA, in close coordination with the Local Health Authority and Civil Protection; thanks to the professionalism and work of all colleagues, and to the partners who provided products and services, in just a few days GNV managed to implement an important project to counter the COVID emergency. Thanks to this experience, the Company also distinguished itself in terms of safety: in June 2020, GNV became the first shipping company to obtain the RINA Biosafety Trust Certification ; this innovative certification scheme, implemented by RINA, verifies through rigorous periodic audits the application of management systems aimed at preventing the occurrence of bacterial and viral infections, and at containing their spread if detected during the travel experience, in order to ensure the safety of passengers, employees, and crew. 2021: M/n GNV Sealand and the newbuild M/n GNV Bridge join the fleet. In June, GNV opens connections to the Balearic Islands , with routes from and to Valencia and Barcelona to Palma de Mallorca, Ibiza, and Ciutadella, offering single-leg tickets. GNV announces an order for four new ro-pax vessels with GSI shipyards in Canton, China, in collaboration with MSC Group. 2022: GNV expands its fleet with GNV Spirit, strengthening international routes, especially to Spain and Morocco, and opens new offices in Valencia. 2023: The company celebrates 30 years of activity. 2024: GNV Polaris officially joins the fleet, the first of four next-generation vessels with high environmental and passenger comfort standards, operating on the Genoa-Palermo route. 2025: In April, GNV inaugurates the new France (Sète) – Algeria (Algiers and Bejaia) route. In May, the new brand positioning is announced, with the payoff \"Every moment of the journey counts,\" emphasizing service quality, safety, sustainability, and customer care. In July, GNV Orion is baptized in Genoa, operating on the Genoa-Palermo route. The company announces an order for four additional LNG-powered ro-pax vessels. By year-end, GNV Virgo, the first LNG-powered ferry in Italy, is expected, reducing CO₂ emissions by over 50% compared to previous-generation vessels. Grandi Navi Veloci SpA, Via Balleydier 7 - 16149 Genoa - www.gnv.it Chairman: Pierfrancesco Vago Chief Executive Officer: Matteo Catani Passenger Contact Center: 010.2094591 - info@gnv.it Cargo Contact Center: 010.5509339 - cargo@gnv.it myGNV Rewards Earn points with myGNV Reserved area Regulation Info point Information and Booking Claims FAQ Request Invoice Offers Albania offers Morocco offers Sardinia offers Sicily offers Tunisia offers Routes Civitavecchia - Palermo Civitavecchia - Tunis Genoa - Palermo (city) Genoa - Porto Torres Genoa - Tangier Destinations Albania Morocco Sardinia Sicily Balearic Islands Tunisia Explore GNV MSC Group FAQ Need help? Contact us Chiama + 39 010 2094591 Write us an email Follow us on our Social Media Grandi Navi Veloci S.p.A. P.IVA 13217910150 General conditions Cargo: General terms and conditions for transport Cookie Policy RIghts of Passengers Unsubscription Procedure for Promotions Rules for use Privacy Request invoice This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    }
  ]
}