{
  "fuentes": [
    {
      "url": "https://www.macgregor.com/contact-us/contactlist/",
      "email": "macgregor@macgregor.com"
    },
    {
      "url": "https://www.macgregorgolf.com/about-us/",
      "email": "help@macgregorgolf.com"
    },
    {
      "url": "https://www.macgregorminigolf.com/",
      "email": "bryan@macgregorminigolf.com"
    },
    {
      "url": "https://www.macgregorminigolf.com/",
      "email": "lauren@macgregorminigolf.com"
    },
    {
      "url": "https://macgregor-golf.com/pages/contact-macgregor%C2%AE",
      "email": "info@macgregor-golf.co.uk"
    },
    {
      "url": "https://www.macgregorgolf.com/clubs/",
      "email": "help@macgregorgolf.com"
    }
  ],
  "mails": [
    "bryan@macgregorminigolf.com",
    "help@macgregorgolf.com",
    "info@macgregor-golf.co.uk",
    "lauren@macgregorminigolf.com",
    "macgregor@macgregor.com"
  ],
  "nombre_sitio": "macgregorminigolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.macgregor.com/contact-us/contactlist/",
      "text": "ContactList - MacGregor.com This website makes use of cookies to enhance browsing experience and provide additional functionality. Read more OK 中文 日本語 About us Our values Our story Purpose and vision Sourcing Suppliers History MacGregor Executive Team Products Merchant cargo and passengers Offshore oil and gas and renewables Naval logistics and operations Ports & terminals Services Global services MacGregor OnlineStore MacGregor Academy Spare parts Upgrade & damage repairs Download center Fishery and Research Services Intelligent solutions Cargo Boost FibreTrac OnWatch Scout Automated mooring system C-How Simulation Services Offshore wind energy Investors Sustainability MacGregor decarbonisation journey Careers News & insights Contact us About us Our values Our story Purpose and vision Sourcing Suppliers History MacGregor Executive Team Products Merchant cargo and passengers Offshore oil and gas and renewables Naval logistics and operations Ports & terminals Services Global services MacGregor OnlineStore MacGregor Academy Spare parts Upgrade & damage repairs Download center Fishery and Research Services Intelligent solutions Cargo Boost FibreTrac OnWatch Scout Automated mooring system C-How Simulation Services Offshore wind energy Investors Sustainability MacGregor decarbonisation journey Careers News & insights Contact us 中文 日本語 How can we help you? HELP Contact us Media contacts General feedback Products Services Intelligent solutions CONNECT Follow us on Legal notice Privacy statement Cookie policy Norwegian Transparency Act ©MacGregor 2025. All rights reserved."
    },
    {
      "url": "https://www.macgregorgolf.com/about-us/",
      "text": "About Us FREE GROUND SHIPPING ON ORDERS OVER $75 phone: +1 (702) 983-7931 Toggle menu my account Sign in Register Gift Certificates Search Search USD US Dollar Canadian Dollar Cart Search Home Sets Mens Right Hand Sets Mens Left Hand Sets Ladies Sets Clubs Drivers Fairway Woods Hybrids & Driving Irons Irons Wedges Putters Juniors Bags Carts Accessories Heads Only Home Sets Mens Right Hand Sets Mens Left Hand Sets Ladies Sets Clubs Drivers Fairway Woods Hybrids & Driving Irons Irons Wedges Putters Juniors Bags Carts Accessories Heads Only USD US Dollar Canadian Dollar Sign in or Register Gift Certificates Home About Us About Us We can trace our roots all the way back to 1829, with the founders of the company, a pair of English immigrants and expert woodworkers, opening a factory in Dayton OH. The company initially started as a producer of hand carved wooden shoe lasts, pioneering a new lathe-based technique for producing lasts faster and more accurately than anyone around. From 1875 to 1897, the company began a transformation. Two new partners were brough on; John McGregor, an expat from St Andrews, Scotland and a die-hard golfer, as well as Edward Canby, who soon became obsessed with the game. In 1897, the partnership began the manufacture of traditional golf shafts and clubs, one of America's very first club manufacturers. MacGregor clubs proved popular with both professionals and amateurs alike, with hundreds of thousands of clubs being sold around the world. The company emerged from the Great Depression with new ownership and management, who sought the services of the legendary Tommy Armour, who in turn brought his assistant Toney Penna, and tour pros Jimmy Demaret, Byron Nelson and Ben Hogan. This was a formidable team; during the 1950s, MacGregor was the number one club and ball on tour. A period of innovation and growth followed which led the company to its most iconic partnership with Jack Nicklaus. Besides dominating on the course, Mr Nicklaus was heavily involved with the management and direction of the company, and even ended up owning the company and bringing stability after a period of mismanagement. Since conception, MacGregor clubs have been used to win an incredible 59 majors in the hands and bags of all time greats like Jack Nicklaus and Greg Norman. Now, though our pedigree runs nearly two centuries, our approach is thoroughly modern. Uncompromising quality shipped direct to the consumer for simply unbeatable prices. We're here to put the MacGregor back on the map, and truly make it The Greatest Name in Golf once more. × OK Home International Returns Warranty FAQs about us contact us Privacy Policy Terms & Conditions Shipping & Returns Sign up for the latest news and offers Email Address 16 Sunset Way #110, Henderson, NV 89014 +1 (702) 983-7931 help@macgregorgolf.com © 2025 MacGregor Golf \r\n            \r\n             All rights reserved. \r\n             | Sitemap"
    },
    {
      "url": "https://www.macgregorminigolf.com/",
      "text": "Gregor MacGregor's Menu Visit Events Gallery Gift Cards Menu Visit Events Gallery Gift Cards Scroll Gregor MacGregor’s Mini Links & Drinks combines some of Florida’s favorite pastimes: a round of golf, a tasty drink, and beautiful scenery in the heart of historic Fernandina Beach. Enjoy our lush garden putt-putt course, beachy bar, and cool, comfy patio to enjoy with friends. Stop by on your next visit to Fernandina Beach! (That means a rootin’ good time) Woman playing mini gold Shot glass with lemon and pretzel behind About our namesake Just who is Gregor MacGregor? He was quite the scalawag. Read more about our infamous namesake. Old Portrait of Gregor MacGregor ... score and some-odd years ago, a Scottish adventurer named Gregor MacGregor landed in the beach and laid claim to Amelia Island to fly the green flag of the Republic of the Floridas. Thankfully, no inhabitants were kilt in the coup. MacGregor may have putt Amelia under Scottish rule in 1817, but he sure didn’t take it the fairway! MacGregor’s brazen conquest turned out to be a load of haggis before the year’s end and Amelia was soon passed to other victors, but MacGregor became an infamous part of our local history. Today, we chuckle at the memory of this scoundrel Scotsman ; and we welcome you to Fernandina’s newest golf club, Gregor MacGregor’s Mini Links & Drinks. We your whistle after an afternoon of golf! FROZEN DRINKS COCKTAILS FOOD ICE CREAM & FREEZIES Alcoholic Frozen Drinks $9 Add a floater to any drink $4 Mulligan Coconut Rum, Passion Fruit, Pineapple Electric Lemonade Vodka, Blue Curacao, Lemonade Key Lime Colada Coconut Rum, Key Lime Cream Rum Strawberry Jalapeño Margarita Casamigos Jalapeño Tequila, Strawberry Puree Margarita Cointreau Floater Mojito White Rum, Lime & Mint Piña Colada Dark Rum Floater Miami Vice 1/2 Strawberry Daiquiri, 1/2 Piña Colada John Daly Sweet Tea, Vodka & Lemonade Non-Alcoholic Frozen Drinks $6 Arnold Palmer Piña Colada Strawberry Lemonade Cocktails $9 Gin Smash Choose: Blackberry, Strawberry, Mango w/ Gin, Honey, Mint Old Fashioned Bourbon, Orange Peel, Bitters, Sugar Twisted Paloma Grapefruit Tonic, Tequila, Lime Dark n' Stormy Ginger Beer, Dark Rum Snacks $ 5 Jumbo Pretzel add cheese, +2 $ 5 $ 5 Funnel Cake Fries $ 5 $ 4 Fries Add cheese, +2 $ 4 Dogs $ 5 Hot Dog $ 5 $ 6 Chili Cheese Dog w/ Chili, Cheese, Mustard & Onions $ 6 $ 3 Corn Dog w/ Mustard on side $ 3 Slaw Dog w/ Mustard & Slaw $ 6 Reuben Dog w/ Sauerkraut & Spicy Brown Mustard $ 6 Wings $7 Order of 5, served with Celery & Ranch Buffalo Spicy Buffalo Timoti's Blackening Lemon Pepper Gold Naked Ice Cream Cup $5, Waffle Cone Bowl $6.50, Root Beer Float $6.50 Vanilla Bean Chocolate Strawberry Seasonal Specials Freezies A Milkshake Slushy Crossover Peaches n' Cream Cookies n' Cream Key Lime Pie Above table view of popcorn, drink, pretzel, hotdog and golf clubs Woman eating ice cream on the mini golf course Host your next event at MacGregors! We host birthday parties, corporate events, pre-wedding parties, and everything in between. Please fill out the form below and we will get back in touch with you. Name * First Name Last Name Email * Message * Thank you! MacGregors Details Golfing Scottish Greens Island Time About our namesake Our Story 19th Hole Frozen Drinks Menu Snacks Events HOURS Tue-Thur s 12–9 PM Fri-Sat 12–11 PM Sun 12–8 PM ADMISSION Adults $9.50 Kids (13 & Under) $7.50 Under 3 Free with adult admission LOCATION 201 Alachua St Fernandina Beach, FL 32034 CONTACT (904) 844-2967 bryan@macgregorminigolf.com © Copyright 2023, all rights reserved, Gregor MacGregor’s"
    },
    {
      "url": "https://macgregor-golf.com/pages/contact-macgregor%C2%AE",
      "text": "Contact MacGregor Europe for Enquiries | Get in Touch with Us Today – MacGregor Golf Skip to content Facebook X (Twitter) Instagram TikTok Free UK Mainland Delivery On All Orders Over £75 30 Day Returns Shipping available to the EU with Taxes included Clubs Clubs Drivers Fairways Hybrids Driving Irons Irons Wedges Chippers Putters Package Sets Package Sets Mens Package Sets Mens Package Sets ½ Package Sets Package Sets Ladies Package Sets Ladies Package Sets ½ Package Sets Package Sets Junior Package Sets Junior Package Sets Boys Package Sets Girls Package Sets Bags Bags Cart Bags Stand Bags Hybrid Bags Trolleys Accessories Accessories Travel Covers Umbrellas Golf Balls Sale Gift Cards Login Facebook X (Twitter) Instagram TikTok Search Site navigation MacGregor Golf Clubs Clubs Drivers Fairways Hybrids Driving Irons Irons Wedges Chippers Putters Package Sets Package Sets Mens Package Sets ½ Package Sets Package Sets Ladies Package Sets ½ Package Sets Package Sets Junior Package Sets Boys Package Sets Girls Package Sets Bags Bags Cart Bags Stand Bags Hybrid Bags Trolleys Trolleys Accessories Accessories Travel Covers Umbrellas Golf Balls Sale Sale Gift Cards Gift Cards Search Login Cart 0 Site navigation Cart 0 Recently viewed Cart Your cart is currently empty. Not sure where to tee off? Start with these product ranges : Mens Package Sets Golf Bags Accessories Spend £100.00 more to reach free shipping! Shipping Estimate shipping rates United Kingdom --- Afghanistan Åland Islands Albania Algeria Andorra Angola Anguilla Antigua & Barbuda Argentina Armenia Aruba Ascension Island Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bosnia & Herzegovina Botswana Brazil British Indian Ocean Territory British Virgin Islands Brunei Bulgaria Burkina Faso Burundi Cambodia Cameroon Canada Cape Verde Caribbean Netherlands Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos (Keeling) Islands Colombia Comoros Congo - Brazzaville Congo - Kinshasa Cook Islands Costa Rica Croatia Curaçao Cyprus Czechia Côte d’Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Honduras Hong Kong SAR Hungary Iceland India Indonesia Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Kosovo Kuwait Kyrgyzstan Laos Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao SAR Madagascar Malawi Malaysia Maldives Mali Malta Martinique Mauritania Mauritius Mayotte Mexico Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar (Burma) Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Norway Oman Pakistan Palestinian Territories Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Islands Poland Portugal Qatar Réunion Romania Russia Rwanda Samoa San Marino São Tomé & Príncipe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia & South Sandwich Islands South Korea South Sudan Spain Sri Lanka St. Barthélemy St. Helena St. Kitts & Nevis St. Lucia St. Martin St. Pierre & Miquelon St. Vincent & Grenadines Sudan Suriname Svalbard & Jan Mayen Sweden Switzerland Taiwan Tajikistan Tanzania Thailand Timor-Leste Togo Tokelau Tonga Trinidad & Tobago Tristan da Cunha Tunisia Türkiye Turkmenistan Turks & Caicos Islands Tuvalu U.S. Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Vatican City Venezuela Vietnam Wallis & Futuna Western Sahara Yemen Zambia Zimbabwe Country/region Province Postal/ZIP code Calculate Shipping calculated at checkout. Subtotal £0.00 GBP Check out View cart Recently viewed Search Search Clear We use cookies This site uses cookies for better user experience and analytics. Accept Decline Home Menu Search Shop 0 Cart Account Contact Us We'd love to hear from you. Our team is here to help. Get in touch with MacGregor by filling out the email form below. Our team will be in touch within 1-2 Working Days. Name Email Phone number Product Order Press Other Subject Message Send message Send message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Address MacGregor Golf Europe, Unit 3 Target Park, Shawbank Road, Redditch, B98 8YN Email info@macgregor-golf.co.uk Phone +44 (0) 1527 941150 mo – fri: 09:00 – 17:00 Follow us Facebook X (Twitter) Instagram TikTok Customer service 12 months guarantee with all our products as standard Fast Free Shipping Get free UK Mainland shipping on orders of £75 or more Save 10% On Your First Order Join the MacGregor Golf Club and save 10% on your first order Secure payment Your payment information is processed securely Shop Clubs Package Sets Bags Trolleys Accessories Sale Gift Cards Customer Service Contact Us Delivery Returns Policy Warranty Package Set Club Specifications About Us MacGregor History Independent Product Reviews Glossary Terms Privacy Policy Terms of Service Join the MacGregor Golf Club and save 10% on your next order Enter your email Facebook X (Twitter) Instagram TikTok © 2025 MacGregor Golf. Refund policy Privacy policy Terms of service Shipping policy Contact information Country/region Andorra (EUR €) Austria (EUR €) Belgium (EUR €) Bulgaria (BGN лв.) Croatia (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Estonia (EUR €) Finland (EUR €) France (EUR €) Germany (EUR €) Gibraltar (GBP £) Guernsey (GBP £) Hong Kong SAR (HKD $) Hungary (HUF Ft) Ireland (EUR €) Isle of Man (GBP £) Italy (EUR €) Jersey (GBP £) Latvia (EUR €) Lithuania (EUR €) Luxembourg (EUR €) Malta (EUR €) Monaco (EUR €) Netherlands (EUR €) Norway (GBP £) Poland (PLN zł) Portugal (EUR €) Romania (RON Lei) San Marino (EUR €) Slovakia (EUR €) Slovenia (EUR €) Spain (EUR €) Sweden (SEK kr) Switzerland (CHF CHF) Türkiye (GBP £) United Kingdom (GBP £) Vatican City (EUR €) Update country/region American Express Apple Pay Bancontact Diners Club Discover Google Pay iDEAL Klarna Maestro Mastercard PayPal Shop Pay Union Pay Visa Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.macgregorgolf.com/clubs/",
      "text": "Clubs - MacGregor Golf FREE GROUND SHIPPING ON ORDERS OVER $75 phone: +1 (702) 983-7931 Toggle menu my account Sign in Register Gift Certificates Search Search USD US Dollar Canadian Dollar Cart Search Home Sets Mens Right Hand Sets Mens Left Hand Sets Ladies Sets Clubs Drivers Fairway Woods Hybrids & Driving Irons Irons Wedges Putters Juniors Bags Carts Accessories Heads Only Home Sets Mens Right Hand Sets Mens Left Hand Sets Ladies Sets Clubs Drivers Fairway Woods Hybrids & Driving Irons Irons Wedges Putters Juniors Bags Carts Accessories Heads Only USD US Dollar Canadian Dollar Sign in or Register Gift Certificates Clubs Home Clubs Categories Sets Mens Right Hand Sets Mens Left Hand Sets Ladies Sets Clubs Drivers Fairway Woods Hybrids & Driving Irons Irons Wedges Putters Juniors Bags Carts Accessories Heads Only Refine by No filters applied Browse by Price & Other Hide Filters Show Filters Price Update Clear Other Is Featured (2) In Stock (43) Drivers Fairway Woods Hybrids & Driving Irons Irons Wedges Putters 24 of 43 Items 1 2 Next Sort By: Featured Items Newest Items Best Selling A to Z Z to A By Review Price: Ascending Price: Descending MacGregor Golf MacTec X 52°, 56°, 60° Wedge, Mens Right Hand MSRP: Was: Now: $54.99 Choose Options MacGregor Golf MacTec X 52°, 56°, 60° Wedge, Black, Mens Right Hand MSRP: Was: Now: $59.99 Choose Options MacGregor Golf MacTec Driving Iron, Mens Right Hand (Custom Fit) MSRP: $99.99 Was: Now: $60.00 Choose Options Sale MacGregor Golf MacTec X Driving Iron, Graphite  Shaft, Mens Right Hand MSRP: Was: $69.99 Now: $49.99 Choose Options MacGregor Golf Tour Grind Milled Face Golf Wedge, Chrome, Mens Right Hand MSRP: Was: Now: $69.99 Choose Options MacGregor Golf Tour Grind Premium Golf Wedge, Chrome, Mens Right Hand (Custom Fit) MSRP: Was: Now: $69.99 Choose Options MacGregor Golf Tour Grind Milled Face Golf Wedge, Black, Mens Right Hand MSRP: Was: Now: $79.99 Choose Options MacGregor Golf Tour Grind Premium Golf Wedge, Black, Mens Right Hand (Custom Fit) MSRP: Was: Now: $79.99 Choose Options MacGregor Golf MacTec Driving Iron, Mens Right Hand MSRP: $99.99 Was: Now: $89.99 - $99.99 Choose Options MacGregor Golf MacTec Fairway Wood, Mens Right Hand (3-5-7-9 Available) MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MacTec Fairway Wood, Mens Right Hand (Custom Fit) MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MacTec Hybrid, Mens Right Hand MSRP: Was: Now: $99.99 - $199.99 Choose Options MacGregor Golf MacTec Hybrid, Mens Right Hand (Custom Fit) MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MACTEC Pro 1 Putter, Right Hand, Silver, 34\" MSRP: Was: Now: $99.99 Add to Cart MacGregor Golf MACTEC Pro 2 Putter, Right Hand, Silver, 34\" MSRP: Was: Now: $99.99 Add to Cart MacGregor Golf MacTec X Fairway Wood, Adjustable Loft, Mens Right Hand MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MacTec X Wedge Set, Mens Right Hand MSRP: Was: Now: $99.99 Add to Cart MacGregor Golf MACTEC Pro 1 Putter, Right Hand, Black, 34\" MSRP: Was: Now: $109.99 Add to Cart MacGregor Golf MACTEC Pro 2 Putter, Right Hand, Black, 34\" MSRP: Was: Now: $109.99 Add to Cart MacGregor Golf MacTec X Black Wedge Set, Mens Right Hand MSRP: $129.99 Was: Now: $109.99 Add to Cart MacGregor Golf MACTEC Driver (Custom Fit) MSRP: Was: Now: $149.99 Choose Options Sale MacGregor Golf Tour Grind Milled Face Golf Wedge Set, Black, Mens Right Hand MSRP: $169.99 Was: $169.99 Now: $149.99 Add to Cart MacGregor Golf Tourney MAX Fairway Woods MSRP: Was: Now: $149.99 Choose Options MacGregor Golf MT Milled 001 Wide-Blade Putter MSRP: Was: Now: $159.99 Choose Options MacGregor Golf MacTec X 52°, 56°, 60° Wedge, Mens Right Hand Premium wedge offering optimum amounts of spin, feel and control\n\nLofts/bounce - 52° of loft and 10° of bounce, 56° of loft and 13° of bounce, 60° of loft and 5° of bounce\nClub Length - 35\" \nQUALITY -... MSRP: Was: Now: $54.99 Choose Options MacGregor Golf MacTec X 52°, 56°, 60° Wedge, Black, Mens Right Hand Premium wedge offering optimum amounts of spin, feel and control\n\nLofts/bounce - 52° of loft and 10° of bounce, 56° of loft and 13° of bounce, 60° of loft and 5° of bounce\nClub Length - 35\" \nQUALITY -... MSRP: Was: Now: $59.99 Choose Options MacGregor Golf MacTec Driving Iron, Mens Right Hand (Custom Fit) The MacTec range is built on the promise of delivering outstanding quality golf equipment at just the best value we can. We stripped back the gimmicks and over-the-top marketing spend of the big brands, and tasked our engineering team to build clubs that... MSRP: $99.99 Was: Now: $60.00 Choose Options Sale MacGregor Golf MacTec X Driving Iron, Graphite  Shaft, Mens Right Hand The MacGregor MACTEC X Driving Iron is a combination of the workability and control of an iron with the forgiveness of a hybrid. The design distributes the weight, ensuring hybrid-like forgiveness that produces extra distance and accuracy by positioning... MSRP: Was: $69.99 Now: $49.99 Choose Options MacGregor Golf Tour Grind Milled Face Golf Wedge, Chrome, Mens Right Hand MILLED FACE - Precision milled grooves on face give optimum spin\nTOUR PLAYER SPECS - Beautiful, high quality wedge with tour shape head. This is not an 'improvement' wedge, this is for good wedge players who need great tools\n8620 MILD CARBON STEEL -... MSRP: Was: Now: $69.99 Choose Options MacGregor Golf Tour Grind Premium Golf Wedge, Chrome, Mens Right Hand (Custom Fit) MILLED FACE - Precision milled grooves on face give optimum spin\nTOUR PLAYER SPECS - Beautiful, high quality wedge with tour shape head. This is not an \"improvement\" wedge, this is for good wedge players who need great tools\n8620 MILD CARBON STEEL -... MSRP: Was: Now: $69.99 Choose Options MacGregor Golf Tour Grind Milled Face Golf Wedge, Black, Mens Right Hand MILLED FACE - Precision milled grooves on face give optimum spin\nTOUR PLAYER SPECS - Beautiful, high quality wedge with tour shape head. This is not an 'improvement' wedge, this is for good wedge players who need great tools\n8620 MILD CARBON STEEL -... MSRP: Was: Now: $79.99 Choose Options MacGregor Golf Tour Grind Premium Golf Wedge, Black, Mens Right Hand (Custom Fit) MILLED FACE - Precision milled grooves on face give optimum spin\nTOUR PLAYER SPECS - Beautiful, high quality wedge with tour shape head. This is not an \"improvement\" wedge, this is for good wedge players who need great tools\n8620 MILD CARBON STEEL -... MSRP: Was: Now: $79.99 Choose Options MacGregor Golf MacTec Driving Iron, Mens Right Hand The MacTec range is built on the promise of delivering outstanding quality golf equipment at just the best value we can. We stripped back the gimmicks and over-the-top marketing spend of the big brands, and tasked our engineering team to build clubs that... MSRP: $99.99 Was: Now: $89.99 - $99.99 Choose Options MacGregor Golf MacTec Fairway Wood, Mens Right Hand (3-5-7-9 Available) The MacTec range is built on the promise of delivering outstanding quality golf equipment at just the best value we can. We stripped back the gimmicks and over-the-top marketing spend of the big brands, and tasked our engineering team to build clubs that... MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MacTec Fairway Wood, Mens Right Hand (Custom Fit) The MacTec range is built on the promise of delivering outstanding quality golf equipment at just the best value we can. We stripped back the gimmicks and over-the-top marketing spend of the big brands, and tasked our engineering team to build clubs that... MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MacTec Hybrid, Mens Right Hand The MacTec range is built on the promise of delivering outstanding quality golf equipment at just the best value we can. We stripped back the gimmicks and over-the-top marketing spend of the big brands, and tasked our engineering team to build clubs that... MSRP: Was: Now: $99.99 - $199.99 Choose Options MacGregor Golf MacTec Hybrid, Mens Right Hand (Custom Fit) The MacTec range is built on the promise of delivering outstanding quality golf equipment at just the best value we can. We stripped back the gimmicks and over-the-top marketing spend of the big brands, and tasked our engineering team to build clubs that... MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MACTEC Pro 1 Putter, Right Hand, Silver, 34\" CLASSIC PUTTER SHAPE - Classic heel toe putter design, made from premium 304 stainless steel for great feel and feedback. 350g head weight.PRE-OPTIMIZED WEIGHTS - Pre-optimized (non-adjustable) weights on sole improves balance and stabilityGROOVE FACE... MSRP: Was: Now: $99.99 Add to Cart MacGregor Golf MACTEC Pro 2 Putter, Right Hand, Silver, 34\" HIGH MOI DESIGN - Modern fanged mallet putter with high MOI for more forgiveness, made from premium 304 stainless steel for great feel and feedback. 360g head weight.PRE-OPTIMIZED WEIGHTS - Pre-optimized (non-adjustable) weights on sole improves balance... MSRP: Was: Now: $99.99 Add to Cart MacGregor Golf MacTec X Fairway Wood, Adjustable Loft, Mens Right Hand Featuring a confidence-inspiring profile design at address, the MACTEC X adjustable fairway performs from both the tee and fairway. The fairway incorporates a high-MOI design in the face to help launch the ball into the air from any lie on the course... MSRP: Was: Now: $99.99 Choose Options MacGregor Golf MacTec X Wedge Set, Mens Right Hand This wedge set offers unparalleled value for clubs of this quality. You're getting three wedges - 52°, 56° and 60° - giving you every wedge you need no matter the approach.\n\n3 WEDGE SET - Unparalleled value wedge set - 52° 56°... MSRP: Was: Now: $99.99 Add to Cart MacGregor Golf MACTEC Pro 1 Putter, Right Hand, Black, 34\" CLASSIC PUTTER SHAPE - Classic heel toe putter design, made from premium 304 stainless steel for great feel and feedback. 350g head weight.PRE-OPTIMIZED WEIGHTS - Pre-optimized (non-adjustable) weights on sole improves balance and stabilityGROOVE FACE... MSRP: Was: Now: $109.99 Add to Cart MacGregor Golf MACTEC Pro 2 Putter, Right Hand, Black, 34\" HIGH MOI DESIGN - Modern fanged mallet putter with high MOI for more forgiveness, made from premium 304 stainless steel for great feel and feedback. 360g head weight.PRE-OPTIMIZED WEIGHTS - Pre-optimized (non-adjustable) weights on sole improves balance... MSRP: Was: Now: $109.99 Add to Cart MacGregor Golf MacTec X Black Wedge Set, Mens Right Hand This wedge set offers unparalleled value for clubs of this quality. You're getting three wedges - 52°, 56° and 60° - giving you every wedge you need no matter the approach.\n\n3 WEDGE SET - Unparalleled value wedge set - 52° 56°... MSRP: $129.99 Was: Now: $109.99 Add to Cart MacGregor Golf MACTEC Driver (Custom Fit) The MAC is back!\nMacGregor’s new flagship driver sets a high bar. Don’t let the clean and pure design confuse you – this club is packed with impactful tech and quality materials to let the shots do the talking.\n\nQUALITY TITANIUM DRIVER... MSRP: Was: Now: $149.99 Choose Options Sale MacGregor Golf Tour Grind Milled Face Golf Wedge Set, Black, Mens Right Hand 3 WEDGE SET - Unparalleled value wedge set - 52° 56° 60°\nMILLED FACE - Precision milled grooves on face give optimum spin\nTOUR PLAYER SPECS - Beautiful, high quality wedge with tour shape head. This is not an 'improvement' wedge, this is for... MSRP: $169.99 Was: $169.99 Now: $149.99 Add to Cart MacGregor Golf Tourney MAX Fairway Woods TOURNEY MAX - UNCOMPROMISING QUALITY. UNBEATABLE PRICE.\nOur Tourney range offers skilled and improving golfers quality clubs at unbeatable prices that wouldn't be possible with any other model but direct to consumer.\nThe Tourney MAX range is built to... MSRP: Was: Now: $149.99 Choose Options MacGregor Golf MT Milled 001 Wide-Blade Putter Our MT Milled range of putters all start life as a single billet of high quality carbon steel, before being precision milled into four different shapes.\n\nPRECISION ENGINEERING - Starting with a pure billet of carbon steel, these putters are... MSRP: Was: Now: $159.99 Choose Options 24 of 43 Items 1 2 Next × OK Home International Returns Warranty FAQs about us contact us Privacy Policy Terms & Conditions Shipping & Returns Sign up for the latest news and offers Email Address 16 Sunset Way #110, Henderson, NV 89014 +1 (702) 983-7931 help@macgregorgolf.com © 2025 MacGregor Golf \r\n            \r\n             All rights reserved. \r\n             | Sitemap"
    }
  ]
}