{
  "fuentes": [
    {
      "url": "https://mining.ca/about-us/mac-staff/",
      "email": "communications@mining.ca"
    },
    {
      "url": "https://mining.ca/about-us/mac-staff/",
      "email": "favicon-mining@2x-150x150.png"
    },
    {
      "url": "https://mining.ca/about-us/mac-staff/",
      "email": "favicon-mining@2x.png"
    },
    {
      "url": "https://themac.com/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    }
  ],
  "mails": [
    "communications@mining.ca",
    "contact@clubcarwash.com",
    "favicon-mining@2x-150x150.png",
    "favicon-mining@2x.png",
    "logo@2x.png"
  ],
  "nombre_sitio": "macsclubdeuce.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mining.ca/about-us/mac-staff/",
      "text": "MAC Staff - The Mining Association of Canada Skip to content THE VOICE OF THE CANADIAN MINING INDUSTRY SINCE 1935 FR FR Subscribe to MAC News Search Mining Facts Canadian Mining Posters Canadian Mining Stories Canadian Mining Videos Public Opinion Polling Our Focus Climate Change Climate Change Initiatives and Innovations in the Mining Industry Mining and its Role in Clean Technology Corporate Responsibility Community Diversity and Inclusion Initiatives In Canada’s Mining Industry Environment Oil Sands Treated Mine Water Release Advancing Diversity and Inclusion in Canada’s Mining Sector Critical Minerals Economic Competitiveness Human Resources Infrastructure International Trade Indigenous Affairs Government Resource Revenue Sharing Indigenous Employment, Training and Procurement Mining-Indigenous Relationship Agreements Response to the Truth and Reconciliation Commission’s Calls to Action International CSR Canadian Mining Contributions Abroad Global Uptake of TSM Human Rights Transparency Northern Development Regulatory Effectiveness Tailings Management OMS Guide Tailings Guide Towards Sustainable Mining How Can You Get Involved in TSM? Communities & NGOs Investors & Finance Mining Companies Purchasing Companies How TSM Works Components of TSM Program components, governance, and policies Opportunities for Public Comment Community of Interest Panel Protocols & Guides Biodiversity Conservation Management Equitable, Diverse, and Inclusive Workplaces Climate Change Crisis Management and Communications Planning Indigenous and Community Relationships Preventing Child and Forced Labour Safety, Health, and Respect Tailings Management Water Stewardship TSM Protocol Reporting Schedule Additional Tools International Uptake Hacia una minería sostenible Submit TSM Data Training Alignment with Other Standards Performance Reports & Awards Company Performance TSM Awards Aggregate Performance TSM Letters of Assurance Voluntary Principles on Security and Human Rights International Initiatives Company Reporting & Verification Schedule External Verification Support for TSM Members & Partners Become a Member Our Members Our Partners News & Resources About Us Board of Directors Contact Us MAC Staff Scholarship Career Opportunities Mining Facts Canadian Mining Posters Canadian Mining Stories Canadian Mining Videos Public Opinion Polling Our Focus Climate Change Climate Change Initiatives and Innovations in the Mining Industry Mining and its Role in Clean Technology Corporate Responsibility Community Diversity and Inclusion Initiatives In Canada’s Mining Industry Environment Oil Sands Treated Mine Water Release Advancing Diversity and Inclusion in Canada’s Mining Sector Critical Minerals Economic Competitiveness Human Resources Infrastructure International Trade Indigenous Affairs Government Resource Revenue Sharing Indigenous Employment, Training and Procurement Mining-Indigenous Relationship Agreements Response to the Truth and Reconciliation Commission’s Calls to Action International CSR Canadian Mining Contributions Abroad Global Uptake of TSM Human Rights Transparency Northern Development Regulatory Effectiveness Tailings Management OMS Guide Tailings Guide Towards Sustainable Mining How Can You Get Involved in TSM? Communities & NGOs Investors & Finance Mining Companies Purchasing Companies How TSM Works Components of TSM Program components, governance, and policies Opportunities for Public Comment Community of Interest Panel Protocols & Guides Biodiversity Conservation Management Equitable, Diverse, and Inclusive Workplaces Climate Change Crisis Management and Communications Planning Indigenous and Community Relationships Preventing Child and Forced Labour Safety, Health, and Respect Tailings Management Water Stewardship TSM Protocol Reporting Schedule Additional Tools International Uptake Hacia una minería sostenible Submit TSM Data Training Alignment with Other Standards Performance Reports & Awards Company Performance TSM Awards Aggregate Performance TSM Letters of Assurance Voluntary Principles on Security and Human Rights International Initiatives Company Reporting & Verification Schedule External Verification Support for TSM Members & Partners Become a Member Our Members Our Partners News & Resources About Us Board of Directors Contact Us MAC Staff Scholarship Career Opportunities FR FR Mining Facts Canadian Mining Posters Canadian Mining Stories Canadian Mining Videos Public Opinion Polling Our Focus Climate Change Climate Change Initiatives and Innovations in the Mining Industry Mining and its Role in Clean Technology Corporate Responsibility Community Diversity and Inclusion Initiatives In Canada’s Mining Industry Environment Oil Sands Treated Mine Water Release Advancing Diversity and Inclusion in Canada’s Mining Sector Critical Minerals Economic Competitiveness Human Resources Infrastructure International Trade Indigenous Affairs Government Resource Revenue Sharing Indigenous Employment, Training and Procurement Mining-Indigenous Relationship Agreements Response to the Truth and Reconciliation Commission’s Calls to Action International CSR Canadian Mining Contributions Abroad Global Uptake of TSM Human Rights Transparency Northern Development Regulatory Effectiveness Tailings Management OMS Guide Tailings Guide Towards Sustainable Mining How Can You Get Involved in TSM? Communities & NGOs Investors & Finance Mining Companies Purchasing Companies How TSM Works Components of TSM Program components, governance, and policies Opportunities for Public Comment Community of Interest Panel Protocols & Guides Biodiversity Conservation Management Equitable, Diverse, and Inclusive Workplaces Climate Change Crisis Management and Communications Planning Indigenous and Community Relationships Preventing Child and Forced Labour Safety, Health, and Respect Tailings Management Water Stewardship TSM Protocol Reporting Schedule Additional Tools International Uptake Hacia una minería sostenible Submit TSM Data Training Alignment with Other Standards Performance Reports & Awards Company Performance TSM Awards Aggregate Performance TSM Letters of Assurance Voluntary Principles on Security and Human Rights International Initiatives Company Reporting & Verification Schedule External Verification Support for TSM Members & Partners Become a Member Our Members Our Partners News & Resources About Us Board of Directors Contact Us MAC Staff Scholarship Career Opportunities Mining Facts Canadian Mining Posters Canadian Mining Stories Canadian Mining Videos Public Opinion Polling Our Focus Climate Change Climate Change Initiatives and Innovations in the Mining Industry Mining and its Role in Clean Technology Corporate Responsibility Community Diversity and Inclusion Initiatives In Canada’s Mining Industry Environment Oil Sands Treated Mine Water Release Advancing Diversity and Inclusion in Canada’s Mining Sector Critical Minerals Economic Competitiveness Human Resources Infrastructure International Trade Indigenous Affairs Government Resource Revenue Sharing Indigenous Employment, Training and Procurement Mining-Indigenous Relationship Agreements Response to the Truth and Reconciliation Commission’s Calls to Action International CSR Canadian Mining Contributions Abroad Global Uptake of TSM Human Rights Transparency Northern Development Regulatory Effectiveness Tailings Management OMS Guide Tailings Guide Towards Sustainable Mining How Can You Get Involved in TSM? Communities & NGOs Investors & Finance Mining Companies Purchasing Companies How TSM Works Components of TSM Program components, governance, and policies Opportunities for Public Comment Community of Interest Panel Protocols & Guides Biodiversity Conservation Management Equitable, Diverse, and Inclusive Workplaces Climate Change Crisis Management and Communications Planning Indigenous and Community Relationships Preventing Child and Forced Labour Safety, Health, and Respect Tailings Management Water Stewardship TSM Protocol Reporting Schedule Additional Tools International Uptake Hacia una minería sostenible Submit TSM Data Training Alignment with Other Standards Performance Reports & Awards Company Performance TSM Awards Aggregate Performance TSM Letters of Assurance Voluntary Principles on Security and Human Rights International Initiatives Company Reporting & Verification Schedule External Verification Support for TSM Members & Partners Become a Member Our Members Our Partners News & Resources About Us Board of Directors Contact Us MAC Staff Scholarship Career Opportunities Home > About Us > MAC Staff MAC Staff Meet the members of the MAC Team. Board of Directors Contact Us MAC Staff Scholarship Recipients Pierre Gratton President and CEO Pierre Gratton was appointed President and CEO of the Mining Association of Canada (MAC) on June 1, 2011. Based in Ottawa, MAC is the national organization for the Canadian mining industry. Its members are engaged in mineral exploration, mining, smelting, refining and semi-fabrication. Prior to his appointment to MAC, Pierre was President and CEO of the Mining Association of British Columbia (MABC). From 1999-2008, Mr. Gratton served as Vice President, Sustainable Development and Public Affairs for the Mining Association of Canada (MAC). In this capacity, he was instrumental in the development of Towards Sustainable Mining, MAC’s flagship program that is gaining international recognition and adoption. In 2005-06, Mr. Gratton was honoured as a Distinguished Lecturer for the Canadian Institute of Mining, Metallurgy and Petroleum (CIM). Mr. Gratton is First Vice-President of the Interamerican Mining Society (SIM – Sociedad Interamericana de Mineria). A board member and former Chair of the Canadian Mining Hall of Fame, Mr. Gratton is Co-chair of the Green Mining Initiative Advisory Committee, sits on Minister’s Advisory Council on Impact Assessment and serves on the Board of Ottawa’s Thirteen Strings Chamber Orchestra. Mr. Gratton holds an M.A. degree in political science, a B.A. from McGill University, and a third-degree black belt in Karate. Ben Chalmers Senior Vice President Since joining MAC in 2011, Ben has been responsible for the Towards Sustainable Mining (TSM) initiative, the made-in-Canada award-winning program focused on enabling mining companies to meet society’s needs for minerals, metals and energy products in the most socially, economically and environmentally responsible way. Over the last few years, Ben has played an important role in the international growth of TSM as it becomes a sought-after responsible mining standard.  During his time working with TSM, it spread beyond Canada to be adopted by national mining associations around the world. As Senior Vice President, Ben is responsible for overseeing MAC’s work related to Public Affairs & Communications and Government Relations.  Ben has extensive experience in the mining sector and began working in the industry in 2004 at the Myra Falls Operations in British Columbia where he worked as an Environmental Supervisor for the mine. Prior to joining MAC, Ben served as Vice President of Environment and Technical Affairs for the Mining Association of British Columbia and was also a Senior Policy Analyst with Natural Resources Canada. Ben is a member of both the Minister of International Trade’s Multi-Stakeholder Advisory Body on Responsible Business Conduct and the Responsible Business Alliance’s Responsible Mining Initiative Engagement Team. Paul Hébert Vice President, Communications Paul is responsible for corporate communications, issues management, media relations, social media, website management, publications, and annual advertising campaigns. Paul works with MAC’s policy experts, members, stakeholders and partners to develop and implement communications plans, strategies and activities to support the entire breadth of the MAC’s objectives. Paul’s 25+ year career has included senior leadership roles at the Mining Industry Human Resource Council, The Canadian Nuclear Association, The Appraisal Institute of Canada, among others.  In 2006-07, Paul was honoured as a Distinguished Lecturer for the Canadian Institute of Mining, Metallurgy and Petroleum (CIM).  Paul studied English Literature at Carleton University and has completed Executive Development Programs At the University of Toronto, McGill University, and the University of Oxford’s Said Business School. Geoff Smith Vice President, Government Relations Engaging with Parliamentarians and federal officials on mining sector issues is a key function MAC undertakes on behalf of its members. As Vice President, Government Relations, Geoff is responsible for identifying opportunities and developing strategies to advance MAC priorities in Ottawa. Having spent eight years as the Director of Government Relations for the Canadian Electricity Association (CEA) prior to joining MAC, Geoff is well versed in federal energy and resource policy. Geoff has significant Parliamentary experience, and for over a decade served as a political advisor to federal Ministers of Industry; Citizenship and Immigration; and several Members of Parliament from Ontario and British Columbia. Geoff also serves as MAC’s representative on the Mining Industry Human Resources Council’s Board of Directors. Photinie Koutsavlis Vice President, Economic Affairs and Climate Change Photinie works to advance the mining industry’s understanding of key economic issues, including taxation, international trade and investment, infrastructure and innovation. She is also responsible for guiding MAC and its members in supporting an orderly transition toward a lower carbon future, and to being constructive partners in the fight against climate change. Photinie previously served as Natural Resources Canada’s (NRCan) Director General, Policy and Economic Branch for the Lands and Minerals Sector where she was responsible for leading and integrating strategic policy, science, regulatory expertise, economics and market analysis to inform policy development and decisions on domestic and international priorities related to lands, minerals and metals. In her most recent role with NRCan, Photinie played a vital role in the development and implementation of the Canadian Minerals and Metals Plan and steered the efforts of the department’s Critical Minerals Task Force to establish Canada as the preferred global supplier of critical minerals, products and technologies that are essential to building a net-zero economy. Tara Shea Vice President, Regulatory and Indigenous Affairs Tara works with MAC members in addressing and understanding the federal regulatory and legislative environment that Canadian mining companies adhere to. In her role, she monitors emerging regulatory issues and participates in policy development for a wide range of federal acts and regulations including the Impact Assessment Act , Migratory Birds Convention Act , Species at Risk Act and the United Nations Declaration on the Rights of Indigenous Peoples Act . She is dedicated to working on species at risk and protected areas related issues and is an active member of the Nature Advisory Committee, a co-chair of the Canadian Environmental Domestic Advisory Group on the Canada-EU Comprehensive Economic and Trade Agreement (CETA) and a member of the Centre for Land Conservation’s Board of Directors. Charles Dumaresq Vice President, Science and Environmental Management Charles focuses on regulatory and environmental aspects of mining, including mine waste management, effluent quality, and monitoring and mitigating effects on water quality and the aquatic environment. Prior to joining MAC, Charles spent 22 years with the Government of Canada, working on issues related to mining and the environment. He is experienced in technical and policy aspects related to legacy environmental issues associated with orphaned and abandoned mines, and has extensive experience in regulatory development and implementation. A geologist by training, Charles first gained experience in the mining industry working on mineral exploration projects. Katherine Gosselin Director, Towards Sustainable Mining Katherine is responsible for the management of the Mining Association of Canada’s Towards Sustainable Mining initiative. She joins MAC from Natural Resources Canada, where she worked with Latin American governments to promote sustainable mining practices and provided advice in support of North American trade negotiations. More recently, Katherine was responsible for Canada’s international collaboration and policy development related to critical minerals trade and investment. Prior to joining the Government of Canada, Katherine worked in diverse roles in Taiwan, Sri Lanka, and Belgium. She holds an MSc in Global Politics from the London School of Economics and Political Science. Danielle Morrison Director, Regulatory Affairs Danielle serves as MAC’s policy lead on issues related to the Canadian Environmental Protection Act (CEPA), including: the Chemicals Management Plan; National Pollutant Release Inventory; circular economy; product stewardship; Fisheries Act; aquatic species; marine protected areas; and other emerging and related issues. Prior to joining MAC in 2023, Danielle served as the chemicals management policy lead at the Chemistry Industry Association of Canada for 4.5 years, where she played a key role influencing the modernization of Canada’s cornerstone environmental protection Act through Bill S-5. Danielle holds a Bachelor of Science in Biochemistry and Master of Biomedical Informatics from Queen’s University. Marilyn Fortin Comptroller and Member Relations Marilyn oversees the operational activities of the association, including human resources, information technology, finance, and facilities management. Marilyn also is the primary contact for membership and member services, coordinates Board of Directors events and conferences, and provides a Board secretariat function. Prior to joining MAC in 2003, Marilyn held management positions with public, private and non-profit organizations, including the Canada Museum of Science and Technology where she held the position of Corporate Secretary. She is a seasoned professional with extensive knowledge of membership services, human resources and administration. Debbie Villeneuve Financial Officer As Financial Officer, Debbie is responsible for MAC’s day-to-day financial management operations. Specifically, her responsibilities include accounts receivable/payable, the preparation of financial statements and payroll as well as the preparation of audit working papers and audited financial statements.  Debbie is a seasoned financial professional with diverse experience in accounting, fund and cash flow management, and performance reporting and financial analysis in a not-for profit environment. Debbie MacVicar Administrative Assistant Manages MAC’s reception area, assists with events programming and provides administrative support for various facets of the association. Mining Association of Canada 700-141 Laurier Avenue West Ottawa, ON K1P 5J3 613.233.9392 ext 316 communications@mining.ca Our Focus Regulatory Effectiveness Economic Competitiveness Corporate Responsibility International CSR Northern Development Climate Change Tailings Management Critical Minerals Indigenous Affairs Regulatory Effectiveness Economic Competitiveness Corporate Responsibility International CSR Northern Development Climate Change Tailings Management Critical Minerals Indigenous Affairs About Us Board of Directors MAC Staff Scholarship Contact Us Board of Directors MAC Staff Scholarship Contact Us Towards Sustainable Mining Hacia una minería sostenible TSM Guiding Principles How TSM Works Alignment with Other Standards Protocols & Guides Community of Interest Panel Performance Reports & Awards Submit TSM Data External Verification TSM Videos Support for TSM Hacia una minería sostenible TSM Guiding Principles How TSM Works Alignment with Other Standards Protocols & Guides Community of Interest Panel Performance Reports & Awards Submit TSM Data External Verification TSM Videos Support for TSM Members & Partners Our Members Our Partners Become a Member Our Members Our Partners Become a Member Resources Reports Guides & Manuals Speeches Presentations Press Releases Newsletters Mining Facts Canadian Mining Posters Canadian Mining Stories Canadian Mining Videos Reports Guides & Manuals Speeches Presentations Press Releases Newsletters Mining Facts Canadian Mining Posters Canadian Mining Stories Canadian Mining Videos News & Events Press Releases Newsletters MAC in the News Press Releases Newsletters MAC in the News Copyright © 2025 Mining Association of Canada Privacy Information Subscribe to MAC News \" * \" indicates required fields Name First Last Email * * Indicates a required field You can unsubscribe from these communications at any time. For more information on how to unsubscribe, our privacy practices, and how we are committed to protecting and respecting your privacy, please review our Privacy Policy . By clicking submit, you consent to allow The Mining Association of Canada to store and process the personal information submitted above to provide you the content requested."
    },
    {
      "url": "https://themac.com/",
      "text": "Home - MAC MAC Menu Home Member Login About MAC Dining History Multnomah Athletic Foundation Careers Parking Contact Us Compete for Team MAC Alpine Ski & Snowboard Artistic Swimming Basketball Climbing Dance Men's Gymnastics Women's Gymnastics Swimming Volleyball 2024 Rosters 2024 Volleyball Schedule Volleyball Coaches Become a Member MAC Salon Events Private Events & Catering Membership Diversity Admissions Program WingedM student Member Login Home About MAC Membership Events Winged M Private Events & Catering Welcome to Multnomah Athletic Club Multnomah Athletic Club in Portland, Oregon, is the largest private athletic and social club in the United States, with a membership that is 21,000-plus strong. The club's desirability is built upon unparalleled recreational and competitive sports programs, first-class athletics facilities, and exceptional social and dining experiences. Founded in 1891, it has influenced the social and athletic history of the city, and its members continue to write the club's history with every achievement. Member Login Become a Member How to Join A Community Unlike Any Other Get unparalleled access to social and sporting spaces, not to mention lectures and other chances to learn and grow. This is a one-of-a-kind opportunity to open a whole new world of individual and family fun at what will undoubtedly become your new second home. Learn More Visitor Information Careers Winged M Events & Catering The club's professional catering team has the experience to coordinate any event from a high-powered business luncheon to the most elegant wedding receptions. MAC has approximately 17,000 square feet of catering space and the flexibility to accommodate groups of five to 500. Learn More Compete for Team MAC Multnomah Athletic Club offers a variety of junior competitive opportunities, which include nine sport programs that are sure to match varying interests and life goals. Check out all the club has to offer to compete on the court, in the pool, on the slopes, in the studio, and in the gym. Then, join the team! Learn More Interested in membership? Fill out the form below and a representative from the club's membership office will be in touch. Membership Question Form Membership Question Form First Name * Last Name * Phone Email * Message * Submit Back To Top Regular Club Hours Mon - Fri: 5 a.m. - 11 p.m. Saturday: 6 a.m. – 11 p.m. Sunday: 6 a.m. – 9 p.m. General Information Membership Parking Multnomah Athletic Foundation Winged M Advertising Private Events & Catering Contact Us Winged M Advertising Private Events & Catering Careers Contact Us © Multnomah Athletic Club. All rights reserved. | Privacy Policy Multnomah Athletic Club, 1849 SW Salmon St., Portland, OR 97205"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    }
  ]
}