{
  "fuentes": [
    {
      "url": "https://madison.com/life-entertainment/local/food-drink/ale-asylum-pizza-place-detroit-style-madison/article_16eaaefa-325a-11ef-99ea-d375d3f6ed42.html",
      "email": "nskalk@madison.com"
    },
    {
      "url": "https://madison.com/life-entertainment/local/food-drink/ale-asylum-pizza-place-detroit-style-madison/article_16eaaefa-325a-11ef-99ea-d375d3f6ed42.html",
      "email": "skalk@madison.com"
    },
    {
      "url": "https://epogee.com/contact-us/",
      "email": "epogee-logo-header@2x.png"
    },
    {
      "url": "https://epogee.com/contact-us/",
      "email": "epogee-logo-white@2x.png"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "ajmuldrow@madison.k12.wi.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "blfeltham@madison.k12.wi.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "board@madison.k12.wi.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "cjli2@madison.k12.iw.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "lrshapiro@madison.k12.wi.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "mpearson2@madison.k12.wi.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "msiravo@madison.k12.wi.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "nichellenichols@madison.k12.wi.us"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "nkvander@yahoo.com"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "email": "sjcastro@madison.k12.wi.us"
    },
    {
      "url": "https://novantapizzeria.com/about-us/",
      "email": "asset-1@3x-8-480x586.png"
    },
    {
      "url": "https://novantapizzeria.com/about-us/",
      "email": "asset-1@3x-8.png"
    },
    {
      "url": "https://madison.com/life-entertainment/local/food-drink/famous-yetis-stoughton-thc-pizza/article_089a2538-92e0-11ef-b0e4-83b9268b2427.html",
      "email": "nskalk@madison.com"
    },
    {
      "url": "https://madison.com/life-entertainment/local/food-drink/famous-yetis-stoughton-thc-pizza/article_089a2538-92e0-11ef-b0e4-83b9268b2427.html",
      "email": "skalk@madison.com"
    },
    {
      "url": "https://papaspizzacompany.com/contact/",
      "email": "info@papaspizzacompany.com"
    },
    {
      "url": "https://valentinaspizzeria.com/",
      "email": "info@valentinaspizzeria.com"
    }
  ],
  "mails": [
    "ajmuldrow@madison.k12.wi.us",
    "asset-1@3x-8-480x586.png",
    "asset-1@3x-8.png",
    "blfeltham@madison.k12.wi.us",
    "board@madison.k12.wi.us",
    "cjli2@madison.k12.iw.us",
    "epogee-logo-header@2x.png",
    "epogee-logo-white@2x.png",
    "info@papaspizzacompany.com",
    "info@valentinaspizzeria.com",
    "lrshapiro@madison.k12.wi.us",
    "mpearson2@madison.k12.wi.us",
    "msiravo@madison.k12.wi.us",
    "nichellenichols@madison.k12.wi.us",
    "nkvander@yahoo.com",
    "nskalk@madison.com",
    "sjcastro@madison.k12.wi.us",
    "skalk@madison.com"
  ],
  "nombre_sitio": "madisonavepizza.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://madison.com/life-entertainment/local/food-drink/ale-asylum-pizza-place-detroit-style-madison/article_16eaaefa-325a-11ef-99ea-d375d3f6ed42.html",
      "text": "Ale Asylum co-founder opening Detroit-style pizza place Skip to main content Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close 71° Log In Subscribe Guest Logout Read Today's E-edition News Local Crime Politics Podcasts Education State & Regional Nation & World Markets & Stocks News Tip Obituaries Share a story Recent Obituaries Find an Obituary Archives Opinion Letters Editorial Columnist Cartoon Sports High School Badgers Brewers Bucks Packers Professional BadgerExtra Football Men’s basketball Women’s basketball Men’s hockey Women’s hockey Volleyball Recruiting History Lifestyles Arts & Theater Events Calendar Food & Dining Music Movies & TV Comics Puzzles Food & Cooking Home & Garden Health Parenting Fashion Pets Faith Contests Play Business Economy Employment Health Care Personal Finance Join the community News tip Share video Send a story Share a photo Brand Ave. Studios Podcasts Print Edition Cap Times E-edition Wisconsin State Journal E-edition E-edition Archives Display Ads Circulars Buy & Sell Place an Ad Jobs Deals Shop Local Promotions Public Notices Marketplace Display Ads Wisconsin Public Notices Shopping Customer Service Manage Subscription Activate Digital Subscription Newsletter sign-up Subscribe Contact Us Activate Full Access Help Center Gift Subscriptions Mobile Apps Weather: Live Radar Facebook Twitter Bluesky YouTube Pinterest Instagram © 2025 Lee Enterprises Terms of Service | Privacy Policy Subscribe Read Today's E-edition Subscribe Log In Welcome, Guest My Subscription Help Center My Account Dashboard Profile Saved items Logout E-edition News Obituaries Opinion Sports Puzzles Podcasts Dining Public Notices Cap Times WiscNews Jobs 71° Mostly Cloudy Share This Facebook Twitter Bluesky WhatsApp SMS Email Ale Asylum co-founder opening Detroit-style pizza place on Madison's Near East Side Live chat 0 Comments Share this Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Alert Top Story RESTAURANT NEWS Ale Asylum co-founder opening Detroit-style pizza place on Madison's Near East Side Samara Kalk Derby | Wisconsin State Journal Jun 25, 2024 Jun 25, 2024 0 Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The co-founder of the former Ale Asylum brewery is opening a pizza place at 912 E. Johnson St., where a Salvatore's Tomato Pies used to be. Otto Dilba said he's spent the past 15 months perfecting Detroit-style pizza in his home kitchen and plans to open Molten Monkey Pizza in late August or early September. Molten Monkey Pizza is going into the former Salvatore's Tomato Pies on Johnson Street. SAMARA KALK DERBY, STATE JOURNAL \"I can't tell you how many different recipe formulations I've worked with,\" Dilba said, adding that Detroit pizza is tough to beat. \"It's amazing to me just how many people have never even heard of the style and have never tried it.\" The pizzas, developed in 1946, are usually rectangular, at least an inch thick, and have caramelized cheese around the edges. Jet's Pizza, a Detroit pizza franchise, has been at 2831 Parmenter St. in Middleton since 2016 and Dilba said he's been a frequent customer. People are also reading… Wisconsin’s Powerball jackpot winners and how much they won Bankruptcy to leave large retail space empty in Madison John Nolen Drive reconstruction starts next month. Here’s what to know 16-story student apartment building proposed near State Street City, developer clash over partly demolished building on West Wilson Street Former Green Bay Packers QB cited after bar altercation in Eau Claire UW-Madison parents hire surrogate mom to care for students at college Survivors group says Madison Diocese ignored complaints against priest accused of sex crimes WIAA moves state high school team wrestling tournament out of Madison Restaurant reviews: Back for seconds, a look at 4 recently visited spots Which Madison schools saw the most police calls last year? 2 Marquette men's lacrosse players killed in crash near campus 5 must-see Wisconsin state parks to visit this fall Madison says GPA determines who gets automatic admission to UW, regardless of number of students Attorney who represented murderer Barbara Hoffman dies at 92 \"I bet you I've paid many salaries there over the last few years — Jet's is great,\" Dilba said. Dilba said he's spent a lot of time working on the dough, which he called critical. \"I wouldn't be doing this if I didn't think it was something that was worthy of pizza lovers and certainly the neighborhood,\" he said. Dilba, 50, who's from Tomahawk in Northern Wisconsin, spent about 22 years in the Orchard Ridge neighborhood and now lives in the Arbor Hills area. He said Tenney-Lapham has been one of his favorite neighborhoods in Madison since he moved here in the 1990s. \"As far as sort of classic Madison neighborhoods, Tenney-Lapham has been at the top of my list for a long time. I love this neighborhood,\" he said. The restaurant has an indoor capacity of 50 with room for 20 outside. Movies-tv Wisconsin chef Dan Jacobs talks about his near win on 'Top Chef' Samara Kalk Derby | Wisconsin State Journal Salvatore's Tomato Pies owner Patrick DePula initially intended to keep the Johnson Street location, but the pandemic forced a change. The Johnson Street Salvatore's was DePula's second. His first one opened in Sun Prairie in 2011. Johnson Street came in late 2014 with a Monona location in 2020. In mid-February 2020, DePula and two partners opened DarkHorse by Sal's, a 3,400-square-foot restaurant on East Washington Avenue and Livingston Street. The restaurant was open for four weeks before it was forced to shut down indoor dining because of the pandemic. \"I leased Livingston with the intent of that being a completely different restaurant. And COVID killed that,\" DePula said. \"It was impossible to build a new brand during COVID.\" DePula consolidated both locations and turned DarkHorse into a Salvatore's. He closed Johnson Street in August 2021, reopened it briefly in 2022, but the remodeled space only lasted about nine months. He said it was too hard then to staff both locations. \"I enjoyed it, but when we reopened it, it never was able to do what it did before COVID,\" he said. \"It just didn't work to have those two spaces so close to each other.\" Meanwhile, Dilba co-founded Ale Asylum, the maker of Hopalicious, Ambergeddon and other popular beers, in 2006. It was put up for sale in 2021 and closed in 2022 after a purchase deal fell through. Last spring, the owners of Madison's Karben4 Brewing Co.  bought Ale Asylum's brands and recipes and have been carrying on many Ale Asylum products. Dilba said he's proud of what he did with Ale Asylum and intends to have some of it on tap at Molten Monkey. He said he plans to offer six to eight rotating tap beers, including Karben4. \"We might even throw the occasional macro in there, you never know.\" His focus now is on getting the proper city permits so he can begin testing pizzas in the space. Local Greenbush Bar in Madison being sold after 30 years Samara Kalk Derby | Wisconsin State Journal Dilba said the menu will be small. \"My thought has always been, the best places don't do 30 things, they do three things better than anyone.\" The menu also will have salads and appetizers. Dilba said he hasn't hired a chef yet. He said he has 16 to 18 specialty pizzas in the hopper and the one he's worked hardest on he's calling the Umami Bomby. It has three or four types of mushrooms, his signature cheese blend, garlic and truffle zest. He said moisture control has been challenging when it comes to that many mushrooms. Molten in the name comes from how Detroit pizzas look when they come straight from the oven, he said, and monkey is a nickname he's had for multiple people and animals he's loved in his life. \"It's just an homage to them,\" Dilba said. The space is well set up for what he's trying to do and doesn't need any renovations, he said, adding that he needs to put his own aesthetic touch on it. \"We're not going to open the doors until we have this thing exactly where we want it.\" Read more restaurant news at: go.madison.com/restaurants 0 Comments Satisfy your cravings With our weekly newsletter packed with the latest in everything food. Sign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy . Samara Kalk Derby | Wisconsin State Journal Author email Follow Samara Kalk Derby | Wisconsin State Journal Related to this story Restaurant review: Comfort Fuel is worthy; just ask a Badger athlete Handy place to eat when you're on State Street with lots of good, healthy choices — and some indulgent ones. Madison restaurant makes Wine Spectator's best wine restaurants list Wine Spectator, a leading authority on wine, named 39 Wisconsin restaurants among its list of the world’s best restaurants for wine. Detroit-style pizza coming to Johnson Street in Madison While many pizza places have been at 912 E. Johnson St. before Molten Monkey, it's the first to have a bar,. × Facebook Twitter Bluesky YouTube Pinterest Instagram Calendar Comics Obituaries Search Subscribe now Sites & Partners Wisconsin State Journal Cap Times WiscNews Madison Media Partners AmplifiedWisconsin ApplyMadison Wingra Printing Group Online Features Services Customer service: 800-362-8333 Manage your subscription Place a classified ad Submit a Celebration Contact Us Email Newsletters Work here Buy and Sell Jobs Homes Apartments Licensing Dealer Returns Shopping © Copyright 2025 Wisconsin State Journal , 1901 Fish Hatchery Rd Madison, WI 53713 Terms of Use | Privacy Policy | Advertising Terms of Use | Do Not Sell My Info | Cookie Preferences Powered by BLOX Content Management System from bloxdigital.com . Notifications Settings You don't have any notifications. Get up-to-the-minute news sent straight to your device. Topics News Alerts Subscribe Badger Sports Subscribe Breaking News Subscribe Crime Subscribe Politics Subscribe Back × You are logged in Switch accounts Secure transaction. Cancel anytime. Have an account? Log In Back × Sign Up Account processing issue - the email address may already exist User information Username (Optional) This is the name that will be used to identify you within the system. Choose wisely! * First name * Last name Your real name will be displayed next to your photo for comments, blog posts, and more! * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. CAPTCHA Create Account or Sign up with Facebook Google Have an account? Log In × You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back × Log In Invalid password or account does not exist Email Address Password Forgot your password? Log In Email me a log in link or Sign in with Facebook Google Admin login Subscribe Need an account? Sign Up Back × Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password × Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back × Email me a log in link Account Email CAPTCHA Send Email Back × Promotional Offers Enter Promo Code Redeem No promotional rates found. Back × Purchase Gift Purchase Access × An error occurred × Secure & Encrypted Sign in with Email Address Continue with Email Address or Continue with Facebook Continue with Google What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Delivery date Delivery date What's your billing location? Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip Code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe What's your delivery address? Copy billing location Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe Phone Subtotal: Total: How would you like to pay? Add New Card I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. × You're all set! Thank you . Your gift purchase was successful! Your purchase was successful, and you are now logged in. A receipt was sent to your email. OK × An error occurred This offer is currently unavailable. Close"
    },
    {
      "url": "https://epogee.com/contact-us/",
      "text": "Contact Epogee | Get in Touch with Our Team | EPG Alternative Fat Skip to content Search for: Applications Chocolate & Confections Salty Snacks Baked Goods Ice Cream Plant-Based Nut Butters & Spreads Technology About Us FAQ Contact Us Search for: Contact Us chuzles 2025-07-08T14:32:45-04:00 Let’s Talk EPOGEE,LLC 169 Madison Avenue Suite 2523 New York, NY 10016 Have questions about EPG? Interested in a sample? Looking to explore what’s possible for your brand? You’re in the right place. Complete the form below and our team will be in touch. We look forward to helping you innovate without compromise. 169 Madison Avenue Suite 2523 New York, NY 10016 Quick Links Home Applications Technology FAQ Contact Us Subscribe to our e-Newsletter Email (Required) Follow Us © 2016- Epogee. Privacy Policy | Terms and Conditions Page load link Go to Top"
    },
    {
      "url": "https://www.madison.k12.wi.us/about/board-of-education",
      "text": "Board of Education - Madison Metropolitan School District Skip To Main Content Search Clear Search Select a School Elementary Schools Middle Schools High Schools Elementary Schools Anana Chávez Crestwood Elvehjem Emerson Franklin Gompers Hawthorne Henderson Huegel Kennedy Lake View Lapham Leopold Lincoln Lindbergh Lori Mann Carey Lowell Marquette Mendota Midvale Muir Nuestro Mundo Olson Orchard Ridge Randall Sandburg Schenk Shorewood Hills Stephens Thoreau Van Hise Middle Schools Badger Rock Black Hawk Cherokee Heights Ezekiel Gillespie Hamilton O'Keeffe Sennett Sherman Spring Harbor Toki Whitehorse Wright High Schools Capital High East La Follette Memorial Shabazz West ABOUT Building for the Future Attendance Areas Awards Big Ideas Board of Education Jefferson Middle School Renaming Process Southside Elementary School Naming Process Safety and Student Wellness Ad Hoc Committee Board of Education Meetings Budget Building Excellence Calendars Religious Holiday Calendar 2024-2025 School Year Calendar 2025-2026 School Year Calendar Construction Updates Contact Us Early Literacy and Beyond Task Force School Improvement Plans (SIP) MMSD News Shoutouts Submit a Shout out! Gratitude Grams Submit A Gratitude Gram Renaming Ceremony of Milele Chikasa Anana Elementary School Land Acknowledgement Ceremony Family News Top Stories Announcements Events In The News Resources School Spotlights Staff Spotlights Student Spotlights News Media Inquiries Newsletter Public Records Request Pupil Nondiscrimination Report Why Madison Why MMSD La Follette Attendance Area Information Request Strategic Framework 2019-20 Results Black Excellence Healthy food, healthy minds Student and Staff Support connect with community through social media series Virtual Learning Report Strategic Framework Recalibration 2022-2023 Annual Report Strategic Framework  - 2025 Meet the Superintendent Breakfast with Champions Superintendent's Impact Awards Superintendent Engagement Vision 2024 Referenda Frequently Asked Questions October 22 Virtual Information Session Sign Up 2024 Operational Referendum 2024 Facilities Referendum Public School Funding ACADEMICS Advanced Learning Arts Education Common Core State Standards Common Core State Standards = Opportunity Curriculum Dual-Language Immersion (DLI) Early College Biomedical Academy Early College Education Academy Early College Networking & Cybersecurity Academy Early College STEM Academy Early Learning Programs Early Learning Session Peer Program Infinite Campus Madison Promise Multilingual Programs & Services Personalized Pathways Running Start Academy Secondary Programs Special Education State Report Cards FOR FAMILIES After-School & Athletics American Sign Language Interpreting Services Attendance Back to School Behavior Education Plan Bullying Resources Anti-Bullying Reporting Form Anti-Bullying Resources for Students What to Expect After Bullying is Reported Calendars Community Schools About Community Schools Contact Us District Policy Guides Enrollment Family Newsletter Find Your School Food Pantries/Food Markets Graduation (High School) Health Services Immigrant Students & Families Infinite Campus Mad for Reading Understanding Act 20 Madison Promise Madison School & Community Recreation (MSCR) (opens in new window/tab) Meals Mental Health & Well-Being On-Track to Graduation Plan MMSD On-Track to Graduation Plan ParentSquare Parent Teacher Conferences Read Your Heart Out Culturally Responsive Books For Educators Multimedia Gallery Read Alouds RYHO 2025 Celebration Safety & Security Information School Supply Lists Start and Dismissal Times 25-26 School Start & Dismissal Times - All Schools Starting November 6 – Updated School Start & Dismissal Times Summer Programming MMSD Summer Resource Page Support Services Title IX Non-Discrimination Statement Title VI - Native American Education Tutoring Programs Transportation Weather Information Welcome Arts Events and Information DEPARTMENTS WORK WITH MMSD Donate (opens in new window/tab) Careers About Madison Pre-Service Teaching LEAD Madison Meet Our Principals Principal Screening and Selection Process SERVE Madison MMSD Substitute Services TEACH Madison External Research Facility Rentals Facility Rental Request Form For Vendors & Contractors Partnerships Volunteer Opportunities LOG IN ClassLink (opens in new window/tab) Email (opens in new window/tab) Incident IQ (opens in new window/tab) Infinite Campus Kronos (opens in new window/tab) Moodle (opens in new window/tab) Munis (opens in new window/tab) Professional Development Catalog Professional Learning Portal (opens in new window/tab) Staff Only Website (opens in new window/tab) Home ABOUT Building for the Future Attendance Areas Awards Big Ideas Board of Education Jefferson Middle School Renaming Process Southside Elementary School Naming Process Safety and Student Wellness Ad Hoc Committee Board of Education Meetings Budget Building Excellence Calendars Religious Holiday Calendar 2024-2025 School Year Calendar 2025-2026 School Year Calendar Construction Updates Contact Us Early Literacy and Beyond Task Force School Improvement Plans (SIP) MMSD News Shoutouts Submit a Shout out! Gratitude Grams Submit A Gratitude Gram Renaming Ceremony of Milele Chikasa Anana Elementary School Land Acknowledgement Ceremony Family News Top Stories Announcements Events In The News Resources School Spotlights Staff Spotlights Student Spotlights News Media Inquiries Newsletter Public Records Request Pupil Nondiscrimination Report Why Madison Why MMSD La Follette Attendance Area Information Request Strategic Framework 2019-20 Results Black Excellence Healthy food, healthy minds Student and Staff Support connect with community through social media series Virtual Learning Report Strategic Framework Recalibration 2022-2023 Annual Report Strategic Framework  - 2025 Meet the Superintendent Breakfast with Champions Superintendent's Impact Awards Superintendent Engagement Vision 2024 Referenda Frequently Asked Questions October 22 Virtual Information Session Sign Up 2024 Operational Referendum 2024 Facilities Referendum Public School Funding ACADEMICS Advanced Learning Arts Education Common Core State Standards Common Core State Standards = Opportunity Curriculum Dual-Language Immersion (DLI) Early College Biomedical Academy Early College Education Academy Early College Networking & Cybersecurity Academy Early College STEM Academy Early Learning Programs Early Learning Session Peer Program Infinite Campus Madison Promise Multilingual Programs & Services Personalized Pathways Running Start Academy Secondary Programs Special Education State Report Cards FOR FAMILIES After-School & Athletics American Sign Language Interpreting Services Attendance Back to School Behavior Education Plan Bullying Resources Anti-Bullying Reporting Form Anti-Bullying Resources for Students What to Expect After Bullying is Reported Calendars Community Schools About Community Schools Contact Us District Policy Guides Enrollment Family Newsletter Find Your School Food Pantries/Food Markets Graduation (High School) Health Services Immigrant Students & Families Infinite Campus Mad for Reading Understanding Act 20 Madison Promise Madison School & Community Recreation (MSCR) (opens in new window/tab) Meals Mental Health & Well-Being On-Track to Graduation Plan MMSD On-Track to Graduation Plan ParentSquare Parent Teacher Conferences Read Your Heart Out Culturally Responsive Books For Educators Multimedia Gallery Read Alouds RYHO 2025 Celebration Safety & Security Information School Supply Lists Start and Dismissal Times 25-26 School Start & Dismissal Times - All Schools Starting November 6 – Updated School Start & Dismissal Times Summer Programming MMSD Summer Resource Page Support Services Title IX Non-Discrimination Statement Title VI - Native American Education Tutoring Programs Transportation Weather Information Welcome Arts Events and Information DEPARTMENTS WORK WITH MMSD Donate (opens in new window/tab) Careers About Madison Pre-Service Teaching LEAD Madison Meet Our Principals Principal Screening and Selection Process SERVE Madison MMSD Substitute Services TEACH Madison External Research Facility Rentals Facility Rental Request Form For Vendors & Contractors Partnerships Volunteer Opportunities LOG IN ClassLink (opens in new window/tab) Email (opens in new window/tab) Incident IQ (opens in new window/tab) Infinite Campus Kronos (opens in new window/tab) Moodle (opens in new window/tab) Munis (opens in new window/tab) Professional Development Catalog Professional Learning Portal (opens in new window/tab) Staff Only Website (opens in new window/tab) ABOUT Building for the Future Attendance Areas Awards Big Ideas Board of Education Budget Building Excellence Calendars Construction Updates Contact Us Early Literacy and Beyond Task Force School Improvement Plans (SIP) MMSD News News Media Inquiries Newsletter Public Records Request Pupil Nondiscrimination Report Why Madison Why MMSD Strategic Framework Meet the Superintendent Vision 2024 Referenda ACADEMICS Advanced Learning Arts Education Common Core State Standards Curriculum Dual-Language Immersion (DLI) Early College Biomedical Academy Early College Education Academy Early College Networking & Cybersecurity Academy Early College STEM Academy Early Learning Programs Infinite Campus Madison Promise Multilingual Programs & Services Personalized Pathways Running Start Academy Secondary Programs Special Education State Report Cards FOR FAMILIES After-School & Athletics American Sign Language Interpreting Services Attendance Back to School Behavior Education Plan Bullying Resources Calendars Community Schools District Policy Guides Enrollment Family Newsletter Find Your School Food Pantries/Food Markets Graduation (High School) Health Services Immigrant Students & Families Infinite Campus Mad for Reading Madison Promise Madison School & Community Recreation (MSCR) (opens in new window/tab) Meals Mental Health & Well-Being On-Track to Graduation Plan ParentSquare Parent Teacher Conferences Read Your Heart Out Safety & Security Information School Supply Lists Start and Dismissal Times Summer Programming MMSD Summer Resource Page Support Services Title IX Title VI - Native American Education Tutoring Programs Transportation Weather Information Welcome Arts Events and Information DEPARTMENTS WORK WITH MMSD Donate (opens in new window/tab) Careers External Research Facility Rentals For Vendors & Contractors Partnerships Volunteer Opportunities LOG IN ClassLink (opens in new window/tab) Email (opens in new window/tab) Incident IQ (opens in new window/tab) Infinite Campus Kronos (opens in new window/tab) Moodle (opens in new window/tab) Munis (opens in new window/tab) Professional Development Catalog Professional Learning Portal (opens in new window/tab) Staff Only Website (opens in new window/tab) Select a School Elementary Schools Anana Chávez Crestwood Elvehjem Emerson Franklin Gompers Hawthorne Henderson Huegel Kennedy Lake View Lapham Leopold Lincoln Lindbergh Lori Mann Carey Lowell Marquette Mendota Midvale Muir Nuestro Mundo Olson Orchard Ridge Randall Sandburg Schenk Shorewood Hills Stephens Thoreau Van Hise Middle Schools Badger Rock Black Hawk Cherokee Heights Ezekiel Gillespie Hamilton O'Keeffe Sennett Sherman Spring Harbor Toki Whitehorse Wright High Schools Capital High East La Follette Memorial Shabazz West Search Clear Go Building for the Future Attendance Areas Awards Big Ideas Board of Education Jefferson Middle School Renaming Process Southside Elementary School Naming Process Safety and Student Wellness Ad Hoc Committee Board of Education Meetings Budget Building Excellence Calendars Religious Holiday Calendar 2024-2025 School Year Calendar 2025-2026 School Year Calendar Construction Updates Contact Us Early Literacy and Beyond Task Force School Improvement Plans (SIP) MMSD News Shoutouts Gratitude Grams Renaming Ceremony of Milele Chikasa Anana Elementary School Land Acknowledgement Ceremony Family News News Media Inquiries Newsletter Public Records Request Pupil Nondiscrimination Report Why Madison Why MMSD La Follette Attendance Area Information Request Strategic Framework 2019-20 Results Black Excellence Healthy food, healthy minds Student and Staff Support connect with community through social media series Virtual Learning Report Strategic Framework Recalibration 2022-2023 Annual Report Strategic Framework  - 2025 Meet the Superintendent Breakfast with Champions Superintendent's Impact Awards Superintendent Engagement Vision 2024 Referenda Frequently Asked Questions October 22 Virtual Information Session Sign Up 2024 Operational Referendum 2024 Facilities Referendum Public School Funding Home > ABOUT > Board of Education Board of Education About the Board of Education The Madison Board of Education is a seven-member policymaking body. Members are elected in April to serve staggered three-year terms in office. Our Strategic Framework lays out a roadmap for our work. Regular Board meetings are generally held on the last Monday of the month, beginning at 6 p.m. Special meetings and work groups typically hold meetings one a month. Contact the Board of Education To reach all seven board members, please use the following group e-mail address: board@madison.k12.wi.us . All Board of Education members will receive your email and may use it to inform their decisions and/or actions. Please know that a member of the Superintendent’s Team will receive and may respond to emails sent to this address. Meeting Agendas and Notices All Meeting Agendas and notices are hosted on BoardDocs (updated at noon on Fridays). Board Policies All board policies are hosted on BoardDocs. Board Meeting Access You can watch/listen to virtual meetings at the Madison Board of Education YouTube Channel . An archive of meetings is available as well. The community is invited to attend meetings in person at the Doyle Administration Building. Details about speaking to the Board or providing written comments during public input time are available on our website . Citizens' Ad Hoc Naming Committee - New southside elementary school Citizens' Ad Hoc Naming Committee - New southside elementary school Thanks to the community’s investment in our public schools during the 2020 referendum, the district constructed a new elementary school connected to Badger Rock Middle School. The new school, which opened fall 2023, has temporarily been called Southside Elementary until a permanent name is chosen. On Monday, May 6, the MMSD Board of Education voted to establish a 12-person committee for the purpose of naming the district's newest elementary school located at 501 E. Badger Road (currently referred to as Southside Elementary). The Ad Hoc Citizens’ Naming Committee is given the charge to follow Board Policy 6700 and move through the school naming process. This committee will follow the policy and make final recommendations to a Board of Education Work Group on the soonest date possible after the final meeting of this ad hoc committee. Southside Naming Webpage Watch Board Meetings Live on YouTube View Meeting Agendas and notices View Student Senate Board Reports Upcoming Meetings RSS Feeds Subscribe to Alerts Sep 15 2025 Operations Work Group 5 : 00 PM - 8 : 00 PM Sep 29 2025 Regular Board of Education Meeting 6 : 00 PM - 9 : 00 PM Oct 6 2025 Instruction Work Group 5 : 00 PM - 8 : 00 PM Oct 13 2025 Operations Work Group 5 : 00 PM - 8 : 00 PM Oct 27 2025 Regular Board of Education Meeting 6 : 00 PM - 9 : 00 PM Load More Events < September 2025 > Sun Mon Tue Wed Thu Fri Sat Sunday, August 31 Monday, September 1 Tuesday, September 2 Wednesday, September 3 Thursday, September 4 Friday, September 5 Saturday, September 6 Sunday, September 7 Monday, September 8 Tuesday, September 9 Wednesday, September 10 Thursday, September 11 Friday, September 12 Saturday, September 13 Sunday, September 14 Monday, September 15 Tuesday, September 16 Wednesday, September 17 Thursday, September 18 Friday, September 19 Saturday, September 20 Sunday, September 21 Monday, September 22 Tuesday, September 23 Wednesday, September 24 Thursday, September 25 Friday, September 26 Saturday, September 27 Sunday, September 28 Monday, September 29 Tuesday, September 30 Wednesday, October 1 Thursday, October 2 Friday, October 3 Saturday, October 4 Our Mission: Every school will be a thriving school that prepares every student to graduate from high school college, career and community ready. Board of Education Members To reach all seven board members, please use the following group e-mail address: board@madison.k12.wi.us . Members of the Madison Board of Education are elected in April and serve staggered three-year terms. Nichelle Nichols, President Maia Pearson, Vice President Blair Mosner Feltham, Treasurer Ali Janae Muldrow, Clerk Nicki Vander Meulen, Member Savion Castro, Member Martha Siravo, Member Claire Li, Student Representative Lily Shapiro, Alternate Student Representative Nichelle Nichols, President Nichelle Nichols Seat 5 Contact Information nichellenichols@madison.k12.wi.us 608-658-5252 School Assignments Elem:  Elvehjem, Huegel, Lake View, Van Hise Middle: Wright High:   East District-Wide: Shabazz Term Expires April 2028 Maia Pearson, Vice President Maia Pearson Seat 1 Contact Information mpearson2@madison.k12.wi.us 608-663-1659 School Assignments Elem:  Henderson, Lindbergh, Lori Mann Carey, Midvale, Schenk Middle: Sennett, Sherman High:  West Term Expires April 2027 Blair Mosner Feltham, Treasurer Blair Mosner Feltham Seat 6 Contact Information email: blfeltham@madison.k12.wi.us phone: TBD School Assignments Elem:   Crestwood, Franklin, Kennedy, Marquette, Orchard Ridge Middle:  Badger Rock, Toki District-Wide: IAE Term Expires April 2026 Ali Janae Muldrow, Clerk Ali Janae Muldrow Seat 4 Contact Information 2706 Milwaukee St. (53704) ajmuldrow@madison.k12.wi.us 608-213-6579 School Assignments Elem:  Chavez, Gompers, Lincoln, Mendota, Shorewood Middle: O’Keefe District- Wide: Metro Term Expires April 2028 Nicki Vander Meulen, Member Nicki Vander Meulen Seat 7 Contact Information 309 W. Washington Ave., Unit 204 (53703) nkvander@yahoo.com 608-332-2807 School Assignments Elem:  Emerson, Olson, Randall, Thoreau Middle: Black Hawk, Hamilton, Whitehorse District-Wide:  Memorial Term Expires April 2026 Savion Castro, Member Savion Castro Seat 2 Contact Information sjcastro@madison.k12.wi.us 608-800-1994 School Assignments Elem:  Anana, Hawthorne, Nuestro Mundo, Sandburg, Stephens Middle: Cherokee Heights District-Wide:  Capital High Term Expires April 2027 Martha Siravo, Member Martha Siravo Seat 3 Contact Information msiravo@madison.k12.wi.us 920-248-0969 School Assignments Elem:  Lapham, Leopold, Lowell, Muir Middle: Gillespie, Spring Harbor High:  La Follette Term Expires April 2028 Claire Li, Student Representative Claire Li Contact information: cjli2@madison.k12.iw.us School Assignments: All Schools Term Expires: June 2026 Lily Shapiro, Alternate Student Representative Lily Shapiro Contact Information lrshapiro@madison.k12.wi.us School Assignments All Schools Term Expires June 2026 Board of Education Standing Work Groups Instruction Work Group - Committee of the Whole Operations Work Group - Committee of the Whole Instruction Work Group - Committee of the Whole Chairperson Ali Muldrow Staff Liaison Cindy Green Work Group Description This work group will focus specifically on the mission of the School District and will address matters and issues leading to the improvement of student learning, including curriculum, instruction, assessment, and intervention, as well as topics related to educator effectiveness. Work will also include the ongoing review and revision of policies related to the range of subject matter encompassed within the Work Group's domain. Operations Work Group - Committee of the Whole Chairperson Savion Castro Staff Liaison Bob Soldner Work Group Description This Work Group will focus on financial management, including budget planning; building and facilities maintenance, operations, and planning; land/property transactions; and District administrative operations, including human resource systems issues such as the retention and hiring of staff and staff equity issues. Work will also include the ongoing review and revision of policies related to the range of subject matter encompassed within the Work Group's domain. Previous Board of Education Ad Hoc Committees Citizens' Ad Hoc Renaming Committee - Jefferson Middle School Safety and Student Wellness Ad Hoc Committee Citizens' Ad Hoc Renaming Committee - Jefferson Middle School February 27, 2023 Update: The MMSD Board of Education voted to rename Thomas Jefferson Middle School to Ezekiel Gillespie Middle School, by a vote of 6-0, with Nicki Vander Meulen recused. The new name goes into effect beginning with the 2023-2024 school year. Jefferson Renaming - More Information Safety and Student Wellness Ad Hoc Committee March 2023 Update : The Ad Hoc committee concluded its work in February 2023, sharing the committee's final recommendations at the March 13, 2023 Board of Education Operations Work Group Meeting . The Board of Education voted to officially receive the committee's recommendations at the March Regular meeting , held on March 22, 2023. The Board will continue to take up the recommendations during the budget process which concludes in June with a preliminary budget. This item will be part of the May 2023 Operations Work Group agenda as a separate discussion item. More Information Board of Education News and Weekly Updates Weekly Update to the Board of Education 8-28-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 8-21-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include BOE questions, DPI crime statistics on school property, 25-26 organization, great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 8-14-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include k-12 asterisk grading, shortened day data memo, proposed consent agenda, great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 8-7-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include health services 25-26 Nursing Assistant FTE adjustments, quarterly review of progress (QRP) Q2&Q3 summary, AGR contract renewals, 24-25 teacher support network impact report, 24-25 State testing opt-out report, great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 5-29-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include third quarter financials, great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 5-22-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include third quarter financials, great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 5-8-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 4-25-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include great things happening around MMSD and the upcoming Board calendar. Weekly Update to the Board of Education 4-17-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include handbook recommendations, ESSA final reports, proposed consent agenda, great things happening around MMSD, and the upcoming Board calendar Weekly Update to the Board of Education 4-3-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include second quarter financials, great things happening around MMSD, upcoming Board calendar, and U.S. mail policy perspectives. Weekly Update to the Board of Education 3-13-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include great things happening around MMSD and upcoming Board calendar. Weekly Update to the Board of Education 2-13-2025 This week's update include a letter from Superintendent Dr. Gothard. Other updates include answers to board members' questions; three year Special Education plan; proposed consent agenda; great things happening around MMSD, and upcoming Board calendar. Weekly Update to the Board of Education 1-30-2025 This week's update include a letter from Superintendent Dr. Gothard, great things happening around MMSD, and upcoming Board calendar. Weekly Update to the Board of Education 1-16-2025 This week's update include a letter from Superintendent Dr. Gothard, proposed consent agenda, great things happening around MMSD, and upcoming Board calendar. Weekly Update to the Board of Education 12-12-2024 This week's update include a letter from Superintendent Dr. Gothard, Metrics Meeting recording and agenda, TRAN interest expense premium and income memo, MMSD on-track to graduation plan report 2024, great things happening around MMSD, and upcoming Board calendar. Weekly Update to the Board of Education 11-21-2024 This week's update include a letter from Superintendent Dr. Gothard, answers to board members' questions, Operations Work Group Meeting health insurance follow up, Wisconsin Department of Public Instruction (DPI) report card release, great things happening around MMSD, and upcoming Board calendar. Weekly Update to the Board of Education 11-14-2024 This week's update include a letter from Superintendent Dr. Gothard, answers to board members' questions, 2024- 2025 First Quarter Financials, proposed consent agenda, great things happening around MMSD, upcoming Board calendar, and WASB Policy Perspectives. Weekly Update to the Board of Education 10-31-2024 This week's update include a letter from Superintendent Dr. Gothard, great things happening around MMSD and upcoming Board calendar. Weekly Update to the Board of Education 10-10-2024 This week's update include a letter from Superintendent Dr. Gothard, great things happening around MMSD and upcoming Board calendar. No Weekly Update to the Board of Education on 10-3-2024 No Weekly Update to the Board of Education on 10-3-2024 Weekly Update to the Board of Education 9-26-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include answers to Board members' questions; restraint and seclusion reporting; great things happening around MMSD; upcoming Board calendar; Policy Perspectives. No Weekly Update to the Board of Education on 9-19-2024 No Weekly Update to the Board of Education on 9-19-2024 Weekly Update to the Board of Education 9-12-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include the medical advisory team recording and agenda; great things happening around MMSD; upcoming Board calendar; and Madison's housing data, challenges and opportunities. Weekly Update to the Board of Education 9-5-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include great things happening around MMSD and upcoming Board calendar. Weekly Update to the Board of Education 8-29-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include great things happening around MMSD and upcoming Board calendar. Weekly Update to the Board of Education 8-22-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include answers to Board members' questions; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 8-15-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include a MEP report release; a construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 8-8-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include a MEP report release; a construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 8-1-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include a high-intensity partnerships update; a construction update; great things happening around MMSD; upcoming Board calendar; and WASBO Policy Perspectives. Weekly Update to the Board of Education 7-11-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates includes answers to Board members' questions;  a construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 6-27-2024 This week's update include a letter from Superintendent Dr. Gothard. Other information includes a construction update; great things happening around MMSD; upcoming Board calendar; and WASB Policy Perspectives. Weekly Update to the Board of Education 6-20-2024 This week's update include a letter from Superintendent Dr. Gothard. Other information includes a construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 6-13-2024 This week's update include a letter from Superintendent Dr. Gothard. Other updates include answers to Board members' questions; Southside naming ad hoc committee membership update; medical advisory team recording and agenda; a construction update; proposed consent agenda; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 6-6-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include a human resources update; 21st Century Learning Center award grant from DPI to La Follette High School; facilities recommendations memo; construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 5-30-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include a construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 5-23-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include quarter 3 financials; on-track to graduation implementation; construction update; great things happening around MMSD; upcoming Board calendar; and WASB Policy Perspectives. Weekly Update to the Board of Education 5-16-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include answers to Board members' questions; Q3 quarterly review of progress; edits to the Long Range Facilities Plan; transportation letter preview; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 5-9-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include the 2024 Long Range Facilities Update; construction update; proposed consent agenda; great things happening around MMSD; upcoming Board calendar; and WSAB Policy Perspectives. Weekly Update to the Board of Education 5-2-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include a construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 4-25-2024 This week's update include a letter from Interim Superintendent Kvistad and Board meeting timeline. Other updates include answers to Board members' questions; ESSA identification update; budget amendment process; new CTE middle school discovery program; construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 4-18-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include answers to Board members' questions; information requests; construction update; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 4-11-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include answers to Board members' questions; Instruction Work Group agenda changes; construction update; community feedback; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 4-4-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include answers to Board members' questions; Memorial ASE accreditation; construction update; community feedback; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 3-21-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include answers to Board members' questions; quarter 2 financials; Quarter 2 quarterly review of progress; salary compression; transportation updates; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 3-14-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include answers to Board members' questions; medical advisory team meeting information; construction updates; transportation updates; great things happening around MMSD; and upcoming Board calendar. Weekly Update to the Board of Education 3-7-2024 This week's update include a letter from Interim Superintendent Kvistad. Other updates include answers to Board members' questions; a human resources update; construction updates; transportation updates; proposed consent agenda; great things happening around MMSD; and upcoming Board calendar. < > 545 W Dayton St. Madison WI 53703 General Info: (608) 663-1879 Students & Families: (608) 663-5241 Community: (608) 663-5310 Staff: (608) 663-5266 Español: (608) 663-5428 Hmong: (608) 663-8433 Resources Calendars Careers Library Catalogs Madison School & Community Recreation (MSCR) (opens in new window/tab) Staff Directory Donate (opens in new window/tab) Staff Only (opens in new window/tab) Infinite Campus Contact Us Questions? Follow Us Instagram (opens in new window/tab) Facebook (opens in new window/tab) YouTube (opens in new window/tab) LinkedIn (opens in new window/tab) Copyright Privacy Policy Translation Disclaimer Web Accessibility Powered by Finalsite"
    },
    {
      "url": "https://novantapizzeria.com/about-us/",
      "text": "ABOUT US | Novanta Pizzeria CARRYOUT DELIVERY DELIVERY CARRYOUT DIY PIZZA MENU ABOUT US PICS Contact / Location DELIVERY DELIVERY CARRYOUT DIY PIZZA MENU ABOUT US PICS Contact / Location CARRYOUT About Us We are a Neapolitan pizzaria located in Madison, Wisconsin. Get Directions “Our dough is “rested” for at least 48 hours before it is shaped and baked.” Our Story We opened in June, 2013. Owned and operated by Nicholas Mattioli and his friends and family . We do things different because our family prides ourselves in bringing true Neapolitan taste to the Madison community. OUR NAME NOVANTA Novanta ® (or “ninety” in Italian) refers to the ever-important ninety seconds that our authentic Neapolitan pizzas bake in our stone ovens before they are served hot and fresh to you. ANCIENT RECIPE INGREDIENTS Our pizzas all start with dough, based on an ancient Italian recipe that includes water, salt, yeast and 00 flour .  Our dough is “rested” for at least 48 hours before it is shaped and baked.  We offer only the finest and the freshest ingredients and toppings, including house-made mozzarella cheese. OUR OVENS COOKING The cooking of the pizza is as crucial as our ingredients.  Our oven, imported from Italy, is a centerpiece of our restaurant and heats to the ideal 900°F.  This enables our pizzas to cook to absolute perfection with the benefit of “oven spring,” which is caused by air and water vapor rapidly expanding inside the stretchy network of interconnected flour proteins that is the Novanta ® dough.  This means our dough inflates quickly, and thus ensures each pizza is light and airy, and is simply delicious. AUTHENTIC NEAPOLITAN PIZZAS AND MORE Novanta ® is pleased to offer guests authentic Neapolitan pizzas,  insalate (salads), dolci (desserts), and a fine assortment of beverages. COUNTER / DELIVERY OR CARRY-OUT READY WHERE YOU ARE We have two locations for Delivery and Carryout The Best Pizza Places for Families “Modern eatery with a small patio for wood-fired pizzas with elevated toppings & select mozzarellas. The pizzas cook in 90 seconds!” ORDER DELIVERY AREA DELIVERY INFOTMATION Open hours Monday – Saturday: 11 a.m. – 9 p.m. Sunday: Closed Our Location 8452 Old Sauk Road ( near Junction Road ) (608) 831-7740 Facebook Instagram © 2025 Novanta®.  All Rights Reserved."
    },
    {
      "url": "https://madison.com/life-entertainment/local/food-drink/famous-yetis-stoughton-thc-pizza/article_089a2538-92e0-11ef-b0e4-83b9268b2427.html",
      "text": "Famous Yeti's co-owner explains how THC got into pizzas Skip to main content Skip to main content You are the owner of this article. Edit Article Add New Article Close You have permission to edit this article. Edit Close 71° Log In Subscribe Guest Logout Read Today's E-edition News Local Crime Politics Podcasts Education State & Regional Nation & World Markets & Stocks News Tip Obituaries Share a story Recent Obituaries Find an Obituary Archives Opinion Letters Editorial Columnist Cartoon Sports High School Badgers Brewers Bucks Packers Professional BadgerExtra Football Men’s basketball Women’s basketball Men’s hockey Women’s hockey Volleyball Recruiting History Lifestyles Arts & Theater Events Calendar Food & Dining Music Movies & TV Comics Puzzles Food & Cooking Home & Garden Health Parenting Fashion Pets Faith Contests Play Business Economy Employment Health Care Personal Finance Join the community News tip Share video Send a story Share a photo Brand Ave. Studios Podcasts Print Edition Cap Times E-edition Wisconsin State Journal E-edition E-edition Archives Display Ads Circulars Buy & Sell Place an Ad Jobs Deals Shop Local Promotions Public Notices Marketplace Display Ads Wisconsin Public Notices Shopping Customer Service Manage Subscription Activate Digital Subscription Newsletter sign-up Subscribe Contact Us Activate Full Access Help Center Gift Subscriptions Mobile Apps Weather: Live Radar Facebook Twitter Bluesky YouTube Pinterest Instagram © 2025 Lee Enterprises Terms of Service | Privacy Policy Subscribe Read Today's E-edition Subscribe Log In Welcome, Guest My Subscription Help Center My Account Dashboard Profile Saved items Logout E-edition News Obituaries Opinion Sports Puzzles Podcasts Dining Public Notices Cap Times WiscNews Jobs 71° Mostly Cloudy Share This Facebook Twitter Bluesky WhatsApp SMS Email Famous Yeti's co-owner explains how THC got into pizzas Live chat 0 Comments Share this Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save Alert Top Story Topical STOUGHTON | FAMOUS YETI’S Famous Yeti's co-owner explains how THC got into pizzas Samara Kalk Derby | Wisconsin State Journal Oct 26, 2024 Oct 26, 2024 0 Facebook Twitter Bluesky WhatsApp SMS Email Print Copy article link Save The co-owner of a pizza restaurant in Stoughton that accidentally sickened customers with THC said the mistake happened when a worker borrowed some oil from a neighboring business, not knowing that it had been infused with Delta-9, the active ingredient in marijuana. Cale Ryan opened Famous Yeti's with his wife, Caitlin Ryan, in 2012. CAITLIN RYAN Cale Ryan owns Famous Yeti’s Pizza with his wife, Caitlin Ryan. The couple also run a separate commercial kitchen used by other businesses, including one that makes products with CBD and Delta-9. When Famous Yeti’s ran short of olive oil for its pizza dough on Tuesday, one of the cooks went across the hall to borrow some, Ryan said. 8 great restaurants you can find at Madison-area gas stations “It’s not normal to do, but you borrow a cup of sugar from a neighbor,” he said. “We went over to borrow some oil and grabbed the wrong one.” People are also reading… Wisconsin’s Powerball jackpot winners and how much they won Bankruptcy to leave large retail space empty in Madison John Nolen Drive reconstruction starts next month. Here’s what to know 16-story student apartment building proposed near State Street City, developer clash over partly demolished building on West Wilson Street Former Green Bay Packers QB cited after bar altercation in Eau Claire UW-Madison parents hire surrogate mom to care for students at college Survivors group says Madison Diocese ignored complaints against priest accused of sex crimes WIAA moves state high school team wrestling tournament out of Madison Restaurant reviews: Back for seconds, a look at 4 recently visited spots Which Madison schools saw the most police calls last year? 2 Marquette men's lacrosse players killed in crash near campus 5 must-see Wisconsin state parks to visit this fall Madison says GPA determines who gets automatic admission to UW, regardless of number of students Attorney who represented murderer Barbara Hoffman dies at 92 Ryan said it was one batch of dough, which can make 60 pizzas. They’ve heard from about 20 customers already, he said. Between that feedback and what he’s learned from Public Health Madison and Dane County, Ryan said there have been about 30 reported instances so far. People get more high than sick, he said. “They get really stoned. They get intoxicated from the THC, so I think it’s more alarming than anything to feel that way. It’s basically eating an edible, but without knowing.” Dining Famous Yeti's Pizza is back, with an arcade Samara Kalk Derby | Wisconsin State Journal The Ryans have four young children, and Ryan said they didn’t have any of the THC-infused pizza. But he said some children were affected and reported dizziness and tiredness. Ryan, who was at the restaurant when his employee borrowed the oil, said he has cooperated with the health department and police department. “So it’s all about us responding to the public now.” In an update posted on its website Friday , Public Health said the oil the employee took was in a clear plastic jug that looked like other cooking oils. “There was a label on the cap that had manufacturer’s information, use by date, and noted it contained Delta-9 cannabis,” the statement said. “The operator did not notice the label on the cap. There was no additional labeling on the body of the bottle.” People can legally purchase hemp-derived Delta-9 THC in Wisconsin as long as the THC concentration is at or below 0.3% dry weight. Ryan said his tenant’s Delta-9 is legal in Wisconsin but didn’t name the tenant. “His product is on the level. He’s the person who makes soap.” Paramedics took five people to the hospital after they reported eating at Famous Yeti’s, the health department said. Because of the symptoms, responders initially suspected possible carbon monoxide exposure and checked the restaurant for that. “Our staff contacted the area hospital and talked to a patient, who said the feeling felt similar to eating a THC edible,” the Public Health post said. “The patient was tested for THC, which came back positive.” FAMOUS YETI'S PIZZA Ryan said the support from his customers has been overwhelming. “It’s unfortunate for sure. And more than anything it’s betraying the public trust, which we’ve worked so hard to keep that good image.” Possible THC-related symptoms include dizziness, increased blood pressure, increased heart rate, nausea, vomiting, anxiety, panic attacks, paranoia, hallucinations, short-term memory impacts, time distortion and sleepiness, according to Public Health. “Keep in mind each person’s reaction may be different, and the concentration of THC in the pizza can vary by piece,” the health department said in an earlier posting. Late last year, Famous Yeti’s moved about two miles from its nearly 12-year-old location to a spot inside the mixed-use Stoughton Wellness and Athletic Center, 2300 Highway 51, where since 2020 the restaurant has been renting a commercial kitchen. The commercial kitchen the Ryans run is called STACK, for Stoughton Area Cooperative Kitchen, and it hosts about 12 food entrepreneurs. The Ryans also own the more upscale restaurant Wendigo, 121 E. Main St., which they opened in 2014. Public Health is asking those who ate the pizza and got sick to complete an online questionnaire to help with its investigation. Dining Here are the best food carts in Madison, according to a city review Samara Kalk Derby | Wisconsin State Journal \"They get really stoned. They get intoxicated from the THC, so I think it's more alarming than anything to feel that way. It's basically eating an edible, but without knowing.\" 0 Comments Satisfy your cravings With our weekly newsletter packed with the latest in everything food. Sign up! * I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy . Samara Kalk Derby | Wisconsin State Journal Author email Follow Samara Kalk Derby | Wisconsin State Journal Related to this story THC was also in sandwiches, garlic bread at Famous Yeti's, health department says The health department said it does not plan to issue a citation against the restaurant and that the contamination was inadvertent. Famous Yeti's THC contamination sickened 85 people, final report says Nearly a third of people who consumed the THC-contaminated food went to the emergency room for symptoms, a final report from Public Health Mad… Close × Facebook Twitter Bluesky YouTube Pinterest Instagram Calendar Comics Obituaries Search Subscribe now Sites & Partners Wisconsin State Journal Cap Times WiscNews Madison Media Partners AmplifiedWisconsin ApplyMadison Wingra Printing Group Online Features Services Customer service: 800-362-8333 Manage your subscription Place a classified ad Submit a Celebration Contact Us Email Newsletters Work here Buy and Sell Jobs Homes Apartments Licensing Dealer Returns Shopping © Copyright 2025 Wisconsin State Journal , 1901 Fish Hatchery Rd Madison, WI 53713 Terms of Use | Privacy Policy | Advertising Terms of Use | Do Not Sell My Info | Cookie Preferences Powered by BLOX Content Management System from bloxdigital.com . Notifications Settings You don't have any notifications. Get up-to-the-minute news sent straight to your device. Topics News Alerts Subscribe Badger Sports Subscribe Breaking News Subscribe Crime Subscribe Politics Subscribe Back × You are logged in Switch accounts Secure transaction. Cancel anytime. Have an account? Log In Back × Sign Up Account processing issue - the email address may already exist User information Username (Optional) This is the name that will be used to identify you within the system. Choose wisely! * First name * Last name Your real name will be displayed next to your photo for comments, blog posts, and more! * Email Address Your email address will be used to confirm your account. We won't share it with anyone else. * Password Create a password that only you will remember. If you forget it, you'll be able to recover it using your email address. * Confirm Password Confirm your password. CAPTCHA Create Account or Sign up with Facebook Google Have an account? Log In × You're all set! Thank you . Your account has been registered, and you are now logged in. Check your email for details. OK Back × Log In Invalid password or account does not exist Email Address Password Forgot your password? Log In Email me a log in link or Sign in with Facebook Google Admin login Subscribe Need an account? Sign Up Back × Reset Password Submitting this form below will send a message to your email with a link to change your password. Email or Screen Name CAPTCHA Reset Password × Forgot Password An email message containing instructions on how to reset your password has been sent to the email address listed on your account. Back × Email me a log in link Account Email CAPTCHA Send Email Back × Promotional Offers Enter Promo Code Redeem No promotional rates found. Back × Purchase Gift Purchase Access × An error occurred × Secure & Encrypted Sign in with Email Address Continue with Email Address or Continue with Facebook Continue with Google What's your email address? Email Password Confirm password What's your name? First name Last name Who is this gift for? Recipient name Recipient email Optional message for the recipient Who is this gift from? Purchaser name Purchaser email Delivery date Delivery date What's your billing location? Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip Code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe What's your delivery address? Copy billing location Address City State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, Canada Zip code Country United States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary\nPeople's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Arab Emirates United Kingdom of Great Britain & N. Ireland Uruguay, Eastern Republic of Uzbekistan Vanuatu Venezuela, Bolivarian Republic of Viet Nam, Socialist Republic of Wallis and Futuna Islands Western Sahara Yemen Zambia, Republic of Zimbabwe Phone Subtotal: Total: How would you like to pay? Add New Card I Agree to the Subscription Terms of Use. This service will be automatically renewed and your credit card billed once it nears expiration. Secure transaction. Secure transaction. Cancel anytime. × You're all set! Thank you . Your gift purchase was successful! Your purchase was successful, and you are now logged in. A receipt was sent to your email. OK × An error occurred This offer is currently unavailable. Close"
    },
    {
      "url": "https://papaspizzacompany.com/contact/",
      "text": "Contact – Papa's Pizza Company Home Menu Our Menu Order Online Features About Us Our Services News Contact Events Mission Hill 617.648.7272 Order Online Mission Hill Close Home Menu Our Menu Order Online Features About Us Our Services News Contact Events 617.648.7272 Info@PapasPizzaCompany.com Order Online get in touch Contact Info Get in touch with any questions or to set up a catering service! We kindly ask that you provide us with at least one days notice for catering. Feel free to call us or fill out the contact form below. 682 Huntington Avenue Boston Ma 02115 Open 7 Days/Week from 10:30 am to 1:00 am 617-648-PAPA (7272) Find us on Facebook Follow Us on Twitter Follow Us on Instagram Stay in Touch I agree that my submitted data is being collected and stored. For further details on handling user data, see our Privacy Policy Send Message Share this: Click to share on X (Opens in new window) X Click to share on Facebook (Opens in new window) Facebook Like this: Like Loading... Spoonless Ventures LLC © 2017 All Rights Reserved Terms of Use and Privacy Policy TO TOP %d"
    },
    {
      "url": "https://valentinaspizzeria.com/",
      "text": "Original Valentina's Pizzeria & Wine Bar - Madison, AL × Order your favorite dishes in seconds! Order Online × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! The NFL is Back! - Catch every big NFL game with us! Call to Inquire The NFL is Back! - Catch every big NFL game with us! Skip to Main Content (256)-325-2240 info@valentinaspizzeria.com 25783 Huntsville Brownsferry Road                                                          , Madison Menu Drinks Specials Order Parties Catering Jobs Gift Cards In The News About Us Twitter page Facebook page Instagram page Yelp page Toggle navigation Twitter page Facebook page Instagram page Yelp page Menu Drinks Specials Order Parties Catering Jobs Gift Cards In The News About Us map marker pin 25783 Huntsville Brownsferry Road, Madison, AL 35756 welcome to Original Valentina's Pizzeria & Wine Bar Huntsville's authentic pizzeria Growing up in an Italian-American home, Joe Carlucci’s grandmother spoke words of wisdom to her grandson. She would say, “Add in some passion when you cook.  You are not just cooking to eat, you are cooking to see the smiles of your family and friends.” Those special words from his cherished Nanny would stay with Joe his whole life. Joe imagined the day when he would carry on this tradition with a child of his own—and today his dream has been fulfilled. A little bit of Nanny, and a whole lot of love is being passed down to his beloved daughter Valentina.  She has been in the kitchen with her daddy since she could crawl. Her passion to learn and serve others is something that comes from her heart.  With Joe and Valentina pouring the love of family and friends into Valentina’s, everyone who breaks bread here is family. They invite you to come and eat, making your own traditions and memories with your family and friends. private events We host. You party! Not only are we professional caterers, but we are also experienced event planners.  Our all-in-one packages are designed with your budget in mind, meaning all you have to do is enjoy the event. Parties treat yourself Order your favorites online Order award-winning pizza 2x Best Pizza in the World, Pizza Maker of the Year, and 2x Guinness World Record Holder. Our Menu We cater! catering high quality ingredients order Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing we cater! Let us cater your next event Original Valentina's Pizzeria & Wine Bar would be honored to provide our services for your next event. Each event is bespoke to your tastes and needs, to provide the best experience possible for you and your guests. catering Join us today Visit us for authentic Italian food book a table Child chef spreading tomato sauce over pizza dough Child tossing pizza dough chef throwing dough The owner stretching pizza dough Beer, red wine, whisky and bourbon Cheesecake, with raspberry drizzle Putting cheese on the dough Whisky neat and on the rocks Making pizza dough Bottles and a glass of red wine Slicing a pepperoni pizza Smiling child chef standing in front of a pizza oven Front view to entrance of restaurant Fried goat cheese balls on a bed of arugula, with a side of hot honey Top-down view of Italian desserts including tiramisu and cannoli Dish and wine Triple chocolate mousse cake Cheesy garlic bread with marinara dipping sauce and herbs Assorted Italian dishes on a wooden table Calzone with melted cheese and marinara sauce Triple Chocolate Mousse Meatballs in marinara sauce with bread slices Bruschetta with tomatoes, cheese, and balsamic glaze Exterior of Valentina's Pizzeria and Wine Bar Child chef stretching pizza dough Pizza chef working at a brick pizza oven Restaurant interior with a mural of a smiling child chef and pendant... Chicken Parmesan Bartender smoking craft cocktails with a smoke gun Child chef holding a pizza on a peel Chef smiling and posing with their arms crossed Tiramisu served in an elegant glass cup Cheesy garlic bread with marinara sauce and herbs served on a wooden... Honey being drizzled over a charcuterie board with meats, cheeses,... Red wine being poured into a glass Marinara sauce being drizzled over cheesy garlic bread Tiramisu dessert Cheesy garlic breadsticks with herbs and marinara sauce Freshly baked vegetable pizza with a blurred chef baking in the... Prosciutto with burrata, arugula, and diced tomatoes Chocolate cannoli filled with vanilla cream and dusted with powdered... Marinara sauce poured over cheesy garlic breadsticks A bartender shaking a cocktail House-made Meatballs Eggplant Rollatini Classic Old Fashioned Moscow Mule Cannoli Flight Classic Daiquiri award-winning pizza Reviews Review by - Yelp Michael R: Had a lovely experience here. Got seated quickly, server was extremely friendly and nice. Food was phenomenal! It was a show just watching them make pizzas and baking them like it was nothing special. Every single pizza looked delicious and makes us want to come back really soon. We will be trying everything on the menu. Easily the best pizza place in the Huntsville Madison area and worth the drive no matter how far. Review by - Yelp Robert R: If you enjoy great NY style wood fired Napolitano pizza this is the best place in Huntsville/Madison for fantastic pizza. Salads, and meatballs are very good as well, and the cannoli's are awesome! Staff is friendly, service is excellent, and the owner is hands on, and involved in all aspects of the operation, and it shows. Review by - Yelp Robin Y: Got there on a Thursday around 5:30 and was immediately seated! Service was great- waiter was knowledgeable and helpful. Food was fresh, the garlic knots are the best we have ever had and the marinara sauce was definitely home made and fresh, so good! Pizza was great and the crust was perfect. We will be back! Review by - Yelp Futien J: WOW!!  As a Chicago native, this nails it!  We came by as a recommendation by friends and we couldn't be any more thankful!  The pizza was so light , crisp and flavorful.  It's been a long time since I've enjoyed a pizza like this!  The staff and owner were very gracious and so friendly.  This is my news favorite! Review by - Yelp Steve B: Amazing all around, service food, environment, cleanliness. Best Pizza in all off Alabama!!! Hands down!! I only eat pizza here at any time. Stop reviews carousel Play reviews carousel Newsletter Location 25783 Huntsville Brownsferry Road Madison, AL 35756 Hours Fri 4:00 PM - 9:00 PM Sat 12:00 PM - 9:00 PM Tue, Wed, Thur 4:00 PM - 8:00 PM Find us on... Twitter page Facebook page Instagram page Yelp page Contact us (256) 325-2240 info@valentinaspizzeria.com Order Parties Catering Jobs × Newsletter We strive to make our website accessible to everybody. Learn More."
    }
  ]
}