{
  "fuentes": [
    {
      "url": "https://www.hideawaybeachmaldives.com/contact/",
      "email": "reservations@hideawaybeachmaldives.com"
    },
    {
      "url": "https://parkavemagazine.com/upscale-magic-show-opens-at-casa-monica-resort-spa/",
      "email": "chico_7_530x@2x-300x200.jpg"
    },
    {
      "url": "https://parkavemagazine.com/upscale-magic-show-opens-at-casa-monica-resort-spa/",
      "email": "chico_7_530x@2x-768x512.jpg"
    },
    {
      "url": "https://parkavemagazine.com/upscale-magic-show-opens-at-casa-monica-resort-spa/",
      "email": "chico_7_530x@2x.jpg"
    },
    {
      "url": "https://www.kesslercollection.com/casa-monica/contact-us/",
      "email": "cmhinfo@kesslercollection.com"
    },
    {
      "url": "https://www.kesslercollection.com/casa-monica/contact-us/",
      "email": "gvl_textured_hero@2x.jpg"
    },
    {
      "url": "https://www.kesslercollection.com/casa-monica/contact-us/",
      "email": "icon_question@2x.png"
    },
    {
      "url": "https://www.kesslercollection.com/casa-monica/contact-us/",
      "email": "slider_arrow_next@2x.png"
    },
    {
      "url": "https://www.kesslercollection.com/casa-monica/contact-us/",
      "email": "slider_arrow_prev@2x.png"
    },
    {
      "url": "https://www.kesslercollection.com/casa-monica/contact-us/",
      "email": "white_marble@2x.jpg"
    },
    {
      "url": "https://www.visitstaugustine.com/event/magic-hideaway",
      "email": "boxoffice@magichideaway.com"
    }
  ],
  "mails": [
    "boxoffice@magichideaway.com",
    "chico_7_530x@2x-300x200.jpg",
    "chico_7_530x@2x-768x512.jpg",
    "chico_7_530x@2x.jpg",
    "cmhinfo@kesslercollection.com",
    "gvl_textured_hero@2x.jpg",
    "icon_question@2x.png",
    "reservations@hideawaybeachmaldives.com",
    "slider_arrow_next@2x.png",
    "slider_arrow_prev@2x.png",
    "white_marble@2x.jpg"
  ],
  "nombre_sitio": "magichideaway.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hideawaybeachmaldives.com/contact/",
      "text": "Contact Hideaway Beach Maldives & Newsletter Sign-up ☰ Untouched Maldives Villas Beach Villas Water Villas Signature Residences Experiences Spa & Wellness Dining Sports & Fitness About Offers Blog Contact Us What’s On FAQ Gallery Getting Here Factsheets Facilities Awards Wellness Dining Experiences hide hide Villas Offers Contact Book Now Menu Menu Contact Us Book your Hideaway Escape to your little hidden corner of the world, at Hideaway Beach Resort. Experience luxury, serenity, and adventure in the heart of the Maldives. Get In Touch With Us Please fill out the form below to contact us and we will do our best to get back to you as soon as possible. Your Name * E-Mail * Telephone Your Message * 1 + 1 = ? Please prove that you are human by solving the equation * If you are an influencer and would like to get in touch with the team please use the form here. Contact us now to start planning your unforgettable getaway. Hideaway Beach Resort & Spa Haa Alifu Atoll, Dhonakulhi Island Maldives +960 6501515 reservations@hideawaybeachmaldives.com +960 7244544 Request a Call Back We Are Social Why not follow us on Facebook, Twitter, Instagram and other social media platforms and be the first to know about what’s going on in your favorite paradise Hideaway. Subscribe to Our Newsletter Subscribe to our monthly newsletter and receive updates about happenings and special offers right into your mailbox. Getting to Hideaway Our friendly and dedicated team will greet you at Velana International Airport and assist you in your onward transfer by either a domestic flight or seaplane. Domestic flights are with Maldivian Airlines to Hanimadhoo International Airport and takes just 55 minutes; from there, it’s a 15-20 minute scenic speedboat ride to Hideaway Beach Resort & Spa in the Maldives. Guests opting for a seaplane transfer will embark on a direct 75-minute picturesque journey to the Untouched Maldives which will be a ride to remember – make sure cameras are ready on these scenic rides and get the best view of the Maldives! Know More > Where comfort meets seclusion – Hideaway offers the ultimate escape Book Now Offers Gallery Talk to us reservations@hideawaybeachmaldives.com +960 650-1515 Factsheet FAQ Sustainability Getting Here Gallery Gifts “Leading Honeymoon Resort in the Maldives” – World Travel Awards “Best Family Resort (Indian Ocean)” – Haute Grandeur Award Contact Privacy Careers Sitemap Download App Book Now Scroll to top"
    },
    {
      "url": "https://parkavemagazine.com/upscale-magic-show-opens-at-casa-monica-resort-spa/",
      "text": "Upscale Magic Show Opens At Casa Monica Resort & Spa Winter Park FL, 32789 hello@parkavemag.com Facebook Twitter Youtube Home Articles Central Florida News Food Reviews Family Fun Entertainment Events Submissions Submit Art & Writing Submit an Article Submit An Event Contact Advertise Privacy Policy Terms and Conditions #SeenAroundTown Home Articles Central Florida News Food Reviews Family Fun Entertainment Events Submissions Submit Art & Writing Submit an Article Submit An Event Contact Advertise Privacy Policy Terms and Conditions #SeenAroundTown Central Florida , Latest News Upscale Magic Show Opens At Casa Monica Resort & Spa By emma June 6, 2022 Upscale Magic Show Opens At Casa Monica Resort & Spa Bill Abbott’s mind-bending performance, Magic Hideaway, is St. Augustine’s newest experience! ST. AUGUSTINE, Florida (May 31, 2022) Upscale Magic Show Opens At Casa Monica Resort & Spa. When Magician Bill Abbott and his wife, Rebecca, moved from Toronto, Canada to St. Augustine four years ago, they knew that the Oldest City would be the place where they would bring Bill’s lifelong dream of creating an upscale, intimate magic show to reality. This weekend, Magic Hideaway, a boutique two-hour magic experience. Opens at the iconic Casa Monica Resort & Spa. For the months of May and June. The performances will be held each Friday and Saturday evening at 8:30pm and after June 30th, will be held every Thursday, Friday, and Saturday evening at 6pm and 8:30pm. Over 5,000 shows “I have performed over 5,000 shows in 11 countries around the world. The best shows are always the ones in intimate settings where I am able to interact with guests and create a magical environment,” explained Magician Bill Abbott. “That is what Rebecca and I have created here. We have worked directly with Richard Kessler, Chairman and CEO of The Kessler Collection. Which owns Casa Monica, and the hotel’s staff, who have been absolutely amazing, to create this one-of-a-kind experience.” Once guests have arrived at the Casa Monica, they choose from a menu of complimentary magic-themed welcome cocktails. To enjoy in the opulent Cobalt Lounge. With exclusive access to the VIP area where Bill Abbott will entertain with pre-show sleight of hand magic before everyone is ushered by House Manager Rebecca Abbott into the Magic Hideaway showroom. Styled after a vintage jazz club, the showroom is a 22-seat venue featuring glowing crystal balls. And Moroccan chandelier, majestic palms, and carefully arranged seating so everyone is within touching distance of the magic. Once the house lights dim, Bill Abbott takes the stage to perform one of the most intimate magic shows in the world featuring interactive, mind-bending illusions. “Magic is meant to transport you to a different headspace and to keep you living in the moment,” explained Bill. “During my show, I perform a type of magic called sleight of hand as well as a psychological-based mental-ism. I also lean on my born showmanship, sarcasm, improve skills, and dry humor to entertain the audience. By the end of the show, the entire room becomes connected. Magic Hideaway is a collective experience.” About Bill Abbot Recently named Canadian Magician of the Year by Canadian Association of Magicians, Bill has created magic illusions and effects for “America’s Got Talent” and “The Steve Harvey Show”. As well as networks and streaming services such as The Disney Channel, Netflix, FOX, and NBC. Over the past few years, Bill has headlined the most exclusive boutique venues across the United States with performances at the Chicago Magic Lounge. The House of Cards in Nashville, and the world-famous Magic Castle in Hollywood. About Magic Hideaway Opened in 2022 by Bill and Rebecca Abbott, Magic Hideaway is an intimate, upscale, adult-geared magic experience held in the Cobalt Lounge at Casa Monica Resort & Spa, located at 95 Cordova Street in downtown St. Augustine, Florida. Tickets are $125 per person and include a welcome cocktail, Cobalt Lounge VIP Access, Pre-Show Sleight of Hand, Magic Hideaway Showroom Experience, and Post-Performance Social for autographs and photos. Starting June 30th, shows will be held every Thursday, Friday, and Saturday at 6pm and 8:30pm. Tickets and additional info are available at magichideaway.com. Follow along on social media Facebook @themagichideaway and Instagram @magichideaway. THE MAGIC WORD RECIPE – A twist on a Prohibition-era classic cocktail called The Last Word. The Magic Word is an original creation by the food and beverage team at Casa Monica Resort & Spa and is included on the special Magic Hideaway cocktail menu. The Magic Word 1.25 oz St. Augustine Distillery Gin 1.25 oz Lime Juice oz Green Chartreuse 1.25 oz Disaronno Amaretto Instructions: Add all ingredients to a shaking tin full of ice and shake vigorously. Double strain into a coup or martini glass and add citrus Flavor Blaster Bubble to top with a commercial-grade bubble gun. When served, say your favorite magic word, and pop the bubble with your wand to drink. Park Ave Magazine Want to be a part of the conversation with Park Ave Magazine? Be sure to check out our newest blogs, articles and events going on in your local community. The magazine is full of exciting articles, art, photography, and trivia about the city of Winter Park and surrounding areas in Central Florida. We would like to thank everyone who has put time and effort to bring Park Ave Magazine to life. We encourage all our local friends to do your part to keep us updated with information you would like to see us cover. With new events, articles, and information being released, sign up for our newsletter and stay in the loop with everything. Meet all the wonderful people that make Winter Park, Orlando, and the areas around Central Florida an incredible place to work, play, and live. Check it out yourself at https://parkavemagazine.com/ Tags Share this post: emma Related Posts Subconscious Harmonics: Rewiring Your Mind for Peak Performance and Lasting Success April 18, 2025 Is a Samurai Sword and a Katana the Same? April 3, 2025 Safety Improvements Underway Along Orange Avenue in Winter Park December 30, 2024 New Year’s Eve in Orlando: Events, Ball Drops, and Midnight Toasts December 28, 2024 Latest Posts Subconscious Harmonics: Rewiring Your Mind for Peak Performance and Lasting Success Read More » April 18, 2025 Is a Samurai Sword and a Katana the Same? Read More » April 3, 2025 Safety Improvements Underway Along Orange Avenue in Winter Park Read More » December 30, 2024 New Year’s Eve in Orlando: Events, Ball Drops, and Midnight Toasts Read More » December 28, 2024 Orlando City Soccer Reveals 2025 Regular Season Schedule Read More » December 27, 2024 Cendrillon [Cinderella] Takes The Stage Of Steinmetz Hall Read More » December 27, 2024 About Us Find the updates on everything in Winter Park and the Orlando area, right here. With constant updates from us; you, family, and friends can truly live the life that the wonderful city of Winter Park has to offer. Facebook Twitter About Us Park Ave Magazine is proud to be your local guide for the Winter Park and Central Florida areas. Facebook Twitter Youtube Latest Posts Subconscious Harmonics: Rewiring Your Mind for Peak Performance and Lasting Success Is a Samurai Sword and a Katana the Same? Safety Improvements Underway Along Orange Avenue in Winter Park Submissions Submit Art Submit Writing Submit An Article Submit An Event hello@parkavemag.com Links Home Articles Events Advertising Contact Copyright © 2024 Park Ave Magazine. All Rights Reserved. | Privacy Policy & Terms & Conditions Stay In Touch - don't miss the fun!"
    },
    {
      "url": "https://www.kesslercollection.com/casa-monica/contact-us/",
      "text": "Contact | Casa Monica Resort & Spa Skip to content Hotel Accommodations Amenities Dining Local Area Happenings Hotel Services Accessibility Contact Exceptional Events Meetings Weddings Inspired Experiences Art Gallery Live Music Poseidon Spa Gallery Sign Up Book Now Hotel Accommodations Amenities Dining Local Area Happenings Hotel Services Accessibility Contact Exceptional Events Meetings Weddings Inspired Experiences Art Gallery Live Music Poseidon Spa Gallery Sign Up Book Now 904.827.1888 95 Cordova Street St. Augustine, FL 32084 Connect with us. We’ll help plan your stay, create your event or answer any questions you may have. Hotel 904.827.1888 Fax 904.819.6065 Address 95 Cordova Street St. Augustine, FL 32084 Name* Your Email* Subject Your Message Accommodations Amenities Dining Local Area Meetings Experiences Art Gallery Poseidon Spa Accessibility Hotel Services Leave a Review Contact 904.827.1888 95 Cordova Street St. Augustine, FL 32084 Sign up and be first Get our best offers and newest updates Facebook Instagram The Kessler Collection Hotels About Grand Bohemian Gallery Careers Copyright © 2025 The Kessler Collection. All rights reserved. Privacy Policy Book Your Stay × Check-in Check-out Nights 1 2 3 4 5 6 7 8 9 My Dates are Flexible MY DATES ARE FLEXIBLE Rooms 01 02 03 Guest/Room 01 02 03 Marriott Bonvoy Use Marriott Bonvoy USE MARRIOTT BONVOY Find Rooms Sign Up × Sign up Submit your information and stay up to date on all of the latest news, offers and promotions, exclusively from the Casa Monica Resort & Spa. RFP × var options = {};\r\noptions.display = \"inline\";\r\noptions.key = \"95e71e41-54a0-44c4-f9a5-341060f2d175\"; \r\noptions.uid = \"G8TXK\";\r\noptions.button = \"custom\";\r\noptions.button_icon_size = \"0\";\r\noptions.button_text = \"Request Proposal\";\r\noptions.button_text_style = \"margin-bottom: 20px; padding: 12px; background-color: #977E45; color: #ffffff; border: 2px solid #ffffff;\";\r\nvar srfp_widget = new srfp.widget(options);"
    },
    {
      "url": "https://www.visitstaugustine.com/event/magic-hideaway",
      "text": "Magic Hideaway: Magic Show | Visit St. Augustine Skip to main content Weddings Map & Guide Request Visitor's Info Things to Do ALL Things to Do Attractions Coupons & Deals Family Fun Ghost Tours Golfing Museums Night Life Recreation Shopping Tour Services Transportation Water Tours Weddings ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Camping Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events Seasonal Events ALL Events Featured Events Sing Out Loud Music Festival Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Local Things to Do Food Events Event Venues Live Music ALL Live Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Places of Worship Real Estate Services Schools Utilities Search Magic Hideaway: Magic Show Jaw-dropping magic and mind reading at the Casa Monica Resort and Spa. Saturdays - Select Dates | 6:00 p.m. and sometimes 8:30 p.m., too. View Website (904) 826-6763 Magic Hideaway: Magic Show (904) 826-6763 Enter through the Cordova Lounge 95 Cordova St. St. Augustine, FL 32084 View Google Map Share This +7 more For date night or a vacation with friends, it's hard to beat Master Magician Bill Abbott's astounding magic and mind-reading show at the Casa Monica Resort and Spa. Magic Hideaway The setting for this evening of magic and mind-reading is an intimate theater draped with red velvet in the Casa Monica Resort and Spa. There, Bill Abbott dazzles the audience during an entertaining and surprising show. About Bill Abbott Bill launched his career in Toronto, where he perfected his \"close-up\" magician act. He has been named Canadian Magician of the Year by the Canadian Association of Magicians and has performed in thousands of shows in 11 countries. Bill has performed in venues of every size, headlining at the Chicago Magic Lounge, the Magic Castle in Hollywood, and the House of Cards in Nashville. More recently, he and his wife, Rebecca, have created an intimate magic show in a small, luxurious theater in the Casa Monica Resort and Spa. What to Expect Expect the unexpected in this one-person magic show, and there are some things you can count on. Arrive at 6:00 p.m. and check in for exclusive access to the VIP area. Your ticket entitles you to a complimentary cocktail and the opportunity to enjoy Bill's pre-show sleight-of-hand at your table. The House Manager will invite you into the Magic Hideaway, where Bill's magic and mind-reading will astound you. After the show, the evening ends with the opportunity to meet Bill for a photo and an autograph. See what Magic Hideaway guests have said about their experience. When: Depending on the time of year, Magic Hideaway shows are held on Friday and Saturday, or Saturday only, at 6:00 p.m. The schedule varies, and on select weeks, there are shows at 8:30 p.m. as well. Where: Casa Monica Resort and Spa, 95 Cordova Street, St. Augustine, Florida 32084. Parking: Valet parking at Casa Monica Resort and Spa is $25.00. If you order dinner entrees from the Cordova Restaurant, you pay only $5.00 for valet parking. Alternatively, parking can be found on the street and at various parking lots throughout Historic Downtown. Be sure to leave time to park and get to the Casa Monica in time to check in with the Magic Hideaway host. Additional information: Cameras and smartphones may not be used during the show. There is time for photos with the magician at the cocktail reception and after the show. There is no dress code. Many choose to wear business casual or cocktail attire. The show is appropriate for children. Children age 12 and younger must be accompanied by an adult. Magic Hideaway: Magic Show (904) 826-6763 Enter through the Cordova Lounge 95 Cordova St. St. Augustine, FL 32084 Share This Profile Keywords Live Performance All Events Live Entertainment Historic Downtown cocktails Have a Question? Your Name Your Email Address Your Message Related Events Today Sep 11 Live Music on Thursdays Every Thursday Restaurants and bars that offer live music on Thursdays throughout the year. Today Sep 11 View Website View Profile Lightner Museum: Transferware by Paul Scott Thursday, Apr. 24 - Monday, Oct. 27, 2025 | 9:00 a.m. - 5:00 p.m. An art exhibit showcasing reworked pieces from the past to tell stories of today. Today Sep 11 View Website View Profile Lenny Foster: Magnolia Season Friday, Jun. 6, - Sunday, Sep. 14, 2025| 9:00 a.m. - 5:00 p.m. The Lightner presents photos of magnolias taken by local photographer Lenny Foster. Today Sep 11 View Website View Profile American Stories: Paintings and Sculpture from the Lightner Museum Monday, Jul. 14, 2025 - Wednesday, May 27, 2026 | 9:00 a.m. - 5:00 p.m. Pieces from the museum's collection highlighting American art in the 1800s and 1900s. Today Sep 11 View Website View Profile Lightner Museum: Vintage Bicycles Friday, Nov. 22, 2024 - Ongoing | 9:00 a.m. - 5:00 p.m. This rotating and ongoing exhibit will delight cyclists, engineers, and those who see art in design. Today Sep 11 Sandra FitzSimmons Presents \"Native Flora, Fauna, and Fantasy\" Friday, Aug. 1, 2025 - Thursday, Oct. 2, 2025 | 10:00 a.m. - 4:00 p.m. Celebrating the natural beauty of the Florida coast through artwork. Related categories Featured Events Festivals Live Entertainment Arts & Culture Sports & Outdoors For Kids Historical Seasonal Show 3 more Show 3 less Food Local Things to Do Fundraisers Editor's Note: We encourage you to verify event times and details with the organizers, as they may change. Request Visitor Information Request St. Augustine FREE information, direct to your inbox. Request Information Things to Do ALL Things to Do Attractions Tour Services Night Life Recreation Shopping Weddings Places to Stay ALL Places to Stay Bed & Breakfasts Condos & Resorts Hotels & Motels Pet Friendly Vacation Rentals Waterfront Eat & Drink ALL Restaurants Seafood Fine Dining Bar / Lounge / Pub Breakfast Family Fare Food Trucks Events ALL Events Featured Events Live Music Festivals Concerts Local Events Seasonal About Us About Visit St. Augustine Request Visitor Info Accessibility Statement Advertise with Us List your Business Submit an Event Map & Guide © 2003-2025 Visit St. Augustine — Designed & hosted by St. Augustine Web Design in beautiful St. Augustine Florida . Home Things to Do ALL Things to Do Attractions Family Fun Ghost Tours Golfing Tour Services Specialty Tours Shopping Museums Night Life Recreation Transportation Weddings LIVE Music ALL Categories Places to Stay ALL Places to Stay Bed and Breakfasts Condos and Resorts Hotels / Motels Pet Friendly Vacation Rentals Waterfront Camping Eat & Drink ALL Restaurants Bars & Pubs Breakfast Family Dining Fine Dining Food Trucks Happy Hour Seafood Spanish ALL Categories Events ALL Events 4th of July Fireworks Featured Events Festivals LIVE Music Live Entertainment Arts & Culture Historical Events Sports & Outdoors For Kids Weddings Seasonal Events Local Things to Do Food Events Event Venues LIVE Music ALL LIVE Music Blues Bluegrass Caribbean Comedy Country Easy Listening Electronic Folk Hip Hop Jazz Latin Pop R&B Rock Relocation Moving to St. Augustine? Featured Communities Neighborhoods Regions Guide Apartments Homes Construction Contractors Government Services Healthcare Home Services Lenders Real Estate Services Schools Utilities Deals & Coupons ALL Deals Attractions Hotels Night Life Recreation Restaurants Shopping Tour Services Weddings About Us Map & Guide"
    }
  ]
}