{
  "fuentes": [
    {
      "url": "https://mainstreet.org/",
      "email": "info@mainstreet.org"
    },
    {
      "url": "https://www.mainstreetinc.com/contact-us-submission/",
      "email": "mssystemadmin@mainstreetinc.com"
    },
    {
      "url": "https://www.mainstreetinc.com/contact-us-submission/",
      "email": "contact@mainstreetinc.com"
    },
    {
      "url": "https://www.mainstreet.org/about/our-team",
      "email": "info@mainstreet.org"
    },
    {
      "url": "https://www.mainstreetwh.com/contact/",
      "email": "anita@mainstreetwh.com"
    },
    {
      "url": "https://mainsttravel.com/contactUs",
      "email": "sales@mainsttravel.com"
    },
    {
      "url": "https://www.mainstcapital.com/",
      "email": "info@mainstcapital.com"
    },
    {
      "url": "https://mainstreetmanagers.com/",
      "email": "info@mainstreetmanagers.com"
    },
    {
      "url": "https://www.mainstreetwh.com/business/gourmet-goodies/",
      "email": "info@ggcupcake.com"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "email": "info@safehavencommunityservices.org"
    },
    {
      "url": "https://www.mainstreetwh.com/membership/benefactors/",
      "email": "ideas@sixtenllc.com"
    },
    {
      "url": "https://www.villagerealtyrental.com/contact",
      "email": "villagerltyoff@aol.com"
    },
    {
      "url": "https://www.villagerealtyrental.com/contact",
      "email": "leasing@863rentals.com"
    },
    {
      "url": "https://www.mainstreetwh.com/business/six-ten-llc/",
      "email": "ideas@sixtenllc.com"
    }
  ],
  "mails": [
    "anita@mainstreetwh.com",
    "contact@mainstreetinc.com",
    "ideas@sixtenllc.com",
    "info@ggcupcake.com",
    "info@mainstcapital.com",
    "info@mainstreet.org",
    "info@mainstreetmanagers.com",
    "info@safehavencommunityservices.org",
    "leasing@863rentals.com",
    "mssystemadmin@mainstreetinc.com",
    "sales@mainsttravel.com",
    "villagerltyoff@aol.com"
  ],
  "nombre_sitio": "mainstreetwh.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mainstreet.org/",
      "text": "Main Street America :: Home Skip to content English Español Member Login Main Street America Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities English Español Member Login Donate Search Building Stronger Communities Together Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Main Street America leads an inclusive, impact-driven movement dedicated to reenergizing and strengthening older and historic downtowns and neighborhood commercial districts nationwide. Learn More Programs and resources just for you Metuchen, New Jersey © Richard Alfonzo Photography Knowledge Hub Explore our comprehensive digital library containing 100 s of best-in-class community development materials. Professional Development The Main Street America Academy is the leading provider of education for downtown and commercial district leaders. Field Services Our team of experts offers on-the-ground training to help make your vision for your community a reality. Events & Opportunities Sep 30 2025 Apply: T‑Mobile Hometown Grants With T‑Mobile’s Hometown Grant program, up to 100 small towns with a population of 50 , 000 or less receive placemaking project funding of up to $ 50 , 000 each. Oct 13 2025 Register: 2025 Community Transformation Workshop Join us for the 2025 Community Transformation Workshop, an immersive, interactive two-day experience that equips participants with data-based solutions and proven strategies necessary to address complex revitalization initiatives. Apr 13 2026 Save the Date: 2026 Main Street Now Conference Mark your calendar for our annual conference — and the largest convening of Main Street professionals — in Tulsa, Oklahoma. View all Destination: Main Street With over 1 , 600 community coalitions nationwide, there’s something for everyone on Main Street. Explore our inspiring member network . Denison’s Arts and Jazz Fest features live jazz throughout downtown. Discover Denison, Denison Arts Council, local school jazz bands, and over a dozen local art vendors worked together to provide this unique experience. © Randy Sedlacek Denison, Texas 2025 Great American Main Street Awards Winner Denison, Texas Raton, New Mexico 2025 Great American Main Street Awards Winner Raton, New Mexico Furniture maker Robby Pederson and his custom furniture store, RVP ~ 1875 , is one of Jefferson’s top tourism entities, connecting the history of the community and region with modern experiences and functionality. © Matt Wetrich Jefferson, Iowa 2025 Great American Main Street Awards Winner Jefferson, Iowa Visitors enjoy the newly renovated Cotton Avenue Plaza, where a Confederate monument stood before being relocated to Rose Hill Cemetery. © DSTO Moore Macon, Georgia 2024 Great American Main Street Awards Winner Macon, Georgia Family-owned and operated businesses like Fountain Alley work daily to create the perfect experience for their customers. © Austin Sims Madison, Indiana 2024 Great American Main Street Awards Winner Madison, Indiana Monroeville, Alabama © Pierce Drones Monroeville, Alabama 2024 Great American Main Street Awards Winner Monroeville, Alabama Featured Resource Main Street Disaster and Resilience Toolkit Get the tools to plan for, prepare for, and recover from natural disasters in your community. Download the toolkit here. Marion, IA © Uptown Marion Recent News and Stories Main Spotlight: The Economics of Fall Foliage Tourism Fall foliage tourism has a substantial economic impact on small towns and rural areas nationwide. Learn how Main Streets can leverage their leaves to boost their communities this fall. September 9, 2025 Vibrant fall colors drive tourists to towns like Stowe, Vermont. Photo by BackyardProduction. Insights Staff Spotlight: Exploring Arkansas with Lisa Mullins Thompson Lisa shares reflections about eight Arkansas communities that recently received assessment visits August 28, 2025 Lisa Mullins Thompson traveled across the state with Main Street Arkansas. Photo by Lisa Mullins Thompson. Storytelling Main Spotlight: 5 Tips for Running a Successful Grant Program Our grantmaking team shares their advice to help you run a successful grant program and expand your impact in your community. August 26, 2025 Mercado del Pueblo Business Incubator received a grant from The Hartford Small Business Accelerator Grant Program. Photo courtesy of PRCC . How-to Just Dropped: New Courses in the Main Street America Academy Deepen your knowledge, bring your vision to life, and expand your impact with our latest Main Street America Academy course. Whether you’re navigating your first grant or hosting a community event, the Local Main Street Leader Launching module is designed to support your growth without burning out. August 20, 2025 Turn plans into progress with the Local Main Street Leader Launching courses. Photo by KandE Productions. Announcement Vintage Vibes, Digital Drive with Rachael Kehler, Peppermint Stick Candy Store Join host Matt Wagner for his conversation with Rachael Kehler, owner of The Peppermint Stick Candy Store in Boyertown, Pennsylvania. In this episode, Matt and Rachael discuss her journey to entrepreneurship, leveraging nostalgia as a marketing tool, small town tourism, and more. August 20, 2025 Storytelling Main Spotlight: Building Shared Priorities to Unlock Growth Main Street America has partnered with the Robert Wood Johnson Foundation to explore the impact of the Capital Absorption Framework in Main Street communities in Virginia and Wisconsin. August 19, 2025 Participants in Wisconsin gather for a workshop in West Allis, WI . Photo by Main Street America. Insights Community Spotlight: How Nashville’s Entrepreneurs are Driving Community Transformation Discover how small businesses are breaking barriers in our Breaking Barriers to Business (B3) series, starting with a powerful spotlight on Nashville’s local changemakers. August 14, 2025 Nashville, Tennessee © Breaking Barriers to Business ( B 3 ) Storytelling Made on Main: DANE Fragrance As part of a new series on Main Street America’s online store, Shop Main Street, we're highlighting the stories behind the amazing brands, makers, and producers along our Main Streets. Today, we’re highlighting DANE Fragrance, a perfumery based in Ukiah, California. August 14, 2025 Storytelling Spotlight on a Main Street Board Member: The Visionary Spirit of Maxine Clark Meet Maxine Clark—entrepreneur, philanthropist, and board member at Delmar Main Street in St. Louis, Missouri—and hear Erin's takeaways from their conversation about advocacy, resiliency, and leadership. August 7, 2025 From left: Gayla Roten, State Director at Missouri Main Street; Felice McClendon, Executive Director at Delmar Main Street; Maxine Clark, Delmar Main Street Board Member and Chief Inspirator at Delmar DivINe; Erin Barnes, President and CEO at Main Street America. Photo courtesy of Maxine Clark. Storytelling Main Spotlight: How a Fresh Start Revitalized Downtown Maryville’s Market Scene Farmers markets are fantastic tools to support local businesses, drive traffic downtown, and build community connections. Learn how Downtown Maryville built their market from an idea to a success. August 5, 2025 The Downtown Maryville Market brings people of all ages to Maryville’s Main Street. Photo courtesy of Downtown Maryville. How-to Main Spotlight: Walking Together to Connect a Community Charles Town Now brings people together with an event that celebrates the importance of nothing. Discover how they organized the event and its lasting impact on the community. July 29, 2025 The Charles Town community gathered for their largest Walk About Nothing on June 4 th . Photo courtesy of Charles Town Now. Storytelling Strengthen Local Economies with the 2025 Supporting Small Businesses on Main Street Course Generously sponsored by U.S. Bank, this live, three-week course centers the real challenges of entrepreneurs and equips Main Street leaders with invaluable insights and practical tools to respond. Register today! July 28, 2025 Oregon City, Oregon. Photo by Adam Wickham. Announcement Florence, South Carolina. Photo by True Light Photography. “ Our downtown would not be the thriving ecosystem it is today without our community’s steadfast alignment with the Main Street Approach.” - Hannah Davis, Main Street Program Director, Florence, S.C. Join Us Join a National Network of Community-Builders Sign up for news, events, and more. Subscribe Contact Main Street America 53 West Jackson Blvd. Suite 350 Chicago, IL 60604 P 312-610-5613 info@mainstreet.org Get Social © 2025 National Main Street Center, Inc. Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.mainstreetinc.com/contact-us-submission/",
      "text": "Contact Main Street - Your Check Printer & Marketing Partner Skip to content Follow Us: Explore More: Search Reorder Checks Client Login FAQs Support Contact Us Who We Are .st0 {\n        fill: #02344c;\n      } The Main Street Difference Careers Events How We Help Connect by Main Street Marketing Solutions Workflow Automation Digital Marketing Print Marketing Performance Tracking How It Works Creative Services Check Program Personal Checks Business Checks High Security Checks Branded Checks Collegiate Checks School Spirit Checks Marketing Materials Custom Print Solutions Holiday Print Collection Drive Up Envelopes Gift Envelopes Currency Envelopes Bank-Use Tickets Custom Checks Services & Support Creative Services Graphic Design Copywriting Services Segmentation Assistance Strategic Account Management Challenges We Solve Resources Industry Insights Events FAQs Catalog Reorder Checks Client Login FAQs Support Contact Us Open mobile menu Close mobile menu Cart Contact Us At Main Street, service is at the heart of everything we do. Start a conversation with us online or by phone to get the help you need with check orders or to learn more about Connect by Main Street. Give Us A Call Send Us A Message Contact Us Today Connect with us to learn more about how Main Street helps community financial institutions like yours. \" * \" indicates required fields Name * First Last Email* * Phone Financial Institution * How Can We Help? How Can We Help? Print & Digital Solutions for Financial Institutions Client Support Compliance What Products/Services Are You Interested In? * Connect by Main Street Check Program Custom Print Solutions Creative Services Other What Issue Do You Need Assistance With? * Order Checks Update Account Information Product Information Ordering Software Support Other Tell us about your request How Did You Hear About Us? How Did You Hear About Us? Direct Mail Social Media Email Web Search Referral Conference/Event Other Opt-In I agree to receive updates and marketing communications from Main Street. CAPTCHA This field is hidden when viewing the form Pardot Tracking ID Facebook This field is for validation purposes and should be left unchanged. Start a Conversation How Can Main Street Help You? We value conversations. That’s why we never charge for phone calls or emails. Need help with a recent order? Interested in our marketing and engagement hub, Connect by Main Street? Let’s start a conversation here. Our Location 920 19th Street North, Birmingham, AL 35203 Contact Information 205.380.4000 | contact@mainstreetinc.com Hours of Operation Monday – Friday: 8:00 a.m. – 5:00 p.m. CST If you need to report a security breach or potential security breach affecting your institution, please notify us immediately by emailing MSSystemAdmin@mainstreetinc.com . Proudly Serving 2,000+ Financial Institutions Nationwide Already a Main Street Customer? Get Help with Orders, Troubleshooting, & More When you call Main Street, you’ll always speak with a human being. Our expert Client Support team is standing by to help with whatever issues you have, from reordering business checks to mastering Connect by Main Street. View Our Resources Find what looking for, from top marketing tips to frequently asked questions. Explore Now Contact Support Have a question about Connect by Main Street? We’re ready to help. Get In Touch Learn How We Help Financial Institutions Thrive Interested in one of our solutions? We’re dedicated to solving the challenges facing community banks and credit unions. Learn more about our products and services, made just for you. How We Help .st0 {\n        fill: #02344c;\n      } Never Miss an Update. Sign Up For Our Newsletter! Sign Up 920 19th Street N Birmingham, AL 35203 contact@mainstreetinc.com 205.380.4000 Customer Support Quick Links Check Program Connect by Main Street Creative Services Custom Print Solutions Strategic Account Management The Main Street Difference Who We Are Industry Insights FAQs Contact Us Reorder Checks Client Login Stay Updated Sign up for our newsletter to receive corporate updates, tips and tricks, and more from Main Street. Email (Required) This field is hidden when viewing the form Opt-In I agree to receive updates and marketing communications from Main Street. CAPTCHA This field is hidden when viewing the form Pardot Tracking ID ©2025 Main Street, Inc. | All rights reserved. | Website Privacy Policy Back To Top Search × ×"
    },
    {
      "url": "https://www.mainstreet.org/about/our-team",
      "text": "Main Street America Staff Members | Main Street America Skip to content English Español Member Login Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities English Español Member Login Donate Search About Our Team Meet the talented and passionate people behind the work. Explore This Section Who We Are How We Work Partner Collaborations Our Supporters Our Team Contact Us Who We Are How We Work Partner Collaborations Our Supporters Our Team Contact Us Board of Directors Coordinating Program Leadership Council Senior Management Team Erin Barnes bio Erin Barnes President and CEO Dionne Baux bio Dionne Baux Chief Programs Officer John Chomiak bio John Chomiak Chief Financial and Administration Officer Matt Wagner, Ph.D. bio Matt Wagner, Ph.D. Chief Innovation Officer Hannah White bio Hannah White Chief Impact Officer Staff Members Steve Amraen bio Steve Amraen Manager of Network Services Joi Cuartero Austin bio Joi Cuartero Austin Senior Program Officer, Economic Vitality Rachel Bowdon bio Rachel Bowdon Senior Director of Marketing and Communications Casie Cameron bio Casie Cameron Manager of Instructional Design Genesis Rivera Candelaria bio Genesis Rivera Candelaria Program Coordinator, Neighborhood Commercial Districts Amber Cooper bio Amber Cooper Director of Talent & Culture Mike Donohue bio Mike Donohue Manager of Media Relations Katie Eckstein bio Katie Eckstein Director of Development Amanda Elliott bio Amanda Elliott Vice President of Field Services Hannah Mira Friedland bio Hannah Mira Friedland Manager, Strategic Projects Alicia Gallo bio Alicia Gallo Associate Director of Strategic Communications Maggie Gillespie bio Maggie Gillespie Associate Manager, Thriving Communities Program Luke Hallowell bio Luke Hallowell Senior Manager of Capital Absorption Shane Hampton bio Shane Hampton Senior Manager, Thriving Communities Program Aoife Harte bio Aoife Harte Associate Research Analyst Kelly Humrichouser bio Kelly Humrichouser Director of Government Relations Tali Jamir bio Tali Jamir Director of Membership Operations Michael Jarosz bio Michael Jarosz Manager of Government Relations Jawanza Joseph bio Jawanza Joseph Director of Governmental Finance and Grants Kathy La Plante bio Kathy La Plante Vice President of Coordinating Programs Amy Miller, MPA bio Amy Miller, MPA Program Officer Emi Morita bio Emi Morita Manager of Research Amanda Mutai bio Amanda Mutai Associate Manager Anya Nair bio Anya Nair Executive Assistant Christy Noel-Tracie bio Christy Noel-Tracie Partner Marketing Coordinator Marta Olmos bio Marta Olmos Associate Manager of Content and Communications Wendy Otero bio Wendy Otero Manager of Marketing and Outreach Miriam Parson, MSUS bio Miriam Parson, MSUS Director of Network Capacity Building, Launch Hilary Pellegrin bio Hilary Pellegrin Staff Accountant Michael Powe, Ph.D. bio Michael Powe, Ph.D. Senior Director of Research Erik Reader bio Erik Reader Director of Illinois Main Street Bethany Rogers, Ph.D. bio Bethany Rogers, Ph.D. Vice President of Strategic Projects Tasha Sams bio Tasha Sams Director of Education Liz Shenk bio Liz Shenk Senior Manager of Marketing and Outreach Amanda Siskind bio Amanda Siskind Associate Manager, Corporate Grants Program Jonathan Stone bio Jonathan Stone Program Officer Jackie Swihart bio Jackie Swihart Director of Network Capacity Building, Strengthen Chandra Teddleton, Ph.D. bio Chandra Teddleton, Ph.D. Program Officer Jenna Temkin bio Jenna Temkin Senior Manager of Development Lisa Mullins Thompson bio Lisa Mullins Thompson Senior Program Officer Marcela Uribe, Ph.D. bio Marcela Uribe, Ph.D. Bilingual Program Officer for Revitalization Services Gustavo Ustariz bio Gustavo Ustariz Director of Entrepreneur & Small Business Support Tia Vice bio Tia Vice Manager of Strategic Projects Sylvia Warfield bio Sylvia Warfield Membership Assistant David Weinberger bio David Weinberger Director of Grant Programs Debra Wise bio Debra Wise Senior Business Manager Join a National Network of Community-Builders Sign up for news, events, and more. Subscribe Contact Main Street America 53 West Jackson Blvd. Suite 350 Chicago, IL 60604 P 312-610-5613 info@mainstreet.org Get Social © 2025 National Main Street Center, Inc. Privacy Policy Terms of Use"
    },
    {
      "url": "https://www.mainstreetwh.com/contact/",
      "text": "Contact – Main Street Winter Haven arrow_down arrow_left-down arrow_left-up arrow_left arrow_right-down arrow_right-up arrow_right arrow_up icon_phone icon_pin Skip to navigation Skip to content Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants Carl J Strang Jr Urban Tree Canopy Fund About Main Street Board of Directors & Staff Main Street Winter Haven Committees Contact Search for: Search Menu Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Map Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtowm Map Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants About Main Street Contact $ 0.00 0 items Home / Contact Contact Main Street Winter Haven, Inc. Our office is located at: 254 W Central Avenue, Suite F Winter Haven, FL 33881 (863) 295-9422 Email: anita@mainstreetwh.com Mailing Address P.O. Box 2074 Winter Haven, FL 33883 Main Street Home Events About Main Street Board of Directors & Staff Committees Contact Membership Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants © Main Street Winter Haven 2025 My Account Search Search for: Search 0 This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://mainsttravel.com/contactUs",
      "text": "Contact - Main Street Travel Call: 845.425.2123 Email: sales@mainsttravel.com Home Services Triplan About Contact MENU Home Services About Contact Contact Us Home Contact GET IN TOUCH! We are ready to assist you! Connect with one of our highly specialized agents! × Thank you for your contacting Main Street Travel! One of our  highly specialized agents will contact you shortly. Submit contact info 1.845.425.2123 1.800.675.2123 1.845.425.2151 sales@mainsttravel.com 20 Robert Pitt Drive, Suite 207 Monsey, NY 10952 WE ARE HERE FOR YOU! Sunday : 10:00am – 2:00pm Monday through Thursday : 10:00am – 5:30pm Friday : 10:00am – 2:00pm in the summer, 10:00am – 1:00pm in the winter In addition, we can be reached via our special emergency line 24/6. Call our main number and follow the after-hours prompts. Entrance Your Full Service Travel Agency TRAVEL planning made simple – our MAIN priority! sales@mainsttravel.com Fax: 845.425.2151 845.425.2123 1.800.675.2123 20 Robert Pitt Dr #207 Monsey NewYork, 10952 Copyright© Main Street Travel 2017.All right reserved."
    },
    {
      "url": "https://www.mainstcapital.com/",
      "text": "Main Street Capital Corporation (MAIN) Skip to main content Skip to footer News Contact Careers Home About About Lower Middle Market Solutions Private Credit Solutions Company History Corporate Social Responsibility Team Executive Committee Lower Middle Market Team Private Credit Team Finance, Legal, Compliance, & Accounting Board of Directors Portfolio Companies Lower Middle Market Private Credit Investors IR Overview News & Events Company Information Financial Information Listed Securities Information SEC Filings Governance For Business Owners What Makes Us Different Who We Invest In Why Businesses Partner With Us How We Invest Minority Recapitalization News Contact Careers Search Search Main Street A True Financial Partner Main Street Capital, based in Houston, Texas, has helped over 200 private companies grow or transition by providing flexible private equity and debt capital solutions. Privately-held businesses turn to us because we are Main Street, not Wall Street--we build relationships and tailor transactions to meet the unique needs of our portfolio companies and their owners. Why Main Street? Customized Capital Solutions We provide “one-stop” capital solutions (private debt and private equity capital) to lower middle market companies and debt capital to middle market companies. Main Street's lower middle market companies generally have annual revenues between $10 million and $150 million. While Main Street's middle market debt investments are made in businesses that are generally larger in size. Through our two business segments, we offer entrepreneurs, business owners, management teams and financial sponsors a number of advantages to help each business realize its full potential and generate wealth for its owners. Learn More Portfolio Companies A seasoned institutional investor, we partner with existing management teams, entrepreneurs and business owners to facilitate management buyouts, majority and minority recapitalizations, growth financings and acquisitions. We have a proven track record established over 20 years of partnering with companies that operate across diverse industry sectors and geographic regions to provide a “one-stop” capital providers of private equity and private debt solutions. View All Companies What Our Clients Say Main Street’s strategic support coupled with their approach to promote senior management’s operational autonomy have helped shape our growth trajectory. David Brown, President and CEO, GRT View Case Study Main Street has provided KMC’s team with a long-term strategic partner that is well aligned with the core values and growth plans for the business while allowing additional members of management to invest in the business, strengthening our team’s alignment and focus on future growth. Gerry Schwarz CEO, KMC View Case Study \"Main Street's investment helped elevate several parts of our company that we did not previously have the bandwidth to support. Their operational support allowed us to make a key hire to bolster the executive team and add productive external board members. We even received an introduction to a new customer.\" Jim Hooker Founder, Televerde View Case Study \"Main Street provided liquidity to achieve my estate planning goals, while allowing me to retain operational control and the right to regain majority equity ownership. They have been true to their word since our initial discussion, have provided valuable insight and resources, and have been the ideal partner for me and CBT Nuggets.\" Dan Charbonneau CEO & Owner, CBT Nuggets View Case Study Company Profile Main Street is a principal investment firm, based in Houston, Texas, that provides long-term debt and equity capital to lower middle market companies and debt capital to middle market companies. View Investor Relations Latest News Main Street Announces New Portfolio Investment September 2, 2025 View All News Presentations 2nd Quarter 2025 Investor Presentation August 8, 2025 View All Presentations Main Street Capital Corporation 1300 Post Oak Blvd, 8th Floor, Houston, TX 77056 Copyright © 2025 . All Rights Reserved. Terms of Use Search Sitemap Contact Us local_phone Market Data copyright © 2025 QuoteMedia . Data delayed\r\n                    15 minutes unless otherwise indicated (view delay times for all exchanges). RT =Real-Time, EOD =End of Day, PD =Previous Day. Market Data powered by QuoteMedia . Terms of Use ."
    },
    {
      "url": "https://mainstreetmanagers.com/",
      "text": "Main Street Management - HOA Management Lake Norman, NC Sale & Closing Information Owner Login/Register About About Main Street Management Why Choose Us Services FAQ Testimonials Free Analysis Talk to Us HOA Management in Lake Norman and the Surrounding Area We’ll handle the day-to-day, freeing you to enjoy your beautiful, thriving HOA community. Talk to Us HOA Management in Lake Norman and the Surrounding Area We’ll handle the day-to-day, freeing you to enjoy your beautiful, thriving HOA community. Talk to Us Enhance Property Values Improve Quality of Life Create A Vibrant Community You Volunteered to Lead Your HOA Community Sometimes, That Can Be Stressful Long meetings and heavy workloads Second-guessing from members of the community A community Facebook group that’s full of discord Inconsistency in HOA rules enforcement Complaints from residents Talk to Us There’s a Better Way to Create a Thriving Community Vendor and Contract Management Our HOA management company can help you find the vendors that best fit your needs. Information Management Our community management services encompass easy-to-access online hubs, providing residents with their financial info, governing documents, and more. Financial Management A key component of HOA property management is furnishing Board members with the tools they need to uphold their fiduciary duties to the community. We’re Here to Support Your Success We know that you take pride in your community and want to see it as a place where homeowners flourish and property values stay robust. At Main Street Management, our role is to position you for success, making it easy to effectively manage your community while creating greater work-life balance for the members of your Board. Our comprehensive HOA management solutions help us stand out We're Focused Our Managers have smaller portfolios so that we can provide hands-on service We're Nearby Our office is near the HOAs we manage We're Responsive We do not have a call center or departments that will bounce you around We're Efficient Our industry-leading software keeps your HOA information at your fingertips Talk to Us You Don’t Have to Take Our Word for It Here’s what other HOAs have said about our community management services Very friendly, helpful staff! They’re extremely easy to get in touch with and have a great response time when resolving issues. Jonah W. By far the best, most responsive HOA I have ever dealt with and being a realtor, I deal with a lot. Andrew Epperson has been amazing. He answers my emails very, very quickly and has been incredibly helpful. I wish they were my HOA! Kristine N. Excellent customer service! It is refreshing to see such professionalism. I highly recommend Main Street Management Group to everyone. Maggie Vallejo You are so amazing to check back with me! Mainstreet Management is the best HOA I have ever had to deal with. Love you all. Christine Y. In my line of work I deal with many different Management Groups daily. It is extremely refreshing to deal with a Management Group that is so professional and always willing to help! Thanks Robin! Sherri Great service. Highly recommended to my friends and family members. Humble and homey feel. Love the person to person communication. Michael Rodriguez Friendly and professional service! Answered questions to the best of their abilities. All staff members work as team. I appreciate the personal service instead of having to go through the troubles of automated operators! Lauren Mapstone Our community has been with Main Street several months. It is a such a refreshing change from our last management company. Jennifer Harrington is most attentive and responsive to our needs. She is quick to address our concerns. Many thanks to Jennifer and Main Street. Linda H. Extremely professional management company! They’ve been able to handle any issue I’ve sent their way in a very quick and efficient manner. Would recommend them to anyone who needs an HOA management company! Chloe C. Talk to Us HOA Management is as Easy as 1-2-3 Call or Email Reach out to our founder and CEO, Kelly, who has more than two decades of homeowner association management experience. Find out whether Main Street Management is the best fit for your community. Talk to Us Convene the Board Kelly will meet with your Board to answer any questions and to give further information about our scope of HOA community management services. Transition Seamlessly From electronic contracts to easy file-sharing, our team makes it as seamless and convenient as can be to transition management duties to Main Street. We’ll be ready to hit the ground running, supporting your community as it flourishes. Our Guarantee If for any reason you are not satisfied with our services, we resolve the issue within 60-days or less or you can terminate our contract with 30-days’ notice. Talk to Us We Have a Proven Track Record in HOA Management 100+ Community Management Portfolio 20+ Years of Experience 0 Better Business Bureau Complaints <3% Delinquency Rate Across All The Communities We Manage >50% Retention Rate of Five Years Or More Talk to Us More About Us Become the Hero of Your HOA Take your community from good to great, and your HOA Board from overworked to overjoyed. Engage our trusted HOA management company today. Talk to Us Follow Us On Facebook Become the Hero of Your HOA Take your community from good to great, and your HOA Board from overworked to overjoyed. Engage our trusted HOA management company today. Talk to Us Follow Us On Facebook EXPLORE About Services FAQ Testimonials Free Analysis CONTACT US (704) 255-1266 Info@MainStreetManagers.com Talk to Us © 2025 Main Street Management Group Website powered by Woland Web"
    },
    {
      "url": "https://www.mainstreetwh.com/business/gourmet-goodies/",
      "text": "Gourmet Goodies – Main Street Winter Haven arrow_down arrow_left-down arrow_left-up arrow_left arrow_right-down arrow_right-up arrow_right arrow_up icon_phone icon_pin Skip to navigation Skip to content Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants Carl J Strang Jr Urban Tree Canopy Fund About Main Street Board of Directors & Staff Main Street Winter Haven Committees Contact Search for: Search Menu Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Map Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtowm Map Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants About Main Street Contact $ 0.00 0 items Home / Business / Gourmet Goodies Gourmet Goodies We are a Gourmet Cupcake & Bake Shop located in Winter Haven, serving Central Florida. Specializing in Gourmet Cupcakes, Custom Cakes, Our Famous Cookies, Fudge Brownies, Cheesecakes and Specialty Desserts. We feature a daily selection of decadent sweets at the Bake Shop and take special orders for custom cakes and events. Contact us to schedule a consultation and tasting. Carissa Hughes, Owner info@GGCupcake.com 863-670-7113 Post navigation Next post: Grove Roots Brewing Co. Main Street Home Events About Main Street Board of Directors & Staff Committees Contact Membership Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants © Main Street Winter Haven 2025 My Account Search Search for: Search 0 This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://www.safehavencommunityservices.org/contact",
      "text": "Contact Safe Haven Community Services: Get in Touch for Foster, Kinship, and Adoption Support — Safe Haven Community Services 0 Skip to Content About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School Open Menu Close Menu Open Menu Close Menu About Services Foster Care Kinship Care Adoption Training Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Care Giver Portal Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery FAQs Foster FAQs Kinship FAQs Adoption FAQs Donate English Back-To-School About Folder: Services Back Foster Care Kinship Care Adoption Folder: Training Back Annual Training New Family Training New Family Training Resources Contact Information Session Volunteer Community Resources Kids Waiting For Adoption Folder: Care Giver Portal Back Care Giver  Portal (Extended Reach) Care Giver Portal Tutorials Family Gallery Folder: FAQs Back Foster FAQs Kinship FAQs Adoption FAQs Donate English Back Back-To-School We take pride in delivering exceptional customer service. We Would Love To Connect With You… If you have any questions, please don't hesitate to contact us through the contact form. You can also reach us by email or phone from 9 a.m. to 5 p.m. CST, Monday through Friday. Click on one of the forms below and we will get back to you promptly . Foster Care Foster Care Inquiry Form What services are you interested in? Foster to adopt Foster (only) Respite (only) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for foster children? * Gender preference to foster: * boy(s) girl(s) Any gender Age preference to foster: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your foster care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . kinship care Kinship Care Inquiry Form What services are you interested in? Kinship-Foster to Adopt Kinship Straight to Adopt Kinship to Permanent Legal Conservatorship (PMC) Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Name of child's kinship worker: First Name Last Name Phone of Child's kinship worker: (###) ### #### Name of caregiver(s) DFPS worker: First Name Last Name Phone of caregiver(s) DFPS worker (###) ### #### List all children placed in your care by DFPS: Child 1 First Name Last Name Child 1 DOB MM DD YYYY Child 2 First Name Last Name Child 2 DOB MM DD YYYY Child 3 First Name Last Name Child 3 DOB MM DD YYYY Child 4 First Name Last Name Child 4 DOB MM DD YYYY Child 5 First Name Last Name Child 5 DOB MM DD YYYY Child 6 First Name Last Name Child 6 DOB MM DD YYYY Thank you for reaching out to Safe Haven with your kinship care inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Adoption Adoption Inquiry Form What services are you interested in? Foster to adopt Straight Adopt Caregiver 1 Name * First Name Last Name Caregiver 1 DOB MM DD YYYY Caregiver 1 Phone * (###) ### #### Caregiver 1 Email * Caregiver 2 Name First Name Last Name Caregiver 2 DOB MM DD YYYY Caregiver 2 Phone (###) ### #### Caregiver 2 Email Address Address 1 Address 2 City State/Province Zip/Postal Code Country Number of beds available for adoption/foster children? * Gender preference to adopt: * boy(s) girl(s) Any gender Age preference to adopt: * 0-6 7-12 13-18 Any age How did you hear about us? * Parent / Friend Referral DFPS Community / Church Group Instagram Facebook X (Formally Twitter) LinkedIn YouTube Other Thank you for reaching out to Safe Haven with your adoption inquiry! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . General Info General Information Name * First Name Last Name Email * Phone (###) ### #### Subject * Message * Thank you for reaching out to Safe Haven! We are committed to providing exceptional customer service and will respond to your inquiry as soon as possible. If you require immediate assistance, please don't hesitate to call us at 713.988.7233 (SAFE) . Email info@safehavencommunityservices.org Phone (713) 988-7233 (SAFE) Address 8100 Washington Ave. Suite 167 Houston, TX 77007 Sign Up For Our Newsletter Family Focused Treatment Association Partner Affiliates Texas Department of Family and Protective Services Child Welfare League of America Greater Houston Permanency Collaborative Safe Haven Community Services Safe Haven Community Services is a licensed and funded 501(c)(3) nonprofit child-placing agency under the Texas Department of Family and Protective Services EIN: 74-3025434 Additional Services Safe Haven Youth Ranch Selim Behavioral Health Contact Us 713.988.7233 (SAFE) Office Location 8100 Washington Ave, Suite 167 Houston, TX 77007 Site Home About Volunteer Family Gallery Sign Up For Our Newsletter Services Foster Care Adoption Kinship Care Training Annual Training New Family Training Donate CELEBRATING 20 YEARS OF SERVICE!"
    },
    {
      "url": "https://www.mainstreetwh.com/membership/benefactors/",
      "text": "Benefactor Members – Main Street Winter Haven arrow_down arrow_left-down arrow_left-up arrow_left arrow_right-down arrow_right-up arrow_right arrow_up icon_phone icon_pin Skip to navigation Skip to content Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants Carl J Strang Jr Urban Tree Canopy Fund About Main Street Board of Directors & Staff Main Street Winter Haven Committees Contact Search for: Search Menu Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Map Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtowm Map Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants About Main Street Contact $ 0.00 0 items Home / Membership / Benefactor Members Benefactor Members What is a Main Street Benefactor? In Fiscal year 2005 Main Street Winter Haven introduced a new initiative the Benefactor Program.  As a Benefactor, a Business pledges to Main Street Winter Haven an annual $5,000 investment for a minimum of two years. What is a Visionary Benefactor? A Visionary Benefactor is a Main Street Winter Haven Benefactor who has made the commitment to support the program for a minimum of ten years .  We applaud their vision for a economically, socially and culturally vibrant downtown. Downtown Winter Haven has a promising future.  We invite you to help us in reaching its full potential. To become a Benefactor of Main Street Winter Haven please call (863) 295-9422. Main Street Winter Haven is a 501(c)(3) designated non profit corporation, thus making your benefactor contribution tax deductible. Main Street Winter Haven receives 100% of your contribution. (FDACS #SC-07505) Visionary Benefactors 451 Third St. NW Winter Haven , FL 33881 863-291-5600 Website City of Winter Haven Welcome to Winter Haven, Florida – the Chain of Lakes City. This site will allow you to explore Winter Haven’s personality, and learn why it is a preferred place to live, work, play and raise a family! 299 Cypress Gardens Blvd Winter Haven , FL 33880 888-612-3182 Website Dodge Chrysler Jeep Winter Haven At Dodge Chrysler Jeep Ram of Winter Haven, we offer new Dodge, Jeep, Chrysler and Ram cars, trucks & SUV’s in Winter Haven, along with used cars, trucks and SUVs by top manufacturers. Our sales staff will help you find that new or used car you have been searching for in Winter Haven. For years, our financial staff has offered expert advice for those seeking a great Dodge, Jeep, Chrysler or Ram car loan or lease. Our service doesn’t stop there. Winter Haven customers can come in and take advantage of our knowledgeable Dodge, Jeep, Chrysler and Ram car repair technicians and a fully-stocked inventory of Dodge, Jeep, Chrysler and Ram car parts. 56 4th St NW Suite 200 Winter Haven , FL 33880 863-299-1195 Website Six Ten LLC Six/Ten owns, develops and manages a diverse portfolio of commercial real estate properties and operating companies across Central Florida. But our true passion is for downtown Winter Haven, where we and others are working to drive smart growth – repurposing wonderful old buildings and new urban spaces. Six/Ten seeks to create value by developing properties and companies in concert with the Winter Haven community. We will continue to transform downtown Winter Haven by fostering high-paying jobs, developing profitable commercial properties, promoting the construction of unique residential options, and creating attractive urban spaces in which to play and work. We will leverage our experience with investments in technology companies into highly profitable exit strategies. Six/Ten combines intelligent investors interested in local ownership with hard assets that are transparently managed. Our mission is to positively transform our community, while preserving its authentic character and protecting our beautiful natural resources. Fifty freshwater lakes surround us, with over 90 miles of shoreline within our city limits. We are owned 100% by investors who have a personal connection with Winter Haven. Have a great idea for a new business? Want to locate in a real downtown? Please let us hear from you! Email us at ideas@sixtenllc.com . Read More + 55 5th St NW Winter Haven , FL 33881 863-268-8285 Website Victor Smith Law Group The attorneys at Victor Smith Law Group have over 50 years of combined legal experience. We are dedicated to aggressive representation in all types of civil litigation. Our practice areas include personal injury, guardianship issues, estate disputes, business litigation and family law. Our family law practice covers divorces, child custody, child visitation, division of assets, financial support disputes, estate planning and wills & trusts. 200 Ave F NE Winter Haven , FL 33881 863-293-1121 Website Winter Haven Hospital Winter Haven Hospital’s Mission is to improve the health of all we serve through community-owned health care services that set the standard for high-quality, compassionate care. Benefactors 40100 US-27 Davenport , FL 33837 (863) 422-4971 Website AdventHealth Whole Person Care You’re more than flesh and bone. That’s why AdventHealth’s full system of care is here to support all of you, from everyday wellness and preventive health care to life-saving diagnostic services and innovative medical treatments in cancer, heart failure and more. In Your Neighborhood Find comfort in knowing that world-class, individualized care is close to home in Central Florida — and backed by the strength of a powerful nationwide network. That means your family will always have access to the expert resources and specialists you need. To make your health care experience as convenient as possible, we also offer virtual physician visits, online scheduling and a patient portal, all in one online location. One Connected Network With a vast network of local hospitals, ERs, urgent care clinics and primary care providers, help is always nearby. More than 80,000 healing hands, 5,000 medical minds and over 1,000 care locations are all connected by our commitment to supporting your whole health, your whole life. 601 6th St SW Winter Haven , FL 33880 863-293-6473 Website Whitehead Construction Established in 1954, Whitehead Construction is a premier large-scale contracting company with three generations of family ownership. Founded on quality workmanship and personal partnerships, our commitment to excellence from conception to completion of a project has established Whitehead Construction as one of the most recognized and respected names in general contracting. Today, we hold 65+ years of experience in design-build, commercial and industrial construction in Florida and other southern states. 208 E Park Street Auburndale , FL 33823 (863) 967-4454 Website Mulling Insurance Mulling Insurance is a Florida-based, independent insurance agent and leading provider of commercial and personal insurance policies. Family owned and operated since 1957, Mulling Insurance is headquartered in Auburndale, FL, and serves businesses and families across Polk County and greater Florida. Mulling insures the places our Florida neighbors work, live, learn, dine, worship and play. They offers a complete portfolio of insurance services for businesses and individuals, including personal and commercial insurance, employee benefits and financial planning services. 999 Avenue H N.E. Winter Haven , FL 33881 863-297-1000 Website Polk State College Polk State College, established in 1964, is a multi-campus institution serving over 20,000 students with Bachelor of Applied Science, Bachelor of Science, Associate in Arts and Associate in Science degrees, as well as a wide range of certificate and workforce training options. The College also operates three charter high schools. 197 W Central Ave Winter Haven , FL 33880 Website Saint Matthew Thrift & Gift Shop P.O. Box 1367 Winter Haven , FL 33882 8633545180 Website Silver Properties of Winter Haven, LLC We Know Winter Haven With over 60 years of combined property management experience in the Winter Haven and Polk County, Florida, areas, Silver Properties only manages properties that we know you will want to call home. We know the area, and we know the market. We live here too. We love to call Winter Haven home, and we know you will too! We Are Here For You You may have experienced the typical rental cycle before, or you may have watched others go through it. First, you find a property. Next, you go through the leasing process. Then, it’s like the management company has no interest in you anymore. At Silver Properties, we are here to ensure your search, selection, and service all meet with your satisfaction. No one likes being treated like a monthly rental fee, us included. When you rent with us, you will have 24/7/365 access to staff who can solve any issue that comes up. We’ve made the rental process simple, and we strive to ensure your experience in our properties always meets your expectations. Main Street Home Events About Main Street Board of Directors & Staff Committees Contact Membership Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants © Main Street Winter Haven 2025 My Account Search Search for: Search 0 This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    },
    {
      "url": "https://www.villagerealtyrental.com/contact",
      "text": "Contact Us | Village Realty of Winter Haven, Inc. Skip Navigation Facebook 863.299.6767 Owner Login Tenant Login Home Services Property Management Real Estate Rentals Owners Owner Information Owner FAQs Owner Login Tenants Tenant Information Pay Rent Maintenance Tenant FAQs Referrals About Our Company Testimonials Contact Blog MENU 863.299.6767 Owner Login Tenant Login Facebook Home Services Property Management Real Estate Rentals Owners Owner Information Owner FAQs Owner Login Tenants Tenant Information Pay Rent Maintenance Tenant FAQs Referrals About Our Company Testimonials Contact Blog Management Services Search for Rent Owner Information Tenant Information Contact Us Village Realty of Winter Haven, Inc. 2500 Recker Highway Winter Haven , FL 33880 Phone: 863.299.6767 Fax: 863-293-0131 leasing@863rentals.com Drop Us a Line! Free Rental Analysis Village Realty of Winter Haven, Inc. 2500 Recker Highway Winter Haven , FL 33880 P: 863.299.6767 F: 863-293-0131 Copyright 2025 Village Realty of Winter Haven, Inc.. All Rights Reserved.\r\n\t\t\t\t\tProperty Manager Website powered by PMW Sitemap Privacy Policy Village Realty of Winter Haven, Inc. is committed to ensuring that its website is accessible to people\r\n\t\t\t\twith disabilities. All the pages on our website will meet W3C WAI's Web Content Accessibility Guidelines 2.0,\r\n\t\t\t\tLevel A conformance. Any issues should be reported to leasing@863rentals.com . Website Accessibility Policy"
    },
    {
      "url": "https://www.mainstreetwh.com/business/six-ten-llc/",
      "text": "Six Ten LLC – Main Street Winter Haven arrow_down arrow_left-down arrow_left-up arrow_left arrow_right-down arrow_right-up arrow_right arrow_up icon_phone icon_pin Skip to navigation Skip to content Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants Carl J Strang Jr Urban Tree Canopy Fund About Main Street Board of Directors & Staff Main Street Winter Haven Committees Contact Search for: Search Menu Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Map Home Events Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtowm Map Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants About Main Street Contact $ 0.00 0 items Home / Business / Six Ten LLC Six Ten LLC Six/Ten owns, develops and manages a diverse portfolio of commercial real estate properties and operating companies across Central Florida. But our true passion is for downtown Winter Haven, where we and others are working to drive smart growth – repurposing wonderful old buildings and new urban spaces. Six/Ten seeks to create value by developing properties and companies in concert with the Winter Haven community. We will continue to transform downtown Winter Haven by fostering high-paying jobs, developing profitable commercial properties, promoting the construction of unique residential options, and creating attractive urban spaces in which to play and work. We will leverage our experience with investments in technology companies into highly profitable exit strategies. Six/Ten combines intelligent investors interested in local ownership with hard assets that are transparently managed. Our mission is to positively transform our community, while preserving its authentic character and protecting our beautiful natural resources. Fifty freshwater lakes surround us, with over 90 miles of shoreline within our city limits. We are owned 100% by investors who have a personal connection with Winter Haven. Have a great idea for a new business? Want to locate in a real downtown? Please let us hear from you! Email us at ideas@sixtenllc.com . Read More + Post navigation Previous post: City of Winter Haven Next post: Winter Haven Hospital Main Street Home Events About Main Street Board of Directors & Staff Committees Contact Membership Membership Benefactor Members Partner Members Friend Members Individual Members Become a Member Update Member Information Downtown Projects & Programs Gram Parsons Derry Down Leedy Lifetime Works Tour Façade Grants © Main Street Winter Haven 2025 My Account Search Search for: Search 0 This website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settings ACCEPT Privacy & Cookies Policy Close Privacy Overview This website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. Necessary Necessary Always Enabled Necessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information. Non-necessary Non-necessary Any cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website. SAVE & ACCEPT"
    }
  ]
}