{
  "fuentes": [
    {
      "url": "https://www.mainstreetinc.com/contact-us-submission/",
      "email": "mssystemadmin@mainstreetinc.com"
    },
    {
      "url": "https://www.mainstreetinc.com/contact-us-submission/",
      "email": "contact@mainstreetinc.com"
    },
    {
      "url": "https://www.mainstventures.org/about",
      "email": "web-banner_1@2x.png"
    },
    {
      "url": "https://mainstreetvetcenter.com/contact/",
      "email": "clientcare@mainstreetvetcenter.com"
    },
    {
      "url": "https://mainstreetbartowfl.com/properties",
      "email": "cedric@donaldsonlawpa.com"
    },
    {
      "url": "https://mainstreetbartowfl.com/properties",
      "email": "cfodick@anthonyandpartners.com"
    },
    {
      "url": "https://mainstreetbartowfl.com/properties",
      "email": "glenn.olsom@svn.com"
    },
    {
      "url": "https://mainstreetbartowfl.com/properties",
      "email": "michael@thenolengroup.com"
    }
  ],
  "mails": [
    "cedric@donaldsonlawpa.com",
    "cfodick@anthonyandpartners.com",
    "clientcare@mainstreetvetcenter.com",
    "contact@mainstreetinc.com",
    "glenn.olsom@svn.com",
    "michael@thenolengroup.com",
    "mssystemadmin@mainstreetinc.com",
    "web-banner_1@2x.png"
  ],
  "nombre_sitio": "mainstreetbartowfl.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mainstreetinc.com/contact-us-submission/",
      "text": "Contact Main Street - Your Check Printer & Marketing Partner Skip to content Follow Us: Explore More: Search Reorder Checks Client Login FAQs Support Contact Us Who We Are .st0 {\n        fill: #02344c;\n      } The Main Street Difference Careers Events How We Help Connect by Main Street Marketing Solutions Workflow Automation Digital Marketing Print Marketing Performance Tracking How It Works Creative Services Check Program Personal Checks Business Checks High Security Checks Branded Checks Collegiate Checks School Spirit Checks Marketing Materials Custom Print Solutions Holiday Print Collection Drive Up Envelopes Gift Envelopes Currency Envelopes Bank-Use Tickets Custom Checks Services & Support Creative Services Graphic Design Copywriting Services Segmentation Assistance Strategic Account Management Challenges We Solve Resources Industry Insights Events FAQs Catalog Reorder Checks Client Login FAQs Support Contact Us Open mobile menu Close mobile menu Cart Contact Us At Main Street, service is at the heart of everything we do. Start a conversation with us online or by phone to get the help you need with check orders or to learn more about Connect by Main Street. Give Us A Call Send Us A Message Contact Us Today Connect with us to learn more about how Main Street helps community financial institutions like yours. \" * \" indicates required fields Name * First Last Email* * Phone Financial Institution * How Can We Help? How Can We Help? Print & Digital Solutions for Financial Institutions Client Support Compliance What Products/Services Are You Interested In? * Connect by Main Street Check Program Custom Print Solutions Creative Services Other What Issue Do You Need Assistance With? * Order Checks Update Account Information Product Information Ordering Software Support Other Tell us about your request How Did You Hear About Us? How Did You Hear About Us? Direct Mail Social Media Email Web Search Referral Conference/Event Other Opt-In I agree to receive updates and marketing communications from Main Street. CAPTCHA This field is hidden when viewing the form Pardot Tracking ID Facebook This field is for validation purposes and should be left unchanged. Start a Conversation How Can Main Street Help You? We value conversations. That’s why we never charge for phone calls or emails. Need help with a recent order? Interested in our marketing and engagement hub, Connect by Main Street? Let’s start a conversation here. Our Location 920 19th Street North, Birmingham, AL 35203 Contact Information 205.380.4000 | contact@mainstreetinc.com Hours of Operation Monday – Friday: 8:00 a.m. – 5:00 p.m. CST If you need to report a security breach or potential security breach affecting your institution, please notify us immediately by emailing MSSystemAdmin@mainstreetinc.com . Proudly Serving 2,000+ Financial Institutions Nationwide Already a Main Street Customer? Get Help with Orders, Troubleshooting, & More When you call Main Street, you’ll always speak with a human being. Our expert Client Support team is standing by to help with whatever issues you have, from reordering business checks to mastering Connect by Main Street. View Our Resources Find what looking for, from top marketing tips to frequently asked questions. Explore Now Contact Support Have a question about Connect by Main Street? We’re ready to help. Get In Touch Learn How We Help Financial Institutions Thrive Interested in one of our solutions? We’re dedicated to solving the challenges facing community banks and credit unions. Learn more about our products and services, made just for you. How We Help .st0 {\n        fill: #02344c;\n      } Never Miss an Update. Sign Up For Our Newsletter! Sign Up 920 19th Street N Birmingham, AL 35203 contact@mainstreetinc.com 205.380.4000 Customer Support Quick Links Check Program Connect by Main Street Creative Services Custom Print Solutions Strategic Account Management The Main Street Difference Who We Are Industry Insights FAQs Contact Us Reorder Checks Client Login Stay Updated Sign up for our newsletter to receive corporate updates, tips and tricks, and more from Main Street. Email (Required) This field is hidden when viewing the form Opt-In I agree to receive updates and marketing communications from Main Street. CAPTCHA This field is hidden when viewing the form Pardot Tracking ID ©2025 Main Street, Inc. | All rights reserved. | Website Privacy Policy Back To Top Search × ×"
    },
    {
      "url": "https://www.mainstventures.org/about",
      "text": "ABOUT US | Main Street Ventures top of page ABOUT US TEAM NEWS ANNUAL REPORT COMMUNITY BLOG COMPANY MAP GRANT FUNDING More Use tab to navigate through the menu items. About Us GOOD IDEAS FINANCIAL CAPITAL SOCIAL CAPITAL SUCCESSFUL BUSINESSES The equation is simple. The reality is anything but. ​ A vibrant future for Cincinnati requires an entrepreneurial ecosystem that removes barriers to starting and growing a business ; yet, most entrepreneurs lack the access to financial or social capital needed for their business to thrive. IMPACT $4 MiLLION IN GRANT FUNDS INVESTED IN LOCAL BUSINESSES $19.6 MiLLION RAISED IN FOLLOW-ON FUNDING BY GRANT RECIPIENTS $36.8 MiLLION IN REVENUE GENERATED BY GRANT RECIPIENT COMPANIES 79% OF GRANT RECIPIENT FOUNDERS ARE CONSIDERED \"UNDERREPRESENTED\" 833 INDIVIDUALS EMPLOYED BY GRANT RECIPIENT COMPANIES REGIONALLY LEVELING THE PLAYING FIELD Too many good ideas fall by the wayside because opportunities for starting and growing a business are not equally available to all founders in our community.​ 83% of entrepreneurs don't have access to funding when starting a business. Women and minority founders face even greater barriers to accessing funding and social capital. ​ Main Street Ventures supports all good ideas and founders, but with a particular focus on those who have been historically underrepresented in the startup community. HISTORY 2010 2018 2021 1999 Main Street Ventures is launched with focus on providing tech companies with a physical structure and wifi network to serve as a home base on Main Street in Over-the-Rhine. Main Street Ventures launches The Brandery , a seed-stage startup accelerator that leverages the expertise of the Cincinnati region - namely branding, marketing, and design. The Brandery has been ranked in the Top 10 of all startup accelerators worldwide (there are hundreds) and successfully graduated 79 companies who have collectively raised over $135MM in outside capital & created over $120MM in exit value. As the needs of the entrepreneurial ecosystem have evolved, Main Street Ventures launches new initiatives to meet challenging future needs, including the equity-free Leap Funding program and Ecosystem Building Grant. Main Street Ventures introduces the Launch Grant Program and the Launch It: Cincy University Pitch Competition and continues to explore other opportunities to meet the needs of entrepreneurs in Greater Cincinnati. © 2024 Main Street Ventures bottom of page"
    },
    {
      "url": "https://mainstreetvetcenter.com/contact/",
      "text": "Contact Us | Main Street Veterinary Center Skip to content 770 East Main Street Bartow, FL, 33830 | (863) 534-9584 About Meet Our Team Careers Affiliated AscendVets Practice Services Wellness Care Vaccinations Dental Care Surgery Spay & Neuter Diagnostics Emergency Care Resources Appointment Request Drop Off Form Online Pharmacy Payment Options Virtual Visits Download Our App Blog Contact Make an Appointment Make an Appointment 770 East Main Street Bartow, FL, 33830 | (863) 534-9584 About Meet Our Team Careers Affiliated AscendVets Practice Services Wellness Care Vaccinations Dental Care Surgery Spay & Neuter Diagnostics Emergency Care Resources Appointment Request Drop Off Form Online Pharmacy Payment Options Virtual Visits Download Our App Blog Contact Make an Appointment Virtual Visits Drop Off Form Contact Us We’re here for you. Contact us with any questions or concerns you have, and we will help you as best we can. To request an appointment, click here . If you need directions, click on the address or map below! Contact Us Name * Name First First Last Last Email * Message * Captcha SUBMIT If you are human, leave this field blank. Address 770 East Main Street Bartow, FL 33830 Phone (863) 534-9584 Email clientcare@mainstreetvetcenter.com Clinic Hours Monday - Tuesday : 8:00 am - 6:00 pm Wednesday : Closed Thursday - Friday : 8:00 am - 6:00 pm Saturday : 8:00 am - 3:00 pm (Open every 4th Saturday, please call to confirm dates.) Sunday : Closed 770 East Main Street Bartow, FL 33830 (863) 534-9584 Monday - Tuesday: 8:00 am - 6:00 pm Wednesday: Closed Thursday - Friday: 8:00 am - 6:00 pm Saturday: 8:00 am - 3:00 pm *Open every 4th Saturday, please call to confirm dates. Sunday: Closed Make an appointment Veterinary Websites by InTouch Practice Communications Send Website Accessibility Feedback About Meet Our Team Careers Affiliated AscendVets Practice Back Services Wellness Care Vaccinations Dental Care Surgery Spay & Neuter Diagnostics Emergency Care Back Resources Appointment Request Drop Off Form Online Pharmacy Payment Options Virtual Visits Download Our App Blog Back Contact × Close Panel Please ensure Javascript is enabled for purposes of website accessibility"
    },
    {
      "url": "https://mainstreetbartowfl.com/properties",
      "text": "Properties Check our calendar for upcoming events in Bartow. Home Event Calendar Events Bartow Uncorked Bloomin' Bike Ride Chalk Walk Christmas Parade Fall Festival Friday Fest Halloween Parade Honey Bee Craft Fair Mistletoe Market Monthly Antique Market Spring Fling  Craft Fair Tour De Tow At a Glance Calendar Main Street Members Members Sponsors Contact Where to Shop Where to Eat and Drink Properties Announcements Home Event Calendar Events Bartow Uncorked Bloomin' Bike Ride Chalk Walk Christmas Parade Fall Festival Friday Fest Halloween Parade Honey Bee Craft Fair Mistletoe Market Monthly Antique Market Spring Fling  Craft Fair Tour De Tow At a Glance Calendar Main Street Members Members Sponsors Contact Where to Shop Where to Eat and Drink Properties Announcements More Home Event Calendar Events Bartow Uncorked Bloomin' Bike Ride Chalk Walk Christmas Parade Fall Festival Friday Fest Halloween Parade Honey Bee Craft Fair Mistletoe Market Monthly Antique Market Spring Fling  Craft Fair Tour De Tow At a Glance Calendar Main Street Members Members Sponsors Contact Where to Shop Where to Eat and Drink Properties Announcements Home Event Calendar Events Bartow Uncorked Bloomin' Bike Ride Chalk Walk Christmas Parade Fall Festival Friday Fest Halloween Parade Honey Bee Craft Fair Mistletoe Market Monthly Antique Market Spring Fling  Craft Fair Tour De Tow At a Glance Calendar Main Street Members Members Sponsors Contact Where to Shop Where to Eat and Drink Properties Announcements Properties 395 Central Avenue South, Bartow Total SF Available: 18,160 SF on 0.75 Acres Year Built: 1915 (Original Building), 2002 (Newer Building) 26 total private offices Sale Price: $2,700,000 Lease Rate: $15.00/SF/Yr - NNN The property can be subdivided so someone can purchase/occupy a portion of the property. The ability to lease individual private offices is also a possibility. The property features multiple conference rooms, a large mock courtroom, and even a humidor room. Contact Tyler Davis, CPA, ALC 205.441.8538 David Hungerford, CCIM, SIOR 863.660.3138 570 East Summerlin Street, Bartow 2,280 SF Block Building with metal roof and private parking and street parking in Downtown Bartow. Clear Span design with 10-Foot Ceilings provides endless possibilities as well as a chance to put your own touch on this extremely versatile space! Suitable for office, retail, or wholesale businesses with fantastic curb appeal in the front and a new large 6' wide door in the rear of the building that makes loading and unloading convenient. Recent upgrades to the roof, windows and electric have made this space ready for your new business. Downtown Bartow is rapidly redeveloping and this location is at the heart of a thriving business scene. Be part of the transformation and watch your business grow in this vibrant community. PROPERTY HIGHLIGHTS Downtown Commercial Property Clear Span Recent Renovations Public Utilities Block Construction, Metal Roof Available for sale or lease (Rental Terms - $12 per Sq Ft.  Minimum one year lease. ) Contact Erin Cardin with Crosby & Associates 141 5th St. NW, Ste. 202 Winter Haven, FL 33881 Office:  863-293-5600 Cell:  863-604-0564 www.crosbydirt.com Properties 120 E. Davidson St. Unit 105 E. Main Street (Upstairs) 105 E. Main Street (Upstairs) PROPERTY FACTS Property Type: Office Building Size: 3,655 SF Building Class: C Year Built: 1917 Building Height: 1 Story Typical Floor Size: 3,655 SF Building FAR: 0.46 Land Acres: 0.18 AC Contact Cedric Donaldson, CPA,Esq (407) 270-5025 Cedric@donaldsonlawpa.com www.donaldsonlawpa.com 105 E. Main Street (Upstairs) 105 E. Main Street (Upstairs) 105 E. Main Street (Upstairs) Office for rent, 600 sq. ft. Rents for $650 a month plus tax. Electric and water is included. For more information, contact Giodano Lanuto @ 267-825-5650. Properties 145 S. Central Ave. - Stuart Building 145 S. Central Ave. - Stuart Building Vintage building (built 1913) being one of the best example of early 20th Century commercial buildings remaining in Downtown Bartow. CB/brick/mortar construction with first floor awnings for the storefront retail spaces. The 2nd and 3rd floors have office spaces available for lease. The building has bathrooms available for tenants, conference room the building also has an elevator. Contact Kim Hancock 863-860- 6876 for showing, availability and pricing. 415 E. Main Street E. 145 S. Central Ave. - Stuart Building MAIN ST. BARTOW OFFICE 415 E MAIN ST BARTOW, FL 33830 LEASE INFORMATION Lease Type: Gross Total Space: 100 - 250 SF Lease Term: Negotiable Lease Rate: $425.00 - $1,000.00 per month AVAILABLE SPACES Downtown Bartow Office Space Available Units 205, 206,207, 210, 213, 214, 218 & 219 Approx. 120 Sq Ft. $450 a month Downtown Bartow Conference Room or Rent Available 250 SF Gross $1,000 per month Upstairs Reception area Available 100 SF Gross $425 per month Downstairs Reception area Available 100 SF Gross $425 per month Contact: Carissa Fosdick Anthony Commercial ,Inc. 813-712-1235 cfodick@anthonyandpartners.com 2025 East Flamingo Drive 1,374 Sq. Ft.  Commercial Lease  $2,500 monthly, 30,000 yearly. Contact Denise Bohde 404-925-3412 320 South Florida Avenue 320 South Florida Avenue The Mahoney Group, Inc. presents a rare, one-of-a- kind landmark building. The former Tuscan Mason’s Lodge, a 12,000 SF 3-story building in the heart of Bartow, Florida. This property is being offered for sale/purchase. For inquiries, please contact: or Maria Mahoney 863 640-0445 . 750 West Main Street 320 South Florida Avenue 750 West Main Street LOCATION DESCRIPTION This property is located in the heart o Bartow, with the Bartow Courthouse being situated just 0.5 ± miles from the subject. It enjoys the great advantage of having State Road 60 just 0.2 miles away, which sees a total o 22,500 ± cars/day. U.S Highway 98 is 1.1 ± miles from the subject and is connected to State Road 60. Contact: GLENN FOLSOM – (SVN/Saunders Ralson Danzler) Senior Advisor glenn.olsom@svn.com Direct: 877.518.5263 x418 | Cell: 863.559.3268 780 West Main Street 320 South Florida Avenue 750 West Main Street PROPERTY OVERVIEW Located right to State Road 60 and along West Main Street in Bartow, this property is a prime chance or a highway commercial opportunity. The subject is a class A building situated on a 0.56 ± acre lot and is a total o 5,000 ± SF, built in 2008. Included is the west 50 FT o the adjacent 750 West Main Street property or added parking.  The property adjacent to this building is or sale as well (750 West Main Street). Both properties can be sold together.   PROPERTY HIGHLIGHTS Class \"A\" office building Built in 2008 0.2 miles from SR 60 (22,500 ± Cars/Day) 0.5 miles from Bartow Courthouse in 2008. Included is the west 50 FT of the adjacent 750 West Main Street property or added parking. OFFERING SUMMARY Sale Price: $700,000 Building Size: 5,000 ± SF Lot Size: 0.56 ± Acres Price / SF: $140.00 Year Built: 2008 Zoning: Highway Commercial APN: 25-30-06-385500- 003030 Property Taxes:  $11,310.58 (2023) Contact: GLENN FOLSOM – (SVN/Saunders Ralson Danzler) Senior Advisor glenn.olsom@svn.com Direct: 877.518.5263 x418 | Cell: 863.559.3268 2040 Highway 60, Bartow 2040 Highway 60, Bartow 2040 Highway 60, Bartow The office building located at 2040 Highway 60, Bartow, Florida 33830 offers a comprehensive range of amenities designed to enhance both functionality and security for its occupants. The property is secured with a gated entry, ensuring controlled access and peace of mind. Inside, the building features four spacious office spaces that can be divided to accommodate multiple workstations, providing flexibility to suit various business needs. A well-equipped conference room is available, ideal for meetings and presentations, offering a professional environment for business operations. The building also includes a dedicated breakroom, providing a comfortable space for employees to relax and recharge during their breaks, enhancing overall workplace satisfaction and productivity. Additionally, the property offers designated parking spaces, ensuring convenient and accessible parking for both staff and visitors. This comprehensive suite of features makes 2040 Highway 60 an ideal location for businesses seeking a secure, functional, and well-appointed office space in Bartow, Florida. 1678 Sq Ft. Lot 0.5 ac Craig Burke CRAIG BURKE REAL ESTATE GROUP, LLC (863) 899-5010 525 East Main Street 2040 Highway 60, Bartow 2040 Highway 60, Bartow Prime Commercial Retail Space Available! Are you looking for a large retail space (2190 sq ft.) in the heart of downtown? This location is perfect for a multitude of retail options. This commercial property features the opportunity to lease one or all three spacious buildings, each with approximately 20 feet of prime window frontage, providing excellent visibility and exposure. The front open and expansive, ideal for showcasing your merchandise or services. Additionally, the unit includes a rear storage area, offering convenient and practical space for your business needs. Opportunities like this are rare. This unique property allows you to combine the three spaces into one large retail area or use them independently, providing flexibility to suit your business requirements. Don't miss out on this exceptional opportunity to establish your business in a prime downtown location. Contact us today for more information! Craig Burke CRAIG BURKE REAL ESTATE GROUP, LLC (863) 899-5010 135 East Central Avenue 2040 Highway 60, Bartow 135 East Central Avenue Located in the heart of historic downtown Bartow, 135 E Central Avenue presents a rare and valuable opportunity for entrepreneurs and investors. This multi-use building offers two street-level commercial units, each approximately 1,500 square feet, situated in a high-visibility area known for its walkability, charming boutiques, and steady foot and vehicle traffic. One of the units is occupied by \"Sweet Magnolia's,\" a well-established cafe that has been a community favorite for over ten years. In addition to daily dining, Sweet Magnolia's offers private parties, catering services, and maintains a strong presence and affiliation with downtown Bartow events and initiatives. The second commercial unit \"Two Crazy Nuts\" is the only Ice Cream shop in Bartow with additional specialties in chocolates, candy, boiled peanuts, candied nuts, pickles, lemonade, and other sweet treats, further enhancing the property's income potential. These tenants have a five year rental history. The building is being sold turnkey, fully furnished with high-quality commercial kitchen and catering equipment, providing immediate operational capabilities for new ownership. Above the commercial spaces, the second floor has been transformed into a spacious and homesteaded residential unit featuring four bedrooms, two bathrooms, an open-concept kitchen and family room, and a generous primary suite. The owner is willing to include the furnishings within the home as well. Each with their own private entrances makes these ideal Income producing properties individually or collectively as well. Each of the three units--two commercial and one residential--has separate utility meters, HVAC systems, and private access, allowing for flexibility in leasing or personal use. The roof is approximately two years old, there is a dry wood termite bond in place on the building that is transferable, and designated parking for residents. Whether you're seeking to own and operate a business, expand your investment portfolio, or live in the upstairs residence while earning income from below, this property offers unmatched versatility and value in one of Bartow's most desirable locations. Craig Burke CRAIG BURKE REAL ESTATE GROUP, LLC (863) 899-5010 905 East Main Street 155 S. Central Avenue 135 East Central Avenue Locate your business in a very visible area. Corner location with lots of parking! 1,500 Sq Ft Sale Price $425,000, will also consider a  lease depending on the lease. Contact: Michael Nolen, Jr., REALTOR 863 508-1716 Office 863 651-1971 Cell The Nolen Group, Inc. Coldwell Banker Realty 290 Cypress Gardens Blvd Ste #13 Winter Haven, FL 33880 michael@thenolengroup.com www.TheNolenGroup.com 155 S. Central Avenue 155 S. Central Avenue 155 S. Central Avenue For Lease 155 S Central Avenue, Space is approximately 500 sqft Retail Tenant… Required to be open, and staffed with a person, Monday through Friday, 10 to 6, Saturday, 9 to 4, and Open for all Downtown events. $1,400 per month, plus 3% sales tax (The Florida commercial sales tax on rent for real property will end on October 1, 2025.), $60 monthly maintenance fee, security deposit is $1,400 and first month, along with required insurance, would be due to move in. 2-year lease. Non-Retail Tenant… Required to be open, and staffed with a person, Monday through Friday, 10 to 6, Saturday, 9 to 4, and Open for all Downtown events. $2,000 per month, plus 3% sales tax (The Florida commercial sales tax on rent for real property will end on October 1, 2025.), $60 monthly maintenance fee, security deposit is $2,000 and fist month, along with required insurance, would be due to move in. 2-year lease. Contact Kim Hancock 863-860- 6876 for showing. Contact Where to Shop Where to Eat and Drink Main Street Bartow Copyright © 2025 Main Street Bartow - All Rights Reserved. Powered by Upcoming Events! learnMore This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    }
  ]
}