{
  "fuentes": [
    {
      "url": "https://mainstreet.org/about/who-we-are",
      "email": "info@mainstreet.org"
    },
    {
      "url": "https://mainstreetlive.com/contact-us/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://mainstreetlive.com/about-us/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://mainstreetlive.com/gun-shy/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://mainstreetlaunch.org/board-members/",
      "email": "updates@mainstreetlaunch.org"
    },
    {
      "url": "https://mainstreetstationrichmond.com/contact-us/",
      "email": "crystal.lowery@richmondgov.com"
    },
    {
      "url": "https://mainstreetstationrichmond.com/contact-us/",
      "email": "crystal.lowery@rva.gov"
    },
    {
      "url": "https://mainstreetlive.com/moonshind-bandits/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://mainstreetlive.com/biketoberfestival/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://mainstreetlive.com/upcoming-events/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://mainstreetlive.com/crashrocket-2/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://mainstreetlive.com/sand-theory/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "dfelton@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "mainstreetbankayerbranch@bankmainstreet.onmicrosoft.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "mainstreetbankgrangerbranch@bankmainstreet.onmicrosoft.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "mainstreetbankhudsonbranch@bankmainstreet.onmicrosoft.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "mainstreetbanknorthboroughbranch@bankmainstreet.onmicrosoft.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "mainstreetbankpepperellbranch@bankmainstreet.onmicrosoft.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "mainstreetbanksouthboroughbranch@bankmainstreet.onmicrosoft.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "tlawrence@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "cseidlich@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "edorian@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "jberube@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "jconaghan@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "jstewart@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "jtucker@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "kthorne@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "mgreer@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "pberry@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "rcavanagh@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "sdupre@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "wdwyer@bankmainstreet.com"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "email": "wkeyles@bankmainstreet.com"
    },
    {
      "url": "https://www.mainstcapital.com/investors/corporate-governance/board-of-directors",
      "email": "info@mainstcapital.com"
    },
    {
      "url": "https://msainsurance.com/contact",
      "email": "brandmarketing@msagroup.com"
    },
    {
      "url": "https://mainstreetlive.com/overkilt/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://mainstreetlive.com/",
      "email": "info@mainstreetlive.com"
    },
    {
      "url": "https://www.mainstreet.org/about/our-team",
      "email": "info@mainstreet.org"
    }
  ],
  "mails": [
    "brandmarketing@msagroup.com",
    "crystal.lowery@richmondgov.com",
    "crystal.lowery@rva.gov",
    "cseidlich@bankmainstreet.com",
    "dfelton@bankmainstreet.com",
    "edorian@bankmainstreet.com",
    "info@inzmo.com",
    "info@mainstcapital.com",
    "info@mainstreet.org",
    "info@mainstreetlive.com",
    "jberube@bankmainstreet.com",
    "jconaghan@bankmainstreet.com",
    "jstewart@bankmainstreet.com",
    "jtucker@bankmainstreet.com",
    "kthorne@bankmainstreet.com",
    "mainstreetbankayerbranch@bankmainstreet.onmicrosoft.com",
    "mainstreetbankgrangerbranch@bankmainstreet.onmicrosoft.com",
    "mainstreetbankhudsonbranch@bankmainstreet.onmicrosoft.com",
    "mainstreetbanknorthboroughbranch@bankmainstreet.onmicrosoft.com",
    "mainstreetbankpepperellbranch@bankmainstreet.onmicrosoft.com",
    "mainstreetbanksouthboroughbranch@bankmainstreet.onmicrosoft.com",
    "mgreer@bankmainstreet.com",
    "pberry@bankmainstreet.com",
    "rcavanagh@bankmainstreet.com",
    "sdupre@bankmainstreet.com",
    "tlawrence@bankmainstreet.com",
    "updates@mainstreetlaunch.org",
    "wdwyer@bankmainstreet.com",
    "wkeyles@bankmainstreet.com"
  ],
  "nombre_sitio": "mainstreetlive.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mainstreet.org/about/who-we-are",
      "text": "Who We Are | Main Street America Skip to content English Español Member Login Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities English Español Member Login Donate Search About Who We Are Main Street America has been helping strengthen and reenergize downtowns and neighborhood commercial districts for more than 45 years. Explore This Section Who We Are How We Work Partner Collaborations Our Supporters Our Team Contact Us Who We Are How We Work Partner Collaborations Our Supporters Our Team Contact Us Atlanta, Georgia © Main Street America WE ARE MAIN STREET Main Street America ( MSA ) leads an inclusive, impact-driven movement dedicated to reenergizing and strengthening older and historic downtowns and neighborhood commercial districts through place-based economic development and community preservation. We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Main Street America was founded in 1980 as the National Main Street Center®, a program of the National Trust for Historic Preservation. Over the past 40 years the MSA network has helped to generate over $ 115 . 27 billion in local reinvestment, rehab 345 , 801 buildings, create 815 , 894 new jobs, and start 181 , 647 new businesses in over 2 , 000 communities. Our History Main Street America has been helping reenergize and strengthen communities since 1977 . Mary Means, the founder of Main Street (left) © The National Trust for Historic Preservation Link to Our History Our Strategic Plan Main Street America’s new Strategic Plan will guide our work for the next 5 – 10 years, building on our legacy and core purpose. Link to Our Strategic Plan Our Team Our team is comprised of highly talented and passionate individuals dedicated to place-based economic development. Atlanta, Georgia © Main Street America Link to Our Team Job Opportunities Explore opportunities to join our team of highly skilled and dedicated individuals committed to place-based economic development. Main Street America team at the 2022 Main Street Now Conference in Richmond, Virginia. © Main Street America Link to Job Opportunities We Believe Main Streets Are for Everyone Everyone should have access to an inclusive and resilient Main Street – a place that has a thriving local economy, is distinctive and rich in character, and features welcoming spaces and diverse businesses for residents and visitors alike. Main Street America models and champions this vision through our actions and programs. Learn more about our vision and steps we are taking to shape an inclusive future . Main Spotlight: The Economics of Fall Foliage Tourism Fall foliage tourism has a substantial economic impact on small towns and rural areas nationwide. Learn how Main Streets can leverage their leaves to boost their communities this fall. September 9, 2025 Vibrant fall colors drive tourists to towns like Stowe, Vermont. Photo by BackyardProduction. Insights Staff Spotlight: Exploring Arkansas with Lisa Mullins Thompson Lisa shares reflections about eight Arkansas communities that recently received assessment visits August 28, 2025 Lisa Mullins Thompson traveled across the state with Main Street Arkansas. Photo by Lisa Mullins Thompson. Storytelling Main Spotlight: 5 Tips for Running a Successful Grant Program Our grantmaking team shares their advice to help you run a successful grant program and expand your impact in your community. August 26, 2025 Mercado del Pueblo Business Incubator received a grant from The Hartford Small Business Accelerator Grant Program. Photo courtesy of PRCC . How-to Just Dropped: New Courses in the Main Street America Academy Deepen your knowledge, bring your vision to life, and expand your impact with our latest Main Street America Academy course. Whether you’re navigating your first grant or hosting a community event, the Local Main Street Leader Launching module is designed to support your growth without burning out. August 20, 2025 Turn plans into progress with the Local Main Street Leader Launching courses. Photo by KandE Productions. Announcement Vintage Vibes, Digital Drive with Rachael Kehler, Peppermint Stick Candy Store Join host Matt Wagner for his conversation with Rachael Kehler, owner of The Peppermint Stick Candy Store in Boyertown, Pennsylvania. In this episode, Matt and Rachael discuss her journey to entrepreneurship, leveraging nostalgia as a marketing tool, small town tourism, and more. August 20, 2025 Storytelling Main Spotlight: Building Shared Priorities to Unlock Growth Main Street America has partnered with the Robert Wood Johnson Foundation to explore the impact of the Capital Absorption Framework in Main Street communities in Virginia and Wisconsin. August 19, 2025 Participants in Wisconsin gather for a workshop in West Allis, WI . Photo by Main Street America. Insights Community Spotlight: How Nashville’s Entrepreneurs are Driving Community Transformation Discover how small businesses are breaking barriers in our Breaking Barriers to Business (B3) series, starting with a powerful spotlight on Nashville’s local changemakers. August 14, 2025 Nashville, Tennessee © Breaking Barriers to Business ( B 3 ) Storytelling Made on Main: DANE Fragrance As part of a new series on Main Street America’s online store, Shop Main Street, we're highlighting the stories behind the amazing brands, makers, and producers along our Main Streets. Today, we’re highlighting DANE Fragrance, a perfumery based in Ukiah, California. August 14, 2025 Storytelling Spotlight on a Main Street Board Member: The Visionary Spirit of Maxine Clark Meet Maxine Clark—entrepreneur, philanthropist, and board member at Delmar Main Street in St. Louis, Missouri—and hear Erin's takeaways from their conversation about advocacy, resiliency, and leadership. August 7, 2025 From left: Gayla Roten, State Director at Missouri Main Street; Felice McClendon, Executive Director at Delmar Main Street; Maxine Clark, Delmar Main Street Board Member and Chief Inspirator at Delmar DivINe; Erin Barnes, President and CEO at Main Street America. Photo courtesy of Maxine Clark. Storytelling Main Spotlight: How a Fresh Start Revitalized Downtown Maryville’s Market Scene Farmers markets are fantastic tools to support local businesses, drive traffic downtown, and build community connections. Learn how Downtown Maryville built their market from an idea to a success. August 5, 2025 The Downtown Maryville Market brings people of all ages to Maryville’s Main Street. Photo courtesy of Downtown Maryville. How-to Main Spotlight: Walking Together to Connect a Community Charles Town Now brings people together with an event that celebrates the importance of nothing. Discover how they organized the event and its lasting impact on the community. July 29, 2025 The Charles Town community gathered for their largest Walk About Nothing on June 4 th . Photo courtesy of Charles Town Now. Storytelling Strengthen Local Economies with the 2025 Supporting Small Businesses on Main Street Course Generously sponsored by U.S. Bank, this live, three-week course centers the real challenges of entrepreneurs and equips Main Street leaders with invaluable insights and practical tools to respond. Register today! July 28, 2025 Oregon City, Oregon. Photo by Adam Wickham. Announcement Middlesboro, Kentucky © Danny Vaughn Get Involved Become a Main Street America Supporter Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Learn More Join a National Network of Community-Builders Sign up for news, events, and more. Subscribe Contact Main Street America 53 West Jackson Blvd. Suite 350 Chicago, IL 60604 P 312-610-5613 info@mainstreet.org Get Social © 2025 National Main Street Center, Inc. Privacy Policy Terms of Use"
    },
    {
      "url": "https://mainstreetlive.com/contact-us/",
      "text": "Main Street Daytona Beach Bar - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Contact Us Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://mainstreetlive.com/about-us/",
      "text": "Biker Bar Daytona Beach - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us About Us When it’s time to have an afternoon or night out with friends and family, there is no better place to visit than the Main Street Station Authentic Garage Bar and Music Venue. A popular, historic destination located in the heart of Main Street, Daytona Beach, this classic icon unites the enthusiasm of music with the racing history, bike events, and spring break mecca blocks from the beach. The World’s most famous beach is a destination that gathers people from around the globe to meet each year to celebrate their passion for racing, cars, and of course, the beach! Located just 2 minutes from Daytona Beach and a few blocks from The Ocean Center Convention Center, Main Street Station is a historical landmark with its beginning dating back to 1934, along with the origins of stock car racing on the beach. Main Street Station features three full, open-air bars with ample and visible bike and car parking and the largest, cleanest restrooms on Main Street! We feature nightly specials, live music, dancing, pool tables, free WI-FI, theme nights, live video web-streaming. While visiting “Main Street Station” pick up some of our branded merchandise Main Street Station is THE PLACE TO BE for Bike Week and Biketoberfest, New Year’s Eve, 4th of July, and more seasonal events offering Daytona’s hottest entertainment, including multiple National Acts, exciting nightlife, and the friendliest staff! This one-of-a-kind, authentic vintage garage bar and historic gathering place attracts people of all ages 21 and up. It is well known for its Wednesday Bike Nights and Daytona’s BEST Live Music, with daily activities, drink specials, live music 5 nights a week and more. Staff Photos Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://mainstreetlive.com/gun-shy/",
      "text": "Gun Shy | Live Music Garage Bar - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us GUN SHY ABOUT THE BAND Band Description Coming Soon! GALLERY UPCOMING SCHEDULE List No event found! Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://mainstreetlaunch.org/board-members/",
      "text": "Board Members - Main Street Launch.org Skip to content (510) 763-4297 Monday – Friday 9:30AM - 5PM Newsletter Sign Up Secure File Upload Main Street Launch.org Powering Dreams. Transforming Communities. Our Lending Programs Oakland San Francisco Statewide Client Spotlights About Us Our Mission & Impact Our Staff Board Members Funders Careers Start an Application Our Lending Programs Oakland San Francisco Statewide Client Spotlights About Us Our Mission & Impact Our Staff Board Members Funders Careers Start an Application Board Members Our board members bring their professional skills and community experience to help us advance our mission. Main Street Launch is seeking Board Members who represent the communities that we serve. If you have a passion for our mission and are interested in joining the Board of Directors, please email updates@mainstreetlaunch.org . Main Street designates two of its Board meetings as public meetings and are open to the public to attend. For 2025 the dates of those meetings are currently scheduled on July 25th and December 12th. If you are interested in attending, please email updates@mainstreetlaunch.org . Wendell W. Jones II CHAIR Wendell retired as of August 2024 as the CFO of Trace Genomics. Previously he has been a Serial CFO and has been a CFO and/or co-founder of several technology companies in multiple industries including biotechnology, medical device, software, and internet related companies. Wendell has also served as consulting CFO to a number of companies including a laser manufacturer, a medical device company, a cybersecurity company and several technology companies which require finance and/or accounting advice. He has been a financial consultant to several companies and start ups in developing business plans, establishing their financial and internal control infrastructure, and driving their fundraising efforts. Wendell serves on a number of boards of both nonprofit and for profit organizations. Wendell has a B.B.A in Accounting from George Washington University. M.B.A. in Finance from Washington University’s Olin School of Business. Mark Alan Lindquist SECRETARY Mark directs the marketing and product development of Hartley Construction which he started with Nathaniel Hartley in 2010. Mark has 40 years of project experience, which includes: large industrial, retail, and commercial complexes; historic renovations; architectural review; and code enforcement. Mark is Past President of the Associated General Contractors of California, and a long time Board Member and Past Chair of the Salvation Army of Alameda County. Mark is an architect and holds numerous licenses in both engineering and building construction. LaSandra Hunt MEMBER LaSandra Hunt is an Executive Director with JP Morgan Chase Commercial Bank. She also serves as the firm’s first Supplier Diversity Ambassador and leads their diverse business practice in Northern California, educating internal and external stakeholders about the firm’s mission and resources dedicated to supporting diverse-, women-, and veteran-owned businesses as they scale, overcome challenges, and become more resilient. She has 20 years of experience in the financial industry, supporting clients navigate capital markets, drive optimum operational efficiency, grow, and scale. Prior to that, she worked as an Account Executive for NBC and CBS. She received a BA in Business in spring of 2015 from Golden Gate University. Stephanie Jones TREASURER Stephanie has contributed her financial services expertise to the Main Street Launch Board for over a decade. Prior to her retirement in 2020, she served as Senior Vice President and Business Acquisition Manager with Wells Fargo Bank. Her introduction to banking began over 40 years earlier as a bank teller. She progressed to become a Premier Banker, focusing on investments and client portfolio management, followed by several Branch Manager roles. With a passion for supporting small businesses, she left Retail Banking to join the Business Banking Group where she gained knowledge of commercial lending, sales, and treasury management. Stephanie remains active in several non-profit organizations and is currently treasurer of her Women’s Golf Group. She holds a BS degree in Business Management from University of Phoenix. Arthur Washington MEMBER Arthur a small business advisor with experience in small business financing and strategic business planning. Arthur’s finance background includes serving as a loan officer for the Small Business Administration and formerly as CEO for Nor-Cal FDC, a California Small Business Financial Development Corporation that serves the Bay Area counties. Arthur is the author of Finding Money for Your Business and, Business Plans for Financing. Arthur is also the Executive Director of the Business Resource Center (BRC), a Northern California-based financial publisher and seminar provider. Jim Wong MEMBER Born in China, Jim served as an enlisted U.S. Marine in Vietnam later becoming a presidentially decorated Marine officer. Following military service, he worked at GM’s Packard Electric Division in quality and reliability engineering, and at PepsiCo in training and development. Since 1988, Jim has worked in entrepreneurial ventures in management consulting, technology exploration and application. Jim has served on the board of two publicly-traded companies and a number of private firms. His philanthropic efforts include serving as Chairman of the National Veterans Transition Services, Inc. (REBOOT), a board member of the Military Spouse Chamber of Commerce and as advisor to NPower, which provides free IT training to veterans and young adults. During the pandemic, Jim and friends founded the California Veterans Chamber of Commerce. He earned a degree in Systems Dynamics and Organization Development from MIT. Elizabeth Fuchs MEMBER Elizabeth Fuchs is a highly accomplished commercial banking executive with 20+ years of experience driving growth, direct market penetration strategies, building de novo offices and fostering strong client and team relationships. Her expertise spans relationship management, risk management, credit underwriting, strategic planning, and M&A financing, enabling her to provide comprehensive support to a diverse client base through various economic cycles. Her dedication extends beyond the financial sector; she is actively involved in her community, notably through leadership roles in non-profits that support musical education in public schools and provide access to resources for small businesses in underserved communities. Elizabeth holds a bachelor’s degree in business administration from UC Berkeley. Her fluency in Spanish further enhances her ability to connect with a broader range of clients and community members. Erik Daniels MEMBER Erik Daniels is Head of SBA Lending at U.S. Bank, where he leads the team responsible for Small Business Administration lending nationwide. Erik is a member of U.S. Bank’s Operating Leadership team responsible for implementing the bank’s strategic initiatives. With a career spanning consulting and financial institutions, Erik focuses on helping businesses access capital and grow efficiently. He has led organizational transformation efforts across early-stage, growth, and turnaround environments. An active advocate for small business, Erik has served on the board and committees for the National Association of Government Guaranteed Lenders and regularly engages with congressional leaders on small business policy. Erik holds an MBA from the University of Southern California and a bachelor’s degree from California State Polytechnic University, Pomona. He is a graduate of the Consumer Bankers Association’s Executive Banking School and completed the McKinsey Hispanic & Latino Executive Leadership Program. A Southern California native, Erik is also active in community service, serving as a mentor for first-generation college students, coaching youth baseball and football, and raising funds for cancer research while running a marathon. Vernon Charles Goins II MEMBER Vernon Charles Goins II is a seasoned attorney and community leader. A graduate of Georgetown University and UC Hastings College of the Law, he also holds an MBA from the University of Laverne and an LLM in Taxation from Golden Gate University. Vernon began his career in education before transitioning to law, specializing in business, real estate litigation, probate, and estate planning. Vernon has held leadership roles in numerous legal and civic organizations, including President of the California Association of Black Lawyers and General Counsel to 100 Black Men of the Bay Area. A frequent lecturer and community educator, Vernon has taught at Merritt College, USF School of Law, and CSU East Bay. His many honors include the National Bar Association’s President’s Award and Congressional Recognition from Representative Barbara Lee. Fluent in French and Spanish, Vernon lives in the Bay Area with his wife, Darlene, and their son, Zachary. Gregory Hunter MEMBER Gregory Hunter is Vice President of Brokerage Services at Colliers in Oakland. With over 20 years of public sector leadership and more than a decade in commercial brokerage, he has a unique blend of public and private sector experience. Gregory holds a B.S. in Geography and Urban Planning from Southwest Texas State University and an M.A. in Public Administration from Baruch College (City University of New York). He is active in multiple community organizations with a focus on the development and real estate sectors. Gregory lives with his wife and daughter in the East Bay. ©Copyright 2016 Main Street Launch | Headquarters: 2101 Webster Street Suite 1200, Oakland, CA 94612 | 510.763.4297 | Registered 501(c)(3). EIN: 94-2548556 Go to Top The owner of this website has made a commitment to accessibility and inclusion, please report any problems that you encounter using the contact form on this website. This site uses the WP ADA Compliance Check plugin to enhance accessibility. We are using cookies to give you the best experience on our website. You can find out more about which cookies we are using or switch them off in settings . Accept Close GDPR Cookie Settings Privacy Policy Strictly Necessary Cookies Cookie Policy Powered by 960 DESIGN GDPR Cookie Compliance Privacy Policy Last Updated: 10/2/2023 Welcome to the Main Street Launch website. At Main Street Launch, we are committed to safeguarding the privacy of our website visitors and users. This Privacy Policy outlines how we collect, use, disclose, and protect your personal information when you visit our website or interact with us online. By using our website, you consent to the practices described in this Privacy Policy. If you do not agree with these practices, please do not use our website. Information We Collect Personal Information We may collect personal information from you when you voluntarily provide it to us, such as when you sign up for our newsletter, submit an inquiry form, or make a donation. This information may include: Name Email Address Phone Number Postal Address Payment Information (if applicable) Non-Personal Information We may also collect non-personal information automatically when you visit our website. This information may include: Internet Protocol (IP) addresses Browser type Device information Website usage data (e.g., pages visited, time spent on the site) How We Use Your Information We use the information we collect for the following purposes: To respond to your inquiries and provide you with information about our services and programs. To send you newsletters and updates if you have subscribed to them. To process and acknowledge your donations (if applicable). To improve our website and services based on user feedback and analytics. Disclosure of Your Information We do not sell or rent your personal information to third parties. We may share your personal information with trusted service providers who assist us in operating our website and delivering our services. These service providers are contractually obligated to protect your information and only use it for the purposes we specify. We may also disclose your information when required by law, in response to legal processes, or to protect our rights, privacy, safety, or property. Cookies and Tracking Technologies Our website may use cookies and other tracking technologies to enhance your browsing experience. You can choose to disable cookies through your browser settings, but this may affect the functionality of our website. Security We take reasonable measures to protect your personal information from unauthorized access, disclosure, alteration, or destruction. However, please be aware that no method of online transmission or storage is completely secure, and we cannot guarantee the absolute security of your data. Your Choices You have the right to: Access and update your personal information. Opt-out of receiving marketing communications. Request the deletion of your personal information (subject to legal obligations). To exercise any of these rights or to request information about the personal data we hold about you, please contact us using the information provided below. Contact Us If you have any questions or concerns about this Privacy Policy or our data practices, please contact us: Main Street Launch 510.763.4297 Changes to this Privacy Policy We may update this Privacy Policy from time to time to reflect changes in our practices or for other operational, legal, or regulatory reasons. The updated Privacy Policy will be posted on our website with the date of the last revision. Strictly Necessary Cookies Strictly Necessary Cookie should be enabled at all times so that we can save your preferences for cookie settings. Enable or Disable Cookies Enabled Disabled Cookie Policy Last Updated: 10/2/2023 Welcome to the Mainstreet Launch website. This Cookies Policy explains how we use cookies and similar tracking technologies when you visit our website. By using our website, you consent to the use of cookies as described in this policy. What Are Cookies? Cookies are small text files that are placed on your device (computer, smartphone, tablet) when you visit a website. They are widely used to make websites work more efficiently and to provide information to the website owners. Types of Cookies We Use Essential Cookies These cookies are necessary for the website to function properly. They enable you to navigate the website and use its features, such as accessing secure areas. Analytical/Performance Cookies These cookies allow us to collect information about how visitors use our website. They help us understand which pages are most and least popular, and how users interact with our site. The information collected is used to improve the website's performance. Functionality Cookies Functionality cookies enable the website to remember choices you make (such as your preferred language) and provide enhanced, more personalized features. Third-Party Cookies We may also use cookies from third-party service providers, such as Google Analytics, to gather and analyze website usage data. These third-party cookies are subject to the privacy policies of the respective providers. How to Manage Cookies You can manage or delete cookies at any time through your browser settings. However, please note that if you choose to disable cookies, certain parts of our website may not function properly. Instructions for managing cookies in Chrome Instructions for managing cookies in Firefox Instructions for managing cookies in Safari Instructions for managing cookies in Internet Explorer Changes to this Cookies Policy We may update this Cookies Policy to reflect changes in our practices or for other operational, legal, or regulatory reasons. The updated Cookies Policy will be posted on our website with the date of the last revision. Contact Us If you have any questions or concerns about this Cookies Policy or our use of cookies, please contact us: Mainstreet Launch 510.763.4297 Enable All Save Changes"
    },
    {
      "url": "https://mainstreetstationrichmond.com/contact-us/",
      "text": "Contact Us - Main Street Station Host Your Event The Headhouse The Shed Facility Rental FAQs Getting Around By Train By Bus By Bicycle By Air By Car Parking What to Do Welcome Center The Gallery Neighboring Attractions Nearby Excursions 17th Street Market Our Story Our Vision FAQs Contact Us Host Your Event The Headhouse The Shed Facility Rental FAQs Getting Around By Train By Bus By Bicycle By Air By Car Parking What to Do Welcome Center The Gallery Neighboring Attractions Nearby Excursions 17th Street Market Our Story Our Vision FAQs Contact Us Contact Us 1500 E. Main St. Richmond, VA 23219 For general information: (804) 646-3800 For event planning and rental information: Contact Crystal Lowery at (804) 646-1862 or crystal.lowery@rva.gov For train schedules and ticketing: Amtrak.com 1-800-USA-RAIL For MegaBus schedules and ticketing: https://us.megabus.com For information on the GRTC Pulse: http://ridegrtc.com/brt (804) 358-GRTC Get In Touch Complete the form below and we’ll be in touch with you. 7112024 contact Name * First Last * Last Email * Phone Type of Event * Date and Time (Start-End) Which Space Are You Interested In? Estimated Number of Attendees * Additional Information * Submit If you are human, leave this field blank. Δ RICHMOND, VIRGINIA’S ARRIVAL POINT IS RIGHT DOWNTOWN. WHERE WE ARE Getting Around By Train By Bus By Bicycle By Air By Car Parking What To Do Welcome Center The Gallery Neighboring Attractions Nearby Excursions 17th Street Market Host Your Event The Headhouse The Shed Facility Rental FAQs 1500 E Main St Richmond, VA 23219 804-646-3800 ADA Complaints"
    },
    {
      "url": "https://mainstreetlive.com/moonshind-bandits/",
      "text": "Moonshind Bandits| Live Music Garage Bar - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Moonshind Bandits Check out their Facebook Page for more info and how to purchase your ticket! Facebook ABOUT THE BAND Band Description Coming Soon! GALLERY UPCOMING SCHEDULE Select January February March April May June July August September October November December Select 2023 2024 2025 2026 2027 2028 2029 List No event found! Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://mainstreetlive.com/biketoberfestival/",
      "text": "Biketoberfest Daytona Beach FL - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Biketoberfest Let the Good Times Roll!. Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://mainstreetlive.com/upcoming-events/",
      "text": "Upcoming Events Daytona Beach Bar - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Upcoming Events 11 September Five Time Shag Facebook Twitter Linkedin Email View Detail 12 September Redgate Facebook Twitter Linkedin Email View Detail 13 September Are Friends Electric Facebook Twitter Linkedin Email View Detail 14 September Grab a Cold One (Specials Night) Facebook Twitter Linkedin Email View Detail 18 September Green Tree Brothers Facebook Twitter Linkedin Email View Detail 19 September Trae Pierce & the T-Stones Facebook Twitter Linkedin Email View Detail 20 September Battle of the Beach (Food Trucks) Facebook Twitter Linkedin Email View Detail 20 September Alex Hayes Band Facebook Twitter Linkedin Email View Detail 21 September Flying High Again (Ozzy Tribute) Facebook Twitter Linkedin Email View Detail 25 September Green Tree Brothers Facebook Twitter Linkedin Email View Detail 26 September Are Friends Electric Facebook Twitter Linkedin Email View Detail 27 September Hairdaze Facebook Twitter Linkedin Email View Detail No event found! Load More Search Events and more…. Search: Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://mainstreetlive.com/crashrocket-2/",
      "text": "Crashrocket | Live Music Venue & Bar - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us CRASHROCKET ABOUT THE BAND Band Description Coming Soon! GALLERY UPCOMING SCHEDULE List No event found! Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://mainstreetlive.com/sand-theory/",
      "text": "Sand Theory | Live Music Historic Garage - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us SAND THEORY ABOUT THE BAND Band Description Coming Soon! GALLERY UPCOMING SCHEDULE Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://www.bankmainstreet.com/about-us/meet-our-leadership-team/",
      "text": "Leadership Team at Main Street Bank FDIC-Insured - Backed by the full faith and credit of the U.S. Government Secure Login Locations & Hours Schedule Appointment Ayer Hudson Marlborough Main Office Northborough Pepperell Southborough Customer Service Contact Us Locations & Hours Video Connect Order Checks Wire Transfers About Us Our Story Main Street Bank History CRA Public File Charitable Foundation Community Support Meet Our Leadership Team Board of Directors & Corporators Annual Report Testimonials Careers Financial Education Banzai Financial Education Home Buying Resources News Fraud Prevention Workplace Banking Understanding Banking Business Checking Convenience e-Banking Equity Lines & Loans Financial Planning Mortgages Retirement Savings Security Read the latest financial article Secure Login Locations & Hours Schedule Appointment Ayer Hudson Marlborough Main Office Northborough Pepperell Southborough Customer Service Contact Us Locations & Hours Video Connect Order Checks Wire Transfers About Us Our Story Main Street Bank History CRA Public File Charitable Foundation Community Support Meet Our Leadership Team Board of Directors & Corporators Annual Report Testimonials Careers Financial Education Banzai Financial Education Home Buying Resources News Fraud Prevention Workplace Banking Understanding Banking Business Checking Convenience e-Banking Equity Lines & Loans Financial Planning Mortgages Retirement Savings Security Read the latest financial article Personal Checking Neighborhood Rewards Checking Main Street Checking Main Street Interest Checking BankOn Main Street Checking 18/65 Accounts Personal Account Deposit Rates Switch Banks with Ease Savings Accounts Main Street Savings Main Street Money Market BankOn Main Street Savings Holiday Account Certificate of Deposit Retirement Accounts eBanking Online Banking Mobile Banking Debit Cards Account and Debit Card Alerts Mobile Wallet Electronic Bill Pay and e‐bills E‐Statements External Transfers Credit Score Manage My Money Zelle® Video Connect Meet Our Branch Managers Open a Personal Account Business Business Checking Accounts Main Street Business Checking Main Street Business Premium Checking Main Street Business Interest Checking Main Street Corporate Analysis Checking Business Savings Accounts Main Street Business Savings Main Street Business Money Market Business e-Banking Business Online Banking Business Mobile Banking Business Debit Cards Zelle® Video Connect Business Account Deposit Rates Non-profit Organization Banking Main Street Cannabanking Acquisition Financing Business Loans & Lines of Credit Business Credit Cards Cash Management Services Escrow and Subaccounting Merchant Processing Meet Our Business Team Workplace Banking Start a Video Call Loans Auto Loans Equity Line of Credit Equity Loan Apply for a Home Equity Line of Credit Apply for a Home Equity Loan Personal Loans & Lines of Credit Personal Credit Cards Mortgage Loans Apply for a Mortgage Apply for a Consumer Loan Loan Rates Consumer Loan Payment Options Start a Video Call Video Connect Login Meet Our Leadership Team As a mutual bank, Main Street Bank is made up individuals who live and work in the communities we proudly serve. The members of our leadership team bring vision, proven expertise, and sound strategic decision making to grow our community bank. We also believe that accessibility to key decision makers makes banking with us easier. Walter J. Dwyer, IV Chief Executive Officer - Walter J. Dwyer, IV - Chief Executive Officer Ellen Dorian President & Chief Operating Officer - Ellen Dorian - President & Chief Operating Officer Ruth Cavanagh Executive Vice President Chief Lending Officer NMLS# 462322 - Ruth Cavanagh - Executive Vice President Chief Lending Officer Suzanne Dupre (She/Her/Hers) Executive Vice President Chief Human Resources Officer - Suzanne Dupre - Executive Vice President Chief Human Resources Officer David Felton Executive Vice President Chief Deposit Officer - David Felton - Executive Vice President Chief Deposit Officer Christopher Seidlich Executive Vice President Chief Financial Officer - Christopher Seidlich - Executive Vice President Chief Financial Officer Jeff Tucker (He/Him) Executive Vice President Strategy & Risk - Jeff Tucker - Executive Vice President Strategy & Risk Pam Berry Senior Vice President Compliance & CRA Officer - Pam Berry - Senior Vice President Compliance & CRA Officer Jennifer Berube Senior Vice President Cash Management Officer - Jennifer Berube - Senior Vice President Cash Management Officer Jamie Conaghan (She/Her) Senior Vice President Marketing & Digital - Jamie Conaghan - Senior Vice President Marketing & Digital A. Tyner Lawrence (he/him) Senior Vice President, Chief Information Officer - A. Tyner Lawrence - Senior Vice President, Chief Information Officer Jeff Stewart Senior Vice President Cash Management Services & Implementation - Jeff Stewart - Senior Vice President Cash Management Services & Implementation Karen Thorne Senior Vice President Credit Officer - Karen Thorne - Senior Vice President Credit Officer Tracy Bartucca Vice President Retail Lending Manager NMLS# 715851 - Tracy Bartucca - Vice President Retail Lending Manager Michelle Greer Vice President Branch Administrator - Michelle Greer - Vice President Branch Administrator Renee Jaworek Vice President BSA Officer - Renee Jaworek - Vice President BSA Officer William Keyles Vice President, Director of HR, Learning & Development - William Keyles - Vice President, Director of HR, Learning & Development General Banking Form Looking forward to hearing from you! Your Name * Your Email * Preferred Phone Zip Code * I'm interested in... * Your information will be stored and sent to us by email. We will use this information to reply to your inquiry. Please do not share any private information, such as account numbers or social security numbers. Checking this box signifies that you understand this use of your data. See our Privacy Policy here. Terms * Yes, I consent to my data being used for this purpose. reCAPTCHA Send Now If you are human, leave this field blank. Our lives are richer when we support one another. This is the guiding principle for how Main Street Bank does business. Main Office 81 Granger Boulevard Marlborough, MA 01752 508-481-8300 Follow Us On Personal Checking Savings E-Banking Credit Score Manage My Money Zelle® Personal Account Deposit Rates Switch Banks with Ease Business Checking Savings E-Banking Zelle® Cash Management Escrow and Subaccounting Merchant Processing Business Loans & Lines of Credit Business Credit Cards Loans Mortgage Equity Line of Credit Equity Loan Personal Loans & Lines of Credit Personal Credit Cards Auto Loans Loan Rates Consumer Loan Payment Options Learn Home Buying Resources News Understanding Banking Fraud Prevention Workplace Banking Customer Service Contact Us Locations & Hours Video Connect Wire Transfers Order Checks Locations Ayer Hudson Marlborough Main Office Northborough Pepperell Southborough About Us Our Story Main Street Bank History CRA Public File Community Support Meet Our Leadership Team Board of Directors & Corporators Annual Report Careers Privacy Terms of Use Security Member FDIC Member DIF Equal Housing Lender Member SUM Network Routing # 211370752 NMLS ID # 562292 Full List of NMLS Employees Available Upon Request ©2025 Main Street Bank Thank you for banking with us! Cancel General Contact Form Your Name * Your Email * Preferred Phone Zip Code * Please give us a few details about your request: * Your information will be stored and sent to us by email. We will use this information to reply to your inquiry. Please do not share any private information, such as account numbers or social security numbers. Checking this box signifies that you understand this use of your data. See our Privacy Policy here. Terms * Yes, I consent to my data being used for this purpose. Captcha Send Now If you are human, leave this field blank."
    },
    {
      "url": "https://www.mainstcapital.com/investors/corporate-governance/board-of-directors",
      "text": "Board of Directors :: Main Street Capital Corporation (MAIN) Skip to main content Skip to section navigation Skip to footer News Contact Careers Home About About Lower Middle Market Solutions Private Credit Solutions Company History Corporate Social Responsibility Team Executive Committee Lower Middle Market Team Private Credit Team Finance, Legal, Compliance, & Accounting Board of Directors Portfolio Companies Lower Middle Market Private Credit Investors IR Overview News & Events Company Information Financial Information Listed Securities Information SEC Filings Governance For Business Owners What Makes Us Different Who We Invest In Why Businesses Partner With Us How We Invest Minority Recapitalization News Contact Careers Search Search Main Street Investor Relations - Board of Directors Main Street Announces Second Quarter 2025 Results View Investor Presentation View Summary Fact Sheet 175 Cumulative Investments $46.86 Per Share Cumulative Dividend $8.4B+ Capital Under Management Investors Investors IR Overview News & Events Press Releases Events Presentations Email Alerts Media Assets Company Information Environmental, Social and Corporate Governance Investor Relations Contacts FAQ Financial Information Listed Securities Information Historical Data Dividends Dividend Reinvestment and Direct Stock Purchase Plan Tax Information SEC Filings All SEC Filings Annual Reports Quarterly Reports Proxy Filings Governance Board of Directors Board Committees Governance Documents Governance Board of Directors Board Committees Governance Documents Vince Foster Chairman of the Board Mr. Foster has served as Chairman of Main Street’s Board since 2007. Mr. Foster previously served as Main Street’s Chief Executive Officer from 2007 until November 2018 and also served as Main Street’s President from 2012 until 2015, as Executive Chairman from November 2018 until December 2021 and as senior advisor from January 2022 to May 2024. He has also been a member of our management team’s investment committee since its formation in 2007 and was a member of our management team’s executive committee from its formation in 2015 until December 2021. Mr. Foster served as a founding director of Quanta Services, Inc. (NYSE: PWR), a provider of specialty contracting services to the power, natural gas and telecommunications industries from its IPO in 1998 through 2025, where he also served on the audit committee and investment committee. He also served as a director of U.S. Concrete, Inc. (NASDAQCM: USCR) from 1999 until 2010, Carriage Services, Inc. (NYSE: CSV) from 1999 to 2011, MSC Income Fund, Inc. (“MSC Income”), a non-publicly traded business development company that is managed by MSC Adviser I, LLC, our wholly owned portfolio company and a registered investment adviser, from 2012 until 2013 and Team, Inc. (NYSE: TISI) from 2005 until 2017. In addition, Mr. Foster served as a founding director of the Texas TriCities Chapter of the National Association of Corporate Directors from 2004 to 2011. Mr. Foster, a certified public accountant, had a 19-year career with Arthur Andersen, where he was a partner from 1988 to 1997. Mr. Foster was the director of Arthur Andersen’s Corporate Finance and Mergers and Acquisitions practice for the Southwest United States and specialized in working with companies involved in consolidating their respective industries. Mr. Foster co-founded and from 1997 until December 2021 acted as co-managing partner and in other senior executive positions of several Main Street predecessor funds and entities, which are now subsidiaries of ours. Mr. Foster received the Ernst & Young Entrepreneur of the Year 2008 Award in the financial services category in the Houston & Gulf Coast Area. The program honors entrepreneurs who have demonstrated exceptionality in innovation, financial performance and personal commitment to their businesses and communities. Mr. Foster holds a Bachelor of Business Administration from Michigan State University and a J. D. degree from Wayne State University Law School. Dwayne Hyzak Member of the Board and Chief Executive Officer Mr. Hyzak has served as Main Street’s Chief Executive Officer since November 2018 and as a member of our Board since January 2018. Mr. Hyzak also serves as a member of our management team’s executive and investment committees. Mr. Hyzak previously served in several executive roles from 2011 to 2018, including as our President (2015 until November 2018), Chief Operating Officer (2014 until November 2018), Chief Financial Officer (2011 until 2014) and Senior Managing Director since 2011 and also served in other senior executive positions at Main Street prior to 2011. Prior to our IPO in 2007, Mr. Hyzak served as a Senior Managing Director and other executive positions of several Main Street predecessor funds and entities, which are now our subsidiaries. Mr. Hyzak joined Main Street in 2002, becoming one of the founding members of the firm. Since October 2020, Mr. Hyzak has also served as the Chief Executive Officer and Chairman of the Board of MSC Income. Prior to joining Main Street, Mr. Hyzak was a Director of Integration with Quanta Services, Inc. (NYSE: PWR), which provides specialty contracting services to the power, natural gas and telecommunications industries, where he was principally focused on the company’s mergers and acquisitions and corporate finance activities. Previously, Mr. Hyzak was a Manager with Arthur Andersen in its Transaction Advisory Services group. Mr. Hyzak currently serves on the board of directors of Child Advocates, a non-profit organization that trains and supports advocates to serve the interests of abused or neglected children in the greater Houston area. J. Kevin Griffin Independent Director Mr. Griffin serves as the Senior Vice President of Finance for UPMC, one of the world’s leading integrated healthcare delivery systems with approximately $26 billion in annual revenue. Headquartered in Pittsburgh, UPMC primarily serves residents across the Commonwealth of Pennsylvania, western New York and northwestern Maryland, but also draws patients for highly specialized services from across the nation and around the world. UPMC serves as both a provider and insurer, owning and operating over 40 hospitals and 800 clinical locations, and offering a variety of insurance products that cover approximately 4.5 million lives. Prior to joining UPMC in January 2024, Mr. Griffin was the Chief Strategy Officer for MaineHealth since 2022 and the Senior Vice President of Financial Planning & Analysis at Novant Health from 2012 until 2022. Before embarking on his career in healthcare, Mr. Griffin was a career investment banker who worked for several notable firms including Lazard Ltd, JPMorgan, Bank of America and several boutique firms. Mr. Griffin’s investment banking experience consists primarily of executing and originating mergers and acquisitions and corporate finance transactions. John E. Jackson Independent Director Mr. Jackson served as the President and Chief Executive Officer of CSI Compressco LP (NASDAQ: CCLP) (“CSI Compressco”), a provider of compression services and equipment for natural gas and oil production, gathering, transportation, processing and storage from 2021 until April 2024. Mr. Jackson previously served as the President and Chief Executive Officer of Spartan Energy Partners, which acquired the general partner of CSI Compressco in January 2021 before becoming a subsidiary of CSI Compressco through a restructuring transaction in November 2021. He has also been a director of Seitel, Inc., a privately owned provider of onshore seismic data to the oil and gas industry in North America, since August 2007. He previously served as a director of Basic Energy Services, Inc. (NYSE: BAS), a provider of well-site services in the United States to oil and natural gas drilling and producing companies, from December 2016 until December 2021, and was a member of the compensation committee and the chair of the audit committee of Basic Energy Services, Inc. He previously served as a director of CNX Midstream Partners, LP, formerly known as CONE Midstream Partners, LP (NYSE: CNXM, formerly CNNX), a master limited partnership that owns and operates natural gas gathering and other midstream energy assets in the Marcellus Shale in Pennsylvania and West Virginia, from January 2015 until its sale in September 2020, and was a member of its audit committee during that time. Mr. Jackson was Chairman, Chief Executive Officer and President of Price Gregory Services, Inc., a pipeline-related infrastructure service provider in North America, from February 2008 until its sale in October of 2009. He served as a director of Hanover Compressor Company (“Hanover”), now known as Exterran Corporation (NYSE: EXTN) and Archrock, Inc. (NYSE: AROC), from July 2004 until May 2010. Mr. Jackson also served as Hanover’s President and Chief Executive Officer from October 2004 to August 2007 and as Chief Financial Officer from January 2002 to October 2004. He also serves on the board of several nonprofit organizations. Brian E. Lane Independent Director Mr. Lane has served as Chief Executive Officer and President of Comfort Systems USA, Inc. (NYSE: FIX), a leading provider of commercial, industrial and institutional heating, ventilation and air conditioning and electrical services, since December 2011 and as a director of Comfort Systems since November 2010. Mr. Lane served as Comfort Systems’ President and Chief Operating Officer from March 2010 until December 2011. Mr. Lane joined Comfort Systems in October 2003 and served as Vice President and then Senior Vice President for Region One until he was named Executive Vice President and Chief Operating Officer in January 2009. Prior to joining Comfort Systems, Mr. Lane spent fifteen years at Halliburton Company (NYSE: HAL), a global service and equipment company devoted to energy, industrial, and government customers. During his tenure at Halliburton, he held various positions in business development, strategy and project initiatives, and he departed as the Regional Director of Europe and Africa. Mr. Lane’s additional experience included serving as a Regional Director of Capstone Turbine Corporation (NASDAQ: CPST), a distributed power manufacturer. He also was a Vice President of Kvaerner, an international engineering and construction company, where he focused on the chemical industry. Mr. Lane earned a Bachelor of Science in Chemistry from the University of Notre Dame and his MBA from Boston College. Dunia A. Shive Independent Director Ms. Shive served as Chief Executive Officer and President of Belo Corp. (NYSE: BLC), a media company that owned several television stations, from 2008 until its acquisition by Gannett Co., Inc. in 2013. After the acquisition, Ms. Shive served as Senior Vice President of TEGNA Inc., formerly Gannett Co., Inc. (NYSE: TGNA, formerly GCI), a broadcast and digital media company, until retiring in 2017. She joined Belo Corp. in 1993 and served in a variety of leadership positions during her tenure, including Chief Financial Officer. Ms. Shive has served on the boards of directors of Kimberly-Clark Corporation (NYSE: KMB), a global manufacturer of branded tissue and personal care products, since May 2019, and Trinity Industries, Inc. (NYSE: TRN), a leading provider of rail transportation products and services in North America, since March 2014, and DallasNews Corporation (NYSE: DALN), the leading local news and information publishing company in Texas, since September 2021. She serves (i) as the chair of the audit committee of Kimberly-Clark Corporation’s board of directors, (ii) on the corporate governance and directors nominating committee, the finance and risk committee, and as the chair of the audit committee of Trinity Industries, Inc.’s board of directors and (iii) on the compensation and management development committee and as the chair of the nominating and corporate governance committee of DallasNews Corporation’s board of directors. Ms. Shive serves as a Trustee of the Downtown Dallas Parks Conservancy. From 2014 to 2018, she was a director of Dr Pepper Snapple Group, Inc., now known as Keurig Dr Pepper Inc. (NYSE: KDP, formerly DPS). From 2009 to 2015, she served on the board of directors of the Associated Press, where she served as chair of the audit committee from 2011 to 2015. From 2008 to 2013, she served on the board of directors of Belo Corp. Stephen B. Solcher Independent Director Mr. Solcher served as the Senior Vice President of Finance and Business Operations and Chief Financial Officer of BMC Software, Inc. (“BMC”), a privately held company that is a global leader in software solutions, from August 2005 until October 2020, and as executive advisor from October 2020 until retiring in October 2021. Previously, Mr. Solcher served as BMC’s Treasurer and Vice President of Finance. He joined BMC in September 1991 as Assistant Treasurer and became Treasurer the following year. During Mr. Solcher’s tenure, BMC grew from nearly $130 million in annual revenue to $2.2 billion in annual revenue in 2013, its last year operating as a public company. In addition to leading many M&A transactions as Chief Financial Officer, Mr. Solcher was instrumental in BMC’s transition from being a publicly traded company to becoming a privately held company in 2013. Prior to joining BMC, he was employed by Arthur Andersen as a certified public accountant. Mr. Solcher also serves on the development board of the Mays Business School at Texas A&M University and has served on the board of numerous nonprofit organizations. He was recognized by Institutional Investor magazine as part of the “All American Executive Team” in 2010 and 2012 and by Houston Business Journal as 2012 Best CFO — Large Public Company. Email Alerts Contacts FAQ RSS News Feed Main Street Capital Corporation 1300 Post Oak Blvd, 8th Floor, Houston, TX 77056 Copyright © 2025 . All Rights Reserved. Terms of Use Search Sitemap Contact Us local_phone"
    },
    {
      "url": "https://msainsurance.com/contact",
      "text": "Contact Us | Main Street America Insurance Skip to main content Top Navigation Customer Login Agent Login Report a Claim Find an Agent Main navigation Insurance Business Insurance Business Owners General Liability Commercial Auto Workers' Compensation Umbrella Surety Bonds Flood Farm and Ranch Resources Pay a Bill One-Time Payment Billing and Payment FAQ's About About Us Our Values Careers Newsroom 100 Year Anniversary Community Involvement Leadership Team Annual Reports Contact CONTACT US CONTACT US Customer Login Access your policy details Get your auto ID cards and policy forms Make a payment View your billing and payment history Check the status of a claim Log in to your account Claims We are committed to making the claims process as easy as possible. Report a Claim Online Auto repair shop locator Deductible status Roadside assistance: 877.425.2467 Policy Services Your independent agent can help you with policy servicing requests, payments, and more. Your agent’s name and number are located on your billing statement. Pay a bill (no login required) To make a change to your policy, please contact your agent. Get a Quote Your local, independent agent can help you get a quote. Find an Agent Customer Care Our Customer Care team can help you with: Policy status questions Billing and payment questions A copy of your ID cards For other policy questions or changes, please contact your agent using their contact information, which is located on your billing or policy statement. 877.927.5672 Other Contact Information General Information or Concerns To submit a concern about an agent, coverage, or claim, contact Consumer Affairs at 877.927.5672 , or submit your concern online . To reach a staff member directly, contact the front desk at 800.258.5310 . You can submit website feedback online. Mailing Address Main Street America Insurance P.O Box 2300 Keene, NH 03431 For Agents and Producers Log in to Agents Only Agent claim reporting by phone: 877.425.2467 Apply for an appointment Press/Media Contact brandmarketing@msagroup.com Newsroom Operating Hours Our Customer Care hours of operation are Monday-Friday from 8 a.m. to 8 p.m. ET. Most claims can be filed 24/7. Please see the claims page for details. Our office hours are Monday-Friday from 8 a.m. to 4 p.m. ET. Our offices observe the following nine holidays for our employees to enjoy time with their families: New Year's Day, Martin Luther King, Jr. Day, Memorial Day, Independence Day, Labor Day, Thanksgiving Day, Day after Thanksgiving, Christmas Eve, Christmas Day. Business Insurance Contact Us Customer Login Make a Payment Agent Login Become an Agent About Us Careers Supplier Information Writing Companies INSURANCE Business Owners General Liability Surety Bonds Worker's Comp Auto Umbrella Farm and Ranch CONNECT Make a Payment Report a Claim Find an Agent Contact Us Resources FOR AGENTS Agent Login Become an Agent COMPANY About Us Careers Community Involvement Leadership Team Our Companies Newsroom Supplier Information Writing Companies ©2025 Main Street America Insurance. All rights reserved. 55 West St, Keene, NH 03431. Privacy Terms and\n          Conditions Legal Notices"
    },
    {
      "url": "https://mainstreetlive.com/overkilt/",
      "text": "OverKilt | Live Music Historic Garage Bar - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us OVERKILT ABOUT THE BAND Band Description Coming Soon! GALLERY UPCOMING SCHEDULE Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://mainstreetlive.com/",
      "text": "Daytona Beach Live Music Venue & Bar - Main Street Station Skip to content 386-214-1389 info@mainstreetlive.com Facebook page opens in new window Instagram page opens in new window YouTube page opens in new window Live Music Venue & Bar in Daytona Beach Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us Search: Home Events Battle of The Babes Karaoke Night Rock O Ween Biketoberfest Band Profile Afterlife Alt X Are Friends Electric Bad Actors Big Engine Black Sheep Calmnet Cheg Crashrocket Deadlanders Derek Trull Easy Heart Green Tree Brothers Greg Warren Band Gun Shy Hayfire Knight Snake Moonshind Bandits Occasional Astronauts OverKilt Penta Pop Culture Poets Raging Sun RedGate R.E.L Sand Theory Shadow Cabinet Shoot to Thrill Shovelhead Split Personality Band Toy Box Tribucon Wildcard Zombie Zu Krew Upcoming Events About Us History Career Contact Us CALENDAR August September 2025 October SU MO TU WE TH FR SA 31 1 2 3 4 Burnside Burnside 4:00 pm - 11:00 pm 5 Papa Wheelee Papa Wheelee 4:00 pm - 12:00 am 6 Papa Wheelee Papa Wheelee 4:00 pm - 12:00 am 7 Tantric w/ special guest Rob Benton Tantric w/ special guest Rob Benton 4:00 pm 8 9 10 11 Five Time Shag Five Time Shag 4:00 pm - 11:00 pm 12 Redgate Redgate 4:00 pm - 12:00 am 13 Are Friends Electric Are Friends Electric 4:00 pm - 12:00 am 14 Grab a Cold One (Specials Night) Grab a Cold One (Specials Night) 4:00 pm 15 16 17 18 Green Tree Brothers Green Tree Brothers 4:00 pm - 11:00 pm 19 Trae Pierce & the T-Stones Trae Pierce & the T-Stones 4:00 pm - 12:00 am 20 Battle of the Beach (Food Trucks) Battle of the Beach (Food Trucks) 4:00 pm - 12:00 am Alex Hayes Band Alex Hayes Band 4:00 pm - 12:00 am 21 Flying High Again (Ozzy Tribute) Flying High Again (Ozzy Tribute) 4:00 pm , ... 22 23 24 25 Green Tree Brothers Green Tree Brothers 4:00 pm - 11:00 pm 26 Are Friends Electric Are Friends Electric 4:00 pm - 12:00 am 27 Hairdaze Hairdaze 4:00 pm - 12:00 am 28 Craft Cocktails Craft Cocktails 4:00 pm - 8:00 pm 29 30 1 2 3 4 Live Music Venue & Bar in Daytona LIFE IS BETTER IN THE GARAGE! UPCOMING EVENTS 11 September Five Time Shag Facebook Twitter Linkedin Email View Detail 12 September Redgate Facebook Twitter Linkedin Email View Detail 13 September Are Friends Electric Facebook Twitter Linkedin Email View Detail 14 September Grab a Cold One (Specials Night) Facebook Twitter Linkedin Email View Detail 18 September Green Tree Brothers Facebook Twitter Linkedin Email View Detail 19 September Trae Pierce & the T-Stones Facebook Twitter Linkedin Email View Detail 20 September Battle of the Beach (Food Trucks) Facebook Twitter Linkedin Email View Detail 20 September Alex Hayes Band Facebook Twitter Linkedin Email View Detail 21 September Flying High Again (Ozzy Tribute) Facebook Twitter Linkedin Email View Detail 25 September Green Tree Brothers Facebook Twitter Linkedin Email View Detail 26 September Are Friends Electric Facebook Twitter Linkedin Email View Detail 27 September Hairdaze Facebook Twitter Linkedin Email View Detail No event found! Load More View more Upcoming Events MEET THE BANDS Main Street Station Historic Garage Bar and Live Music Venue 316 Main Street, Daytona Beach, FL 32118 386.214.1389 316mainstreet@gmail.com Find us on: Facebook page opens in new window YouTube page opens in new window Instagram page opens in new window Copyright © 2025. All rights reserved. | Live Music Venue & Bar in Daytona | Managed, Web Design and Phoenix SEO by Black Box Consulting Go to Top error: Content is protected !!"
    },
    {
      "url": "https://www.mainstreet.org/about/our-team",
      "text": "Main Street America Staff Members | Main Street America Skip to content English Español Member Login Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities Marion, Iowa © Tasha Sams About We work in collaboration with thousands of local partners and grassroots leaders across the nation who share our commitment to advancing shared prosperity, creating resilient economies, and improving quality of life. Overview Who We Are How We Work Partner Collaborations Our Supporters Our Team Job Opportunities 2024 Annual Report Contact Us Emporia, Kansas © Emporia Main Street Our Network Made up of small towns, mid-sized communities, and urban commercial districts, the thousands of organizations, individuals, volunteers, and local leaders that make up Main Street America™ represent the broad diversity that makes this country so unique. Overview Coordinating Programs Main Street Communities Collective Impact Awards & Recognition Community Evaluation Framework Join the Movement Chicago, Illinois © Main Street America Resources Looking for strategies and tools to support you in your work? Delve into the Main Street Resource Center and explore a wide range of resources including our extensive Knowledge Hub, professional development opportunities, field service offerings, advocacy support, and more! Overview Knowledge Hub Field Services Government Relations Main Street Now Conference Main Street America Academy Funding Opportunities Small Business Support Allied Member Services The Point Main Street Insurance Members Area Waterloo, Iowa © Main Street Waterloo The Latest Your one-stop-shop for all the latest stories, news, events, and opportunities – including grants and funding programs – across Main Street. Overview News & Stories Events & Opportunities Subscribe Kendall Whittier — Tulsa, Oklahoma © Kendall Whittier Main Street Get Involved Join us in our work to advance shared prosperity, create strong economies, and improve quality of life in downtowns and neighborhood commercial districts. Overview Join Us Renew Your Membership Donate Partner With Us Job Opportunities English Español Member Login Donate Search About Our Team Meet the talented and passionate people behind the work. Explore This Section Who We Are How We Work Partner Collaborations Our Supporters Our Team Contact Us Who We Are How We Work Partner Collaborations Our Supporters Our Team Contact Us Board of Directors Coordinating Program Leadership Council Senior Management Team Erin Barnes bio Erin Barnes President and CEO Dionne Baux bio Dionne Baux Chief Programs Officer John Chomiak bio John Chomiak Chief Financial and Administration Officer Matt Wagner, Ph.D. bio Matt Wagner, Ph.D. Chief Innovation Officer Hannah White bio Hannah White Chief Impact Officer Staff Members Steve Amraen bio Steve Amraen Manager of Network Services Joi Cuartero Austin bio Joi Cuartero Austin Senior Program Officer, Economic Vitality Rachel Bowdon bio Rachel Bowdon Senior Director of Marketing and Communications Casie Cameron bio Casie Cameron Manager of Instructional Design Genesis Rivera Candelaria bio Genesis Rivera Candelaria Program Coordinator, Neighborhood Commercial Districts Amber Cooper bio Amber Cooper Director of Talent & Culture Mike Donohue bio Mike Donohue Manager of Media Relations Katie Eckstein bio Katie Eckstein Director of Development Amanda Elliott bio Amanda Elliott Vice President of Field Services Hannah Mira Friedland bio Hannah Mira Friedland Manager, Strategic Projects Alicia Gallo bio Alicia Gallo Associate Director of Strategic Communications Maggie Gillespie bio Maggie Gillespie Associate Manager, Thriving Communities Program Luke Hallowell bio Luke Hallowell Senior Manager of Capital Absorption Shane Hampton bio Shane Hampton Senior Manager, Thriving Communities Program Aoife Harte bio Aoife Harte Associate Research Analyst Kelly Humrichouser bio Kelly Humrichouser Director of Government Relations Tali Jamir bio Tali Jamir Director of Membership Operations Michael Jarosz bio Michael Jarosz Manager of Government Relations Jawanza Joseph bio Jawanza Joseph Director of Governmental Finance and Grants Kathy La Plante bio Kathy La Plante Vice President of Coordinating Programs Amy Miller, MPA bio Amy Miller, MPA Program Officer Emi Morita bio Emi Morita Manager of Research Amanda Mutai bio Amanda Mutai Associate Manager Anya Nair bio Anya Nair Executive Assistant Christy Noel-Tracie bio Christy Noel-Tracie Partner Marketing Coordinator Marta Olmos bio Marta Olmos Associate Manager of Content and Communications Wendy Otero bio Wendy Otero Manager of Marketing and Outreach Miriam Parson, MSUS bio Miriam Parson, MSUS Director of Network Capacity Building, Launch Hilary Pellegrin bio Hilary Pellegrin Staff Accountant Michael Powe, Ph.D. bio Michael Powe, Ph.D. Senior Director of Research Erik Reader bio Erik Reader Director of Illinois Main Street Bethany Rogers, Ph.D. bio Bethany Rogers, Ph.D. Vice President of Strategic Projects Tasha Sams bio Tasha Sams Director of Education Liz Shenk bio Liz Shenk Senior Manager of Marketing and Outreach Amanda Siskind bio Amanda Siskind Associate Manager, Corporate Grants Program Jonathan Stone bio Jonathan Stone Program Officer Jackie Swihart bio Jackie Swihart Director of Network Capacity Building, Strengthen Chandra Teddleton, Ph.D. bio Chandra Teddleton, Ph.D. Program Officer Jenna Temkin bio Jenna Temkin Senior Manager of Development Lisa Mullins Thompson bio Lisa Mullins Thompson Senior Program Officer Marcela Uribe, Ph.D. bio Marcela Uribe, Ph.D. Bilingual Program Officer for Revitalization Services Gustavo Ustariz bio Gustavo Ustariz Director of Entrepreneur & Small Business Support Tia Vice bio Tia Vice Manager of Strategic Projects Sylvia Warfield bio Sylvia Warfield Membership Assistant David Weinberger bio David Weinberger Director of Grant Programs Debra Wise bio Debra Wise Senior Business Manager Join a National Network of Community-Builders Sign up for news, events, and more. Subscribe Contact Main Street America 53 West Jackson Blvd. Suite 350 Chicago, IL 60604 P 312-610-5613 info@mainstreet.org Get Social © 2025 National Main Street Center, Inc. Privacy Policy Terms of Use"
    }
  ]
}