{
  "fuentes": [
    {
      "url": "https://www.zapplication.org/event-gallery.php?ID=12288",
      "email": "contactzapp@wearecreativewest.org"
    },
    {
      "url": "https://www.zapplication.org/event-gallery.php?ID=12288",
      "email": "zappsales@wearecreativewest.org"
    },
    {
      "url": "https://www.orlandosentinel.com/2024/11/05/orlando-weekend-events-maker-faire-maitland-rotary-art-festival-edc-jazz/",
      "email": "pconnolly@orlandosentinel.com"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "gabe@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "info@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "leadershipboard@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "olivia@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "oliviac@journeysherwood.org"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "email": "scott@journeysherwood.org"
    },
    {
      "url": "https://business.seminolebusiness.org/events/details/45th-annual-maitland-rotary-art-festival-art-under-the-stars-r-25584",
      "email": "info@seminolebusiness.org"
    },
    {
      "url": "https://www.maitlandchamber.com/list/member/maitland-rotary-art-festival-inc-590",
      "email": "info@maitlandchamber.com"
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=12288",
      "email": "contactzapp@wearecreativewest.org"
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=12288",
      "email": "zappsales@wearecreativewest.org"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "achapman@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "andrew@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "bhuff@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "cfarmer@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "cfryer@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "echristopoulos@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "edassler@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "estuart@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "fzaky@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "jchapman@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "jdomenus@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "jmelius@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "jpacheco@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "jschuster@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "jsouki@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "karen@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "mkwok@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "ninam@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "sarah@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "sbranch@midatlanticarts.org"
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "email": "slewitus@midatlanticarts.org"
    },
    {
      "url": "https://www.gottagoorlando.com/post/the-48th-annual-maitland-rotary-art-festival-is-back-with-art-music-activities-food-and-more",
      "email": "info@gottagoorlando.com"
    }
  ],
  "mails": [
    "achapman@midatlanticarts.org",
    "andrew@midatlanticarts.org",
    "bhuff@midatlanticarts.org",
    "cfarmer@midatlanticarts.org",
    "cfryer@midatlanticarts.org",
    "contactzapp@wearecreativewest.org",
    "echristopoulos@midatlanticarts.org",
    "edassler@midatlanticarts.org",
    "estuart@midatlanticarts.org",
    "fzaky@midatlanticarts.org",
    "gabe@journeysherwood.org",
    "info@gottagoorlando.com",
    "info@journeysherwood.org",
    "info@maitlandchamber.com",
    "info@seminolebusiness.org",
    "info@theatrenantucket.org",
    "jchapman@midatlanticarts.org",
    "jdomenus@midatlanticarts.org",
    "jmelius@midatlanticarts.org",
    "jpacheco@midatlanticarts.org",
    "jschuster@midatlanticarts.org",
    "jsouki@midatlanticarts.org",
    "karen@midatlanticarts.org",
    "leadershipboard@journeysherwood.org",
    "mkwok@midatlanticarts.org",
    "ninam@midatlanticarts.org",
    "olivia@journeysherwood.org",
    "oliviac@journeysherwood.org",
    "pconnolly@orlandosentinel.com",
    "sarah@midatlanticarts.org",
    "sbranch@midatlanticarts.org",
    "scott@journeysherwood.org",
    "slewitus@midatlanticarts.org",
    "zappsales@wearecreativewest.org"
  ],
  "nombre_sitio": "maitlandartfest.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.zapplication.org/event-gallery.php?ID=12288",
      "text": "ZAPP - Event Gallery - Maitland Rotary Art Festival 2024 - 48th Annual skip to content ZAPP - WHERE ARTISTS & ART FESTIVALS CONNECT MENU WHERE ARTISTS & ART FESTIVALS CONNECT Login Sign Up CLOSE WHERE ARTISTS & ART FESTIVALS CONNECT CLOSE Login Sign Up Events Calendar Events List Help Center About ZAPP ZAPP for Events ZAPP™ Software, LLC, powered by Creative West Maitland Rotary Art Festival 2024 - 48th Annual Event Dates: {{ galleryMetaData.eventStart | moment(\"l\") }} - {{ galleryMetaData.eventEnd | moment(\"l\") }} Location: {{ galleryMetaData.fairLocation }} {{ galleryMetaData.fairType }} Visit Event Website Artist Name: Location: Reset Search Show List View Show Grid View Sort By: Filter By Medium (Select multiple) {{discipline.discipline}} Artists/Artwork: Page {{currentPage}} of {{totalApps > 0 ? Math.ceil(totalApps/maxResults) : \"?\"}} Sort By: {{application.artist_name}} {{application.collaborator}} Booth: {{application.booth_number}} Not Assigned Artwork Artist Name Medium Location Booth Number {{application.title}} {{application.artist_name}} {{application.collaborator}} {{application.event_discipline}} {{application.location}} Booth: {{application.booth_number}} Not Assigned Filter By Medium: (Select multiple) {{discipline.discipline}} Loading gallery... Oops! It looks like the gallery isn't available for Maitland Rotary Art Festival 2024 - 48th Annual. Contact the show administrator for more information at maitlandartist@gmail.com . Terms of Use Contact Us Help Center Commitment to Accessibility | Share Feedback 2004-2025© ZAPP™ Software, LLC | Creative West Events Calendar Events List Blog ZAPP for Events About ZAPP Help Center Contact Us 2025 ZAPP™ Software, LLC | Creative West | Terms of Use Commitment to Accessibility | Share Feedback Facebook icon and link for Zapplication Instagram icon and link for Zapplication Youtube icon and link for Zapplication Contact Email: contactzapp@wearecreativewest.org Your Name: Please enter your name. Email: Please enter a valid email address. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Subject: Please select a subject Image Upload Help Checkout Help Show Question Enhancement Suggestion Other Please select a subject Message: Please enter your message Close Send message Contact Email: zappsales@wearecreativewest.org Your Name: Please enter your name. Event Name: Please enter your name. Email: Please enter a valid email address. Phone: Please enter a valid phone number. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Message: Please enter your message Close Send message Loading Artists... Artwork Information {{currentApp.first_name}} {{currentApp.last_name}} {{currentApp.collabs}} {{currentSample.title}} {{currentApp.event_discipline_desc}} {{currentSample.metadata.retail_price | toCurrency}} {{currentApp.city}}, {{currentApp.state}} Visit Website Artwork Information {{currentApp.first_name}} {{currentApp.last_name}} {{currentApp.collabs}} {{currentSample.title}} {{currentApp.event_discipline_desc}} {{currentSample.metadata.retail_price | toCurrency}} {{currentApp.city}}, {{currentApp.state}} Visit Website SHOWS SHOWS: Previous Artist Next Artist"
    },
    {
      "url": "https://www.orlandosentinel.com/2024/11/05/orlando-weekend-events-maker-faire-maitland-rotary-art-festival-edc-jazz/",
      "text": "Weekend events: Maker Faire, Maitland Rotary Art Festival, more Skip to content All Sections Subscribe Now 81°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Home Page Daily e-Edition Evening e-Edition News News Latest Headlines Politics Education National News Local News Local News Lake County Orange County Osceola County Seminole County Health Health Medicare Sports Sports High School Sports UCF Knights Orlando Magic Mike Bianchi Commentary Florida Gators Business Business Tourism Economy Real Estate GrowthSpotter Consumer Reviews Weather Weather Conditions and Forecasts Hurricanes Hurricane preparedness Hurricane Tracks Opinion Opinion Letters to the Editor Scott Maxwell Commentary Editorials Endorsements Entertainment Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Events Travel Travel Theme Parks Epic Universe Explore Florida Cruises Florida & Caribbean Experiences Obituaries Obituaries News Obituaries Place an Obituary Branded Content Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classifieds Services About the Orlando Sentinel Manage Subscription Subscriber Benefits Sign up for Newsletters Buy an advertisement Sign up for email newsletters Sign Up Things To Do | Orlando weekend events: Maker Faire, Maitland… Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Subscribe Login Account Settings Contact Us Log Out Spoof a user Sign up for email newsletters Sign Up Subscribe Login Search 81°F Thursday, September 11th 2025 Daily e-Edition Evening e-Edition Things To Do Entertainment Theater and Arts Things to Do Horoscopes Restaurants, Food & Drink Travel Trending: ☹️ Ticked off! 🚀 Launch schedule 🔍 Restaurant Inspections 🏠 Homeless Camping Ban 💻 Donate to Sentinel News Fund ❓🧔🏾‍♂️❓Read Asking Eric Breaking News Rifle is recovered in the search for Charlie Kirk’s killer, who blended in on Utah school campus Things To Do Orlando weekend events: Maker Faire, Maitland Rotary Art Festival among annual traditions returning Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X Maker Faire Orlando features hands-on exhibits about science, technology, engineering and math at Central Florida Fairgrounds Nov. 9-10. (Courtesy Roberto Gonzalez/Maker Faire Orlando) By Patrick Connolly | pconnolly@orlandosentinel.com | Orlando Sentinel PUBLISHED: November 5, 2024 at 5:00 AM EST Artists, makers, creators and craftspeople of all ages and backgrounds will congregate this weekend for the “Greatest Show and Tell on Earth.” Back for its 12th year in Central Florida Nov. 9-10, Maker Faire Orlando draws an estimated 14,000 attendees for two full days of power racing, cosplayers, battling robots, music and more than 250 exhibits with plenty of hands-on activities. “Maker Faire Orlando is a gathering of fascinating, curious people who enjoy learning and love sharing what they can do,” said Ian Cole, the Orlando event’s founder, in a news release. “From engineers to artists to scientists to crafters, Maker Faire Orlando is a venue for these ‘makers’ to show their hobbies, experiments, or projects for others to glimpse the future and get inspired.” Justin “SKIP” Skipper is one such creator who hopes to inspire visitors at this weekend’s event. The Central Florida-based artist and muralist will have faire attendees contribute to one of three 8-by-8-foot murals that use a “paint by number” format. “By the end of the show, we’ll have three Maker Faire-themed murals that were painted by the maker community,” he said. “What I’m doing this year is allowing people into an environment where they can contribute a little bit and feel like they actually had a part of something that is bigger.” Other event highlights include Robot Ruckus with combat robots, a drone zone, cosplay makers and power racing, an event where makers race their handmade machines with a budget of up to $500. The goal is to peel back the curtain on how things are made, perhaps motivating young creators to make their own inventions. “A big part of Maker Faire is to be able to create that ‘wow’ experience that really sparks imagination. We hope to inspire people to learn more, to get involved more and to find a way to be an inventor and a creator,” Skipper said. “It is definitely about trying to inspire the next generation of creators and engineers.” If you go Maker Faire Orlando is open 10 a.m.-5 p.m. Nov. 9-10 at 4603 W. Colonial Drive in Orlando. Online advance tickets are $20 for adults and $15 for students and children ages 3-17 (before tax). Two-day passes are also available. Parking is free. Food is available on-site. More information: makerfaireorlando.com Fire heats up the Kinetic Field Stage at EDC Orlando, the Electric Daisy Carnival, at Tinker Field on Friday, Nov. 8, 2019. The festival returns Nov. 8-10. (Patrick Connolly/Orlando Sentinel) More weekend events The Maitland Rotary Art Festival returns to Lake Lily Park for the 48th annual event. Explore work from 145 artists during the free-admission event from 5-9 p.m. Nov. 8, 10 a.m.-9 p.m. Nov. 9 and 10 a.m.-4 p.m. Nov. 10 at 701 Lake Lily Drive in Maitland. More information: maitlandartfest.org EDC Orlando is back with tens of thousands of attendees gathering at Tinker Field for a weekend full of electronic dance music, carnival rides and high-production stages. General admission starts at $132.14 for a single day or $264.34 for a three-day pass. The festival is open from 1 p.m.-midnight Nov. 8-10 at 287 S. Tampa Ave. in Orlando. More information: orlando.electricdaisycarnival.com Casselberry’s annual Craft Beer & Blues Festival lands at Lake Concord Park, featuring performer Pat Travers. Visitors can also find food trucks, art exhibits and vendors at the free event, which takes place from 5-9 p.m. Nov. 9 at 95 Triplet Lake Drive in Casselberry. More information: casselberry.org College Park Jazz Fest is back for its annual tradition with 12 live bands performing jazz, R&B and rock music. The annual neighborhood block party also features food vendors and shopping. Tickets are $15 per person in advance or $20 during the day of the event. Children 12 and younger enter for free. The festival is from 5-11 p.m. Nov. 9 along Edgewater Drive. More information: collegeparkmainstreet.com Find me @PConnPie on Instagram or send me an email: pconnolly@orlandosentinel.com . Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on Bluesky (Opens in new window) Bluesky Click to share on X (Opens in new window) X RevContent Feed Most Popular Most Popular Orange schools to reassign over 100 school teachers amid enrollment drops Orange schools to reassign over 100 school teachers amid enrollment drops 7 Central Florida restaurants shut down last week 7 Central Florida restaurants shut down last week DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida DeSantis’ step toward victory on ‘Alligator Alcatraz’ sets up a funding dilemma for Florida Florida’s ban on open carry of guns is unconstitutional, appeals court rules Florida’s ban on open carry of guns is unconstitutional, appeals court rules Conservative activist Charlie Kirk assassinated at Utah university Conservative activist Charlie Kirk assassinated at Utah university UCF offensive line coach Shawn Clark hospitalized for medical emergency UCF offensive line coach Shawn Clark hospitalized for medical emergency Orange judge reprimanded by Florida Supreme Court over rude comments Orange judge reprimanded by Florida Supreme Court over rude comments TV, kickoff time set for UCF’s home game vs. Bill Belichick and North Carolina TV, kickoff time set for UCF’s home game vs. Bill Belichick and North Carolina Bianchi: Why losing its biggest investor could be the best thing for Orlando’s baseball dream Bianchi: Why losing its biggest investor could be the best thing for Orlando's baseball dream Orlando mourns Tom Moench, 64, founder of Orange Blossom Brewing Orlando mourns Tom Moench, 64, founder of Orange Blossom Brewing More in Things To Do Orange County things to do, starting Sept. 12 Search our listings of events, festivals, performances: Things to Do in Orlando, Central Florida Lake County things to do, starting Sept. 12 Volusia County things to do, starting Sept. 12 2024 November 5 Tribune Publishing Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News South Florida Sun-Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company Info Archives Contact Us at the Orlando Sentinel Community News Fund Careers Manage Account Newsletters Daily e-Edition Evening Edition Help Advertise with Us Place an Ad Auto Listings Find a Job About the Orlando Sentinel Photo requests, reprints Send us a News Tip Subscriber Services & Help Site Map Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Policy Cookie Preferences CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Orlando Sentinel Close"
    },
    {
      "url": "https://journeysherwood.org/leadership-team",
      "text": "Leadership Team — Journey Church New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream New Here? Find Us Plan a Visit Leadership Team About Us Who We Are What We Believe Journey Kids Journey Youth Journey Women Journey Men Partners Next Steps Discipleship Bands Connection Card Serve Need Prayer? Journey Groups Be Baptized Membership at Journey Need Help? Summer at Journey Messages Give LiveStream Leadership Team New Here Find Us Plan a Visit Leadership Team Journey Church Staff Team Scott Edinger Lead Pastor scott@journeysherwood.org Olivia Pothoff Pastor of Worship & Care olivia@journeysherwood.org Gabe Nielsen Director of Journey Youth gabe@journeysherwood.org Olivia Cuddeford Director of Journey Kids oliviac@journeysherwood.org Journey Church Leadership Board The Leadership Board at Journey Church is made up of six members of the Journey Church family and the Lead Pastor. They are assigned to help guide, equip, and empower the pastors and staff at Journey Church to fulfill the mission and vision that God has uniquely given us. Our current Leadership Board members: Megan O’Connell, Jon Burgi, Lacey McNay, Ed Hatch, Amy Schlapper, Josh Thoreson. If you have any questions for the Leadership Board please email: leadershipboard@journeysherwood.org Back to Top Events Messages FOLLOWING JESUS TOGETHER Phone 503.610.0759 Email info@journeysherwood.org Gather 22689 SW Pine Street, Sherwood, OR Mail PO Box 322, Sherwood, OR 97140 Subscribe To Our Weekly Update Sign up with your email address to receive our weekly email updates. First Name Last Name Email Address Sign Up We respect your privacy. Thank you for signing up for our Weekly Update!"
    },
    {
      "url": "https://business.seminolebusiness.org/events/details/45th-annual-maitland-rotary-art-festival-art-under-the-stars-r-25584",
      "text": "45th Annual Maitland Rotary Art Festival | Art Under the Stars (R) - Nov 12, 2021 to Nov 14, 2021 - Seminole County Chamber Skip to content Join Why Join Member Benefits Apply Now Events Chamber Calendar Community Calendar Directory Full Directory Membership Map Restaurants Government & Education Non-profits Health Care Meeting Facilities Banking & Finance Our Groups Ambassadors Area Councils Chamber Committees Your Savings News Community News Chamber News Expert Advice Government News About Us Board Staff Trustees Other programs ChamberCast Certificate of Origin I’m Here! Chamber Crush Jobs Privacy Policy Contact Us 45th Annual Maitland Rotary Art Festival | Art Under the Stars (R) Date and Time Friday Nov 12, 2021 Sunday Nov 14, 2021 Festival Hours: Friday Nov 12 from 5pm-9pm; Saturday Nov 13 from 10am to 9pm; Sunday Nov 14 from 10am to 4pm. Location Lake Lily Park, 701 Lake Lily Drive, Maitland, Florida 701 Lake Lily Dr, Maitland Florida 32751 Fees/Admission Admission is FREE Website http://maitlandrotaryartfestival.org Contact Information Pat Woodley Send Email 45th Annual Maitland Rotary Art Festi... Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Description The 45th Annual Maitland Rotary Art Festival | Art Under the Stars (R) will be held November 12 - 14, 2021 at beautiful Lake Lily Park in Maitland, Florida. Festival Hours: Friday Nov 12 from 5pm-9pm; Saturday Nov 13 from 10am to 9pm; Sunday Nov 14 from 10am to 4pm.  Our community's biggest event of the year attracts top professional artists along with student artwork from Central Florida schools, live music, exhibits, fantastic food and more. Admission is FREE. Proceeds benefit local charities and non-profits. For more information, visit http://maitlandrotaryartfestival.org/. If you or your organization are interested in getting more involved, please contact Festival Chair Pat Woodley at 407.777.8515 or email MaitlandRotary@gmail.com. Ways to Support the Maitland Rotary Art Festival | Art Under the Stars (R): (1) Sponsorships are still available between $1,000 and $15,000; (2) Become a Patron of the Arts for $300 or $500 to receive Art Vouchers to purchase art at the festival, Patron Party invitations and more; (3) Advertise in our Festival Program for as little as $125 for a Business Card Ad up to $1,000 for the glossy back cover; (4) Become a Festival Volunteer; (5) Publicize our Art Festival by posting our mini-posters and flyers; (6) Attend the Art Festival Nov 12-14 with family and friends. To provide more information on ways you can support our festival, Maitland Rotary is holding Art Festival Happy Hours on alternate Mondays from 5-7pm at Venue on Lake Lily, The Maitland Civic Center, 641 S. Maitland Ave. These bi-weekly information sessions commence on Monday August 30, 2021, and run through November 8. Please come meet with us and find out how you can get involved! Set a Reminder Enter your email address below to receive a reminder message. Email address Select the amount of Days before the event -- Select Days Before Event -- 1 Day 2 Days 3 Days 1 Week Captcha Validation Please complete the Captcha Submit Business Directory News Releases Events Calendar Hot Deals Member To Member Deals Marketspace Job Postings Contact Us Information & Brochures Join The Chamber Share × Print Email Add to Calendar Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Select Calendar Type × Google Yahoo iCal (Outlook, Apple, or other) Close © 2025 Seminole County Chamber | Site by GrowthZone Privacy Policy Contact Us 407.708.4600 1055 AAA Drive, Suite 153, Heathrow, FL 32746 info@seminolebusiness.org © Seminole County Chamber.  All Rights Reserved. Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://www.maitlandchamber.com/list/member/maitland-rotary-art-festival-inc-590",
      "text": "Maitland Rotary Art Festival Inc. | Arts, Culture & Entertainment - Maitland Area Chamber of Commerce, FL Building Community One Business at a Time Toggle navigation Home Join Member Benefits Application ROI and Statistics Member Directory About Your Chamber About Your Chamber Board of Directors & Staff Sponsorship Opportunities Request Information Connections Get Involved with a Committee Young Professionals Maitland (YPM) Event Contact Information Market Space News Hot Deals Member to Member Deals Job Postings Events Calendar Events List Leadership Maitland Contact Us Member Login Join Today Find a Member View Events Pages Members Categories Quicklinks Events Maitland Rotary Art Festival Inc. Categories Arts, Culture & Entertainment Rotary at Maitland Civic Center 641 S Maitland Avenue Maitland FL 32751 (407) 777-8515 Send Email Visit Website Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Thank you to our Trustee members! Join Today Find a Member View Events Chamber Events Join Today Start benefiting from your Chamber membership today. Sign up today and get your business more exposure. Connect and grow your business with the Chamber. Join Today Directory Deals Map News Events Facebook Instagram Maitland Area Chamber of Commerce 500 N. Maitland Ave, Suite 100, Maitland, FL 32751 407. 644.0741 info@maitlandchamber.com © Copyright 2025 Maitland Area Chamber of Commerce. All Rights Reserved. Site provided by GrowthZone - powered by ChamberMaster software."
    },
    {
      "url": "https://www.zapplication.org/event-info.php?ID=12288",
      "text": "ZAPP - Event Information - skip to content ZAPP - WHERE ARTISTS & ART FESTIVALS CONNECT MENU WHERE ARTISTS & ART FESTIVALS CONNECT Login Sign Up CLOSE WHERE ARTISTS & ART FESTIVALS CONNECT CLOSE Login Sign Up Events Calendar Events List Help Center About ZAPP ZAPP for Events ZAPP™ Software, LLC, powered by Creative West BACK TO EVENTS Event Information View Event Gallery BACK TO EVENTS View Event Gallery CONTACT EVENT Location: {{location(event)}} REQUIREMENTS: Accepted Application Types: Emerging Artists: This application accepts applications from emerging artists and has an emerging artist program or grant. This application accepts applications from emerging artists. This application does not accept applications from emerging artists. Time Remaining: This event has passed. Favorite Event: Dates & Deadlines {{ event.application_start | moment(\"MMMM D, YYYY\") }} Open Date {{ event.jury_fee_early_end_date | moment(\"MMMM D, YYYY\") }} Early Bird Deadline {{ event.notify_date | moment(\"MMMM D, YYYY\") }} Notification Date {{ event.purchase_deadline | moment(\"MMMM D, YYYY\") }} Purchase Deadline {{ event.event_start | moment(\"MMMM D, YYYY\") }} Event Start {{ event.event_end | moment(\"MMMM D, YYYY\") }} Event End Select a link below to jump to that section GENERAL INFORMATION RULES/REGULATIONS BOOTH INFORMATION REFUND POLICY JURY DETAILS GENERAL RULES BOOTH REFUND JURY EVENT INFORMATION GENERAL INFORMATION RULES/REGULATIONS BOOTH INFORMATION REFUND POLICY JURY DETAILS Share (opens in a new tab) Share (opens in a new tab) View Legal Agreement Terms of Use Contact Us Help Center Commitment to Accessibility | Share Feedback 2004-2025© ZAPP™ Software, LLC | Creative West Events Calendar Events List Blog ZAPP for Events About ZAPP Help Center Contact Us 2025 ZAPP™ Software, LLC | Creative West | Terms of Use Commitment to Accessibility | Share Feedback Facebook icon and link for Zapplication Instagram icon and link for Zapplication Youtube icon and link for Zapplication Contact Email: contactzapp@wearecreativewest.org Your Name: Please enter your name. Email: Please enter a valid email address. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Subject: Please select a subject Image Upload Help Checkout Help Show Question Enhancement Suggestion Other Please select a subject Message: Please enter your message Close Send message Contact Email: zappsales@wearecreativewest.org Your Name: Please enter your name. Event Name: Please enter your name. Email: Please enter a valid email address. Phone: Please enter a valid phone number. Preference: Please select a contact preference Contact me by email Contact me by phone No preference Please select a contact preference Message: Please enter your message Close Send message"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://www.midatlanticarts.org/team-members/",
      "text": "Staff Team - Mid Atlantic Arts Grants & Programs Explore Opportunities Program Archive Past Grantees Panelist Interest Form International Festivals Opportunities Outside of Mid Atlantic Arts Application Portal Quick Links Accessibility Training ArtsCONNECT ArtsHERE CALT Appalachian Foodways Practitioner Fellowships CALT Black Appalachian Storytellers Fellowship CALT Community Anchors Initiative CALT Experiences Grants Cultural Sustainability: Community Roots Delaware Division of the Arts Individual Artist Fellowships Folk and Traditional Arts Folk and Traditional Arts Community Projects Grants Jazz Road Jazz Touring Network Mid Atlantic Tours National Leaders of Color Fellowship New Jersey State Council on the Arts Individual Artist Fellowships Performing Arts Global Exchange Philly Jazz Month Poetry Out Loud Special Presenter Initiatives USArtists International Walking Together: Investing in Folklife in Communities of Color Arts Spotlight Resources Professional Development Accessibility Policy Useful Links UEI Information International Festivals News & Publications Media Releases Newsletters Publications State Activity Reports About Us What We Do Our Priorities Our Region & Partners Support Our Work Strategic Plan Board of Directors Staff Team Career Opportunities Contact Us Application Portal Menu Grants & Programs Explore Opportunities Program Archive Past Grantees Panelist Interest Form International Festivals Opportunities Outside of Mid Atlantic Arts Application Portal Quick Links Accessibility Training ArtsCONNECT ArtsHERE CALT Appalachian Foodways Practitioner Fellowships CALT Black Appalachian Storytellers Fellowship CALT Community Anchors Initiative CALT Experiences Grants Cultural Sustainability: Community Roots Delaware Division of the Arts Individual Artist Fellowships Folk and Traditional Arts Folk and Traditional Arts Community Projects Grants Jazz Road Jazz Touring Network Mid Atlantic Tours National Leaders of Color Fellowship New Jersey State Council on the Arts Individual Artist Fellowships Performing Arts Global Exchange Philly Jazz Month Poetry Out Loud Special Presenter Initiatives USArtists International Walking Together: Investing in Folklife in Communities of Color Arts Spotlight Resources Professional Development Accessibility Policy Useful Links UEI Information International Festivals News & Publications Media Releases Newsletters Publications State Activity Reports About Us What We Do Our Priorities Our Region & Partners Support Our Work Strategic Plan Board of Directors Staff Team Career Opportunities Contact Us Application Portal Donate Newsletter Signup Logos Board Member Login Donate Newsletter Signup Logos Board Member Login Staff Team Operations Executive Director Juan Souki (he/him) jsouki@midatlanticarts.org Director of People & Culture Ezekiel Christopoulos (he/them) echristopoulos@midatlanticarts.org Grants Operations Coordinator Cedrick L. Farmer (he/him/his) cfarmer@midatlanticarts.org Grants Operations Associate Chelsea “Chels” Fryer (they/she) cfryer@midatlanticarts.org Jr. Staff Accountant Namra Inam (she/her/hers) ninam@midatlanticarts.org Grants Operations Manager Jamie Melius (they/she) jmelius@midatlanticarts.org Executive Assistant Jeanette Pacheco (she/her) jpacheco@midatlanticarts.org Interim Director of Finance Janessa Schuster (they/them) jschuster@midatlanticarts.org Programs Interim Director of Programs Ana Chapman she/her/ella achapman@midatlanticarts.org Program Director, Creativity in Community Sarah Branch (she/her/hers) sbranch@midatlanticarts.org ArtsHERE , Cultural Sustainability , National Leaders or Color Fellowships Program Associate, Folk and Traditional Arts Joel Chapman (he/him) jchapman@midatlanticarts.org Central Appalachia Living Traditions , Folk & Traditional Arts Community Projects Grants Program Director, Fellowships Jackie Domenus (they/she) jdomenus@midatlanticarts.org Delaware Individual Artist Fellowships , New Jersey Individual Artist Fellowships Program Director, Folk and Traditional Arts Ellie Dassler (she/her/hers) edassler@midatlanticarts.org Central Appalachia Living Traditions , Folk & Traditional Arts Community Projects Grants Program Director, Performing Arts and Accessibility Coordinator Sarah Lewitus (she/her/hers) slewitus@midatlanticarts.org Accessibility Policy , ArtsCONNECT , Mid Atlantic Tours , Special Presenter Initiatives Program Director, International Andrew Alness Olson (he/him/his) andrew@midatlanticarts.org Mid Atlantic Tours (International) , Performing Arts Global Exchange (PAGE) , USArtists International Program Director, Jazz Ernest Stuart (he/him) estuart@midatlanticarts.org Jazz Road , Jazz Touring Network Program Associate. Performing Arts and Creativity in Community Sarah Theune (she/her/hers) sarah@midatlanticarts.org ArtsCONNECT , ArtsHERE , Jazz Road , Jazz Touring Network , Mid Atlantic Tours , National Leaders of Color Fellowships , Special Presenter Initiatives Development Director of Development Brittney Huff (she/her/hers) bhuff@midatlanticarts.org Development Associate Fern Zaky (they/them) fzaky@midatlanticarts.org External Affairs Director of External Affairs Karen Newell (she/her/hers) karen@midatlanticarts.org Communications and Social Media Manager Mackenzie Kwok (she/her/hers) mkwok@midatlanticarts.org Stay Connected With Mid Atlantic Arts Get our latest news and announcements. This field is hidden when viewing the form Next Steps: Sync an Email Add-On To get the most out of your form, we suggest that you sync this form with an email add-on. To learn more about your email add-on options, visit the following page (https://www.gravityforms.com/the-8-best-email-plugins-for-wordpress-in-2020/). Important: Delete this tip before you publish the form. Your e-mail (Required) CAPTCHA 201 North Charles Street suite 401 Baltimore, MD 21201 Phone: 410.539.6656 Fax: 410.837.5517 In partnership with And the state, jurisdictional, and territorial arts agencies of Delaware, the District of Columbia, Maryland, New Jersey, New York, Pennsylvania, Puerto Rico, U.S. Virgin Islands, Virginia, and West Virginia. Accessibility Policy Privacy Policy Terms of Use Instagram Facebook LinkedIn Copyright 2023 Mid Atlantic Arts, Inc. All rights reserved."
    },
    {
      "url": "https://www.gottagoorlando.com/post/the-48th-annual-maitland-rotary-art-festival-is-back-with-art-music-activities-food-and-more",
      "text": "The 48th Annual Maitland Rotary Art Festival is back with art, music, activities, food and more! top of page Search News Orlando News Space Coast News Daytona Beach News Tampa Bay News Travel & Tourism News Orlando International Airport News Weather News Hotel & Resort News Retail News Deals & Special Offers Theme Parks Theme Park News Walt Disney World News Universal Orlando News Seaworld Orlando News Busch Gardens Tampa News Legoland Florida News Attractions Attraction News Water Park News Dinner Show News Entertainment Entertainment News Events & Festival News Concerts & Live Music News Stand-Up Comedy News Bar & Nightlife News Theater & The Arts News Museum & Gallery  News Film &  Movie Theater News Sports News Weekend Guide Events & Things To Do This Weekend Free  &  Cheap Things To Do This Weekend Food & Drink Events Event Calendar Submit Event Things To Do Top 10 Things To Do In Orlando Monthly Events Guide Theme Park Guide Attractions Guide Water Park Guide Dinner Show Guide Concerts & Music Guide Theater & The  Arts Guide Events & Festival Guide Restaurant Guide Bars & Nightlife Guide Movie Theater Guide Museums & Gallery Guide Shopping Guide Seasonal Valentine's Day Guide St Patrick's Day Guide Easter Guide Mother's Day Guide Father's Day Guide Memorial Day Guide 4th Of July Guide Halloween Guide Thanksgiving Guide Holiday & Christmas Guide New Year's Eve Guide What's New Contact Contact Us Newsletter About Us Advertise More Use tab to navigate through the menu items. The Latest News The 48th Annual Maitland Rotary Art Festival is back with art, music, activities, food and more! Alastair Mac Nov 8, 2024 2 min read This weekend, enjoy another year of fantastic art, lively music, and family fun at Lake Lily Park in Maitland! The 48th Annual Maitland Rotary Art Festival returns to Lake Lily Park in Maitland this weekend, featuring dozens of the best traveling artists, together with live music, activities for the kids, food, and more. This years event kicks off with a patrons party on Thursday, November 7, with the festiva open Friday, Nov. 8 from 5 - 9 pm, Saturday, Nov. 9 10 am - 7 pm, and Sunday, Nov. 10 from 10 am - 4 pm. Discover all the latest events and festival happening throughout Central Florida. The Maitland Rotary Art Festival has been entertaining Central Florida residents and visitors since 1976. Hosted annually by the Rotary Club of Maitland, Florida, the event has evolved into a community celebration of the arts. The many public and private partnerships make it possible for Maitland Rotarians to give back to our community. For more information on this year's event: https://www.facebook.com/events/1306092070370517 Check out all the latest news and more from Orlando and throughout Central Florida . Gotta Go Orlando offers the latest entertainment news, together with all the latest events and things to do throughout Central Florida. We feature concerts, theater, culture, nightlife, food & drink. theme parks, attractions, festivals, events, and more. With news and information being released on a daily basis, we encourage you to sign up for our newsletter and stay in the loop with all the latest exciting news from our local community. You can also join the local conversation on X , Facebook , Instagram , and YouTube . Contact Us Got a story to tell Orlando? Contact us now . To advertise with us, click here , and to list your upcoming event with us, submit it here . Tags: Maitland Events & Festival News Florida News Central Florida News Meet The GGO Team Emma Walton News Producer Contact Shane Walton News Producer Contact Alastair Mac News Editor Contact The Latest Headlines Ivanhoe Village, Milk District, Mills 50, and Curry Ford West team up for The Golden Girls Gone Wild Pub Crawl Get ready for a bizarre and brilliant night with Buckethead at The Plaza Live in Orlando! The Totally Rad Vintage Fest is coming to Tampa for the first time on September 13 Orlando Pride hosting a Teddy Bear Toss this weekend, a first in Inter&Co Stadium history! Hero's and Villains Unite - Fandom Kissimmee is back! Your Orlando Plans Are Here Orla n do Events This Weekend​ Orlando Events This Month Things To Do In Orlando Gotta Go Orlando is your local source for the latest entertainment news , events and things to do throughout Central Florida. We feature concerts , theater, arts & culture , nightlife , food & drink . theme parks & attractions, festivals, events , and more. © 2025  Gotta Go Orlando  -  All Rights Reserved Privacy Policy bottom of page"
    }
  ]
}