{
  "fuentes": [
    {
      "url": "https://www.maneros.com/blank-1",
      "email": "enjoyment@maneros.com"
    },
    {
      "url": "https://www.maneros.com/weekday-speicals",
      "email": "enjoyment@maneros.com"
    },
    {
      "url": "https://business.stuartmartinchamber.org/members/member/manero-s-restaurant-6387.htm",
      "email": "info@stuartmartinchamber.org"
    },
    {
      "url": "https://www.maneros.com/product-page/seduced-by-gorgonzola-book",
      "email": "enjoyment@maneros.com"
    },
    {
      "url": "https://www.maneros.com/blog",
      "email": "enjoyment@maneros.com"
    },
    {
      "url": "https://www.maneros.com/blank-3",
      "email": "enjoyment@maneros.com"
    },
    {
      "url": "https://manerosofmulberry.com/about-us/",
      "email": "info@jajajagroup.com"
    },
    {
      "url": "https://www.maneros.com/",
      "email": "enjoyment@maneros.com"
    }
  ],
  "mails": [
    "enjoyment@maneros.com",
    "info@jajajagroup.com",
    "info@stuartmartinchamber.org"
  ],
  "nombre_sitio": "maneros.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.maneros.com/blank-1",
      "text": "About | Manero's Website top of page Home About Lunch Menu Dinner Menu Off-premises DIY Catering Gallery Contact Reviews Shop More Use tab to navigate through the menu items. MANERO'S® RESTAURANT, PALM CITY, FLORIDA Manero's Website RESERVE NOW ORDER FOOD: PICK-UP OR DELIVERY BUY DIGITAL GIFT CARD About Us Stop in for fabulous food & service at lunch or dinner.  We have a great selection of appetizers, a full bar and delicious homemade desserts.  Our lunch menu offers freshly made soup, sandwiches, burgers, entree salads and baskets.  Our dinner menu features casual meals like burgers and flatbreads and coursed meals like prime rib, filet mignon, pork chops, chicken dishes and broiled salmon - all with salad and side dishes.  We have two dining areas; our recently renovated dining room and the Cock & Bull Pub area.  All food items are available for dine-in, take-out and delivery.  We accept reservations for dinner and walk-ins are always welcome.  Ownership is very active in operations and a great roster of management and staff is always on duty.  We have on-site parking and guest Wi-Fi.  We have a private party room for special events and meetings.  This room can be reserved by advance arrangement.  Your complete enjoyment is our mission.  We look forward to seeing you soon! Meet Some Of Our Fabulous Team Some of our MANY Key Players Catering Crew At SFSC Sunday Day Bartender and Festivites Chief Carson, Mackenzie Cold Production MANERO'S® RESTAURANT Call: (772) 220-3011 enjoyment@maneros.com ©2023 Manero's®, all rights reserved. bottom of page"
    },
    {
      "url": "https://www.maneros.com/weekday-speicals",
      "text": "Weekday Speicals | Manero's Website top of page Home About Lunch Menu Dinner Menu Off-premises DIY Catering Gallery Contact Reviews Shop More Use tab to navigate through the menu items. MANERO'S® RESTAURANT, PALM CITY, FLORIDA Manero's Website RESERVE NOW ORDER FOOD: PICK-UP OR DELIVERY BUY DIGITAL GIFT CARD Specials - Tuesday Wednesday Thursday Friday Saturday Sunday MANERO'S® RESTAURANT Call: (772) 220-3011 enjoyment@maneros.com ©2023 Manero's®, all rights reserved. bottom of page"
    },
    {
      "url": "https://business.stuartmartinchamber.org/members/member/manero-s-restaurant-6387.htm",
      "text": "Manero's Restaurant | Restaurants and Nightlife | CATERING/PERSONAL CHEF/BARTENDING/FOOD TRUCK | LIVE ENTERTAINMENT | RESTAURANTS Skip to content --°F Member Login Join Chamber The Chamber Close The Chamber Open The Chamber About Us President’s Report Membership Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship Vubiz Trains Events & News Close Events & News Open Events & News Upcoming Events Chamber Calendar Community Calendar Chamber Event Flyers Latest News Chamber & Member News Online Compass Florida Chamber News Legislative Updates Photo Galleries Breakfasts Luncheons Business After Hours Annual Expos Holiday Trade Show Installation of Officers LEADERship Ribbon Cuttings Golf Tournaments Special Events Business Close Business Open Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Close Tourism Open Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Close Relocation Open Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide The Digital Times Recreation Close Recreation Open Recreation Things to Do Boating Diving and Snorkeling Golf Courses Beaches and Parks Fish & Hunt Fishing Report Sailfish Tournaments Fishing Guide Manero's Restaurant Categories Restaurants and Nightlife CATERING/PERSONAL CHEF/BARTENDING/FOOD TRUCK LIVE ENTERTAINMENT RESTAURANTS 2851 S.W. High Meadows  Avenue Palm City FL 34990 (772) 220-3011 Send Email www.maneros.com Hours: Dinner Tues - Sun starting at 4 pm.  Lunch Tues - Fri starting at 11:30 am.  Closed Mondays, Driving Directions: Conveniently located near I-95 and Turnpike in Pam City.  We are near the intersection of High Meadows Ave and Martin Downs Blvd in a free-standing building. About Us Let’s take it back to Italy.  Everything is homemade & made to order.  Chef owned & operated.  Come as a customer….leave as family.  Let us cater your next event.  Full Bar Highlights Lunch $7.00 - $27.00 Dinner $7.00 - $60.00 Prime Rib, Steaks, Seafood, Burgers, Sandwiches, Gorgonzola Salad, Dividend Drinks Images Area's Greatest Prime Rib Every Night × Bam Shrimp At Lunch & Dinner × Famous Gorgonzola Salad with Blackened Salmon × Bunless Burger Bowl Is Popular at Lunch & Dinner × Known for Great Beef, We Have a Large and Small Filet Mignon × Homemade French Onion Soup is Outrageous × Great Angus Burgers at Lunc & Dinner × All Our Desserts are Made In House and Delicious × Rep/Contact Info Mr. Jay Mahoney × Close Mr. Jay Mahoney Owner Send an Email Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel Connect with us 1650 S Kanner Highway Stuart, FL 34994 772-287-1088 x111 info@stuartmartinchamber.org Facebook-f Twitter Youtube Linkedin-in Chamber Info Join The Chamber Member Search Member Benefits President's Report Contact The Chamber Privacy Policy News & Events Online Compass Member News Chamber Calendar Community Calendar Non-Profit Events Health Resources Newsletter Enter your email, subscribe to our newsletter and stay informed! Subscription Form Newsletter First Name Last Name Subscribe © 2025 STUART/MARTIN COUNTY CHAMBER OF COMMERCE. ALL RIGHTS RESERVED. Member Login Join Chamber The Chamber About Us President’s Report Member Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship VUBIZ Trains Events & News Chamber Calendar Community Calendar Photo Gallery Member News Chamber Event Flyers Online Compass Florida Chamber News Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide Recreation Boating Fishing and Hunting Fishing Report Sailfish Tournaments Fishing Guide Diving and Snorkeling Golf Courses Beaches and Parks Facebook-f Twitter Youtube Linkedin-in Search"
    },
    {
      "url": "https://www.maneros.com/product-page/seduced-by-gorgonzola-book",
      "text": "Seduced By Gorgonzola Book | Manero's Website top of page Home About Lunch Menu Dinner Menu Off-premises DIY Catering Gallery Contact Reviews Shop More Use tab to navigate through the menu items. MANERO'S® RESTAURANT, PALM CITY, FLORIDA Manero's Website RESERVE NOW ORDER FOOD: PICK-UP OR DELIVERY BUY DIGITAL GIFT CARD This is an interesting and fun history of the Manero's Restaurants and some of the great people that worked there as told by Donna Mahoney.  Donna is the niece of Nick Manero, Sr and worked at the Greenwich, Hallandale, West Pam Beach, Maggie Valley and Palm City locations. Seduced By Gorgonzola Book $15.00 Price Quantity * Add to Cart We stand behind our products. Orders are shipped Tuesday through Friday.  The expected arrival date is about three days from date of shipping.  Your input is always welcome; please call or email.  The price includes ground shipping. MANERO'S® RESTAURANT Call: (772) 220-3011 enjoyment@maneros.com ©2023 Manero's®, all rights reserved. bottom of page"
    },
    {
      "url": "https://www.maneros.com/blog",
      "text": "Blog | Manero's Website top of page Home About Lunch Menu Dinner Menu Off-premises DIY Catering Gallery Contact Reviews Shop More Use tab to navigate through the menu items. MANERO'S® RESTAURANT, PALM CITY, FLORIDA Manero's Website RESERVE NOW ORDER FOOD: PICK-UP OR DELIVERY BUY DIGITAL GIFT CARD All Posts Search Check back soon Once posts are published, you’ll see them here. HOME CONTACT US MANERO'S® RESTAURANT Call: (772) 220-3011 enjoyment@maneros.com ©2023 Manero's®, all rights reserved. bottom of page"
    },
    {
      "url": "https://www.maneros.com/blank-3",
      "text": "Contact | Manero's Website top of page Home About Lunch Menu Dinner Menu Off-premises DIY Catering Gallery Contact Reviews Shop More Use tab to navigate through the menu items. MANERO'S® RESTAURANT, PALM CITY, FLORIDA Manero's Website RESERVE NOW ORDER FOOD: PICK-UP OR DELIVERY BUY DIGITAL GIFT CARD Contact Us 2851 SW High Meadows Avenue, Palm City, Florida 34990 enjoyment@maneros.com Call Us: 772-220-3011 Apply for Employment Solicitud de empleo First Name Last name Email Phone Subject Message Submit Thanks for submitting! Service Hours Come in or Order Take-out or Delivery Tues - Fri: 11:30 A - 8:45 P Sat: 4 pm - 8:45 pm Sun: 4 pm - 8 pm Mon: Closed BLOG EMPLOYMENT MANERO'S® RESTAURANT Call: (772) 220-3011 enjoyment@maneros.com ©2023 Manero's®, all rights reserved. bottom of page"
    },
    {
      "url": "https://manerosofmulberry.com/about-us/",
      "text": "About Us - Little Italy Pizza NYC Bar & Restaurant | Manero's of Mulberry Skip to content Reservation Menu Lunch / Dinner Brunch Location Menu Reservation Menu Lunch / Dinner Brunch Location Home About Us Catering Location Menu Lunch / Dinner Menu Pickup / Delivery Reservation Menu Home About Us Catering Location Menu Lunch / Dinner Menu Pickup / Delivery Reservation Pickup / Delivery Catering About Us Menu Pickup / Delivery Catering About Us ABOUT US Maneroâs is built on family, nightlife and New York roots. Named after Tony Manero, John Travoltaâs character in Saturday Night Fever, who worked a regular job by day and was a disco hero by night, our goal is to leave your day job at the door and transport you to the disco era of what a pizzeria would be like 50 years ago. As a family-style, Italian-American restaurant, we pull from family recipes and Brooklyn roots to bring something fresh and new to Mulberry street. Most of our dishes are baked in the pizza oven and will include an artisanal approach to the classics. And if you stay long enough, we serve slices at the bar only. Itâll help with your strut. We hope you enjoy! And if you stay long enough, we serve slices at the bar only. Itâll help with your strut. We hope you enjoy! Previous Next CALL US: 212-9616183 VISIT US: 113 Mulberry Street,New York, NY 10013 EMAIL US: info@jajajagroup.com"
    },
    {
      "url": "https://www.maneros.com/",
      "text": "Manero's, Manero's Restaurant, Manero's Menu | Full Service Restaurant in Palm City | 2851 Southwest High Meadow Avenue, Palm City, FL, USA top of page Home About Lunch Menu Dinner Menu Off-premises DIY Catering Gallery Contact Reviews Shop More Use tab to navigate through the menu items. MANERO'S® RESTAURANT, PALM CITY, FLORIDA Manero's Website RESERVE NOW ORDER FOOD: PICK-UP OR DELIVERY BUY DIGITAL GIFT CARD OUR HISTORY Manero's® originated in Greenwich, Connecticut as a family steakhouse around 1945.  Sibling locations followed in Connecticut, New York, New Jersey, and Florida.  Manero's® was a pioneer in many aspects of today's full-service restaurant, including the welcoming of children, a rarity in those days.  The restaurant included an in-house butcher shop that serviced internal and retail demand.  In addition to great steaks, original items like the Gorgonzola salad, sopping garlic bread and \"Dividend\" liquor drinks added to the appeal.  There was a comittment to consistent quality and hospitality that continues today at Manero's® in Palm City, Florida and J. Arthur's in Maggie Valley, North Carolina.  We look forward to serving you soon. OUR MENU At Manero's®, we take pride in our menu items and our kitchen staff.  From casual burgers and flatbreads to upscale steaks and fresh seafood dishes, our menu has something for everyone.  Manero's is home of the area's best prime rib and the original Gorgonzola salad.  We also offer vegetarian and \"no-added-gluten\" options.  As much as possible, we cook \"to-order\" and prepare items from \"scratch\"; we can accomodate most dietary needs and preferences. OUR LOCATION Manero's® is convenienlty located in beautiful Palm CIty, Florida.  We are close to I-95, Florida's Turnpike, and US-1.  Driving time from Stuart is about 10 minutes; about 20 minutes from Tradition/Port Saint Lucie; about 25 minutes from Palm Beach Gardens.  We have guest parking on site and a large coverd drop-off area for guest comfort and convenience. OUR MOST POPULAR ITEMS While all items on the menu are guaranteed to be enjoyed, we are highly regarded for several dishes (and glasses).  Manero's® is known for great prime rib or thin-sliced Prime Dip sandwich, fresh salmon - prepared in a variety of ways, housemade French Onion soup, the original Gorgonzola salad with optional protein toppings, dividend liquor drinks and a delicious roster of homemade desserts. OUR HAPPY HOUR Manero's® offers reduced pricing during happy hour on well Dividend liquor drinks, all varieties of house wine by the glass, and Miller Lite and Yuengling drafts.  Happy hour is offered Tuesday through Friday from 2 pm to 6 pm and Saturday and Sunday from 4 pm to 6 pm. Service Hours Dine in or Order Take-out & Delivery Available Tues - Fri: 11:30 am - 8:45 pm Sat: 4 pm - 8:45 pm Sun: 4 pm - 8 pm Mon: Closed Popular Items & Gifts Shop All Four Pints 4-Pints of Manero's® Signature Italian Dressing Price $40.00 Add to Cart A fun read! Seduced By Gorgonzola Book Price $15.00 Add to Cart $100.00 Manero's® Gift Card 100 Price $102.00 Add to Cart $50.00 Manero's® Gift Card 50 Price $52.00 Add to Cart $25.00 Manero's® Gift Card 25 Price $27.00 Add to Cart JOIN MANERO'S® LOYALTY BLOG CONTACT US MANERO'S® RESTAURANT Call: (772) 220-3011 enjoyment@maneros.com ©2023 Manero's®, all rights reserved. bottom of page"
    }
  ]
}