{
  "fuentes": [
    {
      "url": "https://mangoafricansafaris.mytravelerprofile.com/ContactUs",
      "email": "info@mangosafari.com"
    },
    {
      "url": "https://mangovoice.com/contact/",
      "email": "sales@mangovoice.com"
    },
    {
      "url": "https://www.mango-omc.com/about-us/",
      "email": "info@mango-omc.com"
    },
    {
      "url": "https://mangologisticsgroup.co.uk/contact-us",
      "email": "20sales@mangologisticsgroup.co.uk"
    },
    {
      "url": "https://mangologisticsgroup.co.uk/contact-us",
      "email": "sales@mangologisticsgroup.co.uk"
    },
    {
      "url": "https://mangoandmain.com/pages/contact-us",
      "email": "artboard_34_190x@2x.png"
    },
    {
      "url": "https://mangoandmain.com/pages/contact-us",
      "email": "artboard_34_390x@2x.png"
    },
    {
      "url": "https://mangoandmain.com/pages/contact-us",
      "email": "boa_2020_x120@2x.jpg"
    },
    {
      "url": "https://mangoandmain.com/pages/contact-us",
      "email": "web_mangoandmain_whitelogo_190x@2x.png"
    },
    {
      "url": "https://mangoandmain.com/pages/contact-us",
      "email": "web_mangoandmain_whitelogo_390x@2x.png"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "aancona@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "aerospace@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "cyoung@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "dperalta@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "egarcia@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "esori@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "info@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "melissa@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "rberrios@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "rhernandez@wtcmiami.org"
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "email": "ycaballero@wtcmiami.org"
    },
    {
      "url": "https://miami.mangos.com/private-events",
      "email": "eventssobe@mangos.com"
    },
    {
      "url": "https://miami.mangos.com/private-events",
      "email": "eventssobe@mangos.com"
    },
    {
      "url": "https://mangos.com/contact-miami/",
      "email": "eventssobe@mangos.com"
    },
    {
      "url": "https://mangos.com/contact-miami/",
      "email": "eventsorlando@mangos.com"
    },
    {
      "url": "https://mangos.com/contact-miami/",
      "email": "eventssobe@mangos.com"
    },
    {
      "url": "https://mangos.com/contact-miami/",
      "email": "janet@mangos.com"
    },
    {
      "url": "https://mangos.com/contact-miami/",
      "email": "joshua.wallack@mangos.com"
    },
    {
      "url": "https://mangos.com/contact-miami/",
      "email": "miguel@mangos.com"
    },
    {
      "url": "https://mangos.com/miami-living/how-mangos-won-at-miami-beach-nightlife/",
      "email": "eventssobe@mangos.com"
    },
    {
      "url": "https://mangos.com/miami-living/how-mangos-won-at-miami-beach-nightlife/",
      "email": "miguel@mangos.com"
    },
    {
      "url": "https://www.blackmango.com.au/pages/contact-us",
      "email": "info@blackmango.com.au"
    },
    {
      "url": "https://www.blackmango.com.au/pages/contact-us",
      "email": "team@blackmango.com.au"
    }
  ],
  "mails": [
    "20sales@mangologisticsgroup.co.uk",
    "aancona@wtcmiami.org",
    "aerospace@wtcmiami.org",
    "artboard_34_190x@2x.png",
    "artboard_34_390x@2x.png",
    "boa_2020_x120@2x.jpg",
    "cyoung@wtcmiami.org",
    "dperalta@wtcmiami.org",
    "egarcia@wtcmiami.org",
    "esori@wtcmiami.org",
    "eventsorlando@mangos.com",
    "eventssobe@mangos.com",
    "info@blackmango.com.au",
    "info@mango-omc.com",
    "info@mangosafari.com",
    "info@wtcmiami.org",
    "janet@mangos.com",
    "joshua.wallack@mangos.com",
    "melissa@wtcmiami.org",
    "miguel@mangos.com",
    "rberrios@wtcmiami.org",
    "rhernandez@wtcmiami.org",
    "sales@mangologisticsgroup.co.uk",
    "sales@mangovoice.com",
    "team@blackmango.com.au",
    "web_mangoandmain_whitelogo_190x@2x.png",
    "web_mangoandmain_whitelogo_390x@2x.png",
    "ycaballero@wtcmiami.org"
  ],
  "nombre_sitio": "mangos.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mangoafricansafaris.mytravelerprofile.com/ContactUs",
      "text": "Contact Us - Mango African Safaris (888) 40-MANGO Plan Your Safari Where to\r\n                                                Begin When to go? What is your budget? Where to go? What is\r\n                                                your travel style? Destinations East\r\n                                                Africa Kenya Ethiopia Rwanda Tanzania Uganda Southern Africa Botswana Malawi Mozambique Namibia South Africa Zambia Zimbabwe North\r\n                                                Africa Egypt Morocco Indian\r\n                                                Ocean Madagascar Seychelles Central Africa Republic of Congo Experiences Mango Highlight Trips Safari & Beach Family Holidays Group Safaris Traditional Cultures Walking & Hiking Value Oriented Wildlife Focus Private Journeys About About Mango Why Travel\r\n                                                with Mango? Testimonials Blog Conservation Press &\r\n                                                Accolades Contact Us Conservation (888) 40-MANGO IMPORTANT: This form requires JavaScript to work properly. Your browser has JavaScript disabled. Please either enable JavaScript and refresh this form (this message won't show up once JavaScript is enabled). Thank you. Home Contact Us Contact Us Thank you for your interest in Mango African Safaris. Please complete as much of the form to the right as you can. All of our trips are customized to suit you, so the more information you can give us, the better we will be able to make suggestions that fit you. If you have any questions or want to call us, please dial toll free at 888.406.2646. We are available M-F from 9am-6pm PST (Pacific). Or email us at info@mangosafari.com. Please note that we will never sell or exchange your contact details for any reason. We have offices in Portland, OR and Denver, CO. Portland Office 3945 SW Wapato Avenue Portland , Oregon 97239 toll free 888-40MANGO (62646) T: 503.282.9009 Denver Office 1673 S. Emerson St. Denver , Colorado 80210 toll free 888-698-9220 T: 303.698.9220 Private Custom Tour Inquiry First Name * Required! Last Name * Required! Email Address * Required! Not a valid email! Phone Area(s) of Interest East Africa Southern Africa North Africa Indian Ocean Available Travel Period * Required! How many people? * Required! Ideal budget per person (not including airfare) * Required! Less than $10,000 $10,000 to $20,000 Over $20,000 How did you hear about us? Please Select Direct Friend Mango Staff Media Repeat Customer Travel Agent Vendor Other Additional Comments (please avoid using special characters) Please wait while processing... Mango African Safaris (888) 40-MANGO 3945 SW Wapato Avenue Portland , Oregon 97239 USA ● 1673 S. Emerson St. Denver , Colorado 80210 USA Mango African Safaris is a boutique tour company specializing in customized journeys to East and Southern Africa's safari destinations and the Indian Ocean. © 2005 – 2023 Mango African Safaris. All rights reserved."
    },
    {
      "url": "https://mangovoice.com/contact/",
      "text": "Contact - Mango Voice Call Us: 435-GO MANGO ( 435-466-2646 ) solutions Business Solutions Products Phones industries Dental Hospitality Optometry Orthodontics Veterinary partners Become a Partner Integration Partners Trade Shows pricing company About Us Blog Careers Contact News support Help Desk System Status login Admin Portal Web App Billing Portal Menu solutions Business Solutions Products Phones industries Dental Hospitality Optometry Orthodontics Veterinary partners Become a Partner Integration Partners Trade Shows pricing company About Us Blog Careers Contact News support Help Desk System Status login Admin Portal Web App Billing Portal CONTACT Mango Call, Email, Text, or Visit We Would Be Happy To Meet You And Learn All About Your Business Visit Us 446 S Mall Dr #200, St George, UT 84790 Email Us sales@mangovoice.com Call Us (888) 541-1397 Text Us (888) 541-1397 Facebook Instagram Twitter Linkedin Youtube Privacy Policy | Acceptable Use Policy | Admin Portal | Web App © Copyright Mango Voice 2025 | All rights reserved"
    },
    {
      "url": "https://www.mango-omc.com/about-us/",
      "text": "About Us - Mango OMC Home About About Us Your Team MANGO-OMC Credentials Deck Services Strategy Strategic Execution Media Relations Media Training Digital and Social Marketing Social Media Strategy and Execution Event PR and Strategy Reputation Management and Crisis Communications Case Studies Blog Client news Industry news Mango news The Incredible Journey of a PR Intern Contact Us Home About About Us Your Team MANGO-OMC Credentials Deck Services Strategy Strategic Execution Media Relations Media Training Digital and Social Marketing Social Media Strategy and Execution Event PR and Strategy Reputation Management and Crisis Communications Case Studies Blog Client news Industry news Mango news The Incredible Journey of a PR Intern Contact Us Home About About Us Your Team MANGO-OMC Credentials Deck Services Strategy Strategic Execution Media Relations Media Training Digital and Social Marketing Social Media Strategy and Execution Event PR and Strategy Reputation Management and Crisis Communications Case Studies Blog Client news Industry news Mango news The Incredible Journey of a PR Intern Contact Us Home About About Us Your Team MANGO-OMC Credentials Deck Services Strategy Strategic Execution Media Relations Media Training Digital and Social Marketing Social Media Strategy and Execution Event PR and Strategy Reputation Management and Crisis Communications Case Studies Blog Client news Industry news Mango news The Incredible Journey of a PR Intern Contact Us OUR PURPOSE Who We Are MANGO-OMC has decades of experience in strategic communication combined with a strong PR background. This gives us the ability to couple specialist strategic marketing communication tools and analytics with creative, PR mindsets. We have a large, strong network of partnerships with other specialist agencies; ensuring that every client receives holistic support on every touchpoint in the marketing and communications matrix. MANGO-OMC specialises in collaborative strategic partnerships, becoming an extension of your team and ensuring true understanding and buy-in of your brand. We operate this way for both project and retainer clients. CONTACT US IPRN MANGO-OMC is currently the only South African agency selected to be accepted into the International Public Relations Network (IPRN). Nicole Capper is the Regional Head for Africa and on the Media Relations Committee. We regularly work on global projects through the Network and have access to world-class owner-led agencies in over 41 countries, meaning we can implement and manage a project anywhere on the globe. CONTACT US MEET THE CORE TEAM This team forms the foundation for projects and retainers with skills contracted in as required. The networked model does not increase client costs as the financials have been devised to allow MANGO-OMC to bring in the best minds, experience and skillsets for your requirements while remaining cost effective. NICOLE CAPPER Managing Director & Owner Read More MARIA OOSTHUIZEN Contracted supporting Account Director Read More SIYA MAHOMBA Contracted Publicist Read More DUMISANI DABADINI Contracted Publicist Read More OUR COLLABORATIVE PARTNERS All of our partners work with us across projects and retainers at preferential rates and either directly with client or via MANGO-OMC as lead agency (whichever route is preferred by client). These are tried and tested relationships with agencies, companies and people that share MANGO-OMC’s ethos of excellent service and ethical delivery. We are happy to work with existing client partners, but able to bring specialists to the table if required. We are also able to manage all of their services via our own team so that client has one contact person. This model does not negatively impact on budgets as there are no additional mark-up or referral fees. Video production Film production Graphic designers Creative directors Copywriters Specialist writers Software developers Web developers Brand collateral production Event production – hybrid, digital and physical Creative studios SEO specialists Digital marketing Media buyers OUR ADDITIONAL SOLUTIONS WE HAVE A VAST NETWORK OF PARTNERS We offer a combination of solutions or specific solutions only. Each proposal is tailormade for client requirements, so the services listed on this website should be treated as an overview of everything that we are able to provide, with the understanding that we can collaborate with your existing suppliers, or bring our own partners to the table or act as a lead agency. In summary, we provide what you need according to the best possible model for your budget. Video & Film Production Graphic Designers & Creative Directors Copywriters &  Specialist Writers SEO & Digital Marketing Specialists, Software & Web Developers Event  Production: Hybrid, Digital & Physical Media Buyers CONTACT US WHAT OUR CLIENTS SAY ABOUT US TESTIMONIALS Since 2005, we have been a visionary and reliable PR and communications company who aim to create beneficial relationships with both our clients and the media. CONTACT US Slide “...They have a strong network of media contacts and were able to write quickly and to the standards that we needed from them… Should we have the opportunity to work together again, we would definitely re-engage them”. AFRICA UTILITY WEEK Lida Van Heerden , Senior Marketing Manager, Spintelligent. “Thanks Nicole, this has been a great project and we are very happy with all of the deliverables! We’d like to thank you for being so easy to work with - very professional and organised, yet flexible in your approach.” ICLEI Michelle Preen , Senior Manager: Communications, Membership & Knowledge Management ICLEI Africa. “...Through their connections we were able to forge strong relationships with key media and bloggers and we found their strategic input immensely valuable.” FRY’S FOOD Amy Chu , Marketing Manager, The Fry’s Family Food Co. Slide Up until 2019 :...Each and every year they over deliver on PR value. Just when we think we have hit a ceiling, the team deliver beyond expectations. Their agility is impressive and they really get the results time after time. MANGO-OMC manage difficult situations with pace, professionalism and complete the solution… We simply couldn’t do it without them!” THE EAT OUT MERCEDES-BENZ RESTAURANT AWARDS , Aileen Lamb: General Manager, Consumer Division, New Media. “MANGO-OMC have catapulted us into public awareness. We have been on TV, radio, in newspapers and on local and international websites - including the Wall Street Journal, all in less than 18 months. What we love about MANGO-OMC is their ability to understand our strategy and provide insightful input, they then synchronise their PR activities with this. We appreciate their intentional and considered approach.” CITIZEN SURVEYS, Marcus Coetzee , Client Services, Citizen Surveys. ….”They were able to attract pro bono partners and support and in doing so, helped reach a 10 fold return on investment - simply by working smart and truly understanding our unique position in the media space. MANGO-OMC is a team of specialists and thought leaders in their industry. Partnering with them has been a joy!” IKAMVA LABANTU Ronell Jordaan, Fundraising Manager, Ikamva Labantu Slide “... They were creative, yet structured, responsive and professional in the approach and flexible to our specific needs. Under their watch for the period of a year, the project developed an excellent community base due to their building of the relationships and they managed high volume content creatively and often went beyond their original mandate to achieve the objectives of the project. They were especially proactive on the reputational demands, which were critical.” FTI CONSULTING Wayne Lowe, Senior Director, Strategic Communications EMEA, FTI Consulting In a challenging economy and media sector, MANGO-OMC have shown a strategic clarity and holistic approach that is promising in terms of an ongoing relationship. HOSPICE PALLIATIVE CARE ASSOCIATION Ewa Skowronska, MD, MPH, CEO Hospice Palliative Care Association Working with Nicole is a dream! I was concerned that a marketing campaign would be ‘too much’ for us but her interaction has made it exciting and rewarding. We love what we do and she has understood that and helped us do it better. She gets our value add to the community. Her approach is professional, patient and consistently helpful in partnering with us on this journey. Her knowledge and connections in the media and marketing world have paved the way for increased exposure for our brand. We haven’t even finished our campaign and we already have increased membership and recognition in the community. SOUTH AFRICAN ASSOCIATION OF SOCIAL WORKERS IN PRIVATE PRACTICE Paula Hildebrand, Chairperson , South African Association of Social Workers in Private Practice Slide \"On behalf of SIOC Community Development Trust (SIOC-CDT), I am pleased to confirm that MANGO-OMC through Nicole Capper has been supporting the Communications Team and the entire organisation with exceptional service from the year 2020 to date. What we appreciate the most about Nicole in particular is that she works as part of the team, is good at transferring skills, is immersed in the team and organisational culture and contributes significantly to the strategic thinking. MANGO-OMC brings along a wealth of industry knowledge and expertise that will be beneficial for any organization. They are extremely professional, efficient, creative, attentive to detail, great work ethic and never miss a deadline.\" SIOC-CDT Refilwe Sebogodi, Head Stakeholder Relations and Communications \"MANGO-OMC proved to be an invaluable partner when we brought them on board to assist us with the PR and influencer management for the relaunched Eat Out (Woolworths) Restaurant Awards in 2022. Nicole’s years of experience, and the talented team she handpicked to work on this massive project, were key to us pulling off a memorable event and hitting our PR value targets.\" New Media Aileen Lamb CEO “I have worked in NGO’s for over 20 years & finding great marketing & communications expertise was as elusive as looking for a needle in a haystack. We bounced around between in-house and outsourcing options and I can honestly say Nicole & her team have been the best I’ve ever worked with. She has the most wonderful combination of being strategic and also willing to dig into detail. I have learnt so much from the extensive experience that she brings to bear. She’s undoubtedly helped HPCA to raise our profile & build our brand. Highly, highly recommended.” Hospice Palliative Care Association, Leigh Meinert Advocacy Manager Slide “...They have a strong network of media contacts and were able to write quickly and to the standards that we needed from them… Should we have the opportunity to work together again, we would definitely re-engage them”. AFRICA UTILITY WEEK Lida Van Heerden , Senior Marketing Manager, Spintelligent. Slide “Thanks Nicole, this has been a great project and we are very happy with all of the deliverables! We’d like to thank you for being so easy to work with - very professional and organised, yet flexible in your approach.” ICLEI Michelle Preen , Senior Manager: Communications, Membership & Knowledge Management ICLEI Africa. Slide “...Through their connections we were able to forge strong relationships with key media and bloggers and we found their strategic input immensely valuable.” FRY’S FOOD Amy Chu , Marketing Manager, The Fry’s Family Food Co. Slide :...\"MANGO-OMC proved to be an invaluable partner when we brought them on board to assist us with the PR and influencer management for the relaunched Eat Out (Woolworths) Restaurant Awards in 2022. Nicole’s years of experience, and the talented team she handpicked to work on this massive project, were key to us pulling off a memorable event and hitting our PR value targets.\" THE EAT OUT MERCEDES-BENZ RESTAURANT AWARDS , Aileen Lamb: General Manager, Consumer Division, New Media. Slide “MANGO-OMC have catapulted us into public awareness. We have been on TV, radio, in newspapers and on local and international websites - including the Wall Street Journal, all in less than 18 months. What we love about MANGO-OMC is their ability to understand our strategy and provide insightful input, they then synchronise their PR activities with this. We appreciate their intentional and considered approach.” CITIZEN SURVEYS, Marcus Coetzee , Client Services, Citizen Surveys. Slide ….”They were able to attract pro bono partners and support and in doing so, helped reach a 10 fold return on investment - simply by working smart and truly understanding our unique position in the media space. MANGO-OMC is a team of specialists and thought leaders in their industry. Partnering with them has been a joy!” IKAMVA LABANTU Ronell Jordaan, Fundraising Manager, Ikamva Labantu Slide “... They were creative, yet structured, responsive and professional in the approach and flexible to our specific needs. Under their watch for the period of a year, the project developed an excellent community base due to their building of the relationships and they managed high volume content creatively and often went beyond their original mandate to achieve the objectives of the project. They were especially proactive on the reputational demands, which were critical.” FTI CONSULTING Wayne Lowe, Senior Director, Strategic Communications EMEA, FTI Consulting Slide I have worked in NGO’s for over 20 years & finding great marketing & communications expertise was as elusive as looking for a needle in a haystack. We bounced around between in-house and outsourcing options and I can honestly say Nicole & her team have been the best I’ve ever worked with. She has the most wonderful combination of being strategic and also willing to dig into detail. Highly, highly recommended. HOSPICE PALLIATIVE CARE ASSOCIATION Leigh Meinert, Advocacy & Operations Manager Slide Working with Nicole is a dream! I was concerned that a marketing campaign would be ‘too much’ for us but her interaction has made it exciting and rewarding. We love what we do and she has understood that and helped us do it better. She gets our value add to the community. Her approach is professional, patient and consistently helpful in partnering with us on this journey. Her knowledge and connections in the media and marketing world have paved the way for increased exposure for our brand. We haven’t even finished our campaign and we already have increased membership and recognition in the community. SOUTH AFRICAN ASSOCIATION OF SOCIAL WORKERS IN PRIVATE PRACTICE Paula Hildebrand, Chairperson , South African Association of Social Workers in Private Practice Slide On behalf of SIOC Community Development Trust (SIOC-CDT), I am pleased to confirm that MANGO-OMC through Nicole Capper has been supporting the Communications Team and the entire organisation with exceptional service from the year 2020 to date. What we appreciate the most about Nicole in particular is that she works as part of the team, is good at transferring skills, is immersed in the team and organisational culture and contributes significantly to the strategic thinking. MANGO-OMC brings along a wealth of industry knowledge and expertise that will be beneficial for any organization. They are extremely professional, efficient, creative, attentive to detail, great work ethic and never miss a deadline. SIOC-CDT Refilwe Sebogodi, Head Stakeholder Relations and Communications HOVER WITH YOUR MOUSE TO VIEW PROJECT INFO CLICK TO VIEW PROJECT INFO Tap to select the previous period Next MANGO OMC MANGO-OMC was founded in 2005 with the aim of creating beneficial relationships with both our clients and the media; delivering provable and relevant ROI and results on every project. Connect Facebook Instagram Twitter Linked In Email Navigation About Services Case Studies Privacy Policy Get in Touch Let’s talk and see how we can work together. Please leave this field empty. © 2020 MANGO-OMC ALL RIGHTS RESERVED. SITE BY TWYNE"
    },
    {
      "url": "https://mangologisticsgroup.co.uk/contact-us",
      "text": "Get In Touch with Mango Logistics to discuss how we can help you Skip to content Same Day Login International Login Warehouse Space Enquiry E-Fulfillment Enquiry sales@mangologisticsgroup.co.uk Facebook-f Twitter Instagram Youtube Linkedin Same Day Login International Login Warehouse Space Enquiry E-Fulfillment Enquiry Home The Mango Experience The Mango Experience Meet The Team Join Us Sustainability Courier Services Final Mile Deliveries Same Day Couriers Next Day / International Couriers Cross Docking Services Storage Services Business Storage Personal Storage Archive Storage e-Fulfillment Ecommerce Fulfilment Order Fulfilment Contact Us Our Blog FAQ Home The Mango Experience The Mango Experience Meet The Team Join Us Sustainability Courier Services Final Mile Deliveries Same Day Couriers Next Day / International Couriers Cross Docking Services Storage Services Business Storage Personal Storage Archive Storage e-Fulfillment Ecommerce Fulfilment Order Fulfilment Contact Us Our Blog FAQ Get In Touch +44 (0)20 7713 2000 New Business Enquiry- +44(0)2036572157 sales@mangologisticsgroup.co.uk We would love to hear from you. You can reach us via several ways including dropping into our office at London Bridge. Your data will be protected and handled in accordance with our privacy policy. A member of Mango Logistics Group will contact you regarding your enquiry. To find out more about how we treat your data click here . If at any stage you wish not to be contacted call us. Address: Units 14 & 15 Rotherhithe Business Estate 214 Rotherhithe New Road London SE16 3EH Twitter Facebook Youtube Linkedin-in Instagram Trustpilot Reviews First name * Last name * Company name Phone * Email * example@example.com Postcode * Description Required Services Industry Do you require? * Please Select Archive Storage Bespoke Service/Fulfilment Business Relocation Business Storage International Next Day Personal storage How can we help? * Please verify that you are human * SEND ENQUIRY Should be Empty: End to End Bespoke Logistics Solutions Sometimes Logistics is not as easy as A, B,C D…We understand logistics can be simple and at times a little bit complex. If you need more information on how we can help you, drop us a note or simply call us on 020 7713 2000 Managed  Storage & Warehouse Services Our managed warehouses are located in and around the city of London. Find a warehouse that best suits your needs for personal, business storage or archive/document storage. We offer bespoke storage services caters for a wide variety of industries such as events management, promotional agencies, real estate, legal firms and many more. Do not hesitate to contact us about your unique requirements. Same Day Couriers in London Need an urgent same day service, a pre-booking or a standard same day delivery? Choose from our wide variety of vehicles including cargo bikes, push bikes, small vans and larger vans. Talk directly to same day couriers team. UK Next Day & International Courier Services Do you have an enquiry about UK next day or international collection and delivery services? Does your business operate in UK and abroad? Or are you looking at expanding your operations internationally? We can collect and deliver to almost anywhere in the world. Talk to our international team by calling 020 7713 2000 . What people say about us We at modulyss have used mangos for our carpet tile sampling and delivery service for over three years and love the \"can do attitude\" we receive from the mangos team. We get an excellent service which is consistent and quick. We are working collaboratively to develop a sustainable and carbon neutral delivery service in London and enjoy the ideas we are coming up with to ensure our samples are circular and not disposed of in landfill. As we grow mangos have continued to adapt to our needs and focus on sustainability and service with us. I would recommend mangos to any company apart from my competitors. Alistair Shove Modulyss Runtech have been fortunate to be able to count on Mango’s warehousing and courier services for many years now. They have continued to adapt and improve their solutions, and always doing so in a friendly and helpful way. They can adapt to changing schedules, quick turnarounds and provide secure local and international delivery. I would definitely recommend them. Matt Runtech Beeing available in the UK market quickly and efficiently is one of the most difficult and stresfull tasks for every company. Mango Logistics is amazing of taking care of the everyday storage and distribution need, thus giving us the time to focus and work on building our brand. George Bagos Three Cents Mango Logistics group are flexible, efficient and friendly. As an IT support company, Mango have been fundamental in making sure that broken computers and brand new equipment get from A to B. They make sure our items are delivered on time, in the right condition and with little to no problems, making our lives a lot easier. We have worked with Mango Logistics for a while now and Lucidica would not be without them. Thomas Jeffs Lucidica If you are looking for a shipping company – I strongly recommend Mango Logistics Group. I would especially like to thank Shay Shaham, for a professional and reliable service and especially for being courteous and humane! After being stung by Eastwind shipping company  who held my personal belongings for a month and a half, I asked for a recommendation on facebook and came to Shay, who helped me personally and was available at any time to help. So again –  I strongly recommend Mango Logistics Group! And to charming Shay who made sure I had a corrective experience – lots and lots of thanks !!! Limor H. Mango is proud to work with Mango Logistics Group is one of London’s best-loved courier and storage companies. Based  minutes away from London Bridge/Tower Bridge, the group is made up of three companies, Mango Couriers, Mango Storage and Mango International which individually and collectively offer bespoke logistics solutions to a varying number of industries Trustpilot Trustpilot Trustpilot Reviews About us Areas We Cover Experience Meet The Team Join Us News FAQs Sustainability Our Services Final Mile Deliveries Same Day Couriers Next Day / International Couriers Cross Docking Services Business Storage Archive Storage Fulfilment Personal Storage Legal Privacy Policy Mango Cookies Policy Mango Archive Storage Terms & Conditions Business Storage Terms & Conditions Same Day Couriers Terms & Conditions Personal & Self Storage Terms & Conditions Next Day & International Terms & Conditions UKWA Contract Conditions For Logistics Fulfilment Terms and Conditions Twitter Facebook Youtube Linkedin-in Instagram © Mango Logistics Group 2021 | Website design by YostratO Ltd Mango Logistics Group is the trading name for Mango Operations Ltd, Mango Storage Ltd and Mango Couriers Ltd. Trading address is Units 14 & 15 Rotherhithe Business Estate, 214 Rotherhithe New Road, London, SE16 3EH -\r\n                        55.730247336377 year ago Click here to read @mangologistics, @FoxyRoxyMango'S Twitter feed Follow @mangologistics, @FoxyRoxyMango"
    },
    {
      "url": "https://mangoandmain.com/pages/contact-us",
      "text": "Contact Us\n– Mango & Main Skip to content Close menu NEW Annapolis Apparel Tops Dresses & Jumpsuits Pants, Skirts & Shorts Jewelry Necklaces Bracelets Earrings Rings Accessories Bags For the Home Pillows Baskets Bath & Spa Food & Drink Home Decor Plant Pots Kids & Baby Toys Kids' Clothing Sale About Our Story & Values Visit Our Store Contact Us Press Customer Service Blog Log in Facebook Twitter Pinterest Instagram Facebook Twitter Pinterest Instagram Search Site navigation Log in Search Cart NEW Annapolis Apparel Tops Dresses & Jumpsuits Pants, Skirts & Shorts Jewelry Necklaces Bracelets Earrings Rings Accessories Bags For the Home Pillows Baskets Bath & Spa Food & Drink Home Decor Plant Pots Kids & Baby Toys Kids' Clothing Sale About Our Story & Values Visit Our Store Contact Us Press Customer Service Blog Search \"Close (esc)\" FREE shipping on orders $50+ or a low flat rate of $5 shipping on everything else Visit our shop in historic downtown Annapolis Click here to check our current shop hours Home / Contact Us We would love to hear from you!  There are lots of ways to get in touch with us... You can fill out the form below, send us a direct message on Facebook or Instagram (@mangoandmain), email hello@mangoandmain.com , or stop by our store at 88 Maryland Avenue, Annapolis, MD. If you need more information about our permanent jewelry studio In The Sand Shop or would like to make an appointment, please click here. Name Email Message Send Meet our Artisan Partners Every product in our shop is handcrafted by artisans across the globe. Learn More Visit our Store Shop in-person at our boutique on Maryland Avenue  in Historic Annapolis. Learn More Search About us Visit Our Store The Mango Journal Blog Customer Service Contact Us Terms of Service Refund policy © 2025 Mango & Main Powered by Shopify \"Close (esc)\""
    },
    {
      "url": "https://www.wtcmiami.org/our-team/",
      "text": "Our Team - World Trade Center Miami Skip to main content Skip to footer About About Us Board of Directors Our Team WTCA Member Directory Our Brands Global Platform Expand to international markets or make global connections. World Trade Center Miami conferences and exhibitions provide the platform to connect businesses to the global market place. Events Events Events Calendar Signature Events Annual General Membership Meeting + International Achievement & International Hall of Fame Awards International Womens Achievement Awards State of the Ports Resources Miami is Global Trade’s Path to Least Resistance 2023 Economic Impact Study International Trade trends International Partnerships Agreements WTCM AGM 2024: Impact of Tariffs on Three South Florida Ports – Ken Roberts WTCM AGM 2024: International Trade Disruptions Ahead for South Florida’s Gateway Economy – John Price News WTCM News Monthly Newsletter Contact Login About About Us Board of Directors Our Team WTCA Member Directory Our Brands Global Platform Expand to international markets or make global connections. World Trade Center Miami conferences and exhibitions provide the platform to connect businesses to the global market place. Events Events Events Calendar Signature Events Annual General Membership Meeting + International Achievement & International Hall of Fame Awards International Womens Achievement Awards State of the Ports Resources Miami is Global Trade’s Path to Least Resistance 2023 Economic Impact Study International Trade trends International Partnerships Agreements WTCM AGM 2024: Impact of Tariffs on Three South Florida Ports – Ken Roberts WTCM AGM 2024: International Trade Disruptions Ahead for South Florida’s Gateway Economy – John Price News News WTCM News Monthly Newsletter Contact Login Join You are here: Home / Our Team Our Team Ivan Barrios President & CEO ibarrios@wtcmiami.org Linkedin Alice Ancona Chief Operating Officer aancona@wtcmiami.org Linkedin Roberto Berríos Exhibit Sales Director rberrios@wtcmiami.org Linkedin Melissa Echevarria Controller + Event Manager melissa@wtcmiami.org Linkedin Emy Garcia Office Manager 305-871-7910 egarcia@wtcmiami.org Linkedin Robert Hernandez Manager Business Development rhernandez@wtcmiami.org Linkedin Enrique Sori Communications and Digital Strategies Manager esori@wtcmiami.org Linkedin Trade Development Specialists: Yelsica H. Caballero ycaballero@wtcmiami.org Linkedin Cher Young cyoung@wtcmiami.org Linkedin Paul Webster aerospace@wtcmiami.org Linkedin Diana Peralta dperalta@wtcmiami.org Linkedin 5835 Waterford District Dr, Suite 100, Miami, FL 33126 Main: (305) 871-7910 info@wtcmiami.org Stay Connected Subscribe to our Newsletter! Send Follow Us Copyright © 2025 World Trade Center Miami, Inc. All Rights Reserved. Ivan Barrios President & CEO ibarrios@wtcmiami.org Linkedin Ivan Barrios is the President/CEO of the World Trade Center Miami. Ivan has served in this role since January 2020. He most recently worked as Vice President for International Trade Development & TEAM Florida missions at Enterprise Florida, Inc., the state of Florida’s official economic development agency. He managed a statewide team of trade specialists that assisted Florida companies to export their products and services overseas. Ivan has organized 28 Governor led trade missions to 22 countries from 1999–2015 for three governors. Special projects included 3,000 one-on-one business matchmaking appointments for exporters, managing two hemispheric trade shows, producing and publishing five Florida International Trade and Services Directories, coordinating the activities of the Florida International Bankers Association and creating the Florida Trade Data Center, a first of its kind information hub for Florida exporters. Ivan holds a position on the Board of Directors of the World Trade Centers Association, where he represents the North American region. His extensive experience includes serving as a board member for the South Florida District Export Council and the Miami-Dade County International Trade Consortium. Ivan is an alumnus of the University of Miami, where he earned his degree in Business Administration. Alice Ancona Chief Operating Officer aancona@wtcmiami.org Linkedin Alice Ancona has held this role since January 2020.  She is charged with boosting organizational resilience and value creation of the operations, events, strategic programing, marketing and trade shows of the World Trade Center Miami (WTCM). With over two decades of experience, she brings a wealth of expertise to her position. In addition, she is charged with creating and executing international trade programs, trade missions, economic development initiatives, advocacy efforts, and innovative revenue-generating solutions as well as providing strategic long-term planning for the organization. Before joining WTCM, Ms. Ancona led the international endeavors of the Florida Chamber of Commerce, serving as a prominent advocate for policies that enhance international trade, logistics, and investments. Her efforts centered on removing trade barriers, expanding market access, facilitating exports, negotiating trade agreements, and strengthening Florida’s trade infrastructure. Ms. Ancona played a pivotal role in connecting Florida to the global trade arena, facilitating relationships with international stakeholders, foreign agencies, elected officials, member companies, and governmental bodies at the state and federal levels. Prior to her work at the Florida Chamber, Ms. Ancona spearheaded the governmental affairs division at the Greater Miami Chamber of Commerce. In this capacity, she directed policy agendas on a diverse range of issues, including trade, infrastructure investment, transportation, and workforce development. Her accomplishments include leading successful campaigns for the passage of crucial trade agreements, such as the Colombia FTA, DR-CAFTA, Panama FTA, Chile FTA, and KORUS. She also contributed to efforts to secure the Free Trade Areas of the Americas. Ms. Ancona’s contributions extend beyond her professional roles.  She is a recognized thought leader and speaker at industry conferences, providing insights on global market dynamics, trade policy, and cross-border strategies. She has actively participated in various steering committees for Florida’s transportation planning initiatives and has been an active member of the Florida International Trade Partnership. Her involvement also includes serving on the Board of the Miami Dade County International Trade Consortium. Her dedication and achievements have earned her recognition, including the 2014 International Women’s Day Award from World Trade Center Miami, the 2015 Person of the Year designation by the Florida Customs Brokers & Forwarders Association, Inc., and the 2016 Women of Distinction Award from the Lauderhill Regional Chamber of Commerce."
    },
    {
      "url": "https://miami.mangos.com/private-events",
      "text": "Private Events | South Beach | Mango's Tropical Cafe Nightclub Sip & Salsa Restaurant Private Events Private Events Bachelorette Party Corporate Events Contact Us Book Now Book Now Private Events Let our team handle every detail, from customized menus to premium bottle service and exclusive seating. Whether you want an intimate gathering or a full-scale celebration, Mangoâs offers private and semi-private spaces tailored to your needs. Elevate your event with high-energy performances, tropical cocktails, and an atmosphere that keeps the party going all night long. Bachelorette Parties Corporate Events Virtual Tour VenueExclusives Turn Any Occasion into a Legendary Night With seamless service, customizable event spaces, and high-energy live performances, we create the perfect setting for any occasionâwhether youâre toasting with colleagues, celebrating with family, or impressing clients in a truly dynamic atmosphere. Venue Specs AVAILABLE SET-UPS Reception Capacity: 800 Seated Capacity: 450 AUDIO/VISUAL CAPABILITIES Lighting, Microphones, Interactive Displays, Professional Sound Systems, Projections, etc. Book Now Food & Drinks Book Now See Menu Mangoâs Tropical CafÃ© South Beach welcomes Executive Chef Byron Rubio to lead a bold new culinary era. With a background at world-class restaurants Chef Rubio is reimagining Mangoâs menu with refined, farm-to-table flavors inspired by Miamiâs vibrant culture. Guests can indulge in elevated dishes like Poached Lobster Tail, USDA Prime Ribeye, and decadent desserts, all crafted to complement Mangoâs iconic nightlife and entertainment. This transformation cements Mangoâs as the ultimate destination for unforgettable dining and world-class performances. Book Your Private Event Sam Serrano Group Sales Coordinator 305.673.4422 Ext 141 â¨ EventsSobe@Mangos.com Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. unforgettable experiences unforgettable experiences unforgettable experiences unforgettable experiences Heat Up the Night â Plan Your Visit Now. Book Now 900 Ocean Dr, Miami Beach, FL 33139 â +1 (305) 673-4422 EventsSoBe@mangos.com Hours of Operations Mon-Thur: Bar 5:00 PM - 5AM Restaurant 6:00 PM - 11:00 PM â Fri-Sun: â Bar & Restaurant 12:00PM - 5AM Lunch: 12:00 PM - 6:00 PM ( Fri-Sun ) Saturdays: Live Reggaeton Band | 1PM - 6PM Sundays: Live Salsa Band | 1PM - 6PM Dinner & Showâ¨ Monday-Sunday: 6:00 PM - 11:00 PM The Entertainment starts at 7:30 PM â â Sip, Savor & Salsaâ¨ Every Night | 7:30PM Lounge Roomâ¨ Nightly | 10:30 PM - Till Late Night Mojito Room | 10PM (Thu, Fri, Sat)â¨ Vodou Room | 10PM (Fri, Sat, Sun) Nightclub Nightclub & Bottle Service Sip & Salsa Party About Us Our Story Contact Careers FAQ VR360 Private Events PRivate Events Bachelorette Party Corporate Events LEGAL Privacy Policy Â© 2025 Mango's Tropical Cafe or their respective license holder. All Rights Reserved. | Â Website: Dark Roast Media"
    },
    {
      "url": "https://mangos.com/contact-miami/",
      "text": "Contact Mango's South Beach | Mango's Tropical Cafe | Mangos.com Skip to content Mango's Tropical Cafe | Miami beach, Florida (305) 673-4422 Directions Sip & Salsa Lessons Menu Contact Book your Event Celebrate Sip & Salsa Lessons Menu Contact Book your Event Celebrate Book Now Contact Us CALL US GET DIRECTIONS Your Name Your Phone Your Email Your Message Send General Contact 305-673-4422 900 Ocean Drive, Miami Beach, FL 33139 Vice President of Events Janet Helm 407-673-4422 Cell: 407-335-9244 janet@mangos.com Corporate Events Sam Serrano Group Sales Coordinator 305-673-4422 Ext 141 EventsSobe@Mangos.com Press joshua.wallack@mangos.com Join the Mango's Email List! Get the latest Mango’s news, specials, & announcements! Your Email Address Join 900 Ocean Drive Miami Beach, FL 33139 +1 (305) 673-4422 eventssobe@mangos.com Make a Reservation Make a Reservation Hours of Operation Monday–Thursday \u0003 Bar 12 PM–5 AM Restaurant 5 PM–5 AM Friday–Sunday \u0003 Bar & Restaurant 12 PM–5 AM Dinner & Show Daily | 8PM Sip, Savor & Salsa Salsa Lessons, Mojitos & Appetizers Every Night | 7:30PM LATIN TUESDAYS Tuesdays | 11PM Nightclub Nightly | 10PM Mojito Room | 10PM (Thu, Fri, Sat) Vodou Room | 10PM (Fri, Sat, Sun) FAQ / Help Book Your Corporate Event Careers Blog Gift Cards Join Our Mailing List VR 360º Instagram Facebook-f Twitter Youtube © 2025 Mango’s Tropical Cafe. All rights reserved. Mango's Orlando Press Contact Privacy Policy Statement of Accessibility Scroll to Top Make a Reservation Make a Reservation Home Home Tropigala Nights Live Show Sip & Salsa Lessons Celebrate With Us! Menu Book Your Event Contact Gift Cards Sip & Salsa Lessons Celebrate With Us! Menu Book Your Event Contact Gift Cards CALL US GET DIRECTIONS"
    },
    {
      "url": "https://mangos.com/miami-living/how-mangos-won-at-miami-beach-nightlife/",
      "text": "Best Nightlife Location in Miami | Mango's Tropical Cafe Skip to content Mango's Tropical Cafe | Miami beach, Florida (305) 673-4422 Directions Sip & Salsa Lessons Menu Contact Book your Event Celebrate Sip & Salsa Lessons Menu Contact Book your Event Celebrate Book Now Mango’s Tropical Cafe Miami Won at South Beach Nightlife November 20, 2020 Miami Living , Miami News For South Floridians who have family or friends visiting from out of town and want to show them the quintessential South Beach experience, Mango’s Tropical Café has been a must-see option for many years. The splashy tourist mecca on iconic Ocean Drive in South Beach, which celebrated hitting the quarter-century mark with a blowout bash on New Year’s Eve, offers a crowd-pleasing, best-of-both-worlds entertainment mix that taps both the charm of Old Havana and the hipness of modern Miami. On any given night, revelers can loosen up with authentic mojitos and enjoy an almost nonstop barrage of colorful, Carnaval-style live entertainment that ranges from fiery flamenco dancing, belly dancing, hip-hop and odes to Michael Jackson and Celia Cruz. You can even learn to dance salsa with nightly classes. There’s also a good chance that you will be joined by a famous face or two, as Mango’s is a celebrity hangout that routinely draws A-listers such as Will Smith, George Clooney, Robert De Niro and Tiger Woods, among many others. Back in 1991 when the café opened, it would have been difficult to imagine the energetic, infectious scene that greets its patrons today. Wallack says Mango’s endured several years of struggle and sacrifice as a “sports bar kind of a thing,” often with Wallack himself performing rock, reggae and country music onstage as the main entertainment source. And then came the turning point, and everything changed completely. “One day, a Cuban gentleman by the name of Miguel Cruz came in and said, ‘I work with Santana out in L.A., and I want to come in and play Afro-Latin jazz,’” Wallack recalled. “And he said, ‘I’m gonna rock the house.’” Apparently, Cruz wasn’t kidding. “You might say this guy was like a psychedelic Desi Arnaz on steroids, mixed with Jimi Hendrix,” Wallack said. “He was on the floor, crawling across the floor banging a conga drum. And I mean, it was Santeria, it was rock and Latin music, and he rocked the house! And my girls, my staff, jumped up on the bar on their own – I never asked them – and started dancing. “Well, that was the miracle that transformed Mango’s,” he continued. “Right at that moment, I looked at my staff having a ball, and I looked at him just banging on the drum, and I looked at my customers getting up and dancing and smiling, and it switched from beer to Black Label. And that was the beginning of the success of Mango’s Tropical Café.” Soon, Wallack noticed that when the band stopped playing, the crowd filed out, so his business sense helped kick things up a notch. “I said, ‘We’ve got to be smarter than this.’ Let’s get a choreographer, and with the girls jumping up on the bar, when the band goes off, we’ll put on a show. And we can’t just put girls up there – that’s not who we are, so let’s get the guys up there, too. So it evolved into three girls and three guys up on the bar doing specialty Latin dances. And then the line became bigger when the band went off than when the band was on.” Mango’s became the kind of place where the celebrities weren’t afraid to let loose and join in the madness. One night, Gloria and Emilio Estefan came in with actor and musician Andy Garcia. “Andy was a Miami guy,” Wallack said. “And he knew Miguel Cruz, so Andy got up onstage with Miguel, and they were both banging the congas and having a ball. And Emilio and Gloria were sitting on the second floor just looking down at them, and a few years later, Bongo’s [Cuban Café] came out. And in Emilio’s brilliant, brilliant mind, I think that in some way he got a little bit of a suggestion of the possibilities of what could be. So that night was a wonderful, wonderful thing.” Another night, Marc Anthony stopped by with Lance Bass from ‘N Sync. “Lance happened to be a bartender before he became a singer,” said Wallack, “and he jumped behind the bar and mixed drinks. Then Marc jumped up onstage and started singing.” Even with the celeb sightings and packed house every night, Wallack couldn’t have foreseen just how big Mango’s would become. The café quickly evolved from local hotspot to national phenomenon when the image of three girls dancing on the bar in their animal print catsuits went around the world. “For 10 years, Mango’s was the most videoed nightclub on the planet Earth,” Wallack said, still sounding incredulous. “Every night, there was cable TV from cities and countries all around the world. We were the ones featured on the Super Bowl, on the University of Miami games, on the Orange Bowl games. All of a sudden we were on the national news representing Miami.” The madness didn’t stop there. “When Peter Jennings did the ABC 24-hour millennium show that aired on Channel 10 in Miami, they broadcast from seven cities, and here they were set up right in front of Mango’s on the beach,” Wallack said. “Mango’s was featured seven times with our logo and our staff dancing. We were the only business featured on that 24-hour show. So we became internationally known, and to me it was just a miracle.” One year ago, the Mango’s miracle finally led to an expansion. Wallack was content, both financially and philosophically, with remaining in Miami, but when his son Joshua joined the family business, he convinced his father to pull the trigger. While a deal with Caesar’s Palace in Las Vegas was put on hold, “a magnificent property opened up for us in Orlando,” said Wallack. “So my son brought me over here to see it. And the logistics of it, plus being only a three-hour drive from Miami, became much more appealing, so we moved our sights toward Orlando, and here we are.” While Mango’s in Miami whoops it up on Saturday night, its successful Orlando spinoff will celebrate its first year with a New Year’s Eve party of its own. And Wallack couldn’t be prouder of both. “Mango’s is all about live entertainment, live musicians, live talent,” he said. “The people that work and perform at Mango’s over the years are the most amazing, talented group of people that are in Miami, and now in Orlando. Many of them have performed at the Tropicana in Havana, so people who came here on rafts are now stars at Mango’s. It’s very amazing, and a blessing for me to be a part of it.” Mango’s Tropical Café, 900 Ocean Dr., Miami Beach; 305-673-4422 or www.mangos.com/miami . Prev Previous Chamber Honors Mango’s Tropical Café Owner David Wallack Next We have missed you! Next Share: More News from Mango's South Beach: Miami Salsa Classes May 28, 2024 Spending the Evening at Mango’s in South Beach Miami August 21, 2023 Join the Mango's Email List Your Email Send 900 Ocean Drive Miami Beach, FL 33139 +1 (305) 673-4422 eventssobe@mangos.com Make a Reservation Make a Reservation Hours of Operation Monday–Thursday \u0003 Bar 12 PM–5 AM Restaurant 5 PM–5 AM Friday–Sunday \u0003 Bar & Restaurant 12 PM–5 AM Dinner & Show Daily | 8PM Sip, Savor & Salsa Salsa Lessons, Mojitos & Appetizers Every Night | 7:30PM LATIN TUESDAYS Tuesdays | 11PM Nightclub Nightly | 10PM Mojito Room | 10PM (Thu, Fri, Sat) Vodou Room | 10PM (Fri, Sat, Sun) FAQ / Help Book Your Corporate Event Careers Blog Gift Cards Join Our Mailing List VR 360º Instagram Facebook-f Twitter Youtube © 2025 Mango’s Tropical Cafe. All rights reserved. Mango's Orlando Press Contact Privacy Policy Statement of Accessibility Scroll to Top Make a Reservation Make a Reservation Home Home Tropigala Nights Live Show Sip & Salsa Lessons Celebrate With Us! Menu Book Your Event Contact Gift Cards Sip & Salsa Lessons Celebrate With Us! Menu Book Your Event Contact Gift Cards CALL US GET DIRECTIONS"
    },
    {
      "url": "https://www.blackmango.com.au/pages/contact-us",
      "text": "Black Mango | Contact Us\n– Black Mango Interiors Skip to content Pause slideshow Play slideshow 48 HOUR DISPATCH AUSTRALIA WIDE 30 DAY RETURNS icon-X Close menu Best Sellers Furniture The Cloud Sofa View All 3 Seater Sofa 2 Seater Sofa Single Seater Sofa Ottoman Slipcovers Bedheads View All King Single Bedheads Double Bedheads Queen Bedheads King Bedheads Slipcovers Benches & Ottomans View All Benches Ottomans Chairs View All Accent Chairs Counter Stools Dining Chairs Recliner Chairs Rocking Chairs Tables & Storage View All Bedside Tables Coffee Tables Dining Tables Shelves Side Tables Sideboards Homewares View All Mirrors Cushion Covers Lighting View All Table Lamps Floor Lamps Swatches Trade Trade Login Become a Trade Member FAQs 08 7084 1848 9.30am - 3.30pm (AEDT) Monday to Friday Log in instagram Instagram Facebook Pinterest TikTok Cart icon-X Close cart Order note Subtotal $0.00 Shipping, taxes, and discount codes calculated at checkout. Check out View Cart Page Your cart is currently empty. 08 7084 1848 9.30am - 3.30pm (AEDT) Monday to Friday instagram Instagram Facebook Pinterest TikTok icon-hamburger Site navigation 0 account Log in Cart Search Search Contact Us We are here to answer any questions you have. If you have a product enquiry or just a general question, please get in touch with us. Simply fill in the contact form on this page at any time or call us on 08 7084 1848, our office hours are open Monday - Friday from 9.30am - 3.30pm (AEST). If you can't reach us on our phones it means we may already be taking a call or have had to step out into the warehouse. We are constantly checking emails so please email us at team@blackmango.com.au and we will reply as soon as possible. Name Email Message Send Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Free Fabric Swatches Order Some Today Family Owned & Operated Since 2015 48 Hour Dispatch & 30 Day Returns Afterpay & Zip Buy Now, Pay Later Company Company About Us Blog Contact Us Reviews Customer Care Customer Care Assembly Library Customer Login Care Instructions Fabric Swatches FAQ Return Request Shipping & Returns Terms & Conditions Privacy Policy Warranty Popular Links Popular Links Furniture Homewares Gift Cards Lighting Newsletter SMS Zip Money GET IN TOUCH GET IN TOUCH 08 7084 1848 9.30am - 3.30pm (AEDT) Monday to Friday info@blackmango.com.au Contact Form Adelaide Showroom Trade Trade Trade Login Become a Trade Member Apple Pay Google Pay Mastercard PayPal Shop Pay Union Pay Visa Powered by Shopify icon-X \"Close (esc)\" icon-X icon-chevron icon-X Black Mango | Contact Us"
    }
  ]
}