{
  "fuentes": [
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "email": "lucky_diamond_logo_100_x_100_110x@2x.png"
    },
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "email": "lucky_diamond_logo_100_x_100_140x@2x.png"
    },
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "email": "lucky_diamond_logo_132_x_132_x50@2x.png"
    },
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "email": "lucky_diamond_logo_white_100_x_100_110x@2x.png"
    },
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "email": "lucky_diamond_logo_white_100_x_100_140x@2x.png"
    },
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "email": "info@lucky.diamonds"
    },
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "email": "william@lucky.diamonds"
    },
    {
      "url": "https://www.luckystrikeent.com/contact-us",
      "email": "guestservice@bowlerocorp.com"
    },
    {
      "url": "https://byronbayoysterbar.com.au/contact-us-byron-bay-oyster-bar/",
      "email": "reservations@hotelmarvell.com.au"
    },
    {
      "url": "https://www.luckystrikeent.com/",
      "email": "guestservice@bowlerocorp.com"
    }
  ],
  "mails": [
    "guestservice@bowlerocorp.com",
    "info@lucky.diamonds",
    "lucky_diamond_logo_100_x_100_110x@2x.png",
    "lucky_diamond_logo_100_x_100_140x@2x.png",
    "lucky_diamond_logo_132_x_132_x50@2x.png",
    "lucky_diamond_logo_white_100_x_100_110x@2x.png",
    "lucky_diamond_logo_white_100_x_100_140x@2x.png",
    "reservations@hotelmarvell.com.au",
    "william@lucky.diamonds"
  ],
  "nombre_sitio": "maplelanes.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.lucky.diamonds/pages/our-team-and-staff",
      "text": "Our Team and Staff\n– Lucky D Skip to content Close menu Shop Shop All Pendants Necklaces Bracelets Earrings Rings Anklets Shop By Precious Metal 24 Karat Gold Jewelry 18 Karat Gold Jewelry 14 Karat Gold Jewelry 10 Karat Gold Jewelry Platinum Jewelry Silver Jewelry Shop By Color White Gold Jewelry Yellow Gold Jewelry Rose Gold Jewelry Men's Designs Men's Pendants Men's Necklaces Men's Bracelets Men's Rings Men's Earrings Women's Designs Women's Earrings Women's Rings Women's Necklaces Women's Pendants Women's Bracelets Anklets Shop By Occasion Anniversary Jewelry Baptism Jewelry Bat Mitzvah Jewelry Christening Jewelry Christmas Father's Day Graduation Jewelry Hanukkah Mother's Day Quinceañera Jewelry Sweet Sixteen Pendants Allah Pendants Alphabet / Letter Pendants Angel Pendants Animal Pendants Ankh Pendants Buddha Pendants Crosses Dragon Pendants Evil Eye Pendants Hamsa Pendants Jesus Pendants Memorial / Picture Pendants Nefertiti Pendants Pharaoh Pendants Religious Pendants Sports Pendants Star of David Pendants Zodiac Sign Pendants Collections Necklaces Chains / Links Tennis Necklaces Cuban Link Chains Bracelets Tennis (Diamond-Line) Bracelet Cuban Link Bracelet Figaro Link Bracelets Rope Bracelets Rings Cuban Link Ring Signet Rings Eternity Rings Nugget Rings Body Jewelry / Piercings Body Piercing Barbells Body Piercing Rings Body Piercing Screws Earrings Hoop Earrings Huggie Earrings Stud Earrings Engagement Engagement Rings Wedding Rings Gem Jewelry Diamond Jewelry Diamond Pendants Diamond Necklaces Diamond Bracelets Diamond Earrings Diamond Rings Pearl Jewelry Pearl Pendants Pearl Necklaces Pearl Bracelets Pearl Rings Jade Jewelry Jade Pendants Jade Necklaces Jade Bracelets Jade Earrings Jade Rings Silver Jewelry Sterling Silver (925) Sterling Silver Pendants Sterling Silver Necklaces Sterling Silver Bracelets Sterling Silver Earrings Sterling Silver Rings Fine Silver (999) Services Custom Jewelry Custom Grillz Repair and Restoration Recycling and Refining About Our Team and Staff FAQs Contact Us 📍Location📍 Contact FAQs Log in Instagram Facebook YouTube Twitter Pinterest Snapchat TikTok LinkedIn Cart Close cart Order note Subtotal $0.00 Shipping, taxes, and discount codes calculated at checkout. Check out One or more of the items in your cart is a recurring or deferred purchase. By continuing, I agree to the cancellation policy and authorize you to charge my payment method at the prices, frequency and dates listed on this page until my order is fulfilled or I cancel, if permitted. Your cart is currently empty. Pause slideshow Play slideshow Free shipping On all orders over $100 Hassle-free returns 30-day postage paid returns 📍Location📍 Contact FAQs Instagram Facebook YouTube Twitter Pinterest Snapchat TikTok LinkedIn Currency USD $ AED د.إ AFN ؋ ALL L AMD դր. ANG ƒ AUD $ AWG ƒ AZN ₼ BAM КМ BBD $ BDT ৳ BGN лв. BIF Fr BND $ BOB Bs. BSD $ BWP P BZD $ CAD $ CDF Fr CHF CHF CNY ¥ CRC ₡ CVE $ CZK Kč DJF Fdj DKK kr. DOP $ DZD د.ج EGP ج.م ETB Br EUR € FJD $ FKP £ GBP £ GMD D GNF Fr GTQ Q GYD $ HKD $ HNL L HUF Ft IDR Rp ILS ₪ INR ₹ ISK kr JMD $ JPY ¥ KES KSh KGS som KHR ៛ KMF Fr KRW ₩ KYD $ KZT ₸ LAK ₭ LBP ل.ل LKR ₨ MAD د.م. MDL L MKD ден MMK K MNT ₮ MOP P MUR ₨ MVR MVR MWK MK MYR RM NGN ₦ NIO C$ NPR Rs. NZD $ PEN S/ PGK K PHP ₱ PKR ₨ PLN zł PYG ₲ QAR ر.ق RON Lei RSD РСД RWF FRw SAR ر.س SBD $ SEK kr SGD $ SHP £ SLL Le STD Db THB ฿ TJS ЅМ TOP T$ TTD $ TWD $ TZS Sh UAH ₴ UGX USh USD $ UYU $U UZS so'm VND ₫ VUV Vt WST T XAF CFA XCD $ XOF Fr XPF Fr YER ﷼ Search Site navigation Shop Shop All Pendants Necklaces Bracelets Earrings Rings Anklets Shop By Precious Metal 24 Karat Gold Jewelry 18 Karat Gold Jewelry 14 Karat Gold Jewelry 10 Karat Gold Jewelry Platinum Jewelry Silver Jewelry Shop By Color White Gold Jewelry Yellow Gold Jewelry Rose Gold Jewelry Men's Designs Men's Pendants Men's Necklaces Men's Bracelets Men's Rings Men's Earrings Women's Designs Women's Earrings Women's Rings Women's Necklaces Women's Pendants Women's Bracelets Anklets Shop By Occasion Anniversary Jewelry Baptism Jewelry Bat Mitzvah Jewelry Christening Jewelry Christmas Father's Day Graduation Jewelry Hanukkah Mother's Day Quinceañera Jewelry Sweet Sixteen Pendants Allah Pendants Alphabet / Letter Pendants Angel Pendants Animal Pendants Ankh Pendants Buddha Pendants Crosses Dragon Pendants Evil Eye Pendants Hamsa Pendants Jesus Pendants Memorial / Picture Pendants Nefertiti Pendants Pharaoh Pendants Religious Pendants Sports Pendants Star of David Pendants Zodiac Sign Pendants Collections Necklaces Chains / Links Tennis Necklaces Cuban Link Chains Bracelets Tennis (Diamond-Line) Bracelet Cuban Link Bracelet Figaro Link Bracelets Rope Bracelets Rings Cuban Link Ring Signet Rings Eternity Rings Nugget Rings Body Jewelry / Piercings Body Piercing Barbells Body Piercing Rings Body Piercing Screws Earrings Hoop Earrings Huggie Earrings Stud Earrings Engagement Engagement Rings Wedding Rings Gem Jewelry Diamond Jewelry Diamond Pendants Diamond Necklaces Diamond Bracelets Diamond Earrings Diamond Rings Pearl Jewelry Pearl Pendants Pearl Necklaces Pearl Bracelets Pearl Rings Jade Jewelry Jade Pendants Jade Necklaces Jade Bracelets Jade Earrings Jade Rings Silver Jewelry Sterling Silver (925) Sterling Silver Pendants Sterling Silver Necklaces Sterling Silver Bracelets Sterling Silver Earrings Sterling Silver Rings Fine Silver (999) Services Custom Jewelry Custom Grillz Repair and Restoration Recycling and Refining About Our Team and Staff FAQs Contact Us Log in Search Cart Search \"Close (esc)\" View more Home / Our Team and Staff Our Team and Staff Meet Our Team Charlie Wong (owner) Founder, President and Head Master Jeweler Specialties: Goldsmithing, Hand-fabrication, and Stonesetting Eva Sam aka A$AP Eva (wife) Co - Founder, Chairwoman, Treasurer William Wong (son) Vice President Brand Development & Creative Director (Grillz & Custom Jewelry), E-Commerce, Marketing, and Online Operations B.S. in Biochemistry and Minor in Fine Arts Anny Wu Ng (daughter-in-law) Director of Gemology (GIA Certified), Inventory Quality Assurance / Control Customer Service Customer Service +1 (212) 431-1180 Frequently Asked Questions Email Customer Service Services Shipping Policy Return Policy Privacy Policy Terms of Service Our Company Our Company Established 1993 Our Team Custom Work Custom Grillz Browse All Products Browse All Collections Popular Jewelry - Affiliate Store Blogs Search Sitemap Stay In Touch Stay In Touch Facebook Instagram Youtube WeChat (微信) TikTok (抖音) Snapchat Pinterest Twitter Spotify SoundCloud Sign up and save Sign up and save Subscribe to get special offers, free giveaways, and once-in-a-lifetime deals. Enter your email Subscribe Instagram Facebook YouTube Twitter Pinterest Snapchat TikTok LinkedIn Currency USD $ AED د.إ AFN ؋ ALL L AMD դր. ANG ƒ AUD $ AWG ƒ AZN ₼ BAM КМ BBD $ BDT ৳ BGN лв. BIF Fr BND $ BOB Bs. BSD $ BWP P BZD $ CAD $ CDF Fr CHF CHF CNY ¥ CRC ₡ CVE $ CZK Kč DJF Fdj DKK kr. DOP $ DZD د.ج EGP ج.م ETB Br EUR € FJD $ FKP £ GBP £ GMD D GNF Fr GTQ Q GYD $ HKD $ HNL L HUF Ft IDR Rp ILS ₪ INR ₹ ISK kr JMD $ JPY ¥ KES KSh KGS som KHR ៛ KMF Fr KRW ₩ KYD $ KZT ₸ LAK ₭ LBP ل.ل LKR ₨ MAD د.م. MDL L MKD ден MMK K MNT ₮ MOP P MUR ₨ MVR MVR MWK MK MYR RM NGN ₦ NIO C$ NPR Rs. NZD $ PEN S/ PGK K PHP ₱ PKR ₨ PLN zł PYG ₲ QAR ر.ق RON Lei RSD РСД RWF FRw SAR ر.س SBD $ SEK kr SGD $ SHP £ SLL Le STD Db THB ฿ TJS ЅМ TOP T$ TTD $ TWD $ TZS Sh UAH ₴ UGX USh USD $ UYU $U UZS so'm VND ₫ VUV Vt WST T XAF CFA XCD $ XOF Fr XPF Fr YER ﷼ Amazon American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa Copyright © 1994 - 2025 Lucky D\n        \n          - Designed & Maintained by William Wong Lucky Diamond is not affiliated with Rolex S.A., Rolex USA, or any of its subsidiaries. Lucky Diamond is an independent watch dealer and is not sponsored by, associated with and/or affiliated with Rolex, or any other brand listed. Lucky Diamond only sells pre-owned watches and provides its own warranties on the watches it sells. Website Issues? Contact Webmaster \"Close (esc)\" English Afrikaans Albanian Amharic Arabic Armenian Azerbaijani Basque Belarusian Bengali Bosnian Bulgarian Catalan Cebuano Chichewa Chinese (Simplified) Chinese (Traditional) Corsican Croatian Czech Danish Dutch English Esperanto Estonian Filipino Finnish French Frisian Galician Georgian German Greek Gujarati Haitian Creole Hausa Hawaiian Hebrew Hindi Hmong Hungarian Icelandic Igbo Indonesian Irish Italian Japanese Javanese Kannada Kazakh Khmer Korean Kurdish (Kurmanji) Kyrgyz Lao Latin Latvian Lithuanian Luxembourgish Macedonian Malagasy Malay Malayalam Maltese Maori Marathi Mongolian Myanmar (Burmese) Nepali Norwegian Pashto Persian Polish Portuguese Punjabi Romanian Russian Samoan Scottish Gaelic Serbian Sesotho Shona Sindhi Sinhala Slovak Slovenian Somali Spanish Sudanese Swahili Swedish Tajik Tamil Telugu Thai Turkish Ukrainian Urdu Uzbek Vietnamese Welsh Xhosa Yiddish Yoruba Zulu"
    },
    {
      "url": "https://www.luckystrikeent.com/contact-us",
      "text": "Contact Lucky Strike | Corporate Information & Guest Services Careers Book an Event Reserve a Lane Reserve Parties & Events Specials Eat & Drink Leagues Find a Location Contact Us Reach out if you have any questions, feedback or marketing opportunities. Contact Guest Services Corporate Address\n\n7313 Bell Creek Rd\nMechanicsville, VA 23111 GuestService@BowleroCorp.com Event/Party Questions Monday - Saturday, \n9:30am-8pm EST 1-866-211-3369 If you are an employee and want to share feedback or file a complaint, submit here. I have a question regarding:* Select New or Existing Event / Lane Reservation Inquiries / Refunds Feedback on a Recent Experience Season Pass Questions / Issues Transaction/Charge Questions/Issues Groupon Questions / Issues League Questions / Issues General Questions / Inquiry Retail Center Search for a City, State or Zip City, State or Zip What day? What day? What day? What day? Time of visit Hour Hour 1 2 3 4 5 6 7 8 9 10 11 12 Min Min 00 05 10 15 20 25 30 35 40 45 50 55 AM/PM AM/PM AM PM First Name* Last Name* Email* Phone Number* Question/Comment Submit *By submitting this form you agree to give Lucky Strike permission to contact you at the email address you provided. You must be at least 13 years of age to complete this form. Your email address will be kept confidential and not provided to third parties. Review our Privacy Policy . Let’s Bowl Parties & Events Eat & Drink Arcade Games Leagues Gift Cards Find a Location MVB Rewards Company Blog Careers Press Investors Contact Us Terms of Use Arcade Terms © 2025 Lucky Strike Entertainment • All Rights Reserved • Terms and Conditions • Privacy Policy • California Privacy Policy"
    },
    {
      "url": "https://byronbayoysterbar.com.au/contact-us-byron-bay-oyster-bar/",
      "text": "Contact Byron Bay Oyster Bar | Get in Touch with Us Home Menus Dinner Oysters What’s On Hotel Marvell Contact Us Home Menus Dinner Oysters What’s On Hotel Marvell Contact Us make a reservation Contact us Write Us First Name Last Name Phone Number Email Message Send OPENING HOURS Tuesday to Saturday – 7am – 10pm                                                             \nSunday & Monday – 7am – 4pm Call Us +61 (02) 6685 7385 ADDRESS Hotel Marvell 4 Marvell Street, Byron Bay, NSW 2481 Stay up to date on the latest news and events Email Send www.hotelmarvell.com.au Instagram Opening Hours 7 days a week 7am – 10pm Contact Address - Hotel Marvell, 4 Marvell St, Byron Bay 2481 Call - +61 (02) 6685 7385"
    },
    {
      "url": "https://www.luckystrikeent.com/",
      "text": "Bowling Alley, Party Venue & Sports Bar | Lucky Strike Careers Book an Event Reserve a Lane Reserve Parties & Events Specials Eat & Drink Leagues Find a Location Make Memories in Style Reserve your lane, skip the line and roll like a VIP. Reserve a Lane Reserve a Lane Book an Event Where do you want to bowl? Search for a City, State or Zip City, State or Zip How many guests? 4 6 Per Lane 2 3 4 5 6 7 8 9 10 11 12 What day? Select a Date Reserve up to 8 days in advance What day? Select a Date Reserve up to 8 days in advance Reserve a Lane Need help planning an event? Contact an Event Planner Where do you want to book an event? Search for a City, State or Zip City, State or Zip What type of an event is this? Select How do you want to celebrate? What day? Book up to 6 months in advance What day? Book up to 6 months in advance Book an Event Need help planning an event? Contact an Event Planner Plan a Party Contact an Event Planner Corporate Parties Elevate your next corporate outing! Our office parties and corporate events are easy to plan and completely stress-free. Plan a Corporate Event Kids Parties Our bowling parties for kids are fun and easy to plan! Design the perfect birthday party for your kids, their friends, and yourself. Book a Kids Party Teen Parties Bowl on blacklight lanes, relax on your own reserved lane, and dig into insta-worthy treats Perfect for teen birthdays! Book a Teen Party Social Events The perfect backdrop for every occasion! Birthdays, bachelorette parties, reunions, and any occasion you can think of! Book a Social Event National Events Let our team of seasoned national event planning experts plan your next National Event. Host a National Event Talk to a Planner Get in touch with our expert party planners and let us bring your event to life! Contact Us Eats & Drinks Nacho Avalanche Brace yourself for a flavor strike with our Nacho Avalanche – it's a game-changer! Nacho Avalanche Brace yourself for a flavor strike with our Nacho Avalanche – it's a game-changer! Espresso Martini Hot Honey Chicken Sandwich Pizza Score a slice of perfection with our piping hot, cheesy pizza – a winner every time! Crispy Tacos Amazing Drinks Signature Sampler Burgers Sweet Spot Bao Buns Join a League Team up. Hit the lanes. Have a great time. Our leagues and social clubs offer lively competition and laid-back fun for everyone from beginners to pros. Make new friends, hang out with your BFFs, improve your game, and get awesome perks—all in a social club or league. Learn About Leagues I can confidently say that this spot exceeds expectations! The venues are top-notch and the food and drinks are delicious. It's the perfect place to unwind and have some fun after a long week. Can't wait for my next visit! The venues are top-notch and the food and drinks are delicious. It's the perfect place to unwind and have some fun after a long week. Can't wait for my next visit! Mike T. I hosted my son's birthday party here, and it was a hit! The staff went above and beyond to ensure everything ran smoothly, from booking the lanes to organizing the catering. The kids had a blast, and the parents appreciated the hassle-free experience. Thank you for making it a memorable day for us! The staff went above and beyond to ensure everything ran smoothly, from booking the lanes to organizing the catering. The kids had a blast, and the parents appreciated the hassle-free experience. Thank you for making it a memorable day for us! Emily H. Not just bowling – this place is a blast for arcade lovers too! With a mix of games and prizes, it's non-stop fun. Whether you're a pro or just looking to chill, the vibe is always electric. Bring your crew and get your game on! With a mix of games and prizes, it's non-stop fun. Whether you're a pro or just looking to chill, the vibe is always electric. Bring your crew and get your game on! Jason R. Bowling at its finest! I've been a regular for years, and every visit is a blast. The lanes are well-maintained, the atmosphere is lively, and the staff is incredibly friendly. Highly recommended! I've been a regular for years, and every visit is a blast. The lanes are well-maintained, the atmosphere is lively, and the staff is incredibly friendly. Highly recommended! Sarah L. Find a Center Near You Choose Location Search 350+ Locations to find a location near you View All Locations All Locations Let’s Bowl Parties & Events Eat & Drink Arcade Games Leagues Gift Cards Find a Location MVB Rewards Company Blog Careers Press Investors Contact Us Terms of Use Arcade Terms © 2025 Lucky Strike Entertainment • All Rights Reserved • Terms and Conditions • Privacy Policy • California Privacy Policy"
    }
  ]
}