{
  "fuentes": [
    {
      "url": "https://www.marconet.com/careers",
      "email": "hr@marconet.com"
    },
    {
      "url": "https://www.marconet.com/careers",
      "email": "marco@marconet.com"
    },
    {
      "url": "https://1799prime.com/about-us/",
      "email": "info@1799prime.com"
    },
    {
      "url": "https://www.marconet.com/about/executive-leadership",
      "email": "marco@marconet.com"
    },
    {
      "url": "https://www.groupon.com/biz/marco-fl/marco-prime-steak-and-seafood",
      "email": "verify@r.groupon.com"
    }
  ],
  "mails": [
    "hr@marconet.com",
    "info@1799prime.com",
    "marco@marconet.com",
    "verify@r.groupon.com"
  ],
  "nombre_sitio": "marcoprime.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.marconet.com/careers",
      "text": "Careers - Join the Marco Team Skip to content Search Toggle Mobile Menu Toggle Managed Services Managed IT Services Managed Print Services Managed Voice  Services Managed Service Bundles IT & Security Cybersecurity Networking & Infrastructure Software & Licensing Assessments Connectivity Cloud IT Projects Consulting Services Managed IT Services Copiers & Printers Office Copiers & Printers Wide Format Printers Production Printing Office Shredding Print Management Software Managed Print Services Phone On-Premises Phone Cloud-Based Phone Collaboration Managed Voice Services Audio Visual Digital Signage Meeting Spaces Paging & Sound Masking Audio Visual Support Physical Security Video Surveillance Systems Access Control Systems Cloud-Based Surveillance Systems Enterprise Content Mgmt M-Files Solution OnBase by Hyland Shop (Opens in new window) About Locations Careers Strategic Partners Purchasing Contracts How to Buy Business Succession News & Blog Client Support Contact Shop (Opens in new window) About Locations Careers Strategic Partners Purchasing Contracts How to Buy Business Succession News & Blog Client Support Contact Managed Services Managed IT Services Managed Print Services Managed Voice  Services Managed Service Bundles IT & Security Cybersecurity Networking & Infrastructure Software & Licensing Assessments Connectivity Cloud IT Projects Consulting Services Managed IT Services Copiers & Printers Office Copiers & Printers Wide Format Printers Production Printing Office Shredding Print Management Software Managed Print Services Phone On-Premises Phone Cloud-Based Phone Collaboration Managed Voice Services Audio Visual Digital Signage Meeting Spaces Paging & Sound Masking Audio Visual Support Physical Security Video Surveillance Systems Access Control Systems Cloud-Based Surveillance Systems Enterprise Content Mgmt M-Files Solution OnBase by Hyland Join the Team of Experts We’ve set the bar high with our Gold Standard culture. We’d love for you to join us and be part of it. We’re focused on building a positive workplace environment and a better community. Scroll down Where Great Careers Are Born Marco is a high-performing technology company with a track record of creating rewarding careers. Whether you’re a recent graduate ready for an exciting opportunity, or a seasoned professional eager to elevate your skills with an industry leader, then you’ve come to the right spot. Take a look at our diversified career opportunities , read about our corporate culture , and review our list of employee benefits that are among the best around. Then, apply. You won’t regret it. Protect Yourself from Job Scam Attempts We've recently been made aware of fraudulent recruiters falsely claiming to represent Marco Technologies. These scammers are creating fake job listings and creating spoofed application portals to deceive job seekers. Marco will not offer a job without a comprehensive interview process or ask for payment/personal financial information during recruitment. Stay safe and vigilant! View Open Positions by Department Previous Slide Next Slide Copier Service Explore the current copier service positions at Marco. View Copier Service Positions View Copier Service Positions Corporate Explore the current corporate positions at Marco. View Corporate Positions View Corporate Positions Engineering Explore the current engineering positions at Marco. View Engineering Positions View Engineering Positions Operations Explore the current operations positions at Marco. View Operations Positions View Operations Positions Sales and Sales Operations Explore the current sales and sales operations positions at Marco. View Sales & Sales Operations Positions View Sales & Sales Operations Positions Shred Services Explore the current shred services positions at Marco. View Shred Services Positions View Shred Services Positions Previous Slide Next Slide Our Commitment to Employee Wellness What does wellness look like for you? Maybe it’s increasing your steps or making healthier meals. Maybe it’s getting a better night’s sleep or learning how to practice mindfulness. It’s not always easy to make self-care a priority, especially when you have additional commitments — like taking care of a loved one or continuing your education. At Marco, we’ve always believed in work-life balance, but we knew we could do more. So we decided to partner with Nest Health Connections in 2022 to create a customized wellness program for our staff, with access to a variety of physical and mental health resources. Our employees can pick and choose what works best for them. Participation is optional, and we invite our staff to take advantage of as many of these resources as they like. Employee Benefits Not Just Health Insurance At Marco, our employees are important to us. So, we offer benefits that extend beyond average health insurance and typical paid holidays. Some of our extra benefits include pet insurance, bonding leave for new parents, caregivers leave, a 529 (college savings) plan, a computer equipment purchase program, and paid volunteer time. An additional benefit, one that is a little less tangible, is our fun and friendly corporate culture. Our unique benefits and Gold Standard culture are some of the reasons we attract talented candidates. Marco Benefits Include: Medical insurance Dental insurance Vision insurance Flexible Spending Account Health Savings Account Bonding leave Caregivers leave 529 college savings plan 401(k) retirement plan Equipment purchase program Paid time off Paid volunteer time Pet insurance Employer-paid life insurance Term life insurance Short- and long-term disability insurance Critical illness and accident insurance Employee Assistance Program All full-time employees working 30 hours per week or more are eligible for these benefits. Little More Insight on Our Benefits Medical Insurance Marco offers six plan options with a national carrier, so there is a plan to fit everyone’s needs. Flexible spending and health savings accounts also are available. 401K Plan As much as you'll love working here, we know someday you'll want to retire. Marco contributes a $1-for-$1 match on employee contributions, up to a maximum of 5 percent of eligible compensation. The 401(k) plan allows employees to defer up to 60 percent of their gross earnings per plan year to help save for retirement. Personal Days The longer you're here, the more personal time you'll accumulate. Full-time employees earn 15 personal days during their first year of employment. Holiday Pay As a family-friendly employer, we want our employees to spend the holidays with the ones they love. So, Marco is closed in observance of the following holidays: New Year’s Eve (3 p.m.), New Year's Day, Good Friday (p.m. only), Memorial Day, Independence Day, Labor Day, Thanksgiving Day, Friday after Thanksgiving, Christmas Eve, and Christmas Day. Funeral Pay Employees are allotted varied amounts of funeral leave for immediate family members. Military Leave Employees who are members of the uniformed services will be granted a military leave of absence for temporary active duty or field training. Accessibility Note: If you are a job seeker with a disability and require a reasonable accommodation to apply for one of our jobs through our online employment application, please contact us at hr@marconet.com or by phone at (320) 259-3000. Careers Locations Support Resources Knowledge Base Partner Programs Events & Webinars Hardware & Devices Screen Share (Opens in new window) Service Request (Opens in new window) marco@marconet.com | 800.847.3098 Marco on Facebook (Opens in new window) Marco on Twitter (Opens in new window) Marco on Instagram (Opens in new window) Marco on YouTube (Opens in new window) Marco on LinkedIn (Opens in new window) © 2025 Marco • Privacy Policy • Cookie Policy"
    },
    {
      "url": "https://1799prime.com/about-us/",
      "text": "Polished Steakhouse | 1799 Prime Steak & Seafood - Alexandria, VA Menus Lunch Dinner Brunch Private Dining Cocktails Wine Happy Hour Promotions & Events VIP & Guest Loyalty Added to force Private Dining to the right of the logo Private Dining About Us Contact Reserve A Table Menus Lunch Dinner Brunch Private Dining Cocktails Wine Happy Hour Promotions & Events VIP & Guest Loyalty Added to force Private Dining to the right of the logo Private Dining About Us Contact Reserve A Table About Us Our Story Jahmond Quander, the Founder of Arrived Hospitality Inc., 1799 Prime Steak & Seafood, & 1799 Prime Kitchen shares his family ancestry & connection to President George Washington. In a full-circle moment in his life, Jahmond returned to George Washington’s Mount Vernon, as the Director of Food & Beverage. Documented from the 1670s, the Quander Family is one of the oldest documented African American Families that have come from African ancestry to present day America. Historians have not found records of any other African American Family whose ancestry has been consistently kept and published from that date and early period. In researching the family lineage, records showed that the majority of the Quander family resides in Virginia, Maryland & Washington DC. The family can trace their lineage almost 350 years into the 1670’s in Colonial Maryland. A branch of the family eventually was placed at Mount Vernon in Virginia as the enslaved servants of President George Washington. The Quanders originated from the Fanti tribe in Ghana, West Africa. A man by the name of Egya Amkwandoh was kidnapped during the African slave trade in the late 17th century and was apparently transported to the Maryland colony. It is thought that when slave owners asked for his name, the reply “Amkwandoh,” was misinterpreted as “I am Quando.” The next few generations of Quanders went by the name Quando rather than Quander. Other variations used included Quandoe and Kwando. The name became recognized as the present-day pronunciation “Quander” during the early 19th century. It is believed that Egya Amkwandoh had two sons, who were both taken away from him and split up. One son resided in Maryland and the other son resided in Virginia. The first known records of the “Quando” family existing as free people come from the Maryland side, specifically the family member of Henry Quando. Henry Adams, the enslaver, from Port Tobacco, Charles County, Maryland, provided for Quando’s freedom in his will of October 13, 1684. Further, the descendant Quandos/Quanders that currently reside in Virginia are widely believed to be related to George Washington. Nancy Carter Quander & her mother Sukey Bay were among the slaves who worked as spinners & cloth makers at River Farm, one of George Washington’s Five Farms that constituted the Mount Vernon Plantation & Estate. Finally, the significance of naming of 1799 Prime Steak & Seafood is revealed. George Washington’s will provided for the manumission and freedom of his 123 enslaved people, but he postponed their release until Martha’s death. George Washington died on December 14, “1799.” On the first anniversary of George Washington’s death, Martha Washington signed a deed of manumission, which took effect on January 01,1801, fully freeing Washington’s enslaved people. On that date, Nancy Carter, who shortly thereafter married Charles Quander, a freed black man, was fully emancipated. Remaining in the Mount Vernon area, Nancy Quander was among the eleven freed people reported in the *Alexandria Gazette* in 1835, as attending the tombstone & landscape at Washington’s grave. To the reporter’s inquiry, the group noted that they were paying their respects & attributed their loyalty to George Washington, whom they claimed to have been like a father. When I pondered the thought of naming my first restaurant “1799 Prime Steak & Seafood,” I reflected on my life’s goals & achievements. The longer I pondered, memories of my forefathers & their struggles to ensure a healthy lifestyle for their family came to mind. In order for my forefathers to achieve that healthy lifestyle, they needed guidance from others to direct their path. That pathway has led me to establish 1799 Prime Steak & Seafood. Meet Our Team Jahmond Quander Founder & CEO Jahmond Quander brings over 30 years of restaurant experience to the table. He is known in the industry as a sharp dressing, detail oriented, approachable and results getting leader that has made every restaurant he has been a part of successful, with an imaginative and innovative approach to the hospitality industry. Jay’s unwavering dedication to amazing food, impeccable service, warm and welcoming atmospheres aided him in opening restaurants in Manhattan, NY, Annapolis, MD & Virginia. Everyone he encounters, from his dishwashers to his high-level executives, are treated with the same respect and care regarding any concern they may have. He has left a trail of loyalty up and down the east coast that is unparalleled. Chefs, Servers, General Managers all follow him over state lines for the opportunity to work with and for him. Eleazar Tena Co-Founder & COO Eleazar Tena brings over 25 years of restaurant experience to 1799 Prime. He is known for running an efficient kitchen, creating innovative features, and developing his team. Chef Eleazar’s unrivaled managerial prowess is accredited to experience in multiple restaurant openings, cruise lines, and operating various kitchens in Washington, DC, Maryland, and Virginia. Chef Eleazar’s cutting edge food knowledge, rapt attention to detail, and problem solving abilities gives great profit to our organization as well as the highest level of satisfaction to our Guests. Fabiano Pinho-Pessoa General Manager Fabiano Pinho-Pessoa brings over 23 years of restaurant experience to 1799. He is known in the industry for his warm, relatable and welcoming demeanor in every aspect of hospitality. He surpasses expectations to deliver flawless service and the finest experience for guests. Fabiano is an expert at leading by example to inspire and achieve positive results while under the daily challenges of restaurant operations. He harmoniously transfers his drive for excellence to help others surpass their growth and development to effect a forward-looking approach and integration at every level of service earning him the role of an exemplary yet humble leader. Fabiano treats you like you are a member of his family entering his home and dining at his table. He came from Brazil to experience the American dream. Fabiano has worked with Jay over the course of 20 years. His diversified background and fearless loyalty supports and complements Jay’s vision for 1799. Kirk Wilson, Jr Beverage Maestro & Maître d’ Kirk began his career in the restaurant industry as a humble busser and food runner. His dedication, passion, and tireless work ethic propelled him through the ranks, culminating in his current roles as a skilled service manager and dining room maître d’. Throughout his journey, Kirk has consistently demonstrated exceptional leadership, initiative, and a deep commitment to delivering unparalleled guest experiences. What sets Kirk apart is not only his impressive professional trajectory but also his visionary outlook. He aspires to become the youngest General Manager within the Arrived Hospitality Inc, with ambitions to eventually assume roles such as Director of Ops or VP of Ops, where he can leverage his talents to open multiple 1799 Prime Steak & Seafood restaurants worldwide. Kirk’s unwavering passion for elevating the dining experience and his drive for excellence are truly inspiring. Beyond his professional achievements, Kirk possesses exceptional communication skills and a dynamic personality that effortlessly engages those around him. He is articulate, adaptable, and possesses a rare combination of strategic thinking and attention to detail. In summary, Kirk Wilson is a shining example of dedication, talent, and potential within the hospitality industry. I am confident that he will excel in any endeavor he pursues and will be a valuable asset to my Team Jessica Rothstein Private Events Coordinator With nearly two years dedicated to perfecting great service at 1799, Jessica is a valuable asset to the team. Her journey in hospitality also includes a role at the Thompson Hotel in Navy Yard, DC, where she contributed to organizational projects and administrative tasks. Jessica’s genuine passion for people and food shines through in her work, complemented by her exceptional detail-oriented approach. This dedication to superior service was honed in her previous fast-casual experiences, consistently making it her top priority. Erick Ramirez Sous Chef Erick Ramirez is an accomplished Sous Chef with extensive experience in high-volume, fast-paced kitchens. Known for his exceptional culinary skills, leadership, and creativity, Erick brings a strong background in menu development, quality control, and kitchen operations management. Skilled in both modern cooking techniques and classical preparations, Erick draws inspiration from international cuisines to craft dishes that consistently meet the highest standards of taste and presentation. His artistry in the kitchen is matched by his ability to lead, train, and inspire culinary teams, ensuring excellence even under pressure. Guided by the mentorship of Chef Sonny Tena, Erick has developed into a proven leader who values precision, teamwork, and respect for ingredients. With dedication and vision, he continues to create memorable culinary experiences that reflect his passion for the craft. Hours of Operation Monday through Thursday 4:00 pm - 10:00 pm Friday through Saturday 12:00 pm - 11:00 pm Sunday Brunch 10:00 am - 3:00 pm Sunday Dinner 4:00 pm - 10:00 pm Reserve A Table Home About Private Dining Menus Contact Join Our Team Dress Code Gift Cards Contact us info@1799prime.com (571) 867-9595 110 S Pitt Street Alexandria, VA 22314 Follow Follow Follow © 1799 Prime Steak & Seafood via WordPress Web Design Agency Terms & Conditions Privacy Policy"
    },
    {
      "url": "https://www.marconet.com/about/executive-leadership",
      "text": "About Skip to content Search Toggle Mobile Menu Toggle Managed Services Managed IT Services Managed Print Services Managed Voice  Services Managed Service Bundles IT & Security Cybersecurity Networking & Infrastructure Software & Licensing Assessments Connectivity Cloud IT Projects Consulting Services Managed IT Services Copiers & Printers Office Copiers & Printers Wide Format Printers Production Printing Office Shredding Print Management Software Managed Print Services Phone On-Premises Phone Cloud-Based Phone Collaboration Managed Voice Services Audio Visual Digital Signage Meeting Spaces Paging & Sound Masking Audio Visual Support Physical Security Video Surveillance Systems Access Control Systems Cloud-Based Surveillance Systems Enterprise Content Mgmt M-Files Solution OnBase by Hyland Shop (Opens in new window) About Locations Careers Strategic Partners Purchasing Contracts How to Buy Business Succession News & Blog Client Support Contact Shop (Opens in new window) About Locations Careers Strategic Partners Purchasing Contracts How to Buy Business Succession News & Blog Client Support Contact Managed Services Managed IT Services Managed Print Services Managed Voice  Services Managed Service Bundles IT & Security Cybersecurity Networking & Infrastructure Software & Licensing Assessments Connectivity Cloud IT Projects Consulting Services Managed IT Services Copiers & Printers Office Copiers & Printers Wide Format Printers Production Printing Office Shredding Print Management Software Managed Print Services Phone On-Premises Phone Cloud-Based Phone Collaboration Managed Voice Services Audio Visual Digital Signage Meeting Spaces Paging & Sound Masking Audio Visual Support Physical Security Video Surveillance Systems Access Control Systems Cloud-Based Surveillance Systems Enterprise Content Mgmt M-Files Solution OnBase by Hyland Simplifying Technology Since 1973. Scroll down 50+ Years of Excellence In 1973, Marco opened its doors as a simple typewriter and office supply shop in St. Cloud, Minnesota. In just over 50 years, our US-based staff has grown to over 650 certified systems engineers and technical representatives, serving clients nationwide. Marco History Previous Slide Next Slide 1987 Three offices in St. Cloud are consolidated into a new corporate headquarters and retail store. Marco has 83 employees. 1997 Marco is repositioned as a technology company. 2008 Managed Print and IT Services are developed to provide customers with more effective ways to implement technology. 2012 St. Cloud Corporate headquarters moves to a new 77,000 sq. ft. office and distribution center. Marco has 21 offices in five states with 431 employees. 2021 Doug Albregts moves from President to CEO of Marco. Marco has locations in 12 states and over 1200 employees. 2023 Marco celebrates its 50th anniversary with offices in 15 states. 1973 Gary Marsden & Dave Marquardt (The ‘Mar’ in Marco) set up shop in St. Cloud, Minnesota. Our Mission To help our customers effectively apply technology that contributes to their success. Our Values We will act in a manner that demonstrates our commitment to doing what is right for our employees, clients, vendors, and communities. Learn more about our Gold Standard culture. Our Culture Previous Slide Next Slide What is Marco’s Gold Standard? It’s an initiative focused on building a positive workplace environment—and it’s not only for our employees. The Gold Standard includes four pillars: employee engagement, client satisfaction, community support, and vendor partnerships. Join the Marco Team Employee Engagement We consistently encourage employee participation through various activities, such as Peer Appreciation and Thanks (P.A.T.) Day, Gold Standard Salutes for employee recognition, customized training, team-bonding experiences, giveaways and more. Are you interested in working at Marco? See Open Positions Client Satisfaction “Think like a customer” is one of our Marco mottos. We take the time to understand the needs of our clients so we can deliver the right technology solution paired with outstanding service and support. We're proud to say that 91% of surveyed customers say they would recommend Marco. Client Testimonials Community Support For Marco, it’s not enough to just do well as a business. We also must “do good.” So we are committed to giving back to the communities we serve. We contribute financially, sponsor events, participate in fundraisers and encourage employees to volunteer on and off company time. Vendor Partnerships Our Vendor Partnerships Committee works to build and maintain lasting relationships with our vendors. We collaborate frequently with our vendors so we can grow together. Together, we are committed to helping you connect the right technology to achieve your business goals. Strategic Partnerships Employee Wellness Marco recently partnered with Nest Health Connections to create a customized wellness program for our staff. All Marco employees now have access to a variety of physical and mental health resources, including everything from online fitness classes and guided meditations to healthy recipes! Why Partner with Marco? One Source From planning and design through installation and support, we apply our network expertise to voice, data, video, print and IT solutions. Expect Satisfaction We've been conducting monthly customer surveys and documenting results since 1994, to ensure we meet your expectations. Caring and Committed We believe it's not enough for a business to do well; it must also do \"good.\" On the job and off, Marco is made up of people who care. Innovation Leader When you connect with Marco, you benefit from the innovation and resources of our industry leading partners. Why Marco? Learn More AWARDS We love what we do and it shows... Learn More Previous Slide Next Slide Featured 2025 Featured 2024 Featured 2023 Featured 2022 Featured 2021 Featured 2020 The Best Technology Providers Don’t Focus on Their Tools. They Focus on Their People. We make it our priority to hire the best and brightest, and then invest in their skills on an annual basis. And we’re led by an experienced and respected leadership team , because the best cultures are created from the top down. Doug Albregts Chairman of the Board Read Doug Albregts Bio Trevor Akervik President of Print Division Read Trevor Akervik Bio Clay Ostlund President of IT Division Read Clay Ostlund Bio Jolene Shaughnessy Vice President of Human Resources Read Jolene Shaughnessy Bio Paul Keller Chief Financial Officer Read Paul Keller Bio Brian Taylor Senior Vice President of Sales Read Brian Taylor Bio Additional Resources Business Succession Whether you’re thinking about an acquisition or are ready to make a move, we look forward to connecting with you. We want to be a trusted resource when planning your company's succession. Learn More Purchasing Programs Learn more about c ooperative contracts that help educational institutions, government institutions, and nonprofits surpass the RFP process. Learn More Professional Certifications At Marco, we take training seriously. We want our certified systems engineers and technical staff to be the most knowledgeable in the business, because your technology and your business depend on it. Learn More Marco Green At Marco, we're all about going green. Because it's not just better for the environment, it's better for our bottom line. Learn More Strategic Partners With Marco, you’re connected to not only an industry-leading technology company, but the best technology businesses in the industry. And they mean business. Learn More Service Commitment When you work with Marco, you'll get the distinct feeling that someone truly cares about your technology and your business. Because we do. Learn More Careers Locations Support Resources Knowledge Base Partner Programs Events & Webinars Hardware & Devices Screen Share (Opens in new window) Service Request (Opens in new window) marco@marconet.com | 800.847.3098 Marco on Facebook (Opens in new window) Marco on Twitter (Opens in new window) Marco on Instagram (Opens in new window) Marco on YouTube (Opens in new window) Marco on LinkedIn (Opens in new window) © 2025 Marco • Privacy Policy • Cookie Policy"
    },
    {
      "url": "https://www.groupon.com/biz/marco-fl/marco-prime-steak-and-seafood",
      "text": "Marco Prime Steak & Seafood, 599 South Collier Boulevard, Marco Island, FL - Groupon Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Marco Prime Steak & Seafood, Marco Island Marco Prime Steak & Seafood, Marco Island 599 South Collier Boulevard, Marco Island, FL 34145 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals Taste Mexican Cuisine with $25 or $40 Food & Drink Options La Estancia Riverside $25 $18 $16.20 -35% Limited time $14.58 Sign in to apply discount 4.6 (354) House of Blues ( 7 Locations ) Show or Night Out dining packages for 2 or 4 individuals at House of Blues (Up to 42% Off) 1490 East Buena Vista Drive, Orlando 994.4 mi $96 $65 -32% Mojo's East Coast Eats Savor Amazing Deals at Mojo's East Coast Eats 2758 Maple Ave., Downers Grove 22.9 mi $20 $15 $13.50 -33% Limited time $12.15 Sign in to apply discount 4.7 (267) Book Online Chicago Skyline Tiki Chic Party Cruise on Lake Michigan Island Party Boat $35 3.8 (26) Nick And Brunos Pizzeria Up to 28% Off on Pizza at Nick And Bruno's Pizzeria 10121 Grand Avenue, Franklin Park 13.5 mi $100 $80 $72 -28% Limited time $64.80 Sign in to apply discount 4.8 (187) 750 Cucina Rustica Sip and Savour: $30 Towards Food and Drink 7 Jandus Road, Cary 39.0 mi $30 $21 $18.90 -37% Limited time $17.01 Sign in to apply discount 4.6 (462) Oh My Goodness Soul Eatery Up to $75 to spend on soul food and more at Oh My Goodness Soul Eatery Ashburn, Chicago 9.5 mi $25 $18 $16.20 -35% Limited time $14.58 Sign in to apply discount 4.4 (256) Crepe It Up And Bowls Sip Lattes, Bite Croissants, Savor Crepes – Ultimate Indulgence 1340 75th Street, Downers Grove 22.1 mi $26.28 $18 -32% 5 (38) IWINE 312 SUSHI BAR Savor and Enjoy $50, $75, or $100 Dining Credit for an Exquisite Meal Chicago Loop, Chicago 0.6 mi $50 $35 $31.50 -37% Limited time $28.35 Sign in to apply discount 4.9 (25) How to reach us © MapTiler © OpenStreetMap contributors Marco Prime Steak & Seafood 1152.5 mi 599 South Collier Boulevard, Marco Island, FL 34145 Open Closes at 10:00 PM Open Closes at 10:00 PM Call Directions Visit website Price Takes Reservations +12393892333 http://www.marcoprime.com/ About Marco Prime Steak & Seafood A stylish seafood spot nestled in Marco Island, Marco Prime Steak & Seafood draws a crowd. Marco Prime Steak & Seafood offers great gluten-free alternatives to fan favorites. Order a bottle for the table if you like ? this restaurant has a full bar stocked with the best wine, beer, and more. If you're in need of a booster seat, this restaurant's got you covered. This is a great spot for the whole family. Al fresco eating options are also available at Marco Prime Steak & Seafood, which presents a lovely patio seating area for warmer months. Marco Prime Steak & Seafood honors a business casual dress code, so formal wear can be left behind. At this restaurant, you can work your arms a little. Pick up the food yourself and carry it out. Marco Prime Steak & Seafood's valet parking allows you to drive right up to the restaurant and get your dining experience started. Marco Prime Steak & Seafood is a prime location for cyclists to park their bikes and enjoy a bite to eat. Marco Prime Steak & Seafood's fare is so good, you'll want to sample everything on the menu (and with its middle-of-the-road prices, you can!). So come to Marco Prime Steak & Seafood, where they're putting a trendy twist on all your favorite seafood dishes. Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    }
  ]
}