{
  "fuentes": [
    {
      "url": "https://www.marcoislandart.org/exhibition-calendar/",
      "email": "info@marcoislandart.org"
    },
    {
      "url": "https://www.marconews.com/story/news/local/2025/04/28/now-you-know-arts-org-to-roast-marco-city-manager/83248806007/",
      "email": "jtaylor@cityofmarcoisland.com"
    },
    {
      "url": "https://www.coastalbreezenews.com/lifestyles/entertainment/marco-art-center-presents-oh-what-a-night-dinner-and-a-show/article_c4e506ee-7b67-11ef-9d30-4f1a57f1ee76.html",
      "email": "val@coastalbreezenews.com"
    },
    {
      "url": "https://www.marcoislandart.org/festival-of-trees/",
      "email": "info@marcoislandart.org"
    },
    {
      "url": "https://www.marcoislandart.org/events-calendar/",
      "email": "info@marcoislandart.org"
    },
    {
      "url": "https://www.marcoislandart.org/events/",
      "email": "info@marcoislandart.org"
    },
    {
      "url": "https://www.marcoislandart.org/the-great-create/",
      "email": "info@marcoislandart.org"
    },
    {
      "url": "https://www.marcoislandart.org/events/manhattan-short-film-festival/",
      "email": "info@marcoislandart.org"
    },
    {
      "url": "https://www.fortheloveofcatsfl.com/contact",
      "email": "cassandra@fortheloveofcatsfl.com"
    },
    {
      "url": "https://www.fortheloveofcatsfl.com/contact",
      "email": "cassandran@fortheloveofcatsfl.com"
    },
    {
      "url": "https://www.marcoislandart.org/",
      "email": "info@marcoislandart.org"
    },
    {
      "url": "https://www.coastalbreezenews.com/news/community/art-center-honors-artists-of-the-year/article_199c99ef-e1d1-4560-8a70-324b0ec37367.html",
      "email": "column16@coastalbreezenews.com"
    },
    {
      "url": "https://www.coastalbreezenews.com/news/community/art-center-honors-artists-of-the-year/article_199c99ef-e1d1-4560-8a70-324b0ec37367.html",
      "email": "val@coastalbreezenews.com"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "email": "iepsconsultation@projectaccessnow.org"
    }
  ],
  "mails": [
    "cassandra@fortheloveofcatsfl.com",
    "cassandran@fortheloveofcatsfl.com",
    "column16@coastalbreezenews.com",
    "iepsconsultation@projectaccessnow.org",
    "info@marcoislandart.org",
    "jtaylor@cityofmarcoisland.com",
    "val@coastalbreezenews.com"
  ],
  "nombre_sitio": "marcoislandart.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.marcoislandart.org/exhibition-calendar/",
      "text": "Exhibition Calendar - Marco Island Center for the Arts 1+239-394-4221 Art Center  / 1+239-784-1186 Box Office info@marcoislandart.org Facebook X Facebook X 0 Items Home About History Our Mission and Policies Board of Directors About Our Team Media and Press Artist of the Year Art Center Resources Space Time Capsule Exhibitions Exhibition Calendar Current Exhibition Gallery Reception Call To Artists Adult Education Onsite Classes Virtual Classes Instructors Policies, Terms, and Conditions Children and Family Children and Youth Children’s Summer Classes High School Art Show and Competition Family Events Resources Events Art Center Events Calendar Outdoor Events Musical Interludes MANHATTAN SHORT Annual Gala Annual Golf Tournament Marco Island Old World Christmas Bazaar Market Festival of Trees Arts Center Theatre Mainstage Theatre Productions-Individual Tickets 2025-2026 Season Tickets Group Ticket Policy Comedy Series Live Entertainment Audition Information Acting and Theatre Workshops Join and Support Support The Art Center Donate Become A Member or Renew Your Membership Become a Sponsor Purchase Engraved Bricks Volunteer! Planned Giving/Legacy Society Annual Appeal Contact Us Select Page Exhibition Calendar Keeping it Cool (Call to Artists) Intake July 31, 2025 10am-Noon August 4-September 30, 2025 La Petite Galerie: ( August) JeanCamposano: August 4-September 2, 2025 (September) Sir Roland Richardson September 8-30, 2025 Receptions August 12, 2025 and September 9, 2025 5:30pm-7pm Words as Art October 5- November 24, 2025 “Words as Art” is an innovative exhibition presented by Dpi-Sig Naples, showcasing a fusion of photography and AI-enhanced artwork. This exhibit explores the intersection of visual storytelling and artificial intelligence, highlighting how technology can transform traditional photographic art into dynamic, thought-provoking pieces. Visitors can expect to experience a diverse range of works that challenge perceptions and invite deeper contemplation on the role of AI in contemporary art. The exhibition underscores Dpi-Sig Naples’ commitment to embracing technological advancements while celebrating the art of photography. Gallery Receptions October 14, 2025 (5:30pm-7pm) and November 11, 2025 (5:30pm-7pm) La Petite Galerie: ( October) Pat Howard-October 6-28, 2025 (November) Ron Orlando- November 3, 2025-December 2, 2025 Day of the Dead (grass wall outdoor installation) October 13- November 14, 2025 This outdoor installation in the Art Center courtyard is part of ¡Arte Viva! Festival of Trees – CALL TO ARTISTS December 2, 2025 -December 4, 2025 Intake December 1, 2025 10am-Noon To Become a participant in Festival of Trees visit our page HERE dedicated to the annual event. “Glazed and Amazed” Clay Guild Exhibition December 8, 2025- January 6, 2026 Mini Masters (Rush Gallery) – Intake December 5, 2025 La Petite Galerie Patrice Schelkun December 8, 2025-January 6, 2026 Reception December 9, 2025 5:30 pm-7 pm Magic of the Sea Featuring Douglas David, Jim Freeman, Peggy Keigley January 12, 2026-February 24, 2026 La Petite Galerie: (January) Margo Kostecka- January 12, 2026 – January 27, 2026 (February) Joyce Flynn Hirsch- February 2, 2026 – February 24, 2026 Reception January 13, 2026 and February 10, 2026 5:30pm-7pm Members Show (Call To Artists Members Only) March 2-24, 2026 Intake February 26, 2026 10am-Noon La Petite Galerie: (March) Bonnie Brisky- March 2 – 24, 2026 Reception March 10, 2026 5:30pm-7pm Adult Student Exhibit Intake March 26, 2026 (any adult student from the past twelve months may submit pieces) March 30-April 28, 2026 La Petite Galerie: Marco Island Academy (March 30-April 28, 2026) Reception April 14, 2026 5:30pm-7pm Collier County High School Competition Online Only (Virtual Exhibition) ART IN BLOOM – Calusa Garden Club Thursday, April 9, 2026 Art in Bloom show in the gallery Calusa Garden Club floral designers will mirror adult student art pieces with the floral entries. Snap Crackle and POP ART! May 4-June 23, 2026 Featuring work by Abel Garcia, Gil Sanchez, Holly Manneck La Petite Galerie: Gaby Swedan (May 4-May 26, 2026) Reception May 12, 2026 5:30pm-7pm Draw The World May 4-June 23, 2026 Featuring Hope Hanley, Wendy Wagner La Petite Galerie: Gaby Swedan (May 4-May 26, 2026) Reception May 12, 2026 5:30pm-7pm Our Valued Sponsors Address 1010 Winterberry Drive Marco Island, Florida 34145, United States +1-239-394-4221 Open Hours Mon – Fri 9:00 a.m. to 4:00 p.m. (not counting special events) Follow Follow Follow Follow Follow Follow Quick Links Become A Member or Renew Your Membership Donate My Account © Marco Island Art Center | All Rights Reserved | Site Design: Kelly J Parsons Creative Services X X"
    },
    {
      "url": "https://www.marconews.com/story/news/local/2025/04/28/now-you-know-arts-org-to-roast-marco-city-manager/83248806007/",
      "text": "Now You Know: Arts org to roast city manager; city seeks applicants News Sports Life Opinion Entertainment Obituaries eNewspaper Legals Subscribe LOCAL Now You Know: Arts org to roast Marco city manager; city seeks audit applicants, more Will Watts Special to the Eagle Marco Island Center for the Arts is inviting the community to “an evening of humor, heart, and hometown celebration” during the 70th Birthday Roast of City Manager Mike McNees at 5:30 p.m., Saturday, May 31at the Arts Center Theatre in Marco Town Center. Honorary Roast Master is Hyla Crane, executive director of Marco Island Center for the Arts. The roast will feature friends, coworkers and public figures “sharing their favorite funny moments and stories about McNees, all in the spirit of good-natured fun and community pride.” Roasters include Assistant City Manager Casey Lucius, Director of Community Affairs Dan Smith, Delores Siegel, vice-chair, Parks & Recreation Advisory Committee; Maria Lamb, vice-chair, Beach & Coastal Resources Advisory Committee; longtime friend Joe Townsend, wife Hazel McNees, former City Council chair Jared Grifoni and former City Council member Becky Irwin. “This event showcases the incredible community spirit that defines Marco Island,” said Crane. “It’s a chance to honor Mike’s leadership with laughter while supporting cultural programs that benefit us all.” Tickets are $25, and seating is first come, first served. All proceeds support Marco Island Center for the Arts. Tickets and additional information are available at marcoislandart.org or by calling 239-394-4221. Marco Island seeks applicants for the Audit Advisory Committee The city clerk is accepting applications for potential candidates to fill seats on the Audit Committee through Wednesday. To qualify, individuals must be residents and registered voters of the city. Appointed individuals will be expected to attend year-round meetings, contribute to group discussions, conduct research and prepare reports. You can either apply through  the online application at cityofmarcoisland.com/bc/webform/online-advisory-board-application or submit a paper application available at City Hall, 50 Bald Eagle Dr, Marco Island. While a resume is not mandatory, it is highly recommended that candidates submit one with the application. For assistance or more information, contact City Clerk Joan Taylor at 239-389-5010 or jtaylor@cityofmarcoisland.com . Volunteers ‘Keep Collier Beautiful’ According to Keep Collier Beautiful, over 900 volunteers cleaned up litter and debris for the 2025 Great American Cleanup. This event saw a 76% increase in volunteers, from 514 to 908 registrations, compared to last year. “We typically only get this much traffic during our September cleanup, so this is a huge milestone!” reads their monthly newsletter. Through this jump in volunteers, the amount of trash bags filled and waste collected also increased by 82%. AAUW-Marco Island scholarships awarded The Marco Island Branch of the American Association of University Women held its annual scholarship luncheon on April 14, according to Jackie Childress. Following a successful fundraiser, scholarships of $2,000 each were awarded to four. They are Carla Melendez, Sophia Torres, Brittany Piersma and Josephine Torres. Additionally, $2,000 each was awarded to four high school seniors: Vania Antonio-Cavvillo, Stephanie Escobedo Ochoa, Michelle Acosta and Brigid O’Sullivan. In addition, AAUW provided a grant of $1,500 to the Big Cypress National Reserve “to help in their efforts to educate Collier County’s youth about the important environment in South Florida through their SWAMP 6th grade program,” and sponsored Julissa Ramos, Manatee Middle School, to attend a weeklong Tech Trek STEM Camp at FAU. If you have an interest in joining the Marco Island Branch of AAUW, contact Lyn Maggio, Director for Membership, linda.maggio@gmail.com , for more information. Or visit marcoisland-fl.aauw.net. More: Now You Know: Picture perfect owls; ‘Famlet’ and family chaos on Marco stage And: Goodbye snowbirds! Collier County businesses prepare to ride out the off-season Also: FHP: Driver dies after speeding car on U.S. 41 East in Naples crashes early Sunday Careers Accessibility Support Site Map Legals Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Advertise Your Business Buy and Sell Help Center Give Feedback Licensing & Reprints Facebook X eNewspaper Archives Jobs Cars Real Estate Classifieds Education Shopping 10BEST LocaliQ © 2025 www.marconews.com. All rights reserved."
    },
    {
      "url": "https://www.coastalbreezenews.com/lifestyles/entertainment/marco-art-center-presents-oh-what-a-night-dinner-and-a-show/article_c4e506ee-7b67-11ef-9d30-4f1a57f1ee76.html",
      "text": "Marco Art Center Presents  | Entertainment | coastalbreezenews.com Skip to main content You have permission to edit this article. Edit Close Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Site search Search News City Community Opinions Opinion Columnist Guest Commentaries Letters to the Editor Columnists All That Glitters Ask the CFP Ask the Life Coach Beach Boy Chronicles Law Matters Let's Talk Golf Net Notes Organized Energized Living Situationally Aware Stepping Stones The Adventures of Harley & Harper The Bookworm Sez The Jewelers Daugther Travel News Lifestyles Health Lifestyles Community Scene Entertainment Environment Sports Classifieds Calendar Public Notices Mullet Rapper About Us Contact Us Advertise Subscribe e-Editions Coastal Breeze News MIA Wave Mullet Rapper Sign Up Log In Dashboard Logout My Account Dashboard Profile Saved items Logout Menu Site search Search News City Community Clubs & Organizations Events Museums Restaurants Special Sections 25th Anniversary City of Marco Island Collier County's Centennial Celebration Opinions Opinion Columnist More Straight Talk Postcards from the Gulf of America Guest Commentaries Letters to the Editor Columnists All That Glitters Ask the CFP Ask the Life Coach Beach Boy Chronicles Law Matters Let's Talk Golf Net Notes Organized Energized Living Situationally Aware Stepping Stones The Adventures of Harley & Harper The Bookworm Sez The Jewelers Daugther Travel News Lifestyles Health Lifestyles Community Scene Entertainment Environment Sports Classifieds Calendar Public Notices Mullet Rapper Close Marco Art Center Presents \"Oh What a Night: Dinner and a Show\" Submitted Sep 26, 2024 Sep 26, 2024 0 Facebook Twitter WhatsApp SMS Email Facebook Twitter WhatsApp SMS Email Print Copy article link Save The Marco Island Center for the Arts is thrilled to announce the unveiling of its re-envisioned annual fundraising event. This season, join us for “Oh What a Night: Dinner and a Show,” a captivating evening designed to delight and inspire, set for Saturday, February 15, 2025, at the Island Country Club. Reimagined by our dedicated chairpersons, Donald and Christine Koppel and Stanley and Cynthia Springer, this year’s event promises to be a spectacular blend of entertainment and elegance. In addition to enjoying a sensational performance by “The Modern Gentlemen,” guests will indulge in exquisite cuisine, bid on prized auction items and experiences, and dance the night away. This evening will also honor the contributions of beloved Art Center supporters Michael and Vicki Hook. Event Highlights: - Entertainment by “The Modern Gentlemen”: More than a decade singing alongside the legendary Frankie Valli, these “four seasoned” outstanding vocalists formed The Modern Gentlemen. Known for their harmonious renditions of Frankie Valli and The Four Seasons, Motown, doo-wop, and other timeless tunes, The Modern Gentlemen bring a fresh twist to beloved melodies. Frankie Valli himself has lauded them, saying, “These guys are truly special! They’re the BEST singers I’ve ever worked with!” - Delicious Cuisine: Savor a gourmet dinner prepared by the chefs at Island Country Club, designed to complement the evening’s entertainment. - Auction Opportunities: Bid on exclusive items and experiences during our lively auction, supporting the Marco Island Center for the Arts. - Dancing and More: Enjoy an evening of dancing and celebration in a setting that redefines the traditional gala experience. The Marco Island Center for the Arts is committed to enhancing the cultural fabric of our community, and this event is a vital part of our mission. All proceeds from “Oh What a Night: Dinner and a Show” will support our ongoing programs and initiatives. Tickets and Sponsorship: Tickets for this memorable evening will be available for purchase soon. For sponsorship opportunities or additional information, please contact the Marco Island Center for the Arts at 239-394-4221 or visit our website at https://www.marcoislandart.org/annual-gala/ Join us for a night to remember as we celebrate the arts and community in style! Facebook Twitter WhatsApp SMS Email Print Copy article link Save Save the Date: ou Go Event: “Oh What a Night: Dinner and a Show” Date: Saturday, February 15, 2025 Time: 6:00 PM – 11:00 PM Location: Island Country Club, Marco Island, FL Tags Music Entertainment Performing Arts African-american Music Popular Music Pop Music Auction Musicology Contemporary Music Doo-wop Rhythm And Blues Sound Recording American Popular Music American Styles Of Music American Music Frankie Valli Musical Subgenres The Four Seasons (band) English-language Music Music Industry Music Of The African Diaspora Culture Recorded Music Singing Vocal Music Fundraising Arts American Musicians Songs Pop Songs Motown Mass Media Soul Music North American Music Musical Compositions Audio Works Oral Literature Dance American Pop Songs Music Mass Media American Songs Universal Music Group Music Performance North American Styles Of Music Cuisine Jersey Shore Sound Musicians From Newark, New Jersey American Rhythm And Blues Record Label Distributors Chef Albums Cooking Rhythm And Blues Songs Pop Musicians Singles Singles (music) American Music Articles Needing Attention American Folk Music Folk Music Record Labels The Arts Individual Songs Contemporary R&b Songs Blues Auctions Musicians Song Recordings Rock Music Melody Marketing Pricing Motown Artists Economics American Contemporary R&b Songs Foods Tencent Music Companies Of The United States American Rhythm And Blues Songs American Pop Musicians American Record Labels Motown People American Compositions And Recordings Marco Island, Florida Financial Markets Dance Music Contemporary R&b Universal Music Group Artists Musicians From New Jersey Warner Records Artists Mass Media Companies Of The United States Soul Music Record Labels Music Of Detroit Recording Artists Pop Albums Warner Music Group Artists Pop Record Labels Song Forms Music Theory Soul Songs Musical Form United States Musical Groups From Newark, New Jersey African Music Public Sphere Music Events Theatre Ethnic Music Jersey Shore Musical Groups American Hip Hop Songs Warner Music Group American Hip Hop Food Watchlist Articles Culture Of The African Diaspora American Soul Songs Music Videos Hip Hop Vee-jay Records Artists North American Folk Music Philanthropy American Musical Groups Sony Music The Four Seasons (band) Members Dance-pop Food And Drink Preparation Traditional Music Modernism (music) Private Stock Records Artists Musical Groups Hip Hop Songs Late Modern Period Musical Forms Fads Musical Techniques Sound Production Social Economy Collier News Swfl Collier County Marco News Marco Island Marco Island Florida Coastal Breeze News Naples Area Naples Load comments × Post a comment as Guest Emoticons [smile] [beam] [wink] [sad] [cool] [innocent] [rolleyes] [whistling] [lol] [huh] [tongue] [love] [sleeping] [yawn] [unsure] [angry] [blink] [crying] [ohmy] [scared] [sleep] [sneaky] [tongue_smile] [thumbdown] [thumbup] [censored] [happybirthday] [ban] [spam] [offtopic] [batman] [ninja] [pirate] [alien] Comment Text Cancel Post comment × Report Cancel Report Abuse × Watch this discussion. Stop watching this discussion. Watch this discussion Get an email notification whenever someone contributes to the discussion Notifications from this discussion will be disabled. Cancel Start watching Stop watching (0) comments Welcome to the discussion. Log In Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another\nperson will not be tolerated. Be Truthful. Don't knowingly lie about anyone\nor anything. Be Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person. Be Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness\naccounts, the history behind an article. Post a comment Watch this discussion. Stop watching this discussion. Sections Home News Sports Opinion Food & Entertainment Local Events Obituaries Multimedia Online Features Services Advertise with Us Subscription Services Submission Forms Classifieds Place a Classified Ad Promote Your Event Search Weather coastalbreezenews.com 1857 San Marco Road Suite 216C Marco Island, FL 34145 Phone: 239-393-4991 Email: val@coastalbreezenews.com Facebook Twitter YouTube Instagram × Browser Compatibility Your browser is out of date and potentially vulnerable to security risks. We recommend switching to one of the following browsers: Microsoft Edge Google Chrome Firefox © Copyright 2025 Coastal Breeze News 1857 San Marco Road Suite 216C, Marco Island, FL | Terms of Use | Privacy Policy Powered by BLOX Content Management System from BLOX Digital ."
    },
    {
      "url": "https://www.marcoislandart.org/festival-of-trees/",
      "text": "Festival of Trees - Marco Island Center for the Arts 1+239-394-4221 Art Center  / 1+239-784-1186 Box Office info@marcoislandart.org Facebook X Facebook X 0 Items Home About History Our Mission and Policies Board of Directors About Our Team Media and Press Artist of the Year Art Center Resources Space Time Capsule Exhibitions Exhibition Calendar Current Exhibition Gallery Reception Call To Artists Adult Education Onsite Classes Virtual Classes Instructors Policies, Terms, and Conditions Children and Family Children and Youth Children’s Summer Classes High School Art Show and Competition Family Events Resources Events Art Center Events Calendar Outdoor Events Musical Interludes MANHATTAN SHORT Annual Gala Annual Golf Tournament Marco Island Old World Christmas Bazaar Market Festival of Trees Arts Center Theatre Mainstage Theatre Productions-Individual Tickets 2025-2026 Season Tickets Group Ticket Policy Comedy Series Live Entertainment Audition Information Acting and Theatre Workshops Join and Support Support The Art Center Donate Become A Member or Renew Your Membership Become a Sponsor Purchase Engraved Bricks Volunteer! Planned Giving/Legacy Society Annual Appeal Contact Us Select Page Click Here for Festival Of Trees Submission Information Become a “Decorator” for the Marco Island Center for the Arts 2025 Festival of Trees Marco Island Center for the Arts is looking for creative individuals, businesses, groups, and organizations to help increase the holiday spirit by decorating a tree for the Art Center’s annual Festival of Trees. The Festival of Trees is a holiday event at Marco Island Center for the Arts and dollars raised benefit the nonprofit’s classes for children and adults, and art exhibitions and events. Founded in 2014 by dedicated Marco Island volunteer and art supporter Mr. Dave Rice, the Festival of Trees is a fundraising and community goodwill event. The 11th annual Festival of Trees is December 2– December 5. The Festival offers students, individuals, families, businesses, clubs, and organizations a unique opportunity to participate in this annual holiday fundraiser. “We are excited to have people showcase their creative talent, providing a beautiful atmosphere for families that consider the Festival of Trees the official start to the holiday season” said Dave Rice, Festival of Trees Founder. How it Works Three foot trees or smaller can be decorated with any style or theme you choose, so let your imagination run wild! Tree decorators will be responsible for providing a tree and all lighting and decorating materials. Electrical outlets are available. A limited number of spaces are available. Register early. There is no registration fee! Registration forms are available at the Art Center or can be downloaded at www.marcoislandart.org There will be a silent auction for the trees. This is a joint fundraising effort with the decorator and Marco Island Center for the Arts. Each will receive 50% of the net proceeds. You can also elect to donate 100% of the proceeds to Marco Island Center for the Arts. Visitors will be able to vote for their favorite tree. The People’s Choice Award will be announced on December 4, 2025. 2025 Festival of Trees Schedule: November 24   FINAL DAY to Submit Registration Forms. DUE BY: 4 pm December 1   9:00 am – 4:00 pm  Installation of the trees December 2 -December 4 9:00 am – 4:00 pm  Festival of the Trees and Tree Silent Auction December 4 4:00 pm -Silent Auction Closes/Winners Notified December 5 9:00 am – 4:00 pm Tree pick up. All trees must be paid for and picked up. Unsold trees must also be picked up by the Tree Decorator. Please return registration form to Marco Island Center for the Arts, 1010 Winterberry Dr. Marco Island or email to info @marcoislandart.org. Questions? Call 239-394-4221 Our Valued Sponsors Address 1010 Winterberry Drive Marco Island, Florida 34145, United States +1-239-394-4221 Open Hours Mon – Fri 9:00 a.m. to 4:00 p.m. (not counting special events) Follow Follow Follow Follow Follow Follow Quick Links Become A Member or Renew Your Membership Donate My Account © Marco Island Art Center | All Rights Reserved | Site Design: Kelly J Parsons Creative Services X X"
    },
    {
      "url": "https://www.marcoislandart.org/events-calendar/",
      "text": "Events Calendar - Marco Island Center for the Arts 1+239-394-4221 Art Center  / 1+239-784-1186 Box Office info@marcoislandart.org Facebook X Facebook X 0 Items Home About History Our Mission and Policies Board of Directors About Our Team Media and Press Artist of the Year Art Center Resources Space Time Capsule Exhibitions Exhibition Calendar Current Exhibition Gallery Reception Call To Artists Adult Education Onsite Classes Virtual Classes Instructors Policies, Terms, and Conditions Children and Family Children and Youth Children’s Summer Classes High School Art Show and Competition Family Events Resources Events Art Center Events Calendar Outdoor Events Musical Interludes MANHATTAN SHORT Annual Gala Annual Golf Tournament Marco Island Old World Christmas Bazaar Market Festival of Trees Arts Center Theatre Mainstage Theatre Productions-Individual Tickets 2025-2026 Season Tickets Group Ticket Policy Comedy Series Live Entertainment Audition Information Acting and Theatre Workshops Join and Support Support The Art Center Donate Become A Member or Renew Your Membership Become a Sponsor Purchase Engraved Bricks Volunteer! Planned Giving/Legacy Society Annual Appeal Contact Us Select Page Upcoming Events for Marco Island Center for the Arts Arts Center Theatre production listings click here Venturino Comedy Series listings click here Date Title Jump Months Current Month January February March April May June July August September October November December 2023 2024 2025 2026 2027 3 Event Name Mon Tue Wed Thu Fri Sat Sun Our Valued Sponsors Address 1010 Winterberry Drive Marco Island, Florida 34145, United States +1-239-394-4221 Open Hours Mon – Fri 9:00 a.m. to 4:00 p.m. (not counting special events) Follow Follow Follow Follow Follow Follow Quick Links Become A Member or Renew Your Membership Donate My Account © Marco Island Art Center | All Rights Reserved | Site Design: Kelly J Parsons Creative Services X X"
    },
    {
      "url": "https://www.marcoislandart.org/events/",
      "text": "Events - Marco Island Center for the Arts 1+239-394-4221 Art Center  / 1+239-784-1186 Box Office info@marcoislandart.org Facebook X Facebook X 0 Items Home About History Our Mission and Policies Board of Directors About Our Team Media and Press Artist of the Year Art Center Resources Space Time Capsule Exhibitions Exhibition Calendar Current Exhibition Gallery Reception Call To Artists Adult Education Onsite Classes Virtual Classes Instructors Policies, Terms, and Conditions Children and Family Children and Youth Children’s Summer Classes High School Art Show and Competition Family Events Resources Events Art Center Events Calendar Outdoor Events Musical Interludes MANHATTAN SHORT Annual Gala Annual Golf Tournament Marco Island Old World Christmas Bazaar Market Festival of Trees Arts Center Theatre Mainstage Theatre Productions-Individual Tickets 2025-2026 Season Tickets Group Ticket Policy Comedy Series Live Entertainment Audition Information Acting and Theatre Workshops Join and Support Support The Art Center Donate Become A Member or Renew Your Membership Become a Sponsor Purchase Engraved Bricks Volunteer! Planned Giving/Legacy Society Annual Appeal Contact Us Select Page ERROR: Please select a event archive page in eventON Settings > Events Paging > Select Events Page Our Valued Sponsors Address 1010 Winterberry Drive Marco Island, Florida 34145, United States +1-239-394-4221 Open Hours Mon – Fri 9:00 a.m. to 4:00 p.m. (not counting special events) Follow Follow Follow Follow Follow Follow Quick Links Become A Member or Renew Your Membership Donate My Account © Marco Island Art Center | All Rights Reserved | Site Design: Kelly J Parsons Creative Services X X"
    },
    {
      "url": "https://www.marcoislandart.org/the-great-create/",
      "text": "The Great Create - Marco Island Center for the Arts 1+239-394-4221 Art Center  / 1+239-784-1186 Box Office info@marcoislandart.org Facebook X Facebook X 0 Items Home About History Our Mission and Policies Board of Directors About Our Team Media and Press Artist of the Year Art Center Resources Space Time Capsule Exhibitions Exhibition Calendar Current Exhibition Gallery Reception Call To Artists Adult Education Onsite Classes Virtual Classes Instructors Policies, Terms, and Conditions Children and Family Children and Youth Children’s Summer Classes High School Art Show and Competition Family Events Resources Events Art Center Events Calendar Outdoor Events Musical Interludes MANHATTAN SHORT Annual Gala Annual Golf Tournament Marco Island Old World Christmas Bazaar Market Festival of Trees Arts Center Theatre Mainstage Theatre Productions-Individual Tickets 2025-2026 Season Tickets Group Ticket Policy Comedy Series Live Entertainment Audition Information Acting and Theatre Workshops Join and Support Support The Art Center Donate Become A Member or Renew Your Membership Become a Sponsor Purchase Engraved Bricks Volunteer! Planned Giving/Legacy Society Annual Appeal Contact Us Select Page THE GREAT CREATE BE AN ARTIST AT MARCO ISLAND CENTER FOR THE ARTS Take your group on a journey into the world of fine arts at Marco Island Center for the Arts, and join one of the world’s foremost mixed media artists, Marjorie Pesek, in creating your own fine art masterpiece. Pesek will share the technique that has garnered her placement in private and gallery collections in the United States and in Europe. This layered imagery technique offers group members the opportunity to capture their inner artists, tell a story and create a masterpiece-regardless of their level of artistic skill. Prepare to be moved by this opportunity to generate your own portrait of this memorable experience in the fine arts world. Please submit your date interest in the form below or call 239-394-4221 and ask for Patricia Mills. January 25, 2022 10am-12:30 March 22, 2022 10am-12:30 May 24, 2022 10am-12:30 COST: $70 per person DETAILS: • No prior art knowledge is necessary • No prior art knowledge is necessary • Booking required in advance • Ideal for groups of 10-15 DURATION: 2.5 hours FOR BOOKING AND MORE INFORMATION Fill OUT THE FORM BELOW Notice: JavaScript is required for this content. Developed in partnership with Our Valued Sponsors Address 1010 Winterberry Drive Marco Island, Florida 34145, United States +1-239-394-4221 Open Hours Mon – Fri 9:00 a.m. to 4:00 p.m. (not counting special events) Follow Follow Follow Follow Follow Follow Quick Links Become A Member or Renew Your Membership Donate My Account © Marco Island Art Center | All Rights Reserved | Site Design: Kelly J Parsons Creative Services X X"
    },
    {
      "url": "https://www.marcoislandart.org/events/manhattan-short-film-festival/",
      "text": "MANHATTAN SHORT Film Festival - Marco Island Center for the Arts 1+239-394-4221 Art Center  / 1+239-784-1186 Box Office info@marcoislandart.org Facebook X Facebook X 0 Items Home About History Our Mission and Policies Board of Directors About Our Team Media and Press Artist of the Year Art Center Resources Space Time Capsule Exhibitions Exhibition Calendar Current Exhibition Gallery Reception Call To Artists Adult Education Onsite Classes Virtual Classes Instructors Policies, Terms, and Conditions Children and Family Children and Youth Children’s Summer Classes High School Art Show and Competition Family Events Resources Events Art Center Events Calendar Outdoor Events Musical Interludes MANHATTAN SHORT Annual Gala Annual Golf Tournament Marco Island Old World Christmas Bazaar Market Festival of Trees Arts Center Theatre Mainstage Theatre Productions-Individual Tickets 2025-2026 Season Tickets Group Ticket Policy Comedy Series Live Entertainment Audition Information Acting and Theatre Workshops Join and Support Support The Art Center Donate Become A Member or Renew Your Membership Become a Sponsor Purchase Engraved Bricks Volunteer! Planned Giving/Legacy Society Annual Appeal Contact Us Select Page MANHATTAN SHORT Film Festival Marco Island Center for the Arts 1010 Winterberry Drive, Marco Island 05 oct 5:30 pm MANHATTAN SHORT Film Festival Event Details We are proud to announce that we are partnering with MANHATTAN SHORT and bringing the 26th Annual MANHATTAN SHORT Film Festival to Marco Island Center for the Arts and Arts Event Details We are proud to announce that we are partnering with MANHATTAN SHORT and bringing the 26 th Annual MANHATTAN SHORT Film Festival to Marco Island Center for the Arts and Arts Center Theatre in October, 2023. MANHATTAN SHORT was started in September, 1998, by Nicholas Mason. Nicholas mounted a screen to the side of a truck on Mulberry St. in New York City and projected 16 short films to a crowd of around 300 New Yorkers, who watched from the street. From that first showing, MANHATTAN SHORT Film Festival has grown to over 100,000 film lovers in over 500 cities across six continents who gather for one reason…to view and vote on the Finalists’ Films in the 26th Annual MANHATTAN SHORT Film Festival. MANHATTAN SHORT is not a touring Festival; rather, it is an instantaneous celebration that occurs simultaneously across the globe, bringing great films to great venues and allowing the audiences to select their favorites. The Film Festival experience is about getting great works in front of as many eyes as possible, and MANHATTAN SHORT offers the truly ultimate platform — one that sees its films screened in Sydney, Mumbai, Moscow, Vienna, and Cape Town, to cinemas in all fifty states of the United States and beyond. This year we are extremely excited to be bringing this Film Festival to Marco Island and giving S.W. Florida a chance to vote on a potential 2024 Oscar winning Short Film, as every film selected for MANHATTAN SHORT is automatically qualified for the 2024 Oscars. We have two dates that we will be showing the MANHATTAN SHORT films, Thursday, October 5, 2023, at 5:30 PM, and Sunday, October 8, 2023 at 3:00 PM. Tickets can be purchased on our website www.marcoislandart.org and are $10 for Art Center members and $15 for non-members. YOU GET TO BE THE JUDGE! Upon entry at all participating venues, festival attendees are handed a Voting Card and an Official Program and asked to vote for the ONE Film and Actor they feel should win. Votes are tallied by each host venue then emailed to our NYC headquarters. Please join us at Marco Island Center for the Arts at 1010 Winterberry Dr., Marco Island, FL and be a part of ONE WORLD – ONE WEEK – ONE FESTIVAL – The 26th Annual MANHATTAN SHORT Film Festival! more Time October 5, 2023 5:30 pm (GMT-04:00) Location Marco Island Center for the Arts 1010 Winterberry Drive, Marco Island Other Events Calendar GoogleCal Purchase Tickets Tickets are not available for sale any more for this event! View Cart Checkout Get Directions Our Valued Sponsors Address 1010 Winterberry Drive Marco Island, Florida 34145, United States +1-239-394-4221 Open Hours Mon – Fri 9:00 a.m. to 4:00 p.m. (not counting special events) Follow Follow Follow Follow Follow Follow Quick Links Become A Member or Renew Your Membership Donate My Account © Marco Island Art Center | All Rights Reserved | Site Design: Kelly J Parsons Creative Services X X"
    },
    {
      "url": "https://www.fortheloveofcatsfl.com/contact",
      "text": "Contact | For the Love of Cats | Marco Island, Florida top of page 239-642-8674 239-642-8674 239-642-8674 239-642-8674 239-642-8674 Home About Our Impact, Mission & Vision Our Team Testimonials Adopt Courtesy Listing Form Programs Support Us Donate Online Now Join our Monthly Giving Program Ways to Give Matching Gifts Donor Advised Fund Planned Giving Sponsors & Partners Volunteer Volunteer Application Purrs of Gratitude Donor Wall Press Blog Hurricane Planning Guide For Pet Owners Events Purr Ball 2025 Marco Island Farmer's Market Purrs & Paddles Pickleball 2026 Contact Join our Mewsletter More Use tab to navigate through the menu items. Contact Our Team CONNECT WITH US TODAY 239-642-8674 Mailing Address: P.O. Box 10248 Naples, FL 34101 Cassandra Nocifora Program Manager cassandran@fortheloveofcatsfl.com I would like to attach: Images Videos Upload File Upload supported file (Max 15MB) Upload Video File Upload supported file (Max 15MB) Upload File Upload supported file (Max 15MB) Upload Video File Upload supported file (Max 15MB) Send Thanks so much for contacting For the Love of Cats! We will respond to your message as soon as possible. don’t miss out on the latest cat news in your community - sign up today Click Here to Join Our Mailing List! Newsletter donate Volunteer 239-642-8674 support@fortheloveofcatsfl.com Mailing Address: P.O. Box 10248 Naples, FL 34101 For the Love of Cats, Inc. is a registered 501(c)(3) non-profit organization dedicated to saving the lives of cats in need in Collier County. Registration # 17053037023026 | FEIN# 20-4188963 Copyright © 2024. For the Love of Cats, Inc. All rights reserved. bottom of page"
    },
    {
      "url": "https://www.marcoislandart.org/",
      "text": "Home - Marco Island Center for the Arts 1+239-394-4221 Art Center  / 1+239-784-1186 Box Office info@marcoislandart.org Facebook X Facebook X 0 Items Home About History Our Mission and Policies Board of Directors About Our Team Media and Press Artist of the Year Art Center Resources Space Time Capsule Exhibitions Exhibition Calendar Current Exhibition Gallery Reception Call To Artists Adult Education Onsite Classes Virtual Classes Instructors Policies, Terms, and Conditions Children and Family Children and Youth Children’s Summer Classes High School Art Show and Competition Family Events Resources Events Art Center Events Calendar Outdoor Events Musical Interludes MANHATTAN SHORT Annual Gala Annual Golf Tournament Marco Island Old World Christmas Bazaar Market Festival of Trees Arts Center Theatre Mainstage Theatre Productions-Individual Tickets 2025-2026 Season Tickets Group Ticket Policy Comedy Series Live Entertainment Audition Information Acting and Theatre Workshops Join and Support Support The Art Center Donate Become A Member or Renew Your Membership Become a Sponsor Purchase Engraved Bricks Volunteer! Planned Giving/Legacy Society Annual Appeal Contact Us Select Page Art Center Open Hours Location: 1010 Winterberry Dr. 239-394-4221 Mon-Fri: 9. a.m. – 4 p.m. Special Event Hours When Applicable Take a THRESHOLD 360 Tour of Marco Island Center for the Arts and Arts Center Theatre Arts Center Theatre Location: 1089 N Collier Blvd. (Marco Town Center) Box Office Phone: 239-784-1186 Open Hours: Wednesday-Sunday 90 Minutes prior to showtimes Exhibitions Current Exhibitions Upcoming Exhibition Calendar Arts Center Theatre Upcoming Shows What We Do Classes And Workshops Events Arts Center Theatre Support The Center Coming Up Upcoming Classes Current Month Marco Island Center for the Arts 1010 Winterberry Drive, Marco Island 16 sep 9:30 am 12:30 pm Collage: Pick and Create - Marjorie Pesek - PES-910-COL View All Classes Coming Up Upcoming Theatre Events Click Here to see upcoming Theatre Productions Click Here for Venturino Comedy Series FOLLOW US Follow Follow Follow Follow Follow Get The Latest News Sign up for our Newsletter below... Success! First Name Last Name Email Subscribe Our Valued Sponsors Address 1010 Winterberry Drive Marco Island, Florida 34145, United States +1-239-394-4221 Open Hours Mon – Fri 9:00 a.m. to 4:00 p.m. (not counting special events) Follow Follow Follow Follow Follow Follow Quick Links Become A Member or Renew Your Membership Donate My Account © Marco Island Art Center | All Rights Reserved | Site Design: Kelly J Parsons Creative Services X X"
    },
    {
      "url": "https://www.coastalbreezenews.com/news/community/art-center-honors-artists-of-the-year/article_199c99ef-e1d1-4560-8a70-324b0ec37367.html",
      "text": "Please wait while we attempt to load the requested page"
    },
    {
      "url": "https://www.projectaccessnow.org/about-us/staff",
      "text": "Project Access NOW Staff: Leadership & Dedicated Team Members | Portland, OR About Mission Learn about how and why we do what we do. People Get to know our staff, leadership, and board. Partners Learn who partners with us to achieve our mission. Impact Stories of success from clients and partners. News Keep up with the latest from Project Access NOW. View our Strategic Plan Click Here Get Involved Donate Your donations will support our efforts. Volunteer Give your time and energy to help people receive care they need. Board &Â Committee Service Become a core member of the leadership team. Employment Find out about current employment opportunities. Contact Get in touch with Project Access NOW. Seeking services? Click Here Refer a client Get Help About Mission People Partners Impact News Programs Donated Care Insurance Support Community Health Community Assistance Advocacy Get Involved Donate Volunteer Board & Committee Service Employment Contact In need of services? Click here Our Staff Leadership Executive Team Greg Sutliff âVice President Finance they/them Omar Al Rais, MBA, MBChB Senior Vice President Operations he/him/his Rebecca Raab, MS Vice President Development and Communications she/her/hers Tracy Carver, MPA President and CEO she/her/hers Leadership Joseph Nicoletti Director IT and Strategic Projects he/him/his Myrna Valdez Director Programs and People she/her/hers/ella Program Management Brennan Universe Manager Executive Assistant and Board Affairs they/them Chloe Dominguez Manager Program and Office Logistics she/her/hers Emma Holland Manager Operations she/her Erika Valdez Manager Donated Care (DC) she/her/hers Jina Kalberg Manager Finance she/her/they/them Julie Chu, PMP Senior Project Manager Strategic Projects (SP) she/her/hers Peter Merritt Manager Impact and Advocacy he/him Ranisha Isom, BS, CAC, CHW Manager Insurance Enrollment and Payment Support she/her/hers Sandra Rivera Manager Community Assistance Program (CAP) she/her/hers/ella We're hiring! Check out our employment opportunities now View Open Positions Subscribe to Updates Join our newsletter to stay up-to-date on news and events. About Mission People Partners Impact Annual Reports News Get Involved Donate Volunteer Employment Contact Resources Social Services Insurance Appointment Client Referral Follow us Facebook Instagram LinkedIn © Project Access NOW. All rights reserved. Privacy Policy Terms of Service Cookies Policy Site Map"
    }
  ]
}