{
  "fuentes": [
    {
      "url": "https://www.marcuspointegc.com/instruction/",
      "email": "lauren@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/instruction/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/leagues/",
      "email": "lauren@marcuspointegc.co"
    },
    {
      "url": "https://www.marcuspointegc.com/leagues/",
      "email": "lauren@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/leagues/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "email": "info@belfairsgolfclub.co.uk"
    },
    {
      "url": "https://www.visitpensacola.com/directory/marcus-pointe-golf-club/",
      "email": "enews@visitpensacola.com"
    },
    {
      "url": "https://www.visitpensacola.com/directory/marcus-pointe-golf-club/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/memberships/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/join-e-club/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/meet-us/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.baypointecc.com/meet-the-staff/",
      "email": "kyle@baypointecc.com"
    },
    {
      "url": "https://www.baypointecc.com/meet-the-staff/",
      "email": "office@baypointecc.com"
    },
    {
      "url": "https://www.baypointecc.com/meet-the-staff/",
      "email": "randy@baypointecc.com"
    },
    {
      "url": "https://www.baypointecc.com/meet-the-staff/",
      "email": "stephen@baypointecc.com"
    },
    {
      "url": "https://www.baypointecc.com/meet-the-staff/",
      "email": "todd@baypointecc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/contact-us/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/course-information/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/tee-times/",
      "email": "rbensley@marcuspointegc.com"
    },
    {
      "url": "https://www.marcuspointegc.com/",
      "email": "rbensley@marcuspointegc.com"
    }
  ],
  "mails": [
    "enews@visitpensacola.com",
    "info@belfairsgolfclub.co.uk",
    "kyle@baypointecc.com",
    "lauren@marcuspointegc.co",
    "lauren@marcuspointegc.com",
    "office@baypointecc.com",
    "randy@baypointecc.com",
    "rbensley@marcuspointegc.com",
    "stephen@baypointecc.com",
    "todd@baypointecc.com"
  ],
  "nombre_sitio": "marcuspointegc.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.marcuspointegc.com/instruction/",
      "text": "Instruction - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Instruction Professional Golf Instruction Assistant Golf Professional Lauren Lamm 2-Time All-American at UWF Ranked 3rd in Nation in Division II All-Decade 1st Team Gulf South Conference Level 1 Certified First Tee Coach Level 2 PGA Associate Lauren’s Lesson Prices 1 Hour Adult Lesson: $100.00 3 Lesson Package: $250.00 1 Hour Member Lesson: $70.00 Playing Lesson: $185.00 (Greens Fees Are Included) Junior Golf Lesson: $70.00 (High School & Under) Short Game Lesson : $60.00 To book a lesson with Lauren Lamm, please contact her at: Cell: (850) 860-1212 Email: lauren@marcuspointegc.com First Tee Registrations: https://firsttee.my.site.com/parentRegistration/s/add-to-cart?website=www.firstteegulfcoast.org&language=en_US&session=a0HUH000007P6m9 Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcuspointegc.com/leagues/",
      "text": "Leagues - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Leagues Marcus Pointe Ladies Golf Association MPLGA plays every Tuesday at 9:00 A.M. League play begins September 1st, and runs through June 30th. All ages and handicaps are welcome to join in play! Yearly dues are $45.00. Interested? Please contact Jan Von Holten at jvhrdh@gmail.com or (702)-349-3911 . Thursday Night League The Thursday Night League will resume in March of 2024. It is a two-person team with rotating formats and prizes weekly. Each time you play, you accumulate points, and at the last event, there will be an awards cookout and prizes. It’s a great time to relax, play a little golf, and have some FUN!! We here at Marcus Pointe Golf Club, are “Putting the fun back in golf!” Click Here For League Website → lauren@marcuspointegc.c om Couples Night League The Couples Night League will resume in the spring of 2024. Format and start times vary throughout the season. Contact the Pro Shop for more information at 850-484-9770, Ext. #1. lauren@marcuspointegc.co m Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.belfairsgolfclub.co.uk/contact-us",
      "text": "Contact Us | Belfairs Golf Club :: Essex Members Login Welcome Visitors Information Green Fees Membership Safeguarding Adult Safeguarding Policy Children & Young Person Safeguarding Members & Visitors Code of Conduct Equality, Diversity & Inclusion Policy Club Disciplinary Regulations Golf The Course Scorecard Tour of the Course Local Rules General Club Noticeboard Clubhouse Social Programme Clubhouse Noticeboard Charity Page Dress Code R & A Club History Course Conditions Pro Shop Members Mens Captain's Welcome Mens Noticeboard Mens Competition News Mens Match Overview Ladies Ladies Captain's Welcome Ladies Noticeboard Ladies Club Competition Overview Ladies Match Overview Mixed Mixed Club Competition Overview Mixed Match Overview Seniors Seniors Welcome Seniors Noticeboard Seniors Club Competition Overview Seniors Match Overview Juniors Juniors Welcome Juniors Noticeboard Juniors Club Competition Overview Juniors Match Overview Club Gallery Honours Board Mens Honours Board Ladies Honours Board Seniors Honours Board Juniors Honours Board Members Only Diary Map/Directions Contact Us Recent Site Updates CAPTAIN'S DAY: July 6th 24-Jul-2025 13:16 LADIES CAPTAIN'S DAY: June 26th 24-Jul-2025 12:43 Club Gallery 24-Jul-2025 12:40 Contact Us Belfairs Golf Club, Eastwood Road North, Leigh-on-Sea, Essex, SS9 4LR Should you have any questions or comments please feel free to get in touch. You can use the online contact form below, where your message will be dealt with as appropriate, or alternatively contact us on the telephone numbers below. Honorary Secretary , Peter Mahoney: Tel: 01702 526 911 You may complete this form to send an email directly to Belfairs Golf Club. Alternatively, you can send an email to the following email address: info@belfairsgolfclub.co.uk . Contact Form Name Email Phone Subject **Please select an option** Clubhouse General Membership Members Website Account Request a Handicap Certificate Visitor Message Please do not provide anything sensitive here, like health details, or your credit card number. Verification We do not support SPAM and we would never sell your information to anyone. Any correspondence is strictly confidential. We will only use the above information to contact you about your query. Address Belfairs Golf Club Eastwood Road North Leigh-on-Sea Essex SS9 4LR Contact phone: 01702 526 911 email: info@belfairsgolfclub.co.uk Tee Times phone: 01702 525 345 Links RSS Feed Cookie and Privacy Contact Us Map/Directions Copyright © Belfairs Golf Club , 2011-2025. All Rights Reserved. Website Design and Cloud Hosting by Uxello. Website System - Golf Club CMS"
    },
    {
      "url": "https://www.visitpensacola.com/directory/marcus-pointe-golf-club/",
      "text": "Marcus Pointe Golf Club | Visit Pensacola Skip to content logo 0 Saved 80 ° F Plan Your Way to Beach™ Navigation logo Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Home Marcus Pointe Golf Club Share About Us\n\nOur golf course in Pensacola, Florida sits on 600 acres of rolling woodlands with convenience to beautiful Gulf Coast beaches. Created by Earl Stone, this classic course boasts natural beauty and maximum playability. We offer professional golf lessons and a casual dining experience. Marcus Pointe Golf Club, while a great value, is one of the top golf facilities along the Gulf Coast. Meeting Space Meeting Space Largest Room: 1500 sq. ft. Meeting Rooms: 1 Classroom Capacity: 42 Reception Capacity: 75 Banquet Capacity: 65 Theater Capacity: 45 Marcus Pointe Golf Club 2500 Oak Pointe Drive Pensacola, FL 32505 (850) 484-9770 Save Website Email Events Save October 3 Northeast Sertoma Charity Classic golf event West Pensacola North Pensacola Hello, fellow Pensacolans as well as those living and/or visiting the Gulf Coast Area! NE Pensacola Sertoma is hosting the Northeast Sertoma Charity Classic golf event in October, 2025. All proceeds will benefit the Gulf Coast Kids House. This will be an exciting day with food, drinks, and outdoor fun. Whether participating as a golf team or purely a spectator, this will prove to be a great time for all and provide a boost for a very worthy cause. (850) 484-9770 Learn More Northeast Sertoma Charity Classic golf event 2500 Oak Pointe Dr Pensacola, Florida 32505 Learn More Open in Google Maps Map Beaches < back Pensacola Beach Perdido Key National Seashore Beach Safety Dog Beach Public Beach Access Things to Do < back Outdoors History & Heritage Arts & Culture Shopping Entertainment & Nightlife Amusement Parks Family Fun Tours Events < back Events This Week Art & Culture Live Music Parade Routes & Information Holidays Signature Events Submit an Event Places to Stay < back Hotels Vacation Rentals Bed and Breakfasts Campgrounds and RV Parks Food and Drink < back Seafood Sweet Treats Beach Restaurants Bars Breweries Downtown Waterfront Dining Coffee Shops Breakfast & Brunch Happy Hour Celebrating 50 Years of Bushwackers Shopping Plan Your Trip < back Getting Here Newsletter Signup Insider's Guide Travel Deals Visitor Centers Neighborhoods Get the App Accessible Pensacola Military Trip Planning and Resources Pensacola Trip Itineraries Seasonal Fun Blog About Visit Pensacola Groups Sports Weddings Media Visit Pensacola 1401 E. Gregory Street Pensacola, Florida 32502 Visitor Center Locations Contact Us (800) 874-1234 enews@visitpensacola.com logo Request Guide Email Signup Blog Get the App Become A Partner Advertising Opportunities Partner Login Privacy Policy ©2025 Visit Pensacola Florida. All Rights Reserved. This website uses cookies to enhance your user experience on the website. Learn more. Accept Experience Builder Quick Search logo Expanded Search Location Map"
    },
    {
      "url": "https://www.marcuspointegc.com/memberships/",
      "text": "Memberships - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Memberships FOR MEMBERSHIP INFORMATION, CALL 850.484.9770 Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Specific Info or Remarks Submit Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcuspointegc.com/join-e-club/",
      "text": "Join E-Club - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Join E-Club Want a Free Greens Fee for your birthday? Sign up here! You do not have to use this on your exact birthday–you have a window of 10 days before or after your birthday. Free Greens Fee for your birthday is valid weekdays anytime, weekends after 2pm. Winter Birthday? No worries! If your birthday is between Nov 1 and March 30, you have until April 30 to use your Free Greens Fee. Please bring your license with you for verification when you check in for your round. Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcuspointegc.com/meet-us/",
      "text": "Meet Us! - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Meet Us! Admin istrative Staff Randy Bensley, PGA General Manager Lauren Lamm Assistant Golf Professional Debbie Lewis Office Administrator Golf Shop Staff Kevin Konopacki Pro Shop Attendant John Nolan Pro Shop Attendant Kenny Anderson Pro Shop Attendant Maintenance Staff Tyler Mcmellon Superintendent Dillan O’Connor Assistant Superintendent Noah Peterson Assistant Superintendent The Grille at Marcus Pointe Golf Club Mateo Zaldana Line Cook Timothy Wells Food & Beverage Manager Jordan Wilkinson Line Cook Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.baypointecc.com/meet-the-staff/",
      "text": "Meet Our Staff - Bay Pointe Country Club Skip to primary navigation Skip to main content Skip to primary sidebar Facebook Instagram Twitter Member Tee Times Guest Tee Times Call Us Today : (601) 829-1862 Book Tee Times Bay Pointe Country Club Welcome to Bay Pointe Country Club Home Tee Times Public Tee Times Member Tee Times Contact Directions E-Club LOYALTY REWARDED Employment GOLF CART WAIVER AND LIABILITY FORM About About Us Course Photos GPS Instruction Meet Our Staff Rates Scorecard Tips Videos Amenities Amenities The 19th Hole Grille Practice Facilities Pro Shop Trackman Indoor Simulator Mr. B’s Restaurant & Bar Learn Juniors Junior Golf 2025 FALL JUNIOR LEAGUE ⛳️ Little Gator’s Club SUMMER GOLF CAMPS SUMMER KIDS GOLF CLINICS U.S. Kids Gold Star Program Memberships Events Events Calendar Event Planning Event Hosting Corporate Outings Private Events Online Store Meet Our Staff Todd Wright Former Class A PGA, General Manager |  Contact Todd at (601) 850-7824 or email todd@baypointecc.com Kyle Boteler Director of Golf, Marketing & Media, Director of Junior Golf |  Contact Kyle at (601) 540-6106, or email kyle@baypointecc.com Stephen Robertson Golf Course Superintendent, Director of Agronomy | Contact Steven at stephen@baypointecc.com Brent Belton Director of Instruction at the Brent Belton Golf Academy.  Contact Brent at (601) 951-3637, or email brentbelton59@gmail.com Randy Smith Club Manager |   Contact Randy at (601) 940-7089 or email randy@baypointecc.com Primary Sidebar Toggle Sidebar Contact Form Please enable JavaScript in your browser to complete this form. Name: Email: Message: Phone No.: Phone No.: Message: Subject: Submit Page Footer Contact Us Address : 800 Bay Pointe Drive, Brandon, MS 39047 Email : office@baypointecc.com Phone : (601) 724-1408 Bay Pointe Country Club | 800 Bay Pointe Drive, Brandon, MS 39047 | (601) 724-1408 Copyright © 2025 Bay Pointe Country Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcuspointegc.com/contact-us/",
      "text": "Contact Us - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Contact Us 850.484.9770 Marcus Pointe Golf Club 2500 Oak Pointe Drive Pensacola, FL, 32505 rbensley@marcuspointegc.com Hours Of Operation OPEN: 7:00 A.M. Breakfast: 7:00 A.M. Through 10:30 A.M. Lunch: 10:30 A.M. Through 2:30 P.M. Bar: 7:00 A.M. Through 5:00 P.M. Send Us A Message Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Specific Info or Remarks Submit Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcuspointegc.com/course-information/",
      "text": "Course Information - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Course Information About Us Our golf course in Pensacola, Florida sits on 600 acres of rolling woodlands with convenience to beautiful Gulf Coast beaches. Created by Earl Stone, this classic course boasts natural beauty and maximum playability. We offer professional golf lessons and a casual dining experience. Marcus Pointe Golf Club, while a great value, is one of the top golf facilities along the Gulf Coast. Scorecard Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcuspointegc.com/tee-times/",
      "text": "Tee Times - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club Tee Times Sorry, the Tee-Times could not be displayed at this time. Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    },
    {
      "url": "https://www.marcuspointegc.com/",
      "text": "Home - Marcus Pointe Golf Club Skip to primary navigation Skip to main content Facebook Instagram Join Our Team Event Calendar Join E-Club Marcus Pointe Golf Club Home Tee Times Course Details Course Information Rates Leagues Agronomy A Broken Tee at Marcus Pointe Golf Club Events Event Calendar Special Events Tournament & Event Request Memberships Membership Info Member Statements Member Tee Times Meet Us! Instruction Contact Contact Us Join E-Club welcome to Marcus pointe Golf club Book Now Learn More Join Us For Weekly Fun! Join us for an exciting evening of Trivia Night on Wednesday from 6 PM to 8 PM! This is a great opportunity to meet new friends, enjoy delicious food, and savor a refreshing drink at the bar—all while challenging yourself with some fun trivia questions. This event is open to everyone, so feel free to bring a friend, family member, or special someone! To stay up-to-date with what’s happening at the golf club, follow us on Facebook: Facebook More than just a golf club Our golf course in Pensacola, Florida sits on 600 acres of rolling woodlands with convenience to beautiful Gulf Coast beaches. Created by Earl Stone, this classic course boasts natural beauty and maximum playability. We offer professional golf lessons and a casual dining experience. Marcus Pointe Golf Club, while a great value, is one of the top golf facilities along the Gulf Coast. To book a tee time, please call the proshop at (850) 484-9770, extension 1 . Call Today What to Expect Explore the Course TEE TIMES Tee times are now available up to 7 days in advance. Book Now MEMBERSHIP Take your love of the game to the next level! Member Info UPCOMING EVENTS Stay up to date with upcoming events at the club. Calendar JOIN THE CLUB MEMBERSHIP HAS ITS PRIVILEGES Score savings and exclusive offers by becoming a member. For more information regarding membership you can contact the golf shop, at 850.484.9770 or online. Learn More Excellent course, very well maintained and some nice challenging holes. The views are amazing and the course play is challenging but enjoyable. They offer military and first responders discounts which is a plus. – JIMMIE RODGERS UPCOMING EVENTS AT MARCUS POINTE Event Calendar play the round of your life Book Now Page Footer Contact Us Address : 2500 Oak Pointe Drive, Pensacola, FL 32505 Email : rbensley@marcuspointegc.com Phone : (850) 484-9770 Marcus Pointe Golf Club | 2500 Oak Pointe Drive, Pensacola, FL 32505 | (850) 484-9770 Copyright © 2025 Marcus Pointe Golf Club All Rights Reserved. Powered by"
    }
  ]
}