{
  "query": "margaritavillehollywoodbeachresort.com email",
  "fuentes": [
    {
      "url": "https://www.margaritavillehollywoodbeachresort.com/",
      "email": "info@mhbr.com"
    },
    {
      "url": "https://chamber.hollywoodchamber.org/list/member/margaritaville-hollywood-beach-resort-11146",
      "email": "information@hollywoodchamber.org"
    },
    {
      "url": "https://www.margaritavillehollywoodbeachresort.com/specials",
      "email": "reservations@mhbr.com"
    }
  ],
  "mails": [
    "info@mhbr.com",
    "reservations@mhbr.com",
    "information@hollywoodchamber.org"
  ],
  "nombre_sitio": "margaritavillehollywoodbeachresort.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://www.margaritavillehollywoodbeachresort.com/",
      "text": "Margaritaville Hollywood Beach Resort Skip to Content (Press Enter) Gallery Entertainment & Events Calendar Margaritaville Perks Open search modal Special Offers Resort Experience Packages Resort Guest Schedule Activities & Pools Resort Map Parakeets Kids Club Store Gift Cards FAQ Stay Guest Rooms & Suites ADA Accommodations​ Eat & Drink JWB Prime Steak and Seafood LandShark Bar & Grill Margaritaville Restaurant 5 o’Clock Somewhere Bar Lone Palm Beach Bar Floridays Tacos and Ritas Margaritaville Coffee Shop Start Planning - Private Dining & Parties Spa Book Spa Appointment Book Spa Group Event Spa Memberships Spa Menu Schedule Fitness Class Fitness Center Meetings & Events Start Planning - Event Corporate Events Team Building Special Events Venue Floor Plans Catering Menus Weddings Start Planning - Wedding Wedding Venues Wedding Catering Menus Wedding FAQ Book Now Menu Menu +1 954-874-4444 Advanced search modal Search: Frequently Searched FAQ Special Offers Things to Do Experience Packages Advanced search modal Search: Frequently Searched FAQ Special Offers Things to Do Experience Packages Gallery Entertainment & Events Calendar Margaritaville Perks Special Offers Resort Resort - Submenu Expand Button Experience Packages Resort Guest Schedule Activities & Pools Activities & Pools - Submenu Expand Button Pools & Cabanas FlowRider License to Chill Bar Kayak & Paddleboarding Jetski Rentals Area Activities Resort Map Parakeets Kids Club Store Gift Cards FAQ Stay Stay - Submenu Expand Button Guest Rooms & Suites ADA Accommodations​ Eat & Drink Eat & Drink - Submenu Expand Button JWB Prime Steak and Seafood JWB Prime Steak and Seafood - Submenu Expand Button JWB Dining Menu JWB Drink Menu LandShark Bar & Grill LandShark Bar & Grill - Submenu Expand Button LandShark Dining Menu LandShark Drink Menu Margaritaville Restaurant Margaritaville Restaurant - Submenu Expand Button Margaritaville Dining Menu Margaritaville Drink Menu 5 o’Clock Somewhere Bar 5 o’Clock Somewhere Bar - Submenu Expand Button 5 o’Clock Somewhere Dining Menu 5 o’Clock Somewhere Drink Menu Lone Palm Beach Bar Lone Palm Beach Bar - Submenu Expand Button Lone Palm Beach Bar Dining Menu Lone Palm Beach Bar Drink Menu Floridays Tacos and Ritas Floridays Tacos and Ritas - Submenu Expand Button Floridays Menu Margaritaville Coffee Shop Start Planning - Private Dining & Parties Spa Spa - Submenu Expand Button Book Spa Appointment Book Spa Group Event Spa Memberships Spa Menu Schedule Fitness Class Fitness Center Meetings & Events Meetings & Events - Submenu Expand Button Start Planning - Event Start Planning - Event - Submenu Expand Button Thank You Corporate Events Team Building Special Events Venue Floor Plans Catering Menus Weddings Weddings - Submenu Expand Button Start Planning - Wedding Wedding Venues Wedding Catering Menus Wedding FAQ Careers FAQ Blog Contact Your Privacy Choices Previous A Beach With Buildings And Trees Next Scroll to Explore Reservations Destination: Arrival 00/00/00 Depart 00/00/00 Previous month Next month Cities/Region Recent Searches Adults Decrease 0 1 Increase Children Decrease 0 0 Increase Rooms Decrease 0 1 Increase Promo Code Enter Code: Enter Code: Enter Code: Enter Agent ID Enter Agent ID Add Code Booking Close Button Reservations Dates: Previous month Next month Booking Check-in: Booking Check-out: Rooms: 1 Room 2 Rooms 3 Rooms 4 Rooms 5 Rooms Guests: 1 Guest 2 Guests 3 Guests 4 Guests 5 Guests Promo Code Enter Promo Code: Enter Group Code: Enter Code: Submit Promo Codes Add Code Find Reservation Escape to Paradise at Margaritaville Hollywood Beach Resort Best Beach Resort in Hollywood, Florida Escape to Margaritaville Hollywood Beach Resort-one of the top Hollywood Florida hotels for relaxation and adventure. Discover new adventures, celebrate with friends and family, or indulge in a relaxing getaway at this iconic resort, nestled between the Atlantic Ocean and Intracoastal Waterway. Enjoy beachfront entertainment, spacious accommodations, and unparalleled coastal luxury. Our 369 guest rooms offer waterfront views that invite you to unwind from the everyday and simply chill. Exclusive Offers Previous Slide 10th Year Anniver... BOOK NOW Learn More Keep the Party Going BOOK NOW Learn More Florida & Georgia... BOOK NOW Learn More Family Paradise E... BOOK NOW Learn More Pre & Post Cruise... BOOK NOW Learn More AAA Member Offer BOOK NOW Learn More First Responders,... BOOK NOW Learn More Pay Now, Save More BOOK NOW Learn More Next Slide JWB Prime Steak and Seafood JWB​ offers a fresh take on fine dining with fresh seafood, a premium raw bar, and prime cuts of meat, all paired with world-class wines and hand-crafted cocktails. Learn more about JWB Prime Steak and Seafood Learn More LandShark​ Bar & Grill Inspired by beach bars along the Atlantic Coast, LandShark Bar & Grill offers delicious seafood, drinks, and fun with ocean views. It’s the ideal spot for a casual meal and relaxation at Margaritaville Hollywood Beach Resort. Learn more about LandShark​ Bar & Grill Learn More Margaritaville​ Restaurant Raise a glass and indulge in Florida flavors at Margaritaville Restaurant. Enjoy signature Margaritaville dishes, live music, and a wide selection of tropical cocktails. Whether you’re craving fresh seafood or classic island fare, our restaurant offers something for every guest. Learn more about Margaritaville​ Restaurant Learn More 5 o'Clock Somewhere​ Bar & Grill At 5 o'Clock Somewhere Bar & Grill, experience the perfect blend of tasty bar bites and refreshing tropical drinks. Located dockside, this rustic bar offers live entertainment and is the ideal spot to unwind and relax by the beach. Learn more about 5 o'Clock Somewhere​ Bar & Grill Learn More Lone Palm Beach Bar​ For a tropical drink and casual vibe, head to Lone Palm Beach Bar. Located near the pool or by the Hollywood Beach Broadwalk, this tiki bar serves refreshing cocktails, making it a perfect choice for guests who want to chill by the water. Learn more about Lone Palm Beach Bar​ Learn More Floridays Sip margaritas at Floridays, a laid-back beachside cantina serving refreshing drinks and signature cocktails, perfect for enjoying the Florida sunshine. Learn more about Floridays Learn More Margaritaville Coffee Shop Start your day with a cup of Margaritaville’s signature gourmet coffee at our on-site coffee shop, serving light bites and pastries in a cozy beachside setting. Learn more about Margaritaville Coffee Shop Learn More Drinks & Dining JWB Prime Steak and Seafood LandShark​ Bar & Grill Margaritaville​ Restaurant 5 o'Clock Somewhere​ Bar & Grill Lone Palm Beach Bar​ Floridays Margaritaville Coffee Shop Activities Experience Packages FlowRider St. Somewhere Spa Pool Paradise Couples & Family Photos Kayak & Paddleboarding Jet Ski Rentals Fitness Center & Classes Area Activities Learn More Accommodations Guest Rooms The resort’s rooms and suites combine the classic carefree vibe of the Florida coast with the modern comforts of a luxury hotel. Gaze out across the sparkling Atlantic Ocean or the calming Intracoastal Waterway from your private balcony and relax amid island-inspired decor, upscale tropical furnishings, and signature Margaritaville amenities. Explore the range of accommodations and find the space that suits your stay. Learn More Meetings, Weddings & Special Events Previous Slide Meetings Margaritaville Hollywood Beach Resort is not just a place for relaxation—it’s also an excellent venue for business meetings. Our meeting space offers over 15,000 square feet of flexible space, with options for both indoor and outdoor meetings. After the meeting, unwind at one of our iconic bars or take a stroll along the Hollywood Beach Broadwalk. Groups & Social Events Whether it’s a corporate retreat, a team-building event, or a family gathering, Margaritaville Hollywood Beach Resort offers ideal venues for your next group event. Our resort is perfect for social gatherings such as receptions, parties, or any event that needs a Florida beachfront venue with a twist of tropical fun. Weddings Is there anything more magical than a beachfront wedding? Celebrate your special day at the most romantic resort in Hollywood, Florida—Margaritaville Hollywood Beach Resort. From intimate beachfront ceremonies to grand ballroom receptions, our team will ensure your wedding day is as magical as the setting. Next Slide What's Nearby Margaritaville Hollywood Beach Resort is located just minutes from top attractions, shopping, and entertainment in Hollywood, FL. Discover the nearby attractions, including: Zoom In Zoom Out All Points Air & Sea Ports Attractions Convention Centers Shopping Stadiums Stay Connected With Margaritaville There’s always something going on at Margaritaville Hollywood Beach Resort, from exciting events to exclusive deals. Sign up for our newsletter, and you’ll be among the first to know our latest offers and updates. Stay Connected Please Enter Your Email Follow Us Visit our facebook Visit our instagram Visit our tripadvisor @Margaritaville_Hollywood_Beach Margaritaville Hollywood Beach 1111 N Ocean Dr, Hollywood, FL 33019 +1 954-874-4444 Careers FAQ Blog Contact Your Privacy Choices Quick links Travel Advisor Information Media/Influencer RFP Form Discover Margaritaville Download Our Guest App ADA Accessibility Statement Privacy Policy Resort Policies Awards & Accolades © Margaritaville Hollywood Beach Slider Arrow Next Slider Arrow Previous Arrow Roundarrow Select Arrow Link Arrow Small Arrow Facebook Twitter Instagram YouTube LinkedIn TripAdvisor Pinterest Datepicker Opentable Datepicker Search Question Email Pointer Close Button 360 Tour Icon 3D Tour Icon 3D"
    },
    {
      "url": "https://chamber.hollywoodchamber.org/list/member/margaritaville-hollywood-beach-resort-11146",
      "text": "Margaritaville Hollywood Beach Resort | Hotels / Motels | Restaurant | Spa and Wellness Centers | Trustee Members - Event - Greater Hollywood Chamber of Commerce 954.923.4000 Email Facebook Instagram Email Facebook Instagram Member Directory Newsletter Member Login What We Do BE INVESTED. Join Our Membership Why You Must Join Membership Overview Market Your Business With Us Member Directory BE INVOLVED. Industry Groups Leads Groups Upcoming Events BE INFLUENTIAL. Committees & Task Forces Sponsorship & Opportunities Leadership Hollywood Foundation Leadership Hollywood Graduation Gala BE INVITED. Board Installation & Business Leaders Awards Teacher of the Year Spark Hollywood FL Disaster Preparedness Conference Leadership Hollywood Graduation Gala Grapes for Grades Golf Classic Who We Are About Us Our Team Board of Directors Ambassadors Greater Hollywood Chamber of Commerce’s 100th Birthday Contact Do Business in Hollywood ABOUT HOLLYWOOD From the Mayor Census/Demographics Hollywood’s History City of Hollywood Official Site Community Redevelopment Agency Broward County Public Schools WORK WITH HOLLYWOOD Vendor Guide Business Connections Guide Job Postings & Hiring Guide GHCC Business Alerts VISIT HOLLYWOOD Plan Your Visit Member Directory Member Directory JOIN NOW Select Page Margaritaville Hollywood Beach Resort Categories Hotels / Motels Restaurant Spa and Wellness Centers Trustee Members 1111 N. Ocean Drive Hollywood FL 33019 (954) 874-4444 (954) 874-4444 (954) 874-2361 http://www.margaritavillehollywoodbeachresort.com/ Hours: 24/7 Driving Directions: https://www.google.com/maps?saddr=%22Johnson+Street+and+A1A,+Hollywood,+FL About Us Destination Paradise Inspired by the lyrics of Jimmy Buffett, the full-service oceanfront resort and entertainment complex offers amenities and services that create the perfect setting to escape the everyday. The resort features incredible waterfront venues including multiple diverse restaurant concepts, a full-service spa, a recreational area with multiple pools, a FlowRider® Double, live entertainment and more. Whatever escape you envision, we are here to take you there! Plan a visit by visiting the website or by calling (954) 874-4444. Video Media Highlights Margaritaville Hollywood Beach Resort Overview Margaritaville Hollywood Beach Resort Meetings and Events Margaritaville Hollywood Beach Resort Amenities Margaritaville Hollywood Beach Resort Guest Rooms and Suites Margaritaville Hollywood Beach Resort Drinks and Dining Images Gallery Image DJI_0166-Enhanced-NR_1.jpg × Gallery Image DJI_0146-Enhanced-NR.jpg × Gallery Image DJI_0163-Enhanced-NR.jpg × Gallery Image 327992364_1629295954171620_5040010828888200649_n.jpg × Gallery Image DSC05492.jpg × Gallery Image DSC03997.jpg × Gallery Image DSC05201.jpg × Gallery Image DSC00623-Enhanced-NR.jpg × Gallery Image Flip_-_Flop_Edited.jpg × Gallery Image DSC08218.jpg × Gallery Image Room_Oceanfront.png × Rep/Contact Info Jamie Botkin × Close Jamie Botkin Phone: (954) 874-4411 Michelle Crais × Close Michelle Crais Phone: (954) 874-4444 Cara Mia Gatti × Close Cara Mia Gatti Phone: (954) 874-4406 Genevieve Kelley × Close Genevieve Kelley Phone: (954) 874-4444 Lourdes Salazar × Close Lourdes Salazar Phone: (954) 874-4444 Jonathan Williams × Close Jonathan Williams Phone: (954) 874-4444 Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel Email Facebook Instagram © Greater Hollywood Chamber of Commerce. All rights reserved. Privacy Policy."
    },
    {
      "url": "https://www.margaritavillehollywoodbeachresort.com/specials",
      "text": "Vacation Deals | Margaritaville Hollywood Beach Specials Skip to Content (Press Enter) Gallery Entertainment & Events Calendar Margaritaville Perks Open search modal Special Offers Resort Experience Packages Resort Guest Schedule Activities & Pools Resort Map Parakeets Kids Club Store Gift Cards FAQ Stay Guest Rooms & Suites ADA Accommodations​ Eat & Drink JWB Prime Steak and Seafood LandShark Bar & Grill Margaritaville Restaurant 5 o’Clock Somewhere Bar Lone Palm Beach Bar Floridays Tacos and Ritas Margaritaville Coffee Shop Start Planning - Private Dining & Parties Spa Book Spa Appointment Book Spa Group Event Spa Memberships Spa Menu Schedule Fitness Class Fitness Center Meetings & Events Start Planning - Event Corporate Events Team Building Special Events Venue Floor Plans Catering Menus Weddings Start Planning - Wedding Wedding Venues Wedding Catering Menus Wedding FAQ Book Now Menu Menu +1 954-874-4444 Advanced search modal Search: Frequently Searched FAQ Special Offers Things to Do Experience Packages Advanced search modal Search: Frequently Searched FAQ Special Offers Things to Do Experience Packages Gallery Entertainment & Events Calendar Margaritaville Perks Special Offers Resort Resort - Submenu Expand Button Experience Packages Resort Guest Schedule Activities & Pools Activities & Pools - Submenu Expand Button Pools & Cabanas FlowRider License to Chill Bar Kayak & Paddleboarding Jetski Rentals Area Activities Resort Map Parakeets Kids Club Store Gift Cards FAQ Stay Stay - Submenu Expand Button Guest Rooms & Suites ADA Accommodations​ Eat & Drink Eat & Drink - Submenu Expand Button JWB Prime Steak and Seafood JWB Prime Steak and Seafood - Submenu Expand Button JWB Dining Menu JWB Drink Menu LandShark Bar & Grill LandShark Bar & Grill - Submenu Expand Button LandShark Dining Menu LandShark Drink Menu Margaritaville Restaurant Margaritaville Restaurant - Submenu Expand Button Margaritaville Dining Menu Margaritaville Drink Menu 5 o’Clock Somewhere Bar 5 o’Clock Somewhere Bar - Submenu Expand Button 5 o’Clock Somewhere Dining Menu 5 o’Clock Somewhere Drink Menu Lone Palm Beach Bar Lone Palm Beach Bar - Submenu Expand Button Lone Palm Beach Bar Dining Menu Lone Palm Beach Bar Drink Menu Floridays Tacos and Ritas Floridays Tacos and Ritas - Submenu Expand Button Floridays Menu Margaritaville Coffee Shop Start Planning - Private Dining & Parties Spa Spa - Submenu Expand Button Book Spa Appointment Book Spa Group Event Spa Memberships Spa Menu Schedule Fitness Class Fitness Center Meetings & Events Meetings & Events - Submenu Expand Button Start Planning - Event Start Planning - Event - Submenu Expand Button Thank You Corporate Events Team Building Special Events Venue Floor Plans Catering Menus Weddings Weddings - Submenu Expand Button Start Planning - Wedding Wedding Venues Wedding Catering Menus Wedding FAQ Careers FAQ Blog Contact Your Privacy Choices Special Offers Reservations Destination: Arrival 00/00/00 Depart 00/00/00 Previous month Next month Cities/Region Recent Searches Adults Decrease 0 1 Increase Children Decrease 0 0 Increase Rooms Decrease 0 1 Increase Promo Code Enter Code: Enter Code: Enter Code: Enter Agent ID Enter Agent ID Add Code Booking Close Button Experience an Island State of Mind, With No Passport Required You deserve a luxurious coastal vacation at Margaritaville Hollywood Beach Resort. Lounge on the endless summer sand, surf the salty ocean waves, soothe your mind and body at the St. Somewhere Spa and celebrate 5 o’Clock Somewhere, all day long. Explore a getaway custom designed for your perfect stay in paradise. Make a Reservation with Personalized Service! 954-874-4444 | [email protected] Grid List 10th Year Anniversary Offer Learn More about 10th Year Anniversary Offer Enjoy up to 20% off your stay, a $100 daily resort credit, complimentary upgrade upon availability and more! 10th Year Anniversary Offer Learn More 10th Year Anniversary Offer BOOK NOW Keep the Party Going Learn More about Keep the Party Going Save up to 20% and Keep the Party Going. This package includes two special edition commemorative cups and supports Singing... Keep the Party Going Learn More Keep the Party Going BOOK NOW Florida & Georgia Residents! Learn More about Florida & Georgia Residents! Book our Florida & Georgia Residents and receive up to 20% off and a $75 Resort Credit with your staycation in paradise! Florida & Georgia Residents! Learn More Florida & Georgia Residents! BOOK NOW Family Paradise Escape Learn More about Family Paradise Escape Enjoy the ultimate family getaway with exclusive perks designed for fun, relaxation, and adventure! Family Paradise Escape Learn More Family Paradise Escape BOOK NOW Pre & Post Cruise Stay Offer! Learn More about Pre & Post Cruise Stay Offer! Margaritaville Hollywood Beach Resort is the perfect place for pre and post-cruise stays, located less than a 10-minute... Pre & Post Cruise Stay Offer! Learn More Pre & Post Cruise Stay Offer! BOOK NOW AAA Member Offer Learn More about AAA Member Offer As a valued member of AAA, CAA and ARC, you can enjoy up to 18% off your stay and a $75 Resort Credit with this exclusive... AAA Member Offer Learn More AAA Member Offer BOOK NOW First Responders, Military and Government Discount Learn More about First Responders, Military and Government Discount Enjoy a very special rate on your next stay with us, as our way of thanking you for all that you do! First Responders, Military and Government Discount Learn More First Responders, Military and Government Discount BOOK NOW Pay Now, Save More Learn More about Pay Now, Save More Book seven days or more in advance to take advantage of this special offer & save up to 25% on your stay! Pay Now, Save More Learn More Pay Now, Save More BOOK NOW Stay Connected With Margaritaville There’s always something going on at Margaritaville Hollywood Beach Resort, from exciting events to exclusive deals. Sign up for our newsletter, and you’ll be among the first to know our latest offers and updates. Stay Connected Please Enter Your Email Margaritaville Hollywood Beach 1111 N Ocean Dr, Hollywood, FL 33019 +1 954-874-4444 Careers FAQ Blog Contact Your Privacy Choices Quick links Travel Advisor Information Media/Influencer RFP Form Discover Margaritaville Download Our Guest App ADA Accessibility Statement Privacy Policy Resort Policies Awards & Accolades © Margaritaville Hollywood Beach Slider Arrow Next Slider Arrow Previous Arrow Roundarrow Select Arrow Link Arrow Small Arrow Facebook Twitter Instagram YouTube LinkedIn TripAdvisor Pinterest Datepicker Opentable Datepicker Search Question Email Pointer Close Button 360 Tour Icon 3D Tour Icon 3D"
    }
  ]
}