{
  "fuentes": [
    {
      "url": "https://marriott.pressarea.com/en/board_members",
      "email": "pressoffice@marriott.com"
    },
    {
      "url": "https://petedulcamara.com/contact/",
      "email": "pete@petedulcamara.com"
    },
    {
      "url": "https://www.biography.com/authors-writers/alice-walker",
      "email": "editor@biography.com"
    },
    {
      "url": "https://www.historicrichmondtown.org/alice-austen",
      "email": "info@historicrichmondtown.org"
    },
    {
      "url": "https://www.historicrichmondtown.org/alice-austen",
      "email": "info@hrtown.nyc"
    },
    {
      "url": "https://www.historicrichmondtown.org/alice-austen",
      "email": "melissa@hrtown.nyc"
    }
  ],
  "mails": [
    "editor@biography.com",
    "info@historicrichmondtown.org",
    "info@hrtown.nyc",
    "melissa@hrtown.nyc",
    "pete@petedulcamara.com",
    "pressoffice@marriott.com"
  ],
  "nombre_sitio": "marriott.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://marriott.pressarea.com/en/board_members",
      "text": "Marriott International Media Centre Info an event just happened Error! Something went wrong. Try again or ping techsupport. Warning! Something just happened which created a warning condition. Success English English Français Español Deutsch Italiano عربي Latest News Brands Media Library Image Library Video Library Newsletter Corporate ESG Contacts Search Loading... Home EMEA Leadership Team EMEA Leadership Team Satya Anand President, EMEA Marriott International Michel Miserez Chief Financial Officer, Europe, Middle East and Africa ... Arielle Quick Chief Lodging Products Officer, EMEA, Marriott ... Francisca Martinez Chief Human Resources Officer, Europe, Middle East & ... Sandeep Walia Chief Operating Officer Middle East & Luxury, Europe ... Neal Jones Chief Operating Officer Europe & Africa Premium & Select, ... Andrew Watson Chief Commercial Officer, EMEA Jerome Briet Chief Development Officer Europe, Middle East & Africa  ... Pankaj Birla Regional Vice President, Eastern Europe Marriott ... Joanna Chugh Regional Vice President, United Kingdom, Ireland, and The ... Johan Cronjé Regional Vice President, Sub-Saharan Africa at Marriott ... Robert Juntke Regional Vice President, Western Europe, Marriott ... Stefan Kuehr Regional Vice President, DACH region, Marriott ... Ronny A. Maier Regional Vice President, Southern Europe and Maghreb Sign up for our latest News alerts Please note that only registrations from the media will be accepted. Insert your email Submit Marriott Bonvoy About Us News Media Library Newsletter Corporate ESG Contact Social Media X Facebook Youtube Instagram LinkedIn Marriott Traveler Extras Privacy Policy Cookies Terms & Conditions Sitemap Search Powered by © 1996 ‐ 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information Password Protected × To download this content you require a password. To get your password contact the press office: pressoffice@marriott.com (for more details see https://marriott.pressarea.com/en/contact ) or enter the password here: Close Submit rTqASRISpxwUOBdPOSWA3ag87s744ZBOyKYlLrboqvjyZ3D2oueexBTU5Duw6scUCz5HbV6Sp0hqrr4UCOe2RPhFpb0OR8xc2rwABpRT7LFbKBm6GHNi71e7nPTsyTTcUQwoUc0UQNU2WZq3ZjbYW1Xl4KSGWGIZcuB0MwOd1UYSzyc0gexb7eLGwrQXeeoyuOMBD4nRrCnYtpgwFD4vuNuV4J8EKGCBonEiIYXJomXLhNBapfwGIIYwMpDYe5qS1UcTQNzJeSXUnvTzmrcvx35"
    },
    {
      "url": "https://petedulcamara.com/contact/",
      "text": "Contact – Pete Dulcamara & Associates, LLC Skip to content Pete Dulcamara & Associates, LLC Reinventing Billionaire Menu + × expanded collapsed About Speaking Blog Inspiration Coaching/Advising AI Learning Contact LinkedIn Contact Let’s talk 👋 Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch pete@petedulcamara.com Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning. Submit Δ Pete Dulcamara & Associates, LLC , Blog at WordPress.com. Subscribe Subscribed Pete Dulcamara & Associates, LLC Sign me up Already have a WordPress.com account? Log in now. Pete Dulcamara & Associates, LLC Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar"
    },
    {
      "url": "https://www.biography.com/authors-writers/alice-walker",
      "text": "Alice Walker - Quotes, Books & Poems Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Lainey Wilson Rupert Murdoch Howard Stern Elvis & Tom Parker’s Feud Famous Authors & Writers Black History Alice Walker Alice Walker Alice Walker is a Pulitzer Prize-winning, African American novelist and poet most famous for authoring 'The Color Purple.' By Biography.com Editors Updated: May 06, 2021 5:20 PM EDT Getty Images (1944-) Who Is Alice Walker? Born to sharecropper parents, Alice Walker grew up to become a highly acclaimed novelist, essayist and poet. She is best known for her 1982 novel The Color Purple , which won the 1983 Pulitzer Prize for Fiction and soon was adapted for the big screen by Steven Spielberg . Walker is also known for her work as an activist. Poor Upbringing Alice Malsenior Walker was born on February 9, 1944, in Eatonton, Georgia. The youngest daughter of sharecroppers, she grew up poor, with her mother working as a maid to help support the family's eight children. At 8 years old, Walker was shot in the right eye with a BB pellet while playing with two of her brothers. Whitish scar tissue formed in her damaged eye, and she became self-conscious of this visible mark. After the incident, Walker largely withdrew from the world around her. \"For a long time, I thought I was very ugly and disfigured,\" she told John O'Brien in an interview that was published in Alice Walker: Critical Perspectives, Past and Present (1993). \"This made me shy and timid, and I often reacted to insults and slights that were not intended.\" She found solace in reading and writing poetry. Living in the racially divided South, Walker showcased a bright mind at her segregated schools, graduating from high school as class valedictorian. Schools and Early Career With the help of a scholarship, Walker was able to attend Spelman College in Atlanta. She later switched to Sarah Lawrence College in New York. While at Sarah Lawrence, Walker visited Africa as part of a study-abroad program. She graduated in 1965—the same year that she published her first short story. After college, Walker worked as a social worker, teacher and lecturer. She became active in the civil rights movement , fighting for equality for all African Americans. 'Once,' 'Everyday Use' and Other Early Works Walker's experiences informed her first collection of poetry, Once , which was published in 1968. Better known now as a novelist, Walker showed her talents for storytelling in her debut work, Third Life of Grange Copeland (1970). Walker continued to explore writing in all of its forms. In 1973, she published the poetry collection Revolutionary Petunias and the short story collection In Love and Trouble , which included the highly acclaimed \"Everyday Use.\" The following year, she delivered her first children's book, Langston Hughes : American Poet . Walker also emerged as a prominent voice in the Black feminist movement. 'The Color Purple': Book and Movie Walker's career as a writer took flight with the publication of her third novel, The Color Purple , in 1982. Set in the early 1900s, the novel explores the female African American experience through the life and struggles of its narrator, Celie. Celie suffers terrible abuse at the hands of her father, and later, from her husband. The compelling work won Walker both the Pulitzer Prize for Fiction and the National Book Award for Fiction in 1983. In 1985, Walker's story made it to the big screen: Spielberg directed The Color Purple , which starred Whoopi Goldberg as Celie, as well as Oprah Winfrey and Danny Glover. Like the novel, the movie was a critical success, receiving 11 Academy Award nominations. Walker explored her own feelings about the film in her 1996 work, The Same River Twice: Honoring the Difficult . In 2005, The Color Purple became a Broadway musical. Walker incorporated characters and their relations from The Color Purple into two of her other novels: The Temple of My Familiar (1989) and Possessing the Secret of Joy (1992), which earned great critical praise and caused some controversy for its exploration of the practice of female genital mutilation. 'By the Light of My Father’s Smile' and Later Works In 1998, Walker published her first novel in six years, By the Light of My Father’s Smile . Next up was the short story collection The Way Forward Is with a Broken Heart (2000). Proving time and time again to be a versatile writer, Walker followed with the novel Now Is the Time to Open Your Heart (2004), the essay collection We Are the Ones We Have Been Waiting For: Light in a Time of Darkness (2006) and the well-received picture book There Is a Flower at the Tip of My Nose Smelling Me (2006). Walker also wrote about her experiences with the group Women for Women International in 2010's Overcoming Speechlessness: A Poet Encounters the Horror in Rwanda, Eastern Congo and Palestine/Israel . She published another poetry collection, Hard Times Require Furious Dancing , that same year. After more than four decades as a writer, Walker shows no signs of slowing down. In 2012, she released The Chicken Chronicles ; in this latest memoir, she ruminates on caring for her flock of chickens. The following year, she published Cushion in the Road: Meditation and Wandering As the Whole World Awakens to Being in Harm's Way and the poetry collection The World Will Follow Joy: Turning Madness into Flowers . According to Walker's website, her books have been translated into more than two dozen languages and sold more than 15 million copies. Marriage and Family Through her involvement in civil rights activism, Walker met the New York City-born Jewish lawyer Melvyn Leventhal. Following their marriage in 1967, they became the first legally married interracial couple to live in Mississippi. The two had one daughter, Rebecca, before divorcing in 1976. Walker later dated both men and women, including singer Tracy Chapman . She was also known for publicly feuding with her daughter, who described how she was neglected by her writer mom in her memoir Black, White, and Jewish: Autobiography of a Shifting Self (2000). Honors and Recollections Along with her Pulitzer and National Book Award, Walker has been honored with the O. Henry Award and the Mahmoud Darwish Literary Prize for Fiction. Additionally, she was inducted into the California Hall of Fame in 2006 and received the LennonOno Peace Award in 2010. In 2007, Walker's personal papers were made available to the public at Emory University in Georgia. In 2013, she was the subject of the acclaimed documentary Alice Walker: Beauty In Truth . QUICK FACTS Name:                                             Alice Walker Birth Year:                                             1944 Birth date: February 9,                                             1944 Birth State:                                             Georgia Birth City:                                             Eatonton Birth Country:                                             United States Gender: Female Best Known For: Alice Walker is a Pulitzer Prize-winning, African American novelist and poet most famous for authoring 'The Color Purple.' Industries Fiction and Poetry Astrological Sign:                                             Aquarius Schools Spelman College Sarah Lawrence College Fact Check We strive for accuracy and fairness.If you see something that doesn't look right, contact us ! CITATION INFORMATION Article Title:                                 Alice Walker Biography Author:                             Biography.com Editors Website Name:                                 The Biography.com website Url:                             https://www.biography.com/authors-writers/alice-walker Access Date: Publisher:                             A&E; Television Networks Last Updated:                                 May                             6,                                 2021 Original Published Date:                                 April                             3,                                 2014 QUOTES For in the end, freedom is a personal and lonely battle; and one faces down fears of today so that those of tomorrow might be engaged. Expect nothing. Live frugally on surprise. Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Watch Next Advertisement - Continue Reading Below Black History How the Greensboro Four Began the Sit-In Movement 9 Memorable Super Bowl Halftime Shows Venus Williams How Serena and Venus Williams’ Father Pushed Them Advertisement - Continue Reading Below Hakeem Jeffries Toni Morrison Martin Luther King Jr. and James Baldwin Malia Obama How Althea Gibson Changed Tennis and Golf Forever Which Historical Figures Are on U.S. Money? Jackie Robinson How the First Black Woman FBI Agent Broke Barriers Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://www.historicrichmondtown.org/alice-austen",
      "text": "Alice Austen — Historic Richmond Town Visit About Education Explore Support Rentals & Permits Back Admission & Hours Group Reservations Event Calendar Open Village Village Store Dining Accessibility & Site Policies Richmond County Fair Back About Us Newsroom & Blog Volunteer Careers & Internships Contact Us FAQ Back School Programs Talks of the Town Apprenticeships Remote Learning Back Historic Village & Structures Historic Trades Exhibitions Research & Library Collections Database Back Donate Membership Corporate Support Perine House Restoration Field of Flags Back Private Events Film & Photography Permits Visit Admission & Hours Group Reservations Event Calendar Open Village Village Store Dining Accessibility & Site Policies Richmond County Fair About About Us Newsroom & Blog Volunteer Careers & Internships Contact Us FAQ Education School Programs Talks of the Town Apprenticeships Remote Learning Explore Historic Village & Structures Historic Trades Exhibitions Research & Library Collections Database Support Donate Membership Corporate Support Perine House Restoration Field of Flags Rentals & Permits Private Events Film & Photography Permits Explore where history lives. The Staten Island Historical Society’s Alice Austen Collection The Alice Austen photograph collection, with more than 7,500 original prints and negatives, is one of the Staten Island Historical Society’s most significant and best-known holdings. Alice’s carefully composed images capture decades of life not only in her native Staten Island but on her extensive travels, including several trips through Europe. Cocroft children in the trees, Clear Comfort, November 2, 1886 Group at the Berkeley Ladies' Athletic Club, Manhattan, May 23, 1893 Alice Austen and Trude Eccleston with officers at Fort Wadsworth, Staten Island, November 6, 1888 South Beach bathing party, Staten Island, September 15, 1886. Alice Austen is in the back row at right “Full length, with bouquet,” Alice Austen self-portrait at Clear Comfort, September 19, 1892 “Large group on tennis ground,” Clear Comfort, August 5, 1886. Alice Austen is seated at far left. “View from front door, tree & schooner,” New York Bay seen from Clear Comfort, August 8, 1887 Alice Austen with her Aunt Minn and Uncle Oswald, 1884. Guy Loomis and Gertrude Tate at the Sagamore Hotel, Lake George, New York, August 24, 1913 Restaurant Foyot, Paris, ca. 1903-1909 “Steerage at supper,” aboard the S.S. Finland, June 14, 1909 “Our house from end of front walk,” September 6, 1892 “Fireplace & stove, our room,” bedroom at Clear Comfort, April 21, 1894 “Administration dome & chair house,” World’s Columbian Exposition, Chicago, July 10, 1893 “Uncle Pete, Oswald & Lysbet,“(Peter T. Austen with his children Oswald and Elizabeth Patty), New Brunswick, New Jersey, March 7, 1892. “Jack, Ben, Julia Bredt & self,” in the middle parlor at Clear Comfort, October 21, 1890 “The Darned Club,” Staten Island, October 29, 1891. From left to right: Alice Austen, Trude Eccleston, Julia (Marsh) Lord, and Sue Ripley Men and boys detained at the Quarantine Station on Hoffman Island, ca. 1901. Three bootblacks, Manhattan, April 13, 1896 “Rag pickers & loaded carts,” 23rd Street and Third Avenue, Manhattan, October 30, 1896 Woman and child, Staten Island, October 22, 1890 “Part of our ferry boat deck,” Staten Island Ferry, November 17, 1890 “Four mules & Wabun,” on the yacht “Wabun” in the Delaware and Raritan Canal, New Jersey, October 18, 1892 “Group in bathing costumes,” on the lawn at Clear Comfort, September 17, 1885. Alice Austen stands at far left Violet Ward and Daisy Elliott with bicycles, Staten Island, ca. 1895. Alice Austen was born on Staten Island on March 17, 1866, and she developed her interest in photography as a teenager. Her natural talent was encouraged by her uncle Oswald Muller, a ship’s captain, and her uncle Peter T. Austen, a professor of chemistry at Rutgers College in New Jersey. Uncle Peter was a photographer himself, even teaching a course in photography at Rutgers, and he provided instruction to Alice as she learned to develop and print her own glass plate negatives. Alice’s photographic skills and eye for composition are readily evident in her early photographs, many of which capture what she called “the larky life.” In posed vignettes and carefully arranged portraits, she recorded happy gatherings with friends and family, particularly in the 1880s and 1890s. Hundreds of her photos document the exterior, interior, and grounds of her beloved family home, Clear Comfort, located on the Staten Island shoreline in the Rosebank neighborhood. Alice was an avid sportsperson, and many of her photos document her interest in tennis, bicycling, swimming, boating, and golf. She was an active member of the Staten Island Ladies’ Club and the Clifton Tennis Club, where she competed in tournaments, and she and her friend Maria E. Ward (nickname Violet) founded the Staten Island Bicycle Club in 1895. In 1896, Violet Ward published the book Bicycling for Ladies , with book illustrations based on a series of Alice Austen’s photographs. Alice’s travels also provided rich subject matter for her photographs. She took hundreds of photographs at the World’s Columbian Exposition in Chicago in 1893 and at the Pan-American Exposition in Buffalo in 1901. She frequently visited friends and family throughout the region, traveling to New Jersey, Pennsylvania, upstate New York, Massachusetts, Vermont, and Canada, all the while recording her travels with her photos. In 1892 she took a series of photographs during a journey south aboard the yacht “Wabun” with noted yacht designer Ralph Munroe, brother of Alice’s aunt Nellie (Munroe) Austen. Alice also turned her attention to more serious subject matter. In 1896, she published a portfolio titled Street Types of New York. The portfolio featured images of men, women, and children in Manhattan working as bootblacks, street sweepers, bicycle messengers, police officers, and other occupations. She also worked for more than a decade as a photographer for the Quarantine Station located near her home on the Staten Island shoreline. Her photographs document the Quarantine facilities and vessels for the busy Port of New York, where all passengers and crew arriving on ships from around the world had to stop for health inspections before continuing on to Manhattan. In the early twentieth century, many of Alice Austen’s social connections centered on her involvement with the Staten Island Garden Club and the Staten Island Antiquarian Society, both of which she helped to found. The Antiquarian Society merged with the Staten Island Historical Society in 1922. Alice’s joyful life took a tragic turn when she lost her savings in the 1929 stock market crash. She and her longtime companion Gertrude Tate did their best to remain financially solvent, but in 1945 Alice and Gertrude were evicted from Clear Comfort. During this time, when Alice was forced to sell most of her possessions, she contacted Loring McMillen, director of the Staten Island Historical Society and an acquaintance of many years, and gave him thousands of her glass plate negatives for the Historical Society. In 1950, Alice went to live in the New York City Farm Colony, a home for destitute individuals, but the following year she was able to move to a private home for aged residents. She passed away on June 9, 1952. The negatives that Alice gave to the Historical Society in 1945 joined the thousands of additional photographs and film negatives, household and personal items, and archival materials that Alice donated to the Historical Society throughout the 1940s. These items today form the Society’s Alice Austen collection. In 2011, the Historical Society digitized the entire Austen photo collection, and these images are available for study and reproduction. The photos on this page provide a small sampling of the collection, and more than 500 of her photos are currently available through Historic Richmond Town’s Online Collections Database , with more images added regularly. Alice Austen’s home, Clear Comfort, has been preserved and is open to the public as a museum, the Alice Austen House . It is operated by the Friends of Alice Austen House and is a member of the Historic House Trust of New York City .  In 2017, the Alice Austen House Museum was designated an LGBTQ landmark as part of the New York City LGBTQ Historic Sites Project . Historic Richmond Town 441 Clarke Avenue, Staten Island, NY, 10306, United States (718) 351-1611 info@hrtown.nyc Hours Wed 1:00-5:00 Thu 1:00-5:00 Fri 1:00-5:00 Sat 1:00-5:00 Sun 1:00-5:00 441 Clarke Ave, Staten Island, NY 10306 | (718)-351-1611 | info[@]historicrichmondtown.org Traditional land and ancestral home of the Lenape people. ABOUT | HOURS & ADMISSION | DONATE | CONTACT US | CAREERS BUY TICKETS"
    }
  ]
}