{
  "query": "marriott.com email",
  "fuentes": [
    {
      "url": "https://help.marriott.com/s/article/Article-22341",
      "email": "bg-info@2x.png"
    },
    {
      "url": "https://help.marriott.com/s/article/Article-22264",
      "email": "bg-info@2x.png"
    },
    {
      "url": "https://techcrunch.com/2018/12/03/marriott-data-breach-response-risk-phishing/",
      "email": "zack.whittaker@techcrunch.com"
    },
    {
      "url": "https://techcrunch.com/2018/12/03/marriott-data-breach-response-risk-phishing/",
      "email": "zackwhittaker@mastodon.social"
    }
  ],
  "mails": [
    "zackwhittaker@mastodon.social",
    "bg-info@2x.png",
    "zack.whittaker@techcrunch.com"
  ],
  "nombre_sitio": "marriott.com",
  "origen_extraccion": "Busqueda externa paso: email",
  "textos_fuente": [
    {
      "url": "https://help.marriott.com/s/article/Article-22341",
      "text": "Marriott Bonvoy Customer Service and Online Help Loading × Sorry to interrupt CSS Error Refresh"
    },
    {
      "url": "https://help.marriott.com/s/article/Article-22264",
      "text": "Marriott Bonvoy Customer Service and Online Help Loading × Sorry to interrupt CSS Error Refresh"
    },
    {
      "url": "https://techcrunch.com/2018/12/03/marriott-data-breach-response-risk-phishing/",
      "text": "Marriott's breach response is so bad, security experts are filling in the gaps — at their own expense | TechCrunch TechCrunch Desktop Logo TechCrunch Mobile Logo Latest Startups Venture Apple Security AI Apps Disrupt 2025 Events Podcasts Newsletters Search Submit Site Search Toggle Mega Menu Toggle Topics Latest AI Amazon Apps Biotech & Health Climate Cloud Computing Commerce Crypto Enterprise EVs Fintech Fundraising Gadgets Gaming Google Government & Policy Hardware Instagram Layoffs Media & Entertainment Meta Microsoft Privacy Robotics Security Social Space Startups TikTok Transportation Venture More from TechCrunch Staff Events Startup Battlefield StrictlyVC Newsletters Podcasts Videos Partner Content TechCrunch Brand Studio Crunchboard Contact Us Image Credits: Getty Images Marriott’s breach response is so bad, security experts are filling in the gaps — at their own expense Zack Whittaker 1:22 PM PST · December 3, 2018 Last Friday, Marriott sent out millions of emails warning of a massive data breach — some 500 million guest reservations had been stolen from its Starwood database. One problem: the email sender’s domain didn’t look like it came from Marriott at all. Marriott sent its notification email from “ email-marriott.com ,” which is registered to a third party firm, CSC , on behalf of the hotel chain giant. But there was little else to suggest the email was at all legitimate — the domain doesn’t load or have an identifying HTTPS certificate . In fact, there’s no easy way to check that the domain is real, except a buried note on Marriott’s data breach notification site that confirms the domain as legitimate. But what makes matters worse is that the email is easily spoofable. Often what happens after a data breach, scammers will capitalize on the news cycle by tricking users into turning over their private information with their own stream of fake messages and websites. It’s more common than you think. People who think they’re at risk after a breach are more susceptible to being duped. Companies should host any information on their own websites and verified social media pages to stop bad actors from hijacking victims for their own gain. But once you start setting up your own dedicated, off-site page with its unique domain, you have to consider the cybersquatters — those who register similar-looking domains that look almost the same. Take “ email-marriot.com .” To the untrained eye, it looks like the legitimate domain — but many wouldn’t notice the misspelling. Actually, it belongs to Jake Williams, founder of Rendition Infosec , to warn users not to trust the domain. Techcrunch event Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. San Francisco | October 27-29, 2025 REGISTER NOW “I registered the domains to make sure that scammers didn’t register the domains themselves,” Williams told TechCrunch. “After the Equifax breach, it was obvious this would be an issue, so registering the domains was just a responsible move to keep them out of the hands of criminals.” Marriott says 500 million Starwood guest records stolen in massive data breach Equifax, the biggest breach of last year, made headlines not only for its eye-watering hack, but its shockingly bad response. It, too, set up a dedicated site for victims — “ equifaxsecurity2017.com ” — but even the company’s own Twitter staff were confused, and inadvertently sent concerned victims to “ securityequifax2017.com ” — a fake site set up by developer Nick Sweeting to expose the company’s vulnerable incident response. With the Equifax breach not even a distant memory, Marriott has clearly learned nothing from the response. Many others have sounded the alarm on Marriott’s lackluster data breach response. Security expert Troy Hunt, who founded data breach notification site Have I Been Pwned , posted a long tweet thread on the hotel chain giant’s use of the problematic domain. As it happens, the domain dates back at least to the start of this year when Marriott used the domain to ask its users to update their passwords. Williams isn’t the only one who’s resorted to defending Marriott customers from cybercriminals. Nick Carr , who works at security giant FireEye, registered the similarly named “ email-mariott.com ” on the day of the Marriott breach. “Please watch where you click,” he wrote on the site . “Hopefully this is one less site used to confuse victims.” Had Marriott just sent the email from its own domain, it wouldn’t be an issue. A spokesperson for Marriott did not respond to a request for comment. A year later, Equifax lost your data but faced little fallout Topics computing , data breach , equifax , founder , Have I Been Pwned , Internet , Marriott , Security , security , spokesperson , Troy Hunt Zack Whittaker Security Editor Zack Whittaker is the security editor at TechCrunch. He can be reached via encrypted message at zackwhittaker.1337 on Signal. You can also contact him by email, or to verify outreach, at zack.whittaker@techcrunch.com . View Bio October 27-29, 2025 San Francisco Founders: land your investor and sharpen your pitch. Investors: discover your next breakout startup. Innovators: claim a front-row seat to the future. Join 10,000+ tech leaders at the epicenter of innovation. Register now and save up to $668. Regular Bird rates end September 26 Register Now Most Popular Elon Musk’s Boring Company suspends work on Vegas airport tunnel after ‘crushing injury’ Sean O'Kane I want to love Apple’s new iPhone Air, but the iPhone 17 is a better deal Julie Bort iPhone 17, iPhone Air, AirPods Pro 3, and everything else announced at Apple’s hardware event Lauren Forristal Musk’s $1T pay package is full of watered-down versions of his own broken promises Sean O'Kane Techcrunch event Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. Join 10k+ tech and VC leaders for growth and connections at Disrupt 2025 Netflix, Box, a16z, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just some of the 250+ heavy hitters leading 200+ sessions designed to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch, and a chance to learn from the top voices in tech. Grab your ticket before Sept 26 to save up to $668. San Francisco | October 27-29, 2025 REGISTER NOW Scale AI’s former CTO launches AI agent that could solve big data’s biggest problem Julie Bort OpenAI announces AI-powered hiring platform to take on LinkedIn Maxwell Zeff Loading the next article Error loading the next article X LinkedIn Facebook Instagram youTube Mastodon Threads Bluesky TechCrunch Staff Contact Us Advertise Crunchboard Jobs Site Map Terms of Service Privacy Policy RSS Terms of Use Code of Conduct Apple Event 2025 Oura Ring New Emojis iPhone Air Snap Tech Layoffs ChatGPT © 2025 TechCrunch Media LLC."
    }
  ]
}