{
  "fuentes": [
    {
      "url": "https://www.marshlandingrestaurant.com/contact-us/",
      "email": "restmarshlanding@aol.com"
    },
    {
      "url": "https://www.marshmclennan.com/about/leadership.html",
      "email": "corpcomms.brand@mmc.com"
    },
    {
      "url": "https://business.sebastianchamber.com/list/member/marsh-landing-restaurant-741",
      "email": "info@sebastianchamber.com"
    }
  ],
  "mails": [
    "corpcomms.brand@mmc.com",
    "info@sebastianchamber.com",
    "restmarshlanding@aol.com"
  ],
  "nombre_sitio": "marshlandingrestaurant.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.marshlandingrestaurant.com/contact-us/",
      "text": "Contact Us – Marsh Landing Restaurant Home Dine Private Events Catering About Contact (772) 571-8622 Contact Us Contact Phone: (772) 571-8622 Email: restmarshlanding@aol.com Physical Address Marsh Landing Restaurant 44 N Broadway Fellsmere, FL  32948 Mailing Address Marsh Landing Restaurant P.O. Box 309 Fellsmere, FL 32948 Notice: JavaScript is required for this content. © 2025 Marsh Landing Restaurant. \r\n\t\t\t\t\t    All Rights Reserved. | Website Design by Black Door Creative Home Dine Private Events Catering About Contact (772) 571-8622"
    },
    {
      "url": "https://www.marshmclennan.com/about/leadership.html",
      "text": "Leadership Media Center Careers Contact Us Insights Climate Resilience Emerging Risks Generative AI Healthy Societies Innovations in Infrastructure Transformative Technologies Workforce for the Future Solutions Automotive Energy Financial Institutions Healthcare Insurance Retail / Consumer Products Technology Cyber Digital Public Sector M&A Advisory Investors Reporting Quarterly Earnings Annual Reports + Proxy Statements SEC Filings Events & Presentations Stocks & Dividend Information Dividend Information Stock Chart Investment Calculator Historical Price Lookup Shareholder Information Stock Quote Email Alerts About Leadership Culture Careers Business Responsibility Corporate Governance Our Capabilities Heritage Marsh McLennan's Code of Conduct Search MARSH & McLENNAN COMPANIES Leadership We are in business to expand what’s possible for our clients and each other Meet Our President & CEO John Q. Doyle is an industry veteran with more than 35 years of management experience. More about John Meet Our President & CEO John Q. Doyle is an industry veteran with more than 35 years of management experience. More about John Leadership is a mindset, not a title. We believe our leaders have an elevated duty to amplify impact: making our clients more successful, our communities more resilient, our people more empowered and our company more enduring. Learn about our leaders below. Marsh McLennan Executive Committee Paul Beswick SVP & Chief Information and Operations Officer Katherine J. Brennan SVP & General Counsel John Q. Doyle President & Chief Executive Officer Carmen Fernandez SVP & Chief People Officer John Jones SVP & Chief Marketing and Communications Officer Dean Klisura President & CEO, Guy Carpenter Mark McGivney SVP & Chief Financial Officer Martin South President & CEO, Marsh Nick Studer President & CEO, Oliver Wyman Group Pat Tomlinson President & CEO, Mercer Paul Beswick SVP & Chief Information and Operations Officer Mr. Beswick is Senior Vice President and the Global Chief Information and Operations Officer of Marsh McLennan. In this role, he oversees Marsh McLennan's Business and Client Services function which brings together our Operations and Technology teams in support of the firm’s global businesses.\n\nPrior to his appointment as Chief Information and Operations Officer, Mr. Beswick variously served as Marsh McLennan’s Chief Information Officer, Deputy CIO, and Global Head of Oliver Wyman Labs and the Digital Practice at Oliver Wyman. With more than two decades at Oliver Wyman, he worked across various sectors, including financial services, retail, transportation, telecoms, and consumer goods. Mr. Beswick holds an MA (first class) in chemical engineering from Cambridge University. Katherine J. Brennan SVP & General Counsel Ms. Brennan leads Marsh McLennan’s global legal, compliance and public affairs function, which supports the Company’s four businesses, Marsh, Guy Carpenter, Mercer and Oliver Wyman.  She also leads the Company’s ESG efforts. Ms. Brennan has held several legal and compliance leadership roles at Marsh McLennan, serving most recently as General Counsel, Marsh LLC. She also served as Deputy General Counsel, Corporate Secretary and Chief Compliance Officer for Marsh McLennan from 2017 to 2021, and prior to that, as General Counsel of Guy Carpenter. Ms. Brennan currently serves on the Board of the Red Cross of Greater New York. John Q. Doyle President & Chief Executive Officer Mr. Doyle is President and CEO of Marsh McLennan. Previously, Mr. Doyle served as Group President and Chief Operating Officer, responsible for the strategy and operational objectives of Marsh McLennan’s four global businesses. He joined the firm in 2016 as President of Marsh, then led Marsh as President and CEO from 2017 to 2021. An industry veteran with more than 35 years of management experience, Mr. Doyle began his career at AIG, where he held several executive positions. He is a Trustee of the Inner-City Scholarship Fund, a member of the Board of Overseers of the Maurice R. Greenberg School of Risk Management, Insurance and Actuarial Science at St. John’s University, and a member of the Board of the New York Police and Fire Widows’ and Children’s Benefit Fund. Mr. Doyle serves as the Chairman of the US Federal Advisory Committee on Insurance. Carmen Fernandez SVP & Chief People Officer Ms. Fernandez is responsible for our people strategy and capabilities, to support our colleagues’ growth and our businesses’ priorities. Prior to her current role, Ms. Fernandez held positions within Marsh McLennan for 15 years, most recently Deputy CHRO, CHRO of Guy Carpenter, and HR leadership roles at Mercer, including North America HR Leader, Global HR Leader for the Career business and Chief of Staff in the Office of the CEO. Before joining Marsh McLennan, Ms. Fernandez worked in investment banking at Goldman Sachs and Bank of America. She began her career as a consultant with PricewaterhouseCoopers. John Jones SVP & Chief Marketing and Communications Officer As SVP and Chief Marketing and Communications Officer, Mr. Jones is responsible for the marketing and communications strategy for Marsh McLennan and its four global businesses. Previously he was Chief Marketing and Communications Officer of Marsh. Mr. Jones joined Marsh in 2016 as Senior Vice President, Business Planning, leading strategic development and global growth initiatives. Prior to that, he was Senior Vice President of Commercial Marketing and Strategy for AIG and has more than 25 years of marketing, communications and strategy experience. He graduated from Indiana University with a BA in political science and history, and a minor in Russian language. Dean Klisura President & CEO, Guy Carpenter Dean Klisura is President & CEO of Guy Carpenter, responsible for all of Guy Carpenter’s businesses and operations globally. He is also Vice Chair of Marsh McLennan.\nDean has significant insurance industry experience. Prior to joining Guy Carpenter in 2020, he held a number of executive roles at Marsh, including President of Global Placement, Specialties and Advisory Services. Dean joined Marsh in 1993.\nDean is a member of the Board of Directors of Blue Marble, an organization that develops insurance protection for the underserved, and The Institutes Knowledge Group, which is dedicated to helping the risk management and insurance industries better serve the public. Dean holds a BS in Finance from Santa Clara University. Mark McGivney SVP & Chief Financial Officer Mr. McGivney has held a number of senior financial management positions since joining the Company in 2007, including Chief Financial Officer of Marsh and Chief Financial Officer and Chief Operating Officer of Mercer. In his most recent role as Senior Vice President, Corporate Finance of Marsh McLennan, Mr. McGivney was responsible for leading and directing the Company’s Corporate Development, Treasury and Investor Relations functions. His prior experience includes senior positions at The Hanover Insurance Group, including serving as Senior Vice President of Finance, Treasurer, and Chief Financial Officer of the Property & Casualty business, and investment banking positions at Merrill Lynch and PriceWaterhouseCoopers. Martin South President & CEO, Marsh Mr. South is President and Chief Executive Officer of Marsh and oversees all of Marsh’s businesses and operations globally. He is also Vice Chair of Marsh McLennan. With more than 30 years in the insurance industry, Mr. South joined Marsh for the first time in 1985 with Bowring Marsh, a Marsh McLennan broking unit. His industry experience includes senior leadership roles at Zurich Financial Services, where he was a member of the Group Management Board, responsible for all of Zurich’s operations outside of North America and Europe, and CEO of Zurich’s London operations. Since rejoining Marsh in 2007, Mr. South has served as CEO of Marsh’s Asia-Pacific region, CEO of Marsh UK and Ireland, CEO of Marsh Europe and CEO of Marsh US and Canada. Nick Studer President & CEO, Oliver Wyman Group Mr. Studer is the President and Chief Executive Officer of Oliver Wyman Group and Vice Chair of Marsh McLennan. Prior, he was the Managing Partner of Oliver Wyman and has held many senior positions, including Managing Partner of the Consumer, Industrial, and Services Practice, Managing Partner of the Financial Services Practice, and Head of the European Finance and Risk Practice. He has over 20 years of experience consulting in the UK, Continental Europe, and North America. Mr. Studer was a founding Director of TheCityUK, a founding advisory board member of the FICC Markets Standards Board and is a member of the Sustainable Markets Initiative. Mr. Studer graduated with a First Class Honors degree in Manufacturing Engineering from Cambridge University. Pat Tomlinson President & CEO, Mercer Mr. Tomlinson is President and Chief Executive Officer of Mercer and Vice Chair of Marsh McLennan. Mr. Tomlinson also serves as CEO of Marsh McLennan US and Canada, with responsibility for leading across businesses to address clients’ increasingly interconnected risk, strategy and people challenges. Mr. Tomlinson joined Mercer in 2014 as US and Canada Career business leader and, from 2018 to 2020, led the US East Market, where he guided Mercer's Health, Wealth, and Career businesses to meet ever-changing client needs. Prior to joining Mercer, he spent 17 years with Aon and served as an officer in the US Army. Mr. Tomlinson is a graduate of the United States Military Academy at West Point with a bachelor of science in sociology. Marsh McLennan Board of Directors Anthony K. Anderson Bruce Broussard John Q. Doyle H. Edward Hanway Judith Hartmann Deborah C. Hopkins Tamara Ingram Jane Lute Steven A. Mills Morton O. Schapiro Jan Siegmund Lloyd M. Yates Anthony K. Anderson Mr. Anderson served as Vice Chair and Midwest Area Managing Partner of Ernst & Young LLP from 2006 until his retirement in April 2012. He joined Ernst & Young in 1977 and held various management positions during his 35-year career. Throughout his career, Mr. Anderson served the financial services industry, focused on insurance companies and brokers. Mr. Anderson served on the Board of the Federal Reserve Bank of Chicago from 2008 to 2010. He is a member of the American, California and Illinois Institutes of Certified Public Accountants. Mr. Anderson is a former director of Avery Dennison Corporation, Exelon Corporation, AAR Corporation and First American Financial Corporation. Bruce Broussard Bruce Broussard served as President and Chief Executive Officer of Humana Inc., a leading healthcare company, from 2013 through 2024. During his tenure, he led Humana through a period of significant transformation and growth, evolving it into an integrated health services organization with a strong focus on senior care. Prior to Humana, Mr. Broussard was Chief Executive Officer of McKesson Specialty/US Oncology, Inc., where he held senior leadership roles for over a decade—including CFO, President, CEO, and Chairman, guiding the company through substantial expansion and its eventual acquisition by McKesson.\n\n \n\nMr. Broussard also serves on the boards of directors of HP Inc., Cleveland Clinic and One Call. Additionally, he holds leadership positions in numerous advocacy organizations, including The Business Council and the American Heart Association’s CEO Roundtable. He is also the Chair of the Board of Directors of the Trust for the National Mall, a nonprofit philanthropic partner of the National Park Service dedicated to restoring and preserving the National Mall. John Q. Doyle Mr. Doyle is President and CEO of Marsh McLennan. Previously, Mr. Doyle served as Group President and Chief Operating Officer, responsible for the strategy and operational objectives of Marsh McLennan’s four global businesses. He joined the firm in 2016 as President of Marsh, then led Marsh as President and CEO from 2017 to 2021. An industry veteran with more than 35 years of management experience, Mr. Doyle began his career at AIG, where he held several executive positions. He is a Trustee of the Inner-City Scholarship Fund, a member of the Board of Overseers of the Maurice R. Greenberg School of Risk Management, Insurance and Actuarial Science at St. John’s University, and a member of the Board of the New York Police and Fire Widows’ and Children’s Benefit Fund. Mr. Doyle serves as the Chairman of the US Federal Advisory Committee on Insurance. H. Edward Hanway Mr. Hanway served as Chairman and Chief Executive Officer of CIGNA Corporation from 2000 until his retirement in 2009. From 1999 to 2000, he served as President and Chief Operating Officer of CIGNA. From 1996 to 1999, he was President of CIGNA HealthCare and from 1989 to 1996 was President of CIGNA International. Mr. Hanway is a former member of the Board of Directors of America’s Health Insurance Plans (AHIP). He is also a past Chairman of the Council on Affordable Quality Healthcare (CAQH) and has been active in a wide range of issues and initiatives associated with children’s health and education. He serves on the Board of Trustees of Drexel Neumann Academy and was the Chairman of the Faith in the Future Foundation committed to growth of Catholic education in the Archdiocese of Philadelphia. Judith Hartmann Judith Hartmann is an Operating Partner at Sandbrook Capital, a private investment firm focused on transforming energy infrastructure. From 2015 to 2022, Judith Hartmann was Deputy CEO and Group Chief Financial Officer of ENGIE S.A., a French multi-national utility company operating in the fields of electricity generation, energy transportation and distribution and energy services. She was the interim Co-CEO in 2020. She held P&L responsibility for the North American and UK/Ireland business units and oversaw Procurement and Corporate Social Responsibility (CSR). Prior to ENGIE, Ms. Hartmann served as Chief Financial Officer and member of the Executive Board of the international media and services corporation Bertelsmann SE & Co. KGaA from 2012 to 2015. Prior to that, she served in a number of financial and operational roles at General Electric since 2000 in the US, Latin America and Europe, including at Global Service, GE Healthcare Clinical Systems, GE Water Europe, Middle East & Africa, GE Healthcare Latin America and GE Germany. Before that, she held positions in The Walt Disney Company and Transport Canada. Ms. Hartmann serves on the Board of Directors of Ørsted A/S. She was a Non-Executive Director of Unilever, Suez, Electrabel, International Power, RTL Group, Penguin Random House and Gruner + Jahr. She holds a PhD in Economics (Hons) and an MBA from the WU University of Business Administration and Economics. Deborah C. Hopkins Ms. Hopkins was the founder and Chief Executive Officer of Citi Ventures and served as Citigroup’s first Chief Innovation Officer. Previously at Citi she was Chief Operations and Technology Officer of the company, Chief Information Security Officer and Senior Advisor to the Corporate and Investment Bank. She retired at the end of 2016. Prior to joining Citigroup in 2003 as Head of Corporate Strategy and M&A, she was Chief Financial Officer of Lucent Technologies and The Boeing Company and held senior-level positions at General Motors in the U.S. and Zurich and at Unisys Corporation, after starting her career at Ford. Ms. Hopkins was twice named to Fortune’s 10 most powerful women in business and was on Institutional Investor’s Top 50 list every year from 2011 until she retired. She is a director of Union Pacific Corporation and privately-held cybersecurity company, Deep Instinct. She is a former director of Bridge Investment Group, Compass Digital Acquisition Corporation, Virtusa Corporation, Qlik Technologies, E.I. DuPont de Nemours & Company and Dendrite International. Ms. Hopkins holds honorary doctorate degrees from Westminster College and Walsh College and a B.A. in Accounting from Walsh College. Tamara Ingram Ms. Ingram was Global Chairman of Wunderman Thompson, an international global advertising agency. Ms. Ingram held previous roles at WPP plc, a media conglomerate, including Global Chief Executive Officer of J. Walter Thompson, Grey UK’s Group Chief Executive Officer, Global Leader on their Procter & Gamble account, as well as roles at WPP’s wholly owned data investment division, Kantar. Prior to joining WPP plc, Ms. Ingram was Chief Executive Officer of McCann Worldgroup in London and Chief Executive Officer of Saatchi & Saatchi’s London office. Ms. Ingram previously served as a non-executive director of London Stock Exchange-listed companies Sage Group plc and Serco Group plc. She is a Trustee of Save the Children International (UK) and was awarded an OBE (Officer of the Most Excellent Order of the British Empire) for her services to tourism through her work as Chairman of Visit London. Ms. Ingram serves on the Board of Directors of Intertek plc, Marks & Spencer plc and Reckitt Benckiser Group plc. Jane Lute Ms. Lute is the Former Deputy Secretary of Homeland Security. She serves as a Strategic Director for SICPA North America, a company that protects the integrity and value of products, processes, and documents, including most of the world’s banknotes. Ms. Lute also served as Special Advisor to the Secretary-General of the United Nations, where she has held several positions in peacekeeping, peace building and political affairs. Previously, Ms. Lute served as Chief Executive Officer of the Center for Internet Security, an operating not-for-profit organization providing cybersecurity services for state, local, tribal and territorial governments. She began her distinguished career in the United States Army serving in Europe, Desert Storm, as well as on the National Security Council staff under both Presidents George H.W. Bush and William Jefferson Clinton. Ms. Lute holds a Ph.D. in political science from Stanford University and a J.D. from Georgetown University. Ms. Lute serves on the Board of Directors of Union Pacific Corporation and Shell plc and previously served as Director of Atlas Worldwide Holding Corporation. Steven A. Mills Mr. Mills was a senior executive at International Business Machines Corporation (IBM) before his retirement at the end of December 2015. Mr. Mills joined IBM in 1973 and during the course of his 40-plus-year career held various executive leadership positions across the company. At the time of his retirement, Mr. Mills was the Executive Vice President of Software & Systems, with responsibility for directing IBM’s $40 billion product business, which included over 100,000 employees spanning development, manufacturing, sales, marketing and support professions. Mr. Mills sits on Boards of privately held Syniti, Inc. and Accedian Networks, Inc. Morton O. Schapiro Mr. Schapiro is Executive Vice President and Senior Advisor of TWG Global and President Emeritus of Northwestern University. Prior to that, he was President and Professor of Economics at Northwestern University from 2009 to 2022. Previous positions include President and Professor at Williams College from 2000 to 2009, Dean of the College of Letters, Arts and Sciences of the University of Southern California from 1994 to 2000, the University's Vice President for planning from 1999 to 2000 and Chair of its Department of Economics from 1991 to 1994. Mr. Schapiro is among the nation’s leading authorities on the economics of higher education and has expertise in labor and development economics. Jan Siegmund Mr. Siegmund has over 30 years of experience in corporate finance, strategy and consulting. He served as Chief Financial Officer of Cognizant Technology Solutions, a professional services company, before retiring in early 2024. Prior to that, he was Corporate Vice President and Chief Financial Officer of Automatic Data Processing (ADP), a global provider of cloud-based human capital management solutions. He joined ADP in 1999 and worked in various roles of increasing responsibility at the company including President, Added Value Services, and Chief Strategy Officer from 2009 to 2012. Mr. Siegmund also serves on the Board of Directors of Western Union. Lloyd M. Yates Mr. Yates is the President and Chief Executive Officer of NiSource Inc., a position he has held since 2022. From 2012 until his retirement in 2019, Mr. Yates served in senior leadership roles with Duke Energy, including Executive Vice President and President of Duke Energy’s Carolinas Region and Executive Vice President of Customer Operations. Mr. Yates has more than 40 years of experience in the energy industry, including the areas of nuclear and fossil energy generation and delivery. Before the merger between Duke Energy and Progress Energy in July 2012, Mr. Yates served as President and Chief Executive Officer for Progress Energy Carolinas. Mr. Yates joined Progress Energy’s predecessor, Carolina Power & Light, in 1998. Before joining Progress Energy, he worked for PECO Energy for 16 years in several line operations and management positions. Marsh McLennan is the leader in risk, strategy and people, helping clients navigate a dynamic environment through four global businesses. Share Terms of Use Privacy Notice CA Privacy Accessibility Suppliers Cookie Notice © 2025 Marsh & McLennan Companies, Inc. All Rights Reserved."
    },
    {
      "url": "https://business.sebastianchamber.com/list/member/marsh-landing-restaurant-741",
      "text": "Marsh Landing Restaurant | Restaurants - Sebastian River Area Chamber of Commerce Skip to content Menu Chamber About Us Board of Directors Staff Employment Opportunities Committees Mural Program Economic Development Chamber Newsletter Contact Us Members Business Directory & Community Guide Member Directory Search Member to Member Deals Member News Member Login Become a Member Events Chamber Events Community Calendar Festivals & Special Events Area Our History Our Communities Business Directory & Community Guide Weather Real Estate Job Postings Photo/Video Gallery Request Information Visit Pelican Porch Visitor’s Center Digital Visitor Guide Festivals & Special Events Mural Trail Destination Videos Visit SRA Newsletter Visit SRA Facebook Marsh Landing Restaurant Categories Restaurants 44 N Broadway Street Fellsmere FL 32948 (772) 571-8622 (772) 571-8627 Send Email www.marshlandingrestaurant.com Hours: TUESDAY THRU FRIDAY: 11AM - 9PM SATURDAY - SUNDAY: 8AM - 9PM MONDAYS: CLOSED About Us The story of Marsh Landing is one that is rooted in the community, by creating a welcoming space for everyone to come together to enjoy authentic local cuisine. Owned and operated by a mother and daughter team, Fran and Susan Adams have created a unique and recognizable landmark in Fellsmere. Fran Adams grew up in the restaurant business, specializing in the local fare of fried chicken and barbecue, and as a Peace Corp volunteer in the 70’s and an elected official for 12 years, Fran spent her life in the service business. These traits and her talent for cooking, we’re embedded early on to her daughter Susan, so creating Marsh Landing together seemed like a natural fit. Frans daughter Susan Adams grew up in Fellsmere, enjoying the rural lifestyle of the area. She attended FSU earning her law degree, and immediately returned to Fellsmere carrying on the family tradition of community involvement and has served as an elected official for over 12 years. The lure of restoring a unique landmark while sharing local history, brought Fran and Susan back to the restaurant business where they work to preserve native Florida cuisine and culture and have been having a ball doing it! Video Media Highlights HOME DINE PRIVATE EVENTS CATERING ABOUT US Images Gallery Image marsh%20landing%201_240622-021536.jpg × Gallery Image marsh%20landing%202_240622-021555.jpg × Gallery Image marsh%20landing%203_240622-021616.jpg × Gallery Image marsh%20landing%204_240622-021637.jpg × Gallery Image marsh%20landing%205.jpg × Gallery Image marsh%20landing%206_240622-021721.jpg × Share × Print Email Facebook Twitter LinkedIn Pinterest Close Tell a Friend × Send Request Cancel © 2025 Sebastian River Area Chamber of Commerce | Site by GrowthZone Get In Touch! 772.589.5969 700 Main Street Sebastian, FL 32958 email Email Us Additional Resources IRC Disaster Preparedness Member Login Member Directory Become a Member Stay Connected! Join Our Mailing List © Sebastian River Area Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top"
    }
  ]
}