{
  "fuentes": [
    {
      "url": "https://www.martindownsgolfclub.com/our_story/index.html",
      "email": "info@martindownsgolfclub.com"
    },
    {
      "url": "https://martindownsgolfclub.com/contact/index.html",
      "email": "info@martindownsgolfclub.com"
    },
    {
      "url": "https://www.martindownsgolfclub.com/lifestyle/fine_dining",
      "email": "info@martindownsgolfclub.com"
    },
    {
      "url": "https://martindownsgolfclub.com/contact/eclub_signup",
      "email": "info@martindownsgolfclub.com"
    },
    {
      "url": "https://www.martindownsgolfclub.com/",
      "email": "info@martindownsgolfclub.com"
    }
  ],
  "mails": [
    "info@martindownsgolfclub.com"
  ],
  "nombre_sitio": "martindownsgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.martindownsgolfclub.com/our_story/index.html",
      "text": "MartinDownsGolfClubOfficialRails Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Elevate: Networking Social About Contact Us Meet The Team In the News Newsletters Employment Opportunities Eclub Home Our Story The Club Membership Tournaments History Gallery Lifestyle Spa Weddings And Events Contact Book your tee time BOOK YOUR TEE TIME Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events & Functions Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Tickets Elevate: Networking Social About Contact Meet The Team In the News Newsletters Employment Opportunities Eclub Sign Up OUR STORY The Pride of Martin\n                County Designed\n                by legendary Treasure Coast Golf Architect Charles Ankrom in the late 70's, Martin Downs Country Club is\n                situated on 83 acres of beautiful Floridian land, lush with greens that roll fast. With five\n                sets of tees, Martin Downs Country Club has become a staple of the Martin County community, beloved by\n                both veterans and newcomers in the sport of golf. Our Team Stanley Campbell Club Owner Read More Jesus Romero Vice President Course Operations and Maintenance Randy Radecki Head Chef/Food and Beverage Manager Jennifer Davis ProShop Manager Xavier Williams Golf Tournament Director Mike Russell Outside Operations Manager Sharon Lightbourne Spa Manager Close Sign up for our Eclub to receive news, early notification of events and promos etc. Subscribe (772) 286-6818 info@martindownsgolfclub.com 3801 SW Greenwood Way, Palm City, FL 34990 Facebook Twitter Instagram © 2025, Martin Downs\n      Country Club. All Rights Reserved."
    },
    {
      "url": "https://martindownsgolfclub.com/contact/index.html",
      "text": "MartinDownsGolfClubOfficialRails Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Elevate: Networking Social About Contact Us Meet The Team In the News Newsletters Employment Opportunities Eclub Home Our Story The Club Membership Tournaments History Gallery Lifestyle Spa Weddings And Events Contact Book your tee time BOOK YOUR TEE TIME Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events & Functions Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Tickets Elevate: Networking Social About Contact Meet The Team In the News Newsletters Employment Opportunities Eclub Sign Up CONTACT CONTACT INFORMATION AND DIRECTIONS (772) 286-6818 info@martindownsgolfclub.com 3801 SW Greenwood Way Palm\n                          City, FL 34990 General Inquiries – 772-286-6818 Tee Times/Pro shop Information – 772-286-6818 Dining Reservations – 772-286-6818 EXT 3 Memberships – 772-286-6818 Billing Department– 772-286-6818 Weddings and Events – 772-286-6818 Spa – 772-286-6818 Directions from Palm Beach Int’l Airport: From PBI, Start out going east on Turnage Blvd toward Perimeter Rd then Merge onto I-95 N toward W Palm Bch. Go into SW High Meadow Ave/County Hwy-713 via EXIT 102 toward County Hwy-713.Take left at SW Martin Downs Blvd/FL-714 then Turn left onto Sandhill Rd. Finally Turn right onto SW Greenwood Way to reach gate. Contact US Doesn’t matter if you are joining us for drinks and a breakfast, lunch or dinner in one of our restaurants, or hosting a sports or formal event, we have it all. Sign up for dining, event specials and MDCC Clubhouse updates. If you have any question, comment, or concern? Please let us know below. Name Email State State AK AL AR AS AZ CA CO CT DC DE FL GA GU HI IA ID IL IN KS KY LA MA MD ME MI MN MO MP MS MT NC ND NE NH NJ NM NV NY OH OK OR PA PR RI SC SD TN TX UM UT VA VI VT WA WI WV WY Message Subscribe **By signing up, you are opting in to receive communication from the Martin Downs Country Club. You may opt out at any time. Sign up for our Eclub to receive news, early notification of events and promos etc. Subscribe (772) 286-6818 info@martindownsgolfclub.com 3801 SW Greenwood Way, Palm City, FL 34990 Facebook Twitter Instagram © 2025, Martin Downs\n      Country Club. All Rights Reserved."
    },
    {
      "url": "https://www.martindownsgolfclub.com/lifestyle/fine_dining",
      "text": "MartinDownsGolfClubOfficialRails Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Elevate: Networking Social About Contact Us Meet The Team In the News Newsletters Employment Opportunities Eclub Home Our Story The Club Membership Tournaments History Gallery Lifestyle Spa Weddings And Events Contact Book your tee time BOOK YOUR TEE TIME Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events & Functions Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Tickets Elevate: Networking Social About Contact Meet The Team In the News Newsletters Employment Opportunities Eclub Sign Up Fine dining AWARD-WINNING CHEFS ARE SERVING FINE DINING CUISINE, AMIDIST STUNNING PATIO AND LAKE FRONT VIEWS. Make A Reservation To make a reservation, please reserve online above or contact our dining room at 772.286.6818 EXT 3. Hours of Operations Lunch: 11:00 am – 5:00 pm (Mon-Sat) Happy Hour:  4:00 pm – 6:00 pm (Mon-Fri) Dinner:  5:00 pm – 7:00 pm Sunday :  9:00 am – 7:00 pm A Taste of South Florida As a major fishing enclave in the United States, South\n                  Florida combines local recipes with a rich, cultural\n                  influence from Latin, American, and Caribbean nations to\n                  bring you a unique culinary experience. Stay tuned for more information on our restaurant's\n                  grand re-opening. Sign up for our Eclub to receive news, early notification of events and promos etc. Subscribe (772) 286-6818 info@martindownsgolfclub.com 3801 SW Greenwood Way, Palm City, FL 34990 Facebook Twitter Instagram © 2025, Martin Downs\n      Country Club. All Rights Reserved."
    },
    {
      "url": "https://martindownsgolfclub.com/contact/eclub_signup",
      "text": "MartinDownsGolfClubOfficialRails Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Elevate: Networking Social About Contact Us Meet The Team In the News Newsletters Employment Opportunities Eclub Home Our Story The Club Membership Tournaments History Gallery Lifestyle Spa Weddings And Events Contact Book your tee time BOOK YOUR TEE TIME Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events & Functions Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Tickets Elevate: Networking Social About Contact Meet The Team In the News Newsletters Employment Opportunities Eclub Sign Up Eclub SignUp JOIN THE MARTIN DOWNS COUNTRY CLUB ECLUB Please complete the information below to become a member of our Eclub Sign up for our Eclub to receive news, early notification of events and promos etc. Subscribe (772) 286-6818 info@martindownsgolfclub.com 3801 SW Greenwood Way, Palm City, FL 34990 Facebook Twitter Instagram © 2025, Martin Downs\n      Country Club. All Rights Reserved."
    },
    {
      "url": "https://www.martindownsgolfclub.com/",
      "text": "MartinDownsGolfClubOfficialRails Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Elevate: Networking Social About Contact Us Meet The Team In the News Newsletters Employment Opportunities Eclub Home Our Story The Club Membership Tournaments History Gallery Lifestyle Spa Weddings And Events Contact Book your tee time BOOK YOUR TEE TIME Home Our Story History Gallery Past Events Gallery Golf Membership Book the Tee time Rates MDCC- FAQ Special Offers Tournament Calendar Past Tournaments Gallery Private Events & Functions Weddings And Events Spa Fine Dining Chippers Bistro On Green Reserve Dining Order Food Now Upcoming Events Tickets Elevate: Networking Social About Contact Meet The Team In the News Newsletters Employment Opportunities Eclub Sign Up Our Back 9 is closed for improvements until Nov 9th. The front 9 is open with temporary greens, so you can still enjoy a round with us! South Florida's\n            premier golf Destination A FORMER pga &\n            us tour qualifying course Situated on 200\n            acres of natural floridian scenery Previous Next The Pride of Martin County Martin Downs Country Club is situated on 83 acres of beautiful Floridian land. Contact US Sorry, your browser doesn't support embedded videos. The Martin Downs Story Built in the late 70's, Martin\n                      Downs carries a rich history in the evolution of South Florida golf. Read Our Story A PGA Qualifying Course Explore and see what makes Martin\n                      Downs the choice for both the PGA and US Tour qualifiers. Tournaments History Gallery A Distinctive Lifestyle Martin Downs aims to transform the\n                      sport of golf into a lifestyle that promotes health and wellness, regardless of age or ability. Events Health And Wellness Fine Dining Our Club Offerings Tournaments Events Fine Dining Sign up for our Eclub to receive news, early notification of events and promos etc. Subscribe (772) 286-6818 info@martindownsgolfclub.com 3801 SW Greenwood Way, Palm City, FL 34990 Facebook Twitter Instagram © 2025, Martin Downs\n      Country Club. All Rights Reserved."
    }
  ]
}