{
  "fuentes": [
    {
      "url": "https://artist.callforentry.org/festivals_unique_info.php?ID=7873",
      "email": "jhearn@martinarts.org"
    },
    {
      "url": "https://artist.callforentry.org/festivals_unique_info.php?ID=7873",
      "email": "jhearn@martinarts.org"
    },
    {
      "url": "https://artist.callforentry.org/festivals_unique_info.php?ID=7873",
      "email": "juriedshow@martinarts.org"
    },
    {
      "url": "https://www.martinarts.org/resources/magazine.html",
      "email": "kjohnson@martinarts.org"
    },
    {
      "url": "https://www.martinarts.org/resources/magazine.html",
      "email": "thill@martinarts.org"
    },
    {
      "url": "https://shopmartins.com/pages/contact-us",
      "email": "logo_59499fe3-e930-4190-90cf-419de8a6e530_110x@2x.png"
    },
    {
      "url": "https://shopmartins.com/pages/contact-us",
      "email": "logo_59499fe3-e930-4190-90cf-419de8a6e530_320x@2x.png"
    },
    {
      "url": "https://shopmartins.com/pages/contact-us",
      "email": "logo_x65@2x.png"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.martinarts.org/court-house-cultural-center/currentexhibitions.html",
      "email": "jhearn@martinarts.org"
    },
    {
      "url": "https://www.martinarts.org/resources/artist-directory.html",
      "email": "thill@martinarts.org"
    },
    {
      "url": "https://www.biography.com/activists/martin-luther-king-jr",
      "email": "editor@biography.com"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://www.martinarts.org/support_us/shop-local.html",
      "email": "clasaga@martinarts.org"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://business.stuartmartinchamber.org/members/member/martinarts-1958",
      "email": "info@stuartmartinchamber.org"
    }
  ],
  "mails": [
    "clasaga@martinarts.org",
    "editor@biography.com",
    "info@reception-plus.de",
    "info@scibpaints.com",
    "info@stuartmartinchamber.org",
    "jhearn@martinarts.org",
    "juriedshow@martinarts.org",
    "kjohnson@martinarts.org",
    "logo_59499fe3-e930-4190-90cf-419de8a6e530_110x@2x.png",
    "logo_59499fe3-e930-4190-90cf-419de8a6e530_320x@2x.png",
    "logo_x65@2x.png",
    "sales@finewineliquors.com",
    "thill@martinarts.org"
  ],
  "nombre_sitio": "martinarts.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://artist.callforentry.org/festivals_unique_info.php?ID=7873",
      "text": "CaFÉ - Back to Top Cafe Help Close MENU CLOSE Find Calls Calendar Help Blog Contact Us Login Artist Sign Up Email verification is rolling out for CaFÉ accounts, starting today. Learn more on our FAQ Page. Skip to Content Find Calls Calendar Help Blog Contact Us Login Artist Sign Up Call Detail Back to Participating Calls 30th Annual All Florida Juried Arts Show Visit Organization Website Contact Email: Jhearn@martinarts.org Contact Phone: Call Overview Entry Deadline : 8/24/20 Application Closed Entry Fee (30th Annual All Florida Juried Arts Show): $40.00 Artist Membership to The Arts Council of Martin County (optional): $35.00 Work Sample Requirements Images | Minimum: Min. 1, Maximum: Max. 3 Total Samples | Minimum: Min. 1, Maximum: Max. 3 Call Type : Exhibitions Eligibility : Regional State : Florida Call Description A Juried Exhibition presented by The Arts Council, Inc., of Martin County, Florida | www.martinarts.org The Arts Council of Martin County, Florida invites artists residing in Florida to participate in its 30th Annual All Florida Juried Arts Show. Selected works will be exhibited at the Court House Cultural Center from Tuesday, October 13 through Saturday, December 12, 2020. Located in historic downtown Stuart, the Arts Council of Martin County has been a leader in the arts community since 1980. By providing services to visual and performing artists, arts organizations, students and the public, the Arts Council strives to inspire participation and passion for the arts in our community. The Arts Council provides various programs for the community including ArtsFest, The Court House Cultural Center Gallery and maintains an initiative to support arts education. Eligibility Open to artists residing in Florida. Exhibition dates October 13 - December 12, 2020 Location and Hours Court House Cultural Center, 80 E Ocean Blvd., Stuart, Florida 34994 | 772.287.6676 Gallery hours* are Tuesday 10 AM to 6 PM | Wednesday - Saturday, 10 AM to 4 PM (*during exhibits only) Important dates Submission Deadline: August 24, 2020 11:59 PM, Mountain Time Selection notice: on or before September 10, 2020 Delivery of artwork: Monday, October 5, 12PM – 4PM.  Shipped work may arrive between October 1-5, 2020. Exhibition Opening Reception & Awards: TBD Pick up artwork: Monday, December 14, 2020, from 12PM – 4PM Entry Form, Fees and Deadline Applications, fees and images must be received by CaFÉ ( www.callforentry.org ) on or before August 24, 2020 by 11:59 PM Mountain Time to be considered. No applications, images or fees will be accepted after the deadline or by mail. A non-refundable entry fee of $40.00 for up to three (3) entries.  A maximum of three (3) entries may be submitted per artist.   Visa and MasterCard payments are submitted through CaFÉ The Arts Council of Martin County member artists receive a $5 discount.  Please contact Jennifer Hearn, 772.287.6676 ext 2 or email jhearn@martinarts.org, Monday - Friday 10am-4pm to check member status and get the Member Artist Code BEFORE you submit your application. Artwork and Digital Images For each submitted image please include the title, medium, price, year completed, and the FRAMED size for 2D or all dimensions for 3D/sculpture. 2D work must be properly framed with wire attached for hanging, using plexi-glass only, no glass. Gallery wrapped canvases with finished edges are acceptable.  Maximum framed width to be no larger than 60\".  3D work limited to 70 lbs maximum weight. Write a detailed description of the medium for all work. 2D and 3D original work in all media completed in the last 36 months and not previously exhibited at the Court House Cultural Center, The Elliott Museum, or any other local art exhibit held within 50 miles either in person or virtually. Giclees will be accepted in photography only. Images must conform to CaFÉ guidelines. For more information on image preparation visit the CaFÉ website at www.callforentry.org/media prep. Shipped Artwork Ship to: The Arts Council, Inc, attn Jennifer Hearn, 80 SE Ocean Blvd, Stuart, FL 34994. Arrival dates:  Oct 1-5, 2020.  Due to our limited storage area, please be sure your works arrive in this timeframe only. Artists are responsible for shipping and insuring their work. Shipped work must be insured during transport and sent in reusable containers. All claims for artwork damaged in shipment are the responsibility of the artist and shipper. The Arts Council provides insurance coverage for artwork on its property from date of delivery to the day artwork is picked up on Monday, December 14, 2020. Artists are financially responsible for arranging the return of any unsold artwork. A FedEx pre-paid return shipping label is required for any art that will be return shipped at the end of the exhibit that includes all fees (the shipper's pick-up fee and the return shipping fee). The label may be included with shipment, emailed, or mailed to our offices prior to the end of the exhibit. Artwork Pick Up Artists are responsible for making necessary arrangements to pick up their artwork. The Arts Council will not be responsible for unclaimed artwork after Monday, December 14, 2020. Sales A 25% donation benefiting the Arts Council, Inc. will be deducted from all sales. Awards First $500, Second $200, Third $100 and up to four Honorable Mentions $50. Questions Please email questions to juriedshow@martinarts.org or jhearn@martinarts.org . Please mention “juried show” in the subject line of the email. Juror Lisa Rockford Lisa Rockford, founder of Rockford Projects, is an independent curator, artist, and educator. As a passionate avid arts advocate, she has organized multi-disciplinary exhibitions, public lectures, artist workshops, and interactive experiences, all designed to be accessible to a broad audience, spark dialogue, and act as a catalyst for cultural exchange. To learn more about the juror visit: https://rockfordprojects.weebly.com/ Application Requirements Eligibility Criteria Print this Page View Rules & Terms to Apply Share Share Legal Agreement Conditions\n\nA non-refundable entry fee of $40.00 for up to three (3) entries.\n\nArtists are encouraged to price their work for sale. A 25% donation benefiting the Arts Council will be deducted from all sales.\n\nNo withdrawals of work permitted before the close of the exhibition.\n\nAll artwork must be an original work completed in the last 36 months and not previously exhibited at the Court House Cultural Center, The Elliott Museum, or any other local art exhibit held within 50 miles either in person or virtually.\n\nLabel back of each artwork with artist’s name, hometown, phone, email, title, medium, price and framed size.\n2D work must be properly framed with wire attached for hanging, using plexi-glass only, no glass. Maximum framed width to be no larger than 60\". 3D work limited to 70 lbs maximum weight. Artists submitting installation artwork must participate in its installation.\n\nThe Arts Council reserves the right to reject any accepted artwork if the work is improperly framed, wired, and/or is misrepresented by the submitted digital image.\n\nThe Arts Council reserves the right to use any accepted image for promotional purposes. Close Find Calls Help Blog Contact Us Login Artist Sign Up Terms of Service Privacy Policy ©2005-2025 CaFÉ TM | Creative West (formerly WESTAF) Commitment to Accessibility | Share Feedback Commitment to Accessibility | Share Feedback ©2005-2025 CaFÉ TM | Creative West (formerly WESTAF)"
    },
    {
      "url": "https://www.martinarts.org/resources/magazine.html",
      "text": "MartinArts Magazine | Arts News Martin County FLl | arts information Skip to main content ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources search MENU RESOURCES MartinArts Magazine Current Issue: Click image to see the digital version. Advertise in MartinArts Magazine View Art St. Lucie Magazine Businesses and Organizations, please email T ori Hill to be added to our delivery list. Note: This does not include residential addresses. If you would like to be added to our USPS mailing list, please consider registering as a member . Thank you! Past Issues of MartinArts Magazines: 1 2 3 MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources 80 Southeast Ocean Boulevard Stuart, FL 34994 Council (772) 287-6676 Foundation (772) 288-5397 Office Hours: M-F 9AM - 5PM (Except Holidays) Court House Cultural Center Gallery Hours: Tuesday, 10AM - 6PM | Wednesday - Saturday 10AM-4PM Explore Contact Us Magazine SHS Project Follow Us Instagram Facebook ©\n          2025\n           – \n          MartinArts\n           – Crafted by Firespring Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources Follow Us Instagram Facebook MENU CLOSE"
    },
    {
      "url": "https://shopmartins.com/pages/contact-us",
      "text": "Contact Us\n– Martin's Skip to content Close menu Junior Trending Collections The Fall Edit Halloween Best Dressed Fitsporation Hey Santa Tops Tops T-shirts Sweaters Jackets Dresses Athletic Curvy Sizes Bottoms Jeans Pants Shorts & Capris Skirts Women Tops Tops Sweaters Jackets Dresses Curvy Sizes Bottoms Jeans Pants Skirts Shorts & Capris Shoes Women's Shoes Now Trending Casual Boots Sandals Athletic Dress Men's Shoes Casual Boots Sandals Athletic Dress Children's Shoes Featured Brands Corkys UGG Hey Dude Birkenstock L'Artiste Accessories Women's Purses & Wallets Jewelry Headwear Bags & Backpacks Socks Cold Weather Men's Caps Bags & Backpacks Socks Cold Weather Featured Accessories Kendra Scott Consuela Hobo Men Shirts Jackets Jeans & Pants Shorts Loungewear Athletics Home & Gifts Product Type Home Decor Kitchen Kids & Baby Candles & Melts Stationary & Books Outdoor Living Wall Decor Toys Greeting Cards Gift Wrap Drinkware Stationary & Books Ornaments Hallmark Gold Crown Shop Ornaments Seasonal Collections Fall Home Christmas The Faith Collection Special Collections Trending Footwear The Faith Collection Arkansas- Red White & WPS Sale Gift Guide Gifts for Guys Self Care Essentials Log in Instagram Facebook Twitter Pinterest Cart Close cart Site navigation Log in Search 0 Cart Your cart is currently empty. Junior Trending Collections The Fall Edit Halloween Best Dressed Fitsporation Hey Santa Tops Tops T-shirts Sweaters Jackets Dresses Athletic Curvy Sizes Bottoms Jeans Pants Shorts & Capris Skirts Women Tops Tops Sweaters Jackets Dresses Curvy Sizes Bottoms Jeans Pants Skirts Shorts & Capris Shoes Women's Shoes Now Trending Casual Boots Sandals Athletic Dress Men's Shoes Casual Boots Sandals Athletic Dress Children's Shoes Featured Brands Corkys UGG Hey Dude Birkenstock L'Artiste Accessories Women's Purses & Wallets Jewelry Headwear Bags & Backpacks Socks Cold Weather Men's Caps Bags & Backpacks Socks Cold Weather Featured Accessories Kendra Scott Consuela Hobo Men Shirts Jackets Jeans & Pants Shorts Loungewear Athletics Home & Gifts Product Type Home Decor Kitchen Kids & Baby Candles & Melts Stationary & Books Outdoor Living Wall Decor Toys Greeting Cards Gift Wrap Drinkware Stationary & Books Ornaments Hallmark Gold Crown Shop Ornaments Seasonal Collections Fall Home Christmas The Faith Collection Special Collections Trending Footwear The Faith Collection Arkansas- Red White & WPS Sale Gift Guide Gifts for Guys Self Care Essentials Search \"Close (esc)\" View more Contact Us You can reach us by phone at 800-952-2251 or by filling out the form below. Name Email Message Send This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. SUBSCRIBE » Information Information Contact Us About Us Shipping Returns Job Openings Shopping Shopping Brand List Visit Our Store Sizing Help Connect With Us Connect With Us Facebook Instagram Twitter Pinterest © 2025 Martin's // All Rights Reserved Previous Next \"Close (esc)\""
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.martinarts.org/court-house-cultural-center/currentexhibitions.html",
      "text": "Exhibitions : COURT HOUSE CULTURAL CENTER : MartinArts Skip to main content ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources search MENU COURT HOUSE CULTURAL CENTER Exhibitions Current Exhibit... Uncommon Threads: Contemporary Fiber Exhibition showing 2D, 3D, and Wearable Art Uncommon Threads: Contemporary Fiber & Wearable Art is a national juried exhibition by the South Florida Surface Design Group that celebrates the innovative use of fiber in contemporary art and design. Showcasing bold, boundary-pushing works, it redefines expectations of textile and wearable art through creative expression and global perspectives. Exhibit Dates | September 9 - November 1, 2025 Opening Reception | Friday, September 12, 5:30–7PM Closing Reception | Saturday, November 1, 2–4PM Featuring artists: Yochi Y. Avin, Patti Barker, Linda Barlow, Lisa Binkley, Kim Borowy, Afton Boyd, Betty Busby, Al Canner, Chris Carlson, Suzanne Connors, Lauren Dawson, Lynn Doyal, Linda Facci, Andrea Finch, Barbara Fugazzotto, Muffy Clark Gill, Ania Gilmore, Valerie Goodwin, Kerr Grabowski, Amy Gross, Lindsay Hager, Michele Hardy, Ana Lisa Hedstrom, Cathy Heeter, Joanna Hoge, Andrea Huffman, Doris Hulse, Kathy Knapp, Sarah Knouse, Leeann Kroetsch, Bonnie Kuhr, Alice Laputka, Anna Lasik, Claudia Lee, Jacqueline Mallegni, Jo-Ann Morgan, Amy Nguyen, Theresa Olson, Kathy Pallie, Susan Peck, Isabel Perez, Judy Polstra, Wen Redmond, Cajah Reed, Susan Rienzo, Meryl Ruth, Susan Sadow, Sonya Sanchez Arias, Joseph Schairer, Terri Shinn, Nancy Jo Smith, Jennifer Stafford, Michelle Tillander, Charity Van der Meer Musoma, Marian Zielinski Thank you Exhibit Sponsors: Become an Exhibit Sponsor Upcoming Exhibits... Will It Go Round in Circles November 11 – December 20 Will It Go Round in Circles Three Artists. Three Paths. One Reunion. Will It Go Round in Circles? is a vibrant, thought-provoking exhibition featuring the work of three dynamic and widely recognized artists, each on a journey that’s come full circle. Though distinct in style and medium, their paths have led them back to the core of why they create: not to repeat the past, but to rediscover it through fresh eyes. This show is a celebration of artistic evolution—where bold reinventions meet quiet returns to form. It’s about coming back, not to the beginning, but to something richer, wiser, and more resonant. Their work reflects years of exploration, intuition, and creative risk—each piece offering a renewed connection to personal vision. The paths of these three artists converge in one compelling space, where continuity and change unfold in equal measure. What emerges is an invitation to slow down—an opportunity to engage deeply, whether you're a seasoned art lover, a dedicated collector, or simply seeking inspiration. Featuring Artists: Maria G. Miele, Thomas Prestopnik, Linda Reymore Exhibit Dates: November 11 - December 20, 2025 Opening Reception: Thursday, November 13 | 5:30-7PM Walk & Talk with Artists | Saturday, November 22, 10AM 35th Annual All Florida Juried Art Show January 9 - February 28 35th Annual All Florida Juried Art Show A 35-year legacy exhibition showcasing recent art by all Florida artists in all media. Exhibited works span the mediums of watercolor, ceramics, acrylic, oil, photography, clay, encaustic, wood, metal, glass, and intaglio from 44 artists from Tallahassee to Miami. Exhibit dates : January 13 - February 28, 2026 Opening & Awards Reception Friday, January 9 | 5:30PM–7PM Juror's Lecture: Saturday, January 10 at 11AM Juror: Donne Bitner To learn more about the juror visit: https://www.donnebitner.com/ Apply by October 1 Cover Image: 1st Place 2025 \"18005” by Christian Feneck The Florida Artists Group - Everglow March 10 - April 18 The Florida Artists Group - Everglow Florida’s textures and light create an everlasting experience that affects all who live here. This Florida Artists Group (FLAG) exhibition highlights a powerhouse of art by professional visual artists living in Florida whose artistic content is as diverse as they are. Their extraordinary artworks reveal contrasting color spectrums, sensory-enlightening textures, and presents in multifarious forms. Visitors will experience 2D and 3D artworks, from realistic to abstract and fanciful, created in oil and acrylic painting, colored pencil, watercolor, mixed media, clay, paper mâché, bronze, fiber, photography, digital art, and more. With such a wide variety of styles, materials, and viewpoints, this exhibition will be exciting and memorable. Exhibit Dates: March 10 - April 18, 2026 Opening Reception: Friday, March 13 | 5:30-7PM Featuring artists from the Florida Artists Group To learn more visit: https://www.floridaartistsgroup.org/ Cover Image: Hope\" by Jeffrey Baisden Marvin S. Cone 40th Annual High School Juried Art Show April 28 - June 20 Marvin S. Cone 40th Annual High School Juried Art Show Featuring art work from students of Martin County, Jensen Beach, and South Fork High Schools, The Pine School, and Clark Advanced Learning Center Exhibit Dates : April 28 - June 20, 2026 Awards Reception : TBD | 5:30-7PM Sponsorship Opportunities available Cover Image: Best of Show 2025 “The Distinguished Ram” by Brayden Thomas, The Pine School Past Exhibitions Curious about what’s been on view? Explore our rich history of exhibitions featuring local, regional, and national artists. Browse past shows to revisit highlights and discover how our gallery programming has evolved over the years. Discover Our Exhibition History Hours & Accessibility Gallery Location: 80 SE Ocean Blvd., Stuart, FL 34994 *Gallery Hours (only during an exhibit) Tuesday 10AM–6PM and Wednesday–Saturday 10AM–4PM or by appointment A donation of $5 in support of our exhibitions and programs is requested. MartinArts and its galleries are accessible to all. The south entrance is wheelchair accessible as are all spaces within the first floor. We are pleased to try to accommodate other reasonable requests from patrons needing additional assistance with adequate notice. Sponsored in part by the State of Florida through the Division of Arts and Culture and the National Endowment for the Arts, Martin County Board of County Commissioners, and private contributions. Interested in scheduling a group visit? Contact us at 772-287-6676 x2 or by email at jhearn@martinarts.org Learn about our Volunteer Opportunities Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee 80 Southeast Ocean Boulevard Stuart, FL 34994 Council (772) 287-6676 Foundation (772) 288-5397 Office Hours: M-F 9AM - 5PM (Except Holidays) Court House Cultural Center Gallery Hours: Tuesday, 10AM - 6PM | Wednesday - Saturday 10AM-4PM Explore Contact Us Magazine SHS Project Follow Us Instagram Facebook ©\n          2025\n           – \n          MartinArts\n           – Crafted by Firespring Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources Follow Us Instagram Facebook MENU CLOSE"
    },
    {
      "url": "https://www.martinarts.org/resources/artist-directory.html",
      "text": "Artist Directory : RESOURCES : MartinArts Skip to main content ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources search MENU RESOURCES Artist Directory Browse the MartinArts artist directory to find current artist members. Are you a visual artist, actor, writer, musician, dancer or chef that would like to be listed on our registry? Become a MartinArts member today! For current artist members who would like to make updates to their listing, please email Tori Hill 2 Way Street Port St. Lucie, FL Performing Artist - Music Edgardo Abello Stuart, FL Visual Artist, 2D Ilene Adams Jupiter, FL Visual Artist - 2D Alex Akerberg Stuart, FL Visual Artist - 3D Caren Akers Jensen Beach, FL Visual Artist - 2D Glen Allen Stuart, FL Photography Elisa Amari Stuart, FL Visual Artist Deborah Aronovici Port St. Lucie, FL Visual Artist, 2D Jane Baldridge Stuart, FL Mixed Media Terry Barber Robbinsville, NJ Performing Artist - Music & Theatre Teaching Artist Lynne Barletta Palm City, FL Painting, Murals Deborah Beckmann Palm City, FL Visual Artist, 2D Kathryn Bell Hobe Sound, FL Jewelry Lynn Bell Stuart, FL Ceramics Michaelann Bellerjeau Stuart, FL Painting Kimberly Beltrame Jensen Beach, FL Visual Artist - 2D Hye-Yun Chung Bennett Stuart, FL Dinija Berkien Palm City, FL Visual Artist - 2D Nataly Biskay Palm City, FL Visual Artist, 3D Mallo Bisset Palm City, FL Visual Artist - 2D Ali Blaylock Stuart, FL Literary Artist, Visual Artist - 2D Deborah Bottorff Stuart, FL Mixed Media Jerilyn Brown West Palm Beach, FL Visual Artist, 2D Teaching Artist Sally Browning-Pearson Port St. Lucie, FL Visual Artist - 2D Teaching Artist Alexandra Bruce Jensen Beach, FL Visual Artist - 2D Barbara Bucci Stuart, FL Visual Artist Holly Cannon Palm City, FL Visual Artist, 2D Marco Carcich Stuart, FL Visual Artist - 2D Lauren Carstensen Stuart, FL Visual Artist, 2D Nanette Carton Hobe Sound, FL Visual Artist - 2D John Ciambriello Stuart, FL Visual Artist - 2D Amy Clark Stuart, FL Performing Artist - Music Teaching Artist Mitch Clark Port St. Lucie, FL Visual Artist, 2D Robert ClenDening Jr. Palm City, FL Visual Artist, 2D & 3D Susan Clifford Stuart, FL Visual Artist - 2D Jennifer Collins Stuart, FL Literary Artist Suzanne Connors Stuart, FL Visual Artist - 3D Teaching Artist Edwidg Constant Stuart, FL Literary Artist Visual Artist - 2D Teaching Artist Susan 'Shoshana' Cooper Jensen Beach, FL Visual Artist - 2D Kristina Costello Stuart, FL Musician, Teaching Artist Cheryl Cote Palm City, FL Painting Liliana Crespi Port St. Lucie, FL Visual Artist - 3D LauraKay Whiticar-Darvill Stuart, FL Visual Artist - 3D Adrienne Davis Palm Beach Gardens, FL Painting Michael Davis Stuart, FL Painting Sue Appleton Dayton Jupiter, FL Visual Artist, 2D Diana R Dean Stuart, FL Pastel Katie Deits North Palm Beach, FL Visual Artist, 2D & 3D Constance DelGiudice Palm City, FL Painting Maria Delucia Stuart, FL Visual Artist, 2D Evangelia Deslis Hobe Sound, FL Painting Diane Di Maio Fort Pierce, FL Visual Artist, 2D Nancy Dillen Melbourne, FL Visual Artist, 2D Len Dinter Stuart, FL Painting Angelica Dorizas Port St. Lucie, FL Visual Artist - 2D, 3D MJ Dowling Stuart, FL Visual Artist - 2D Lesley Driver Palm City, FL Visual Artist, 2D Doug Drumm Stuart, FL Visual Artist, 2D & 3D Gina Duffy Port St. Lucie, FL Visual Artist Judith Eisinger Royal Palm Beach, FL Visual Artist, 2D Sarah El-Ali Stuart, FL Visual Artist, 2D Jose Farinos Palm City, FL Visual Artist - 2D Sharon A. Ferina Jensen Beach, FL Painting, Artist Intructor Michelle Foligno Stuart, FL Visual Artist - 2D Visual Artist - 3D Thomas Forster Stuart, FL Visual Artist - 2D Teaching Artist Carrie Fox Jensen Beach, FL Performing Artist - Music Donna Franklin Port St. Lucie, FL Visual Artist, 2D Diane Freaney Stuart, FL Literary Artist Barbara Fugazzotto Jensen Beach, FL Mixed Media Alyssa Fuggetta Port St. Lucie, FL Visual Artist, 2D Mathew Fuller Palm City, FL Visual Artist, 2D Dot Galfond Palm City, FL Visual Artist - 3D Torenzo Gann Stuart, FL Visual Artist - 2D Teaching Artist Lanjiabao Ge Port St. Lucie, FL Musician, Teaching Artist Viktor Genel Hutchinson Island, FL Visual Artist, 3D Katie Gianni Stuart, FL Painting, Ink Charlotte Glover Stuart, FL Visual Artist, 2D Eduardo Gomez Jensen Beach, FL Sculpture Neil Goodenough Stuart, FL Visual Artist, 2D Lorraine Goss Port St. Lucie, FL Ceramic Christina Goudeau Stuart, FL Painting/Mixed Media Kate Gouery Tequesta, FL Visual Artist, 2D & 3D Margaret Gray Palm City, FL Painting Kathryn “Kitt” Grof-Tisza Fort Pierce, FL Visual Artist 2D, 3D Gloria Gronowicz Stuart, FL Visual Artist - 2D Al Hager Stuart, FL Performing Artist - Music Lindsay Hager Stuart, FL Performing Artist - Music Sharon Hagin Stuart, FL Photography Olga Hamilton Stuart, FL Visual Artist Barbara Hann Key Largo, FL Visual Artist, 2D; Teaching Artist Leslie Hanner Port St. Lucie, FL Visual Artist, 2D John Hart Stuart, FL Visual Artist 3D Lucinda Herlihy Jensen Beach, FL Painting Jillane Heveron Port St. Lucie, FL Painting Kimberly Hogan Hobe Sound, FL Visual Artist, 2D Shah Hosein Port St. Lucie, FL Visual Artist - 2D Dominique Italiano Hobe Sound, FL Visual Artist - 2D Heather Ivins Stuart, FL Painting, Drawing Denise Jackson Stuart, FL Painting Kelly Jadon Jensen Beach, FL Visual Artist, 3D 1 2 3 MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources 80 Southeast Ocean Boulevard Stuart, FL 34994 Council (772) 287-6676 Foundation (772) 288-5397 Office Hours: M-F 9AM - 5PM (Except Holidays) Court House Cultural Center Gallery Hours: Tuesday, 10AM - 6PM | Wednesday - Saturday 10AM-4PM Explore Contact Us Magazine SHS Project Follow Us Instagram Facebook ©\n          2025\n           – \n          MartinArts\n           – Crafted by Firespring Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources Follow Us Instagram Facebook MENU CLOSE"
    },
    {
      "url": "https://www.biography.com/activists/martin-luther-king-jr",
      "text": "Martin Luther King Jr.: Biography, Civil Rights Activist, MLK Jr. Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Kathy Bates Almost Quit Emmy Nominee Owen Wilson Shohei Ohtani Everyday Heroes of 9/11 Famous Activists Civil Rights Activists Martin Luther King Jr. Martin Luther King Jr. Martin Luther King Jr. was a Baptist minister and major leader of the Civil Rights Movement. After his assassination, he was memorialized by Martin Luther King Jr. Day. By Biography.com Editors and Tim Ott Updated: Jan 13, 2025 4:23 PM EST Reg Lancaster // Getty Images We may earn commission from links on this page, but we only recommend products we back. 1929-1968 In Focus: Martin Luther King Jr. Day In the nearly 40 years that the United States has celebrated Martin Luther King Jr. Day, the national holiday has never coincided with the inauguration of a non-incumbent president. That changes this year. Martin Luther King Jr. Day is celebrated annually on the third Monday in January to mark the late activist’s birthday. In 2025, the holiday falls on January 20, the same day typically set aside for Inauguration Day every four years. Indeed, January 20 is also when Donald Trump will be sworn in as 47 th president. Bill Clinton and Barack Obama previously took presidential oaths of office on Martin Luther King Jr. Day. However, in both cases, the men were starting their second consecutive terms, much quieter occasions than the transfer of power from one president to the next. Days after King’s assassination in 1968, a campaign for a holiday in his honor began. U.S. Representative John Conyers Jr. of Michigan first proposed a bill on April 8, 1968, but the first vote on the legislation didn’t happen until 1979. King’s widow, Coretta Scott King , led the lobbying effort to drum up public support. Fifteen years after its introduction, the bill finally became law. In 1983, President Ronald Reagan ’s signature created Martin Luther King Jr. Day of Service as a federal holiday. The only national day of service, Martin Luther King Jr. Day was first celebrated in 1986. The first time all 50 states recognized the holiday was in 2000. Had he lived, King would be turning 96 years old this year. See Martin Luther King Jr.’s life depicted onscreen in the 2018 documentary I Am MLK Jr. or the Oscar-winning movie Selma . Jump to: Who Was Martin Luther King Jr? Quick Facts When Was Martin Luther King Jr. Born? Education Philosophy of Nonviolence Civil Rights Accomplishments \"I Have a Dream\" and Other Famous Speeches Wife and Kids FBI Surveillance Later Activism When Did Martin Luther King Jr. Die? Legacy Quotes Who Was Martin Luther King Jr? Martin Luther King Jr. was a Baptist minister and civil rights activist who had a seismic impact on race relations in the United States, beginning in the mid-1950s. Among his many efforts, King headed the Southern Christian Leadership Conference. Through his nonviolent activism and inspirational speeches , he played a pivotal role in ending legal segregation of Black Americans as well as the creation of the Civil Rights Act of 1964 and the Voting Rights Act of 1965 . King won the Nobel Peace Prize in 1964, among several other honors. Assassinated by James Earl Ray , King died on April 4, 1968, at age 39. He continues to be remembered as one of the most influential and inspirational Black leaders in history. Quick Facts FULL NAME: Martin Luther King Jr. BIRTHDAY: January 15, 1929 DIED: April 4, 1968 BIRTHPLACE: Atlanta, Georgia SPOUSE: Coretta Scott King (1953–1968) CHILDREN: Yolanda, Martin III, Dexter, and Bernice King ASTROLOGICAL SIGN: Capricorn When Was Martin Luther King Jr. Born? Martin Luther King Jr. was born January 15, 1929, in Atlanta. Originally, his name was Michael Luther King Jr. after his father. Michael Sr. eventually adopted the name Martin Luther King Sr. in honor of the German Protestant religious leader Martin Luther . In due time, Michael Jr. followed his father’s lead and adopt the name himself to become Martin Luther King Jr. His mother was Alberta Williams King. Keep Reading The Parallels Between MLK Jr. and Martin Luther The Williams and King families had roots in rural Georgia. Martin Jr.’s maternal grandfather, A.D. Williams, was a rural minister for years and then moved to Atlanta in 1893. He took over the small, struggling Ebenezer Baptist Church with around 13 members and made it into a forceful congregation. He married Jennie Celeste Parks, and they had one child who survived, Alberta. Martin Sr. came from a family of sharecroppers in a poor farming community. He married Alberta in 1926 after an eight-year courtship. The newlyweds moved to A.D.’s home in Atlanta. Martin stepped in as pastor of Ebenezer Baptist Church upon the death of his father-in-law in 1931. He, too, became a successful minister. Getty Images Martin Luther King Sr. and Alberta Williams King, seen here in 1968, were parents to Martin Luther King Jr. A middle child, Martin Jr. had an older sister, Willie, and a younger brother, Alfred. The King children grew up in a secure and loving environment. Martin Sr. was more the disciplinarian, while Alberta’s gentleness easily balanced out their father’s strict hand. Although they undoubtedly tried, Martin Jr.’s parents couldn’t shield him completely from racism. His father fought against racial prejudice, not just because his race suffered, but also because he considered racism and segregation to be an affront to God’s will. He strongly discouraged any sense of class superiority in his children, which left a lasting impression on Martin Jr. His baptism in May 1936 was less memorable for young King, but an event a few years later left him reeling. In May 1941, when King was 12 years old, his grandmother Jennie died of a heart attack. The event was traumatic for the boy, more so because he was out watching a parade against his parents’ wishes when she died. Distraught at the news, he jumped from a second-story window at the family home, allegedly attempting suicide. Education Growing up in Atlanta, King entered public school at age 5. He later attended Booker T. Washington High School, where he was said to be a precocious student. He skipped both the ninth and eleventh grades and, at age 15, entered Morehouse College in Atlanta in 1944. He was a popular student, especially with his female classmates, but largely unmotivated, floating through his first two years. Influenced by his experiences with racism, King began planting the seeds for a future as a social activist early in his time at Morehouse. “I was at the point where I was deeply interested in political matters and social ills,” he recalled in The Autobiography of Martin Luther King, Jr . “I could envision myself playing a part in breaking down the legal barriers to Negro rights.” The Autobiography of Martin Luther King, Jr. Now 54% Off $10 at Amazon $10 at Walmart At the time, King felt that the best way to serve that purpose was as a lawyer or a doctor. Although his family was deeply involved in the church and worship, King questioned religion in general and felt uncomfortable with overly emotional displays of religious worship. This discomfort had continued through much of his adolescence, initially leading him to decide against entering the ministry, much to his father’s dismay. But in his junior year at Morehouse, King took a Bible class, renewed his faith, and began to envision a career in the ministry. In the fall of his senior year, he told his father of his decision, and he was ordained at Ebenezer Baptist Church in February 1948. Later that year, King earned a sociology degree from Morehouse College and began attended the liberal Crozer Theological Seminary in Chester, Pennsylvania. He thrived in all his studies, was elected student body president, and was valedictorian of his class in 1951. He also earned a fellowship for graduate study. Even though King was following his father’s footsteps, he rebelled against Martin Sr.’s more conservative influence by drinking beer and playing pool while at college. He became romantically involved with a white woman and went through a difficult time before he could break off the relationship. During his last year in seminary, King came under the guidance of Morehouse College President Benjamin E. Mays, who influenced King’s spiritual development. Mays was an outspoken advocate for racial equality and encouraged King to view Christianity as a potential force for social change. Getty Images Martin Luther King Jr., seen here in the mid-1950s, served as a pastor at Dexter Avenue Baptist Church in Montgomery, Alabama, then Ebenezer Baptist Church in Atlanta. After being accepted at several colleges for his doctoral study, King enrolled at Boston University. In 1954, while still working on his dissertation, King became pastor of the Dexter Avenue Baptist Church of Montgomery, Alabama. He completed his doctorate and earned his degree in 1955 at age 25. Decades after King’s death, in the late 1980s, researchers at Stanford University’s King Papers Project began to note similarities between passages of King’s doctoral dissertation and those of another student’s work. A committee of scholars appointed by Boston University determined that King was guilty of plagiarism in 1991, though it also recommended against the revocation of his degree. Philosophy of Nonviolence First exposed to the concept of nonviolent resistance while reading Henry David Thoreau ’s On Civil Disobedience at Morehouse, King later discovered a powerful exemplar of the method’s possibilities through his research into the life of Mahatma Gandhi . Fellow civil rights activist Bayard Rustin , who had also studied Gandhi’s teachings, became one of King’s associates in the 1950s and counseled him to dedicate himself to the principles of nonviolence. As explained in his autobiography , King previously felt that the peaceful teachings of Jesus applied mainly to individual relationships, not large-scale confrontations. But he came to realize: “Love for Gandhi was a potent instrument for social and collective transformation. It was in this Gandhian emphasis on love and nonviolence that I discovered the method for social reform that I had been seeking.” It led to the formation of King’s six principles of nonviolence : Nonviolence is a way of life for courageous people. Nonviolence seeks to win friendship and understanding. Nonviolence seeks to defeat injustice, not people. Nonviolence holds that suffering for a just cause can educate and transform. Nonviolence chooses love instead of hate. Nonviolence believes that the universe is on the side of justice. Understanding the Through Line How Gandhi Inspired MLK Jr.’s Nonviolence Mahatma Gandhi: Leader for India’s Independence In the years to come, King also frequently cited the “ Beloved Community ”—a world in which a shared spirit of compassion brings an end to the evils of racism, poverty, inequality, and violence—as the end goal of his activist efforts. In 1959, with the help of the American Friends Service Committee, King visited Gandhi ’s birthplace in India. The trip affected him in a profound way, increasing his commitment to America’s civil rights struggle. Civil Rights Accomplishments Getty Images Martin Luther King Jr. waves to crowds during the 1963 March on Washington, where he delivered his famous “I Have a Dream” speech. Led by his religious convictions and philosophy of nonviolence, King became one of the most prominent figures of the Civil Rights Movement . He was a founding member of the Southern Christian Leadership Conference and played key roles in several major demonstrations that transformed society. This included the Montgomery Bus Boycott that integrated Alabama’s public transit, the Greensboro Sit-In movement that desegregated lunch counters across the South, the March on Washington that led to the passage of the 1964 Civil Rights Act, and the Selma-to-Montgomery marches in Alabama that culminated in the 1965 Voting Rights Act. King’s efforts earned him the Nobel Peace Prize in 1964 when he was 35. Dive Deeper Black Activists Who Led the Civil Rights Movement The Birmingham Children’s Crusade of 1963 Montgomery Bus Boycott King’s first leadership role within the Civil Rights Movement was during the Montgomery Bus Boycott of 1955–1956. The 381-day protest integrated the Alabama city’s public transit in one of the largest and most successful mass movements against racial segregation in history. The effort began on December 1, 1955, when 42-year-old Rosa Parks boarded the Cleveland Avenue bus to go home after work. She sat in the first row of the “colored” section in the middle of the bus. As more passengers boarded, several white men were left standing, so the bus driver demanded that Parks and several other African Americans give up their seats. Three other Black passengers reluctantly gave up their places, but Parks remained seated. The driver asked her again to give up her seat, and again, she refused. Parks was arrested and booked for violating the Montgomery City Code. At her trial a week later, in a 30-minute hearing, Parks was found guilty and fined $10 and assessed $4 court fee. The History of Public Transit Integration Inside Claudette Colvin’s Little-Known Bus Protest Rosa Parks’ Life After the Montgomery Bus Boycott On the night Parks was arrested, E.D. Nixon , head of the local NAACP chapter, met with King and other local civil rights leaders to plan a Montgomery Bus Boycott. King was elected to lead the boycott because he was young, well-trained, and had solid family connections and professional standing. He was also new to the community and had few enemies, so organizers felt he would have strong credibility with the Black community. In his first speech as the group’s president, King declared: “We have no alternative but to protest. For many years, we have shown an amazing patience. We have sometimes given our white brothers the feeling that we liked the way we were being treated. But we come here tonight to be saved from that patience that makes us patient with anything less than freedom and justice.” King’s skillful rhetoric put new energy into the civil rights struggle in Alabama. The Montgomery Bus Boycott began December 5, 1955, and for more than a year, the local Black community walked to work, coordinated ride sharing, and faced harassment, violence, and intimidation. Both King’s and Nixon’s homes were attacked. Getty Images Martin Luther King Jr. stands in front of a bus on December 26, 1956, after the successful conclusion of the Montgomery Bus Boycott, which integrated the city’s public transit. In addition to the boycott, members of the Black community took legal action against the city ordinance that outlined the segregated transit system. They argued it was unconstitutional based on the U.S. Supreme Court ’s “separate is never equal” decision in Brown v. Board of Education (1954). Several lower courts agreed, and the nation’s Supreme Court upheld the ruling in a November 13, 1956, decision that also ruled the state of Alabama’s bus segregation laws were unconstitutional. After the legal defeats and large financial losses, the city of Montgomery lifted the law that mandated segregated public transportation. The boycott ended on December 20, 1956. Southern Christian Leadership Conference Flush with victory, African American civil rights leaders recognized the need for a national organization to help coordinate their efforts. In January 1957, King, Ralph Abernathy , and 60 ministers and civil rights activists founded the Southern Christian Leadership Conference to harness the moral authority and organizing power of Black churches. The SCLC helped conduct nonviolent protests to promote civil rights reform. King’s participation in the organization gave him a base of operation throughout the South, as well as a national platform. The SCLC felt the best place to start to give African Americans a voice was to enfranchise them in the voting process. In February 1958, the SCLC sponsored more than 20 mass meetings in key southern cities to register Black voters. King met with religious and civil rights leaders and lectured all over the country on race-related issues. Greensboro Sit-In By 1960, King was gaining national exposure. He returned to Atlanta to become co-pastor with his father at Ebenezer Baptist Church but also continued his civil rights efforts. His next activist campaign was the student-led Greensboro Sit-In movement . In February 1960, a group of Black students in Greensboro, North Carolina , began sitting at racially segregated lunch counters in the city’s stores. When asked to leave or sit in the “colored” section, they just remained seated, subjecting themselves to verbal and sometimes physical abuse. Who Are the Greensboro Four? How the Greensboro Four Began the Sit-In Movement The movement quickly gained traction in several other cities. That April, the SCLC held a conference at Shaw University in Raleigh, North Carolina, with local sit-in leaders. King encouraged students to continue to use nonviolent methods during their protests. Out of this meeting, the Student Nonviolent Coordinating Committee (SNCC) formed and, for a time, worked closely with the SCLC. By August 1960, the sit-ins had successfully ended segregation at lunch counters in 27 southern cities. But the movement wasn’t done yet. On October 19, 1960, King and 75 students entered a local department store and requested lunch-counter service but were denied. When they refused to leave the counter area, King and 36 others were arrested. Realizing the incident would hurt the city’s reputation, Atlanta’s mayor negotiated a truce, and charges were eventually dropped. Soon after, King was imprisoned for violating his probation on a traffic conviction. The news of his imprisonment entered the 1960 presidential campaign when candidate John F. Kennedy made a phone call to Martin’s wife, Coretta Scott King . Kennedy expressed his concern over the harsh treatment Martin received for the traffic ticket, and political pressure was quickly set in motion. King was soon released. Letter from Birmingham Jail In the spring of 1963, King organized a demonstration in downtown Birmingham, Alabama. With entire families in attendance, city police turned dogs and fire hoses on demonstrators. King was jailed, along with large numbers of his supporters. The event drew nationwide attention. However, King was personally criticized by Black and white clergy alike for taking risks and endangering the children who attended the demonstration. In his famous Letter from Birmingham Jail , King eloquently spelled out his theory of nonviolence: “Nonviolent direct action seeks to create such a crisis and foster such a tension that a community, which has constantly refused to negotiate, is forced to confront the issue.” 1963 March on Washington By the end of the Birmingham campaign, King and his supporters were making plans for a massive demonstration on the nation’s capital composed of multiple organizations, all asking for peaceful change. The demonstration was the brainchild of labor leader A. Philip Randolph and King’s one-time mentor Bayard Rustin . On August 28, 1963, the historic March on Washington for Jobs and Freedom drew an estimated 250,000 people in the shadow of the Lincoln Memorial. It remains one of the largest peaceful demonstrations in American history. During the demonstration, King delivered his famed “I Have a Dream” speech. Inside the Speech MLK Jr. Almost Didn’t Say “I Have a Dream” Mahalia Jackson Sparked “I Have a Dream” Speech The rising tide of civil rights agitation that had culminated in the March on Washington produced a strong effect on public opinion. Many people in cities not experiencing racial tension began to question the nation’s Jim Crow laws and the near-century of second-class treatment of African American citizens since the end of slavery. This resulted in the passage of the Civil Rights Act of 1964 , authorizing the federal government to enforce desegregation of public accommodations and outlawing discrimination in publicly owned facilities. Selma March Getty Images Martin Luther King Jr. and Coretta Scott King help lead marchers from Selma to Montgomery, Alabama, in March 1965. Continuing to focus on voting rights, King, the SCLC, SNCC, and local organizers planned to march peacefully from Selma, Alabama, to the state’s capital, Montgomery. Led by John Lewis and Hosea Williams , demonstrators set out on March 7, 1965. But the Selma march quickly turned violent as police with nightsticks and tear gas met the demonstrators as they tried to cross the Edmund Pettus Bridge in Selma. The attack was televised, broadcasting the horrifying images of marchers being bloodied and severely injured to a wide audience. Of the 600 demonstrators, 58 were hospitalized in a day that became known as “ Bloody Sunday .” King, however, was spared because he was in Atlanta. Not to be deterred, activists attempted the Selma-to-Montgomery march again. This time, King made sure he was part of it. Because a federal judge had issued a temporary restraining order on another march, a different approach was taken. On March 9, 1965, a procession of 2,500 marchers, both Black and white, set out once again to cross the Pettus Bridge and confronted barricades and state troopers. Instead of forcing a confrontation, King led his followers to kneel in prayer, then they turned back. This became known as “Turnaround Tuesday.” Alabama Governor George Wallace continued to try to prevent another march until President Lyndon B. Johnson pledged his support and ordered U.S. Army troops and the Alabama National Guard to protect the protestors. On March 21, 1965, approximately 2,000 people began a march from Selma to Montgomery. On March 25, the number of marchers, which had grown to an estimated 25,000 gathered in front of the state capitol where King delivered a televised speech. Five months after the historic peaceful protest, President Johnson signed the 1965 Voting Rights Act . \"I Have a Dream\" and Other Famous Speeches Getty Images Martin Luther King Jr. delivers his “I Have a Dream” speech on August 28, 1963, during the March on Washington. Along with his “I Have a Dream” and “I’ve Been to the Mountaintop” speeches, King delivered several acclaimed addresses over the course of his life in the public eye: “I Have A Dream” Speech Date: August 28, 1963 King gave his famous “I Have a Dream” speech during the 1963 March on Washington. Standing at the Lincoln Memorial, he emphasized his belief that someday all men could be brothers to the 250,000-strong crowd. Notable Quote: “I have a dream that my four children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character.” “Give Us the Ballot” Speech Date: May 17, 1957 Six years before he told the world of his dream, King stood at the same Lincoln Memorial steps as the final speaker of the Prayer Pilgrimage for Freedom. Dismayed by the ongoing obstacles to registering Black voters, King urged leaders from various backgrounds—Republican and Democrat, Black and white—to work together in the name of justice. Notable Quote: “Give us the ballot, and we will no longer have to worry the federal government about our basic rights. Give us the ballot, and we will no longer plead to the federal government for passage of an anti-lynching law... Give us the ballot, and we will transform the salient misdeeds of bloodthirsty mobs into the calculated good deeds of orderly citizens.” Nobel Peace Prize Acceptance Speech Date: December 10, 1964 Speaking at the University of Oslo in Norway, King pondered why he was receiving the Nobel Prize when the battle for racial justice was far from over, before acknowledging that it was in recognition of the power of nonviolent resistance. He then compared the foot soldiers of the Civil Rights Movement to the ground crew at an airport who do the unheralded-yet-necessary work to keep planes running on schedule. Notable Quote: “I think Alfred Nobel would know what I mean when I say that I accept this award in the spirit of a curator of some precious heirloom which he holds in trust for its true owners—all those to whom beauty is truth and truth, beauty—and in whose eyes the beauty of genuine brotherhood and peace is more precious than diamonds or silver or gold.” “Our God is Marching On (How Long? Not Long)” Speech Date: March 25, 1965 At the end of the bitterly fought Selma-to-Montgomery march, King addressed a crowd of 25,000 supporters from the Alabama State Capitol. Offering a brief history lesson on the roots of segregation, King emphasized that there would be no stopping the effort to secure full voting rights, while suggesting a more expansive agenda to come with a call to march on poverty. Notable Quote: “I come to say to you this afternoon, however difficult the moment, however frustrating the hour, it will not be long, because ‘truth crushed to earth will rise again.’ How long? Not long, because ‘no lie can live forever.’... How long? Not long, because the arc of the moral universe is long, but it bends toward justice.” “Beyond Vietnam: A Time to Break Silence” Speech Date: April 4, 1967 One year before his assassination, King delivered a controversial sermon at New York City’s Riverside Church in which he condemned the Vietnam War . Explaining why his conscience had forced him to speak up, King expressed concern for the poor American soldiers pressed into conflict thousands of miles from home, while pointedly faulting the U.S. government’s role in escalating the war. Notable Quote: “We still have a choice today: nonviolent coexistence or violent co-annihilation. We must move past indecision to action. We must find new ways to speak for peace in Vietnam and justice throughout the developing world, a world that borders on our doors. If we do not act, we shall surely be dragged down the long, dark, and shameful corridors of time reserved for those who possess power without compassion, might without morality, and strength without sight.” “I’ve Been to the Mountaintop” Speech Date: April 3, 1968 The well-known orator delivered his final speech the day before he died at the Mason Temple in Memphis, Tennessee. King reflected on major moments of progress in history and his own life, in addition to encouraging the city’s striking sanitation workers. Notable Quote: “I’ve seen the promised land. I may not get there with you. But I want you to know tonight that we, as a people, will get to the promised land.” More Powerful MLK Jr. Quotes 17 Inspiring Martin Luther King Quotes Wife and Kids Getty Images Martin Luther King Jr. and his wife, Coretta Scott King, sit with three of their children—Yolanda, Dexter, and Martin III—in 1962. Their daughter Bernice was born the next year. While working on his doctorate at Boston University, King met Coretta Scott , an aspiring singer and musician at the New England Conservatory school in Boston. They were married on June 18, 1953, and had four children—two daughters and two sons—over the next decade. Their oldest, Yolanda, was born in 1955, followed by sons Martin Luther King III in 1957 and Dexter in 1961. The couple welcomed Bernice King in 1963. In addition to raising the children while Martin travelled the country, Coretta opened their home to organizational meetings and served as an advisor and sounding board for her husband. “I am convinced that if I had not had a wife with the fortitude, strength, and calmness of Corrie, I could not have withstood the ordeals and tensions surrounding the movement,” Martin wrote in his autobiography. His lengthy absences became a way of life for their children, but Martin III remembered his father returning from the road to join the kids playing in the yard or bring them to the local YMCA for swimming. Martin Jr. also fostered discussions at mealtimes to make sure everyone understood the important issues he was seeking to resolve. Leery of accumulating wealth as a high-profile figure, Martin Jr. insisted his family live off his salary as a pastor. However, he was known to splurge on good suits and fine dining, while contrasting his serious public image with a lively sense of humor among friends and family. FBI Surveillance Due to his relationships with alleged Communists, King became a target of FBI surveillance and, from late 1963 until his death, a campaign to discredit the civil rights activist. While FBI wiretaps failed to produce evidence of Communist sympathies, they captured the civil rights leader’s engagement in extramarital affairs. This led to the infamous “suicide letter” of 1964, later confirmed to be from the FBI and authorized by then-Director J. Edgar Hoover , which urged King to kill himself if he wanted to prevent news of his dalliances from going public. In 2019, historian David Garrow wrote of explosive new allegations against King following his review of recently released FBI documents. Among the discoveries was a memo suggesting that King had encouraged the rape of a parishioner in a hotel room as well as evidence that he might have fathered a daughter with a mistress. Other historians questioned the veracity of the documentation, especially given the FBI’s known attempts to damage King’s reputation. The original surveillance tapes regarding these allegations are under judicial seal until 2027. Later Activism From late 1965 through 1967, King expanded his civil rights efforts into other larger American cities, including Chicago and Los Angeles. He was met with increasing criticism and public challenges from young Black power leaders. King’s patient, nonviolent approach and appeal to white middle-class citizens alienated many Black militants who considered his methods too weak, too late, and ineffective. Spotlight: Martin Luther King Jr. and Malcolm X Martin Luther King Jr. and Malcolm X Only Met Once Martin Luther King Jr. Didn’t Criticize Malcolm X To address this criticism, King began making a link between discrimination and poverty, and he began to speak out against the Vietnam War . He felt America’s involvement in Vietnam was politically untenable and the government’s conduct in the war was discriminatory to the poor. He sought to broaden his base by forming a multiracial coalition to address the economic and unemployment problems of all disadvantaged people. To that end, plans were in the works for another march on Washington to highlight the Poor People’s Campaign, a movement intended to pressure the government into improving living and working conditions for the economically disadvantaged. By 1968, the years of demonstrations and confrontations were beginning to wear on King. He had grown tired of marches, going to jail, and living under the constant threat of death. He was becoming discouraged at the slow progress of civil rights in America and the increasing criticism from other African American leaders. In the spring of 1968, a labor strike by Memphis, Tennessee, sanitation workers drew King to one last crusade. On April 3, 1968, he gave his final and what proved to be an eerily prophetic speech, “I’ve Been to the Mountaintop,” in which he told supporters, “Like anybody, I would like to live a long life. Longevity has its place. But I’m not concerned about that now… I’m not worried about anything. I’m not fearing any man. Mine eyes have seen the glory of the coming of the Lord.” When Did Martin Luther King Jr. Die? Getty Images A funeral procession for Martin Luther King Jr. was held April 9, 1968, in Atlanta. Thousands of mourners walked from Ebenezer Baptist Church to Morehouse College. In September 1958, King survived an attempt on his life when a woman with mental illness stabbed him in the chest as he signed copies of his book Stride Toward Freedom in a New York City department store. Saved by quick medical attention, King expressed sympathy for his assailant’s condition in the aftermath. A decade later, King was again targeted, and this time he didn’t survive. While standing on a balcony outside his room at the Lorraine Motel in Memphis, Tennessee, Martin Luther King Jr. was killed by a sniper’s bullet on April 4, 1968. King died at age 39. The shocking assassination sparked riots and demonstrations in more than 100 cities across the country. The shooter was James Earl Ray , a malcontent drifter and former convict. He initially escaped authorities but was apprehended after a two-month international manhunt. In 1969, Ray pleaded guilty to assassinating King and was sentenced to 99 years in prison. Keep Reading The Assassination of Martin Luther King Jr. James Earl Ray: The Man Who Killed MLK Jr. The identity of King’s assassin has been the source of some controversy. Ray recanted his confession shortly after he was sentenced, and King’s son Dexter publicly defended Ray’s innocence after meeting with the convicted gunman in 1997. Another complicating factor is the 1993 confession of tavern owner Loyd Jowers, who said he contracted a different hit man to kill King. In June 2000, more than two years after Ray died, the U.S. Justice Department released a report that dismissed the alternative theories of King’s death. Legacy Getty Images The Martin Luther King Jr. Memorial in Washington, D.C., was dedicated on August 28, 2011. King’s life had a seismic impact on race relations in the United States. Years after his death, he is the most widely known Black leader of his era. His life and work have been honored with a national holiday, schools and public buildings named after him, and a memorial on Independence Mall in Washington D.C. Over the years, extensive archival studies have led to a more balanced and comprehensive assessment of his life, portraying him as a complex figure: flawed, fallible, and limited in his control over the mass movements with which he was associated, yet a visionary leader who was deeply committed to achieving social justice through nonviolent means. Quotes But we come here tonight to be saved from that patience that makes us patient with anything less than freedom and justice. There comes a time when the cup of endurance runs over and men are no longer willing to be plunged into an abyss of injustice where they experience the bleakness of corroding despair. Any law that uplifts human personality is just. Any law that degrades human personality is unjust. The whirlwinds of revolt will continue to shake the foundations of our nation until the bright day of justice emerges. Let us not seek to satisfy our thirst for freedom by drinking from the cup of bitterness and hatred. Darkness cannot drive out darkness: only light can do that. Hate cannot drive out hate: only love can do that. The ultimate measure of a man is not where he stands in moments of comfort and convenience, but where he stands at times of challenge and controversy. The true neighbor will risk his position, his prestige, and even his life for the welfare of others. We must all learn to live together as brothers, or we will all perish together as fools. Forgiveness is not an occasional act; it is a permanent attitude. I have a dream that my four children will one day live in a nation where they will not be judged by the color of their skin but by the content of their character. The function of education, therefore, is to teach one to think intensively and to think critically. But education which stops with efficiency may prove the greatest menace to society. The most dangerous criminal may be the man gifted with reason but with no morals. I’ve seen the promised land. I may not get there with you. But I want you to  know tonight that we, as a people, will get to the promised land. Power at its best is love implementing the demands of justice. Justice at its best is love correcting everything that stands against love. A man who won’t die for something is not fit to live. At the center of non-violence stands the principle of love. Right, temporarily defeated, is stronger than evil triumphant. In the end, we will remember not the words of our enemies, but the silence of our friends. Injustice anywhere is a threat to justice everywhere. Our lives begin to end the day we become silent about things that matter. Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Advertisement - Continue Reading Below Civil Rights Activists How the Greensboro Four Began the Sit-In Movement How the Gallaudet Four Paved the Way for the ADA Jackie Robinson Coretta Scott King and Betty Shabazz Friendship Advertisement - Continue Reading Below Did the Mob Kill John F. Kennedy? 51 Inspiring Famous Women in History Rosa Parks’ Life After the Montgomery Bus Boycott Marcus Garvey 17 Inspiring Martin Luther King Quotes Malcolm X Ethel Kennedy MLK Almost Didn’t Say “I Have a Dream” Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://www.martinarts.org/support_us/shop-local.html",
      "text": "Shop Local : SUPPORT THE ARTS : MartinArts Skip to main content ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources search MENU SUPPORT THE ARTS Shop Local Browse and shop local to support these talented artists If you are a visual artist and would like to be added, please email Cristina Lasaga Pam Ayres Pamela J. Ayres Fine Art Jane Baldridge Lynne Barletta Lynn Bell Bob Johnstone Suzanne Connors Aya Fiber Studio Gina Duffy Katie Gianni Katie Gianni Art Dominique Italiano Dominique Italiano Studios Heather Ivins Sue Klahne Sue Klahne Custom Artwork Vickie Marsango Marsango Art Gallery & Studio Sean McGraw Sean McGraw Fine Art Maria G. Miele MGM Originals Fine Art Sally Browning Pearson Sally's Paintings Martha Quigley Landfall Gallery Lisa Rapp Nancy Smyth Nancy Smyth Fine Art Janet Sunny Walker Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London 80 Southeast Ocean Boulevard Stuart, FL 34994 Council (772) 287-6676 Foundation (772) 288-5397 Office Hours: M-F 9AM - 5PM (Except Holidays) Court House Cultural Center Gallery Hours: Tuesday, 10AM - 6PM | Wednesday - Saturday 10AM-4PM Explore Contact Us Magazine SHS Project Follow Us Instagram Facebook ©\n          2025\n           – \n          MartinArts\n           – Crafted by Firespring Privacy Policy Privacy Policy What Information Do We Collect? When you visit our website you may provide us with two types of information: personal information you knowingly choose to disclose that is collected on an individual basis and website use information collected on an aggregate basis as you and others browse our website. Personal Information You Choose to Provide We may request that you voluntarily supply us with personal information, including your email address, postal address, home or work telephone number and other personal information for such purposes as correspondence, placing an order, requesting an estimate, or participating in online surveys.\nIf you choose to correspond with us through email, we may retain the content of your email messages together with your email address and our responses. We provide the same protections for these electronic communications that we employ in the maintenance of information received by mail and telephone. Website Use Information Similar to other websites, our site may utilize a standard technology called \"cookies\" (see explanation below, \"What Are Cookies?\") and web server logs to collect information about how our website is used. Information gathered through cookies and server logs may include the date and time of visits, the pages viewed, time spent at our website, and the sites visited just before and just after ours. This information is collected on an aggregate basis. None of this information is associated with you as an individual. How Do We Use the Information That You Provide to Us? Broadly speaking, we use personal information for purposes of administering our business activities, providing service and support and making available other products and services to our customers and prospective customers. Occasionally, we may also use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. The lists used to send you product and service offers are developed and managed under our traditional standards designed to safeguard the security and privacy of all personal information provided by our users. You may at any time to notify us of your desire not to receive these offers. What Are Cookies? Cookies are a feature of web browser software that allows web servers to recognize the computer used to access a website. Cookies are small pieces of data that are stored by a user's web browser on the user's hard drive. Cookies can remember what information a user accesses on one web page to simplify subsequent interactions with that website by the same user or to use the information to streamline the user's transactions on related web pages. This makes it easier for a user to move from web page to web page and to complete commercial transactions over the Internet. Cookies should make your online experience easier and more personalized. How Do We Use Information Collected From Cookies? We use website browser software tools such as cookies and web server logs to gather information about our website users' browsing activities, in order to constantly improve our website and better serve our users. This information assists us to design and arrange our web pages in the most user-friendly manner and to continually improve our website to better meet the needs of our users and prospective users.\nCookies help us collect important business and technical statistics. The information in the cookies lets us trace the paths followed by users to our website as they move from one page to another. Web server logs allow us to count how many people visit our website and evaluate our website's visitor capacity. We do not use these technologies to capture your individual email address or any personally identifying information about you. Notice of New Services and Changes Occasionally, we may use the information we collect to notify you about important changes to our website, new services and special offers we think you will find valuable. As a user of our website, you will be given the opportunity to notify us of your desire not to receive these offers by clicking on a response box when you receive such an offer or by sending us an email request. How Do We Secure Information Transmissions? When you send confidential personal information to us on our website, a secure server software which we have licensed encrypts all information you input before it is sent to us. The information is scrambled en route and decoded once it reaches our website.\nOther email that you may send to us may not be secure unless we advise you that security measures will be in place prior to your transmitting the information. For that reason, we ask that you do not send confidential information such as Social Security, credit card, or account numbers to us through an unsecured email. How Do We Protect Your Information? Information Security -- We utilize encryption/security software to safeguard the confidentiality of personal information we collect from unauthorized access or disclosure and accidental loss, alteration or destruction.\nEvaluation of Information Protection Practices -- Periodically, our operations and business practices are reviewed for compliance with organization policies and procedures governing the security, confidentiality and quality of our information.\nEmployee Access, Training and Expectations -- Our organization values, ethical standards, policies and practices are committed to the protection of user information. In general, our business practices limit employee access to confidential information, and limit the use and disclosure of such information to authorized persons, processes and transactions. How Can You Access and Correct Your Information? You may request access to all your personally identifiable information that we collect online and maintain in our database by emailing us using the contact form provided to you within the site structure of our website. Do We Disclose Information to Outside Parties? We may provide aggregate information about our customers, sales, website traffic patterns and related website information to our affiliates or reputable third parties, but this information will not include personally identifying data, except as otherwise provided in this privacy policy. What About Legally Compelled Disclosure of Information? We may disclose information when legally compelled to do so, in other words, when we, in good faith, believe that the law requires it or for the protection of our legal rights. Permission to Use of Materials The right to download and store or output the materials in our website is granted for the user's personal use only, and materials may not be reproduced in any edited form. Any other reproduction, transmission, performance, display or editing of these materials by any means mechanical or electronic without our express written permission is strictly prohibited. Users wishing to obtain permission to reprint or reproduce any materials appearing on this site may contact us directly. Terms & Conditions Terms & Conditions Donation Refund Policy We are grateful for your donation and support of our organization. If you have made an error in making your donation or change your mind about contributing to our organization please contact us.  Refunds are returned using the original method of payment. If you made your donation by credit card, your refund will be credited to that same credit card. Automated Recurring Donation Cancellation Ongoing support is important to enabling projects to continue their work, so we encourage donors to continue to contribute to projects over time. But if you must cancel your recurring donation, please notify us. ABOUT US What We Do Staff Frequently Asked Questions Contact Us SUPPORT THE ARTS Donate Sponsorship Membership Artist Memberships Personal Membership Business/Organizational Memberships The Impressionists NARM Membership Benefits Volunteer SHS Arts Campus Project Art Out of the Closet Women Supporting the Arts Join Women Supporting the Arts Grants About Women Supporting the Arts Grants WSA Grant Application & Guidelines Gallery Excursions London PROGRAMS & EVENTS ArtsFest Be a part of ArtsFest! MartinArts Awards Support the Awards! Sunset Concerts at the Gallery Harvesting the Arts Arts Education Marvin S. Cone Annual High School Juried Art Show Sponsorship Awards List Alumni Stories Arts Day Arts License Plate Art in Public Places COURT HOUSE CULTURAL CENTER Exhibitions Exhibition Sponsorship Opportunities Interested in Exhibiting at the Gallery? Court House Cultural Center Committee RESOURCES MartinArts Magazine Cultural Calendar Artist Directory Calls To Artists Grants Martin County Arts & Culture Trail Local Gallery & Organizations Visual Performing Cultural Arts Community Resources State & National Resources Follow Us Instagram Facebook MENU CLOSE"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * Nachricht name Surname Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://business.stuartmartinchamber.org/members/member/martinarts-1958",
      "text": "MartinArts | Arts and Culture | ART GALLERY/ARTISTS | NON PROFIT/CULTURAL Skip to content --°F Member Login Join Chamber The Chamber Close The Chamber Open The Chamber About Us President’s Report Membership Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship Vubiz Trains Events & News Close Events & News Open Events & News Upcoming Events Chamber Calendar Community Calendar Chamber Event Flyers Latest News Chamber & Member News Online Compass Florida Chamber News Legislative Updates Photo Galleries Breakfasts Luncheons Business After Hours Annual Expos Holiday Trade Show Installation of Officers LEADERship Ribbon Cuttings Golf Tournaments Special Events Business Close Business Open Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Close Tourism Open Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Close Relocation Open Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide The Digital Times Recreation Close Recreation Open Recreation Things to Do Boating Diving and Snorkeling Golf Courses Beaches and Parks Fish & Hunt Fishing Report Sailfish Tournaments Fishing Guide MartinArts Categories Arts and Culture ART GALLERY/ARTISTS NON PROFIT/CULTURAL 80 S.E. Ocean Blvd. Stuart FL 34994 (772) 287-6676 www.martinarts.org Hours: Office Hours: Monday through Friday, 9am - 5pm Gallery Hours: Tues, 10am-6pm; Wed-Sat, 11am-4pm. Driving Directions: Located on East Ocean Boulevard next door to the County Courthouse. About Us MartinArts is a nonprofit organization serving the arts and cultural sector of Martin County. Located in historic Court House Cultural Center, we offer arts and cultural programs year round. News ArtsFest Stuart 2026 Calling for Community Partners Release Date: July 29, 2025 Rep/Contact Info Kailene Chua × Close Kailene Chua Marketing & Development Coordinator Phone: (772) 287-6676 x7 Send an Email Jennifer Hearn × Close Jennifer Hearn Senior Programs Manager Phone: (772) 287-6676 x2 Send an Email Ms. Nancy K. Turrell × Close Ms. Nancy K. Turrell Executive Director Phone: (772) 287-6676 x4 Fax: (772) 288-5301 Send an Email 80 S.E. Ocean Blvd. Stuart FL 34994 Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel Connect with us 1650 S Kanner Highway Stuart, FL 34994 772-287-1088 x111 info@stuartmartinchamber.org Facebook-f Twitter Youtube Linkedin-in Chamber Info Join The Chamber Member Search Member Benefits President's Report Contact The Chamber Privacy Policy News & Events Online Compass Member News Chamber Calendar Community Calendar Non-Profit Events Health Resources Newsletter Enter your email, subscribe to our newsletter and stay informed! Subscription Form Newsletter First Name Last Name Subscribe © 2025 STUART/MARTIN COUNTY CHAMBER OF COMMERCE. ALL RIGHTS RESERVED. Member Login Join Chamber The Chamber About Us President’s Report Member Benefits & New Members Member Directory Join The Chamber Office Staff Board Members Committees Trustees LEADERship Contact Us Martin Chamber Foundation JAC Scholarship VUBIZ Trains Events & News Chamber Calendar Community Calendar Photo Gallery Member News Chamber Event Flyers Online Compass Florida Chamber News Business Business and Industry Office and Commercial Career Connect Martin Job Postings Member to Member Deals Facts and Figures New Business Checklist Tourism Accommodations Dining and Nightlife Beaches and Parks Attractions Interactive County Map Weather Forecast Shopping and Downtown Culture and the Arts History Relocation Real Estate Housing Making the Move Important Phone Numbers Education Health and Wellness Senior Services Religion and Worship Transportation Communications 2025 Welcome Guide Recreation Boating Fishing and Hunting Fishing Report Sailfish Tournaments Fishing Guide Diving and Snorkeling Golf Courses Beaches and Parks Facebook-f Twitter Youtube Linkedin-in Search"
    }
  ]
}