{
  "fuentes": [
    {
      "url": "https://www.tampabay.com/news/st-petersburg/2021/06/03/pete-boland-owner-of-st-petersburg-bar-files-to-run-for-mayor/",
      "email": "licensing@zumapress.com"
    },
    {
      "url": "https://marymargarets.com/st-petersburg-downtown-st-pete-jannus-block-mary-margaret-s-olde-irish-tavern-events",
      "email": "pete@marymargarets.com"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Contact/rJABzJ3L",
      "email": "bsoler@stpete.com"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Contact/rJABzJ3L",
      "email": "lcissna@stpete.com"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Contact/rJABzJ3L",
      "email": "tourism@stpete.com"
    },
    {
      "url": "https://marymargarets.com/st-petersburg-downtown-st-pete-jannus-block-mary-margaret-s-olde-irish-tavern-about",
      "email": "pete@marymargarets.com"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Details/mary-margaret-s-olde-irish-tavern-2057301",
      "email": "bsoler@stpete.com"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Details/mary-margaret-s-olde-irish-tavern-2057301",
      "email": "lcissna@stpete.com"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Details/mary-margaret-s-olde-irish-tavern-2057301",
      "email": "tourism@stpete.com"
    },
    {
      "url": "https://www.stmargarets-school.org.uk/about-us/our-people/meet-the-team",
      "email": "schooloffice@stmargarets-school.org.uk"
    },
    {
      "url": "https://marymargarets.com/st-petersburg-downtown-st-pete-jannus-block-mary-margaret-s-olde-irish-tavern-drink-menu",
      "email": "pete@marymargarets.com"
    },
    {
      "url": "https://marymargarets.com/",
      "email": "pete@marymargarets.com"
    },
    {
      "url": "https://www.tampabay.com/arts-entertainment/food/2020/02/17/traditional-pub-mary-margarets-olde-irish-tavern-is-coming-to-st-petersburg/",
      "email": "mhabuda@tampabay.com"
    },
    {
      "url": "https://marymargarets.com/-events?spot_id=95721&destination=events&promotion=live_music",
      "email": "pete@marymargarets.com"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "aaskey@smsch.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "ashanahan@smsch.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "awalton@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "betty.mooney@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "dcajigas@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "ffadmin@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "frkevin@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "hwilkins@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "info@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "jefwinfield@comcast.net"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "jmbrown@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "jpubah@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "jwinfield@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "kgoedeke@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "kreilly@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "lgonzalez@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "lhack@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "lkimmel@smsch.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "marcher@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "mhultquist@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "myantz@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "ninah@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "rbenjes@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "receptionist@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "rsmccord@comcast.net"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "slaird@stmargaret.org"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "email": "tcastelli@smsch.org"
    },
    {
      "url": "https://marymargarets.com/-events",
      "email": "pete@marymargarets.com"
    }
  ],
  "mails": [
    "aaskey@smsch.org",
    "ashanahan@smsch.org",
    "awalton@stmargaret.org",
    "betty.mooney@stmargaret.org",
    "bsoler@stpete.com",
    "dcajigas@stmargaret.org",
    "ffadmin@stmargaret.org",
    "frkevin@stmargaret.org",
    "hwilkins@stmargaret.org",
    "info@stmargaret.org",
    "jefwinfield@comcast.net",
    "jmbrown@stmargaret.org",
    "jpubah@stmargaret.org",
    "jwinfield@stmargaret.org",
    "kgoedeke@stmargaret.org",
    "kreilly@stmargaret.org",
    "lcissna@stpete.com",
    "lgonzalez@stmargaret.org",
    "lhack@stmargaret.org",
    "licensing@zumapress.com",
    "lkimmel@smsch.org",
    "marcher@stmargaret.org",
    "mhabuda@tampabay.com",
    "mhultquist@stmargaret.org",
    "myantz@stmargaret.org",
    "ninah@stmargaret.org",
    "pete@marymargarets.com",
    "rbenjes@stmargaret.org",
    "receptionist@stmargaret.org",
    "rsmccord@comcast.net",
    "schooloffice@stmargarets-school.org.uk",
    "slaird@stmargaret.org",
    "tcastelli@smsch.org",
    "tourism@stpete.com"
  ],
  "nombre_sitio": "marymargarets.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.tampabay.com/news/st-petersburg/2021/06/03/pete-boland-owner-of-st-petersburg-bar-files-to-run-for-mayor/",
      "text": "Pete Boland, St. Petersburg restaurateur, files to run for mayor Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement News / St. Petersburg Pete Boland, St. Petersburg restaurateur, files to run for mayor Boland, a registered Republican who calls himself moderate, owns The Galley and Mary Margaret’s Olde Irish Tavern. Pete Boland, owner of St. Petersburg restaurants the Galley and Mary Margaret's Olde Irish Tavern, filed to run for mayor. [ Brian James ] By Josh Solomon Former Times Reporter Published | Updated Josh Solomon Former Times Reporter MORE FOR YOU Florida Holocaust Museum reopens with giant rescue boat, Elie Wiesel artifacts • History Is the Trump-DeSantis rivalry back on? Look out for 2026. • The Buzz on Florida Politics Advertisement Lawn tyranny in Tampa Bay’s rainy season | Column • Viewpoints Dick’s Sporting Goods completes multibillion-dollar deal to acquire Foot Locker • Business Semitrailer bursts into flames after crashing on I-275 exit in St. Pete • Pinellas Florida is threatening local transportation like never before, leaders say • Business Clearwater Beach icon Pier 60 partially reopens to public • Photos Man fatally shot in St. Petersburg while driving with child in car • Crime St. Pete suit shows limits of DeSantis-backed public sleeping law • News In downtown St. Petersburg, a proposed $134M tower hits height hurdles • St. Petersburg Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://marymargarets.com/st-petersburg-downtown-st-pete-jannus-block-mary-margaret-s-olde-irish-tavern-events",
      "text": "Mary Margaret's Olde Irish Tavern - events Skip to Main Content (727)-873-6764 pete@marymargarets.com 29 3rd Street North                                                          , St. Petersburg Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Events Live Music - Sean Doyle Wednesday September 10th Every Wednesday We bring you Sean Doyle, the Emigrant Son, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:30 PM - 12:30 AM 2025-09-10 20:30:00 2025-09-10 00:30:00 America/New_York Live Music - Sean Doyle We bring you Sean Doyle, the Emigrant Son, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Greg Roy Thursday September 11th We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-11 20:00:00 2025-09-11 00:00:00 America/New_York Live Music - Greg Roy We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Comin' In Hot Friday September 12th We bring you, Comin' In Hot, playing smooth, tuneful rock music from the 70s and 80s, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-12 21:00:00 2025-09-12 01:00:00 America/New_York Live Music - Comin' In Hot We bring you, Comin' In Hot, playing smooth, tuneful rock music from the 70s and 80s, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Soccer Matches at Mary Margaret's Saturday September 13th Sundays and Saturdays every week Love the thrill of the English Premier League and the passion of Glasgow Celtic FC? Mary Margaret’s is the place to be! Whether you’re a dedicated supporter of clubs like Manchester United, Arsenal, Liverpool, or Chelsea, or simply a fan of the beautiful game, our big screens and enthusiastic crowd make every match unforgettable. English Premier League fans bring their energy and passion, turning Mary Margaret’s into the ultimate game-day destination. Join St Pete Shamrock - Tampa Bay's CSC, proud supporters of Glasgow Celtic FC, as they cheer on their team with unmatched enthusiasm. Share the camaraderie of devoted fans, whether you’re celebrating goals, debating calls, or singing your team’s chants. Wear your team colors, join in the excitement, and feel the energy of every moment. Follow us on Facebook and Instagram for updates, schedules, and all the latest buzz. Come experience soccer like never before at Mary Margaret’s—where the passion of the Premier League and Celtic pride come alive! 10:00 AM - 10:00 PM 2025-09-13 10:00:00 2025-09-13 22:00:00 America/New_York Soccer Matches at Mary Margaret's Love the thrill of the English Premier League and the passion of Glasgow Celtic FC? Mary Margaret’s is the place to be! Whether you’re a dedicated supporter of clubs like Manchester United, Arsenal, Liverpool, or Chelsea, or simply a fan of the beautiful game, our big screens and enthusiastic crowd make every match unforgettable. English Premier League fans bring their energy and passion, turning Mary Margaret’s into the ultimate game-day destination.Join St Pete Shamrock - Tampa Bay's CSC, proud supporters of Glasgow Celtic FC, as they cheer on their team with unmatched enthusiasm. Share the camaraderie of devoted fans, whether you’re celebrating goals, debating calls, or singing your team’s chants. Wear your team colors, join in the excitement, and feel the energy of every moment.Follow us on Facebook and Instagram for updates, schedules, and all the latest buzz. Come experience soccer like never before at Mary Margaret’s—where the passion of the Premier League and Celtic pride come alive! Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Midnight Rovers Saturday September 13th We bring you Midnight Rovers, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 05:00 PM - 08:00 PM 2025-09-13 17:00:00 2025-09-13 20:00:00 America/New_York Live Music - Midnight Rovers We bring you Midnight Rovers, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com The Bawdy Boys Saturday September 13th We bring you The Bawdy Boys, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-13 21:00:00 2025-09-13 01:00:00 America/New_York The Bawdy Boys We bring you The Bawdy Boys, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Cage O'Hanlon Sunday September 14th Every Sunday Cage O'Hanlon, bringing the music and craic, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 07:00 PM - 10:00 PM 2025-09-14 19:00:00 2025-09-14 22:00:00 America/New_York Live Music - Cage O'Hanlon Cage O'Hanlon, bringing the music and craic, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Monday Night Karaoke Monday September 15th Every Monday Monday Night Karaoke – Powered by High Rise Beverages Join us every Monday at 10p for Karaoke Night, sponsored by High Rise Beverages! Whether you're here to sing your heart out or cheer on your friends, it's the perfect way to kick off your week. Great vibes, cold drinks, and your favorite songs all night long.  Plus, 40% off for all service industry pros – just show proof of employment. See you Monday – the mic is waiting! All Day Drink Specials High Rise Beverages - THC Infused Hightails MANGO MARGARITA High Rise Mango, Lime, Agave, Tajín BLUEBERRY MOJITO High Rise Blueberry, Mint, Lime, Sugar PINEAPPLE SUNSET High Rise Pineapple, OJ, Grenadine $8 Each Single Can $8.49 10:00 PM - 01:30 AM 2025-09-15 22:00:00 2025-09-15 01:30:00 America/New_York Monday Night Karaoke Monday Night Karaoke – Powered by High Rise Beverages Join us every Monday at 10p for Karaoke Night, sponsored by High Rise Beverages! Whether you're here to sing your heart out or cheer on your friends, it's the perfect way to kick off your week. Great vibes, cold drinks, and your favorite songs all night long.  Plus, 40% off for all service industry pros – just show proof of employment. See you Monday – the mic is waiting!All Day Drink Specials  High Rise Beverages - THC Infused HightailsMANGO MARGARITAHigh Rise Mango, Lime, Agave, TajínBLUEBERRY MOJITOHigh Rise Blueberry, Mint, Lime, SugarPINEAPPLE SUNSETHigh Rise Pineapple, OJ, Grenadine$8 EachSingle Can $8.49 Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Cage O'Hanlon Tuesday September 16th Every Tuesday Cage, bringing the music and craic, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-16 20:00:00 2025-09-16 00:00:00 America/New_York Live Music - Cage O'Hanlon Cage, bringing the music and craic, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Noel Rochford Tuesday September 16th Every Tuesday We bring you Noel Rochford, multi-instrumentalist, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-16 20:00:00 2025-09-16 00:00:00 America/New_York Live Music - Noel Rochford We bring you Noel Rochford, multi-instrumentalist, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Kimi Tortuga Thursday September 18th We bring you singer-songwriter, guitarist, and pianist, Kimi Tortuga, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-18 20:00:00 2025-09-18 00:00:00 America/New_York Live Music - Kimi Tortuga We bring you singer-songwriter, guitarist, and pianist, Kimi Tortuga, in front of our fireplace.  Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Sean Patrick Walsh Friday September 19th We bring you, high energy, solo guitarist, Sean Walsh, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-19 21:00:00 2025-09-19 01:00:00 America/New_York Live Music - Sean Patrick Walsh We bring you, high energy, solo guitarist, Sean Walsh, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Niall McIlroy Saturday September 20th We bring you, solo guitarist, Niall McIlroy, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-20 21:00:00 2025-09-20 01:00:00 America/New_York Live Music - Niall McIlroy We bring you, solo guitarist, Niall McIlroy, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Greg Roy Thursday September 25th We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-25 20:00:00 2025-09-25 00:00:00 America/New_York Live Music - Greg Roy We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Steve Cary Friday September 26th We bring you Steve Cary in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-26 21:00:00 2025-09-26 01:00:00 America/New_York Live Music - Steve Cary We bring you Steve Cary in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Brendan Nolan Saturday September 27th We bring you Brendan Nolan, a true Dubliner, singer-songwriter, solo guitarist, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 05:00 PM - 08:00 PM 2025-09-27 17:00:00 2025-09-27 20:00:00 America/New_York Live Music - Brendan Nolan We bring you Brendan Nolan, a true Dubliner, singer-songwriter, solo guitarist, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Chad McDonald Saturday September 27th We bring you Chad McDonald, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-27 21:00:00 2025-09-27 01:00:00 America/New_York Live Music - Chad McDonald We bring you Chad McDonald, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Parties Catering Jobs"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Contact/rJABzJ3L",
      "text": "Contact Mary Margaret's Olde Irish Tavern  - St. Petersburg Chamber of Commerce Skip to content JOIN MEMBER LOGIN Menu Membership Become a Member Member Benefits Member Bright Spots Ribbon Cutting Requests Bright Spot Request Form Member Job Postings Member Directory Events Calendar News Our Work 2024 Annual Report Councils and Committees Programs and Events The Greenhouse Advocacy Community Leadership St. Pete Young Professionals Leadership St. Pete Tech Founders The Foundation St. Pete St. Pete Store and Visitors Center City of St. Pete History of St. Pete Healthy St. Pete Parks and Recreation Maps The Districts Visit St. Pete/Clearwater Getting Around Destination Magazine Things To Do Beaches Eat and Drink Travel Deals Nightlife Places to Stay I Love the Burg Airports St. Pete Clearwater International (PIE) Tampa International Airport (TPA) Albert Whitted Airport St. Petersburg Economic Development Corporation Our Sports Teams The Rays Tampa Bay Lightning The Rowdies Tampa Bay Buccanneers About Us Leadership and History Nominate Leadership St. Pete Community Investors Chamber Staff Chamber Ambassadors Become an Ambassador Contact Mary Margaret's Olde Irish Tavern My Contact Information Name * Email Address * Subject * Message * Powered By GrowthZone © 2025 St. Petersburg Chamber of Commerce | Site by GrowthZone Thank you to our Investors! City of St. Pete VSPC Rays Rowdies Marina Bay I Love the Burg Duke Energy EDC The Bank of Tampa Kahwa Orlando Health Peninsular Mechanical Regions Bank The Root Agency SmartChoice St. Anthonys Hospital Florida Orchestra Bank of America Community Foundation Cyberlicious Cyndeo Wealth Partners Eckerd College First Horizon Hancock Whitney Johns Hopkins Johnson Pope PNC Bank Power Design SPC Tampa Bay Times TECO Trenam Law USF Valley Bank Vine IT Wannemacher Jensen Next Previous Keep in touch. 100 2nd Avenue North #150 St. Petersburg, FL 727-821-4069 General Info & Membership lcissna@stpete.com Visitors & Tourism tourism@stpete.com Media & Press bsoler@stpete.com Our Core Values Innovation. Excellence. Inclusivity. Accountability. Integrity. Terms Privacy Policy Terms of Use Press & Media Inquiries Quick Links 2024 Annual Report & 2025 Calendar of Events Ribbon Cutting Request Form Bright Spot Request Form Member Benefits The Greenhouse Building Back Nominate Leadership Let's Connect. @stpetechamber Facebook twitter LinkedIn Instagram youtube © 2025 St. Petersburg Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://marymargarets.com/st-petersburg-downtown-st-pete-jannus-block-mary-margaret-s-olde-irish-tavern-about",
      "text": "Mary Margaret's Olde Irish Tavern - About Skip to Main Content (727)-873-6764 pete@marymargarets.com 29 3rd Street North                                                          , St. Petersburg Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Mary Margaret's Olde Irish Tavern Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Mary Margaret's Olde Irish Tavern How we came to be the Olde Irish Tavern From the books of legends, Mary Margaret's Olde Irish Tavern came of age with a merry band of publicans led by Pete, Kat, Aaron & Ian. Named for Pete's grandmother, Mary Margaret Prescott, who's beauty salon sat inside these 4 walls decades prior, Mary's sought to be the quitessential Irish pub in Tampa Bay that celebrates all aspects of Celtic Irish Culture, which led our founders to make the pilgrimage to the homeland and beyond to find what made an Irish Pub truly authentic. From traditional food to fine whiskeys, proper pints & Irish Rebel Music, Mary Margaret's transports you to the Auld Sod with olde world friendly hospitality in an environment fit for any occassion. Have a pint, make some friends, and stay a while. Erin go Bragh. Contact us: by phone (727)-873-6764, by email pete@marymargarets.com Parties Catering Jobs"
    },
    {
      "url": "https://business.stpete.com/memberdirectory/Details/mary-margaret-s-olde-irish-tavern-2057301",
      "text": "Directories  - St. Petersburg Chamber of Commerce Skip to content JOIN MEMBER LOGIN Menu Membership Become a Member Member Benefits Member Bright Spots Ribbon Cutting Requests Bright Spot Request Form Member Job Postings Member Directory Events Calendar News Our Work 2024 Annual Report Councils and Committees Programs and Events The Greenhouse Advocacy Community Leadership St. Pete Young Professionals Leadership St. Pete Tech Founders The Foundation St. Pete St. Pete Store and Visitors Center City of St. Pete History of St. Pete Healthy St. Pete Parks and Recreation Maps The Districts Visit St. Pete/Clearwater Getting Around Destination Magazine Things To Do Beaches Eat and Drink Travel Deals Nightlife Places to Stay I Love the Burg Airports St. Pete Clearwater International (PIE) Tampa International Airport (TPA) Albert Whitted Airport St. Petersburg Economic Development Corporation Our Sports Teams The Rays Tampa Bay Lightning The Rowdies Tampa Bay Buccanneers About Us Leadership and History Nominate Leadership St. Pete Community Investors Chamber Staff Chamber Ambassadors Become an Ambassador Business Directory This page is no longer available. Search for someone else Powered By GrowthZone © 2025 St. Petersburg Chamber of Commerce | Site by GrowthZone Thank you to our Investors! City of St. Pete VSPC Rays Rowdies Marina Bay I Love the Burg Duke Energy EDC The Bank of Tampa Kahwa Orlando Health Peninsular Mechanical Regions Bank The Root Agency SmartChoice St. Anthonys Hospital Florida Orchestra Bank of America Community Foundation Cyberlicious Cyndeo Wealth Partners Eckerd College First Horizon Hancock Whitney Johns Hopkins Johnson Pope PNC Bank Power Design SPC Tampa Bay Times TECO Trenam Law USF Valley Bank Vine IT Wannemacher Jensen Next Previous Keep in touch. 100 2nd Avenue North #150 St. Petersburg, FL 727-821-4069 General Info & Membership lcissna@stpete.com Visitors & Tourism tourism@stpete.com Media & Press bsoler@stpete.com Our Core Values Innovation. Excellence. Inclusivity. Accountability. Integrity. Terms Privacy Policy Terms of Use Press & Media Inquiries Quick Links 2024 Annual Report & 2025 Calendar of Events Ribbon Cutting Request Form Bright Spot Request Form Member Benefits The Greenhouse Building Back Nominate Leadership Let's Connect. @stpetechamber Facebook twitter LinkedIn Instagram youtube © 2025 St. Petersburg Chamber of Commerce. All Rights Reserved | Site by GrowthZone Scroll To Top Enable JavaScript to ensure website accessibility"
    },
    {
      "url": "https://www.stmargarets-school.org.uk/about-us/our-people/meet-the-team",
      "text": "Staff | Team | St Margaret's Home About Us About Us Welcome From The Head Welcome From Our Students ISI Inspection Report Our People Pastoral Co-Education Exam Results Higher Education & Beyond Alumni Our History Our Community Admissions Admissions The Nursery Admissions Junior School Admissions Senior School Admissions Sixth Form Admissions International Admissions Fees Scholarships & Bursaries Visit Us The Nursery The Nursery Curriculum Excellent Care Outdoor Learning Our Day & Wraparound Care Junior School Junior School Lower Junior Upper Junior Senior School Senior School Academic Pastoral Co-curricular & Sport Our Day Sixth Form Sixth Form Academic Pastoral Co-curricular & Sport Our Day Boarding Boarding Boarding Life International Students International Students EAL Our School Our School Waterhouse Our Music Centre Our Sports Facilities Our Grounds Travelling To School Stories {{ result.title }} No search results Meet The Team Warm relationships are key to our success The Senior Management Team (SMT) are responsible for the day to day running of the School and to the Governors for the leadership and management of St Margaret’s. We place great value on direct communication and as such we actively invite pupils and families to be in contact with our SMT and will regularly seek feedback. The Senior Team is made of the Head, Lara Péchard; the Vice Principal, Julie Chatkiewicz; the Head of Junior School, Emma Gray; the Deputy Head: Academic, Simon Winchester; the Deputy Head: Operations, Stuart Borrill; the Director of Finance & Operations, Andy Francombe and the Director of Marketing & Admissions, Sally Elvin. Lara Péchard Head With a passion for US history I started my teaching career at Portsmouth Grammar School where I quickly became involved in the wider life of the School and became the Head of Sixth Form. I developed expertise in supporting students develop and prepare for life at university and beyond. As Principal Deputy Head at Norwich School, the job was broad. Here I oversaw the pastoral life of the School and developed the wellbeing support which was recognised by an award from Mind. Both my previous schools were turning co-educational as I joined and I played an important role in their transition. As Head of St Margaret’s I am immensely proud of our ethos and accomplishments. It is a beautiful school where there is a real warmth in relationships, where individuals and their passions are supported and stretched. Julie Chatkiewicz Vice Principal I began my career teaching history at Blacon High School, Chester, where I saw the impact and difference a teacher could make to a young person’s life. My next post at the Licensed Victuallers’ School gave me the opportunity of joining their girls’ boarding house as a resident tutor whilst still teaching history. Boarding allows you to become more involved in the community of a school and this drew me to St. Margaret’s where I joined as Head of Lower School. 30 years on, I am now proud to be Vice Principal at a school which truly allows young people to develop their potential at their own pace during their journey through education and beyond. Emma Gray Head of Junior School My teaching career started after a Masters in Teaching, completed in Australia. I moved back to London to teach at two independent schools, first at Hornsby House before moving to Knightsbridge School, from its inception in 2006. As Director of Studies, I enjoyed shaping the curriculum, teaching and learning from Nursery - Y8.  In 2012, a move to Hertfordshire and a role at York House gave further opportunities, including Head of Pre-Prep and Assistant Head. At York House, I played an integral part as the school moved from a boys’ school to fully co-educational.  It is an absolute privilege to be Head of the Junior School at St Margaret’s, providing the foundations and clear pathways for children to flourish. Simon Winchester Deputy Head: Academic After an undergraduate degree in English Literature, running ski camps for children in Switzerland persuaded me of the rewards of working with young people; I trained as a teacher at University College London and initially taught English for several years at two co-educational maintained sector schools in London. In 2012 I became Head of English at Wycombe Abbey School, where I oversaw a large and successful department. I am an A-level examiner in English Literature for a UK examination board. My post as Deputy Head (Academic) gives me the responsibility for ensuring that teaching and learning across the School is the best it can be. Sally Elvin Director of Marketing & Admissions I trained as a fashion stylist and journalist at the London College of Fashion and began my career working on the fashion pages of national women’s magazines. It was a fast-moving, creative environment that gave me a strong foundation in visual storytelling and editorial production. After a career break to raise my children, I returned to creative work through photography, which allowed me to re-engage with visual communication from a different perspective. From there, I moved into a marketing and admissions role at a university, and more recently, into the independent school sector, working across marketing, communications, and admissions. My career has followed a varied path, but at its core has always been a focus on clear communication, creativity, and connecting with audiences in meaningful ways. Stuart Borrill Deputy Head: Operations After qualifying from the Royal Welsh College of Music and Drama, I started my teaching career in a large co-educational school in Surrey. I have worked as a Head of Department, Head of Faculty, and an Assistant Head. I am passionate about the Arts in schools, especially youth theatre and the opportunities and skills it provides young people. As Deputy Head (Operations) I am responsible for curriculum design and timetabling. At St. Margaret’s we aim to deliver a broad and balanced curriculum with high levels of academic contact time, whilst also providing ample opportunity to engage with a multitude of enrichment activities. Andy Francombe Director of Finance and Operations Following qualification as a Chartered Accountant I pursued a career in commerce, which has taken me all over the world including stints living in Australia and Hungary. I joined my first school, St Paul’s School in Barnes, as Director of Finance and IT. This was followed by Northwood Schools Group in Wandsworth and from there I joined the team at St Margaret’s. I love the breadth of my role, working with teachers and support staff, managing pretty much everything outside education. My and my team’s role is to provide the tools and infrastructure to ensure our teachers are able to provide the best educational experience they can to pupils, plus working with our Leadership Team and Governors to deliver on the School’s long term strategic vision. Take a look at our Prospectus “The Leadership team has the right ethos and ideas to take the School to the next level” Download Merry Hill Road, Bushey Hertfordshire, WD23 1DT United Kingdom View Map +44 (0)20 8416 4400 schooloffice@stmargarets-school.org.uk For our Parents Term Dates Parent Portal For the Public Sports Centre Work With Us Campus Map Home Intranet Policies & Guidelines Privacy Notices Inspection Report Registered Charity no. 1056228 A company limited by guarantee, registered in England & Wales no. 3201182 © Copyright 2025 St Margaret's School - All Rights Reserved. By Thursday Essential cookies Essential cookies enable core\n          functionality such as page navigation. The website cannot function\n          properly without these cookies; they can only be disabled by changing\n          your browser preferences. Performance cookies Performance cookies help us to\n          improve our website by collecting and reporting information on its usage\n          (for example, which of our pages are most frequently visited). Marketing cookies We use third party cookies on\n          our site to serve you with advertisements that we believe are relevant\n          to you and your interests. You may see these advertisements on our site\n          and on other sites that you visit. This website uses cookies to\n        improve your experience. We'll assume you're ok with this, but you can\n        opt-out if you wish. Accept Manage cookies"
    },
    {
      "url": "https://marymargarets.com/st-petersburg-downtown-st-pete-jannus-block-mary-margaret-s-olde-irish-tavern-drink-menu",
      "text": "Mary Margaret's Olde Irish Tavern - Drink Menu Skip to Main Content (727)-873-6764 pete@marymargarets.com 29 3rd Street North                                                          , St. Petersburg Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Our Drinks Cocktails Summer Cocktails 2025 Whiskey of the Month Cocktails The Old-fashioned O'boland Jameson Caskmate's simple syrup, angostura bitters & a dash o' Guinness Draught, garnished with filthy cherry & orange peel The Proper B.V. Irish Coffee A homage to Buena Vista Cafe's signature international Irish Coffee recipe with Tullamore DEW Irish Whiskey, Kahwa Coffee, brown sugar & cream Paddy's Irish Martini Equal parts Paddy's Irish Whiskey & Bailey's Irish Cream on the rocks Mary's Margarita A golden margarita with Gold Teuila, Gran Marnier and fresh lemon & lime juice O'malley's Irish Breakfast Shooter Jameson Whiskey & Buttershots served neat with an OJ & bacon chaser Tully's Irish Mule The Three Point Shot Discover the new Juniper Summer Cocktail Menu at Mary Margaret’s Olde Irish Tavern—featuring refreshing gin cocktails, handcrafted botanicals, and build-your-own G&T creations in the heart of downtown St. Pete. Summer Cocktails 2025 Rose Collins $10.00 Glendalough Rose Gin, Rose Liquor, Lemon and Sugar topped with Club Soda Bitter Bee $12.00 Barr Hill Gin, Campari, Vermouth Bianco, Honey Syrup and fresh Lemon. Speyside $10.00 Tulchan Speyside Gin, Fresh Lemon Juice and Simple Syrup topped with bubbles  . Cucumber Gimlet $12.00 Minke Irish Dry Gin, Fresh Lime Juice and Simple Syrup served up   $12 G & T Bar Build your own Gin and Tonic - $12 Base -  Hendrick’s Gin or Hendrick’s Grand Cabaret +$2 (notes of stone fruit and sweet herbs) or Hendrick’s Oasium +$2 (notes of aromatic herbs and bright fruit) Choose a Bitter - Cucumber or Orange. Choose a Tonic - Lemon, Cucumber, Elderflower, Classic, Mediterranean, Pink. Discover our Whiskey of the Month at Mary Margaret’s — a bold new pour chosen to surprise your palate and elevate your next visit. Whiskey of the Month Teeling Whiskey $6.00 Single Shot Teeling Peach Lemonade $10.00 Teeling Small Batch Irish Whiskey, Peach Syrup, Fresh Lemon  and Lemonade Teeling Flight $15.00 Featuring Small Batch, Pot Still, Black Pitts and World of Wood Florida Cask Edition Flight This Month Only: Just $30! Parties Catering Jobs"
    },
    {
      "url": "https://marymargarets.com/",
      "text": "Mary Margaret's Olde Irish Tavern - Downtown St. Pete / Jannus Block, St. Petersburg, FL Skip to Main Content (727)-873-6764 pete@marymargarets.com 29 3rd Street North                                                          , St. Petersburg Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs A taste of Ireland Our Menu Sláinte! Our Drinks Pick up or get delivered Order online Timeless Irish Pub About us Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 slideshow start stop playing map marker pin 29 3rd Street North, St. Petersburg, FL 33701 Mary Margaret's Olde Irish Tavern From the books of legends, Mary Margaret's Olde Irish Tavern came of age with a merry band of publicans led by Pete, Kat, Aaron & Ian. Named for Pete's grandmother, Mary Margaret Prescott, who's beauty salon sat inside these 4 walls decades prior, Mary's sought to be the quitessential Irish pub in Tampa Bay that celebrates all aspects of Celtic Irish Culture, which led our founders to make the pilgrimage to the homeland and beyond to find what made an Irish Pub truly authentic. Read more Our menu St. Pete’s Authentic Irish Tavern From traditional food to fine whiskey, proper pints & Irish Rebel Music, Mary Margaret's transports you to the Auld Sod with olde world friendly hospitality in an environmrnt fit for any occasion. View menu Specials 40% Off Whiskey Flights 11:00 AM - 02:00 AM ALL SPECIALS Order online Pickup or get delivered Our dining room is open with the current guidelines to keep you safe. But if you’d rather order one of our delicious meals delivered click the button below. Order now Reservations Book your table today Mary Margaret's is a timeless Irish Pub serving up proper pints, classic cocktails, great pub grub, fine whiskey and live music along with friendly conversation. Book a table and make some memories! Book now Reviews review by - Yelp Deborah W.: Staff was friendly, atmosphere welcoming and food was exceptional. My vegan bangers and mash was delicious!  There are 3 vegan choices; shepherdess pie, bangers and mash, and impossible burger.  All meals reasonably priced. review by - Yelp Carolyn T.: Quaint little Irish bar with very friendly Irish workers. They know how to pour a Guinness tge right way. Rueben was tasty, and they have a band play at night. It gets crowded, so get there earlyfor a seat. review by - Yelp Dawn M.: Service outstanding, Shepard's pie very very good! Potato's are good. We also tried the fried chicken sandwich that was breaded.That also was amazing. Great fun vibe! Go when there's live music! Outdoor seating is plentiful but fills up quickly! review by - Yelp Jann M.: DON'T miss it!  Everything about Mary Margaret's is amazing!  An absolutely fabulous Irish Pub with the beer, food, music & ambiance that makes you feel at home.  Ronan & Liz are almost perfect in every way - personable, phenomenal servers and gracious hosts!  We never miss a chance when we're in town! review by - Yelp Nathan G.: Great Irish food and drink. If you're looking for something else, then go somewhere else. Food was tremendous and came out quickly. Potions were adequate. Had Irish music playing to add to the ambience. Both seating indoors and at the sidewalk were available Stop reviews carousel Play reviews carousel Newsletter Location 29 3rd Street North St. Petersburg, FL 33701 Hours Mon, Tue, Wed, Thur 11:00 AM - 1:30 AM Fri 11:00 AM - 3:00 AM Sat 10:00 AM - 3:00 AM Sun 10:00 AM - 12:30 AM Find us on... Facebook page Instagram page Yelp page Contact us (727)-873-6764 pete@marymargarets.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. Parties Catering Jobs × Newsletter We strive to make our website accessible to everybody. Learn More."
    },
    {
      "url": "https://www.tampabay.com/arts-entertainment/food/2020/02/17/traditional-pub-mary-margarets-olde-irish-tavern-is-coming-to-st-petersburg/",
      "text": "Traditional pub Mary Margaret’s Olde Irish Tavern is coming to St. Petersburg Search Subscribe Manage profile Donate Log in Log out Menu Close Journalism you trust. Your News. Your Way. Subscribe Support Local Journalism Donate Home Home Log in Log in Log out Log out Search Search Newsletters Newsletters Help chat Help Chat Go to the e-Newspaper Navigation caret Go to the e-Newspaper Subscribers only Featured The Marked Man Buying up the Bay Elections The Housing Experiment Latest News Navigation caret Regions Pinellas Hillsborough Pasco Hernando St. Petersburg Tampa Clearwater Topics Education Business Real Estate Politics Crime Obituaries Navigation caret Weather Navigation caret Sports Navigation caret Bucs Rays Lightning High Schools Bulls Gators Seminoles Viewpoints Navigation caret Life & Culture Navigation caret Things To Do Calendar Food Navigation caret Videos Navigation caret Photos Navigation caret Investigations Navigation caret Connect with us Navigation caret Games & Puzzles Navigation caret Shop Navigation caret Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Hurricane News Sports Viewpoints Life & Culture Food Obituaries Classifieds Today's Paper Newsletters e-Newspaper e-Newspaper Subscribers only Subscribe Advertisement Life & Culture / Food Traditional pub Mary Margaret’s Olde Irish Tavern is coming to St. Petersburg Expect Irish fare and brews for lunch, dinner and into the wee hours of the night. Mary Margaret's Olde Irish Tavern co-owner Pete Boland poses with photos of his family that will hang in the new St. Petersburg pub. He's holding a portrait of his late grandmother Mary Margaret Prescott, whom the bar is named after. [ MEAGHAN HABUDA  |  Times ] By Meaghan Habuda Times staff Published | Updated Meaghan Habuda Senior Engagement Editor MORE FOR YOU British pub The Moon Under Water finally has a new home • Food New Italian restaurant coming to Carrollwood, from Cooper’s Hawk group • Food Advertisement Hungry Harry’s celebrates 40 years of Land O’ Lakes barbecue • Food Lucky Tigre has moved to a new restaurant space in Old West Tampa • Food Tampa’s Olive Tree restaurant is already good. Now, it’s about to get big. • Food Food historian, author and USF librarian Andrew Huse left a legacy of loving Tampa • Life & Culture This Florida Italian restaurant celebrates 25 years of creating community • Florida In Dunedin, MockFusion creates bar atmosphere minus the alcohol • Bars & Breweries Temple Terrace bets big on boozy pickleball complex • Bars & Breweries ‘Prices are just too high’: Florida newspaper asks people why they’re not dining out • Florida Advertisement Advertisement Advertisement Tampa Bay Times Logo The words \"Tampa Bay Times\" written in a Gothic font Instagram Facebook Twitter/X Youtube LinkedIn Contact Help Chat Customer Service Submit a News Tip Contact Account Digital access Home delivery Newsletters Manage my account Donate Subscriber FAQ e-Newspaper FAQ e-Newspaper App FAQ About Times Publishing Company About us Connect with us Careers Advertise Times Total Media Media Kit Place an ad Public Notices Classifieds Best of the Best Shop Champa Bay Shop Bucs Hardcover Book Lightning Hardcover Book Photo Reprints Article Reprints Article Licensing Historic Front Pages Meeting Backgrounds More Spotlight News in Education Expos Homes Sponsored Content Special Sections Apps Podcasts Archives © 2025 All Rights Reserved Times Publishing Company Privacy Policy ONLY AVAILABLE FOR SUBSCRIBERS The Tampa Bay Times e-Newspaper is a digital replica of the printed paper seven days a week that is available to read on desktop, mobile, and our app for subscribers only. To enjoy the e-Newspaper every day, please subscribe. Subscribe Log in"
    },
    {
      "url": "https://marymargarets.com/-events?spot_id=95721&destination=events&promotion=live_music",
      "text": "Mary Margaret's Olde Irish Tavern - events Skip to Main Content (727)-873-6764 pete@marymargarets.com 29 3rd Street North                                                          , St. Petersburg Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Events Live Music - Sean Doyle Wednesday September 10th Every Wednesday We bring you Sean Doyle, the Emigrant Son, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:30 PM - 12:30 AM 2025-09-10 20:30:00 2025-09-10 00:30:00 America/New_York Live Music - Sean Doyle We bring you Sean Doyle, the Emigrant Son, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Greg Roy Thursday September 11th We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-11 20:00:00 2025-09-11 00:00:00 America/New_York Live Music - Greg Roy We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Comin' In Hot Friday September 12th We bring you, Comin' In Hot, playing smooth, tuneful rock music from the 70s and 80s, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-12 21:00:00 2025-09-12 01:00:00 America/New_York Live Music - Comin' In Hot We bring you, Comin' In Hot, playing smooth, tuneful rock music from the 70s and 80s, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Soccer Matches at Mary Margaret's Saturday September 13th Sundays and Saturdays every week Love the thrill of the English Premier League and the passion of Glasgow Celtic FC? Mary Margaret’s is the place to be! Whether you’re a dedicated supporter of clubs like Manchester United, Arsenal, Liverpool, or Chelsea, or simply a fan of the beautiful game, our big screens and enthusiastic crowd make every match unforgettable. English Premier League fans bring their energy and passion, turning Mary Margaret’s into the ultimate game-day destination. Join St Pete Shamrock - Tampa Bay's CSC, proud supporters of Glasgow Celtic FC, as they cheer on their team with unmatched enthusiasm. Share the camaraderie of devoted fans, whether you’re celebrating goals, debating calls, or singing your team’s chants. Wear your team colors, join in the excitement, and feel the energy of every moment. Follow us on Facebook and Instagram for updates, schedules, and all the latest buzz. Come experience soccer like never before at Mary Margaret’s—where the passion of the Premier League and Celtic pride come alive! 10:00 AM - 10:00 PM 2025-09-13 10:00:00 2025-09-13 22:00:00 America/New_York Soccer Matches at Mary Margaret's Love the thrill of the English Premier League and the passion of Glasgow Celtic FC? Mary Margaret’s is the place to be! Whether you’re a dedicated supporter of clubs like Manchester United, Arsenal, Liverpool, or Chelsea, or simply a fan of the beautiful game, our big screens and enthusiastic crowd make every match unforgettable. English Premier League fans bring their energy and passion, turning Mary Margaret’s into the ultimate game-day destination.Join St Pete Shamrock - Tampa Bay's CSC, proud supporters of Glasgow Celtic FC, as they cheer on their team with unmatched enthusiasm. Share the camaraderie of devoted fans, whether you’re celebrating goals, debating calls, or singing your team’s chants. Wear your team colors, join in the excitement, and feel the energy of every moment.Follow us on Facebook and Instagram for updates, schedules, and all the latest buzz. Come experience soccer like never before at Mary Margaret’s—where the passion of the Premier League and Celtic pride come alive! Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Midnight Rovers Saturday September 13th We bring you Midnight Rovers, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 05:00 PM - 08:00 PM 2025-09-13 17:00:00 2025-09-13 20:00:00 America/New_York Live Music - Midnight Rovers We bring you Midnight Rovers, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com The Bawdy Boys Saturday September 13th We bring you The Bawdy Boys, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-13 21:00:00 2025-09-13 01:00:00 America/New_York The Bawdy Boys We bring you The Bawdy Boys, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Cage O'Hanlon Sunday September 14th Every Sunday Cage O'Hanlon, bringing the music and craic, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 07:00 PM - 10:00 PM 2025-09-14 19:00:00 2025-09-14 22:00:00 America/New_York Live Music - Cage O'Hanlon Cage O'Hanlon, bringing the music and craic, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Monday Night Karaoke Monday September 15th Every Monday Monday Night Karaoke – Powered by High Rise Beverages Join us every Monday at 10p for Karaoke Night, sponsored by High Rise Beverages! Whether you're here to sing your heart out or cheer on your friends, it's the perfect way to kick off your week. Great vibes, cold drinks, and your favorite songs all night long.  Plus, 40% off for all service industry pros – just show proof of employment. See you Monday – the mic is waiting! All Day Drink Specials High Rise Beverages - THC Infused Hightails MANGO MARGARITA High Rise Mango, Lime, Agave, Tajín BLUEBERRY MOJITO High Rise Blueberry, Mint, Lime, Sugar PINEAPPLE SUNSET High Rise Pineapple, OJ, Grenadine $8 Each Single Can $8.49 10:00 PM - 01:30 AM 2025-09-15 22:00:00 2025-09-15 01:30:00 America/New_York Monday Night Karaoke Monday Night Karaoke – Powered by High Rise Beverages Join us every Monday at 10p for Karaoke Night, sponsored by High Rise Beverages! Whether you're here to sing your heart out or cheer on your friends, it's the perfect way to kick off your week. Great vibes, cold drinks, and your favorite songs all night long.  Plus, 40% off for all service industry pros – just show proof of employment. See you Monday – the mic is waiting!All Day Drink Specials  High Rise Beverages - THC Infused HightailsMANGO MARGARITAHigh Rise Mango, Lime, Agave, TajínBLUEBERRY MOJITOHigh Rise Blueberry, Mint, Lime, SugarPINEAPPLE SUNSETHigh Rise Pineapple, OJ, Grenadine$8 EachSingle Can $8.49 Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Cage O'Hanlon Tuesday September 16th Every Tuesday Cage, bringing the music and craic, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-16 20:00:00 2025-09-16 00:00:00 America/New_York Live Music - Cage O'Hanlon Cage, bringing the music and craic, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Noel Rochford Tuesday September 16th Every Tuesday We bring you Noel Rochford, multi-instrumentalist, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-16 20:00:00 2025-09-16 00:00:00 America/New_York Live Music - Noel Rochford We bring you Noel Rochford, multi-instrumentalist, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Kimi Tortuga Thursday September 18th We bring you singer-songwriter, guitarist, and pianist, Kimi Tortuga, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-18 20:00:00 2025-09-18 00:00:00 America/New_York Live Music - Kimi Tortuga We bring you singer-songwriter, guitarist, and pianist, Kimi Tortuga, in front of our fireplace.  Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Sean Patrick Walsh Friday September 19th We bring you, high energy, solo guitarist, Sean Walsh, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-19 21:00:00 2025-09-19 01:00:00 America/New_York Live Music - Sean Patrick Walsh We bring you, high energy, solo guitarist, Sean Walsh, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Niall McIlroy Saturday September 20th We bring you, solo guitarist, Niall McIlroy, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-20 21:00:00 2025-09-20 01:00:00 America/New_York Live Music - Niall McIlroy We bring you, solo guitarist, Niall McIlroy, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Greg Roy Thursday September 25th We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-25 20:00:00 2025-09-25 00:00:00 America/New_York Live Music - Greg Roy We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Steve Cary Friday September 26th We bring you Steve Cary in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-26 21:00:00 2025-09-26 01:00:00 America/New_York Live Music - Steve Cary We bring you Steve Cary in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Brendan Nolan Saturday September 27th We bring you Brendan Nolan, a true Dubliner, singer-songwriter, solo guitarist, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 05:00 PM - 08:00 PM 2025-09-27 17:00:00 2025-09-27 20:00:00 America/New_York Live Music - Brendan Nolan We bring you Brendan Nolan, a true Dubliner, singer-songwriter, solo guitarist, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Chad McDonald Saturday September 27th We bring you Chad McDonald, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-27 21:00:00 2025-09-27 01:00:00 America/New_York Live Music - Chad McDonald We bring you Chad McDonald, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Parties Catering Jobs"
    },
    {
      "url": "https://stmargaret.org/pastor/",
      "text": "Meet Our Pastor | St. Margaret Parish 410-838-6969 info@stmargaret.org Facebook Instagram Facebook Instagram Bulletins Events Calendar School Website YouTube Channel Home About Our Parish Our Pastor & Staff Lay Leadership Organizations Parish Registration Liturgy & Prayer Mass Schedule Reconciliation Feasts & Holy Days Eucharistic Adoration Rosary Prayer Resources Liturgical Ministries Ministries Growing in Faith Elementary & Middle School Faith Formation Youth & Young Adults/ Confirmation Adult Sacraments Baptism Becoming Catholic First Reconciliation First Eucharist Confirmation Holy Orders Holy Matrimony Anointing of the Sick Outreach Contact Giving Select Page Meet Our Pastor & Staff St. Margaret Church and St. Mary Magdalen Mission Msgr. Kevin Schenning Pastor Meet Our Pastor Monsignor Schenning is a Baltimorean. He was born in 1954, the second son of Matthew F. Schenning of Highlandtown and Kathleen Hannon Schenning from County Mayo, Ireland. Father Kevin is of German-Dutch and Irish descent. Father Kevin grew up in Shrine of the Little Flower Parish in northeast Baltimore. He attended elementary school there and began high school at Saint Paul’s Latin Day Seminary. When Saint Paul’s closed, he attended Cardinal Gibbons High school and graduated from there in 1972. Father Kevin earned his college degree at Saint Mary’s Seminary College in Catonsville and then entered Saint Mary’s Seminary and University in the Roland Park area of Baltimore. He was awarded his Masters in Divinity Degree in 1981 and ordained a Deacon in May of that year. He was assigned to Immaculate Heart of Mary Parish in Baynesville for his diaconal experience and was then ordained to the priesthood on November 28, 1981. He has served very well in a number of parishes during his years as a priest: Associate Pastor of Our Lady of Mount Carmel Parish in Essex from 1981 to 1988 Associate Pastor of Saint Dominic Parish in Hamilton from 1988 to 1994 Pastor of Saint Joan of Arc Parish in Aberdeen from 1994 to 2000 Pastor of Saint Jane Frances de Chantal Parish in Rivera Beach from 2000 to 2004 Pastor of Saint Joseph Parish in Fullerton from 2004 to 2016. In December 2009, Pope Benedict recognized all that Father had done by bestowing the title on him of Monsignor. Throughout his years as a priest, Father Kevin has served on the Archdiocesan Presbyteral (Priests) Council, the Core Team for City Ministry, and the Priests Personnel Board. Associates Rev. Dan Acquard Associate Pastor Rev. J. Kevin Farmer Associate Pastor Deacons Daniel Cajigas Deacon dcajigas@stmargaret.org Bruce Hultquist Deacon dcnbkh@gmail.com Rob McCord Deacon rsmccord@comcast.net Deacon John Paul Ubah Deacon jpubah@stmargaret.org Herman Wilkins Deacon | Director of Faith Formation hwilkins@stmargaret.org 410-879-2670 ext. 126 Deacon Ken Goedeke Deacon kgoedeke@stmargaret.org Victor Petrosino In Memoriam Deacon James DeCapite In Memoriam Deacon Administration Geoff Denton Business Manager gdenton @stmargaret.org 410-879-2670 ext. 115 Kathleen Reilly Executive Assistant kreilly@stmargaret.org 410-879-2670 ext. 112 Robin Benjes Accounting Assistant rbenjes@stmargaret.org 410-879-2670 ext. 135 Betty Mooney Administrative Associate betty.mooney@stmargaret.org 410-879-2670 ext. 173 Maureen Yantz Technical Administrative Assistant myantz@stmargaret.org 410-879-2670 ext. 111 Barbara Sutton Receptionist receptionist@stmargaret.org 410-838-6969 Theresa Gacheny Receptionist receptionist@stmargaret.org Nina Heck Director of Outreach ninah@stmargaret.org 410-879-2670 ext. 174 Faith Formation Deacon Herman Wilkins Adult Faith Formation hwilkins@stmargaret.org 410-879-2670 ext. 126 Abigail Walton Director of Youth & Young Adult Ministry/ Confirmation awalton@stmargaret.org Lisa Hack Director of Faith Formation Coordinator Elementary Faith Formation lhack@stmargaret.org 410-879-2670 ext. 102 Joan Motsay Brown Sacramental Coordinator jmbrown@stmargaret.org 410-879-2670 ext. 127 Liz Gonzalez Faith Formation Assistant/ Wedding Coordinator lgonzalez@stmargaret.org 410-879-2670 ext. 125 Marylee Archer Coordinator of Middle School Faith Formation marcher@stmargaret.org 410-879-2670 ext. 177 Music Chris King Contemporary Music Leader Tom Wilson Assistant Organist Facilities Sandy Laird Facilities Manager slaird@stmargaret.org 410-879-2670 ext. 116 Dave Kraft Facilities Will Wilkins Custodian St. Margaret School Anna Shanahan Principal St. Margaret School ashanahan@smsch.org 410-879-2670 ext. 138 Lauren Kimmel Vice Principal Elementary School lkimmel@smsch.org Anne Askey Vice Principal Middle School aaskey@smsch.org Terri Castelli Assistant Principal Elementary School tcastelli@smsch.org LOCATIONS St. Margaret Church 141 N. Hickory Avenue Bel Air, MD 21014 St. Mary Magdalen Mission 1716 Churchville Road Bel Air, MD 21015 CONTACT INFO 141 N. Hickory Avenue Bel Air, MD 21014 410-879-2670 info@stmargaret.org Parish Office Hours Lobby open for pick-up and drop-off of items Mon-Thurs 9:00am – 4:00pm Fri. 9:00am – 12:00pm Upstairs parish office by appointment only Call: 410-838-6969 Mon-Thurs 9:00am – 4:00pm Fri. 9:00am – 12:00pm Parish Office closed for lunch 12:00 – 12:45pm SOCIAL MEDIA You Tube Facebook Instagram We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://marymargarets.com/-events",
      "text": "Mary Margaret's Olde Irish Tavern - events Skip to Main Content (727)-873-6764 pete@marymargarets.com 29 3rd Street North                                                          , St. Petersburg Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Facebook page Instagram page Yelp page Toggle navigation Facebook page Instagram page Yelp page Menu Drinks Specials About Music - Events - Watch Parties Parties Catering Gift Cards Jobs Events Live Music - Sean Doyle Wednesday September 10th Every Wednesday We bring you Sean Doyle, the Emigrant Son, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:30 PM - 12:30 AM 2025-09-10 20:30:00 2025-09-10 00:30:00 America/New_York Live Music - Sean Doyle We bring you Sean Doyle, the Emigrant Son, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Greg Roy Thursday September 11th We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-11 20:00:00 2025-09-11 00:00:00 America/New_York Live Music - Greg Roy We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Comin' In Hot Friday September 12th We bring you, Comin' In Hot, playing smooth, tuneful rock music from the 70s and 80s, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-12 21:00:00 2025-09-12 01:00:00 America/New_York Live Music - Comin' In Hot We bring you, Comin' In Hot, playing smooth, tuneful rock music from the 70s and 80s, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Soccer Matches at Mary Margaret's Saturday September 13th Sundays and Saturdays every week Love the thrill of the English Premier League and the passion of Glasgow Celtic FC? Mary Margaret’s is the place to be! Whether you’re a dedicated supporter of clubs like Manchester United, Arsenal, Liverpool, or Chelsea, or simply a fan of the beautiful game, our big screens and enthusiastic crowd make every match unforgettable. English Premier League fans bring their energy and passion, turning Mary Margaret’s into the ultimate game-day destination. Join St Pete Shamrock - Tampa Bay's CSC, proud supporters of Glasgow Celtic FC, as they cheer on their team with unmatched enthusiasm. Share the camaraderie of devoted fans, whether you’re celebrating goals, debating calls, or singing your team’s chants. Wear your team colors, join in the excitement, and feel the energy of every moment. Follow us on Facebook and Instagram for updates, schedules, and all the latest buzz. Come experience soccer like never before at Mary Margaret’s—where the passion of the Premier League and Celtic pride come alive! 10:00 AM - 10:00 PM 2025-09-13 10:00:00 2025-09-13 22:00:00 America/New_York Soccer Matches at Mary Margaret's Love the thrill of the English Premier League and the passion of Glasgow Celtic FC? Mary Margaret’s is the place to be! Whether you’re a dedicated supporter of clubs like Manchester United, Arsenal, Liverpool, or Chelsea, or simply a fan of the beautiful game, our big screens and enthusiastic crowd make every match unforgettable. English Premier League fans bring their energy and passion, turning Mary Margaret’s into the ultimate game-day destination.Join St Pete Shamrock - Tampa Bay's CSC, proud supporters of Glasgow Celtic FC, as they cheer on their team with unmatched enthusiasm. Share the camaraderie of devoted fans, whether you’re celebrating goals, debating calls, or singing your team’s chants. Wear your team colors, join in the excitement, and feel the energy of every moment.Follow us on Facebook and Instagram for updates, schedules, and all the latest buzz. Come experience soccer like never before at Mary Margaret’s—where the passion of the Premier League and Celtic pride come alive! Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Midnight Rovers Saturday September 13th We bring you Midnight Rovers, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 05:00 PM - 08:00 PM 2025-09-13 17:00:00 2025-09-13 20:00:00 America/New_York Live Music - Midnight Rovers We bring you Midnight Rovers, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com The Bawdy Boys Saturday September 13th We bring you The Bawdy Boys, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-13 21:00:00 2025-09-13 01:00:00 America/New_York The Bawdy Boys We bring you The Bawdy Boys, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Cage O'Hanlon Sunday September 14th Every Sunday Cage O'Hanlon, bringing the music and craic, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 07:00 PM - 10:00 PM 2025-09-14 19:00:00 2025-09-14 22:00:00 America/New_York Live Music - Cage O'Hanlon Cage O'Hanlon, bringing the music and craic, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Monday Night Karaoke Monday September 15th Every Monday Monday Night Karaoke – Powered by High Rise Beverages Join us every Monday at 10p for Karaoke Night, sponsored by High Rise Beverages! Whether you're here to sing your heart out or cheer on your friends, it's the perfect way to kick off your week. Great vibes, cold drinks, and your favorite songs all night long.  Plus, 40% off for all service industry pros – just show proof of employment. See you Monday – the mic is waiting! All Day Drink Specials High Rise Beverages - THC Infused Hightails MANGO MARGARITA High Rise Mango, Lime, Agave, Tajín BLUEBERRY MOJITO High Rise Blueberry, Mint, Lime, Sugar PINEAPPLE SUNSET High Rise Pineapple, OJ, Grenadine $8 Each Single Can $8.49 10:00 PM - 01:30 AM 2025-09-15 22:00:00 2025-09-15 01:30:00 America/New_York Monday Night Karaoke Monday Night Karaoke – Powered by High Rise Beverages Join us every Monday at 10p for Karaoke Night, sponsored by High Rise Beverages! Whether you're here to sing your heart out or cheer on your friends, it's the perfect way to kick off your week. Great vibes, cold drinks, and your favorite songs all night long.  Plus, 40% off for all service industry pros – just show proof of employment. See you Monday – the mic is waiting!All Day Drink Specials  High Rise Beverages - THC Infused HightailsMANGO MARGARITAHigh Rise Mango, Lime, Agave, TajínBLUEBERRY MOJITOHigh Rise Blueberry, Mint, Lime, SugarPINEAPPLE SUNSETHigh Rise Pineapple, OJ, Grenadine$8 EachSingle Can $8.49 Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Cage O'Hanlon Tuesday September 16th Every Tuesday Cage, bringing the music and craic, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-16 20:00:00 2025-09-16 00:00:00 America/New_York Live Music - Cage O'Hanlon Cage, bringing the music and craic, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Noel Rochford Tuesday September 16th Every Tuesday We bring you Noel Rochford, multi-instrumentalist, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-16 20:00:00 2025-09-16 00:00:00 America/New_York Live Music - Noel Rochford We bring you Noel Rochford, multi-instrumentalist, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Kimi Tortuga Thursday September 18th We bring you singer-songwriter, guitarist, and pianist, Kimi Tortuga, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-18 20:00:00 2025-09-18 00:00:00 America/New_York Live Music - Kimi Tortuga We bring you singer-songwriter, guitarist, and pianist, Kimi Tortuga, in front of our fireplace.  Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Sean Patrick Walsh Friday September 19th We bring you, high energy, solo guitarist, Sean Walsh, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-19 21:00:00 2025-09-19 01:00:00 America/New_York Live Music - Sean Patrick Walsh We bring you, high energy, solo guitarist, Sean Walsh, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Niall McIlroy Saturday September 20th We bring you, solo guitarist, Niall McIlroy, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-20 21:00:00 2025-09-20 01:00:00 America/New_York Live Music - Niall McIlroy We bring you, solo guitarist, Niall McIlroy, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Greg Roy Thursday September 25th We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 08:00 PM - 12:00 AM 2025-09-25 20:00:00 2025-09-25 00:00:00 America/New_York Live Music - Greg Roy We bring you, Greg Roy, Jamaican roots reggae artist best known for his fiery stage presence and uplifting, poetic performance style, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Steve Cary Friday September 26th We bring you Steve Cary in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-26 21:00:00 2025-09-26 01:00:00 America/New_York Live Music - Steve Cary We bring you Steve Cary in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Brendan Nolan Saturday September 27th We bring you Brendan Nolan, a true Dubliner, singer-songwriter, solo guitarist, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 05:00 PM - 08:00 PM 2025-09-27 17:00:00 2025-09-27 20:00:00 America/New_York Live Music - Brendan Nolan We bring you Brendan Nolan, a true Dubliner, singer-songwriter, solo guitarist, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Live Music - Chad McDonald Saturday September 27th We bring you Chad McDonald, in front of our fireplace. Musicians and times are subject to change. Please check our FB and IG daily for our live music information. 09:00 PM - 01:00 AM 2025-09-27 21:00:00 2025-09-27 01:00:00 America/New_York Live Music - Chad McDonald We bring you Chad McDonald, in front of our fireplace.Musicians and times are subject to change. Please check our FB and IG daily for our live music information. Mary Margaret's Olde Irish Tavern Mary Margaret's Olde Irish Tavern pete@marymargarets.com Parties Catering Jobs"
    }
  ]
}