{
  "fuentes": [
    {
      "url": "https://sbdctampabay.com/mastrys-brewing-co-of-pinellas-county/",
      "email": "nreyes@usf.edu"
    },
    {
      "url": "https://stpetecatalyst.com/mastrys-brewing-receives-1-6-million-for-new-headquarters/",
      "email": "park@stpetecatalyst.com"
    },
    {
      "url": "https://mastrysbrewingco.com/contact/",
      "email": "contact@mastrysbrewingco.com"
    },
    {
      "url": "https://mastrysbrewingco.com/about-us/",
      "email": "contact@mastrysbrewingco.com"
    },
    {
      "url": "https://tbbwmag.com/2025/01/03/mastrys-brewing-hub-renderings/",
      "email": "tbbw-logo-2023-100x50-v1-@2x.png"
    },
    {
      "url": "https://ilovetheburg.com/venue/mastrys-brewing-co/",
      "email": "info@ilovetheburg.com"
    },
    {
      "url": "https://mastrysbrewingco.com/",
      "email": "contact@mastrysbrewingco.com"
    },
    {
      "url": "https://mastrysbrewingco.com/",
      "email": "contact@mastrysbrewingco.com"
    },
    {
      "url": "https://ws-mastry.webflow.io/contact-us",
      "email": "newyork@academy.com"
    },
    {
      "url": "https://ws-mastry.webflow.io/contact-us",
      "email": "newyork@mastry.io"
    },
    {
      "url": "https://ws-mastry.webflow.io/contact-us",
      "email": "sanfrancico@academy.com"
    },
    {
      "url": "https://ws-mastry.webflow.io/contact-us",
      "email": "sanfrancisco@mastry.io"
    }
  ],
  "mails": [
    "contact@mastrysbrewingco.com",
    "info@ilovetheburg.com",
    "newyork@academy.com",
    "newyork@mastry.io",
    "nreyes@usf.edu",
    "park@stpetecatalyst.com",
    "sanfrancico@academy.com",
    "sanfrancisco@mastry.io",
    "tbbw-logo-2023-100x50-v1-@2x.png"
  ],
  "nombre_sitio": "mastrysbrewingco.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://sbdctampabay.com/mastrys-brewing-co-of-pinellas-county/",
      "text": "Mastry’s Brewing Co. of Pinellas County Link to Facebook Link to Youtube Link to X Link to LinkedIn Link to Flickr Link to Slideshare Link to Rss  this site Donate Subscribe Home Solutions Certifications Business Certifications Minority-Owned Business Woman-Owned Business Veteran-Owned Business Consulting & Training Training Training Calendar Consulting Schedule a Consultant Consulta Business Solutions Growth Acceleration Government Contracting International Trade Starting Your Business Disaster Preparedness Student Teams Financing Your Business Resources Business Resources Frequently Asked Questions Insights Blog Media Inquiries About Us Mission / Vision Consultants Meet the Staff Meet Our Clients Partners / Affiliates Training Training Calendar On-Demand Training Results Success Stories Economic Impact Locations Tampa Hernando County Highlands, Hardee, DeSoto Hillsborough Manatee Pasco County Pinellas County Polk County Sarasota Contact Request a Consultant Click to open the search input field Click to open the search input field Search Menu Menu Blog Local Craft Brewery Pours Up a Glass to Business Resiliency and Success Blog , Featured Success Stories , Success Stories Mastry’s Brewing Co. of Pinellas County Nestled in the vibrant coastal community of St. Pete Beach, Matthew Dahm has crafted a remarkable journey as the owner of Mastry’s Brewing Co., the first and only craft brewery in the area. As of this year, Mastry’s has also made history by becoming the first craft distillery in St. Pete Beach, offering locals and visitors alike a unique blend of handcrafted beers and spirits. “I’ve always said I’ve been a bit of a jack of all trades and this right here -the craft beer industry – is what allowed me to really represent that and to feel ultimately fulfilled in my professional career,” Dahm said. Seeking guidance, they turned to the Florida SBDC at Pinellas County Economic Development (PCED) and business consultant Debra Schweikowsky for support. Together, they tackled business planning, and development, while also connecting with lenders to secure crucial funding. “They [Florida SBDC at PCED] helped me Identify the questions that I didn’t know to ask and line me up with the resources to really set us up for success on those next steps that we’re taking with our business development,” he said. Since partnering with the Florida SBDC at PCED, Mastry’s has seen remarkable growth, cementing its reputation as a cornerstone of the St. Pete Beach community. This entrepreneurial milestone wasn’t achieved without its challenges. From starting the business back in 2015 to navigating through the COVID-19 pandemic and weathering the impacts of Hurricanes Milton and Helene, Dahm’s business has demonstrated resiliency at every turn. “The biggest thing I can really speak to when I share that is resiliency as well as professional stamina – the amount of proacting and reacting that we have had as a small business and from that, starting with beer, here we are today, just launched Mastry’s Craft Spirits,” Dahm said. “Because of the networking capabilities that the SBDC has, to put you in contact with not only people within their own team but resources outside of their team, it’s really helped to complete the full circle,” Dahm added. Looking ahead, Dahm plans to continue leveraging the Florida SBDC’s resources to navigate future growth and challenges. “As far as I can see for the future of Mastry’s, the SBDC is on Team Mastry’s, Mastry’s is on Team SBDC, and anything new coming along the line, we know that they are gonna be right there with us and we are definitely gonna be calling upon them any and every new opportunity that comes our way,” he said. The business owner is also looking forward to reaching a new goal for his business and tells us that that Florida SBDC at PCED will be brought on the journey. “We have a brand-new site that we’re developing in the city of Pinellas Park. It is an acre and a half site. We’re focused on building 40,000 square feet of space that’s going to occupy a hundred plus employees and really help bring so much to the community and the city of Pinellas Park,” Dahm said. “Then again, with the backbone support of the SBDC at Pinellas County Economic Development, I really just can’t speak enough on how much support that has been through this. The SBDC and the City of Pinellas Park have just been a huge component adding to that level of success,” he added. For other small businesses considering working with the Florida SBDC at PCED, Dahm offered this advice: “Really as entrepreneurs, we love coaching other entrepreneurs. For me, when I get asked where should I start, how do I get this information, I need help, who do I call? I always tell them, ‘Here’s my friend Debra at the Florida SBDC at Pinellas County Economic Development. She’s a fantastic resource. If she doesn’t know the answer, she’s gonna find you the answer or find somebody who can find you the answer. At the bare minimum you’re gonna be in good hands and put in a great direction,’” Dahm said. Share this entry Share on Facebook Share on X Share on LinkedIn Share by Mail https://enwqtxc9es4.exactdn.com/wp-content/uploads/2024/12/Mastrys-Brewing-Candid68.jpg?strip=all&lossy=1&ssl=1 2000 3000 sbdclarry /wp-content/uploads/2024/10/Locked-Host-Logos-Horizontal-USF-Small-e1728920602651.png sbdclarry 2024-12-17 16:24:31 2025-02-27 05:05:02 Local Craft Brewery Pours Up a Glass to Business Resiliency and Success Categories Business Essentials Business Plans Buying a Business Certifications COVID-19 Crowdfunding Disaster Preparedness Economic Development Finance Government Contracting Growing Your Business Healthcare Human Resources International Trade Marketing Press Releases Radio and Podcast Starting a Business Success Stories Success Stories Videos Tech Commercialization/Tech Transfer Veteran Web and Social Media Subscribe to Newsletter Contact Us Regional Office Contact Info USF CONNECT 3802 Spectrum Blvd., Suite 201 Tampa, FL 33612 813-396-2700 Subscribe to Our Newsletter Florida SBDC Network The Florida SBDC at the University of South Florida is a member of the Florida SBDC Network, a statewide partnership program nationally accredited by the Association of America’s SBDCs and funded in part by the U.S. Small Business Administration, Department of Defense, State of Florida, and other private and public partners, with the University of West Florida serving as the network’s headquarters. Full funding disclosure available at www.floridasbdc.org/funding-disclosures/ . Florida SBDC services are extended to the public on a nondiscriminatory basis. Language assistance services are available for individuals with limited English proficiency. All opinions, conclusions, and/or recommendations expressed herein are those of the author(s) and do not necessarily reflect the views of the SBA or other funding partners. Reasonable accommodations for persons with disabilities and/or limited English proficiency will be made if requested at least two weeks in advance. To request accommodation or language assistance, please contact Nelson Reyes, nreyes@usf.edu, 813.396.2700. Business Assistance State Designated as Florida’s Principal Provider of Business Assistance [§ 288.01, Fla. Stat.] © Florida SBDC at USF   | contact webmaster Link to: Therapeutic Company Goes the Extra Mile, Empowering Families Near and Far Link to: Therapeutic Company Goes the Extra Mile, Empowering Families Near and Far Therapeutic Company Goes the Extra Mile, Empowering Families Near and Far Link to: Public Relations Agency Blossoms with Support from the Florida SBDC at USF Link to: Public Relations Agency Blossoms with Support from the Florida SBDC at USF Public Relations Agency Blossoms with Support from the Florida SBDC at USF Scroll to top Scroll to top Scroll to top Get Answers"
    },
    {
      "url": "https://stpetecatalyst.com/mastrys-brewing-receives-1-6-million-for-new-headquarters/",
      "text": "Mastry’s Brewing receives $1.6 million for new headquarters • St Pete Catalyst ST Pete's Business Daily (and a whole lot more) sign up for a free lifetime subscription And take your seat at the table Name Email Subscribe News Know Innovate Thrive Create Place Impact Venture Content SPG Insight Partner Stories Podcasts People Influencers The Hustle The Shuffle Organizations Connect Contribute Content Promote Your Business Meet the Team Support the Catalyst Events Community Voices Connect with us Type a text St Pete Catalyst News Know Innovate Thrive Create Place Impact Venture Content SPG Insight Partner Stories Podcasts People Influencers The Hustle The Shuffle Organizations Connect Contribute Content Promote Your Business Meet the Team Support the Catalyst Events Community Voices Know Mastry’s Brewing receives $1.6 million for new headquarters Published 2 years ago on January 17, 2024 By Mark Parker St. Pete Beach-based Mastry's Brewing Co. is building a 30,000-square-foot campus at 5805 Park Blvd. in Pinellas Park. Rendering provided. Pinellas County officials awarded $2.3 million Tuesday to help a local brewer overcome soaring construction costs, and to ensure a relocating San Diego-based defense contractor has a suitable new home. Commissioners unanimously approved the two recommended applications submitted through the Employment Sites Program’s (ESP) fifth cycle. Mastry’s Brewing Co. received $1.62 million, nearly 71% of the funding. The St. Pete Beach-based brewer is building an expansive new complex in Pinellas Park. Founder and CEO Matthew Dahm said the project’s scope and building costs exponentially increased since plans began in 2019. “What we want to do is make sure that we don’t miss any step in executing 100% of what we said we’re bringing, and putting as many people to work as we possibly can,” Dahm said. “While also bringing in new opportunities for growth, economics and business in the City of Pinellas Park that will really lead the way for generations to come.” The 1.49-acre parcel at 5805 Park Blvd. is part of Pinellas Park’s new mixed-use City Center. Municipal officials selected Dahm to reimagine the property in May 2023. Mastry’s new headquarters and manufacturing hub will also feature tasting rooms, kitchens and event space. County documents state that labor and material acquisition expenses spiked 40-50% since initial estimates. The total project cost for the nearly 30,000-square-foot facility is now $9.7 million. Documents also note that increasing the ceiling height from 20 to 30 feet, implementing a chilled water cooling system and transitioning to a steel frame rather than a concrete block building contributed to the funding gap. Dahm said the expansion would triple Mastry’s current manufacturing capabilities. “We’re estimating that we’re actually going to be able to put over 100 people to work on it,” Dahm said. “We’re talking about a full-on fledged manufacturing entity.” He told the commissioners that Mastry’s has grown by “leaps and bounds” since its 2014 launch. Dahm added that craft brewing is now ingrained in the local culture and promotes philanthropic and tourism efforts. The St. Pete Beach location at 7701 Blind Pass Rd. will remain operational. However, Dahm said the new facility will allow Mastry’s to enter new product segments. “Of course, manufacturing requires equipment,” Dahm said. “Costly equipment.” Dahm said the new headquarters would serve as a local “economic engine” and bolster the tax base. County administrators agreed and gave his application a score of 83 out of 100. A site plan for Mastry’s Brewing Co.’s nearly $10 million project. Screengrab, county documents. San Diego-based Amaratek is relocating to a 33,600-square-foot warehouse in Dunedin. The total development cost is $5.6 million. David Dumas, president of Amaratek, applied for $673,500 to implement fire suppression equipment, security fencing and a new roof. County documents note that the previous owner stored chemicals without wastewater protection, and Dumas will add a catchment system. The rehabilitated and modernized facility will include manufacturing and research space for defense applications. While Dumas did not speak at the meeting, documents state new jobs will “span the economic spectrum.” Those include a “high percentage” of scientists, engineers and skilled tradesmen. County administrators gave Amaratek an ESP score of 92. Commissioner Renee Flowers said the county’s “wonderful” high schools and postsecondary educational institutions would provide a talent pipeline. “Thank you so much for coming to our community,” Flowers said. “And please, by all means, take advantage of our young people who will be graduating from college and eagerly looking for employment opportunities that fall right in line with what you’re doing.” San Diego-based Amaratek’s owner is moving manufacturing and research operations to a 33,600-square-foot building in Dunedin. Screengrab, county documents. Commissioners approved the ESP initiative in Dec. 2019. Teresa Brydon, business development manager, said they have committed about $24 million to capital projects throughout Pinellas – despite pandemic disruptions. County officials dedicate 8.3% of Penny for Pinellas taxes to the program. Brydon said staff verifies financial gaps and amounts requested are accurate before an independent firm conducts additional due diligence. She said “clawback mechanisms” ensure awardees meet terms and conditions over the 20-year agreement. “We’ve paid out over $8.5 million,” Brydon said. “So, we’re doing fairly well considering it’s new and unique to us.” Share Tweet Share Related Topics: Amaratek campus capital projects City Center commissioners complex defense contractor Dunedin employment sites program funding funding gaps jobs manufacturing Mastry's Brewing Co. Penny for Pinellas Pinellas County Pinellas Park products relocate Renee Flowers research San Diego scores St. Petersburg students taxes 4 Comments 4 Comments todd j January 27, 2024at10:12 am wow if i knew you could make mistakes expanding your private brewery business and the city would bail you out I would have started one too This is using public funds for private business – and another over priced beer product. There are thousands of them everywhere. Only a few will survive. But if there’s no risk then hey lets expand and see what happens Reply Danny White January 18, 2024at3:06 pm And people cry foul about government funding for the Tropicana Field/Historic Gas Plant District redevelopment! What some people seem to dismiss is that these types of massive projects bring JOBS and TAX REVENUE to the city and county but people also moan about the of the lack of ‘good paying jobs’ in the area! It’s about give and take and compromise. Reply Tatguy January 17, 2024at9:23 pm Is this a joke?!Wow Reply Tim January 17, 2024at5:24 pm Another government handout!? Reply Leave a Reply Cancel reply Your email address will not be published. Required fields are marked * Please fill out all the form entries below. We do not publish anonymous comments. Comments are held for moderation per our posting guidelines - please read them.  We appreciate your taking the time to share your perspective on how to improve our community. First Name * Last Name * Email * Your email will not be published Subscribe to the Catalyst daily edition, the Daily Spark By posting a comment, I have read, understand and agree to the Posting Guidelines . Subscribe to the Daily Spark Get the latest right to your phone Subscription Form Name Email Subscribe Subscribe to the Daily Spark Get the latest right to your phone Subscription Form Name Email Subscribe You may like North Kenwood duplex under construction Avionics tech company selects St. Pete for global HQ Brush to canvas: News from the art community The St. Pete Catalyst The Catalyst honors its name by aggregating & curating the sparks that propel the St Pete engine.  It is a modern news platform, powered by community sourced content and augmented with directed coverage.  Bring your news, your perspective and your spark to the St Pete Catalyst and take your seat at the table. Email us: s park@stpetecatalyst.com Quick Links Contribute Content Events Sparkive The Wire St Pete X Promote Your Business Connect With Us Subscribe for Free Subscription Form Name Email Subscribe Privacy Policy | Copyright © 2020 St Pete Catalyst Share with friend Enter the details of the person you want to share this article with. Your Name * Your Email * Friend Email * Share"
    },
    {
      "url": "https://mastrysbrewingco.com/contact/",
      "text": "Contact - Mastry's Brewing Co. Skip to content HOME DRINK EAT RELAX EVENTS ABOUT SHOP CONTACT Facebook Instagram YouTube Tiktok Contact MastrysBrewingCo 2024-09-06T16:42:36+00:00 Contact Us Your Name (required) Your Email (required) Subject Your Message Δ × Call Or Stop In Email contact@mastrysbrewingco.com Phone (727) 202-8045 Address 7701 Blind Pass Road St. Pete Beach, FL 33706 Hours Monday – 12:00pm to 10:00pm Tuesday – 12:00pm to 10:00pm Wednesday – 12:00pm to 10:00pm Thursday – 12:00pm to 10:00pm Friday – 12:00pm to 11:00pm Saturday – 12:00pm to 11:00pm Sunday – 12:00pm to 9:00pm In the meantime, follow us on social! EMAIL contact@mastrysbrewingco.com CALL (727) 202-8045 FIND US 7701 Blind Pass Road St. Pete Beach, FL © Copyright 2012 - | Mastry's Brewing Co.  ™ | All Rights Reserved  | Privacy Policy | Terms & Conditions Facebook Instagram YouTube Tiktok Page load link Go to Top"
    },
    {
      "url": "https://mastrysbrewingco.com/about-us/",
      "text": "About Us - Mastry's Brewing Co. Skip to content HOME DRINK EAT RELAX EVENTS ABOUT SHOP CONTACT Facebook Instagram YouTube Tiktok Loading... ABOUT US \"It's the passion, dedication and loyal customers that continue to push us to new boundaries with everything we do.\"\r\n      - Matthew Dahm (Founder/CEO) About Us MastrysBrewingCo 2024-06-20T19:07:20+00:00 Mastry’s Brewing Co. The first craft brewery on St. Pete Beach Mastry’s Brewing Co. was founded in 2014 as a brew-pub operating out of a family-owned restaurant.  In 2016, the operations were expanded, and now Mastry’s Brewing is proud to be the first craft brewery and tasting room on St. Pete Beach. Taking traditional styles and combining influences from exotic locales, Mastry’s Brewing is elevating the beach beer experience.  With selections like the MADE Porter, a chocolate coffee porter brewed with freshly roasted Cacao and local roasted coffee beans, and the wildly popular, Best Florida Beer gold-medal winning Hefeweizen, locals and visitors continue coming back for more. Matthew and Danie Dahm Founder and Owners Matthew and Danie are Florida natives and were inspired by their hardworking and entrepreneurial parents who built their own businesses from the ground up. Matthew is a 3 rd generation Mastry, a huge family who has had its roots in St. Petersburg since the late nineteenth century. The couple wanted to honor this family history, and particularly Matthew’s grandmother, Juliet, so they chose it as the namesake for their brewery. Avid craft beer fans, they began their own craft beer endeavor when Matthew began home-brewing on weekends while Danie worked on her doctorate. Matthew and Danie are passionate about beer and contributing to the local St. Pete and St. Pete Beach community. Come have a beer with us! CALL (727) 202-8045 FIND US 7701 Blind Pass Road St. Pete Beach, FL 33706 EMAIL contact@mastrysbrewingco.com © Copyright 2012 - | Mastry's Brewing Co.  ™ | All Rights Reserved  | Privacy Policy | Terms & Conditions Facebook Instagram YouTube Tiktok Page load link Go to Top"
    },
    {
      "url": "https://tbbwmag.com/2025/01/03/mastrys-brewing-hub-renderings/",
      "text": "Great Places and Spaces: Mastry's Brewing Hub (RENDERINGS) - Tampa Bay Business & Wealth Digital Magazine Skip to content Main Navigation Tampa Bay Business & Wealth Search for: Sections Signature Events Upcoming Events Awards and Event Highlights Apogee Awards CEO Connect Philanthropist of the Year Awards Women Who Win Awards Women’s Wellness Invitational All Events Ask the Experts Awards On The Scene Calendar Community Event Calendar Submit an event Economic Development Economic impact Economic impact Coronavirus Editor’s Choice Editor’s Choice 20 Question with… Cover Stories Great Places and Spaces Local Business Luxe Life Mansions on the Market Posher Palate Hurricane Alliance Industries Industries Arts & Culture Banking & Financial Advice Cars, Boats & Toys Education & Philanthropy Entrepreneurs & Business Strategy Fashion and Retail Health Care & Wellness Law & Professional Services Marine Real Estate Retail Sports Technology Travel & Recreation People Profiles Local Buzz All Local Buzz Things To Do One Liners All One Liners Hillsborough Manatee/Sarasota Pasco Pinellas Polk The Good Life Thought Leadership Women of Business About TBBW Advertise With TBBW Contact Us Digital Publications Meet The Team Subscribe Social Media Connect Tampa Bay Business & Wealth Subscribe Header Navigation Posher Palate Editor’s Choice 20 Question with… Cover Stories Great Places and Spaces Local Business Mansions on the Market People Profiles The Good Life Luxe Life Signature Events Upcoming Events Awards & Event Highlights Apogee Awards Philanthropist of the Year Awards Women Who Win Women’s Wellness Invitational Thought Leadership Industries Banking & Financial Advice Cars, Boats & Toys Commercial Real Estate Education & Philanthropy Entrepreneurs & Business Strategy Fashion and Retail Health Care & Wellness Human Resources/Management Law & Professional Services Marine Real Estate Retail Sports Technology Travel & Recreation Calendar Community Event Calendar Submit an event Hurricane Alliance About Us Meet The Team Contact Us Advertising With TBBW Great Places and Spaces Great Places and Spaces: Mastry’s Brewing Hub (RENDERINGS) January 3, 2025 | Jo-Lynn Brown Mastry’s Brewing Hub , a 40,000-square-foot brewery and marketplace, is planned for Park Junction, a new mixed-use destination, in Pinellas Park. Matthew Dahm , founder and chief executive officer of Mastry’s Brewing Co., expects to begin site work by the end of the year, which includes a 5,000-square-foot brewery and a 36,000-square-foot indoor food hall and market, at 5805 Park Blvd. Renderings for the development showcase a courtyard with a children’s play area, an outdoor performance stage, green space and an activated rooftop with seating and lawn games. The brewery and marketplace will feature a taproom, offices, art studios and an event space with a full audio-visual setup. Mastry’s Brewing Co., which opened St. Pete Beach’s first craft brewery in 2016, at 7701 Blind Pass Road, offers more than 15 beers on tap. The St. Pete Beach location will remain open. The new Pinellas Park hub is expected to grow Mastry’s manufacturing capacity by five times, boosting regional distribution. The expanded facility will also offer brewery tours and hands-on educational programs for University of South Florida St. Petersburg students. Mastry’s is partnering with general contractor Sinclair Group and Greg Walden of BDG Architects . Walden also designed the original architectural plans for the St. Pete Beach brewery. Print Share Share on Facebook Share on Twitter Share on LinkedIn Share on Pinterest Tags: featured You May Also Like Construction underway on luxury waterfront community on Tampa Bay (RENDERINGS) September 1, 2025 Great Places and Spaces: Dynasty Financial Partners Signs Major Lease At 400 Central (RENDERINGS) July 30, 2025 Great Places and Spaces: Topping out of AQUA’S first tower at Westshore Yacht Club (RENDERINGS) June 4, 2025 Great Places and Spaces: Condo project on Corey Avenue (RENDERINGS) May 9, 2025 Upcoming Events Apogee Awards 2025 Learn More featured Rob Higgins named USF’s first CEO of Athletics Sep 10, 2025 Kettler names James Nozar president of development, to lead Gasworx in Tampa Sep 9, 2025 Keep up with TBBW's top headlines Subscribe to our free eNewsletter Email Address Comments This field is for validation purposes and should be left unchanged. Latest Issue READ LATEST ISSUE MAGAZINE ARCHIVE More Great Places and Spaces Posts Waldorf Astoria Residences coming to St. Petersburg in 50-story tower (RENDERINGS) May 1, 2025 | Jo-Lynn Brown Luxury development to become city’s tallest building with waterfront views, signature amenities Read More Great Places and Spaces: Waterways Apartments and Marina (RENDERINGS) April 7, 2025 | Jo-Lynn Brown Work has begun on Waterways Apartments and Marina, a 39-acre waterfront development, in north St. Pete, set to bring over 470 rental units to Gandy Boulevard. Miami-based Key International is Read More Great Places and Spaces: Johns Hopkins All Children’s Hospital plans Wesley Chapel expansion (RENDERINGS) March 2, 2025 | Jo-Lynn Brown Johns Hopkins All Children’s Hospital is set to expand in Wesley Chapel with a new 56-bed pediatric hospital. Construction is slated to begin in 2025, with the facility expected to Read More Great Places and Spaces: TBBW’s New Office in Carillon (PHOTOS) February 4, 2025 | Jo-Lynn Brown After spending the summer in a temporary space, the team at Tampa Bay Business and Wealth has officially moved into its new office. The first-floor office, located in the Mercury Read More Other Posts From hours to outcomes: Tampa panel explores the future of work in an AI world September 9, 2025 | Geneva Maresma Tampa Bay leaders debate the end of hourly billing, exploring AI-driven pricing models and the future of work. Read More Scenes from TBBW’s Women’s Wellness Invitational 2025 (PHOTOS) September 8, 2025 | Jo-Lynn Brown Tampa Bay Business and Wealth’s fourth annual Women’s Wellness Invitational, presented by presented by Cigna, Fifth Third Bank, HCA Florida South Tampa Hospital, the Hospital for Endocrine Surgery and Questmont, Read More USF Sarasota-Manatee to build new $6.5 million STEM facility September 5, 2025 | Jo-Lynn Brown The University of South Florida Sarasota-Manatee campus plans to build a new $6.5 million STEM academic facility, a project that leaders say will expand access to high-quality lab instruction in Read More LD&D secures $5.4 million grant to add workforce housing at DoMo at Cass Square September 5, 2025 | Jo-Lynn Brown Miami-based real estate firm LD&D has been awarded a $5.4 million workforce housing grant from the Tampa Community Redevelopment Agency to support the inclusion of 30 income-eligible apartments at DoMo Read More Awards & Events Recap Upcoming Events Editor’s Choice Posher Palate Industries Local Buzz Company Tampa Bay Business & Wealth (TBBW) magazine is the leading provider and trusted resource for business leaders affecting change in the Tampa Bay region. TBBW delivers in-depth reporting – with a distinct local perspective – on topics that make a difference in our community. Our wealth coverage will not only provide information for high net worth investors, but will also spotlight the emerging angel investor, venture capital, private equity and hedge fund ecosystem in Tampa Bay. Read More… 1901 Ulmerton Road Suite 100 Clearwater 33762 (727)860-8229 [email protected] About TBBW Contact TBBW Advertise With TBBW Also of Interest Great Places and Spaces: Skyway Village (RENDERINGS) St. Petersburg College unveils plans for... The Rise of Park Junction: Economic... Privacy Policy Terms of Use Ad Services © Copyright , Babcox Media Inc. All rights reserved Latest Digital Edition View All Editions Subscribe Email Address Email This field is for validation purposes and should be left unchanged. Social Connect"
    },
    {
      "url": "https://ilovetheburg.com/venue/mastrys-brewing-co/",
      "text": "Mastry's Brewing Co We use cookies to give you the best experience on our site. Learn more or close to accept. × Skip to content Stories Guides Events Visitors Tours Merch Stories Guides Events Visitors Tours Merch Search Search 0 events found. Event Submission Form Notice There were no results found. Notice There were no results found. Mastry’s Brewing Co Events Venues Mastry’s Brewing Co Address 7701 Blind Pass Road St. Pete Beach , 33706 Get Directions Events at this venue Today Upcoming Upcoming Select date. Previous Events Today Next Events Since I Love the Burg launched in May of 2009, it has been our mission to make St. Petersburg (a.k.a. the #BURG) the best place to live, work and play. Facebook-f Instagram Twitter Tiktok Youtube Envelope Email Subscribe All Things Good Stories Guides Events Shop Visitor's Guide More From Us History Tours About / Contact Advertise Privacy Policy That's So Tampa © All rights reserved Brought to you with ❤️ by WallMedia Partners Stories Guides Events Visitors Merch"
    },
    {
      "url": "https://mastrysbrewingco.com/",
      "text": "Home - Mastry's Brewing Co. Skip to content HOME DRINK EAT RELAX EVENTS ABOUT SHOP CONTACT Facebook Instagram YouTube Tiktok Loading... Mastering the art of craft beer. Home MastrysBrewingCo 2024-12-06T18:28:51+00:00 Welcome to Mastry’s Brewing Company! Loading... Mastry’s Brewing Co. started as an idea in 2014. This idea sparked a collaboration among cousins resulting in the launch of a nano-brewery within the C.D. Roma Italian Restaurant in the Tyrone area of St. Petersburg. After starting the nano-brewery, we began the search for the perfect location for a free-standing microbrewery. In 2016, Mastry’s Brewing Co. opened its doors as the first and only micro-brewery on St. Pete Beach. We have a rich family history. Here’s some background on the Mastry family history and the genesis of Mastry’s Brewing Co!! “IT’S THE PASSION, DEDICATION AND LOYAL CUSTOMERS THAT CONTINUE TO PUSH US TO NEW BOUNDARIES WITH EVERYTHING WE DO.” – Matthew Dahm (Founder/CEO) Mastry’s Brewing Co. stands as a prominent craft brewery and kitchen. We’re a casual oasis nestled in the heart of St. Pete Beach, FL. We take pride in offering a diverse range of libations, including over 15 rotating house brews, seltzers, ciders, wines, cold brew coffee and more, all complemented by a delectable food menu curated by The Kitchen at Mastry’s . Our approach is to blend traditional brewing styles with inspiration from exotic destinations, crafting a unique and boutique beer experience. Our lineup boasts crowd-favorites such as the MADE Coffee Porter, a luscious chocolate coffee porter made from fresh cacao and locally roasted coffee beans, the Pais Tropical, a delightful tropical hazy juicy IPA, and our acclaimed Hefeweizen, a recipient of the 2017 Best Florida Beer Gold Medal. Located in stunning St. Pete Beach, Mastry’s Brewing Co. provides a serene and open setting, promising an authentic taste of the easy-going Florida lifestyle in every glass. Quench your thirst with one of our most popular brews ! Try the tastiest tacos in all of  St Pete Beach! Plan a casual meetup with your friends! CALL (727) 202-8045 EMAIL contact@mastrysbrewingco.com FIND US 7701 Blind Pass Road St. Pete Beach, FL 33706 © Copyright 2012 - | Mastry's Brewing Co.  ™ | All Rights Reserved  | Privacy Policy | Terms & Conditions Facebook Instagram YouTube Tiktok Page load link Go to Top"
    },
    {
      "url": "https://ws-mastry.webflow.io/contact-us",
      "text": "Contact Us - Mastry Home Apply to Teach About Us Blog FAQ Login Register My Account Logout 0 Your Cart $Â 0.00Â USD : Remove Subtotal Pay with browser. Continue to Checkout No items found. Product is not available in this quantity. APPLY To TEACH Contact Us If you have any questions about Academy, please fill the form below. We will get back to you within 24 hours. Full Name Email Address Phone Number Subject Message Thank you! Your message has been received! Oops! Something went wrong while submitting the form. Need more information? If you want to reach out directly, feel free to get in touch using the contact information below. Phone San Francisco (415) 701 - 2323 New York (415) 701 - 2323 Email San Francisco sanfrancisco@mastry.io New York newyork@mastry.io Social Media î  Mastry î  @mastry î  @mastry î  Mastry Frequently Asked Questions What are the course payment methods? î  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Est fringilla morbi mauris gravida. Eu vel arcu neque vitae vitae justo. Sit integer faucibus in dictumst amet hac. Enim amet, elementum faucibus id ultrices facilisis. Integer sed aenean consectetur. When was Academy founded? î  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Est fringilla morbi mauris gravida. Eu vel arcu neque vitae vitae justo. Sit integer faucibus in dictumst amet hac. Enim amet, elementum faucibus id ultrices facilisis. Integer sed aenean consectetur. Can I buy a course in installments? î  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Est fringilla morbi mauris gravida. Eu vel arcu neque vitae vitae justo. Sit integer faucibus in dictumst amet hac. Enim amet, elementum faucibus id ultrices facilisis. Integer sed aenean consectetur. Are there discounts for students? î  Lorem ipsum dolor sit amet, consectetur adipiscing elit. Est fringilla morbi mauris gravida. Eu vel arcu neque vitae vitae justo. Sit integer faucibus in dictumst amet hac. Enim amet, elementum faucibus id ultrices facilisis. Integer sed aenean consectetur. Grow your career! Start learning with Academy. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Odio quisque integer elementum egestas aliquet tincidunt. Our Courses Web Spiders Inc. 111 North Market Street, Suite 300 San Jose, CA 95113, USA +1 408 673 4682 Request callback Apply to Teach Home About Us Teachers Courses FAQ Blog Events Teachers Contact Courses Join our newsletter Lorem ipsum dolor sit amet, consectetur adi. Thank you! You are now subscribed! Oops! Something went wrong. Copyright Â© 2021 | Mastry ( Web Spiders Inc. ) Terms of Service Privacy Policy Refund Policy Disclaimer î  î  î  î "
    }
  ]
}