{
  "fuentes": [
    {
      "url": "https://www.hiddenlibations.com/mathers-social-gathering-floridas-largest-speakeasy/",
      "email": "info@hiddenlibations.com"
    },
    {
      "url": "https://www.mathersorlando.com/",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://www.mathersorlando.com/",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "katie.thomason@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "nathanael.edmund@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "abigail.wagner@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "bob.omalley@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "brooke.hill@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "casey.evans@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "cassie.gunsolus@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "coye.mccabe@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "danielle.permenter@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "derek.ephrem@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "destin.wells@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "donna.ketchum@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "greg.mason@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "ivan.gonzalez@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "jack.bojinov@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "jeanne.ford@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "jennifer.marcial@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "jenny.cruz@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "jessica.wilson@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "joe.horan@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "jordan.dewitt@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "justin.braun@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "katie.thomason@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "laureen.martinez@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "lisa.addy@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "lisa.winkelbauer@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "liz.chiarello@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "madeline.shields@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "natasha.hosein@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "neil.hamilton@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "pedro.demelorodrigues@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "roseanne.carter@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "sara.reynolds@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "scott.fagan@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "tammy.humphrey@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "tim.giuliani@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "tracy.garcia@orlando.org"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "email": "trent.goodin@orlando.org"
    },
    {
      "url": "https://www.nucleus.org.uk/contact",
      "email": "advice@nucleus.org.uk"
    },
    {
      "url": "https://www.nucleus.org.uk/contact",
      "email": "info@nucleus.org.uk"
    },
    {
      "url": "https://www.partyslate.com/venues/mathers-social-gathering",
      "email": "contact@partyslate.com"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "email": "contact@brottar.com"
    },
    {
      "url": "https://www.mathersorlando.com/dress-code",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://www.mathersorlando.com/dress-code",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://teamorlando.org/",
      "email": "karen@mycapitalcommunications.com"
    },
    {
      "url": "https://teamorlando.org/",
      "email": "media@teamorlando.org"
    },
    {
      "url": "https://www.mathersorlando.com/events",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://www.mathersorlando.com/events",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://www.mathersorlando.com/private-events",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://www.mathersorlando.com/private-events",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://members.doporlando.com/memberdirectory/Details/mathers-social-gathering-2524858",
      "email": "info@doporlando.com"
    },
    {
      "url": "https://thevendry.com/venue/122496/mathers-social-gathering-orlando-fl",
      "email": "info@mathersorlando.com"
    },
    {
      "url": "https://thevendry.com/venue/122496/mathers-social-gathering-orlando-fl",
      "email": "kyla@mathersorlando.com"
    }
  ],
  "mails": [
    "abigail.wagner@orlando.org",
    "advice@nucleus.org.uk",
    "bob.omalley@orlando.org",
    "brooke.hill@orlando.org",
    "casey.evans@orlando.org",
    "cassie.gunsolus@orlando.org",
    "contact@brottar.com",
    "contact@partyslate.com",
    "coye.mccabe@orlando.org",
    "danielle.permenter@orlando.org",
    "derek.ephrem@orlando.org",
    "destin.wells@orlando.org",
    "donna.ketchum@orlando.org",
    "greg.mason@orlando.org",
    "info@doporlando.com",
    "info@hiddenlibations.com",
    "info@mathersorlando.com",
    "info@nucleus.org.uk",
    "ivan.gonzalez@orlando.org",
    "jack.bojinov@orlando.org",
    "jeanne.ford@orlando.org",
    "jennifer.marcial@orlando.org",
    "jenny.cruz@orlando.org",
    "jessica.wilson@orlando.org",
    "joe.horan@orlando.org",
    "jordan.dewitt@orlando.org",
    "justin.braun@orlando.org",
    "karen@mycapitalcommunications.com",
    "katie.thomason@orlando.org",
    "kyla@mathersorlando.com",
    "laureen.martinez@orlando.org",
    "lisa.addy@orlando.org",
    "lisa.winkelbauer@orlando.org",
    "liz.chiarello@orlando.org",
    "madeline.shields@orlando.org",
    "media@teamorlando.org",
    "natasha.hosein@orlando.org",
    "nathanael.edmund@orlando.org",
    "neil.hamilton@orlando.org",
    "pedro.demelorodrigues@orlando.org",
    "roseanne.carter@orlando.org",
    "sara.reynolds@orlando.org",
    "scott.fagan@orlando.org",
    "tammy.humphrey@orlando.org",
    "tim.giuliani@orlando.org",
    "tracy.garcia@orlando.org",
    "trent.goodin@orlando.org"
  ],
  "nombre_sitio": "mathersorlando.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hiddenlibations.com/mathers-social-gathering-floridas-largest-speakeasy/",
      "text": "Mathers Social Gathering Florida's Largest Speakeasy | Rating 4.5 of 5 Search for: Home Secret Bars Contact Search for: Mathers Social Gathering Florida’s Largest Speakeasy by Hidden Libations | Nov 11, 2020 | Orlando Welcome to Mathers Social Gathering, Florida’s largest speakeasy. Even though this place is a very well-known secret, the size does not take away from its grandeur or exclusivity. With an elegant dress code and a double entrance, there’s still an elaborate experience to get in to this secret bar. Look for the Phoenix Building, locate the dapper doorman, whisper the password and see if he’ll let you through. To actually enter Mathers, after approval at the door, you have to ride the elevator up to a secret library where you need to figure out which bookcase opens to let you into the bar. This was really fun considering a lot of the speakeasies we’ve visited do not allow you to open the door yourself, it was a true exploration adventure. As the typical early birds, we were almost the only ones at the bar and were able to take pictures without masks before entering the seating area (Strict COVID rules for safety- unless a drink was to our mouth, masks were on). Behind the hidden bookcase entrance, the bar is spacious and gloriously renovated with a vintage gentlemen’s club vibe – original wood floors, brick walls, and tufted leather couches. The building is over 130 years old and Mathers Social Gathering honors the history of the building by only updating what is necessary for modern comfort and restoring antique collectibles from the building’s past. A few grammable additions (such as a swinging velvet loveseat) show that they are staying trendy even within their vintage atmosphere. Mathers’ mission is to provide a sophisticated yet comfortable space for people to gather together, and they do a great job of it. The drink menu is organized by liquor type and specially curated by the owners to promote spirit authenticity, as true speakeasies did in the past. Devin, one of the curators, was excited to share his favorite creation with us: the “Envy”. The honey and ginger blended bourbon cocktail is served smoked with green apple and thyme. It is the level of sophistication sought for at such establishments, raising the bar for libations everywhere. We also enjoyed a “Bathtub Gin,” served in a tiny bathtub, the gin emphasized with honey and lavender. And to top it all off we also ordered their refreshing and popular “Strawberry Fields” and the “Blueberry Basil Gimlet.” It was quite the tipsy party by the time we left! ​ A few extra details I’d be remiss not to mention: they have an amazing happy hour. Tuesday through Saturday from 4pm – 7pm craft cocktails are half price, unusual for the hidden bars we seek! The next time we visit will be around Christmas because Devin seriously talked up their elaborate holiday décor, custom drinks, and themed entertainment. Live musicians play each weekend and Tuesdays feature burlesque. Lastly, Mathers will soon be expanding and opening locations in Tampa and Jacksonville. Mathers Social Gathering is a wonderful bar with all the right gimmicks of a speakeasy. The only thing that set this bar back for us is its size. It’s wonderful that they are so successful, but I hope to see their franchises scale down to create a more intimate atmosphere rather than a party space. That being said though, this is the perfect hidden bar to give people an introduction to speakeasies and the culture that surrounds finding and enjoying these elusive drinking dens. Waiting for travel to open back up so we can get out of Florida. Stay safe everyone. Your home-bound PLIs (Visited July 2020) Submit a Comment Cancel reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Hidden Libations Rating Overall 4.5 of 5 Keys Secrecy 4 of 5 Keys Drinks 4.5 of 5 Keys Atmosphere 4 of 5 Keys Mathers Social Gathering Florida’s Largest Speakeasy Information About Mathers Social Gathering Florida’s Largest Speakeasy  Address 30 , South Magnolia Avenue , Orlando , Florida , 32801 , United States  Hours Mon: Closed Tue: Closed Wed: 7PM–12AM Thu: 7PM–12AM Fri: 7PM–2AM Sat: 7PM–2AM Sun: 12PM–12AM  Visit Speakeasy Website https://www.mathersorlando.com The Woo Woo NYC The Woo Woo, located between Hells Kitchen and the largest tourist trap in the world, is a faux 1980s sex shop and a pure blast from the past! Read More 6 Speakeasies in Ireland You Need To Visit The Emerald Isle, a land known for its pubs and famous black beer! While we do enjoy a well pulled pint of Guinness, you know our true hearts desire lies in the depths of a well-hidden speakeasy flowing with luscious libations and a sultry atmosphere. Read More 5 London Speakeasies You Need To Visit Late April 2022 we had the chance to stopover London for two nights and tried to hit a number of Speakeasies to add to the map. Our first visit to London in 2017 was just before we started the blog and hadn’t taken good notes or pictures. Unfortunately, London has shamefully been ill represented by Hidden Libations. Read More Discount Suit Company (DSC) Located in a shop that looks like an abandoned suit store from the 90s, this long-time speakeasy still had a lovely local feel without the tourist hoopla that typically comes with age and maintained a regular subterranean basement living room atmosphere. A rather grungy drinking spot, the cocktails are nothing fancy but delicious, and chatting with the staff was the best part. DSC makes you feel relaxed, at home, and ready to return. We certainly wish we had a local bar like this near our home to frequent for the lovely community vibe. Read More Happiness Forgets Very small hidden neighborhood bar. This speakeasy was interesting to find because it felt right in the middle of a residential district. No theme to this place, just a nonchalant local drinking hole that’s not easy to see unless you know where to look. The drinks were very unique and very tasty; even better was their great selection of mocktails. Read More Murder Inc. Cocktails This bar was so quirky and fun! Definitely a unique theme we enjoyed and would recommend people visiting. The only caveat is that it didn’t feel like a speakeasy, but more just off the beaten path. The bar is found on a bendy alley off the main road, but it’s clearly marked and has lights pointing you downstairs. The drinks were more typical but good and it was a fun place overall. Read More Home Secret Bars Privacy Policy Follow Us On Instagram © 2025 Hidden Libations | Designed and Managed by LP Creative Media"
    },
    {
      "url": "https://www.mathersorlando.com/",
      "text": "Mathers Social Gathering 0 Skip to Content Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Folder: Events Back Weekly Events Private Events Folder: About Us Back Our History Dress Code Bottle Service Gift Cards Folder: TMG Venues Back The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Sophisticated & Alluring PAIRING VINTAGE COCKTAILS AND SULTRY SPIRITS MODERN LIBATIONS Our mixologists use boutique spirits and seasonal fruit, with house-made cordials, bitters, and syrups to create classic cocktails and modern libations. Small plates are served upon your request to complement your favorite cocktails. EVOLUTIONARY Mathers Social Gathering lives in a prominent Downtown Orlando building aged over 140 years. Mathers in its current state has taken the stylish dark wood, vast pillars and exposed brick and turned it into a historical social hideaway. House Rules Our establishment holds high standards. To ensure the enjoyment of all patrons, we’ve established a dress code and house rules. House Rules Private Events Mathers has been the backdrop for weddings, photoshoots, work parties, and showers. Please see below for photoshoots/private event inquiries. Private Events Bottle Service We offer bottle service to enhance your time here with us. Click the button below to book our Family Table or Library Section for bottle service. Bottle Service Mathers Social Gathering 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801 Press | Careers | House Rules | Private Event Hours Kitchen Hours Tuesday-Saturday 4 PM - 11 PM Tuesday - Saturday 4 PM - 2 AM Sunday & Monday CLOSED Contact Info@mathersorlando.com (407) 745-1185"
    },
    {
      "url": "https://orlando.org/l/our-team/",
      "text": "Orlando Economic Partnership Staff | Meet the Team Skip to content Facebook Twitter Instagram LinkedIn YouTube Broad-based Prosperity™ Orlando, FL Menu OEP Logo Orlando Economic Partnership Advancing Broad-based Prosperity in the Orlando region. Toggle Search Menu Partnership About the Partnership Our Team Partnership Board Careers Internships Invest With Us Investor Company Directory Programs | Initiatives | Events Government Affairs Prioritizing Transportation Investing in Semiconductors Orlando Film Commission One-Stop Permitting Locations Production Directory Film Resources FAQs Orlando Prosperity Scorecard Neighborhood Opportunity Index Reports Available Resources Business Invest in Orlando Economic Development Services Orlando Regional Digital Twin Entrepreneur Resources International Resources Key Sectors Advanced Manufacturing Aerospace & Defense Headquarters & Regional Offices Digital Technology Life Sciences & Healthcare Logistics & Distribution Semiconductor Why Orlando Large, Growing Market Talent Operating Costs & Incentives Infrastructure Quality of Life How Orlando Compares Available Properties Research Regional Demographics Data Center Top 30 MSA Comparison Tool Relocations & Expansions Orlando MSA Market Snapshot Orlando MSA Market Update Orlando MSA Business Conditions Survey Programs Leadership Orlando Current Classes Class Chairs Alumni Black Boardroom Leadership Institute Public Leadership Institute PLI Graduates Elected PLI Alumni LEADForward Roundtables UpSkill Orlando An Orlando Cybersecurity Talent Deep Dive An Orlando Semiconductor Workforce Deep Dive Healthcare’s Hidden Workforce UpSkill Osceola Life Welcome in Orlando Living in Orlando Neighborhoods Cost of Living Healthcare Success Stories Working in Orlando Companies Job Fields Things to Do in Orlando Arts & Culture Sports & Recreation Shopping & Dining Theme Parks & Attractions Learning in Orlando K-12 Education Higher Education News Partnership Events Community Business Events Contact Get In Touch Partnership Contacts Search for: OEP Starburst Logo Partnership About the Partnership Our Team Partnership Board Careers Internships Invest With Us Investor Company Directory Programs | Initiatives | Events Government Affairs Prioritizing Transportation Investing in Semiconductors Orlando Film Commission One-Stop Permitting Locations Production Directory Film Resources FAQs Orlando Prosperity Scorecard Neighborhood Opportunity Index Reports Available Resources Business Invest in Orlando Economic Development Services Orlando Regional Digital Twin Entrepreneur Resources International Resources Key Sectors Advanced Manufacturing Aerospace & Defense Headquarters & Regional Offices Digital Technology Life Sciences & Healthcare Logistics & Distribution Semiconductor Why Orlando Large, Growing Market Talent Operating Costs & Incentives Infrastructure Quality of Life How Orlando Compares Available Properties Research Regional Demographics Data Center Top 30 MSA Comparison Tool Relocations & Expansions Orlando MSA Market Snapshot Orlando MSA Market Update Orlando MSA Business Conditions Survey Programs Leadership Orlando Current Classes Class Chairs Alumni Black Boardroom Leadership Institute Public Leadership Institute PLI Graduates Elected PLI Alumni LEADForward Roundtables UpSkill Orlando An Orlando Cybersecurity Talent Deep Dive An Orlando Semiconductor Workforce Deep Dive Healthcare’s Hidden Workforce UpSkill Osceola Life Welcome in Orlando Living in Orlando Neighborhoods Cost of Living Healthcare Success Stories Working in Orlando Companies Job Fields Things to Do in Orlando Arts & Culture Sports & Recreation Shopping & Dining Theme Parks & Attractions Learning in Orlando K-12 Education Higher Education News Partnership Events Community Business Events Contact Get In Touch Partnership Contacts orlando economic Partnership Our Team Executive Leadership Tim Giuliani President & CEO 407.902.2410 Phone Email Linkedin Scott Fagan Chief Financial Officer 407.835.2454 Phone Email Linkedin Danielle Permenter Chief Development Officer 407.835.2444 Phone Email Linkedin Laureen Martinez, APR Senior Vice President, Communications, Marketing & Branding 407.902.2421 Phone Email Linkedin Bob O’Malley Senior Vice President, Government Affairs 407.803.3969 Phone Email Linkedin Destin Wells Senior Vice President, Economic Development 407.902.2420 Phone Email Linkedin Accounting & Administration Scott Fagan Chief Financial Officer 407.835.2454 Phone Email Linkedin Jenny Cruz Senior Director, Employee Engagement, Performance Management & Culture Building 407.902.2426 Phone Email Linkedin Roseanne Carter Director, Board Relations 407.902.2410 Phone Email Liz Chiarello Executive Assistant to CFO 407.835.2494 Phone Email Linkedin Natasha Hosein Staff Accountant 407.902.2404 Phone Email Linkedin Donna Ketchum Office Navigator 407.902.0201 Phone Email Linkedin Economic Development Destin Wells Senior Vice President, Economic Development 407.902.2420 Phone Email Linkedin Neil Hamilton Vice President, Research & Strategy 407.902.2405 Phone Email Linkedin Casey Evans, MEDP Vice President, Economic Development 407.902.2411 Phone Email Linkedin Tracy Garcia, CEcD, MEDP Senior Director, Economic Development 407.902.0214 Phone Email Linkedin Jack Bojinov Director, Economic Development 407.669.3041 Phone Email Linkedin Derek Ephrem Director, Economic Development 407.902.2422 Phone Email Linkedin Jessica Wilson Director, Economic Development 407.902.2416 Phone Email Linkedin Sara Reynolds Associate Director, Research & Strategy 407.902.2424 Phone Email Linkedin Abigail Wagner Associate Director, Economic Development 407.902.2442 Phone Email Linkedin Cassie Gunsolus Coordinator, Economic Development 407.902.2417 Phone Email Linkedin Pedro de Melo Rodrigues Coordinator, Research & Strategy 407.902.2406 Phone Email Linkedin Orlando Film Commission Brooke Hill Associate Director, Orlando Film Commission 407.902.0206 Phone Email Linkedin Corporate Engagement Katie Thomason Senior Director, Corporate Engagement 407.902.0209 Phone Email Linkedin Greg Mason Director, Corporate Engagement 407.835.2509 Phone Email Linkedin Joe Horan Director, Corporate Engagement 407.835.2442 Phone Email Linkedin Coye McCabe Coordinator, Corporate Engagement 407.902.0212 Phone Email Linkedin Government Affairs Bob O’Malley Senior Vice President, Government Affairs 407.803.3969 Phone Email Linkedin Jordan DeWitt Director, Policy & Strategic Initiatives Semiconductor Cluster Manager 407.902.4226 Phone Email Linkedin Grace Thompson Associate Director 315.657.3040 Phone Email Linkedin Marketing, Branding & Communications Laureen Martinez, APR Senior Vice President, Communications, Marketing & Branding 407.902.2421 Phone Email Linkedin Trent Goodin Creative Director 407.902.0227 Phone Email Linkedin Justin Braun Director, Marketing & Branding 407.902.0211 Phone Email Linkedin Jennifer Marcial Ocasio Director of Communications 407.902.0221 Phone Email Linkedin Programs & Events Danielle Permenter Chief Development Officer 407.835.2444 Phone Email Linkedin Tammy Humphrey Senior Director, Talent Development 407.902.2407 Phone Email Linkedin Lisa Winkelbauer Executive Director, Leadership Orlando 407.835.2448 Phone Email Linkedin Nathanael Edmund Director, Programs 407.341.1266 Phone Email Linkedin Jeanne Ford Director, Events 407.902.0218 Phone Email Linkedin Iván Gonzalez Director, Talent Development 407.902.2443 Phone Email Linkedin Lisa Addy Production Manager 407.803.1569 Phone Email Linkedin Madeline Shields Coordinator 407.902.0219 Phone Email Linkedin Contacts Media Inquiries Jennifer Marcial Ocasio 407.902.0221 Phone Email Economic Development Destin Wells 407.902.2420 Phone Email Corporate Engagement Katie Thomason 407.902.0209 Phone Email Leadership Orlando Lisa Winkelbauer 407.835.2448 Phone Email Black Boardroom Leadership Institute (BBLI) Nathanael Edmund 407.341.1266 Phone Email Public Leadership Institute (PLI) Bob O’Malley 407.803.3969 Phone Email Orlando Film Commission Brooke Hill 407.446.0201 Phone Email Partnership About the Partnership Invest With Us Programs | Initiatives | Events Government Affairs Orlando Film Commission Orlando Prosperity Scorecard Available Resources Business Invest in Orlando Economic Development Services Key Sectors Why Orlando Available Properties Research Programs Leadership Orlando Black Boardroom Leadership Institute Public Leadership Institute LEADForward Roundtables UpSkill Orlando UpSkill Osceola Life Welcome in Orlando Living in Orlando Working in Orlando Things to Do in Orlando Learning in Orlando News Partnership Events Community Business Events Contact Get In Touch Partnership Contacts OEP Starburst Logo 407.422.7159 200 S. Orange Avenue, Suite 200 Orlando, FL 32801 Facebook Twitter Instagram LinkedIn YouTube © 2025  Orlando Economic Partnership. All rights reserved. Website by Zillas."
    },
    {
      "url": "https://www.nucleus.org.uk/contact",
      "text": "Get In Touch - Nucleus Legal Advice Centre Get Advice Benefits LegalÂ Advice Housing Legal Advice Debt Legal Advice Pro-Bono Solicitors Service About Us Overview 50th Anniversary Our History Management Committee Our Team Community Knowledge Centre See All Topics Welfare Benefits Debt & Money Housing Volunteer Support Get in Touch Call us Menu Need legal advice? We got you! Tell us about your problem. Get free expert legal advice for all things related to social welfare. Fill a simple enquiry form to reach out to us. We will get back to you with the right advice. Fill an Enquiry Form to get started Welfare Benefits Form Debt & Money Form Housing Form Campden Referral Or Get in touch via call at 020 7373 4005 Office hours Mon-Fri, 10AM-4PM You can also visit us At either one of our offices address below, we highly recommend you ring and book an appointment first if you can to see the most appropriate person. Â 298 Old Brompton Road London SW5 9JF Walk in advice timings Tuesday and Thursdays 10am â 12.30pm. Telephone: 020 7373 4005 advice@nucleus.org.uk Get Directions The Lido, 63 Mattock Lane London W13 9LA. You need a pre arranged appointment . Telephone: 020 8280 2222 info@nucleus.org.uk Get Directions You can also email us at advice@nucleus.org.uk Real People. Real Advice. Hereâs what people have to say about their experience with us. âMy experience was exemplary. Both Vicki and Franco were professionals and listened and advised accordingly. They were also empathetic and polite.I am so thankful and grateful!!â Christine Ivegbuna Client âGreat advisers! I am very thankful for the advice they gave me, especially grateful to Shamaila who was kind, helpful and dealt with my problems in a professional way.I highly recommend nucleus to everyone.â Hanan Chakour Client âI am very happy with the advice that I have been given and the quick response to help me with my rent arrears even though it has not been solved yet,I am glad that they are helping me step-by-step with my problems and understanding me.â Amina Client âThe team are very nice, kind, helpful, approachable and professional. Special thanks to Shola for her outstanding work. I highly recommend them.â Benjamin Martinez Client âFor many years, I had always received the help I needed when I had ask for legal advice from Nucleus. I had been treated with respect, kindness, professionalism and the legal team has always help me with legal matters, as much as it has been possible to them.â Pedro Rojas Client âI been today oh my good shola she the best she help me a lot god bless her.Thank you for shola.She help me a lot God bless her.â Ali Poormodheji Client âKalpamayee Das Parija was very clear and precise with what i had to do exactly and was understanding when it came to asking questions overall very good experience.â Lilo Client âI was so happy today with the service.Thank you so much Franco.He try his best to find a solution for my debt problems and I really appreciate it. Well done.â Majdi Alkadamani Client âI was referred by my local citizens advisor. Service given by Nucleus has been very easy and straight forward, they got in touch shortly after took all details I have and already working with me to resolve my issue. I am really at ease now thanks to Franco and Shola for their collab work!â Gelila Client Learn about our Community Learn More About Nucleus We are supported by Sponsor Us > Together, we can make justice accessible for the weaker sections of our community. Your help matters. Donate To Our Cause > Golden Years of Transforming Lives with Legal Advice. Learn More Fill an Enquiry Form to get started Welfare Benefits Form Debt & Money Form Housing Form Campden Referral Call Us at 020 7373 4005 Welfare Benefits Advice Housing Advice Debt and Money Advice Pro-Bono Solicitors Service About Us Knowledge Centre Volunteers Support Community Visit Us or Write to Us 298 Old Brompton Road, â London SW5 9JF Privacy Policy Terms & Conditions Complaints Procedure Â© Nucleus Rights Reserved. This website uses cookies By using this website, you agree to the storing of cookies on your device to enhance site navigation, analyze site usage, and to give you the best experience on our website. View our Privacy Policy for more details. Click on the button below to accept and close this dialogue box. Okay. Got it!"
    },
    {
      "url": "https://www.partyslate.com/venues/mathers-social-gathering",
      "text": "Mathers Social Gathering | Orlando Venue | PartySlate Skip to content Venues Planners Vendors Ideas Venues Planners Vendors Ideas Mathers Social Gathering Find Venues / Florida / Orlando / Mathers Social Gathering Mathers Social Gathering 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801, United States Max Seated 80 Max Standing 500 Request info Favorite Overview Gallery 0 About Mathers Social Gathering Mathers' prohibition-inspired hideout is the perfect setting for a smart intimate celebration. Within the boundaries of exposed brick walls, an intriguing library of hand-crafted libations, and tufted leather and velvet upholstery, celebrate the most important of occasions. Evenings are designed to meet your highest expectations, with themed entertainment and a delectable, tailored meal. With a classy yet appealing celebration, become a part of history in this 1800s establishment. Choose Mathers to make a lasting impression at your next social, corporate, or wedding-related event.\n\nClassic and modern cocktails are created by our stylish bartenders using boutique spirits and seasonal fruit, as well as house-made cordials, bitters, and syrups. Small snacks are served to accompany your favorite beverages upon request.\n\nOriginally a late-nineteenth-century furniture business. The sophisticated, dark wood, exposed brick-filled hideaway has been transformed into a communal meeting space by Mather's.\n\nAfter nearly 20 years of culinary experience in Downtown Orlando, Darren \"Dan\" Allinder now holds the keys to Mather's Social Gathering. Pastry and baking arts are his culinary emphasis and passion in fine dining places. Because of his expertise, Darren is uniquely qualified to serve some of the finest spirits and cocktails in the country. Event Spaces 1 80 max seated • 500 max standing 4 Indoor Space 80 Seated 150 Standing Event Space Pricing Packages Mathers Social Gathering hasn't listed their pricing yet. Connect with them directly to get a customized pricing proposal for your event. Request a Quote Amenities A/V Equipment Coat Check Handicap Accessible Kosher Kitchen Media Room Pet Friendly Pool Street Parking Valet Parking WiFi Windows Dance Floor Breakout Rooms Map 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801, United States Follow Us Visit Website Call Get the latest trends Our team's top picks and more straight to your inbox. Subscribe Follow us Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Get Started Find a Venue Find a Pro Find Ideas Browse by Event Weddings Birthdays Baby Showers Corporate Events For Event Professionals Become a Member Digital Events Contact Pro Support The Company About Us Contact PartySlate Careers Privacy Policy Terms of Service Pro Terms of Service © PartySlate 2025"
    },
    {
      "url": "https://brottar.com/pages/contact",
      "text": "Contact BROTTAR: Get in Touch for Premium Service & Inquiries\n – BROTTAR® OFFICIAL Skip to content Great news! Shipping is now available to Canada & the UK! 🚚✨ Shop now! Home Contact Wholesale About Us FAQs Log in Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Home Contact Wholesale About Us FAQs Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Search Log in Cart Item added to your cart View cart Check out Continue shopping Contact We’d Love to Hear From You At BROTTAR, we value every question, comment, and piece of feedback from our customers. Whether you’re curious about our products, need assistance with your order, or simply want to share your thoughts, our dedicated team is here to help. Multiple Ways to Connect Email: For prompt support, drop us a message at Contact@brottar.com . Contact Form: Fill out our online form available on this page for quick inquiries and we’ll get back to you within 24 hours. Customer Support: Our dedicated support team is available during business hours to provide personalized assistance and ensure your satisfaction. Our Commitment to You We believe in building lasting relationships with our customers through transparency, responsiveness, and exceptional service. Every inquiry is important, and we strive to ensure that your experience with BROTTAR is seamless and satisfying. Visit Our Website Explore our online catalog and discover how our premium products can elevate your living space. We’re here to assist you every step of the way—from product selection to post-purchase support. Thank you for choosing BROTTAR. We look forward to connecting with you! Contact form Name Email * Phone number Comment Send Support About Us Shipping & Delivery Return & Refund Policy Terms & Conditions Privacy Policy Wholesale FAQs Blog At BROTTAR, every detail matters. Founded by visionary entrepreneurs with a passion for design and excellence, our brand was born out of the desire to merge artistic innovation with everyday functionality. Our journey began with a single idea: to redefine the way you display your most cherished items. Country/region Morocco |\n      USD\n      $ Search Australia USD\n                $ Austria USD\n                $ Belgium USD\n                $ Canada USD\n                $ Czechia USD\n                $ Denmark USD\n                $ Finland USD\n                $ France USD\n                $ Germany USD\n                $ Hong Kong SAR USD\n                $ Ireland USD\n                $ Israel USD\n                $ Italy USD\n                $ Japan USD\n                $ Malaysia USD\n                $ Morocco USD\n                $ Netherlands USD\n                $ New Zealand USD\n                $ Norway USD\n                $ Poland USD\n                $ Portugal USD\n                $ Singapore USD\n                $ South Korea USD\n                $ Spain USD\n                $ Sweden USD\n                $ Switzerland USD\n                $ United Arab Emirates USD\n                $ United Kingdom USD\n                $ United States USD\n                $ Payment methods PayPal Venmo © 2025, BROTTAR® OFFICIAL Powered by Shopify Privacy policy Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://www.mathersorlando.com/dress-code",
      "text": "Dress Code — Mathers Social Gathering 0 Skip to Content Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Folder: Events Back Weekly Events Private Events Folder: About Us Back Our History Dress Code Bottle Service Gift Cards Folder: TMG Venues Back The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Mathers Social Gathering 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801 Press | Careers | House Rules | Private Event Hours Kitchen Hours Tuesday-Saturday 4 PM - 11 PM Tuesday - Saturday 4 PM - 2 AM Sunday & Monday CLOSED Contact Info@mathersorlando.com (407) 745-1185"
    },
    {
      "url": "https://teamorlando.org/",
      "text": "Team Orlando News - Team Orlando News Skip to content Search for: Toggle Navigation Government Military Industry People of Interest People of Interest — Application Events About Team Orlando News Team Orlando Contact Subscribe to Newsletter × Subscribe to our Newsletter By adding your email address, you are subscribing to the Team Orlando News newsletter.  Team Orlando News does not share subscriber data under any circumstance.  You can unsubscribe at anytime. Email Address * CAPTCHA Download our ad rates Team Orlando News Tony Kim 2025-07-15T10:27:49-04:00 UCF Salutes: connections between Knight Nation and the military Education , Military Published On: September 5, 2025 6.5 min read PEO STRI welcomes new senior enlisted advisor, bids farewell to outgoing leader following 28 years of service General News , Military Published On: September 5, 2025 4.5 min read NSF Florida Semiconductor Engine hosts Inaugural Powering Prosperity 2025 Conference General News , Government Published On: September 3, 2025 2.8 min read AUSA Sunshine Chapter hosts Col. Jason L. West to discuss Army transformation and training Military , Training Published On: September 2, 2025 3.1 min read PEO STRI and partners conduct next generation constructive experimentation using cloud technology during Scarlet Dragon 25-3 Military , Training Published On: August 27, 2025 3.1 min read Col. Wynndee Young assumes command of PM TRASYS at Change-of-Command Ceremony Military Published On: August 20, 2025 2.4 min read Karwowski talks future of systems engineering at INCOSE event Education , General News , Industry Published On: August 19, 2025 2.2 min read National Center for Simulation to host 2025 B2B event spotlighting drone innovation General News Published On: August 13, 2025 1.4 min read Webinar highlights university innovation in XR and digital engineering Education , XR Published On: August 13, 2025 2.6 min read UCF IST’s TRACE Lab graduate research assistant to attempt to row across the Atlantic Education Published On: August 13, 2025 2.4 min read PEO STRI deactivates Product Manager Medical Simulation Office General News , Military Published On: August 12, 2025 3 min read UCF launches Institute of Artificial Intelligence to advance research, talent development across disciplines Artificial Intelligence , Education , General News Published On: August 1, 2025 10.1 min read PEO STRI hosts TableTop Exchange to advance Army training innovation General News , Military , Simulation Published On: July 31, 2025 2.9 min read Cruz-Neira named to Forbes ’50 Over 50′ List, honored for pioneering virtual reality General News , People Published On: July 31, 2025 1.3 min read Army and Navy forge alliance to revolutionize maritime training and project $10 million in savings Military , Military , Training Published On: July 25, 2025 3.6 min read CYBER Students Fight Simulated Cybersecurity Attacks in Capture the Flag Cyber Competition Published On: September 24, 2024 0.7 min read Categories: Cyber , STEM , Training MEDICAL Meet the MeGa Jam Participants Published On: September 11, 2024 6.1 min read Categories: Medical , Simulation EDUCATION UCF Salutes: connections between Knight Nation and the military Published On: September 5, 2025 6.5 min read Categories: Education , Military AUGMENTED REALITY Senior Team Orlando tech leaders explore how XR and AI are transforming MS&T Published On: May 9, 2025 2.9 min read Categories: Augmented Reality , Military , Training , Virtual Reality Let’s Work Together! Connect with our unique audience of key government decision-makers: Share MS&T news Submit event listings Promote your products and services Subscribe to our newsletter Follow us on social media Contact Us SPOTLIGHT ARTICLE AFCEA Space Coast hosts NASA Kennedy Director Janet Petro at event Read article The People in MS&T: Today and Yesterday Cruz-Neira named to Forbes ’50 Over 50′ List, honored for pioneering virtual reality Read article The National Center for Simulation (NCS) honors two pioneering leaders in 2025 Modeling & Simulation Hall of Fame induction Read article NAWCTSD and NSA Orlando welcome new leadership, as CAPT James retires and CAPT Rob Betts becomes commanding officer Read article Meet Caitlin McInnes: NAWCTSD’s New Director of International Programs Read article MS&T People of Interest Johnny Fortune President and Senior Consultant AECO Digital Technologies Meet Johnny Fortune Candace Croughwell Capture and Proposal Manager Engineering & Computer Simulations (ECS) Meet Candace Croughwell Andrea Rodriguez International Programs and Compliance Manager Engineering & Computer Simulations (ECS) Meet Andrea Rodriguez Drina Black Military Business Development Director Rocket Technology Meet Drina Black Lesley Foraker Human Resources Manager Engineering & Computer Simulations Meet Lesley Foraker Stacey Hinnant Vice President of Business Development Hatalom Corporation Meet Stacey Hinnant View All Orlando welcomes 11 new Smart Cities Startups in fall 2025 Plug and Play accelerator Read Story 4C Group accelerates growth in the U.S. defense market Read Story R-CON panel analyzes the impact of the space supersector on digital twin innovation Read Story Hatalom signs one of Orlando’s largest office leases this year Read Story TSIS 2025 opens with welcome addresses from NTSA and NDIA-CFL leaders Read Story SPOTLIGHT ARTICLE AFCEA Space Coast hosts NASA Kennedy Director Janet Petro at event Read article Amentum Leverages Smart Logistics to Ensure Operational Readiness Industry , Military Published On: October 1, 2023 7.7 min read UCF Salutes: connections between Knight Nation and the military Education , Military Published On: September 5, 2025 6.5 min read PEO STRI welcomes new senior enlisted advisor, bids farewell to outgoing leader following 28 years of service General News , Military Published On: September 5, 2025 4.5 min read NSF Florida Semiconductor Engine hosts Inaugural Powering Prosperity 2025 Conference General News , Government Published On: September 3, 2025 2.8 min read AUSA Sunshine Chapter hosts Col. Jason L. West to discuss Army transformation and training Military , Training Published On: September 2, 2025 3.1 min read PEO STRI and partners conduct next generation constructive experimentation using cloud technology during Scarlet Dragon 25-3 Military , Training Published On: August 27, 2025 3.1 min read Col. Wynndee Young assumes command of PM TRASYS at Change-of-Command Ceremony Military Published On: August 20, 2025 2.4 min read National Center for Simulation to host 2025 B2B event spotlighting drone innovation General News Published On: August 13, 2025 1.4 min read Webinar highlights university innovation in XR and digital engineering Education , XR Published On: August 13, 2025 2.6 min read UCF IST’s TRACE Lab graduate research assistant to attempt to row across the Atlantic Education Published On: August 13, 2025 2.4 min read PEO STRI deactivates Product Manager Medical Simulation Office General News , Military Published On: August 12, 2025 3 min read The People in MS&T: Today and Yesterday Cruz-Neira named to Forbes ’50 Over 50′ List, honored for pioneering virtual reality Read article The National Center for Simulation (NCS) honors two pioneering leaders in 2025 Modeling & Simulation Hall of Fame induction Read article NAWCTSD and NSA Orlando welcome new leadership, as CAPT James retires and CAPT Rob Betts becomes commanding officer Read article Meet Caitlin McInnes: NAWCTSD’s New Director of International Programs Read article MS&T People of Interest Johnny Fortune President and Senior Consultant AECO Digital Technologies Meet Johnny Fortune Candace Croughwell Capture and Proposal Manager Engineering & Computer Simulations (ECS) Meet Candace Croughwell Andrea Rodriguez International Programs and Compliance Manager Engineering & Computer Simulations (ECS) Meet Andrea Rodriguez Drina Black Military Business Development Director Rocket Technology Meet Drina Black View All Amentum Leverages Smart Logistics to Ensure Operational Readiness Read Story Orlando welcomes 11 new Smart Cities Startups in fall 2025 Plug and Play accelerator Read Story 4C Group accelerates growth in the U.S. defense market Read Story PEO STRI welcomes new senior enlisted advisor, bids farewell to outgoing leader following 28 years of service Read Story NSF Florida Semiconductor Engine hosts Inaugural Powering Prosperity 2025 Conference Read Story AUSA Sunshine Chapter hosts Col. Jason L. West to discuss Army transformation and training Read Story CYBER Students Fight Simulated Cybersecurity Attacks in Capture the Flag Cyber Competition Published On: September 24, 2024 0.7 min read Categories: Cyber , STEM , Training MEDICAL Meet the MeGa Jam Participants Published On: September 11, 2024 6.1 min read Categories: Medical , Simulation EDUCATION UCF Salutes: connections between Knight Nation and the military Published On: September 5, 2025 6.5 min read Categories: Education , Military AUGMENTED REALITY Senior Team Orlando tech leaders explore how XR and AI are transforming MS&T Published On: May 9, 2025 2.9 min read Categories: Augmented Reality , Military , Training , Virtual Reality Let’s Work Together! Connect with our unique audience of key government decision-makers: Share MS&T news Submit event listings Promote your products and services Subscribe to our newsletter Follow us on social media Contact Us Team Orlando News is the online, independent news source for the Central Florida MS&T community! Never miss an important story about the people, ideas, and innovation that make Orlando the world headquarters for MS&T. Subscribe for the latest Team Orlando News Updates: Email Address * CAPTCHA NAWCTSD PEO STRI PM TRASYS AFAMS STTC ACC ADL CF Tech Grove MST PMO STE CFT DHS S&T VHA SimLEARN NCS UCF The Partnership Florida High Tech Corridor DIU NTSA DoD STARBASE CFL Team Orlando News is an independent news organization. Our content does not imply endorsement by DoD, federal, or non-federal entities. © Copyright 2010 - 2025 |  teamorlando.org  ALL RIGHTS RESERVED | Website by Capital Communications and Consulting Page load link Event Listing Form Team Orlando News offers two options of event listings: A complimentary event listing includes the name and date of your event, as well as a link to your event’s website. Event listings must be approved by Team Orlando News staff and are then posted on the Event page; these listings appear in date order. A signature event listing is featured on the Events page and includes all of the above, plus a description (up to 400 characters), entry fee, where the event is located and one featured image/photo. The cost per signature listing is $150. \" * \" indicates required fields Would you like your event to be Featured? * Would you like your event to be Featured? Yes - $150 No Event Title * What is the Title of your Event? How Long is your event? * One Day Multiple Days Start Date * MM slash DD slash YYYY End Date * MM slash DD slash YYYY Name of Your Organization Location * Street Address City Alabama Alaska American Samoa Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Guam Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Northern Mariana Islands Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas Utah U.S. Virgin Islands Vermont Virginia Washington West Virginia Wisconsin Wyoming Armed Forces Americas Armed Forces Europe Armed Forces Pacific State ZIP Code Event Start Time What is the Start time of your event? Event End Time What is the end time of your event? POC Name What is the name of your POC? POC Name What is the email address of your POC? Price of Event What is the fee to attend your event? External Link Enter event URL/Registration Link. Link must be a secure URL beginning  with https:// Form submitted by: Event Description Please Provide some information about your Event. Event Image Upload an Image to use for your Featured Event, 800px x 800px or larger. Max. file size: 256 MB. Total: Go to Top"
    },
    {
      "url": "https://www.mathersorlando.com/events",
      "text": "Weekly Events — Mathers Social Gathering 0 Skip to Content Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Folder: Events Back Weekly Events Private Events Folder: About Us Back Our History Dress Code Bottle Service Gift Cards Folder: TMG Venues Back The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Weekly Events Tuesday Happy Hour Enjoy half-off our vintage cocktails 4 PM - 7 PM Burlesque All seating is first come, first served | 21+ Performances through the night Wednesday Happy Hour Enjoy half-off our vintage cocktails 4 PM - 7 PM Whiskey Wednesday Half-off Old Fashioneds 7 PM - 9 PM Thursday Happy Hour Enjoy half-off our vintage cocktails 4 PM - 7 PM Live Music Join us for live music from various artists and genres 9 PM - 12 AM Magic Shows 9 PM - 12 AM Friday Happy Hour Enjoy half-off our vintage cocktails 4 PM - 7 PM Live Music Join us for live music from various artists and genres 9 PM - 12 AM Saturday Happy Hour Enjoy half-off our vintage cocktails 4 PM - 7 PM Burlesque All seating is first come, first served | 21+ Performances through the night May 12 to May 13 Mathers 5 Year Anniversary Thu, May 12, 2022 7:00 PM Fri, May 13, 2022 2:00 AM Google Calendar ICS You are invited to celebrate Mather’s Social Gathering 5th year anniversary, come out for a night at the orchestra! The doors open at 4:00 pm but entertainment begins at 7:00 pm. Fancy dress is required, please dress to impress. All seating will be reservation only, standing room will be limited to first come, first served. View Event → Mathers Social Gathering 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801 Press | Careers | House Rules | Private Event Hours Kitchen Hours Tuesday-Saturday 4 PM - 11 PM Tuesday - Saturday 4 PM - 2 AM Sunday & Monday CLOSED Contact Info@mathersorlando.com (407) 745-1185"
    },
    {
      "url": "https://www.mathersorlando.com/private-events",
      "text": "Private Events — Mathers Social Gathering 0 Skip to Content Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Events Weekly Events Private Events About Us Our History Dress Code Bottle Service Gift Cards TMG Venues The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Open Menu Close Menu Menu Folder: Events Back Weekly Events Private Events Folder: About Us Back Our History Dress Code Bottle Service Gift Cards Folder: TMG Venues Back The Phoenix Jazz Club Nuri’s Tavern Alfie's HiFi Plantees Primrose Lanes Taco Kat The Acre The Robinson Disco Room The Wellborn Private Events Thank you for your interest in hosting your own event at mathers social gathering Set the scene for a dapper private event at Mathers prohibition-inspired hideaway. Celebrate the most significant of occasions within the confines of exposed brick walls, an enticing library of hand-crafted libations, and tufted leather and velvet furnishing. Evenings are fit to fulfill your greatest aspirations with themed performances and an exquisite, curated menu. Become a part of history in this 1800s establishment with a sophisticated, yet alluring celebration. Choose to distinguish your social, corporate, or wedding-related event with the most remarkable experience at Mathers. Venue Layout | Style Bar & Lounge Speakeasy VIP / Semi-Private Space Reception Style Venue Capacity 150 Guests Semi Private Space for groups up to 80 Seated Style Venue Capacity 80 Guests Food & Beverage Small bites and bar service provided by Mathers Social Gathering Outside catering permitted (preferred vendors only) Entertainment Ask About In-House Entertainment Plenty of themed entertainment DJ’s & Live Music Available Location & Parking Located in the heart of Downtown Orlando Paid Parking Street Parking Easy bus dropoff Book your Event Mathers Social Gathering 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801 Press | Careers | House Rules | Private Event Hours Kitchen Hours Tuesday-Saturday 4 PM - 11 PM Tuesday - Saturday 4 PM - 2 AM Sunday & Monday CLOSED Contact Info@mathersorlando.com (407) 745-1185"
    },
    {
      "url": "https://members.doporlando.com/memberdirectory/Details/mathers-social-gathering-2524858",
      "text": "Mathers Social Gathering  - Downtown Orlando Partnership Inc Skip to content Menu Home About The Epicenter of an Unstoppable Opportunity Economy Board of Directors Board Application Team DOP Careers Internships Volunteer Opportunities DOP Foundation 2025 Sponsorship Opportunities Members Our Investors Key Stakeholders Membership Benefits Members by Level Job Board Directory Join Now Events Events Calendar Sponsor an Event First Friday Third Thursday ConnectDTO Downtown Business Forum Black History Month: Meet The Artists Reception Golden Brick Awards Chow on Church Downtown Employee Appreciation Week State of Downtown Golf Scramble News Downtown Drip Downtown Voices DOP in the News Member Spotlights Subscribe Contact Member Login Join Menu Home About The Epicenter of an Unstoppable Opportunity Economy Board of Directors Board Application Team DOP Careers Internships Volunteer Opportunities DOP Foundation 2025 Sponsorship Opportunities Members Our Investors Key Stakeholders Membership Benefits Members by Level Job Board Directory Join Now Events Events Calendar Sponsor an Event First Friday Third Thursday ConnectDTO Downtown Business Forum Black History Month: Meet The Artists Reception Golden Brick Awards Chow on Church Downtown Employee Appreciation Week State of Downtown Golf Scramble News Downtown Drip Downtown Voices DOP in the News Member Spotlights Subscribe Contact Mathers Social Gathering Back to Search Mathers Social Gathering Categories Restaurants, Food, & Beverage Connect 30 S Magnolia Ave, 3 Phoenix Building , Orlando , FL , 32801 (407) 745-1185 mathersorlando.com Membership Type Connect Share × Print Email Facebook LinkedIn X Pinterest Close Powered By GrowthZone © 2025 Downtown Orlando Partnership Inc | Site by GrowthZone Say Hello 407-228-3891 PO Box 2026, Orlando, FL 32802 333 S Garland Ave, 13th Floor, Orlando, FL 32801 info@doporlando.com Additional Resources Member Directory Login Privacy Policy Stay Connected! LinkedIn Instagram Facebook youtube twitter © 2025 Downtown Orlando Partnership Inc. All Rights Reserved | Site by GrowthZone Scroll To Top"
    },
    {
      "url": "https://thevendry.com/venue/122496/mathers-social-gathering-orlando-fl",
      "text": "Mathers Social Gathering - Bar / Club in Orlando, FL | The Vendry by by Search Inspiration Circles Log In Sign Up Overview Spaces Press Nearby Hotels Mathers Social Gathering Bar / Club 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801, USA Central Business District Mathers Social Gathering 3 Phoenix Building, 30 S Magnolia Ave, Orlando, FL 32801, USA Central Business District Request Pricing # of Spaces 2 Space s Capacity Max Seated: 80 Max Standing: 150 Set the scene for a dapper private event at Mathers prohibition-inspired hideaway. Celebrate the most significant of occasions within the confines of exposed brick walls, an enticing library of hand-crafted libations, and tufted leather and velvet furnishing. Evenings are fit to fulfill your greatest aspirations with themed performances and an exquisite, curated menu. Become a part of history in this 1800s establishment with a sophisticated, yet alluring celebration. Choose to distinguish your social, corporate, or wedding-related event with the most remarkable experience at Mathers. Show more Request Pricing 30 South Magnolia Avenue, Orlando, FL Show on the map Spaces Semi-Private Dining Max Seated: 80 Full Buyout Max Standing: 150 Semi-Private Dining Max Seated: 80 Full Buyout Max Standing: 150 Press The Infatuation The 21 Best Restaurants In Orlando 2023 - Orlando Nov 23, 2022 Narcity This Library In Orlando Is Really A Hidden Bar & It's Actually Hard To Find Jun 14, 2022 Time Out 11 Best Bars In Orlando For Painting The Town Red Jul 19, 2021 Condé Nast Traveler 15 Best Bars in Orlando, Florida May 1, 2019 The Infatuation The 21 Best Restaurants In Orlando 2023 - Orlando Nov 23, 2022 Narcity This Library In Orlando Is Really A Hidden Bar & It's Actually Hard To Find Jun 14, 2022 Time Out 11 Best Bars In Orlando For Painting The Town Red Jul 19, 2021 Condé Nast Traveler 15 Best Bars in Orlando, Florida May 1, 2019 Do you work for Mathers Social Gathering ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Orlando for Your Event Orlando Convention Centers Orlando Restaurants Orlando Event Spaces Orlando Aquariums / Zoos Orlando Vineyards Orlando Hotels Orlando Breweries / Distilleries Orlando Bars / Clubs Orlando Performance Spaces Orlando Golf Courses Orlando Museums / Galleries Orlando Public Spaces Orlando Stadiums Orlando Private Group Activites Orlando Private Clubs Orlando Convention Centers Orlando Restaurants Orlando Event Spaces Orlando Aquariums / Zoos Orlando Vineyards Orlando Hotels Orlando Breweries / Distilleries Orlando Bars / Clubs Orlando Performance Spaces Orlando Golf Courses Orlando Museums / Galleries Orlando Public Spaces Orlando Stadiums Orlando Private Group Activites Orlando Private Clubs by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use"
    }
  ]
}