{
  "fuentes": [
    {
      "url": "https://www.miamiandbeaches.com/l/parks-and-recreation/miami-beach-botanical-garden/2126",
      "email": "maurice@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/rent-the-garden/",
      "email": "events@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/rent-the-garden/",
      "email": "maurice@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/employment/",
      "email": "kathy@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/rent-the-garden-2/",
      "email": "maurice@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/event/spring-artisan-market-at-the-garden/",
      "email": "corey@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/event/spring-artisan-market-at-the-garden/",
      "email": "maurice@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/photography-policy/",
      "email": "events@mbgarden.org"
    },
    {
      "url": "https://www.miamiandbeaches.com/l/outdoor-experiences/miami-beach-botanical-garden/2126",
      "email": "maurice@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/programeventsassistantcoordinator/",
      "email": "growwithus@mbgarden.org"
    },
    {
      "url": "https://climatetoolkit.org/profile/miami-beach-botanical-garden/",
      "email": "climatetoolkit@phipps.conservatory.org"
    },
    {
      "url": "https://climatetoolkit.org/profile/miami-beach-botanical-garden/",
      "email": "tlbrown@mbgarden.org"
    },
    {
      "url": "https://plantly.io/botanical-gardens/beach-botanical-gardens/",
      "email": "grow@plantly.io"
    },
    {
      "url": "https://mbgarden.org/gardenerjobposting/",
      "email": "riki@mbgarden.org"
    },
    {
      "url": "https://mbgarden.org/gardenerjobposting/",
      "email": "susanaskew@mbgarden.org"
    },
    {
      "url": "https://www.givemiamiday.org/organization/miamibeachbotanicalgarden",
      "email": "growwithus@mbgarden.org"
    },
    {
      "url": "https://www.givemiamiday.org/organization/miamibeachbotanicalgarden",
      "email": "givemiamiday@miamifoundation.org"
    },
    {
      "url": "https://mbgarden.org/weddings/",
      "email": "events@mbgarden.org"
    }
  ],
  "mails": [
    "climatetoolkit@phipps.conservatory.org",
    "corey@mbgarden.org",
    "events@mbgarden.org",
    "givemiamiday@miamifoundation.org",
    "grow@plantly.io",
    "growwithus@mbgarden.org",
    "kathy@mbgarden.org",
    "maurice@mbgarden.org",
    "riki@mbgarden.org",
    "susanaskew@mbgarden.org",
    "tlbrown@mbgarden.org"
  ],
  "nombre_sitio": "mbgarden.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.miamiandbeaches.com/l/parks-and-recreation/miami-beach-botanical-garden/2126",
      "text": "Miami Beach Botanical Garden | Miami & Miami Beach Skip to Content The Official Website of Greater Miami & Miami Beach Visitors Meeting Planners GMCVB Partners Travel Professionals Press & Media GMCVB About GMCVB Advertising Opportunities BHI Business Relocation Film/TV Production Sports Commission Partner Extranet Login Language English 中文 Deutsch Español Français Italiano 日本語 Kreyòl Português EN English 中文 Deutsch Español Français Italiano 日本語 Kreyòl Português Explore Explore Explore Things to Do Things to Do See All Things to Do Arts & Culture Attractions Beaches Cruising from Miami Health & Fitness History Multicultural Nightlife Outdoor Experiences Shopping Spa & Wellness Sports Tours & Excursions Water Activities See All Things to Do Arts & Culture Attractions Beaches Cruising from Miami Health & Fitness History Multicultural Nightlife Outdoor Experiences Shopping Spa & Wellness Sports Tours & Excursions Water Activities Added to your favorites Experience Miami's Concerts & Live Music Events Added to your favorites Discover Halloween in Miami Cities & Neighborhoods Travel Interests Travel Interests See All Travel Interests Accessible Travel Family Friendly Indulgent Experiences LGBTQ Travel Multicultural Miami Outdoor Explorer Pet Friendly Travel Relaxing Getaway Sustaining Miami See All Travel Interests Multicultural Miami Accessible Travel Outdoor Explorer Family Friendly Pet Friendly Travel Indulgent Experiences Relaxing Getaway LGBTQ Travel Sustaining Miami Plan Your Trip Plan Your Trip See All Plan Your Trip Insider Guides Itineraries Weddings Transportation International Travel Signup for our newsletter View our Vacation Planning Guide Visitor Centers Weather Webcams See All Plan Your Trip Insider Guides Itineraries Weddings Transportation International Travel Signup for our newsletter View our Vacation Planning Guide Visitor Centers Weather Webcams Added to your favorites Planning a visit to Miami? Check out these itinerary ideas Added to your favorites Use our Hipster Guide to plan the perfect weekend Added to your favorites Love Music? Find Your Rhythm Added to your favorites Summer in Miami Places To Stay Places To Stay Explore All Hotels Beachfront Hotels Boutique Hotels Extended Stay Hotels Hotels Near the Airport Hotels Near PortMiami Luxury Hotels Pet-Friendly Hotels Resort Hotels Hotel Deals Explore All Hotels Beachfront Hotels Boutique Hotels Extended Stay Hotels Hotels Near the Airport Hotels Near PortMiami Luxury Hotels Pet-Friendly Hotels Resort Hotels Hotel Deals Added to your favorites Miami Beach's Luxury Oceanfront Hotels Added to your favorites Top Resorts for Families Eat & Drink Eat & Drink Restaurants Bars & Lounges Craft Beer & Breweries Restaurants Bars & Lounges Craft Beer & Breweries Added to your favorites Experience Miami Spice | through Sept 30 Added to your favorites Looking for Restaurants with Live Music? Events Events See All Miami Events & Festivals September Events Concerts & Live Music Events Signature Annual Events Sporting Events Seasonal Events See All Miami Events & Festivals September Events Concerts & Live Music Events Signature Annual Events Sporting Events Seasonal Events Added to your favorites Miami International Auto Show | Sep 26 - Oct 5 Added to your favorites Orgullo | Sep 25 - Oct 12 Deals Deals See All Miami Deals Art & Culture Deals Attraction Deals Cruise Deals Hotel Deals Military Deals Restaurant Deals Tours & Outdoor Deals See All Miami Deals Hotel Deals Art & Culture Deals Military Deals Attraction Deals Restaurant Deals Cruise Deals Tours & Outdoor Deals Added to your favorites Indulge in Miami Spice this August - September Follow Us Follow Us Visitors Meeting Planners GMCVB Partners Travel Professionals Press & Media GMCVB About GMCVB Advertising Opportunities BHI Business Relocation Film/TV Production Sports Commission Partner Extranet Login Home Outdoor Activities Miami Beach Botanical Garden 1 6 Miami Beach Botanical Garden Outdoor Experiences Overview Details Meetings The Miami Beach Botanical Garden is a lush three-acre landscape filled with 100 palm species, orchids and native plants such as the corky stem, which attracts Florida’s state butterfly, the black-and-yellow striped zebra longwing. Meander through the gardens and enjoy a tropical escape in the heart of Miami Beach. Located next to the Miami Beach Convention Center, the garden is part of the Miami Beach City Center Campus in the Miami Beach Convention Center district. Botanical Garden Activities Take a break from the hustle and bustle of South Beach to enjoy the beauty of stunning orchids, the tranquility of the Japanese Garden and the beautiful koi pond. Miami Beach Botanical Garden has several distinct garden areas to explore. Highlights include spotting orchids in the trees and along the ground, marveling at the garden’s largest and oldest palms in its northeast corner, and breathing in the sweet scent of the ylang-ylang tree. The garden offers yoga classes, cultural events, workshops and other activities throughout the year. Some activities are currently held virtually, but there are still events taking place at the garden. Be sure to check the website for more details. If you’re looking to rent an event space , the Miami Beach Botanical Garden offers spaces for weddings and more. Botanical Garden Tours The garden has adjusted its tour hours. Please visit the ticketing page for details about how to purchase tickets and schedule tours. Self-guided audio tours (available in English, Spanish and Portuguese) are available. A garden map is accessible at the main entrance and welcome center. Botanical Boutique & Garden Center Grow your own piece of Miami with seeds and orchids from the Botanical Boutique. You can nab some unique souvenirs here such as items created by local artisans, jewelry and even compost soil made in the garden. At the Garden Center, you can get a peek at what the garden is currently growing. A nursery, propagation center and outdoor classroom make the garden center a great stop for budding plant enthusiasts. Talk to one of the garden’s horticulturalists for information about plants and professional tips on making your plants thrive. Visiting the Garden Thanks to Miami’s subtropical climate, the garden is open year-round and many plants flower continuously. Hours are currently limited and you must purchase timed-entry tickets ahead of time to visit. Check the Miami Botanical Garden to purchase tickets and for information about prices, hours and amenity availability, as well as event and garden rental information. General Amenities Free Wifi Self-Parking Number of Self-Parking Spaces: 10 Pet Friendly Gift Shop Meeting/Private Event Space Smoke-Free Property The Miami Beach Botanical Garden is a three acres tropical oasis located directly across from the City’s state of the art Convention Center and just two blocks from the famed Lincoln Road open air pedestrian mall. The Garden provides visitors a unique opportunity to view our horticulture collections. Designed with meandering walkways, water features, specialty gardens, a 5000 square feet Great Lawn and a 350 ft. waterfront promenade, this is the perfect location for corporate meetings or social gatherings. The garden provides amble space for interacting while observing social distancing protocols. The Garden offers two meeting function rooms. The Banyan Ballroom opens out to a covered terrace with views into the garden. This room, with its 18 ft ceiling, is coded to accommodate up to 110 people with an additional 90 guests on the adjacent terrace. The Butterfly Conference Room, equipped with large screen monitor and easy A/V hook up, is ideal for a group of 40 or less Free wifi is available throughout the property. Visit the website at www.mbgarden.org. For event information contact Maurice Jackson at maurice@mbgarden.org or call at 305 673 7256 x 2020. Submit RFP Meeting and Event Space Meeting Space: 1500.00 Meeting Rooms: 2 Largest Meeting Room (sq.ft): 150.00 Banquet Capacity: 120 Meeting Rooms Sustainability Partner has self-reported the following sustainability efforts. Please contact them directly for details. All windows are doube-glazed Most lighting uses energy-efficient bulbs Recycling bins available to guests Water cooler/dispenser Use of Unbleached Linens Accessibility See Miami Beach Botanical Garden's verified accessibility information on WheeltheWorld.com Miami Beach Botanical Garden 2000 Convention Center Drive Miami Beach, FL 33139 (305) 673-7256 Visit website Events Added to your favorites Perfumer for a Day Workshop with Patrizio Santocchi Sep 14, 2025 Unlock the art of fragrance creation in a hands-on workshop led by a professional perfumer. Educational Events Added to your favorites Find Your Flexibility Sep 13, 2025 Miami Beach Botanical Garden hosts a morning workshop designed to help participants restore ease of movement and improve flexibility through Somatic Relief Yoga. Health & Wellness Added to your favorites HypnoExpression: Ancestry Healing Activation Sep 14, 2025 Silent disco headphones set the stage for a three-part journey of meditation, creative expression and movement at Miami Beach Botanical Garden. Arts & Culture Added to your favorites Growing Orchids with R.F. Orchids Sep 17, 2025 Learn the essentials of orchid care in a workshop led by Michael Coronado, Vice President of South Florida's renowned R. Educational Events Added to your favorites Garden Magic: An Immersive Sound Healing Experience Oct 25, 2025 Breathwork, movement and live percussion combine with immersive soundscapes in an evening program designed to guide participants through meditation and collective experience. Health & Wellness Added to your favorites Groovin' on a Sunday Afternoon Sep 28, 2025 Jazz ensembles from across Miami bring their sound to the open-air setting of the Miami Beach Botanical Garden for an afternoon of community and music. Music Added to your favorites Echos in the Ferns Zine Launch Sep 28, 2025 A zine launch at the Miami Beach Botanical Garden blends personal history, Florida landscapes and hands-on artmaking. Arts & Culture Added to your favorites Songs of the Earth Jan 23, 2026 Classical voices and immersive sound installations transform the Miami Beach Botanical Garden into an open-air instrument of music and nature. Music Highlighted In These Stories Added to your favorites Sustainability at the Miami Beach Convention Center Added to your favorites Accessible Miami Attractions Added to your favorites Free Transportation Added to your favorites Miami Beach For Families Added to your favorites Miami Attractions Itinerary Added to your favorites Fun, Free Things To Do In Miami Added to your favorites Explore Nature in the Parks & Gardens of Miami Added to your favorites Your Guide to a Weekend in Miami Beach Added to your favorites How To Use Miami's Trolleys Added to your favorites Miami Beach Trolley Added to your favorites Where To Catch Dance Performances In Miami top 201 S Biscayne Blvd, Suite 2200 Miami, FL 33131 USA 1-305-539-3000 1-800-933-8448 Contact Us About GMCVB Accessibility Statement Employment at GMCVB Privacy Policy Follow Us! SIGN-UP FOR OUR NEWSLETTER Thank you for your submission ! STAY IN THE KNOW WITH ALL THINGS GREATER MIAMI & MIAMI BEACH Sign Me Up By signing up, you are agreeing to our Privacy Policy . We won’t share or sell your email address. You may unsubscribe at any time. © 2025 Official website Greater Miami Convention & Visitors Bureau. All rights reserved."
    },
    {
      "url": "https://mbgarden.org/rent-the-garden/",
      "text": "Rent The Garden | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup RENT THE GARDEN Let us host your next special event… RENT THE GARDEN Corporate Events Weddings OPEN: Tues-Sun, 9am-5pm </a Events Membership Garden Rental Miami Beach Botanical Garden is a lush subtropical setting for private and corporate events. Our goal is a smooth and pleasant planning process and an enjoyable event. Something is always in bloom at the Miami Beach Botanical Garden, and we offer a choice of themed settings for your event. Whether you want an indoor, outdoor or mixed space event, we have a range of options that will suit both large and small crowds. For more details please contact us at Events@mbgarden.org Corporate Event Information Click here to rent the garden Click here to rent the garden ENTIRE GARDEN You have the exclusive use of the entire 3-acre garden. This includes our Great Lawn, a patio overlooking the Koi Pond, Banyan Ballroom, Covered Terrace and Japanese Garden, plus the trails through the garden.  From the time they enter the front gates, your guests will feel they have been transported from the glitz of South Beach to a lush subtropical island accented with flowering trees. The beauty of the natural setting will impress your guests. This option is recommended for parties requiring substantial space and allows for social distancing. There will be no other events scheduled at the same time and tenting is permitted. Click here to rent the garden Click here to rent the garden ENTIRE GARDEN You have the exclusive use of the entire 3-acre garden. This includes our Great Lawn, a patio overlooking the Koi Pond, Banyan Ballroom, Covered Terrace and Japanese Garden, plus the trails through the garden.  From the time they enter the front gates, your guests will feel they have been transported from the glitz of South Beach to a lush subtropical island accented with flowering trees. The beauty of the natural setting will impress your guests. This option is recommended for parties requiring substantial space and allows for social distancing. There will be no other events scheduled at the same time and tenting is permitted. BANYAN ROOM Banyan Room, Terrace & Lawn\n\nThe Banyan Room and adjacent sail covered terrace is a versatile indoor/outdoor option.\n\nThe Banyan Room measures 30’ x 50’ with lofted 18 foot ceilings and stone tile flooring, giving it a light and airy feel. The room can accommodate up to 100 guests for a sit-down dinner, 150 standing cocktail reception and a perfect space to place a live band or DJ to dance the night away. The entire length of the room is windows with three sets of sliding doors which open fully onto the adjacent 25′ x 50′  sail covered Banyan Terrace.  In this covered terrace area, you can seat up to 100 additional guests.  The Banyan Terrace overlooks the Banyan Lawn and connects to the Gumbo Limbo Courtyard.  An adjacent catering prep kitchen is convenient and spacious. Click here to rent the garden Click here to rent the garden BANYAN ROOM Banyan Room, Terrace & Lawn\n\nThe Banyan Room and adjacent sail covered terrace is a versatile indoor/outdoor option.\n\nThe Banyan Room measures 30’ x 50’ with lofted 18 foot ceilings and stone tile flooring, giving it a light and airy feel. The room can accommodate up to 100 guests for a sit-down dinner, 150 standing cocktail reception and a perfect space to place a live band or DJ to dance the night away. The entire length of the room is windows with three sets of sliding doors which open fully onto the adjacent 25′ x 50′  sail covered Banyan Terrace.  In this covered terrace area, you can seat up to 100 additional guests.  The Banyan Terrace overlooks the Banyan Lawn and connects to the Gumbo Limbo Courtyard.  An adjacent catering prep kitchen is convenient and spacious. Click here to Rent The Garden BUTTERFLY GALLERY Butterfly Gallery is 15’ x 30’ and will comfortably accommodate up to 40 people for classes, seminars, staging area for photo shoots and meetings.  One-story windows allow attendees to view the garden around them or pull down the shades for privacy.  This space also includes a wall-mounted TV for A/V use. Click here to rent the garden Click here to rent the garden BUTTERFLY GALLERY Butterfly Gallery is 15’ x 30’ and will comfortably accommodate up to 40 people for classes, seminars, staging area for photo shoots and meetings.  One-story windows allow attendees to view the garden around them or pull down the shades for privacy.  This space also includes a wall-mounted TV for A/V use. GET QUOTE - BUTTERFLY GARDEN × GET QUOTE - BUTTERFLY GARDEN [tel Phone class:events-field \"events-phone\" placeholder \"Phone\"] Event Date* Type of Events* Special Event Wedding Wedding Ceremony Educational Event Other.... Close An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter Rent The garden Fill out the form below, and we will be in touch shortly. Client Information Form Full Name Organization Is this a Non Profit? NonProfit Yes No Email Cell Phone Home Phone Address City State Zipcode Requested Event Date StartTime EndTime Choose Event General Event* Corporate Event* Photo Shoot* Guest Count: Will you need catering? Will you need catering Yes No Will Alcohol be served? Will Alcohol be Served Yes No How did you hear Submit ⟶"
    },
    {
      "url": "https://mbgarden.org/employment/",
      "text": "Employment | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup OPPORTUNITIES BE PART OF OUR TEAM VISIT Visitor Info Garden Map Parking info Tours Photography Policy Community Compost OPEN: Tues-Sun, 9am-5pm Events Membership Garden Rental Employment Opportunities Job Detail: Arborist Location: Miami Beach, FL Salary: 2025 starting hourly rate is $30.00/hr with advancement to $35.00 Full or Part-Time Career Opportunity The Miami Beach Botanical Garden promotes environmental enjoyment, stewardship and sustainability through education, the arts, and interaction with the natural world. Our garden is a unique, subtropical oasis of beauty and tranquility within an urban setting—a community resource that refreshes, inspires and engages our visitors. Overview This is a skilled position with the Miami Beach Garden Conservancy which is responsible for the preventative care, formative pruning, planting and removal of trees and shrubs to improve appearance, maintain usability, improve plant health and minimize storm damage. Arborists can see the impact their work has on the Miami Beach Botanical Garden landscape/environment that will benefit the community for years to come, along with the impact it will have on the residents. This position is well suited for those looking to work as a team, primarily outdoors. This position offers both part-time and full-time opportunities, with flexible scheduling based on availability and preference. The ideal candidate will have a passion for horticulture, a strong work ethic, and the ability to work both independently and as part of a team to maintain the beauty of our garden. Pay Rate 2025 starting hourly rate is $30.00/hr with advancement to $35.00/hr. The Miami Beach Garden Conservancy offers a suite of benefits to all full-time employees including paid holidays, time off, health, dental and vision insurance.  The Garden pays 100% of employee premiums for health insurance.  After 1 year of service the Garden also offers a 4% match on its 401(k) plan. DUTIES AND RESPONSIBILITIES The work below is representative of the scope of work performed. Individual duties will vary based on work assignment. Tree & plant installation, maintenance and care Plant, prune and provide general care of trees and shrubs. Operate hand and power tools, saws, light and medium duty equipment, and various other grounds & tree maintenance equipment. Plant trees and other plant material according to current applicable industry standards. Inspect trees and shrubs to determine health and perform integrated pest management. Train laborers and volunteers in the techniques and procedures of planting, pruning and general care of trees and shrubs. Respond to storm events and any resulting damage, which may include coordination of work with contractors. Perform general custodial duties including leaf blowing, sweeping, general cleaning, waste & rubbish removal. MINIMUM QUALIFICATIONS Education and Experience Associate’s degree or two-year vocational certificate in horticulture, arboriculture, landscape maintenance, natural resources, ecology or closely related field AND two (2) years of experience performing preventative care, formative pruning, and tree removal OR an equivalent combination of education and experience sufficient to successfully perform the essential duties of the job. Desirable Qualifications Experience in public gardening and arboriculture with related knowledge of general tree and plant identification, pruning and grounds maintenance. If this work interests you but you are unsure if you meet all the job requirements listed above, please apply anyway! Your experience is likely more applicable to the role than you think, and the Miami Beach Garden Conservancy is interested in candidates who can bring not only technical expertise but a variety of lived experience to the team. PHYSICAL AND ENVIRONMENTAL CRITERIA In consideration of the overall amount of physical effort required to perform this position, the work is best described as Heavy Work: Exerting up to 100 pounds of force occasionally, and/or up to 50 pounds of force frequently, and/or up to 20 pounds of force constantly to move objects.  Working in extreme heat (above 100 degrees) and rain is expected.  An ability to walk on uneven ground (gravel, rocks, mounds) is expected. To have your application considered in the first round of reviews, please apply before September 8, 2025.  Applications will be accepted until the position is filled. How to Apply : Interested candidates can send a resume or brief description of experience to kathy@mbgarden.org Job Description: Part-Time or Full-Time Gardener – Miami Beach Botanical Garden Location : Miami Beach, FL Position : Part-Time or Full-Time Gardener Compensation : Competitive pay, based on experience Overview : The Miami Beach Botanical Garden is seeking a reliable and dedicated Gardener to join our team. This position offers both part-time and full-time opportunities, with flexible scheduling based on availability and preference. The ideal candidate will have a passion for horticulture, a strong work ethic, and the ability to work both independently and as part of a team to maintain the beauty of our garden. Responsibilities : Maintain and care for a wide variety of plants, flowers, trees, and landscaping features throughout the garden. Assist in planting, pruning, weeding, mulching, and general garden maintenance. Water plants and monitor soil health to ensure optimal growth conditions. Keep garden areas clean and tidy, including trash removal and sweeping. Assist with pest control, disease management, and applying fertilizers as needed. Maintain garden tools and equipment, ensuring they are clean and in good working condition. Assist with educational and community outreach events held within the garden. Help with the setup and breakdown of garden events as needed. Qualifications : Previous experience in gardening, landscaping, or horticulture is preferred but not required. Ability to work independently and as part of a team. Strong attention to detail and a love for plants and nature. Must be able to lift heavy objects (up to 50 lbs) and perform physical tasks such as bending, kneeling, and standing for long periods. Ability to work outdoors in varying weather conditions. Strong communication skills and a positive attitude. A valid driver’s license may be required for transportation of materials, depending on the position. Physical Requirements : Ability to lift and carry items weighing up to 50 pounds. Ability to bend, kneel, and work in various physical positions. Comfortable working in all weather conditions, including sun and rain. Benefits : Competitive hourly wage. Flexible work schedule (part-time or full-time). Opportunity to work in a beautiful, vibrant environment. How to Apply : Interested candidates can send a resume or brief description of experience to kathy@mbgarden.org Click here to rent the garden Click here for more Information An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter"
    },
    {
      "url": "https://mbgarden.org/rent-the-garden-2/",
      "text": "Rent The Garden-2 | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup RENT THE GARDEN Let us host your next special event… RENT THE GARDEN EVENT SPACES WEDDINGS OPEN: Tues-Sun, 9am-5pm Join our Team - positions open Events Membership Garden Rental Miami Beach Botanical Garden is a lush subtropical setting for private and corporate events.\n\nOur goal is a smooth and pleasant planning process and an enjoyable event. Maurice Jackson is your dedicated on-site event manager, offering you a wealth of experience from 25 years in residential and corporate interior design and event management.\n\nSomething is always in bloom at the Miami Beach Botanical Garden, and we offer a choice of themed settings for your event. Whether you want an indoor, outdoor or mixed space event, we have a range of options that will suit both large and small crowds.\n\nFor more details please  contact Maurice Jackson at 305.673.7256 ext 202 or email maurice@mbgarden.org . JAPANESE GARDEN The Garden Center houses our Nursery, Propagation Center and outdoor classroom. Choose from an array of native plants, succulents, philodendron, flowering vines, and a selection of plants propagated from our collection and ornamental exotics for purchase. Pick up a bag of Garden Compost Soil and watch your plants flourish. Speak with our horticulture experts to be sure you have the right plant for the right place and get tips on caring for your garden. Open during Garden hours. Click here to Rent The Garden JAPANESE GARDEN The Garden Center houses our Nursery, Propagation Center and outdoor classroom. Choose from an array of native plants, succulents, philodendron, flowering vines, and a selection of plants propagated from our collection and ornamental exotics for purchase. Pick up a bag of Garden Compost Soil and watch your plants flourish. Speak with our horticulture experts to be sure you have the right plant for the right place and get tips on caring for your garden. Open during Garden hours. ENTIRE GARDEN You have the exclusive use of the entire 3-acre garden. This includes our Great Lawn, a patio overlooking the Koi Pond, Banyan Ballroom, Covered Terrace and Japanese Garden, plus the trails through the garden.  From the time they enter the front gates, your guests will feel they have been transported from the glitz of South Beach to a lush subtropical island accented with flowering trees. The beauty of the natural setting will impress your guests. This option is recommended for parties requiring substantial space and allows for social distancing. There will be no other events scheduled at the same time and tenting is permitted. Click here to Rent The Garden ENTIRE GARDEN You have the exclusive use of the entire 3-acre garden. This includes our Great Lawn, a patio overlooking the Koi Pond, Banyan Ballroom, Covered Terrace and Japanese Garden, plus the trails through the garden.  From the time they enter the front gates, your guests will feel they have been transported from the glitz of South Beach to a lush subtropical island accented with flowering trees. The beauty of the natural setting will impress your guests. This option is recommended for parties requiring substantial space and allows for social distancing. There will be no other events scheduled at the same time and tenting is permitted. BUTTERFLY GALLERY Butterfly Gallery is 15’ x 30’ and will comfortably accommodate up to 40 people for classes, seminars, staging area for photo shoots and meetings.  One-story windows allow attendees to view the garden around them or pull down the shades for privacy.  This space also includes a wall-mounted TV for A/V use. Click here to Rent The Garden BUTTERFLY GALLERY Butterfly Gallery is 15’ x 30’ and will comfortably accommodate up to 40 people for classes, seminars, staging area for photo shoots and meetings.  One-story windows allow attendees to view the garden around them or pull down the shades for privacy.  This space also includes a wall-mounted TV for A/V use. GET QUOTE - BUTTERFLY GARDEN × GET QUOTE - BUTTERFLY GARDEN [tel Phone class:events-field \"events-phone\" placeholder \"Phone\"] Event Date* Type of Events* Special Event Wedding Wedding Ceremony Educational Event Other.... Close BANYAN ROOM Banyan Room, Terrace & Lawn\n\nThe Banyan Room and adjacent sail covered terrace is a versatile indoor/outdoor option.\n\nThe Banyan Room measures 30’ x 50’ with lofted 18 foot ceilings and stone tile flooring, giving it a light and airy feel. The room can accommodate up to 100 guests for a sit-down dinner, 150 standing cocktail reception and a perfect space to place a live band or DJ to dance the night away. The entire length of the room is windows with three sets of sliding doors which open fully onto the adjacent 25′ x 50′  sail covered Banyan Terrace.  In this covered terrace area, you can seat up to 100 additional guests.  The Banyan Terrace overlooks the Banyan Lawn and connects to the Gumbo Limbo Courtyard.  An adjacent catering prep kitchen is convenient and spacious. Click here to Rent The Garden BANYAN ROOM Banyan Room, Terrace & Lawn\n\nThe Banyan Room and adjacent sail covered terrace is a versatile indoor/outdoor option.\n\nThe Banyan Room measures 30’ x 50’ with lofted 18 foot ceilings and stone tile flooring, giving it a light and airy feel. The room can accommodate up to 100 guests for a sit-down dinner, 150 standing cocktail reception and a perfect space to place a live band or DJ to dance the night away. The entire length of the room is windows with three sets of sliding doors which open fully onto the adjacent 25′ x 50′  sail covered Banyan Terrace.  In this covered terrace area, you can seat up to 100 additional guests.  The Banyan Terrace overlooks the Banyan Lawn and connects to the Gumbo Limbo Courtyard.  An adjacent catering prep kitchen is convenient and spacious. Click here to Rent The Garden An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter Rent The garden Fill out the form below, and we will be in touch shortly. Rent The garden Fill out the form below, and we will be in touch shortly. Client Information Form Full Name Organization Is this a Non Profit? NonProfit Yes No Email Cell Phone Home Phone Address City State Zipcode Requested Event Date StartTime EndTime Choose Event General Event* Corporate Event* Photo Shoot* Guest Count: Will you need catering? Will you need catering Yes No Will Alcohol be served? Will Alcohol be Served Yes No How did you hear Submit ⟶"
    },
    {
      "url": "https://mbgarden.org/event/spring-artisan-market-at-the-garden/",
      "text": "Spring Artisan Market at the Garden | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup Spring Artisan Market at the Garden OPEN: Tues-Sun, 9am-5pm Events Membership Garden Rental « All Events This event has passed. Spring Artisan Market at the Garden April 30, 2023 @ 9:00 am - 5:00 pm « Earth Day Workshop: Make Jewelry & Art with Scraps by Riki Full Moon Candlelit Yogic Breathwork & Sound Bath Journey » Spring Artisan Market at the Garden Sunday, April 30 • 9am-5pm Save the date for fun, open air shopping at our upcoming artisan market taking place for one day only this April. You’ll find a selection of handcrafted items – from painting, printmaking, sculpture and ceramics – to jewelry, leather working, home design products and personal accessories. Also meet the small batch food artisans who create local and sustainable brands. Stay tuned for more info about the vendors who will be joining us on April 30! If you are a vendor who is interested in space at our Spring Artisan Market, please contact corey@mbgarden.org or maurice@mbgarden.org to request an application form. Add to calendar Google Calendar iCalendar Outlook 365 Outlook Live Details Date: April 30, 2023 Time: 9:00 am - 5:00 pm « Earth Day Workshop: Make Jewelry & Art with Scraps by Riki Full Moon Candlelit Yogic Breathwork & Sound Bath Journey » An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter"
    },
    {
      "url": "https://mbgarden.org/photography-policy/",
      "text": "Photography Policy | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup PHOTOGRAPHY POLICY Please read our policies and guidelines… VISIT Visitor Info Garden Map Parking info Photography Policy Community Compost OPEN: Tues-Sun, 9am-5pm Events Membership Garden Rental The Miami Beach Botanical Garden is happy to provide the setting for souvenir snapshots, personal portraits, and commercial photography and film shoots. All fees must be paid prior to the beginning of the photo/filming session upon arrival of the crew. These fees are valid during normal business hours Tuesday-Sunday 9am to 5pm, time needed outside of this must be scheduled in advance for an additional fee per hour. Professional photography For individuals who wish to use our facility as the setting or backdrop for personal photo portraits, including weddings, quinceañeras, couples, or groups up to 6 people. No reservations are required for professional photography but it is strongly encouraged to call in advance to find out if there are any private or community events scheduled. Rates start at $150 per Hour *There are no dressing room facilities included at this level. The bathrooms are not to be used as a dressing room as they are the public facilities for the Garden. For information, please contact Corey Narson at: events@mbgarden.org Commercial Photography and Filming Permits Reservations are required for commercial photography and filming. *There are no dressing room facilities included at this level. The bathrooms are not to be used as a dressing room as they are the public facilities for the Garden. **Additional permits may be required by the City of Miami Beach For information on commercial photography and and filming, please contact Corey Narson at: events@mbgarden.org Major film and television shoots Reservations are required and they need to be pre-approved on a case-by-case basis after submitting detailed request in writing. **Additional permits may be required by the City of Miami Beach Priced on a case-by-case basis Dressing Room An air conditioned dressing room may be reserved for your shoot in advance, if available, for an additional fee An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter"
    },
    {
      "url": "https://www.miamiandbeaches.com/l/outdoor-experiences/miami-beach-botanical-garden/2126",
      "text": "Miami Beach Botanical Garden | Miami & Miami Beach Skip to Content The Official Website of Greater Miami & Miami Beach Visitors Meeting Planners GMCVB Partners Travel Professionals Press & Media GMCVB About GMCVB Advertising Opportunities BHI Business Relocation Film/TV Production Sports Commission Partner Extranet Login Language English 中文 Deutsch Español Français Italiano 日本語 Kreyòl Português EN English 中文 Deutsch Español Français Italiano 日本語 Kreyòl Português Explore Explore Explore Things to Do Things to Do See All Things to Do Arts & Culture Attractions Beaches Cruising from Miami Health & Fitness History Multicultural Nightlife Outdoor Experiences Shopping Spa & Wellness Sports Tours & Excursions Water Activities See All Things to Do Arts & Culture Attractions Beaches Cruising from Miami Health & Fitness History Multicultural Nightlife Outdoor Experiences Shopping Spa & Wellness Sports Tours & Excursions Water Activities Added to your favorites Experience Miami's Concerts & Live Music Events Added to your favorites Discover Halloween in Miami Cities & Neighborhoods Travel Interests Travel Interests See All Travel Interests Accessible Travel Family Friendly Indulgent Experiences LGBTQ Travel Multicultural Miami Outdoor Explorer Pet Friendly Travel Relaxing Getaway Sustaining Miami See All Travel Interests Multicultural Miami Accessible Travel Outdoor Explorer Family Friendly Pet Friendly Travel Indulgent Experiences Relaxing Getaway LGBTQ Travel Sustaining Miami Plan Your Trip Plan Your Trip See All Plan Your Trip Insider Guides Itineraries Weddings Transportation International Travel Signup for our newsletter View our Vacation Planning Guide Visitor Centers Weather Webcams See All Plan Your Trip Insider Guides Itineraries Weddings Transportation International Travel Signup for our newsletter View our Vacation Planning Guide Visitor Centers Weather Webcams Added to your favorites Planning a visit to Miami? Check out these itinerary ideas Added to your favorites Use our Hipster Guide to plan the perfect weekend Added to your favorites Love Music? Find Your Rhythm Added to your favorites Summer in Miami Places To Stay Places To Stay Explore All Hotels Beachfront Hotels Boutique Hotels Extended Stay Hotels Hotels Near the Airport Hotels Near PortMiami Luxury Hotels Pet-Friendly Hotels Resort Hotels Hotel Deals Explore All Hotels Beachfront Hotels Boutique Hotels Extended Stay Hotels Hotels Near the Airport Hotels Near PortMiami Luxury Hotels Pet-Friendly Hotels Resort Hotels Hotel Deals Added to your favorites Miami Beach's Luxury Oceanfront Hotels Added to your favorites Top Resorts for Families Eat & Drink Eat & Drink Restaurants Bars & Lounges Craft Beer & Breweries Restaurants Bars & Lounges Craft Beer & Breweries Added to your favorites Experience Miami Spice | through Sept 30 Added to your favorites Looking for Restaurants with Live Music? Events Events See All Miami Events & Festivals September Events Concerts & Live Music Events Signature Annual Events Sporting Events Seasonal Events See All Miami Events & Festivals September Events Concerts & Live Music Events Signature Annual Events Sporting Events Seasonal Events Added to your favorites Miami International Auto Show | Sep 26 - Oct 5 Added to your favorites Orgullo | Sep 25 - Oct 12 Deals Deals See All Miami Deals Art & Culture Deals Attraction Deals Cruise Deals Hotel Deals Military Deals Restaurant Deals Tours & Outdoor Deals See All Miami Deals Hotel Deals Art & Culture Deals Military Deals Attraction Deals Restaurant Deals Cruise Deals Tours & Outdoor Deals Added to your favorites Indulge in Miami Spice this August - September Follow Us Follow Us Visitors Meeting Planners GMCVB Partners Travel Professionals Press & Media GMCVB About GMCVB Advertising Opportunities BHI Business Relocation Film/TV Production Sports Commission Partner Extranet Login Home Outdoor Activities Miami Beach Botanical Garden 1 6 Miami Beach Botanical Garden Outdoor Experiences Overview Details Meetings The Miami Beach Botanical Garden is a lush three-acre landscape filled with 100 palm species, orchids and native plants such as the corky stem, which attracts Florida’s state butterfly, the black-and-yellow striped zebra longwing. Meander through the gardens and enjoy a tropical escape in the heart of Miami Beach. Located next to the Miami Beach Convention Center, the garden is part of the Miami Beach City Center Campus in the Miami Beach Convention Center district. Botanical Garden Activities Take a break from the hustle and bustle of South Beach to enjoy the beauty of stunning orchids, the tranquility of the Japanese Garden and the beautiful koi pond. Miami Beach Botanical Garden has several distinct garden areas to explore. Highlights include spotting orchids in the trees and along the ground, marveling at the garden’s largest and oldest palms in its northeast corner, and breathing in the sweet scent of the ylang-ylang tree. The garden offers yoga classes, cultural events, workshops and other activities throughout the year. Some activities are currently held virtually, but there are still events taking place at the garden. Be sure to check the website for more details. If you’re looking to rent an event space , the Miami Beach Botanical Garden offers spaces for weddings and more. Botanical Garden Tours The garden has adjusted its tour hours. Please visit the ticketing page for details about how to purchase tickets and schedule tours. Self-guided audio tours (available in English, Spanish and Portuguese) are available. A garden map is accessible at the main entrance and welcome center. Botanical Boutique & Garden Center Grow your own piece of Miami with seeds and orchids from the Botanical Boutique. You can nab some unique souvenirs here such as items created by local artisans, jewelry and even compost soil made in the garden. At the Garden Center, you can get a peek at what the garden is currently growing. A nursery, propagation center and outdoor classroom make the garden center a great stop for budding plant enthusiasts. Talk to one of the garden’s horticulturalists for information about plants and professional tips on making your plants thrive. Visiting the Garden Thanks to Miami’s subtropical climate, the garden is open year-round and many plants flower continuously. Hours are currently limited and you must purchase timed-entry tickets ahead of time to visit. Check the Miami Botanical Garden to purchase tickets and for information about prices, hours and amenity availability, as well as event and garden rental information. General Amenities Free Wifi Self-Parking Number of Self-Parking Spaces: 10 Pet Friendly Gift Shop Meeting/Private Event Space Smoke-Free Property The Miami Beach Botanical Garden is a three acres tropical oasis located directly across from the City’s state of the art Convention Center and just two blocks from the famed Lincoln Road open air pedestrian mall. The Garden provides visitors a unique opportunity to view our horticulture collections. Designed with meandering walkways, water features, specialty gardens, a 5000 square feet Great Lawn and a 350 ft. waterfront promenade, this is the perfect location for corporate meetings or social gatherings. The garden provides amble space for interacting while observing social distancing protocols. The Garden offers two meeting function rooms. The Banyan Ballroom opens out to a covered terrace with views into the garden. This room, with its 18 ft ceiling, is coded to accommodate up to 110 people with an additional 90 guests on the adjacent terrace. The Butterfly Conference Room, equipped with large screen monitor and easy A/V hook up, is ideal for a group of 40 or less Free wifi is available throughout the property. Visit the website at www.mbgarden.org. For event information contact Maurice Jackson at maurice@mbgarden.org or call at 305 673 7256 x 2020. Submit RFP Meeting and Event Space Meeting Space: 1500.00 Meeting Rooms: 2 Largest Meeting Room (sq.ft): 150.00 Banquet Capacity: 120 Meeting Rooms Sustainability Partner has self-reported the following sustainability efforts. Please contact them directly for details. All windows are doube-glazed Most lighting uses energy-efficient bulbs Recycling bins available to guests Water cooler/dispenser Use of Unbleached Linens Accessibility See Miami Beach Botanical Garden's verified accessibility information on WheeltheWorld.com Miami Beach Botanical Garden 2000 Convention Center Drive Miami Beach, FL 33139 (305) 673-7256 Visit website Events Added to your favorites Perfumer for a Day Workshop with Patrizio Santocchi Sep 14, 2025 Unlock the art of fragrance creation in a hands-on workshop led by a professional perfumer. Educational Events Added to your favorites Find Your Flexibility Sep 13, 2025 Miami Beach Botanical Garden hosts a morning workshop designed to help participants restore ease of movement and improve flexibility through Somatic Relief Yoga. Health & Wellness Added to your favorites HypnoExpression: Ancestry Healing Activation Sep 14, 2025 Silent disco headphones set the stage for a three-part journey of meditation, creative expression and movement at Miami Beach Botanical Garden. Arts & Culture Added to your favorites Growing Orchids with R.F. Orchids Sep 17, 2025 Learn the essentials of orchid care in a workshop led by Michael Coronado, Vice President of South Florida's renowned R. Educational Events Added to your favorites Garden Magic: An Immersive Sound Healing Experience Oct 25, 2025 Breathwork, movement and live percussion combine with immersive soundscapes in an evening program designed to guide participants through meditation and collective experience. Health & Wellness Added to your favorites Groovin' on a Sunday Afternoon Sep 28, 2025 Jazz ensembles from across Miami bring their sound to the open-air setting of the Miami Beach Botanical Garden for an afternoon of community and music. Music Added to your favorites Echos in the Ferns Zine Launch Sep 28, 2025 A zine launch at the Miami Beach Botanical Garden blends personal history, Florida landscapes and hands-on artmaking. Arts & Culture Added to your favorites Songs of the Earth Jan 23, 2026 Classical voices and immersive sound installations transform the Miami Beach Botanical Garden into an open-air instrument of music and nature. Music Highlighted In These Stories Added to your favorites Sustainability at the Miami Beach Convention Center Added to your favorites Accessible Miami Attractions Added to your favorites Free Transportation Added to your favorites Miami Beach For Families Added to your favorites Miami Attractions Itinerary Added to your favorites Fun, Free Things To Do In Miami Added to your favorites Explore Nature in the Parks & Gardens of Miami Added to your favorites Your Guide to a Weekend in Miami Beach Added to your favorites How To Use Miami's Trolleys Added to your favorites Miami Beach Trolley Added to your favorites Where To Catch Dance Performances In Miami top 201 S Biscayne Blvd, Suite 2200 Miami, FL 33131 USA 1-305-539-3000 1-800-933-8448 Contact Us About GMCVB Accessibility Statement Employment at GMCVB Privacy Policy Follow Us! SIGN-UP FOR OUR NEWSLETTER Thank you for your submission ! STAY IN THE KNOW WITH ALL THINGS GREATER MIAMI & MIAMI BEACH Sign Me Up By signing up, you are agreeing to our Privacy Policy . We won’t share or sell your email address. You may unsubscribe at any time. © 2025 Official website Greater Miami Convention & Visitors Bureau. All rights reserved."
    },
    {
      "url": "https://mbgarden.org/programeventsassistantcoordinator/",
      "text": "ProgramEventsAssistantCoordinator | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup Program and Events Assistant Coordinator BE PART OF OUR TEAM VISIT Visitor Info Garden Map Parking info Tours Photography Policy Community Compost The Garden is Open : Tuesday- Sunday 9am-5pm and for special events Events Membership Program and Events Assistant Coordinator Reports to Program and Events Coordinator Full-time, non-exempt position Summary : This position is responsible for assisting with all phases of event scheduling, booking, staffing, and execution. Events range from weddings and corporate receptions to educational and arts programming. Essential Duties and Responsibilities : Assist with programs and events within the Garden including weddings, corporate receptions, and Garden-sponsored events. Respond to in-bound inquiries regarding Garden rental and event packages. Meet with potential clients, give tours of the Garden and event spaces, and conduct follow ups. Provide support during events including working with event planners and conducting walk-throughs, ensuring Garden rules and policies are understood and followed, ensuring load-ins and load-outs do not damage the garden, monitoring guests as needed, and providing on-site troubleshooting to facilitate efficient and satisfactory completion of client requirements. Assist with implementation of Garden events from beginning through completion, ensuring adequate event staffing such as security, bathroom attendant, porters, and bar staffing and acting as on-site contact during events coordinating logistics and ensuring timely execution, and overseeing bar and cleaning staff during events. Skills and Abilities : Two to three years of event management or related experience required Working knowledge of hotel, fine dining, and/or catering Excellent interpersonal, organizational, and customer service skills required Demonstrate problem-solving and communication skills Must be a team player Spanish preferred but not required Core Values : We are looking for someone passionate about supporting the mission of the Garden which promotes environmental enjoyment, stewardship and sustainability through education, the arts, and interaction with the natural world. Working Conditions : Candidate must have the ability to work long and irregular hours. While the schedule varies depending on events and season, candidates must be available to work Monday through Sunday with flexible days and hours but generally Wednesday through Sunday. For event coverage, hours range from 3 pm until an event ends, typically between 10 pm and 1 am. On non-event days, the hours are shorter and more regular depending on the schedule in a particular week and work needed to prepare for upcoming events. Schedule is more regular during summer months/off-season. Physical Requirements : As this position involves helping to set up and break down some events, applicants must be able to meet the following physical requirements: Standing for prolonged periods of time. Lifting, carrying, pushing and pulling up to 50 lbs. Bending, stooping, twisting and reaching overhead. Send resume to growwithus@mbgarden.org An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter"
    },
    {
      "url": "https://climatetoolkit.org/profile/miami-beach-botanical-garden/",
      "text": "Miami Beach Botanical Garden - The Climate Toolkit The Climate Toolkit Connect with Institutions Join the Toolkit Get Our Newsletter About Resources Bioregions Working Groups Webinars Listserv Blog ↓ Skip to Main Content The Climate Toolkit English English Chinese Czech German French Hebrew Hindi Italian Japanese Malayalam Portuguese Sinhala Spanish Swedish Swahili Tamil Ukrainian Connect with Institutions Join the Toolkit Get Our Newsletter About Resources Bioregions Working Groups Webinars Listserv Blog in partnership with Miami Beach Botanical Garden Contact: TL Brown Executive Director tlbrown@mbgarden.org 305-673-7256 Region Served: Miami, Florida Website: mbgarden.org Resources Community Compost Native Garden Gallery Focus Area: Landscapes and Horticulture Completed Planned Landscapes and Horticulture Convert parking spaces into greenspaces to combat the rising temperature in cities Ensure 25% of all lawn/garden maintenance equipment is electric Ensure that 50% pesticides and fertilizers used are not derived from fossil fuels (by end of 2024) Reduce lawn areas by 10% and encourage native plant replacements (by end of 2025) Support reforestation to sequester carbon (by end of 2026) Additional Goals for This Institution Buildings and Energy Engagement Assist visitors in switching to household renewable energy (by end of 2025) Educate visitors on growing organic food (by end of 2025) Educate visitors on sustainable, fossil-free horticulture (by end of 2024) Educate visitors on the impacts of food choices and waste on climate change (by end of 2025) Establish an employee green team to support climate action (by end of 2024) Teach facts and best practices to mitigate and reduce global climate change (by end of 2025) Food Service Investments Research Transportation Waste Water ‹ Melbourne Arboretum Michigan Science Center › Presented by Phipps Conservatory and Botanical Gardens Community Resources and Consultation Architecture 2030 Environment and Culture Partners ICCROM International Living Future Institute One Earth Project Drawdown Public Gardens Sustainability Index Regenesis Institute Rocky Mountain Institute Shepley Bulfinch United Nations Sustainable Development Goals We Are Still In Automatic translation powered by Does the translation help you? Is it accurate? We want your feedback! CONTACT US with questions and comments. Contact Us climatetoolkit@phipps.conservatory.org 412-622-6914 ©          2025 The Climate Toolkit"
    },
    {
      "url": "https://plantly.io/botanical-gardens/beach-botanical-gardens/",
      "text": "Miami Beach Botanical Gardens: Everything You Need To Know Plantly The Plant Marketplace 💚 Shop By Category All Plants Indoor Plants All Indoor Plants 🛁 Room Specific Plants 🥗 Hanging Plants Outdoor Plants All Outdoor Plants 🍀 Bonsai 🌴 Trees & Bushes 🌾 Edible Garden Plants Advanced 💎 Rare Plants 🌿 Hunt By Genus All Alocasia Anthurium Calathea Hoya Philodendron Monstera Peperomia Planting Accessories Deals Of The Day Search More results... Price 0 No products in the cart. Log in Register 💚 Shop By Category All Plants Indoor Plants All Indoor Plants 🛁 Room Specific Plants 🥗 Hanging Plants Outdoor Plants All Outdoor Plants 🍀 Bonsai 🌴 Trees & Bushes 🌾 Edible Garden Plants Advanced 💎 Rare Plants 🌿 Hunt By Genus All Alocasia Anthurium Calathea Hoya Philodendron Monstera Peperomia Planting Accessories Deals Of The Day Plant Care Education Spring Splendor Spring Gardening Activities For Kids Welcoming Spring With These Flowers Spring Gardening Essentials: Tips & Techniques for Healthy Plants How to Protect Your Spring Garden From Pests? 10 Spring Container Garden Ideas Essential Gardening Tasks For Spring Best Of The Best 2024 Lucky Plants That Brings Wealth, Health and Prosperity 13 Best Pet-Friendly Plants for Cats and Dogs The Best Indoor Flowering Plants to Brighten Up Your Living Space Best Temperature and Humidity For Indoor Plants Nikko Blue Hydrangea Care: Get The Best Tips to Keep Your Blue Hydrangea Happy Best Small Flowering Trees You Can Plant In Your Garden The Best Window Plant Shelf: Display Your Plants in a Unique Way How To’s Lawn Aeration Why, When, And How to Do It Complete Guide to Acclimating Plants to a New Environment Complete Guide on How to Repot An Orchid How to Care for Swiss Cheese Plant (Monstera Adansonii) Worm Casting: How To Make And How To Use 🔎 Search Entire Library New Our Community Facebook Group Follow-us on Instagram Plantly on Tik Tok Pin with us on Pinterest Popular Categories 💎 Rare Plants 🐾 Pet-Friendly 👍🏻 Easy-To-Care 🌲 Fast Growing Search More results... Price 🔎 Care Guides Search Search More results... Plant Care , Botanical Gardens Miami Beach Botanical Gardens: Everything You Need To Know December 9, 2022 / by Christina D. Table of Contents Take a break from the South Beach hustle and bustle to enjoy the wonders of nature at the Miami Beach Botanical Garden. Here you can find tranquility throughout the distinct garden areas to explore. Bring the family to enjoy the activities and events throughout the year. About Miami Beach Botanical Garden The City of Miami Beach created the Garden Center in 1962 opposite the Miami Beach Convention Center. At the time, it was a City Park and the garden situated on the Collins Canal. In 1996 a group of Miami Beach residents approached the City Council to create the Miami Beach Botanical Garden Conservancy. It is a non-profit organization that has a mission to restore the gardens. Today it is a public-to-private partnership place owned by the City of Miami Beach. It is a dynamic venue that presents a guided garden and self-guided audio tours and has arts and cultural programs with cultural tours and environmental education for all. Things To Know Before Going To Miami Beach Botanical Garden When visiting the Miami Beach Botanical Garden, general admission is free, so you can easily spend the day with the family at this fabulous place. Still, there are a few things visitors need to know to plan a visit to the Miami Gardens. Hours and Days of Operation The botanical garden, garden center, and Botanical Boutique are open from Tuesday to Sunday at 9 am and close at 5 pm. The garden is closed to visitors on the 4th of July, Thanksgiving, Christmas Day, and New Year’s Day. Admission and Tickets Admission to the garden is free, but fees are payable when particular events occur. You can find metered parking along 19th Street, a parking lot between Meridian Avenue and Convention Center Drive, with standard rates applied. There are parking garages on 17th and 18th Streets with an hourly rate. The hourly rate is $4 for street parking and surface parking lots. The parking garages cost $2 per hour, and you pay $1 per hour for registered Miami residents. To plan your visit, you can download the garden map to follow the routes when you visit the Miami Beach Botanical Garden. Photography Policy You can take souvenir snapshots, commercial photography, personal portraits, and film shoots. All fees must be paid before the photo/filming sessions. For individual shots used for personal photography, weddings, and groups of six people, you need not make reservations, but it helps to call in advance. The rate is $150 per hour, and no dressing rooms are available. You need permits and a reservation for all other photo sessions to film. For these sessions, you can reserve an air-conditioned dressing room in advance. Pets The only pets allowed are service animals for the disabled. Contact Details The Miami Botanical Garden is situated at 2000 Convention Center Drive, Miami Beach, FL 33139, and the contact details are 305.673.PALM (7256). Things To See Inside Miami Beach Botanical Garden Enjoy a relaxing family day at this South Beach facility with plenty to do and see. Japanese Garden You can enjoy the cascading waters in the Zen garden at the Japanese Garden, showcasing collections of different bamboo specimens. A small red bridge crosses two pools rippling over the river rock. Here you can see later pagodas to many other fabulous things. Another great thing is gathering in small groups for photo ops and ceremonies. Edible Garden See the garden’s beauty to see vegetation used in culinary from around the world. The garden contains: Papaya (Carica papaya) Pineapples (Ananas comosus) Pomegranates (Punica granatum) Coffee (Coffea arabica) The common fig (Ficus carica) Jaboticaba (Plinia cauliflora) Brazilian cherry (Eugenia brasiliensis) Macadamia tree (Macadamia ternifolia) Starfruit tree (Averrhoa carambola) Lychee tree (Litchi chinensis) The fantastic thing is that the botanic garden harvests its own food, from fresh herbs and veg/fruit for mixers and events to workshops. You can find the seeds for sale at the gift shop. Orchid Garden In the plant kingdom, orchids are one of the largest flowering families, and each is unique. Explore the Orchid Garden to see how this magnificent plant thrives in the humid climate of South Florida. The orchid remains part of the exotic plants found in the world. Flowering Trees Smell the intoxicating Ylang-ylang tree as you enter the garden. Another tree with an exotic smell is the Frangipani and native Florida plants outdoors like the Fiddlewood. Behind the executive office, you find the White Scented Garden you should not miss. Native Garden Here you have a wild area defined by woodchipped pathways, and densely planted tropical plants, trees, palms to shrubs. The corky stem attracts the state’s butterflies, and you see a lot of water conservation for wildlife in the garden. Palm Garden A symbol of the tropics is the palm tree found throughout Miami Beach. In the Palm Garden. Here you can find over 100 species growing in this section, providing beautiful spaces for you to explore. Water Show The Miami Beach Botanical Garden is a water display with water features found everywhere. You have the refurbished circular fountain outside the offices with the main pond to cascading polite fountain with water lilies. Collins Canal Prominade At the Collins Canal Promenade, you find a walkway with a 352-foot waterfront that flows into the gardens from the northern perimeter. Here you find a shaded area of plans with other trees and wildflowers that attract pollinators. With the pathway, you get access to the iconic cultural institutions of Miami Beach. Wildlife The Miami Beach Botanical Garden is a sanctuary for different wildlife found in the urban area. You see different birds passing through with some permanent residents, like hawks, herons, and egrets. There are a lot of butterflies to moths feeding on the nectar of plants. Even the bird feeders you find displayed in the view. See turtles residing in the ponds to cichlid and koi fish. Rental And Other Interesting Things at The Botanical Garden You will find a nursery with a propagation center to outdoor classrooms at the garden center. You can discuss the right indoor plant to grow in your garden with the experts or pick up a bag of compost. The Botanical Boutique is a lovely little gift shop with jewelry and garden seeds for gift ideas for garden lovers. Here you find gardening tools to other equipment to use at home. Whether it is a t-shirt, baseball cap, or reusable water bottle, you can find it here. While you do not find any eateries inside the garden, you can find a restaurant or snack stand outside the vicinity to enjoy cold drinks and more. Still, you can host an event or visit some of the events. A highlight, except for seeing native plants, paved walkways, and the holocaust memorial, you take yoga classes on a Sunday. Vending machines are also available, but you cannot rent motorized wheelchairs. Still, with the beautiful spaces, and so many butterflies, you can hold a wedding there. Host an event at the canopied terrace with a breathtaking setting and beautiful plants. It is a charming place to watch the sunset. You can also find a small garden to host other events. Frequently Asked Questions Can you picnic at the Miami Beach Botanical Garden? There is a pool area, but food is not allowed within the Miami Beach Botanical Gardens. Are dogs allowed in Miami Beach Botanical Garden? No pets are allowed, only service dogs for the disabled. Is there a Miami Beach Botanical Garden tour? The Miami Beach Botanical Garden hosts tours, and you can find out more about them on their tour page. There are also self-guided tours with audio in different languages and a map available. There are two entrances, but the map you find at the main entrance. Do you get a Miami Beach Botanical Garden Membership? You can get a membership card at the Miami Beach Botanical Garden, providing you with discounts to gift shop items and events. You also get free magazine subscriptions. Whether you want to buy, sell or simply reach out to other plant enthusiasts, Plantly is the right place to be! Tags: Outdoor Plants , botanical gardens Christina D. I'm a born and bred Capetonian but have lived all over South Africa. For now, my home is a farm in eManzana where I'm surrounded by everything I love, nature. I've been a freelance writer since 2014 and love writing about everything especially plants and landscape architecture. My passion is environmental issues, gardening, and my family. Related Articles Plant Care How To Choose The Right Pot For Your Plants June 3, 2024 by Christina D. Plant Care Majesty Palm Care: A Comprehensive Guide June 3, 2024 by Emelyn Plant Care Syngonium Albo Plant Care June 3, 2024 by Nathalie Benipayo Post navigation Previous Post Previous Buffalo Botanical Gardens: Everything You Need To Know Next Post Next Is Winter Bad For Your Plants? 🔎 Care Guides Search Search More results... Latest Featured Products Hoya hindu rope $ 55.00 Status: In stock Live Cayenne Pepper Plant Rated 5.00 out of 5 03 $ 20.00 Status: In stock The Viners $ 7.00 Status: Available on backorder Colocasia 'Pharaoh's Mask' in 4\" pot Rated 5.00 out of 5 03 $ 55.95 $ 95.00 Status: In stock Clear Glass Bottle w/ Stopper | Propagation & Terrarium Accessory $ 5.00 $ 7.00 Status: In stock Glabra Purple Bougainvillea 1 Gal. 20\" Ships Free $ 40.99 Status: In stock (can be backordered) Black Locust Tree - Robinia pseudoacacia - 3 starter plugs $ 29.99 Status: In stock Three Wasabi Plant Starts $ 45.00 Status: In stock Alocasia Odora 'Variegata' plant 'Okinawa Silver' in 3\" pot $ 55.95 $ 97.00 Status: In stock You had me at Aloe unisex T-shirt Rated 5.00 out of 5 03 $ 25.00 – $ 26.00 Price range: $25.00 through $26.00 Status: In stock Girl Face Head Planter white with live succulent $ 25.00 Status: In stock Mammillaria Elongata, Ladyfinger Cactus, 2-4\", Rooted, 1+ Pup $ 12.00 Status: In stock Yellow Live Plant Bougainvillea Vine 6\" Pot Trellis $ 39.99 Status: In stock (can be backordered) Cryptanthus bivittatus Assortment, Earth Star Bromeliad Set, 3 Different Succulents $ 17.99 $ 19.99 Status: In stock surinam cherry tree $ 58.00 Status: In stock The Plant Marketplace™ Customer Care My account Returns & Refund Policy Track Your Order Contact Us Quick Links Independent Sellers The 🌱 Community Recently Viewed ©  2025  Plantly, LLC. All Rights Reserved. Privacy Policy | Terms & Conditions | Accessibility | Do Not Sell My Personal Information Plantly Menu 🔥 Hot Deals Of The Day 🐾 Pet-Friendly 🌵 Indoor Plants 🏡 Outdoor Plants 💎 Rare & Exotic ☘️ Low Maintenance ⛏️ Planting Accessories & Crafts —— 🌞 Newest Care Guides 🔎 Search Care Guide Library 🌱 Join Our Community Facebook Group Instagram TikTok Pinterest 🛎️ Need Help?"
    },
    {
      "url": "https://mbgarden.org/gardenerjobposting/",
      "text": "GardenerJobPosting | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup Gardener (Full or Part-Time) Come join our team… The Garden is Open : Tuesday - Sunday 9am-5pm and for special events Events Membership Gardener   (Full or Part-Time) The Miami Beach Botanical Garden, a living museum, is hiring a Gardener. Job Summary The Gardener position is responsible for general hands-on garden maintenance, assists in ensuring effective care of our garden beds and living collection, and provides support for educational events and programming as needed. This position is part of the Garden/horticulture team and works under the direct supervision of the Horticulture Manager. Minimum Job Requirements, Qualifications & Skills Experience in a professional gardening, landscaping, and/or nursery setting working directly with plants. Knowledgeable and skilled in basic plant physiology and common South Florida landscape plant identification. Able to follow directions and collaborate effectively with other staff members. Ability to work independently or as a team to ensure proper maintenance of all garden areas to desired standards. Comfortable working around and communicating with members of the public. Conducts himself/herself/themself in a professional manner with staff, visitors, contractors and vendors. Flexible to a changing schedule according to the needs of the Garden and scheduled events, including evenings and weekends. Able to communicate effectively verbally and in writing in English. Bilingual (Spanish) preferred. Basic experience using carpenter’s tools such as hammers and drills, as well as landscape tools such as shovels, auger, blowers, pruning clippers and saws. Exhibits a team-oriented, positive, can-do attitude. Essential Duties and Responsibilities General hands-on garden maintenance activities including planting, pruning, weeding, watering, fertilizing, debris removal, blowing, pond cleaning. Report updates on plant health, labeling, and other concerns to Horticulture Manager for records and timely management. Work independently or with team members to maintain all garden areas to desired standards Work with a variety of garden hand tools. Participate and lead educational events or programs as needed (tours, workshops, etc.) Work directly with and assist volunteers as needed on garden-related tasks Assist with nursery production as needed Maintains supply and gardening areas clean and organized as directed. Properly clean and maintain tools. Equal Opportunity Employer Miami Beach Botanical Garden is committed to equity and inclusion and is engaged in a strategic process to ensure that our staff, Board and volunteers reflect our community’s diversity. Miami Beach Botanical Garden welcomes applicants from groups that are underrepresented in cultural organizations and seeks to recruit, develop and retain a diverse workforce. Miami Beach Botanical Garden is an equal opportunity employer. MBBG respects people of all backgrounds and does not discriminate based upon race, religion, color, national origin, ancestry, sex, pregnancy, childbirth, sexual orientation, gender identity, gender expression, age, marital status, familial status, status as a protected veteran, status as an individual with a disability, status as a victim of domestic violence, dating violence or stalking, or other applicable legally protected characteristics protected by law. Working conditions Available to work outside of regular business hours, including evenings and weekends for events and other business needs. Most of the work is conducted outdoors in variable weather conditions including excessive heat, humidity and rain. Physical requirements Standing for prolonged periods of time. Traversing uneven grounds. Lifting, carrying, pushing and pulling up to 50 lbs. Ascending and descending ladders. Bending, stooping, twisting and reaching overhead. Send resume to Riki@mbgarden.org Employment is subject to the successful completion of a background check . An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter"
    },
    {
      "url": "https://www.givemiamiday.org/organization/miamibeachbotanicalgarden",
      "text": "Miami Beach Botanical Garden | Give Miami Day Search Log in Miami Beach Botanical Garden A nonprofit organization Donate Fundraise Share this organization 0% complete $62,000 Goal The Miami Beach Botanical Garden is a serene 3-acre urban oasis, tucked away from the glitz of South Beach. It's a slice of paradise where residents and visitors can commune with nature. The Garden is a living museum that serves as a destination for the public, inviting both young and old, from around the corner or around the world, to view our diverse subtropical collection of rare palm species, orchids and cycads.  The Garden's habitat hosts wildlife including butterflies, migrating birds, fish and turtles. Visiting children especially love chasing the butterflies and feeding the fish. We strive to be a fountainhead of sustainability by offering green living education. We encourage the public to reduce their carbon footprint by participating in our compost initiative where their food scraps are processed into nutrient rich soil. We maintain an apiary to help educate our visitors about the importance of plant pollination. We are firmly committed to minimizing the use of commercial fertilizers that directly impact everyone's water supplies. Educational horticulture seminars and workshops are offered monthly, teaching botanical best practices to all levels of garden lovers, and our annual Earth Day Celebration provides a platform with other environmental nonprofits who want to share their messages. The Garden is a mecca for the cultural arts, serving as a stage for visual and performing artists. A schedule of live musical performances, as well as a monthly rotation of art exhibitions and collaborative programming with other dance, film and art organizations brings a wide audience to experience the beauty of nature in the heart of Miami Beach. The generous support received during Give Miami Day is essential to delivering on our mission. Mission The mission of the Miami Beach Botanical Garden is to promote environmental enjoyment, stewardship and sustainability through education, the arts, and interaction with the natural world. Our garden is a unique, subtropical oasis of beauty and tranquility within an urban setting-a community resource that refreshes, inspires and engages our visitors. Media gallery Organization Data Summary 0 Programs 0 Summary Organization name Miami Beach Botanical Garden Tax id (EIN) 65-0811036 Address 2000 Convention Center Drive Miami Beach, FL 33139 Phone 305-673-7256 Email 0 GrowWithUs@mbgarden.org Website 0 https://mbgarden.org Social Media 0 Show more Manage this organization Donate Home Support Terms & Privacy Give Miami Day is brought to you by The Miami Foundation . Powered by Mightycause Copyright © 2025 The Miami Foundation How can we help? Browse help topics Contact Chat"
    },
    {
      "url": "https://mbgarden.org/weddings/",
      "text": "Weddings | Miami Beach Botanical Garden Facebook Instagram Twitter Member Login Menu Visit Visitor Info Garden Map Parking Info Photography Policy Community Compost Art Exhibitions Events Gardens About Employment People Garden Staff Board of Directors Our Advisory Board Place About the Garden Affiliations REPORTS Support DONATION MEMBERSHIP SPONSORSHIP VOLUNTEER Rent the Garden CORPORATE EVENTS WEDDINGS Newsletter Signup RENT THE GARDEN Corporate Events Weddings OPEN: Tues-Sun, 9am-5pm Events Membership Garden Rental Click here to rent the garden   (Wedding Event) Nothing rivals the secluded charm of Miami Beach Botanical Garden with its lush tropical plants and flowering trees staged in the middle of Miami Beach. It lends itself well as a wedding venue. Day and night the scent of the jasmine, ylang ylang and frangipani lingers in the air.  You and your guests will be surrounded by flowering native plants. There are koi swimming through a pond dappled with sunlight and a Morris Lapidus fountain splashing over coral stone and moss. The garden was orchestrated to create a peaceful serene setting, and in the evening the lights come up creating an enchanting backdrop for a wedding.  We host about 40 weddings a year and the popularity of the garden as an event venue is increasing as more people find out about it. The canopied terrace is a breathtaking setting for a summer party, dance, or reception. The terrace overlooks a 100- year-old banyan tree planted by Carl Fisher. It’s a charming setting for a ceremony. In the evenings, through the canopy of the Banyan tree and sea grape, you can watch a beautiful sunset.  The Miami Beach Botanical Garden allows you to enjoy an informal garden event and the garden setting is easy to accommodate any taste. We invite you explore the possibilities! For more information or a complimentary tour of the garden, you can reach us at 305.673.7256 ext 2020 or email us at Events@mbgarden.org “In my opinion Miami Beach Botanical Garden is one of Miami’s best kept secrets. I had never heard of the Garden until I started planning my wedding. Once my fiancé and I toured the garden, we knew it was where we needed to get married. It was the perfect venue for our vision of our garden wedding. The garden is kept very clean and well maintained. In addition to its being a beautiful property, Maurice, the head of special events, was a pleasure to work with! He always brought a smile to my face, was very responsive, and was helpful throughout the planning process. …If you are looking for an outdoor wedding space, I highly recommend the Miami Beach Botanical Garden.” Posted on Wedding Wire An intimate 3 acre tropical garden on a very big mission! A sustainable urban oasis in the middle of the glitz and neon of South Beach. Welcoming visitors from around the corner to around the world, serving the community as “Miami Beach’s Backyard.” Educating those who meander the pathways, connecting gardens within the Garden which showcase the horticulture collections. 2000 Convention Center Drive Miami Beach, FL 33139 Phone: 305.673.PALM (7256) Facebook Instagram X-twitter"
    }
  ]
}