{
  "fuentes": [
    {
      "url": "https://amprorealty.com/st-lucie-county/fort-pierce-fl-real-estate/meadowood-golf-and-tennis-club/",
      "email": "info@amprorealty.com"
    }
  ],
  "mails": [
    "info@amprorealty.com"
  ],
  "nombre_sitio": "meadowoodgolfandtennis.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://amprorealty.com/st-lucie-county/fort-pierce-fl-real-estate/meadowood-golf-and-tennis-club/",
      "text": "Meadowood Golf and Tennis Club Homes For Sale | Fort Pierce Real Estate Meadowood Golf and Tennis Club Homes For Sale | Fort Pierce Real Estate (772) 334-8600 850 Federal Hwy, #422, Stuart, FL 34994 info@amprorealty.com Buyers SEARCH PROPERTIES Foreclosures and Short Sales Why Choose AmPro Realty Our Services Get Prequalified to Buy a Home Home Buyer’s Guide/Brochure Sellers Submit Your Property For An Estimate Why List and Sell With AmPro Realty What’s My Property Really Worth? Home Selling System Our Seller Services Home Seller’s Guide Renters Commercial Our Company Contact About us Join Our Team / Career Real Estate Services Mission Statement Daily News Submit Property to Sell Search Properties By County Martin County Homes St Lucie County Homes Palm Beach County Homes Home » St Lucie County Real Estate And Homes For Sale » Fort Pierce Homes and Condos For Sale at Luxury Communities in St. Lucie County » Meadowood Golf and Tennis Club Homes For Sale in Fort Pierce Meadowood Golf and Tennis Club Homes For Sale in Fort Pierce Fort Pierce Hutchinson Island Jensen Beach Palm City Port St. Lucie Saint Lucie West Meadowood Golf and Tennis Club Homes For Sale in Fort Pierce The Meadowood Golf and Tennis Club community is located in the beautiful city of Fort Pierce, Florida . See which homes are available for sale including which units were already sold and for how much. Being part of the Meadowood Golf and Tennis Club neighborhood provides the local residents a tropical paradise lifestyle, known only to tourists as the perfect vacation spot. It’s part of the Treasure Coast region of St. Lucie County. In addition to scenic waterfront views of the Treasure Coast, you’ll have outdoor activities such as boating, beautiful beaches, top-notch shopping, and an entertaining nightlife at your fingertips. Come be a part of this hidden gem . Search Meadowood Golf and Tennis Club Homes For Sale in Fort Pierce Available for Sale Available for Rent Enroll to save searches, favorite any listings you like of homes or condos for sale, and choose to receive an email of new listings or price changes for this neighborhood or others. Once you're logged in, you'll be able to make free unlimited searches of properties and areas at your own pace. You'll only need to register once, and can discontinue at any time. Plus, if there’s a specific property you’re interested in or would like more details about the community and local area, you can quickly contact us with the form below, calling our office at 772-334-8600 or by emailing us . One of our agents should reply within minutes. About Meadowood Golf and Tennis Club Homes For Sale in Fort Pierce List View Map View Grid View 9401 Poinciana Court, Fort Pierce, FL 9401 Poinciana Court Fort Pierce, FL $449,000 Lot Size Home Size 1,929 sqft Beds 3 Beds Baths 2 Baths Year Built 1990 View Virtual Tour 9439 Poinciana Court, Fort Pierce, FL 9439 Poinciana Court Fort Pierce, FL $368,000 Lot Size Home Size 1,729 sqft Beds 3 Beds Baths 2 Baths Year Built 1991 View Virtual Tour 2656 Conifer Drive, Fort Pierce, FL 2656 Conifer Drive Fort Pierce, FL $538,000 Lot Size Home Size 2,112 sqft Beds 3 Beds Baths 3 Baths Year Built 2015 View Virtual Tour 3351 Twin Lakes Terrace #206, Fort Pierce, FL 3351 Twin Lakes Terrace #206 Fort Pierce, FL $269,000 Lot Size Home Size 2,026 sqft Beds 3 Beds Baths 2 Baths Year Built 1989 View Virtual Tour See all Real estate matching your search . (all data current as of\r\n    9/10/2025) Listing information deemed reliable but not guaranteed. Read full disclaimer . Buyer Assistance Series Buyer Real Estate Services Get Prequalified To Buy A Guide to Buying What is a Short Sale / Foreclosure Moving Assistance Why Choose AmPro Realty Areas We Serve More Tools for Buyers We Are Your Meadowood Golf and Tennis Club at Fort Pierce Real Estate Experts The real estate listing data relating to Fort Pierce real estate and Meadowood Golf and Tennis Club homes for sale or lease on the AmPro Realty website comes in part from a cooperative data exchange program of the multiple listing service (MLS) in which this real estate Broker participates. The homes in Fort Pierce and Meadowood Golf and Tennis Club neighborhood displayed may not be all the properties in the MLS’s database, or all the properties listed with Brokers participating in the cooperative data exchange program. Fort Pierce real estate and Meadowood Golf and Tennis Club Fort Pierce homes for sale that are listed by Brokers other than this Broker are marked with either the listing Broker’s name or the MLS name or a logo provided by the MLS. The Detailed listing page about such properties includes the name of the listing Brokers. Information provided is thought to be reliable but is not guaranteed to be accurate; you are advised to verify facts that are important to you. No warranties, expressed or implied, are provided for the data herein, or for their use or interpretation by the user. The Florida Association of Realtors and its cooperating MLSs do not create, control or review the property data displayed herein and take no responsibility for the content of such records. Federal law prohibits discrimination on the basis of race, color, religion, sex, handicap, familial status or national origin in the sale, rental or financing of housing. AmPro Realty is an equal housing opportunity luxury real estate broker representing waterfront, golf and country club homes in Meadowood Golf and Tennis Club in Fort Pierce Florida. This information is not verified for authenticity or accuracy and is not guaranteed and may not reflect all real estate activity in the market. All rights reserved. MLS Home Search City Select City... All Fort Pierce Hobe Sound Hutchinson Island Indiantown Jensen Beach Juno Beach Jupiter Jupiter Inlet Colony Lake Park Lantana Manalapan North Palm Beach Palm Beach Gardens Palm Beach Shores Palm City Port Saint Lucie Port Salerno Port St Lucie Riviera Beach Saint Lucie West Sewalls Point Singer Island South Palm Beach Stuart Tequesta Town Of South Palm Beach West Palm Beach Property Type - All property types - Business Commercial Land Multi-Family Rental Residential: All Residential: Condo or Coop Residential: Mobile Home Residential: Single Family Residential: Townhouse Price Range - Min Price - No Minimum Price $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $600,000 $700,000 $800,000 $900,000 $1,000,000 $2,000,000 $2,500,000 $3,000,000 $4,000,000 $5,000,000 - Max Price - No Max $50,000 $100,000 $150,000 $200,000 $250,000 $300,000 $350,000 $400,000 $450,000 $500,000 $600,000 $700,000 $800,000 $900,000 $1,000,000 $1,500,000 $2,000,000 $2,500,000 $3,000,000 $4,000,000 $5,000,000 $10,000,000 Beds 1+ 2+ 3+ 4+ 5+ Baths 1+ 2+ 3+ 4+ 5+ Forclosure/Short Sale - Select Property Type - Foreclosure Short sale Both Home size (sq. ft.) › Lot Size (sq. ft.) › Days Listed › Year Built › Property Status Active Conditional Pending Sold - All Property Statuses - Bank-owned / Foreclosure Short Sale Listings Advanced Search Fort Piece Communities Aaron Lees Map Aetna Park Alamanda Vista Altamira at Hutchinson Island Amy Anna Park Anglevilla Ankona Aquanique at Hutchinson Island Assessors Map Atlantic View Beach Club at Hutchinson Island Atrium at Hutchinson Island Augusta Avalon Beach Club at Hutchinson Island Avon Manor BS Harris Barclay Beach Club at Hutchinson Island Beach Estates at Hutchinson Island Beach Villas at Hutchinson Island Beachcomber at Hutchinson Island Beachtree at Ocean Village on Hutchinson Island Bel Aire Estates Bent Creek Biltmore Park Blakely Boardwalk at Hutchinson Island Breakers Landing at Hutchinson Island Briargate Bryn Mawr at Hutchinson Island Bunche Park Capstan at Ocean Village on Hutchinson Island Cardinal Glades Cardinal Glen Carlton Villas at Hutchinson Island Carolwood Terrace Casa Caprona Catamaran at Ocean Village on Hutchinson Island Celebration Pointe Christensen Acres Clydesdale Heights Coastal Coves at Hutchinson Island Cobbs Park Coconut Cove Marina at Hutchinson Island Colonel HD Goforth Colonnades at Hutchinson Island Commodore at the Colonnades on Hutchinson Island Coral Cluster at Ocean Village on Hutchinson Island Coral Cove Beach on Hutchinson Island Corso Courts Cortez Estates Cortez Park Country Living Estates Cramers Addition Crossed Anchors Cristelle Cay at Hutchinson Island Dark Hammock De Fina Deal TM Prop Doiran Dreamland Park Driftwood Manor Edgewood Acres Edgewood Park Eldorado Eleven Mile Creek Emancipation Park Englewood Park Enquist Estates of Longwood Executive Estates Fairlawn Fairview Park Fleetwood Acres Florence M. Hatchers Floriana Park Fort Pierce Beach at Hutchinson Island Fort Pierce Gardens Fort Pierce Shores at Hutchinson Island Frambach Franklin Park Garden City Farms Garden Villas of Gator Trace Gator Trace Golden Ponds Golf Lodges North at Ocean Village on Hutchinson Island Golf Lodges South at Ocean Village on Hutchinson Island Golf Lake Villas Golf Villas at Ocean Village on Hutchinson Island Golfview Grand Isle at Hutchinson Island Grandview Gardens Green Acres Greenwood Grove Subdivision Gulfstream Villas at Hutchinson Island Happy Land Harbour Cove at Hutchinson Island Harbour Isle at Hutchinson Island Harmony Estates Harmony Heights Hartman Heights Hibiscus by the Sea at Hutchinson Island Hibiscus Park Hidden Acres Hidden Pines Estates High Point Hillside Hillview Hole in One Circle at Meadowood Holiday Pines Hunts Indian Hills Estates Indian Pines Village Indian River Estates Indian River Place Inlet House Inlet Palms at Hutchinson Island Irene Plaza Island House Ixoria Gardens Jay Gardens Jellisons Jennings Cove at Hutchinson Island JO Fries Key Colony Keystone Heights Killer and Demmers Kiwi Condominiums on Hutchinson Island Koblegard La Entrada Del Mar on Hutchinson Island Lake Shore Village at Meadowood Lakes at the Savannahs Lakeshore at the Sands on Hutchinson Island Lakeview at the Sands on Hutchinson Island Lakewood Park Lawnwood Lincoln Park Longwood Village Lost Tree Estates Luke's Lots Magnolia Park Magnolia Square Maravilla Mariner Bay at Hutchinson Island Marion Heights McCarty Court McNurlen Farms Meadowood Golf and Tennis Club Merriweather Park Model Land Monte Carlo Country Club at Meadowood Morningside at Palm Breezes Club New Century at the Gator Trace Country Club Oak Alley Oakland Park Ocean Harbour North at Hutchinson Island Ocean Harbour South at Hutchinson Island Ocean Harbour Tower at Hutchinson Island Ocean Harbour Villas at Hutchinson Island Oceanhouse at Ocean Village on Hutchinson Island Ocean Pearl at Hutchinson Island Ocean Resorts at Hutchinson Island Ocean View Subdivision Replat Holley and Morgan at Hutchinson Island Ocean Village at Hutchinson Island Ocean Villas at Ocean Village on Hutchinson Island Oceanique Oceanfront at Hutchinson Island Orange Blossom Estates Orange Park Osceola Estates Palm Breezes Club Palm Grove Palm Haven at Hutchinson Islabnd Palm Lakes Gardens Palm Vista Park Paradise Park Park Trail Acres Paragon at Hutchinson Island Parkway Groves Parkway Place Patti Rizzo Plaza at Meadowood Pinecrest Estates Pinewood Pioneer Estates Pioneer Park Plantation Manor Pleasant View Ponce De Leon Park Pony Pines Portofino Shores Preserve at Savannahs Quail Acres Quail Run Village at Meadowood Queen's Cove at Hutchinson Island RA Saeger’s Raintree Forest Regina Palms Renaissance on the River Rinehart Rio Vista River Branch Estates River Gates Estates River Hammock River Oaks River Woods Rivers Edge at Hutchinson Island Riverdale Yacht Club Riverpointe at the Sands on Hutchinson Island Riverside Harbour Riverside at the Sands on Hutchinson Island Riverview Manor Riverwalk at the Sands on Hutchinson Island Roarks Grove Ruhlman Russell Estates San Lucie Plaza at Casa Caprona San Lucie Plaza Homes Sands at Lakeview Circle on Hutchinson Island Sands on the Ocean on Hutchinson Island Sandalwood Savannahs Sea Palms on Hutchinson Island Sea Pointe Towers on Hutchinson Island Sea Tern on Hutchinson Island Seabreeze at Atlantic View Beach Club on Hutchinson Island Seascape at Ocean Village on Hutchinson Island Seaward at Atlantic View Beach Club on Hutchinson Island Sheraton Plaza Silver Heights Silver Lake Park Sindons Southern Courtyard Southern Oak Estates Southern Pines Southern View Southpointe at Ocean Village on Hutchinson Island Spanish Lakes Country Club Spanish Lakes Fairways St. James Park Stones Throw Sunrise Estates Sunrise Park Sunrise Terrace Sunset Park Sunshower Subdivision Surfside at Hutchinson Island Tarpon Flats at Hutchinson Island Thumb Point at Hutchinson Island Tiara Towers at Hutchinson Island Treasure Cove Dunes at Hutchinson Island Tropical Acres Tropical Beach at Hutchinson Island Tropical Isles Trowbridge Acres Visions at Hutchinson Island Watersong at Hutchinson Island Waterstone Whimbrel Landing at Hutchinson Island White City Winding Creek About Us We provide a Personalized Family Approach to Real Estate like no other. AmPro Realty is recognized as one of America’s top growing real estate companies. We are an independently owned, full-service real estate brokerage firm covering communities throughout the beautiful Palm Beach County and Treasure Coast of Florida. By offering great style, quality and unprecedented value, it's easy to see that at AmPro Realty, it's all about you! More Need Real Estate Advice This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. RECEIVE QUICK ACCESS ON NEW LISTINGS AND PRICE CUTS Save your searches, favorite any listings of homes or condos for sale, and even choose to receive an email of new listings or price changes for this neighborhood or other communities. Enroll Recent Posts: Our Blog Private Dock Communities in Martin County, FL and Northern Palm Beach County, FL What factors influence homeowners insurance rates in Stuart and Palm City, FL Homeowner’s Insurance in Palm Beach County and the Treasure Coast: A Comprehensive Guide Buying a Home with Bitcoin in Palm Beach Gardens and Jupiter, FL: A New Era in Real Estate Top Real Estate Trends for Summer 2024: What Homebuyers and Sellers Need to Know Careers Our Services Foreclosures and Short Sales Privacy Policy Terms Of Use Submit Property To Sell Have a Question? Browse our FAQs , or feel free to contact us at info@amprorealty.com NEED EXPERT REAL ESTATE ADVICE? Contact Us 850 NW Federal Highway, Suite 422, Stuart, FL 34994 (772) 334-8600 info@amprorealty.com FLORIDA TREASURE COAST & PALM BEACH COUNTY REAL ESTATE COVERAGE AREAS Martin County Hobe Sound Hutchinson Island Indiantown Jensen Beach Jupiter Island Palm City Port Salerno Sewall's Point Stuart Palm Beach County Juno Beach Jupiter Jupiter Inlet Beach Colony North Palm Beach Palm Beach Gardens Palm Beach Shores Tequesta Singer Island West Palm Beach St. Lucie County Fort Pierce Hutchinson Island Jensen Beach Palm City Port St. Lucie St. Lucie West SEARCH  TREASURE COAST REAL ESTATE By City By Map By School By Zip Code By Neighborhood By Foreclosures By Builder By MLS ID By City By Map By School By Zip Code By Neighborhood By Foreclosures By Builder By MLS ID Follow Us & Find Out First Real Estate Daily News July 2024 June 2024 June 2023 May 2023 June 2022 March 2021 For full details and disclosure please visit our disclaimer .  Copyright © 2004 - 2023 AmPro Realty, Inc. All Rights Reserved.  View Our Listings Site Map . Offering that states 2% or $6,000 of purchase price shall be based upon size of property, market conditions, and all at broker's discretion."
    }
  ]
}