{
  "fuentes": [
    {
      "url": "https://www.heritage-christian.org/contact-us/contactus.cfm",
      "email": "sandy@heritage-christian.org"
    },
    {
      "url": "https://www.lrsd.net/_ci/p/39215",
      "email": "fancybox_loading@2x.gif"
    },
    {
      "url": "https://www.lrsd.net/_ci/p/39215",
      "email": "fancybox_sprite@2x.png"
    },
    {
      "url": "https://unfspinnaker.com/87024/features/hispanic-heritage-month-highlight-maria-mestre-de-los-dolores-andreu/",
      "email": "editor@unfspinnaker.com"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.staugustine.com/story/news/local/2014/11/17/oldest-wooden-schoolhouse-educates-visitors-menorcan-heritage/16095155007/",
      "email": "peter.willott@staugustine.com"
    },
    {
      "url": "https://heritageshops.ca/contact-us/",
      "email": "dms@historicsites.ca"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration-2/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration-2/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://centurionbanquethall.com/contact/",
      "email": "info@centurionbanquethall.com"
    },
    {
      "url": "https://houseofmercyministries.net/staff-page/",
      "email": "office@hom.church"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration-3/",
      "email": "x@2x.png"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration-3/",
      "email": "sjcc@historiccoastculture.com"
    },
    {
      "url": "https://www.heritagetile.com/contactus",
      "email": "info@heritagetile.com"
    },
    {
      "url": "https://www.heritagetile.com/contactus",
      "email": "showroom@heritagetile.com"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "email": "dj_convoy@lazonamuerta.blog"
    },
    {
      "url": "https://menorcansociety.net/publications/",
      "email": "rustyhall@me.com"
    }
  ],
  "mails": [
    "dj_convoy@lazonamuerta.blog",
    "dms@historicsites.ca",
    "editor@unfspinnaker.com",
    "fancybox_loading@2x.gif",
    "fancybox_sprite@2x.png",
    "info@centurionbanquethall.com",
    "info@heritagetile.com",
    "info@scibpaints.com",
    "office@hom.church",
    "peter.willott@staugustine.com",
    "rustyhall@me.com",
    "sandy@heritage-christian.org",
    "showroom@heritagetile.com",
    "sjcc@historiccoastculture.com",
    "x@2x.png"
  ],
  "nombre_sitio": "menorcansociety.net",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.heritage-christian.org/contact-us/contactus.cfm",
      "text": "Contact Us - Heritage Christian School Skip Navigation Educating Students to Impact the World for Christ Donate Faculty Login Parent/Student Login Navigation About Us About Us Why Christian Education? Mission Statement Statement of Faith Faculty and Staff Board of Directors How To Become A Christian Academic Calendar Support HCS Admissions Admissions Admissions Requirements Admissions Procedures Re-Enrollment Procedures Scholarships Academics Christ Centered Academics Elementary Secondary Part Time Students Library Home Library Links Library Catalog Accelerated Reader Standardized Testing Student Life Student Life Interactive Calendar Athletics MCAA Tournament Volleyball Soccer Basketball Track Ultimate Frisbee Athletic Forms Clubs and Performing Arts Chapel Mission Trip Music Festival Parents Information for Parents Academic Calendar Parents Web Parents Informed School Hours Attendance Reporting Email Hot Lunch Falcon Wear School Forms 2025-26 Field Trip Permission Slip School Handbook Parent Teacher Fellowship Booster Club Fundraisers Volunteering Contact Us Contact Us Map/Directions Facility Rental Forms Give Employment Contact Us Contact Us Map/Directions Facility Rental Forms Give Employment How to Reach Us Mailing Address: Heritage Christian School 4310 Durston Road Bozeman, MT 59718 406-587-9311 Fax 406-587-1838 Faculty and Staff Sort By Name Title Group Name Title Group Contact Berry, Michael Secondary Teacher Secondary Teachers Bittner, Johnna Pre-Kinder Teacher Elementary Teachers Black, Rachelle Secondary Teacher Secondary Teachers Blackmore, Kyle Secondary Teacher Administration, Secondary Teachers, Specials Teachers Burdick, Darice 5th Grade Teacher Elementary Teachers Cummins, Jay Administrator Administration, Secondary Teachers Cummins, Mary Librarian Elementary Teachers, Secondary Teachers, Specials Teachers Frazer, Drew Secondary Teacher Secondary Teachers, Specials Teachers 303-709-1269 Frazer, Stacy Secondary Teacher Secondary Teachers Gee, Anne Secondary Teacher Secondary Teachers 406-587-9311 Gilbert, Katie 1st Grade Teacher Elementary Teachers Gillis, Rick Secondary Teacher Secondary Teachers 406-587-9311 Goede, Gerry Financial Administrator Administration 406-587-9311 ext. 202 Gossack, Ray Secondary Teacher Secondary Teachers 406-587-9311 ext. 223 Gossack, Stephanie Elementary Principal Administration 406-587-9311 ext. 212 Graham, Jennifer Admissions Administrator Administration Heupel, Karri Teacher/Volleyball Coach Secondary Teachers 406-580-7808 Heys, Landa Secondary Teacher Elementary Teachers, Secondary Teachers, Specials Teachers 406-587-9311 Ihasz, MaryLou Instructor Elementary Teachers Kimmel, Jon Secondary Teacher Secondary Teachers Kneeland, Linda Secondary Teacher Secondary Teachers 406-587-9311 Moss, Shannon Office Assistant Administration Neiminen, Judy Pre Kinder/Kinder Aide Elementary Teachers 406-587-9311 Nuss, Michelle Financial Administrator Administration 406-587-9311 ext. 204 Rasmussen, John Secondary Teacher/Athletic Director Secondary Teachers 406-587-9311 ext. 224 Rumsey, Holly 2nd Grade Teacher Elementary Teachers Schwartz, Rhianna Secondary Teacher Secondary Teachers Taylor, Emma 4th Grade Teacher Elementary Teachers Walker, Sandy Office Manager Administration 406-587-9311 ext. 207 Washington, Taylor 3rd Grade Teacher Elementary Teachers Wielenga, Kimberly Music Teacher Elementary Teachers, Secondary Teachers, Specials Teachers 406-587-9311 Wolfe, Leslie Kindergarten Teacher Elementary Teachers Yakos, Kari Secondary Teacher Secondary Teachers 406-587-9311 4310 Durston Rd Bozeman, MT 59718 Phone: 406.587.9311 Fax: 406.587.1838 Email Us | Directions About Us Admissions Academics Student Life Parents Contact Us"
    },
    {
      "url": "https://www.lrsd.net/_ci/p/39215",
      "text": "Staff Announcements April 2024 Louis Riel School Division Javascript must be enabled for the correct page display Thriving Learners ∞ Flourishing Communities | Des apprenants épanouis ∞ Des communautés florissantes | Gegwe-gikenjigewaad ∞ Mamino-ayaang Eyaang Afrikaans Albania Arabic Armenian Azerbaijani Basque Belarusia Bengali Bosnian Bulgarian Catalan Cebuano Chinese (Simplifield) Chinese (Traditional) Croatian Czech Danish Dutch Esperanto Estonian Filipino Finnish French Galician Georgia German Greek Gujarati Haitian Creola Hebrew Hindi Hmong Hungarian Icelandic Indonesian Irish Italian Japanese Javanese Kannada Khmer Korean Lao Latin Latvian Lithuanian Macedonian Malay Maltese Marathi Norwegian Persian Polish Portuguese Romanian Russian Serbian Slovak Slovenian Spanish Swahili Swedish Tamil Telugy Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Sign In Staff/Student Sign In Parent/Guardian Sign In MENU CLOSE About drop down CiTest240628767 Weather Station drop down CiTest240628767 CiTest240628770 Accesibility drop down CiTest240628767 Organizational Chart drop down CiTest240628767 Louis Riel School Division 900 St. Mary's Road Winnipeg, MB, R2M 3R3 | Phone: (204) 257-7827 Staff Announcements April 2024 April 19, 2024 I would like to share the following information which was presented at the Public Board Meeting on April 16, 2024: Patrice Chartrand will be appointed as principal of École Henri-Bergeron, effective Aug. 1, 2024 Jason Dubeau will be appointed as principal of École Sage Creek School, effective Aug. 1, 2024 Damien Lemoine will be appointed as vice-principal of Collège Béliveau, effective Aug. 1, 2024 Shannon Baxter will be appointed as vice-principal of École George-McDowell, effective Aug. 1, 2024 Ida Azevedo will be transferred as vice-principal to École Guyot, effective Aug. 1, 2024 Michelle Kennedy will be transferred as vice-principal to École Sage Creek School, effective Aug. 1, 2024 Paulette Sabourin will be transferred as vice-principal to École Van Belleghem, effective Aug. 1, 2024 Mélanie Bisson will be appointed as vice-principal of École Henri-Bergeron, effective Aug. 1, 2024 Joy Perrott will be appointed as vice-principal of École Marie-Anne-Gaboury, effective Aug. 1, 2024 Karlene Fontaine will be appointed as vice-principal of École St. Germain, effective Aug. 1, 2024 On behalf of the Board of Trustees and the Senior Leadership Team, I wish our colleagues the best in their new roles. Christian Michalik CONTACT THE SCHOOL DIVISION Louis Riel School Division 900 St. Mary's Road Winnipeg, MB, R2M 3R3 Phone: (204) 257-7827 CONTACT US LRSD CONNECT APP Download our app and stay connected with up-to-date notifications, information and news from your school and teachers on your mobile device. © 2024 Louis Riel School Division. All rights reserved. Privacy Policy Site Map Copyright - Fair Dealing Guidelines"
    },
    {
      "url": "https://unfspinnaker.com/87024/features/hispanic-heritage-month-highlight-maria-mestre-de-los-dolores-andreu/",
      "text": "Hispanic Heritage Month Highlight: Maria Mestre de los Dolores Andreu | UNF Spinnaker Skip to Content UNF Spinnaker Facebook Instagram Spotify LinkedIn YouTube News University Student Government Police Beat Features Community Events Sports Basketball Softball Baseball Soccer Volleyball TV Magazine Freshman Center Opinions Letters Opinions Reviews From the Editor About Newsroom Staff Get Involved Advertise Newsletters News Tips Donate Spinnaker Radio More Search this site Submit Search Open Navigation Menu UNF Spinnaker About Staff Get Involved Donate Advertise Newsletters News Tips News University Student Government Police Beat Sports Basketball Volleyball Soccer Baseball Softball Features Community Events Opinions Letter to the Editor Opinions Reviews Letter from the Editor Freshman Center Magazine TV Spinnaker Radio More UNF Spinnaker Open Search Bar Search this site Submit Search UNF Spinnaker Open Navigation Menu UNF Spinnaker About Staff Get Involved Donate Advertise Newsletters News Tips News University Student Government Police Beat Sports Basketball Volleyball Soccer Baseball Softball Features Community Events Opinions Letter to the Editor Opinions Reviews Letter from the Editor Freshman Center Magazine TV Spinnaker Radio More Search this site Submit Search Facebook Instagram Spotify LinkedIn YouTube Trending 1 Professor & former university trustee takes legal action against UNF 2 ‘It’s okay’: Student thoughts on food court’s new Halal Shack 3 UNF announces it will offer AI certificate program for free through end of 2025 4 New soccer stadium, basketball practice facility, and expanded arena: A detailed look at UNF’s athletic master plan 5 UNF students report parking challenges as fall semester begins, Parking Services responds Latest Professor & former university trustee takes legal action against UNF Madelyn Schneider , Editor-in-Chief UNF alum Kasper Hjulmand announced as head coach of German soccer club Bayer Leverkusen Daniel Cimino , Sports Reporter UNF students report parking challenges as fall semester begins, Parking Services responds Mindy McLarty , Managing Editor UNF announces it will offer AI certificate program for free through end of 2025 Sasha Koresh , News Editor SG committees approve appointments, funding requests, September Osprey Voice topic Mindy McLarty , Managing Editor Categories: Features Holiday Column Latest Stories Hispanic Heritage Month Highlight: Maria Mestre de los Dolores Andreu Aloe Suarez , Reporter | Sep 24, 2020 St. Augustine is one of the oldest cities in the United States and is a treasure trove of Spanish history. In honor of Hispanic Heritage Month, the Spinnaker is honoring the first Hispanic and female keeper of the St. Augustine Lighthouse, Maria Mestre de los Dolores Andreu. De los Dolores Andreu, along with her husband Juan Andreu, is a descendant of Menorcan immigrants who arrived at New Smyrna in 1768. The immigrants came from the Spanish island of Minorca as indentured servants to Dr. Andrew Turnbull on his indigo plantation. Graphic by Jill Responte After reports of mistreatment and a petition to the British government, the Menorcan people moved to St. Augustine for better employment. They were hired as maritime dock workers, especially as lighthouse keepers. After the death of Juan Andreu, the first male Hispanic-American worker, De los Dolores Andreu was appointed by the US government in 1859 to serve as the official keeper of the nicknamed Old Spanish Watchtower until the American Civil War. During that time, she provided for her family of her children on a yearly lighthouse keeper salary of about $400. She was faithful to commanding and guarding the first federal shore installation until the Union peacefully captured St. Augustine. De los Dolores Andreu then moved to Georgia to be closer to family. Not much is known afterward; however, she has made history for Hispanics and women across the U.S.. The US Coast Guard acknowledges de los Dolores Andreu as the first female Hispanic American worker to serve in their military service. Stick around for more highlights about other Hispanic leaders throughout the northeast parts of Florida. __ For more information or news tips, or if you see an error in this story or have any compliments or concerns, contact editor@unfspinnaker.com . View Story Comments 0 Like This Story Share on Facebook Email this Story Print this Story Leave a Comment More to Discover More in Features ‘It’s okay’: Student thoughts on food court’s new Halal Shack UNF freshmen find first week of college easier than expected Is The Flats at UNF right for you? Here’s what to know Getting around UNF: Your guide to the Osprey Connector shuttle system More in Holiday Column Column: Why News Year’s resolutions need to be left in 2022 Jumping back into finals after Thanksgiving Break How to avoid awkward conversations during Thanksgiving The significance of Rosh Hashanah More in Latest Stories Hurricane Milton upgraded to major hurricane - live updates The Red Zone is approaching: a higher-risk time of year for sexual assaults For surfers, skaters and go-go dancers, a night with Seagate Surf, soap and rock & roll, an interview with Yaupon Holly About the Contributor Aloe Suarez UNF Spinnaker UNF's #1 Student-Run News Source Search this site Submit Search About Staff Advertise Donate Social Media Instagram Facebook Linkedin Subscribe Newsletter YouTube Spotify News Tips Volunteer Letter to the Editor UNF Spinnaker • © 2025  • FLEX Pro WordPress Theme by SNO • Log in Comments (0) Spinnaker intends for this area to be used to foster healthy, thought-provoking discussion. Comments are expected to adhere to our standards and to be respectful and constructive. As such, we do not permit the use of profanity, foul language, personal attacks, slurs, defamation, or the use of language that might be interpreted as libelous. Comments are reviewed and will be removed if they do not adhere to these standards. Spinnaker does not allow anonymous comments, and Spinnaker requires a valid email address. The email address will not be displayed but will be used to confirm your comments. Share your thoughts... All Sort: Newest Cancel reply Your email address will not be published. Required fields are marked * Comment * Spam Control Field. Verification Field. Name * Email * Close Close Modal Window Close"
    },
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.staugustine.com/story/news/local/2014/11/17/oldest-wooden-schoolhouse-educates-visitors-menorcan-heritage/16095155007/",
      "text": "Where History Lives: Oldest Wooden Schoolhouse educates visitors on Menorcan heritage News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals LOCAL Where History Lives: Oldest Wooden Schoolhouse educates visitors on Menorcan heritage Sue Bjorkman In the 1800s, students in St. Augustine attending the wooden schoolhouse on St. George St. brought their own wood to stoke the fire and paid about 12 cents a day in tuition. The Oldest Wooden School House gives visitors an insiders glimpse of how children were educated, but this historic landmark also tells a deeper tale about the students' Menorcan heritage. Elaine Fraser, owner and executive director, said they want to tell the story of how the Menorcans transformed what was essentially a military outpost into the thriving city of St. Augustine. \"Buildings like this are preserved so they can uniquely tell a story of the people who used them,\" Fraser said. History is in the Fraser family genes. She is the third generation of family owners of this structure. Menorcans,the largest group of immigrants to came to America in one group at one time, arrived first in New Smyrna to work as indentured servants in 1768. Of the original 1,403 immigrants from this Spanish island, only 600 survived to settle in St. Augustine in 1777. The old school is the Menorcan home of Juan Genoply, a leader of New Smyrna colonists responsible for helping them gain freedom. It has become the symbol of their hard work and perseverance, Fraser said. \"The Menorcans were the true craftsmen of the area. St. Augustine couldn't have survived without them. They truly are the authentic history.\" This holiday season the oldest school is celebrating in traditional Menorcan style. They are also hosting a 150th class reunion on Dec. 19 for descendants of the last graduating class of 1864. Graduates of this class included Benjamin Pacetti, Victoriano Capo, Evelina Manucy, Dora Bennett, Tony Capo, John Manucy, Ferdinand Ximanies, Jane Manucy and Ernest Olivero. A Menorcan Christmas Christmas centered on family and religion and gifts were usually hand-made. \"Any commodity, anything they could make or grow would be considered a gift,\" said Fraser. Starting on Nov. 29 in the old school gardens, eight \"Family Trees,\" adorned with wood ornaments with pictures of Menorcan descendants will be displayed. Fraser said Menorcans would decorate their Christmas trees with pictures or names of people they left behind. \"They also made ornaments of oyster shells and ribbons and angels. They used to go around the neighborhood and sing carols. If the people inside liked the songs they would give them goodies and treats,\" she added. The holiday meal would usually be pilau, a dish made with rice and fish or wild game or whatever they had on hand, complemented with Menorcan clam chowder, breads, cheeses and olives. All about authenticity The cedar and Cyprus wood structure with a coquina chimney and rough, tabby floor is considered the oldest surviving frame structure in St.Augustine. As its name proclaims, it is also the oldest wooden school building in the U.S. Very little changes have been made to this 18th century building, but it has been used in different ways. According to records, it became a school in 1788. Because both boys and girls were educated in one classroom, it is also the nation's first co-ed classroom. In the 1920s it was used as a tea house and gift shop. In 1936 it was purchased by Walter B. Fraser, also the owner of the Ponce de Leon Fountain of Youth attraction, and converted to a museum of a restored 1864 school. In the 1930s. words like \"first\" and \"oldest\" were descriptions bandied about perhaps too freely in St.Augustine, causing a push for real authentication. \"People began to believe we were making things up,\" Fraser said. The city put together a fact-finding commission to research and authenticate many historic buildings, but Walter B. Fraser also brought in a national commission. \"He had people come in that could really authenticate the dates from documents and other findings. The schoolhouse passed the test,\" Fraser said. Now it's her responsibility to keep it real. \"It's lovingly preserved,\" Fraser said. \"There's a difference between preservation and renovation. All we are doing is preserving. We are not trying to change anything.\" They have sprinklers, lights and security, but other than that it is all natural, she said. The school's parlor is furnished with antiques belonging to the Fraser family from the 1700s-1800s. They even have the desk Walter B. Fraser used when he was a state senator in 1944-48. \"We want to give the feel for what it was like to go to school back then, but also what it was like to live here,\" Fraser said. School days School groups from North Carolina to Alabama to all over Florida regularly visit the attraction. In the 1970s they added a small classroom of animatronic pupils from Sally Corporation in Jacksonville, including a talking teacher and student. The rest of the story is told by Jerry Hall, operations manager, who dresses up in 1820s clothing to lead tours. Hall said it cost around 12 cents a day for children to attend school in the 18th century. If they couldn't afford this, bartering with food or crafted items was accepted. \"Attendance was often interupted when the mullet were running or during harvest. If a family had many children, they might choose to send just one child to school and teach the others trades at home,\" Hall said. Grads remember when The last graduating class of 1864 held a reunion in 1931. The Evening Record reported the nine graduates were filmed by Eastman Kodak Company for a national educational film, \"The Old and New South.\" The graduates, then in their 80s, recalled when the schoolmaster Genoply went to Gainesville as a sergeant in the Civil War. Janie Manucy recalled being punished by being placed in the little closet or \"dungeon\" under the stairs. Each graduate wrote a letter to authenticate their time at the old school. Victoriano Capo, 80 at the time, said he attended in 1861 and was taught by Miss Mary Darling and Mr. John Darling. \"I consider this to be the oldest frame house in St. Augustine. There were no desks. We used chairs and sometimes sat on the floor of coquina facing the fireplace with our book in the teacher's lap,\" Capo wrote. ** If you go What: Oldest Wooden School- house - A Traditional Menorcan Christmas When: Nov. 22-Jan. 3 Where: 14 St. George St. Admission: $4.95 adults, $3.95 children 6-12; under 6 are free Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Buy and Sell Help Center Subscriber Guide Manage Account My Print Account Legal Notices Give Feedback Licensing & Reprints Subscribe Today Newsletters Facebook X Instagram eNewspaper Newspapers in Education Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.staugustine.com. All rights reserved."
    },
    {
      "url": "https://heritageshops.ca/contact-us/",
      "text": "Contact Us Information - Get in Touch Today | Heritage Shops NL Blog Contact Us Home shop Blog Local Makers Contact us Login / Register Search Wishlist 0 items / $ 0.00 Menu 0 items $ 0.00 HTML iFrame Generator FREQUENTLY ASKED QUESTIONS Contact Us Information Will I receive the same product that I see in the picture? Yes, we strive to ensure that the product images on our website accurately represent the actual products you will receive. However, please note that there may be slight variations in color or appearance due to factors such as lighting conditions or monitor settings. Rest assured, we make every effort to provide an accurate representation of our products. Where can I view my sales receipt? Once you have completed your purchase, you will receive an email containing your sales receipt. This email will be sent to the email address you provided during the checkout process. Additionally, you can also view your sales receipt within your account on our website. Simply log in to your account and navigate to the \"Order History\" or \"My Purchases\" section, where you will be able to find and download your sales receipt. How can I return an item? We understand that sometimes you may need to return an item. To initiate a return, please follow the steps below: Contact our customer service team: Reach out to our customer service team either by phone or email to inform them about your intention to return the item. Provide them with your order details, including the order number and the specific item you wish to return. Review our return policy: Our return policy outlines the conditions and time frame within which returns are accepted. Make sure you familiarize yourself with this policy to ensure your return is eligible. Package the item securely: Place the item back in its original packaging, ensuring it is securely packed to avoid any damage during transit. Include all the original accessories, tags, and documentation that came with the item. Ship the item back to us: Use a reputable shipping service to return the item to our designated address. We recommend using a trackable shipping method to ensure the item reaches us safely. You will be responsible for the return shipping costs unless otherwise specified in our return policy. Await confirmation and refund: Once we receive the returned item and verify its condition, we will process your refund according to our refund policy. This may include refunding the purchase price, minus any applicable restocking fees or shipping charges. Please note that certain items may be non-returnable or subject to specific return conditions, such as personalized or customized products. It's important to review our return policy and contact our customer service team for further assistance and guidance throughout the return process. Will you restock items indicated as “out of stock?” We understand that it can be disappointing to find an item marked as out of stock. We strive to restock our inventory regularly to ensure a wide selection of products for our customers. However, the availability of restocking depends on various factors, including supplier availability, production schedules, and demand for the product. To stay updated on the availability of out-of-stock items, we recommend the following: Sign up for notifications: On the product page, you may find an option to sign up for notifications when the item is back in stock. By providing your email address, you will receive an alert as soon as the item becomes available again. Check our website regularly: We regularly update our website with new stock and restocked items. Keep an eye on the product page or browse through our inventory to see if the item you are interested in has been restocked. Contact our customer service: If you have a specific inquiry about a particular item or need assistance with availability, feel free to reach out to our customer service team. They will be happy to provide you with the most up-to-date information and assist you in any way they can. While we strive to restock popular items, please note that there may be instances where certain products are discontinued or not available for restocking due to various reasons. However, we are always looking to enhance our product offerings, so we encourage you to explore alternative options or similar items that may meet your needs. We appreciate your understanding and patience as we work to ensure a diverse and well-stocked inventory for our valued customers. Where can I ship my order? We offer several options for shipping your order to ensure convenience and flexibility. Here are the available shipping methods: In-store pickup: If you prefer to collect your items in person, you can choose to pick up your order at only at our store at 158 Duckworth St., St. John's, NL. Simply select the \"In-store Pickup\" option during the checkout process, and we will notify you when your order is ready for pickup. This is a great option if you are located near one of our store locations and want to save on shipping costs. Local delivery: For customers in the local area (St. John's, Mount Pearl), we provide a convenient delivery service for a nominal fee of $5. Our team will deliver your order directly to your specified address. This option allows for faster delivery and ensures your items reach you safely. Shipping via third-party carrier: If you are located outside of our local area or prefer to use a shipping carrier of your choice, you can select this option during checkout. We partner with reliable shipping companies to ensure your order is delivered securely and efficiently. Simply provide your preferred shipping address, and we will arrange for the carrier to pick up and deliver your items. During the checkout process, you will have the opportunity to select your preferred shipping method based on your location and preference. The applicable shipping fees, if any, will be clearly indicated before you finalize your order. Please note that shipping options may vary depending on your location and the availability of certain carriers. We strive to provide a range of shipping choices to accommodate our customers' needs. If you have any specific shipping inquiries or require assistance in selecting the most suitable shipping option for your order, our customer service team will be happy to assist you. What is Store policies for all of that items? Refunds : If you would like to return one of your purchases, you can do so within 14 days of receiving your shipment. You should contact us prior to shipping your item back. Please note that the customer will be responsible for returning the item to the Historic Sites Association at their own expense. A refund will only be issued once the item is received and inspected. The item must be unused, in its original packaging, and in resalable condition for a full refund. The following item categories are final sale only and not eligible for refund: sale items, earrings, and food. If you received a damaged or incorrect item, please see the “damages” section below. Shipping : Orders will ship from the Historic Sites Association Warehouse within 1-3 business days . We ensure your items are packaged securely to arrive to you in pristine condition, however, we do use re-purposed packaging materials whenever possible to reduce waste. We try our best to apply accurate shipping calculations at checkout, but in the event of a significant overcharge, you will be refunded the difference. Payment: Our online store accepts payment through Paypal , Apple Pay , and major credit cards on the Stripe platform. Your credit card information is processed securely online. See the following from Stripe’s Policies : “When you use Stripe Checkout on a merchant’s website to store your payment credentials, we will gather and store your payment card information, your email address, your mobile phone number, and billing and shipping address. We will use this information to complete purchases that you choose to make on other websites or applications that also use Stripe Checkout, but only with your permission . We may also share your contact information, but not your card information, with merchants as part of your purchases. We will not share this information with other third parties except as a necessary part of providing our Website and Services . You should carefully review merchants’ privacy policies to better understand how each uses your information.” Orders can also be processed over the phone by credit card. You can call or e-mail your selected items to us and we will confirm the order and shipping cost, and then contact you for payment. For a phone order, your credit card details are entered directly into the payment processing machine at the time of purchase and a hard copy is never produced , keeping your details secure and confidential. Damages : In the unlikely event that you receive an item that is damaged, or is not what you ordered, please contact us as soon as possible after receiving your order. Photos of affected items, and of defective shipping materials (if applicable), are a huge asset and should be forwarded to the e-mail address below. Online Store Contact : 1-709-753-5130 dms@historicsites.ca INFORMATION ABOUT US CONTACT US FOR ANY QUESTIONS dms [at] historicsites [dot] ca 3F WASTE RECOVERY PETER SOBOL Clareville Chamber of Commerce CRUNCHYPUPPYCREATIONS NL TEA COMPANY FIGGY DUFF DORY DAWN'S CREATIONS STUFFED ANIMAL HOUSE ONLY VIKING JIM COLBOURNE KYLE NOSEWORTHY NORTHEASTERN FOLK ART KATE FUDGE DOODLEPALOOZA TALL SHIPS ST. JOHN'S SOAP WORKS JYMLINE KETTLE HILL POTTERY NORTHERN WATTERS KNI Changeling Glass Works ELIZABETH BURRY TUCKS BEE BETTER ATTRACTION INC KAREN TUCKER SLATE Reflect Studio PAWTASTIC BANDANAS BOULDER PUBLICATIONS F.M.STAMPS WILD MOTHER PROVISIO JUMPING BEAN COFFEE LABRADOR TRADITIONS WISHPETS RAW ISLAND BOTANICAL CLARENVILLE CHAMBER FOGGY ISLAND CANDLES YOUR PAWS ONLY PARKS CANADA LADDIO CRAFTS FNC WORKSHOP SALTWATER DESIGNS WHITES EMPORIUM GINGER GLASS ISLAND FLORA SPIRIT OF NEWFOUNDLAND MARIE'S KNITS CRACKERBERRY BAGS Doug Bird SALTWATER PEWTER (DA) FLANKER PRESS GRAHAM BLAIR WOODCUT JORDAN'S LABRADORITE RAYKU POTTERY MOLLY MADE MOLLY MARGARET ART SAUCY NEWFOUNDLAND C RAD DISTRIBUTION GRUMPY GOAT GALLERY Rug Hook \\ NEWBORNLANDER Jenny Higgins AMY ADAMS SEA SALT AND TWIG POSTCARD FACTORY HSA ED ROCHE River Bead Jewelry NEWFOUNDLAND SALT CO KANSINEE DE GRAEF CYNTHIA NOEL SILVER SENSATIONS OLD COUNTRY DESIGN IMAGE GLASS ROCK HOUSES BY KAREN Anastasiia Mansiuk NEWFOUNDLAND SEASONING EAST COAST GLOW DARK TICKLE SPINDRIFT LIGHTHOUSE FRAGRANCE By working closely with artisans and crafters in our province, we ensure the continuation of traditional techniques and that the history behind these products lives on. Phone: (709) 753-0879 E-mail: dms[at]historicsites.ca By working closely with artisans and crafters in our province, we ensure the continuation of traditional techniques and that the history behind these products lives on. Phone: (709) 753-0879 E-mail: dms[at]historicsites.ca Recent Posts Open for the Season: Discover What’s in Store at Our Heritage Shop at Signal Hill July 19, 2023 No Comments Exploring Cape Spear: A Historic Gem in St. John’s April 10, 2023 No Comments Our stores Signal Hill Castle Hill Cape Spear Water Street Port au Choix Ryan Premises Duckworth Street L’Anse aux Meadows St. John’s International Airport USEFUL LINKS Privacy Policy Returns Terms & Conditions Contact Us Wholesale Our Story Footer Menu Instagram profile New Arrivals Local Makers Souvenirs Seasonal Gifts © 2025 Heritage Shops NL . All rights reserved Search Start typing to see products you are looking for. Search Menu Categories Local Crafts Souvenirs Arts Jewelry Clothing Food Gifts Book & Stationary Home shop Blog About us Contact us Wishlist Compare Login / Register Shopping cart Close Sign in Close Username or email address * Required Password * Required Log in Lost your password? Remember me No account yet? Create an Account Sorry, we are unable to fulfill orders from US at this time due to changes to \"de minimis exemptions\" for Canadian packages entering the US. Shop Wishlist 0 items Cart My account"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration-2/",
      "text": "Menorcan Heritage Celebration, The Minorcan Experience  at Llambias House, St. Augustine FL, History & Heritage Menorcan Heritage Celebration,  The Minorcan Experience   at  Llambias House, St. Augustine FL, History & Heritage English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Find An Event Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Culinary Family-Friendly Festivals Free History & Heritage Literary Arts & Film Many Cultures Online/Streaming Performing Arts Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Select City: City/Town combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select City/Town City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 SEARCH Advanced Filters Home History & Heritage Menorcan Heritage Celebration Accessibility Info Facebook Twitter Linkedin Print Please Note: This event has expired. Menorcan Heritage Celebration Presented by The Minorcan Experience at  Llambias House , St. Augustine FL Mar 02 2024 The Menorcan Cultural Society and The Minorcan Experience presents the Menorcan Heritage Celebration at Llambias House. Dr. Ann Browning Masters, Menorcan poet Laureate, will have copies of her book Floridanos, Menorcans, Cattle Whip-Crackers: Poetry of St. Augustine. Dr. Darien Andreu, Flagler College professor, will share information about the Minorcan Studies Project. Angela Ortagus Saxon and Lea Craig will display historical information and the books Tour of St. Augustine: A Minorcan Perspective and Maria's Secret Ingredient will be for sale. Free and open to the public. Dr. Ann Browning Masters, Menorcan poet Laureate, will have copies of her book Floridanos, Menorcans, Cattle Whip-Crackers: Poetry of St. Augustine. Dr. Darien Andreu, Flagler College professor, will share information about the Minorcan Studies Project. Angela Ortagus Saxon and Lea Craig will display historical information and the books Tour of St. Augustine: A Minorcan Perspective and Maria’s Secret Ingredient will be for sale. Free and open to the public. View less ADMISSION INFO Free LOCATION Llambias House 31 St. Francis Street, St. Augustine, FL 32084 View in Google Maps Accessibility Information: Currently, no accessibility information is available for this event. Connect with this Organization: DONATE Full\n        map and directions MEMBER REVIEWS There are currently no reviews/comments for this event. Be the first to add a review/comment , and let folks know what you think! Most Viewed Events Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 06 - Sep 14, 2025 Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association at St. Johns County Ocean Pier May 09 - Sep 24, 2025 Romanza Collage presents A Swing and a Miss! Presented by Romanza at The Waterworks Sep 27, 2025 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council at The Waterworks Sep 28, 2025 Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 05 - Sep 28, 2025 Fiber Arts and Flicks Presented by Southeast Branch Library at Southeast Branch Public Library Sep 29, 2025 SUBMIT A LISTING DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://centurionbanquethall.com/contact/",
      "text": "Contact Us - Centurion Banquet Hall Home About Us Services Birthday Parties Sweet 16 / Quinceañera First Communion Bar/Bat Mitzvah Baby Shower Corporate Events Funeral / Memorial Weddings Anniversaries Holiday Parties Other Special Occasions Gallery Contact Us Reservations 224-500-8679 Get in touch Contact Us Centurion Banquet Hall Get in touch with Centurion Banquet Hall for all your event needs. Whether you're planning a wedding, corporate event, or special celebration, our team is here to assist you. Fill out the form or contact us directly for more information. We look forward to making your event unforgettable! Reservations 224-500-8679 Email Info info@centurionbanquethall.com Address 3315 Milwaukee Ave, Northbrook, IL 60062 Get in touch CONTACT First Name Last Name Phone Number Event Type Guest Count - Select - 25 to 120 120 to 350 350+ Email Event Date Event Time - Select - 8 am to 4 pm 6 pm to 1 am Additional Comments How did you hear about us? - Select - Google Word of Mouth Other Submit Each of our guest rooms feature a private bath, wi-fi, cable television and include full breakfast. Reservation 855 100 4444 Call us, it's toll-free. Rooms & Suites Hotel Booking Form Check in Check out Adults 1 Adult 2 Adults 3 Adults 4 Adults Children 1 Children 2 Childrens 3 Childrens 4 Childrens Check Availability The Cappa Explore Home About Us services Gallery Contact Us Contact 3315 Milwaukee Ave, Northbrook, IL 60062 224-500-8679 info@centurionbanquethall.com © 2025 Centurion Banquet Hall"
    },
    {
      "url": "https://houseofmercyministries.net/staff-page/",
      "text": "Team | House of Mercy - Clean & Sober Housing Program 206.651.7840 office@hom.church Home Application About Success Stories Gallery Resources Get Involved Contact Payments Select Page Team House of Mercy’s mission of ensuring access to housing and transition services for some of our country’s most underserved and marginalized groups would not be possible without the passion and commitment of our staff, volunteers, partner organizations, and board members. Pastor Bob Faulk Sr. President and Founder Your content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings. Bob Faulk Jr. Executive Director Your content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings. Michael Lovrick Program Director “Having served over two thirds of my life behind bars I am passionate about breaking the cycles of anger, addiction & incarceration that have held so many family’s captive for generations. I am blessed to be able to help others change from destructive mindsets and set & achieve their goals ti live the lives God intended for them to live.” Michael is an author, speaker and teacher and has created numerous classes and conferences around the topics of leadership and men’s issues. Glenn Kelly Technology Director Your content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings. Cristi Faulk Finance Manager Your content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings. James Crowder Area Support Manager Your content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings. John Conley Something Important Your content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings. Rusty Thomas Grants and Care Manager Your content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings. Julie Bennett Communications & Volunteer Coordinator Prior to coming to House of Mercy, Julie served as Executive Director for Sumner’s Downtown Promotion Association, along with serving on boards and committees for Tacoma’s Downtown Merchants, The Tacoma Farmer’s Market, First Night and Tacoma’s 6th Ave. Business District were she served as Vice President.   Julie is passionate about how faith affects community, reentry, recovery and sharing people’s stories.  She is a photographer, artist, speaker and mentor. Hours of Operation MON – FRI 9:00am – 5:00pm SAT-SUN We are closed 206.651.7840 Drop Us a Line Don’t be shy. Let us know if you have any questions! email: office@hom.church Our Newsletter Sign up for news and updates at House of Mercy Success! First Name Last Name Email Subscribe Home Application About Success Stories Gallery Resources Get Involved Contact Payments House of Mercy | © 2025  All Rights Reserved"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration/",
      "text": "Menorcan Heritage Celebration, The Minorcan Experience  at Llambias House, St. Augustine FL, History & Heritage Menorcan Heritage Celebration,  The Minorcan Experience   at  Llambias House, St. Augustine FL, History & Heritage English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Find An Event Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Culinary Family-Friendly Festivals Free History & Heritage Literary Arts & Film Many Cultures Online/Streaming Performing Arts Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Select City: City/Town combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select City/Town City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 SEARCH Advanced Filters Home History & Heritage Menorcan Heritage Celebration Accessibility Info Facebook Twitter Linkedin Print Please Note: This event has expired. Menorcan Heritage Celebration Presented by The Minorcan Experience at  Llambias House , St. Augustine FL Mar 02 2024 The Menorcan Cultural Society and The Minorcan Experience presents the Menorcan Heritage Celebration at Llambias House. Dr. Ann Browning Masters, Menorcan poet Laureate, will have copies of her book Floridanos, Menorcans, Cattle Whip-Crackers: Poetry of St. Augustine. Dr. Darien Andreu, Flagler College professor, will share information about the Minorcan Studies Project. Angela Ortagus Saxon and Lea Craig will display historical information and the books Tour of St. Augustine: A Minorcan Perspective and Maria's Secret Ingredient will be for sale. Free and open to the public. Dr. Ann Browning Masters, Menorcan poet Laureate, will have copies of her book Floridanos, Menorcans, Cattle Whip-Crackers: Poetry of St. Augustine. Dr. Darien Andreu, Flagler College professor, will share information about the Minorcan Studies Project. Angela Ortagus Saxon and Lea Craig will display historical information and the books Tour of St. Augustine: A Minorcan Perspective and Maria’s Secret Ingredient will be for sale. Free and open to the public. View less ADMISSION INFO Free LOCATION Llambias House 31 St. Francis Street, St. Augustine, FL 32084 View in Google Maps Accessibility Information: Currently, no accessibility information is available for this event. Connect with this Organization: DONATE Full\n        map and directions MEMBER REVIEWS There are currently no reviews/comments for this event. Be the first to add a review/comment , and let folks know what you think! Most Viewed Events Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 06 - Sep 14, 2025 Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association at St. Johns County Ocean Pier May 09 - Sep 24, 2025 Romanza Collage presents A Swing and a Miss! Presented by Romanza at The Waterworks Sep 27, 2025 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council at The Waterworks Sep 28, 2025 Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 05 - Sep 28, 2025 Fiber Arts and Flicks Presented by Southeast Branch Library at Southeast Branch Public Library Sep 29, 2025 SUBMIT A LISTING DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://historiccoastculture.com/event/menorcan-heritage-celebration-3/",
      "text": "Menorcan Heritage Celebration, Menorcan Cultural Society  at Llambias House, St. Augustine FL, History & Heritage Menorcan Heritage Celebration,  Menorcan Cultural Society   at  Llambias House, St. Augustine FL, History & Heritage English English French German Italian Spanish SUBSCRIBE SUBMIT AN EVENT LOGIN REGISTER LOGOUT MY ACCOUNT There are no recent bookmarks. MENU Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Things To See & Do Culinary Arts Family-Friendly Festivals Free History & Heritage Literary Arts & Film Performing Arts Visual Arts STORIES Architecture & Neighborhoods Culinary Arts History & Heritage Holidays People Of Culture Performing Arts Things To See Visual Arts PLAN YOUR TRIP Before You Come Culinary Guide Public Art Map While You’re Here Visitor Center Art Galleries Culinary Excellence Museums Parks & Historic Sites Itineraries Guides Colonial Tour Flagler College Gilded Age Tour Lincolnville South of the Plaza Cultural de Estados Unidos de América EXPLORE ST. AUGUSTINE Arts & Culture ARTIST PROFILES PUBLIC ART Cultural Trails Accord Trail Touch – Braille Trail Oldest In History Neighborhoods Neighborhoods Guide Find An Event Search by Keyword Category combo box can be expanded using the Spacebar, Alt + Down Arrow, or Enter key. Once expanded, users can navigate through the options using the arrow keys. Multiple options or \"Select All\" can be chosen before applying the selection. Select Category Select Category Culinary Family-Friendly Festivals Free History & Heritage Literary Arts & Film Many Cultures Online/Streaming Performing Arts Visual Arts Select Venue: Venue combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select Venue Select City: City/Town combo box can be expanded with either Spacebar, Alt + Down arrow key, or Enter. Then arrows can be used to explore the options. Only one selection can be made in each of these combo boxes. To select, navigate to the option with the arrow keys and then press enter to save the selection. Select City/Town City/Town Armstrong Crescent Beach Elkton Fruit Cove Hastings Palm Coast Palm Valley Ponte Vedra Ponte Vedra Beach St. Augustine St. Augustine Beach St. Augustine Shores Switzerland Vilano Beach Quick Search Today Weekend Tomorrow The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK The date pickers are best navigated if one types the dates as: mm/dd/yyyy (example: 11/08/2024) instead of trying to use the arrows to move around the calendar dates. December 2020 Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Cancel OK Search by date range: Today Tomorrow Weekend next 7 14 30 SEARCH Advanced Filters Home History & Heritage Menorcan Heritage Celebration Accessibility Info Facebook Twitter Linkedin Print Please Note: This event has expired. Menorcan Heritage Celebration Presented by Menorcan Cultural Society at Llambias House , St. Augustine FL Mar 01 2025 Celebrating the heritage and culture of the Menorcans. Celebrating the heritage and culture of the Menorcans who left their Mediterranean homeland to make a new life in the New World--hosted by The Menorcan Cultural Society. Celebrating the heritage and culture of the Menorcans who left their Mediterranean homeland to make a new life in the New World–hosted by The Menorcan Cultural Society. View less LOCATION Llambias House 31 St. Francis Street, St. Augustine, FL 32084 View in Google Maps Accessibility Information: Currently, no accessibility information is available for this event. Connect with this Organization: DONATE Full\n        map and directions MEMBER REVIEWS There are currently no reviews/comments for this event. Be the first to add a review/comment , and let folks know what you think! Most Viewed Events Spill the Tea: Fresh-Brewed Comedy Presented by Third Space Improv at Third Space Improv Sep 13, 2025 Lenny Foster: The Magnolia Season Presented by Lightner Museum and Lenny Foster's Gallery One Forty Four at Lightner Museum Jun 06 - Sep 14, 2025 Comedy Smackdown Presented by Third Space Improv at Third Space Improv Sep 19, 2025 Pastel Landscape Painting Workshop (with Cynthia Pierson) Presented by St. Augustine Art Association at St. Augustine Art Association Sep 23 - Sep 24, 2025 MUSIC AND ART BY THE SEA Presented by St. Augustine Beach Civic Association at St. Johns County Ocean Pier May 09 - Sep 24, 2025 Romanza Collage presents A Swing and a Miss! Presented by Romanza at The Waterworks Sep 27, 2025 September Poetry Open Mic Presented by Ancient City Poets and St. Johns Cultural Council at The Waterworks Sep 28, 2025 Annual Fall Members Show Presented by St. Augustine Art Association at St. Augustine Art Association Sep 05 - Sep 28, 2025 Fiber Arts and Flicks Presented by Southeast Branch Library at Southeast Branch Public Library Sep 29, 2025 SUBMIT A LISTING DIRECTORIES Artist Profiles Restaurants Drinks Places To Stay Organizations Venues RESOURCES Spotlight Media Marketing Toolkit Most Viewed Events Stories SUBMIT A LISTING Event Organization Artist Profile ABOUT US Contact Us About Us Support the Arts ST. JOHNS CULTURAL COUNCIL HistoricCoastCulture.com is a one-stop source for information about all the performances, venues, exhibitions, and community events that are happening year-round. CONTACT US 184 San Marco Ave, St. Augustine FL 32084 904-808-7330 sjcc@historiccoastculture.com © 2025 - St. Johns Cultural Council . All Rights Reserved. { Powered by ARTSOPOLIS } Processing... Thank you! Your subscription has been confirmed. You'll hear from us soon. GET THE LATEST FROM HISTORIC COAST CULTURE Stay connected with weekly updates on arts, culture, history, and heritage events in St. Augustine, Ponte Vedra, and the Beaches. Name ErrorHere Email * City * Zip/Postal Code * Interests * Visual Arts Performing Arts Literary Arts Festivals Living History Many Cultures Culinary Historic Coast INSIDER"
    },
    {
      "url": "https://www.heritagetile.com/contactus",
      "text": "Contact Us | Heritage Tile Follow us +1 (888) 387-3280 ​​ CONTACT US ​​​​ Collections → Marble Mosaics → Subway Ceramics → Viva Tile → Zen+Clay Samples All Collection Samples → Marble Mosaics → Subway Ceramics → Viva Tile → Zen+Clay Design Guides All Design Guides Marble Mosaics Design Guide Shadow Tile Design Guide Subway Ceramics Design Guide Viva Tile Design Guide Zen+Clay Design Guide Trade Accounts Trade Program Experience Sampling Program About Our Story Blog Project Services Press and Media Visit Our Showroom FAQs Contact Us Project Services 0 Sign in ​​ CONTACT US ​​​​ Contact Us Contact us about anything related to our company or services, and our team will get back to you as soon as possible. Applying for a trade account? Please use our trade registration form . Your Name: * Company: If applicable. Your Email: * Phone Number: * Preferred Contact Method: * Phone Email Either Address: City: State: Zip Code: Country: Subject: * Your Question: * Attachment: Protected by reCAPTCHA, Privacy Policy & Terms of Service apply. Submit​​​​ MARBLE MOSAICS | SUBWAY CERAMICS | VIVA TILE | ZEN+CLAY Our support staff is available weekdays from 8:30am - 5:00pm (Central Time). For assistance outside of these hours, please leave a voicemail or email, and we'll get back to you promptly. Thank you! Main Office + Warehouse: 312 Investment Court Verona, WI 53593-8713 United States +1 (888) 387-3280 ​ info@heritagetile.com Showroom: 144 N. Oak Park Ave. Oak Park, IL  60301 United States +1 (708) 919-1600 ​ showroom@heritagetile.com REQUEST A FREE PHONE CONSULTATION​​​​ REQUEST A SHOWROOM APPOINTM​​​​ENT About Our Story FAQs Contact Visit Our Showroom Terms & Conditions Share Your Project Collections Marble Mosaics Subway Ceramics Viva Tile Zen+Clay Trade Trade Program Experience Sampling Program Log In Services Free Phone Consultation ​ Project Services Viva Tile Design Services Contact Us Hours: 8:30am - 5:00pm (Central Time), weekdays ​ info@heritagetile.com ​ +1 (888) 387-3280 ​ 312 Investment Court Verona, WI 53593 United States Social Media ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ ​ © Heritage Tile, LLC 2025"
    },
    {
      "url": "https://lazonamuerta.net/contact/",
      "text": "Contact – La Zona Muerta La Zona Muerta Blog About Contact Home Contact Don’t hesitate to reach out with the contact information below, or send a message using the form. Get in Touch dj_convoy@lazonamuerta.blog DeviantArt YouTube Send Us a Message Go back Your message has been sent Name (required) Warning Email (required) Warning Website Warning (required) Warning Warning. Submit Δ Like Loading… Designed with WordPress Subscribe Subscribed La Zona Muerta Sign me up Already have a WordPress.com account? Log in now. La Zona Muerta Subscribe Subscribed Sign up Log in Copy shortlink Report this content View post in Reader Manage subscriptions Collapse this bar %d"
    },
    {
      "url": "https://menorcansociety.net/publications/",
      "text": "Publications – The Menorcan Cultural Society Skip to content HOME EVENTS JOIN GALLERY PUBLICATIONS CONTACT Menorca A gathering of Menorcans San Juan Festival Menorcan Olivewood Gate Poblat talaiòtic de Talatí de Dalt Port of Mahon Publications ocws 2025-03-06T17:22:48+00:00 Publications Fromajadas and Indigo: The Minorcan Colony in Florida. The Menorcan Cultural Society and History Press are proud to present Kenneth Beeson’s Fromajadas and Indigo: The Minorcan Colony in Florida. A limited number of these books are still available from the Society at $17.95 each plus shipping. All proceeds benefit the Society. If you are interested in purchasing the book contact: Rusty Hall, President of the Menorcan Cultural Society at: RustyHall@me.com MULLET ON THE BEACH The Minorcans of Florida 1768 – 1788 Patricia Griffin’s Mullet on the Beach is available through Amazon.com or if you are in St. Augustine it is available at the gift shop of the Oldest House. Floridanos, Menorcans, Cattle-Whip Crackers: Poetry of St. Augustine. Ann Browning Masters, Floridanos, Menorcans, Cattle-Whip Crackers: Poetry of St. Augustine.  Florida Historical Society Press, 2015. This book is available at the Florida Historical Society, Oldest House Gift Shop, and on-line at Amazon and Barnes & Noble. Other Links, Resources We offer information on Menorcan history, genealogy, and other items of interest to the Menorcan community. Florida History Online – A premier Florida history website. The Smyrnea section on the projects page is especially relevant to Menorcans. McCown.org Family History – An extensive site for Menorcan genealogy. Minorcan Pride – A web blog from one of our members. Video Smyrnea: Lost and Found, Gale Force Films, Filmaker George Sibley, 2006. This is available in DVD format at the Oldest House gift shop and at the New Smyrna History Museum. © The Menorcan Cultural Society. All Rights Reserved. St. Augustine Web Design by Old City Web Services. Visit St. Augustine on Oldcity.com Page load link Go to Top"
    }
  ]
}