{
  "fuentes": [
    {
      "url": "https://prioritymarketing.com/brightwater-lagoon-celebrates-opening-invites-community-to-splash-into-summer/",
      "email": "info@prioritymarketing.com"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/brightwater-lagoon/6195",
      "email": "help@metrolagoons.com"
    },
    {
      "url": "https://brightwaterpools.com/contact-us/",
      "email": "aloha@brightwaterpools.com"
    },
    {
      "url": "https://brightwaterpools.com/contact-us/",
      "email": "ohana@brightwaterpools.com"
    },
    {
      "url": "https://prioritymarketing.com/brightwater-lagoon-announces-jimmy-cruz-as-general-manager/",
      "email": "info@prioritymarketing.com"
    },
    {
      "url": "https://lagoonteam.com/",
      "email": "help@dsghelp.com"
    },
    {
      "url": "https://www.brightwaterholidays.com/us/about/",
      "email": "info@brightwaterholidays.com"
    },
    {
      "url": "https://www.brightwaterholidays.com/us/about/",
      "email": "u003einfo@brightwaterholidays.com"
    },
    {
      "url": "https://www.winknews.com/gulfshore_business/brightwater-lagoon-cuts-ribbon-on-6-acre-pool-amenity/article_012a1f5a-9640-4f32-8e16-4204c03d6264.html",
      "email": "david.dorsey@gulfshorelife.com"
    }
  ],
  "mails": [
    "aloha@brightwaterpools.com",
    "david.dorsey@gulfshorelife.com",
    "help@dsghelp.com",
    "help@metrolagoons.com",
    "info@brightwaterholidays.com",
    "info@prioritymarketing.com",
    "ohana@brightwaterpools.com",
    "u003einfo@brightwaterholidays.com"
  ],
  "nombre_sitio": "metrolagoons.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://prioritymarketing.com/brightwater-lagoon-celebrates-opening-invites-community-to-splash-into-summer/",
      "text": "Brightwater Lagoon celebrates opening, invites community to Splash into Summer Skip to content Taking Care of Family, Clients & Community for Over Three Decades 239-267-2638 Facebook Instagram Youtube Twitter Icon Linkedin Services Brand Development Web Services Social Media Digital Marketing Public Relations Media Buying Creative Services Video Production Event Execution Our Work About Get to Know Us You won’t find a more passionate, creative, strategic and hardworking team than the pros at Priority Marketing! Our Story Our Tribe Careers Reviews Let's Talk About You! News & Marketing Tips FAQ Fridays Let's Connect Let's Connect May 30, 2025 Brightwater Lagoon celebrates opening, invites community to Splash into Summer MetroLagoons debuts full resort-style experience now open in North Fort Myers Brightwater Lagoon, a resort-style lagoon experience in the Brightwater community in North Fort Myers, is welcoming the community to Splash into Summer and enjoy the final experiences that complete the one-of-a-kind tropical destination now fully open to residents and the public. To mark the milestone, community leaders, project partners and supporters gathered May 30 for a ribbon cutting ceremony celebrating the opening of all onsite amenities. The festivities featured live luau entertainment and remarks from company leadership and key community partners, officially launching the lagoon’s next chapter. The innovative concept is brought to life by Metro Development Group and MetroLagoons, the managing companies behind Brightwater Lagoon and several other residential lagoon communities across Florida. In addition to public offerings, residents of MetroLagoons communities receive exclusive benefits, including unlimited lagoon access, members-only events and more. Now open seven days a week, the lagoon is the first of its kind in Southwest Florida and the fourth MetroLagoons location in the state. Located at 8630 Sunny Page Lane in North Fort Myers, the lagoon offers resort-style fun for the whole family, featuring six acres of clear blue water surrounded by sandy beaches and lounge chairs, inflatable floating obstacle courses for adults and children, traditional waterslide, splash pad, resort-style swim-up bar, food trucks, and paddleboard and kayak rentals. “The lagoon offers a signature experience found in only a few places across the state, setting a new standard for outdoor fun in Southwest Florida,” said Brightwater Lagoon General Manager Jimmy Cruz. “With crystal-clear water, fun water activities and fresh food and drinks, we’re proud to introduce this one-of-a-kind destination for locals and visitors to enjoy.” Complimentary lounge chairs are spread along the beaches and available on a first come, first served basis. Guests seeking a more exclusive experience may purchase rentals for shaded tikis, umbrellas or covered spaces in Cabana Cove, a separate VIP section that offers 13 cabanas and four floating aquabanas, a private swimming area, bar and additional seating. In addition to sunny days by the water, Brightwater Lagoon showcases live music and entertainment at “The Hub,” a shaded stage area complete with a large LED video wall, special themed days, plus family friendly games and activities. Brightwater Lagoon is MetroLagoons’ first cashless venue. Visitors may purchase food and drinks on property with credit, debit or mobile wallets including Apple and Google Pay. On-site food trucks serve made-to-order handhelds like burgers, hot dogs and fries, plus fresh wraps and a wide selection of ice cream and frozen treats. Non-alcoholic beverages and a selection of specialty cocktails, beer and wine are also available for purchase at the bar. Visitors can plan their day in advance online. The lagoon, Cabana Cove, food trucks and onsite bars are open seven days a week, along with add-on upgrades like the Splash Pass, which provides access to paddleboards, kayaks and the inflatable floating obstacle courses. Visit MetroLagoons.com/Lagoon/Brightwater to plan your visit. Share now! Prev Previous Next Next More To Explore Client News Brightwater Lagoon launches Football SUN-Days Brightwater Lagoon is kicking off the football season with the Football SUN-Days multi-day ticket, giving guests access to the lagoon every Sunday now through Jan. September 10, 2025 Client News FGCU donation fuels Child Care of Southwest Florida’s ‘Focus on Four’ program Child Care of Southwest Florida received a $40,900 financial contribution from Florida Gulf Coast University to enhance the child care provider’s Focus on Four program, September 10, 2025 Client News Windward Construction relocates, creates inspiration hub for custom homebuyers Windward Construction, an award-winning Southwest Florida-based luxury homebuilding company, has relocated its company headquarters to a new location designed to inspire collaboration and bring a September 10, 2025 Get News You Can Use Sign up for our monthly newsletter to keep up with what we’re doing for our clients and the community. We cover a variety of relevant marketing tips and topics to inspire and empower your brand! Email (Required) A full-service marketing and public relations firm serving every industry, everywhere. Facebook Instagram Youtube Twitter Icon Linkedin CONTACT INFORMATION 12140 Carissa Commerce Ct. Suite # 201 Fort Myers, FL 33966 239.267.2638 info@prioritymarketing.com SERVICES Brand Development Public Relations Creative Services Digital Marketing Web Services Social Media Video Production Event Execution Media Buying Priority Marketing © All rights reserved. 1992-2025 Accessibility Statement | Cookie Policy | Privacy Policy | Terms and Conditions | Sitemap | Accessibility Adjustments Florida | Georgia | North Carolina | South Carolina | Alabama | Colorado"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/brightwater-lagoon/6195",
      "text": "Brightwater Lagoon | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN 78° Now 78° Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Amenities Amenities Events Events Deals Deals Share Share Visit Website Brightwater Lagoon Brightwater Lagoon, located in Fort Myers, FL, is 5-acres of tropical oasis offering clear blue waters perfect for swimming, sunning and sipping perfection. Surrounded by sandy beaches, it provides an escape with luxurious cabanas, a floating obstacle course and family-friendly amenities. With year-round events and activities, Brightwater Lagoon is a unique destination for relaxation, adventure, and community... Load More Brightwater Lagoon, located in Fort Myers, FL, is 5-acres of tropical oasis offering clear blue waters perfect for swimming, sunning and sipping perfection. Surrounded by sandy beaches, it provides an escape with luxurious cabanas, a floating obstacle course and family-friendly amenities. With year-round events and activities, Brightwater Lagoon is a unique destination for relaxation, adventure, and community fun. Load Less 26.731661538027, -81.813699200007 (486 Google Reviews) 813-444-5221 8630 Sunny Page Lane North Fort Myers , FL 33917 United States help@metrolagoons.com View Website Book Now Key Features Things to Do Family Fun Water Park Aquaculture Outdoor Activities & Sports Canoeing & Kayaking Water Sports Gallery Amenities Suitable for Ages All Ages Upcoming Events Sep 14, 2025 Sep 14, 2025 Football SUN-Days North Fort Myers North Fort Myers Sep 24, 2025 Sep 24, 2025 Movie on the Turf: Descendants Rise of Red North Fort Myers North Fort Myers Sep 17, 2025 Sep 17, 2025 The Summer I Turned Pretty Watch Party North Fort Myers North Fort Myers Sep 13, 2025 Sep 13, 2025 Decades Night 70s, 80s, 90s North Fort Myers North Fort Myers Sep 12, 2025 Sep 12, 2025 Sunset Social: PJ's& Prosecco North Fort Myers North Fort Myers Movie on the Turf: IF North Fort Myers North Fort Myers Sep 19, 2025 Sep 19, 2025 Finish the Line North Fort Myers North Fort Myers Sep 20, 2025 Sep 20, 2025 Karaoke North Fort Myers North Fort Myers Sep 27, 2025 Sep 27, 2025 Musical Bingo North Fort Myers North Fort Myers Sep 26, 2025 Sep 26, 2025 Cigar Night with Live Music North Fort Myers North Fort Myers Our Deals Details Football SUN-Days Aug 28, 2025 - Sep 21, 2025 Aug 28, 2025 - Sep 21, 2025 Brightwater Lagoon Brightwater Lagoon Details Happy Hour at Brightwater Lagoon March 31, 2025 - Dec 31, 2028 March 31, 2025 - Dec 31, 2028 Brightwater Lagoon Brightwater Lagoon Details Buy Online & Save Up To $10* March 17, 2025 - Nov 17, 2028 March 17, 2025 - Nov 17, 2028 Brightwater Lagoon Brightwater Lagoon 26.731661538027, -81.813699200007 (486 Google Reviews) 813-444-5221 8630 Sunny Page Lane North Fort Myers , FL 33917 United States help@metrolagoons.com View Website Book Now Key Features Things to Do Family Fun Water Park Aquaculture Outdoor Activities & Sports Canoeing & Kayaking Water Sports What's Nearby Caloosahatchee Creeks Preserve Located on the northern shoreline of the Caloosahatchee River, the preserve has picnic pavilions, a canoe and kayak... ECHO Global Farm Tours Our Global Farm is anything but typical. Through our tour, you’ll experience farming at its most creative, with unique... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    },
    {
      "url": "https://brightwaterpools.com/contact-us/",
      "text": "Contact Us | BrightWater Pools Skip to content Free Shipping & Lift Gate Service on All Pools & Hot Tubs   | Shop Our Hot Tubs Shop Our Pools | Our Reviews Why BrightWater Pools About Us How to Buy Pre-Delivery FAQs Our Pools Bright Classic™ Bright Hybrid™ Bright Icon™ Bright Icon+ Salt™ Our Hot Tubs DayDream 3500L Ensemble DayDream 3500S Ensemble DayDream 3500L DayDream 3500S Discover 600 Premium Discover 500 Premium Discover 400 Premium Discover 150 Premium Discover 600 Discover 500 Discover 400 Discover 150 Shop Now Contact Us Resources Blog Why BrightWater Pools About Us How to Buy Pre-Delivery FAQs Our Pools Our Pools Say aloha to your perfect pool paradise with BrightWater Pools! With our incredible selection of steel, hybrid, and resin pools, it couldn’t be easier to build your favorite space at home. Find My Pool Bright Classic™ Bright Hybrid™ Bright Icon™ Bright Icon+ Salt™ Bright Classic™ Steel Pool The Bright Classic™ above ground pool is your one-way ticket to paradise. $ 1,899.00 View Details Bright Hybrid™ Best Value Steel & Resin Pool The Bright Hybrid™ pool is your gateway to a staycation that never ends. $ 2,099.00 View Details Bright Icon+ Salt™ Resin Pool Saltwater Pool Saltwater serenity is yours with the Bright Icon+ Salt™ above ground pool. $ 2,399.00 View Details Bright Icon™ Added Strength Resin Pool Island dreams meet iconic quality with the Bright Icon™ pool. $ 2,299.00 View Details Our Hot Tubs Our Hot Tubs Maximize at-home enjoyment with a spa from BrightWater Pools! With our innovative portable hot tub models from AquaRest Spas, relaxation and renewal are yours each day. Find My Hot Tubs DayDream 3500L Ensemble DayDream 3500S Ensemble DayDream 3500L DayDream 3500S Discover 600 Premium Discover 500 Premium Discover 400 Premium Discover 150 Premium Discover 600 Discover 500 Discover 400 Discover 150 Shop Now Resources Blog Why BrightWater Pools About Us How to Buy Pre-Delivery FAQs Our Pools Bright Classic™ Bright Hybrid™ Bright Icon™ Bright Icon+ Salt™ Our Hot Tubs DayDream 3500L Ensemble DayDream 3500S Ensemble DayDream 3500L DayDream 3500S Discover 600 Premium Discover 500 Premium Discover 400 Premium Discover 150 Premium Discover 600 Discover 500 Discover 400 Discover 150 Shop Now Contact Us Resources Blog Contact Us 0 items $0.00 Contact Us 0 items $0.00 Home - Contact Us Contact Us Thank you for connecting with us! At BrightWater Pools, we’re dedicated to helping you create your perfect backyard oasis. Whether you’re looking for advice on choosing the right above ground pool, need assistance with your questions, or require more information and suggestions about our products, our dedicated team is here to help. First, please visit our FAQ page for our most frequently asked questions. Can’t find what you need? Here’s how to contact us. Read our FAQs Send Us a Message Get in Touch Email: Send inquiries to aloha@brightwaterpools.com for sales and general info or ohana@brightwaterpools.com for orders and support. We’ll get back to you soon. Send Us a Message: If you have any questions or feedback, fill out the form above and we will get in touch with you shortly. Give Us A Call: 802-341-8679 Connect with Us Online Aloha! Welcome to the BrightWater Pools family. Stay updated on our latest products, promotions, and pool care tips by following us on social media. Facebook Instagram We look forward to hearing from you and helping you make a huge splash with BrightWater Pools products. BrightWater Pools Life outside the yard is complicated. Your backyard doesn't have to be. Facebook-f Instagram Questions? We've got answers. Frequently Asked Questions Call: 802-341-8679 We do not install pools or pool products. Contact Us Products Pools Hot Tubs Equipment Entry Systems All Products Pools Hot Tubs Equipment Entry Systems All Products Resources FAQs Pre-Delivery Why BrightWater Pools? Reviews FAQs Pre-Delivery Why BrightWater Pools? Reviews Quick Links Get Financing Specials Terms & Conditions Refund and Return Policy Delivery Areas Get Financing Specials Terms & Conditions Refund and Return Policy Delivery Areas © BrightWater Pools 2025. All rights reserved. Terms & Conditions | Privacy Policy $500 Off Pool Packages All August Long Save big when you spend $4,000 or more on any above ground pool or pool package. Promo Code: SWIM500"
    },
    {
      "url": "https://prioritymarketing.com/brightwater-lagoon-announces-jimmy-cruz-as-general-manager/",
      "text": "Brightwater Lagoon announces general manager Skip to content Taking Care of Family, Clients & Community for Over Three Decades 239-267-2638 Facebook Instagram Youtube Twitter Icon Linkedin Services Brand Development Web Services Social Media Digital Marketing Public Relations Media Buying Creative Services Video Production Event Execution Our Work About Get to Know Us You won’t find a more passionate, creative, strategic and hardworking team than the pros at Priority Marketing! Our Story Our Tribe Careers Reviews Let's Talk About You! News & Marketing Tips FAQ Fridays Let's Connect Let's Connect July 16, 2024 Brightwater Lagoon announces Jimmy Cruz as general manager Brightwater Lagoon, a MetroLagoons resort-style amenity coming soon to the Brightwater community in North Fort Myers, is proud to announce Jimmy Cruz as general manager. Cruz brings an impressive 30 years of hospitality experience at theme parks, resorts, public parks and residential amenity properties. He joined the MetroLagoons team in March 2023 to oversee pre-opening responsibilities and establish operations teams at Brightwater Lagoon. Moving forward, he will manage Brightwater Lagoon Operations, Water Safety, Water Quality and Food and Beverage teams. Prior to moving to Southwest Florida, Cruz worked a collective 26 years at SeaWorld and Discovery Cove, Busch Gardens Tampa Bay and Universal Orlando in park operations supervisor and management roles. He also served as the director of operations and safety at Gathering Place Tulsa, overseeing special events, security, boat operations and safety of three properties. “I love working with teams and developing great leaders,” said Cruz. “So far, we have built an incredible team here at Brightwater and we’re looking forward to providing Southwest Florida with a safe and fun environment to make great memories.” For more information and the latest updates, visit www.metrolagoons.com/lagoon/brightwater/ . About Brightwater Lagoon Opening in 2024, Brightwater Lagoon is one of four MetroLagoons locations in Florida and the first in Southwest Florida. Located at 8630 Sunny Page Lane in North Fort Myers, the lagoon will feature six acres of clear blue water surrounded by sandy beaches. Brightwater residents and guests can enjoy a resort-style swim-up bar, food trucks, live entertainment, a water slide, inflatable obstacle course and more. Guests can purchase an All Day Ticket to experience the lagoon and upgrade their day with shaded rental spaces and water activities to create unforgettable experiences in the sunshine. To learn more, visit MetroLagoons.com/Lagoon/Brightwater or call 813-444-5221. Share now! Prev Previous Next Next More To Explore Client News Brightwater Lagoon launches Football SUN-Days Brightwater Lagoon is kicking off the football season with the Football SUN-Days multi-day ticket, giving guests access to the lagoon every Sunday now through Jan. September 10, 2025 Client News FGCU donation fuels Child Care of Southwest Florida’s ‘Focus on Four’ program Child Care of Southwest Florida received a $40,900 financial contribution from Florida Gulf Coast University to enhance the child care provider’s Focus on Four program, September 10, 2025 Client News Windward Construction relocates, creates inspiration hub for custom homebuyers Windward Construction, an award-winning Southwest Florida-based luxury homebuilding company, has relocated its company headquarters to a new location designed to inspire collaboration and bring a September 10, 2025 Get News You Can Use Sign up for our monthly newsletter to keep up with what we’re doing for our clients and the community. We cover a variety of relevant marketing tips and topics to inspire and empower your brand! Email (Required) A full-service marketing and public relations firm serving every industry, everywhere. Facebook Instagram Youtube Twitter Icon Linkedin CONTACT INFORMATION 12140 Carissa Commerce Ct. Suite # 201 Fort Myers, FL 33966 239.267.2638 info@prioritymarketing.com SERVICES Brand Development Public Relations Creative Services Digital Marketing Web Services Social Media Video Production Event Execution Media Buying Priority Marketing © All rights reserved. 1992-2025 Accessibility Statement | Cookie Policy | Privacy Policy | Terms and Conditions | Sitemap | Accessibility Adjustments Florida | Georgia | North Carolina | South Carolina | Alabama | Colorado"
    },
    {
      "url": "https://lagoonteam.com/",
      "text": "MetroLagoons Resources 0 Skip to Content Open Menu Close Menu Open Menu Close Menu EMPLOYEE RESOURCES We are glad you’re part of the MetroLagoons team! See below for helpful links and resources. View LagoonLife Insider Share Your Feedback View Team Member Benefits View Quick Links Team Member of the Month Google Reviews Employee Online Ordering (Mirada Only) Safety & Professionalism Service is the Experience Informed Expectation Each month, help us recognize team members who go the extra mile! Submit your nominations for Team Member of the Month and Leader of the Quarter to celebrate those making a real impact. Winners will be recognized and rewarded for their outstanding efforts! Team Member Of The Month & Leader of the Quarter Submit a Nomination As an employee of MetroLagoons, enjoy access to exclusive benefits on Admissions, Food & Beverage and more at the Lagoon. Please note, you will not receive your employee discount outside of your registered employee loyalty account. If you have not registered your account, you will not receive your loyalty discount. Team Member Benefits New! Starting in June 2025, we’re excited to introduce a new birthday reward for our active employees! During the month of your birthday, you’ll receive a $15 MetroMoney reward added to your loyalty account. We're awarding $15 MetroMoney for birthdays dating back to January 1, 2025, so if your birthday has already passed this year, don’t worry—you’ll still receive your reward! To be eligible, please make sure your birthday is added to your loyalty profile. Please note: Your birthday reward will expire 30 days after your birthday. Birthday Reward View Team Member Benefits Ready to crush the competition? Click below to keep track of our Google scores each month and see how your Lagoon team is doing. Plus, learn how you can make up to $100 in our Google Review Challenge! View Google Reviews Enjoy monthly employee newsletters and stay up to date with all things MetroLagoons. LagoonLife Insider View LagoonLife Insider Newsletter New! Employee Online Ordering (EOO) Policy The Employee Online Ordering portal is provided solely for the convenience and use of on-duty employees. All employee orders from the VIP Truck must be placed through this online system . Your 50% working discount has already been applied to the listed menu prices. If you are eligible for a Shift Meal , you must order it directly at the VIP Truck . The Shift Meal discount is not available through EOO. Items ordered through the EOO are intended for consumption by the working employee only and may not be shared or extended to others. Any misuse of this system may result in disciplinary action, up to and including termination. Employees of Mirada Lagoon can now place their order online and pickup at the VIP Truck. Employee Online Ordering (Mirada Lagoon Only) View Menu & Order Online (Mirada Lagoon Only) Printable Menu Employee Handbook View the MetroLagoons Employee Handbook. Click Here. Lagoon Employee Exclusive Perks As an employee of MetroLagoons, enjoy access to exclusive benefits at the Lagoon. Click here to review your benefits. Shift Note Stay up to date on events and important updates with ShiftNote. Click here. Punch Edit Did you forget to clock in or out and need to submit a Punch Edit? Please fill out the form through the link below to submit your request. Click Here. Employees must complete this punch edit form for all timecard adjustments. Requests made verbally or otherwise NOT through this form will not be entered. One Punch Edit form per business date. Punch Edit requests must be submitted in a timely manner; requests received after 8am on Mondays may not be entered in time for payroll processing. Complete only missing or adjusted times; reason required for all edits. Self-Service Network Password Reset Visit https://portal.office.com and click “Forgot Password.” The first time you use Self-Service you may be prompted for a phone number and secondary email for password recovery if either do not exist in your profile. Mileage Reimbursement Please note before filling out this form: Mileage reports are Lagoon and month specific. Your daily round trip to your normal work location is deducted from your daily total mileage. Click here to fill out the Mileage Reimbursement form. Paycheck Discrepancy Is there a discrepancy on a paycheck that you’ve received? Fill out the form below and a leadership member will review your submission as soon as possible. Click Here. Expense Report Please use this form to report an out-of-pocket expense. Report must be filed by the 3rd of the next month. Click here to access the expense report form. Employment Information We all need a little support now and then. Please review the various employee assistance programs and resources available to you as a MetroLagoons employee. Click here. Business Card Request Form If you or a team member needs new business cards, please fill out a business card request form by clicking here. Quick Links Hot Schedules Check your schedule, request a schedule change, request time off and more! Click here. PayChex Access the online portal via your desktop or through the mobile app on your smartphone or tablet to view your paystubs and benefits. Do you need help setting up your PayChex account? Click Here. Direct Deposit Please see the following form for more information regarding direct deposit. Click Here. Branded Templates PowerPoint Template Word Document Template Email Signature Templates Signage Template Event Menu Templates Employee Uniform Policy View the MetroLagoons Employee Uniform Policy. Click Here. Employee Hotline Need to talk to your manager, call in tardy, or absent? Follow the directions in the attachment below to reach the employee hotline. Click Here. IT Support Need IT Support? Submit a ticket using the self-service portal at https://support.dsghelp.com/ or by emailing help@dsghelp.com . For after hours support, call DSG’s Help Desk at 813.739.0664 or 800.979.4374. Please do not call or email technicians directly. Employee Benefits Wondering about your benefits as a Full-time or Salaried employee? Click Here for Hourly Employees. Click Here for Salaried Employees. Types of Memberships View a helpful guide of all the memberships that MetroLagoons offers. Click here to view the Memberships Guide. Sign Up For Text Updates Text the word 'Employee' to (813) 692-5446 to sign up for text messages regarding team member updates. Marketing Request Form To request signage or graphics, please fill out a marketing request form by clicking here. Name Tags Name Tag Ordering Team members can now order name tags online. Click he re and fill out the online ordering form to request your name tag. Are you a salaried manager and part of the Leadership Team? Click here to request your name tag. Slide 1 Slide 1 (current slide) Slide 2 Slide 2 (current slide) Slide 3 Slide 3 (current slide)"
    },
    {
      "url": "https://www.brightwaterholidays.com/us/about/",
      "text": "About - Brightwater US United Kingdom America Call us: 646 802 1530 Brochure Request Contact TOURS Destinations About Tour Managers Offers Book With Us Price View Tours About Home About Welcome to Brightwater Holidays, a premier specialist tour operator founded in 1992. As part of the esteemed Specialist Journeys group, we have made it our mission to provide quality garden and special interest tours to individuals, private clubs and societies up and down the country. Helping our guests to expand their horizons and fulfil their travel dreams is our privilege — if there’s a garden or archaeological site you’ve always wanted to see, we’d love to help you see it. Our dedication to excellence has earned us numerous accolades, including prestigious British Travel Awards in categories such as Best Coach Holiday Company and Best Special Interest Holiday Company. The perfect choice, Brightwater Holidays When choosing a company to book a holiday with, there are many things to consider. Choose Brightwater Holidays and look forward to a trip booked by multi-award-winning specialists with our 30 years of experience in the travel industry. We pride ourselves on creating memorable itineraries that visit the world’s most spectacular gardens. Fantastic value for money With the cost of almost everything on the rise, we understand how important it is to offer affordable holidays where many aspects are included, leaving you free to enjoy your time away with very little to worry about. With Brightwater, everything is taken care of so all you need to do is to choose your holiday and meet us at your pick-up point. One of our experienced Tour Managers will be on hand throughout to ensure the smooth running of your trip and other inclusions range from all visits as per the itinerary to hotel accommodation, not forgetting transport between visits abroad one of our comfortable coaches. Hassle-free travel An escorted coach tour is the ultimate hassle-free way to enjoy a holiday. Our friendly drivers will collect you from your designated pick-up points, your luggage will be safely stowed away and you can sit back and enjoy the view as your trip gets off to a relaxing (and often scenic) start. Let the experts take the lead We know that planning a holiday involves visits to multiple gardens or different islands can be quite a challenge, what with the logistics of travelling from one place to another or ensuring you arrive on time for ticket entry, so choose a Brightwater holiday and we’ll do that for you. Knowledgeable tour managers All of our holidays are led by experienced and friendly Tour Managers, among whom you will find a former Head Gardener to HM the Queen Mother at Windsor, popular horticulturalists, award-winning garden designers and broadcasters. More sightseeing opportunities Travelling by coach also offers a chance to see more of your chosen destination. While we take the fastest routes to get you to and from your holiday, we also consider your viewing pleasure as we go, factoring in some fantastic opportunities for sightseeing where possible. We cater for different needs and activity levels As our collection of holidays is so broad, it means that we can cater for all kinds of interests – from ancient archaeological sire to island-hopping adventures – and varying activity levels. Personalise your holiday When you travel with Brightwater Holidays, your enjoyment of the trip is our priority. This is why we offer a variety of ways in which you can tailor your holiday to best fit your needs as there are always things we can do to help! From extending your stay with extra nights before or after your escorted tour to room upgrades and even booking regional flights, there’s nothing we can’t help with. Garden Holidays Whether you’re green-fingered or you simply enjoy the peace and serenity that walking around a beautiful garden can bring, there is bound to be a garden holiday for you. Our range is incredibly broad, taking in both public and private gardens at home and abroad, and not forgetting those all-important horticultural events such as flower shows and festivals. So, why should you consider Brightwater for a garden holiday? Let’s find out… Visits to well-loved flower shows We couldn’t create garden tours without including some of the most exciting events on the horticultural calendar, which range from the legendary RHS Chelsea Flower Show to the International Rose Festival in Grasse. Access to private gardens Due to the fact that we have been operating award-winning coach holidays for over 30 years now, we have formed great relationships with garden owners – many of them who own private gardens – which enables us to grant you access! Itineraries that showcase the ‘best of’ When we design our garden itineraries, we are sure to include all the highlights a particular area or region has to offer, so that you can get the very best out of your chosen destination. The grounds of historic houses As you know, many of the UK’s historic houses and castles are known for their glorious grounds, and we visit a fabulous array of these throughout our portfolio of garden holidays. How about a bit of history or a special encounter along the way? Gardens at home and abroad We may be a UK-based tour operator, but our garden holidays can take you all over the world. We have many stunning itineraries on offer that visit gardens in destinations as diverse as France, Italy, Japan and the Caribbean island of Grenada, to name but a few. Holidays to Scotland 2022 marked our 30th anniversary, which means we’ve been bringing groups of guests to our home country of Scotland for over three decades now. With this kind of longevity comes a lot of experience that we are using to delivery memory-making holidays. So, choose Brightwater for your next Scottish holiday and see why we’re the top choice for this, our most beloved destination. Broad range of itineraries We have an incredibly broad range of scenic Scottish holidays, more than any other, and the majority of our tours are well established, as they have been running for decades. We often introduce new itineraries, but the majority are tried and tested. No and low single supplement Our Scotland holidays continue to be so popular with guests that we have created as many low and no single supplement spaces as possible to ensure that our trips also cater to our valued solo travellers. No and low single supplement Our Scotland holidays continue to be so popular with guests that we have created as many low and no single supplement spaces as possible to ensure that our trips also cater to our valued solo travellers. Knowledgeable and experienced tour managers We have a team of highly experienced tour managers who know Scotland inside out, and as well as ensuring the holiday runs smoothly they will provide key facts and figures about each destination on the tour. Personal experience of the locations Between us, the members of the Brightwater team have personally visited every island and destination among our Scottish portfolio. We have extensive experience in our home country, which allows our tours to be the very best they can be. We cater for different needs and activity levels As our range of Scottish holidays is so broad, it means that we can cater for all kinds of interests – from ancient archaeological sites to island-hopping adventures -and activity levels. So, whether you want to sit back and enjoy the view or head out on an active walking tour, there’s something for everyone. We also value feedback shared by guests when they return from our carefully crafted holidays and here are some of our most recent reviews: “Very enjoyable look at a period of Scottish history of which we knew very little.” Guest – August 2024 “Enjoyable and Colin Crosbie is an attentive Tour Manager. Excellent coach driver who was very skilful negotiating some very narrow roads to visit the gardens. This is my third Brightwater holiday – my second with Colin and I will definitely be looking into another one next year.” Guest – July 2024 “From beginning to end a fabulous holiday with many memorable days and experiences.” Guest – October 2024 “One of the best holidays I have been on” Guest – October 2024 “A lovely small group, good weather, nice hotel and the variety of excursions made for a very pleasant five days.” Guest – October 2024 Our Awards We were delighted to win Gold for Best Small Travel Company for Coach Holidays at the 2024 British Travel Awards, adding to our successes in previous years. We were also voted Garden Tour Operator of the Year at the International Garden Tourism Awards in Canada. Our thanks go to everyone who voted for us. Additionally, we also won the Feefo 2024 Trusted Service Award for excellence in customer service throughout 2023, so you can book with Brightwater safe in the knowledge that your holiday will be operated by a multi-award-winning travel company. Previous accolades and continued success Elsewhere, recent years have been a wonderful journey for us, with our very own Jenni Duncan being named a finalist for the coveted Excellence Award, which rewards brilliant service to group travel organisers, and Brightwater being shortlisted for the Best Coach or Tour Operator at the Group Leisure and Travel Awards. We have also won a handful of British Travel Awards over the past few years, including Best Coach Holiday Company in 2020 and both Best Special Interest Holiday Company and Best Coach Holiday Company in 2019. Solo Travellers We know that a good proportion of our valued guests travel solo, which is why our attention has turned more than ever to reducing and eliminating single supplements where possible. In our recent annual survey, over 60% of our solo travellers told us that the most important factor when choosing a holiday was that it offered either a low single supplement or none at all, and we are working hard to ensure we can provide this. We continue to increase our single places year on year and we intend to carry on making our solo travellers feel more than welcome here at Brightwater. The next most important factor was enjoying a holiday with travel companions who share the same interest and with our collection of garden holidays and scenic Scottish tours, rest assured you will be in great company with like-minded guests. Another crucial part of the solo travel experience for Brightwater guests is the safety of taking a holiday with a group. We know it can be daunting to travel alone, but with Brightwater, you are never alone unless you choose to be. Our holidays are inclusive, informal and fun, and our guests are some of the most pleasant people you could care to meet. Friendships are formed and our tour staff are very much part of your group, making for convivial mealtimes and great chatter! Contact Contact Us Opening Hours Terms & Policies Travel Insurance Booking Conditions Privacy About About Blog Our Awards FAQs Group Travel Work for us ABTOT Gift Vouchers Activity Level Solo Travel Feefo Social BrightWater is part of Specialist Journeys, an award winning UK-based tour operator. By Propeller Contact Us Tour Enquiry The team is available Monday to Friday from 8am – 6pm (GMT) Call us: 646 802 1530 Tour Enquiry View/Request a Brochure Launch Live Chat"
    },
    {
      "url": "https://www.winknews.com/gulfshore_business/brightwater-lagoon-cuts-ribbon-on-6-acre-pool-amenity/article_012a1f5a-9640-4f32-8e16-4204c03d6264.html",
      "text": "Please wait while we attempt to load the requested page"
    }
  ]
}