{
  "fuentes": [
    {
      "url": "https://www.myempireenergy.com/contact",
      "email": "sales@myempireenergy.com"
    },
    {
      "url": "https://allmusiccorp.com/contact/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://miamisoundrental.com/about-us",
      "email": "info@miamisoundrental.com"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "email": "gvs-2025-@leylagulerphoto-5851-1024x683.jpg"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "email": "gvs-2025-@leylagulerphoto-5851-150x100.jpg"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "email": "gvs-2025-@leylagulerphoto-5851-1536x1024.jpg"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "email": "gvs-2025-@leylagulerphoto-5851-2048x1365.jpg"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "email": "gvs-2025-@leylagulerphoto-5851-300x200.jpg"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "email": "gvs-2025-@leylagulerphoto-5851-768x512.jpg"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "email": "gvs-2025-@leylagulerphoto-5851-scaled.jpg"
    },
    {
      "url": "https://www.miamisoundspace.com/who-we-are",
      "email": "info@miamisoundspace.com"
    },
    {
      "url": "https://www.miamisoundspace.com/who-we-are",
      "email": "laurah@miamisoundspace.com"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "letsparty@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "marketing@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "play@sound.london"
    },
    {
      "url": "https://sound.london/contact-us",
      "email": "r.ashcroft@verve.com"
    }
  ],
  "mails": [
    "gvs-2025-@leylagulerphoto-5851-1024x683.jpg",
    "gvs-2025-@leylagulerphoto-5851-150x100.jpg",
    "gvs-2025-@leylagulerphoto-5851-1536x1024.jpg",
    "gvs-2025-@leylagulerphoto-5851-2048x1365.jpg",
    "gvs-2025-@leylagulerphoto-5851-300x200.jpg",
    "gvs-2025-@leylagulerphoto-5851-768x512.jpg",
    "gvs-2025-@leylagulerphoto-5851-scaled.jpg",
    "info@miamisoundrental.com",
    "info@miamisoundspace.com",
    "laurah@miamisoundspace.com",
    "letsparty@sound.london",
    "logo@2x.png",
    "marketing@sound.london",
    "play@sound.london",
    "r.ashcroft@verve.com",
    "sales@myempireenergy.com"
  ],
  "nombre_sitio": "miamisound.bar",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.myempireenergy.com/contact",
      "text": "Contact | Reach Out Today — Trusted Power Solutions 0 Skip to Content Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Folder: Services Back Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Folder: Service Area Back Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Contact Us If you’re interested in learning more about the potential savings solar can do for your home, fill out the information below and we’ll contact you! \"By providing your phone number and/or email, you consent to receive automated and non-automated marketing calls, texts, and account-related updates from Empire Energy (401)-336-6798 . Consent is not a condition of purchase. Message & data rates may apply. Reply STOP to opt out.\" Name * First Name Last Name Email * Message * Phone (###) ### #### Thank you! Or you can email us at: Sales@MyEmpireEnergy.com Contact us About us Services Reviews (401)-336-6798 Support@MyEmpireEnergy.com Address 1007 Waterman Ave. East Providence, RI 02914 Company Follow us!"
    },
    {
      "url": "https://allmusiccorp.com/contact/",
      "text": "Contact Allmusic Miami Home Brand Adam Hall Amp Audio B&C Speakers Ciare DBX GatorCases Gravity JBL LD Systems Mc2 Audio Sennheiser Whirlwind Xta Electronics Categories Audio Management Cable Protectors Cables Connectors & Snakes Cases & Rack Panels Installed Sounds Live Sound Metal Stands Outlet Power Amplifiers Transducers Blog Contact Contact Home Contact Send us an Email Name * Email * Nationality Phone Message * Accept the Terms of Use* Send Message OPENING HOURS Monday – Friday: 9am to 5pm Come and take your order during the shop hours 6035 NW 87th Avenue  Miami, FL 33178 U.S.A. Phone: +1 (305) 599-8939 Email: [email protected] Shop Categories Audio Management Cable Protectors Cables Connectors & Snakes Cases & Rack Panels Installed Sounds Live Sound Metal Stands Outlet Power Amplifiers Transducers New Products Adam Hall Stands SKS 22 XBAG MORE INFO Adam Hall Stands SKT 17 MORE INFO Adam Hall Stands SKS 03 MORE INFO Adam Hall Stands SKS 01 MORE INFO Adam Hall Stands SPSG 3 B MORE INFO All Music Group INFO We believe in Simple , Creative & Flexible Design Standards. 6035 NW 87th Avenue  Miami, FL 33178 U.S.A. Phone: +1 (305) 599-8939 Email: [email protected] Brands B&C Speakers Mc2 Audio Xta Electronics GatorCases Amp Audio Sennheiser See more Recent Posts Subwoofer With Amplifier Signal Processing Speaker and Microphone Mixer For Music Installed Sound System Follow DHL EXPRESS We ship all over the world Tracked shipping AMPTM is a registered trademark of AllMusicCorp.  | Terms of Use / Privacy Policy [email protected] · +1 (305) 599-8939"
    },
    {
      "url": "https://miamisoundrental.com/about-us",
      "text": "About Us - Miami Sound Rental Miami Choose Store 305 974 4411 Login Rentals Sound Systems Speaker Rental Microphone Rental Karaoke Rental Visuals LED Video Wall Rental Projector Rental TV Rentals Staging Stage Risers Party Tents Pipe & Drape Stage Truss DJ Equipment CDJ Rental DJ Mixer Rental DJ Controller Rental Lighting Uplighting Rental Stage Lighting Rental Spotlight Rental Special Effects Cold Sparks Rental CO2 Cannon Rental Fog Machine Rental Services Corporate Events Pre Made Packages Concert & Live Events Live Streaming Event Portfolio Private Events AV Central Blog Business Partnerships Cart 0 We Are #1 Rated Audio Visual Partner in South Florida We offer a wide range of audio and visual equipment for rental and provide services for all kinds of events in South Florida. We specialize in providing audio-visual equipment solutions for events of various natures: Corporate : Meetings, conferences, team-building activities, product launches, trade-shows, etc. Private Events : Weddings, birthdays,home celebrations, etc. Public Events : festivals, fairs; political functions, etc. We offer a comprehensive, start-to-finish service that flexibly adapts to each client's needs. Our aim is to elevate the standards of service in the industry by leveraging our proprietary technology. We service all types of events , from private to large corporate conferences. We specialize in providing audio-visual equipment solutions for events of various natures: Corporate : Meetings, conferences, team-building activities, product launches, trade-shows, etc. Private Events : Weddings, birthdays,home celebrations, etc. Public Events : festivals, fairs; political functions, etc. We offer a comprehensive, start-to-finish service that flexibly adapts to each client's needs. Our aim is to elevate the standards of service in the industry by leveraging our proprietary technology. We service all types of events , from private to large corporate conferences. Our mission is to be your trustworthy AV partner. That's why, by leveraging our technology, we've developed a robust, yet agile, operations model that positions us as: Extremely Convenient We offer custom-made AV solutions for events of any type and size, and we do it in minutes thanks to our advanced technology. Quick & Transparent Our system automatically generates transparent and accurate pricing tailored to the actual needs of EACH event. Reliable Thanks to data-driven service planning and delivery, we ensure flawless execution and a significant reduction in human errors. We specialize in providing start-to-finish AV services for all types of events Meetings & Conferences Professional Audio Systems to ensure crystal-clear communication. Visual Solutions that enhance presentations. Lighting Design that sets the tone for meetings and presentations. Technical Support Conventions & Trade Shows Comprehensive Audio-Visual Solutions for diverse booth and stage requirements. Exhibit Booth Setup. Lighting Design that maximizes attendees engagement. Technical Support and Coordination. Entertainment & Live Events Professional Audio Systems for impeccable sound quality. Visual Solutions for live feeds and background visuals. Lighting Design to complement the mood of the event. DJ & Live Music Coordination Weddings & Celebrations Profesional audio that ensures excellent attendee experience. Visual Solutions that enhance the celebration experience. Lighting Design setting the tone for celebration. Technical Support and Coordination South Florida's #1 Rated AV Provider 5 / 5 4.9 / 5 5 / 5 We are doing a great job, but don't take our word for it. Here is what our clients think: Kathy Stamos Dec 27, 2023 It’s a pleasure to work with Mario and his team, they are quick, efficient, and professional. Have done a few events already and looking forward to many more Read this review on google Stephanie Van Tieghem Dec 4, 2023 We used Miami Sound Rental for a conference we were sponsoring. They were the perfect choice for the role. Easy to work with and arrived on time. Quick and efficient. We had to change a few things the week before the event and they were able to accommodate our changes with no issue. Read this review on google Erica Jerome Nov 2, 2023 Delivered on time and showed us exactly how to use the equipment and picked it up the next morning! Was perfect for my birthday party and would definitely use them again! Read this review on google Paulina Kucharska August 14, 2023 I Love this company. Professional, helpful, diligent and extremely punctual! Kate is the best - make sure you speak with her because she will Make it Happen! I highly recommend this company. Read this review on google Paul Himmel August 28, 2023 Called Mario Saturday afternoon, hot speakers delivered Saturday night!  Reliable, clean, on point! Read this review on google Josh Chalfant July 8, 2023 Miami Sound Rental saved the weekend for me! I was in a bind when I arrived in Miami, as I needed sound equipment (last minute) for a 100+ attendee private event in Key Largo on Sat 7/8. I called and spoke to Kate, and she was AMAZING!! I’m not a very tech savvy guy, but she talked through all of their options and they had everything I needed for my event. I showed up and they had all of the equipment ready for me. I will absolutely rent from them again when I’m in South Florida! Thank you, Kate and team! Read this review on google Christie Lenox May 30, 2023 Miami Sound Rental was excellent to work with!  They made everything so easy from start to finish.   The team was great to work with.  I would highly recommend them to anyone looking for an AV vendor. Read this review on google Guillermo Balseca March 5, 2023 Miami Sound Rental is top notch. I am a Project Manager based out of New Jersey. Planning an event in Miami seemed a little overwhelming at first until I got in Contact with Alex from Miami Sound Rental. He was very professional and knowledgeable of everything I was expecting. I will definitely use Miami Sound Rental again in the future and will recommend to any Producers needing planning done in Miami or anywhere in South Florida. Thank you for being part of making our event a great success. Read this review on google Katie Sebastiano Feb 12, 2023 Everything was very easy. They were here on time, they always had great communication with me and explained everything and answered all my questions right away. Their equipment was really nice and new and worked perfectly. Read this review on google Victoria Sepulveda Feb 4, 2023 Absolutely amazing service and professionalism. Delivery, set up and pick absolutely perfect. Thanks Read this review on google Oleg Safronov Dec 22, 2022 Outstanding service! Attentiveness to the smallest customer's details. Instant communications. Huge huge kudos to Mario and Pedro! Read this review on google Noelle Vander Hoff Dec 4, 2022 Pedro and his team are INCREDIBLE! We needed a last minute AV and Lighting crew for an event on a boat and he jumped right into the opportunity. They were extremely responsive the whole process. Not having a ton of experience with production, they were able to provide knowledge on how set up works, what products we would need to suit our event, and I didn’t feel like we were overcharged or scammed. Their whole team was kind, willing to roll with the punches and were hard workers throughout the whole event. Can’t speak highly enough of them.\n    \n        I would HIGHLY recommend Miami Sound Rental for any of your events. Read this review on google Carlos Sosa Nov 28, 2022 The attention to detail by everyone involved in my event was a pleasant surprise. The delivery and pick up timely to the minute. Also the equipment I rented looked new and of high quality. I will undoubtedly  keep doing business with you. Read this review on google Kristen Smith Nov 12, 2022 Absolutely amazing to work with! Kate and the AV team did a fantastic job working our corporate retreat for 3 days. Working with them was the smoothest part of planning the whole retreat. I cannot recommend them highly enough. They’re knowledgeable, affordable, and incredibly efficient. Justin is a great AV tech. Lao — he’s THE MAN! Do yourself a favor and make your event painless. Call Kate and let her help solve your AV problems. Thanks again! Read this review on google Camille Jules Oct 24, 2022 Such amazing customer service I am beyond satisfied with this company. Mario was very prompt, professional, and also very kind. From the first call consultation until the day of the event, I felt at ease. The set up was amazing and the equipment all worked so great! Thank you for helping to make my event setup a smooth one! Can’t wait to book again! I highly highly highly recommend this company. Read this review on google Caitlin Singles Oct 21, 2022 We hosted a seminar and rented a projector and some microphones from Miami Sound Rental. We had a great experience and will likely use them again for future seminars. Read this review on google View All Google Reviews Recent Events 1332 events serviced in 2025 Every month, we service more than 150 conferences and events, from small local meetings to large international ones. View Entire Portfolio Stadium Spectacle Showcase Wed Aug 13 2025 Vibrant School Kickoff Thu Aug 07 2025 Elevate Your Event Experience Tue Jun 17 2025 HCL Software Americas Business Partner Summit 2025 Thu Apr 10 2025 Electrifying Atmosphere at Formula E Prix Tue Apr 08 2025 Miami Powerhouse Conference Sun Mar 02 2025 Unforgettable Art Basel Popup Tue Dec 03 2024 Illuminate Your Vision at Eden Roc Wed Nov 06 2024 Dazzling Awards Show at Emanuel Luxury Venue Mon Oct 21 2024 Empowering Black Travel Summit Sat Oct 12 2024 Glamorous Wedding Fiesta at Kimpton Hotel Fri Oct 04 2024 Retirement Conference at Trump Doral Sat Aug 03 2024 Stellar 4th of July in North Miami! Thu Jul 04 2024 Cruise Ship Expo Thu Jun 06 2024 HCL Conference Wed Apr 17 2024 Ariana Grande event takes flight Thu Apr 11 2024 Lighting Show that Sparkle! Mon Mar 25 2024 Celebrating Two Years of R.A.D Performance Wed Jan 10 2024 Dazzling Magic at Takato Mon Jan 01 2024 Spellbound New Year's Eve Wedding Mon Jan 01 2024 American Mayors association conference at Fort Lauderdale Wed Nov 15 2023 Epic Karate Showdown Fri Nov 10 2023 Sonic Brilliance at AI, WEB3 & REAL ESTATE SUMMIT - MIAMI 2023, Fri Nov 03 2023 Anual Conference College Music Society at the Marriot Thu Oct 26 2023 Lights, Camera, Beauty! Sun Oct 22 2023 A Night of Celebration at Takato Thu Oct 19 2023 Pike Fraternity House Party Fri Sep 22 2023 Revolutionizing Conferences: Comply365 Wed Sep 13 2023 Magical Music Video Presentation Fri Aug 11 2023 Latto x WingStop Sat Jul 22 2023 YouTube Shorts Reunion Mon Jul 17 2023 Fashion Life Tour Fri Jul 07 2023 Summer Sweats Sat Jun 24 2023 Magen Boys Showcase Thu Jun 01 2023 Google Cloud Event Thu Apr 06 2023 Sothebys Intl. Realty Rooftop Event Wed Mar 15 2023 CyberBass Rave Sun Feb 19 2023 Fountainbleau Corporate Event Sat Jan 21 2023 Tech Conference at the Mondrian Tue Jan 17 2023 EGC 2022 Sat Nov 12 2022 Data Science Salon Wed Sep 21 2022 Events are Complex. We make them Simple. 305 974 4411 info@miamisoundrental.com CLOSED: Warehouse opens at 9:00 AM Rental Categories Sound Systems Speaker Rental Microphone Rental Karaoke Rental DJ Equipment CDJ Rental DJ Mixer Rental DJ Controller Rental Visuals LED Video Wall Rental Projector Rental TV Rental Staging Stage Rental Party Tent Rental Pipe & Drape Stage Truss Lighting Uplighting Rental Stage Lighting Rental Spotlight Rental Special Effects Cold Sparks Rental CO2 Cannon Rental Fog Machine Rental Production Experts Corporate Events Private Events & Parties Live Events: DJs & Music Live Streaming Services Pre-made Packages Production Portfolio Company Contact Us Orlando Branch About Us Careers Business Partnerships Terms of Service Privacy Policy 20227 NE 15th Ct, Miami FL 33179 Monday to Friday: 9:00 AM - 5:00 PM Saturday & Sunday: 9:00 AM - 12:00 PM AV Central AV Industry News & Trends Blog Your go-to blog for the latest in audio-visual equipment and live event trends. Expert guides, reviews, and insights for all AV enthusiasts. Follow Us Locations Miami Orlando Areas Serviced Miami Miami Beach Fort Lauderdale Palm Beach Coral Gables Aventura Boca Raton Jupiter Orlando Tampa Copyright 2025 Miami Sound Rental"
    },
    {
      "url": "https://www.decodedmagazine.com/club-space-owners-co-open-new-state-of-the-art-sound-space-jolene-sound-room-miami/",
      "text": "Club Space owners co-open new state-of-the-art sound space, Jolene Sound Room Miami - Decoded Magazine Skip to content Follow us: Facebook Twitter Instagram YouTube Snapchat More September 11, 2025 Search Search for: Authors About us Services Advertise Contact More Decoded Magazine Electronic Music Magazine News Decoded & Evermix Launch Partnership with Clive Henry at Sushisamba September 9, 2025 September 9, 2025 Guy J to deliver next Global Underground City Series Mix September 4, 2025 September 4, 2025 Submit your Mix of the Month DJ Competition entry September 1, 2025 September 8, 2025 Review – Balance Croatia 2025: A Progressive Paradise in Tisno August 26, 2025 August 26, 2025 The Crossroads: When Electronic Music Passion Collides with Life’s Realities August 20, 2025 August 20, 2025 UK New Music Venue ’77’ Set To Launch in Marylebone This September September 3, 2025 September 3, 2025 Decoded Magazine presents Clive Henry at Sushisamba London September 26th September 2, 2025 September 2, 2025 Nightmares on Wax Announces ‘IN A SPACE OUTTA DELIGHT’ A One-Night-Only Anniversary Show at Royal Albert Hall September 1, 2025 September 2, 2025 Passenger Presents: Adventures on Arran August 24, 2025 August 24, 2025 Review – Good Vibrations Society Festival August 20, 2025 August 22, 2025 Australia Interview – Breaking Beats and Breaking Boundaries: Kid Kenobi September 11, 2025 September 11, 2025 Event Review: Saturday Social x Decoded Magazine Boat Party June 25, 2025 June 26, 2025 Club 77 celebrates 28 years of Independence May 1, 2025 May 1, 2025 Decoded Magazine & Saturday Social Boat Party April 24, 2025 April 24, 2025 Waverley Council wants New Year’s Eve festival to return to Bondi Beach April 9, 2025 April 9, 2025 World The Secret Life of Ibiza: From Club Classics to Off-Grid Paradise Documentary July 30, 2025 July 30, 2025 Laurent Garnier set to host a Cod3 QR anniversary party May 15, 2025 May 15, 2025 Kyiv’s ∄ (K41) Welcomes Alinka as its first International Club Resident May 8, 2025 May 8, 2025 Jordan’s Medaina Festival announces cultural multi-day escape to Petra and Wadi Rum February 18, 2025 February 18, 2025 Laurent Garnier launches new monthly radio show September 6, 2024 September 6, 2024 Videos Music Premieres THE ORB drop new single taken from forthcoming album ‘Buddhist Hipsters September 10, 2025 September 10, 2025 To mark its 25th anniversary, AIR – The Virgin Suicides will be reissued on September 26 September 4, 2025 September 4, 2025 The Enduring Legacy of Fatima Yamaha’s “What’s A Girl To Do” August 29, 2025 August 29, 2025 Nick Warren releases new single ‘Turbulence’ ahead of his solo album August 25, 2025 August 25, 2025 Max Cooper “On Being” remixes featuring Lone, Bredren, Turtle and Sorcery August 22, 2025 August 22, 2025 Mixes Introducing MJ – August’s Decoded Magazine Mix of the Month Winner September 5, 2025 September 8, 2025 Decoded Magazine presents Simon Shackleton August 16, 2025 August 16, 2025 Mix of the Month July 2025 Winner – DJ LP August 1, 2025 August 15, 2025 Mix of the Month June 2025 winner – Uncle GRAMpa July 4, 2025 September 8, 2025 Decoded Magazine Presents: AFFKT – Interview and Exclusive Mix July 2, 2025 July 2, 2025 Lifestyle From Markets to Margaritas: The East London Day-to-Night Guide September 1, 2025 September 1, 2025 Classic Music Company announces 30th anniversary plans August 20, 2025 August 20, 2025 Roland Celebrates 45 Years of Rhythm Culture August 11, 2025 August 11, 2025 Irvine Welsh – Reality Is Not Enough trailer revealed ahead of September UK release August 5, 2025 August 5, 2025 Decoded City Guide – Paris with Manda Moor July 29, 2025 July 29, 2025 Tech The ELP Laser Turntable: When Japanese Precision Meets Vinyl Obsession August 22, 2025 August 22, 2025 Introducing the Native Instruments Massive X Player August 11, 2025 August 11, 2025 The Tiny Giant: How Sony’s MiniDisc Almost Changed Everything July 31, 2025 August 16, 2025 Vestax: The Rise and Fall of a DJ Icon July 29, 2025 July 29, 2025 Spin Class: The 10 Most Expensive Turntables in the World July 10, 2025 July 17, 2025 More Menu Decoded Magazine Electronic Music Magazine Search Search for: Club Space owners co-open new state-of-the-art sound space, Jolene Sound Room Miami News North America and Canada News North America and Canada July 11, 2023 July 12, 2023 Bar Lab Hospitality , Space Invaders and Link Miami Rebels have joined forces once again for Jolene Sound Room Miami , a one-of-a-kind sound space in Downtown on the legendary Flagler Street. Located in the basement of 200 E Flagler Street, the funky, retro-themed high energy sound room is complete with a state-of-the-art audio and light system designed to celebrate local music culture and Miami-based artists. The venue draws top talent from Miami’s thriving nightlife scene as well as the global dance music circuit to create an idyllic dance floor for locals and visitors alike. The whole venue has been spec’d out to be a perfect sound room with a full studio treatment. Inspired by the midcentury recording studios & 70’s leisure lifestyle, Jolene Sound Room Miami will boast an amazing custom-made sound system and all-around wood finishes to create a high energy sound room for Miami. A vision inspired by the past built for partygoers of the present and future, Jolene represents the third formal collaboration between hospitality pioneers Bar Lab Hospitality, and Link Miami Rebels | Space Invaders – a Miami-based nightlife trio formed In 2016. Space Invaders, which consists of III Points co-founder David Sinopoli and Miami nightlife veterans Davide Daneseand Coloma Kaboomsky of Link Miami Rebels, own the world renowned dance music haven Club Space , a revolutionary staple of Miami club culture. Bar Lab Hospitality founders Elad Zvi and Gabe Orta have become synonymous with service and quality from their award-winning Broken Shaker and more. Related Chicago house music summit Viva Acid confirms 2025 schedule & headliners Decoded & Evermix Launch Partnership with Clive Henry at Sushisamba The space, inspired by the fierceness and femininity of Dolly Parton, showcases the best of disco, house, and techno, with notable names and pillars of the international dance scene including, DJ Tennis , Soul Clap , and more who joined for the opening weekend of operation in May. DJ Ray will be spearheading programming efforts for the cutting edge sound room, which has an audio system developed by Nicolas Matar and Scott Ciungan of Phonic Technologies. Phonic Technologies, the award winning sound team behind legendary New York clubs Cielo and Output, takes a holistic approach to sound design that involves the careful study of a venue’s acoustics and the selection of finishes for optimal sound quality. The result must be experienced in person. Gabe Orta, Davide Danese, Coloma Kaboomsky, David Sinopoli, & Elad Zvi The design was inspired by late 1960’s-early 1970’s recording studios, with the Mad Artistics team accentuating some of the features that could be found in their design. Irregular in shape and floor plan, wood finishes backed with acoustic insulation are complemented with carpeting on the walls that mimic these retro sound recording studios. Jolene Sound Room Miami features a unique, specially curated menu of craft cocktails courtesy of the award-winning Bar Lab team and beverage director , Christine Wiseman. Alongside the inventive cocktail selection, guests can choose from an assortment of beer, wine, and bottle service options featuring vodka, tequila, Mezcal, gin, and champagne. Miami marks the second opening of the Jolene concept, with Jolene Sound Room Brooklyn , located in the heart of Williamsburg, having opened this past March. For more information and the latest programming updates, visit @JoleneSoundRoom and JoleneSoundroom.com Related Discover more from Decoded Magazine Subscribe to get the latest posts sent to your email. Type your email… Subscribe by Decoded Magazine Share Tweet Pin it Share Email More Tagged: Cocktails Electronica House Music Miami Music Industry Recording Studio Space Read Next Chicago house music summit Viva Acid confirms 2025 schedule & headliners September 9, 2025 September 9, 2025 Viva Acid, Chicago’s landmark House music initiative, returns October 2–5 for its fifth annual summit,… Decoded & Evermix Launch Partnership with Clive Henry at Sushisamba September 9, 2025 September 9, 2025 Some nights you know are going to be special before they even begin. The lineup’s… Guy J to deliver next Global Underground City Series Mix September 4, 2025 September 4, 2025 Global Underground are renowned for releasing the greatest mixes from the very best electronic artists… New York City Underground: A Cultural Guide Through the Eyes of Electronic Music Pioneer John Creamer September 2, 2025 September 3, 2025 New York City’s relationship with electronic music runs deeper than most realise. While Chicago birthed… Submit your Mix of the Month DJ Competition entry September 1, 2025 September 8, 2025 ENTRIES CLOSE ON 20 SEPTEMBER After a little bit of a hiatus, we have brought… Facebook X Instagram YouTube SoundCloud Privacy & Cookies: This site uses cookies. By continuing to use this website, you agree to their use. To find out more, including how to control cookies, see here: Cookie Policy About Authors About us Services Advertise Contact News UK World Videos Music Premieres Mixes Lifestyle Tech Facebook 106.0k Fans Authors About us Services Advertise Contact Follow Us Facebook X Instagram YouTube SoundCloud © 2020 Decoded Magazine . All Rights Reserved. Decoded Magazine Electronic Music Magazine News UK World Videos Music Premieres Mixes Lifestyle Tech Discover more from Decoded Magazine Subscribe now to keep reading and get access to the full archive. Type your email… Subscribe Continue reading"
    },
    {
      "url": "https://www.miamisoundspace.com/who-we-are",
      "text": "Who we are — Miami Sound Space 0 Skip to Content About Who we are Team Contact Donate Galleries FAQs Programs Miami Sound Choir The Bluebirds Threshold Singers Events Login Account DONATE Open Menu Close Menu About Who we are Team Contact Donate Galleries FAQs Programs Miami Sound Choir The Bluebirds Threshold Singers Events Login Account DONATE Open Menu Close Menu Folder: About Back Who we are Team Contact Donate Galleries FAQs Folder: Programs Back Miami Sound Choir The Bluebirds Threshold Singers Events Login Account DONATE We are taking the sounds of Miami into the spaces that need them. Welcome to Miami Sound Space, a forthcoming 501(c)3 organization! Our organization is dedicated to creating unforgettable musical experiences for all in Miami. Through diverse music-making opportunities, we inspire positive change, combat community deterioration, and ensure accessibility for everyone. Let's break down barriers, build bridges, and spread joy and unity through music. Join us on this remarkable journey of education, community building, and creating beautiful melodies of change in Miami! We currently have three programs: Miami Sound Choir Miami Sound Choir , our flagship ensemble, and Miami’s non audition, all-inclusive, adult community choir. The Bluebirds The Bluebirds , our men’s choir, made up of singers who are incarcerated at the Everglades Correctional Institution. Threshold Choir Our forming chapter of Threshold Choir , a small group of gentle voices and heartfelt melodies, singing at patients' bedsides and providing solace in various end-of-life services. Subscribe to our newsletter. Sign up with your email address to receive news and updates. Email Address Sign Up We respect your privacy. Thank you! EXPLORE Shop Galleries About Contact CONNECT WITH US LET’S BE FRIENDS Drop your email address to receive news and updates. No spam (scout’s honor) Email Address Sign Up Thank you!"
    },
    {
      "url": "https://sound.london/contact-us",
      "text": "Contact Us - Get in Touch | SOUND Skip to content Book A Table Menu Music Sports Christmas New Years Eve Book A Table Facebook Instagram TikTok CONTACT US SOUND Cafe Monday - Thursday: 11.00 am to 11.00 pm Friday & Saturday: 11.00 am to 11.30 pm Sunday: 11.00 am to 10.30 pm SOUND SPORTS BAR Monday - Thursday: 5.00 pm to 11.00 pm Friday: 5.00 pm to 11.30 pm Saturday: 11 am to 11.30 pm Sunday:11.00 am to 10.30 pm SOUND Bar Sunday - Wednesday: 11.00 am to 0.00 am Thursday, Friday & Saturday: 11.00 am to 2.00 am Opening Hours Get  in Touch Looking for more information? A host team is here to help, use the form below to send us a message. First Name * Email * Last Name Phone Number * Message * I'd like to receive news, offers and updates from SOUND Phone: 020 7479 5078 Come and Find us at: The Cumberland Hotel, Great Cumberland Place, Marble Arch, London, W1H 7DL Speak to Our Team General Enquiries Hello@sound.london Media Enquiries Marketing@sound.london Group Enquiries Letsparty@sound.london Artist Enquiries Play@sound.london First Name * Last Name * Email * I'd like to receive news, offers and updates from SOUND Stay in the Loop Sign up for the latest updates, exclusive offers, and events. Don’t miss out on all the exciting happenings at SOUND. Facebook Instagram TikTok Contact us Book a Table Group Booking The Cumberland Careers Partners Terms and Conditions Privacy Policy Cookie Policy 0207479 5078 The Cumberland Hotel,\nGreat Cumberland Place, Marble Arch, London, W1H 7DL © 2025 SOUND"
    }
  ]
}