{
  "fuentes": [
    {
      "url": "https://www.miamimusicfestival.com/career-institute",
      "email": "admissions@miamimusicfestival.com"
    },
    {
      "url": "https://www.miamimusicfestival.com/mmf-cruise",
      "email": "amarotc@aol.com"
    },
    {
      "url": "https://www.miamimusicfestival.com/mmf-cruise",
      "email": "olgafigueras@bellsouth.net"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "email": "info@aspenmusic.org"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "email": "studentservices@aspenmusic.org"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "email": "tickets@aspenmusic.org"
    },
    {
      "url": "https://immersivespacesymphony.com/miami/",
      "email": "press@feverup.com"
    },
    {
      "url": "https://caplinnews.fiu.edu/best-classical-music-events-in-miami/",
      "email": "press@feverup.com"
    },
    {
      "url": "https://www.miamimusicfestival.com/contact-us",
      "email": "admissions@miamimusicfestival.com"
    },
    {
      "url": "https://www.miamimusicfestival.com/contact-us",
      "email": "patrons@miamimusicfestival.com"
    }
  ],
  "mails": [
    "admissions@miamimusicfestival.com",
    "amarotc@aol.com",
    "info@aspenmusic.org",
    "olgafigueras@bellsouth.net",
    "patrons@miamimusicfestival.com",
    "press@feverup.com",
    "studentservices@aspenmusic.org",
    "tickets@aspenmusic.org"
  ],
  "nombre_sitio": "miamimusicfestival.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.miamimusicfestival.com/career-institute",
      "text": "Career Institute Only — Miami Music Festival 0 Skip to Content Home Events Events Calendar 2025 Program Book Immersive Opera Experiences Locations Students Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply About About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Open Menu Close Menu Home Events Events Calendar 2025 Program Book Immersive Opera Experiences Locations Students Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply About About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Open Menu Close Menu Home Folder: Events Back Events Calendar 2025 Program Book Immersive Opera Experiences Locations Folder: Students Back Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply Folder: About Back About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS CAREER INSTITUTE: June 13 – June 25, 2022 Beyond the musical training of a typical program, MMF offers a pioneering and intensive Career Institute for entrepreneurial participants during the summer session. While most musicians receive a high level of artistic training in formal education, they rarely receive instruction on how to actually make a living in the arts. The \"starving-artist\" is an all too familiar cliché MMF declines to perpetuate – a late-night bartending job is not conducive to an opera singer's needs, just as a \"9-to-5\" is not suitable to fulfilling the instrumentalist's potential. The Career Institute aims to give participants functional career skills to take charge of their artistic careers and prosper in an evolving economy. While many programs are giving a series of lectures, the MMF Career Institute goes beyond normal classes by guiding each participant in a series of personalized steps to realize their project. Students accepted into the Career Institute will receive instruction on how to: Cultivate an idea Form a company (LLC, non-profit, etc.) Establish a Board of Directors Establish a budget and financial plan Apply for funding, grants Develop a fundraising or donation base Create an attractive website Create a marketing plan Utilize cost-effective marketing to promote project including Social Media, online email marketing services and community partnerships Real-time experience in Arts Presenting and Production for MMF events Outreach: the reciprocal effects of involving the community Multiple classes will be taught by community experts and members of MMF’s development, web, outreach, and marketing teams, as well as Board Advisors and Founder and Artistic Director, Michael Rossi. Projects examples range from: Creating a teaching studio/school Promoting a chamber ensemble Promoting yourself as an individual artist Forming a contracting service Forming a large organization (orchestra, opera company, etc.) How to Apply MMF Participants Students interested in taking specific steps to becoming successful entrepreneurs in today’s industry will have the opportunity to do so as a student of MMF. All fully admitted students to any of the Miami Beach Classical Music Festival’s different performing institutes will receive free admission to all Career Institute classes. Special projects may be assigned to individuals in which express interest. Non-MMF Participants MMF will accept a limited number of participants from the Miami community who would like to take part in the career institute. To apply only for the career institute, please fill out our online application and send your resume and letter of interest to admissions@miamimusicfestival.com. Space in this course is limited in order to give the proper attention to each project and student. Tuition MMF Participants: Free Non-MMF Participants: $500 per 3-week session To apply, please fill the online application and email cover letter to our admissions office at admissions@miamimusicfestival.com \"No matter the level of artistic facility, it is imperative for all musicians to have an understanding of the music business in today's world. Artists must have the confidence and savvy to navigate the business-side of their art, and advocate for themselves and their organizations. In an evolving music industry, artists must take work into their own hands, maintaining support from their communities and audiences. While many established organizations face the struggles of a changing audience base and economy, a new breed of musician and organization emerges that thrives on adaptability, grit and innovation. The MMF career institute is a first step for these new emerging artists to gain confidence and experience in today's musical scene.\" Michael Rossi , MMF Founder and Artistic Director Miami Beach Classical Music Festival 1440 Ocean Drive Miami Beach, FL 33139 Follow us! Page Navigation About Events Students - Vocal Institutes - Instrumental Institute - Conducting Institute - Youth Program - Vocal Collaborative Institute Contact Us Sign up with your email address to receive news and updates. Name * First Name Last Name Email * Which type of email are you interested in? Admissions (for students and applicants) Events (for patrons) Both Thank you for subscribing!"
    },
    {
      "url": "https://www.miamimusicfestival.com/mmf-cruise",
      "text": "A Musical Extravaganza At Sea — Miami Music Festival 0 Skip to Content Home Events Events Calendar 2025 Program Book Immersive Opera Experiences Locations Students Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply About About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Open Menu Close Menu Home Events Events Calendar 2025 Program Book Immersive Opera Experiences Locations Students Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply About About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Open Menu Close Menu Home Folder: Events Back Events Calendar 2025 Program Book Immersive Opera Experiences Locations Folder: Students Back Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply Folder: About Back About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Miami Music Festival presents The brand new MSC Seashore features enhanced designed public spaces, including bars and restaurants, retail and entertainment venues, outdoor areas, and beautiful staterooms. The MSC Seashore has a stunning exterior designed with more outdoor space than other ships in its category, bringing guests closer to the sea with an aft that mirrors an iconic beach condo. It also features the innovative MSC for Me technology, providing a higher level onboard experience. MSC Seashore, with its glamorous design features, takes cruising to a whole new level. This year’s talent comes from the Miami Music Festival which has become one of the premiere classical music festivals in the country. There will be more variety of entertainment, vocally and instrumentally, created by Michael Rossi, Director of the festival. You may truly look forward to a new experience. Performing Artists and exciting programming will be announced in October. DON'T MISS THE BOAT! Itinerary Day 1  Sat, January 15 - Miami, FL - Embarkation (Port of Miami) Day 2  Sun, January 16 - At Sea Day 3  Mon, January 17 - Ocho Rios, Jamaica Day 4  Tues, January 18 - Georgetown, Cayman Islands Day 5  Wed, January 19 - Cozumel, Mexico Day 6  Thurs, January 20 - At Sea Day 7  Fri, January 21 - Ocean Cay, MSC Marine Reserve, Bahamas Day 8  Sat, January 22 - Miami, FL - Disembarkation Important Information: -  Passport required and must be valid for at least 6 months beyond the return date. -  All guests must be fully vaccinated and must comply with COVID related protocols including vaccines, testing, and any other guidelines provided by MSC and the CDC. Reserved guests will be updated periodically. Contacts: For reservations and travel information, please contact: Norma Amaro (Amaro Travel Consultants, Inc.) Business: 305-275-2850 | Mobile: 305-989-1068 E-mail: amarotc@aol.com | FL Seller of Travel # ST21757 For other operational questions, please contact: Olga Figueras | 305-733-2959 | E-mail: olgafigueras@bellsouth.net Miami Beach Classical Music Festival 1440 Ocean Drive Miami Beach, FL 33139 Follow us! Page Navigation About Events Students - Vocal Institutes - Instrumental Institute - Conducting Institute - Youth Program - Vocal Collaborative Institute Contact Us Sign up with your email address to receive news and updates. Name * First Name Last Name Email * Which type of email are you interested in? Admissions (for students and applicants) Events (for patrons) Both Thank you for subscribing!"
    },
    {
      "url": "https://www.aspenmusicfestival.com/about/staff",
      "text": "Staff | Aspen Music Festival And School Donate Buy Merchandise Buy Tickets PDF Calendar events school support about community Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct Programs for Local Youth School Year Programs Hire a Musician cancel events Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams school About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty support Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities about About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct community Programs for Local Youth School Year Programs Hire a Musician 09 cancel Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct Programs for Local Youth School Year Programs Hire a Musician 02 01 About the AMFS 03 02 01 Culture, Excellence, Access 03 02 01 Board and National Council 03 02 01 Festival Leadership 03 02 01 Board of Trustees 03 02 01 National Council 03 02 01 Corporation 03 02 01 Trustee Secure Area 03 02 01 2025-26 AMFS Board of Trustees 03 02 01 Board Committees 03 02 01 Key Contacts 03 02 01 Board Meeting Packets 03 02 01 Strategic Plan 03 02 01 Music Associates of Aspen Bylaws 03 02 01 Conflict of Interest Policy 03 02 01 Disclosure and Compliance Form (please sign) 03 02 01 Financial Documents 03 02 01 Staff 03 02 01 Employment 03 02 01 Publications 03 02 01 Deep Focus: Enriching the Aspen Experience 03 02 01 Festival Focus 03 02 01 2025 03 02 01 2024 03 02 01 2023-2015 03 02 01 Podcast - High Notes 03 02 01 AMFS on Spotify 03 02 01 Annual Report 03 02 01 Student Spotlight 03 02 01 Season Calendar Request Form 03 02 01 Convocation 03 02 01 Press Area 03 02 01 Press Releases 03 02 01 News Room 03 02 01 AMFS Code of Conduct 03 Staff General Inquiries Name / Title Email Address Phone Number Administration .(JavaScript must be enabled to view this email address) 970 925 3254 Alumni Correspondence .(JavaScript must be enabled to view this email address) 970 205 5052 Box Office .(JavaScript must be enabled to view this email address) 970 925 9042 Student Services Office .(JavaScript must be enabled to view this email address) 970 205 5050 Executive Office Name / Title Email Address Phone Number Alan Fletcher Munroe President and CEO .(JavaScript must be enabled to view this email address) 970 205 5011 Susanne Morrison Executive Assistant .(JavaScript must be enabled to view this email address) 970 205 5011 Jennifer Brown Elliot Vice President for Special Projects .(JavaScript must be enabled to view this email address) 970 205 5040 Finance and Administration Name / Title Email Address Phone Number Hilary Respass Vice President and Chief Operating Officer .(JavaScript must be enabled to view this email address) 970 205 5046 Deisy Kessler Chief Financial Officer .(JavaScript must be enabled to view this email address) 970 205 5041 Tessa Lemke Finance Assistant .(JavaScript must be enabled to view this email address) 970 205 5044 IT and HR Name / Title Email Address Phone Number Fritz Grueter Manager of Information Services .(JavaScript must be enabled to view this email address) 970 205 5045 Charlie Fields Accounting Director .(JavaScript must be enabled to view this email address) 970 205 5042 Facilities Name / Title Email Address Phone Number Matthew Bergdahl Director of Facilities .(JavaScript must be enabled to view this email address) 970 205 5029 Tim Rafferty Facilities Technician .(JavaScript must be enabled to view this email address) 970 205 5029 John Hammarback Facilities Technician .(JavaScript must be enabled to view this email address) 970 205 5029 Artistic Administration Name / Title Email Address Phone Number Patrick Chamberlain Vice President for Artistic Administration .(JavaScript must be enabled to view this email address) 970 205 5030 Joseph Pfender Editor-in-Chief, Programs .(JavaScript must be enabled to view this email address) 970 205 5032 Katie Brill Associate Artistic Administrator .(JavaScript must be enabled to view this email address) 970 205 5031 Operations Name / Title Email Address Phone Number Kate Northfield Lanich Vice President and General Manager .(JavaScript must be enabled to view this email address) 970 205 5022 Beth Noble Director of Operations .(JavaScript must be enabled to view this email address) 970 205 5021 Timothy Hsu Housing Director .(JavaScript must be enabled to view this email address) 970 205 5028 Kyle Schick Director of Production .(JavaScript must be enabled to view this email address) 970 205 5027 Nicole Mendyka Manager of Personnel .(JavaScript must be enabled to view this email address) 970 205 5024 Student Services Name / Title Email Address Phone Number Azusa Chapman Vice President and Dean of Students .(JavaScript must be enabled to view this email address) 970 205 5053 Ronte’ Hardy Assistant Dean of Admissions and Student Life .(JavaScript must be enabled to view this email address) 970 205 5054 Megan McDevitt Assistant Dean of Enrollment and Student Programming .(JavaScript must be enabled to view this email address) 970 205 5052 Education and Community Name / Title Email Address Phone Number Heather Kendrick Stanton Vice President for Education and Community .(JavaScript must be enabled to view this email address) 970 205 5057 Lindsay Bobyak Manager of Education and Community Programs .(JavaScript must be enabled to view this email address) 970 205 5055 Veronica Lopez Education and Community Coordinator .(JavaScript must be enabled to view this email address) 970 205 5059 Marketing and Communications Name / Title Email Address Phone Number Laura E. Smith Vice President for Marketing and Communications .(JavaScript must be enabled to view this email address) 970 205 5070 Jessica Moore Senior Director of Marketing and Global Communications .(JavaScript must be enabled to view this email address) 970 205 5075 Bonnie Shappell Director of Ticket Services .(JavaScript must be enabled to view this email address) 970 205 5025 Justin Bak Communications Manager .(JavaScript must be enabled to view this email address) 970 205 5078 Kristin Cleveland Publications Manager .(JavaScript must be enabled to view this email address) 970 205 5073 Emma Kirby Marketing Manager .(JavaScript must be enabled to view this email address) 970 205 5072 Diane Stine Archive Manager and Guest Services .(JavaScript must be enabled to view this email address) 970 205 5074 Advancement Name / Title Email Address Phone Number Austin Stewart Vice President for Advancement .(JavaScript must be enabled to view this email address) 970 205 5060 Lenor Leeds Associate Vice President for Advancement .(JavaScript must be enabled to view this email address) 970 205 5062 Chandler Martin Director of Annual Giving and Special Events .(JavaScript must be enabled to view this email address) 970 205 5065 Kat Berg Donor Stewardship Manager .(JavaScript must be enabled to view this email address) 970 205 5061 Grant Strom Advancement Manager .(JavaScript must be enabled to view this email address) 970 205 5064 Elana Weiner Annual Fund and Special Events Coordinator .(JavaScript must be enabled to view this email address) 970 205 5066 Leah Podzimek Institutional Giving Specialist .(JavaScript must be enabled to view this email address) 970 205 5063 09 02 01 About the AMFS 03 02 01 Culture, Excellence, Access 03 02 01 Board and National Council 03 02 01 Festival Leadership 03 02 01 Board of Trustees 03 02 01 National Council 03 02 01 Corporation 03 02 01 Trustee Secure Area 03 02 01 2025-26 AMFS Board of Trustees 03 02 01 Board Committees 03 02 01 Key Contacts 03 02 01 Board Meeting Packets 03 02 01 Strategic Plan 03 02 01 Music Associates of Aspen Bylaws 03 02 01 Conflict of Interest Policy 03 02 01 Disclosure and Compliance Form (please sign) 03 02 01 Financial Documents 03 02 01 Staff 03 02 01 Employment 03 02 01 Publications 03 02 01 Deep Focus: Enriching the Aspen Experience 03 02 01 Festival Focus 03 02 01 2025 03 02 01 2024 03 02 01 2023-2015 03 02 01 Podcast - High Notes 03 02 01 AMFS on Spotify 03 02 01 Annual Report 03 02 01 Student Spotlight 03 02 01 Season Calendar Request Form 03 02 01 Convocation 03 02 01 Press Area 03 02 01 Press Releases 03 02 01 News Room 03 02 01 AMFS Code of Conduct 03 07 06 Robert Spano , Music Director 02 Alan Fletcher , Munroe President and CEO Administrative Offices 02 225 Music School Road Aspen, CO 81611, USA 04 Get directions 02 +1 970 925 3254 02 info@aspenmusic.org Box Office 02 960 North 3rd Street Aspen, CO 81611, USA 04 Get directions 02 +1 970 925 9042 02 tickets@aspenmusic.org Student Services Office 02 225 Music School Road Aspen, CO 81611, USA 04 Get directions 02 +1 970 205 5050 02 studentservices@aspenmusic.org 07 07 Events Calendar Tickets/Box Office 2025 Program Book Plan Your Visit Virtual Stage 2025 Livestreams Support Make a Contribution Brand Partnerships Planned Giving Government and Foundation Support Rent or Provide Housing Volunteer Advertising Opportunities About About the AMFS Culture, Excellence, Access Board and National Council Staff Employment Read and Listen Convocation Press Area Code of Conduct School About the School Admissions Programs of Study Student Handbook Faculty Portal Alumni Hub Artist-Faculty 07 Community Programs for Local Youth School Year Programs Hire a Musician 07 07 Follow Us 06 Check out our Instagram 04 Join us on Facebook 04 Check out our Tweets 04 Watch AMFS videos on Youtube 04 Listen to AMFS on Spotify 04 AMFS on LinkedIn 07"
    },
    {
      "url": "https://immersivespacesymphony.com/miami/",
      "text": "Immersive Space Symphony in Miami - Classical Music Show THE EXPERIENCE PRACTICAL INFO LOCATION FAQS en es ð ðThe cosmic journey continues! Use Code: INTERSTELLAR20 â¨ Get 20% Off! 11 Days 5 Hours 13 Minuts 16 Seconds MIAMI Immersive Space Symphony: Music of Hans Zimmer A cosmic tribute to Hans Zimmerâlive with 360Â° visuals. A space odyssey brought to life through sound and stars Tickets are now on sale! Get your tickets! Immersive Space Symphony: Music of Hans Zimmer in Miami Where modern technology reinvents classical music. Back by popular demand after seven weeks of sold-out performances, Immersive Space Symphony returns for its second year with an all-new experience Immersive Space Symphony: Music of Hans Zimmer. This yearâs edition takes audiences on a breathtaking multisensory journey through the iconic music of legendary composer Hans Zimmer. Featured Soloists Siobhan Cronin: Electric Violin Blending classical finesse with rock power, Siobhan Cronin is a genre-defying electric violinist who has toured the world with STARSET and performed alongside icons like Michael BublÃ©, Andrea Bocelli, and Trans-Siberian Orchestra. With over 2 billion streams, appearances in Forbes, and a #1 rock single, Siobhan is as much a showstopper on stage as she is in the studio. Her performances fuse cutting-edge tech with raw virtuosity, making every show a high-voltage experience. Clarissa Vieira â Electric Cello Nicknamed the âCello Goddess,â Clarissa Vieira captivates with her elegant yet powerful style on both acoustic and electric cello. From Brazilâs Amazon Cello Choir to performances with Joshua Bell and Lynn Harrell, she brings passion, poise, and flair to every stage. Now based in Florida, Clarissa continues to light up concerts, events, and collaborations with her bold artistry and unmistakable presence. Practical Info Date: From July 26th, 2025 Opening hours: From 5:00 p.m. Price: Tickets start at $31 USD Location: ELV 1723 Washington Ave Miami Beach, 33139 Get tickets Reviews See what others are saying about Immersive Space Symphony Patrick D. The performers were exceptional and I was fully immersed in the visuals. Erika D. Everything was amazing and professionally performed. I loved the Immersive Space Symphony!! Highly recommended! Lisa S. Incredible experience. It felt very personal, approachable and cozy while keeping musical standards extremely high Robin W. Beautiful event ! Never experienced anything like this before Daniel C. Absolutely mesmerizing! The combination of live orchestral music with space visuals was breathtaking. A must-see experience. Nicolas O. Magnificent! A gift to the community! Thank you, thank you, thank you!!! Jack B. I loved this event and the talent at the show was unreal!!!! SofÃ­a F. Beautiful performance and incredible visuals! Felt like I was floating through space. Overall a fantastic experience. Locations ELV 1723 Washington Ave Miami Beach, 33139 Metrorail, Metromover, and Metrobus all provide low-cost or free ways for you\nto get around Miami without splurging on taxis, rideshares, or rental cars.\nNot only is public transit an excellent way to see the sights, it's also great\nfor the environment and a smart way to avoid parking and garage fees. FAQs Do you have any questions? You might find the answer here! Reveal FAQs THE EXPERIENCE What can I expect from the event? Back by popular demand after seven weeks of sold-out performances, The Space Symphony returns for its second year with an all-new experience. This yearâs edition takes audiences on a breathtaking multisensory journey through the iconic music of legendary composer Hans Zimmer. Where is the experience located? The concert series will take place at Temple Emanu-El. In our new immersive ballroom (1701 Washington Ave Miami Beach, FL 33139). Does the experience take place in an indoor or outdoor venue? This experience is held indoors in an air-conditioned venue. How long does the experience last? For you to have an estimate, the concert will last about 60 min. Will food and beverages be available for purchase on site? A full bar is located in the lobby for drink purchases. Is there parking available? There is street parking available in the surrounding area, as well as several parking garages nearby. The closest garage is the 17th Street Garage, conveniently located across from the Miami Beach Convention Center. Will there be additional sessions? Unfortunately, we cannot guarantee there will be extra dates. Please refer to the experience page for updated information on availability, as those are the confirmed dates and timings. Is there a dress code? There's no defined dress code for this experience; a casual look will be fine. TICKETS Where can I get tickets? In the Fever App, available on Google Play and the Apple Store or on the Fever website. Can I purchase tickets at the door? We will have a box office on site. However, tickets may be sold out by the time you arrive at the event, so we highly recommend you book your tickets in advance in order to guarantee your spot. You can purchase tickets in the Fever App or on the Fever website. Can I transfer my tickets to another person? Yes, you can transfer your tickets to anyone for free. It is as easy as clicking \"Transfer Tickets\" on your ticket on the Fever App. Please contact us for additional help. Make sure to include your ticket order number. Do I need to print my ticket? You can find your ticket in the \"Tickets\" section of the Fever app (you can download it from the Apple App Store or Google Play ). Please remember to log in with the same login method used to make the purchase.\nYou will also find your QR code in your purchase confirmation email. I can't find my ticket. What should I do? You can view your ticket in the Fever app, within the Tickets section. If you don't have the app installed, you can download it from the Apple Store or Google Play . Remember to log in using the same account that you used when buying the tickets. If you still cannot find your ticket, please contact us . Can I change the date of my ticket? Are refunds allowed? This experience allows date changes up to 48 hours in advance. If you would like to make the change, please contact us and include the ticket ID associated with your purchase. One of our agents will respond to your request as soon as possible, informing you of the next steps to follow. No refunds are permitted under any circumstances. For more information, you can consult our T&C . Can I make a group booking? You can make group bookings up to the amount of tickets our app/web allows you to purchase (based on availability). No special group bookings will be made for this event. Do you offer press passes? Unfortunately, there won't be press passes offered for this event. ACCESS Do I need to arrive at the start of my scheduled session? The show begins at the time on your ticket. We recommend getting to the venue 30 minutes early to allow enough time for parking and finding your seat. Once the show begins, late entry will not be permitted as it will disturb the show for the audience. Can I bring animals? Are service dogs allowed? Only service animals as defined by the ADA are permitted with proper identification. Pets and emotional support animals are not allowed. Service dogs must remain under ownerâs control at all times. Is the venue accessible? Yes, the event is being held in an accessible venue. What are the prohibited items at the experience? Flash photography, alcohol, and anything that may disturb the other patrons. Smoking and vaping are not allowed. Is the experience accessible for deaf/visually impaired people? Our experience merges audio and visual elements, making it accessible and enjoyable for both deaf and visually impaired individuals. We strive to create an inclusive environment where everyone can participate and engage fully. Will there be strobe lights? Yes, the projections do create the effect of Strobe Lights.  Be advised that this production will incorporate projections with fast-moving graphics, which may cause vertigo or dizziness in some viewers. Are there chairs available? Can I be seated during the experience/exhibition? This is a seated experience, so seating will be available for every guest. Will restrooms be available on site? This venue has restroomsâplease ask our staff on site for directions. Can I take photos or record the experience? Taking photos or recording videos during the performance is strictly prohibited to ensure everyone enjoys the experience to its fullest. Photography/videography is only allowed before and after the performance. Please note that professional equipment and tripods are not permitted. Is there a Lost & Found? We would recommend to ask the staff at the venue if they have found your belongings. Is a coat check available? Unfortunately, this venue has no coat check. Is there a Lost & Found? We would recommend to ask the staff at the venue if they have found your belongings. Organized by In partnership with Media partner Contact Press Affiliates Influencers Â© 2024 Fever. Miami Beach Classical Music Festival Â© Immersive Space Symphony. All Rights Reserved. This site is created and operated by Fever Labs. Inc\n Â© 2025 FEVER PRIVACY POLICY"
    },
    {
      "url": "https://caplinnews.fiu.edu/best-classical-music-events-in-miami/",
      "text": "Best classical music events in Miami - Caplin News Best classical music events in Miami - Caplin News Facebook Instagram Twitter Youtube Home News Business DC Bureau Education Environment Immigration Culture Guess What? Calendar ArtSpeak Features South Florida Access Sports Phin Tank Sideline En Español Noticiero Miami’s Best About Awards About Caplin News Contributors About the Lee Caplin School of Journalism & Media About FIU Search Thursday, March 6, 2025 Events About Us Caplin News Home News From the 305 to the 202: Celebrating Miami in the nation’s capital (includes video story) North Carolina fears more damage this weekend after Hurricane Helene’s high winds (includes video story) The Frost Science Museum hosts Technology and Engineering Day (includes video story) Venezuelan community meets in Sunrise to discuss TPS and other challenges (includes video story) 305 Lifetime Race brings energy to South Beach (includes video story) All Business DC Bureau Education Environment Immigration Culture South Beach Wine and Food Festival hosts Foodiecon at the Mondrian South Beach (includes video story) Dinosaurs visit Zoo Miami (includes video story) NAEMI breaks mental health stigmas with new exhibitions (includes video) Coconut Grove Arts Festival returns with a vibrant celebration of creativity (includes video story) Civil rights pioneers honored in Brownsville during Black History Month (includes video story) All Guess What? Calendar ArtSpeak Features At 21, this Venezuelan baker turned his dreams into a reality (includes video story) She couldn’t find a school in Bolivia for her autistic daughter, so they moved to Miami “Soul Man” Sam Moore passes at 89, leaves behind strong FIU legacy (includes video story) She’s fighting multiple sclerosis and needs a mobility scooter to keep up with her child He thought his childhood cancer was gone. But more than a decade later, it returned All South Florida Access Sports FIU baseball loses to Canes in historic game at LoanDepot Park (includes video story) Sideline: Inter Miami season starts, FIU vs UM, and going Bananas. FIU baseball team faces UM at LoanDepot Park (includes video story) Savannah Bananas visit Miami (includes video story) The MLS is back as Inter Miami starts the biggest season in club history (includes video story) All Phin Tank Sideline En Español Congresista habla con venezolanos de Florida sobre TPS y otros retos (incluye video) Trump presenta primer discurso ante el Congreso tras su regreso a la presidencia (incluye video) Restricciones de vacaciones de primavera afectan a comerciantes de South Beach (incluye video) Noticiero, 5 de marzo del 2025 Fallece Lincoln Díaz-Balart, excongresista y político del sur de Florida (incluye video) All Noticiero Miami’s Best About Awards About Caplin News Contributors About the Lee Caplin School of Journalism & Media About FIU ​​Adrienne Arsht Center concert hall (courtesy of the Arsht Center) Miami's Best Best classical music events in Miami By Daniela Morales and Gabriela Flores - February 23, 2024 Share Facebook Twitter Linkedin Email Copy URL Miami is best known for its vibrant nightlife, delicious cuisine and stunning beaches. However, in recent years there has been significant growth in classical music with various organizations setting up shop and sponsoring events. Scores of live events from those that play concerto to chamber music are held from Kendall to Aventura. They can help people to connect, release stress, and take a break from the demands of everyday life. The Candlelight Experience (Courtesy of Fever Press). Candlelight Concerts Various locations Instagram An unforgettable experience is offered by a company called Fever, which holds events in concert halls, historic churches, art galleries, and even outdoor settings. The elegance and intimate atmosphere of candles are combined with different styles and genres of classical music to create an unforgettable experience. String quartets and small groups of musicians such as the Listeso String Quartet perform work from movie soundtracks to tributes to artists such as ABBA, Amy Winehouse, Luis Miguel, and Adele. To see a full list of the concerts visit their website or contact them through press@feverup.com . They offer private events as well as student, military personnel, and senior discounts. All attendees must be at least age 8, and some events are pet-friendly. The prices generally range from $26 to $45. Their next show will be on February 25 featuring The Best of Frank Sinatra & Nat King Cole . Piano recital at Miami Beach. (Photo by Gabriela Flores/Caplin News) The Wolfsonian-Florida International University 1001 Washington Ave. Miami Beach, FL 33139 305-531-1001 Instagram Get on board for a multi-sensory journey at The Wolfsonian, where the combination of classical music and masterpieces creates a unique and rich atmosphere, giving visitors a memorable and culturally rich experience on Miami Beach. The participating artists, such as cellist Jason Calloway, come from all around the world and are recipients of prestigious awards. The Wolfsonian is also home to one of the nation’s largest university art collections. Members, Florida residents, Visitors with disabilities, students with ID, faculty, and staff obtain free entrance. Tickets for others cost between $8 to $12. Their next show will be on March 6, Featuring Orlando Jacinto Garcia’s “Those at Peace Shall See Their Wake”. Adrienne Arsht Center concert hall. (courtesy of ​​Adrienne Arsht Center’s official website) Visit Adrienne Arsht Center 1300 Biscayne Blvd. Miami, FL, 33132 305-949-6722 Instagram: https://www.instagram.com/arshtcenter/ The Adrienne Arsht Center of the Performing Arts in Miami is known for captivating its audiences with the amazing and diverse world of classical music. Bringing musicians from the best symphonies to chamber music, it regularly hosts world-class orchestras such as the Cleveland Orchestra, New World Symphony, and Vienna Philharmonic. Audiences enjoy classical masterpieces, contemporary works, and solo performances. Local musicians, teachers, and historians offer lectures before each performance of the Knight Masterworks Classical Music series for one hour about the background of what audiences will delight in at the concert. The Arsht Pass offers $25 tickets for students. The Adrienne Arsht Center box office is open from Monday through Friday from noon to 5 p.m.. The Rotterdam Philharmonic plays on March 7 . The Friends of Chamber Music of Miami. (courtesy of ContastContact the Friends of Chamber Music of Miami’s Facebook official page) Visit the Friends of Chamber Music of Miami 509 Navarre Ave. Coral Gables, Fl 33134 305-209-8728 Facebook The Friends of Chamber Music of Miami hosts captivating events that present the timeless elegance of music. Attendees can anticipate a rich and diverse repertoire, spanning eras, and styles, showcasing the dynamic capacity of chamber music. Since 1955, internationally acclaimed performers have performed in the series, including the Budapest, Juilliard, Guarneri, Emerson, Cleveland, and Beaux Arts Quartets. Most of the series’ concerts are performed at the acoustically superb Gusman Concert Hall at the University of Miami, the Colony Theatre, Wertheim Auditorium at Florida International University, Temple Beth Am, Coral Gables Congregational Church, and other distinguished venues across South Florida. The next show will be on March 4 by Trio Zimbalist and Robert Diaz . Daniela Morales Daniela Morales is a junior at Florida International University majoring in Digital Broadcasting . After graduating , her goal is to work for a prestigious news channel and travel all around the worl d to cover news and stories. Gabriela Flores Gabriela Flores is a junior majoring in Digital Journalism and Broadcasting with a minor certificate in International Relations. She wishes to pursue a career in the film industry and work for the United Nations. Share Facebook Twitter Linkedin Email Copy URL Previous article Noticiero, 22 de febrero del 2024 Next article Newsbreak February 23, 2024 Daniela Morales and Gabriela Flores RELATED ARTICLES MORE FROM AUTHOR Miami's Best Top five films based in South Florida Miami's Best Jammin’ in the 305: Five Miami vinyl shops you can’t miss Miami's Best Top free museums to visit in Miami Miami's Best Top five French bakeries in South Miami/Pinecrest Miami's Best Top five places to visit in Hialeah FIU Biscayne Bay Campus Academic II, Media Hub 3000 NE 151st St, Miami, FL 33181 Contact us: E-Mail: caplinnews@gmail.com Events About Us © Caplin News"
    },
    {
      "url": "https://www.miamimusicfestival.com/contact-us",
      "text": "Contact Us — Miami Music Festival 0 Skip to Content Home Events Events Calendar 2025 Program Book Immersive Opera Experiences Locations Students Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply About About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Open Menu Close Menu Home Events Events Calendar 2025 Program Book Immersive Opera Experiences Locations Students Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply About About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Open Menu Close Menu Home Folder: Events Back Events Calendar 2025 Program Book Immersive Opera Experiences Locations Folder: Students Back Vocal Institutes Instrumental Institute Conducting Institute Youth Program Alumni Locations Apply Folder: About Back About MMF Jobs & Internships Donors & Sponsors Community Outreach Contact Us BUY TICKETS Contact Us For ticket sales and events: patrons@miamimusicfestival.com For programs, applicants, and participants: admissions@miamimusicfestival.com 1440 Ocean Drive Miami Beach, FL 33139 Name * First Name Last Name Email * Message * Thank you! We will get back to you as soon as possible. Miami Beach Classical Music Festival 1440 Ocean Drive Miami Beach, FL 33139 Follow us! Page Navigation About Events Students - Vocal Institutes - Instrumental Institute - Conducting Institute - Youth Program - Vocal Collaborative Institute Contact Us Sign up with your email address to receive news and updates. Name * First Name Last Name Email * Which type of email are you interested in? Admissions (for students and applicants) Events (for patrons) Both Thank you for subscribing!"
    }
  ]
}