{
  "fuentes": [
    {
      "url": "https://miamidadearts.org/about/staff-councils",
      "email": "ashlee.thomas@miamidade.gov"
    },
    {
      "url": "https://miamidadearts.org/about/staff-councils",
      "email": "kellya@miamidade.gov"
    },
    {
      "url": "https://miamidadearts.org/about/staff-councils",
      "email": "nikenna.smart@miamidade.gov"
    },
    {
      "url": "https://miamidadearts.org/about/staff-councils",
      "email": "stephanie.antequera@miamidade.gov"
    },
    {
      "url": "https://miamidadearts.org/about/staff-councils",
      "email": "winick@miamidade.gov"
    },
    {
      "url": "https://www.ameliaearhartmuseum.org/contact",
      "email": "tours@ameliaearhartmuseum.org"
    },
    {
      "url": "https://www.cloudofgoods.com/amelia-earhart-park-party-rental-miami-fl-26644_1_21_38_26644",
      "email": "info@cloudofgoods.com"
    },
    {
      "url": "https://www.cloudofgoods.com/amelia-earhart-park-party-rental-miami-fl-26644_1_21_38_26644",
      "email": "press@cloudofgoods.com"
    }
  ],
  "mails": [
    "ashlee.thomas@miamidade.gov",
    "info@cloudofgoods.com",
    "kellya@miamidade.gov",
    "nikenna.smart@miamidade.gov",
    "press@cloudofgoods.com",
    "stephanie.antequera@miamidade.gov",
    "tours@ameliaearhartmuseum.org",
    "winick@miamidade.gov"
  ],
  "nombre_sitio": "miamidade.gov",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://miamidadearts.org/about/staff-councils",
      "text": "Staff & Councils | Miami-Dade County Department of Cultural Affairs Miami-Dade County | Department of Cultural Affairs Skip to Newsletter Subscription Skip to Site Search Box Skip to Main Menu Skip to Main Page Content Newsletter Subscription Subscribe Site Search Box Site Search Main Menu About Us Board of County Commissioners Office of the Mayor Staff & Councils Supporters Partners Advocacy Press Room Publications Opportunities FAQs Events Calendar Grants Grants for Artists Grants for Organizations Grant Resources SurveyMonkey Apply Facilities Facilities in Progress Artists Grants Opportunities Art in Public Places Resources Directory Organizations Grants Opportunities Grant Resources Cultural Resource Directory Arts Education, Access & Engagement All Kids Included Culture Shock Miami Golden Ticket Arts Guide Youth Arts in the Parks ADA / Accessibility Partners & Resources After School & Camp Programs Support the Arts License Plate News Room Previous Pause Next Reflect by Ivan Toth Depeña Winner of Americans for the Arts' Public Art Network 2012 Year in Review All Kids Included – Youth Arts in the Parks Exhibition www.ImagesbyJDA.com Light Field by Robert Chambers Dennis C. Moss Cultural Arts Center The Bollard Project by Jim Drain (Image Credit: Markus Haugg) The Ripple Garden by Mikyoung Kim Untitled (Flooring) by José Bedia Winner of Americans for the Arts' Public Art Network 2006 Year in Review You are here Home » About Us Staff & Councils Main Page Content Widget Layout: Two Columns Cultural Affairs Council The Miami-Dade County Cultural Affairs Council serves as Board to the Department of Cultural Affairs and is comprised of fifteen volunteer members appointed by the Board of County Commissioners. View Details Tourist Development Council The Tourist Development Council (TDC) is a nine-member volunteer board whose members are appointed by the County Commissioners and have backgrounds in the tourism industry. View Details Staff listing Staff Tags (field_staff_tags) - Any - Administration Administrative Support Art in Public Places Arts Education Capital Projects Facilities Grants Outreach Search Staff Listing Ashlee Thomas Interim Director ashlee.thomas@miamidade.gov (305) 375-5042 Ashlee Thomas currently serves as the Interim Director of the Miami-Dade County Department of Cultural Affairs. In this role, she has led the development of the Arts Energize 305 engagement initiatives, fostering dynamic community participation in... More Graham Winick Assistant Director winick@miamidade.gov (305) 375-2523 Graham Winick​ currently serves as Assistant Director of the Miami-Dade County Department of Cultural Affairs.\nHe has made a career of combining his experiences in film, arts, culture and tourism with public affairs and administration towards... More Kelly Allocco Cultural Projects Administrator kellya@miamidade.gov (305) 375-4636 Kelly Allocco joined the Miami-Dade County Department of Cultural Affairs in July of 2001 and serves as the administrator for three of the Department’s grants programs: 1) the Major Cultural Institutions (MCI) Grants Program, which provides funding... More Stephanie Antequera Cultural Projects Administrator stephanie.antequera@miamidade.gov 305-375-2554 Stephanie is the Cultural Projects Administrator for the Youth Arts Enrichment Program (YEP) and the Summer Arts & Science Camps for Kids (SAS-C) at the Miami-Dade County Department of Cultural Affairs. Funded by The Children’s Trust, these... More Roxana Barba Cultural Projects Administrator rbarba@miamidade.gov (305) 375-4209 Roxana Barba is an arts administrator and artist with twenty years of professional experience.\nShe joined the Department of Cultural Affairs on 2012, taking over the management of the Community Grants program, a quarterly project-based grant serving... More Nikenna D. Smart Cultural Projects Administrator nikenna.smart@miamidade.gov (305) 375-5092 Nikenna Smart, a Coconut Grove native, received her Bachelors of Science degree with Cum Laude Honors in Political Science and Public Administration from Florida Agricultural and Mechanical University (FAMU) in Tallahassee, Florida. Prior to joining... More Pages 1 2 3 4 5 next › last » Our Facilities Useful Links Miami-Dade County Art in Public Places Cultural Resource Directory Golden Ticket Arts Guide 2025 Miami-Dade Arts Hall of Fame Arts & Economic Prosperity Top 15 Facts About the Arts in Miami-Dade County Coconut Grove Playhouse Updates ArtBurst Miami Culture Shock Miami Arts Energize 305 Greater Miami and Miami Beach Event Calendar Public Records Request Arts Resilient 305 Job Opportunities Miami Emerging Arts Leaders Miami-Dade County Logo Footer Menu News Room Resources Site Map Contact ADA Notice Share This Print this page"
    },
    {
      "url": "https://www.ameliaearhartmuseum.org/contact",
      "text": "CONTACT | Mysite top of page HOME TICKETS DONATE MEMBERSHIP VISIT ACCESSIBILITY ABOUT JOIN US SHOP PRODUCTS BLOG CONTACT More Use tab to navigate through the menu items. CONTACT We enjoy hearing from you!  Please fill out the form below and we will get back to you as soon as possible.  You can also reach us at 913-367-4217. We are on the corner of Santa Fe and N. Terrace Street. 223 N. Terrace Street Atchison, KS 66002 ​ Tel: 913-367-4217 tours@ameliaearhartmuseum.org ​ ​ Your details were sent successfully! Send (913) 367-4217 tours@ameliaearhartmuseum.org Newsletter Sign Up © Copyright 2025 Amelia Earhart Birthplace Museum and Ninety-Nines bottom of page"
    },
    {
      "url": "https://www.cloudofgoods.com/amelia-earhart-park-party-rental-miami-fl-26644_1_21_38_26644",
      "text": "Party rental for Amelia Earhart Park - 09/11/25 - Cloud of Goods Cloud of Goods logo Stylized white text logo on transparent background Sign in Account & orders Your cart is empty. Rentals Locations Make Money Scooters Wheelchairs Baby & Kids Medical Party Bikes Golf Carts ATVs Camping Browse All >> Cities Hotels Cruises Attractions Neighborhoods Experiences Events Setup your rental shop Become an affiliate My profile Log in Create account Popular rentals All rentals Scooters Wheelchairs Strollers Medical Baby & Kids Accessories Camping Sports Categories Baby & kids Mobility Sports Camping Accessories Medical Party Tools & equipment Photography Locations Cities Attractions Hotels Experiences Events Cruises Account Privacy policy Terms of use FAQs About Back Baby & kids View all Stroller Car seats Cribs and bassinets Playards and swings Baby chairs Toys Walkers Diapering and bathing Miscellaneous Back Mobility View all Wheelchairs Scooters Bikes Golf carts Sports & recreation Accessible vans Slingshot Boats E-bikes Motorcycles & trikes Mobility scooters Ecvs Cars Mopeds Atvs Segways Ramps Power chairs Back Medical View all Bath & shower Hospital beds Respiratory aids & accessories Walking aids Daily living aids Recliners Lift chairs Back Party View all Bounce houses Canopies Equipment Furniture Games Packages Chairs Back Tools & equipment View all Power generators Back Gopro View all Discover More Heavy Duty Mobility Scooter Double Stroller Ultra Light Standard Wheelchair Slingshot Home Amelia Earhart Park Party rental Party rental for Amelia Earhart Park Last updated: 09/11/25 See more  Party equipments 10' x 10' popup canopy rental is a must have for your outdoor party or picnic near Amelia Earhart Park to shield your guests from the intense sunlight or the rain. It takes only a few minutes to setup and take down, which makes it a no brainer to add to your outdoor party or event rentals list. 10'X10' popup canopy 3 1 Rental delivered Cotton candy, candy floss, fairy floss, or floss sugar, is a big, bright, colorful ball of sugar served on a stick that kids and adults will enjoy. It is a simple and fun food to offer at your party and it couldn’t be easier to set up, make and serve with a cotton candy machine rental near Amelia Earhart Park Cotton candy machine 3 6ft rectangular tables are foldable and easy to move around and it is one of the most popular rentals for parties. Whether you're planning an indoor or outdoor party near Amelia Earhart Park, this table is a must have. You can use it to hold presents, food or use as a dining table. It can comfortably seat 6 to 8 adults or children. 6ft Rectangular Table 1 Bounce house rental near Amelia Earhart Park is a great way to make your kid's birthday party enjoyable. Many types of bounce house rentals for you to choose from: Jumping, Sliding, Obstacle course, Safari and Bungee run. In addition, we have various themed bounce houses. If you have a preference, specify it in the order notes at the time of placing the order and we'll try our best to accommodate. Jumping bounce house 0 Customers love the Cloud of Goods Amelia Earhart Park Party rental experience You will love the whole end to end Party rental experience with Cloud of Goods Amelia Earhart Park that will keep you coming back to rent everything you want. Cloud of goods got great reviews on TripAdvisor and Google. \"I rented the Party equipment while in Miami at a conference. Entire staff was super helpful and friendly from the very first phone call. I highly recommend this company. Party equipment was clean and worked well.\" You will love the whole end to end Party rental experience with Cloud of Goods Miami that will keep you coming back to rent everything you want. Cloud of goods got great reviews on TripAdvisor and Google. Browse Party Rentals See all reviews Rent at Amelia Earhart Park resorts, hotels, & vacation homes We deliver your Party rental to all the Amelia Earhart Park area vacation homes, hotels, and resorts. See all Miami hotels W Miami Hilton Miami Airport Blue Lagoon (9  Deliveries ) Hilton Miami Downtown (31  Deliveries ) Hampton Inn & Suites by Hilton Miami Brickell Downtown (6  Deliveries ) The Gabriel Miami, Curio Collection by Hilton Courtyard by Marriott Miami Airport Kimpton EPIC Hotel (19  Deliveries ) Viceroy Miami Cloud of Goods Party rentals delivered to many Amelia Earhart Park locations We have the largest Party rentals delivery coverage in Amelia Earhart Park. The highest demand is for Amelia Earhart Park Party rentals. See all Miami neighborhoods South Beach Downtown Miami Little Havana Coconut Grove (3  Deliveries ) Brickell (1  Delivery ) Wynwood North Beach (3  Deliveries ) Little Haiti How to rent Party equipment at Amelia Earhart Park with Cloud of Goods? “The best party rental near Amelia Earhart Park through the large network of party rental companies partnered with Cloud of Goods. Bounce house rentals, canopy rentals, table & chair rentals, photo booth rentals, popcorn machine rentals & more available near Amelia Earhart Park. Rent everything you want for your party now and we'll have your party rentals delivered to you anywhere around Amelia Earhart Park.” Reserve any Party model you want and let us bring your Party rental to Amelia Earhart Park hotel, residence, or attraction Add low-priced Party equipment and accessories to your shopping cart Fill out the checkout form with rental dates and Amelia Earhart Park delivery location Make the payment online to confirm your Amelia Earhart Park rental reservation Rent Now Frequently asked questions about Party rentals by Amelia Earhart Park customers Is Amelia Earhart Park Party rentals available on Cloud of Goods? Yes! Amelia Earhart Park Party rentals available online at CloudofGoods.com. All your Amelia Earhart Park Party rentals will be delivered to anywhere near Amelia Earhart Park. Can I rent Party rentals at Amelia Earhart Park? Yes. Amelia Earhart Park Party rentals are available on Cloud of Goods. Rent online on CloudofGoods.com and one of our rental partners near Amelia Earhart Park will deliver your Party rental to Amelia Earhart Park. How much does it cost to rent a Party rentals at Amelia Earhart Park? Product 1 day 2 day 3 day 4 day 5 day 6 day 7 day 8 day 9 day 10 day Additional day 10'X10' popup canopy $85 $110 $130 $145 $155 $170 $185 $200 $220 $240 $5 Cotton candy machine $75 $150 $175 $200 $225 $275 $350 $425 $500 $500 $75 6ft Rectangular Table $15 $20 $25 $30 $35 $40 $45 $50 $60 $65 $3 Jumping bounce house $175 $225 $285 $340 $365 $390 $415 $440 $465 $540 $25 Does Amelia Earhart Park has Party rentals for rent? Amelia Earhart Park may or may not have Party rentals. You can directly check with the Amelia Earhart Park guest services. However, Cloud of Goods can find you the best Amelia Earhart Park Party rental and have one of our delivery partners near Amelia Earhart Park deliver it to you. Does Cloud of Goods deliver Party rentals to Amelia Earhart Park? Yes. All of our rental partners near Amelia Earhart Park deliver your Party rental to Amelia Earhart Park. Once you place the reservation, a local rental partner who accepts your order will get in touch with you to arrange Party rental delivery to Amelia Earhart Park. Book Your Party Rentals Now Before you hit the road... Sign up for our newsletter to get the latest news, updates and promotions before you set off on your next adventure. Stay updated with our latest deals, inspirations and notifications. You consent to receiving email and/or SMS marketing messages according to our terms of use. You can unsubscribe anytime. Cloud of Goods About Blog Videos Reviews Coupons & Promotions Price list FAQ We're hiring! 👋 Shops Cities Neighborhoods Attractions Hotels Experiences Events Cruises Amelia Earhart Park Scooter rentals Stroller rentals Wheelchair rentals Slingshot rentals Medical rentals Party rentals Moped rentals Cribs and bassinets rentals ECV rentals Car rentals Miami\n                                    attractions Miami\n                                    neighborhoods Miami\n                                    hotels Miami\n                                    experiences Browse Miami Rentals Scooters Wheelchairs Strollers Slingshots Medical Equipment Bounce houses Camping Cars Browse all Earn Money Setup your rental shop Become an agent How to start rental business Languages Español Português Français Contact Message us Media inquiries info@cloudofgoods.com (407)545-3103 Miami, Florida, USA Payment methods Terms | Privacy | Rental agreement | Cancellation policy | Damage waiver policy © 2025 Rental Commerce Inc. All rights reserved. About cookies on this site We use cookies to: (1) Collect and analyze information on site performance and usage, (2) To provide social media features, (3) To enhance and customize content, (4) Personalized advertising. Cookie settings Accept all Decline all About cookies on this site Close Cookies used on the site are categorized as below. You can read about each category and allow or deny some or all of them. When categories that have been previously allowed are disabled, all cookies assigned to that category will be removed from your browser. Accept all Decline all Necessary cookies Some cookies are required to provide core functionality. The website won't function properly without these cookies and they are enabled by default and cannot be disabled. Analytical cookies Analytical cookies help us improve our website by collecting and reporting information on its usage. Marketing cookies allow us to personalise your experience and to send you relevant content and offers, on this website and other websites. Save settings"
    }
  ]
}