{
  "fuentes": [
    {
      "url": "https://www.msvfl.gov/CountryClubAdvisoryBoard",
      "email": "rodriguezy@msvfl.gov"
    },
    {
      "url": "https://www.1golf.eu/en/club/miami-shores-country-club/",
      "email": "default-80@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/miami-shores-country-club/",
      "email": "golf-club-detail@2x.png"
    },
    {
      "url": "https://www.1golf.eu/en/club/miami-shores-country-club/",
      "email": "info@miamishoresgolf.com"
    },
    {
      "url": "https://www.1golf.eu/en/club/miami-shores-country-club/",
      "email": "travel@albrecht.de"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "email": "contact@clubcarwash.com"
    },
    {
      "url": "https://business.miamishores.com/list/member/miami-shores-country-club-788",
      "email": "chamberinfo@miamishores.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "vip@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "boats@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "dining@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "eservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "events@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reception@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reservations@palmtreeclubmiami.com"
    }
  ],
  "mails": [
    "boats@palmtreeclubmiami.com",
    "chamberinfo@miamishores.com",
    "contact@clubcarwash.com",
    "default-80@2x.png",
    "dining@palmtreeclubmiami.com",
    "eservations@palmtreeclubmiami.com",
    "events@palmtreeclubmiami.com",
    "forms@tambourine.com",
    "golf-club-detail@2x.png",
    "info@miamishoresgolf.com",
    "reception@palmtreeclubmiami.com",
    "reservations@palmtreeclubmiami.com",
    "rodriguezy@msvfl.gov",
    "travel@albrecht.de",
    "vip@palmtreeclubmiami.com"
  ],
  "nombre_sitio": "miamishoresgolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.msvfl.gov/CountryClubAdvisoryBoard",
      "text": "Miami Shores Florida - Country Club Advisory Board Citizens Academy Residents Government Departments Services Business Miami Shores Village Boards and Committees Code Enforcement Board Country Club Advisory Board Doctors Charter School Board Education Advisory Board Arts & Culture Board General Employee Pension Board Historic Preservation Board Library Board of Trustees Personnel Appeals Board Planning & Zoning Board Police Retirement Pension Plan Board Recreation Advisory Committee Sustainability & Resiliency Committee Country Club Advisory Board Home > Groups > Miami Shores Village Boards and Committees > Country Club Advisory Board Advises the Country Club General Manager on matters which effect the Country Club operations. This Board is comprised of seven residents appointed by the Village Council for a two year term. View Upcoming Meetings Meets: Last Wednesday of each month at 5:30 PM Location: Miami Shores Country Club Board Liaison: Alberto Pozzi | 305-795-2360 General Information Staff Directory Email rodriguezy@msvfl.gov Phone Numbers 305-762-4870 Emergencies: Dial 911 Location 10050 NE 2ND Avenue Miami Shores, FL 33138 Get Directions Contact Info 10050 Northeast 2nd Avenue  Miami Shores, Florida 33138 305-795-2207 Miami Shores Newsletter Signup \"Don't miss out! 📩 Subscribe for our Newsletter and Bid alerts HERE\" Website By EvoGov"
    },
    {
      "url": "https://www.1golf.eu/en/club/miami-shores-country-club/",
      "text": "Miami Shores Country Club, Miami Shores, FL - Albrecht Golf Guide Golf Courses Golf Hotels Golf Packages Bookshop Apps Sign in / Sign up Saved Items Deutsch English Español Italiano Albrecht Golf Guide Golf courses in North America United States Florida Miami Shores Country Club 18 Hole Semi- Private Overview Course Visitors Prices Amenities Club Reviews No image available Miami Shores Country Club 10000 Biscayne Blvd, Miami Shores, FL 33138-2699, USA Phone: +1 305-795-2366 , Fax: +1 305-795-2384 info@miamishoresgolf.com www.miamishoresgolf.com Map Save Share 3.0 of 5 stars 1 Review The Course 18-Hole Course Driving Range  &  Practice area Visitors welcome? Yes - every day. Season: Year round Green fees $75 - 99 (64-85 €) / 18 Holes The Course 18-Hole Course Opened in 1939. Design: Red Lawrence . Style: Parkland. Terrain: Water hazards Technical difficulty: Moderate - Hard Scorecard Tee Par CR Slope Length Blue (Men) 71 71.2 131 6705 yards White (Men) 71 69.8 130 6310 yards Gold (Men) 71 68.4 129 5511 yards Red (Women) 72 72.8 124 5036 yards Practice Facilities Driving Range Putting Green Chipping Green Visitors 18-Hole Course Visitors are welcome every day. Advance booking is essential. Etiquette Softspikes required. Green Fees 18-Hole Course Green Fee Mon - Fri Sat, Sun, Holidays May 1 - October 14, 2017 18 Holes $75 (64 €) $75 (64 €) October 15, 2017 - April 30, 2018 18 Holes $99 (85 €) $99 (85 €) Amenities Club Amenities Clubhouse Club accepts credit cards Pro Shop Bar Snack Bar Beverage Cart Rentals Clubs for hire Electro-cart for hire The Club Personnel Title Name Manager Alberto Pozzi Enlarge / get directions Nearby Courses Normandy Shores GC Miami Beach (3.4 km) 3.8 of 5 stars (4) 18 Hole 17 € / 18 Holes Indian Creek Country Club Indian Creek Village (3.6 km) 18 Hole La Gorce Country Club Miami Beach (5.8 km) 18 Hole See all User Reviews 3.0 of 5 stars 1 Review 5 Stars: 0 4 Stars: 0 3 Stars: 1 2 Stars: 0 1 star: 0 Write a Review Most Recent Reviews PHa 6 Reviews Automatic translation Original version Green fee is more expensive than noted here 3.0 of 5 stars Reviewed December 1, 2017 Currently, Dec. 2017, until April 2018 is $ 99. It is a busy game here. Translated by Google . Been to Miami Shores Country Club ? Share your experiences! Write a Review See all reviews Golf Packages Tenerife, Spain Tivoli La Caleta Tenerife Resort 5 stars Very good 8,4 / 10 7 Nights 5 green fees from € 1475 per person Tenerife, Spain Hacienda del Conde Meliá Collection Golf & Spa 5 stars Wonderful 9,1 / 10 7 Nights HB unlimited golf from € 1231 per person La Gomera, Spain Hotel Jardín Tecina 4 stars Excellent 8,7 / 10 7 Nights HB 5 green fees from € 833 per person Majorca, Spain Elba Sunset Mallorca 4 stars Very good 8,2 / 10 7 Nights 5 green fees from € 855 per person Majorca, Spain VIVA Golf Adults Only 18+ 4 stars Superior Very good 8,4 / 10 7 Nights HB 5 green fees from € 1083 per person Sicily, Italy Verdura Resort 5 stars Excellent 8,8 / 10 7 Nights 4 green fees from € 1269 per person Porto Cervo, Italy Cervo Hotel, Costa Smeralda Resort 5 stars Excellent 8,8 / 10 7 Nights unlimited golf from € 1042 per person Cyprus Almyra 5 stars Very good 8,2 / 10 7 Nights 4 green fees from € 928 per person All Packages Get a €20 discount on your golf vacation with our newsletter Sign up for our newsletter and be the first to discover new golf packages, special offers, and exclusive golf tours. As a bonus, you will receive a €20 discount code for your next golf vacation. Yes, please send me the newsletter You can change your mind at any time by clicking the unsubscribe link in the footer of any newsletter you receive from us, or by contacting us at travel@albrecht.de . We will treat your information with respect. You can find details about our privacy practices here . By clicking above, you agree that we may process your information in accordance with these terms. Follow us on Instagram New Golf Guide Africa Asia Caribbean Central America Europe Middle East North America Pacific South America Golf Packages Book Golf Holiday Travel Themes Golf Round Trips Group Golf Tours Early Booking Deals Majorca Canary Islands Tuscany Algarve Andalusia Greece All Destinations Mobile App Golf Guide for iPhone Golf Guide for iPad Info Contact/Imprint Media Information Privacy Policy Terms Feedback © 2025 Albrecht Golf Verlag GmbH"
    },
    {
      "url": "https://clubcarwash.com/contact-us/",
      "text": "Contact Us | Club Car Wash We use cookies to help make our site better and make your experience on our site more enjoyable. Accept X Skip to content Washes Locations News Contact Us Washes Locations News Contact Us Search Manage Membership Reach out to us using the form below! We love to hear your feedback, and we are always looking to grow and improve! You're not able to cancel your membership through this form. To cancel your membership, click the manage membership button below! Manage Membership Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. Name * First Last Email * Phone Preferred Location Select preferred location... 10084 Coors Blvd NW Albuquerque, NM 87114 1075 Diffley Rd Eagan, MN 55123 11200 Timberland Blvd Fort Worth, TX 76177 11611 S 73rd St Papillion, NE 68046 118 N Fox River Dr Appleton, WI 54915 1202 Getwell Rd Memphis, TN 38111 12035 O'Connor Rd San Antonio, TX 78233 12225 E US-290 Manor, TX 78653 12322 W US Highway 90, San Antonio, TX - Montgomery 13046 Four Star Blvd Austin, TX 78737 1305 E Imhoff Rd - Norman OK 73071 1317 N Moore Ave Moore, OK 73160 14109 Culebra Rd San Antonio, TX 78254 15490 E 120th Ave Commerce City, CO 80603 1721 N Veterans Blvd Pharr, TX 78589 1725 S Valley Mills Dr Waco, TX 76711 1821 W Tyler Ave Harlingen, TX 78550 2002 Gateway Center Dr Belvidere, IL 61008 206 N Kingshighway Cape Girardeau, MO 63701 2550 Coon Rapids Blvd NW Minneapolis, MN 55433 2651 Telegraph Rd St. Louis, MO 63125 2909 Ford St Beloit, WI 53511 3028 S Seneca St Wichita, KS 67217 3031 23rd Ave Greeley, CO 80631 307 Greenbriar Rd Normal, IL 61761 3091 Goodman Rd W Horn Lake, MS 38637 3131 S 72nd St Omaha, NE 68124 3521 S Broadway Edmond, OK 3581 Hickory Hill Rd Memphis, TN 38115 3715 Sandman Ln Columbia, MO 65201 3900 Southern Blvd SE Rio Rancho, NM 87124 3910 S McColl Rd Edinburg, TX 78539 4406 Western Ave Knoxville, TN 37921 4441 Fredricksburg Rd Balcones Heights, TX 78201 4620 Old Greenwood Rd Fort Smith, AR 72903 4675 TX-121 The Colony, TX 75056 505 E 53rd St, Davenport, IA 52807 5404 Rogers Ave Fort Smith, AR 72903 5762 Rufe Snow Dr N Richland Hills, TX 76180 6609 N 99th St Omaha, NE 68122 6627 Governors Pkwy Edwardsville, IL 62025 681 Sycamore Dr Sullivan, MO 63080 701 Hillsboro Blvd Manchester, TN 37355 7323 Fairlawn Dr San Antonio, TX 78223 7514 S Zarzamora St San Antonio, TX 78224 8274 Hwy 64 Bartlett, TN 38133 9600 Sage Rd SW Albuquerque, NM 87121 Appleton, WI - E College Ave Appleton, WI - E Longview Dr Appleton, WI - N123 Eisenhower Drive Arnold, MO - JeffCo Blvd Augusta, KS - W 7th Ave Ballwin, MO - Manchester Rd Bastrop, TX - Old Austin Hwy Bastrop, TX - State Hwy 71 Bee Cave, TX - State Hwy 71 Belleville, IL - Belleville Crossing Belleville, IL - N Green Mount Commons Dr Bellevue, NE - S 22nd St Bellevue, WI - Monroe Rd Bentonville, AR - SE Walton Blvd Bloomington, IL - E Oakland Ave Boerne, TX - 28353 IH-10 Boerne, TX - S Main St Boonville, MO - Boonslick Dr Bryan, TX - E William Joel Bryan Pkwy Bryan, TX - W Villa Maria Burleson, TX - 797 SW Wilshire Blvd Cape Girardeau, MO - N Kingshighway Cape Girardeau, MO - Siemers Dr Clarksville, TN - 1493 Madison St. Clarksville, TN - 2021 Needmore Rd College Station, TX - Farm to Market Rd 2154 Collinsville, IL - N Bluff Rd Colorado Springs, CO - 1378 Republic Dr. Colorado Springs, CO - 301 E. Fillmore St. Colorado Springs, CO - 6653 Dalby Dr. Columbia, MO - Clark Ln Columbia, MO - Conley Rd Columbia, MO - Grindstone Pkwy Columbia, MO - N Providence Rd Columbia, MO - S Scott Blvd Columbia, MO - W Worley St Coralville, IA - 2nd St Cottleville, MO - 6088 Mid Rivers Mall Dr Council Bluffs, IA - W Broadway Davenport, IA - E 53rd St Decatur, IL - E Pershing Rd Denton, TX - E University Dr Derby, KS - N Rock Rd Edinburg, TX - N Jackson Rd Edmond, OK - Kelly & Covell Edmond, OK - N Kelley Ave Edmond, OK - NW 178th St Eureka, MO - Legends Pkwy Fairview Heights, IL - 6118 Illinois Dr Farmington, MO - Maple St Fayetteville, AR - Joyce Blvd Fayetteville, AR - N College Ave Fayetteville, AR - N Crossover Rd Fayetteville, AR - W MLK Blvd Fenton, MO - Bowles Ave Fenton, MO - Majestic Dr Festus, MO - N Creek Dr Florissant, MO - N Hwy 67 Fond du Lac, WI - N Country Ln Fond du Lac, WI - N Pioneer Rd Fond du Lac, WI - W Pioneer Rd Fort Worth, TX - E Blue Mound Rd Garland, TX - Foster Rd Georgetown, TX - W University Ave Georgetown, TX - Williams Dr Grain Valley, MO - N Main St Grand Junction, CO - 2122 North Ave Grand Junction, CO - 691 24 Road Green Bay, WI - University Ave Green Bay, WI - W Mason St Hazelwood, MO - Howdershell Rd Headquarters Hewitt, TX - Hewitt Dr Houston, TX - Huffmeister Rd Hutchinson, KS - E 17th Ave Independence, MO - E 39th St Iowa City, IA - Hwy 6 Iowa City, IA - IA-1 Jacksonville, IL - W Morton Ave Kansas City, MO - Lees Summit Rd Katy, TX - Fulshear Kearney, MO - Watson Dr Kyle, TX - Kyle Centre Dr Lake St. Louis, MO - Hawk Ridge Trl Lake St. Louis, MO - Hwy N Lakewood, CO - Alameda Pkwy Lansing, KS - W Eisenhower Rd Lawrence, KS - Bauer Farm Dr Lawrence, KS - E 23rd St Leander, TX - Ronald Reagan Lebanon, MO - S Jefferson Ave Leon Valley, TX - Bandera Rd Liberty Hill, TX - W State Hwy 29 Loves Park, IL - Deery Dr Lowell, AR - N Bloomington Rd Manitowoc, WI - Calumet Ave Maplewood, MO - Maplewood Commons Dr McAllen, TX - 1300 E Jackson Rd McAllen, TX - E Ridge Rd McKinney, TX - Stacy Rd Mead, CO - Highland Dr Melissa, TX - Sam Rayburn Hwy Menasha, WI - Midway Rd Mesquite, TX - 2121 N Belt Line Rd Mesquite, TX - Buckner Blvd Mission, TX - E Griffin Pkwy Moberly, MO - Hwy 24 Moline, IL - 41st Ave Dr Moore, OK - S Eastern Ave Murfreesboro, TN - Rutherford Blvd Muscatine, IA - Park Ave Nashville, TN - 3131 Lebanon Pike Nashville, TN - 3600 Murfreesboro Pike Nashville, TN - Hwy 70 S Neenah, WI - W Winneconne Ave New Braunfels, TX - TX-46 Norman, OK - 36th Ave Norman, OK - Classen Blvd O'Fallon, IL - Frank Scott Pkwy O'Fallon, MO - Monticello Dr O'Fallon, MO - Veterans Memorial Pkwy O'Fallon, MO - W Terra Ln Oklahoma City - SE 44th St Oklahoma City, OK - N Council Rd Oklahoma City, OK - N Rockwell Ave Oklahoma City, OK - SW 89th St Oklahoma City, OK - W Reno Ave Oklahoma City, OK - Western Ave Olathe, KS - S Harrison St Omaha, NE - 18318 Evans St Omaha, NE - Gold St Omaha, NE - N 108th St Omaha, NE - N 72nd St Omaha, NE - S 72nd St Ottawa, KS - S Princeton St Overland Park, KS - W 121st St Overland Park, KS - W 95th St Pearland, TX - Pearland Pkwy Peoria, IL - N Centerway Dr Peoria, IL - Sterling Ave Peoria, IL - W Glen Ave Peoria, IL - W Holiday Dr Pflugerville, TX - TX-130 Prosper, TX - E University Dr Rogers, AR - W Hudson Rd Rolla, MO - Fairgrounds Rd Round Rock, TX - 1051 N A.W. Grimes Blvd Saginaw, TX - 100 E McLeroy Blvd Salina, KS - Market Place Salina, KS - S Broadway San Antonio, TX - 2815 SE Military Drive San Antonio, TX - Culebra Rd San Antonio, TX - Hwy 151 San Antonio, TX - Marbach Rd San Antonio, TX - Medina Base Rd San Antonio, TX - NW Military Hwy San Antonio, TX - Perrin Beitel San Antonio, TX - Potranco Rd San Antonio, TX - SW Military Dr San Antonio, TX - W Interstate 10 San Antonio, TX - W Loop 1604 San Marcos, TX - S I-35 Sedalia, MO - Wisconsin Ave Shawnee, KS - Silverheel St Shawnee, KS - W 65th St Sheboygan, WI - Vanguard Dr Sherman, TX - Texoma Pkwy Sikeston, MO - S Main St Siloam Springs, AR - E Main St Springdale, AR - 3500 S. 48th St. Springdale, AR - E Robinson Ave Springdale, AR - N 45th St Springdale, AR - N Thompson St Springfield, IL - 1640 W Jefferson St Springfield, IL - Lincolnshire Blvd Springfield, IL - N Dirksen Pkwy Springfield, IL - Veterans Pkwy Springfield, TN - Memorial Blvd St. Ann, MO - St. Charles Rock Rd St. Charles, MO - 1st Capitol Dr St. Charles, MO - Zumbehl Rd St. Louis, MO - Gravois Ave St. Louis, MO - Hampton Ave St. Louis, MO - Lusher Rd St. Louis, MO - S Lindbergh Blvd St. Robert - Hwy Z Sterling, IL - 35th Ave Stillwater, OK - E 6th Ave Stillwater, OK - N Perkins Rd Sussex, WI - W248N5221 Executive Dr Taylor, TX - N Main St Topeka, KS - NW 25th St Topeka, KS - SE California Ave Topeka, KS - SW 30th Terrace Topeka, KS - SW Topeka Blvd Troy, MO - Merlin Dr Waco, TX - N Valley Mills Dr Warehouse Warrenton, MO - N State Hwy 47 Washington, MO - Willows Ct Waterloo, IA - E San Marnan Dr Wentzville, MO - Wilmer Meadow Dr Wichita, KS - 2965 N Maize Rd Wichita, KS - 3610 N Maize Rd Wichita, KS - 47th & Broadway Wichita, KS - 7931 E 37th St N Wichita, KS - N 127th St E Wichita, KS - N Woodlawn Blvd Wichita, KS - S Rock Rd Wichita, KS - W 21st St Yukon, OK - N Mustang Rd Optional: FastPass # or Last 4 Digits of Payment Method Comment or Message * Send (833) 416 - 9975 CONTACT@CLUBCARWASH.COM COMPANY Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal Washes Unlimited Club Locations Business Accounts Acquisitions Employee Portal COMMUNITY News Fundraising Community Donations Children’s Miracle Network Hospitals News Fundraising Community Donations Children’s Miracle Network Hospitals NEED HELP? Contact Us Survey Vehicle Restrictions Privacy Policy Contact Us Survey Vehicle Restrictions Privacy Policy CAREERS Our Story Careers Our Story Careers FOLLOW US X-twitter Facebook Instagram Youtube Tiktok Email us Fill out the form below and we will reach out as soon as possible. CLOSE"
    },
    {
      "url": "https://business.miamishores.com/list/member/miami-shores-country-club-788",
      "text": "Miami Shores Country Club | Country Clubs Please ensure Javascript is enabled for purposes of website accessibility Skip to content Contact Us Member Login Facebook Twitter LinkedIn Menu Chamber Member Benefits Join the Chamber Board of Directors Chamber History Member Directory Opening a Business Chamber Events Citizen of the Year Women in Business Networking Group Contact Us Miami Shores Villages Miami Shores Biscayne Park El Portal North Bay Village Visitors Community Calendar Tourism Info Recreation Shopping & Dining Weather Events Calendar Miami Shores Map Member Map History of Miami Shores Schools & Universities Housing Arts & Culture Chamber Non Profits Photos Advertising Advertising Opportunities Egret Archives Join/Renew Member Application Member Login Green Day Green Day Photos Miami Shores Country Club Categories Country Clubs 10000 Biscayne Boulevard Miami Shores FL 33138 (305) 795-2363 Send Email Visit Website Rep/Contact Info Resa Strickland × Close Resa Strickland Director of Catering Phone: (305) 795-2363 Send an Email Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel © 2025 Greater Miami Shores Chamber of Commerce | Site by GrowthZone Building Business. Building Community. Greater Miami Shores Chamber of Commerce 9620 NE 2nd Avenue, Suite 201 | Miami Shores, FL 33138 (305) 754-5466 chamberinfo@miamishores.com Facebook Twitter LinkedIn © Greater Miami Shores Chamber of Commerce. All Rights Reserved | Site by GrowthZone Photo credit: Kate Baumwell"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "text": "Contact Us | Palm Tree Club Miami Skip to Content Palm Tree Club Miami (305) 865-7100 Rooms & Suites Offers Live Events Restaurant Happenings Our Neighborhood Gallery About Us Book Now Connect With Palm Tree Club Let’s Hear From You! Palm Tree Club Miami 1819 79th Street Causeway North Bay Village, FL 33141 Hotel Phone: 305-865-7100 Front Desk Inquiries: reception@palmtreeclubmiami.com Reservations: r eservations@palmtreeclubmiami.com Restaurant Phone: 786-204-1366 Email: dining@palmtreeclubmiami.com Marina Email: boats@palmtreeclubmiami.com Radio Channel: #71 Live Events Email: VIP@palmtreeclubmiami.com Thank you for reaching out! We will be in touch shortly. First Name * Last Name * Email Address * Comments Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit FREQUENTLY ASKED QUESTIONS Live Music & Events What time does the live music start? Doors open at 3 PM. Is there a cover charge for guests to enjoy the live music? Only for ticketed events. Get your tickets on Posh: https://posh.vip/g/ptc-miami . Do I need a reservation to see the live music? Not unless it's a ticketed event. How long does the live music performance last? Sunset parties typically go until 12 AM. Is the music indoors or outdoors? Both. Do you have a schedule or calendar for upcoming live music performances? Yes! Be sure to check our socials and website for more details: www.palmtreeclubmiami.com . Do you offer special deals or promotions? For offers and experiences, check our OpenTable: Palm Tree Club Miami Restaurant - North Bay Village, FL | OpenTable . Are there specific days or nights dedicated to live music? Typically Saturdays and Sundays, but please check our website for more details! What time will the DJs perform at the events we've published? Stay tuned to our social media for updates on set times. What’s the dress code for events? Come as you are—sneakers, flip-flops, heels, sequins, or bikini tops. Feel free to wear jeans, shorts, or even your suit (but we hope you lose the tie). Hotel General Information Is there a minimum age to check in? Yes, guests must be 21 years or older to check-in and will be required to present a valid photo ID, in addition to their method of payment. What time is check-in and check-out? Check-in time: 4pm Check-out time: 11am Can I check in early or check out late? Early check-in or late check-out may be available upon request, subject to availability. Please contact the front desk for more information. How late can I check-in? Our front desk is available 24 hours. What is required to check-in? Guests must be 21 years or older to check in and will be required to present a valid photo ID in addition to their method of payment. Is parking available at the hotel? Yes, complimentary on-site parking is available for all hotel guests. Can I store my luggage before or after I check out? Yes, complimentary luggage storage is available at our Front Desk. Is the hotel accessible for guests with disabilities? Yes, we have accessible rooms, ramps, and elevators for your convenience. Please inform us of any specific needs prior to your arrival. Are there any extra charges or resort fees? $20 plus taxes Resort Fee is applied to all reservations. Is the hotel pet-friendly? Yes. A non-refundable $100 pet fee applies. Room and Facilities Do the rooms include complimentary Wi-Fi? Yes, free Wi-Fi is available in all rooms and public areas of the hotel. When will my room be cleaned, and how do I request additional items? Your room will receive full cleaning service every third day of your stay. For any requests, such as extra towels or amenity refills, please contact the Front Desk at any time. Are there any amenities in the rooms? Our rooms come with air conditioning, a flat-screen TV, minibar, safe, Bluetooth speaker, hair dryer, and ironing board. Check the room description for specific details. Do you have accessible rooms? We offer three accessible room types - our Accessible Classic King and Accessible Classic Double, Accessible Deluxe King. For more specifics, check out our Accessibility page. Is there a smoking policy in the hotel? Our hotel is smoke-free, and smoking is only allowed in designated areas. Please ensure compliance with our smoking policy. A $250 cleaning fee will be applied if any odor is found in the room. Do you offer breakfast? Brunch begins at 11am. Do you have a restaurant or bar on-site? Yes, we have Palm Tree Club Miami Restaurant. Open daily, our restaurant serves up coastal-American food in a casual dining environment, with all your favorites & Miami’s best sunset views! Do you offer laundry and dry cleaning services? Yes, laundry and dry cleaning services are available. Booking and Payments Does the hotel accept traveler’s checks as payment? No, we do not accept traveler’s checks as payment. Does the hotel require any deposit at check in? Yes, at check-in, we require a $150 incidental deposit per stay, in addition to the room and tax charges. This is just a hold on the credit card. If the guest doesn’t incur any incidentals or make any purchases during their stay, the hold will be released within 5 to 7 business days after check-out. Does the hotel require any deposit prior to checking in? Pre-stay deposits are dependent upon the rate plan reserved. What type of credit cards are accepted at the hotel? MasterCard, Visa, American Express, and Discover are all accepted. What is your cancellation policy? Cancellation policy depends on the reservation rate booked. We offer rates with a refundable reservation up to 72 hours before arrival, as well as discounted non-refundable rates. Can I book directly on your website? Yes, we recommend booking directly through our website for the best rates and special offers. Can I modify or cancel my reservation after booking? Cancellation/Modification policy depends on the reservation rate booked. We offer rates that may be cancelled or modified up to 72 hours before arrival, as well as discounted non-refundable rates that do not allow cancellations or modifications. Special Requests and Policies Can I send a package to the hotel? Yes, we’re happy to accept packages prior to your arrival. Please be sure that the name of the registered guest is included in the delivery information and be sure to use our Security/Receiving address: 1819 79th Street Causeway North Bay Village, FL 33141 Can I request special accommodations or amenities (e.g., flowers, champagne, etc.)? Yes, we can arrange special requests for a fee. Please contact us ahead of time to ensure availability. Do you offer shuttle service to the airport? We do not offer this service directly, however, our concierge services may assist in making a shuttle reservation with a 3rd party company. Additional Services Can I book tours or activities through the hotel? Yes, we’d be happy to assist with booking. Please stop by the front desk to inquire about available options. Our concierge team can also help with making reservations. Do you have a gym or fitness center? Yes, we have a brand-new fitness center, and it’s open 24 hours a day for your convenience! Reservations & Ticketing How can I contact the restaurant if I have further questions? You can reach us at 786-204-1366 or email us at dining@palmtreeclubmiami.com . Will there be commissions for promoters who refer clients? For more information, email VIP@palmtreeclubmiami.com . Contact Information How can I contact the hotel if I have further questions? You can reach us at 305-865-7100 or email us at reception@palmtreeclubmiami.com . Our team is available 24/7 to assist you. Join the Crew Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Palm Tree Club Miami Palm Tree Club Miami 1819 79th Street Causeway                        North Bay Village, FL                         33141 HOTEL: (305) 865-7100 reception@palmtreeclubmiami.com reservations@palmtreeclubmiami.com RESTAURANT: (786) 796-0846 dining@palmtreeclubmiami.com MARINA: boats@palmtreeclubmiami.com Radio Channel: #71 LIVE EVENTS & PRIVATE TABLES: VIP@palmtreeclubmiami.com events@palmtreeclubmiami.com Our hotel properties include Palm Tree Hotel, Palm Tree Crew Hotel, and Palm Tree Club, all operating under the Palm Tree Crew umbrella. facebook instagram pinterest Contact & FAQs Palm Tree Club Miami  2025. All Rights Reserved Accessibility Privacy Policy Sitemap Consent Preferences Hotel Web Design by close"
    }
  ]
}