{
  "fuentes": [
    {
      "url": "https://miamibeachbandshell.com/accessibility/",
      "email": "info@miamibeachbandshell.com"
    },
    {
      "url": "https://miamibeachbandshell.com/visit/",
      "email": "info@miamibeachbandshell.com"
    },
    {
      "url": "https://miamibeachbandshell.com/visit/",
      "email": "info@miamibeachbandshell.com"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "info@miamibeachchamber.com"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "sales@miamibeachchamber.com"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "triangle_bigquad2@2x.png"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "triangle_bigquad@2x.png"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "triangle_duographic2@2x.png"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "triangle_duographic@2x.png"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "triangle_mediumduo2@2x.png"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "email": "triangle_mediumduo@2x.png"
    },
    {
      "url": "https://www.miamibeachfl.gov/city-hall/parks-and-recreation/rentals/north-shore-bandshell-rentals/",
      "email": "benton@rhythmfoundation.com"
    },
    {
      "url": "https://www.miamibeachfl.gov/city-hall/parks-and-recreation/rentals/north-shore-bandshell-rentals/",
      "email": "laura@rhythmfoundation.com"
    },
    {
      "url": "https://www.asgllc.com/asg-transforms-the-iconic-miami-beach-bandshell/",
      "email": "info@asgllc.com"
    }
  ],
  "mails": [
    "benton@rhythmfoundation.com",
    "info@asgllc.com",
    "info@miamibeachbandshell.com",
    "info@miamibeachchamber.com",
    "laura@rhythmfoundation.com",
    "sales@miamibeachchamber.com",
    "triangle_bigquad2@2x.png",
    "triangle_bigquad@2x.png",
    "triangle_duographic2@2x.png",
    "triangle_duographic@2x.png",
    "triangle_mediumduo2@2x.png",
    "triangle_mediumduo@2x.png"
  ],
  "nombre_sitio": "miamibeachbandshell.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://miamibeachbandshell.com/accessibility/",
      "text": "Miami Beach Bandshell Accessibility – Miami Beach Bandshell Rhythm Foundation North Beach Social Arts in the Parks Miami Beach Youth Music Festival Bandshell Laboratories Calendar Your Visit Your Visit Getting Here and Parking Seats and Club Boxes Food and Beverages Sustainability FAQs Accessibility Explore Photos Videos Bandshell History Resident Companies Support Membership Sponsors Affiliations Follow us Instagram YouTube Facebook Tiktok Mail TICKETS The Miami Beach Bandshell team works to make sure that all patrons have an enjoyable experience, and that our venue is fully accessibile. For questions about ADA and Accessibility accommodations, please contact info@miamibeachbandshell.com or call 786-453-2897. . To request materials in accessible format, sign language interpreters, and/or any disability accommodation, please contact Miami Beach Bandshell: 305-672-5202 / info@miamibeachbandshell.com five days in advance to initiate your request. TTY users may also call 711 ( Florida Relay Service ). Accessibility FAQs Where are the Accessible Entrances? The main entrance on 73rd Street as well as the Club Box Entrance on Collins Avenue are both fully accessible. Where is the ADA Accessibility Center onsite? Any ADA and accessibility questions can be answered at our Box Office cart located at the main entrance on 73rd Street. Our Access Center services include, but are not limited to: Answers to questions specific to the Accessibility Program Power outlets for recharging powered mobility devices How do I gain access to the accessible viewing areas? All general admission tickets are accessible, purchasing an additional accessible ticket is not necessary.  Find the ADA seating area on the south side of the venue, or ask the box office or security staff to usher you there. Access to the area includes the patron plus one companion. Wheelchair Accessibility / Where can I charge my power wheelchair? There is a charging station at the box office as well as in the ADA viewing area. Please ask before you charge and a box office staff member will assist you with plugging your device in. Chargers must use a 110-volt, 20-amp circuit. Is ASL provided for musical performances? What other accessible services do you offer? Please email info @miamibeachbandshell.com to request a specific performance be interpreted. We ask that you request this a minimum of 5 days prior to the show. We have on hand at the venue assisted listening devices as well. I have a special dietary need and/or have prescription medicine that I need. Can I bring this? Outside food and drinks are not allowed inside the venue, but if a patron has special medical dietary restrictions, those necessary items will be allowed. Please alert the security guard out front. Can I bring service animals? Service animals are permitted. Pets are not allowed into the Bandshell. How can I ask an accessibility or ADA question? For any questions, please email: info@miamibeachbandshell.com Do you have ADA parking? The municipal parking lot at 73rd Street and Collins Avenue has ADA parking spaces.  Parking is free after 6pm. Follow us Events Explore Rhythm Foundation FAQs Contact Rent the Bandshell Privacy Policy Accessibility Join Email List 7275 Collins Avenue, Miami Beach FL. 33141 7275 Collins Avenue, Miami Beach FL. 33141"
    },
    {
      "url": "https://miamibeachbandshell.com/visit/",
      "text": "Miami Beach Bandshell Visit – Miami Beach Bandshell Rhythm Foundation North Beach Social Arts in the Parks Miami Beach Youth Music Festival Bandshell Laboratories Calendar Your Visit Your Visit Getting Here and Parking Seats and Club Boxes Food and Beverages Sustainability FAQs Accessibility Explore Photos Videos Bandshell History Resident Companies Support Membership Sponsors Affiliations Follow us Instagram YouTube Facebook Tiktok Mail TICKETS Getting Here & Parking #gettinghere Seating and Club Boxes #seating Food & Beverage #foodbar Sustainability #sustainability Accessibility #accessibility Getting Here & Parking 7275 Collins Avenue, Miami Beach Parking Parking in North Beach Municipal Lot across the street: [299 – 72 Street, Miami Beach] Municipal Lot 2 blocks north of venue [75th St & Collins Ave] Municipal Lot at North Shore Youth Center [541 – 72 Street] Plus street parking Note, Parking is no longer free after 6pm. For additional parking info, visit the CITY’S PARKING SITE . Transit The venue is served by Miami-Dade Transit lines 79 and 100, and the free Miami Beach Trolley’s Collins Express. Find the full transit map here . Beach Walk Reach the Bandshell on foot or bicycle via the beautiful oceanfront Miami Beach Beachwalk! Suenalo at North Beach Social, Dec 23 Seating and Club Boxes SEATING varies, depending on the show. Please refer to the specific event for more details. Standing GA (General Admission) – limited non-reserved seats at the rear, plus a seated ADA section. Seated GA or Reserved feature comfortable stadium-style chairs. Social events include both open space for dancing or standing, as well as high-boy cafe tables and other seats. CLUB BOXES offer an elevated experience.  These boxes are on a raised platform encircling the rear of the venue and include comfortable couches and chairs. At select events, Club Box patrons enjoy VIP hospitality and a dedicated entrance on Collins Avenue. Each club box purchase includes admission for up to six people; the boxes can hold up to 10 people. QUESTIONS ? Club box seating Seated show Food and Beverages FOOD AND BEVERAGE : A full bar at all events offers speciality cocktails, craft beers, soft drinks. Most events also feature food (pizza, empanadas, popcorn) at the Bandshell Cafe. See individual show listings for more details. QUESTIONS ? Sustainability Miami Beach Bandshell has been recognized as the “Sustainable Venue of the Year” by TIME OUT MIAMI . Managed by the Rhythm Foundation, a founding member of the City’s PlasticFreeMB business certification program, the Bandshell has implemented several eco-friendly practices: Elimination of straws and plastic cups Free water bottle refill stations for concertgoers to reduce plastic waste Water sold at the bar in easily refillable aluminum cans Comprehensive recycling of aluminum through the Replenish program Our CANOPY made from a special photovoltaic fabric that uses solar power to generate its lights Accessibility The Miami Beach Bandshell team works to make sure that all patrons have an enjoyable experience, and that our venue is fully accessibile. For questions about ADA and Accessibility accommodations, please contact info@miamibeachbandshell.com or call 786-453-2897. To request materials in accessible format, sign language interpreters, and/or any disability accommodation, please contact Miami Beach Bandshell: 305-672-5202 / INFO@MIAMIBEACHBANDSHELL.COM five days in advance to initiate your request. TTY users may also call 711 ( FLORIDA RELAY SERVICE ). Accessibility F.A.Q.s Where are the accessible entrances? The main entrance on 73rd Street as well as the Club Box Entrance on Collins Avenue are both fully accessible. How do I access the ADA viewing center? All general admission tickets are accessible, purchasing an additional accessible ticket is not necessary.  Find the ADA next to the sound and lights control box, or ask the box office or security staff to usher you there. Access to the area includes the patron plus one companion. Wheelchair accessibilty? Where can I charge my power wheelchair? There is a charging station at the box office as well as in the ADA viewing area. Please ask before you charge and a box office staff member will assist you with plugging your device in. Chargers must use a 110-volt, 20-amp circuit. Is ASL provided for performances? What other accessible services do you offer? Please email info@miamibeachbandshell.com to request a specific performance be interpreted. We ask that you request this a minimum of 5 days prior to the show. We have on hand at the venue assisted listening devices as well. I have a special dietary need and/or have prescription medicine. Can I bring this? Outside food and drinks are not allowed inside the venue, but if a patron has special medical dietary restrictions, those necessary items will be allowed. Please alert the security guard out front. Can I bring my service animal? Service animals are permitted. Pets are not allowed into the Bandshell. Do you have ADA parking? The municipal parking lot across the street at 73rd Street and Collins Avenue has ADA parking spaces. Follow us Events Explore Rhythm Foundation FAQs Contact Rent the Bandshell Privacy Policy Accessibility Join Email List 7275 Collins Avenue, Miami Beach FL. 33141 7275 Collins Avenue, Miami Beach FL. 33141"
    },
    {
      "url": "https://business.miamibeachchamber.com/members/member/miami-beach-bandshell-11297",
      "text": "Miami Beach Bandshell | Entertainment | Music and Entertainment - Miami Beach Chamber of Commerce ? JOIN TODAY LOGIN CONTACT US (305) 674-1300 Become a member Subscribe to our Mailing Lists Membership Benefits Apply Online Events RSVP Full Calendar of Events Chamber Events Signature Events Events Gallery Business Directory Education Foundation Mission Programs Donate Apply Chamber Leadership Message from the President Chamber Mission & History Board of Governors Pillar Trustees Board Chairman’s Circle Honors Citizen of the Year Award Distinguished Service Award Lifetime Achievement Award Excellence in Tourism Award Beach High Alumni Outstanding Achievement Member of the Decade Outstanding Board of Governors Excellence in Business Award Champion of Business Award Small Business of the Year Award Better Beach Real Estate Awards Woman in Business Award Chamber Team Chamber News Miami Beach Community Newspaper Miami Beach Guest Member Center Member Login Subscribe to our Mailing Lists Chamber Councils Toggle Navigation Join Today Newsletter Sign-Up Contact Us (305) 674-1300 Become a member Subscribe to our Mailing Lists Membership Benefits Apply Online Events RSVP Full Calendar of Events Chamber Events Signature Events Events Gallery Business Directory Education Foundation Mission Programs Donate Apply Chamber Leadership Message from the President Chamber Mission & History Board of Governors Pillar Trustees Board Chairman’s Circle Honors Citizen of the Year Award Distinguished Service Award Lifetime Achievement Award Excellence in Tourism Award Beach High Alumni Outstanding Achievement Member of the Decade Outstanding Board of Governors Excellence in Business Award Champion of Business Award Small Business of the Year Award Better Beach Real Estate Awards Woman in Business Award Chamber Team Chamber News Miami Beach Community Newspaper Miami Beach Guest Member Center Member Login Subscribe to our Mailing Lists Chamber Councils Hide map Get in touch with us at info@miamibeachchamber.com Miami Beach Chamber of Commerce info@miamibeachchamber.com p. +1 (305) 674-1300 1920 Meridian Ave Miami Beach, FL 33139 + Send us a message + Show map » Theme 1 » Theme 2 » Theme 3 » Theme 4 Miami Beach Bandshell Categories Entertainment Music and Entertainment 7275 Collins Ave Miami Beach FL 33141 (305) 672-5202 Send Email Visit Website Hours: Office hours are 10 am-5 pm. Concerts hours weekdays 6-10 pm weekends 7-11 pm Driving Directions: 7275 Collins Avenue, Miami Beach, FL 33141 About Us In 2015, the CITY OF MIAMI BEACH awarded Miami Beach Bandshell management to THE RHYTHM FOUNDATION, a Miami Beach-based non-profit cultural organization. We present a well-rounded series of concerts. Share × Print Email Facebook Twitter LinkedIn Close Tell a Friend × Send Request Cancel MEMBER LOGIN PRIVACY POLICY TERMS OF USE NEWSLETTER SUBSCRIBE MENU One-on-One Orientation Become a member Events RSVP Chamber Councils Member Hot Deals Business Directory Miami Beach Tourism Education Foundation Chamber Leadership Chamber News Member Center Chamber Map CONTACT US 1920 Meridian Ave Miami Beach, FL 33139 (305) 674-1300 For inquiries about membership: sales@miamibeachchamber.com For general information: info@miamibeachchamber.com Contact Form Site by Gideon Kimbrell NEWSLETTER SUBSCRIBE MEMBER LOGIN PRIVACY POLICY TERMS OF USE MENU One-on-One Orientation Become a member Events RSVP Chamber Councils Member Hot Deals Business Directory Miami Beach Tourism Education Foundation Chamber Leadership Chamber News Member Center Chamber Map CONTACT US 1920 Meridian Ave Miami Beach, FL 33139 (305) 674-1300 For inquiries about membership:  sales@miamibeachchamber.com For general information: info@miamibeachchamber.com Contact Form 2025 © MIAMI BEACH CHAMBER OF COMMERCE. ALL RIGHTS RESERVED."
    },
    {
      "url": "https://www.miamibeachfl.gov/city-hall/parks-and-recreation/rentals/north-shore-bandshell-rentals/",
      "text": "Miami Beach Bandshell Rentals - City of Miami Beach Skip to content Government Menu Toggle Column 1 Menu Toggle Mayor & Commissioners City Manager City Clerk Meetings & Agendas Column 2 Menu Toggle City Meetings Calendar Public Records Boards & Committees Residents Menu Toggle CITY SERVICES Menu Toggle Pay Invoice Residential Garbage Pickup Customer Service Center Code Compliance COMMUNITY Menu Toggle Neighborhood Affairs Housing & Community Services Park Programs Parking Programs Neighborhood Improvements Projects NEWS & UPDATES Menu Toggle MBTV – Watch Live Meetings Press Releases City Calendar Engagement Toolbox – Stay Connected MB Magazine GUIDES Menu Toggle Building Permitting Guide Educational Resources Resident Guide Visitors Menu Toggle Column 1 Menu Toggle Getting Around Beach Conditions Cultural Calendars Column 2 Menu Toggle Parks & Facilities Parking Lot & Garage Map Featured Events Architecture Business Menu Toggle RESOURCES Menu Toggle Economic Development Business Guide Business News PERMITTING Menu Toggle Types of Permits Building Permits Planning & Zoning Online Permitting OPPORTUNITIES Menu Toggle Business Incentives Bidding Opportunities Grants Public Safety Menu Toggle Fire Department Police Department Emergency Management & Weather Emergencies Emergency Preparedness Flood Awareness Departments Menu Toggle Column 1 Menu Toggle Building Capital Improvement Projects City Attorney City Clerk City Manager Code Compliance Customer Service Economic Development Column 2 Menu Toggle Education & Performance Initiatives Environment & Sustainability Facilities & Fleet Management Finance Fire Fire & Police Pension G.O. Bond Housing & Community Column 3 Menu Toggle Human Resources Information Technology Marketing & Communications Mayor & Commissioners Inspector General Management & Budget Parking Parks & Recreation Column 4 Menu Toggle Planning & Zoning Police Procurement Public Works Tourism & Culture Transportation & Mobility MBERP Contact Menu Toggle Feedback Form Subscribe to our Newsletters Department Directory Language Menu Toggle EN ES HT PT FR DE Main Menu MENU Government Menu Toggle Column 1 Menu Toggle Mayor & Commissioners City Manager City Clerk Meetings & Agendas Column 2 Menu Toggle City Meetings Calendar Public Records Boards & Committees Residents Menu Toggle CITY SERVICES Menu Toggle Pay Invoice Residential Garbage Pickup Customer Service Center Code Compliance COMMUNITY Menu Toggle Neighborhood Affairs Housing & Community Services Park Programs Parking Programs Neighborhood Improvements Projects NEWS & UPDATES Menu Toggle MBTV – Watch Live Meetings Press Releases City Calendar Engagement Toolbox – Stay Connected MB Magazine GUIDES Menu Toggle Building Permitting Guide Educational Resources Resident Guide Visitors Menu Toggle Column 1 Menu Toggle Getting Around Beach Conditions Cultural Calendars Column 2 Menu Toggle Parks & Facilities Parking Lot & Garage Map Featured Events Architecture Business Menu Toggle RESOURCES Menu Toggle Economic Development Business Guide Business News PERMITTING Menu Toggle Types of Permits Building Permits Planning & Zoning Online Permitting OPPORTUNITIES Menu Toggle Business Incentives Bidding Opportunities Grants Public Safety Menu Toggle Fire Department Police Department Emergency Management & Weather Emergencies Emergency Preparedness Flood Awareness Departments Menu Toggle Column 1 Menu Toggle Building Capital Improvement Projects City Attorney City Clerk City Manager Code Compliance Customer Service Economic Development Column 2 Menu Toggle Education & Performance Initiatives Environment & Sustainability Facilities & Fleet Management Finance Fire Fire & Police Pension G.O. Bond Housing & Community Column 3 Menu Toggle Human Resources Information Technology Marketing & Communications Mayor & Commissioners Inspector General Management & Budget Parking Parks & Recreation Column 4 Menu Toggle Planning & Zoning Police Procurement Public Works Tourism & Culture Transportation & Mobility MBERP Contact Menu Toggle Feedback Form Subscribe to our Newsletters Department Directory Main Menu MENU Miami Beach Bandshell Rentals Parks & Recreation Menu P&R Home Parks & Facilities Parks Directory Map View Adopt a Bench Adopt a Brick Park Rangers Holidays & Teacher Planning Days Sports Baseball/Softball Basketball Fencing Golf Gymnastics Ice Skating Martial Arts Pickleball Soccer Swimming/Water Aerobics Tennis Volleyball Programs Adult Programs After School Programs No School Days, Winter & Spring Breaks Teen Clubs Toddler Programs & Classes Senior Programs Special Abilities/Inclusion  Program Summer Camps Summer Specialty Camps Youth Programs Features & Amenities Aquatics Bark Parks & Beach Fitness Parks & Centers Playgrounds Specialty Areas & Activities Sports Rentals Miami Beach Bandshell Open Space Rentals Other (Bowling, Ice Skating, Etc.) Paddleboards Pavilions Pool Parties Sports Fields Quick Links Events Contact Us FAQs Forms Rules and Regulations Registration Info Senior Events Calendar Parks & Recreation Menu Ã P&R Home Parks & Facilities Parks Directory Map View Adopt a Bench Adopt a Brick Park Rangers Holidays & Teacher Planning Days Sports Baseball/Softball Basketball Fencing Golf Gymnastics Ice Skating Martial Arts Pickleball Soccer Swimming/Water Aerobics Tennis Volleyball Programs Adult Programs After School Programs No School Days, Winter & Spring Breaks Teen Clubs Toddler Programs & Classes Senior Programs Special Abilities/Inclusion  Program Summer Camps Summer Specialty Camps Youth Programs Features & Amenities Aquatics Bark Parks & Beach Fitness Parks & Centers Playgrounds Specialty Areas & Activities Sports Rentals Miami Beach Bandshell Open Space Rentals Other (Bowling, Ice Skating, Etc.) Paddleboards Pavilions Pool Parties Sports Fields Quick Links Events Contact Us FAQs Forms Rules and Regulations Registration Info Senior Events Calendar With a beautiful blend of Miami Beach art deco and high-tech audio and visual equipment, this classic 1961 open air theater is the perfect location to host your next corporate event, private concert, award ceremony, cocktail reception, product launch, fundraiser, or business meeting. Featuring a one-of-a-kind rain or shine canopy, expansive terrazzo floor, and 9 VIP boxes, perfect for hosting a timeless night. Located adjacent to the ocean and on Collins Ave, the Miami Beach Bandshell accommodates up to 800 seated guests and 1,350 standing. The Miami Beach Bandshell is proudly managed by The Rhythm Foundation Â www.rhythmfoundation.com . For rental information please contact Laura at 305.672.5202 or email laura@rhythmfoundation.com . Amenities FOOD AND BEVERAGE: Club Level Boxes Custom Menus & Offerings Exclusive Culinary Partners ENTERTAINMENT & PRODUCTION: Massive LED Screen on Stage Removable Seating System State-of-the-Art Lighting & Sound EVENT ENHANCEMENTS: All Weather Canopy Video Mapping Interactive Entertainment Creative & Customized DÃ©cor Full Live Stream Capabilities LEARN MORE Since 2015, The Rhythm Foundation has been managing the historic oceanfront amphitheater The Miami Beach Bandshell for the City of Miami Beach, providing music programming, producing its concerts, renting the venue out to other public and private organizations for events, and consulting for other concert and festival producers that rent the venue. Built in 1961 by Norman Giller and Associates, the Miami Beach Bandshell is an anchor of the North Shore Historic District. The historic district received its 2009 designation on the National Register of Historic Places based on the characteristic style of Miami Modernism (MiMo), a post-war modern style of architecture. Since its construction, the open-air amphitheater has served as a community center and gathering place for North Beach residents. Big bands would play on Saturday nights, creating an impromptu ballroom under the stars and in the echo of waves crashing on the shore. Famed variety TV show The Mike Douglas Show filmed on location here during the winter months. For over fifty years the Miami Beach Bandshell has brought people together in the spirit of community, culture and entertainment. Work on the site continues, with recent improvements to the Bandshell Park which features a mandala created by artist Kevin Arrow, memorializing the 50th anniversary of the Beatlesâ âBritish Invasion.â Their first performance in the US was at the nearby Deauville Hotel. Pick-up volleyball games go on in the Beach Bowl courts, just behind the park, and beach goers can enjoy the Beach Walk, a wide paved path which currently connects Allison Park and its life-size turtle sculptures on 62 Street and the quasi-wilderness of the North Shore Open Space Park on 79 Street. Government Menu Toggle Column 1 Menu Toggle Mayor & Commissioners City Manager City Clerk Meetings & Agendas Column 2 Menu Toggle City Meetings Calendar Public Records Boards & Committees Residents Menu Toggle CITY SERVICES Menu Toggle Pay Invoice Residential Garbage Pickup Customer Service Center Code Compliance COMMUNITY Menu Toggle Neighborhood Affairs Housing & Community Services Park Programs Parking Programs Neighborhood Improvements Projects NEWS & UPDATES Menu Toggle MBTV – Watch Live Meetings Press Releases City Calendar Engagement Toolbox – Stay Connected MB Magazine GUIDES Menu Toggle Building Permitting Guide Educational Resources Resident Guide Visitors Menu Toggle Column 1 Menu Toggle Getting Around Beach Conditions Cultural Calendars Column 2 Menu Toggle Parks & Facilities Parking Lot & Garage Map Featured Events Architecture Business Menu Toggle RESOURCES Menu Toggle Economic Development Business Guide Business News PERMITTING Menu Toggle Types of Permits Building Permits Planning & Zoning Online Permitting OPPORTUNITIES Menu Toggle Business Incentives Bidding Opportunities Grants Public Safety Menu Toggle Fire Department Police Department Emergency Management & Weather Emergencies Emergency Preparedness Flood Awareness Departments Menu Toggle Column 1 Menu Toggle Building Capital Improvement Projects City Attorney City Clerk City Manager Code Compliance Customer Service Economic Development Column 2 Menu Toggle Education & Performance Initiatives Environment & Sustainability Facilities & Fleet Management Finance Fire Fire & Police Pension G.O. Bond Housing & Community Column 3 Menu Toggle Human Resources Information Technology Marketing & Communications Mayor & Commissioners Inspector General Management & Budget Parking Parks & Recreation Column 4 Menu Toggle Planning & Zoning Police Procurement Public Works Tourism & Culture Transportation & Mobility MBERP Contact Menu Toggle Feedback Form Subscribe to our Newsletters Department Directory Government Menu Toggle Column 1 Menu Toggle Mayor & Commissioners City Manager City Clerk Meetings & Agendas Column 2 Menu Toggle City Meetings Calendar Public Records Boards & Committees Residents Menu Toggle CITY SERVICES Menu Toggle Pay Invoice Residential Garbage Pickup Customer Service Center Code Compliance COMMUNITY Menu Toggle Neighborhood Affairs Housing & Community Services Park Programs Parking Programs Neighborhood Improvements Projects NEWS & UPDATES Menu Toggle MBTV – Watch Live Meetings Press Releases City Calendar Engagement Toolbox – Stay Connected MB Magazine GUIDES Menu Toggle Building Permitting Guide Educational Resources Resident Guide Visitors Menu Toggle Column 1 Menu Toggle Getting Around Beach Conditions Cultural Calendars Column 2 Menu Toggle Parks & Facilities Parking Lot & Garage Map Featured Events Architecture Business Menu Toggle RESOURCES Menu Toggle Economic Development Business Guide Business News PERMITTING Menu Toggle Types of Permits Building Permits Planning & Zoning Online Permitting OPPORTUNITIES Menu Toggle Business Incentives Bidding Opportunities Grants Public Safety Menu Toggle Fire Department Police Department Emergency Management & Weather Emergencies Emergency Preparedness Flood Awareness Departments Menu Toggle Column 1 Menu Toggle Building Capital Improvement Projects City Attorney City Clerk City Manager Code Compliance Customer Service Economic Development Column 2 Menu Toggle Education & Performance Initiatives Environment & Sustainability Facilities & Fleet Management Finance Fire Fire & Police Pension G.O. Bond Housing & Community Column 3 Menu Toggle Human Resources Information Technology Marketing & Communications Mayor & Commissioners Inspector General Management & Budget Parking Parks & Recreation Column 4 Menu Toggle Planning & Zoning Police Procurement Public Works Tourism & Culture Transportation & Mobility MBERP Contact Menu Toggle Feedback Form Subscribe to our Newsletters Department Directory Quick Links Pay Parking Tickets Pay Bills Recycle Reporting Fraud Special Magistrate Miami Beach Redevelopment Agency City Directory City Meeting Notices Commission & Board Meetings Neighborhood & Condominiums Associations Employees Flood Awareness Live Trolley Updates Master Plans Parking Information Parks & Recreation North Beach Community Redevelopment Agency Subscribe to our Biweekly E-Newsletter: Please enable JavaScript in your browser to complete this form. Enter Your Email * Subscribe to the City of Miami Newsletter Subscribe MBMagazine: Subscribe to other email lists Follow us: Facebook X Instagram YouTube © 2025 Copyright City of Miami Beach. Contact Policies & Disclaimers Accessibility Cookies EN ES HT FR DE PT EN Scroll to Top"
    },
    {
      "url": "https://www.asgllc.com/asg-transforms-the-iconic-miami-beach-bandshell/",
      "text": "ASG Transforms the Iconic Miami Beach Bandshell Solutions Workflows and Tools Cloud Audio Apple Services Systems Integration Managed Services Professional Services Support About About ASG Leadership Team ASG Technology Partners Customer Stories Resources Careers All Resources Blogs News Events Awards Customer Stories Videos Careers Contact Customer Stories Subscribe to Newsletter Advanced Systems Group Transforms the Iconic Miami Beach Bandshell into an Immersive Experience for The Rhythm Foundation Categories Customer Stories Projects August 28, 2023 Share this post During a George Clinton & Parliament Funkadelic concert in his hometown of Miami Beach, Advanced Systems Group ( ASG ) Director of Strategic Accounts Namdev Lisman , re-connected with an old friend at the Miami Beach Bandshell – Rene Pereda . Pereda is head of strategic partnerships for the Rhythm Foundation , which manages The Bandshell. In between sets, Pereda mentioned the Foundation was awarded a grant to update the venue’s video and immersive technology capabilities. Shortly after that conversation, Lisman was introduced to Rhythm Foundation Director James Quinlan and met with Quinlan and Pereda that week to discuss the project. The Rhythm Foundation, well known for introducing both emerging and established world music acts, began its transformational journey when it received management of the bandshell in 2015. In 2021 when John S. and James L. Knight Foundation awarded the Rhythm Foundation a 1.5 million grant the vision was clear: to elevate the Miami Beach Bandshell from just a premier music venue to a world class, technologically advanced, immersive space catering to diverse events. Transformation of the Miami Beach Bandshell, a national historic open-air amphitheater in the heart of North Beach, began with the completion of the solar-powered architectural canopy in 2020. The architectural canopy, which has been a unique feature of the bandshell, will be transformed into a dynamic digital canvas by Miami’s best visual artists with the new Panasonic projectors. After a very competitive bid, ASG was selected to guide the Rhythm Foundation through its video upgrade and determine the best technologies to implement within the bandshell. ASG oversees the entire video infrastructure build-out and creating a multi-purpose, multi-digital experience at The Bandshell. One of the first tasks for ASG was adding software that enables the Rhythm Foundation production crew to project 3D video mapping onto the underside of the canopy and throughout the facility. “The mapping is perfect,” reports Lisman. “It transforms the entire place into a canvas. With Rhythm Foundation’s new initiative, Bandshell Laboratories, they will forge collaborations with talented visual artists and musicians who will create truly unique experiences here. “We can not only do this, but we can also really make this place look phenomenal.” Rhythm Foundation Director James Quinlan, after the first demonstration of the new projection mapping software during the Aqua Garden Flow performance in late May. “We’ve increased their production capacity so that seeing a live concert becomes more of an experiential event,” Lisman continues. “With their previous projection system, they couldn’t do the proper blending of the video. The experience was much more limited. Now, visitors are immersed in visuals as well as music.” Previously when promoters booked the venue, they had to hire their own production company and bring in any gear required. Now, they have pristine projection mapping and upgraded video capacity that can be offered as a service, which expands the foundation’s offering. The Rhythm Foundation recently launched Bandshell Studios, the audio-visual production arm of the iconic venue. Bandshell Studios produces high-quality media that captures the essence of live performance in the space. The new project aims to give the world a fresh look at Miami’s unique cultural scene and share the same sense of discovery they feel meeting the amazing artists who grace the Bandshell stage. While ASG was hired initially for all video production aspects of the upgrade, they’ve also moved the network infrastructure to an all-IP network and are redesigning security and surveillance systems at The Bandshell. “This is a big lift for the Rhythm Foundation,” says Lisman. “We’re redesigning all of their network infrastructure to take them from a dedicated SDI environment to an all-IP network that enables them to be really flexible in terms of production.” Namdev Lisman Director of Strategic Accounts Advanced Systems Group When the entire upgrade is complete, The Bandshell will be not only an unparalleled, experiential A/V venue but also a destination concert hall. After the first demonstration of the new projection mapping software during the Aqua Garden Flow performance in late May, Rhythm Foundation Director James Quinlan said, “We can not only do this, but we can also really make this place look phenomenal.” The work continues through November when the full, multi-dimensional visual experience will be revealed during the foundation’s annual gala event. Want to discuss how ASG can help with your next project? Request a Quote Download a PDF of this ASG Customer Story (4MB) Download Now Share this post 1226 Powell Street \n                    Emeryville, CA 94608 info@asgllc.com 510.654.8300 ASG Careers Contact ASG Solutions Workflows and Tools Cloud Audio Apple Services Systems Integration Managed Services Professional Services Support Resources Customer Stories Blogs News Events Awards Videos About Us About ASG Leadership Team Technology Partners ASG Projects"
    }
  ]
}