{
  "fuentes": [
    {
      "url": "https://www.visittheparkgp.com/about",
      "email": "info@visittheparkgp.com"
    },
    {
      "url": "https://www.visittheparkgp.com/about",
      "email": "info@visittheparkgp.com"
    },
    {
      "url": "https://www.miamiandbeaches.com/about-gmcvb/gmcvb-staff-directory/executive-team",
      "email": "jyarzabal@gmcvb.com"
    },
    {
      "url": "https://www.miamiandbeaches.com/about-gmcvb/gmcvb-staff-directory/executive-team",
      "email": "jyarzabal@gmcvb.com"
    },
    {
      "url": "http://www.professortucker.org/south-point-park",
      "email": "matthew@professortucker.org"
    },
    {
      "url": "http://www.professortucker.org/south-point-park",
      "email": "mjtucker@umn.edu"
    },
    {
      "url": "https://southpointedetail.com/contact/",
      "email": "info@southpointedetail.com"
    },
    {
      "url": "https://www.hillpointe.com/the-team/",
      "email": "info@hillpointe.com"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://www.thebalfourmiamibeach.com/things-to-do/south-pointe-park-pier",
      "email": "info.balfour@morgansoriginals.com"
    },
    {
      "url": "https://www.thebalfourmiamibeach.com/things-to-do/south-pointe-park-pier",
      "email": "info@balfour.com"
    },
    {
      "url": "https://www.thebalfourmiamibeach.com/faq/south-pointe/where-to-park-in-south-pointe-park--pier",
      "email": "balfour.reservations@morgansoriginals.com"
    },
    {
      "url": "https://www.thebalfourmiamibeach.com/faq/south-pointe/where-to-park-in-south-pointe-park--pier",
      "email": "info.balfour@morgansoriginals.com"
    },
    {
      "url": "https://www.thebalfourmiamibeach.com/faq/south-pointe/where-to-park-in-south-pointe-park--pier",
      "email": "info@balfour.com"
    }
  ],
  "mails": [
    "asset-1@2x.png",
    "balfour.reservations@morgansoriginals.com",
    "cservice@thisistheplace.org",
    "customerservice@thisistheplace.org",
    "info.balfour@morgansoriginals.com",
    "info@balfour.com",
    "info@hillpointe.com",
    "info@southpointedetail.com",
    "info@visittheparkgp.com",
    "jyarzabal@gmcvb.com",
    "matthew@professortucker.org",
    "mjtucker@umn.edu",
    "tkramer@thisistheplace.org",
    "you@domain.com"
  ],
  "nombre_sitio": "miamiandbeaches.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visittheparkgp.com/about",
      "text": "WHO WE ARE — Visit The Park 0 Skip to Content Community Resources TIFA Grant Local Workers GPHF Grant GPP Public Safety Foundation Public Safety Donation k-Line Trolley App (iPhone) k-line trolley app (android) ABOUT WHO WE ARE Contact DIRECTORY Dining Retail Services Membership Learn More Application Open Menu Close Menu Open Menu Close Menu Community Resources TIFA Grant Local Workers GPHF Grant GPP Public Safety Foundation Public Safety Donation k-Line Trolley App (iPhone) k-line trolley app (android) ABOUT WHO WE ARE Contact DIRECTORY Dining Retail Services Membership Learn More Application Folder: Community Resources Back TIFA Grant Local Workers GPHF Grant GPP Public Safety Foundation Public Safety Donation k-Line Trolley App (iPhone) k-line trolley app (android) Folder: ABOUT Back WHO WE ARE Contact Folder: DIRECTORY Back Dining Retail Services Folder: Membership Back Learn More Application The Grosse Pointe Park Business Association is a forward-thinking group of business owners dedicated to developing and maintaining the economic vitality of Grosse Pointe Park. We are committed to fostering a culture of connection, communication, and collaboration within our business districts and surrounding communities. MISSION Our mission is to advocate on behalf of Grosse Pointe Park businesses while working to attract continued interest, investment, and development in our city. VISION Our vision is to act as the unifying force behind the Grosse Pointe Park business community and serve as the liaison between business owners, city officials, and residents. Learn more about becoming a member Donate here MEET THE BOARD OF DIRECTORS Zack Assaf The Village Wine Shop Alicia Carlisle Cabbage Patch Saloon Trenton Chamberlian The Bricks Pizzeria Randy Cousineau Pointe Hardware & Lumber ﻿ Joe Hebeka Belding Cleaners Sonny Mio Park Place Market Vina Taylor The Zealous Root JOIN THE BUSINESS ASSOCIATION WEB DESIGN BY NICOLE ST. JOHN Nicole St. John is a visual artist based in Grosse Pointe Park. Her specialties include food and beverage photography, modern design and lettering, and creative direction. She is a proud alumna of the College for Creative Studies in Detroit. View more of her work here . VISIT THE PARK By the Grosse Pointe Park Business Association info@visittheparkgp.com"
    },
    {
      "url": "https://www.miamiandbeaches.com/about-gmcvb/gmcvb-staff-directory/executive-team",
      "text": "GMCVB Executive Team | Miami & Miami Beach Skip to Content The Official Website of Greater Miami & Miami Beach Visitors Meeting Planners GMCVB Partners Travel Professionals Press & Media GMCVB About GMCVB Advertising Opportunities BHI Business Relocation Film/TV Production Sports Commission Partner Extranet Login Language English 中文 Deutsch Español Français Italiano 日本語 Kreyòl Português EN English 中文 Deutsch Español Français Italiano 日本語 Kreyòl Português Explore Explore Explore Things to Do Things to Do See All Things to Do Arts & Culture Attractions Beaches Cruising from Miami Health & Fitness History Multicultural Nightlife Outdoor Experiences Shopping Spa & Wellness Sports Tours & Excursions Water Activities See All Things to Do Arts & Culture Attractions Beaches Cruising from Miami Health & Fitness History Multicultural Nightlife Outdoor Experiences Shopping Spa & Wellness Sports Tours & Excursions Water Activities Added to your favorites Experience Miami's Concerts & Live Music Events Added to your favorites Discover Halloween in Miami Cities & Neighborhoods Travel Interests Travel Interests See All Travel Interests Accessible Travel Family Friendly Indulgent Experiences LGBTQ Travel Multicultural Miami Outdoor Explorer Pet Friendly Travel Relaxing Getaway Sustaining Miami See All Travel Interests Multicultural Miami Accessible Travel Outdoor Explorer Family Friendly Pet Friendly Travel Indulgent Experiences Relaxing Getaway LGBTQ Travel Sustaining Miami Plan Your Trip Plan Your Trip See All Plan Your Trip Insider Guides Itineraries Weddings Transportation International Travel Signup for our newsletter View our Vacation Planning Guide Visitor Centers Weather Webcams See All Plan Your Trip Insider Guides Itineraries Weddings Transportation International Travel Signup for our newsletter View our Vacation Planning Guide Visitor Centers Weather Webcams Added to your favorites Planning a visit to Miami? Check out these itinerary ideas Added to your favorites Use our Hipster Guide to plan the perfect weekend Added to your favorites Love Music? Find Your Rhythm Added to your favorites Summer in Miami Places To Stay Places To Stay Explore All Hotels Beachfront Hotels Boutique Hotels Extended Stay Hotels Hotels Near the Airport Hotels Near PortMiami Luxury Hotels Pet-Friendly Hotels Resort Hotels Hotel Deals Explore All Hotels Beachfront Hotels Boutique Hotels Extended Stay Hotels Hotels Near the Airport Hotels Near PortMiami Luxury Hotels Pet-Friendly Hotels Resort Hotels Hotel Deals Added to your favorites Miami Beach's Luxury Oceanfront Hotels Added to your favorites Top Resorts for Families Eat & Drink Eat & Drink Restaurants Bars & Lounges Craft Beer & Breweries Restaurants Bars & Lounges Craft Beer & Breweries Added to your favorites Experience Miami Spice | through Sept 30 Added to your favorites Looking for Restaurants with Live Music? Events Events See All Miami Events & Festivals September Events Concerts & Live Music Events Signature Annual Events Sporting Events Seasonal Events See All Miami Events & Festivals Signature Annual Events September Events Sporting Events Concerts & Live Music Events Seasonal Events Added to your favorites Miami International Auto Show | Sep 26 - Oct 5 Deals Deals See All Miami Deals Art & Culture Deals Attraction Deals Cruise Deals Hotel Deals Military Deals Restaurant Deals Tours & Outdoor Deals See All Miami Deals Hotel Deals Art & Culture Deals Military Deals Attraction Deals Restaurant Deals Cruise Deals Tours & Outdoor Deals Added to your favorites Indulge in Miami Spice this August - September Follow Us Follow Us Visitors Meeting Planners GMCVB Partners Travel Professionals Press & Media GMCVB About GMCVB Advertising Opportunities BHI Business Relocation Film/TV Production Sports Commission Partner Extranet Login Home About GMCVB GMCVB Staff Directory Executive Team Executive Team David Whitaker President & Chief Executive Officer (305) 539-3001 e-mail David Whitaker has been appointed the next President & CEO of the destination marketing organization (DMO) for Greater Miami and Miami Beach. The appointment is a homecoming for Whitaker who served as a member of the GMCVB team for 17 years (1990 – 2007), most recently as the organization’s Executive Vice President & Chief Marketing Officer. Whitaker left Miami initially in 2007 due to an appointment to the role of President & CEO of Tourism Toronto (now known as Destination Toronto), the DMO for Toronto, where he led the organization for eight years. During his tenure in Toronto, the organization was voted North America’s top convention and visitors bureau and convention center in a poll of over 650 meeting planners. Whitaker led successful bids to host an NBA All-Star Game, Pan American/Parapan American Games and World Pride in 2014. The organization was also central to promoting numerous major festivals including the annual Toronto International Film Festival and Caribana – one of the world’s largest Caribbean heritage celebrations. Upon conclusion of his tenure in Toronto and over the past five years, Whitaker has served as the President & CEO of Choose Chicago, the DMO for Chicago. During his tenure in Chicago, he had the responsibility of promoting and selling the largest convention center in the United States, McCormick Place. Under his leadership, the DMO successfully bid on and hosted an NBA All-Star Game, an MLS All-Star Game, North America’s first Laver Cup international tennis tournament, a NCAA Frozen Four, and numerous international soccer and rugby events.  Chicago, as a destination, has been voted in a prestigious poll of savvy readers of Condé Nast Traveler Readers’ Choice Awards as “Best Big City” to visit for an unprecedented four consecutive years (2017 – 2020), all of which occurred under Whitaker’s leadership. David served on the executive staff of the United Way of Miami-Dade prior to his earlier stint at the GMCVB and is a proud graduate of the University of South Florida with a bachelor’s degree in Mass Communication & Public Relations. David and his wife, Lily enjoy long walks and even longer times cooking together. They are both avid boaters and taking in the performing arts. Rolando Aedo, CDME Chief Operating Officer (305) 539-3090 e-mail Rolando Aedo has been a senior staff member of the Greater Miami Convention & Visitors Bureau (GMCVB) since 1994. He currently serves as Chief Operating Officer (COO) and works closely with the President and CEO on all operational aspects of the GMCVB including governmental relations and stakeholder engagement and support. As the acting Chief Marketing Officer, he also leads the overall marketing strategy and brand development to drive consumer and business demand for Greater Miami and the Beaches as a preferred destination for vacation, meetings, conventions and major events. He also oversees several areas that help drive private revenue to the organization including an 1,100-member partnership division. Mr. Aedo has degrees from Miami-Dade College and Florida International University and an MBA in International Business from the University of Miami. He is also a Certified Destination Management Executive and was recognized as one of the top 25 “extraordinary minds” in sales and marketing by the Hospitality Sales and Marketing Association International. Born in Norfolk, Virginia to Cuban parents, he came to Miami at a very early age where he has spent most of his life and is professionally and civically active. He currently serves on the boards of the Miami Dade County Taxi Advisory Group, Miami Bayside Foundation and the Education Fund among others. Joseph Yarzabal, C.P.A. Chief Financial Officer and Senior Vice President (305) 539-3090 JYarzabal@GMCVB.com The Greater Miami Convention & Visitors Bureau (GMCVB) has named Joseph Yarzabal chief financial officer and senior vice president. The long-standing industry veteran now joins senior leadership at Miami-Dade County’s official destination marketing organization, reporting directly to President & CEO David Whitaker and the GMCVB’s Finance Committee and 38-member board of directors. “Joe has always been an important advantage for our organization,” said Whitaker. “He’s not only seen the destination become what it is today, he’s been instrumental in the financial stability and success of the GMCVB. It’s a privilege working alongside him in this new chapter.” Yarzabal, who most recently served as vice president of financial services, joined the GMCVB in 1990 as director of financial services. Throughout his tenure, he’s overseen development and management of the 1,000-member organization’s accounting policies and internal controls, ensuring the GMCVB maintained its financial management obligations and clean audit findings of more than 30 years.\nAn experienced member of GMCVB senior management, Yarzabal has also helped lead the finance team through significant industry challenges, including Hurricane Andrew in 1992, 9/11, 2008’s global financial crisis and the recent COVID-19 pandemic recovery.\nMiami has been his home since he was a young child. The Miami-Dade College graduate went on to receive Bachelor of Science degrees in accounting and hotel, food & travel services from Florida International University and his MBA from Nova Southeastern University. He became a Certified Public Accountant in 1991. He is also a member of the Atlanta Federal Reserve Travel & Tourism Advisory Council and serves as treasurer for the Black Hospitality Initiative. Carol Motley Senior Vice President, Convention Sales & Services (305) 539-3020 e-mail Carol Motley joined the Greater Miami Convention & Visitors Bureau as Senior Vice President of Convention Sales & Services in 2021. She is excited to lead the team as it works to bring meetings and conventions to the Reimagined Miami Beach Convention Center and other amazing venues in Greater Miami & Miami Beach. She has nearly 30 years of direct experience selling convention and meeting destinations for CVBs, convention centers and hotels during her distinguished career. Carol relocated to Miami from Washington, DC, where she served as Director of Convention Sales at Destination DC for seven years. She and her team developed sales programs to foster a strong relationship between Destination DC and the hotel community, as well as the Walter E. Washington Convention Center, to yield the maximum number of events and room nights for the city to generate positive economic impact. Prior to that, she was the Senior National Account for Visit Orlando for five years. She was responsible for strategically placing citywide business in the Orange County Convention Center. Her focus was on soliciting new and repeat business from the Washington, DC, Maryland and Virginia markets. Before joining Visit Orlando, Carol was Senior Sales Manager for the Hyatt Regency in Chicago, where she was responsible for all citywide business. She has also served as Director of Sales for the Chicago Convention and Tourism Bureau and National Sales Manager for the Baltimore Convention Center. Born and raised in Washington, DC, Carol is a graduate of the University of Virginia in Charlottesville. She earned a Bachelor of Arts in Rhetoric and Communication Studies with a concentration in Business. She is a member of Meeting Professionals International (MPI), the Professional Convention Management Association (PCMA) and the American Society of Association Executives (ASAE). Connie Kinnard Senior Vice President, Multicultural Tourism & Development (305) 539-3123 e-mail Connie W. Kinnard is Senior Vice President of Multicultural Tourism & Development for the Greater Miami Convention & Visitors Bureau (GMCVB). Ms. Kinnard leads the department’s efforts in promoting multicultural neighborhoods, attractions, and events in Miami. The Multicultural & Tourism department not only leads efforts internally, but under Connie's leadership, the department spearheads business development programs for small businesses around tourism capacity building along with a cultural program called Art of Black Miami. Art of Black Miami is a marketing platform that highlights all forms of art, artists and galleries in Miami that touches the African Diaspora. Most recently, her portfolio has expanded to include oversight of the GMCVB’s Black Hospitality Initiative which is a college scholarship and workforce development program for the tourism industry. In addition, she has broadened her scope of work locally and nationally on advancing DEI opportunities. Connie has worked in the hospitality industry for over 25 years and holds a master’s degree in Management from the University of Phoenix and a Bachelor of Business Administration from Tennessee State University. She is active with numerous civic/service organizations and has served on various professional boards or participated in volunteer organizations throughout her career to include Destinations International (Foundation Board), Miami-Dade Chamber of Commerce, Christian Community Services Inc., National Museum of African American Music, Nashville City Club, Women of Tomorrow, National Coalition of Black Meeting Professionals and Alpha Kappa Alpha Sorority, Inc. Prior to joining the GMCVB in 2015, Ms. Kinnard worked for the Nashville Convention & Visitors Corporation (NCVC) for 19 years and held the position of SVP of Multicultural Sales & Development. She also served administratively as the National Museum of African American Music’s, Chief Administrator respectively from 2003-2008 in addition to but in tandem with her responsibilities at the NCVC. top 201 S Biscayne Blvd, Suite 2200 Miami, FL 33131 USA 1-305-539-3000 1-800-933-8448 Contact Us About GMCVB Accessibility Statement Employment at GMCVB Privacy Policy Follow Us! SIGN-UP FOR OUR NEWSLETTER Thank you for your submission ! STAY IN THE KNOW WITH ALL THINGS GREATER MIAMI & MIAMI BEACH Sign Me Up By signing up, you are agreeing to our Privacy Policy . We won’t share or sell your email address. You may unsubscribe at any time. © 2025 Official website Greater Miami Convention & Visitors Bureau. All rights reserved."
    },
    {
      "url": "http://www.professortucker.org/south-point-park",
      "text": "South Pointe Park — Matthew Tucker Matthew Tucker HOME HOME UMN|LA 89 Church Street Southeast University of Minnesota - Twin Cities, MN, 55455 SOUTH POINTE PARK+PIER South Pointe Park and Pier is a complete makeover of a derelict park in Miami Beach, FL.  The oceanfront context offered substantial design opportunities: expansive views of the Atlantic Ocean and the Miami skyline, adjacency to lively residential neighborhoods, and direct access to both the bayfront and beachfront. However, the previous program amenities and design quality of the park required substantial intervention to capitalize on these assets and make the park a vibrant and successful place. The plan included a grand esplanade\"Cut Walk\"  along Government Cut, a 2-acre beach dune restoration area, children’s playground landscape, and a 4,000 square foot park pavilion, all anchored within a dramatic, serpentine landform that provides elevated, dramatic views of the ocean.  The overall structure of South Pointe Park links it to its varied edge conditions – urban streetscape, beach promenade and cruise ship passageway. Within the park, this organizational structure creates a varied and flexible structure that supports a range of activities and experiences. The Park’s location bounded by the Atlantic Ocean and Biscayne Bay presented many environmental challenges to the Park’s design. The immediate adjacency to these sensitive environments required extensive design consideration and coordination with local and state agencies to ensure compliance of the planned park improvements with the stringent coastal and environmental permitting requirements.  Buildings and structures were designed to safely accommodate coastal storms and hurricane forces. Grading and earthwork plans were addressed construction along the beach, which included the use of indigenous limerock for subgrade construction and beach-quality sand in areas of beach dune restoration. Custom site lighting was designed so as to balance site safety while also ensuring protection of marine turtle reproduction.   Eighteen custom cutwalk pylons were designed to provide a signature night-time experience and announce the point of passage to cruise ships. Staggered along the 2,000 linear foot cutwalk, the pylons also signify the annual phenomena of sea turtles retuning to the beach to nest. Each year during the six month turtle nesting season, all the pylon lights change color and illuminate the promenade with amber long-wavelength light, which does not interfere with turtle hatchlings and their migration back to the ocean. Given the project’s immediate adjacency to the Ocean and the Biscayne Bay Aquatic Preserve, a central focus of the project design was the application of sustainable design strategies to have minimal impact on the sensitive coastal hydrology.  The rainwater management system includes an integrated system of collection and harvesting. Nearly all the rainwater that falls on the 22-acre site is harvested and retained on site. To address the seasonal sub-tropical rainfalls of south Florida, site grading was utilized to direct surface flow during small rain events into large areas of native plantings, which allow for infiltration and to minimize reliance on traditional drainage structures. During 25-year or greater storm events, lawn areas serve as temporary detention basins that replenish deep aquifers (through injection wells) and thereby prevent stormwater from entering the Ocean, Bay or Inlet. The planting design concept reflects the park’s various program uses while creating a simple and powerful visual language to define these park spaces. To achieve an immediate visual impact, over 450 existing trees and palms were transplanted to an on-site nursery then relocated once major construction was completed. The park’s active recreation zones were planted with Seashore Paspalum, a drought and salt tolerant grass, and embraced by an informal massing of native Sabal Palms and Coconut Palms.  Along the ocean side, a series of man-made dunes and coquina shell paths lead through masses of native/xeric coastal vegetation, including over 50,000 Sea Oats, Railroad Vine, Gaillardia, Necklace Pod and Yucca species. An acute design sensibility is critical to getting work built to achieve design intent. For two years I worked directly with the City of Miami Beach as the primary Owner’s representative, providing design and construction administration services for the 19-acre South Pointe Park while managing a complex team of local and national subconsultants.  My work included all aspects of on-site construction administration for a design-bid-build project delivery. My work also included material selections both on site and off-site and working with lighting designers and manufacturers for custom lighting fixtures for a $21 million, high-profile project in arts and design-saavy Miami Beach.  A highlight was providing a guided tour to Miami Beach resident actor Sir Michael Caine. CLIENT: City of Miami Beach, FL RESPONSIBILITIES: Hargreaves Associates, Project manager, construction administration. 2007-2009"
    },
    {
      "url": "https://southpointedetail.com/contact/",
      "text": "Contact – South Pointe Detail Home Services Detailing Packages Paint Protection Film Window Tint Ceramic Coatings Monthly Specials Contact 403-365-4529 EMAIL: info@southpointedetail.com 403-724-9999 Contact Contact Info Contact Details Have a question? Want to get in touch? Just fill out this form and we will get right back to you Address: 11500 35 Street Southeast Calgary, AB T2Z 3W4 phone number: 403-365-4529 403-724-9999 E-Mail: info@southpointedetail.com Facebook-f Send us a message Home Services Detailing Packages Paint Protection Film Window Tint Ceramic Coatings Monthly Specials Contact Connect With Us Facebook-square Our Address 11500 35 Street SE Calgary, AB T2Z 3W4 Opening Hours Monday – Friday 7:00 AM – 5:30 PM Saturday 7:30 AM – 4:00 PM 403-365-4529 Questions? Send us an email and let us help. info@southpointedetail.com Exclusive Offers Sign up to receive exclusive offers and up to date information on our monthly specials List choice Ovatheme Leave this field empty if you're human: South Pointe Detail @ 2021. All Rights Reserved"
    },
    {
      "url": "https://www.hillpointe.com/the-team/",
      "text": "The Team - Hillpointe The Team The Hillpointe Difference Project Portfolio Hillpointe Careers Media Investor Login Contact Investor Login Careers Media The Hillpointe Team / Leadership Kelly Mahoney Co-Founder + Managing Partner Kelly heads the firm’s development and construction efforts and is jointly responsible for the firm’s new project origination, pre-development, project underwriting and asset management activities. Read More Kelly has dedicated his entire career to the general construction and multi-family development sector and is an expert in various aspects of site development, procurement, vertical construction and project management. Prior to co-founding Hillpointe, in 2002 Kelly founded Value Added Concepts (VAC), a general contracting and sourcing firm, and has been instrumental in its operation since inception. Kelly has developed and repositioned over $1,000,000,000 of residential and multi-family housing assets representing over 5,000 units with institutional financing partners. VAC has been merged into Hillpointe upon its founding. Kelly holds a B.A. in Economics from the University of Michigan, is NASCLA certified and is a licensed general contractor in several states. STEVEN CAMPISI, CFA Co-Founder + Managing Partner Steven heads the firm’s capital markets and investor relations efforts and is jointly responsible for the firm’s new project origination, pre-development, project underwriting and asset management activities. Read More Prior to co-founding Hillpointe, Steven co-founded and served as Managing Partner of Greenstalk Capital, a real estate focused private equity investment firm. While at Greenstalk, Steven led the firm’s transaction origination, capital markets, and underwriting functions. Prior to Greenstalk, Steven served as an Equity Research Analyst at Robert W. Baird, an employee-owned wealth management, capital markets, asset management and private equity firm, and as an analyst at Bay Head Capital, a high-frequency trading incubator for investment management firms. Steven holds the Chartered Financial Analyst designation. He received a Masters in International Business and a B.S. in Finance from the University of Florida. / Team All Development + Investment Construction Property Management Administration + Accounting CFO GABE SHIBLY, CPA Managing Director + Head of Capital Markets JEFF GOLL, CFA Managing Director of Multifamily Operations MIKE BOONE Managing Director of Asset Management WILL BOHN, CFA Managing Director, Multifamily Development JAMIE TELCHIN Senior Vice President, Debt Capital Markets & Asset Sales CHIP WOOTEN Vice President of External Affairs MARCUS WIEDOWER Vice President of Stabilizations DUSTIN BROCK Vice President of Marketing JESSICA RAY Vice President of Development MARK FOSTER Vice President of Construction JUSTIN SPANGLER Vice President of Construction MARCO MUNOZ Vice President of Development MARK MACK Vice President of Land Planning NICK EVERLY Vice President of Projects ROBERT MAHONEY Vice President, Capital Markets & Investor Relations STEVEN ROGERS, CFA Vice President of Development WILL RUTHERFORD General Counsel SETH COLEMAN Head of Culture & Talent AMY JIMENEZ Director of IT ADAM MACLEOD Director of Project Management ANDREW PERU Director of Risk Management DEREK LODGE Director of Quality Control KAREN STROUT Director of Field Stabilizations OSCAR CRIBAS Director of Facilities ROBERT STILES Director of Projects and Compliance RYAN COONEY Construction Controller SHELLEY EWING Tax Director VICTORIA ROWARS, CPA IT Manager CODY WRIGHT Superintendent JOE MAHONEY Project Superintendent RODRIGO CORRO Project Superintendent JUAN ROMERO Director of Learning and Development AMANDA HERDER Regional Manager DANIELLE VARACCHI Regional Manager LASHA ANTHONY Regional Manager LESLIE MOUBRAY Global Sourcing Manager ANNA “KATIE” PERRY Senior Accounting Manager LINDSAY JOHNSON Corporate Accounting Senior Manager VLADIMIR ARAPAJ Talent Experience Manager ASHLEY PERSAN Accounts Payable Manager CLAUDIA ASPIAZU Operations Technology R&D Manager CLYDE TROCHE Payroll and Benefits Manager KATE CROSS Implementation and Training Manager KELLY BLANK Marketing Manager LINDSAY DE LAU Purchasing Manager LOWREY LOVE Helpdesk Supervisor LUIS LOPEZ Logistics Manager PATRICK PATTERSON Risk Manager ROBERT SCHNETTLER Project Manager SAM PHILLIPS Compliance and Safety Manager STEVE SCHELL Executive Office Assistant MICHELLE JARAE Office Manager PEGGY SPANGLER Office Manager TERESA SUAREZ Warehouse Manager KEN MAHONEY Acquisitions Associate ALEX ADAMS Senior Associate, Client Service & Operations SAMUEL TERRY R&D Senior Analyst BARRY SMITH Procurement Specialist LEILA VAZQUEZ Supply Chain Management Specialist MITCH LIVENSPARGER IT Specialist TERRY VLAHOS Project Coordinator COOPER MCCAW Senior Accountant MADISON HOWELL Network and Systems Administrator HAMMAD GHULAN-HUSSAIN Project Coordinator JONATHAN HERNANDEZ Construction Accountant JUDY BRISLIN Office Admin TANYA DAVIS CFO GABE SHIBLY, CPA Gabe serves as Chief Financial Officer for Hillpointe, overseeing the firm’s accounting and administrative functions. He is primarily responsible for the design and implementation of Hillpointe’s financial controls, reporting, budgeting, and treasury management functions. Gabe joined Hillpointe from Orlando City Soccer Club (OCSC). As Controller for OCSC, Gabe successfully launched Florida’s only fully funded, $150 million, world-class soccer-specific stadium and helped grow the organization to incorporate three professional soccer teams, a youth academy, and two training facilities. Prior to OCSC, Gabe spent seven years in public accounting as an auditor. Serving as Audit Manager, he focused primarily on clients within the Construction, Government Contracting, Manufacturing, Technology, Government, Non-profit, and Community Banking industries. Gabe is a licensed CPA and CGMA and holds a Master’s in Accountancy and a Bachelor’s in Accounting from Stetson University. Managing Director + Head of Capital Markets JEFF GOLL, CFA Jeff is a Managing Director of Hillpointe overseeing the firm’s capital raising and investor relations initiatives. Jeff brings over 14 years of capital markets experience which includes structuring and underwriting capital raises for public and private real estate companies, alternative investment funds, and traditional long-only equity strategies. Prior to joining Hillpointe, Jeff was in Institutional Marketing and Client Service for DePrince, Race & Zollo, Inc., a Value Equity investment manager. Prior to joining DePrince, Race & Zollo, Inc., he was Vice President of Institutional Equity Sales at FBR & Co. Jeff holds the Chartered Financial Analyst (CFA) designation and currently serves on the board of directors for the CFA Society Orlando. He received his Bachelor of Science in Management from Tulane University. Managing Director of Multifamily Operations MIKE BOONE Mike Boone, CPM, is a seasoned property management executive with over 20 years of experience driving operational excellence and strategic growth in the multifamily real estate sector. From leasing agent to executive leadership at national firms, Mike has led high-performing teams and partnered with owners to implement scalable systems that boost performance and asset value. A U.S. Air Force veteran and former Airborne Cryptologic Linguist, he brings discipline, clarity, and a results-driven mindset to every initiative. Mike excels at streamlining operations, enhancing client satisfaction, and developing talent to support long-term success. Managing Director of Asset Management WILL BOHN, CFA Will brings over nine years of experience in asset management across both public and private real estate sectors. As a proven leader in revenue management, budgeting, and strategic planning, he previously served as Senior Vice President of Asset Management at Simply Self Storage, playing a key role in the company’s $2.2 billion portfolio sale to Public Storage. Will began his career at National Storage Affiliates, contributing to $2.5 billion in acquisitions while specializing in data science and asset performance. He is a CFA charter holder with a Master of Finance and a B.A. in Finance and Legal Studies from Tulane University. Managing Director, Multifamily Development JAMIE TELCHIN Jamie is a seasoned real estate executive with over 20 years of experience leading $2 billion in development and redevelopment across 7 million square feet of commercial and multifamily projects. As Senior Managing Director at Waypoint Residential, he oversaw ground-up development nationwide, with a focus on Florida, contributing to 35,000+ multifamily units and $6 billion in total capitalization. Jamie previously held executive roles at top national firms, including Executive Vice President of Development at LXR (a Blackstone affiliate), directing luxury residential projects across the U.S. He holds an MBA from the University of Colorado Denver and has been an active member of the Urban Land Institute since 2008, including service as Chair of the Multi-Family Development Council for Florida and the Caribbean. Senior Vice President, Debt Capital Markets & Asset Sales CHIP WOOTEN Chip Wooten serves as Senior Vice President, Debt Capital Markets & Asset Sales at Hillpointe, overseeing portfolio management, debt origination, and asset sales across the firm’s rapidly growing multifamily portfolio. With over 17 years of experience in capital markets, Chip brings deep expertise in investment consulting, brokerage, and real estate transaction strategy. Before joining Hillpointe, he served as First Vice President at CBRE’s Institutional Multifamily Group, where he led over $2.5 billion in real estate dispositions. Chip began his career in research and business development at leading investment consulting firms. He is a Certified Commercial Investment Member (CCIM) and holds a B.S. in Business Administration from the University of Central Florida. Vice President of External Affairs MARCUS WIEDOWER Marcus serves as the Vice President of External Affairs for Hillpointe. Along with coordinating the firm’s development pipeline, he represents Hillpointe in all public matters, municipal communication and leads a highly skilled team of Project Managers. Prior to joining Hillpointe, Marcus had a long career in civil engineering and land planning services which included owning a commercial and residential construction company that operated across Georgia. His specialties include the management of construction projects, processing of civil and construction permitting, and the handling of any complexity that arises in a new market. Marcus holds a BA of Landscape Architecture from the University of Georgia and serves the people of Georgia’s District 119 in the State’s House of Representatives. Vice President of Stabilizations DUSTIN BROCK Dustin is the vice president of facilities and field stabilizations at Hillpointe and formerly served as the director of asset management at Hillpointe. Dustin has more than twenty years of multifamily asset management experience and heads maintenance and asset management functions for each property in the Hillpointe portfolio. Prior to joining Hillpointe, Dustin served as director of construction and maintenance for GoldOller Real Estate Management, a multifamily firm with over 40,000 units across sixteen states. Additionally, Dustin served as the COO of Left Coast Construction, a multifamily construction and renovation firm where he was responsible for due diligence reporting, asset renovation, and value add projects. Dustin began his career in the multifamily industry with CAPREIT management where he served as regional director of maintenance. Vice President of Marketing JESSICA RAY Jessica leads marketing at Hillpointe, bringing over 20 years of experience in full-funnel marketing, digital strategy, and cross-functional team leadership. Her expertise supports Hillpointe’s mission to deliver quality, attainable multifamily housing while enhancing brand visibility and resident engagement. Prior to joining Hillpointe, Jessica served as Senior Director of Marketing & Communications at Full Sail University, where she played a key role in expanding the university’s degree programs to over 65. Her leadership helped thousands of students pursue careers in entertainment, media, and business. Jessica holds a B.S. in Organizational Communications and an M.S. in Integrated Marketing Communications from West Virginia University. She is known for building high-performing teams and delivering measurable marketing results that drive growth. Vice President of Development MARK FOSTER Mark serves as Vice President of Development at Hillpointe, where he manages the underwriting, due diligence, site design, as well as the pre-development and entitlement processes for Hillpointe. Prior to joining Hillpointe, Mark held various leadership positions in real estate development and investment, successfully managing ~$1 billion in large-scale commercial and residential projects across the U.S Mark holds a Master of Business Administration (MBA) in Corporate Finance and a Master’s in Real Estate Finance and Construction Management from the University of Denver. With a deep background in real estate investment, land development, and commercial real estate, Mark plays a key role in expanding Hillpointe’s portfolio of high-quality, attainable housing communities in Colorado, Arizona, Utah, and Nevada. Vice President of Construction JUSTIN SPANGLER Justin is a senior project manager at Hillpointe, leading the firm’s MEP divisions and a highly skilled team in various specialty projects. Before joining Hillpointe, Justin served as a senior project manager at Value Added Concepts where his responsibilities included overseeing trade subcontractors and coordinating the installation of all utilities, including bulk fiber networks. Justin also served as a foreman for Bach Electric, a Michigan-based electrical wiring firm, managing and directing the installation of all key electrical systems on over 500 homes developed by Mayberry Homes and CRMC. Vice President of Construction MARCO MUNOZ Marco is one of Hillpointe’s senior project managers. He heads the firm’s crew divisions and coordinates the scheduling of manpower and suppliers for all construction operations. Marco has extensive background in residential and multifamily construction. Prior to joining Hillpointe, Marco served at Value Added Concepts as a senior project manager and field manager for residential and multifamily projects. For over ten years, he was a project manager and foreman for White Oak Homes where he oversaw and directed the construction of over 1,400 homes in the Metro Athens, Georgia, area. Vice President of Development MARK MACK Mark serves as a Vice President of Development for Hillpointe. He plays a pivotal role in driving full underwriting, due diligence, entitlements, land and loan closings, and acquisition efforts. Prior to joining Hillpointe, Mark held various roles in the multifamily investment and acquisitions sector, including Development Manager at Waypoint Residential. He received his bachelor’s degree in business administration from the University of Georgia where he majored in Finance. Vice President of Land Planning NICK EVERLY Nick serves as Vice President of Land Planning for Hillpointe. Nick is primarily responsible for managing the company’s land pipeline throughout the pre-development phase. Nick brings over 15 years of experience in the real estate development industry, including design, project management, and owner representation. Prior to joining Hillpointe, Nick served as Senior Land Development Manager with both Ashton Woods Homes and Meritage Homes, where he directed the pre-development process for prospective single-family residential communities across central Florida. He received his Bachelor of Science in Civil Engineering from the University of Florida. Vice President of Projects ROBERT MAHONEY Robert Mahoney is the Vice President of Projects at Hillpointe. With a remarkable career spanning over 30 years in commercial finance and project management, Robert brings a wealth of experience and expertise to our team. At Hillpointe, Robert’s focus lies in hands-on project management, meticulous compliance and procurement, and offering insightful leadership consulting. He plays a pivotal role in guiding our projects from pre-construction design through to their successful completion and the attainment of the final certificate of occupancy. Robert’s exceptional business acumen shines through his unwavering commitment to fostering teamwork and maintaining transparent, continuous communication with both the Hillpointe team and stakeholders throughout the entire project life cycle. Before joining our organization, Robert managed supplier relationships for Ford Credit in North America. During this role, he played a crucial part in identifying quality control gaps and operational risks, contributing significantly to the enhancement of supplier quality and risk management. Robert holds a Bachelor of Science in Business Management from Wright State University and earned his MBA in Finance from the University of Detroit-Mercy. Vice President, Capital Markets & Investor Relations STEVEN ROGERS, CFA Steven is a Vice President of Capital Markets & Investor Relations at Hillpointe. He directly assists with the firm’s capital raising and investor relations endeavors. Steven brings over 8 years of capital markets and investment experience which includes asset management, economic research, and institutional/private portfolio management. Prior to joining Hillpointe, Steven was a senior portfolio manager at Bank of America Private Bank overseeing both institutional & private client investable assets. Prior to joining Bank of America Private Bank, Steven was an investment strategist with Merrill Lynch. Steven holds the Chartered Financial Analyst (CFA) designation and is currently a member of the CFA Society of Orlando. He received a Bachelor of Science in Finance from the University of Florida. Vice President of Development WILL RUTHERFORD Will is the Vice President of Development at Hillpointe, leading underwriting, pre-development, and closings to ensure that multifamily projects are delivered on time and on budget. With 7+ years of experience in real estate development and investment, he specializes in site selection, design management, entitlements, construction oversight, and deal structuring. Prior to Hillpointe, Will held roles at Horizon Group of Companies and JT Klein Company. He is a licensed attorney in Wisconsin and a member of the Wisconsin Real Estate Alumni Association. Will holds a B.A. from the University of Vermont, a J.D. from the University of Wisconsin–Madison, and an MBA with a focus in Real Estate Private Equity. General Counsel SETH COLEMAN Seth serves as General Counsel for Hillpointe and is responsible for managing all legal aspects of the company, including, but not limited to, operations, transactions, corporate affairs, compliance, and fund management. Seth joined Hillpointe from Publix Super Markets. As a senior real estate attorney at Publix, Seth handled the company’s real estate transactions and collaborated with outside counsel. Before Publix, Seth represented national and regional developers in real estate and financial transactions as an attorney at Shutts & Bowen LLP, a full-service business law firm. Seth is licensed to practice in Florida and the District of Columbia and holds a Juris Doctor from Florida State University College of Law. Seth also studied international law at the University of Oxford, St. Edmund Hall. In 2022, Tampa Bay Business Journal identified Seth as a Top Corporate Counsel Rising Star honoree, an award that recognizes in-house counsel across multiple industries and specialties. Head of Culture & Talent AMY JIMENEZ Amy serves as the Head of Talent & Culture for Hillpointe leading the firm’s talent acquisition, team development, and culture initiatives. She is primarily responsible for strategic workforce growth planning with a focus on transforming business needs into comprehensive people strategies that align Hillpointe’s mission and core values with our people operations. Prior to joining Hillpointe, Amy served as the Vice President of Human Resources for Simply Self Storage, a Blackstone Real Estate Income Trust (BREIT) portfolio company, where her organizational leadership strategies reduced turnover by unifying core values with people operations to drive a world class culture brand leading to a successful $2.2 billion sale to Public Storage. Amy has 20 years of experience in human resources, is an M.B.A. graduate of Rollins College, possesses a B.B.A. from Northwood University, holds an S.P.H.R. certification, and is a U.S. Army combat veteran. Director of IT ADAM MACLEOD A seasoned IT leader with 25+ years of experience driving innovation across startups, mid-sized companies, and enterprise environments. Specializing in IT infrastructure and cybersecurity, Adam delivers secure, scalable tech solutions aligned with business goals. Born and raised in Queens, NY, he holds a B.S. in Computer Science and is currently completing a Master’s in Cybersecurity. Passionate about continuous learning and team leadership, Adam brings a strategic approach to every challenge. Outside of work, he’s a proud father of two and stays active through Boxing and Brazilian Jiu-Jitsu. Director of Project Management ANDREW PERU Andrew Peru is a seasoned program manager with over 25 years of experience leading enterprise initiatives across IT, finance, and operations. He has delivered large-scale projects for companies like UKG and The Walt Disney Company, with deep expertise in mergers, system integrations, and business process automation. Andrew excels at driving operational efficiency, reducing costs, and leading cross-functional teams to success. His background includes advanced project management training and multiple ITIL certifications, making him a trusted expert in strategic planning and enterprise technology solutions. Director of Risk Management DEREK LODGE Derek serves Hillpointe in the role of director of risk management, providing assistance with operational aspects of the development and lease-up process and risk management supervision. With over thirty years as a property manager, supervisor, or owner, Derek has provided oversight for numerous apartment communities in twelve states. Major clients have included ING-Barings, G.E. Capital, Overland Capital Group, and Alex Brown Realty. In the last five years, he directed the lease-up and subsequent disposition of four student housing communities and several workforce housing projects. Derek holds the Certified Property Manager designation, is a graduate of Sheffield University in England with a bachelor of laws and has an MBA from the J.L. Kellogg Graduate School of Management at Northwestern University. Director of Quality Control KAREN STROUT Karen serves as Director of Quality Control for Hillpointe Construction. Prior to taking on this role, she served as Vice President of Start-up Leasing at Hillpointe, overseeing the hiring of on-site leasing staff and directing leasing initiatives for Hillpointe’s newly developed properties. Karen has over 32 years of experience in the multifamily housing industry. Prior to joining Hillpointe, Karen held positions with The Rohdie Group, Olympus Property, and Steven D. Bell and Company. For the majority of her career, she worked as the Director of Operations for King Management Solutions where she managed a portfolio of more than thirty communities across the Southeast, increasing ROI for both stabilized properties and new developments. Karen worked integrally with owners, developers, and local governments, targeting high-growth markets and ensuring properties were built to specification. She conducted due diligence inspections prior to ownership possession, ensuring expectations were met at the highest standard. Karen previously served as president of the Mid Georgia Apartment Association. She has also been a part of multiple boards, has conducted training seminars, and has received numerous awards for her outstanding work. Director of Field Stabilizations OSCAR CRIBAS Oscar started his career in the multifamily housing industry ten years ago in South Florida doing maintenance. Since that time, Oscar has managed multimillion-dollar value add programs and punch completions for multi-family projects in Florida and Georgia. Oscar thrives on the constant changes and challenges within the industry. Director of Facilities ROBERT STILES Robert serves as the Director of Facilities for Hillpointe. His background includes more than 35 years of experience in the maintenance and construction fields, having held leadership positions in property management throughout his career. This uniquely positions him to oversee and manage maintenance operations for all Hillpointe properties throughout the growing portfolio. In this role, Robert is responsible for the development and training of Hillpointe’s regional and local maintenance teams, establishing and maintaining external vendor relationships, overseeing capital improvement projects, and much more. A New York native, Robert enjoys listening to music and spending time with his family outdoors in his free time. Director of Projects and Compliance RYAN COONEY Ryan Cooney is the director of projects and compliance with a proven history of on-time, on-budget, safe, high quality project completions. He is a veteran construction project manager with experience in all stages of multi-million-dollar construction projects for local government and private sector clients. His 15 years of project management experience includes critical path schedules, scopes of work, negotiating contracts, estimating, and bidding, including managing crews of up to 200 in ground up concrete and steel structures and a variety of other multi-family construction projects. Ryan holds a BS in Construction Management from Eastern Michigan University and is a Licensed Certified General Contractor in the State of Florida. Construction Controller SHELLEY EWING Shelley serves as Construction Controller at Hillpointe, where her responsibilities include integrating new database software and management systems to enhance and streamline processes. With a background in the multi-family industry, Shelley has gained valuable experience ranging from her role as Vice President of Operations to the operationalization of a construction firm. She is adept at working across technical disciplines and handling various accounting tasks. Shelley holds a Master of Science Degree in Business Administration from the University of Central Florida and is also a published author. Tax Director VICTORIA ROWARS, CPA Victoria is the Tax Director at Hillpointe, where she oversees all aspects of tax planning, compliance, and accounting for the firm’s growing real estate portfolio. With over 10 years of experience in both public accounting and private industry, she brings deep expertise in pass-through taxation, long-term planning, and real estate tax incentives. Before joining Hillpointe, Victoria worked at Marcum LLP, serving clients in real estate, construction, and other middle-market sectors. She also led tax compliance for a $1.6 billion insurance brokerage group. A licensed CPA in Florida, Victoria holds dual B.S. degrees in Accounting and Real Estate from Florida State University. IT Manager CODY WRIGHT As IT Manager for Hillpointe, Cody oversees the firm’s internal technology functions. Cody began his IT career as an advanced repair agent with Best Buy’s Geek Squad. He then advanced to a position as IT support technician for the Forsyth County Government, managing daily IT duties for all departments and buildings, including the courthouse, police stations, and fire departments. During this time he also started his own business as an IT contractor and music video producer. These skills have served him well in his present role at Hillpointe, where he strives to ensure that all technology used day to day delivers excellent results. Superintendent JOE MAHONEY Joe is a superintendent with Hillpointe Construction. He primarily oversees onsite coordination with various trades, and he has specific expertise in landscaping and site-specific closeout. Project Superintendent RODRIGO CORRO Rodrigo has been with Hillpointe Construction since the company began, and for five years prior, worked for Value Added Concepts within various trades. He has worked up the ladder with Hillpointe Construction and is now an expert in the field who can be relied on at all times to ensure projects run safely and smoothly. Project Superintendent JUAN ROMERO Juan is a United States Marine Corps veteran who grew up in his family’s construction business, learning many trades from his father. Juan began his career in the multifamily housing sector in 2014 and hasn’t looked back. He has managed several properties, implementing successful maintenance programs and teams throughout the state of Florida. Juan is an integral member of the HPC team, specifically in his consistent work to establish and grow a team of seasoned professionals and vendors in the Central Florida region. Director of Learning and Development AMANDA HERDER Amanda is the Director of Learning and Development at Hillpointe, leading company-wide learning initiatives including application support for Entrata. With over 20 years of experience in hospitality, property management, and customer service training, she is passionate about creating scalable programs that enhance team performance, drive operational excellence, and foster career growth. Before joining Hillpointe, Amanda served as Manager of Training at Westmont Hospitality Groups Extended Stay Division, implementing blended learning across 50+ properties and optimizing LMS platforms and designed programs that improved guest satisfaction and employee engagement. She also brings extensive experience in leadership coaching, curriculum design, and performance management from her previous roles at Vie Management and Signature Worldwide. A Certified Professional in Training Management (CPTM), Amanda is passionate about using innovative learning solutions and technology to enhance the employee experience and operational excellence. Regional Manager DANIELLE VARACCHI Danielle oversees several of Hillpointe’s multifamily communities in Georgia and South Carolina, leading operations, staffing, and performance. With over 25 years of experience in multifamily housing, she brings deep expertise in project management, financial oversight, and strategic operations. Before joining Hillpointe, Danielle served as Director of Operations at UDR, where she streamlined leasing, renewals, and business processes to improve efficiency and reduce costs. She holds CAPS and CAM certifications through the National Apartment Association and earned a B.A. in Project Management from the University of Nebraska, Lincoln. Danielle is passionate about developing high-performing teams and advancing Hillpointe’s mission to provide best-in-class workforce housing throughout the Sun Belt. Regional Manager LASHA ANTHONY A seasoned property management professional with over 20 years of experience, LaSha serves as a Regional Manager at Hillpointe. She is responsible for assets in the Southeast and draws on her extensive background in property repositioning, compliance monitoring, and asset stabilization to equip her teams for success. LaSha emphasizes team building and employee development by fostering a positive work culture that resonates within Hillpointe and the broader multifamily industry. Before joining Hillpointe, LaSha managed a large multifamily portfolio spanning eight states, achieving notable milestones such as completing 70 capital transactions, increasing Net Operating Income (NOI) by 54%, and reducing portfolio delinquency by 50%. Beyond her professional commitments, LaSha remains dedicated to community service and holds designations as a Housing Credit Certified Professional and Specialist Housing Credit Management Professional, C3P. Her role as a Notary Public further demonstrates her commitment to service and community welfare. Regional Manager LESLIE MOUBRAY Leslie serves as Regional Manager for Hillpointe. Leslie plays a pivotal role in spearheading property management operations for the company’s expanding multifamily portfolio in Central Florida. With over 23 years of experience in multifamily property management, Leslie has demonstrated her expertise by successfully overseeing large-scale portfolios across the Midwest and Southeast. Prior to her tenure at Hillpointe, Leslie held the position of Regional Director at McKinley, a prominent real estate firm with $4.6 billion valuation, headquartered in Ann Arbor, Michigan. During her remarkable 18-year journey, she managed operations of over 5,000 apartment homes, showcasing adeptness in achieving outstanding results and fostering enduring relationships. In 2017, Leslie transitioned to Bell Partners, assuming the role of Regional Director for Central Florida, further enriching her professional journey. Renowned for her exceptional leadership, Leslie is recognized for her ability to cultivate strong business practices, forge lasting connections, and cultivate dedicated teams of property management professionals. Active in the industry, Leslie has served as a Board Member for the Apartment Association of Greater Orlando, contributing her insights and expertise to the Education and Legislative Committees. Leslie calls Winter Park, Florida, home, but remains deeply connected to her Midwest roots. Global Sourcing Manager ANNA “KATIE” PERRY Anna “Katie” Perry is a Global Sourcing Manager here at Hillpointe. With her expertise in directing and controlling material sourcing, logistics, and delivery, Katie plays a pivotal role in ensuring the smooth operation of our supply chain, always striving for continuous quality improvement while reducing costs and mitigating supply chain risks throughout our projects’ life cycles. Before joining Hillpointe, Katie garnered valuable experience in the field of Supply Chain Management. She was actively involved in forecasting and sourcing for Power Partners, a global leader in commercial power products manufacturing. Additionally, she served as an Area Manager for Daifuku, overseeing operations at a major Amazon distribution center. Katie’s impressive academic background includes a Bachelor’s degree in business management from the University of North Georgia, where she also earned a full-ride athletic scholarship to Columbus State University. In her leisure time, Katie cherishes moments with her husband, Clay, as they enthusiastically support their daughters in their fastpitch softball endeavors. They’re also die-hard Braves fans and, during football season, you’ll find them passionately cheering on the Georgia Bulldogs. Senior Accounting Manager LINDSAY JOHNSON Corporate Accounting Senior Manager VLADIMIR ARAPAJ Vladimir serve as Corporate Accounting Senior Manager at Hillpointe. He is responsible for overseeing accounts payable, accounts receivable, banking activities, and reconciliations. His diverse experience has equipped him with the knowledge and skills to excel in financial management and reporting roles. Prior to joining Hillpointe, Vladimir served as the Senior Accounting Manager for the German American Chamber of Commerce in New York, NY. In this role, he managed the Accounting department, which was ranked as the third largest by budget among 79 chapters. Vladimir holds a Bachelor of Science in Finance and a Master of Science in Business Informatics from University of Vienna, Austria. Talent Experience Manager ASHLEY PERSAN Ashley serves as the Human Resources Generalist for Hillpointe. She focuses on a vast range of HR tasks and administration while supporting employees and departments on a day-to-day basis. Before joining Hillpointe, Ashley worked in the HR Department at Kaufman Lynn Construction, a South Florida-based commercial construction firm focused on multi-family housing. Ashley holds a Bachelor of Science degree in Psychology from the University of Central Florida. Go Knights! Accounts Payable Manager CLAUDIA ASPIAZU Claudia serves as the Accounts Payable Manager for Hillpointe, where she showcases her expertise in project controlling and accounts payable. She combines strategic insight with meticulous attention to detail to optimize the company’s financial operations, demonstrating her proficiency and dedication in her role. In her free time, Claudia finds fulfillment in family life, cherishing moments spent with her loved ones. An avid traveler, she embraces opportunities to explore new destinations with her two young children, fostering bonds and creating lasting memories. Operations Technology R&D Manager CLYDE TROCHE Clyde serves as Operations Technology R&D Manager at Hillpointe, where he leads the development and deployment of innovative tech solutions to enhance operational efficiency across the organization. Since joining Hillpointe as an IT Technician, he has advanced through roles in Business Analytics and IT Implementation Management, driving system improvements and cross-functional integration. Prior to Hillpointe, Clyde gained valuable experience in IT support and consulting with Noventech, Inc., Geek Squad, and CIT Trucks. He holds a Bachelor’s degree in Computer Systems Technology from Illinois State University. Clyde’s blend of technical expertise and strategic insight supports Hillpointe’s commitment to innovation in the multifamily housing industry. Payroll and Benefits Manager KATE CROSS Kate brings over seven years of experience as a skilled human resources professional to her role as the Payroll and Benefits Manager at Hillpointe. Her expertise lies in managing smooth payroll operations and delivering comprehensive benefits administration. She holds a bachelor’s degree from the University of North Florida. Beyond her professional achievements, Kate finds joy in spending quality time with her loved ones and exploring new destinations through travel. Implementation and Training Manager KELLY BLANK Kelly brings an impressive track record of over 17 years of multifamily expertise to the Hillpointe team. Her journey in the industry has been enriched through various management roles with esteemed companies such as Bell Partners and Olympus Properties. Kelly’s Hillpointe journey commenced as a Community Manager, where her dedication and proficiency led to her current role as the Implementation and Training Manager. In her current capacity, she assumes responsibility for the systems and software integral to asset optimization across our organization. Additionally, she plays a pivotal role in training associates on the diverse array of multifamily software programs employed by Hillpointe. Kelly’s professional focus revolves around elevating Hillpointe’s status as a prospective national brand. She is consistently in pursuit of innovative technologies and services that promise operational efficiencies, enrich the resident and prospect experience, augment asset value, and align with our financial and business objectives. Kelly is committed to empowering Hillpointe’s community leaders and their teams to foster business growth while delivering exceptional resident experiences. Her passion lies in enhancing associate engagement and elevating property performance, guiding our teams to operate at the highest standards within the market. Marketing Manager LINDSAY DE LAU Lindsay is the Marketing Manager for Stabilized Communities, where she leads marketing strategy, content development, and resident engagement for the Hillpointe portfolio. She specializes in brand management, digital marketing, and visual storytelling—overseeing social media, advertising campaigns, and on-site marketing support to enhance community visibility and drive occupancy. Before joining Hillpointe, Lindsay held marketing roles at TLC Engineering Solutions and HNTB, where she developed a strong foundation in brand strategy and marketing. She earned her B.S. in Business Administration from the University of Central Florida. Outside of work, she enjoys time with her loved ones and her dogs, Apollo and Remy. Purchasing Manager LOWREY LOVE As Purchasing Manager Lowrey is responsible for purchasing and maintaining strategic supply chain relationships. He previously served as Manager of Projects and Compliance, specializing in overseeing construction projects during their pre-development and early construction phases. His responsibilities included identifying and addressing potential quality, security, and safety risks, closely monitoring project progress, and meticulously maintaining project documents and reports. Lowrey’s educational background includes a major in Residential Property Management from the University of Georgia. Helpdesk Supervisor LUIS LOPEZ Luis is the Helpdesk Supervisor at Hillpointe, overseeing day-to-day IT support and ensuring seamless technology operations across the company. He manages helpdesk workflows, leads user support for hardware, software, and network systems, and plays a key role in onboarding new associates, coordinating device setup, system access, and user training. Luis also supports the implementation of technology in new multifamily communities, ensuring reliable connectivity and infrastructure from the outset. An A+ certified professional, he is committed to cybersecurity best practices and safeguarding Hillpointe’s digital assets. Before transitioning to IT, Luis was a teacher and holds a B.A. in History from the University of Florida. Logistics Manager PATRICK PATTERSON Patrick has spent his entire career in the construction trades and has been with Hillpointe Construction since the company was formed. He is excellent with occupied tenant service and can always be counted on to deliver solutions to everyday construction problems and worksite operations. Risk Manager ROBERT SCHNETTLER Robert Schnettler serves as Risk Manager for Hillpointe. A highly accomplished safety and security professional, Robert’s remarkable career spans over 25 years. Throughout his extensive tenure, he has developed an expertise in asset protection and workforce safety. His unwavering commitment to excellence compliments Hillpointe’s progressive corporate initiative to exceed the accepted standards of site safety. Among his notable achievements, Rob holds both General Industry and Construction OSHA 30 certifications, showcasing his comprehensive knowledge and expertise in occupational safety and health. Whether in the field on a construction site or supporting the numerous Hillpointe communities, Robert ensures that associates are working in an environment guided by Hillpointe’s paramount focus on safety. Project Manager SAM PHILLIPS Sam is a project manager with Hillpointe Construction. Sam joined the organization in 2016 and coordinates all aspects of project execution, specifically municipal compliance. Compliance and Safety Manager STEVE SCHELL Steve serves as Compliance and Safety Manager for Hillpointe, LLC. He is licensed with EPA and OSHA training. Steve brings to Hillpointe over twenty years of single and multifamily housing experience. Prior to joining Hillpointe, Steve directed maintenance and rehab/construction efforts for Tricon American Homes, managing all of Tricon’s maintenance personnel and superintendent teams from central Florida to southern Georgia. In his twenties, Steve proudly served in the United States Coast Guard. Executive Office Assistant MICHELLE JARAE Michelle is the Executive Office Assistant for Hillpointe focusing on a wide range of senior level administration and supportive office tasks. Michelle helps manage the corporate office in Winter Park, Florida, and assists alongside co-founder Steven Campisi. Prior to joining Hillpointe, Michelle was an Executive Assistant for Tavistock and also served as the Brokers Assistant for Isleworth Realty. Originally from Cleveland, Ohio, Michelle’s hobbies were always being a part of classical choirs such as The Cleveland Orchestra Choir and shortly after her move to Florida, she became a member for The Bach Festival Choir at Rollins College. Michelle would like to finish her schooling and achieve a BA degree in Business Administration in the near future. Office Manager PEGGY SPANGLER Peggy has worked with Hillpointe Construction since its inception, and with Hillpointe’s predecessor firm, Value Added Concepts, since its beginning more than ten years ago. Peggy manages the construction operations office in Athens, Georgia, and has worked alongside co-founder Kelly Mahoney in multiple roles throughout the years. She is integral to construction execution and subcontractor relations and is an extremely valuable team member whom many employees and subcontractors rely on daily. Office Manager TERESA SUAREZ Teresa Suarez serves as an office manager for Hillpointe Property Management. She provides office support for all onsite personnel, with a primary concentration on property management software systems and bookkeeping. Teresa has served an on-site property manager for over twenty years, including management of conventional housing, student housing communities, and condominium associations. She has substantial experience in a variety of industry-standard property management software and bookkeeping systems. Warehouse Manager KEN MAHONEY Ken serves as warehouse manager for Hillpointe Construction. His responsibilities include direction and oversight of velocity inventory control, project deliveries, and material coordination. Acquisitions Associate ALEX ADAMS Alex is an Acquisitions Associate at Hillpointe. He is primarily responsible for sourcing and underwriting investment opportunities, the preparation of financial models, conducting market research and monitoring the firm’s deal origination pipeline. Prior to joining Hillpointe, Alex was a Development Manager at VanTrust Real Estate in Jacksonville. At VanTrust, he was responsible for preparing financial models, compiling market research, and reviewing pre-development and due diligence items. Alex received his Masters of Science in Real Estate and his Bachelors in Mechanical Engineering from the University of Florida. Senior Associate, Client Service & Operations SAMUEL TERRY Samuel serves as Senior Associate, Client Service & Operations for Hillpointe, LLC. He directly assists with the firm’s investment fund accounting and treasury operations. He is primarily responsible for assisting with the firm’s treasury management operations as well as assisting with investor relations. Prior to joining Hillpointe, Samuel worked in public accounting as a tax accountant. As a tax accountant, he focused primarily on individual and business tax returns across a wide variety of industries. Samuel holds bachelor’s and master’s degrees in accounting from Mercer University. R&D Senior Analyst BARRY SMITH Barry serves as a Senior Analyst in R&D at Hillpointe, directing administration and operations for the Hillpointe Construction office. Procurement Specialist LEILA VAZQUEZ Leila serves as a dedicated Procurement Specialist at Hillpointe Construction, where her primary responsibility is to ensure the prompt and efficient ordering and delivery of the company’s electrical materials and products. Additionally, she offers essential administrative support by meticulously processing, verifying, and reconciling invoices with our valued vendors. Before becoming an integral part of Hillpointe, Leila accumulated a wealth of experience through over 8 years of service as a project administrator for an electrical contractor. Supply Chain Management Specialist MITCH LIVENSPARGER Mitch Livensparger is a Supply Chain Management Specialist at Hillpointe Construction, where he plays a crucial role in overseeing the procurement and inventory management of lumber. Mitch is dedicated to managing Hillpointe’s relationships with suppliers and carriers in the lumber industry, ensuring a smooth and efficient supply chain. Additionally, he takes charge of producing Bill of Ladings, both for the Hillpointe team and third-party trucking partners. Before joining our team, Mitch spent three years as a supply chain associate at an upscale furniture company, gaining valuable experience in the field. With over a decade of experience in the trucking industry, Mitch possesses a deep appreciation for the pivotal role transportation plays in keeping the world moving. Outside of work, Mitch finds joy in spending quality time with family and friends. His passion for exercise keeps him active, and he’s an avid sports enthusiast, often catching games on TV. Given his love for the outdoors, it’s no surprise that Mitch enjoys embracing the beauty of nature whenever possible. Originally hailing from Angola, IN, a small town surrounded by cornfields, he made the move south a few years ago to escape the chilly Midwest winters and embark on new adventures. IT Specialist TERRY VLAHOS Terry is an IT Specialist with a strong foundation in Emerging Tech and leverages a background in computer craftsmanship to excel. His expertise lies in remote troubleshooting, addressing tech inquiries, and setting up PCs for new Hillpointe hires. Combining his education from Athens Technical College with previous roles, Terry brings a skill set that profoundly benefits our IT department. Pioneering smooth daily technology operations, he’s fueled by a fervor for advancing automation and ensuring client satisfaction. Project Coordinator COOPER MCCAW Cooper is a Project Coordinator in the Projects and Compliance department at Hillpointe. His role primarily centers around pre-construction setup, coordinating site services, handling permit submissions, and providing support to our supply chain and logistics division. Cooper joined Hillpointe in April 2023, armed with a strong educational background. He holds a Bachelor of Science in Business Administration and a Master of Business Administration in Real Estate Development, both earned from Liberty University. In addition to his academic achievements, Cooper brings a wealth of experience from his time as a 6-year letterwinner on the Liberty University football team, where he played as an offensive lineman. Beyond work, Cooper’s interests include sports, golfing, and cherishing moments with family and friends. Senior Accountant MADISON HOWELL Madison is a Senior Accountant at Hillpointe, focusing on a wide range of accounting tasks related to projects under construction. Prior to joining the Hillpointe team, Madison served as a Staff Accountant for HCA Healthcare, a Fortune 500 company and one of the nation’s largest healthcare providers, where she supported over 15 healthcare practices and centers. With her prior experience in accounting and enthusiasm to learn further, she works to contribute to the growth-oriented atmosphere at Hillpointe. Madison holds a Bachelor’s Degree in Business Administration with a focus in Accounting from Cumberland University in Lebanon, TN. Network and Systems Administrator HAMMAD GHULAN-HUSSAIN Hammad serves as the network and systems administrator at Hillpointe. Now a certified IT professional with over eight years of experience in IT, he began his career in tech support and quickly advanced to serve the Dekalb County Schools District, providing IT support to more than 2,000 users and over 2,500 devices. With extensive knowledge of IT administration, Hammad strives to ensure that all Hillpointe property networks and systems are optimized to run smoothly. Project Coordinator JONATHAN HERNANDEZ Jonathan has been with Hillpointe Construction since its inception and worked for Value Added Concepts prior to Hillpointe Construction for over five years. He coordinates sub crew implementation and execution for various trades at different stages of the construction life cycle. Jonathan also coordinates Hillpointe warehouse operations for its Southern territory. Construction Accountant JUDY BRISLIN Judy is a construction accountant at Hillpointe. She primarily handles construction-related payables and vendor accounts. Before joining Hillpointe, Judy served as a construction accountant at Hillpointe Construction’s predecessor firm, Value Added Concepts. Office Admin TANYA DAVIS Tanya has held the role of Office Admin at our Athens office since October 2022. With a robust customer service foundation, she previously excelled as a medical assistant in the Alzheimer’s and dementia unit. Tanya’s educational journey spans arts, business management, nursing, and psychology. Tanya predominantly oversees worker housing utilities, subcontractors, and construction operations. Her commitment to continual growth aligns seamlessly with our company’s values. / Team All Development + Investment Construction Property Management Administration + Accounting GABE SHIBLY, CPA CFO JEFF GOLL, CFA Managing Director + Head of Capital Markets MIKE BOONE Managing Director of Multifamily Operations WILL BOHN, CFA Managing Director of Asset Management JAMIE TELCHIN Managing Director, Multifamily Development CHIP WOOTEN Senior Vice President, Debt Capital Markets & Asset Sales MARCUS WIEDOWER Vice President of External Affairs DUSTIN BROCK Vice President of Stabilizations MARK FOSTER Vice President of Development JESSICA RAY Vice President of Marketing JUSTIN SPANGLER Vice President of Construction MARCO MUNOZ Vice President of Construction MARK MACK Vice President of Development NICK EVERLY Vice President of Land Planning ROBERT MAHONEY Vice President of Projects STEVEN ROGERS, CFA Vice President, Capital Markets & Investor Relations WILL RUTHERFORD Vice President of Development SETH COLEMAN General Counsel ADAM MACLEOD Director of IT AMY JIMENEZ Head of Culture & Talent ANDREW PERU Director of Project Management DEREK LODGE Director of Risk Management KAREN STROUT Director of Quality Control OSCAR CRIBAS Director of Field Stabilizations ROBERT STILES Director of Facilities RYAN COONEY Director of Projects and Compliance SHELLEY EWING Construction Controller VICTORIA ROWARS, CPA Tax Director JOE MAHONEY Superintendent RODRIGO CORRO Project Superintendent JUAN ROMERO Project Superintendent AMANDA HERDER Director of Learning and Development DANIELLE VARACCHI Regional Manager LASHA ANTHONY Regional Manager LESLIE MOUBRAY Regional Manager SAM PHILLIPS Project Manager ANNA “KATIE” PERRY Global Sourcing Manager STEVE SCHELL Compliance and Safety Manager KEN MAHONEY Warehouse Manager KELLY BLANK Implementation and Training Manager CODY WRIGHT IT Manager ROBERT SCHNETTLER Risk Manager LINDSAY JOHNSON Senior Accounting Manager CLAUDIA ASPIAZU Accounts Payable Manager KATE CROSS Payroll and Benefits Manager VLADIMIR ARAPAJ Corporate Accounting Senior Manager LOWREY LOVE Purchasing Manager CLYDE TROCHE Operations Technology R&D Manager BARRY SMITH R&D Senior Analyst PEGGY SPANGLER Office Manager TERESA SUAREZ Office Manager MICHELLE JARAE Executive Office Assistant ALEX ADAMS Acquisitions Associate SAMUEL TERRY Senior Associate, Client Service & Operations HAMMAD GHULAN-HUSSAIN Network and Systems Administrator ASHLEY PERSAN Talent Experience Manager LINDSAY DE LAU Marketing Manager LUIS LOPEZ Helpdesk Supervisor TERRY VLAHOS IT Specialist LEILA VAZQUEZ Procurement Specialist MITCH LIVENSPARGER Supply Chain Management Specialist JUDY BRISLIN Construction Accountant MADISON HOWELL Senior Accountant PATRICK PATTERSON Logistics Manager JONATHAN HERNANDEZ Project Coordinator COOPER MCCAW Project Coordinator TANYA DAVIS Office Admin info@hillpointe.com 407.752.9004 Corporate Headquarters 631 W Morse Blvd., Suite 200 Winter Park, FL 32789 Operations Offices 8830 Macon Hwy., Building 300 Athens, GA 30606 1910 South Blvd., Suite 220 Charlotte, NC 28203 Copyright © 2025 Hillpointe All Rights Reserved. Legal Disclaimer"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Updates First Name Last Name Email Department - Select Department - Weddings Events Corporate Groups Dining General Admission Media / Press Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://www.thebalfourmiamibeach.com/things-to-do/south-pointe-park-pier",
      "text": "Balfour Miami Beach Hotel | Morgans Originals Skip to content Skip to content HOME HOTELS About Morgans Originals Offers BACK St Martins Lane, London The Hotel Rooms & Suites Restaurants & Bars Meetings & Events Offers Sanderson, London The Hotel Rooms & Suites Restaurants & Bars Meetings & Events Offers Balfour, Miami Beach The Hotel Rooms & Suites Restaurant & Bars Offers Coming Soon Luura, Paros LANGUAGE: BACK English Spanish French BOOK The Hotel Rooms & Suites Restaurant & Bars Offers Home Balfour Discover an art deco gem in Miami’s South Beach, where art, culture, and oceanside living intertwine. Soak up the Miami sun on the rooftop pool deck with chic loungers and umbrella-shaded seating A serene corner of the hotel’s plunge pool framed by lush palms, your private South Beach escape A vibrant summer escape captured as a guest step out of the pool in a yellow bathing suit and wide-brim hat Step into the bold and stylish pink-and-green coffee bar at The Balfour Hotel, where tropical flair meets Art Deco charm Enjoy a freshly brewed coffee paired with a buttery croissant in the vibrant ambiance of The Balfour Property, now part of Morgans Originals Chill poolside in comfort with elegant loungers and umbrellas, designed for all-day relaxation in the heart of South Beach MeET. RELAX. EXPLORE. Discover beautifully designed rooms, a secluded restaurant and laid-back café close to the beach in Miami’s scenic South of Fifth neighborhood. EXPLORE ROOMS AND SUITES OFFERS Balfour, Miami Beach Stay Local. Live Balfour Enjoy up to 15% off room rates, 20% off at Cleo restaurant, and thoughtful perks like complimentary room upgrade, early check-in and check-out, and 50% off overnight parking. BOOK NOW TELL ME MORE Balfour, Miami Beach Paws & Paradise Package Book direct and we’ll waive the $150 cleaning fee, inviting your pup to relax and revel in true South Beach style. From bespoke treats to elevated in-room comforts, we’ve curated a pet-friendly getaway designed for paws and pampering. BOOK NOW TELL ME MORE Balfour, Miami Beach join dis-loyalty Dis-loyalty is the travel and food membership that beats boring with 50% off just-opened hotels, 20% off first-time stays, and 10% off return stays. Plus, 10% off food and drink, and 365 free coffees. Valid for stays year-round 1 year commitment BOOK NOW TELL ME MORE DINE AT CLEO Eastern Mediterranean flavors meet the vibrant energy of South Beach. Enjoy soulful dishes and a thoughtfully curated wine list in a modern setting that celebrates connection, tradition, and the joy of sharing Reservations Now Available EXPLORE RESTAURANTS & BARS Refresh a T SOFI COFFEE Tucked into the heart of Miami’s iconic SoFi neighborhood, SoFi Coffee blends artisanal brews with a warm, coastal spirit. COMING SOON EXPLORE RESTAURANTS & BARS ABOUT BALFOUR Escape to Balfour, an Art Deco oasis in Miami’s upscale South of Fifth enclave. Just steps from the beach, with iconic 1940s architecture, modern Mediterranean restaurant Cleo, and 82 thoughtfully designed rooms circling a serene rooftop pool deck, it’s a stylish hideaway where design, service, and community converge for discerning travelers and locals alike. Join our community Sign up for exclusive offers, events and news. First Name (Required) Email Address (Required) I want to hear about (Required) I want to hear about Global St Martins Lane Sanderson Balfour Luura Continue Consent (Required) We’ll use your data in accordance with our Privacy Policy (Required) Email This field is for validation purposes and should be left unchanged. Δ find us Located in South Beach’s upscale enclave, South of Fifth, Balfour offers a moment of calm amid the buzz of Miami. +1 305-538-1055 350 Ocean Dr, Miami Beach, FL 33139, United States info.balfour@morgansoriginals.com GET DIRECTIONS Miami Beach 350 Ocean Dr Miami Beach FL 33139, United States Email Us FAQs Careers Develop with us Terms and Policies Accessibility California Collection Notice Sustainability Cookie Settings Instagram Facebook Language ENGLISH SPANISH FRENCH © Ennismore 2025 Close Booking Panel Make a Booking Check Availability"
    },
    {
      "url": "https://www.thebalfourmiamibeach.com/faq/south-pointe/where-to-park-in-south-pointe-park--pier",
      "text": "FAQs & Contact | Morgans Balfour Skip to content Skip to content HOME HOTELS About Morgans Originals Offers BACK St Martins Lane, London The Hotel Rooms & Suites Restaurants & Bars Meetings & Events Offers Sanderson, London The Hotel Rooms & Suites Restaurants & Bars Meetings & Events Offers Balfour, Miami Beach The Hotel Rooms & Suites Restaurant & Bars Offers Coming Soon Luura, Paros LANGUAGE: BACK English Spanish French BOOK The Hotel Rooms & Suites Restaurant & Bars Offers Home FAQs & CONTACT DETAILS FAQs & Contact At BALFOUR Cancellation policy Default bookings cancellation: Reservations must be guaranteed with a credit or debit card at time of booking. Payment is taken upon check-out unless otherwise stated. For Advance Purchase rates, payment is taken at time of booking and is non-refundable. For standard bookings, you can amend or cancel your booking free of charge up until 4pm (local time) one day before arrival. Email or call our reservations team with your details, and we will be able to assist you with your query. Cancelling after 4pm one day before arrival or failing to arrive for your stay means you will be charged the full amount. For corporate and group bookings, your reservation may be cancelled as per your agreement. Cancellation after your corporate or group agreement for your stay means you will be charged for the first night of your stay unless otherwise stated in your agreement. If you intend to pay for someone else’s stay and won’t be present at check-in to show your payment card, a payment needs to be made via bank transfer or secured payment link 48 hours before arrival. Please email us at balfour.reservations@morgansoriginals.com Rooms cannot be transferred without prior notice. Non-refundable cancellation (offer rate codes): Reservations must be guaranteed with a credit or debit card at time of booking. Payment is taken upon check-out unless otherwise stated. The amount due is not refundable even if the booking is cancelled or modified. If you intend to pay for someone else’s stay and won’t be present at check-in to show your payment card, a payment needs to be made via bank transfer or secured payment link 48 hours before arrival. Please email us at balfour.reservations@morgansoriginals.com. Rooms cannot be transferred without prior notice. Groups cancellation: Reservations must be guaranteed with a credit or debit card at time of booking. Payment is taken upon check-out unless otherwise stated. For corporate and group bookings, your reservation may be cancelled as per your agreement. Cancellation after your corporate or group agreement for your stay means you will be charged for the first night of your stay unless otherwise stated in your agreement. If you intend to pay for someone else’s stay and won’t be present at check-in to show your payment card, a payment needs to be made via bank transfer or secured payment link 48 hours before arrival. Please email us at balfour.reservations@morgansoriginals.com Rooms cannot be transferred without prior notice. Specific rate codes: Reservations must be guaranteed with a credit or debit card at time of booking. Payment is taken upon check-out unless otherwise stated. For standard bookings, you can amend or cancel your booking free of charge up until 6pm (local time) one day before arrival. Email or call our reservations team with your details, and we will be able to assist you with your query. Cancelling after 6pm one day before arrival or failing to arrive for your stay means you will be charged the full amount. If you intend to pay for someone else’s stay and won’t be present at check-in to show your payment card, a payment needs to be made via bank transfer or secured payment link 48 hours before arrival. Please email us at balfour.reservations@morgansoriginals.com. Rooms cannot be transferred without prior notice. What’s included in your stay fee Two signature welcome drinks per stay Complimentary in-room Lavazza Premium Coffee machine Daily F45 Fitness classes (see Front Desk for location and current schedule) Yoga classes every Saturday and Sunday at 8am Daily exclusive beach access (includes two chairs and an umbrella) Deluxe bath robes for use during your stay Local and toll-free phone calls Enhanced high-speed internet access in guest rooms and public areas Turndown service available upon request Fruit-infused water and refill stations available in the lobby Beach towels (available from Front Desk) Check in/Check Out Times Check in: 4pm; Check out: 11am Luggage Storage We will store luggage free of charge during your stay, and you’re welcome to leave your bags with us on the day you check-in or check-out. Car hire SIXT is the Preferred Car Rental of Balfour, South Beach Miami Balfour Hotel guests can enjoy up to 15% off car rentals. Unlock exclusive pricing for your next trip whenever you book through this page. Maximize your South Beach getaway by experiencing premium comfort and style with a rental from SIXT. Discounts already applied to the price displayed. Terms and conditions apply. Pet friendly Balfour allows guests to bring along a maximum of two dogs. Maximum 40 pounds weight, per pet. A $150.00 cleaning fee per stay will be charged for pets at check in. Kid friendly We can accommodate children up to 12 years old in the room with their parents on a rollaway bed (available on request but not guaranteed). For families with more than one child, connecting room options are available (subject to availability). Choose from 10 Classic Queen Doubles or a Bunk Bed Suite featuring a Double Bunk bed and King Size bed. Additionally, our Suites offer pull-out sofa beds for extra sleeping space, accommodating up to four people. Bicycles The hotel offers bicycles on a first-come, first-served basis. Guests can download the Zybra app (QR code available on the bike) to access them. Each stay includes a $20 bicycle rental credit; additional charges apply once the credit is exhausted. find us Located in South Beach’s upscale enclave, South of Fifth, Balfour offers a moment of calm amid the buzz of Miami. +1 305-538-1055 350 Ocean Dr, Miami Beach, FL 33139, United States info.balfour@morgansoriginals.com GET DIRECTIONS Miami Beach 350 Ocean Dr Miami Beach FL 33139, United States Email Us FAQs Careers Develop with us Terms and Policies Accessibility California Collection Notice Sustainability Cookie Settings Instagram Facebook Language ENGLISH SPANISH FRENCH © Ennismore 2025 Close Booking Panel Make a Booking Check Availability"
    }
  ]
}