{
  "fuentes": [
    {
      "url": "https://www.peacockgapgolfclub.com/contact-us",
      "email": "info@peacockgapgolfclub.com"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "email": "info@clubcaddie.com"
    },
    {
      "url": "https://nccga.org/app/teams/miami-university-of-ohio-club-golf",
      "email": "info@nccga.org"
    },
    {
      "url": "https://www.miamilakesgolf.com/contact-us/staff",
      "email": "charlied@miamilakesgolf.com"
    },
    {
      "url": "https://www.miamilakesgolf.com/contact-us/staff",
      "email": "johnr@miamilakesgolf.com"
    },
    {
      "url": "https://www.miamilakesgolf.com/contact-us/staff",
      "email": "mikes@miamilakesgolf.com"
    },
    {
      "url": "https://www.miamilakesgolf.com/contact-us/staff",
      "email": "tim.sticco@miamilakesgolf.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "vip@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "boats@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "dining@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "eservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "events@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "forms@tambourine.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reception@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "email": "reservations@palmtreeclubmiami.com"
    },
    {
      "url": "https://www.businessinsider.com/the-rise-of-jack-penrod-and-nikki-beach-2016-8",
      "email": "group-subscriptions@businessinsider.com"
    },
    {
      "url": "https://www.businessinsider.com/the-rise-of-jack-penrod-and-nikki-beach-2016-8",
      "email": "tavakian@businessinsider.com"
    }
  ],
  "mails": [
    "boats@palmtreeclubmiami.com",
    "charlied@miamilakesgolf.com",
    "dining@palmtreeclubmiami.com",
    "eservations@palmtreeclubmiami.com",
    "events@palmtreeclubmiami.com",
    "forms@tambourine.com",
    "group-subscriptions@businessinsider.com",
    "info@clubcaddie.com",
    "info@nccga.org",
    "info@peacockgapgolfclub.com",
    "johnr@miamilakesgolf.com",
    "mikes@miamilakesgolf.com",
    "reception@palmtreeclubmiami.com",
    "reservations@palmtreeclubmiami.com",
    "tavakian@businessinsider.com",
    "tim.sticco@miamilakesgolf.com",
    "vip@palmtreeclubmiami.com"
  ],
  "nombre_sitio": "miamibeachgolfclub.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.peacockgapgolfclub.com/contact-us",
      "text": "Contact Us | Reach Out to Peacock Gap Golf Club for Inquiries and Assistance Skip to content Golf image-group Book Tee Time Rates and Scorecard Driving Range Tournaments Lessons link-group Annual Golf Pass NCGA Program Course Rules Golf Carts Pro Golf Tips FAQs Golf Instructors Event Venue image-group Weddings Business Meetings Conferences Social Events Facility Rental link-group Golf Events Capacity Chart FAQs RangeCafe image-group Menu Happy Hour Catering Services Events button-group Delivery Take-Out Gallery image-group Golf RangeCafe Event Venue About Us image-group About Peacock Gap Employment Opportunities Gift Cards Directions Contact Us Book Tee Time Start typing and press enter to search Search for: phone Home > Contact Us Contact Us Peacock Gap 333 Biscayne Drive, San Rafael, CA 99901 Get Direction Phone/Fax 415-453-4940 (P) 415-485-0743 (F) * First Name * Last Name * Email Phone * Area of Interest Area of Interest Golf Club The Clubhouse RangeCafe Comments Send Message Interested in learning more about our beautiful event space? Request Info right-arrow Golf Book Tee Time Rates and Scorecard Driving Range FAQ Annual Golf Pass Event Venue Weddings Business Meetings Facility Rental Conferences Social Events Capacity Chart RangeCafe Menu Order Online Catering Services Happy Hour Experiences Gift Cards Event Calendar Golf Tournaments Golf Lessons About About Peacock Gap Employment Opportunities Directions Contact Us Peacock Gap 333 BISCAYNE DRIVE SAN RAFAEL, CA 94901 Phone (415) 453-4940 Email info@peacockgapgolfclub.com @2025 All Rights Reserved. Terms of Use | Privacy Policy | Sitemap Stay Connected:"
    },
    {
      "url": "https://clubcaddie.com/contact/",
      "text": "Contact Club Caddie: Get In Touch for Support & Demos Skip to content About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT WITH US REQUEST A DEMO About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition About Solutions Tee Time Management & Online Reservation Engine Starter Sheet Activity Booking Register & Point of Sale Accounting & Reports Restaurant & Bar Food & Beverage Ordering Customer Management Member Management Member Portal Banquet & Event Management Venue Management System Inventory Management Partners & Integrations Marketing Managed Marketing Website Design Email Marketing & SMS Mobile App Resources Changelog Blog Club Caddie Webinars Knowledge Base Careers Club Caddie University Support Chat Submit Ticket Hardware Gift Cards Remote Assist Tool Download Single Course Operator Download Accountant Edition CHAT REQUEST A DEMO contact We are available by chat, 24 hours a day, 7 days a week. Just click on the chat message icon in the lower corner of your screen or at the top of the menu and we can answer any question, get you login credentials, provide support, or even give you a full demo of our software. Full Name Email Phone Course or Organization Name Which Best Describes Your Role? -Select- Owner General Manager Director of Golf Head Golf Professional Other Golf Staff Food and Beverage Director Message SUBMIT testimonials What Our Clients Say see more testimonials Start Growing Revenue with Club Caddie Golf Course Solutions Today With tools to streamline every aspect of your golf facility’s operation and a 24/7 support team excited to help you out, improving your course, club or golf business management software has never been easier. Golf operations software is our forte. GET STARTED today Don’t have time right now? Send us a message and we’ll get back to you right away. send us a message Award Winning, All-In-One, Golf Facility Management Software. Menu About Features Contact Privacy Policy Terms & Conditions About Features Contact Privacy Policy Terms & Conditions Resources Services Mission Testimonials About Contact Services Mission Testimonials About Contact Support Knowledge Base Submit Tickets Chat With Us Club Caddie Holdings, Inc. info@clubcaddie.com 18720 Mack Ave, Suite 210, Grosse Pointe, MI 48236 Copyright © 2025 by Club Caddie Holdings, Inc, Powered by Club Caddie Privacy Policy Terms and Conditions Facebook Footer [main Template] Linkedin Scroll to Top We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. I agree"
    },
    {
      "url": "https://nccga.org/app/teams/miami-university-of-ohio-club-golf",
      "text": "Miami University of Ohio Club Golf Team 25/26 updates Schedule Regional Events National Qualifiers Pinehurst Open Close Rankings Nationals About Benefits Equipment Deals Team Resources Close Colleges Rules and Eligibility Past Tournaments Close Login 25/26 updates Schedule Regional Events National Qualifiers Pinehurst Open Close Rankings Nationals About Benefits Equipment Deals Team Resources Close Colleges Rules and Eligibility Past Tournaments Close Login Miami University of Ohio Club Golf Club President Kyle Gruley Ohio Valley Region Join the Club Golf Team If you are interested in competing in the NCCGA Tournaments, enter your email address and we will introduce you to the club president Graduation Year Spring 2025 Fall 2025 Spring 2026 Fall 2026 Spring 2027 Fall 2027 Spring 2028 Fall 2028 Spring 2029 Fall 2029 Spring 2030 Fall 2030 Request Team Deals All NCCGA teams get exclusive discounts and custom product offerings from the best brands in golf. View Team Deals Fall 2025 - Spring 2026 Tournaments Regional Tournament 1 Neumann Golf Course 7215 Bridgetown Rd Cincinnati, OH - 45248-2033 Sep 20, 2025  7:20 am Sep 21, 2025  8:00 am Join team Sign-Up Regional Tournament 2 Glenross Golf Club 231 Club House Dr Delaware, OH - 43015-8490 Oct 18, 2025 10:03 am Oct 19, 2025 10:03 am Join team Sign-Up Regional Tournament 3 Beckett Ridge Golf Club 5595 Beckett Ridge Blvd Ste 2 West Chester, OH - 45069-1800 Oct 25, 2025  9:00 am Oct 26, 2025  9:00 am Join team Sign-Up Regional Tournament 4 Glenview Golf Course 10965 Springfield Pike Cincinnati, OH - 45246-4305 Mar 28, 2026  8:00 am Mar 29, 2026  8:00 am Join team Sign-Up Golf Courses near Miami University-Oxford Home Course Course: Indian Ridge Golf Club Pro: Jim Brazen Website: www.golfindianridge.com Team Discounts National Partners About Privacy Policy Terms of Use Tournaments College Rankings National Championship College Tournaments Resources Get A Golf Handicap Golf Equipment Deals Golf Stories Golf Jobs Board info@nccga.org info@nccga.org"
    },
    {
      "url": "https://www.miamilakesgolf.com/contact-us/staff",
      "text": "Staff 7601 Miami Lakes Dr, Miami Lakes, FL 33014 | Reservations: 305.820.8088 | Home Golf Course Instruction First Tee Miami - Junior Golf Events Tournaments Upcoming Events Facilities Facilities Info Dining Accommodations Banquets & Catering Fitness Membership Stay & Play Contact Contact Us Staff Book a Tee Time Staff Our staff members have spent many years devoted to pursuing excellence in their field and have attained a certain level of expertise to qualify them as instructors and trainers. Through extensive training, certification and dedication, our staff has attained mastery in their fields and now enjoy sharing their skill and passing it on to our members. Here are a few of Miami Lakes Golf Club's staff members: Charles DeLucca III, PGA John Reed Tim Sticco Dave Gergely Mike Stern Joey Vega Jen Lemus Max Wagenberg Felicia Leftinger, LPGA Charles DeLucca III, PGA General Manager, PGA | This email address is being protected from spambots. You need JavaScript enabled to view it. John Reed Director of Golf | This email address is being protected from spambots. You need JavaScript enabled to view it. Tim Sticco Superintendent | This email address is being protected from spambots. You need JavaScript enabled to view it. Originally from Hollywood, Florida, Tim has been with Miami Lakes Golf Club since 2001.  Prior to joining Shula's, Tim worked at the Doral Resort & Spa, Weston Hills Country Club, and Whistling Straits in Kohler, Wisconsin.  He has worked closely with the PGA and LPGA tours for the Doral Ryder Open, Honda Classic, and LPGA Tournament of Champions.  He was instrumental in the renovation of the Great White course at Doral, and construction of the Tour and Player's course at Weston Hills Country Club. Dave Gergely Golf Sales Manager | This email address is being protected from spambots. You need JavaScript enabled to view it. Born in Allentown, PA, where he played Baseball, Basketball and Golf, for Louis E. Dieruff High School. Earned A Bachelor of Science Degree in Marketing and Education at Rider University in Lawrenceville, N.J. Began his career with Miami Lakes Golf Club and The Graham Companies as The Program Director for Miami Lakes Athletic Club in 1982, has also served as The Director of Sports Entertainment at ML Steaks & Sport Restaurant.  During his 30 plus years with Miami Lakes Golf Club, Dave has always enjoyed  golf and since 2012, in his current position of Golf Sales Manager,  He specializes in Corporate Groups, Charity, Groups and anyone interested in playing golf at Miami Lakes Golf Club. Mike Stern Head Golf Professional | This email address is being protected from spambots. You need JavaScript enabled to view it. Joey Vega Assistant Pro & Pro Shop Manager | This email address is being protected from spambots. You need JavaScript enabled to view it. Jen Lemus Assistant Pro | This email address is being protected from spambots. You need JavaScript enabled to view it. Max Wagenberg Assistant Pro Felicia Leftinger, LPGA LPGA Professional | This email address is being protected from spambots. You need JavaScript enabled to view it. © 2022 Miami Lakes Golf Club | 7601 Miami Lakes Dr, Miami Lakes, FL 33014 | Reservations: 305.820.8088 Designed and Hosted by 121 Marketing Contact Us | Site Map Close Home Tee Times Food Members Contact Home Golf Course Instruction First Tee Miami - Junior Golf Events Tournaments Upcoming Events Facilities Facilities Info Dining Accommodations Banquets & Catering Fitness Membership Stay & Play Contact Contact Us Staff Book a Tee Time 7601 Miami Lakes Dr, Miami Lakes, FL 33014 | Reservations: 305.820.8088 |"
    },
    {
      "url": "https://www.palmtreeclubmiami.com/contact-us",
      "text": "Contact Us | Palm Tree Club Miami Skip to Content Palm Tree Club Miami (305) 865-7100 Rooms & Suites Offers Live Events Restaurant Happenings Our Neighborhood Gallery About Us Book Now Connect With Palm Tree Club Let’s Hear From You! Palm Tree Club Miami 1819 79th Street Causeway North Bay Village, FL 33141 Hotel Phone: 305-865-7100 Front Desk Inquiries: reception@palmtreeclubmiami.com Reservations: r eservations@palmtreeclubmiami.com Restaurant Phone: 786-204-1366 Email: dining@palmtreeclubmiami.com Marina Email: boats@palmtreeclubmiami.com Radio Channel: #71 Live Events Email: VIP@palmtreeclubmiami.com Thank you for reaching out! We will be in touch shortly. First Name * Last Name * Email Address * Comments Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit FREQUENTLY ASKED QUESTIONS Live Music & Events What time does the live music start? Doors open at 3 PM. Is there a cover charge for guests to enjoy the live music? Only for ticketed events. Get your tickets on Posh: https://posh.vip/g/ptc-miami . Do I need a reservation to see the live music? Not unless it's a ticketed event. How long does the live music performance last? Sunset parties typically go until 12 AM. Is the music indoors or outdoors? Both. Do you have a schedule or calendar for upcoming live music performances? Yes! Be sure to check our socials and website for more details: www.palmtreeclubmiami.com . Do you offer special deals or promotions? For offers and experiences, check our OpenTable: Palm Tree Club Miami Restaurant - North Bay Village, FL | OpenTable . Are there specific days or nights dedicated to live music? Typically Saturdays and Sundays, but please check our website for more details! What time will the DJs perform at the events we've published? Stay tuned to our social media for updates on set times. What’s the dress code for events? Come as you are—sneakers, flip-flops, heels, sequins, or bikini tops. Feel free to wear jeans, shorts, or even your suit (but we hope you lose the tie). Hotel General Information Is there a minimum age to check in? Yes, guests must be 21 years or older to check-in and will be required to present a valid photo ID, in addition to their method of payment. What time is check-in and check-out? Check-in time: 4pm Check-out time: 11am Can I check in early or check out late? Early check-in or late check-out may be available upon request, subject to availability. Please contact the front desk for more information. How late can I check-in? Our front desk is available 24 hours. What is required to check-in? Guests must be 21 years or older to check in and will be required to present a valid photo ID in addition to their method of payment. Is parking available at the hotel? Yes, complimentary on-site parking is available for all hotel guests. Can I store my luggage before or after I check out? Yes, complimentary luggage storage is available at our Front Desk. Is the hotel accessible for guests with disabilities? Yes, we have accessible rooms, ramps, and elevators for your convenience. Please inform us of any specific needs prior to your arrival. Are there any extra charges or resort fees? $20 plus taxes Resort Fee is applied to all reservations. Is the hotel pet-friendly? Yes. A non-refundable $100 pet fee applies. Room and Facilities Do the rooms include complimentary Wi-Fi? Yes, free Wi-Fi is available in all rooms and public areas of the hotel. When will my room be cleaned, and how do I request additional items? Your room will receive full cleaning service every third day of your stay. For any requests, such as extra towels or amenity refills, please contact the Front Desk at any time. Are there any amenities in the rooms? Our rooms come with air conditioning, a flat-screen TV, minibar, safe, Bluetooth speaker, hair dryer, and ironing board. Check the room description for specific details. Do you have accessible rooms? We offer three accessible room types - our Accessible Classic King and Accessible Classic Double, Accessible Deluxe King. For more specifics, check out our Accessibility page. Is there a smoking policy in the hotel? Our hotel is smoke-free, and smoking is only allowed in designated areas. Please ensure compliance with our smoking policy. A $250 cleaning fee will be applied if any odor is found in the room. Do you offer breakfast? Brunch begins at 11am. Do you have a restaurant or bar on-site? Yes, we have Palm Tree Club Miami Restaurant. Open daily, our restaurant serves up coastal-American food in a casual dining environment, with all your favorites & Miami’s best sunset views! Do you offer laundry and dry cleaning services? Yes, laundry and dry cleaning services are available. Booking and Payments Does the hotel accept traveler’s checks as payment? No, we do not accept traveler’s checks as payment. Does the hotel require any deposit at check in? Yes, at check-in, we require a $150 incidental deposit per stay, in addition to the room and tax charges. This is just a hold on the credit card. If the guest doesn’t incur any incidentals or make any purchases during their stay, the hold will be released within 5 to 7 business days after check-out. Does the hotel require any deposit prior to checking in? Pre-stay deposits are dependent upon the rate plan reserved. What type of credit cards are accepted at the hotel? MasterCard, Visa, American Express, and Discover are all accepted. What is your cancellation policy? Cancellation policy depends on the reservation rate booked. We offer rates with a refundable reservation up to 72 hours before arrival, as well as discounted non-refundable rates. Can I book directly on your website? Yes, we recommend booking directly through our website for the best rates and special offers. Can I modify or cancel my reservation after booking? Cancellation/Modification policy depends on the reservation rate booked. We offer rates that may be cancelled or modified up to 72 hours before arrival, as well as discounted non-refundable rates that do not allow cancellations or modifications. Special Requests and Policies Can I send a package to the hotel? Yes, we’re happy to accept packages prior to your arrival. Please be sure that the name of the registered guest is included in the delivery information and be sure to use our Security/Receiving address: 1819 79th Street Causeway North Bay Village, FL 33141 Can I request special accommodations or amenities (e.g., flowers, champagne, etc.)? Yes, we can arrange special requests for a fee. Please contact us ahead of time to ensure availability. Do you offer shuttle service to the airport? We do not offer this service directly, however, our concierge services may assist in making a shuttle reservation with a 3rd party company. Additional Services Can I book tours or activities through the hotel? Yes, we’d be happy to assist with booking. Please stop by the front desk to inquire about available options. Our concierge team can also help with making reservations. Do you have a gym or fitness center? Yes, we have a brand-new fitness center, and it’s open 24 hours a day for your convenience! Reservations & Ticketing How can I contact the restaurant if I have further questions? You can reach us at 786-204-1366 or email us at dining@palmtreeclubmiami.com . Will there be commissions for promoters who refer clients? For more information, email VIP@palmtreeclubmiami.com . Contact Information How can I contact the hotel if I have further questions? You can reach us at 305-865-7100 or email us at reception@palmtreeclubmiami.com . Our team is available 24/7 to assist you. Join the Crew Thank you for your interest. Hidden Field First Name Last Name Email Address Privacy Policy agreement I have read and agree to the Privacy Policy . Yes, I would like to receive emails with exclusive specials and offers. Submit Palm Tree Club Miami Palm Tree Club Miami 1819 79th Street Causeway                        North Bay Village, FL                         33141 HOTEL: (305) 865-7100 reception@palmtreeclubmiami.com reservations@palmtreeclubmiami.com RESTAURANT: (786) 796-0846 dining@palmtreeclubmiami.com MARINA: boats@palmtreeclubmiami.com Radio Channel: #71 LIVE EVENTS & PRIVATE TABLES: VIP@palmtreeclubmiami.com events@palmtreeclubmiami.com Our hotel properties include Palm Tree Hotel, Palm Tree Crew Hotel, and Palm Tree Club, all operating under the Palm Tree Crew umbrella. facebook instagram pinterest Contact & FAQs Palm Tree Club Miami  2025. All Rights Reserved Accessibility Privacy Policy Sitemap Consent Preferences Hotel Web Design by close"
    },
    {
      "url": "https://www.businessinsider.com/the-rise-of-jack-penrod-and-nikki-beach-2016-8",
      "text": "The Rise of Jack Penrod and Nikki Beach - Business Insider Business Insider Subscribe Newsletters Search Business Strategy Economy Finance Retail Advertising Careers Media Real Estate Small Business The Better Work Project Personal Finance Tech Science AI Enterprise Transportation Startups Innovation Markets Stocks Indices Commodities Crypto Currencies ETFs Lifestyle Entertainment Culture Travel Food Health Parenting Politics Military & Defense Law Education Reviews Tech Streaming Tickets Home Kitchen Style Beauty Gifts Deals Video Big Business Food Wars So Expensive Still Standing Boot Camp Subscribe My account Log in Newsletters US edition Deutschland & Österreich España Japan Netherlands Polska Get the app Finance How an entrepreneur went from flipping burgers at McDonald's to opening some of the most famous beach clubs in the world By Talia Avakian Jack Penrod, founder and owner of Nikki Beach, with his family. Artman Agency 2016-08-05T14:13:00Z Share Facebook Email X LinkedIn Reddit Bluesky WhatsApp Copy link lighning bolt icon An icon in the shape of a lightning bolt. Impact Link Save Saved Read in app Add us on This story is available exclusively to Business Insider\n                subscribers. Become an Insider and start reading now. Have an account? Log in . Today, Nikki Beach is famous for its luxurious ambience, lavish beach parties, and celebrity clientele. But before the beach club's founder Jack Penrod became a successful entrepreneur, he was flipping burgers as a McDonald's line cook. Using clever marketing tactics, Penrod worked his way up the ranks of McDonald's before eventually leaving to start his own luxury brand. He became famous in the '80s for opening up Penrod's Beach Club, reviving Miami Beach and turning it into a trendy spot for young travelers and spring breakers. In 1998, Penrod introduced the first Nikki Beach club, combining music and dining with fashion, film, and art. Today, Nikki Beach has expanded to include its beach clubs, hotels, a charity, and even an entire lifestyle division. We spoke to Penrod to learn about his fascinating rise to success, from the difficulties he faced to his triumphs. Nikki Beach is famous for its themed parties, international cuisine, all-white decor, and the top DJs it draws in. The beach clubs were created to honor and celebrate the life of Penrod's daughter Nicole, who passed away in a car crash at the age of 18. The company fulfills its philosophy of \"Celebrate Life!\" through its many events. Facebook/Nikki Beach Saint Tropez Penrod began working at the age of 9, doing everything from carrying newspapers to cleaning bakery pans to get by. In 1961, he was working at the Greenbrier Hotel in West Virginia when he heard about a new chain — McDonald's — opening up. He thought the idea had a lot of promise, so he left and went to Tallahassee, Florida, to start working as a line cook for 85 cents an hour. Nikki Beach Thanks to his enthusiasm, he was promoted to manager within a few days. Penrod, who was 21 at the time, asked his boss if he could get a share of the gross profit if he was able to make their location the most successful McDonald's of its time. His boss said yes, so he started using some interesting marketing tactics: creating free lunches for schools, delivering burgers to Miss Florida parties, and starting a birthday club at McDonald's. Justin Sullivan/Getty Images Through these tactics, Penrod took his restaurant's yearly profit from $90,000 a year to $440,000 a year. Eventually, Penrod went on to acquire 16 different South Florida McDonald's within seven years. He left the company in 1975, after being offered the chance to buy out at a value of roughly $10 million. Artman Agency In the early '80s, he shifted his efforts to entertainment, opening Penrod's Beach Club in Fort Lauderdale. Penrod's became famous for the thousands of spring breakers it drew in. Penrod would send buses to over 120 colleges, bringing in an average of 2,000 people a day during spring break. In 1984, the mayor of Miami Beach contacted Penrod to see if he could help revive Miami Beach, which in the years prior had earned a reputation for being packed with retirees. Nikki Beach Pernod was given a 40-year lease on beachfront property, and he opened a second Penrod's at One Ocean Drive in Miami Beach. \"I knew I had to do something to catch the world's attention,\" Penrod said. He started hosting events like Beach Boys concerts, and he even brought in an Olympic skier to ride down a giant mound of ice piled on the beach. Nikki Beach In 1977, Penrod replaced the club's pool with a garden, calling it Café Nikki in honor of his daughter. The space became very popular, drawing in celebrities like Bruce Willis, Michael Douglas, and Madonna. Penrod continued to develop the beachfront property until he eventually opened the first Nikki Beach location there in 1998. Nikki Beach Penrod had studied beach clubs in Europe and knew he wanted to create a luxury brand. So instead of using rusty umbrellas and lounge chairs, he spent around $1 million on each property's furniture, bringing in vintage wooden farm tables that were heavy enough for people to dance on, and director's chairs so that their guests could sit comfortably for hours. Nikki Beach They also made the company's logo a tipi, since Penrod, an avid pilot and hiker, always felt close with nature. It was also a symbol that could easily be identified around the world. \"Our goal was to create a high-end global brand, so that when people see our tipi, they can know to expect five-star service and our casual atmosphere,\" Penrod said. Artman Agency For Penrod, the goal wasn't to open a nightclub, but to have a space where people could dine, relax, and enjoy partying. His mentality was that as people grow older, they don't want to be out partying until 3 or 4 in the morning. With the concept of a beach club, they could come in, enjoy the party scene, and still get to bed at a practical time. Facebook/Nikki Beach Marbella \"We would dream up reasons to throw parties,\" Penrod said. Across their properties, Nikki Beach's themed parties include everything from circus celebrations to jungle parties. The beach clubs are also notorious for their white party, an idea they conceived when Naomi Campbell hosted a white clothing-themed birthday party there years ago. Facebook/Nikki Beach Mallorca Eventually, they became so busy at their Miami Beach location that customers suggested they open another, which they did in 2002 in Saint-Tropez, France. They chose St. Barts and Marbella for future Nikki Beach locations. Nikki Beach While each location has its own unique elements, there are some features that remain constant throughout. These include the furniture and the staff uniform: white flowing palazzo pants and hand-carved leather utility belts from Nicaragua, which Penrod told us they wear because it's the ideal size for holding bottle openers. Nikki Beach About 50% of the menu stays the same in each location, while the rest is adapted to the local taste of the region. Menu items include a raw bar, sushi, fresh salads, hearty sandwiches, fresh seafood plates, and pastas. Nikki Beach also hosts its famous Sunday Brunch, when its culinary team creates rotisserie stations, a rolling sushi station, and an extensive dessert display. Facebook/Nikki Beach Marbella They also host celebrities, producers, and VIPs both at its beach clubs and at pop-up locations they create for major events like the Cannes Film Festival and the Toronto International Film Festival. Some of Nikki Beach's celebrity clients include Woody Allen, Al Pacino, Jay Z, Kanye West, Justin Timberlake, Scarlet Johansson, and Ryan Gosling, among many others. Nikki Beach For Penrod, part of the success has come from the work habits he has developed over the years, as he worked seven years from open to close while at McDonald's, and he never took a day off. Facebook/Nikki Beach Miami He also told us it's also about ensuring you hire great people and take good care of them. When they opened a Nikki Beach location in Koh Samui, Thailand, in 2009, there wasn't much of a hospitality industry on the island. They hired 100 people, none of whom spoke English or had even seen a knife or fork, and worked with them so they could learn the necessary skills. They still have the same employees working for them today. Nikki Beach In 2007, Penrod decided to expand into the hotel industry with Nikki Beach Hotels & Resorts. \"I was thinking about what I could do for my family because with the clubs, you really have to be on your toes, but I used to be in the hotel business so I thought it would be easier to sustain,\" Penrod told us. Nikki Beach Today, Nikki Beach has hotels in Greece, Thailand, and Turkey, and will be opening a property in Dubai later this year. According to Penrod, the goal with their hotel division is to ensure they're a good neighbor to those they surround, which is why they're working on features like noise-blocking walls. Facebook/Nikki Beach Resort & Spa Porto Heli Click here to learn more about Nikki Beach Hotels & Resorts » The company also has a lifestyle division (with branding and clothing), a music label, and a lifestyle publication, \"Nikki Style Magazine.\" They also operate a nonprofit charity called Nikki Cares, which partners with charities to host fundraising events for various causes. Facebook/Nikki Beach Ibiza \"When I was 12, we were a family of seven children on welfare and I told my mother not to worry because one day we would be rich,\" Penrod said. Today, his lifestyle brand is recognized around the world. Facebook/Nikki Beach Marbella Travel Arts & Culture McDonald's More Read next Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know Business Insider tells the innovative stories you want to know HOME Subscribe This story is available exclusively to Business Insider\n      subscribers. Become an Insider and start reading now. Have an account? Log in . Legal & Privacy Terms of Service Terms of Sale Privacy Policy Accessibility Code of Ethics Policy Reprints & Permissions Disclaimer Advertising Policies Conflict of Interest Policy Commerce Policy Coupons Privacy Policy Coupons Terms Company About Us Careers Advertise With Us Contact Us News Tips Company News Awards Masthead Other Sitemap Stock quotes by finanzen.net International Editions AT DE ES JP NL PL Copyright © 2025 Insider Inc. All rights reserved.\n    Registration on or use of this site constitutes acceptance of our Terms of Service and Privacy Policy . Jump to Main content Search Account"
    }
  ]
}