{
  "fuentes": [
    {
      "url": "https://miccosukee.com/news/miccosukee-golf-country-club-opens-new-pro-shop-range/",
      "email": "ariellat@miccosukeetribe.com"
    },
    {
      "url": "https://miccosukeegolfandcountryclub.godaddysites.com/",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://www.miccosukeegolf.com/contact-us/",
      "email": "ericw@miccosukeegolf.com"
    }
  ],
  "mails": [
    "ariellat@miccosukeetribe.com",
    "ericw@miccosukeegolf.com",
    "team@latofonts.com"
  ],
  "nombre_sitio": "miccosukeegolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://miccosukee.com/news/miccosukee-golf-country-club-opens-new-pro-shop-range/",
      "text": "Press Release - Miccosukee Golf & Country Club Opens New Pro Shop & Range, Presented by the Miami Marlins - Miccosukee Casino & Resort News Directions Email Offers | RESERVATIONS: 305.925.2555 M Sphere Mobile App Player Portal M Sphere Rewards M Sphere Rewards Kiosks Casino Casino Promotions Slots High Limit Slots & VIP Lounge Exclusive Smoking Room Bingo Poker Casino Hosts Little Trail Casino Resort Rooms & Suites Golf & Country Club Experiences Entertainment Food & Drink Mobile Ordering La Brisa Tempt Lounge B1 Grill Taquería Los Güeros Max’s Grab & Go Meetings & Events Meetings Weddings Banquets Corporate Retreats Book Your Everglades Getaway Check In Check Out Check Rates Skip to content Miccosukee Golf & Country Club Opens New Pro Shop & Range, Presented by the Miami Marlins Miami, FL – April 9, 2025 – The Miccosukee Golf & Country Club is excited to announce the grand opening of its new pro shop and state-of-the-art driving range, presented by the Miami Marlins, on Friday, May 9, 2025, at 12p. This $6.2 million upgrade marks a major milestone for the club and reinforces its commitment to providing a premier golf experience in South Florida. The Miami Marlins’ support as the presenting sponsor of this grand opening underscores a shared dedication to community engagement, wellness, and the advancement of recreational experiences across the region. “This project has been a labor of love, and we are thrilled to open our doors to the community and showcase our new facilities,” said Eric Weiss, General Manager of the Miccosukee Golf & Country Club. “Whether you’re an avid golfer or someone new to the game, our upgraded amenities are designed to provide a welcoming and elevated experience for everyone.” Highlights Include: 8,000-Square-Foot Expanded Pro Shop Trackman-Equipped Driving Range Brand-New Gym & Sauna for Members Enhanced Locker Rooms & Showers New Restaurant Featuring Outdoor Seating Hours of Operation: Pro Shop: 7a-7p Driving Range: 7a-10p Grill: 7:30a-10p Pricing: Weekend Rates: $100 Weekday Rates: $77 Memberships: Starting at $3,200 per year The celebration begins May 9, 2025, at 12p, for a special ribbon-cutting ceremony, followed by facility tours and exclusive opportunities to experience all that the Miccosukee Golf & Country Club has to offer. For more information or to RSVP for the event, please visit miccosukeegolf.com or email ariellat@miccosukeetribe.com . ### About Miccosukee Golf & Country Club: Miccosukee Golf & Country Club is a premier private golf course and recreational facility located at 6401 Kendale Lakes Drive in Miami, Florida. With a rich history and a commitment to excellence, the club offers world-class amenities for golfers of all skill levels. The club features a 27-hole golf course, extensive fitness and recreational options, and dining experiences for members and guests to enjoy year-round. For more information, visit miccosukeegolf.com or call (305) 382-3930. About Miami Marlins: The Miami Marlins of Major League Baseball combine the tradition of America’s pastime with the excitement of South Florida, with two World Series championships (1997 and 2003) and four Postseason appearances (1997, 2003, 2020, and 2023). As part of the vibrant community, the Marlins are dedicated to enhancing the game experience for fans with a modern ballpark, state-of-the-art facilities, and innovative fan engagement. The Marlins organization lives through its values, dedicated to sustained success on and off the field as a world-class entertainment venture. With a forward-thinking approach and a determined commitment to consistently compete at the highest level, the Miami Marlins are bringing a refreshed pursuit to baseball while remaining deeply rooted in the cultural fabric of the South Florida community. 500 SW 177th Ave Miami, FL 33194 About Us Contact Directions Careers Property Map Miccosukee Tribe Miccosukee Tribe Administration Privacy Policy Cookie Policy Terms & Conditions Join Our List Name Email ©2025 Miccosukee Casino & Resort Go to Top You are here: Home News Press Release – Miccosukee Golf… Casino & Resort About Us Contact Directions Careers Property Map Vendors W2G/1099 Request Form Additional Links Miccosukee Tribe Miccosukee Tribe Administration Miccosukee Tobacco Shop Miccosukee Service Plaza Privacy Policy Cookie Policy Terms & Conditions JOIN OUR LIST Be the first to know about upcoming events, special resort and dining promotions, and exclusive giveaways at Miccosukee Casino & Resort! Name Email ©2024 Miccosukee Casino & Resort Linkedin M Sphere Mobile App Player Portal M Sphere Rewards M Sphere Rewards Kiosks Casino Casino Promotions Slots High Limit Slots & VIP Lounge Exclusive Smoking Room Bingo Poker Casino Hosts Little Trail Casino Resort Rooms & Suites Golf & Country Club Experiences Entertainment Food & Drink Mobile Ordering La Brisa Tempt Lounge B1 Grill Taquería Los Güeros Max’s Grab & Go Meetings & Events Meetings Weddings Banquets Corporate Retreats News Directions Email Offers"
    },
    {
      "url": "https://miccosukeegolfandcountryclub.godaddysites.com/",
      "text": "Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club More Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club Miccosukee Golf & Country Club is a premier golfing destination nestled in the heart of the beautiful and scenic Miami, Florida. Situated amidst lush green landscapes and surrounded by pristine natural beauty, this renowned club offers a world-class golfing experience for players of all skill levels. With its meticulously designed golf courses, state-of-the-art facilities, and exceptional amenities, Miccosukee Golf & Country Club is a haven for golf enthusiasts seeking a memorable and enjoyable golfing experience. The club boasts two championship golf courses that are meticulously crafted to provide a challenging yet rewarding experience for players. Both courses are designed by renowned architects and offer a unique blend of natural elements, strategic layouts, and well-manicured fairways and greens. Each hole presents its own set of challenges, ensuring an exciting and varied gameplay that keeps golfers engaged and eager to tackle the next shot. The courses at Miccosukee Golf & Country Club provide a harmonious fusion of aesthetics and functionality. The stunning scenery, including sparkling lakes, pristine waterways, and lush vegetation, creates a picturesque backdrop that adds to the overall golfing experience. The strategic placement of hazards and bunkers demands precision and strategy from players, while the well-designed fairways and greens ensure a fair and enjoyable game for golfers of all levels. In addition to its exceptional golf courses, Miccosukee Golf & Country Club offers an array of amenities and services that enhance the overall experience for members and guests. The club features a fully equipped pro shop where players can find top-quality golf equipment, apparel, and accessories. The knowledgeable and friendly staff are on hand to provide expert advice and assist with any golfing needs. For those looking to improve their game, Miccosukee Golf & Country Club provides professional golf instruction. Whether you're a beginner looking to learn the fundamentals or an experienced player seeking to refine your skills, the club's experienced golf instructors offer personalized coaching and guidance to help you reach your full potential on the course. Private lessons, group clinics, and junior programs are available to cater to golfers of all ages and abilities. After a round of golf or during a break, players can relax and recharge at the club's clubhouse and dining facilities. The clubhouse offers a welcoming and elegant atmosphere, perfect for socializing and unwinding after a day on the course. Guests can enjoy a delicious meal or refreshing beverage at the club's restaurant and bar, which provides a diverse menu of culinary delights and a selection of beverages to satisfy every taste. Miccosukee Golf & Country Club also caters to the needs of corporate events, tournaments, and special occasions. The club's dedicated event planning team works closely with organizers to create memorable and successful events, whether it's a corporate golf outing, charity tournament, or private celebration. The club's picturesque setting, exceptional amenities, and professional staff ensure that every event is executed flawlessly, leaving a lasting impression on guests. Beyond its golfing offerings, Miccosukee Golf & Country Club embraces a sense of community and camaraderie among its members. The club organizes a variety of social events, member tournaments, and leagues that foster a strong sense of belonging and friendship among golf enthusiasts. These events provide opportunities to connect with fellow golfers, share experiences, and create lasting memories both on and off the course. In conclusion, Miccosukee Golf & Country Club is a golfer's paradise, offering a world-class golfing experience amidst stunning natural surroundings. With its meticulously designed courses, exceptional facilities, professional instruction, and welcoming atmosphere, the club provides an unforgettable golfing journey for players of all levels. Whether you're a seasoned golfer or new to the game, Miccosukee Golf & Country Club invites you to indulge in the joy of golf and experience the beauty and excitement of this premier golfing destination in Miami. Here is a local Sliding Glass Door Repairs that supports the community. The Glassperts Sliding Glass Door & Window Repair in 13991 SW 144th Ave #302, Miami, FL 33186, United States Be sure to check out this local attraction too!! Copyright © 2023 Miccosukee Golf & Country Club - All Rights Reserved. This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.miccosukeegolf.com/contact-us/",
      "text": "Contact Us - Miccosukee Golf & Country Club (305) 382-3930 [email protected] Instagram Instagram Home Golf Club The Course Rates Membership Rates Lessons Meet the Team Events Events Calendar Event Request Hotel Reservations Contact Us Eclub Hotel & Casino Select Page Contact Us Miccosukee Golf & Country Club  Call Us (305) 382-3930  Find Us 6401 Kendale Lakes Dr, Miami, FL View map  Email Us [email protected] Play golf in Miami, FL Miccosukee Golf & Country Club (305) 382-3930 6401 Kendale Lakes Drive Miami, FL 33183 [email protected] © Miccosukee Golf & Country Club Website by Lightspeed"
    }
  ]
}