{
  "fuentes": [
    {
      "url": "https://www.visitgainesville.com/dine/restaurant/mildreds-big-city-food/",
      "email": "info@visitgainesville.com"
    },
    {
      "url": "https://guidetogreatergainesville.com/purpose-20-mildreds-big-city-food/",
      "email": "scott@costellocm.com"
    },
    {
      "url": "https://www.staygainesville.com/mildred-s-big-city-food-new-deal-cafe",
      "email": "info@staygainesville.com"
    }
  ],
  "mails": [
    "info@staygainesville.com",
    "info@visitgainesville.com",
    "scott@costellocm.com"
  ],
  "nombre_sitio": "mildredsbigcityfood.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.visitgainesville.com/dine/restaurant/mildreds-big-city-food/",
      "text": "Mildred's Big City Food - Visit Gainesville Cookie Settings Close About cookies Essential Analytics Targeting Social media About cookies This control panel describes what kinds of cookies are present on this website and allows you to enable or disable different types of cookies. Cookies are small pieces of text saved by websites to your computer. Cookies are how your computer remembers things you’ve already done on the internet and are an important part of making modern websites work properly. Because cookies may contain information about your browsing habits, some people prefer to turn them off entirely. However, turning off cookies can prevent websites from working the way you expect. Essential cookies These cookies are critical to the functioning of this website and cannot be disabled through this control panel. They don’t contain any information about your identity. They can be disabled through your browser, but doing so could cause some parts of this website to stop working. WordPress wordpress_, wp- Always enabled Analytics cookies These cookies collect information on visitors to our website to help us understand how well our website is working and how to improve it. No vendors are present in this group. Targeting cookies These cookies collect information on your browsing habits to help our advertising partners show you more relevant ads. No vendors are present in this group. Social media cookies These cookies help social media sites understand your likes and dislikes so they can show you more relevant content. They also make it easier to share contents from other websites such as ours to your social media profiles. No vendors are present in this group. Communities University of Florida Blog Meetings & Industry Sports Things To Do Outdoor Recreation Eat & Drink Stay Events MENU SEARCH Things To Do LIVE MUSIC & PERFORMING ARTS FAMILY-FRIENDLY ATTRACTIONS MUSEUMS, GALLERIES & ART WALKS TOURS SHOPPING HISTORY & HERITAGE ITINERARIES ALL ARE WELCOME Outdoor Recreation FRESHWATER SPRINGS PARKS & PLACES HIKING PADDLING TRAILS PICKLEBALL BIRDING HOT SPOTS BIKING GOLF FISHING Eat & Drink RESTAURANTS BREWERIES & WINERIES HOMEGROWN IN ALACHUA COUNTY Stay BED & BREAKFAST Hotels & Lodging RV PARKS & CAMPING VACATION RENTALS Events WHAT’S GOOD.® GUIDE All Events Communities University of Florida Blog Meetings & Industry Sports New American Delivery Takeout Mildred’s Big City Food 3445 W University Ave Gainesville, \n                                    \n                                                                            FL                                    \n                                                                            32607 352-371-1711 Get Directions View Website Overview Winner of multiple Golden Spoon Awards! Mildred’s supports sustainability and farm-to-table by buying as locally as possible. Our beef and pork come from the University of Florida and most of our vegetables are sourced from Gainesville’s local farms when they are in season. All of our food is made from scratch every day and the menu changes frequently to showcase the freshest of what Gainesville has to offer. We have great local seafood and a beautiful dessert case full of homemade cakes! Check out our website to see the latest menu and to make your reservations through OpenTable. CHECK OUT WEEKLY TRAVEL INSPIRATION Explore What's Good. ® PLAN YOUR VISIT WITH A FREE VISITOR GUIDE GRAB A VISITOR GUIDE SIGN UP FOR THE WHAT’S GOOD.® GUIDE Complete form to signup to email list or request a visitor guide by mail. \" * \" indicates required fields First Name * Last Name * Email * checkbox Sign up for our What's Good Weekly Event Guide Receive a printed Visitors Guide in the mail Address * Street Address Address Line 2 City State / Province / Region ZIP / Postal Code Afghanistan Albania Algeria American Samoa Andorra Angola Anguilla Antarctica Antigua and Barbuda Argentina Armenia Aruba Australia Austria Azerbaijan Bahamas Bahrain Bangladesh Barbados Belarus Belgium Belize Benin Bermuda Bhutan Bolivia Bonaire, Sint Eustatius and Saba Bosnia and Herzegovina Botswana Bouvet Island Brazil British Indian Ocean Territory Brunei Darussalam Bulgaria Burkina Faso Burundi Cabo Verde Cambodia Cameroon Canada Cayman Islands Central African Republic Chad Chile China Christmas Island Cocos Islands Colombia Comoros Congo Congo, Democratic Republic of the Cook Islands Costa Rica Croatia Cuba Curaçao Cyprus Czechia Côte d'Ivoire Denmark Djibouti Dominica Dominican Republic Ecuador Egypt El Salvador Equatorial Guinea Eritrea Estonia Eswatini Ethiopia Falkland Islands Faroe Islands Fiji Finland France French Guiana French Polynesia French Southern Territories Gabon Gambia Georgia Germany Ghana Gibraltar Greece Greenland Grenada Guadeloupe Guam Guatemala Guernsey Guinea Guinea-Bissau Guyana Haiti Heard Island and McDonald Islands Holy See Honduras Hong Kong Hungary Iceland India Indonesia Iran Iraq Ireland Isle of Man Israel Italy Jamaica Japan Jersey Jordan Kazakhstan Kenya Kiribati Korea, Democratic People's Republic of Korea, Republic of Kuwait Kyrgyzstan Lao People's Democratic Republic Latvia Lebanon Lesotho Liberia Libya Liechtenstein Lithuania Luxembourg Macao Madagascar Malawi Malaysia Maldives Mali Malta Marshall Islands Martinique Mauritania Mauritius Mayotte Mexico Micronesia Moldova Monaco Mongolia Montenegro Montserrat Morocco Mozambique Myanmar Namibia Nauru Nepal Netherlands New Caledonia New Zealand Nicaragua Niger Nigeria Niue Norfolk Island North Macedonia Northern Mariana Islands Norway Oman Pakistan Palau Palestine, State of Panama Papua New Guinea Paraguay Peru Philippines Pitcairn Poland Portugal Puerto Rico Qatar Romania Russian Federation Rwanda Réunion Saint Barthélemy Saint Helena, Ascension and Tristan da Cunha Saint Kitts and Nevis Saint Lucia Saint Martin Saint Pierre and Miquelon Saint Vincent and the Grenadines Samoa San Marino Sao Tome and Principe Saudi Arabia Senegal Serbia Seychelles Sierra Leone Singapore Sint Maarten Slovakia Slovenia Solomon Islands Somalia South Africa South Georgia and the South Sandwich Islands South Sudan Spain Sri Lanka Sudan Suriname Svalbard and Jan Mayen Sweden Switzerland Syria Arab Republic Taiwan Tajikistan Tanzania, the United Republic of Thailand Timor-Leste Togo Tokelau Tonga Trinidad and Tobago Tunisia Turkmenistan Turks and Caicos Islands Tuvalu Türkiye US Minor Outlying Islands Uganda Ukraine United Arab Emirates United Kingdom United States Uruguay Uzbekistan Vanuatu Venezuela Viet Nam Virgin Islands, British Virgin Islands, U.S. Wallis and Futuna Western Sahara Yemen Zambia Zimbabwe Åland Islands Country Name This field is for validation purposes and should be left unchanged. Δ Alachua County Visitors & Convention Bureau 33 N Main St, Gainesville, FL 32601 Toll free: (866) 778-5002 Local: (352) 374-5260 info@visitgainesville.com Facebook Instagram Twitter YouTube LinkedIn #WhyILoveGNV • @visitgainesville About Us Contact Us Press Coverage Routes to Roots Carbon Offset Project Partner and Business Resources Apply for a Grant Submit an Event Submit An RFP Tourism Economic Impacts Media Resources Travel Writers, Bloggers and Photographers Filming in Gainesville Alachua County Community and Travel Resources Emergency Preparedness Accessibility Legal Disclaimers, Public Records & Accessibility Privacy Policy Google Translate Disclaimer © 2025 Visit Gainesville Alachua County, FL"
    },
    {
      "url": "https://guidetogreatergainesville.com/purpose-20-mildreds-big-city-food/",
      "text": "Purpose 20: Mildred's Big City Food - Guide to Greater Gainesville About Us Advertise Contact Us SiteMap Facebook Twitter Linkedin Instagram Youtube Now Reading Purpose 20: Mildred’s Big City Food 0 Fierce Featured Why Greater Gainesville? Alachua County Map History of Alachua County Communities Live Work Play Municipalities Gainesville Alachua Archer Hawthorne High Springs Lacrosse Micanopy Newberry/Jonesville Waldo Real Estate Apartments Commercial Real Estate Know Your Neighbor Education School Map K-12 Private Magnets Career and Tech Online University of Florida UF Online Santa Fe College: A Global Focus Health Care Public Health Services Hospitals & Emergency Care UF Health Specialty Clinics & Services Non-Emergency Care Business Business Community Biotechnology Greater Gainesville Chamber Innovation Incubators & Startups Culture Food Scene Breweries & Distilleries Arts Sports and Recreation Weekend Getaways Lifestyle & Wellness Music Scene Things To Do Pet Services Non-Profit Getting Settled Moving Quick Tips Emergency Contact Numbers Transportation Voter Information & Engagement Gator Sports LATEST NEWS Education , University of Florida: A top-ranked university Purpose 20: Mildred’s Big City Food by webmaster March 27, 2015 webmaster Read Next Purpose 20: Scarborough Insurance The Center for Leadership and Service at the University of Florida created the Purpose 20 Awards to honor the contributions made to Alachua County by local for-profit businesses. These 20 businesses provide invaluable cash and in-kind donations while supporting the community with efforts in environmental sustainability, serving as role models for change within the community and encouraging staff members to give their time to local causes. All of this work often goes unrecognized. The Center for Leadership and Service hopes that by recognizing these businesses, we inspire others through their example and demonstrate that business is about more than making a profit — it is also about having a purpose to build a better community. “Small businesses are almost solely supported by the community where they are located, and by giving back to the people who support you, it creates a beneficial relationship for everyone.” –April Williams, general manager The Gill family is dedicated to supporting locally grown, sustainable agriculture and has always been a major supporter of local farmers in the North Central Florida community. In 2003, Bert Gill co-founded a farm-to-table food organization, the North Florida Food Partnership, committed to teaching patrons as well as the community’s youth about sustainable agriculture. Since Mildred’s follows a “lead by example” motto for its staff, Chef Gill has volunteered as part of the Let’s Move! initiative in the Alachua County School District cafeterias, where he set up healthy school menus and mentored future chefs at Eastside by teaching them the importance of organic and local agriculture. The Gills encourage their team to volunteer because they believe in giving back to the community that supports them — that is what makes Gainesville a better place for everyone to live and work! Sign Up to Our Newsletter Get notified about exclusive offers every week! SIGN UP I would like to receive news and special offers. 0 webmaster March 27, 2015 0 Shares Share 0 Tweet Share Share Guide to Greater Gainesville Annual Digital All Issues HOME: Living in Greater Gainesville Monthly Digital All Issues Guide to Greater Tampa Bay Annual Digital All Issues Education Purpose 20: Solar Impact Inc. Previous Article Education Purpose 20: Scarborough Insurance Next Article Contact Us CostelloCM. Gainesville, FL (352) 281-2072 (352) 372-5957 scott@costellocm.com Subscribe to receive GUIDE news & articles in your inbox! SIGN UP I would like to receive news and special offers. Copyright © 2024 Costello Communications & Marketing, LLC Facebook Twitter Instagram Linkedin Scroll To Top Fierce Featured Why Greater Gainesville? Alachua County Map History of Alachua County Communities Live Work Play Municipalities Gainesville Alachua Archer Hawthorne High Springs Lacrosse Micanopy Newberry/Jonesville Waldo Real Estate Apartments Commercial Real Estate Know Your Neighbor Education School Map K-12 Private Magnets Career and Tech Online University of Florida UF Online Santa Fe College: A Global Focus Health Care Public Health Services Hospitals & Emergency Care UF Health Specialty Clinics & Services Non-Emergency Care Business Business Community Biotechnology Greater Gainesville Chamber Innovation Incubators & Startups Culture Food Scene Breweries & Distilleries Arts Sports and Recreation Weekend Getaways Lifestyle & Wellness Music Scene Things To Do Pet Services Non-Profit Getting Settled Moving Quick Tips Emergency Contact Numbers Transportation Voter Information & Engagement Gator Sports LATEST NEWS About Us Media Kit Contact Us Facebook Twitter Instagram Linkedin"
    },
    {
      "url": "https://www.staygainesville.com/mildred-s-big-city-food-new-deal-cafe",
      "text": "Mildred's Big City Food & New Deal Cafe HOME BOOK NOW ALL SHORT-TERM RENTALS LARGE GROUPS NEAR UF CAMPUS PRIVATE POOLS COMMUNITY POOLS DOWNTOWN GAINESVILLE BUDGET NEAR UF SHANDS HOSPITAL ACCESSIBLE HOMES PET-FRIENDLY MEDICAL HOUSING CORPORATE HOUSING CONSTRUCTION CREWS TRAVEL NURSE HOUSING AIRBNB PROPERTY MANAGEMENT THINGS TO DO THINGS TO DO IN GAINESVILLE THE STAYGAINESVILLE EXPERIENCE ABOUT US ABOUT US CONTACT BLOG RESOURCES FOR REALTORS GATOR ATHLETES RELOCATION GUIDE FAQs PRIVACY POLICIES WEBSITE TERMS & CONDITIONS BEST OF THE BEST TERMS & CONDITIONS Book Now Get in touch (352) 519-3994 info@staygainesville.com HOME BOOK NOW ALL SHORT-TERM RENTALS LARGE GROUPS NEAR UF CAMPUS PRIVATE POOLS COMMUNITY POOLS DOWNTOWN GAINESVILLE BUDGET NEAR UF SHANDS HOSPITAL ACCESSIBLE HOMES PET-FRIENDLY MEDICAL HOUSING CORPORATE HOUSING CONSTRUCTION CREWS TRAVEL NURSE HOUSING AIRBNB PROPERTY MANAGEMENT THINGS TO DO THINGS TO DO IN GAINESVILLE THE STAYGAINESVILLE EXPERIENCE ABOUT US ABOUT US CONTACT BLOG RESOURCES FOR REALTORS GATOR ATHLETES RELOCATION GUIDE FAQs PRIVACY POLICIES WEBSITE TERMS & CONDITIONS BEST OF THE BEST TERMS & CONDITIONS Mildred's Big City Food & New Deal Cafe A Culinary Adventure Awaits: Unveiling Mildred's Big City Food in Gainesville, FL Website: https://mildredsbigcityfood.com/ Address: 3445 W University Ave, Gainesville, FL The StayGainesville Connection: One of our owners, Susannah Peddie, LOVES Mildred's for lunch. She has a standing lunch date with one of her friends. It's a friendly place with delicious food, attentive staff, and is in a great location (centrally located in Gainesville). Amidst the bustling streets and the iconic University of Florida campus lies a culinary gem – Mildred's Big City Food.  This restaurant isn't your average restaurant; it's a celebration of bold flavors, innovative comfort food, and a warm, welcoming atmosphere.  Step inside Mildred's, and you're greeted by the friendly banter between staff and regulars and a sense of vibrant energy that sets the stage for a memorable dining experience. Mildred's Big City Food was first established in Gainesville, in the summer of 1999. One of three restaurants owned and operated by Tara and Bert Gill, it's mission has been the mantra of the Gills' approach to cooking at all of their businesses: To serve fresh, delicious, and local food. That means working with local farmers to use sustainable and organic produce, cooking with fresh seafood caught from the waters surrounding Florida, and serving choice cuts of a variety of meats cooked to perfection. With a constantly changing menu that balances simplicity with sophistication, the staff at Mildred's are dedicated to learning new techniques and dishes. Come for lunch, dinner, coffee, dessert or drinks, and experience the food and atmosphere that earned Mildred's a place in the Golden Spoon Hall of Fame. The New Deal Café is also owned and operated by Tara & Bert Gill, proprietors of Mildred’s Big City Food and Blue Gill Quality Foods. Established in 1999, Mildred’s Big City Food serves high-quality food crafted from locally sourced ingredients. By day it is a casual bistro-style setting, in the evening Mildred’s offers some of the most sophisticated cuisines in the region with service to match. The menu changes nightly, with a meticulously crafted wine list and top shelf, craft spirits. When dining at the New Deal, you are welcome and encouraged to order from our Mildred’s menu. The New Deal Café features local award-winning burgers and salads and we all know there’s nothing better than a well-paired burger and beer. We also have a great pizza oven so that we can offer delicious, crispy flatbreads in addition to our burgers. We offer happy hour daily from 4-7pm and our back dining room is available for private events such as business dinners, showers, and birthday parties. In 2011, Blue Gill Quality Foods opened its doors inviting friends and family to enjoy contemporary meals inspired by southern cuisine. Blue Gill offers local, fresh ingredients in dishes created by a talented kitchen staff. For private events, Blue Gill also provides a venue known as “the barn” adjoined to the main dining room. From day one, the Gills and their staff have ensured that their restaurants not only offer delicious cuisine but also maintain a community first orientation. While they purchase products from local farmers and artisans they also contribute to Gainesville in a more subtle manner. In 2008, Bert won the Florida Volunteer Restaurateur Award for his work as a mentor with the Eastside High School Culinary Team. Additionally, under Tara & Bert’s careful guidance numerous Gainesville residents have had the opportunity to learn skills of the trade, which has allowed them to seek hospitality careers in competitive environments such as New York City, Chicago, and Atlanta. Looking for a place to stay while visiting the local Gainesville attractions? Look no further than Gainesville's locally owned vacation rental company, StayGainesville . Book directly on our site, or call us at 352-519-3994 for guidance. For homes and condos, StayGainesville has many options- large and small/ budget and luxury, and more. For a shorter stay, we have 2 beautiful historic Inns in downtown Gainesville. The Camellia Rose Inn and The Laurel Oak Inn - both have unique personalities and they both feel like a home away from home. Looking for more things to do in Gainesville? Visit our Things to Do link. < Older Post Newer Post > Why Owners Trust StayGainesville for AirBNB Property Management By Susannah Peddie • September 8, 2025 Discover why property owners trust StayGainesville for expert property management in Gainesville. From guest care to profitability, we protect your investment. Gainesville Vacation Rentals with Beautiful Outdoor Spaces By Susannah Peddie • September 5, 2025 Gainesville Vacation Rentals with Beautiful Outdoor Spaces                                                              When you’re planning a trip to Gainesville, chances are you’re coming for more than just a place to sleep. Whether you’re cheering on the Gators, visiting friends and family, or exploring North Florida’s springs and trails, your accommodations should be a retreat of their own. That’s where StayGainesville comes in.                                                              Our collection of vacation rentals is designed not only for comfort inside but also for relaxation and fun outside. From private pools perfect for Florida sunshine to fenced yards where kids and pets can run free, our homes are built for guests who want more than four walls. In this post, we’re highlighting some of the beautiful outdoor spaces you’ll find when you book with us.                                                                          Why Outdoor Space Matters                                                                         Vacations and getaways are about slowing down, connecting, and making memories. An outdoor area extends your living space and gives you options:                                                        Morning coffee on the porch with birdsong in the background.                                     Afternoon swims in the pool to beat the Florida heat.                                     Evening cookouts on the patio with everyone gathered around.                                     Quiet fenced yards where little ones (and pets) can play safely.                                                      These simple pleasures can make your Gainesville stay feel less like a trip and more like home.                                                                          StayGainesville Homes with Pools                                                                         There’s something magical about having your own pool while on vacation. No crowded hotel decks, no closing hours—just a sparkling, private oasis steps from your back door.                                                              Several StayGainesville rentals feature in-ground pools surrounded by lush greenery or spacious decks where you can stretch out with a book. Families love them for the kids, while adults enjoy winding down after a day of adventure. Gainesville’s warm weather means pool season lasts much longer here than in other parts of the country, so no matter when you visit, you’ll likely get to take a dip.                                                              Imagine spending your Saturday at a Gator football game and then cooling off in your own pool when you get back. That’s the kind of experience that makes guests return to us year after year.                                                                          Patios and Porches Made for Gathering                                                                         For those who prefer lounging over laps, our homes with patios and porches offer the perfect backdrop for relaxation. Picture yourself sipping a glass of wine under string lights, or reading a novel in a rocking chair while the breeze drifts by.                                                        Screened-in porches mean no bug spray needed while you enjoy the Florida evenings.                                     Covered patios provide shade during sunny afternoons.                                     Outdoor seating and dining areas let you take every meal al fresco.                                                      One of the most common comments we hear from guests is how much they loved “just hanging out on the porch.” It’s a simple pleasure that turns a good vacation into a memorable one.                                                                          Fenced Yards for Families and Pets                                                                         We know that for many of our guests, pets are family too. That’s why several StayGainesville properties feature large, fenced yards where dogs can explore and play safely. Families with kids also appreciate these yards—there’s peace of mind knowing everyone can enjoy the outdoors without worry.                                                              Traveling with your furry friend? No need to stress about pet policies or tiny hotel rooms. Our homes are designed to welcome wagging tails, with plenty of space for everyone to stretch out.                                                                          Outdoor Dining and Entertainment                                                                         Vacations are about sharing meals and laughter, and nothing sets the scene better than a great outdoor dining setup. Many of our rentals come with:                                                        Gas or charcoal grills for cookouts.                                     Patio tables and umbrellas for shaded lunches.                                     Fire pits for roasting marshmallows on cooler nights.                                                      In Gainesville, evenings are often balmy and perfect for gathering outside. Whether you’re grilling burgers before a game day or enjoying a quiet dinner under the stars, our outdoor spaces make it easy to stay connected with the people who matter most.                                                                          Gainesville: A City Made for Outdoor Living                                                                         Of course, part of the beauty of having great outdoor space at your rental is how well it pairs with Gainesville’s natural surroundings. When you’re not enjoying the pool or porch, you can step out and explore:                                                        Kanapaha Botanical Gardens, just a short drive away, with 24 themed gardens to wander.                                     Paynes Prairie Preserve State Park, where you might spot wild horses, bison, or a sunset over the prairie.                                     Local springs like Ginnie Springs or Blue Springs, famous for their crystal-clear waters.                                     Biking and walking trails, such as the Gainesville-Hawthorne Trail, perfect for an active morning.                                                      After a day of adventuring, coming back to a home with its own backyard retreat makes your trip feel balanced and refreshing.                                                                          Who Our Outdoor Spaces Are Perfect For                                                                                 Families with kids                          : Let them splash in the pool or play tag in the yard while you relax nearby.                                                   Couples                          : Share morning coffee on the porch or a private dinner under the stars.                                                   Pet owners                          : Give your four-legged friend freedom to roam safely.                                                   Groups of friends                          : Host a cookout, hang by the pool, and make memories together.                                                      Whatever your group looks like, StayGainesville has a property designed with you in mind.                                                                          Why Choose StayGainesville?                                                                         It’s not just about the amenities—it’s about the experience. When you stay with us, you’re choosing:                                                        Homes with personality: Every property is thoughtfully designed and furnished.                                     Local expertise: We’ve been part of Gainesville’s community for years, and we love sharing it with visitors.                                     Flexibility: From whole homes for large groups to cozy retreats for couples, we offer spaces that fit your trip.                                     Peace of mind: Professionally managed homes mean you’ll enjoy a clean, reliable, and comfortable stay.                                                      Hotels can’t compete with the privacy, space, and comfort of a rental home—especially when it comes with a beautiful outdoor area all to yourself.                                                                          Book Your Gainesville Outdoor Retreat                                                                         Your vacation should feel like a breath of fresh air—literally. StayGainesville’s rentals with pools, fenced yards, patios, and porches give you room to relax, play, and connect. Whether you’re here for a weekend or a season, our homes are ready to welcome you.                                                              Browse our collection and find the outdoor oasis that’s perfect for your Gainesville getaway. We’ll handle the details—you just bring the sunscreen, the burgers, and your favorite people.                                                              Ready to plan your stay? Book directly with StayGainesville                       for the best rates and availability.                                                      Call us at                         352-519-3994                        or                         book on our website                        . More Posts Gainesville, FL Find Us: Call: (352) 519-3994 Email: info@staygainesville.com We are a short-term property rental company with a deep local presence. We support the Gainesville community in so many ways. We hire locally, we use local vendors, we partner with local businesses, and we love sharing our love of Gainesville with all of our guests. PRIVACY POLICY TERMS & CONDITIONS FOR ALL BOOKINGS © 2025 All Rights Reserved | Stay Gainesville Share by:"
    }
  ]
}