{
  "fuentes": [
    {
      "url": "https://millennialbrewing.com/fort-myers-downtown-fort-myers-millennial-brewing-company-about",
      "email": "info@millennialbrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "accounts.payable@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "events@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "grant@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "kim@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mic@parkwaybrewing.com"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "email": "mike@parkwaybrewing.com"
    },
    {
      "url": "https://www.mhkbeer.com/about-us",
      "email": "info@mhkbeer.com"
    },
    {
      "url": "https://demo.visitfortmyers.com/listing/millennial-brewing-company/59244",
      "email": "info@millennialbrewing.com"
    },
    {
      "url": "https://millennialbrewing.com/",
      "email": "info@millennialbrewing.com"
    },
    {
      "url": "https://thevendry.com/venue/214283/millennial-brewing-company-fort-myers-fl",
      "email": "events@millennialbrewing.com"
    },
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "email": "info@blockbrewingcompany.com"
    },
    {
      "url": "https://www.millennialbrewing.com/about/",
      "email": "info@millennialbrewing.com"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/millennial-brewing-company/59244",
      "email": "info@millennialbrewing.com"
    }
  ],
  "mails": [
    "accounts.payable@parkwaybrewing.com",
    "events@millennialbrewing.com",
    "events@parkwaybrewing.com",
    "grant@parkwaybrewing.com",
    "info@blockbrewingcompany.com",
    "info@mhkbeer.com",
    "info@millennialbrewing.com",
    "kim@parkwaybrewing.com",
    "mic@parkwaybrewing.com",
    "mike@parkwaybrewing.com"
  ],
  "nombre_sitio": "millennialbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://millennialbrewing.com/fort-myers-downtown-fort-myers-millennial-brewing-company-about",
      "text": "Millennial Brewing Company - About Skip to main content Private Parties Drinks Our Events About BEER Catering Gift Cards Facebook page Instagram page Google page Facebook page Instagram page Google page Toggle navigation Private Parties Drinks Our Events About BEER Catering Gift Cards Millennial Brewing Company slideshow start stop playing Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 previous slide next slide Millennial Brewing Company About us Multi-tasking, connected, and tech-savvy are all terms used to describe the quintessential Millennial.  So who are we?  We are Millennials who have a dream.  No different than all the generations before us, we seek to make a difference.  To make an impact on the world through creating a one-of-a-kind community of beer lovers.  We pair passion with a strong work ethic and technology to create a singular craft beer and member experience.  Add to this a never-ending commitment to the community we love and there’s nothing we can’t do.   250+ local charities supported since 2017 and the number continues to grow.   We won’t stop giving back. Ever. Kyle Cebull - Founder - I've loved beer for as long as I can remember.  Once I paired up with a skilled brewmaster, everything fell right into place.  I served our country for five years as a Sergeant in the USMC right outside Washington, DC.  I followed that up with 10 years of being immersed the SWFL business market, making connections, and helping people.  All of my previous experience with leadership and business lead me right into starting Millennial Brewing. I was born in Sandusky, OH (home of the famous Cedar Point) and moved to SWFL when I was six years old.  I have always loved Southwest Florida and appreciate it more each day.  I enjoy golfing, boating and hanging out at the beach with the family.  I have two beautiful children, Kyle Jr. and Amelie.  They are my motivation, my everything and my hope is to create something that they will be just as proud of as I am.  That's why Millennial Brewing exists.  To create more than just a group of \"regulars\" that hang out at the brewery, to create a singular community of people that are just as committed to the community and the art of brewing as we are.  In that way, and as a direct result of its community, Millennial Brewing will be unlike any other brewery in the world.  We are so excited to share our dream with each and every one of you. Millennial Brew Team Brewer – Ralph Sprandel Jr. -The Millennial Brew team is like none other in the state.  Our Brewer, Ralph Sprandel Jr., is a self-taught, passionate curator of craft beer production.   He served our country in the United States Marine Corps, and then our community as a Lee County Sheriff Deputy.   Now, he expresses his love for beer right here in the Millennial brewhouse and crafts recipes that are true to style with his own unique flavor.   We are so excited to have him take the helm and lead us into the next evolution of our beverage offerings. Millennial Customer Experience Team - Our customer experience team leads the front of house operation with ease and skill.   Erin Williams applies her leadership experience in education and many years of hospitality experience to deftly maneuver the variety of service and event management elements of Millennial Brewing.  Stephanie Bilske brings to bear her vast amount of management and service experience within the craft beer industry every day delivering the absolute best customer experience and contributing to the never ending innovation with events, beer naming and more that is required to keep Millennial at the forefront of the craft beer scene in SWFL. Erin and Stephanie lead our front of house team of dynamic customer service dynamos and ensure every customer has a great time here at Millennial! Contact us: by phone (239)-271-2255, by email info@millennialbrewing.com Parties Catering"
    },
    {
      "url": "https://parkwaybrewing.com/contact/",
      "text": "Contact - Parkway Brewing Company Skip to content Parkway Brewing Company Home Brews Where to find Parkway Distribution Online Store About Us Our Team Our Story The Tasting Room On Tap This Week’s Live Music and Food Trucks Private Events Monthly Music & Food Truck Calendar Visiting Parkway Pilot Batch Online Store Beer Buzz Contact Facebook Twitter Instagram Contact Contact Have a specific question? See below for the right contact and we’d love to answer that question for you! Private Events: events@parkwaybrewing.com For music/talent bookings, food trucks, or anything tasting room related: No Phone Calls Please, All Music Booking by Email ONLY kim@parkwaybrewing.com For  sales and distribution: grant@parkwaybrewing.com mike@parkwaybrewing.com For brewing, and general manager: mike@parkwaybrewing.com For office manager: mic@parkwaybrewing.com For invoices: accounts.payable@parkwaybrewing.com Share this: Click to share on Facebook (Opens in new window) Click to share on Twitter (Opens in new window) Click to share on Pinterest (Opens in new window) Click to print (Opens in new window) Subscribe for Updates Search our Site Distinctive Beers Crafted With Care In The Heart Of The Blue Ridge parkwaybrewing.com 739 Kessler Mill Road Exit 141 on I-81, SALEM, VA 540-404-9810 kim@parkwaybrewing.com Facebook Twitter Instagram Brewery Hours Monday – 2pm to 8pm Tuesday – 2pm to 8pm Wednesday – 2pm to 9pm Thursday – 2pm to 9pm Friday – 12pm to 9pm Saturday – 12pm to 9pm Sunday – 12pm to 8pm Holiday Closures: Christmas Day, New Years Day, Memorial Day, July 4th, Labor Day, Thanksgiving Day © 2025 Parkway Brewing Co. | Custom Wordpress Development by William Alexander"
    },
    {
      "url": "https://www.mhkbeer.com/about-us",
      "text": "About Us - Manhattan Brewing Company Skip to main content We use cookies to improve site performance and your experience. View our privacy policy for more information OK Go Home About Us Beers MBC Lounge MBC Catering The Brew Deck Join Our Team Shop Wing Wars Contact Us Our Story About Us We're ready to share our beers with Manhattan. With nearly 20 years of collective experience in the craft beer industry, we're focused on brewing and serving high-quality craft beers in a family-friendly atmosphere in the heart of downtown Manhattan. This town is our home, and we want to bring the best possible beer experience and education to the wonderful people of Manhattan. We want to create a place for everyone to come out and have a good time with friends and cultivate a craft beer culture Manhattan can be proud of. Our Team The best and brightest Co-Owners Portraits by Killian Millner Adam Krebsbach Brewer A native of Norton, Kansas, who moved to Manhattan in 2006, Adam's unrelenting creative energy has resulted in a tasty variety of imaginative beers. A tinkerer at heart, Adam is the yin to Garrett's yang; for every traditional style brewed by Garrett, you'll find Adam experimenting with an array of unique ingredients into his beers to challenge and delight beer fans. Adam loves drinking American pale ales, robust porters and Belgian tripels. Garrett Paulman Brewer A professionally trained brewer from the renowned Siebel Institute of Technology in Chicago, Garrett also brings experience in facility management and quality control. Garrett started brewing in 2011 before making the leap to attend Siebel and \"turn pro\" in 2012. You will find Garrett drinking anything hoppy while laughing with friends, family and strangers at the bar. Although he's a Nebraska native, Garrett, his wife and two children are K-State fans in training. Jake Voegeli Sales & Marketing A former K-State football player from Wichita, Kansas, who bleeds purple with his wife and daughter, Jake's journey into craft beer began in college after committing himself to trying a new six pack each week. Jake loves to challenge his palate with hoppy IPAs, sours and barrel-aged stouts, but also loves a well-crafted, delicate pilsner or a traditional English brown ale. An experienced salesman and marketer both in the craft beer and spirits industries, you'll mostly see Jake up front slinging beers or chatting with guests about beer, K-State football, his favorite Ryan Bingham album or his daughter Chloe. Keep up to date with Manhattan Brewing Company on twitter Follow Manhattan Brewing Company on facebook See what's going on at Manhattan Brewing Company on instagram Manhattan Brewing Company,\n\t\t\t\t\t406 Poyntz Ave, Manhattan, KS  66502 785-775-0406 Powered By Merlin® | Privacy Policy | Terms of Use Scroll to top of page"
    },
    {
      "url": "https://demo.visitfortmyers.com/listing/millennial-brewing-company/59244",
      "text": "Millennial Brewing Company | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Share Share Visit Website Millennial Brewing Company Multi-tasking, connected, and tech-savvy are all terms used to describe the quintessential Millennial. The founders wish to make an impact on the world through creating a one-of-a-kind community of beer lovers.  They pair passion with a strong work ethic and technology to create a singular craft beer and member experience. 26.642913, -81.864357 239-271-2255 1811 Royal Palm Ave Fort Myers , FL 33901 United States info@millennialbrewing.com View Website Key Features Where to Eat Breweries & Distilleries Bars, Lounges & Clubs Gallery 26.642913, -81.864357 239-271-2255 1811 Royal Palm Ave Fort Myers , FL 33901 United States info@millennialbrewing.com View Website Key Features Where to Eat Breweries & Distilleries Bars, Lounges & Clubs What's Nearby River District History Tour Explore the charming river district of old Fort Myers as you hear the story of its sometimes turbulent birth and... McGregor Cottage Discover Fort Myers' historic charm at the McGregor Cottage, built in 1925 and just minutes from the Edison Ford Winter... Haunted History Tour This 90-minute guided walking tour offers glimpses into the unseen, with stories of the reputed paranormal activity of... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    },
    {
      "url": "https://millennialbrewing.com/",
      "text": "Millennial Brewing Company | Brewery & Private Event Venue Fort Myers × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Skip to main content Private Parties Drinks Our Events About BEER Catering Gift Cards Facebook page Instagram page Google page Facebook page Instagram page Google page Toggle navigation Private Parties Drinks Our Events About BEER Catering Gift Cards The decorative video is currently playing The decorative video sound is off Drinks We take pride in crafting high-quality, small-batch creations that stand out. Each of our award-winning handcrafted nano brews is carefully curated and brewed with a dedication to flavor, detail, and the spirit of the times. Whether you’re sipping on a nostalgic throwback or trying a daring new blend, you’ll taste the care we pour into every drop. Join us and experience the future of brews – one nano batch at a time! Our drinks Groups and Parties Book your next party with us! Need the space for your event? Search no more we have a perfect place for you! Private Parties Explore our non-alcoholic offerings Millennial's homegrown non-alcoholic bar located right inside the brewery. Featuring Kava, Kratom, CBD, Delta-8, Botanical Cocktails, Kid-Friendly Lemonades and Cocktails. Our drinks slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content previous slide next slide Eat. Drink. Enjoy. Our Events Explore our non-alcoholic offerings Our Drinks Beer Subscription Subscribe About us Multi-tasking, connected, and tech-savvy are all terms used to describe the quintessential Millennial.  So who are we?  We are Millennials who have a dream.  No different than all the generations before us, we seek to make a difference.  To make an impact on the world through creating a one-of-a-kind community of beer lovers.  We pair passion with a strong work ethic and technology to create a singular craft beer and member experience.  Add to this a never-ending commitment to the community we love and there’s nothing we can’t do.   250+ local charities supported since 2017 and the number continues to grow.   We won’t stop giving back. Ever. Read more about us Skip Photo Gallery A glass of light beer Millennial Brewing outdoor seating area Interior decorations Millennial Brewing beer and cocktail menu items Guests at the restaurant The restaurant building Fruitopia cocktail The exterior patio under parasols Light beer People at the restaurant Guests at their tables Brewery devices The interior of the restaurant Lots of guests at the restaurant Our Events Start stop events carousel B.E.E.R.R.U.N. Social Run Club Night - Every Thursday Thursday September 11th Every Thursday Join us every Thursday when Running Friends of SWFL meets for their weekly social run club event. A casual run/walk through beautiful Downtown Fort Myers with a new route each week featuring Downtowns most beautiful sights including bridge runs, park runs, and neighborhood runs! Open to all ages, all skill levels and pets are encouraged! Stay in the know for theme weeks and changes to the schedule are posted on Social Media! SWFL BURGER THROWDOWN Saturday September 13th SWFL BURGER THROWDOWN   Saturday, September 13 |  12 PM – 8 PM  Think you know the best burger in Southwest Florida? We’re putting it to the test! EIGHT of SWFL’s top food trucks and restaurants are going head-to-head in the ultimate burger battle. Juicy, creative, and downright delicious—only one will walk away with the crown  of Best Burger in SWFL.   Live entertainment  Cold drinks flowing  Burgers of every style imaginable  Family-friendly, free to attend (pay for what you eat!)  Bring your appetite, bring your crew, and get ready to eat, vote, and celebrate the burger champions of SWFL. Who will you crown the winner?   RSVP now and tag your burger squad—this is one showdown you don’t want to miss! Return of the Disco - Silent Disco Dance Party Saturday September 20th 🎶 3 Channels. 1 Dance Floor. Endless Vibes. 🎶 🎧 Silent Disco Dance Party @ Millennial 🍻 📅 Friday, September 20th 🕗 8:00 PM – 12:00 AM The Return of the Disco is here! 🎉 For one night only, snag your headset for just $5 and dive into the ultimate Silent Disco experience at Millennial Brewing Company. Switch between 3 DJ channels packed with nostalgia: ✨ 80s classics ✨ 90s throwbacks ✨ 2000s hits Hit the air-conditioned warehouse dance floor, sip on house craft beer, ciders, cocktails, or explore our huge non-alcoholic menu — the perfect fuel for a night of nonstop dancing. 📍 Millennial Brewing Company 🎟 $5 headsets (special return price!) 🎟 21+ to drink | All ages welcome Grab your crew, pick your channel, and let’s bring the disco back! 9th Annual Millennial Oktoberfest Friday October 3rd Runs until Sunday, October 5th, 2025 Just wait until you see the lineup of what we have planned for this year's EPIC OKTOBERFEST Event! Here's a taste of what's in store!!!   GERMAN FOOD COOKING COMPETITIONS  MORE GERMAN CONTESTS (In addition to Steinhoisting, Cup Stack Contests, Beerlympics Events, and more more more)  AUTHENTIC BAVARIAN PERFORMANCES  MILLENNIAL DIRNDL GIRLS AND MORE!!!  PLUS + Our Full German Craft Beer Menu + Your Favorite Authentic German Family Food Vendors + Free Parking and Free Entry + Delicious German Dessert Vendors + and more! Reviews Start stop reviews carousel Review by - Google five star review by Taylor A.: So far so good…place is HUGE with plenty to hear, see and touch and of course…quality brews. Typical games including a beer pong table are at your disposal as well as plenty of seating and a bar. Ahhh. The smell of a brewery! Cheers. Review by - Google five star review by Dr. Elijah T.: Place is expertly designed. Fridays they have a good truck rally with 4 or more trucks. They have memberships to get growler fills and add new beers each month.  They have lots of different themed days.  Sunday is family fun day with bounce house and water park for kids.  The place is kid and dog friendly. Review by - Google five star review by Shawn F.: Excellent brewery, cool space and events. They brew small 4 barrel batches so there are often new brews. Tables and cool wall are reclaimed wood and made by the employees. Grapefruit Hefeweizen is awesome. They're happy to give you samples, there's pinball, games, and pool. Hang out for a while! Review by - Google five star review by Paul S.: Great location and great brews… We stoped by during the pandemic right when they opened and were able to get served right away. Friendly staff. Great selection of beer. They even have a food truck outside but happy to be of Indian style food… It all looks very appetizing Newsletter Location 1811 Royal Palm Avenue Fort Myers, FL 33901 Located in Downtown Fort Myers, southwest from the intersection of Fowler & Second Street, right off Royal Palm Avenue close to Dr. MLK Jr. Blvd. Hours Tue, Wed 4:00 PM - 9:00 PM Thur, Fri 4:00 PM - 10:00 PM Sat 12:00 PM - 10:00 PM Sun 12:00 PM - 6:00 PM Find us on... Facebook page Instagram page Google page Contact us Call us at (239)-271-2255 Write us at info@millennialbrewing.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. Parties Catering × Newsletter Are You 21 or Older? Yes No We strive to make our website accessible to everybody. Learn More."
    },
    {
      "url": "https://thevendry.com/venue/214283/millennial-brewing-company-fort-myers-fl",
      "text": "Millennial Brewing Company - Brewery / Distillery in Fort Myers, FL | The Vendry by by Search Inspiration Circles Log In Sign Up by The community and marketplace for event pros. Join Us List My Business The Vendry Organizations The Memo About the Vendry Contact Us Groupize Keep me posted with industry news, cool case studies, and events. Your email address Subscribe © 2025 THE VENDRY LLC. Privacy Terms & Conditions Terms of Use Overview Spaces Press Nearby Hotels Millennial Brewing Company Brewery / Distillery 1811 Royal Palm Ave, Fort Myers, FL 33901, United States Millennial Brewing Company 1811 Royal Palm Ave, Fort Myers, FL 33901, United States Request Pricing # of Spaces 1 Space Capacity Max Seated: 120 Multi-tasking, connected, and tech-savvy are all terms used to describe the quintessential Millennial. So who are we? We are Millennials who have a dream. No different than all the generations before us, we seek to make a difference. To make an impact on the world by creating a one-of-a-kind community of beer lovers. We pair passion with a strong work ethic and technology to create a singular craft beer and member experience. Add to this a never-ending commitment to the community we love and there's nothing we can't do. 250+ local charities supported since 2017 and the number continues to grow. We won't stop giving back. Ever. Show more Request Pricing 1811 Royal Palm Avenue, Fort Myers, FL Show on the map Spaces Full Buyout of Millennial Brewing Company Max Seated: 120 Full Buyout of Millennial Brewing Company Max Seated: 120 Press Wandering our World A Guide To Fort Myers Nightlife: Best Bars, Nightclubs, Live Music & More! May 23, 2023 Wanderlog The 36 best bars with live music in Fort Myers Aug 12, 2022 Wandering our World A Guide To Fort Myers Nightlife: Best Bars, Nightclubs, Live Music & More! May 23, 2023 Wanderlog The 36 best bars with live music in Fort Myers Aug 12, 2022 Do you work for Millennial Brewing Company ? Contact us to learn more about who's managing this profile or gain access. Other Venues in Fort Myers for Your Event Fort Myers Restaurants Fort Myers Hotels Fort Myers Event Spaces Fort Myers Bars / Clubs Fort Myers Breweries / Distilleries Fort Myers Restaurants Fort Myers Hotels Fort Myers Event Spaces Fort Myers Bars / Clubs Fort Myers Breweries / Distilleries"
    },
    {
      "url": "https://www.blockbrewingcompany.com/contact-us/",
      "text": "Contact Us - Block Brewing Skip to content FACEBOOK INSTAGRAM Home About Block Brewing – Brighton Block Brewing – Howell Banquets & Catering Our Beers Mug Club Gift Cards Events News Employment Contact Contact Us Contact we would love to hear from you You can Get in touch with us by email, phone, mail or by filling out the form below how to reach us bLOCK BREWING - HOWELL, MI By Mail: 1140 S. Michigan Ave. Howell, MI 48843 Email: [email protected] Phone: (517) 540-0300 bLOCK BREWING - BRIGHTON, MI By Mail: 1840 South Old US 23 Brighton, MI 48114 Email: [email protected] Phone: (810) 206-3990 get in touch Send Brighton Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm Howell Hours Sun-Thurs: 11am to 10pm Fri & Sat: 11am to 11pm catering or banquet inquiries Click for more info on catering or banquets 🚨🍻NOW   ON   TAP   AT   OUR   BRIGHTON  ... Open We're   kicking   off   American   Craft   Beer   Week  ... Open Happy   Mother's   Day   to   all   you   amazing  ... Open 🚨🍻Now   on   Tap   at   our   Brighton   Location:   TAN  ... Open Happy   Cinco   de   Mayo!! We've   got   some... Open May   The   4th   Be   With   You! Stop   into   the  ... Open Happy   Friday   Everyone,   we   made   it   to   the  ... Open Happy   Saturday!! We're   throwing   out... Open 🚨🍻NEW   BEER   ALERT   🚨🍻 ... Open It's   Flux   Friday!!!   Come   enjoy   this   beautiful... Open It's   a   beautiful   day   to   come   enjoy   a   brew   on  ... Open Hoppy   Easter!!   We're   throwing   out   some   new,  ... Open Happy   National   Beer   Day!! Come   celebrate  ... Open Something   Wicked   this   way   comes.   .   With  ... Open It's   a   slam   *Dunk*,   vote   Block   for   March  ... Open Load More This error message is only visible to WordPress admins Error: Access Token is not valid or has expired. Feed will not update. Contact us block brewing Howell Facebook 1140 S Michigan Ave Howell, MI 48843 (517) 540-0300 [email protected] block brewing Brighton Facebook 1840 South Old US 23 Brighton, MI 48114 (810) 206-3990 [email protected] Howell hours Sun-Thurs: 11am -10pm Fri & Sat: 11am - 11pm Brighton hours Sun-Thurs: 11am - 10pm Fri & Sat: 11am - 11pm quick links Our Brews Brighton Location Howell Location Mug Club Gift Cards Banquets & Catering Employment Block Brewing Company was founded on the concept of bringing together a simple love of craft beer and great food and we want to share that passion with you. Designed and powered by Brewing Sites | Privacy Policy"
    },
    {
      "url": "https://www.millennialbrewing.com/about/",
      "text": "Millennial Brewing Company - About Skip to main content Private Parties Drinks Our Events About BEER Catering Gift Cards Facebook page Instagram page Google page Facebook page Instagram page Google page Toggle navigation Private Parties Drinks Our Events About BEER Catering Gift Cards Millennial Brewing Company slideshow start stop playing Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 previous slide next slide Millennial Brewing Company About us Multi-tasking, connected, and tech-savvy are all terms used to describe the quintessential Millennial.  So who are we?  We are Millennials who have a dream.  No different than all the generations before us, we seek to make a difference.  To make an impact on the world through creating a one-of-a-kind community of beer lovers.  We pair passion with a strong work ethic and technology to create a singular craft beer and member experience.  Add to this a never-ending commitment to the community we love and there’s nothing we can’t do.   250+ local charities supported since 2017 and the number continues to grow.   We won’t stop giving back. Ever. Kyle Cebull - Founder - I've loved beer for as long as I can remember.  Once I paired up with a skilled brewmaster, everything fell right into place.  I served our country for five years as a Sergeant in the USMC right outside Washington, DC.  I followed that up with 10 years of being immersed the SWFL business market, making connections, and helping people.  All of my previous experience with leadership and business lead me right into starting Millennial Brewing. I was born in Sandusky, OH (home of the famous Cedar Point) and moved to SWFL when I was six years old.  I have always loved Southwest Florida and appreciate it more each day.  I enjoy golfing, boating and hanging out at the beach with the family.  I have two beautiful children, Kyle Jr. and Amelie.  They are my motivation, my everything and my hope is to create something that they will be just as proud of as I am.  That's why Millennial Brewing exists.  To create more than just a group of \"regulars\" that hang out at the brewery, to create a singular community of people that are just as committed to the community and the art of brewing as we are.  In that way, and as a direct result of its community, Millennial Brewing will be unlike any other brewery in the world.  We are so excited to share our dream with each and every one of you. Millennial Brew Team Brewer – Ralph Sprandel Jr. -The Millennial Brew team is like none other in the state.  Our Brewer, Ralph Sprandel Jr., is a self-taught, passionate curator of craft beer production.   He served our country in the United States Marine Corps, and then our community as a Lee County Sheriff Deputy.   Now, he expresses his love for beer right here in the Millennial brewhouse and crafts recipes that are true to style with his own unique flavor.   We are so excited to have him take the helm and lead us into the next evolution of our beverage offerings. Millennial Customer Experience Team - Our customer experience team leads the front of house operation with ease and skill.   Erin Williams applies her leadership experience in education and many years of hospitality experience to deftly maneuver the variety of service and event management elements of Millennial Brewing.  Stephanie Bilske brings to bear her vast amount of management and service experience within the craft beer industry every day delivering the absolute best customer experience and contributing to the never ending innovation with events, beer naming and more that is required to keep Millennial at the forefront of the craft beer scene in SWFL. Erin and Stephanie lead our front of house team of dynamic customer service dynamos and ensure every customer has a great time here at Millennial! Contact us: by phone (239)-271-2255, by email info@millennialbrewing.com Parties Catering"
    },
    {
      "url": "https://www.visitfortmyers.com/listing/millennial-brewing-company/59244",
      "text": "Millennial Brewing Company | Visit Fort Myers | SW Florida Skip to main content Footer Top Home Meetings Weddings Travel Trade EN 89° Now 89° Close Islands Beaches All Beaches Alison Hagerup Beach Park Blind Pass Beach Park Boca Grande Beach Accesses Bonita Beach Park Bowditch Point Park Bowman's Beach Park San Carlos Bay - Bunche Beach Preserve Causeway Islands Park Cayo Costa State Park Crescent Beach Family Park Dog Beach Park Gasparilla Island State Park Gulfside City Beach Park Lighthouse Beach Park Little Hickory Island Park Lovers Key State Park Lynn Hall Memorial Park Tarpon Bay Beach Turner Beach Yacht Club Beach Neighborhoods All Neighborhoods Alva, Buckingham & Lehigh Acres Boca Grande & Outer Islands Bonita Springs & Estero Cape Coral Captiva Island Fort Myers Fort Myers Beach Matlacha North Fort Myers Pine Island Sanibel Island Things to Do All Things to Do Plan Your Trip Arts & Entertainment Murals Attractions Outdoor Activities & Sports Parks & Nature Paddling Trail Shopping Tours & Transportation Eat & Drink All Eat & Drink Restaurants Cafes Bars, Lounges & Clubs Breweries & Distilleries Ways to Stay All Ways to Stay Bed & Breakfast Campgrounds Condos Cottages Hotels Motels RV Parks Resorts Vacation Rentals Events All Events Arts & Culture Concerts Education Fairs & Festivals Food & Drink Nature & Outdoors Sports & Recreation Deals All Deals Digital Passes Parks, Points & Perks Sanibel Wild Mile Sun Saver Passport Search May we recommend Live Webcams Things to Do Plan Your Trip Digital Visitor Guide Quick Links Overview Overview Gallery Gallery Share Share Visit Website Millennial Brewing Company Multi-tasking, connected, and tech-savvy are all terms used to describe the quintessential Millennial. The founders wish to make an impact on the world through creating a one-of-a-kind community of beer lovers.  They pair passion with a strong work ethic and technology to create a singular craft beer and member experience. 26.642913, -81.864357 239-271-2255 1811 Royal Palm Ave Fort Myers , FL 33901 United States info@millennialbrewing.com View Website Key Features Where to Eat Breweries & Distilleries Bars, Lounges & Clubs Gallery 26.642913, -81.864357 239-271-2255 1811 Royal Palm Ave Fort Myers , FL 33901 United States info@millennialbrewing.com View Website Key Features Where to Eat Breweries & Distilleries Bars, Lounges & Clubs What's Nearby Farmer's Market Restaurant Serving South West Florida since 1952, the Farmers Market Restaurant is the longest operating restaurant in Lee County... Beacon Social Drinkery Located on the 12th floor of Luminary Hotel & Co., Beacon Social Drinkery lights up downtown Fort Myers with a dizzying... The Banyan Hotel - Tapestry Collection by Hilton - Downtown Fort Myers As the newly renovated boutique hotel in the neighborhood, we are passionate about delivering personalized service and... Footer Top Home Meetings Weddings Travel Trade Contact Local: (239) 338-3500 Toll-Free: (800) 237-6444 2201 Second Street Suite 600 Fort Myers, Florida 33901 Footer Menu 2 For Visitors Plan Your Trip Digital Visitor Guide Beach Conditions Footer Menu 3 For Businesses About VCB ADA Notice Film Permit Requests Industry Portal Login Newsletter Sign Up Sign up for our enewsletter to receive information on the greater Fort Myers area. Footer Bottom Menu Cookie Preferences Privacy Policy Tourism Accessibility Guide © 2025 Lee County Visitor & Convention Bureau"
    }
  ]
}