{
  "fuentes": [
    {
      "url": "https://minibarsystems.com/contact/",
      "email": "msasia@singnet.com.sg"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.themeridianmiami.com/miami-beach-restaurant/",
      "email": "reservations@kasa.com"
    },
    {
      "url": "https://worldredeye.com/2018/04/qa-not-your-average-bar-minibar/",
      "email": "logo@2x.png"
    },
    {
      "url": "https://worldredeye.com/2018/04/qa-not-your-average-bar-minibar/",
      "email": "logo@3x.png"
    },
    {
      "url": "https://worldredeye.com/2018/04/qa-not-your-average-bar-minibar/",
      "email": "logo@4x.png"
    },
    {
      "url": "https://www.allmusic.com/artist/minibar-mn0000493974",
      "email": "name@domain.com"
    },
    {
      "url": "https://mbhotel.com/",
      "email": "information@mbhotel.com"
    }
  ],
  "mails": [
    "info@reception-plus.de",
    "information@mbhotel.com",
    "logo@2x.png",
    "logo@3x.png",
    "logo@4x.png",
    "msasia@singnet.com.sg",
    "name@domain.com",
    "reservations@kasa.com"
  ],
  "nombre_sitio": "minibarmiami.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://minibarsystems.com/contact/",
      "text": "Contact | Minibar Systems Home Company History References We Care Products Minibars SmartCube Primo SmartTrays Software SmartCube MOS Software Minibar MCS Software Fridges SmartFridge SmartFridge Eco GuestFridge Accessories Restocking Cart Safes SmartBox NG SmartBox SmartSnax SmartSnax Careers Contact Contact Distributors Language Select Page Contact Us Your questions and comments are important to us. Reach us by phone or email or send a message with the form below. If you need to contact a local representative, please use the email address provided in the list on this page. Send us a Message Company Name Address City/Region State/Province Country First Name Last Name Email Address Phone Number Message 15 + 2 = Send Message Headquarters Minibar Systems 7340 Westmore Road Rockville, MD 20850 tel 301-354-5055 fax 301-309-1115 info@minibarsystems.com Follow Follow Follow Follow Offices and Headquarters Headquarters – United States tel +1 301 309 1100 fax +1 301 309 1115 info@minibarsystems.com Asia tel +65 6741 3373 fax +65 6741 6303 msasia@singnet.com.sg Canada tel 905-487-0620 fax 905-487-0622 info@minibarsystems.com Finland & Baltics tel +358 9 250 4155 fax +358 9 250 4277 minibar.finland@minibar.ch France & Benelux tel +33 7 60 54 13 03 fax +33 1 47 49 61 62 minibar.france@minibar.ch Germany tel +49 2271 993 120 fax +49 2271 993 119 minibar.germany@minibar.ch Mexico tel +52 442 832 6353 fax +52 442 832 6353 info@minibarmex.com.mx Nordic & Scandinavia tel +47 97 95 94 84 fax +47 55 31 10 85 minibar.norge@minibar.ch Spain & Portugal tel +34 902 10 20 50 fax +34 913 04 91 92 minibar.spain@minibar.ch Switzerland & Austria tel +41 41 767 23 00 fax +41 41 767 23 23 info@ch.minibar.ch United Kingdom & Ireland tel +44 1628 820 800 fax +44 1628 820 801 info@minibaruk.co.uk Distributors List Click Here MINIBARS SmartCube Primo SmartTrays FRIDGES SmartFridge SmartFridge Eco GuestFridge SAFES SmartBox & NG SOFTWARE MoS S3 MCS ACCESSORIES Restock SMARTSNAX SmartSnax MINIBAR SYSTEMS 7340 Westmore Road Rockville, MD 20850 P 301-354-5055 F 301-309-1115 info@minibarsystems.com Follow Follow Follow Follow © Minibar Systems 2025 | Site by CWD English"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * name Datenschutz First E-Mail * Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.themeridianmiami.com/miami-beach-restaurant/",
      "text": "Miami Beach Fl Restaurant & Bar - The Meridian Hotel Skip to main content BOOK NOW Hit enter to search or ESC to close Close Search Menu Rooms Experiences Bachelorette Cruises Other Experiences Eat & Drink Contact Us FAQ Groups Book Now Rooms Experiences Bachelorette Cruises Other Experiences Eat & Drink Contact Us FAQ Groups Book Now Amazing Culinary Experiences Eat & Drink Four great food and beverage selections for you to enjoy affordable and high-quality guest experiences. Minibar Tucked inside the Meridian Hotel, Minibar is Miami Beach’s hidden gem for cocktail lovers. We serve strong drinks, curated playlists, and good energy every day from 4 PM to 2 AM. Join us for Happy Hour daily from 4 to 8 PM and DJs on the weekends setting the vibe. Whether you’re a local or just passing through, it only takes one round to feel like a regular. New Times Miami 2024 Winner – Best Bar For private and semi-private events please contact us today Hours of Operation: Every day from 4pm to 2am 418 Meridian Ave. Miami Beach +1 (305) 697-7769 Under The Palm Tree Cozy, unexpected and most importantly healing. Our mission is to provide delicious food that can be kind to our planet and our bodies. We make every effort to provide a cozy customer service and healthy food with a focus on sustainability and kindness. Our website is under construction but please visit our sister restaurant, Under The Mango Tree for a better feel of who we are and how we can serve you! Highly Recommended Walking Distance Culinary Experiences Orilla Orilla Bar & Grill is a chef driven modern steak house. Enjoy our cuisine offering meats cooked on the charcoal oven grill. Hours of Operation - Mon-Sat: 6pm-11pm, Sat: 12.30-11pm 426 Euclid Ave, Miami Beach +1 (305) 397-8806 VISIT WEBSITE ROOMS EXPERIENCES EAT & DRINK FAQ GET ON THE VIP LIST I have read and accepted the privacy policy. Yes, I would like to receive emails with exclusive offers. 418 Meridian Ave, Miami Beach, FL 33139 +1 (650) 451 3444 reservations@kasa.com © 2025 The Meridian Hotel. Crafted by yours truly, The Brand Collective /**"
    },
    {
      "url": "https://worldredeye.com/2018/04/qa-not-your-average-bar-minibar/",
      "text": "Q&A: #NotYourAverageMinibar - World Red Eye | World Red Eye Categories Featured News Video About Categories Nightlife Celebrity News Food Fashion Music Lifestyle Culture Tech Featured News guide Video Philosophy Client Log In search client Client login facebook Twitter Instagram Newsletter 0-458-21 0-458-22 0-458-62482 0-458-11 0-458-46935 0-458-181747 Celebrity See all Celebrity DJ Khaled at LIV Draft Kings x David Grutman Welcome to NYC Tennis Dinner at Crane Club Restaurant Young Thug, Lil Baby, Quavo, G HERBO, Eliantte, & Metro Boomin at LIVONSUNDAY Marc Anthony, Kyle Forgeard, Loud Luxury, & Mednas at LIV Playboi Carti & DJ Swamp Izzo at LIV Nightlife See all Nightlife Kiki On The River Sundays Chance the Rapper at LIVONSUNDAY SIDEPIECE & OMNOM at LIV MYNT Fridays Mayami Fridays Editorials See all Editorials Q&A: Cooling the Dance Floor: How Kryogenifex Turned Nightlife Into a Frozen Fantasy Q&A: A Century at the Table: Joe’s Stone Crab and the Soul of Miami Beach Las’ Lap Miami Brings Carnival Energy and Caribbean Soul to South Beach Delano Miami Beach Set for Grand Reopening, Honoring Its Iconic Legacy Q&A: HOWL’s Noble Nomad: A Love Letter to Personal Adornment News See all News WRE News: RIVANI Acquires $37M Lincoln Theatre, Anchored by H&M Fueling Lincoln Road Revival WRE News: Terra Joins JDS in 330-Foot South Beach Luxury Tower Project WRE News: Trump National Doral to Host New Miami Championship as PGA Tour Returns in 2026 WRE News: Gables Estates Tops Beverly Hills as America’s Priciest Neighborhood WRE News: Ziggurat & Chèvre Unite to Launch Culinary-Infused Sales Center in Coconut Grove Food See all Food EATZ by Chris Valdes with Loews Miami Beach Hotel WRE Films: The Pasta Maestro Has Arrived at Mother Wolf Miami WRE Films: All the Sushi Your Heart Desires at Mayami Wynwood WRE Films: Miso Marinated Grilled Bavette Steak at Elastika Miami WRE Films: It’s Time for a Refuel at Yann Couvreur Café Real Estate See all Real Estate The Perrin Groundbreaking Ceremony Bespoke Beachfront Living at The Ritz-Carlton, South Beach Partners Group Miami Office Ribbon Cutting Ceremony Crypto Real Estate Fireside Chat at The Moore Diving Into The Raleigh, A Rosewood Hotel and Residences 0-458-45806 Weekend Guide See all Weekend Guide WRE Weekend Guide November 14 – 16, 2014 WRE Weekend Guide October 24 – 26, 2014 WRE Weekend Guide October 10–12, 2014 WRE Weekend Guide October 3–5, 2014 WRE Weekend Guide September 26–28, 2014 0-458-47703 221523-458-1474193 221523-458-1474196 221523-458-1474199 221523-458-1474203 1474207-458-1456541 Events Global Champions Arabians Tour 2025 Cleeks Golf Club at LIV Golf Miami 2025 Formula 1 2025 Gordon Ramsay Hell’s Kitchen Bayside Marketplace 0-458-38 See all Video WRE Films: Island Queen Cruises & Tours at Bayside Marketplace WRE Films: Pasta at Mother Wolf Miami WRE Films: Espresso Martini at Jay’s Fort Lauderdale WRE Films: The Ceviche de Corvina & Piña Querida Cocktail at Mayami Wynwood WRE Films: Reliving Palm Tree Club Miami’s Opening Season WRE Films: Cuban Fritas, Croquetas, Empanadas, Café, & More at Vegan Cuban Cuisine Q&A: #NotYourAverageMinibar Photography by Seth Browarnik , Ryan Troy on April 27th, 2018 in Editorials , Lifestyle WRE Films: #NotYourAverageMinibar from World Red Eye Films on Vimeo . Miami Beach, FL – April 25, 2018 – Miami has a new bar in town, but minibar is not your average bar. Minibar provides fresh, mid-century lounge with a sexy, contemporary twist located in the quaint South of Fifth area located at Urbanica The Meridian Hotel . Partners Philippe “Flip” Falca of minibar, Charlie Porchetto, and Diego Colmenero of Urbanica The Meridian Hotel, partnered to open a cozy and sexy little bar; something that is so unique in the South of Fifth community. The partnership was a match made in heaven, combining the cool and modern feel of the Urbancia mixed with minibar’s low key and intimate vibe. Urbanica provides a new concept in the boutique hotel experience that speaks to a sophisticated, global audience for vacationing like a local. It’s more than a cool hotel room, with numerous public spaces located inside the hotel its a place where everyone can gather, hang out, providing a sense of community. Falca, who took full creative direction of minibar, filled the gap in the South of Fifth neighborhood to design the perfect spot for those looking to just get a good drink, maybe a little mystery, romance, or some real good feels. Inside, it’s gem-like colors and jungle-like atmosphere has been described as a “Parisian speakeasy in Bali.” The outside patio has a very comfortable Art Deco look, a beautiful setting to enjoy cocktails under the stars. World Red Eye brings you inside minibar, a classic throwback to a new era. As Miamians are already buzzing about the hottest new bar, World Red Eye captured it all and stopped by for a drink (or two, or three) with owner Philippe Falca to get the latest on what minibar brings to Miami. Charlie Porchetto, Philippe Falca, & Diego Colmenero WRE: What was the inspiration for opening minibar? Did some of your favorite spots in Miami influence the style of minibar? PF: The location for me was everything. Minibar is located in Urbanica The Meridian Hotel located at 418 Meridian Ave. I love the south of fifth neighborhood and the community. A cozy lil bar only seemed right. WRE: How did you team up with Urbanica’s Charlie & Diego? Where is the symmetry in the vision for minibar? PF: Originally Charlie and Diego brought me in to consult for a few months. The dynamic between us clicked, so we decided to partner up to open our first bar. Philippe Falca The DNA for minibar is like the inspiration, it’s made up a lot from its location. It’s a locals bar. A place where the employees know your name and your drink preference. Philippe Falca WRE: Being a South of 5th local; how do envision spaces like minibar to potentially expand the Miami Beach experience for locals and tourists? PF: I would say say minibar is really conveniently located and not to mention it’s accompanied by a beautiful boutique hotel, Urbanica the Meridian Hotel. WRE: How would you describe the DNA of minibar? PF: The DNA for minibar is like the inspiration, it’s made up a lot from its location. It’s a locals bar. A place where the employees know your name and your drink preference. WRE: What are your hopes and expectations for minibar in the future? Do you plan to open more locations? PF: I can only hope the local community embraces what we have created here for them to enjoy. Yes, in the future we plan to open more locations. WRE: What three words would you use to describe minibar? PF: The three words I use to describe minibar are original, tropical, and dope. WRE: What kind of events/programming can locals expect at minibar? PF: I don’t want to give much away, what we’re creating is a experience. Good food, good music, and good cocktails. A classic recipe for a good time! People will have to come see for themselves. I will tell you we’re making a late night members only key card that will allow you to access the bar from 3-5 am. Only if you’re lucky enough to get one. WRE: Who designed minibar and what was the vision behind it? PF: One of my conditions as partner, was to have full control of concept and design for minibar. Growing up, my mom was an interior decorator so I spent a lot of times in showrooms; I think now in my later years it rubbed off. I have a passion for creating and the bar was designed as a place that I would go to for a drink. WRE: What’s the missing piece from South Beach nightlife now that minibar will fill? PF: You had to ask about the clubs didn’t you! Ok well I’ll be as nice as possible. The people clubbing on South Beach has changed throughout the years. I’d like to say that we’re getting old and we outgrew clubbing but I remember seeing 30 and 40 yr olds partying back in the day. Minibar is the perfect spot that will fill the void for people that still wanna go out. WRE: In Miami, there’s so many bars to choose from, how does minibar differ from other local bars? PF: Minibar is more intimate than your average bar. We’re open from 5pm to 5am on the weekends so the bar goes through a lot of different vibes. You can go in for a mellow drink but like any good bar minibar has the potential to turn up. WRE: Can you share with our readers more about the unique food and beverage minibar offers? PF: The food and the cocktails are really a testament of my experienced and talented team. In the kitchen, world renowned Chef Fernando Trocca provides the delicious bites. Behind the cocktail menu, David Cedeno, a favorite amongst the mixers and shakers of the bar industry created a unique cocktail menu to keep the party alive. Rest assure, you won’t be disappointed. Chicken Tostada Roasted Eggplant Shrimp Ceviche Zucchini Carpaccio Shrimp Causa WRE: Does minibar have a signature drink? FF: We have a few cocktails that include a mini bottle as a floater. For example my favorite is the “South Beach Z-pack” it’s a mini bottle of altos tequila with ginger, honey, lemon grapefruit juice and a hint of mezcal. Simply delicious. Mini Mary Birds in the Trap Pucker Up DIY Negroni Philippe Falca Minibar is more intimate than your average bar… you can go in for a mellow drink but like any good bar has the potential to turn up. Philippe Falca Nicole Lodl, Diana Arreci, & Patti Stocker Seth Browarnik, Tommy Pooch,Mark Lehmkuhl, & Josh Wagner Philippe Falca, John Cicero, Josh Wagner, & Dan Binkiewicz Steven Rojas Chelsea Olson & Heather Lilleston Jake Kovacs & Carley Johnston Nicole Gongee & Annie Gustafsson Jake Kovacs, Carley Johnston, Denio Madera, Nicole Gongee, Philippe Falca, Annie Gustafsson, Tony Merenda, Nicole Lodl, Diana Arreci, & Patti Stocker GALLERY SLIDER Annie Gustafsson & Patti Stocker Aliette Weill, Valentina Parada, & Grissell Tudisco Dan Hetchkopf, Ben Brand, & David Puyanic Denio Madera & Bianca Coletti Tony Merenda & Paulo Cardoso Misha Ezratti & Marina Slovina Roy Alpert & Steven Rojas Tony Merenda, Jake Kovacs, & Denio Madera Seth Browarnik & Tommy Pooch Rene Pereda, Mark Gamez, & Sean Drake Jake Kovacs, Carley Johnston, Denio Madera, Nicole Gongee, Philippe Falca, Annie Gustafsson, Tony Merenda, Nicole Lodl, Diana Arreci, & Patti Stocker Videos Recommended Posts News WRE News: RIVANI Acquires $37M Lincoln Theatre, Anchored by H&M Fueling Lincoln Road Revival Editorials Q&A: Cooling the Dance Floor: How Kryogenifex Turned Nightlife Into a Frozen Fantasy News WRE News: Terra Joins JDS in 330-Foot South Beach Luxury Tower Project"
    },
    {
      "url": "https://www.allmusic.com/artist/minibar-mn0000493974",
      "text": "Minibar Songs, Albums, Reviews, Bio & More | A... | AllMusic AllMusic relies heavily on JavaScript. Please enable JavaScript in your browser to use the site fully. New Releases Discover Genres Moods Themes Blues Classical Country Electronic Folk International Pop/Rock Rap R&B Jazz Latin All Genres Aggressive Bittersweet Druggy Energetic Happy Hypnotic Romantic Sad Sentimental Sexy Trippy All Moods Background Music Celebration Cool & Cocky Drinking Hanging Out In Love Rainy Day Relaxation Road Trip Romantic Evening Sex All Themes Articles AllMusic Recommends My Profile Advanced Search Remove Ads New Releases Discover Articles Recommendations Trending Artists Staff Picks Year In Review Advanced Search Remove Ads Credit: Matthew Welch Minibar Follow Artist + While Minibar comes from the U.K., the quartet plays a brand of cosmopolitan roots rock (see Wallflowers and Counting Crows) that is distinctly American. Appropriately, the group relocated to California… Read Full Biography STREAM OR BUY: Active 2000s Genre Pop/Rock Styles Roots Rock , Alternative Pop/Rock , Alternative/Indie Rock , American Trad Rock , Britpop Group Members Malcolm Cross , Sid Jordan , Simon Petty , Tim Walker Set Your\n                        Streaming\n                        Service Suggest Streaming Links To Set Your Preferred Streaming Service, Log In to Your\n                            AllMusic\n                            Account To Submit Streaming Links, Log In to Your AllMusic Account Log In Don't have an Account? Related Artists All Related Artists Blue Rodeo The Charlatans Billy Bragg The Jayhawks Wilco Luna The Wallflowers Biography Discography Songs Credits Related Submit Corrections Credit: Matthew Welch Follow Artist + Biography Discography Songs Credits Related Artists Our Properties AllMusic AllMovie SideReel Site Overview New Releases Discover Articles Recommendations About What is AllMusic? Copyright Policy Privacy Policy Terms of Service Advertise Questions and Contact FAQ Feedback Your AllMusic Account My Profile Account Settings Remove Ads Subscribe to AllMusic Follow Us Facebook Bluesky Threads Tumblr RSS Sign Up For Our Weekly New Releases Newsletter Thank You for subscribing to the AllMusic\n                                New Releases Newsletter . ©2025 ALLMUSIC, NETAKTION LLC - ALL RIGHTS RESERVED"
    },
    {
      "url": "https://mbhotel.com/",
      "text": "MB Hotel | 6525 Collins Avenue Miami Beach, FL 33141 STAY Services Location Gallery Contact Us STAY Services Location Gallery Contact Us Book Now TEXT Hotel Policies Hotel Services Cafe & Bar E-Brochure ROOMS SUITES PROMOTIONS Beachfront Bliss in Miami Beach experience modern luxury and elegance Beachfront Bliss in Miami Beach experience modern luxury and elegance Beachfront Bliss in Miami Beach experience modern luxury and elegance WELCOME TO MB HOTEL A Beachfront Boutique Hotel A Trademark Collection by Wyndham hotel, formerly known as The Mimosa Miami Beach. Our intimate settings, stylish modern décor, and attentive staff open the door to welcome your stay away from home. Our international clientele represents Miami culture. The tranquil and casual atmosphere offers the perfect setting for a relaxing and enjoyable stay. The newly remodeled MB Hotel provides comfortable rooms with modern décor appointed with climate control, cable TV, in-room safe, and many other conveniences. The hotel is located only 5 miles from the Art Deco district and only 2.9 miles from upscale Bal Harbour shopping. All rooms at MB are non-smoking and feature complimentary Wireless Internet Access. The swimming pool and surrounding pool deck are flank by palm trees and overlooks the Atlantic Ocean and its white sand beach. Refreshing beverages and light snacks are at your call throughout the day. FEATURED SPECIALS & AMENITIES WEEKLY RATE SPECIALS Stay 7 consecutive nights and save 20% Bed and Breakfast Package Lock in a discounted breakfast buffet overlooking the Atlantic Ocean. GROUP TRAVEL Book your wedding party, family reunion, sports team, or other group travel at MB Hotel. ROOMS & SUITES Our intimate settings, stylish modern décor, and attentive staff open the door to welcome your stay away from home. Bringing the Beach to You Walk straight out to the beach and let us tend to you with our full beach service. MIAMI CULTURE The tranquil and casual atmosphere offers the perfect setting for a relaxing and enjoyable stay. CAFE & BAR Let us spoil you with our refreshing mimosas after a day in the hot Miami sun. Pool & Bar Surrounded and flanked by palm trees overlooking the Atlantic Ocean. Refreshing beverages and light snacks are at your call throughout the day. MIAMI BEACH HOTSPOT The tranquil and casual atmosphere offers the perfect setting for a relaxing and enjoyable stay. MIAMI BEACH HOT SPOT ACCOMMODATIONS ← ROOMS SUITES → 2 Queen or 1 KING Deluxe Newly Constructed Rooms on the 4th Floor. Smart, Stylish, Sophisticated, and Affordable! Lavishly styled and equipped with flat screen television, personal safe, espresso coffee machine, working desk, tile floors and bathrooms, duvet comforters, in-room safe, beverage cooler, iron/ironing board upon request, hairdryer,and flat screen TV. KING STANDARD or 2 Double Beds At 250 sq ft, the Queen Deluxe room is lavishly styled and equipped with a 32 in flat screen television, personal safe, mini bar, and queen-sized bed. The bathroom features a glass enclosed standing shower. City View Rooms with Balcony Tile floors and bathrooms bathtub overlooking the ocean Working desk Pure natural bathroom amenities by Bath & Body Works The Estates Suite offers city skyline views. Enjoy the large scale wraparound balcony along, the city skyline. Equipped with a kitchen, pull-out couch in the living room with 1 ½ bathrooms, with a rainfall shower head, Flat screen TV, personal safe, and minibar. Oceanfront Rooms with Balcony Tile floors and bathrooms bathtub overlooking the ocean Working desk Pure natural bathroom amenities by Bath & Body Works The Estates Suite offers city skyline views. Enjoy the large scale wraparound balcony along, the city skyline. Equipped with a kitchen, pull-out couch in the living room with 1 ½ bathrooms, with a rainfall shower head, Flat screen TV, personal safe, and minibar. Superior Room with Jacuzzi Tile floors and bathrooms, Modern décorDuvet comforters. Centrally controlled A/C. Pure natural bathroom amenities by Bath and Body Works and Terry Robes (2). AM/FM radio and alarm clock, In-room safe, Beverage Cooler, Hairdryer, Iron/ironing board upon request. ALL ROOMS ARE NON-SMOKING BOOK NOW WHAT’S NEARBY? FIND SOMETHING INTERESTING! SHOPPING RESTAURANTS & BARS ATTRACTIONS NIGHTLIFE ARTS & CULTURE OUTDOORS ENTERTAINMENT Cafe & Bar New Rooftop Lounge Everything at your fingertips… Settle in with on-site bars, beach service and a pool. Stay in Touch . HOME STAY SERVICES LOCATION GALLERY POLICIES FREQUENTLY ASKED QUESTIONS E-BROCHURE CONTACT US Follow Follow Follow 6525 Collins Avenue, Miami Beach, Florida 33141 1-305-376-0359 | information@mbhotel.com | COPYRIGHT© 2022. ALL RIGHTS RESERVED. BOOK NOW Facebook Twitter Instagram RSS"
    }
  ]
}