{
  "fuentes": [
    {
      "url": "https://vickisveggies.ca/",
      "email": "logo-flat_180x@2x.png"
    },
    {
      "url": "https://www.giftly.com/gift-card/miss-vickis-on-the-river-holiday",
      "email": "corporate@giftly.com"
    },
    {
      "url": "https://www.giftly.com/gift-card/miss-vickis-on-the-river-holiday",
      "email": "merchants@giftly.com"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://ca.news.yahoo.com/miss-vickies-real-woman-potato-chips-tiktok-162713493.html",
      "email": "u003ebillhimself@yahoo.com"
    }
  ],
  "mails": [
    "corporate@giftly.com",
    "info@communityaccessnaperville.org",
    "logo-flat_180x@2x.png",
    "merchants@giftly.com",
    "u003ebillhimself@yahoo.com"
  ],
  "nombre_sitio": "missvickisontheriver.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://vickisveggies.ca/",
      "text": "Vicki's Veggies PEC – Vicki's Veggies PEC Home Seedlings Expand submenu Seedlings Collapse submenu Seedlings Vicki's Party 6 Pack Red Tomatoes Pink-Purple Tomatoes White-Yellow-Orange Tomatoes Brown, Black, Blue Tomatoes Green Tomatoes Multi-Coloured Other Sweet Peppers Hot Peppers Herbs Eggplant Zinnias Calendar Contact Seedlings Calendar Roadside Stand Search Welcome to Vicki's Veggies brand new online store! Site navigation Home Seedlings Vicki's Party 6 Pack Red Tomatoes Pink-Purple Tomatoes White-Yellow-Orange Tomatoes Brown, Black, Blue Tomatoes Green Tomatoes Multi-Coloured Other Sweet Peppers Hot Peppers Herbs Eggplant Zinnias Calendar Contact Search Cart Cart Your cart Close Cart A family farm run by Vicki Emlaw in Prince Edward County Buy Your 2025 Seedlings Today! Shop now 2025 Seedling Sale Vicki's Annual Seedling Sale coming May 17 & 18, 2025! 10-4 each day. Seasonal Veggies! Seasonal veggies available May-October specializing in heirloom tomatoes Tours of the garden available by appointment - contact Vicki by Phone/Text: 613-848-7791 Local bottled lemonade by Lemonade Dave available every day - www.lemonadedave.ca 2024 Vicki's Veggies Calendar The 2024 edition of Vicki's famous calendar is here! Includes all the key dates you need to remember plus some really awesome photos! Click here to buy now for just $25! Seed Saving 2024 Here are  some examples from this year! Vicki's Seed Saver How-To ROADSIDE STAND The Roadside Stand will open in May for the season! Drop by Vicki's roadside stand/store at 81 Morrison Point road to pick up seasonal vegetables, leafy greens, and all kinds of goodness fresh from the farm.  You can even pick up local bottled lemonade from Lemonade Dave. Make it part of your adventure as you tour around PEC! WHO IS VICKI? Vicki Emlaw is an eight generation family farmer from Milford, Ontario. She originally started Vicki's Veggie's back in 2001 and continues the family tradition to this day. Subscribe to our newsletter Promotions, new products and sales. Directly to your inbox. Sign up to our mailing list Subscribe CONTACT VICKI Get in touch with Vicki to learn more about the farm, order seedlings, or buy some veggies! Phone/Text: 613-848-7791 Email: vickiemlaw@gmail.com Location: 81 Morrison Point Rd., Black River, Ontario, K0K 2P0 Seedlings Calendar Roadside Stand Search Facebook Instagram Country/region Canada (CAD $) Afghanistan (CAD $) Åland Islands (CAD $) Albania (CAD $) Algeria (CAD $) Andorra (CAD $) Angola (CAD $) Anguilla (CAD $) Antigua & Barbuda (CAD $) Argentina (CAD $) Armenia (CAD $) Aruba (CAD $) Ascension Island (CAD $) Australia (CAD $) Austria (CAD $) Azerbaijan (CAD $) Bahamas (CAD $) Bahrain (CAD $) Bangladesh (CAD $) Barbados (CAD $) Belarus (CAD $) Belgium (CAD $) Belize (CAD $) Benin (CAD $) Bermuda (CAD $) Bhutan (CAD $) Bolivia (CAD $) Bosnia & Herzegovina (CAD $) Botswana (CAD $) Brazil (CAD $) British Indian Ocean Territory (CAD $) British Virgin Islands (CAD $) Brunei (CAD $) Bulgaria (CAD $) Burkina Faso (CAD $) Burundi (CAD $) Cambodia (CAD $) Cameroon (CAD $) Canada (CAD $) Cape Verde (CAD $) Caribbean Netherlands (CAD $) Cayman Islands (CAD $) Central African Republic (CAD $) Chad (CAD $) Chile (CAD $) China (CAD $) Christmas Island (CAD $) Cocos (Keeling) Islands (CAD $) Colombia (CAD $) Comoros (CAD $) Congo - Brazzaville (CAD $) Congo - Kinshasa (CAD $) Cook Islands (CAD $) Costa Rica (CAD $) Côte d’Ivoire (CAD $) Croatia (CAD $) Curaçao (CAD $) Cyprus (CAD $) Czechia (CAD $) Denmark (CAD $) Djibouti (CAD $) Dominica (CAD $) Dominican Republic (CAD $) Ecuador (CAD $) Egypt (CAD $) El Salvador (CAD $) Equatorial Guinea (CAD $) Eritrea (CAD $) Estonia (CAD $) Eswatini (CAD $) Ethiopia (CAD $) Falkland Islands (CAD $) Faroe Islands (CAD $) Fiji (CAD $) Finland (CAD $) France (CAD $) French Guiana (CAD $) French Polynesia (CAD $) French Southern Territories (CAD $) Gabon (CAD $) Gambia (CAD $) Georgia (CAD $) Germany (CAD $) Ghana (CAD $) Gibraltar (CAD $) Greece (CAD $) Greenland (CAD $) Grenada (CAD $) Guadeloupe (CAD $) Guatemala (CAD $) Guernsey (CAD $) Guinea (CAD $) Guinea-Bissau (CAD $) Guyana (CAD $) Haiti (CAD $) Honduras (CAD $) Hong Kong SAR (CAD $) Hungary (CAD $) Iceland (CAD $) India (CAD $) Indonesia (CAD $) Iraq (CAD $) Ireland (CAD $) Isle of Man (CAD $) Israel (CAD $) Italy (CAD $) Jamaica (CAD $) Japan (CAD $) Jersey (CAD $) Jordan (CAD $) Kazakhstan (CAD $) Kenya (CAD $) Kiribati (CAD $) Kosovo (CAD $) Kuwait (CAD $) Kyrgyzstan (CAD $) Laos (CAD $) Latvia (CAD $) Lebanon (CAD $) Lesotho (CAD $) Liberia (CAD $) Libya (CAD $) Liechtenstein (CAD $) Lithuania (CAD $) Luxembourg (CAD $) Macao SAR (CAD $) Madagascar (CAD $) Malawi (CAD $) Malaysia (CAD $) Maldives (CAD $) Mali (CAD $) Malta (CAD $) Martinique (CAD $) Mauritania (CAD $) Mauritius (CAD $) Mayotte (CAD $) Mexico (CAD $) Moldova (CAD $) Monaco (CAD $) Mongolia (CAD $) Montenegro (CAD $) Montserrat (CAD $) Morocco (CAD $) Mozambique (CAD $) Myanmar (Burma) (CAD $) Namibia (CAD $) Nauru (CAD $) Nepal (CAD $) Netherlands (CAD $) New Caledonia (CAD $) New Zealand (CAD $) Nicaragua (CAD $) Niger (CAD $) Nigeria (CAD $) Niue (CAD $) Norfolk Island (CAD $) North Macedonia (CAD $) Norway (CAD $) Oman (CAD $) Pakistan (CAD $) Palestinian Territories (CAD $) Panama (CAD $) Papua New Guinea (CAD $) Paraguay (CAD $) Peru (CAD $) Philippines (CAD $) Pitcairn Islands (CAD $) Poland (CAD $) Portugal (CAD $) Qatar (CAD $) Réunion (CAD $) Romania (CAD $) Russia (CAD $) Rwanda (CAD $) Samoa (CAD $) San Marino (CAD $) São Tomé & Príncipe (CAD $) Saudi Arabia (CAD $) Senegal (CAD $) Serbia (CAD $) Seychelles (CAD $) Sierra Leone (CAD $) Singapore (CAD $) Sint Maarten (CAD $) Slovakia (CAD $) Slovenia (CAD $) Solomon Islands (CAD $) Somalia (CAD $) South Africa (CAD $) South Georgia & South Sandwich Islands (CAD $) South Korea (CAD $) South Sudan (CAD $) Spain (CAD $) Sri Lanka (CAD $) St. Barthélemy (CAD $) St. Helena (CAD $) St. Kitts & Nevis (CAD $) St. Lucia (CAD $) St. Martin (CAD $) St. Pierre & Miquelon (CAD $) St. Vincent & Grenadines (CAD $) Sudan (CAD $) Suriname (CAD $) Svalbard & Jan Mayen (CAD $) Sweden (CAD $) Switzerland (CAD $) Taiwan (CAD $) Tajikistan (CAD $) Tanzania (CAD $) Thailand (CAD $) Timor-Leste (CAD $) Togo (CAD $) Tokelau (CAD $) Tonga (CAD $) Trinidad & Tobago (CAD $) Tristan da Cunha (CAD $) Tunisia (CAD $) Türkiye (CAD $) Turkmenistan (CAD $) Turks & Caicos Islands (CAD $) Tuvalu (CAD $) U.S. Outlying Islands (CAD $) Uganda (CAD $) Ukraine (CAD $) United Arab Emirates (CAD $) United Kingdom (CAD $) United States (CAD $) Uruguay (CAD $) Uzbekistan (CAD $) Vanuatu (CAD $) Vatican City (CAD $) Venezuela (CAD $) Vietnam (CAD $) Wallis & Futuna (CAD $) Western Sahara (CAD $) Yemen (CAD $) Zambia (CAD $) Zimbabwe (CAD $) © 2025, Vicki's Veggies PEC Powered by Shopify Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa Search Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection. Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device"
    },
    {
      "url": "https://www.giftly.com/gift-card/miss-vickis-on-the-river-holiday",
      "text": "Miss Vicki's On the River Gift & Greeting Cards - Email, Text or Print - 1029 Baillies Bluff Rd, Holiday, FL Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Restaurants Travel Spa & Beauty Activities Shopping Universal Brands Top Cities Multi-Place Corporate Gifts Gift Cards Holiday Restaurants Miss Vicki's On the River Miss Vicki's On the River Gift Card Miss Vicki's On the River Giftly A beautiful gift card alternative for Miss Vicki's On the River Miss Vicki's On the River 100% satisfaction guarantee Gift Amount $25 $50 $75 $100 $250 $500 $1000 Other Gift Design Continue 100% satisfaction guarantee Enter an amount between $5 and $1,000 Confirm Amount Miss Vicki's On the River (253) (727) 940-7237 Categories Bars, American, Seafood Location 1029 Baillies Bluff Rd, Holiday, FL Gift Tips Try the crab cakes that are made fresh in-house; they are highly praised and considered fantastic by many guests. Order the blackened fish for a flavorful and well-seasoned dish that isn't charred, offering a nice crunch. Don't miss the shrimp platter—it's known for generous portions and great value. Enjoy the waterfront seating, especially under the trees for a lovely view of the sunset. For a relaxed atmosphere, visit while they have live music to enhance your dining experience. Click here to send a gift up to $1,000 with the suggestion to use it at Miss Vicki's On the River. Is this your business? Claim your business to update business information, customize this listing, and more! Learn more about Miss Vicki's On the River Price $$ Ambience Casual Miss Vicki's On the River is a delightful waterside restaurant located in Holiday, FL. Nestled near the Anclote River, the restaurant offers a serene atmosphere perfect for a casual dining experience. Ambiance : Casual vibe with outdoor seating along the water. Cuisine : Specializes in seafood, burgers, and sandwiches with a relaxed beach theme. Highlights : Beautiful sunset views, friendly service, and popular crab cakes. Guests appreciate the attentive service and the unique charm of this local gem. While the food is delicious, it's the beautiful views that really make dining at Miss Vicki's special. Whether arriving by car or boat, visitors are sure to enjoy a memorable meal in a relaxed setting. Great Alternatives Gift $100 for Angelos Pizza : Indulge in the mouthwatering flavors and authentic Italian taste of Angelos Pizza, your go-to destination for delicious pies in the charming town of Holiday. Buy a Gift & Greeting Card for La Fondita de Leo : La Fondita de Leo in Holiday serves up mouthwatering Mexican cuisine with a delightful twist, making it a go-to destination for flavorful dishes and a vibrant dining experience. Updated: September 03, 2025 The Giftly Advantage With Giftly you strike a perfect balance, the thoughtfulness of a Miss Vicki's On the River gift card with the flexibility of money. Easy to buy online. Have it delivered now or later Send it with a personalized greeting card 3 easy ways for your recipient to redeem the gift See a Sample Gift 100% satisfaction guaranteed No wasted balance Easy to customize How it works You customize a gift Gift up to $1,000 with the suggestion to use it at Miss Vicki's On the River. Delivered in a personalized greeting card. They receive the gift Gifts can be sent by email, SMS*, mail or you can print it yourself. They enjoy it! They redeem the gift on our website and choose to deposit the funds in their bank account, Paypal account or to have a Visa Gift Card mailed to them. They can spend the money at Miss Vicki's On the River or anywhere else they like! Top Related Gifts Topolino’s Terrace A Taste of Disney Magic and Elegance 1080 Esplanade Ave, Lake Buena Vista, FL 4.4 (461) • $$$ • Italian Harry's Continental Kitchens Coastal Cuisine with a Classy Touch 525 Saint Judes Dr, Longboat Key, FL 3.8 (239) • $$$ • Delis Cala Bella Shingle Creek Italian Elegance in Every Bite 9939 Universal Blvd, Orlando, FL 4.1 (114) • $$$ • Italian Maple Street Biscuit Company - St. Petersburg Biscuit Bliss in Every Bite 662 Central Ave, St. Petersburg, FL 4.4 (653) • $$ • Breakfast & Brunch Judy's Natural Foods Nourishing Health, Nourishing Family 2418 US Hwy 19, Holiday, FL 4.4 (16) • $$ • Health Markets Universal Fine Wine and Spirits Your source for fine drinks and more 1542 US Highway 19, Holiday, FL 3.5 (35) • $$ • Beer, Wine & Spirits Pizza Chef Crafted with Love, Served Fresh 3438 US Hwy 19, Holiday, FL 4.6 (50) • $ • Pizza GrindTruck Burgers that Celebrate Local Flavor 2715 US-19, Holiday, FL 5.0 (2) • Food Trucks More Nearby Businesses Americana 50s Diner 1730 US Hwy 19 N, Holiday, FL 3.3 (110) • $ • Diners Kytos Pastelitos 2636 US Hwy 19, Holiday, FL 4.3 (13) • Latin American China House 1718 US Hwy 19, Holiday, FL 2.3 (27) • $ • Chinese Roberts Smokin’ BBQ 2 3333 US Hwy 19 N, Holiday, FL 3.8 (18) • Barbeque Stonewater Grill 4422 Land O' Lakes Blvd, Land O' Lakes, FL 3.7 (270) • $$ • Bars Rum River Bar & Grill 7811 Bayview St, Port Richey, FL 3.0 (139) • $$ • Bars Ford's Garage St. Pete 200 1st Ave S, St. Petersburg, FL 4.1 (503) • $$ • Bars Gen X Tavern 103 E Jackson St, Tampa, FL 3.4 (326) • $$ • Bars Windward Bar and Grill 282 Windward Passage, Clearwater Beach, FL 4.4 (107) • $$ • Bars Ollie's on the Beach 6438 Clark St, Hudson, FL 3.6 (71) • $$ • Bars JoToro Kitchen & Tequila Bar 615 Channelside Dr, Tampa, FL 3.8 (500) • $$ • Bars Whiskey Joe's Bar & Grill - Tampa 7720 W Courtney Campbell Cswy, Tampa, FL 3.0 (2.0k) • $$ • Bars Caddy's Madeira Beach 14080 Gulf Blvd, Madeira Beach, FL 3.5 (316) • $$ • Bars Cricketers 52 7306 State Rd 52, Hudson, FL 3.3 (12) • $$ • Bars The Greeks 1542 US Hwy 19 N, Holiday, FL 4.2 (32) • Greek Inferno Pizza Lounge 1818 US-19, Holiday, FL 3.4 (18) • Italian Dino's Sub and Pizza 2526 US Hwy 19, Holiday, FL 3.5 (88) • $ • Pizza Dock's Waterfront 210 Dodecanese Blvd, Tarpon Springs, FL 3.0 (44) • $$ • Bars The Nauti Oar 7729 Grand Blvd, Port Richey, FL 4.3 (84) • $$ • Bars Bar Louie - Tampa 2223 North Westshore Blvd, Tampa, FL 3.8 (576) • $$ • Bars Frenchys Outpost Bar & Grill 466 Causeway Blvd, Dunedin, FL 4.0 (757) • $$ • Bars The Bricks 1327 E 7th Ave, Tampa, FL 4.1 (619) • $$ • Bars The Stein & Vine 827 W Bloomingdale Ave, Brandon, FL 4.5 (1.3k) • $$ • Bars Alex Place 7845 Grand Blvd, Port Richey, FL 4.4 (29) • $$ • Bars Foodys Restaurant 7512 W Hillsborough Ave, Tampa, FL 4.4 (185) • $$ • Bars La La’s Sangria Bar 203 N Meridian Ave, Tampa, FL 3.3 (68) • $$ • Bars Friendly Tavern 18121 Gulf Blvd, Redington Shores, FL 3.4 (187) • $$ • Bars Five Bucks Drinkery 247 Central Ave, St. Petersburg, FL 3.8 (388) • $$ • Bars Flowers Baking Company 4104 Louis Ave, Holiday, FL 3.7 (3) • Bakeries Villa Roma Italian Restaurant & Pizza 1818 US Hwy 19, Holiday, FL 2.6 (34) • $ • Italian Baby Hughy's Pizza and Burgers Tampa Bay 1402 Us-19 Alt, Holiday, FL 4.6 (10) • Chicken Wings Bourbon on Main 6307 Grand Blvd, New Port Richey, FL 3.2 (93) • $$ • Bars Doc B's Restaurant + Bar 2223 N Westshore Blvd, Tampa, FL 4.3 (655) • $$ • Bars Coppertail Brewing Co 2601 E 2nd Ave, Tampa, FL 4.3 (574) • $$ • Bars Acropolis Greek Taverna 3023 W Kennedy Blvd, Tampa, FL 3.5 (357) • $$ • Bars Surfside Taphouse 395 Mandalay Ave, Clearwater, FL 3.6 (423) • $$ • Bars Flying Bridge Fish Deck 5500 Gulf Blvd, St Pete Beach, FL 3.6 (80) • $$ • Bars Small Giant 1051 Water St, Tampa, FL 3.4 (106) • $$ • Bars District Tavern 116 N 12th St, Tampa, FL 3.8 (343) • $$ • Bars BellaBrava - Tampa 1015 Gramercy Ln, Tampa, FL 4.3 (311) • $$ • Bars Ulele Bar 4100 George J Bean Pkwy, Tampa, FL 3.7 (65) • $$ • Bars Doc Ford's Rum Bar and Grille 8790 Bay Pines Blvd, St. Petersburg, FL 4.0 (274) • $$ • Bars See More Help If you have questions, need help, or want to modify, resend, or cancel a gift, please see our Support Center , where you can access an array of self-service tools and our FAQ. For other questions or issues, please contact support@giftly.com . Gift Disclosure The Giftly Prepaid Gift is redeemed for money through the Giftly website. It is not issued, endorsed, or accepted by any third-party merchant (including any third-party merchant explicitly referenced in this Giftly Prepaid Gift), and is not covered by the CARD Act. Giftly Prepaid Gifts never expire and there are no inactivity fees. Please see the Giftly Prepaid Gift Agreement for the complete terms. Bars American Seafood 4.0 200-299 4 single place gcdp gift_and_greeting_card_in_title_tag Holiday, FL S M Help Help Center How Giftly works FAQ support@giftly.com Corporate Why Giftly Sign Up Log In corporate@giftly.com Merchants Customize listing Remove listing Settlement Notice FAQ merchants@giftly.com About Team Press Blog Legal Terms Privacy Gift Agreement Business categories Restaurants Travel Shopping Activities Spa & Beauty Outdoors Going Out Nationwide Brands All Business Categories Business locations Atlanta Austin Boston Chicago Dallas Denver Detroit Houston Las Vegas Los Angeles Miami Minneapolis New York Oakland Philadelphia Phoenix Portland St. Louis San Diego San Francisco San Jose Seattle Wash, DC Browse All Restaurants Seafood Steakhouses Italian French Asian Fusion Pizza Sushi Burgers Mexican Japanese All Restaurant Types Gift Ideas Multi-Place Gift Ideas The Giftly Prepaid Gift is issued by Sunrise Banks N.A., St. Paul, MN 55103, Member FDIC. * Standard data rates, fees, and charges may apply to send by text. Copyright © 2025 Giftly. All rights reserved."
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://ca.news.yahoo.com/miss-vickies-real-woman-potato-chips-tiktok-162713493.html",
      "text": "The real Miss Vickie, of potato chip fame, makes her TikTok debut Search query Search the web Skip to main News Finance More -1 Manage your account Help Add or switch accounts Sign out Search the web Advertisement Advertisement Return to Homepage The real Miss Vickie, of potato chip fame, makes her TikTok debut A Canadian snack icon, Miss Vickie, is making her debut on TikTok — much to her fans' delight. Elianna Lev Tue, October 17, 2023 at 4:27 p.m. UTC 2 min read The real Miss Vickie, of potato chip fame, makes her TikTok debut A Canadian snack icon, Miss Vickie, is making her debut on TikTok — much to her fans' delight. Vickie Kerr, the founder of Miss Vickie’s potato chips, has started an account with the intention of connecting directly with people who love her famed snacks. While Miss Vickie's chips can be found across North America and Europe, sold everywhere from Costco to Subway franchises, not much is made of its Canadian roots. Advertisement Advertisement Advertisement Advertisement Kerr initially created the product in 1987 from her farm in New Lowell, Ontario. Frustrated with the trans fats and preservatives that were found in potato chips at the time, she was compelled to create a better product for her family, using peanut oil instead. ( The products now use canola or sunflower oil.) After testing out her homemade chips at markets and food festivals, Kerr was garnered a loyal following. The family eventually sold their company to Frito-Lay in 1993, but still maintained relationships with their customers. That’s evident on Kerr’s TikTok, where she has quickly racked up over 35,000 followers and posts videos replying to fan comments. In a video posted Oct. 15, she says comments reminded her of when she first started her business and would ask her customers to tell her how they liked her product. After working at the plant, she’d go home to put her kids to bed, and then respond to some of the thousands of letters she’d receive from fans. “It was such a joy to be able to do that,” she says. “It made me have a connection with my customers, and I loved it.” Advertisement Advertisement Advertisement Advertisement Many are taking to the comment section of her two posts so far to share their enthusiasm for the products she helped create, and their special connection with the chips. “My husband hid my engagement ring in a bag of Miss Vickie’s! My fave,” one commenter wrote, to which Kerr replied, “Oh goodness how romantic!!” “When I was pregnant on my first I cried in a convenient store because they were out of Miss Vickie’s Salt and Vinegar. Sobbed,” another wrote. Another commenter wrote about how her family — “the Allan girls” — used to work for the company when it first started. “We loved having local women! I started a 4 day work week so we had 3 days to care for our families,” Kerr replied. Advertisement Advertisement Advertisement Advertisement Kerr clarifies that her account is a personal one, intended to recount stories of the history of the brand but that she no longer owns the company. Kerr isn’t the only member of her family to share the company’s history online. Her daughter, who goes by handle @littlemissCHIP-per, posts stories and memories from the company’s legacy. TikTok is a popular place for Miss Vickie’s lovers to share their enthusiasm for the snack, where they test out new flavours and try to replicate versions of their own. Advertisement Advertisement Advertisement Advertisement Advertisement About Our Ads Advertisement Advertisement Advertisement Originals Israel-Hamas War COVID-19 Canada World Business Entertainment Weather Videos Sports Science Help Share Your Feedback About Us About Our Ads Site Map Follow us on © 2025 Yahoo. All rights reserved."
    }
  ]
}