{
  "fuentes": [
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "email": "info@communityaccessnaperville.org"
    },
    {
      "url": "https://bocaratonobserver.com/locations/mizner-country-club/",
      "email": "info@bocaratonobserver.com"
    },
    {
      "url": "https://bocaratonobserver.com/locations/mizner-country-club/",
      "email": "mlalov@miznercc.org"
    },
    {
      "url": "https://www.workwithteresa.com/communities/mizner-country-club-real-estate",
      "email": "jsolowsky@cmghomeloans.com"
    },
    {
      "url": "https://www.workwithteresa.com/communities/mizner-country-club-real-estate",
      "email": "teresa@greenbergrealestategroup.com"
    },
    {
      "url": "https://www.workwithteresa.com/communities/mizner-country-club-real-estate",
      "email": "jsolowsky@cmghomeloans.com"
    },
    {
      "url": "https://www.workwithteresa.com/communities/mizner-country-club-real-estate",
      "email": "teresa@greenbergrealestategroup.com"
    },
    {
      "url": "https://www.bocaexpert.com/mizner-country-club.php",
      "email": "marker--hover--listing-stack@2x.png"
    },
    {
      "url": "https://www.bocaexpert.com/mizner-country-club.php",
      "email": "marker--listing-stack@2x.png"
    },
    {
      "url": "https://luxuryresortportfolio.com/mizner-country-club-in-delray-beach-is-awarded-platinum-country-club-status/",
      "email": "carla@luxuryresortportfolio.com"
    },
    {
      "url": "https://luxuryresortportfolio.com/mizner-country-club-in-delray-beach-is-awarded-platinum-country-club-status/",
      "email": "info@luxuryresortportfolio.com"
    },
    {
      "url": "https://luxuryresortportfolio.com/mizner-country-club-in-delray-beach-is-awarded-platinum-country-club-status/",
      "email": "philip@luxuryresortportfolio.com"
    },
    {
      "url": "https://luxuryresortportfolio.com/mizner-country-club-in-delray-beach-is-awarded-platinum-country-club-status/",
      "email": "info@luxuryresortfortpolio.com"
    },
    {
      "url": "https://luxuryresortportfolio.com/mizner-country-club-in-delray-beach-is-awarded-platinum-country-club-status/",
      "email": "info@luxuryresortportfolio.com"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "berna.marketing@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "daisy.raquel@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "golf@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "info@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "mohammad.rashed@acci.com.ph"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "email": "raymond.sandoval@acci.com.ph"
    },
    {
      "url": "https://sun-sentinel.com/business/jobs/fl-people-on-the-move-0117-20160114-story.html",
      "email": "ckent@tribune.com"
    },
    {
      "url": "https://sun-sentinel.com/business/jobs/fl-people-on-the-move-0117-20160114-story.html",
      "email": "peopleonthemove@sunsentinel.com"
    }
  ],
  "mails": [
    "berna.marketing@acci.com.ph",
    "carla@luxuryresortportfolio.com",
    "ckent@tribune.com",
    "daisy.raquel@acci.com.ph",
    "golf@acci.com.ph",
    "info@acci.com.ph",
    "info@bocaratonobserver.com",
    "info@communityaccessnaperville.org",
    "info@luxuryresortfortpolio.com",
    "info@luxuryresortportfolio.com",
    "jsolowsky@cmghomeloans.com",
    "marker--hover--listing-stack@2x.png",
    "marker--listing-stack@2x.png",
    "mlalov@miznercc.org",
    "mohammad.rashed@acci.com.ph",
    "peopleonthemove@sunsentinel.com",
    "philip@luxuryresortportfolio.com",
    "raymond.sandoval@acci.com.ph",
    "teresa@greenbergrealestategroup.com"
  ],
  "nombre_sitio": "miznercc.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.communityaccessnaperville.org/about-us/our-team",
      "text": "Our Team | CAN top of page Diego Reeb, Grants Manager Our day programs include service and fun with peers in our community. Join our Fall Fundraiser Donate Home About Us Our Team Photo Gallery Our Program Our Participants Our Schedule Consulting Services Let Us Help You CAN Store Join Our Team Internships Volunteer Careers Become a Friend of CAN Support CAN Donate Fundraising Events Recycle Your Old Crayons Let Us Help You Our Supporters 2024 CAN Sponsors Our Community Supporters More Use tab to navigate through the menu items. CAN Staff Members Hannah Klinnert, Executive Director Sarah VanStedum, Program Leader Brenda Hasler, Operations Director Dawn Callahan, Program Leader Jissell Cano, Program Assistant Gregory Zelasko, Program Assistant Vanessa Maduzia, Program Advisor Kimberly Nierman, Intern Supervisor & Program Leader Andrew Zelasko, Program Leader Christina Stauffer, Program Leader Delani Kosner, Program Assistant Joseph Kim, Program Assistant Gia Hanrahan, Intern Coordinator & Program Leader Diana Chrostowski, Community Relations Coordinator Amy Ranalli, Program Assistant CAN's Administrative Board of Directors: CAN's Advisory Board : Vivienne Venderley Jennifer Fairlamb Jeanette Edwards Sherry Healey Jama Wall Mark Brown Justin Elder Peggy Kulling Mary Muszynski Subscribe to Newsletter Recent Newsletter CAN's Annual Financial Report Like us on Facebook 25 E Benton Ave Naperville, IL  60540 Info@communityaccessnaperville.org 630-352-1928 Community Access Naperville is a 501c3 not-for-profit organization. Donations are tax-deductible to the full amount permitted by law. bottom of page"
    },
    {
      "url": "https://bocaratonobserver.com/locations/mizner-country-club/",
      "text": "Mizner Country Club - bocaratonobserver.com Skip to main content Search Subscribe facebook instagram RSS Culture Buzz Destinations Features Style Wellness Food & Drink Bites Cheers Chef Profile Readers’ Choice Restaurant Guide Restaurant News Review Community Around Town Community News Flash Giving Back La Vida Boca Happenings Calendar Editor's Corner Out 'N' About Guides Charity Country Clubs Education Top Docs Top Lawyers Visitors Profiles Country Club Collection Cuisine Scene Health Care Heroes Inspired Home Men On The Move Power Players Professional Edge Top Docs Top Lawyers Wonder Women Fresh Picks Home Mizner Country Club Mizner Country Club 16104 Mizner Club Drive , Delray Beach , Florida 33446 Print Video Photos Map × 1 of 14 × 2 of 14 × 3 of 14 × 4 of 14 × 5 of 14 × 6 of 14 × 7 of 14 × 8 of 14 × 9 of 14 × 10 of 14 × 11 of 14 × 12 of 14 × 13 of 14 × 14 of 14 Prev Next Nearby Nearby Events Address 16104 Mizner Club Drive , Delray Beach , Florida 33446 Phone 561-638-5600 Visit Website Originally developed by Toll Brothers, Mizner Country Club is a newer private club community with 471 single-family homes in the fabulous getaway destination of Delray Beach. We’ve taken the traditional country club lifestyle and infused it with casual resort living, the finest 18 hole private golf course, a family friendly atmosphere, delicious food, and year round social & wellness opportunities. But it’s the people that make Mizner unique-they’re warm, welcoming and inclusive. Accolades: A Platinum Club of the World, awarded to top 150 clubs in America by Club Leaders Forum since 2017 Distinguished World Club by Boardroom Magazine America’s Healthiest Club awarded by Prevo Health Solutions, Inc., 2019 AGM Platinum Award by the Association of Golf Merchandisers Golf: Arnold Palmer in 1999 Renovated in 2017 by Kipp Schulties Golf Design Tennis: 6 Har-Tru Hydro clay courts Pool: Newly renovated aquatic center and lounge deck complete with lap lane, changing room, hot tub, and children's mini-water park splash pool Fitness Center: New 6,000 sq. ft. complex with wall-to-wall Technogym Equipment. Fitness Class Studio for aerobics, barre, yoga, tai chi and more is another 1017 square feet. Pilates Reformer Studio, Technogym Group Cycle Studio, two Massage and Tranquility Quiet Rooms, Physical Therapy onsite and Personal Trainers. Dining: Main Dining Room seats up to 250 people Craft Bar poolside with indoor and outdoor seating Craft Grill poolside for casual dining with indoor and outdoor seating The Market for morning continental breakfast, snacks and quick lunches One Mile Bar & Grille is a sophisticated but casual bar and lounge Poolside service available on the weekends in season Banquets: • Clubhouse Ballroom • One Mile Bar & Grille • The BKYD • Skydeck • Garden Ceremony Location Ownership Structure: Private Member-Owned Membership Classes: Sports, Golf Residency Requirement: Mandatory for Residents; Limited number of nonresident memberships available on a yearly basis Membership Information: To learn more about Mizner Country Club, please contact Mackenzie Lalov, Director of Membership & Marketing, at 561-288-3300 or mlalov@miznercc.org . Back to Search Results Tags Golf Tennis Tweets by @twitter.com/Miznercc 7700 Congress Ave., Suite 3115 Boca Raton, FL 33487 561-982-8960 info@bocaratonobserver.com About Team Advertise Sponsorships Awards Issue Archive Subscribe Careers Contact Privacy Policy Terms © 2024 A&A Publishing Corp Built with Metro Publisher™"
    },
    {
      "url": "https://www.workwithteresa.com/communities/mizner-country-club-real-estate",
      "text": "Mizner Country Club — Greenberg Real Estate Group Buy Search Homes in Florida Search Homes in New Jersey Sell Home Valuation for Florida Home Valuation for New Jersey Why List With Us Communities Florida Communities New Jersey Communities Financing Testimonials Contact Us Meet The Team Florida Team New Jersey Team Blog Home Buy Search Homes in Florida Search Homes in New Jersey Sell Home Valuation for Florida Home Valuation for New Jersey Why List With Us Communities Florida Communities New Jersey Communities Financing Testimonials Contact Us Meet The Team Florida Team New Jersey Team Blog Home Mizner Country Club Mizner Country Club is a luxury community that offers a sophisticated lifestyle experience located in West Delray Beach. A Grand entrance leads to a 24-hour manned community filled with various amenities, picturesque landscapes, and a magnificent 18-hole Arnold Palmer Signature Golf Course. Mizner Country Club is home to 471 single family homes ranging in size from 2,400 square feet to just over 5,000 square feet. Homes for sale in Mizner Country Club are known for their exquisite Mediterranean architectural details, extensive interior touches, open floor plans and spacious living areas. Find the newest homes for sale & real estate listings in Mizner Country Club!  In this competitive market it’s important to stay on top of the newest listings & to alert us on anything you would like to see.  If you would like more information on any of these Mizner Country Club  homes for sale, just request information on the listing details page of the property. We can provide you with information that’s not available to the public including disclosures, past sales history, dates and prices of homes recently sold nearby, and more. And, if you haven’t already, be sure to register for our website so that you can receive email alerts whenever new Mizner Country Club homes for sale come on the market. Back to Communities Edit Lead Form OPEN PAGE Optional custom content for this leadform (unique to this page) Name * First Name Last Name Email * Phone * (###) ### #### Thank you! © Greenberg Real Estate Group All Rights Reserved Popular Pages Buy Search Homes in Florida Search Homes in New Jersey Sell Home Valuation for Florida Home Valuation for New Jersey Why List With Us Communities Florida Communities New Jersey Communities Financing Testimonials Contact Us Meet The Team Florida Team New Jersey Team Blog Home Office Hours Greenberg Real Estate Group Phone: Email: Map View Privacy Policy ©Keller Williams Prosperity 2022 All Rights Reserved ©Keller Williams Boca Raton 2022 All Rights Reserved ©Keller Williams Prosperity 2023 All Rights Reserved ©Keller Williams Boca Raton 2023 All Rights Reserved Popular Pages Search HOMES IN FL Search HOMES IN NJ HOME VALUATION FL HOME VALUATION NJ COMMUNITIES TESTIMONIALS TEAM FL TEAM NJ CONTACT US HOME Buy Search Homes in Florida Search Homes in New Jersey Sell Home Valuation for Florida Home Valuation for New Jersey Why List With Us Communities Florida Communities New Jersey Communities Financing Testimonials Contact Us Meet The Team Florida Team New Jersey Team Blog Home Monday-Friday 9AM-5PM Weekends By Appointment Greenberg Real Estate Group 7280 WEST PALMETTO PARK ROAD BOCA RATON, FL, 33433 PHONE: (561) 997-0500 CELL: (201) 774-6563 EMAIL: TERESA@GREENBERGREALESTATEGROUP.COM 1700 RT 23 NORTH STE 300 WAYNE, NJ, 07470 PHONE: (973) 696-0077 CELL: (201) 774-6563 EMAIL: TERESA@GREENBERGREALESTATEGROUP.COM CMG Home Loans 433 Hackensack Ave, 5th FL Hackensack, NJ 07601 Branch NMLS# 247715 Phone: (201) 460-0166 Email: JSOLOWSKY@CMGHOMELOANS.COM Map View Privacy Policy Upload Background Image: Custom Background Brightness: ©Keller Williams Prosperity 2023 All Rights Reserved ©Keller Williams Boca Raton 2023 All Rights Reserved Popular Pages Search HOMES IN FL Search HOMES IN NJ HOME VALUATION FL HOME VALUATION NJ COMMUNITIES TESTIMONIALS TEAM FL TEAM NJ CONTACT US HOME Buy Search Homes in Florida Search Homes in New Jersey Sell Home Valuation for Florida Home Valuation for New Jersey Why List With Us Communities Florida Communities New Jersey Communities Financing Testimonials Contact Us Meet The Team Florida Team New Jersey Team Blog Home 7280 WEST PALMETTO PARK ROAD BOCA RATON, FL, 33433 PHONE: (561) 997-0500 CELL: (201) 774-6563 EMAIL: TERESA@GREENBERGREALESTATEGROUP.COM 1700 RT 23 NORTH STE 300 WAYNE, NJ, 07470 PHONE: (973) 696-0077 CELL: (201) 774-6563 EMAIL: TERESA@GREENBERGREALESTATEGROUP.COM CMG Home Loans 433 Hackensack Ave, 5th FL Hackensack, NJ 07601 Branch NMLS# 247715 Phone: (201) 460-0166 Email: JSOLOWSKY@CMGHOMELOANS.COM Map View ©Keller Williams Prosperity 2022 All Rights Reserved ©Keller Williams Boca Raton 2022 All Rights Reserved Privacy Policy Upload Background Image: PRIVACY POLICY Information herein is deemed reliable but not guaranteed and is provided exclusively for consumers personal, non-commercial use, and may not be used for any purpose other than to identify prospective properties consumers may be interested in purchasing. All listings featuring the BMLS logo are provided by BeachesMLS, Inc. This information is not verified for authenticity or accuracy and is not guaranteed. Copyright ©2021 BeachesMLS, Inc.. The data relating to the real estate for sale on this web site comes in part from the Internet Data Exchange Program of the NJMLS. Real estate listings held by brokerage firms other than are marked with the Internet Data Exchange logo and information about them includes the name of the listing brokers. Some properties listed with the participating brokers do not appear on this website at the request of the seller. Listings of brokers that do not participate in Internet Data Exchange do not appear on this website. All information deemed reliable but not guaranteed. Last date updated: Mon Mar 28 2022 05:30:40 GMT-0700 (Pacific Daylight Time). Source: New Jersey Multiple Listing Service, Inc. 2022 New Jersey Multiple Listing Service, Inc. All rights reserved. Information being provided is for consumer’s personal, non-commercial use and may not be used for any purpose other than to identify prospective properties consumers may be interested in purchasing. The data displayed relating to real estate for sale comes in part from the IDX Program of Garden State Multiple Listing Service, L.L.C. Real estate listings held by other brokerage firms are marked as IDX Listing. IDX information is provided exclusively for consumers personal, non-commercial use, that it may not be used for any purpose other than to identify prospective properties consumers may be interested in purchasing, and that the information deemed reliable but not guaranteed. Copyright © 2021 Garden State Multiple Listing Service, L.L.C. All rights reserved. CMG Mortgage, Inc. dba CMG Home Loans dba CMG Financial, NMLS# 1820, is an equal housing lender. Licensed by the NJ Department of Banking and Insurance. To verify our complete list of state licenses, please visit www.cmgfi.com/corporate/licensing and www.nmlsconsumeraccess.org . We are committed to respecting your right to privacy and protecting your information when\n\t\tyou use our services. This privacy policy also describes the choices available to you regarding our use of your\n\t\tpersonal information and how you can access, update and delete this information. We want you to understand what information we gather about you, how we use it and the\n\t\tsafeguards we have in place to protect it. This Privacy Policy applies to information\n\t\tcollected through this website and otherwise. Your use of this website and our services, and\n\t\tany disputes arising from it, is subject to this Privacy Policy as well as the Terms of Use\n\t\tand all its dispute resolution provisions, including arbitration, limitation on damages and\n\t\tchoice of law. This website is a general audience site and we do not knowingly collect personal information\n\t\tfrom children under the age of 13. If you have questions or concerns regarding this policy, you should first contact our website at support@ylopo.com 1. Collection and Use of Your Personal Information We collect Personal Information from you only when you voluntarily submit it in order to\n\t\tobtain certain information, including without limitation (A) requests to find out more about\n\t\tour programs; (B) requests to contact us; and (C) requests to forward your information to\n\t\tone of our affiliates. We do not honor all “do not track” requests and settings. If you use any signal(s) or\n\t\tanother mechanism(s) that provides you the ability to exercise choice regarding the\n\t\tcollection of personally identifiable information about your online activities over time and\n\t\tacross third-party websites or online services, we will attempt to override such signals or\n\t\tmechanisms. When you use our website, no other parties can collect personally identifiable\n\t\tinformation about your online activities over time and across different websites. Your\n\t\tchoice is indicated by your settings in your web browser. A “do not track” indication sent\n\t\tfrom your web browser will not result in any tracking activity (i.e., tracking cookies)\n\t\twithin the website to be programmatically disabled. We collect the following personal information from you: Contact Information such as name, email address, mailing address, and phone number We use this information to: Send you requested product or service information Respond to customer service requests Administer your account Send you a newsletter Send you marketing communications Improve our Web site and marketing efforts Conduct research and analysis Display content based upon your interests Data will not be sold or shared with third parties for promotional or marketing purposes.  Information collected may be used to help train AI models and approve our offerings. By clicking the Submit button, you agree to have your information shared with us \n\t\tand for us to initiate contact with you at the telephone number you provided using\n\t\tlive, recorded, artificial, or AI-generated voice, mobile phone (including through automated\n\t\tdialing, text SMS/MMS, or pre-recorded messaging) and/or email, even if your telephone\n\t\tnumber is on a corporate, state, or the National Do Not Call Registry, and you agree to our\n\t\tPrivacy Policy. You further represent that you have the authority to provide this consent\n\t\tregarding voice and text calls to the telephone number you provided. To opt out of voice\n\t\tcall, tell the operator you no longer wish to receive voice calls. To opt out of text calls,\n\t\treply “Stop”. For text messaging, you agree to only use the term “Stop” to communicate an\n\t\topt out. The rights of Users We adopt this Notice to comply with the California Consumer Privacy Act of 2018 (CCPA). Any\n\t\tterms defined in the CCPA have the same meaning when used in this Notice. Users may exercise certain rights regarding their Data processed by the Owner. In particular, Users have the right to do the following: Withdraw their consent at any time. Users have the right to withdraw\n\t\t\tconsent where they have previously given their consent to the processing of their Personal\n\t\t\tData. Object to processing of their Data. Users have the right to object to the\n\t\t\tprocessing of their Data if the processing is carried out on a legal basis other than\n\t\t\tconsent. Further details are provided in the dedicated section below. Access their Data. Users have the right to learn if Data is being\n\t\t\tprocessed by the Owner, obtain disclosure regarding certain aspects of the processing and\n\t\t\tobtain a copy of the Data undergoing processing. Verify and seek rectification. Users have the right to verify the\n\t\t\taccuracy of their Data and ask for it to be updated or corrected. Restrict the processing of their Data. Restrict the processing of their\n\t\t\tData. Users have the right, under certain circumstances, to restrict the processing of\n\t\t\ttheir Data. In this case, the Owner will not process their Data for any purpose other than\n\t\t\tstoring it. Have their Personal Data deleted or otherwise removed. Users have the right to obtain the erasure of their Data from the Owner by placing a request \n\t\t\tat the below designated support email address support@ylopo.com including their Facebook URL, \n\t\t\tfirst and last name, email address and/or phone number for identification purposes, or user can \n\t\t\talso request removal of data from Ylopo by removing the \"Local Home Search\" app connected to the \n\t\t\tFacebook account that was used for login. Go to Facebook settings, navigate to \"Apps and Websites,\" \n\t\t\tand find the app named \"Local Home Search\". Click \"Remove\" next to the app's name. Receive their Data and have it transferred to another controller. Users\n\t\t\thave the right to receive their Data in a structured, commonly used and machine readable\n\t\t\tformat and, if technically feasible, to have it transmitted to another controller without\n\t\t\tany hindrance. This provision is applicable provided that the Data is processed by\n\t\t\tautomated means and that the processing is based on the User's consent, on a contract\n\t\t\twhich the User is part of or on pre-contractual obligations thereof. Lodge a complaint. Users have the right to bring a claim before their\n\t\t\tcompetent data protection authority. Details about the right to object to processing Where Personal Data is processed for a public interest, in the exercise of an official\n\t\tauthority vested in the Owner or for the purposes of the legitimate interests pursued by the\n\t\tOwner, Users may object to such processing by providing a ground related to their particular\n\t\tsituation to justify the objection. Users must know that, however, should their Personal Data be processed for direct marketing\n\t\tpurposes, they can object to that processing at any time without providing any\n\t\tjustification. To learn, whether the Owner is processing Personal Data for direct marketing\n\t\tpurposes, Users may refer to the relevant sections of this document. How to exercise these rights Any requests to exercise User rights can be directed to the Owner through the contact\n\t\tdetails provided in this document. These requests can be exercised free of charge and will\n\t\tbe addressed by the Owner as early as possible and always within one month. We may provide this information in a standardized format that is not specific to you. The\n\t\tdesignated email address for these requests is support@ylopo.com Consent to Receiving Emails, Auto-Dialing & Auto-Texting: By registering, you are giving us, and our professional real estate clients and\n\t\tadvertisers permission to contact you via text message, email, or telephone using the email\n\t\taddress and/or telephone number that you have provided during the registration process. Such\n\t\tcontact may, from time to time, include attempts to contact you via auto-dialing,\n\t\tprerecorded or artificial voice, or auto-texting technology. You may opt out of receiving\n\t\tthese forms of communication by unsubscribing from any email communication or texting STOP\n\t\tas a reply to one of our text communications. There is no fee charged by us or its\n\t\tadvertisers to receive text messages, however, your mobile service provider may charge you\n\t\tfor sending and/or receiving text messages and air-time, as well as any other standard\n\t\tapplicable rates charged by your mobile service provider. Information Sharing We may share your personal information with and any other business associated\n\t\twith this site, in the ways that are described in this Privacy Statement. We may provide\n\t\tyour personal information to our subcontractors in support of our services,\n\t\tsuch as customer service. These companies are authorized to use your personal information as\n\t\tis necessary to provide these services to you. We may also disclose your personal information: As required by law such as to comply with a subpoena, or similar legal process. When we believe in good faith that disclosure is necessary to protect our rights, protect\n\t\t\tyour safety or the safety of others, investigate fraud or respond to a government request, To any other third party with your prior consent to do so. Cookies and Other Tracking Technologies We may use cookies, for example, to keep track of your preferences and profile information.\n\t\tCookies are also used to collect general usage and volume statistical information that does\n\t\tnot include personal information. We may use another company to place cookies on your computer to collect non-personally\n\t\tidentifiable information to compile aggregated statistics for us about visitors to our site. Links to Other Web Sites Our Site includes links to other Websites whose privacy practices may differ from ours. If\n\t\tyou submit personal information to any of those sites, your information is governed by their\n\t\tprivacy policy statements. We encourage you to carefully read the privacy statement of any\n\t\tWeb site you visit. Security The security of your personal information is important to us. We follow generally accepted\n\t\tindustry standards to protect the personal information submitted to us, both during\n\t\ttransmission and once we receive it. No method of transmission over the internet, or method\n\t\tof electronic storage is 100% secure, however. Therefore, we cannot guarantee its absolute\n\t\tsecurity. If you have any questions about the security of our Web site, you can contact our\n\t\twebsite and advertising provider support@ylopo.com Special Notice to California Residents. If you are a resident of California, in addition to\n\t\tthe rights set forth in this Privacy Policy: 1. We will not share any personal information about you to the extent prohibited by\n\t\tapplicable California law or to the extent your prior consent to share is required by\n\t\tapplicable California law; and 2. You have the right to request information from us regarding the manner in which we share\n\t\tcertain categories of information with third parties for their direct marketing purposes.\n\t\tCalifornia law gives you the right to send us a request at a designated address to receive\n\t\tthe following information the categories of information we disclosed to third parties for their direct marketing purposes during the preceding calendar year the names and addresses of the third parties that received that information; and if the nature of the third party's business cannot be determined from their name, examples of the products or services marketed. Additional Policy Information Our Web site includes Widgets, which are interactive mini-programs that run on our site to\n\t\tprovide specific services from another company (e.g. displaying the news, opinions, music,\n\t\tetc.). Personal information, such as your email address, may be collected through the\n\t\tWidget. Cookies may also be set by the Widget to enable it to function properly. Information\n\t\tcollected by this Widget is governed by the privacy policy of the company that created it. Our Web site offers publicly accessible blogs, social media, or community forums such as\n\t\tFacebook, Twitter, or Google Plus. You should be aware that any information you provide in\n\t\tthese areas may be read, collected, and used by others who access them. Visiting our Websites From Outside the United States. This Privacy Policy is intended to cover collection of information on our websites from\n\t\tresidents of the United States. If you are visiting our websites from outside the United\n\t\tStates, please be aware that your information may be transferred to, stored and processed in\n\t\tthe United States where our servers are located and our central database is operated. The\n\t\tdata protection and other laws of the United States and other countries might not be as\n\t\tcomprehensive as those in your country. By using our services, you understand that your\n\t\tinformation may be transferred to our facilities and those third parties with whom we share\n\t\tit as described in this Privacy Policy. No Rights of Third Parties. This Privacy Policy does not create rights enforceable by third parties or require\n\t\tdisclosure of any personal information relating to users of our websites. Notification of Privacy Policy Statement Changes We may update this privacy statement to reflect changes to our information practices or\n\t\tchanges in regulations governing privacy. If we make any material changes we will notify you\n\t\tby email (sent to the email address specified in your account) or by means of a notice on\n\t\tthis Site prior to the change becoming effective. We encourage you to periodically review\n\t\tthis page for the latest information on our privacy practices. This Privacy Policy was last revised on June 2, 2025. We reserve the right to modify\n\t\tor amend this policy at any time by posting the revised Privacy Policy on the website. true"
    },
    {
      "url": "https://www.bocaexpert.com/mizner-country-club.php",
      "text": "Mizner Country Club Homes For Sale | Mizner Country Club, Delray Beach FL Skip to main content Search Dropdown arrow Search MLS New Listings Featured Listings Communities Dropdown arrow South Florida Cities Boca Raton Boynton Beach Deerfield Beach Delray Beach Highland Beach Hillsboro Beach Ocean Ridge Parkland West Palm Beach Lifestyles Dropdown arrow Lifestyles Waterfront Homes 55+ Active Adult Golf & Country Clubs Gated Communities Downtown Living Waterfront Condos Montoya Circle Sell About Dropdown arrow About Meet our Team Join our Team Local Info Contact Us Read our Blog My Dashboard My Dashboard Favorites Saved Searches Messages Preferences Sign Out Sign In 561.866.7584 Menu Close Home Golf and Country Club Communities Mizner Country Club Mizner Country Club Homes For Sale Search homes at Mizner Country Club - Delray Beach, FL Mizner Country Club is located on Lyons Road, north of Clint Moore Road, and south of Atlantic Avenue. Mizner Country Club is centered around a magnificent 18-hole Arnold Palmer Signature Golf Course. From the elegant Toll Brothers homes that make up the community to the world-class amenities and the lush natural landscape, Mizner Country Club offers only the best to Members and their guests. In addition to the championship golf course, Mizner Country Club includes full tennis and swimming facilities, a fitness center, grand ballroom, many dining options, two fully-stocked Pro shops, private locker facilities, aerobics rooms, and much more. And, if you have guests coming to visit they can stay right at the Club in one of the beautiful guest rooms! For more information about Mizner Country Club homes for sale in Delray Beach, FL , contact at your earliest convenience. Browse Mizner Country Club Homes For Sale All Listings Under $100,000 Over $1,000,000 Bedrooms Bathrooms Price Range Save\n                        Search Sort by: Price, high to low Dropdown arrow Pending $5,750,000 ↓ $245,000 8388 Del Prado Dr, Delray Beach 6\n                                    Beds 9\n                                    Baths 8,313 SqFt Residential MLS® # RX-11077466 $4,550,000 8417 Del Prado Dr, Delray Beach 5\n                                    Beds 7\n                                    Baths 7,728 SqFt Residential MLS® # RX-11073041 Pending $2,495,000 16313 Mira Vista Lane, Delray Beach 5\n                                    Beds 6\n                                    Baths 4,687 SqFt Residential MLS® # RX-11092808 Under Contract $2,221,000 8836 Valhalla Dr, Delray Beach 4\n                                    Beds 4\n                                    Baths 3,564 SqFt Residential MLS® # RX-11057363 Pending $2,195,000 8877 Valhalla Dr, Delray Beach 5\n                                    Beds 6\n                                    Baths 4,568 SqFt Residential MLS® # RX-11093725 $1,995,000 16312 Braeburn Ridge Trl, Delray Beach 4\n                                    Beds 5\n                                    Baths 4,050 SqFt Residential MLS® # RX-11083190 Pending $1,850,000 15926 Laurel Creek Dr, Delray Beach 5\n                                    Beds 6\n                                    Baths 4,227 SqFt Residential MLS® # RX-11033579 $1,675,000 ↓ $25,000 8168 Valhalla Dr, Delray Beach 4\n                                    Beds 6\n                                    Baths 4,251 SqFt Residential MLS® # RX-11100608 Under Contract $1,590,000 16414 Braeburn Ridge Trl, Delray Beach 4\n                                    Beds 5\n                                    Baths 4,050 SqFt Residential MLS® # RX-11098084 $1,590,000 8048 Valhalla Dr, Delray Beach 4\n                                    Beds 6\n                                    Baths 4,187 SqFt Residential MLS® # RX-11116313 $1,549,000 16360 Braeburn Ridge Trl, Delray Beach 4\n                                    Beds 5\n                                    Baths 4,050 SqFt Residential MLS® # RX-11077722 $1,500,000 ↓ $75,000 15974 Laurel Creek Dr, Delray Beach 4\n                                    Beds 4\n                                    Baths 3,539 SqFt Residential MLS® # RX-11076001 1 2 Next Arrow right CONTINUE SEARCHING GOLF COURSE HOMES IN THE AREA If you're not seeing anything that fits your needs and wants here, start browsing other available golf and country club homes for sale in and around beautiful Boca Raton, FL! ^ Back to Mizner Country Club homes for sale Communities Delray Beach Highland Beach Boynton Beach Boca Raton Ocean Ridge Information About Us Our Agents Our Listings Contact Us Popular Pages Local Communities Home Evaluation Real Estate Blog Search Listings Boca Expert Realty LLC 561.866.7584 hello@bocaexpert.com Facebook Twitter LinkedIn © 2025 Real Estate Webmasters All Rights Reserved. | Sitemap | Accessibility | Privacy Policy Real Estate Webmasters will open a new window All listings featuring the BMLS logo are provided by BeachesMLS, Inc.This information is not verified for authenticity or accuracy and is not guaranteed.Copyright © 2025 BeachesMLS, Inc. Listing information last updated on September 10th, 2025 at 11:15pm EDT."
    },
    {
      "url": "https://luxuryresortportfolio.com/mizner-country-club-in-delray-beach-is-awarded-platinum-country-club-status/",
      "text": "Mizner Country Club, Delray Beach - Luxury Resort Portfolio 561.445.2282 info(at)luxuryresortportfolio(dotted)com Home Our Exclusive Listing Portfolio Our Landmark Sales Luxury Estates Ultra-Luxury Estates Buy Your Home With Us South Florida Luxury Communities Relocation Services School Information Search For A Residence Map Search Our Exclusive Listed Property Services Global Marketing Exposure Print & E-Marketing What Is My Home Worth Maximize Your Homes Value Our History The Firm LRP In The Press Luxury Lifestyle Newsletter Featured Videos Welcome To Luxury Resort Portfolio Privacy Policy Notice Accessibility Notice Copyright Notice Contact Us Featured Areas Oceanfront Estates Yacht & Intracoastal Residences Luxury Waterfront Estates Ultra-Luxury Waterfront Estates Country Club Homes Gated  Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots Buyers South Florida Exclusive Communities Email Property Alerts Relocation Services Mortgage Calculator School Information Buy Your Home With Luxury Resort Portfolio Short Sale and Foreclosure Home Search Map Search Sellers Our Exclusive Listed Property Services Global Marketing Exposure Print & E-Marketing Maximize Your Homes Value What is My Home Worth? Our Portfolio Our Exclusive Listing Portfolio Our Landmark Sales Open Houses LUXURY LIFESTYLE NEWSLETTER FEATURED VIDEOS About LRP Welcome To LRP Our History The Firm LRP In The Press Contact Us Login Property Organizer Email Property Alerts Saved Searches Facebook Twitter Youtube Linkedin Pinterest Instagram 561.445.2282 Direct: 561.445.2282 Office: 800.644.5616 info@luxuryresortfortpolio.com Info(at)LuxuryResortPortfolio(dotted)com Menu Featured Areas Oceanfront Estates Yacht & Intracoastal Residences Luxury Waterfront Estates Ultra-Luxury Waterfront Estates Country Club Homes Gated  Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots Buyers South Florida Exclusive Communities Email Property Alerts Relocation Services Mortgage Calculator School Information Buy Your Home With Luxury Resort Portfolio Short Sale and Foreclosure Home Search Map Search Sellers Our Exclusive Listed Property Services Global Marketing Exposure Print & E-Marketing Maximize Your Homes Value What is My Home Worth? Our Portfolio Our Exclusive Listing Portfolio Our Landmark Sales Open Houses LUXURY LIFESTYLE NEWSLETTER FEATURED VIDEOS About LRP Welcome To LRP Our History The Firm LRP In The Press Contact Us Login Property Organizer Email Property Alerts Saved Searches 561.445.2282 Direct: 561.445.2282 Office: 800.644.5616 info@luxuryresortfortpolio.com Info(at)LuxuryResortPortfolio(dotted)com Menu Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla(at)LuxuryResortPortfolio(dotted)com 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram Login Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla (at)LuxuryResortPortfolio(dotted)com Oceanfront Estates Yacht & Intracoastal Residences Yacht & Intracoastal Residences Luxury Waterfront Estates Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Country Club Homes Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots Our Exclusive Listing Portfolio Our Landmark Sales Luxury Estates Ultra-Luxury Estates Buy Your Home With Us South Florida Luxury Communities Relocation Services School Information Search For A Residence Map Search Our Exclusive Listed Property Services Global Marketing Exposure Print & E-Marketing What Is My Home Worth Maximize Your Homes Value Our History The Firm LRP In The Press Luxury Lifestyle Newsletter Featured Videos Welcome To Luxury Resort Portfolio Privacy Policy Notice Accessibility Notice Copyright Notice Contact Us Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com Facebook Twitter Youtube Linkedin Pinterest Instagram Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram Questions? Ask Us! We would love to hear from you! Send us a message and we’ll get right back in touch. Thank you! Choose Side: First Name Last Name Phone Number Email Address How Did You Find Us? How Did You Find Us? Search Engine Social Media YouTube Print Media Marketing Mailer From A Friend Other Message/Inquiry Luxury Resort Portfolio takes your privacy seriously. We do not share your information with anyone. By using this site you agree to our Privacy Policy . For more information, please see our Privacy Notice . Facebook Twitter Youtube Linkedin Pinterest Instagram Contact Search Quick Search Property Type House / Condo House Only Condo Only Lots / Land Multi-Unit Residential Mobile Home Rental Commercial Beds 1 2 3 4 5 6 7 8 9 10+ Baths 1 2 3 4 5 6 7 8 9 10+ Advanced Search + Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram Questions? Ask Us! We would love to hear from you! Send us a message and well get right back in touch. Thank you! Choose Side: First Name Last Name Phone Number Email Address How Did You Find Us? How Did You Find Us? Search Engine Social Media YouTube Print Media Marketing Mailer From A Friend Other Message/Inquiry Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram Luxury Resort Portfolio takes your privacy seriously. We do not share your information with anyone. By using this site you agree to our Privacy Policy . For more information, please see our Privacy Notice . Subscribe To Our Blog! Choose Side: First Name Last Name Email Address Philip Lyle Smith Co-Founder Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com Carla Ferreira- Smith Co-Founder | Broker Luxury Real Estate Specialist 561.445.2299 Carla(at)LuxuryResortPortfolio(dotted)com 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram Luxury Resort Portfolio takes your privacy seriously. We do not share your information with anyone. By using this site you agree to our Privacy Policy . For more information, please see our Privacy Notice . Login Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla (at)LuxuryResortPortfolio(dotted)com Oceanfront Estates Yacht & Intracoastal Residences Yacht & Intracoastal Residences Luxury Waterfront Estates Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Country Club Homes Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots About Us Welcome To Luxury Resort Portfolio Our History The Firm Luxury Lifestyle Newsletter Featured Videos LRP In The Press Our Portfolio LRP Listing Portfolio LRP Landmark Sales Buyers South Florida Luxury Communities Relocation Services Mortgage Calculator Open Houses School Information Short Sales & Foreclosures Buy Your Home With Us Home Search Map Search Sellers Our Exclusive Listed Property Services Global marketing Exposure Print & E-Marketing What is My Home Worth? Maximize Your Homes Value Login | Sign-up Your Property Organizer Email Property Alerts Saved Searches Disclosures Privacy Policy Notice Accessibility Notice Copyright Notice Contact Us Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla (at)LuxuryResortPortfolio(dotted)com Oceanfront Estates Yacht & Intracoastal Residences Yacht & Intracoastal Residences Luxury Waterfront Estates Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Country Club Homes Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram Privacy Policy Notice Accessibility Notice Copyright Notice Back To Top Main Content Mizner Country Club, Delray Beach Awarded “Platinum Club Of America” Mizner Country Club, Delray Beach Awarded “Platinum Club Of America” Mizner Country Club, Delray Beach, Florida 33446 A “Platinum Club of America” – Ranked In The Nations Top 5% Of Country Clubs Where The Good Life… Is The Way Of Life Mizner Country Club – Community Flyover Video & Kipp Schulties Championship Golf Course Mizner Country Club Real Estate Mizner Country Club In Delray Beach, Florida Is A Luxurious Golf Course Community With Beautiful Real Estate For Sale Located Conveniently To Its’ Neighboring Boca Raton Luxury Real Estate and the beautiful beaches along the Gold Coast of South Florida, the exclusive Mizner Country Club real estate is one of South Florida’s most distinctive and prestigious luxury resort-style country club enclaves. Owners of Mizner Country Club homes enjoy a life of comfort and relaxation in a lush setting evocative of Old World Florida. A glamorous Delray Beach luxury real estate golf course community, Mizner Country Club, which recently achieved “ Platinum Country Club ” status and now joins the ranks of the top 5% of private clubs in the nation, captures the gracious Palm Beach lifestyle in a lush lake-studded landscape centered on a completely re-imagined 18-hole Kipp Schulties, par 72 signature golf course. One of the best kept secrets in South Florida and inspired by the architectural vision of historic Palm Beach architect Addison Mizner, Mizner Country Club real estate is characterized by the elegance and rich detailing of the Mediterranean Revival style. Extending over 384 lavishly landscaped acres, Mizner Country Club is gate-guarded and features 478 homes that lie on spacious manicured lots in ten subdivisions. From the elegant Mediterranean inspired homes that make up Mizner Country Club real estate for sale, to it’s world-class amenities and verdant vistas, Mizner Country Club offers only the best to its’ Members and their Guests. In addition to the Kipp Schulties signature championship golf course, Mizner Country Club homes for sale include its’ current award-winning Grande Clubhouse. Mizner Country Club Homes For Sale Mizner Country Club Homes For Sale Offers Homeowners The Best Floor Plans & Amenities In Palm Beach County Real Estate A Toll Brothers, Inc., America’s Luxury Homebuilder built community, Mizner Country Club benefits from the highest quality standards of the respected and award-winning luxury home builder. Toll Brothers, Inc. has been named America’s Best Builder, National Builder Of The Year, and has been the recipient of the National Housing Quality Gold Award. Mizner Country Club luxury homes range in size from 2,700 to 9,200 square feet and there are two dozen different designs and floor plans, excluding the custom-built estates, whose specifications are unique to each property. The builders of the custom residences are National Custom Homes, Tuscan-Harvey Estate Homes, Courchene Development Corporation, and New Millennium Builders. Mizner Country Club’s central location in Delray Beach adjacent to Boca Raton’s real estate along “Millionaires Mile” provides residents with a veritable cornucopia of shopping, dining, entertainment and recreational options. Delray Beach’s Delray Marketplace, Palm Beach’s luxury brand boutiques of Worth Avenue, Ft. Lauderdale’s Las Olas yachting paradise and Miami’s world class nightlife and entertainment on South Beach are close at hand. Nearby cultural attractions include: the Morikami Museum and Japanese Gardens, the Boca Raton Museum of Art, Palm Beach’s Henry M. Flagler Museum and Norton Museum of Art, and the Kravis and Broward Center’s for the Performing Arts. If you find the sporting life to be more appealing, Mizner Country Club homes’ convenient locale to the International Polo Club Pam Beach in the Village of Wellington and the Delray Beach Tennis Center play host to numerous championship and celebrity tournaments throughout the year, while the Dolphins, Marlins, Heat and Panthers home stadiums are all within an hours drive. Exquisite Gold Coast beaches and exclusive Mizner Park in Boca Raton are close at hand. Mizner Country Club real estate is conveniently located between Ft. Lauderdale and Palm Beach International Airports, and only a short drive to the Boca Raton Private Executive Airport. Mizner Country Club – Membership Information In the event of a resale of your property, the equity contribution has a Refundable Portion per the schedule below equal to the actual contribution amount paid by the resale seller at the time the membership was originally acquired. The purchaser of a resale property can only obtain a membership classification up to the category of membership owned by the resale seller at the time of sale. 2021 – 2022 Resident Membership Equity Schedule Of Fees & Dues Full Equity Contribution: $120,000 Refundable Portion: $20,000 Annual Dues: $27,234 Sports Equity Contribution: $100,000 Refundable Portion: $20,000 Annual Dues: $24,511 Tennis Equity Contribution: $75,000 Refundable Portion: $15,000 Annual Dues: $23,149 Social Equity Contribution: $75,000 Refundable Portion: $15,000 Annual Dues: $23,149 Equity Contributions, Fees & Dues Are Subject To Changes Without Notice And Are In Addition To Monthly And Annual Additional Charges And Assessments Mizner Country Club Golf Course Homes & $22 Million Lifestyle Center Kipp Schulties Golf Course: Challenging the members of Mizner Country Club is it’s brand new 6,734 yard par 72 Kipp Schulties redesigned signature course. The rolling Bermuda fairways are bounded by elevated tees and contoured Tifeagle greens. Five sets of tees are available to challenge a variety of handicaps. The course boasts four par 5’s, but the signature hole is the par three 9th (featured below), which happens to be the shortest of the par 3’s on the course. This hole requires an accurate shot from an island tee to an island green, with two green side bunkers protecting the front of the green. $22 Million Lifestyle Center : The showcase of Mizner Country Club! A completely brand new $22 million dollar “Lifestyle Center” affording Homeowners’ and their Families to an all new tennis and swimming facility, fitness center, elegant grand ballroom, family arcade, children’s splash pad, sky deck and fire-pit area. Entertaining options include: indoor and outdoor pool-side dining at the all new Central replete with sports bar, grab & go cafe at Market, Craft Bar & Grill, One Mile Bar & Grill and Grande Clubhouse Restaurant… in addition: two fully-stocked Pro Shops, private locker facilities, aerobics rooms, and much more. Mizner Country Club’s 9th Hole – Double Island Tee Box & Green Is The Kipp Schulties Golf Courses Signature Par 3 Hole Mizner Country Club’s New $22 Million Lifestyle Center, State-Of-The-Art Fitness Facility, Spa, Resort Pool & Restaurants For more information on Mizner Country Club homes for sale or to schedule an appointment to view any of the beautiful and luxurious amenities Mizner Country Club has to offer, please contact the Mizner Country Club resident real estate specialists “The Smiths” of Luxury Resort Portfolio today at 561.445.2282 or TheSmiths(at)LuxuryResortPortfolio(dotted)com … your Palm Beach County Realtors of choice offering the utmost in confidentiality, expert advice and personalized service to South Florida home buyers for more than 32 years collectively! Please Click Links Below For More Information Mizner Country Club Homes | Mizner Country Club Realtor | Mizner Country Club Real Estate | Mizner Country Club Luxury Homes | Mizner Country Club Homes For Sale | Mizner Country Club Real Estate For Sale | Mizner Country Club – Platinum Club View All Mizner Country Club Real Estate Listings For Sale Here No results found Back To Luxury Resort Portfolio Lifestyle Guide - The Art Of Living Well Back to Top Questions? Ask Us! We would love to hear from you! Send us a message and we’ll get right back in touch. Thank you! Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip@LuxuryResortPortfolio.com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla@LuxuryResortPortfolio.com Choose Side: First Name Last Name Phone Number Email Address How Did You Find Us? How Did You Find Us? Search Engine Social Media YouTube Print Media Marketing Mailer From A Friend Other Message/Inquiry Luxury Resort Portfolio takes your privacy seriously. We do not share your information with anyone. By using this site you agree to our Privacy Policy . For more information, please see our Privacy Notice . SOUTH FLORIDA LUXURY REAL ESTATE AREAS OF EXPERTISE Philip & Carla Smith Sell Highest Priced Oceanfront Mansion In Palm Beach County Beaches MLS 2023 | Palm Beach County Luxury Real Estate Specialists | South Florida Waterfront Homes | Palm Beach County Oceanfront Estates For Sale | Boca Raton Luxury Real Estate | Boca Raton - The Stay At Home Vacation Destination | South Florida Properties of Distinction | Wellington Equestrian Real Estate In South Florida | Royal Palm Yacht & Country Club In Boca Raton | St. Andrews Country Club - The Most Luxurious Golf Course Community In Boca Raton | Mizner Country Club, Delray Beach - Awarded \"Platinum Club Of America\" | Long Lake Estates - Boca Raton Gated Estate Homes | Stone Creek Ranch - Delray Beach Luxury' Real Estate | Boca Raton Real Estate | Boca Raton Luxury Homes for Sale | Boca Raton Homes For Sale | Boca Raton Luxury Homes | Boca Raton Realtor | Real Estate Agent Boca Raton | Boca Raton Ocean Front Estates | Boca Raton Country- Club Real Estate | boca Raton Country Club Homes | Real Estate in Boca Raton Country Club | Homes for Sale Boca Raton Country Club | Boca Raton Country  Club Realtor | St. Andrews Country Club Real Estate | long Lake Estates Real Estate | Long Lake Estates Homes for Sale | Long Lake Estates Realtor | Mizner Country Club Real Estate | Mizner Country Club Real Estate For Sale | Mizner Country Club Homes For Sale | Mizner Country Club Luxury Homes | Mizner Country Club Realtor | The Oaks at Boca Raton Real Estate | The Oaks at Boca Raton Homes for Sale | The Oaks at Boca Raton Realtor Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla(at)LuxuryResortPortfolio(dotted)com Oceanfront Estates Yacht and Intracoastal Residences Elite Country Club Homes Exclusive Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots Navigate Exclusive Listing Portfolio Luxury Waterfront Estates Ultra-Luxury Waterfront Estates South Florida Communities Contact Us 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com ENGLISH | ESPAÑOL | PORTUGUÊS Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla (at)LuxuryResortPortfolio(dotted)com Oceanfront Estates Yacht & Intracoastal Residences Yacht & Intracoastal Residences Luxury Waterfront Estates Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Country Club Homes Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots Social Facebook Twitter Youtube Linkedin Pinterest Instagram Subscribe To Our Luxury Lifestyle Blog Log-In / Sign-Up Contact Us 800.644.5616 | Office 800.644.0059 | Fax Info(at)LuxuryResortPortfolio(dotted)com ENGLISH | ESPAÑOL | PORTUGUÊS Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip(at)LuxuryResortPortfolio(dotted)com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla (at)LuxuryResortPortfolio(dotted)com Oceanfront Estates Yacht & Intracoastal Residences Yacht & Intracoastal Residences Luxury Waterfront Estates Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Country Club Homes Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots © 2025 Luxury Resort Fortfolio . All rights reserved. | Sitemap | Privacy Policy | Accessibility Notice | Copyright Notice | Real Estate Website Design by Agent Image 561.445.2282 info@luxuryresortportfolio.com Home Preview Our Listed Estates Our Landmark Sales Exclusive Communities Open Houses Short Sale & Foreclosure Why Buy With LRP Relocation Services School Information Search For A Residence Map Search Why List With LRP Global Marketing Exposure Print & E-Marketing What Is My Home Worth Maximize Your Homes Value Our History The Firm LRP In The Press Luxury Lifestyle Newsletter Featured Videos Welcome To LRP Privacy Policy Notice Accessibility Notice Copyright Notice Contact Us Login Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip@LuxuryResortPortfolio.com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla @LuxuryResortPortfolio.com Oceanfront Estates Yacht & Intracoastal Residences Yacht & Intracoastal Residences Luxury Waterfront Estates Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Ultra- Luxury Waterfront Estates Country Club Homes Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots About Us Welcome To Luxury Resort Portfolio Our History The Firm Luxury Lifestyle Newsletter Featured Videos LRP In The Press Our Portfolio LRP Listing Portfolio LRP Landmark Sales Buyers Why Buy With Luxury Resort Portfolio South Florida Exclusive Communities Relocation Services Mortgage Calculator School Information Open Houses Short Sales & Foreclosures Home Search Map Search Sellers Why List Your Home With Luxury Resort Portfolio Global marketing Exposure Print & E-Marketing What is My Home Worth? Maximize Your Homes Value Login | Sign-up Your Property Organizer Email Property Alerts Saved Searches Disclosures Privacy Policy Notice Accessibility Notice Copyright Notice Contact Us Philip Lyle Smith Co-Founder South Florida Luxury Real Estate Specialist 561.445.2282 Philip@LuxuryResortPortfolio.com Carla Ferreira-Smith Co-Founder | Broker South Florida Luxury Real Estate Specialist 561.445.2299 Carla @LuxuryResortPortfolio.com Oceanfront Estates Yacht & Intracoastal Residences Yacht & Intracoastal Residences Country Club Homes Gated Estate Enclaves Waterfront Condominiums Equestrian Estates & Horse Farms Vacant Land & Lots English Español Português Facebook Twitter Youtube Linkedin Pinterest Instagram Privacy Policy Notice Accessibility Notice Copyright Notice"
    },
    {
      "url": "https://acci.com.ph/contact-us/",
      "text": "Contact Us - Alabang Country Club, Inc. Skip to content Menu Facebook-f Instagram Search Contact Us Home Contact Us GET IN TOUCH For inquiries, please feel free to send us a message or reach us on the contact details provided below. clubhouse OPERATIONS Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph GOLF OPERATIONS Felicita V. Mallari 0998 587 9420 8842-3530 loc 157 golf@acci.com.ph corporate services Daisy C. Raquel 0998 587 9422 8842-3530 loc 176 daisy.raquel@acci.com.ph member relations Berna D. Malolos 0917 568 5764 8842-3530 loc 152 berna.marketing@acci.com.ph DINING & BANQUETS Mohammad Rashed Jr. 0918 239 4898 8842-3530 loc 226 mohammad.rashed@acci.com.ph data privacy officer Raymond Jaye M. Sandoval 0968 875 2955 8842-3530 loc 215 raymond.sandoval@acci.com.ph Contact Form \" * \" indicates required fields Full Name * Email * Contact Number * Subject * Subject * Membership Golf Operations Dining & Banquets Events Message Name This field is for validation purposes and should be left unchanged. ACCI started its operation in 1981 with a Member-base of 1,646. Our primary objective is to provide Members excellent leisure facilities designed for the whole family. Quick Links About Facilities Events Membership Careers Contact Us Contact Us 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines Follow Us Facebook-f Instagram © Copyright 2025 Alabang Country Club. All Rights Reserved. © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines 8-842-3530 info@acci.com.ph Acacia Ave., Ayala Alabang Village, Muntinlupa City, Philippines © Copyright 2025 Alabang Country Club. All Rights Reserved. Powered by: Web Designer Philippines Privacy Policy Facebook-f Instagram Home About Us History of the Club Mission & Vision Board of Directors The Committees Club Management Events Social Activities Monthly Newsletter Golf Course Tour Golf Tournaments Facilities Member Services Sports and Recreation Dining and Banquets Members Corner Contact Us Career"
    },
    {
      "url": "https://sun-sentinel.com/business/jobs/fl-people-on-the-move-0117-20160114-story.html",
      "text": "People on the Move: Mizner Country Club names golf professional, food and beverage manager – Sun Sentinel Skip to content All Sections Subscribe Now 78°F Wednesday, September 10th 2025 Daily e-Edition Evening e-Edition Home Page Daily e-Edition Evening e-Edition Sign Up for Newsletters Local News Local News Broward County Palm Beach County Miami-Dade County Weather News Weather News Forecasts and Conditions Hurricane Tracks Storms & Hurricanes Politics Politics Elections Health Health Medicare Things To Do Things To Do Restaurants Horoscopes Events Arts Theater Sports Sports Miami Dolphins Miami Heat Florida Panthers Miami Marlins Inter Miami UM Hurricanes FAU Owls High School Sports Business Business Consumer Reviews Retail Real Estate Real Estate Featured Homes Agents Brokers Open Houses Opinion Opinion Election Endorsements Editorials Letters to the Editor Commentary Education Travel Travel Florida Cruise Guide Explore Florida Florida & Caribbean Experiences Florida Jewish Journal Florida Jewish Journal Jewish Journal Opinion Broward Jewish News Miami-Dade Jewish News Palm Beach Jewish News E-Newspaper City & Shore Magazine Obituaries Obituaries News Obituaries Place an Obituary Branded Content Paid Partner Content Advertising by Ascend Paid Content by Brandpoint Classified About our Ads Advertise Advertise Sign up for email newsletters Sign Up People on the Move: Mizner Country Club names… Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Bluesky (Opens in new window) Bluesky Subscribe Log in Account Settings Contact Us Log Out Spoof a user Sign up for email newsletters Sign Up Subscribe Log in Search 78°F Wednesday, September 10th 2025 Daily e-Edition Evening e-Edition Storms & Hurricanes Sports Local News Restaurants Real Estate Things To Do Opinion Puzzles Obituaries Trending: 🇺🇲 9/11 events in South Florida 🍝Dining deals 🎤 Best fall-winter concerts 🕍High Holy Days 🍂 Festivals this fall Sports Golf People on the Move: Mizner Country Club names golf professional, food and beverage manager Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Bluesky (Opens in new window) Bluesky Posted by jbecker32 Rosenberg is a partner with the national construction law firm Peckar & Abramson, P.C.  He has been recognized for 35 years in the categories Construction Law, Litigation - Real Estate and Real Estate Law. Posted by WRAGG Spicer will oversee all aspects of project construction operations from business development through project delivery. He'll also focus on client development, relationships with subcontractors, design professionals and business partners. Posted by mary00000147 Reed Smith attorney Eduardo De la Peña Bernal will serve as President of International Association of Young Lawyers (AIJA)'s International Arbitration Commission for the 2019-2022 term. Posted by tilsonpr2017 45 NCCI employees came together for the Lynn Cancer Institute Run for the Ribbons to raise money for research, education, and services for patients and their families. \r\nL-R: Carlos Menendez, Mitch Wiemer, Corey Mitleider, Victor Wong Posted by Adriana Lyles Amerant, the largest community bank headquartered in Florida, is proud to announce that Eduardo Bello, Wealth Management Business Manager, has been appointed to the Board of Directors of Hispanic Unity of Florida (HUF). Posted by DureeRoss Jon Fedele, CEO of PurWell, is pleased to announce that Nick DiFrancesco has joined as PurWell's Executive Vice President of Sales & Marketing. DiFrancesco brings more than 20 years of experience in the medical industry to his position. Posted by sdethomas Posted by DureeRoss Joseph P. Klock, Jr., Esq. was selected by his peers for inclusion in The Best Lawyers in America 2020 in the field of Commercial Litigation. Best Lawyers® has become universally regarded as the definitive guide to legal excellence. Posted by DureeRoss Ramón E. Rasco, Esq. was selected by his peers for inclusion in The Best Lawyers in America 2020 in the fields of Banking and Finance Law, and Commercial Transactions/UCC Law. Posted by Rosy Strategies, Inc. Dolan Dobrinsky Rosenblum, LLP Founding Partner, Manuel L. Dobrinsky, has been recognized by Florida Trend in the Florida Legal Elite 2019 in the area of Civil Trial. Posted by BARBARA GOLDBERG An experienced banquet chef, Chef Michael Vitetta brings over ten years of experience to Olivia Restaurant & Bar. Posted by lewis.greenberg Ashlie Forum has been promoted to Tax Partner at Marcum, a leading national accounting and advisory services firm. Mrs. Forum serves as the Real Estate and Construction Tax Services Leader for the Firm in the Southeast region. Posted by Rosy Strategies, Inc. Esther E. Galicia has been recognized by The Best Lawyers in America© 2020 for her work in Appellate Practice. Posted by monika8 ADL Florida is pleased to announce that Marsha Frith has been tapped to serve as Education Director for ADL Florida. Posted by WanderPR Bolay, the fast casual dining phenom making a splash across Florida, has recently named Karlie Barber to lead its newest location. Karlie joined the Bolay team in 2017 and currently oversees day-to-day operations within the restaurant. Posted by Chrissy Gibson Zachary Bihr has been promoted to Municipal Services Director for the City of Boca Raton. Zachary formerly served as the City's Assistant Engineer. Posted by Pierson Grant PR Randall Deich, computer science teacher and STEM coordinator at Lauderhill 6-12 STEM-MED, will receive the Office Depot Education Achievement Award for his dedication to a career in public education. Posted by Rosy Strategies, Inc. Fowler White Burnett Shareholder, Joseph R. Englander, has been named \"Lawyer of the Year\" for Trademark Law in Miami, Florida - an honor bestowed on only one lawyer in each practice area and metropolitan region annually. Posted by JULIE BOARDROOM COMM SILVER Sweatt serves as VP and Chief Information Security Officer for the Bank. Previously, he was an information technology and cybersecurity leader at the U.S. Department of Defense and the U.S. Department of Homeland Security. Posted by jbecker32 Sean focuses his practice on insurance services, particularly first and third party insurance matters and insurance coverage issues. He holds a JD degree from the University of Florida Levin College of Law. Posted by vallen2 Heather Needelman has become an associate attorney with Goren, Cherof, Doody & Ezrol.  Ms. Needelman's primary areas of practice are litigation; municipal and administrative matters; and contracts. Posted by jbecker32 Brodsky is a partner and Director of the Latin American Practice Group with the national construction law firm Peckar & Abramson, P.C.  He has been recognized for 10 years in the category Litigation - Construction. Posted by SAVANNAH WHALEY Dr. John Nicholas Melvan, M.D., Ph.D. joins Holy Cross Hospital's Jim Moran Heart and Vascular Center. Dr. Melvan's office is located in the Jim Moran Heart and Vascular Center in Fort Lauderdale. To make an appointment, call 954-267-6770. Posted by Adriana Lyles Patricia Gail Sanders previously worked for Fannie Hillman & Associates as an associate. She's  a member of the Florida Association of Realtors and the National Association of Realtors. she's also a Certified Negotiation Expert. Posted by Rosy Strategies, Inc. Robert D.W. Landon, III, has been recognized by The Best Lawyers in America© 2020 for his work in Commercial Litigation. Posted by SchwartzMedia Mr. Prieto leads the commercial litigation and class action practice at Podhurst Orseck. The International Academy of Trial Lawyers limits membership to a select group of 500 Fellows who have attained the highest level of advocacy. Posted by jbecker32 Trusty is a shareholder with Markowitz, Ringel, Trusty + Hartog. She focuses her practice on elder care, guardianship and complex commercial litigation and is dedicated to pro bono service in the community. Posted by jbecker32 Kammer is Co-National Practice Leader of Hinshaw & Culbertson's Insurance Services Practice Group. He has represented insurers throughout the US for more than 35 years on significant coverage matters including trials and appeals. Posted by Rosy Strategies, Inc. James N. Hurley has been recognized by The Best Lawyers in America© 2020 for his work in the areas of Admiralty and Maritime Law, and Transportation Law. Posted by DureeRoss James Crosland of Bryant Miller Olive was selected by his peers for inclusion in The Best Lawyers in America 2020 in Miami in the fields of Employment Law Management and Labor Law Management. He has been recognized for the past 20 years. Posted by Pierson Grant PR Douglas Harrison, City of Miami Senior Assistant City Attorney, will receive the Bank of America Community Achievement Award for significant accomplishments in any field. Posted by Maureen62 Linda Parsons joins Pacific National Bank as Senior Vice President for Commercial Banking in its new Loan Production Office in Broward County. Parsons was formerly the vice president for commercial banking at Seacoast National Bank. Posted by kdean01 Roger Kobert, a Partner with Weiss Serota Helfman Cole & Bierman, P.L., is one of only 20 Florida attorneys to become Board Certified in International Litigation & Arbitration. Posted by jbecker32 Rollnick has more than five decades of experience in business law with particular emphasis in real estate sales and acquisitions, commercial real estate and real estate-secured and asset based institutional loans. Posted by Reframed PR Marketing Brenda Lanza Brings Industry Expertise to the Role Posted by Rosy Strategies, Inc. Daniel D. Dolan II was recognized by The Best Lawyers in America© 2020 for his work in Medical Malpractice Law - Plaintiffs and Personal Injury Litigation - Plaintiffs. Posted by Rosy Strategies, Inc. Richard A. Wood has been recognized by The Best Lawyers in America© 2020 for his work in Real Estate Law. Posted by Rosy Strategies, Inc. Elizabeth Brooks Honkonen has been recognized by The Best Lawyers in America© 2020 for her work in Commercial Litigation. Posted by Rosy Strategies, Inc. Alice K. Sum has been recognized by The Best Lawyers in America© 2020 for her work in Commercial Litigation. Posted by Adriana Lyles Prior to joining EWM, Rafael Cordero served as a sales associate for Keller Williams in Miami Shores. He earned a bachelor's degree in business management and a minor in human resources from Curry College, located in Boston, Mass. Posted by Rosy Strategies, Inc. Douglas H. Patton has been recognized by The Best Lawyers in America© 2020 for his work in Antitrust Law. Posted by jbecker32 Josh is a Partner in the Corporate Group at Bilzin Sumberg. His practice involves forming private funds and advising on regulations affecting investment advisers. MFF is the premier network of finance and investment professionals. Posted by rbb  Communications Engage PEO has named Farrah Fielder as executive vice president. Reporting directly to the CEO, Fielder will oversee government affairs, internal HR, and client-facing HR compliance services for the company. Posted by Jennifer Beber Dr. DeSanctis has a proven record of student success, academic excellence, and educational leadership at Broward College. She was selected from a field of more than 70 candidates following a national search. Posted by jbecker32 Alina focuses on insurance-related matters including the defense of property issues, personal injury and premises liability litigation. She holds a JD degree, cum laude, from the University of Miami School of Law. Posted by The Pontes Group Gesandro DeOliveira joins Coastal Wealth, a member of the MassMutual Financial Group in their Fort Lauderdale office as the Managing Director. Posted by Pierson Grant PR Tim Hogans is an external affairs area manager for Florida Power & Light. He currently serves on several boards across South Florida and holds Bachelor of Science and Master of Science degrees in electrical engineering from FSU. Posted by monika8 ADL Florida is pleased to announce that Zohar Casden has been tapped to serve as the Associate Director of Development for ADL Florida. Posted by jbecker32 Robson is a partner with the law firm of Markowitz, Ringel, Trusty + Hartog. She is a member of the firm's bankruptcy practice and certified in business bankruptcy law by The American Board of Certification. Posted by jbecker32 Gentile is a partner with the national construction law firm Peckar & Abramson, P.C. She has been recognized for 10 years in the category Litigation - Construction. Posted by kdean01 Calderon takes on the new position with BoardroomPR after serving in a multi-media role with the firm for three years, bringing innovation and a distinct perspective to the firm and its clients. Posted by Rosy Strategies, Inc. Deborah S. Corbishley has been recognized by The Best Lawyers in America© 2020 for her work in Commercial Litigation. Posted by Adriana Lyles In addition to joining BHHS EWM Realty, Carlos Flores currently serves T J USA, LLC as an administration director and a managing partner. Flores earned business management and marketing degrees from Loyola University. Posted by rbb  Communications Maray Leal has joined nationally recognized public accounting firm, MBAF, as the director of human resources. She will play a key role in leading the firm's strategic recruiting efforts and employee programs. Posted by DureeRoss Leonard T. Marcinko, Esq. was selected by his peers for inclusion in The Best Lawyers in America 2020 in Atlanta in the field of Public Finance Law. Len has been selected by The Best Lawyers in America for the past 15 years. Posted by Rosy Strategies, Inc. Michael Nachwalter has been recognized by The Best Lawyers in America© 2020 for his work in Antitrust Law, Arbitration, Bet-the-Company Litigation, Commercial Litigation, Legal Malpractice-Defendants, and Mediation. Posted by SchwartzMedia Christina is the first Hispanic partner with the firm and is helping to grow its fast-expanding Family Law work. Posted by Jennifer Beber Dr. Coyne, who joined Broward College in 2013, has focused her career on guiding students to make educational choices mapped to careers that improve their quality of life and the local economy. Posted by SchwartzMedia Steven Hurwitz joins JLL as a Managing Director in South Florida. He was previously at Colliers International. In his new role, Hurwitz will support further growing the agency leasing business line across the region. Posted by EvClay_PR Hugo Mantilla has been named Palmer Trinity School's new Chairman of the Board of Trustees. His term will begin at the start of the 2019-2020 school year. The board's former chairman, Michael Baiamonte, will become Trustee Emeritus. Posted by monika8 ADL Florida is pleased to announce that Liat Altman has relocated to ADL's south Florida office to continue her work as the Director of Latin American Affairs at ADL. Posted by WRAGG Seco will lead the firm's enterprise-wide business systems along with various business initiatives critical to the continued growth and success of the company. She most recently served as the firm's Director of Business Applications. Posted by monika8 ADL Florida is pleased to announce that Jessica Schapiro has been tapped to serve as the Associate Director of Development for Miami at ADL Florida. Posted by DureeRoss Duane D. Draper, Esq. of Bryant Miller Olive P.A. was named the Best Lawyers® 2020 Public Finance Law \"Lawyer of the Year\" in Tampa and was recognized by The Best Lawyers in America 2020 in Tampa in the field of Public Finance Law. Posted by Maureen62 Healthy Start Coalition of Miami-Dade, the County's prenatal and infant care coalition, recently announced Jeannette Torres as the new director of programs. Posted by DureeRoss Jenna Reed Promoted to Vice President of Operations at Award-Winning South Florida and Aspen PR Firm Durée & Company Posted by Impact Players Laura Raybin Miller, a board member since 2000, was selected vice-chair. She is credited with, among other accomplishments, helping lessen the tax burden on the communities Memorial Healthcare System serves as a Safety Net provider. Posted by rbb  Communications South Florida PBS has appointed respected medical expert and active community volunteer leader Handel R. Robinson, MD, FACS, to its board of directors. Posted by tilsonpr2017 Team NCCI, consisting of 45 employees from The National Council on Compensation Insurance, participated in the Lynn Cancer Institute Run for the Ribbons, raising over $7,400 in donations. \r\nL-R: Chi-Fai Leong, Karen Richburg, Carlos Menendez Posted by tp000004 Zachary Carpenter joined WGI's Civil Division as a designer. He has specific expertise in civil engineering and design and holds an Associate of Applied Science degree from Northeast Mississippi Community College. Posted by yoreyes The Southeast Florida Chapter of the Alzheimer's Association has announced the selection of Jason Forstot, managing partner and wealth advisor at SWAN Wealth Management Group, as its new board chair. Posted by jembry1 Tara Pellegrino, general counsel for Now Optics, was the first female named to the company's leadership team in Jan. 2018. Posted by kdean01 Eric Hockman, a Partner with Weiss Serota Helfman Cole & Bierman, P.L., was elected as Secretary of the Dade County Bar Association (DCBA). Posted by Maureen62 Drew Saito joins Pacific National Bank as Senior Vice President for Commercial Banking in its new Loan Production Office in Broward County. Saito was formerly the senior vice president for commercial banking at Seacoast National Bank. Posted by DureeRoss Freedland was selected by his peers for inclusion in The Best Lawyers in America© 2020 in Fort Lauderdale in the field of Personal Injury Litigation - Plaintiffs. Posted by jbecker32 Shore concentrates his practice on complex trial and appellate litigation. His clients include international businesses, military and defense contractors, real estate investors, celebrities and professional athletes. Posted by rbb  Communications Respected medical expert and active community volunteer leader Margaret Eidson, MD, has been appointed to the South Florida PBS Board of Directors. Posted by Britney7 Part of the Fortune Development Sales Group team, Amy is an industry veteran with 24 years of luxury real estate experience. In her new role she will oversee sales and marketing initiatives for the property's 64 residences. Posted by rsher0 Marshall Dennehey Warner Coleman & Goggin, a leading civil defense litigation law firm, has added Jason S. Sandler and Jesse T. Schwartz as associates in the firm's Fort Lauderdale office. Posted by WilliamS26 Mr. Nash will act as the firm's Board representative to the American Resort Development Association (ARDA). He continues to serve as non-executive Chairman of Interval International and senior advisor to Marriott Vacations Worldwide. Posted by Rosy Strategies, Inc. Jeffrey T. Foreman has been recognized by The Best Lawyers in America© 2020 for his work in Commercial Litigation. Posted by Consensus The Best Lawyers in America® has selected Lester J. Perling, a partner at Nelson Mullins Broad and Cassel, for the 2020 \"Lawyer of the Year\" in Healthcare Law in Fort Lauderdale. Posted by WanderPR Bolay, the fast casual dining phenom making a splash across Florida, has recently named Colleen Brady to lead its newest Miami Lakes location. Colleen joined the Bolay team in 2016 and oversees day-to-day operations within the restaurant. Posted by juliana19 MOAD MDC has hired Nicole Martinez as their new Marketing & Membership Manager. Nicole will manage the Museum's marketing and membership platforms with a focus on expanding the institution's local & international footprint. Posted by Samantha Feld Carol Cassis and Stephan Burke bring top-performing team with over 70 years combined experience to Elliman's Miami Beach office Posted by jbecker32 Rollnick handled the purchase and financing for Miami's Westside Capital Group, a diversified real estate investment firm led by Jakub Hejl. The 337-unit garden-style apartment community in Tampa will be rebranded as Westshore Crossing. Posted by Rosy Strategies, Inc. Norman I. Weil has been recognized by The Best Lawyers in America© 2020 for his work in Real Estate Law. Posted by Julie Mullen Ariella Bloch, RCSWI, has taken on the role of Job Training Admissions and Care Coordinator at Boca Helping Hands. Previously, Ariella worked as the Boca Helping Hands Social Worker. Posted by madelinesklar West Palm Beach, Florida Attorney Nellie L. King was sworn in as Second Vice President of the National Association of Criminal Defense Lawyers (NACDL) at the Association's annual meeting in Philadelphia, PA, on August 3. Posted by Pierson Grant PR Anabel Evora is senior director of development for The Everglades Foundation. She has a Master of Science in Fundraising and Grantmaking from NYU's Heyman Center for Philanthropy and a B.S. in Public Relations and Marketing. Posted by Adriana Lyles Originally from Dijon, France, Frederic Dugourd was previously a real estate associate with Weichert Realtors. He earned a bachelor's degree in computer engineering from the University of France and has lived in Florida for 18 years. Posted by jbecker32 Shore's clients include international businesses, military and defense contractors, real estate investors, celebrities and professional athletes. He holds a J.D., magna cum laude, from the University of Miami School of Law. Posted by Rosy Strategies, Inc. Stanley H. Wakshlag has been recognized by The Best Lawyers in America© 2020 for his work in Commercial Litigation, Entertainment Law - Motion Pictures and Television, Litigation-Securities, and Securities/Capital Markets Law. Posted by Rosy Strategies, Inc. Brian D. Elias has been recognized by The Best Lawyers in America© 2020 for his work in Commercial Litigation. Posted by Impact Players Vic Narang, founder of GDKN Corporation, a global technology services firm, was selected board chair, succeeding Douglas A. Harrison. The hospital district and its commissioners oversee the actions of the Memorial Healthcare System. Posted by jbecker32 Markowitz is managing shareholder with Markowitz, Ringel, Trusty + Hartog. He is one of South Florida's leading business and bankruptcy reorganization law practitioners; and business and bankruptcy mediators. Posted by jembry1 Lukana Justin is the new, senior vice president of marketing for Now Optics, a leading eye health provider, with oversight of marketing strategy, communications, ecommerce, and customer analytics. Posted by tp000004 Cara Reichenbach joined WGI's Civil Division as a project engineer. She is a registered Professional Engineer and holds a master's degree in Civil Engineering from Villanova University. Posted by info000001803 Pace Branding & Marketing has promoted longtime employee Morgan Pandula to Operations Manager/Media Buyer. Posted by WordWorkPR Vivien Balcker, financial advisor with Ameriprise Financial in Ft. Lauderdale, FL has been named a recipient of the 2019 Five Star Wealth Manager award by Five Star Professional. Ms. Balcker has 19 years of experience in financial services. Posted by jbecker32 Brodsky is a partner and Director of the Latin American Practice Group with the national construction law firm Peckar & Abramson, P.C.  He has been recognized for 10 years in the category Litigation - Construction. Posted by Pierson Grant PR Henri W. Crockett, founder and president of Crockett Foundation, Inc., will receive the JM Family Enterprises, Inc. Youth Impact Award for his positive impression on the lives of thousands of children. Posted by jbecker32 Grigsby is a partner with Hinshaw & Culbertson LLP. Recognized in the Insurance Law and Litigation - Insurance categories, he has a civil trial practice that includes extensive experience in insurance issues. Posted by The Pontes Group Gesandro DeOliveira joins Coastal Wealth, a member of the MassMutual Financial Group in their Fort Lauderdale office as the Managing Director. Posted by DureeRoss JoLinda L. Herring, Esq. of Bryant Miller Olive P.A. was selected by her peers for inclusion in The Best Lawyers in America 2020 in Miami in the field of Public Finance Law and was first listed by The Best Lawyers in America in 2019. Posted by The Pontes Group Richard Sterling Price joins  Coastal Wealth, a member of the MassMutual Financial Group in their Fort Lauderdale office as the Managing Associate. Posted by Rosy Strategies, Inc. Kenny Nachwalter Shareholder, Christina M. Ceballos-Levy, has been recognized by The Best Lawyers in America© 2020. Posted by Rosy Strategies, Inc. June G. Hoffman has been recognized by The Best Lawyers in America© 2020 for her work in Appellate Practice. Posted by jbecker32 Weinstein represents companies and individuals in white collar criminal defense, seized asset recovery, financial fraud investigations, corporate compliance, anti-money laundering, FCA and FCPA matters. Posted by rsher0 Brandon Esquenazi joins Kelley Kronenberg.  He assists in handling matters related to Third Party Insurance Defense and General Liability. Prior to joining the firm, Esquenazi was an Attorney for an insurance defense law firm in New York. Posted by The Pontes Group Marcia Gooden-George joins Coastal Wealth, a member of the MassMutual Financial Group in their Fort Lauderdale office as a Financial Services Representative. Posted by DureeRoss Randall C. Clement, Esq. was selected for inclusion in The Best Lawyers in America 2020 in Orlando in the field of Public Finance Law and has been recognized by The Best Lawyers in America for the past 15 years. Posted by Joanne Polin Real estate powerhouse, Ashley Cooper, recently joined Lang Realty, where he will partner with Marc Schafler to create the \"Cooper and Schafler Team.\" Posted by Rosy Strategies, Inc. Richard Alan Arnold was recognized by The Best Lawyers in America© 2020 for his work in Antitrust Law and Commercial Litigation. Posted by JULIE BOARDROOM COMM SILVER The board is composed of top business, civic and academic leaders throughout the state.  Their mission is to improve the life and economic well-being of all Floridians through better, business-driven public policy. Posted by Rosy Strategies, Inc. Coxhead is a shareholder in the Aviation, Commercial Litigation, and Products Liability & Toxic Tort practice groups at Fowler White Burnett. Posted by jembry1 Morgan Diaz joins Now Optics, a leading eye health provider, as its senior vice president of operations and business development. Diaz is responsible for overseeing the company's retail, clinical, and franchise operations.. Posted by Rosy Strategies, Inc. J. Michael Pennekamp has been recognized by The Best Lawyers in America© 2020 for his work in Insurance Law. Posted by Sue.arrowsmith Dr. Eduardo J. Padrón awarded prestigious Certificate of Stock from the Greater Miami Chamber of Commerce in recognition of his stellar career and outstanding service to the community. Posted by cindyschutt Owned by Chad Van Horn, Esq., Van Horn Law Group, P.A., was named as one of the the top 5,000 fastest-growing, privately held companies in the United States this week. Posted by Jungle Ruler Lynch will support the organization's goals by coordinating its major gifts program, including selecting and identifying major gifts prospects, as well as cultivating relationships with key donors in the local community. Posted by nemmanuel Dr. Amoy Reid is the Associate Dean of Academic Affairs for Broward College. She has a Ph.D. in Education, Child and Youth Studies from Nova Southeastern University. Posted by jbecker32 Erica is a partner in the Real Estate Practice at Katz Barron. Her practice includes acquisition, development, construction, leasing and financing transactions. MFF is the premier network of finance and investment professionals. Posted by Adriana Lyles Denise Georges at Coral Gables-based law firm Colson Hicks Eidson, was selected by the Cystic Fibrosis Foundation for its prestigious \"40 Under 40 Outstanding Lawyers in South Florida\" recognition. Posted by Pierson Grant PR Miguel Pilgram is founder of The Pilgram Group, a 9-year-old lifestyle brand based in Ft. Lauderdale that spans from real estate renovating to eateries and executive suites. His latest endeavor was the opening of NYSW Jazz Lounge in 2018. Posted by Rosy Strategies, Inc. Scott E. Perwin has been recognized by The Best Lawyers in America© 2020 for his work in Appellate Practice, Bet-the-Company Litigation, and Litigation-Antitrust. Posted by Nadia Mehriary FBMC Benefits Management, Inc. has promoted President David Faulkenberry to President and CEO. Faulkenberry joined FBMC in 2011 and is responsible for the the overall leadership, strategy and corporate direction of the organization. Posted by Rosy Strategies, Inc. Allan R. Kelley has been recognized by The Best Lawyers in America© 2020 for his work in Admiralty and Maritime Law. Posted by rbb  Communications Dolores Sukhdeo, President and CEO of South Florida PBS, has been recognized by Florida Public Media for her work as Chair of the Board from 2017-2019. She was honored on July 29 at Florida Public Media's annual meeting. Posted by Rosy Strategies, Inc. Manuel L. Dobrinsky was recognized by The Best Lawyers in America© 2020 for his work in Medical Malpractice Law - Plaintiffs, Personal Injury Litigation - Plaintiffs, and Product Liability Litigation - Plaintiffs. Posted by jbecker32 Hartog is a shareholder with the law firm of Markowitz, Ringel, Trusty + Hartog. He concentrates on the representation of trustees, creditors, creditors' committees, and debtors in cases. Posted by Stir-Communications Transwestern appoints Andrea Lopez as Managing Senior Vice President, Asset Services Posted by jbecker32 Edgard represents clients in first and third party insurance matters focusing on those involving property and casualty claims and complex commercial construction disputes. He holds a JD degree from the University of Miami School of Law. Posted by JULIE BOARDROOM COMM SILVER Weiss Serota Helfman Cole & Bierman, P.L. announces that Belinda Bacon has joined the firm as Of Counsel. Bacon is based in the firm's Coral Gables office. Posted by Adriana Lyles Rebeca Tinoco previously served Bellini condominium as an administrative assistant and is an active member of the MIAMI Association of REALTORS. Originally from Nicaragua, Tinoco has lived in Florida for 20 years. Posted by jbecker32 Ringel is a founding shareholder with Markowitz, Ringel, Trusty + Hartog. He one of Miami's foremost real estate attorneys handling residential and commercial real estate closings in South Florida. Posted by Maureen62 Jeffrey Cannon joins Pacific National Bank as Executive Vice President and Broward County Executive in its new Loan Production Office in Broward County. Cannon was formerly the senior VP and senior loan officer for Seacoast National Bank. Posted by Adriana Lyles Carolina Mesias previously worked in operations and finance for Bacardi USA. She attended Santa Fe Community College and the University of Florida, where she earned an economics degree in food and resources. Posted by rbb  Communications Berger Singerman named Jordi Guso as its new managing partner, effective January 1, 2020. Guso was elected on September 18 for a four-year term by the firm's equity partners as part of a strategic succession and leadership transition plan. Posted by WRAGG Rodriguez joins Shutts in Miami from Greenberg Traurig, where she served as Chair of its Miami Appellate Department and a member of its National Appellate Practice. Posted by JULIE BOARDROOM COMM SILVER Carlson joins a team that is actively seeking building opportunities from Miami to Vero Beach. Pulte's Southeast Florida Division builds between 800 and 900 homes per year with prices starting in the high $200s. Posted by kelly0171 John Carr of Venture Construction Group has been named Chairman of the Palm Beach North Chamber of Commerce, which spans 10 Palm Beach County municipalities from Tequesta to Riviera Beach, and serves more than 1,000 business members. Posted by tp000004 David M.Y. Millikan, P.E. joined WGI's Transportation Division as vice president, Texas transportation regional manager. He is a registered Professional Engineer in several states and holds a bachelor's degree in Civil Engineering. Posted by DureeRoss Kenneth R. Artin, Esq. was selected by his peers for inclusion in The Best Lawyers in America 2020 in Orlando in the field of Public Finance Law. The first year Ken was listed in any practice area in The Best Lawyers in America was 2008. Posted by SAVANNAH WHALEY Shelly Bradshaw, vice president of operations at the Broward Center for the Performing Arts, has been named chair of the Leadership Broward Board of Directors. Posted by SAVANNAH WHALEY Broward County Arts & Culture Visionary award recipients: WLRN (represented by Ross Cooper), Andrew Martineau, Jodi Jeffreys-Tanner, Phillip Dunlap, Evan Snow, Darran Blake and George Gadson Posted by Pamela Calder Boca Raton resident, Ellen Gechter, has been named the new President of JARC FL Board of Directors. Gechter has been involved with JARC for 8 years now and is excited to continue JARC's positive growth within the community. Posted by rbb  Communications MSC Cruises USA-the North American arm of MSC Cruises, the Swiss-based world's largest privately-owned cruise line-announced that Alex Acosta has joined MSC Cruises USA as Manager of Meetings, Incentives & Corporate Events and Charter Sales Posted by jbecker32 Reisman is the Vice Chairman of the national construction law firm Peckar & Abramson, P.C.  He has been recognized for 15 years in the categories Construction Law and Litigation - Construction. Posted by lewis.greenberg Moises Ariza has been promoted to Audit Partner at Marcum, a leading accounting and advisory services firm. Mr. Ariza specializes in assurance services for local governments, nonprofit organizations and employee benefit plans. Posted by Rosy Strategies, Inc. John Strickroot has been recognized by The Best Lawyers in America© 2020 for his work in Real Estate Law. Posted by Adriana Lyles Nathalie Rader has been named general manager of The Ritz-Carlton Residences, Sunny Isles Beach by the condominium's developers, Fortune International Group and Château Group. Rader will oversee daily operations in the oceanfront tower. Posted by Rosy Strategies, Inc. John H. Friedhoff has been recognized by The Best Lawyers in America© 2020 for his work in Corporate Law. Posted by jbecker32 Levi defends matters involving no-fault benefits and representing carriers in arbitrations and court. His experience includes working as in-house counsel for a NY insurance firm. He is admitted in Florida, New Jersey and New York. Posted by jbecker32 Rossana has 14 years of experience in So Fl. Her background in civil litigation in state and federal court make her a well-rounded lawyer who can handle any aspect of a case. She received a JD from the University of Miami School of Law. Posted by Pierson Grant PR Michelle Kefford, principal of Marjory Stoneman Douglas High School, will receive the Office Depot Education Achievement Award for her dedication to a career in public education. Posted by DureeRoss Harwin was selected by his peers for inclusion in The Best Lawyers in America© 2020 in Fort Lauderdale in the field of Personal Injury Litigation - Plaintiffs. Posted by sdethomas Williams Island announced the promotion of seasoned human resource hospitality executive, Debra Lavoie, as the community's Vice President of Operations, Human Resources, Training and Development. Posted by Impact Players Karen Harrington, a cancer survivor and former candidate for the U.S. Congress, was elected secretary/treasurer. Her goal is to to help improve the Memorial Healthcare System for the benefit of all Broward County residents. Posted by Pierson Grant PR Shanti Bruce is a Professor at Nova Southeastern University. Bruce has published five books, earned two international awards for published scholarship and has given more than 60 peer-reviewed and invited presentations. Posted by Adriana Lyles Christopher Gil previously worked for Golden Acre Real Estate in Miami Lakes as a sales associate. A Miami native, Gil has been in the real estate industry for more than three years. Posted by mvf000001 Omnia Family Wealth welcomes Alexandra Quitko, CPA, to the team. She will be exclusively focused on serving client families, and will discuss wealth planning and investment strategy, taxes and risk management, among other financial topics. Posted by Adriana Lyles Juan Flores currently works for T J USA, LLC as a managing partner, in addition to being an associate with BHHS EWM Realty. He is also a member of the Cary's Hope for Education Foundation. Posted by Rosy Strategies, Inc. Randy Rosenblum was recognized by The Best Lawyers in America© 2020 for his work in Medical Malpractice Law - Plaintiffs, Personal Injury Litigation - Plaintiffs, and Product Liability Litigation - Plaintiffs. Posted by Rosy Strategies, Inc. James D. DeChurch has been recognized by The Best Lawyers in America© 2020 for his work in Medical Malpractice Law-Defendants. Posted by JULIE BOARDROOM COMM SILVER KW Property Management & Consulting (KWPMC), a premier residential property management company that recently celebrated its 15th anniversary, has promoted Zuly Maribona to Senior Vice President. Posted by Pierson Grant PR Rep. Patricia H. Williams, Florida State House Representative, District 92, will receive the Bank of America Community Achievement Award for significant accomplishments in any field. Posted by Samantha Feld Carol Cassis and Stephan Burke Bring top-performing team with over 70 years combined experience to Elliman's Miami Beach office Posted by The Pontes Group Richard Sterling Price joins Coastal Wealth, a member of the MassMutual Financial Group in their Fort Lauderdale office as an Managing Associate. Posted by jbecker32 Stein is the Miami Co-Managing Partner with the national construction law firm Peckar & Abramson, P.C.  He has been recognized for 15 years in the categories Commercial Litigation, Construction Law and Litigation - Construction. Posted by carcos Baker Donelson is pleased to announce that Mark P. Schnapp, special counsel in the firm's Fort Lauderdale office, has been selected by his peers for inclusion in the 2020 edition of The Best Lawyers in America© for Criminal Defense. Posted by jbecker32 Gentile is a partner with the national construction law firm Peckar & Abramson, P.C. She has been recognized for 10 years in the category Litigation - Construction. Posted by jbecker32 Sklar is a partner with the national construction law firm Peckar & Abramson, P.C.  He has been recognized for 10 years in the categories Construction Law and Litigation - Construction. Posted by Pierson Grant PR Juliette Lippman, attorney with Birnbaum, Lippman & Gregoire, PLLC, will receive the Bank of America Community Achievement Award for significant accomplishments in any field. Posted by Rosy Strategies, Inc. KNPA Shareholder, Stanley H. Wakshlag, has been appointed by the Supreme Court of Florida to membership on the Florida Board of Bar Examiners. His term of office will extend through October 31, 2024. Posted by Adriana Lyles In addition to now being a real estate associate with BHHS EWM Realty, Yeisel Rodriguez works as a general manager for Developing New Horizons Inc. He earned a bachelor's degree in psychology from Keiser University. Posted by crubal The certified public accounting firm of Caler, Donten, Levine, Cohen, Porter and Veil, P.A. (CDL) is pleased to announce that Martin R. Woods, CPA,  has been promoted to Shareholder. Posted by lucia.gonzalez Jamie has left The Keyes Company and joined Apex Capital Realty. As Commercial Advisor, Jamie will specialize in commercial land sales with a special focus on urban core neighborhoods and redevelopment sites across Miami and Miami Beach. Posted by rsher0 Lilli Balik has joined Kelley Kronenberg. She assists in handling First Party Insurance Defense Litigation matters. Before joining, she represented clients in Fair Housing Act and ADA Title III claims at a general litigation practice. Posted by EvClay_PR Bacardi, an alumna of Palmer Trinity ('93) has been assisting the school in various capacities since 2017 including admissions showcases, and as a member of the Parent Education Committee and the PTS Alumni Board. Posted by SchwartzMedia Doug Okun joins JLL as a Managing Director in South Florida. He was previously at Colliers International. In his new role, Okun will support further growing the agency leasing business line across the region. Posted by Adriana Lyles Richard Canales previously worked for Fair Fax Realty ERA. He's a member of the MIAMI Association of REALTORS and serves in the organization's Military Affairs committee. He served the U.S. Marine Corps and was awarded 3 Purple Hearts. Posted by Reframed PR Marketing New Store Manager Brings Years of Industry Experience Posted by rbb  Communications Berger Singerman is pleased to announce that Florida Bar Board Certified expert in Intellectual Property (IP) law, Heidi Howard Tandy, has joined the firm as a partner on the Dispute Resolution Team. Posted by aworthington1 Chef Ryan Corbin joins the team at Boca Woods Country Club as the new Executive Chef. Posted by aadams12 Lesser Lesser Landy & Smith Partners Gary S. Lesser, Joseph B. Landy, and Michael S. Smith have been named to the Lawdragon 500 Leading Plaintiff Consumer Lawyers. Only 29 lawyers from the South Florida region were included. Posted by bcpr00 Chef Eric Charron is the newly appointed Executive Chef of the landmark Miami Restaurant, Rusty Pelican. Charron is a homegrown talent who has risen through the ranks and is now at the helm of this iconic dining destination. Posted by EvClay_PR Cortinas, VP of IT Shared Services at Interval International, has served as secretary, president-elect, and president of the school's Parents' Association and supported the Soaring capital campaign. Posted by jbecker32 Handfinger is the Miami Co-Managing Partner with the national construction law firm Peckar & Abramson, P.C.  He was selected in the categories Construction Law and Litigation - Construction. Posted by Rosy Strategies, Inc. Elizabeth Pryor Johnson has been recognized by The Best Lawyers in America© 2020 for her work in Employment Law-Management. Posted by Adriana Lyles Milisse Vera previously worked for Academica Virtual Education as a virtual teacher. A Miami native, she earned a Bachelor of Science degree in elementary education from Florida International University. Posted by jbecker32 Stacy focuses on defense of insurance-related matters and has experience in all phases of litigation including premises liability and personal injury. She holds a JD degree, cum laude, from the University of Miami School of Law. Posted by Pierson Grant PR Zack Crockett, vice president of Crockett Foundation, will receive the JM Family Enterprises, Inc. Youth Impact Award for his positive impression on the lives of thousands of children. Posted by tp000004 Aisling O'Reilly joined WGI's Traffic Planning Division as a transportation planner. As a recent graduate, she holds a Bachelor of Science degree in Urban Studies from the University of Minnesota. Posted by Pierson Grant PR Ralph A. Aiello, III, Director of School Counseling & BRACE Advisement for Broward County Public Schools, will receive the Office Depot Education Achievement Award for his dedication to a career in public education. Posted by Rosy Strategies, Inc. William J. Blechman was recognized by The Best Lawyers in America© 2020 for his work in Antitrust Law. Posted by Charlie Beeler Bankers Healthcare Group (BHG), the leading provider of financial solutions for healthcare professionals, has promoted Danielle Walker to Chief Strategic Officer, the first to hold the title at BHG. Posted by SAVANNAH WHALEY Giulia Valmassoi, Thema Optical's North American Division CEO, has been named one of Vision Monday's Most Influential Women in Optical. Posted by Adriana Lyles Previously, Mariana Rojas was part of the top-producing Oscar Teran Group at Avanti Way Realty. She earned a bachelor's degree in economics from Andres Bello Catholic University and an MBA from The University of Pennsylvania. Show Caption Posted by jbecker32 1 of 199 Rosenberg is a partner with the national construction law firm Peckar & Abramson, P.C.  He has been recognized for 35 years in the categories Construction Law, Litigation - Real Estate and Real Estate Law. Expand By Cindy Kent UPDATED: April 5, 2019 at 9:14 AM EDT Lifestyle Stefan Brunt was appointed director of golf at Mizner Country Club, a private golf community in Delray Beach.Brunt recently worked for Sawgrass Country Club in Northern Florida as the head golf professional. Before that, he worked for Bear Lakes Country Club in West Palm Beach. Additionally, Rouby Lamy was appointed food and beverage manager at Mizner Country Club.He most recently worked at Trump National Golf Club in Jupiter. Previously, Lamy spent five years at St. Andrews Country Club, and at at the Breakers Hotel in Palm Beach. Finance Frank Gonzalez has been named managing principal of the Miami office of accounting firm MBAF. BFS Capital, a technology-enabled small business financing platform, has appointed Ken Murray as chief marketing officer in Coral Springs. Murray is responsible for customer acquisition and loyalty marketing efforts, including demand generation, communications, marketing analytics, digital, channel development and brand management. Real estate Martha Jolicoeur and Maria Mendelsohn , real estate agents specializing in equestrian clientele in the Wellington area, have joined the Sports & Entertainment division of Douglas Elliman Real Estate. These people have joined EWM Realty International, an affiliate of Christie’s International Real Estate for Miami-Dade and Broward counties, in its Las Olas office in Fort Lauderdale: Raymond Fadis, Brittany Lewis, Melissa Louden, Sean Macneir, Matthew McCarthy, Brittany Reilly, Jo Reynolds and Natalie Sessa . Peter H. Chinnock has joined NAI Rauch Weaver Norfleet Kurtz & Co. as a senior associate in Fort Lauderdale. Chinnock previously worked as a landlord representative for Penn Florida Realty Corp. and before that at Stiles Corp. where he managed its industrial and office portfolio in the Boca Raton area. Additionally Chinnock was an asset manager for National Life of Vermont, Greenwin-Florida Enterprises and Morely Properties of Orlando. Cushman & Wakefield announced that Director Michael H. Feldman has been hired in the firm’s West Palm Beach office. Previously, Feldman was the managing director of property services for Aurum Property Partners and also served as director of leasing for AW Property Co., where he oversaw the leasing of that firm’s Florida professional and medical office portfolio. Prior to that, he was vice president of acquisitions and asset management with NetLease USA, a national investor of net leased properties. Christel Silver , owner of Silver International Realty in Delray Beach, recently received the Global Realtorof the Year Award from the RealtorsAssociation of the Palm Beaches. She also received the Global Achievement Platinum Award from the National Association of Realtors.The Global Realtorof the Year Award recognizes a member who has added significantly to the quality of the association’s programs, services and benefits to its members, through participation in educational programs, committees and meetings at the local, state and national level. The Global Achievement Platinum Award recognizes Silver’s activity and leadership on the Global Business Committee of the Florida Realtors,of which she was the 2015 Chair. Jarred M. Goodstein has joined Colliers International South Florida, from CBRE, as senior vice president, based in Colliers’ Fort Lauderdale office. Marine The Italian Sea Group shipbuilding conglomerate that owns and operates brands such as Admiral, Tecnomar and NCA, announced the opening of its new American office in Fort Lauderdale, which will be managed by Francesco Carbone , group vice chairman and new president of The Italian Sea Group Americas Inc. Law Clark, Fountain, La Vista, Prather, Keen and Littky-Rubin, a catastrophic personal injury law firm headquartered in West Palm Beach, announced that attorney Ben J. Whitman has joined its practice. Arnstein & Lehr LLP named Michael B. Denberg , the firm’s Fort Lauderdale managing partner, to its Executive Committee. Denberg co-chairs the Florida Real Estate Practice Group. David L. Hirschberg , partner at Gladstone & Weissman, P.A. in Boca Raton, was named a Florida Supreme Court Certified Family Law Mediator. Construction Ken Dyman has joined Schachne Architects and Builders, a Davie-based design/build firm, as an associate architect. Nonprofits The American Heart Association and American Stroke Association have named Pamela Rauch , vice president of development and external affairs at Florida Power & Light Co., as chairwoman of the 2016 Palm Beach County Go Red For Women Campaign. The 4th Annual Go Red For Women Luncheon takes place on April 7 at the Four Seasons Palm Beach. Education Brandon L. Hensler has been appointed as executive director of University Relations at Nova Southeastern University in Davie. Randal L. Martin , chief financial officer and executive vice president of The King’s Academy, will assume the role of president beginning June 1, when Jeffrey M. Loveland steps down from the position. Before The King’s Academy, Martin held the positions of vice president of accounting of Woolbright Development in Boca Raton and vice-president, controller and chief accounting officer for CRT Properties Inc. and Dycom Industries Inc. He is a former trustee of Palm Beach Atlantic University. Loveland was president for 17 years of the Christian school that serves more than 1,300 students from preschool through 12th grade in West Palm Beach, where has been involved for the past 37 years. He will continue as chief operating officer and special adviser to the president. He will continue to serve as a board member of The Florida Association of Christian Colleges and Schools. Medical Heather Pasitoniu has joined Delray Medical Center as the director of revenue analysis, overseeing the day-to-day operations of the business office. Pasitoniu most recently worked as a disputed claims manager for Conifer Health Solutions and was responsible for 12 Tenet hospitals across the Florida and Philadelphia regions. When she started at Tenet in 2004, she worked as an appeals specialist in the disputed claims department at the National Insurance Center in Boca Raton. She was then promoted to disputed claims supervisor the following year. Dr. Adam Schulman joins the Faulk Center for Counseling professional staff as program manager and clinical supervisor in Boca Raton. Schulman will provide input and support to maintain and enhance all clinical services. He will work as a clinical supervisor to psychology practicum students on all clinical work — child, adult, family and seniors — and will provide supplemental supervision to the internship program. In addition, Schulman will maintain his private practice and continue his role as an adjunct faculty member at Nova Southeastern University, where he teaches graduate level courses in clinical psychology. Hospitality Robert Goupil has joined Special Needs Group / Special Needs at Sea as contact center manager in Fort Lauderale. Goupil has managed call centers on shore and in South America and the Philippines. Before joining SNG, he was as the director of the national contact center for Hair Club. Before that he was the manager of logistics, forecasting and scheduling for Policy Studies Inc., which serves the State Children’s Health Insurance Programs in Florida and Georgia. In addition, he was director of individual and group reservations for American Classic Voyages and manager of reservations staffing/planning/payroll for Royal Caribbean International. Submit promotions, new hires to SunSentinel.com/peopleonthemove or e-mail peopleonthemove@sunsentinel.com . For more information contact ckent@tribune.com , 954-356-4662, or Twitter @mindingyourbiz. Originally Published: January 15, 2016 at 11:34 AM EST Share this: Click to share on Facebook (Opens in new window) Facebook Click to share on X (Opens in new window) X Click to share on Bluesky (Opens in new window) Bluesky RevContent Feed Most Popular Most Popular Florida to get season’s first ‘cold’ front this weekend, but South Florida might be out of luck Florida to get season's first ‘cold’ front this weekend, but South Florida might be out of luck YNW Melly co-defendant pleads no contest as accessory to murder YNW Melly co-defendant pleads no contest as accessory to murder Florida’s ban on open carry of guns is unconstitutional, appeals court rules Florida's ban on open carry of guns is unconstitutional, appeals court rules Dolphins Q&A: Could Mike McDaniel and Chris Grier be fired as soon as next week? Dolphins Q&A: Could Mike McDaniel and Chris Grier be fired as soon as next week? TGI Fridays’ closure after 40 years in Coral Springs leaves only memories TGI Fridays' closure after 40 years in Coral Springs leaves only memories Conservative activist Charlie Kirk assassinated at Utah university Conservative activist Charlie Kirk assassinated at Utah university Dave Hyde: Grier, McDaniel and Tua have Dolphins careers on line Dave Hyde: Grier, McDaniel and Tua have Dolphins careers on line Idyllic small Florida town divided by move to add Donald Trump’s name to iconic street Idyllic small Florida town divided by move to add Donald Trump’s name to iconic street Lack of access to vaccines frustrates Floridians seeking COVID, flu, RSV shots Lack of access to vaccines frustrates Floridians seeking COVID, flu, RSV shots Delray Beach agrees to join other cities in challenging Florida’s street-art ban Delray Beach agrees to join other cities in challenging Florida's street-art ban More in Sports Chris Perkins: Here’s how laidback Dolphins coach Mike McDaniel expresses anger to players Dolphins’ Tua looks to correct turnover issues ahead of facing Patriots Meet the former Miami alum and coach working to help USF upset the Hurricanes What are the odds? Hornets schedule, then cancel, Sports Betting night coinciding with appearance by Heat’s Rozier 2016 January 15 Tribune Publishing Chicago Tribune The Morning Call of Pa. Daily Press of Va. New York Daily News Orlando Sentinel Hartford Courant The Virginian-Pilot Studio 1847 Company Info About us Careers Archives Sun Sentinel Store Contact Us Photo Requests Submit a News Tips Newspaper Archives Manage Subscription e-Edition Sign up for Newsletters Help Center Site Map Advertise with Us Place an ad Ad Policy Homes for Sale Place an Auto Ad Classified Find a Job Legal Notices Subscribe Now Subscriber Terms and Conditions Terms of Service Privacy Policy Cookie Preferences Cookie Policy CA Notice at Collection CA Notice of Financial Incentive Do Not Sell/Share My Personal Information Copyright © 2025 Sun Sentinel Close"
    }
  ]
}