{
  "fuentes": [
    {
      "url": "https://mode.miami/pulse/the-ultimate-guide-to-a-night-out-at-mode-miami-premier-nightclub/",
      "email": "info@mode.miami"
    },
    {
      "url": "https://www.tagvenue.com/us/rooms/miami/87918/mode-downtown-miami/basement-nightclub-lounge",
      "email": "pin-red-58-3@x2.png"
    },
    {
      "url": "https://www.myempireenergy.com/contact",
      "email": "sales@myempireenergy.com"
    },
    {
      "url": "https://fireflyteamevents.com/blog/miami-team-building-ideas/",
      "email": "events@fireflyteamevents.com"
    },
    {
      "url": "https://www.mode.miami/about/",
      "email": "info@mode.miami"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "customercare@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "alvarezv@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "costar@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "craigk@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "customercare@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "director@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "fitosa@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "fowlerw@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "iturreym@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "jarraj@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "khalill@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "lauk@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "lopezly@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "millayl@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "programs@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "rodriguezj@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "shipleyje@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "stilesm@mdpls.org"
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "email": "thompsonl@mdpls.org"
    },
    {
      "url": "https://www.mocanomi.org/about/staff",
      "email": "communications@mocanomi.org"
    },
    {
      "url": "https://www.mocanomi.org/about/staff",
      "email": "info@mocanomi.org"
    },
    {
      "url": "https://mode.miami/event/she-knows-the-owner-2024-09-15/",
      "email": "info@mode.miami"
    },
    {
      "url": "https://www.mdc.edu/fashion/about.aspx",
      "email": "crctitleixada@mdc.edu"
    },
    {
      "url": "https://www.mdc.edu/fashion/about.aspx",
      "email": "equityoff@mdc.edu"
    },
    {
      "url": "https://www.mode.miami/contact/",
      "email": "info@mode.miami"
    },
    {
      "url": "https://www.mode.miami/reservations",
      "email": "info@mode.miami"
    },
    {
      "url": "https://mode.miami/",
      "email": "info@mode.miami"
    },
    {
      "url": "https://www.mode.miami/events/",
      "email": "info@mode.miami"
    },
    {
      "url": "https://www.mode.miami/event/jazz-night-with-query-2024-03-05/",
      "email": "info@mode.miami"
    },
    {
      "url": "https://linktr.ee/mode.miami",
      "email": "info@mode.miami"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "email": "jeni@getvows.com"
    },
    {
      "url": "https://mode.miami/event/hedonism-miami-burn-decompression-2024-09-29/",
      "email": "info@mode.miami"
    }
  ],
  "mails": [
    "alvarezv@mdpls.org",
    "communications@mocanomi.org",
    "costar@mdpls.org",
    "craigk@mdpls.org",
    "crctitleixada@mdc.edu",
    "customercare@mdpls.org",
    "director@mdpls.org",
    "equityoff@mdc.edu",
    "events@fireflyteamevents.com",
    "fitosa@mdpls.org",
    "fowlerw@mdpls.org",
    "info@mocanomi.org",
    "info@mode.miami",
    "iturreym@mdpls.org",
    "jarraj@mdpls.org",
    "jeni@getvows.com",
    "khalill@mdpls.org",
    "lauk@mdpls.org",
    "lopezly@mdpls.org",
    "millayl@mdpls.org",
    "pin-red-58-3@x2.png",
    "programs@mdpls.org",
    "rodriguezj@mdpls.org",
    "sales@myempireenergy.com",
    "shipleyje@mdpls.org",
    "stilesm@mdpls.org",
    "thompsonl@mdpls.org"
  ],
  "nombre_sitio": "mode.miami",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://mode.miami/pulse/the-ultimate-guide-to-a-night-out-at-mode-miami-premier-nightclub/",
      "text": "The Ultimate Guide to a Night Out at MODE: Miami's Premier Nightclub | MODE Downtown Miami MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS The Ultimate Guide to a Night Out at MODE: Miami's Premier Nightclub Welcome to MODE, where Miami nightlife reaches its peak. Whether you're a local or a visitor, a night out at MODE promises an unforgettable experience in Downtown Miami. This comprehensive guide will take you from arrival to the last dance, ensuring you make the most of your time at Miami's premier nightclub. Arriving at MODE Getting There: Situated in the heart of Downtown Miami, MODE is easily accessible by car, rideshare, or public transportation. With ample nearby parking and convenient access, arriving at MODE is as smooth as our signature cocktails. Dress The Vibe: At MODE, style is paramount. We celebrate individuality and fashion-forward thinking, so put on your trendiest attire and join us for a night of sophistication and fun. The Entrance The Welcome: As you step into MODE, you'll be greeted by our friendly staff who are here to ensure you have an amazing night. Our door policy ensures a vibrant yet respectful crowd, making your night enjoyable and hassle-free. The Atmosphere: MODE's ambiance is a blend of vintage elegance and modern chic. With green hues, sophisticated dark wooden accents, and dim, mysterious lighting, the cocktail bar sets the stage for an exquisite night out. Enjoying the Cocktail Bar Signature Cocktails: Start your evening at our stunning cocktail bar. Our menu features a curated selection of drinks that tell a story with every sip. Don’t miss the Miami Spice, a smoky and sweet delight with Union Mezcal and a spicy mango cube. Happy Hour: From Thursday through Saturday, enjoy Happy Hour from 7 PM to 9 PM with $5 beers, $7 wines, and house spirits for just $8. It’s the perfect time to unwind and savor our expertly crafted cocktails. Vinyl Forward: MODE’s cocktail bar features a curated mix of music, genres, and styles. Our selection of local talented musicians ensures a vibrant soundtrack to your night, blending the latest hits with underground gems. The Music and Dance Floors L-Acoustics Sound System: Both our cocktail bar and Downstairs Lounge are equipped with state-of-the-art L-Acoustics sound systems, providing the best audio experience in Miami. Each beat and melody is delivered with clarity, enhancing your musical journey. Giant Mirror Ball: The cocktail bar's dance floor is graced by a giant mirror ball that sets an incredible vibe for a night of dancing and celebration. Downstairs, the lounge is filled with multiple mirror balls, creating a mesmerizing light show that captivates and energizes the dance floor. The Downstairs Lounge: As the night progresses, head to the Downstairs Lounge. Here, you’ll be immersed in an intimate setting with red hues and a captivating light show. The multiple mirror balls and state-of-the-art sound system create a personal connection to the music, making it an unforgettable experience. The Dance Floor Unmatched Vibes: At MODE, the dance floor is where the magic happens. From the moment you step in, you'll be swept away by the energy of the crowd and the rhythm of the music. Our resident DJs and international guests bring a diverse range of sounds, from house to techno, keeping you dancing all night. Special Events: MODE is known for its exclusive events. From Comedy Nights featuring top local comedians to live music on Fridays, there’s always something happening at MODE. Be sure to check our event calendar and secure your tickets early. Wrapping Up Last Call: As the night winds down, enjoy one last cocktail and soak in the final moments of your night at MODE. Our bartenders are always ready to craft something special just for you. Planning Your Next Visit: Once you've experienced a night at MODE, you'll understand why it's one of the best nightclubs in Miami. Follow us on Instagram and sign up for our newsletter to stay updated on upcoming events and exclusive offers. Why MODE is Miami's Premier Nightclub Unparalleled Experience: From the elegant cocktail bar to the high-energy Downstairs Lounge, MODE offers a unique and unforgettable night out in Downtown Miami. Top-Notch Sound System: Our L-Acoustics sound system provides the best audio experience in the city, ensuring every note and beat is crystal clear. Exquisite Cocktails: Our cocktail menu is designed to impress, featuring a mix of classic and innovative drinks that highlight the best of Miami's cocktail scene. Vibrant Atmosphere: MODE's blend of vintage and modern design, combined with our diverse music lineup, creates an atmosphere that’s both inviting and exciting. Whether you're looking for the best nightclubs in Miami or the top spots for cocktails in Downtown Miami, MODE is the place to be. Plan your visit and experience the ultimate Miami nightlife destination. See you on the dance floor! UPCOMING EVENTS VIEW ALL Thu Sep 11 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Sep 11 2025 | 10:00 PM - LATE Hesoyam Records Showcase ABOVE MORE INFO Thu Sep 11 2025 | 11:00 PM - LATE Sunkissed Sounds BELOW MORE INFO WANT TO BOOK A PRIVATE EVENT? GET A QUOTE 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://www.tagvenue.com/us/rooms/miami/87918/mode-downtown-miami/basement-nightclub-lounge",
      "text": "Basement Nightclub & Lounge - MODE Downtown MIami - Event Venue Rental - Tagvenue.com See all 5 photos Basement Nightclub & Lounge at MODE Downtown MIami Nightclub · Whole venue 1 review – Read all 2 South Miami Avenue, Miami, FL 33130 – Show map Downtown Miami, FL Up to 150 seats Up to 250 standing Venue offers catering External catering allowed About this space Hidden beneath the vibrant streets of Downtown Miami, MODE’s Basement Nightclub & Lounge offers a dynamic and immersive setting for your next unforgettable event. This unique space combines intimacy and energy, creating the perfect atmosphere for exclusive gatherings, celebrations, and nightlife experiences. Powered by a state-of-the-art L-Acoustics sound system, the Basement transforms every event into an auditory masterpiece. With its adaptable layout, warm lighting, and comfortable seating, this versatile venue is ideal for hosting anything from corporate events to private parties and brand activations. Whether you envision a pulsating dance floor or a sophisticated lounge vibe, the Basement is designed to bring your vision to life. Every detail, from the immersive sound to our top-tier service, is curated to ensure your guests leave with lasting memories. Elevate your event in a space where rhythm meets refinement. Contact us today to learn more about renting MODE’s Basement Nightclub & Lounge for your next extraordinary occasion. Prices Sunday 7:00 am –\n                5:00 am from $2000–$12000 min. spend Per morning 7:00 am –\n                12:00 pm from $2000 min. spend Per afternoon 12:00 pm –\n                5:00 pm from $2500 min. spend Per evening 5:00 pm –\n                10:00 pm from $3000 min. spend Per evening 10:00 pm –\n                5:00 am from $12000 min. spend Note: Alcohol licence until 5:00 am.\n                                    All prices include sales tax. Monday 7:00 am –\n                5:00 am from $2000–$5000 min. spend Per morning 7:00 am –\n                12:00 pm from $2000 min. spend Per afternoon 12:00 pm –\n                5:00 pm from $2500 min. spend Per evening 5:00 pm –\n                10:00 pm from $3000 min. spend Per evening 10:00 pm –\n                5:00 am from $5000 min. spend Note: Alcohol licence until 5:00 am.\n                                    All prices include sales tax. Tuesday 7:00 am –\n                5:00 am from $2000–$5000 min. spend Per morning 7:00 am –\n                12:00 pm from $2000 min. spend Per afternoon 12:00 pm –\n                5:00 pm from $2500 min. spend Per evening 5:00 pm –\n                10:00 pm from $3000 min. spend Per evening 10:00 pm –\n                5:00 am from $5000 min. spend Note: Alcohol licence until 5:00 am.\n                                    All prices include sales tax. Wednesday 7:00 am –\n                5:00 am from $2000–$5000 min. spend Per morning 7:00 am –\n                12:00 pm from $2000 min. spend Per afternoon 12:00 pm –\n                5:00 pm from $2500 min. spend Per evening 5:00 pm –\n                10:00 pm from $3000 min. spend Per evening 10:00 pm –\n                5:00 am from $5000 min. spend Note: Alcohol licence until 5:00 am.\n                                    All prices include sales tax. Thursday 7:00 am –\n                5:00 am from $2000–$12000 min. spend Per morning 7:00 am –\n                12:00 pm from $2000 min. spend Per afternoon 12:00 pm –\n                5:00 pm from $2500 min. spend Per evening 5:00 pm –\n                10:00 pm from $3000 min. spend Per evening 10:00 pm –\n                5:00 am from $12000 min. spend Note: Alcohol licence until 5:00 am.\n                                    All prices include sales tax. Friday 7:00 am –\n                5:00 am from $2000–$12000 min. spend Per morning 7:00 am –\n                12:00 pm from $2000 min. spend Per afternoon 12:00 pm –\n                5:00 pm from $2500 min. spend Per evening 5:00 pm –\n                10:00 pm from $3000 min. spend Per evening 10:00 pm –\n                5:00 am from $12000 min. spend Note: Alcohol licence until 5:00 am.\n                                    All prices include sales tax. Saturday 7:00 am –\n                5:00 am from $2000–$12000 min. spend Per morning 7:00 am –\n                12:00 pm from $2000 min. spend Per afternoon 12:00 pm –\n                5:00 pm from $2500 min. spend Per evening 5:00 pm –\n                10:00 pm from $3000 min. spend Per evening 10:00 pm –\n                5:00 am from $12000 min. spend Note: Alcohol licence until 5:00 am.\n                                    All prices include sales tax. Pricing updated by venue 7 months ago Capacity Standing up to 250 Cabaret up to 150 Catering and drinks In-house catering available Complimentary water American cuisine External catering allowed Buyout fee for external catering Kitchen facilities available for guests Venue provides alcohol Alcohol licence until 5:00 am No BYO alcohol allowed Facilities Wi-Fi available Projector PA system / speakers Air conditioner Storage space Free on-street parking Paid parking facilities available nearby Flatscreen TV Whiteboard Flipchart Conference call facilities Natural light Quiet space Alcohol licence Music & sound equipment Play your own music Bring your own DJ Space has noise restriction\n                                                                                after 05:00 Accessibility Accessible toilets Ground level Accessible parking spot available Lift to all floors Cargo lift Wheelchair accessible Rules of the space Allowed events Promoted and ticketed events No wedding licence No temporary Event Notice (TENs) available Host rules We have flexible rules that can cater to events based on needs. Cancellation policy: Flexible Show cancellation details Cancellations 7 days in advance will receive a full refund. Cancellations 7 days to 24 hours in advance will receive a 50% refund. Cancellations for events starting within 24 hours are non-refundable. Event date of a confirmed booking can be changed to another date within 1 months from the original date, at no cost. Reviews and ratings 5.0 (1\n                review and rating - Read all ) Verified reviews come from Tagvenue users. All reviews are checked by our team to uphold our trust and safety standards. FG Fidel G. Verified review Birthday Party · 120 guests\n\n                                            · June 2025 Everything was great , the location and the staff was amazing I would recommend this place to anyone wanting to host a party or event . Submitted 2 months ago 5.0 Show all reviews About MODE Downtown MIami Located in the heart of Downtown Miami, MODE offers more than just nightlife—it's a versatile space ready to host everything from private celebrations to corporate functions. Our 2,500-square-foot venue is split across multiple floors, each fully equipped with Wi-Fi, VIP seating, and 3 full bar areas (one above, two below). Housed in a former Cold War fallout shelter, MODE is infused with history and character, creating an immersive atmosphere ideal for any occasion. We stand out thanks to our L-Acoustics Arcs sound system, delivering a premium audio experience that makes every performance, presentation, or reception unforgettable. Our focus on intimacy and personal connection means we’re not your typical mega club—our setup is thoughtfully designed by a team with deep roots in top nightclubs and festivals. Whether you’re envisioning a cutting-edge music event, a product launch, or a milestone party, MODE seamlessly blends innovative cocktails, curated entertainment, and a warm, adaptable space that caters to your specific needs. Welcome to MODE, where we make it personal. We look forward to helping you host a memorable event that resonates with both you and your guests. Other spaces and event packages at this venue from $2000 minimum spend  / per morning Cocktail Bar in a Nightclub Whole venue 100 Above: Cocktail Bar & Lounge Location Meet your host Richard Barrenechea Member of Tagvenue since January 2025 1 Review 5 Rating 2h Response time 84% Response rate Contact venue managers directly on Tagvenue. Keep all event communication here for a secure, seamless booking. United States > Miami > MODE Downtown MIami > Basement Nightclub & Lounge Similar spaces from $50 per person  / per session Bar Whole venue 125 200 Cucu's Nest Bar Miami Beach, FL from $1500 hire fee  / per session Museum Whole venue 250 250 Cubaocho Museum & Performing Arts Center Little Havana, Miami, FL from $100 per person  / per session Dining Room in a Restaurant Private space 140 250 Baoli (1) Miami Beach, FL from $200 hire fee  / per hour Bar Whole venue 190 200 Abyss Events Miramar Isles, FL from $100 per person  / per session Bar Whole venue 250 300 Da Cave Miami Golden Glades, North Miami from $300 hire fee  / per hour Warehouse Whole venue 200 250 Black Box Media Miami (1) Central North Miami, FL from $750 hire fee  / per hour Gallery Whole venue 250 250 Wynwood Urban Art Studio Wynwood Art District, Miami, FL from $7000 hire fee  / per day Gallery Whole venue 200 300 MAMAN Fine Art Gallery Allapattah, Miami, FL from $1000 hire fee  / per hour Museum Whole venue 90 150 Museum of Graffiti (1) Wynwood Art District, Miami, FL from $100 per person  / per session Restaurant Whole venue 150 170 Rakija Lounge Miami Beach, FL Tagvenue Australia Tagvenue Canada Tagvenue Ireland Tagvenue Singapore Tagvenue UK Tagvenue USA Users Why Tagvenue User login Venues Why list with us List your venue Venue login Tagvenue About us Help Centre Contact us Careers Terms & Privacy Press Blog Locations Popular events © 2025 Tagvenue.\n            All rights reserved."
    },
    {
      "url": "https://www.myempireenergy.com/contact",
      "text": "Contact | Reach Out Today — Trusted Power Solutions 0 Skip to Content Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Services Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Service Area Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Open Menu Close Menu Home Folder: Services Back Solar Only Roof & Solar Packages Solar & Mini-Splits Solar Programs & Incentives Home Owner Reviews Hablamos Español! FAQ's Folder: Service Area Back Rhode Island Providence, RI Newport Massachusetts Connecticut About Contact Free Home Assessment Contact Us If you’re interested in learning more about the potential savings solar can do for your home, fill out the information below and we’ll contact you! \"By providing your phone number and/or email, you consent to receive automated and non-automated marketing calls, texts, and account-related updates from Empire Energy (401)-336-6798 . Consent is not a condition of purchase. Message & data rates may apply. Reply STOP to opt out.\" Name * First Name Last Name Email * Message * Phone (###) ### #### Thank you! Or you can email us at: Sales@MyEmpireEnergy.com Contact us About us Services Reviews (401)-336-6798 Support@MyEmpireEnergy.com Address 1007 Waterman Ave. East Providence, RI 02914 Company Follow us!"
    },
    {
      "url": "https://fireflyteamevents.com/blog/miami-team-building-ideas/",
      "text": "31 Memorable Miami Team-Building Ideas - FireFly Team Events Home Team Building Activities All Activities Charity Team Building [CSR] DIY Team Building Activities Scavenger Hunts Virtual Team Building Tournament Team Building Training & Workshops Group Activities Locations About Us Who We Are Client Reviews Why Team Build Team Building for Meeting Planners Social Team Building Team Training Join Our Team FAQ Team Building Blog Talk To Us Click to open the search input field Click to open the search input field Search Menu Menu Link to Facebook Link to Instagram Link to Youtube Team Building Blog You are here: Home 1 / Team Building Blog 2 / Team Building 3 / 31 Memorable Miami Team-Building Ideas 31 Memorable Miami Team-Building Ideas March 31, 2025 / in Team Building , Team Building Idea / by James Bennett Miami is more than just a spring break destination for the swimsuit-clad youth. It’s also a fantastic place to bring your corporate team for some fun in the sun that also encourages a bit of bonding. The following list of Miami team-building ideas will help you organize your time in Florida’s party city. We recommend choosing one of the first three events—designed and orchestrated by us at Firefly—if you have specific team-building goals you’d like to meet, such as improving collaboration, giving back to the community, or encouraging a healthy sense of competition. Unless all our happy customers are just being nice and telling us what we want to hear, our events are a blast and you’re in for a great time! Otherwise, pick whatever sounds fun and have at it! You’re already spending the dough to take your team out for a good time. Let our team-building experts at Firefly make sure you get a return on investment you’ll be thrilled with. Table of Contents 1. Launch It! Rocket Challenge 2. Charity Bike Build: A CSR Team Activity 3. Float This! Boat Build 4. The Great Escape Room 5. Cozymeal 6. Candle Land 7. K1 Speed Go Kartz 8. InBattle Virtual Reality Arena 9. Fox in a Box Escape Room 10. Delirium Axe Throwing 11. Exit Escape Room 12. Castle Harbor Boating School 13. Island Queen Cruises and Tours 14. Axe Habits 15. Oleta River Outdoor Center 16. Cauley Square Historic Village 17. Thriller Miami Speedboat Adventures 18. Blue Point SUP 19. Pedal Pub Miami 20. Arcade Odyssey 21. Cooking Classes Miami 22. Schnebly Redland’s Winery & Brewery 23. 786 Bartend 24. Sip and Salsa 25. Everglades Airboat Adventures 26. Miami Brew Bus 27. Cycle Party 28. Treetop Trekking Miami 29. Hollywood Hot Glass 30. The Edge Rock Gym 31. Wynwood Miami 31 Super Awesome Miami Team-Building Ideas 1. Launch It! Rocket Challenge This event will help you launch your company to greatness, because each team member’s creative problem-solving skills will take off like a rocket once they master our rocket-building challenge. Cheesy puns aside, you can expect a day of outdoor fun, technical challenges, and team bonding. This event is a great choice for groups with a lot of tech-y expertise or those who want to practice putting their heads together to work through complex situations. Pricing: Starts at $5,000 Group Size: 25 or more Address: Any outdoor site that’s at least 100 feet by 300 feet. Neighborhood: Any Website 2. Charity Bike Build: A CSR Team Activity What fosters a sense of community more than building and donating bikes to children who need them? This charity event not only benefits children but also your team, who will emerge with newly honed collaborative skills and have a ton of fun in the process. The basics: Teams receive an empty bike frame to start off the event. To complete the bike, teams must win challenges, earn more parts, and assemble each component. Once the bikes are finished, they will be donated—along with a heartfelt card you’ll also design—to a charity that ensures they wind up in the hands of some very grateful kiddos. Pricing: Starts at $5,000 Group Size: 25–500 Address: Anywhere outdoors or indoors in Miami Neighborhood: Any Website 3. Float This! Boat Build While you’re in Miami, take advantage of the beautiful stretches of beach the city is known for! Bring your group to the shore and we’ll supply them with creative and unusual boat-building materials. Teams will complete challenges to win extra materials and design a (hopefully) functional boat. The best, most seaworthy vessel wins! Teams that don’t work together should plan to get a little wet… Pricing: Starts at $5,500 Group Size: 25 or more Address: Anywhere in Miami with beach or pool access Neighborhood: Any Website 4. The Great Escape Room Immerse your team in a thrilling adventure at an escape room, where collaboration is the key to success. Locked in a room, participants must unite to unravel clues and conquer challenges strategically scattered throughout. Effective communication becomes paramount in handling unexpected hurdles, emphasizing the need for flexibility and open-mindedness. The Great Escape Room’s intricately designed rooms foster appreciation for each team member’s strengths, promoting a shared understanding of individual contributions. This unique team-building experience offers valuable insights into group dynamics, creating a relaxed yet professional atmosphere. Pricing: Call for group rates Group Size: Up to 100 people Address: 2315 S. Le Jeune Rd., Ste 200, Miami, FL Website 5. Cozymeal This exceptional team-building experience in Miami seamlessly blends entertainment and gastronomic delights. You’ll engage with a local professional chef who will guide you and your colleagues through a culinary journey, offering options like crafting handmade sushi, preparing homemade pasta, or participating in a friendly cooking competition. Regardless of the chosen experience, you can count on enjoying delectable gourmet food in the company of your team. From the thrill of hands-on culinary adventures to the camaraderie fostered during friendly cooking competitions, these activities promise not only memorable entertainment but also a shared appreciation for fine dining. Pricing: Pricing varies by class Group Size: For teams of all sizes Address: Multiple locations Website 6. Candle Land Heat up your next team-building experience with a trip to Candle Land! Candle Land offers a distinctive opportunity for guests to craft personalized candles. Each visit to Candle Land is a one-of-a-kind experience that includes a diverse selection of vessels and fragrances and enthusiastic instructors. With a commitment to eliciting smiles, Candle Land staff members strive to ensure each moment you spend there is a guaranteed source of joy. If you’re looking to spread some warmth and happiness among your team, try this unique candle-making outing. Pricing: Contact them for group pricing Group Size: 15–20 people Address: 2311 NW Second Ave., Miami, FL Website 7. K1 Speed Go Kartz Looking for an exhilarating venue near Miami for your upcoming company party or corporate event? Bring your team to K1 Speed Miami. This offering combines on- and off-kart excitement as participants collaborate to maximize points for their teams, aiming for the top spot on the podium. Beyond the thrill, these activities naturally promote skills that are vital for teams; they also boost morale, enhance leadership visibility, build confidence, and increase overall group effectiveness. Elevate your corporate event with the unmatched excitement and team-building advantages of K1 Speed Miami. Pricing: Call for pricing Group Size: Up to 30 people Address: 8600 NW South River Dr., Medley, FL Website 8. InBattle Virtual Reality Arena Have a team that would be interested in virtual reality gaming? InBattle is a great place to dive into the world of competitive online gaming, where strategy, skill, and excitement converge. InBattle’s innovative VR experience offers an array of cutting-edge features and functionalities. For seasoned gamers and newcomers alike, InBattle experiences foster camaraderie and provide adrenaline-pumping challenges. Pricing: Contact for pricing Group Size: Up to 8 players Address: 2818 NW 5th Ave., Miami, FL Website 9. Fox in a Box Escape Room Elevate your corporate team-building experience with Fox in a Box Miami’s Escape Room adventure! Unleash the power of teamwork as your colleagues apply logic and creativity to conquer intricate puzzles and challenges. Its escape rooms provide the perfect setting for fostering communication, problem-solving, and camaraderie. The facility can accommodate up to 50 players per time slot, making this a good team-building event for large groups. For a more exclusive experience, you can elect to take advantage of their private facility rentals and dedicated conference room. You can also customize your team-building adventure to fit your organization’s needs and objectives. Pricing: Contact for pricing Group Size: Up to 50 people Address: 28 SE 1st St., Miami, FL Website 10. Delirium Axe Throwing Replace your traditional and often dreaded corporate retreats with this engaging, memorable, and fun alternative. Axe throwing offers a variety of mental, physical, and logical challenges that will help boost workplace productivity, promote effective collaboration, and inject a sense of excitement into the work environment. Endorsed by publications like Forbes and companies like Google, Facebook, and Amazon, axe throwing is a dynamic, in-person activity crucial for fostering face-to-face interactions, particularly in the current era of remote work. Pricing: $25–$32 per person Group Size: Up to 6 per throwing lane Address: 10920 West Flagler Street, Suite 207/208, Miami, FL Website 11. Exit Escape Room The corporate world makes most people want to escape from time to time, so why not indulge the fantasy and try out another escape room? (We kid.) But seriously: Your group can experience the ultimate team-building adventure at Exit Escape Room Miami. Their meticulously designed games not only challenge participants’ problem-solving skills but also emphasize the crucial role of teamwork. Your group will engage in a thrilling environment where logic and common sense converge, requiring teams to think outside the box, communicate effectively, and rely on each other’s strengths. Pricing: Call for pricing Group Size: Can accommodate all size groups by booking multiple escape rooms! Address: 515 NW 26th St., Miami, FL Website 12. Castle Harbor Boating School Embark on an exhilarating team-building journey with Castle Harbor’s most popular program: One-Design Keelboat Fleet Racing. In this unique experience, up to ten teams—each comprising four members led by a dedicated coach—engage in thrilling “round the buoys” races, emulating the strategies of professional sailing on a scaled-down level. Beyond honing sailing skills, participants delve into the psychology of clever team dynamics, elevating their performance levels and shaping strategic goals. This isn’t merely a learn-to-sail program but a goal-oriented adventure where newcomers and experienced sailors alike unite for great fun. The half-day activity encompasses orientation, team selection, strategy development, safety procedures, and a debriefing, all customizable to fit any schedule or specific agenda. Expect active participation, professionally trained crews, top-notch sailboats, and an unforgettable experience. Pricing: Call for pricing Group Size: Up to 10 teams. Team sizes can vary. Address: 9610 Old Cutler Road, Coral Gables, FL Website 13. Island Queen Cruises and Tours Miami provides the perfect backdrop for corporate conferences, and these private charters offer a distinctive and dynamic setting. Experience top-rated service and ambiance, making your corporate event an exceptional voyage on the waters of Miami. Its charter consultants prioritize attention to detail, team coordination, and unmatched event production expertise to ensure your team has a fun and productive outing. Pricing: Call for pricing Group Size: Up to 400 passengers Address: 401 Biscayne Blvd., Miami, FL Website 14. Axe Habits Unleash your inner lumberjack at Miami’s premier indoor axe throwing range. Its “Axeperts” provide a safe and enjoyable environment, guiding your group through the art of axe throwing. You’ll also discover games like “21” and “Around the World,” where precision meets excitement. As noted in previous entries, an axe throwing event guarantees a memorable bonding experience. Axe Habits also offers a mobile trailer that brings the excitement to you! Pricing: $35–$60 per person Group Size: 2–10 people Address: 540 N. Miami Ave. Fl 2, Miami, FL Website 15. Oleta River Outdoor Center Embark on a team-building adventure with Oleta River Outdoor Center, just moments away from North Miami Beach. Your group can dive into the thrill of off-road bicycling or glide along the serene waters via paddle boards or kayaks. Both activities foster teamwork and bonding while everyone takes in the scenic beauty of the Oleta River. Whether on land or water, Oleta River Outdoor Center promises an unforgettable team-building journey that blends adventure, nature, and a collaborative spirit in the heart of South Florida. Pricing: Pricing varies please call for more details (park Entry fees not included in ticket price) Group Size: All sizes Address: 3400 NE 163rd Street, North Miami Beach, FL Website 16. Cauley Square Historic Village Step into the charm of Old South Florida at its finest at Cauley Square, a historic village that offers a nostalgic glimpse into the past. Nestled in the heart of Miami, this enchanting destination boasts a collection of quaint cottages and shops, each brimming with unique character. Cauley Square’s cobblestone pathways and lush gardens make an idyllic setting for team gatherings, celebrations, and memorable moments. Experience the magic of Old South Florida and create lasting memories with your team at Cauley Square. Pricing: Free to the public Group Size: All sizes Address: 22400 Old Dixie Hwy., Miami, FL Website 17. Thriller Miami Speedboat Adventures The Thriller Speedboat Tour sets sail from the iconic Bayside Marketplace in Downtown Miami. This unique tour promises the ultimate sightseeing experience in authentic “Miami Vice-style.” Cruise along the Atlantic Ocean to witness the opulent celebrity mansions adorning Star Island and Fisher Island, explore the sun-kissed shores of Miami Beach, and marvel at the iconic Art Deco district of South Beach. Immerse your team in the thrill of the open sea, fostering camaraderie and creating unforgettable memories against the stunning backdrop of Miami’s coastal treasures. The Thriller Speedboat Tour is not just a journey; it’s a team-building odyssey like no other. Pricing: Pricing varies by boat, group size, and itinerary Group Size: Up to 75 guests Address: Multiple locations Website 18. Blue Point SUP Include a workout for the mind and body in your next team-building adventure! Stand up paddle (SUP) surfing is a variant of traditional surfing where riders stand on a surfboard and propel themselves with a paddle. This engaging physical activity provides a holistic workout that engages nearly all muscle groups. Its inclusive nature ensures that anyone, regardless of age, size, or athletic condition, can partake in the excitement. Beyond the physical benefits, SUP provides a unique vantage point of the water. Whether exploring harbors and lakes or riding ocean swells, stand up paddle surfing promises to be an enjoyable experience for all. Pricing: $35 for 1-hour rental, $75 for a 1-hour lesson Group Size: Groups of all sizes Address: 3602 Rickenbacker Causeway, Miami, FL Website 19. Pedal Pub Miami Take a tour of Miami while getting in a bit of exercise and bonding with your team. You’ll experience the thrill of collective pedaling while savoring cold beverages and creating lasting memories. Pedal Pub’s commitment to fun, safety, and environmental consciousness ensures a team-building event that is not only exhilarating but also aligns with a sustainable ethos. Elevate your team’s spirit and unity with Pedal Pub, where fearlessness meets fun on the city streets! Pricing: Private tours start at $500 per bike Group Size: Up to 15 people per bike Address: 175 NW 20th St., Miami, FL Website 20. Arcade Odyssey Immerse your team in a gaming haven that boasts the finest selection, from Fighters to Shoot’ em-ups, featuring new releases, ultra-rare finds, imported gems, and cherished classics. This dynamic space hosts an ever-changing lineup of pinball machines, music games, and an array of Japanese snacks and beverages. They also offer a unique team-building experience where groups can engage in friendly competitions, collaboratively conquer challenges, and foster camaraderie amidst the vibrant arcade ambiance. Whether you’re seeking retro nostalgia or cutting-edge fun, this arcade might be just what your team is looking for! Pricing: No cover fee; pay per game Group Size: All group sizes Address: 12045 SW 117 Avenue, Miami, FL Website 21. Cooking Classes Miami Test out your team’s skills in the kitchen at Cooking Classes Miami. This venue blends fun and hands-on experiences to inspire culinary creativity, giving teams the chance to delve into cooking techniques, food history, and chemistry. Their cooking classes are tailored for everyone, from novices to seasoned professionals. Embrace the team-building benefits of cooking together in these dynamic classes, where collaboration, communication, and shared creativity flourish. Pricing: Price varies per class Group Size: Class sizes vary Address: Various locations Website 22. Schnebly Redland’s Winery & Brewery Sometimes the best way to bond with your team is over a drink or two! Schnebly Winery, the Southernmost Winery in the United States, offers a unique selection of exotic tropical fruit wines in a beautiful setting featuring gorgeous waterfalls surrounded by tiki huts. Enjoy wine tastings, farm to table food, live music, and much more! At this charming winery, every sip is an invitation to savor moments of camaraderie. Private areas are available to rent if you have a large group; give them a call to inquire. Pricing: No entry fee; pay per drink Group Size: Groups of all sizes welcome Address: 30205 SW 217th Ave., Homestead FL Website 23. 786 Bartend This mixology class and interactive cocktail-making workshop offers an unforgettable experience. Under the expert guidance of their professionals, this class empowers you and your team to master bartending basics through hands-on practical experience. Picture yourself relishing the sophistication of a Bourbon Peach Smash, crafted at the renowned Milk and Honey bar in New York, or immersing in the vibrant carnival ambiance of Rio de Janeiro with a refreshing Caipirinha in hand. Explore cocktails from across the globe, from El Floridita’s Papa Doble, created exclusively for Ernest Hemingway, to the lively Bora Bora Sangria from Ibiza. Pricing: $149 per person for groups of 12 or more Group Size: 12 or more; if you have a smaller group reach out for pricing Address: Miami Lakes, Miami, FL Website 24. Sip and Salsa Spice things up with a new spin on team building activities at Salsa Mia’s Sip & Salsa. Awarded Best of Miami, this amazing nightlife experience is a fun night out in a relaxed and inviting atmosphere where your team can mix and mingle with like-minded people from all over the world. Indulge in handcrafted Mojitos, savor delicious appetizers, and learn enough Salsa and Bachata to enjoy the dance floor after the lessons in front of a live band. Pricing: $79 Group Size: 30–130 Address: 900 Ocean Dr., Miami Beach, FL Website 25. Everglades Airboat Adventures Here, the thrill of the ride meets the joy of bonding with your team. Feel the excitement build as your team navigates through the intricate waterways, encountering the unique flora and fauna of the wetlands. Whether it’s the thrill of spotting wildlife or the collective laughter as the airboat makes its twists and turns, every moment becomes a memory etched in camaraderie. The airboat tour offers more than just a scenic ride—it creates a dynamic environment for teamwork and shared enjoyment. Foster connections, build trust, and strengthen relationships as you revel in the natural beauty around you. For thrill-seekers to nature enthusiasts, an airboat tour provides a perfect blend of excitement and team bonding. Pricing: $60 per person Group Size: 6 people per boat Address: 5334 FL-90, Miami, FL Website 26. Miami Brew Bus The opening of several new breweries in late 2013 and early 2014 sent Miami into a frenzy looking for ways to visit them all. The explosion of wildly delicious craft beer left beer geeks in a tough spot when trying to decide which breweries to hit first. But at the time, no one was providing an opportunity to safely experience them all—hence, the Miami Brew Bus was born. Its mission is this: to take you on the best tasting tour of Miami’s locally brewed craft beer and create an experience that will leave you feeling connected to South Florida and its local ingredients. Whether you’re a tourist, a local, or something in-between, now you can enjoy brewery-hopping while getting ‘schooled’ on the booming craft beer scene in Miami. Pricing: $105 pp Group Size: 4–500 Address: 1547 SW 8th Street, Miami, FL Website 27. Cycle Party Step outside the conventional corporate event setting and dive into a world of fun, connection, and adventure with Cycle Party’s Corporate Events. Perfect for team building, client entertaining, and celebrating achievements, these tours offer a unique and engaging experience that leaves a lasting impression. Strengthen your team’s bonds and foster a positive work culture as your team pedals together, laughs together, and grows together. From scavenger hunts to game shows, they offer a variety of activities to keep the energy high and ensure everyone is involved. You can even tailor your corporate event to suit your objectives, whether it’s a lunch tour, a dinner adventure, or a happy hour escapade. Pricing: Starting at $39 per person Group Size: 6–16 per bike Address: 128 NE 28th Street, Miami, FL Website 28. Treetop Trekking Miami Escape the office and share an unforgettable outdoor experience with your co-workers. Treetop Trekking Miami’s adventure activities are the perfect outing for groups of all types. Feel the stress of the workplace fly away as your group explores the aerial obstacle courses together. Get to know your colleagues on a whole new level as you take on this challenge as a team. Work together to find your strengths and weaknesses and work as a group in a fun activity. These skills can then be taken back to the workplace! Pricing: $49.99 Group Size: No limit Address: 1111 Parrot Jungle Trail, Miami FL Website 29. Hollywood Hot Glass Ignite creativity and teamwork with a captivating Glass Blowing Team Building Experience—an extraordinary journey into the world of molten artistry. Step into the heart of the glass studio, where the ancient craft of glass blowing transforms into a dynamic team-building adventure. Under the guidance of skilled artisans, your team will delve into the mesmerizing process of shaping and molding molten glass into unique creations. Embrace the heat of the furnace and the exhilaration of collaboration as you and your colleagues craft personalized glass pieces. From vibrant ornaments to intricate sculptures, each creation reflects the synergy and creativity of your team. Pricing: $200 per hour Group Size: Up to 100 Address: One Young Circle, Hollywood, FL Website 30. The Edge Rock Gym Reach new heights with your next team-building event at the Edge Rock Gym. Under the guidance of experienced instructors, your group will scale vertical walls, navigate bouldering challenges, and conquer obstacles, fostering teamwork and mutual support. The gym caters to all skill levels. The rock climbing gym transcends conventional team-building activities, offering a unique combination of physical and mental engagement. Each ascent becomes a metaphor for overcoming obstacles, promoting problem-solving, and reinforcing the importance of collaboration. Experience the thrill of teamwork in a vertical arena, where every climb is a shared adventure and triumph. Pricing: $500 for up to 25 people Group Size: Up to 25 Address: 13972 SW 139 Ct., Miami, FL Website 31. Wynwood Miami Sometimes the best way to bond with your team is a free outing to explore a new part of the city. We give you… Wynwood! Known for its many colorful murals, Wynwood is one of the city’s most happening districts. Wynwood Walls is an outdoor museum showcasing large-scale works by some of the world’s best-known street artists. The surrounding streets have converted warehouses housing craft breweries and funky art galleries. A hip young crowd frequents the neighborhood’s chic clothing boutiques, stylish bistros and late-night bars. Explore the amazing artwork, grab a beer and enjoy all the amenities Wynwood offers. Pricing: Free to the public Group Size: Groups of any size Address: Arts District Website Get more great Miami team-building ideas from our experts at Firefly! If you’ve worked your way through the above list and nothing lights you up, reach out to us at Firefly Team Events and let us know your goals, hopes, and dreams for the perfect team-building event. We’ll help you find what you’re looking for or design a custom event from scratch! Shoot us a request here. Notice: JavaScript is required for this content. Share this entry Share on Facebook Share on X Share on WhatsApp Share on Pinterest Share on LinkedIn Share on Reddit Share by Mail Link to Instagram Link to Youtube https://fireflyteamevents.com/wp-content/uploads/2024/04/memorable-miami-team-building-ideas-blog-header-1.webp 423 1200 James Bennett https://fireflyteamevents.com/wp-content/uploads/2021/05/ff_website_main-495x226.png James Bennett 2025-03-31 12:06:19 2025-03-31 13:55:00 31 Memorable Miami Team-Building Ideas Recent Posts Your team is WAY more creative than you think 21 Best Team Building Activities in San Antonio A Crazy-Fun Group Game To Play With Drones Team Design Beats Team Building All Day Long What if surveys (even post-workshop surveys) were fun? Talk To Us Ph. 877.267.1939 em. events@fireflyteamevents.com Team Building Blog Privacy Policy © Copyright - FireFly Team Events - Enfold Theme by Kriesi Link to: 27 Fantastic Nashville Team-building Ideas For 2025 Link to: 27 Fantastic Nashville Team-building Ideas For 2025 27 Fantastic Nashville Team-building Ideas For 2025 Link to: 23 Awesome Venice, CA Team-building Ideas Link to: 23 Awesome Venice, CA Team-building Ideas 23 Awesome Venice, CA Team-building Ideas Scroll to top Scroll to top Scroll to top"
    },
    {
      "url": "https://www.mode.miami/about/",
      "text": "MODE Downtown Miami | A Cultural Hub of Music, Art, and Mixology MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS ABOUT Culture, Expressed Located in the heart of Downtown Miami, MODE is more than just a nightclub. It’s a sanctuary for music lovers, creatives, and cultural tastemakers. As one of the top Miami nightclubs, MODE offers a polite alternative to the city’s mercenary nightlife, with a focus on intimacy, authenticity, and connection. Housed in a former Cold War fallout shelter, MODE’s immersive atmosphere sets it apart from the neutral mega clubs. Our two crisp rooms— ABOVE and BELOW— are powered by the only L-Acoustics Arcs sound system in any nightclub in Miami, delivering a sonic experience that’s not just heard, but felt deep within. Each night is a curated journey, featuring top talent, an occasional touring artist, and the best of Miami’s covert scene. Backed by a team that has shaped some of the city’s most iconic nightclubs and festivals, MODE blends sound, space, and soul to create something truly personal. In addition to world-class music programming, MODE features one of the most innovative cocktail bars in Miami. With a menu inspired by music genres like disco, techno, groovy, and beyond, our cocktails are crafted with the same level of detail and creativity as our sound. At MODE, we don’t chase trends, we curate experiences. Every element is intentional, from the lineup to the lighting, the drinks to the dancefloor. This is nightlife redefined for those who seek something deeper. Welcome to MODE. Where we make it personal. ABOVE At the heart of MODE, a cocktail bar like no other that blends the soul of vinyl records and curated DJ sets with the craft of mixology. Offering an inviting space where music enthusiasts and cocktail aficionados alike can savor the harmony of great tunes and inviting drinks. Curated with passion, our menu features cocktails that tell a story with every sip, alongside a selection of vinyl that spins tales of musical legends. It’s a place for discovery, relaxation, and connection, all set to the backdrop of meticulously chosen beats. Step into MODE, where every evening is an intimate journey through sound and flavor. BELOW Beneath the vibrant energy of MODE lies an intimate haven designed for those who seek depth in both sound and experience. This intimate space, complemented by the warm fidelity of our L’Acoustics sound system, sets the stage for a uniquely personal experience. This lounge is designed for comfort and connection, offering a space where the music takes center stage and every moment feels personalized. It’s an escape into a world of sensory delight, where the rhythm of the night is matched only by the quality of your experience. Step into the Downstairs Lounge at MODE and immerse yourself in an experience where every detail is tuned to the frequency of unforgettable nights. WANT TO BOOK A PRIVATE EVENT? GET A QUOTE 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://www.mdpls.org/contactus",
      "text": "Contact Us - Miami-Dade Public Library System Skip to main content Skip to main content Skip to Navigation Skip to Footer Account Login Get a Library Card Open Now Account Login Get a Library Card Open Now Go Go Toggle navigation Quick Links Browse the Catalog Calendar of Events Digital Collections eBooks, eAudiobooks & More Get a Library Card Latest News Learning & Training Mobile Apps Mobile Printing Locations Alphabetical List Near You Open Now View Map (English) View Map (Spanish) Mobile Library Virtual Library Get Oriented Assistive Services & Technology Borrowing Browse the Catalog Calendar of Events Computers & Internet Fines & Fees Friends of the Miami-Dade Public Library Get a Library Card Holiday Schedule Make a Payment Mobile Apps Volunteer Explore 24/7 Library Community Resources Coworking Center Digital Collections eBooks, Audiobooks & More eGovernment Exhibitions at the Library Learning & Training Museum Pass Permanent Art Collection Staff Picks Special Collections Talking is Teaching: Early Literacy The Library for Children The Library for Teens The Vasari Project Virtual Exhibitions YOUmake Miami YOUmedia Miami Services Adult Learning Academy Ask A Librarian Braille & Talking Books Library Connections Home Library Services Digital Learn Drive-Up Wi-Fi Homework Help & Tutoring Program Interlibrary Loan Libraries @ Your Door Home Delivery Service Mobile Device Lending Program Mobile Printing Project L.E.A.D. Adult Literacy Reserving Space at the Library Social Services at the Library Storytime Express Early Literacy Kits Suggestions for Purchase U.S. Passport Services My Accounts Log In Items Out Requests Fines & Fees Freegal Music Hoopla Digital OverDrive/Libby Support the Library Friends of the Miami-Dade Public Library Donate Volunteer at the Library close Reset to\n\t\t\t\t\t\t\t\t\tstandard size Font size options Increase or decrease the font size for this website by clicking on the 'A's. Reset to default contrast Contrast options Choose a color combination to give the most comfortable\n\t\t\t\t\t\t\t\t\tcontrast. Contact Us If you need assistance with your library account or have any questions, please email our Customer Care team at customercare@mdpls.org or complete the form below. First Name* Last Name* Daytime Phone Email Which branch did you visit? Please choose... Allapattah Arcola Lakes Bay Harbor Islands California Club Coconut Grove Concord Connections Coral Gables Coral Reef Country Walk Culmer Overtown Doral Edison Center Fairlawn Golden Glades Hialeah Gardens Hispanic International Mall Jump Start Kendale Lakes Kendall Key Biscayne Lakes of the Meadow Lemon City Little River Main Library Miami Beach Regional Miami Lakes Miami Springs Mobile Services Model City Naranja North Central North Dade Regional North Shore Northeast Dade - Aventura Opa-locka Palm Springs North Palmetto Bay Pinecrest Shenandoah South Dade Regional South Miami South Shore Sunny Isles Beach Sunset Tamiami UHealth | Jackson Station Library Kiosk Virrick Park West Flagler West Kendall Regional Westchester Regional Westchester Health & Wellness Information Center Subject Please choose... Comments Suggestions More Information on Library Events More Information on Library Services Feedback on Website Other Message* × Thank you for your feedback! Submit Form * Required Fields This project has been funded under the provisions of the State Aid to Libraries Grant program, administered by the Florida Department of State’s Division of Library and Information Services. We encourage patrons to use the Ask‑a‑Librarian service when sending reference questions. To find information for a specific branch, please refer to the Library Locator . Can't find a title in the catalog? Request an item by submitting a Suggestion for Purchase . Miami-Dade Public Library System Public Records Custodian Leila Khalil 101 West Flagler Street Miami, FL 33130 305-375-5291 khalill@mdpls.org This information may also be found at the Customer Service Desk on the first floor of the MDPLS Main Library , 101 West Flagler Street, Miami, FL 33130. Library Director Name and Title Email Contact Phone Number Ray Baker Director E-mail 305‑375‑5026 Veronica Alvarez Departmental Administrative Coordinator E-mail 305‑375‑5026 Special Collections, Communications & Strategic Planning Name and Title Email Contact Phone Number Lydia Lopez Assistant Director E-mail 305-375-3555 Leila Khalil Chief, Library Marketing & Development Services E-mail 305-375-5291 Library Operations & Services Name and Title Email Contact Phone Number Rafael Costa Assistant Director E-mail 305‑375‑5183 Wil Fowler Operations Manager E-mail 305-375-3873 Julio Rodriguez Operations Manager E-mail 305‑375‑5271 Michele Stiles Operations Manager E-mail 305‑375‑5008 Jennifer Shipley Operations Manager E-mail 305-751-8687 Laura Millay Operations Manager, Collection Development & Technical Services E-mail 305-375-5179 Athanasia Fitos Operations Manager, Community Engagement E-mail 305-375-4540 Business Operations Name and Title Email Contact Phone Number Mike Iturrey Assistant Director E-mail 305‑375‑5044 Jessica Jarra Budget & Accounting Manager E-mail 305‑375‑5178 Kimberly Craig Chief, Library Contracts, Procurement & Materials Management E-mail 305-375-5576 Capital Construction & Facility Management Name and Title Email Contact Phone Number Lisa D’Andrea-Thompson Library Capital Programs Director E-mail 305-375-5106 Human Resources Name and Title Email Contact Phone Number Kelly Lau Chief, Human Resources E-mail 305‑375‑5010 Main Library 101 W. Flagler St., Miami, FL 33130 Service or Department Phone Number Additional Info General Information 305‑375‑2665 Children's Room 305‑375‑5021 Circulation 305-375-2665 Florida Room / Genealogy 305-375-5572 General Reference 1 st Floor 305‑375‑5231 General Reference 2 nd Floor 305‑375‑5575 Social Services 786-988-6816 TDD 305‑679‑7977 Miami-Dade Public Library System Public Records Custodian Leila Khalil 101 West Flagler Street Miami, FL 33130 305-375-5291 khalill@mdpls.org This information may also be found at the Customer Service Desk on the first floor of the MDPLS Main Library , 101 West Flagler Street, Miami, FL 33130. Download our Library App Facebook X Instagram Threads YouTube Sign Up for Library News Site Map Find a Branch About Us Contact Us/Customer Care Latest News Library Policies Get a Library Card Browse the Catalog Learning & Training eBooks, Audiobooks & More eGovernment © 2025 Miami‑Dade County. All rights reserved. Miami-Dade County Home Privacy Statement Disclaimer About the County ADA Notice Directory Jobs Privacy and cookie policy | Accessibility | Communico Connected content from Communico. © 2025."
    },
    {
      "url": "https://www.mocanomi.org/about/staff",
      "text": "Staff & Board - Museum of Contemporary Art North Miami Please ensure Javascript is enabled for purposes of website accessibility No items found. Visit Visit Hours & Admission Directions & Parking Tours Book the Venue Accessibility On View On View Current Exhibitions Public Art Upcoming Past Events Events Calendar Upcoming Past Virtual Jazz at MOCA Gala Learn Learn Children (1-12) Teens (13-17) Adults Art Camps Resources Collection About About Who We Are In the Community News Opportunities Support Support Membership Curator's Circle Donate Corporate Support Donor Recognition English EspaÃ±ol Kreyol Staff Matt Roza Chana Budgazad Sheldon Executive Director Amanda Covach Director of Education and Community Engagement Sara Ryan Director of Development Kimari Jackson Curatorial Assistant Sara Uhlig Perez Membership and Donor Relations Manager Shekinah Johnson Development Assistant Fabienne Merritt Content Manager and Copywriter Ester Paulino Youth Education Manager William Miranda Building Manager Marceau Livette Security Chief Felix St. Hilaire Gallery Interpreter Tainisel Rodriguez Visitor Services Manager General Information info@mocanomi.org For Press Inquiries Michelle Barge, Director of Communications communications@mocanomi.org Learn more about MOCAÂ Nomi MOCA North Miami presents contemporary art and its historical influences through exhibitions, educational programs, and collections. Inspired by its surrounding communities, MOCA connects diverse audiences and cultures by providing a welcoming place to encounter new ideas and voices, and nurturing a lifelong love of the arts. Learn More Subscribe for museum news & events Email Address Thank you! You have been subscribed to the MOCA newsletter. Oops! Something went wrong while submitting the form. Visit Joan Lehman Building 770 NE 125 Street North Miami, FL 33161 305-893-6211 Hours Monday:Â Closed Tuesday:Â Closed Wednesday: 12 - 7 pm Thursday: 10 am - 5 pm Friday: 10 am - 5 pm Saturday: 10 am - 5 pm Sunday: 10 am - 5 pm Monday : Closed Tuesday : Closed Wednesday : 12 â 7 PM Thursday : 10 AM â 5 PM Friday : 10 AM â 5 PM Saturday : 10 AM â 5 PM Sunday : 10 AM â 5 PM Support Membership Curator's Circle Donate Corporate Support Donor Recognition Legal Web Accessibility Privacy Supporters MOCA North Miami is generously funded by the North Miami Mayor and Council and the City of North Miami; the Miami-Dade County Department of Cultural Affairs and the Cultural Affairs Council, the Miami-Dade County Mayor and Board of County Commissioners; and the John S. and James L. Knight Foundation. Additional support is provided by the Fine & Greenwald Foundation and the Sol Taplin Charitable Foundation. Founding support for the MOCA Sustainability Fund provided by the Green Family Foundation Trust. Major support provided by Shirley and William M. Lehman, Jr. We also thank our Board of Trustees, Curatorâs Circle, and MOCA Members for their meaningful support. Copyright Â© 2024 Museum of Contemporary Art North Miami. All rights reserved. X Opt-out Preferences We use third-party cookies that help us analyse how you use this website, store your preferences, and provide the content and advertisements that are relevant to you. However, you can opt out of these cookies by checking \"Do Not Sell or Share My Personal Information\" and clicking the \"Save My Preferences\" button. Once you opt out, you can opt in again at any time by unchecking \"Do Not Sell or Share My Personal Information\" and clicking the \"Save My Preferences\" button. Do Not Sell or Share My Personal Information Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Cancel Save Preferences X Cookie Settings We take the security and privacy of our users seriously. This policy outlines the measures we take to protect data and personal information and ensure a safe browsing experience. I agree Preferences Reject Accept Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. X X We use cookies and access non-sensitive information from your device to enhance and personalize ads and content across this website. You can choose to accept all or some of these operations. Necessary Marketing Personalization Analytics Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Cancel Save preferences X We value your privacy This website or its third-party tools process personal data. You can opt out of the sale of your personal information by clicking on the âDo Not Sell or Share My Personal Informationâ link. Do Not Sell or Share My Personal Information"
    },
    {
      "url": "https://mode.miami/event/she-knows-the-owner-2024-09-15/",
      "text": "She Knows The Owner | MODE Downtown Miami Event MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS She Knows The Owner event Description She Knows The Owner - so make way! Sunday, September 15th we invite you to dance like you know the owner too. Everyone is a VIP to us - be part of the vibe. Music by M.O.E, Mausa, Park Line and a very special B2B for you to enjoy. ROOM ABOVE DATE Sun. September 15 TIME 9:00 PM - Late GET TICKETS RESERVATIONS RESERVE TABLE DATE INTERESTED EXPECTED ATTENDANCE * Less than 10 11 - 25 26 - 50 51 - 100 101 - 200 More than 200 Loading... SIMILAR EVENTS Thu Sep 11 2025 | 11:00 PM - LATE Sunkissed Sounds BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE Liquid Rose BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE She Knows Best ABOVE MORE INFO Sat Sep 13 2025 | 10:00 PM - LATE Pucllana Sounds (2 Year Annversary) ABOVE MORE INFO Sun Sep 14 2025 | 10:00 PM - LATE ZENSKI: Oceanic Quest BELOW MORE INFO Thu Sep 18 2025 | 10:00 PM - LATE Wassup by Hopeful Jo ABOVE MORE INFO Thu Sep 18 2025 | 11:00 PM - LATE Nightshift by Snooko BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Oscar G BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Mints On The House ABOVE MORE INFO Fri Sep 26 2025 | 10:00 PM - LATE Lupe Fuentes BELOW MORE INFO Fri Sep 26 2025 | 9:00 PM - LATE Grooveland by Silvio Rodrigues ABOVE MORE INFO Sat Sep 27 2025 | 10:00 PM - LATE Toni Varga BELOW MORE INFO Thu Oct 2 2025 | 10:00 PM - LATE Oura by The Lux ABOVE MORE INFO Thu Oct 9 2025 | 11:00 PM - LATE Higher Viiibrations present 9B49 BELOW MORE INFO Thu Oct 9 2025 | 10:00 PM - LATE Hush Records Launch Party ABOVE MORE INFO Thu Oct 16 2025 | 10:00 PM - LATE Wassup Anniversary ABOVE MORE INFO Fri Nov 7 2025 | 10:00 PM - LATE Crusy BELOW MORE INFO 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://www.mdc.edu/fashion/about.aspx",
      "text": "About the Miami Fashion Institute at Miami Dade College Skip to site navigation Skip to content Toggle navigation About MDC About Miami Dade College Accreditation Future Students Office of the President Community Engagement Campuses and Centers Jobs at MDC MDC News Academics Academic Programs College Catalog Academic Calendar The Honors College MDC Online Continuing Education High School Programs New World School of the Arts Libraries Learning Resources Admissions Apply Now Admissions Info Advisement Register for Classes Transcripts and Test Scores Veteran and Military Services International Students Testing and Assessment Paying for College Tuition and Fees Financial Aid Scholarships Payment Options Student Work Programs Life at MDC Arts & Culture Career Services Events Student Life Student Wellness Single Stop Services Athletics Public Safety College Forum Portals Canvas Students Student Portal MDConnect SharkNet Student Email Navigate Student Employees Employee Portal MDConnect Email Retiree Portal Navigate Staff Office 365 Give Now Apply Register Search MDC site Toggle The Fashion Institute navigation Miami Fashion Institute at Miami Dade College Home About Us MFI Talent Night The Fashion Lab Upcycle Challenge Donate Contact Us Miami Fashion Institute at MDC This is an industry driven program that prepares students to work as creative professionals in the fashion industry. From concept to production, students learn the process, skills and language of fashion design and technology, combining business and creative skills to develop an individual portfolio that expresses a solid understanding of the fashion industry. Learn the business and art of fashion Develop competitive skills and techniques for the fashion industry Innovate, explore and nurture your creativity Prepare for a dynamic career in fashion Courses are led by renowned faculty members who bring decades of real world experience into the classroom. MFI's instructors are artists, designers and business professionals who have worked with some of the most notable names in fashion including Calvin Klein, Diane Von Furstenberg, Jason Wu, Mara Hoffman, Marc Jacobs and Zac Posen. Meet the people OSCAR LOPEZ Chairperson Oscar Lopez serves as the Chairperson of Fashion Programs at Miami Fashion Institute. Previously at Miami International University of Art & Design, he led the charge in aligning fashion curricula for eight campuses, showcasing his commitment to ensuring quality education for fashion students nationwide. Beyond curriculum enhancement, Mr. Lopez fostered valuable industry relationships on both local and national fronts. Collaborating with renowned organizations such as Miami Fashion Week, FashInnovation, Paraiso Swim Week, New York Fashion Week, and Fashion Group International, he not only spoke and moderated at industry events but also opened doors for his students to directly engage with professionals and experts. Oscar's dedication to education and talent development has earned him recognition, including his role as a former Regional Director and current District Director for Fashion Group International, where he oversees South Florida, Chicago, and St. Louis. During his tenure as Regional Director, he orchestrated high-profile events featuring industry leaders. His leadership led FGI South Florida to be awarded the National Programming Merit Award in 2019. Prior to his career in academia, Mr. Lopez made his mark in the corporate world. With a background in Human Resources and Talent Acquisition, he contributed to Saks Fifth Avenue Corporate Office as the National Talent Acquisition and Planning Manager, where his insights and expertise resonated in support of the South Florida Market. M.P.S. Fashion Management, Parsons School of Design M.A. Design and Media Management, Miami International University of Art and Design B.S. Psychology, Albizu University Mia Causevic MFI Advisor Born in Croatia, raised in Italy where I’ve played professional volleyball for more than 10 years. Driven by passion and curiosity, I decided to put aside my volleyball career and complete my BA in Fashion Design and Communication at NABA. After graduating I had the opportunity to work for NABA. For years, I oversaw the contests and special projects with companies, and events for the NABA Fashion programs. During those years I had the chance to work on numerous collaborations with some of the most influential Italian brands, artists, and designers such as Romeo Gigli, Benedetta Barzini, Angela Missoni, Shingo Sato, Max Mara, Etro, Pandora and many more. I eventually moved with my family to California where I worked in Retail Management as a Clothing Buyer for Men’s Wearhouse in the Suits and Sport Coats division. In 2019 we moved to Miami, and shortly after joined the MFI Team. I love working with creatives, and I am passionate about helping them pursue their dreams, reach goals, and develop into successful designers and merchants. BA  Fashion Design and Communication from NABA, New Academy of Fine Arts, Milan,  Italy. Carlos M Rico Faculty Born  in Colombia and Raised in Miami, I always had a penchant for art and design,  ultimately settling on fashion design to combine both my interests. I completed  my A.A. in New York while working under Benjamin Cho as a design assistant  and also with Kimora Lee Simons in NYC.  Later moving to London to attend Central  Saint Martin's College of Art and Design where I secured a BA Honours in  menswear and immediately accepted a position in the Masters program. While  living and studying in London I was lucky enough to work under the Alexander McQueen  fashion House as an intern. After Graduating from CSM I moved back to NYC  to work under Phillip Lim and throughout my career I have been able to work  with many designers on a freelance basis.  I started my own fashion brand  and was shortlisted for GenArt's young designer award for my menswear  collection in NYC. Later moving back to Miami, I guided my career  to education where I worked as fashion adviser to the fashion program at Miami  International University and now Joining MFI my passion for teaching can be  realized.  Although my true passion is menswear; throughout my career I  have been able to work with womenswear, graphic design, textile pattern design,  and digital illustration. As a Local, I aim to bring my national and  international education to our wonderful community. M.A. in Menswear Design, Central Saint Martins, London,  England B.A. (Honors) in Menswear Design, Central Saint Martins, London,  England A.A in Menswear Design, Fashion Institute of Technology, New  York City, New York Alberto Ravelo Adjunct Faculty I have been working on developing my private label specialized in menswear and womenswear. My work is bespoke and expands to red carpets, stage performances, ballet, prom and wedding dresses. With a science background and more than 15 years of experience I own very strong technical skills, my patterns are precise, with very accurate proportions and fit. My goal is to train students' imagination and advanced understanding in the application of creative and interpretative skills required to translate designers' drawings into three dimensions. Graduate of Central Saint Martin's Innovative Pattern Making Course Desirae Allen Adjunct Faculty Following the completion of my M.B.A studies, I gained experience as a Freelance Fashion Colorist, Fashion Design, and Production Assistant for companies such as Liz Claiborne Inc., DKNY Jeans International, and Warnaco/Calvin Klein Jeans. Desirae extended her time abroad and traveled to countries such as Japan and South Africa; in addition, interning at Diane Von Furstenberg Studio in London as a Wholesale Sales Assistant. M.B.A studies in International Business Administration in London, England. B.A. in Fashion Design/Merchandising from Morris Brown College in Atlanta, Ga. Herion Park Adjunct Faculty I’m a visual artist, teacher, and fashion design entrepreneur. I encourage my students to transcend beyond style, integrating correlative artistic disciplines in order to present their own distinct convictions. I trained under the mentorship of artist Nick Cave, who’s vision asserts the vital interrelationship between the costumes we wear and the thorny cultural world we all navigate. I also believe that outside of the theatrical ephemera, fashion has the potential to transmute into a critical language that communicates a message to and from our time, a kinetic art-form with many layers of meaning and relevance to our sociology. I want my design students to become empowered to tell profound stories through their work, whether they be personal, or comprehensive of the challenges encountering us as a global citizenry. Each student has a unique story and gift for humanity. My goal is to encourage their dreams and help them develop all the skills necessary to make them into thriving capable professionals. MDes, Fashion, Body and Garment School of the Art Institute of Chicago B.F.A, Fashion Design, School of the Art Institute of Chicago. Jill Odermann Adjunct Faculty I have enjoyed three decades working in the business of apparel design and production. I attended design school in Chicago after which, my first and second jobs were as dancewear designer and pattern maker. Years later I moved to a large national department store chain as Technical Designer for Asian production across multiple markets. Eddie Bauer Int’l Americas offered me a Technical Design management position here in Miami working directly with the factories in South Africa and the Caribbean in private brand. Post Corporate, I have taught for twelve years at many local institutions receiving training for teaching at the high school and university levels. I’m grateful to now be able to mentor and share with my students here at MFI. ACUE Certified Instructor B.A. from Ray College of Art, Chicago and the University of Wisconsin Joanne DeMartini Adjunct Faculty I have over 25 years of experience in the fashion industry in various positions. I started my career in the Intimate Apparel department of Lord & Taylor, and then went on to become a buyer for Saks Fifth Ave and a Divisional Merchandise Manager for Designer, Dresses and Coats and Suits at the late Bonwit Teller. I changed to the manufacturing side and became President of R & K Originals, a moderate dress company. After being in my own fashion business twice, I joined The Jump Design Group where I was President of the Marina brand and also V.P. of International Sales for all the Jump brands. I became the On-Air personality for Jump’s “Tiana B” brand for QVC in the U.K., Italy, and Germany, for TVSN in Australia, and even CNR Mall (a QVC partner) in China. Jump actually shipped U.S. made apparel TO China! Along with teaching in New York at F.I.T. and L.I.M and now Miami Fashion Institute, I continue to be the On-Air guest for Tiana B in Canada at The Shopping Channel. M.A. Philosophy and the Arts, The New School B.A. Education/Art History, Queens College Julian Asion Adjunct Faculty I graduated from Miami Dade College with a degree in Fashion Design in 1972. I then worked in the industry here in Miami for several years before moving to New York to further develop my craft. I worked as the premier(master) mans for some of the most important names in America's Fashion Industry: Zac Posen Jason Wu, Narciso Rodriguez, Isabel Toledo and Francisco Costa for Calvin Klein Collection among others. I'm now retired and love sharing my craft, learned over 45 years. A.S. in Fashion Design Miami Dade College. Premier Mans with 45 years of Experience Leonardo De Armas Adjunct Faculty I started my career as a student at Parsons School of Design, in New York City, I had the opportunity to learn the disciplines of design, clothing construction and illustration from some of the most legendary names in the American fashion industry. Right after graduation, I opened my design studio, creating luxury ready to wear lines and exclusive bridal and evening gowns for a demanding global clientele, while also devoting time to a life-long passion; teaching and sharing my expertise in different educational institutions and art foundations throughout the U.S., Latin America and the Caribbean. I strongly believe that a truly successful professor is a communicator who is capable of inspiring and motivating aspiring designers by leaving on them an indelible mark of honest work ethics and values, while nurturing their abilities and talents. ACUE Certified Instructor B.F.A. Fashion Design, Parsons School of Design Gold Thimble Award for Design Excellence. Matilda KaLAveshi Adjunct Faculty My introduction to the international fashion industry started at an early age in Europe. After transitioning into the buying world when I joined Macys Corporate Inc, I completely fell in love with retail and the business side of the fashion world. For the past 17 years, I have worked for numerous retailers in the southeast region and have held different positions such as fashion buyer, planner, senior buyer, fashion director, and consultant. I currently run my own retail consulting boutique where I help brands and retailers build and grow profitable businesses. At a local level, I am the Downtown NEWS Business Correspondent. I focus on retail news, consumer trends, e-commerce, emerging brands, new retail developments, and more. My ultimate goal is to prepare my students to navigate the multi-faceted world of retail by bridging the gap between fashion and business. M.B.A. International Business Florida International University Certificate in Corporate Strategies for Europe EDHEC Business School Lille & Nice France B.A. International Business and Marketing Florida International University PRISCA MILLIANCE Adjunct Faculty After receiving a BA in Journalism from Georgetown University in 2005, I revisited my childhood love for art and fashion when I enrolled in a costume design class at Boston University. When my sewing instructor recommended I enroll in the Master's of Science program at Drexel University, I considered it to be a call from the universe to pursue my lifelong passion. However, I took the year before starting my graduate degree to travel across the US as a costume attendant for the Ringling Bros Circus. I have worked as a technical designer for contemporary brands including Mara Hoffman, Tracy Reese and Vanilla Beach. I have a strong affinity for the use of technology in creating fashion including Digital Illustration along with Patternmaking in CAD. Nevertheless, the love of art and fashion history is what drew me to this profession. My goal is to share that curiosity and interest in research with the MFI community. ACUE Certified Instructor Master's of Science in Fashion Design at Drexel University BA in Journalism from Georgetown University Advisory Board Members Thank YOU for your support Taylor Anne Abess Founder & Creative Director, Parlor Miami Oscar Carvallo Artistic Director OCP USA, LLC Menchu Dominicis Owner, J.A. Uniforms Barbara Hulanicki Founder Biba & Hu Design, Inc. Elysze Held Stylist/Consultant, Founder Style Out of the City Rene Ruiz Founder & Creative Designer Rene Ruiz Wholesale Godfrey Del Rio Personal Stylist, Bloomingdales Julian Chang Fashion Designer Fashion with Intension Oscar Feldenkreis CEO & President Perry Ellis International Merline Labissiere Designer Juan Lopez Vice President & General Manager Saks Fifth Avenue, Dadeland Rosemary Pringle Retired, Lead Fashion Instructor, Design and Architecture Senior High Campuses and Centers Hialeah Homestead Kendall Medical North Padrón West Wolfson Meek Center Gibson Center Information College Catalog Future Students Current Students Employees Retirees Business Opportunities Give | Alumni Mobile App Connect with MDC Follow on Instagram Find on Facebook Follow on X Follow on LinkedIn Watch on YouTube Get Help Help & FAQs Contacts & Hours College Directory Sitemap Request Information Copyright © Miami Dade College Privacy Policy Consumer Information EOP/ADA/Title IX Jobs at MDC Human Resources Site Feedback Accreditation Miami Dade College is an equal access/equal opportunity institution which does not discriminate on the basis of sex, race, color, marital status, age, religion, national origin, disability, veteran’s status, ethnicity, pregnancy, sexual orientation or genetic information. To obtain more information about the College’s equal access and equal opportunity policies, procedures and practices, please contact the College’s Civil Rights Compliance Officer: Cindy Lau Evans, Director, Equal Opportunity Programs/ ADA Coordinator/ Title IX Coordinator, at (305) 237-2577 (Voice) or 711 (Relay Service). 11011 SW 104 St., Room 1102-01; Miami, FL 33176. CRCTitleIXADA@mdc.edu"
    },
    {
      "url": "https://www.mode.miami/contact/",
      "text": "Contact MODE Downtown Miami | Connect With Us MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS MODE Miami 2 South Miami Ave. Miami, FL 33130 info@mode.miami DIRECTIONS TRAVEL DEALS RENT CARS on KAYAK send a message SUBJECT * General Inquiry Event Planning Partnerships Reservations Sponsorships Other Loading... 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://www.mode.miami/reservations",
      "text": "Book Your Table at MODE Downtown Miami | Reservations MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS RESERVATIONS request info DATE INTERESTED EXPECTED ATTENDANCE * Less than 10 11 - 25 26 - 50 51 - 100 101 - 200 More than 200 Loading... 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://mode.miami/",
      "text": "MODE Downtown Miami | Cocktail Bar & Downstairs Lounge MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS ELEVATED NIGHTLIFE Downtown Miami RESERVATIONS THIS IS MODE THIS IS MODE THURSDAY - SUNDAY : 9PM till Late Located in the heart of downtown Miami, MODE is more than just a nightclub—it’s where music, culture, and hospitality converge. Equipped with the city’s only L-Acoustics Arcs sound system, every performance at MODE is not just heard—it’s felt. We are dedicated to delivering a personal and intimate experience, standing apart from the impersonal mega clubs and corporate-driven nightlife. Housed in a former Cold War fallout shelter, MODE creates an immersive atmosphere where curated artists, producers, and an engaged audience come together for a deeper, more meaningful connection. Backed by a team that has shaped legendary nightclubs and festivals, every detail at MODE is thoughtfully crafted. From cutting-edge music to innovative cocktails, we redefine nightlife by focusing on those intimate, unforgettable moments. Welcome to MODE, where we make it personal. UPCOMING EVENTS VIEW ALL Thu Sep 11 2025 | 10:00 PM - LATE Hesoyam Records Showcase ABOVE MORE INFO Thu Sep 11 2025 | 11:00 PM - LATE Sunkissed Sounds BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE Liquid Rose BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE She Knows Best ABOVE MORE INFO Sat Sep 13 2025 | 10:00 PM - LATE Pucllana Sounds (2 Year Annversary) ABOVE MORE INFO Sun Sep 14 2025 | 10:00 PM - LATE ZENSKI: Oceanic Quest BELOW MORE INFO Thu Sep 18 2025 | 10:00 PM - LATE Wassup by Hopeful Jo ABOVE MORE INFO Thu Sep 18 2025 | 11:00 PM - LATE Nightshift by Snooko BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Oscar G BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Mints On The House ABOVE MORE INFO Thu Sep 25 2025 | 11:00 PM - LATE Luminary Spectrum BELOW MORE INFO Fri Sep 26 2025 | 10:00 PM - LATE Lupe Fuentes BELOW MORE INFO Fri Sep 26 2025 | 9:00 PM - LATE Grooveland by Silvio Rodrigues ABOVE MORE INFO Sat Sep 27 2025 | 10:00 PM - LATE Toni Varga BELOW MORE INFO Thu Oct 2 2025 | 10:00 PM - LATE Oura by The Lux ABOVE MORE INFO Thu Oct 9 2025 | 11:00 PM - LATE Higher Viiibrations present 9B49 BELOW MORE INFO Thu Oct 9 2025 | 10:00 PM - LATE Hush Records Launch Party ABOVE MORE INFO Thu Oct 16 2025 | 10:00 PM - LATE Wassup Anniversary ABOVE MORE INFO Sat Oct 18 2025 | 10:00 PM - LATE Satin Jackets BELOW MORE INFO Fri Nov 7 2025 | 10:00 PM - LATE Crusy BELOW MORE INFO #MODEMIAMI EVENTS WANT TO BOOK A PRIVATE EVENT? GET A QUOTE 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://www.mode.miami/events/",
      "text": "Upcoming Events at MODE Downtown Miami | Music, Art, and Mixology MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS EVENTS UPCOMING EVENTS CALENDAR Thu Sep 11 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Sep 11 2025 | 10:00 PM - LATE Hesoyam Records Showcase ABOVE MORE INFO Thu Sep 11 2025 | 11:00 PM - LATE Sunkissed Sounds BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE Liquid Rose BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE She Knows Best ABOVE MORE INFO Sat Sep 13 2025 | 10:00 PM - LATE Pucllana Sounds (2 Year Annversary) ABOVE MORE INFO Sun Sep 14 2025 | 10:00 PM - LATE ZENSKI: Oceanic Quest BELOW MORE INFO Thu Sep 18 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Sep 18 2025 | 10:00 PM - LATE Wassup by Hopeful Jo ABOVE MORE INFO Thu Sep 18 2025 | 11:00 PM - LATE Nightshift by Snooko BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Oscar G BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Mints On The House ABOVE MORE INFO Thu Sep 25 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Sep 25 2025 | 11:00 PM - LATE Luminary Spectrum BELOW MORE INFO Fri Sep 26 2025 | 10:00 PM - LATE Lupe Fuentes BELOW MORE INFO Fri Sep 26 2025 | 9:00 PM - LATE Grooveland by Silvio Rodrigues ABOVE MORE INFO Sat Sep 27 2025 | 10:00 PM - LATE Toni Varga BELOW MORE INFO Thu Oct 2 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Oct 2 2025 | 10:00 PM - LATE Oura by The Lux ABOVE MORE INFO Thu Oct 9 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Oct 9 2025 | 11:00 PM - LATE Higher Viiibrations present 9B49 BELOW MORE INFO Thu Oct 9 2025 | 10:00 PM - LATE Hush Records Launch Party ABOVE MORE INFO Thu Oct 16 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Oct 16 2025 | 10:00 PM - LATE Wassup Anniversary ABOVE MORE INFO Sat Oct 18 2025 | 10:00 PM - LATE Satin Jackets BELOW MORE INFO Thu Oct 23 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Oct 30 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Thu Nov 6 2025 | 9:00 PM - 11:00 PM The Killing Joke - Downtown Miami Comedy Night BELOW MORE INFO Fri Nov 7 2025 | 10:00 PM - LATE Crusy BELOW MORE INFO 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://www.mode.miami/event/jazz-night-with-query-2024-03-05/",
      "text": "Jazz Night with QUERY | MODE Downtown Miami Event MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS Jazz Night with QUERY event Description MODE presents JAZZ NIGHT every Tuesday with live jazz performances from special guest acts starting at 8 PM. LINEUP query DATE Tue. March 05 TIME 8:00 PM - Late GET TICKETS RESERVATIONS RESERVE TABLE DATE INTERESTED EXPECTED ATTENDANCE * Less than 10 11 - 25 26 - 50 51 - 100 101 - 200 More than 200 Loading... About the Artists query query 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    },
    {
      "url": "https://linktr.ee/mode.miami",
      "text": "MODE Downtown Miami | Instagram, Facebook | Linktree MODE Downtown Miami NIGHTCLUB & COCKTAIL LOUNGE\nOPEN THU-SUN 7PM TILL LATE 🌐 WEBSITE 🌐 🍾 TABLE SERVICE 🍾 🎟️ GET TICKETS 🎟️ 📱GET UPDATES📱 ✉️ JOIN INSIDER LIST ✉️ 🎶 LIVE AT MODE 🎶 ▶️ DJ CHUS - 4TH OF JULY AT MODE ▶️ STEVE LAWLER: PENDULUM AT MODE ▶️  T. JACQUES AT MODE ▶️ BORIS LIVE AT MODE GET INVOLVED 👉 APPLY TO PERFORM 👉 JOB APPLICATION Instagram Instagram Facebook Facebook YouTube YouTube Email Email Cookie Preferences · Report · Privacy View on mobile"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "text": "Contact Us - Get Vows Skip to content Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar New Jersey/New York Area (732) 763-2730 jeni@getvows.com Facebook Twitter Pinterest Flipboard Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar CONTACT US Send Message GET IN TOUCH If you’re interested in our services or have any questions, please reach out to us thru the contact information below or fill out our form on the right. jeni@getvows.com (732) 763-2730 New Jersey/New York Area CONTACT INFO jeni@getvows.com (732) 763-2730 New Jersey/New York Area SOCIAL Facebook Twitter Pinterest Flipboard NEED TO MAKE A PAYMENT? Payment Options Copyright © All Rights Reserved"
    },
    {
      "url": "https://mode.miami/event/hedonism-miami-burn-decompression-2024-09-29/",
      "text": "Hedonism Miami: Burn Decompression | MODE Downtown Miami Event MODE Events Gallery About Happy Hour Reservations Private Events Contact Join our mailing list MODE RESERVE TABLE BUY TICKETS Hedonism Miami: Burn Decompression event Description Sunday, September 29th, HEDONISM comes to MODE for an unforgettable night of immersive music and creative energy. Designed as a Burn decompression event, this is where art, music, and indulgence collide. The night kicks off at 8 PM with Alina Prox, whose blend of Indie Dance, Melodic House, and Afro House will set the perfect tone. From 10 PM, ALAR takes over, combining deep, melodic beats with his signature sound, known from collaborations with Jan Blomqvist, Korolova, and more. With millions of streams and performances worldwide, ALAR is sure to deliver an unmissable set. Closing the night from midnight is Ro Rousseau, the visionary behind Kyiv's UBK beach club and the Hedonism Festival. His unique blend of sounds has shaped unforgettable gigs across the globe. Expect a night filled with deep connections, eclectic music, and a community of creatives, burners, and hedonists ready to lose themselves in the rhythm. Doors open at 8 PM—come ready to experience the next chapter of Hedonism at MODE. ROOM BELOW DATE Sun. September 29 TIME 8:00 PM - Late GET TICKETS RESERVATIONS RESERVE TABLE DATE INTERESTED EXPECTED ATTENDANCE * Less than 10 11 - 25 26 - 50 51 - 100 101 - 200 More than 200 Loading... SIMILAR EVENTS Thu Sep 11 2025 | 11:00 PM - LATE Sunkissed Sounds BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE Liquid Rose BELOW MORE INFO Fri Sep 12 2025 | 10:00 PM - LATE She Knows Best ABOVE MORE INFO Sat Sep 13 2025 | 10:00 PM - LATE Pucllana Sounds (2 Year Annversary) ABOVE MORE INFO Sun Sep 14 2025 | 10:00 PM - LATE ZENSKI: Oceanic Quest BELOW MORE INFO Thu Sep 18 2025 | 10:00 PM - LATE Wassup by Hopeful Jo ABOVE MORE INFO Thu Sep 18 2025 | 11:00 PM - LATE Nightshift by Snooko BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Oscar G BELOW MORE INFO Sat Sep 20 2025 | 10:00 PM - LATE Mints On The House ABOVE MORE INFO Fri Sep 26 2025 | 10:00 PM - LATE Lupe Fuentes BELOW MORE INFO Fri Sep 26 2025 | 9:00 PM - LATE Grooveland by Silvio Rodrigues ABOVE MORE INFO Sat Sep 27 2025 | 10:00 PM - LATE Toni Varga BELOW MORE INFO Thu Oct 2 2025 | 10:00 PM - LATE Oura by The Lux ABOVE MORE INFO Thu Oct 9 2025 | 11:00 PM - LATE Higher Viiibrations present 9B49 BELOW MORE INFO Thu Oct 9 2025 | 10:00 PM - LATE Hush Records Launch Party ABOVE MORE INFO Thu Oct 16 2025 | 10:00 PM - LATE Wassup Anniversary ABOVE MORE INFO Fri Nov 7 2025 | 10:00 PM - LATE Crusy BELOW MORE INFO 2 South Miami Ave., Miami, FL 33130 info@mode.miami | 305.942.7240 Terms & Conditions // Privacy Policy // News THANK YOU ERROR AUTH Please enter your email to gain access to the galleries: Loading... Please check your inbox to verify your email."
    }
  ]
}