{
  "fuentes": [
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "adventures@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "bayswater@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "broadway@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "central@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "downtown@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "eastside@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "kingscross@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "melbourne@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "pottspoint@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "village@madmonkey.com.au"
    },
    {
      "url": "https://www.madmonkey.com.au/contact",
      "email": "waterfront@madmonkey.com.au"
    },
    {
      "url": "https://www.monkeyinmychair.org/contact-us/",
      "email": "info@lovechloe.org"
    },
    {
      "url": "https://monkeydoplaygrounds.com/contact/",
      "email": "info@monkeydoplaygrounds.com"
    },
    {
      "url": "https://www.groupon.com/biz/jacksonville-beach-fl/monkeys-uncle-tavern",
      "email": "verify@r.groupon.com"
    },
    {
      "url": "https://monkeybusinesscamp.com/working-at-upcoming-camps/",
      "email": "office@monkeybusinesscamp.com"
    }
  ],
  "mails": [
    "adventures@madmonkey.com.au",
    "bayswater@madmonkey.com.au",
    "broadway@madmonkey.com.au",
    "central@madmonkey.com.au",
    "downtown@madmonkey.com.au",
    "eastside@madmonkey.com.au",
    "info@lovechloe.org",
    "info@monkeydoplaygrounds.com",
    "kingscross@madmonkey.com.au",
    "melbourne@madmonkey.com.au",
    "office@monkeybusinesscamp.com",
    "pottspoint@madmonkey.com.au",
    "verify@r.groupon.com",
    "village@madmonkey.com.au",
    "waterfront@madmonkey.com.au"
  ],
  "nombre_sitio": "monkeysuncletavern.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.madmonkey.com.au/contact",
      "text": "Get in Touch with Mad Monkey Backpackers | Contact Us Today HOME LOCATIONS SYDNEY - AUSTRALIA Mad Monkey Bayswater Mad Monkey Broadway Mad Monkey Kings Cross Mad Monkey Downtown Mad Monkey Potts Point Mad Monkey East Side CAIRNS - AUSTRALIA Mad Monkey Central Mad Monkey Village Mad Monkey Waterfront Mad Monkey Jungle ADVENTURES GUIDES ABOUT US CONTACT US GET IN TOUCH WORK WITH US INFLUENCER INTERNSHIP BOOK NOW HOME LOCATIONS SYDNEY - AUSTRALIA Mad Monkey Bayswater Mad Monkey Broadway Mad Monkey Kings Cross Mad Monkey Downtown Mad Monkey Potts Point Mad Monkey East Side CAIRNS - AUSTRALIA Mad Monkey Central Mad Monkey Village Mad Monkey Waterfront Mad Monkey Jungle MELBOURNE - AUSTRALIA Mad Monkey Melbourne ADVENTURES GUIDES ABOUT US CONTACT US GET IN TOUCH WORK WITH US INFLUENCER INTERNSHIP BOOK NOW GET IN TOUCH CAIRNS MAD MONKEY CENTRAL 100 Sheridan St Cairns City QLD 4870 Email: central@madmonkey.com.au Phone: +61 7 4231 9871 MAD MONKEY WATERFRONT 93A Esplanade Cairns City QLD 4870 Email: waterfront@madmonkey.com.au Phone: +61 7 4229 0888 MAD MONKEY VILLAGE 141 Sheridan St Cairns City QLD 4870 Email: village@madmonkey.com.au Phone: +61 7 4231 9612 BOUNCE 117 Grafton St Cairns City QLD 4870 Email: cairns@bouncehostels.com Phone: +61 7 4047 7200 SYDNEY MAD MONKEY BROADWAY 20 City Rd Chippendale NSW 2008 Email: broadway@madmonkey.com.au Phone: +61 2 8705 3762 MAD MONKEY BAYSWATER 79 Bayswater Rd Potts Point NSW 2011 Email: bayswater@madmonkey.com.au Phone: +61 2 9331 0520 MAD MONKEY KINGS CROSS 34-36A Darlinghurst Rd Potts Point NSW 2011 Email: kingscross@madmonkey.com.au Phone: +61 2 8004 9947 MAD MONKEY DOWNTOWN 23 Darlinghurst Road Potts Point NSW 2011 Email: downtown@madmonkey.com.au Phone: +61 2 8363 3346 MAD MONKEY POTTS POINT 27 Orwell Street Potts Point NSW 2011 Email: pottspoint@madmonkey.com.au Phone: +61 2 8363 3347 MAD MONKEY Eastside 20 City Rd Chippendale NSW 2008 Email: eastside@madmonkey.com.au Phone: +61 2 9326 9675 Melbourne MAD MONKEY MELBOURNE 475 Spence Street Melbourne VIC 3003 Email: melbourne@madmonkey.com.au Phone: +61 3 9454 6848 TRAVEL MAD MONKEY ADVENTURES Email: adventures@madmonkey.com.au We WOULD LOV E TO HEAR FROM YOU! CONTACT US Have a question? We’re here to help. Send us a message and we’ll be in touch. First Name Last Name Email Phone number Message Opt-In Yes, please add me to the Mailing list to make sure I receive all discounts Thank you for contacting us. We will get back to you as soon as possible Oops, there was an error sending your message. Please try again later Mad Monkey HOME LOCATIONS SYDNEY - AUSTRALIA Mad Monkey Bayswater Mad Monkey Broadway Mad Monkey Kings Cross Mad Monkey Downtown Mad Monkey Potts Point Mad Monkey East Side CAIRNS - AUSTRALIA Mad Monkey Central Mad Monkey Village Mad Monkey Waterfront Mad Monkey Jungle ADVENTURES GUIDES ABOUT US CONTACT US GET IN TOUCH WORK WITH US INFLUENCER INTERNSHIP HOME LOCATIONS SYDNEY - AUSTRALIA Mad Monkey Bayswater Mad Monkey Broadway Mad Monkey Kings Cross Mad Monkey Downtown Mad Monkey Potts Point Mad Monkey East Side CAIRNS - AUSTRALIA Mad Monkey Central Mad Monkey Village Mad Monkey Waterfront Mad Monkey Jungle ADVENTURES GUIDES ABOUT US CONTACT US GET IN TOUCH WORK WITH US INFLUENCER INTERNSHIP BOOK NOW JOIN OUR NEWSLETTER © 2025 All Rights Reserved | Mad Monkey | Privacy & Cookies Policy | Terms & Conditions Share by:"
    },
    {
      "url": "https://www.monkeyinmychair.org/contact-us/",
      "text": ""
    },
    {
      "url": "https://monkeydoplaygrounds.com/contact/",
      "text": "Contact Us | Monkey Do! Monkey Do! Create Family ACCOUNT Home Play Party FAQ s Gallery Contact Tour Find Us 802.872.7522 info@monkeydoplaygrounds.com Monkey Do! 64 Harvest Lane Williston, VT 05495 Quick Links: Home Play Party FAQ s Gallery Contact Tour Contact Info: Monkey Do! 64 Harvest Lane Williston, VT 05495 802.872.7522 info@monkeydoplaygrounds.com Business Hours: Daily 9:00am – 5:00pm © 2025, Monkey Do!, All Rights Reserved | Privacy Policy | Terms of Use Design by: Gray Cat Studio"
    },
    {
      "url": "https://www.groupon.com/biz/jacksonville-beach-fl/monkeys-uncle-tavern",
      "text": "Monkey's Uncle, 1850 3rd Street South, Jacksonville Beach, FL - Groupon Download our app for exclusive deals Sell on Groupon English Chicago Sign In Beauty & Spas Beauty & Spas Massage Hair Removal Face & Skin Care Cosmetic Procedures Spas Hair & Styling Health & Fitness Weight Loss Nail Salons Dental Brows & Lashes Tanning Beauty & Spas Things To Do Things To Do Fun & Leisure Tickets & Events Kids Activities Sightseeing & Tours Sports & Outdoors Museums & Galleries Photography Amusement Parks Bowling Trampoline & Bounce Houses Boat Tours Classes Escape Games Arcades Things To Do Auto & Home Auto & Home Oil Change Auto Repair & Maintenance Car Wash Parking Home Services Cleaning Services Bedding Furniture Patio, Lawn & Garden Kitchen & Dining Auto & Home Food & Drink Food & Drink Restaurants Cafes & Treats Bakeries Bars Breweries, Wineries & Distilleries Groceries & Markets American Restaurants Asian Restaurants Latin American Restaurants Pizza Seafood Restaurants Steakhouse Food & Drink Gifts Gifts Recipient For Her For Him For Couples For Kids Occasion Birthday Anniversary Wedding Graduation Interest Foodies Relaxing Care Sports Fun Leisure Housewarming Travelers Learning Price Under $10 Under $20 Under $50 Under $100 $100+ More Trending gifts Personalized gifts Flowers, Sweets & Baskets Gift cards Gifts Local Local Beauty & Spas Personal Services Health & Fitness Retail Things To Do Food & Drink Auto & Home Improvement Home Services Gift Cards Local Travel Travel Air-Inclusive Waterparks Casinos Family Romantic Beach Destinations City Outdoor Activities All-Inclusive Cruises Culinary Luxury Spa & Wellness Unique Lodging Travel Goods Goods Health & Beauty Products Fragrance Hair Care Vitamins & Supplements Sexual Wellness Personal Care Skin Care Oral Care Health Care Cosmetics Bath & Body Men's Health & Beauty Massage Aromatherapy Shaving & Grooming For the Home Bedding Furniture Kitchen & Dining Luggage Outdoor Décor Patio, Lawn & Garden Mattresses & Accessories Storage & Organization Bath Home Appliances Floor Care & Cleaning Home Decor Office & School Supplies Seasonal Decor Women's Fashion Women's Clothing Women's Accessories Intimates Women's Shoes Maternity Clothing Personalized Gifts Photo Books Cards, Invitations & Stationery Canvas & Photo Art Custom Gifts & Gadgets Jewelry Clothing & Accessories Home Decor Kitchen Accessories Baby & Kids Pets Bags More Flowers, Sweets & Baskets CBD Cell Phones & Accessories Software Electronics Video Games Jewelry & Watches Men's Fashion Grocery & Household Auto & Home Improvement Sports & Outdoors Pet Supplies Baby & Kids Toys Goods Coupons Coupons Popular Brands Amazon Costco eBay Expedia Great Clips Hotels.com Macy's Nike Pizza Hut The Home Depot TurboTax Viator VistaPrint Walmart Wayfair Trending Betterhelp Booking.com Budget Cabela's Dick's Sporting Goods HBO Max Macy's Old Navy Paramount+ ProFlowers Sam's Club Shutterfly Sunglass Hut TaxSlayer Wayfair Coupons Blog Best 4th of July Sales & Promo Codes Sephora Sales Calendar 2024 Hobby Lobby 2024 Sales Calendar Amazon Prime Day Deals on July 16 & 17 Amazon Prime Discount: Do You Qualify? Amazon Music Unlimited Free 3-Month Trial Ulta 2024 Sales Calendar Back to School: Shop Tax-Free Weekends Nike Factory Outlet Stores Lowe's 2024 Sales Calendar Home Depot 2024 Seasonal Sales Guide Nordstrom Anniversary Sale Calendar Walmart Vision Center Price Guide Cheapest Diaper Deals this Week Macy's 2024 Sales Calendar Coupons Home Monkey's Uncle, Jacksonville Beach Monkey's Uncle, Jacksonville Beach 1850 3rd Street South, Jacksonville Beach, FL 32250 Deals at this location No deals are currently available at this location. This merchant doesn't have any deals and is not affiliated with Groupon. Please contact them directly for services. Is this your business? Similar deals Taste Mexican Cuisine with $25 or $40 Food & Drink Options La Estancia Riverside $25 $18 $16.20 -35% Limited time $15.39 Sign in to apply discount 4.6 (354) Popular Gift City Cruises Chicago - Signature Dining Lake Michigan Signature Dining Cruises with City Cruises 600 East Grand Avenue, Chicago 1.3 mi $104.51 $88.71 -15% 4.4 (3,315) House of Blues ( 7 Locations ) Show or Night Out dining packages for 2 or 4 individuals at House of Blues (Up to 42% Off) 1490 East Buena Vista Drive, Orlando 994.4 mi $96 $65 -32% Mojo's East Coast Eats Savor Amazing Deals at Mojo's East Coast Eats 2758 Maple Ave., Downers Grove 22.9 mi $20 $15 $13.50 -33% Limited time $12.82 Sign in to apply discount 4.7 (268) Pat's Pizza Satisfy Your Cravings: $15 or $30 Worth of Food and Drink 628 South Clark Street, Chicago 0.5 mi $15 $10 $9 -40% Limited time $8.55 Sign in to apply discount 4.9 (33) Oh My Goodness Soul Eatery Up to $75 to spend on soul food and more at Oh My Goodness Soul Eatery 7922 South Western Avenue, Chicago 9.5 mi $25 $18 $16.20 -35% Limited time $15.39 Sign in to apply discount 4.4 (256) 750 Cucina Rustica Sip and Savour: $30 Towards Food and Drink 7 Jandus Road, Cary 39.0 mi $30 $21 $18.90 -37% Limited time $17.96 Sign in to apply discount 4.6 (462) Crepe It Up And Bowls Sip Lattes, Bite Croissants, Savor Crepes – Ultimate Indulgence 1340 75th Street, Downers Grove 22.1 mi $26.28 $18 -32% 5 (38) IWINE 312 SUSHI BAR Savor and Enjoy $50, $75, or $100 Dining Credit for an Exquisite Meal 312 West Adams Street, Chicago 0.6 mi $50 $35 $31.50 -37% Limited time $29.92 Sign in to apply discount 4.9 (25) How to reach us © MapTiler © OpenStreetMap contributors Monkey's Uncle 873.8 mi 1850 3rd Street South, Jacksonville Beach, FL 32250 Closed Closed Call Directions Visit website Parking Good for Kids Price Takes Reservations +19042461070 http://www.monkeysuncletavern.com/ About Monkey's Uncle Come to Monkey's Uncle Tavern in Jacksonville Beach to grab an American classic with a side of fries. Ready for a drink to unwind? At this restaurant, you can pair your meal with something from their full bar. The happy hour at Monkey's Uncle Tavern is sure to impress. Eat outdoors Monkey's Uncle Tavern (weather permitting) with their beautiful patio seating. Bring your laptop here and tap into the complimentary wifi. The restaurant also features a DJ, and patrons are encouraged to strut their stuff on the dance floor. Those hoping to avoid the weekend rush will do best visiting the restaurant during the week. Can't stay at this restaurant long? Pick up and go home. Make use of the ample parking near Monkey's Uncle Tavern. Monkey's Uncle Tavern is home to many cyclists who appreciate the parking racks outside. The menu at Monkey's Uncle Tavern features affordable prices to help you save money on dining out. So when you need to cure your hunger craving, visit Monkey's Uncle Tavern and treat yourself to a tasty American dish. Customer Reviews 100% Verified Reviews All Groupon reviews are from people who have redeemed deals with this merchant. Review requests are sent by email to customers who purchased the deal. | | | | | | Trending in Groupon Groupon is your place for savings and discovery while exploring fun activities in your city and around the country. Explore categories Popular Things Nearby Things To Do In Popular Cities By Cities Coupons and Promo Codes Beauty & Spas Deep Tissue Massage Near You Full Body Massage Near You Teeth Cleaning Near You Lash Extensions Near You Keratin Treatment Near You Reflexology Near You Eyebrow Threading Near You Brazilian Wax Near You Pedicure Near You Day Spa Near You Lip Fillers Near You Tanning Near You Massage Near You Laser Hair Removal Near You Nail Salon Near You Couples Massage Near You Salon Near You Barber Shops Near You Hair Salons Near You Spa Near You Haircut Near You Botox Near You Facials Near You Waxing Near You Food & Drink Food Near You American Restaurants Near You Bars Near You Chinese Food Near You Indian Food Near You Italian Restaurants Near You Mexican Food Near You Pizza Near You Steakhouses Near You Sushi Near You Things To Do Fun Activities Near You Cheap Movie Tickets Events Near You Photography Classes Near You Kids Shows Near You Cheap Concert Tickets Things to Do Near You Amusement Parks Near You Arcade Near You Bowling Near You Escape Room Near You Kids Activities Near You Mini Golf Near You Museums Near You Trampoline Park Near You Zoos Near You Health & Fitness Eye Exam Near You Dentist Near You Teeth Whitening Near You B12 Shots Near You Pilates Near You Chiropractor Near You Dance Classes Near You Dermatologist Near You Fitness Classes Near You Colon Cleanse Near You Invisalign Near You Golf Near You Gyms Near You Weight Loss Clinic Near You Yoga Near You Automotive Oil Change Near You Car Detailing Near You Car Wash Near You Mechanic Near You Wheel Alignment Near You Personal Services Classes Near You Hobbies Near You Cooking Classes Near You Photographers Near You Home Services Air Duct Clening Near You Carpet Cleaning Near You Things To Do In Atlanta Things To Do In Austin Things To Do In Baltimore Things To Do In Boston Things To Do In Calgary Things To Do In Charleston Things To Do In Charlotte Things To Do In Chicago Things To Do In Dallas Things To Do In Denver Things To Do In Edmonton Things To Do In Houston Things To Do In Las Vegas Things To Do In Los Angeles Things To Do In Miami Things To Do In New York City Things To Do In Orlando Things To Do In Ottawa Things To Do In Philadelphia Things To Do In Phoenix Things To Do In Portland Things To Do In San Antonio Things To Do In San Diego Things To Do In San Francisco Things To Do In San Jose Things To Do In Seattle Things To Do In Tampa Things To Do In Toronto Things To Do In Vancouver Things To Do In Washington D.C. Things To Do In Indianapolis Atlanta Austin Baltimore Boston Calgary Charleston Charlotte Chicago Dallas Denver Edmonton Houston Las Vegas Los Angeles Miami New York City Orlando Ottawa Philadelphia Phoenix Portland San Antonio San Diego San Francisco San Jose Seattle Tampa Toronto Vancouver Washington D.C. 1-800-Flowers Coupons Adidas Promo Codes Amazon Promo Codes American Eagle Promo Codes Ancestry DNA Coupons ASOS Promo Codes Bed Bath & Beyond Coupons Boohoo Promo Codes eBay Coupons Edible Arrangements Coupons Forever 21 Coupons H&R Block Coupons Home Depot Coupons Kohl's Coupons L.L.Bean Coupons Lowe's Coupons Macy's Coupons Michaels Coupons Old Navy Coupons Quickbooks Coupons Samsung Coupons Sephora Coupons Target Coupons TJ Maxx Coupons Turbotax Service Codes Udemy Coupons Verizon Wireless Promo Codes Walmart Coupons Weight Watchers Coupons Zales Promo Codes Get the Groupon App Unlock up to 90% discounts on the go with the Groupon app! Exclusive deals, push notifications, and digital vouchers at your fingertips. Get the App 100M+ downloads Groupon Sites USA United Kingdom France Deutschland Italia España Polska Nederland Ireland UAE België Canada Australia Sign up for the latest deals By subscribing, I agree to the Terms of Use and have read the Privacy Statement . Follow Us Support Customer Support Report Infringement Refund Policies Merchant Class Action Settlement Notice Sell on Groupon Join Groupon Marketplace Run a Groupon Campaign How does Groupon work for Merchants Sponsor your Campaign Affiliate Program Vendor Code of Conduct Company About Groupon Jobs Press Investor Relations Management Team Quick Links Treat Yourself Things To Do Coupons Gifts for Occasions © 2025 Groupon, Inc. All Rights Reserved. Terms and Conditions Privacy Statement Do Not Sell or Share My Personal Information Accessibility Sitemap Customer Support Licenses"
    },
    {
      "url": "https://monkeybusinesscamp.com/working-at-upcoming-camps/",
      "text": "Staff: Year-Round Team | Monkey Business Camp Skip to content Monkey Business Camp Show/Hide Menu Home Register Programs School Break Camps Summer Camp Youth Leadership Program Ages 11+ About Policies Our Philosophy Meet the Monkey Business Camp Staff Job Opportunities Contact Staff: Year-Round Team Founders Heather Mitchell (she/her) Co-Founder & Director Heather grew up between Brooklyn’s lively streets and summers in a Catskills bungalow community—two worlds that shaped her love of play, nature, and intergenerational community. In 1998, she founded Monkey Business Camp and has since created and led programs from Tilden Outdoor Camp to Girls & Boys on the Go. With a background in early childhood education and leadership studies, Heather blends creativity, care, and community into everything MBC does. She loves hiking East Bay hills, dancing to live music, and spending time with her husband, Brad. “Thanks for being such a continued presence in our lives and a great leader in the community… you’re helping to raise so many kids with your great values.” —Parent In Loving Memory of Stacy Raye (1960–2011) Co-Founder Stacy was born in Tasmania, raised in Sacramento, and graduated from UC Berkeley, where she was active in student leadership and social justice. She devoted her career to working with children—teaching ASL, nurturing creativity, and helping kids feel both free and caring toward others. In 1998, she co-founded Monkey Business Camp with her partner Heather Mitchell, launching beloved programs like Girls on the Go . Stacy’s passion for community, music, dance, and children’s literature still infuses camp culture today. She passed away in 2011; her spirit continues to guide MBC’s warmth, creativity, and joy. Leadership & Administration Samantha Swor (she/her) Assistant Director Samantha has been part of MBC since 2011—her kids grew from campers to youth leaders to staff. She supports operations and curriculum, helps set up camp daily, teaches art, and mentors staff and youth leaders. With deep roots in early childhood education, Samantha brings color, care, and playfulness to everything she touches. Zach Bigelow (he/him) Program Manager & Site Director Zach began at MBC as a youth leader and now helps shape programming year-round. He supports admin and operations and also serves as an on-site director. A Bay Area native, he loves board games, stories in all forms, and time in nature. You’ll find him leading field games, creative projects, and community moments with steady enthusiasm. On-Site Directors Freesia Huth (she/her) Site Director (Strawberry Banana) A Bay Area native and longtime dance teacher, Freesia has brought joy and movement to MBC since 2015. She believes fun is the key to healthy living and loves creating playful, inclusive spaces for campers and staff. Her energy, creativity, and care set the tone for many sessions throughout the year. Zach Bigelow (he/him) Site Director (Mango Coconut) In addition to his program role, Zach directs on-site sessions year-round—supporting campers, mentoring youth leaders, and teaming closely with staff to create playful, caring days. Operations & Special Guests Brad Olson (he/him) Operations Assistant & Special Guest Brad supports camp operations year-round and keeps things running smoothly behind the scenes. He’s also a beloved on-site guest—leading cooking projects, BINGO, and bubble dance parties that campers talk about for weeks. Outside of camp he enjoys mountain biking, rollerblading, disc golf, cooking, stonemasonry, and playing saxophone. “Brad’s bubble dance parties and BINGO games are highlights my kids talk about for weeks after camp!” —Parent Youth Leadership at Camp Home © 2024 Monkey Business Camp, Berkeley, CA office@monkeybusinesscamp.com"
    }
  ]
}