{
  "fuentes": [
    {
      "url": "https://monstahlobstahirb.com/contact-us/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://www.tripadvisor.co.uk/Restaurant_Review-g34316-d495247-Reviews-Monstah_Lobstah_IRB-Indian_Rocks_Beach_Florida.html",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-738/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/25/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/25/",
      "email": "jenn@dandyreviewaitools.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/25/",
      "email": "scott.arnett45@yahoo.com"
    },
    {
      "url": "https://monstahlobstahirb.com/dish_item/menu/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://www.judnichlaw.com/contact-us/",
      "email": "bo@judnichlaw.com"
    },
    {
      "url": "https://monstahlobstahirb.com/about-monstah-lobstah/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-20/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-20/",
      "email": "jennifer@dandyaisoftware.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/",
      "email": "dave@webrandpromo.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/",
      "email": "elanatuclnnam@yahoo.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/",
      "email": "info@floridakitchenpros.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/",
      "email": "jenn@dandyreviewaitools.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/",
      "email": "ronny.affleck@yahoo.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-9/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-9/",
      "email": "jenn@dandyreviewaitools.com"
    },
    {
      "url": "https://neon.reviewjournal.com/dining-out/monstah-lobstah-offers-a-taste-of-new-england/",
      "email": "neon@reviewjournal.com"
    },
    {
      "url": "https://monstahkookies.com/pages/contact-us",
      "email": "vilcie@monstahkookies.com"
    },
    {
      "url": "https://monstahlobstahirb.com/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/31/",
      "email": "greville.suzanna@yahoo.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/31/",
      "email": "info@monstahlobstahirb.com"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/31/",
      "email": "reddyadam617913@yahoo.com"
    }
  ],
  "mails": [
    "bo@judnichlaw.com",
    "dave@webrandpromo.com",
    "elanatuclnnam@yahoo.com",
    "greville.suzanna@yahoo.com",
    "info@floridakitchenpros.com",
    "info@monstahlobstahirb.com",
    "jenn@dandyreviewaitools.com",
    "jennifer@dandyaisoftware.com",
    "neon@reviewjournal.com",
    "reddyadam617913@yahoo.com",
    "ronny.affleck@yahoo.com",
    "scott.arnett45@yahoo.com",
    "vilcie@monstahkookies.com"
  ],
  "nombre_sitio": "monstahlobstahirb.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://monstahlobstahirb.com/contact-us/",
      "text": "Contact Monstah Lobstahirb | Get in Touch Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Contact Us Click Here Contact Info Phone : 727-595-1320 Address : 125 Gulf Boulevard Indian Rocks Beach, FL 33785 Email: info@monstahlobstahirb.com Monday-Thursday 11:00 pm - 10:00 pm Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Social Media Contact Us Now Or Stop By Today For guest comments or suggestions please feel free to send us an inquiry or tell us how to how to contact you by completing the form below. Name * Email * Phone Number Message Submit Order Specials Reservations Parties Catering [contact-form-7 id=\"a4c05c2\" title=\"Contact form 1\"] The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://www.tripadvisor.co.uk/Restaurant_Review-g34316-d495247-Reviews-Monstah_Lobstah_IRB-Indian_Rocks_Beach_Florida.html",
      "text": "MONSTAH LOBSTAH IRB, Indian Rocks Beach - 2025 Reviews & Info Skip to main content Discover Trips Review GBP Sign in Indian Rocks Beach Hotels Things to Do Restaurants Flights Cruises Holiday Rentals Forums United States Florida (FL) Indian Rocks Beach Indian Rocks Beach Restaurants Monstah Lobstah IRB Monstah Lobstah IRB Claimed Someone from this business manages this listing. Learn More Share Review Save 3.9 3.9 of 5 bubbles ( 819 reviews ) #7 of 29 Restaurants in Indian Rocks Beach American , Bar , ££ - £££ 109 What is Travellers’ Choice? Tripadvisor gives a Travellers’ Choice award to accommodations, attractions and restaurants that consistently earn great reviews from travellers and are ranked within the top 10% of properties on Tripadvisor. Interior 33 Food 41 Menu 1 Monstah Lobstah IRB Share Review Save At a glance Open until 22:00 See all hours 125 Gulf Boulevard, Indian Rocks Beach, FL 33785-2529 Website Menu +1 727-595-1320 Email Improve this listing About Features CUISINES American, Bar, Seafood Meal types Lunch, Dinner, Drinks Special Diets Vegetarian friendly, Vegan options FEATURES Accepts Credit Cards Full Bar Highchairs Available Live Music Outdoor Seating Parking Available Seating Serves Alcohol Table Service Takeout Television Waterfront Wheelchair Accessible Location 125 Gulf Boulevard, Indian Rocks Beach, FL 33785-2529 Parking Available Menu Show full menu Sandwiches add your favorite topping to any sandwich Steak Sandwich 26 reviews 5 oz sirloin 1/4 Lb Burger 3 reviews 100 % sirloin 1/2 Lb Beach Burger 100% sirloin 1 Lb King Burger 100 % sirloin Crab Cake Sandwich 13 reviews Chicken Breast 7 reviews Can a gluten free person get a good meal at this restaurant? Yes No Unsure Save this restaurant Save Hours Suggest an edit Open until 22:00 Sunday 11:00 - 22:00 Monday 16:00 - 22:00 Tuesday 16:00 - 22:00 Wednesday 16:00 - 22:00 Thursday 16:00 - 22:00 Friday 16:00 - 23:00 Saturday 11:00 - 23:00 Contribute Write a review Upload a photo Ask a question Reviews Q&A We perform checks on reviews. Tripadvisor’s approach to reviews Before posting, each Tripadvisor review goes through an automated tracking system, which collects information, answering the following questions: how, what, where and when. If the system detects something that potentially contradicts our community guidelines , the review is not published. When the system detects a problem, a review may be automatically rejected, sent to the reviewer for validation, or manually reviewed by our team of content specialists, who work 24/7 to maintain the quality of the reviews on our site. Our team checks each review posted on the site disputed by our community as not meeting our community guidelines . Learn more about our review moderation. 3.9 3.9 of 5 bubbles ( 819 ) Excellent 326 Good 257 Average 122 Poor 55 Terrible 59 Filters English Detailed Reviews Detailed Reviews: Reviews order informed by descriptiveness of user-identified themes such as cleanliness, atmosphere, general tips and location information. Popular mentions fries oysters live music jds patio beach clearwater Curious429093 1 contribution 0 3 of 5 bubbles NOT the  same Apr 2022 • none Each year I have a group of friends visit from out of town. They always want to go to JD's for their super scallops.   What happened to JD's  delicious huge scallops, these were tiny and tasteless.  We told the  waitress we were disappointed and she stated \"yes a lot has changed since Crabby Bills bought us out\".  For the price we paid I could have gone to the market  gotten just as \"small\" cheaper and made them myself.    The only positive they still have music to listen and enjoy during your meal.  I hope that everything isn't changing This used to be a place I would suggest for the best scallops. Read more Written 19 April 2022 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Veronica Ayala Thank you for your review. We are sorry we left you disappointed with our scallops. We work hard to source only the best ingredients and apologize that your scallops did not reach your table as intended. If ever something is not to your liking, please don't hesitate to let your manager know so our team can immediately work to make things right for you.\nI would like to look further into this and would appreciate if you would email me at marketing@crabbybills.com with more details about your visit (date/time, who your server was, receipt #, last 4 digits of card used for payment if applicable, if you spoke to the manager, etc.). With more information, we will be better able to address and correct the issues you experienced.\nWe hope for the opportunity to serve you again and show you the great experience you are used to.\nThank you,\nVeronica - Brands Manager Read more Written 20 April 2022 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. AnnHMColumbus_Ohio 20 contributions 0 3 of 5 bubbles A bit disappointing Feb 2020 • couples Have gone there every year when we are in the area and we’ve really enjoyed it. But this year, we had our usual shrimp and found the shrimp to be very small and overcooked. Very disappointing.  This has always been one of our favorite spots but now—-not so much. Read more Written 15 February 2020 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Claudia 4 contributions 1 3 of 5 bubbles No precautions utilized for safety of customers Jun 2020 • none I enjoy going to this establishment but since reopening I’m not at all impressed. If your looking for a safe place to dine this is not the place. My experience started by not seeing one employee wearing a mask. It continued when I was given a plastic covered menu that I witnessed being continually used without being cleaned. There were no precautions taken. I asked management why no one was wearing masks and was told employees did not want to wear them. \nSo there you go. Dine there at your own risk. Read more Written 7 June 2020 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Rob T 27 contributions 0 5 of 5 bubbles Great stop off May 2025 • couples I’m giving 5* as called in our way from Treasure island to Clearwater for a few beers  I went In The bar where our waiter (I think name was something like Tobias) took  our drinks order.  The music was a bit loud and a lovely sunny day so we moved outside and our waiter was very accommodating so we then had food and all was good and reasonably priced.  We really enjoyed it Read more Written 3 May 2025 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Crabby Bill's Family Brands We can’t thank you enough for your generous comment and rating, Rob. It’s feedback like yours that motivates our team to continue delivering stellar service throughout the Monstah Lobstah and JD's Back Porch region. We appreciate your support for our business, and hope we’ll have the chance to serve you again soon.\nThank you, \n\nShonda  \n\nMonstah Lobstah’s General Manager Read more Written 3 July 2025 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. Gigi152 Tampa 41 contributions 0 2 of 5 bubbles Not What It Used to Be May 2024 • couples The food in this place has really gone downhill since it was bought by the Crabby Bill's organization. It used to be a place to get a pretty good meal, but what we have been served lately is an insult. A single dried-up and wilted piece of lettuce slapped on a plate, way overcooked and dried out fish, a tiny and burnt baked potato, and that was probably the best of the meals at our table. The service too used to be stellar. But they got rid of the more experienced staff and hired clearly inexperienced staff to presumably pay less. The drinks used to be reasonably priced. Now they are priced much higher, and the quality of what you get is rock bottom. The music is still great. But that is the only thing that is reminiscent of the old JDs. There are better places on the beach. We won't be back. Read more Written 18 May 2024 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Crabby Bill's Family Brands Gigi152, we are so sorry to hear we left you disappointed. We strive to provide our guests with excellent service and delicious food. We apologize if we did not accomplish our goals during your visit and I would greatly appreciate additional information so I can look further into this. Please email me directly at mackenzie.baird@bigclawmanagement.com with these and more details (date/time of visit, receipt #, server's name, last 4 digits of credit card if applicable, if you spoke to a manager, etc.) With more information, I can better address and correct the issues you experienced. We hope to make things right and show you a much better experience. Thank you, Mackenzie Read more Written 20 May 2024 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. Candice C 1 contribution 1 2 of 5 bubbles Food runner was a delight. Waitress was awful. Nov 2023 • family This is my first time at JDs, I was excited to get breakfast here with my family until i got Here! Our waitress T was visibly flustered and annoyed by our being there. She was rude from the moment we sat down. She never introduced herself or anything we had to ask her what her name was at the end of our meal.. She claimed it was because she was soo busy so she couldn’t be bothered with seeing if we needed silverware or coffee. She got to taking our order and because she was speaking so fast i misunderstood what she said and she gave me a dirty cocky look for not hearing her correctly. My grandfather asked her if she was going to give him anymore coffee and she said oh sure i have 10 tables It’s busy make sure you catch me when you can for coffee. The guy who brought out our food was a delight. He was so welcoming and made us feel happy to eat. Wish i could say the same for her. Probably won’t be back due to her making us feel unwelcome. Read more Written 5 November 2023 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Crabby Bill's Family Brands candicecW6325SP, we are so sorry to hear we left you disappointed. We strive to provide our guests with excellent service and delicious food. We apologize if we did not accomplish our goals during your visit and I would greatly appreciate additional information so I can look further into this. Please email me directly at mackenzie.baird@bigclawmanagement.com with these and more details (date/time of visit, receipt #, last 4 digits of credit card if applicable, if you spoke to a manager, etc.) With more information, I can better address and correct the issues you experienced. We hope to make things right and show you a much better experience. Thank you, Mackenzie Read more Written 5 December 2023 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. atsendel Cote Saint-Luc 102 contributions 0 5 of 5 bubbles CLAM CHOWDER Jun 2023 • couples What a great place. Blue cheese burger was awesome, BLT (massive), fries were scorching hot. Beer was not expensive. Clam Chowder (best I've ever had) Music was great. Service was extremely friendly. Read more Written 15 June 2023 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. luvntravel20 Green Bay 102 contributions 0 5 of 5 bubbles What a fun spot! Mar 2023 • couples What a fun surprise! We have vacationed on Clearwater Beach for many years and typically walk for dinner. Tonight we decided to take a ride and stopped here for dinner. It was unexpected fun! We ordered ribs and chicken breast dinners. Both were really good for the price. If your an uptight foodie, this is not the place for you. The all you can eat salad was awesome. The band in the back bar area was very good and people were having a blast enjoying the music. After dinner, we stopped at the front piano bar to listen to the musician. He was fun to listen to. Loved the vibe, definitely going back! Read more Written 21 March 2023 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Veronica Ayala Thank you for joining us! We hope you'll come back soon! Read more Written 5 April 2023 This response is the subjective opinion of the management representative and not of Tripadvisor LLC. Kim Hartford 2 contributions 3 1 of 5 bubbles Bring Your Wallet and Patience Jun 2021 • family So we are on Vacation from KY.  We decided to try JDs because it was about the only place we called with no wait.  (There's a reason)  so...my group was my husband, 21 year old daughter, and sons 17, 15, and 12. My daughter went in first and the hostess told her to sit at the tables by the door because she didn't have time to seat us right now.  Many tables were visibly open.  \nWe sat for 25 to 30 min.  The waitress took our order after we were seated and didn't take my sons order before she walked off.  I flagged her down and she acted like I aggravated her.  We ordered our food...my youngest got a cheeseburger and my daughter and 15 year old shared a meal of crablegs.   We got an appetizer and 4 of us ordered water to drink.  When we were finished we got the bill...175.00!  30.00 tip included.  When I asked about that I was told that any party of 5 or more automatically got it added.  They were my children!  Not a party of 5 different tickets that makes it more challenging.  The food was good but very small portions.  Very overpriced.  Bad service..  Would NOT return.  If I tip someone I want to choose the amount.  I dont want to tip someone 30.00 for poor/mediocre service. Read more Written 7 June 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. jhtoome Hollywood 38 contributions 1 5 of 5 bubbles Stop Here! Jun 2021 • none We stopped here on a Thursday for dinner. We have been here before. The single female bartender was snippy and could have used some help,  unless you were one of her regulars. All of our food orders were delivered  hot, flavorful and together. Outdoor bar had live music and a dance area. Seafood is fresh and well prepared. Salads were also crisp. Good place to stop, but come early, gets crowded. Read more Written 16 June 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Michelle008_800 Tavistock 177 contributions 0 5 of 5 bubbles Good Food Jan 2020 • couples My husband and I ate here while on vacation in the area. We saw the menu online and had to check it out. They have an early bird menu for $9.25 if you order before 6pm. I ordered the chicken and my husband had the all you can eat fish and chips for $9.95. They also had happy hour draft beers for $1.25. The food was good. They have a back room with live bands playing and it was packed. People were dancing and having a great time back there. The waiters were very friendly and the service was fast.  We would recommend it. Read more Written 31 January 2020 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Travis B 33 contributions 1 2 of 5 bubbles Very average, expected better Feb 2021 • none We recently tried JD's for the first time.  I was excited, the pictures looked good and the reviews were very positive.  It was very average overall and I paid far too much for a dinner that included bland fish and a loaded baked potato that was covered in what I can only guess was Velveeta cheese, and un-melted Velveeta cheese at that.  Disappointed doesn't even begin to express my feelings. Read more Written 16 February 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Barb Szatko Naperville 1 contribution 0 1 of 5 bubbles Did not honor prices that are on the web menu Feb 2020 • none My husband and I went for the Tuesday Daily Special all you can eat fish fry advertised on their website menu for $8.99 only to learn that they no longer featured this.\nWe asked for the manager and she too would not honor the website menu pricing.\nJD's, if you advertise something at a certain price, then you should honor that price.\nCustomer Service 101.\nWe left the restaurant and will not return. Read more Written 18 February 2020 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Betsy A Charleston 131 contributions 0 5 of 5 bubbles Loved it Jul 2021 • none This is an older place and a little like stepping back to the 70s or 80s. We were immediately greeted by hostess and given option of self seating outside or a small wait for inside. We chose outside and glad we did as the band was excellent and we were able to eat dinner out there. People were dancing and having a good time. Inside is quiet dining room. Sheree was our waitress and she was great. She had lots of personality, was attentive and fun. Our service was excellent even on this very busy night. The outside was packed and full. The food did not disappoint. We had peel and eat shrimp, Chicago oysters, salad, gumbo. Crab legs and bacon wrapped scallops. All were very,  very good with very reasonable prices compared to others in the area. We would definitely go back. This was one of our best meals on our trip and Sheree and the delicious, fresh food made it extra nice. Loved seeing everyone having so much fun. Read more Written 21 July 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. Sarah H 1 contribution 0 1 of 5 bubbles Horrible! Do not recommend! Apr 2021 • family Horrible! The kitchen was backed up and they wouldn’t seat us until they caught up. Our initial wait time was 35-40 min and we didn’t sit down for an hour and 15 min. Then we couldn’t order when we sat down because the kitchen was too backed up!Once we were able it took a while to get it our food....hire more people! We were there for over 2.5 hours. Ridiculous!!!! DO NOT RECOMMEND. We would’ve turned around but we waited too long and then didn’t realize we couldn’t even order when we sat down!!!!! Read more Written 3 April 2021 This review is the subjective opinion of a Tripadvisor member and not of Tripadvisor LLC. Tripadvisor performs checks on reviews as part of our industry-leading trust & safety standards. Read our transparency report to learn more. 1 2 3 4 5 6 … Showing results 1 - 15 of 811 Best moderately priced restaurants See all Sponsored Friendly Fisherman Restaurant 3.9 3.9 of 5 bubbles ( 1,841 reviews ) American • ££ - £££ Open now The Original Crabby Bill's 4.5 4.5 of 5 bubbles ( 6,576 reviews ) American • ££ - £££ Open now Villa Gallace 4.5 4.5 of 5 bubbles ( 875 reviews ) Italian • ££ - £££ Open now Guppy's on the Beach 4.4 4.4 of 5 bubbles ( 2,582 reviews ) American • ££ - £££ Open now Reserve Keegan's Seafood Grille 4.3 4.3 of 5 bubbles ( 1,605 reviews ) American • ££ - £££ Open now PJ's Oyster Bar 4.1 4.1 of 5 bubbles ( 1,426 reviews ) American • ££ - £££ Open now TJ's Italian Cafe 4.0 4 of 5 bubbles ( 582 reviews ) Italian • ££ - £££ Open now Jimmy Guana's Restaurant 3.9 3.9 of 5 bubbles ( 766 reviews ) Seafood • ££ - £££ Open now Groupers On The Gulf 4.3 4.3 of 5 bubbles ( 94 reviews ) American • ££ - £££ Open now 18 on the Rocks 3.9 3.9 of 5 bubbles ( 298 reviews ) American • ££ - £££ Open now Best nearby We rank these hotels, restaurants, and attractions by balancing reviews from our members with how close they are to this location. Best nearby hotels See all Sandy Shores 4.9 4.9 of 5 bubbles ( 204 ) 0.18 miles away Great Heron Inn 4.8 4.8 of 5 bubbles ( 219 ) 0.15 miles away Gulfside Resorts 4.8 4.8 of 5 bubbles ( 210 ) 0.16 miles away New Hotel Collection Harbourside Resort 4.0 4 of 5 bubbles ( 755 ) 0.17 miles away Best nearby restaurants See all Villa Gallace 4.5 4.5 of 5 bubbles ( 875 ) 0.02 miles away The Original Crabby Bill's 4.5 4.5 of 5 bubbles ( 6,575 ) 0.27 miles away PJ's Oyster Bar 4.1 4.1 of 5 bubbles ( 1,426 ) 0.33 miles away Candy Kitchen 4.3 4.3 of 5 bubbles ( 225 ) 0.14 miles away Best nearby attractions See all Keegan Clair Park 3.8 3.8 of 5 bubbles ( 6 ) 0.12 miles away Splash Harbour Water Park 4.0 4 of 5 bubbles ( 234 ) 0.22 miles away Indian Rocks Historical Museum 4.4 4.4 of 5 bubbles ( 74 ) 0.22 miles away McGough Nature Park 4.7 4.7 of 5 bubbles ( 181 ) 0.48 miles away Is This Your Listing? Own or manage this property?  Claim your listing for free to respond to reviews, update your profile and much more. Claim Your Free Listing MONSTAH LOBSTAH IRB, Indian Rocks Beach - 2025 Reviews & Info Indian Rocks Beach Indian Rocks Beach Tourism Indian Rocks Beach Hotels Bed and Breakfast Indian Rocks Beach Indian Rocks Beach Holiday Rentals Flights to Indian Rocks Beach Indian Rocks Beach Restaurants Indian Rocks Beach Attractions Indian Rocks Beach Travel Forum Indian Rocks Beach Photos Indian Rocks Beach Map Hotels All Indian Rocks Beach Hotels Indian Rocks Beach Hotel Deals Hotels Near Me By Hotel Type Indian Rocks Beach Motels Romantic Hotels in Indian Rocks Beach Indian Rocks Beach Resorts Indian Rocks Beach Green Hotels Business Hotels Indian Rocks Beach Family Hotels Indian Rocks Beach Indian Rocks Beach Beach Hotels By Hotel Class 3-Star Hotels in Indian Rocks Beach Popular Amenities Indian Rocks Beach Hotels with a Pool Pet Friendly Hotels in Indian Rocks Beach Popular Neighbourhoods Hotels near Independence Square Popular Indian Rocks Beach Categories Charming Hotels in Indian Rocks Beach Hotels with Kitchenette in Indian Rocks Beach Indian Rocks Beach Suite Hotels Quiet Hotels in Indian Rocks Beach Hotels with Waterparks in Indian Rocks Beach Indian Rocks Beach Hotels with a View Indian Rocks Beach Accessible Hotels Indian Rocks Beach Hotels with Outdoor Pool Indian Rocks Beach Hotels with Gym Indian Rocks Beach Hotels with Air Conditioning Near Landmarks Hotels near Splash Harbour Water Park Hotels near Indian Rocks Beach Nature Preserve Hotels near Indian Rocks Beach Access Hotels near Indian Rocks Historical Museum Hotels near Beach Art Center Hotels near Kolb Park Hotels near Yoga on the Beach Hotels near Chief Chic-A-Si Park Hotels near Keegan Clair Park Hotels near Belleair Rent-a-car Near Airports Hotels near Tampa Intl Airport (TPA) Hotels near St. Petersburg Intl Airport (PIE) Hotels near Bradenton Airport (SRQ) Motels near St. Petersburg Intl Airport (PIE) Motels near Bradenton Airport (SRQ) Motels near Tampa Intl Airport (TPA) Near Colleges Hotels near Everest University Largo Hotels near Schiller International University Hotels near American Institute of Beauty, Inc. Hotels near PTEC Clearwater Campus Hotels near National Aviation Academy Hotels near St. Petersburg Seminary and Yeshiva Hotels near Fortis College Hotels near Cortiva Institute Hotels near Loraines Academy Hotels near Ultimate Medical Academy Popular Hotel Categories Popular Luxury Resorts Popular Ryokan Popular Ski Resorts Popular Resorts Popular Campgrounds Popular Hotels With Waterparks Popular Apartment Hotels Popular Family Hotels Popular Villas Popular Boutique Hotels Things to Do Restaurants All Indian Rocks Beach Restaurants Restaurants near Monstah Lobstah IRB Popular Types of Food Turkish Restaurants in Indian Rocks Beach Fast Food Restaurants in Indian Rocks Beach Street Food Restaurants in Indian Rocks Beach Latin Restaurants in Indian Rocks Beach Vegetarian Restaurants in Indian Rocks Beach Vegan Restaurants in Indian Rocks Beach Gluten Free Restaurants in Indian Rocks Beach Late Night American Restaurants in Indian Rocks Beach Italian Restaurants for Families in Indian Rocks Beach Seafood Restaurants with Outdoor Seating in Indian Rocks Beach Popular Dishes Best Salmon in Indian Rocks Beach Best Cannoli in Indian Rocks Beach Best Tacos in Indian Rocks Beach Best Beef Stroganoff in Indian Rocks Beach Best Frozen Yogurt in Indian Rocks Beach Best Ceviche in Indian Rocks Beach Best Sandwiches in Indian Rocks Beach Best Salad in Indian Rocks Beach Best Hot Dogs in Indian Rocks Beach Best Calamari in Indian Rocks Beach Best Nachos in Indian Rocks Beach Best Risotto in Indian Rocks Beach Best Beignets in Indian Rocks Beach Best Crepes in Indian Rocks Beach Best Tiramisu in Indian Rocks Beach Popular Restaurant Categories Breakfast Restaurants in Indian Rocks Beach Lunch Restaurants in Indian Rocks Beach Dinner Restaurants in Indian Rocks Beach Restaurants with Outdoor Seating in Indian Rocks Beach Restaurants for Special Occasions in Indian Rocks Beach Restaurants for Group Dining in Indian Rocks Beach Restaurants with a View in Indian Rocks Beach Late Night Restaurants in Indian Rocks Beach Kid Friendly Restaurants in Indian Rocks Beach Romantic Restaurants in Indian Rocks Beach Desserts in Indian Rocks Beach Coffee & Tea in Indian Rocks Beach Bakeries in Indian Rocks Beach Flights Holiday Rentals Travel Stories Cruises More Tours Add a Place Travel Forum Airlines Travellers' Choice Help Centre Trip Planner © 2025 Tripadvisor LLC All rights reserved. Terms of Use Privacy and Cookies Statement Cookie consent Site Map How the site works Contact us Accessibility Statement This is the version of our website addressed to speakers of English in United Kingdom . If you are a resident of another country or region, please select the appropriate version of Tripadvisor for your country or region in the drop-down menu. Tripadvisor   LLC makes no guarantees for availability of prices advertised on our sites and applications. Listed prices may require a stay of a particular length or have blackout dates, qualifications or other applicable restrictions. Tripadvisor   LLC is not responsible for any content on external web sites that are not owned or operated by Tripadvisor  . Tripadvisor LLC is not a booking agent or tour operator. When you book with one of our partners, please be sure to check their site for a full disclosure of all applicable fees. Read more £ GBP United Kingdom"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-738/",
      "text": "Contact Us - Monstah Lobstah Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Name: MphUiPlkuz Email: tbrednw1@gmail.com Phone: 7774529968 Message: The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/25/",
      "text": "Inquiries Archive - Page 25 of 139 - Monstah Lobstah Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Contact Us Name: AGbrjfFE Email: dezdemonagrantoo@gmail.com Phone: 5950727185 Message: Contact Us Name: Jennifer Obrien Email: jenn@dandyreviewaitools.com Phone: (949)-755-7782 Message: JD’s Restaurant & Lounge, Leads for JD’s Restaurant & Lounge are being missed on (727) 595-1320 – especially after hours. Do you want us to answer those for you and automatically schedule them into your business? Our technology gives you a 24/7 ai employee that monitors every […] Contact Us Name: Donald Kirk Email: info@monstahlobstahirb.com Phone: Message: Hi, Stock Talk Insiders is a professional trading & investing community built by @stocktalkweekly on X/Twitter. We are followed by Elon Musk and several Fortune 500 CEOs and U.S. congresspeople:https://x.com/stocktalkweekly . We have assembled an expert team of traders & investors with over 50 years of combined experience […] Contact Us Name: Lavea Email: polyessence@gmail.com Phone: +18082560456 Message: Ukulele player looking for open dates to book.feel good music, postive vibrations.. Reverbnation.com/polyessence Thank you and mahalo for your time Contact Us Name: aefaJGNYOjDm Email: foxtina1990@gmail.com Phone: 2646494384 Message: Contact Us Name: fLlZXIVUCb Email: davidagarnerr1982@gmail.com Phone: 7297825323 Message: Contact Us Name: YcLORikhKYtt Email: foxtina1990@gmail.com Phone: 3169907438 Message: Contact Us Name: OEFysDfzIk Email: davidagarnerr1982@gmail.com Phone: 2299552046 Message: Contact Us Name: Eman Ibrahim Email: emanibrahim2027@gmail.com Phone: 00201098839623 Message: Experience: Working with over 100 clients (companies) from various Arab countries, including Egypt, Saudi Arabia, the UAE, Qatar, and Kuwait. Social media designs – logos – business cards – banners – flyers – company profiles – company catalogs. Some of my work : https://www.behance.net/emanibrahim3 Available for work […] Contact Us Name: Scott Arnett Email: scott.arnett45@yahoo.com Phone: 7835067096 Message: Hi, We have a promotional offer for your website monstahlobstahirb.com. Instantly Research Profitable Keywords, Create & Publish To 310 Million Amazon Users Without Writing A Single Word Making Us $527 Per Day! No Writing. No Tech Skills. No Experience Needed! Learn more: https://www.youtube.com/watch?v=3PMOkcMJGNg You are receiving this […] ← older newer → The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://monstahlobstahirb.com/dish_item/menu/",
      "text": "Monstah Lobstah's Menu: Delightful Dishes & Crafted Beverages Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Lunch & Dinner Prix Fixe Menu Starters Raw Bar Salads Fried Seafood Platters Clawhelds The Lobstah Menu Entrees Sides Kid Meals Beverages Prix Fixe Menu 3-Courses, One Price! *MONDAY - FRIDAY 4PM - 6PM || *MUST BE ORDERED BY 6PM Course 1: Choice of Simple House Salad or Cup of Haddock Chowder Course 2: Choice of Entree Course 3: Monstah's Petit Dessert - $22 Grilled Hickory Dusted Salmon SERVED WITH PARSLEY POTATOES AND TOPPED WITH CORN SALSA BBQ Roasted Half Chicken SERVED WITH SAUTEED GREEN BEANS Crispy Shrimp SERVED WITH OLD BAY CHIPS, SLAW, AND HUSHPUPPIES Seafood Stuffed Half Maine Lobstah SERVED WITH LEMON BUTTER SAUCE AND SLAW Shrimp & Lobstah Pastah LINGUINI TOSSED WITH OUR GARLIC WHITE CREAM SAUCE AND SAUTEED WITH\r\nLOBSTER, SHRIMP, TOMATOES, AND ONIONS. SERVED WITH GARLIC TOAST Fried Cod Platter FRIED COD WITH OLD BAY FRIES, SLAW, AND HUSPUPPIES Linguini with Clams LINGUINI TOSSED WTH TENDER CLAMS IN A WHITE WINE SAUCE OR MARINARA SAUCE AND SERVED WITH GARLIC TOAST Starters Monstah Poutine $13.00 Crispy fries topped with lobster bisque, lobster, shrimp, scallions, bacon, cheese, and lemon aioli Panko Fried Buffalo Shrimp $14.00 Served with blue cheese and celery Grouper Nuggets $17.00 Hand breaded and fried crispy served with tartar Calamari & Peppers $18.00 Fried crispy with tangy cherry peppers. Served with spicy marinara and lemon aioli Beer Battered Onion Rings $13.00 Served with brew mustard Sauteed Mussels $22.00 Lemon, garlic, white wine, chili, and a touch of cream; with sourdough bread Boiled Shrimp $15.00 Our peel & eat shrimp boiled and served with butter and Old Bay spice Boneless Buffalo Bites $13.00 Served with blue cheese and celery Hot Littlenecks $20.00 Littleneck clams in a butter wine broth ML Fish Chowdah $9.00 Thick and creamy fish chowder with potatoes, onions, bacon, corn, and chives Smoked Fish Dip $16.00 Locally smoked fish, blended with mayo and served with crackers Lobster Bisque $12.00 Rich and creamy with lobster, cream, sherry, and chives Mozzarella Sticks $12.00 Classic cheese sticks served with marinara sauce Fried Pickle Chips $9.00 Handbreaded and served with ranch Buffalo Chicken Wings Naked style, fried crispy tossed with buffalo or hot sauce and served with blue cheese and celery (10) $16 | (20) $30 Raw Bar Oysters $15.00 $26.00 6 or 12 with horseradish, cocktail, and mignonette Cocktail Shrimp $15.00 $28.00 JUMBO! 6 or 12 shrimp with horseradish and cocktail Upgrade Your Greens Upgrade Your Greens – Chicken Breast $6 |\r\nFaroe Salmon $9 |\r\nReal Grouper $12 |\r\nJumbo Shrimp $9 | Dressings – House Made Ranch, Blue Cheese, Italian Vinaigrette, House Made Caesar Caesar Salad $14 Romaine, croutons, parmesan, and house made Caesar dressing Simple House Salad $11 Romaine, tomatoes, onions, carrots, croutons, and house made ranch Fried Seafood Platters SERVED WITH OLD BAY CHIPS, SLAW, AND HUSHPUPPIES SUBSTITUTE FRIES +$1 Real Grouper $29.00 Popcorn Shrimp $19.00 Crispy Shrimp $25.00 Sea Scallops $29.00 Cod $23.00 Haddock $MKT Monstah Seafood Plattah $39.00 Cod, clam strips, sea scallops, and crispy shrimp Clawhelds SERVED WITH OLD BAY CHIPS SUBSTITUTE OLD BAY FRIES OR SLAW +$1 Crispy Chicken Sandwich $15.00 Country fried chicken breast, onions, shredded lettuce, dill pickles, and house made ranch Grown Up Fish Stick Sandwich $17.00 Hand cut and beer battered cod sticks, lettuce, tomato, and tartar Blackened Grouper Sandwich $22.00 Real grouper, lettuce, tomato, onion, and tartar Lobstah Roll $29.00 Served on a buttered brioche: Traditional: mayo, celery, lemon zest, tarragon, and chives Connecticut: hot butter and chives Monstah Style: double the lobster...+ $10 Monstah Burger $25.00 Braveheart brand midwestern steakburger, sauteed lobster, sharp cheddar, lettuce, tomato,\r\nand bacon onion jam Patty Melt $16.00 Braveheart brand midwestern steakburger with grilled onions, American cheese, and thousand island, on toasted white bread Monstah Lobstah Melt $26.00 Sauteed lobster, shrimp, bacon onion jam, American cheese, sharp cheddar, and grilled onions on buttered sourdough Cheeseburger $16.00 Braveheart brand midwestern steakburger, American cheese, lettuce, tomato, and onion. Add bacon +$2 The Lobstah Menu Served with corn, potatoes, and a side of slaw || We serve true maine lobsters caught by usa lobstermen See our board for today’s boat price! Spicy Sausage (1/2 Pound) $6.00 Mussels (1/2 Pound) $9.00 Littlenecks (1 Dozen) $14.00 Jumbo Shrimp (6 Each) $12.00 Steamed Oysters (1 dozen) $15.00 Kicked Up Spicy Style $2.00 Big Maine Lobstah MKT Averages 1lb Bigger Maine Lobstah MKT Averages 2lbs Biggest Maine Lobstah MKT Averages over 3lbs Entrees Massachusetts Sea Scallops $34.00 Blackened sea scallops with parsley potatoes and sauteed green beans Grilled Hickory Dusted Salmon $26.00 Faroe salmon filet, dusted in hickory BBQ spice and grilled. Topped with corn salsa and served with parsley potatoes and slaw BBQ Roasted Half Chicken $22.00 Fall off the bone BBQ half chicken, served with parsley potatoes and sauteed green beans Yankee Suppah $49.00 1 pound of Maine lobster, littlenecks, mussels, corn, potatoes, spicy sausage, and butter wine broth. Served with a side of slaw “I Don’t Want Lobstah” Snow Crab Legs $37.00/1 Pound $68.00/2 Pound Piping hot steamed snow crab legs. Served with drawn butter, Old Bay fries, and slaw Seafood Stuffed Maine Lobstah $27.00/Half $46.00/whole Stuffed with shrimp, crab, and scallops. Oven broiled with crumbled Ritz crackers, and topped with lemon butter sauce. Served with parsley potatoes and slaw Shrimp & Lobstah Pastah $27.00 Linguini tossed with our garlic white cream sauce and sauteed with lobster, shrimp, tomatoes, and onions. Served with garlic toast Braveheart Ribeye $36.00 12 ounces of hand cut well marbled USDA choice beef, grilled to your liking and served with parsley potatoes and sauteed green beans *Make it a Surf & Turf by adding Sauteed Garlic Butter Royal Red Shrimp +$7 New England Style Seafood Bake $32.00 Scallops, cod, and jumbo shrimp topped with crumbled Ritz crackers, butter, white wine, and cream. Oven baked, served with parsley potatoes, and sauteed green beans Linguini with Clams $24.00 Linguini tossed with tender clams in a white wine sauce or marinara sauce served with garlic toast Sides Small Simple House OR Caesar Salad $5.00 Sauteed Green Beans with Bacon & Onions $5.00 Parsley Red Potatoes $4.00 Hush Puppies $6.00 Slaw $4.00 Corn $4.00 Old Bay Fries $4.00 Old Bay Chips $4.00 Kid Meals Kids meals served with fries, sauteed green beans, corn, or hush puppies and a soft drink (water, tea, soda) Fried Cod Nuggets $10.00 Chicken Bites $10.00 Cheeseburger $10.00 Crispy Shrimp $10.00 Beverages Sodas $4.00 COKE, DIET, SPRITE, COKE ZERO Iced Tea $4.00 SWEET, UNSWEET Coffee $4.00 **Consuming Raw or Undercooked Meats, Seafood, Poultry, Shellfish, Oysters, or Eggs may increase your risk of food borne illness, especially if you have medical conditions.** **Shared plates will incur a $5 Surcharge** The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://www.judnichlaw.com/contact-us/",
      "text": "Contact Us | Judnich Law, Montana 8:00 AM - 5:00 PM Our Opening Hours Mon - Fri. (406) 721-3354 Call us for free consultation Missoula (406) 602-8700 Call us for free consultation Bozeman (406) 721-3354 Call us for free consultation Missoula Call Us in Missoula (406) 602-8700 Call us for free consultation Bozeman Call Us in Bozeman Close Home About Us Practice Area Criminal Law DUI Defense Expungement Drug Possession Conditional Probation Discharge Offender Registration Removal Family Law Child Custody Child Support Divorce Personal Injury Auto Accident Negligent Death Locations Missoula Law Office Bozeman Law Office Blog CONTACT US Contact Experienced Montana Attorneys Judnich Law, Montana Free consultation. (406) 721-3354 . Family law, auto accidents, and criminal defense. In Missoula on Russell St and Bozeman on W Dickerson St. Call Today Photo by Urs Keller Contact Us Judnich Law Firm proudly serves individuals throughout all of Montana with high-quality legal services in areas of family law, criminal law, and injuries from auto accidents. Initial consultation for criminal defense and personal injury is always free. Family law consultations are free as long as you retain the firm after the consultation. For your convenience, we have offices in both Missoula and Bozeman, Montana, and happily practice in all jurisdictions and District Courts across the State. If you don’t want to come into the office, we will gladly set up a Zoom consultation to speak with you as well. Name (Required) Phone (Required) Email (Required) Message (Required) URL This field is for validation purposes and should be left unchanged. After Hours Feel free to call after hours (5 pm), and our live operator will take your call and send the appropriate attorney a message. If you’re not available to meet until after 5 pm, let us know. We’ll work with you to find a mutually convenient time. CALL TODAY Toll-Free: (406) 721-3354 Email: bo@judnichlaw.com Current Clients If you’re a client with a quick question about your case, remember that you have full access to your file through your online client portal. You can also upload materials and send us messages through your portal. Still need help? Our contact information follows. Reach us in Missoula Reach us in Bozeman Reach us in Missoula Reach us in Bozeman 501 S Russell St, Missoula, MT 59801 (406) 721-3354 Both locations are ADA-friendly and staff are all LGBTQ+ friendly. We see you, we care, and we want to help you if we can. 1940 W Dickerson St #102, Bozeman, MT 59718 (406) 602-8700 Both locations are ADA-friendly and staff are all LGBTQ+ friendly. We see you, we care, and we want to help you if we can. Best Ways to Reach Us Phone. The fastest way to reach us is by telephone. Our staff will have a quick chat with you and schedule you in if they believe we can help you. For additional information and for non-urgent questions, feel free to email us or use the contact form to above get in touch with us. We look forward to speaking with you. We will help if we can. CALL TODAY Follow Us Navigation Home About Contact Us Practice Areas Criminal Law DUI Defense Expungement Drug Possession Conditional Probation Discharge Offender Registration Removal Family Law Child Custody Child Support Divorce Personal Injury Auto Accident Negligent Death Missoula Judnich Law Office 501 S Russell St Missoula, MT 59801 (406) 721-3354 Mon-Fri 8:00 AM - 5:00 PM Bozeman Judnich Law Office 1940 W. Dickerson Ave, Suite 102 Bozeman, MT 59718 (406) 602-8700 Mon-Fri 8:00 AM - 5:00 PM Practice Areas Criminal Law DUI Defense Expungement Drug Possession Conditional Probation Discharge Offender Registration Removal Family Law Child Custody Child Support Divorce Personal Injury Auto Accident Negligent Death Navigation Home About Contact Us Bozeman Judnich Law Office 1940 W. Dickerson Ave, Suite 102 Bozeman, MT 59718 (406) 602-8700 Mon-Fri: 9am-5pm Missoula Judnich Law Office 501 S Russell St Missoula, MT 59801 (406) 721-3354 Mon-Fri: 9am-5pm ©2025 Judnich Law Office | Privacy Policy | Accessibility Statement | Sitemap | Resources Photos by Destination Missoula and Urs Keller"
    },
    {
      "url": "https://monstahlobstahirb.com/about-monstah-lobstah/",
      "text": "About Our Story | About Monstah Lobstahirb Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards About Monstah Lobstah Monstah Lobstah ABOUT US Welcome to Monstah Lobstah, your ultimate destination for fresh, Northeastern-inspired seafood right here in the heart of Indian Rocks Beach. Our mission is to bring the authentic taste and charm of New England to Florida’s Gulf Coast. Monstah Lobstah proudly features fresh live Maine lobsters, a wide variety of fresh seafood, and a menu crafted to delight seafood lovers and families alike. With a focus on quality and value, we offer a dining experience where everyone can enjoy premium meals without breaking the bank. Set in a clean and inviting atmosphere, Monstah Lobstah celebrates the spirit of the sea while paying homage to the beloved local landmark, JD’s, which previously called this location home. We’ve kept the sense of community alive, infusing our space with both nostalgia and fresh energy. Enjoy live music on our back porch daily, adding a lively and welcoming vibe to every visit. Whether you’re looking to enjoy a family night out, a date with unbeatable seafood, or a casual gathering with friends, Monstah Lobstah is the place to be. Come for the lobstah, stay for the memories. We look forward to serving you! The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-20/",
      "text": "Contact Us - Monstah Lobstah Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Name: Jennifer Obrien Email: jennifer@dandyaisoftware.com Phone: 9495776294 Message: I noticed you have 452 (1, 2 and 3 star) bad reviews for JD’s Restaurant & Lounge on Google. Want us to delete them and improve your average star rating? That’s what our software does without any work needed on your part – and that’s why some of the largest brands in the world trust us to automate their online reviews. Do you have 15 minutes to chat today to learn how I can help eliminate the bad reviews? Schedule a Call here: https://getdandy.com/schedule-call-4/ Otherwise if you want additional information visit our website: https://getdandy.com/custom I look forward to speaking with you. Sincerely, – Jenn Jennifer O’brien | Director of Reviews GetDandy Phone: (949) 577-6294 https://getdandy.com/custom Unsubscribe The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/",
      "text": "Inquiries Archive - Monstah Lobstah Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Contact Us Name: TOwicmkNrimLzAV Email: ohoyafuvo886@gmail.com Phone: 8274407194 Message: Contact Us Name: Jennifer Obrien Email: jenn@dandyreviewaitools.com Phone: (949)-755-7782 Message: JD’s Restaurant & Lounge, Leads for JD’s Restaurant & Lounge are being missed on (727) 595-1320 – especially after hours. Do you want us to answer those for you and automatically schedule them into your business? Our technology gives you a 24/7 ai employee that monitors every […] Contact Us Name: David Stitch Email: dave@webrandpromo.com Phone: 0924073003 Message: Contact Form Of Book Your Next Party With Us Name: * * * Free BTC drop – do not be the last to hear about it * * * hs=a264af0b558a5ab89363513ef359021c* ххх* 9onzls Phone: 912927667762 Email: paouqua@mailbox.in.ua Number of people: 912927667762 Date: 6pcxk9 Time: nmir44 Occasion: rvpixa Description: casauz Contact Form Of Book Your Next Party With Us Name: * * * Free BTC drop – do not be the last to hear about it: https://alphadogprinting.com/index.php?tqztb9 * * * hs=a264af0b558a5ab89363513ef359021c* ххх* 9onzls Phone: 912927667762 Email: paouqua@mailbox.in.ua Number of people: 912927667762 Date: 6pcxk9 Time: nmir44 Occasion: rvpixa Description: casauz Contact Us Name: David Stitch Email: dave@webrandpromo.com Phone: 0924073003 Message: Hi, With custom staff uniforms, branded cups, eco-friendly to-go bags, and table-top items like coasters or menus, [Monstahlobstahirb Com] can look more professional, keep guests returning, and carry your brand beyond the dining room. We’re offering 10% off your first order, and we’ve been helping restaurants and […] Contact Us Name: HPCgQvZHpzizU Email: elanatuclnnam@yahoo.com Phone: 8572924334 Message: Contact Us Name: Ronny Affleck Email: ronny.affleck@yahoo.com Phone: 20555584 Message: Hello I learned about a tested method that helps change simple clicks to real sales easily. This method improves your sales conversions by automating follow-ups and enhancing customer interaction, so you make more with less effort. Want to begin earning daily? Click here to unleash your sales […] Contact Us Name: Frank Geivelis Email: info@floridakitchenpros.com Phone: 3524373553 Message: Hi Monstahlobstahirb Com, Deep clean your kitchen with Florida Kitchen Pros — up to 90% brand new, anywhere in Florida. From fryers, exhaust Hood, and hoods to ovens, floors, and ceilings — we clean it all. Whether it’s one piece of equipment or a full kitchen deep […] Contact Us Name: gfdgdfg Email: ayojogab151@gmail.com Phone: 727-595-1320 Message: gdfgdfgdfg ← older The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/contact-us-9/",
      "text": "Contact Us - Monstah Lobstah Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Name: Jennifer Obrien Email: jenn@dandyreviewaitools.com Phone: (949) 577-6294 Message: Hi, Want us to help you delete unfair bad reviews from Google, OpenTable, TripAdvisor and other main review sites? We noticed JD’s Restaurant & Lounge has 464 unfair bad reviews on Google and we can help remove them. That’s what our AI powered software does without any work needed on your part – and that’s why some of the largest brands in the world like Wyndham trust us to consistently remove unfair bad reviews from the main review sites without any work needed on their end. Do you have 15 minutes for a call today? Schedule a Call Here: getdandy.com/schedule-call-3 or for more information please visit our website: getdandy.com/ai-removal-tool You can also call me directly at (949)-755-7782 We’ve removed over 40,000 bad reviews and want to help you too. Thank you, Jennifer O’brien | Director of Reviews Getdandy Phone: +1 949-755-7782 | Visit us Online 9891 Irvine Center Drive, Suite #200, Irvine, CA 92618 The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://neon.reviewjournal.com/dining-out/monstah-lobstah-offers-a-taste-of-new-england/",
      "text": "Monstah Lobstah offers a taste of New England | Dining Out goguide Kats! Dining Out top 100 restaurants Faves & Craves Outdoors Bars Nightlife Music Arts & Culture Free Family Friendly lvrj.com subscribe manage activate sign in sign out 5359822-0-4 Home >> Dining Out Dining Out Monstah Lobstah offers a taste of New England March 2, 2011 - 2:06 am That's right: It's called Monstah Lobstah, the name crafted to suggest both the speech and the quintessential entree of New England. Monstah Lobstah New England Seafood Restaurant comes to Southern Nevada by way of Tampa, Fla., and currently operates restaurants inside two Doc Holliday's Saloons here. The first, at 2551 Anthem Village Drive, Henderson, opened in mid-October. A month later, the second area Monstah Lobstah opened at 9310 S. Eastern Ave., Henderson. Carol Pritchard, restaurant manager for both locations, said Monstah Lobstah -- the chain is owned and operated by mixed martial arts fighter Allen Berube, whose occasional nickname is \"Monstah\" -- offers a figurative and literal taste of New England in family-friendly surroundings. Some dishes even are served in cups and paper boats of the sort you'd see back in New England, Pritchard said. \"People come in from New England and say, 'This reminds me of the restaurant I used to go to back home.' \" The menu includes such Maine classics as lobsters and New England-style belly clams (both market price) and \"Lobstah\" rolls ($7.99). Early risers can order a lobster omelet ($9.99) off the breakfast menu, while a selection of kids' meals ($3.99 each) are built around such favorites as mac and cheese, corn dogs and fish and chicken strips. For diners whose tastes don't lean toward seafood, Monstah Lobstah offers such land-bred entrees as a hand-cut 10-ounce New York strip steak ($15.99) The Anthem location seats about 80 and the South Eastern Avenue location about 120. Reservations are accepted for groups of six or more. Both locations are open from 8 a.m. to 9 p.m. Sundays through Thursdays and 8 a.m. to 10 p.m. Fridays and Saturdays. Starters: Crab cakes, $7.99; peel-and-eat shrimp, $7.99 for a half-pound; mussels simmered in the shell, $9.99 Soups and salads: New England-style seafood chowder, $4.99 a cup or $6.99 a bowl; Caesar salad, $5.99 (add chicken breast for $3 or lobster meat for $8); \"Lobstah salad,\" $11.99 Entrees: Haddock fish fry, $11.99; the \"Samplah\" (haddock, shrimp, scallops, hush puppies and fries), $18.99; crab ($13.99) or lobster ($16.99) macaroni and cheese Desserts: Chocolate or carrot cake ($5.99) Information: 399-1200 (South Eastern Avenue) or 671-4194 (Anthem Village Drive). -- By John Przybys most read Sponsored By One Nevada Credit Union LISTEN TO THE TOP FIVE HERE in case you missed it THE TOP 100 RESTAURANTS IN LAS VEGAS From Strip standouts to neighborhood hangouts, here’s our guide to the finest food and drink in Las Vegas READ MORE more Dining Out Portillo’s may not be coming to Las Vegas, after all Top 10 things to do in Las Vegas this week What’s new in food, drink this NFL season at Las Vegas’ Allegiant Stadium 5 tasty varieties of boba tea to try across Las Vegas Vegas food truck known for pasta cones opens 1st restaurant 3 new Hawaiian coffee, lunch spots open in the Las Vegas Valley Longtime Vegas cheesesteak spot closing for refresh A guide to Las Vegas’ full slate of fall festivals Downtown Vegas museum to debut open-air cocktail lounge, event space Top 10 things to do in Las Vegas this week A popular sushi bar closes in downtown Las Vegas. Or has it? Chef James Trees reveals what is replacing the original Esther’s Kitchen frequently asked questions POWERED BY THE PRESENTED BY say hello! neon@reviewjournal.com newsletter sign up advertise with us Affiliate Publications Las Vegas Review-Journal Best of Las Vegas Business Press Pahrump Valley Times Boulder City Review Vegas Nation rj magazine Lightning Digital Copyright © 2019 Las Vegas Review-Journal, Inc. | Privacy Policy | Terms of Service | Cookie Preferences | Your Privacy Choices Powered by WordPress.com VIP"
    },
    {
      "url": "https://monstahkookies.com/pages/contact-us",
      "text": "Contact Us\n    \n    \n    \n      – MONSTAH Kookies Skip to content SUPPORT MONSTAH AND FOLLOW OUR INSTAGRAM @MONSTAHKOOKIES FOR SPECIAL GAMES AND GIVEAWAYS Log in Create account Search Search Search our store Close search Search Search Search our store Close search 0 Search Search our store Home Kookies About Find Us Home Kookies About Find Us More links Search Search Search our store Close search 0 Home Contact Us Contact Us You can reach Monstah in many many ways! Monstah will respond within half an hour (usually much sooner!) during office hours (09:00am – 6:00pm) Monday to Friday but is still contaktable from early morning till midnight though it may take longer outside office hours… Monstah awso needs to sleep tho, so if you message after midnite, then Monstah will reply next mawning… DM on IG, Twitter Send a FB message Email Vilcie@monstahkookies.com Whatsapp: +65 9022 2034 Get updates Email address Sign up Search Payment Methods Contact Monstah Returns & Refunds Policy Shipping policy Terms of Service Refund policy Follow us Copyright © 2025 MONSTAH Kookies . Powered by Shopify"
    },
    {
      "url": "https://monstahlobstahirb.com/",
      "text": "Welcome Monstah Lobstahirb Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Welcome To Restaurant & Lounge B ook A T able *Powered By OpenTable 1 Person 2 Person 3 Person 4 Person 28.6.2023 29.6.2023 30.6.2023 01.7.2023 11:30am 12:00pm 02:45pm 05:30pm RESERVE TABLE About Us Monstah Lobstah Since 1985, Monstah Lobstah in Indian Rocks Beach has been a family-run business. We invite you to learn more about unique local spot that has been part of the community for almost 40 years. Read More J Hop Thursday, September 11 4:30 PM - 8:30 PM https://drive.google.com/file/d/1JTZwBoMXbMsMsmK7N8uoA5g4K47O49JS/view?usp=drive_link Red Hawk Friday, September 12 5:30 PM - 9:30 PM https://drive.google.com/file/d/1Je844TJqmjcITSEEepnpa910RdJ4z4qI/view?usp=drive_link Karaoke (Inside) Friday, September 12 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link Bryan Craft Saturday, September 13 12:30 PM - 4:30 PM https://drive.google.com/file/d/1_yYzkGUCsPt0FwHb0MRlMXmZEvNSQXFv/view?usp=drive_link Skid Rodeo Saturday, September 13 5:30 PM - 9:30 PM https://drive.google.com/file/d/1N72RbnQ84i22MSE6gBX1jyNIUKMoP2pl/view?usp=drive_link Karaoke (inside) Saturday, September 13 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link Red Sunday, September 14 11:30 AM - 3:30 PM https://drive.google.com/file/d/1qsYBr2yJ_c8cLTsuz-5G37oGRJplok8j/view?usp=drive_link Larry Mott Sunday, September 14 4:30 PM - 8:30 PM Larry Mott at Monstah Lobstah Larry Mott at Monstah Lobstah\nhttps://drive.google.com/file/d/1Q0ZZqQIa2o4IcK4iiSiuio9t5ejoekyT/view?usp=drive_link Jerry Northup Monday, September 15 4:30 PM - 8:30 PM https://drive.google.com/file/d/1IaOcrBios4DIe3wx-o7vOEVhOjNYBGBu/view?usp=drive_link Matt Knabe Tuesday, September 16 4:30 PM - 8:30 PM https://drive.google.com/file/d/16RvvbZEEEgQuUpFwaRrsNOFmNLsdD1Su/view?usp=drive_link Uptown Funk Wednesday, September 17 4:30 PM - 8:30 PM https://drive.google.com/file/d/1dL3-M1aF1qegAGt-gKfYRhdnT-FeDR0t/view?usp=drive_link J Hop Thursday, September 18 4:30 PM - 8:30 PM https://drive.google.com/file/d/1JTZwBoMXbMsMsmK7N8uoA5g4K47O49JS/view?usp=drive_link Skid Rodeo Friday, September 19 5:30 PM - 9:30 PM https://drive.google.com/file/d/1N72RbnQ84i22MSE6gBX1jyNIUKMoP2pl/view?usp=drive_link Karaoke (Inside) Friday, September 19 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link Lobstah Fest Saturday, September 20 All Day Event https://drive.google.com/file/d/1ctLVyCQ6KdZLyfEMRGmIPPwQLq-dCiDK/view?usp=drive_link Chello Hollyday Saturday, September 20 12:00 PM - 4:30 PM https://drive.google.com/file/d/1ksgEIJOALD3CWHbao4uSl0dfjLkDrEdB/view?usp=drive_link Red Hawk Saturday, September 20 3:00 PM - 6:00 PM https://drive.google.com/file/d/1Je844TJqmjcITSEEepnpa910RdJ4z4qI/view?usp=drive_link Kingpin Saturday, September 20 6:00 PM - 10:00 PM https://drive.google.com/file/d/1n-w0wpb_GMBRFyu6xVap0ecwbc3Bi2ve/view?usp=drive_link Red Sunday, September 21 11:30 AM - 3:30 PM https://drive.google.com/file/d/1qsYBr2yJ_c8cLTsuz-5G37oGRJplok8j/view?usp=drive_link Britney Mone Sunday, September 21 4:30 PM - 8:30 PM https://drive.google.com/file/d/1qs9TOJlNT9Z7FeatlKPcwd8xqNPpWhtY/view?usp=drive_link Jeremy James Monday, September 22 4:30 PM - 8:30 PM https://drive.google.com/file/d/1-zqothxuZxpHKAYwFQ7mpW63GmzgC6bj/view?usp=drive_link Jason Parker Tuesday, September 23 4:30 PM - 8:30 PM https://drive.google.com/file/d/1Qvo3jE7xswUDHwU3OPMRrCjyQaECIXfF/view?usp=drive_link Uptown Funk Wednesday, September 24 4:30 PM - 8:30 PM https://drive.google.com/file/d/1dL3-M1aF1qegAGt-gKfYRhdnT-FeDR0t/view?usp=drive_link Trivia in the Inside Lounge Wednesday, September 24 7:00 PM - 9:00 PM Weekly Trivia Now Rotating Locations Each Week Between Guilty Sea & Monstah Lobstah IRB https://drive.google.com/file/d/1Ug0EIM5h-PG5gBzd48LnOnwWXSXDn5BP/view?usp=drive_link\n\nWeekly Trivia Now Rotating Locations Each Week Between Guilty Sea & Monstah Lobstah IRB J Hop Thursday, September 25 4:30 PM - 8:30 PM https://drive.google.com/file/d/1JTZwBoMXbMsMsmK7N8uoA5g4K47O49JS/view?usp=drive_link North 2 South Friday, September 26 5:30 PM - 9:30 PM https://drive.google.com/file/d/1iS6VeESSSrNhMfAXnt6BtK4b8hg7a5vD/view?usp=drive_link Karaoke (Inside) Friday, September 26 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link Ricky Jackson Saturday, September 27 12:30 PM - 4:30 PM https://drive.google.com/file/d/1ORwi-UZmy3ik2cUapgdyeCTCkXOU3lmw/view?usp=drive_link Jay Brown Saturday, September 27 5:30 PM - 9:30 PM https://drive.google.com/file/d/1myv_J_SXsgiQjhmxd-No2Qqt4TCTM1JE/view?usp=drive_link Karaoke (inside) Saturday, September 27 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link Red Sunday, September 28 11:30 AM - 3:30 PM https://drive.google.com/file/d/1qsYBr2yJ_c8cLTsuz-5G37oGRJplok8j/view?usp=drive_link Erika Najibo Sunday, September 28 4:30 PM - 8:30 PM https://drive.google.com/file/d/1nGj-fse5RGJlc1hFNUwVXPC1wlUsFz0D/view?usp=drive_link Johnny B Monday, September 29 4:30 PM - 8:30 PM https://drive.google.com/file/d/1n-w0wpb_GMBRFyu6xVap0ecwbc3Bi2ve/view?usp=drive_link Matt Knabe Tuesday, September 30 4:30 PM - 8:30 PM https://drive.google.com/file/d/16RvvbZEEEgQuUpFwaRrsNOFmNLsdD1Su/view?usp=drive_link Uptown Funk Wednesday, October 01 4:30 PM - 8:30 PM https://drive.google.com/file/d/1dL3-M1aF1qegAGt-gKfYRhdnT-FeDR0t/view?usp=drive_link J Hop Thursday, October 02 4:30 PM - 8:30 PM https://drive.google.com/file/d/1JTZwBoMXbMsMsmK7N8uoA5g4K47O49JS/view?usp=drive_link Uptown Funk Friday, October 03 5:30 PM - 9:30 PM Uptown Funk at Monstah Lobstah Uptown Funk at Monstah Lobstah   https://drive.google.com/file/d/1dL3-M1aF1qegAGt-gKfYRhdnT-FeDR0t/view?usp=drive_link Karaoke (Inside) Friday, October 03 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link Donnie Oneal Saturday, October 04 12:30 PM - 4:30 PM https://drive.google.com/file/d/1_yYzkGUCsPt0FwHb0MRlMXmZEvNSQXFv/view?usp=drive_link North 2 South Saturday, October 04 5:30 PM - 9:30 PM https://drive.google.com/file/d/1iS6VeESSSrNhMfAXnt6BtK4b8hg7a5vD/view?usp=drive_link Karaoke (inside) Saturday, October 04 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link Red Sunday, October 05 11:30 AM - 3:00 PM Britney Mone Sunday, October 05 4:30 PM - 8:30 PM https://drive.google.com/file/d/1qs9TOJlNT9Z7FeatlKPcwd8xqNPpWhtY/view?usp=drive_link Jay Brown Monday, October 06 4:30 PM - 8:30 PM Jeremy James Tuesday, October 07 4:30 PM - 8:30 PM Uptown Funk Wednesday, October 08 4:30 PM - 8:30 PM https://drive.google.com/file/d/1dL3-M1aF1qegAGt-gKfYRhdnT-FeDR0t/view?usp=drive_link Trivia in the Inside Lounge Wednesday, October 08 7:00 PM - 9:00 PM Trivia Now Rotating Locations Each Week Between Guilty Sea & Monstah Lobstah IRB https://drive.google.com/file/d/1Ug0EIM5h-PG5gBzd48LnOnwWXSXDn5BP/view?usp=drive_link Weekly Trivia Now Rotating Locations Each Week Between Guilty Sea & Monstah Lobstah IRB J Hop Thursday, October 09 4:30 PM - 8:30 PM https://drive.google.com/file/d/1JTZwBoMXbMsMsmK7N8uoA5g4K47O49JS/view?usp=drive_link Red Hawk Friday, October 10 5:30 PM - 9:30 PM Karaoke (Inside) Friday, October 10 7:00 PM - 10:00 PM https://drive.google.com/file/d/1MHDiRbt3Ug1IvBuxbGNjVjzS0KPGJrav/view?usp=drive_link See all upcoming events Menu Highlights Delicious Dishes The Lobstah Menu Prix Fixe Menu View  The Lobstah Menu Biggest Maine Lobstah MKT Averages over 3lbs Bigger Maine Lobstah MKT Averages 2lbs Big Maine Lobstah MKT Averages 1lb Kicked Up Spicy Style $2.00 View  Prix Fixe Menu Linguini with Clams LINGUINI TOSSED WTH TENDER CLAMS IN A WHITE WINE SAUCE OR MARINARA SAUCE AND SERVED WITH GARLIC TOAST Fried Cod Platter FRIED COD WITH OLD BAY FRIES, SLAW, AND HUSPUPPIES Shrimp & Lobstah Pastah LINGUINI TOSSED WITH OUR GARLIC WHITE CREAM SAUCE AND SAUTEED WITH\r\nLOBSTER, SHRIMP, TOMATOES, AND ONIONS. SERVED WITH GARLIC TOAST Seafood Stuffed Half Maine Lobstah SERVED WITH LEMON BUTTER SAUCE AND SLAW View Linguini with Clams $24.00 Linguini tossed with tender clams in a white wine sauce or marinara sauce served with garlic toast Buffalo Chicken Wings Naked style, fried crispy tossed with buffalo or hot sauce and served with blue cheese and celery (10) $16 | (20) $30 Fried Pickle Chips $9.00 Handbreaded and served with ranch Mozzarella Sticks $12.00 Classic cheese sticks served with marinara sauce View Linguini with Clams $24.00 Linguini tossed with tender clams in a white wine sauce or marinara sauce served with garlic toast Buffalo Chicken Wings Naked style, fried crispy tossed with buffalo or hot sauce and served with blue cheese and celery (10) $16 | (20) $30 Fried Pickle Chips $9.00 Handbreaded and served with ranch Mozzarella Sticks $12.00 Classic cheese sticks served with marinara sauce FRESH INGREDIENTS Delicious Dishes YOUR PLACE OR OURS? leave the Catering to us YOUR PLACE OR OURS? leave the Catering to us Catering Perfect for any occasion Inquire today and let us help you celebrate your next event! Catering Book Your Next Party With us ! Make a reservation Come to celebrate your special event or – give us the opportunity to make your event memorable. We look forward to serving and seeing you soon! To book a party reservation give us a call at (727)-595-1320 Reviews What people say The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    },
    {
      "url": "https://monstahlobstahirb.com/inquiry/page/31/",
      "text": "Inquiries Archive - Page 31 of 139 - Monstah Lobstah Skip to content 727-595-1320 Family owned, friendly service and great food! Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Menu Home Menu Drinks Specials Catering About Us Events Jobs Rewards Contact Us Gift Cards Gift Cards Contact Us Name: GdcXsdwTybJRRDD Email: asofixosi67@gmail.com Phone: 7380731237 Message: Contact Us Name: lYstqIui Email: stranbp@gmail.com Phone: 8437484989 Message: Contact Us Name: kEaMpbvGD Email: yoltobroc@gmail.com Phone: 4815659132 Message: Contact Us Name: Margareta Villasenor Email: margareta.villasenor@googlemail.com Phone: 617137769 Message: Hey, I discovered a completely free short video that teaches how to use email marketing to generate leads on autopilot and increase conversions without running ads. It’s completely free and takes just a few minutes to watch. I think it could really help if you’re building an […] Contact Us Name: AmjdUkWwHY Email: reddyadam617913@yahoo.com Phone: 9001946842 Message: Contact Us Name: VfrZqqzeZg Email: yilfredgoodman1982@gmail.com Phone: 6493103298 Message: Contact Us Name: Suzanna Greville Email: greville.suzanna@yahoo.com Phone: 717481475 Message: Hey, I discovered a completely free workshop that explains how to use email marketing to get new clients automatically and increase conversions without running ads. It’s 100% free and takes just around 20 minutes to watch. I think it could make a difference if you’re selling online. […] Contact Us Name: dzVGdyEtExqe Email: ormehayde39@gmail.com Phone: 6820509995 Message: Contact Us Name: eMJAmkIOgVCiGn Email: bidocojiru86@gmail.com Phone: 5150084887 Message: Contact Us Name: FivkaDDtY Email: ogupavutapu58@gmail.com Phone: 2763685530 Message: ← older newer → The team that has contributed to over 3 decades, as well as the numerous guests over the years is a testament to the success of their hard work and spirit. Hours Monday-Thursday 11:00AM - 10:00PM Friday & Saturday 11:00AM - 11:00PM Sunday 11:00AM - 10:00PM Quick Links Menu Drinks Specials Catering About us Events Jobs Gift Cards Menu Menu Drinks Specials Catering About us Events Jobs Gift Cards Contact Us 727-595-1320 125 Gulf Boulevard Indian Rocks Beach, FL 33785 info@monstahlobstahirb.com Facebook-f Instagram Yelp Tripadvisor NEWSLETTER Sign Up With over 40 years of experience in the restaurant industry, the Loder family brings their passion for food and hospitality to The Crabby Bill’s Family Brands. We invite you to enjoy our 10 different dining experiences located along the Gulf of Mexico in the always sunny Florida state! © Monstah lobstah | All rights reserved. | Terms, Privacy, and ADA Compliance"
    }
  ]
}