{
  "fuentes": [
    {
      "url": "https://monsterminigolf.com/locations/us/fl/pembroke-pines/group-events/",
      "email": "miramar@monsterminigolf.com"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/promotions/",
      "email": "coralsprings@monsterminigolf.com"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/mini-golf/",
      "email": "coralsprings@monsterminigolf.com"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/birthday-parties/",
      "email": "coralsprings@monsterminigolf.com"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/pembroke-pines/fundraisers/",
      "email": "miramar@monsterminigolf.com"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/field-trips/",
      "email": "coralsprings@monsterminigolf.com"
    }
  ],
  "mails": [
    "coralsprings@monsterminigolf.com",
    "miramar@monsterminigolf.com"
  ],
  "nombre_sitio": "monsterminigolf.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://monsterminigolf.com/locations/us/fl/pembroke-pines/group-events/",
      "text": "Miramar Group Events | Monster Mini Golf Miramar Skip to content Our pizzeria – Boneyard Pizza Co. – is officially open and ready to feed the humans of Pembroke Pines. Come in today for the best pizza and wings in town! About Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Find A Location Toggle Menu Find A Location Pembroke Pines GROUP EVENTS Company Events That Rock (And Roll)! Tired of the same old boring Company or Group Event? Looking for something unique and fun to entertain and invigorate your friends, family or co-workers? If so, look no further than Monster Mini Golf! Group Events are great for both adults and young adults alike. Companies, youth groups, clubs, etc. can all enjoy unlimited entertainment and be able to relax in our private haunted mansion event rooms. We guarantee to get the laughs rolling and the competitive juices flowing as each event features: 18 Holes of Monster Mini Golf Arcade Game Play Prizes and Fun awards ADDITIONS INCLUDE: Additional Arcade Game Play Food and refreshments Group Event Package Options Fiend Fest Skeleton Soiree The Beast 18 Holes of Monster Mini Golf Arcade Game Play $15.00 per guest $15.00 per person $20.00 per person Bowling Attraction (1 Game per guest) Climbing Tree Attraction (1 per guest) Minimum Number of Participants 12 guests 12 guests 30 guests Package Price $25.00 per guest $31.00 per guest $38.00 per guest OPTIONAL ADDITIONS (ALL ATTRACTIONS) Bowling Attraction (Unlimited for 30 minutes) $50.00 per lane Action Climbing Tower Attraction (unlimited for 30 minutes) $95.00 Virtual Reality Attraction (per play) $8.00 Large Cheese Pizza $19.95 Large Pepperoni Pizza $21.95 Pitcher of Fountain Beverage $6.95 Group Event pricing starts for a group of 12 participants. Monster Mini Golf can accommodate groups of all shapes and sizes and even have private event and facility buyout options should you desire additional privacy and exclusivity. Booking a Group Event at Monster Mini Golf is easy, simply contact us to start the booking process. Contact Us Pembroke Pines, FL (954) 589-1878 Email Us 8358 Pines Blvd, Pembroke Pines, FL 3302 4 CURRENT PROMOTIONS Book a Birthday Party Online Birthday Parties and Events Toggle child menu Expand Birthday Parties Field Trips Group Events Fundraisers Promotions Attractions We Offer Toggle child menu Expand Indoor Mini Golf Arcade Duck Pin Bowling Virtual Reality Action Climbing Tower Facebook Instagram TikTok About Attractions Events Franchising Locations Contact © 2025 Monster Mini Golf Website Design & Development by Levy Online Privacy Policy About Toggle child menu Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Toggle child menu Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Toggle child menu Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Facebook Instagram Twitter"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/promotions/",
      "text": "Coral Springs Promotions | Monster Mini Golf Skip to content About Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Find A Location Toggle Menu Find A Location CORAL SPRINGS Promotions Pick Your Deal Today – Play, Laugh, and Live It Up Select your items of interest below and add to your cart. On Checkout page add the coupon code CORALSPRINGSPROMO25 . Once purchased, you will receive an email on how to redeem your purchase. MONSTROUS MIX – $20.00pp Includes 1 Game of Mini Golf and 1 $10 Arcade Game Card. Purchase online and receive $2.00 off. Normal Price – $22.00 THE FINE PRINT: Promotion expires Tuesday September 30, 2025. Once purchased, product does not expire – use anytime. Available for Online Purchase only , offer does not apply to in-store purchases. use the following Discount Code at checkout: CORALSPRINGSPROMO25 Offer cannot be combined with any other offers or promotions purchase now TERRIFIC TRIO – $25.00pp Includes 1 Game of Mini Golf, 3 Laser Maze Games, 2 King Kong Virtual Reality Games.  Purchase online and receive $3.00 off. Normal Price – $28.00 THE FINE PRINT: Promotion expires Tuesday September 30, 2025. Once purchased, product does not expire – use anytime. Available for Online Purchase only , offer does not apply to in-store purchases. use the following Discount Code at checkout: CORALSPRINGSPROMO25 Offer cannot be combined with any other offers or promotions purchase now ULTIMATE COMBO – $40.00pp Includes 1 Game of Mini Golf, $20 Arcade Game Card, 3 Laser Maze Games, 2 King Kong Virtual Reality Games. Purchase online and receive $5.00 off. Normal Price – $45.00 THE FINE PRINT: Promotion expires Tuesday September 30, 2025. Once purchased, product does not expire – use anytime. Available for Online Purchase only , offer does not apply to in-store purchases. use the following Discount Code at checkout: CORALSPRINGSPROMO25 Offer cannot be combined with any other offers or promotions purchase now Contact Us Coral Springs, FL (954) 526-5115 Email Us 9533 Westview Drive Coral Springs, Florida 33076 CURRENT PROMOTIONS Book A Birthday Party Online Purchase Attractions Online Birthday Parties & Events Toggle child menu Expand Birthday Parties Field Trips Group Events Fundraisers Promotions Attractions we offer Toggle child menu Expand Indoor Mini Golf Arcade Laser Maze Virtual Reality Facebook Instagram TikTok About Attractions Events Franchising Locations Contact © 2025 Monster Mini Golf Website Design & Development by Levy Online Privacy Policy About Toggle child menu Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Toggle child menu Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Toggle child menu Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Facebook Instagram Twitter"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/mini-golf/",
      "text": "Discover Coral Springs Ultimate Mini Golf Adventure Skip to content About Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Find A Location Toggle Menu Find A Location Discover the Magic of Mini Golf at Coral Springs Step into a world where the ordinary is delightfully transformed into the extraordinary, and the mundane becomes monstrous! With 18 holes of indoor, glow-in-the-dark mini golf, complete with custom-designed artwork and animated monsters at every twist and turn, this is a place where fun and excitement know no bounds. Monster Mini Golf provides an unforgettable adventure for all. Get ready to be immersed in a one-of-a-kind entertainment experience right in the heart of Coral Springs. The Monster Mini Golf Experience The fun at Monster Mini Golf doesn’t stop at indoor mini golf in Coral Springs. Not just fun for all ages but fun for all events as well. We’re one of the best birthday party places , perfect for Coral Springs field trips , and the most spooktacular corporate event venue . Guests can enjoy an array of activities, including an arcade, laser maze, and virtual reality, making Monster Mini Golf your one-stop destination for all things fun, spooky, and out of this world. On Course Entertainment Not only will you interact with staff and other players, but you will also have the chance to participate in contests, try skill shots, answer trivia, and more with our Masters of Entertainment via our internal radio station. In addition, our skilled staff will give you the opportunity to compete in mini golf challenges for prizes and rewards throughout your 18 hole extravaganza. Experience Local Culture With a Creative Twist Monster Mini Golf isn’t one of those facilities that embody the phrase, “If you’ve been to one, you’ve been to them all.” Our team of artists works diligently to make each location a unique monument to its location. As you play your round of mini golf, you’ll notice witty, comical, and relatable pop culture artwork unique to the actual location. Created with vibrant neon colors, the history and culture of the area come to life in vivid contrast under black light. Get Directions Locally Inspired Mini Golf Course Our Coral Springs Monster Mini Golf location was locally inspired and created specifically for Coral Springs residents. This is evident in our mini golf course, surrounded by a virtual canvas that comes to life with comical, witty, and relatable pop-culture artwork belonging to Coral Springs and Florida. Our monster development team worked hard to ensure our city and state were brought to life and enlisted the help of local artists who helped hand-paint each detail to perfection for a monster-theme history lesson under our black lights. Order Online Attractions Mini Golf 18 holes of spooky fun await at Monster Mini Golf. Test your putting skills and challenge friends and family to a friendly competition to discover who will be the victor and earn the right to be called champion! You’ll have to hone your skills to overcome lively obstacles; a simple aim won’t get you to the winner’s circle with our course. You’ll have to tap into your skills in strategy and focus to win at Monster Mini Golf. Arcade After your round of mini golf, head over and test your gaming skills in our state-of-the-art, fully-stocked arcade. From the newest in gaming technology to timeless classics, our arcade features it all. Play some of our big ticket givers to collect tickets to redeem at our prize center. Laser Maze Channel your inner Bond, James Bond, that is. Our laser maze is straight out of your favorite spy movie. It’ll take agility, focus, and expert strategy to navigate through it. One wrong move could break a beam, and it’s over. The faster you move without disrupting the laser beams, the better your score. Virtual Reality Virtual reality has taken the world by storm by plunging players into the game themselves. Experience new worlds firsthand with Monster Mini Golf. From Rabbids to King Kong, we have an entertainment option for everyone in the realm of VR. Contact us today! Events Coral Springs Fundraisers Book Now Coral Springs Fundraisers Coral Springs Group Events Book Now Coral Springs Group Events Coral Springs Field Trips Book Now Coral Springs Field Trips Coral Springs Birthday Parties Book Now Coral Springs Birthday Parties Mini Golf FAQs How Many Times Can You Hit the Ball in Mini Golf? Mini golf league rules state that golfers get a maximum of 6 strokes per hole. How Do You Count Points in Mini Golf? In mini golf, the lower the score , the better. Each hole typically has a par; this represents the number of strokes a skilled player is expected to take to complete it. The scorekeeper should mark down the number of strokes it took for each player to complete. If the number exceeds the par, it should be marked as +, then the number of extra strokes. If the player completes the hole in fewer strokes than par, it should be marked as – then the difference between the number of strokes and the par. What’s the Difference Between Mini Putt and Mini Golf? Both mini putt and mini golf share a number of similarities ; however, mini putt typically has a much simpler and easier layout than mini golf. In contrast, mini golf tends to be more difficult, advanced, and complex. Mini putt is usually composed of more even and flat surfaces, while you can expect more hazards, twists, turns, and obstacles in mini golf. They also have different scoring methods. Sources: How to Keep Score in Mini Golf . Mini golf League Rules. Mini-Golf Vs Putt-Putt (What Are The Main Differences?). Contact Us Coral Springs, FL (954) 526-5115 Email Us 9533 Westview Drive Coral Springs, Florida 33076 CURRENT PROMOTIONS Book A Birthday Party Online Purchase Attractions Online Birthday Parties & Events Toggle child menu Expand Birthday Parties Field Trips Group Events Fundraisers Promotions Attractions we offer Toggle child menu Expand Indoor Mini Golf Arcade Laser Maze Virtual Reality Facebook Instagram TikTok About Attractions Events Franchising Locations Contact © 2025 Monster Mini Golf Website Design & Development by Levy Online Privacy Policy About Toggle child menu Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Toggle child menu Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Toggle child menu Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Facebook Instagram Twitter"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/birthday-parties/",
      "text": "Mini Golf Birthday Party Places | Monster Mini Golf Coral Springs Skip to content About Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Find A Location Toggle Menu Find A Location Coral Springs Birthday Party Venue Indoor Mini Golf Birthday Parties in Coral Springs Immerse yourself in the spooky fun with Monster Mini Golf’s diverse birthday party packages, each tailored to deliver a unique and thrilling experience for all. Check out the details: Our experience includes: 90-minute reservation of one of our Private Haunted Mansion rooms 18 Holes of Monster Mini Golf Arcade play and prize center FUN Pizza and Soft Drinks We set up the room, handle all service needs, entertain and engage the child and clean up! *See additional featured elements and add-ons below. Click here to book a party now Birthday Party Package Options ACTIVITY AND/OR FEATURE Ghostly Gala Bones Bash Monster Mania V.I.M. (Very Important Monster) GraveYard Hop Guest of Honor is free Number of children included Up to 10 Children Up to 12 Children Up to 15 Children Up to 25 Children Includes 50 Guests Dedicated Memory Maker Private Haunted Mansion Event Room 1 Room 1 Room 1 Room 2 Rooms 2 Rooms Duration in Private Haunted Mansion Event Room 90 Minutes 90 Minutes 90 Minutes 2 Hours 3 Hours 18 Holes of Mini Golf for each guest Unlimited Unlimited Arcade Value for the Guest of Honor $10.00 $15.00 $20.00 $20.00 $20.00 Arcade Value for each child $5.00 $7.50 $10.00 $10.00 $10.00 Surprise Toy for each child 1 2 2 Return Mini Golf Pass for each child Monster Mini Golf T Shirt for the Guest of Honor Monster Glow Hand Print Experience Monster Challenge Experience Cheese Pizza 2 2 3 4 10 Pitcher of a Soft Drink 2 2 3 4 5 Rule The W.I.R.D Radio Airwaves DJ Bootcamp Mini Golf Tournament with prizes for winning team We Set Up and Clean Up! Available as private event before open to public! Available as Private Event, After hours! Package Price $325.00 $395.00 $495.00 $750.00 $1395.00 OPTIONAL NON- FOOD ADDITIONS Additional Guests $12.50 per guest $13.50 per guest $15.00 per guest $15.00 per guest $15.00 per guest Monster Mini Golf Goodie Bags $4.00 per guest $4.00 per guest $4.00 per guest $4.00 per guest $4.00 per guest Color My T Shirt Experience (1 for each child) $5.00 per guest $5.00 per guest $5.00 per guest $5.00 per guest $5.00 per guest Arcade Game Value Any Value Any Value Any Value Any Value Any Value Monster Mini Golf T Shirt $14.99 (10 or more, $10 each) $14.99 (10 or more, $10 each $14.99 (10 or more, $10 each $14.99 (10 or more, $10 each $14.99 (10 or more, $10 each Popcorn $5.95 per bowl $5.95 per bowl $5.95 per bowl $5.95 per bowl $5.95 per bowl Pitcher of a Soft Drink $5.95 each (Free Refills) $5.95 each (Free Refills) $5.95 each (Free Refills) $5.95 each (Free Refills) $5.95 each (Free Refills) Go-To Spot for Exciting Children’s Birthday Parties Here at Monster Mini Golf, we offer more than a party. We deliver an exceptional and delightful experience for all ages, from the young to the young at heart. That means no matter your age, you get to join in for a monstrously good time. With a Monster Mini Golf birthday party, you’ll get a reservation for one of our Private Haunted Mansion rooms, play mini golf underneath the black lights, and play in the arcade that has a spectacular prize center. Celebrating with us means the guest of honor can make cherished memories that will last a lifetime. We’re excited to offer a unique monster-inspired 18-hole course. Our vibrant, 3D atmosphere is full of life and color that can’t be found anywhere else. Plus, you won’t have to do a thing. We’ll set up the party room, handle all service needs, entertain and engage the children, and clean up! Our unique experience is the perfect choice for a birthday backdrop. With interactive characters, special features, and thrilling surprises around every corner, our exciting mini golf course will make your event an unforgettable experience. Monster Mini Golf is your answer if you’re looking for Coral Springs birthday party venues or trying to figure out Coral Springs birthday party ideas! Celebrate your special day with us and create a memory that will last forever. Our birthday parties have impressive decorations, a private room that will accommodate any of your guests, with ample and comfortable seating, and different package options to ensure everyone knows it’s the honoree’s special day. At Monster Mini Golf in Coral Springs, we’re committed to providing unforgettable entertainment for your birthday party. So what are you waiting for? Let the monstrous fun begin. Click here to book a party now Birthday Party FAQs Are food and beverages provided? We offer a variety of food and beverage add-ons to your party package, including pizza, chicken wings, boneless chicken wings, salads, and more. What is the cancellation or rescheduling policy? We invite you to call our Coral Springs Monster Mini Golf location to learn more about our specific cancellation and rescheduling policy for birthday parties. How many children can be accommodated at a Monster Mini Golf birthday party? We can accommodate groups of 10 children up to approximately 50 children. It is recommended you call to confirm space and availability for groups of children larger than 25 or more. How long are birthday parties at Monster Mini Golf? Birthday party reservations at Monster Mini Golf normally last 90 minutes. Within that duration, you can book various activities and games and add to your birthday party experience with us. One of a kind Mini Golf experience Memories that last a lifetime Memorable Interactive Moments Guest of Honor is celebrated Select the image below to take advantage of our custom Electronic Invitations Click Here to Book a Party Now Contact Us Coral Springs, FL (954) 526-5115 Email Us 9533 Westview Drive Coral Springs, Florida 33076 CURRENT PROMOTIONS Book A Birthday Party Online Purchase Attractions Online Birthday Parties & Events Toggle child menu Expand Birthday Parties Field Trips Group Events Fundraisers Promotions Attractions we offer Toggle child menu Expand Indoor Mini Golf Arcade Laser Maze Virtual Reality Facebook Instagram TikTok About Attractions Events Franchising Locations Contact © 2025 Monster Mini Golf Website Design & Development by Levy Online Privacy Policy About Toggle child menu Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Toggle child menu Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Toggle child menu Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Facebook Instagram Twitter"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/pembroke-pines/fundraisers/",
      "text": "Pembroke Pines Fundraiser Opportunities At Monster Mini Golf Skip to content Our pizzeria – Boneyard Pizza Co. – is officially open and ready to feed the humans of Pembroke Pines. Come in today for the best pizza and wings in town! About Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Find A Location Toggle Menu Find A Location Pembroke Pines FUNDRAISERS COMING SOON! Pembroke Pines Fundraiser Venues at Monster Mini Golf Monster Mini Golf at Pembroke Pines provides a range of fundraising options that can be tailored to suit the needs of any organization and the budgets of its members. Our options are priced per person and come with attractive discounts from our regular retail price, ensuring your organization’s members can enjoy savings while helping you achieve your revenue generation goals. Planning and executing fundraisers can be a headache; let us help you ditch your boring list of fundraiser ideas and choose Monster Mini Golf as your next unique fundraiser venue. We offer the fun and excitement you need without any of the stress or mess. We take care of the finer details, leaving you to enjoy the event with your guests. Fundraising Options Mini Golf Only Fundraiser Attractions Bundle Fundraiser 1 Round of Monster Mini Golf Arcade Game Play TBD Package Price TBD TBD OPTIONAL FUNDRAISING ELEMENTS Promotional Materials Electronic Sales Page Dedicated Event Steps To Starting And Executing Your Monster Mini Golf Fundraiser: Contact Monster Mini Golf Discuss and choose your desired Fundraising option Purchase your desired quantity of Fundraising cards Select optional Fundraising elements OPTIONAL ELEMENT – Promotional Materials – to be distributed throughout your organization OPTIONAL ELEMENT – Electronic Sales Page – to be shared electronically throughout your organization OPTIONAL ELEMENT – Host an actual event at Monster Mini Golf Receive your revenue!!! It’s that simple! Contact us today to get started! Discover Excitement and Adventure With Our Attractions Experience the thrill of a lifetime at Monster Mini Golf! Get ready to be captivated by our incredible attractions that will leave you spellbound. Challenge your friends and colleagues on our spine-tingling mini golf course, where you’ll navigate through our spooky arena, encounter ghoulish obstacles, and come face-to-face with our life-sized interactive monsters. But that’s not all! Immerse yourself in the glow-in-the-dark wonderland as you explore our fully stocked arcade. Whether you and your guests are seasoned golfers or first-timers, we guarantee a monstrously good time for all. Gather your guests and prepare for an unforgettable adventure at our one-of-a-kind facility. Out-of-This-World Events Monster Mini Golf isn’t just for hosting fundraisers; we are a one-stop shop for all events and occasions! Our facility is the perfect destination to host field trips , group events, and fundraisers. Our staff is experienced in ensuring guests have a frighteningly good time with age-appropriate activities for all. From the moment you walk through our doors till the moment you leave, the fun doesn’t stop, and there will be no short supply of smiles and laughter. With excitement and ghoulish creatures at every corner, Monster Mini Golf is sure to captivate and enthrall all who attend. We’re also the perfect Pembroke Pines birthday party venue ! FUNDRAISING FAQ How Do Fundraisers Work? Fundraisers work by mobilizing individuals and communities to support a specific cause or organization by collecting funds and often involving various activities to raise money for a particular purpose. With Monster Mini Golf as your venue, your activities are already organized, allowing you the time and freedom to get in on the fun. Monster Mini Golf is committed to supporting your organization by donating a predetermined percentage of all fundraising revenue. We understand the importance of your event details and will ensure your organization receives the support it deserves. Contact our staff today to discuss how you will acquire revenue at fundraisers hosted at Monster Mini Golf. How Do I Start a Fundraiser for a Cause? Get started on planning your fundraiser for a cause by contacting Monster Mini Golf today! A staff member will discuss and help you choose a fundraising option that works for you and your organization that meets your unique needs. Our staff will review optional fundraising elements and any unique details you want to address. Is Monster Mini Golf a Good Location for Fundraisers? Monster Mini Golf is not only a hub of innovative entertainment but also a champion of charitable causes. Our history of organizing and participating in charity and fundraising events demonstrates our commitment to our community. We are dedicated to making a positive impact that goes beyond our entertainment attractions. Our locations, filled with pop culture artwork, interactive animated monsters, and glow-in-the-dark features, create an engaging and fun atmosphere for all our guests. Our facilities are not only a good location for fundraisers but also a trusted and affordable place to create memories while supporting causes dear to the heart of our community. Pembroke Pines, FL (954) 589-1878 Email Us 8358 Pines Blvd, Pembroke Pines, FL 3302 4 CURRENT PROMOTIONS Book a Birthday Party Online Birthday Parties and Events Toggle child menu Expand Birthday Parties Field Trips Group Events Fundraisers Promotions Attractions We Offer Toggle child menu Expand Indoor Mini Golf Arcade Duck Pin Bowling Virtual Reality Action Climbing Tower Facebook Instagram TikTok About Attractions Events Franchising Locations Contact © 2025 Monster Mini Golf Website Design & Development by Levy Online Privacy Policy About Toggle child menu Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Toggle child menu Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Toggle child menu Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Facebook Instagram Twitter"
    },
    {
      "url": "https://monsterminigolf.com/locations/us/fl/coral-springs/field-trips/",
      "text": "Plan A Fun Field Trip At Monster Mini Golf Coral Springs Skip to content About Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Find A Location Toggle Menu Find A Location coral springs FIELD TRIPS ONE OF A KIND MINI GOLF EXPERIENCE STRUCTURED GROUP ACTIVITIES MEMORABLE INTERACTIVE MOMENTS Monster Mini Golf Field Trips Rock! Are you on the hunt for “field trip ideas near me?” You’re in luck! Whether it be a rainy-day activity or looking to pre-plan all your summer activities for your daycare, school, or camp program, Monster Mini Golf is the perfect venue for your next action-packed field trip! Monster Mini Golf provides a physically and mentally stimulating experience for children filled with adventure, games, prizes, smiles, and loads of laughs! Get directions Field Trip Package Options EVE L. JAWBONE STELLA 1 Round of Monster Mini Golf 45 Minutes of Arcade Game Play Value (redemption tickets not awarded) 2 Laser Maze Games Package Price $10.00 per child $15.00 per child $18.00 per child Children will leave begging to come back as they participate in our non-stop fun and entertainment featuring: ALL PACKAGES INCLUDE: 18 Holes of Monster Mini Golf Age-appropriate Monster Themed games Prize giveaways ADDITIONS INCLUDE: Private Haunted Mansion Event Rooms Pizza, popcorn and fountain drinks Laser Maze Attraction Additional Arcade play Field Trip pricing is discounted from normal admission fees and is applicable for groups of 15 children and above. Booking a Field Trip at Monster Mini Golf is easy! Give us a call today to reserve your upcoming event. IMPORTANT NOTE: Spaces fill up quickly for periods of the year when school is not in session. Click here to give us call Field Trips and Other Events You Can Host at Monster Mini Golf School Field Trips School field trips allow you to change your class dynamics for the day and immerse your students in hands-on learning experiences! Some people might be surprised just how much your class can learn from playing mini golf! Anatomy: You use more muscles than you might realize when playing mini golf, exploring a virtual reality world, or winding through laser beams in a laser maze! A Monster Mini Golf field trip is an immersive way to get students to identify which muscles they use during different activities! Art inspiration: A round of Monster Mini Golf is the perfect way to introduce students to a glow-in-the-dark art unit! Send your class in with their sketchbooks and have them draw their favorite monster art from our course. You can encourage them to find a source of inspiration to design their glow-in-the-dark monster! Language arts: Introduce your class to journalism with your Monster Mini Golf field trip! Assign students the task of writing an article about their field trip. This is a great way to teach students the difference between hard news and feature stories while promoting interpersonal skills. You can encourage students to interview each other and include some quotes in their articles! Mathematics: Students can reinforce their math skills by adding scores. You can also have a volunteer wait at the 15th hole and get students to project who they think will win the game. This is a great way to teach students about probabilities and encourage them to use reasoning skills! Physical fitness: Mini golf and the laser maze are perfect low-impact activities that help people burn extra calories while having fun. Group Field Trips Check out Monster Mini Golf when you’re looking for group field trip ideas nearby. Field trips aren’t just for students! Maybe you’re looking for a fun activity for a group of seniors from a retirement home in Broward County, Florida, or you want to plan a special outing for adults with disabilities. We’ve got you covered! You don’t have to be a pro golfer to have a great time playing mini golf, and posing for pictures with our marvelous monsters is an excellent way for guests of all ages to have fun! Monster Mini Golf is also perfect for an outing for board members, support groups, and volunteer groups. Corporate Team Building Are you looking for a Coral Springs corporate team-building session? Look no further! Monster Mini Golf offers the perfect venue for team building. Teams can strategize while playing mini golf and work together to beat our laser maze. Our attractions offer practical ways to promote communication and cooperation, and our memorable activities will stay with your staff when they head back to the office to strategize on corporate matters. Call us today! Group Events Anniversary parties: Enjoy a round of mini golf, head to our arcade to test your luck, and win a prize for the happy couple Bachelor/bachelorette parties: Looking for a fun way to celebrate your upcoming wedding? Plan a Monster Mini Golf bachelor or bachelorette party where you and your closest friends can have a blast making memories! Birthday parties: Our Coral Springs birthday venue delivers all the essentials, including cheese pizza, use of a private Haunted Mansion room, and more Fundraisers: Make money for your favorite cause with a Monster Mini Golf fundraiser Graduation parties: Celebrate graduation with a Monster Mini Golf party for the graduate and their closest friends! Every graduation is a significant milestone, and when you celebrate with us, you’ll create special memories that last a lifetime! Retirement parties: Monster Mini Golf is fun for kids of all ages, so it’s a great way to celebrate your upcoming retirement Field Trips faq Why Choose Monster Mini Golf in Coral Springs for Field Trips? Monster Mini Golf is a fun field trip activity, and there are many reasons to choose Monster Mini Golf in Coral Springs for your next outing! We’re just ten minutes from Coral Springs Elementary School. Follow NW 110th Avenue to Wiles Road. Turn right, then turn left on Coral Springs Drive. After a right on Westview Ave and a left on NW 98th Lane, you’ll see us on the right. We’re just seven minutes from Coral Springs Middle School via Wiles Road Monster Mini Golf is affordable. We offer discount package rates for customized field trips. Monster Mini Golf is an indoor activity, so you won’t have to worry about rescheduling if it rains How Do Students Benefit From Fun Field Trips? Field trips give students community-based experiences that promote learning. Field trips are memorable because they allow students to get out of the classroom and spend time in a different environment. Fun outings become memorable experiences that have a long-lasting impact on your class! Plus, a Monster Mini Golf field trip is a great way to show your students they can have fun while learning! A mini golf field trip is a fantastic opportunity to promote social interaction and teamwork. Students play golf together; you can have them play as individuals, partners, or teams. With all these options, you can customize your mini golf field trip to emphasize the skills you want your students to develop. How Should Students Dress for a Monster Mini Golf Field Trip? Monster Mini Golf is the perfect indoor place for field trips in Coral Springs, FL, so you don’t have to worry too much about the weather! Your class will enjoy a climate-controlled environment out of the heat and sunshine. Students should wear comfortable clothes and sneakers or footwear with good treads. For fun, you might encourage your class to wear white or fluorescent green, yellow, pink, or orange! These colors pop in our glow-in-the-dark Monster Mini Golf course! Contact Us Coral Springs, FL (954) 526-5115 Email Us 9533 Westview Drive Coral Springs, Florida 33076 CURRENT PROMOTIONS Book A Birthday Party Online Purchase Attractions Online Birthday Parties & Events Toggle child menu Expand Birthday Parties Field Trips Group Events Fundraisers Promotions Attractions we offer Toggle child menu Expand Indoor Mini Golf Arcade Laser Maze Virtual Reality Facebook Instagram TikTok About Attractions Events Franchising Locations Contact © 2025 Monster Mini Golf Website Design & Development by Levy Online Privacy Policy About Toggle child menu Expand About Monster Mini Golf Our Facilities Gift Cards Blog In The News Attractions Toggle child menu Expand Monster Mini Golf Arcade Laser Tag Bowling Laser Maze Virtual Reality View All Attractions Events Toggle child menu Expand Birthday Parties Spring Break Group Events Field Trips Fundraisers Date Night View All Events Franchising Locations Contact Facebook Instagram Twitter"
    }
  ]
}