{
  "fuentes": [
    {
      "url": "https://www.phillymag.com/news/2023/02/03/morning-glory-diner-website-hacked/",
      "email": "vfiorillo@phillymag.com"
    },
    {
      "url": "https://www.morninggloryventures.com/contact-us",
      "email": "info@morninggloryventures.com"
    },
    {
      "url": "https://www.morninggloryventures.com/contact-us",
      "email": "info@morninggloryventures.com"
    }
  ],
  "mails": [
    "info@morninggloryventures.com",
    "vfiorillo@phillymag.com"
  ],
  "nombre_sitio": "morninggloryeatery.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.phillymag.com/news/2023/02/03/morning-glory-diner-website-hacked/",
      "text": "Morning Glory Diner Website Hacked In Donald Trump's Favor Find It/Philly Doctors Dentists Home Design Experts Senior Living Wedding Experts Real Estate Agents Private Schools City Life The Latest Restaurants Foobooz 50 Best Restaurants Jobs Health Be Well Philly Find a Dentist Find a Doctor Senior Living Be Well Philly Fest Life & Style Life & Style Travel Real Estate & Home Properties & News Find a Home & Design Pro Find a Real Estate Agent Things To Do Events in Philly Philly Mag Events Wedding Guides & Advice Find a Wedding Expert Bubbly Ball Best of Philly Winners Buy Tickets Now! Subscribe Magazine Newsletters My Account Follow Facebook Instagram Twitter Search for: Search Follow Facebook Instagram Twitter Philadelphia Magazine Subscribe Magazine Newsletters My Account Find It/Philly Doctors Dentists Home Design Experts Senior Living Wedding Experts Real Estate Agents Private Schools City Life The Latest Restaurants Foobooz 50 Best Restaurants Jobs Health Be Well Philly Find a Dentist Find a Doctor Senior Living Be Well Philly Fest Life & Style Life & Style Travel Real Estate & Home Properties & News Find a Home & Design Pro Find a Real Estate Agent Things To Do Events in Philly Philly Mag Events Wedding Guides & Advice Find a Wedding Expert Bubbly Ball Best of Philly Winners Buy Tickets Now! I'm a scraper This search result is here to prevent scraping If you're a human and see this, please ignore it. If you're a scraper, please click the link below :-)\n  Note that clicking the link below will block access to this site for 24 hours. By I'm a scraper News Prankster Hijacks Website of Anti-Trump South Philly Diner Plus: Wind chills below zero. And Jason Kelce's very pregnant wife is bringing her OB/GYN to the Super Bowl. By Victor Fiorillo · 2/3/2023, 9:53 a.m. Get a compelling long read and must-have lifestyle tips in your inbox every Sunday morning — great with coffee! South Philadelphia’s politically outspoken Morning Glory Diner, whose website has been hacked to go to Donald Trump’s website (Photo by Samantha Chapnick via Flickr/Creative Commons) Check phillymag.com each morning for the latest edition of Philly Today. And if you have a news tip for our hardworking Philly Mag reporters, please send it here . The Website for South Philly’s Morning Glory Diner Now Goes to Donald Trump’s Website Sam’s Morning Glory Diner in the Bella Vista section of South Philadelphia is not your typical eatery. Whereas most businesses tend to stay out of politics, the walls and facade of Morning Glory Diner have, for years, proudly displayed anti-gun and anti-Donald Trump messaging. “If we were in Arkansas, we’d probably have no windows by now,” Morning Glory Diner owner Carol Mickey once told us. Well, the windows may have stayed intact, but some MAGA prankster has sought revenge in a much more 21st-century way. If you try to go to the website for Morning Glory Diner that’s listed in many news articles and on Morning Glory’s Facebook page, you won’t get lovely photos of the restaurant’s delicious frittatas, bananas foster French toast, or fluffy pancakes, known here as glory cakes. Instead, this is what you get: A screenshot of what you’ll see if you go to the website of South Philadelphia’s Morning Glory Diner Yes, the Morning Glory website now redirects to the online headquarters of Donald J. Trump, the latter website proclaiming “Official 2024 Presidential Founder,” whatever that means. “They hacked into my website and changed all the login information and contact information,” explains Mickey, who says she’s not exactly sure when it happened. “And I have no idea how to get it back. I guess I will just have to start all over.” I asked Mickey if the website hijacking bothers her, beyond just the way it might affect her business. “It’s just nice to know they are out there thinking about me,” she jests. Any hacker types out there who can help her out? South Philly Letter-Writer Gets Overwhelming Response On Thursday, I told you about Jean Merritt , the South Philly woman who will send a handwritten letter to anybody who asks for one. All you have to do is email her your mailing address and a bit about yourself. Well, since our story came out late Thursday afternoon, Merritt has been flooded with requests, and they keep coming in. So be patient. She will get to you. And this is not on some first-come, first-served basis. “I’m answering the most compelling requests first,” she tells me. Want to Talk to Gritty? Thanks to AI, now you can . Sort of. Talk About an Exciting Super Bowl Jason Kelce’s very pregnant wife isn’t watching the Super Bowl at home. She’ll be at the game, and she’s bringing her OB/GYN just in case . She’s at 38 weeks. Anything could happen. So if the baby is born at the Super Bowl, what’s the name? Speaking of the Kelces Travis Kelce, who will be playing in the Super Bowl against his brother, seems to be well aware of the Curse of the Rocky Statue: Travis Kelce addresses the Rocky statue curse ahead of #SuperBowlLVII on New Heights: “Chiefs fans… do not touch the f****g Rocky statue. And definitely don’t put a #87 on there.” pic.twitter.com/peQGSye3eq — Eagles Nation (NFC Champs) (@PHLEaglesNation) February 1, 2023 Forget About that Silly Groundhog Named Phil Let’s go with the much closer Harleysville Hank: Harleysville Hank contradicts Punxsutawney Phil and forecasts an early spring https://t.co/tUb0IidPOR — dan sokil (@dansokil) February 2, 2023 After all, Punxsutawney is basically Steelers country. And Because We Can’t Let Go of This Stupid Groundhog Thing Bob Casey in an attempt to be funny, I guess: Me showing @JohnFetterman around the Capitol pic.twitter.com/zueYhpc4GT — Bob Casey Jr. (@Bob_Casey) February 2, 2023 Brrrrr Wind chills below zero. So Much for Haddonfield Being Quaint A Haddonfield man allegedly paid $20,000 in Bitcoin to have a 14-year-old killed. And from the Counting-Down-the-Days Sports Desk … Next weekend is the BIG weekend, but there’s lots going on this weekend, too. Tonight, the Sixers take a trip to Texas to play the Spurs at 8 p.m.; on Sunday, they’ll host the Knicks at six. Guess who’s NBA Eastern Conference Coach of the Month: NBA Coaches of the Month for January. West: Michael Malone ( @nuggets ) East: Doc Rivers ( @sixers ) pic.twitter.com/AXpUQlYQEa — NBA (@NBA) February 2, 2023 And Player of the Month! The Kia NBA Players of the Month for January! #KiaPOTM West: Nikola Jokic ( @nuggets ) East: Joel Embiid ( @sixers ) pic.twitter.com/MZ3VJvibcm — NBA (@NBA) February 2, 2023 Joel also came to the defense of James Harden, who wasn’t named to the All-Star Game despite some league-leading stats: https://twitter.com/BleacherReport/status/1621312426821001216 In college hoops, it was a thrilla in the Daskalakis Center last night as the Drexel Dragons came from behind to within one point of the College of Charleston Cougars in the closing minute, went ahead by one on a LONG two with three seconds left, then held on for the 70-69 win! MOORE MANIA!! Dragons up 1 with 3.5 seconds left!! #FearTheDragon pic.twitter.com/gtgF6B03jw — Drexel Men's Basketball (@DrexelMBB) February 3, 2023 Tonight Columbia plays at Penn at 7 p.m. Tomorrow, we’ve got Drexel at Monmouth at two, Cornell at Penn at six, and Villanova vs. Creighton at 7:30. And on Sunday, La Salle and St. Joe’s face off at noon, and Temple is at home for a rematch against currently third-ranked Houston at 6 p.m. Can they pull off a second giant-slayer upset? We believe, Owls! We believe! All Philly Today Sports Desk coverage is provided by Sandy Hingston. Read More About: Digital Age Diners Donald Trump South Philadelphia Victor Fiorillo Senior Reporter at Philadelphia Magazine @phillyvictor vfiorillo@phillymag.com You Might Also Like Philly’s Great and Not-So-Great Fourth of July Concerts The Grammy Awards: A Philadelphia Timeline of Winners and Memorable Moments A Year of Sales (and More Deals) in Philly Trending Mare of Easttown Creator Brad Ingelsby Talks His New Show, Task Mike Jerrick Lands Late-Night Talk Show of His Own 50 Years of Fresh Air: An Oral History Feds Charge Philly Chef With Voting Twice During Last Election Are Philly Police Hiding Hundreds of Murdered Bodies? IN THIS SECTION About Contact Magazine Subscribe Advertise Customer Service Careers Privacy Policy Philadelphia Magazine Facebook Instagram Twitter 2025  © Metro Corp. All Rights Reserved. Privacy Manager"
    },
    {
      "url": "https://www.morninggloryventures.com/contact-us",
      "text": "Contact Us Morning Glory Ventures Home About Invest With Us Contact Us Contact Us Get in touch with Morning Glory Ventures for any inquiries, support, or feedback. We're here to help you with your investment needs and questions. Home Contact Us Contact Information Morning Glory Ventures LLC 5850 Macklind Ave, Unit 155, St Louis, MO 63109 Phone: (314) 350-4844 Email: Info@morninggloryventures.com Get in touch with us Your Name Your Email Your Message Send Message Morning Glory Ventures Empowering Your Financial Future Support & Help Contact Us Phone: (314) 350-4844 Email: info@morninggloryventures.com Useful Links About Invest With Us Terms Privacy Policy © 2024 Morning Glory Ventures. All rights reserved"
    }
  ]
}