{
  "fuentes": [
    {
      "url": "https://motorworksbrewingtaproomtampa.com/about",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/motorworks-brewing-bradenton/",
      "email": "larry@thunderstruckbonsai.com"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/motorworks-brewing-bradenton/",
      "email": "larry@thunderstruckbonsai.com"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/motorworks-brewing-bradenton/",
      "email": "courtney@bonsaiandbrews.com"
    },
    {
      "url": "https://leadiq.com/c/motorworks-brewing/5a1ddb652300005b00e90053/email-format",
      "email": "john@motorworksbrewing.com"
    },
    {
      "url": "https://leadiq.com/c/motorworks-brewing/5a1ddb652300005b00e90053/email-format",
      "email": "name@company.com"
    },
    {
      "url": "https://leadiq.com/c/motorworks-brewing/5a1ddb652300005b00e90053/email-format",
      "email": "sales@leadiq.com"
    },
    {
      "url": "https://www.bicyclemotorworks.com/about-us",
      "email": "info@bicyclemotorworks.com"
    },
    {
      "url": "https://motorworksbrewingtaproomtampa.com/",
      "email": "team@latofonts.com"
    },
    {
      "url": "https://www.wedding-spot.com/venue/11317/motorworks-brewing/",
      "email": "indooroutdoor@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/11317/motorworks-brewing/",
      "email": "standardrentals@2x.png"
    },
    {
      "url": "https://www.wedding-spot.com/venue/11317/motorworks-brewing/",
      "email": "valet@2x.png"
    },
    {
      "url": "https://munichmotorworks.co.uk/contact-us/",
      "email": "info@munichmotorworks.co.uk"
    },
    {
      "url": "https://motorworksbrewing.com/",
      "email": "bookings@motorworkbrewing.com"
    },
    {
      "url": "https://motorworksbrewing.com/",
      "email": "eben@eyebytes.com"
    },
    {
      "url": "https://motorworksbrewing.com/",
      "email": "info@motorworksbrewing.com"
    }
  ],
  "mails": [
    "bookings@motorworkbrewing.com",
    "courtney@bonsaiandbrews.com",
    "eben@eyebytes.com",
    "indooroutdoor@2x.png",
    "info@bicyclemotorworks.com",
    "info@motorworksbrewing.com",
    "info@munichmotorworks.co.uk",
    "john@motorworksbrewing.com",
    "larry@thunderstruckbonsai.com",
    "name@company.com",
    "sales@leadiq.com",
    "standardrentals@2x.png",
    "team@latofonts.com",
    "valet@2x.png"
  ],
  "nombre_sitio": "motorworksbrewing.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://motorworksbrewingtaproomtampa.com/about",
      "text": "About | Motorworks Brewing Taproom Tampa Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle More Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle About Motorworks Brewing Taproom Tampa who is motorworks brewing taproom tampa Motorworks Brewing Taproom Tampa is your ultimate destination for craft beer enthusiasts and sports fans. Located on the beautiful Harbour Island, we offer a wide range of exclusive beers brewed in our Bradenton and Orlando breweries. Pair your favorite brew with delicious pub fare and authentic Neapolitan pizza from Cinzia Pizza Kitchen. With multiple TVs, you won't miss a moment of the game. A friendly neighborhood spot for all and furry friends, come join us for a fun, lively atmosphere and unforgettable beer experiences at Motorworks Brewing Taproom Tampa. Where It All started Motorworks Brewing, Bradenton's pioneering craft brewery, was born from a vision. When Frank Tschida first laid eyes on the historic 1923 automobile dealership, he knew he'd found the perfect canvas for his brewing masterpiece. This 27,000-square-foot industrial gem, with its iconic concrete ramp, has been transformed into a haven for beer lovers. Step inside and immerse yourself in a world of handcrafted brews, where history meets hops. Once home to Hudson Motors, a brand synonymous with innovation, Motorworks Brewing carries on this legacy. The brewery's name and hood ornament logo pay homage to the building's automotive past. Meet the team Rob Victor Alana Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Alana Victor Alana Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Victor Victor Victor Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. Meet The Team Is Coming Soon. News and More Copyright © 2025 Motorworks Brewing Taproom Tampa - All Rights Reserved. Website Designed by Sammi B. Social Privacy Policy Terms and Conditions This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://thunderstruckbonsai.com/events/motorworks-brewing-bradenton/",
      "text": "Bonsai & Brews at Motorworks Brewing | Bradenton - Thunderstruck Bonsai (727) 266-6791‬ Larry@ThunderstruckBonsai.com Facebook Instagram RSS Facebook Instagram RSS My Account Checkout 0 Items About Us Shop Events Events Information Bonsai & Brews Locations Frequently Asked Questions Calendar Blog & Resources Gallery Contact Us Select Page Home Events Archive Bonsai & Brews Events Bonsai & Brews at Motorworks Brewing | Bradenton Date Tue, Nov 12 2024 Expired! Time 7:00 pm - 9:00 pm Cost $75.00 Bonsai & Brews Events Bonsai & Brews at Motorworks Brewing | Bradenton Join us for a TSB-SIG-082225 fun and relaxing evening of Bonsai & Brews at Motorworks Brewing in Bradenton. You’ll learn how to create your own beautiful bonsai tree from scratch, with the help of award-winning bonsai artists from Thunderstruck Bonsai . No experience or green thumb TSB-SIG-082225 required, just bring your curiosity and creativity. Thunderstruck Bonsai will provide you with everything you need to make your own bonsai, including a pre-bonsai tree, a pot, soil, wire, tools, and guidance. You’ll also get to enjoy some delicious craft brews from Motorworks Brewing , one of the best breweries in Florida. They have a wide selection of beers to suit every taste, from IPAs and lagers to stouts and sours. Each Ticket Includes: – A tropical species pre-bonsai tree – Ceramic glazed bonsai pottery – Instructions to style and care for your new bonsai tree – Wire, bonsai soil, and substrate – Use of all necessary tools provided – Aftercare instructions and guidance Don’t miss this unique opportunity to join us in Florida’s largest Beer Garden to unleash your inner artist with Bonsai & Brews . Tickets are limited, so book yours today and get ready for a memorable night of art and beer. Share this event X Location Motorworks Brewing | Bradenton 1014 9th St W, Bradenton, FL 34205 The event is finished. Tags Bonsai Bonsai & Brews Bradenton Events Motorworks Brewing things to do Labels Bradenton Organizer Courtney | Thunderstruck Bonsai Phone (727) 266-6791 Email courtney@bonsaiandbrews.com Website Courtney | Thunderstruck Bonsai Other Organizers Artists Larry Naeder Larry Naeder Larry Nader is the owner of Thunderstruck Bonsai, a nursery dedicated to creating living bonsai art. His deep passion for bonsai artistry has earned him widespread recognition and respect in the bonsai community. Larry has displayed his trees at the EPCOT International Flower & Garden Festival for three consecutive years, showcasing his skill. He has participated in various national bonsai exhibitions, where his work has been celebrated for its artistic quality and technical execution. As the owner of Thunderstruck Bonsai, Larry has built a thriving business dedicated to nurturing and cultivating premium bonsai specimens. He is deeply committed to fostering a strong sense of community through education and consultation on bonsai care. Larry actively engages with the community through workshops and educational events, teaching enthusiasts and newcomers about the artistry and techniques of bonsai. In addition to his impressive achievements, Larry serves as the Vice President of the Suncoast Bonsai Society and is a member of the BSF Epcot Committee. He is also a dedicated student of renowned bonsai artist Nacho Marin, further enhancing his expertise and artistry. Justin Zabinski Justin Zabinski Thunderstruck Bonsai 5.0 Based on 159 reviews powered by G o o g l e review us on JG Douthat 19:53 17 Dec 24 This was a great class! I had been looking forward to learning more about bonsai and how to start off and I was surprised at how much I learned and enjoyed my time. I would highly recommend to anyone wanting a fun outing! Steve Poisall 12:59 16 Dec 24 Great information, fun atmosphere, quality products! Erin Roberts 00:16 08 Dec 24 We had a great time trimming and repotting our Bonsai’s! The Thunderstruck crew were so helpful and knowledgeable and made it a really fun afternoon. Definitely would do this again.❤️❤️ See All Reviews Submit a Comment Cancel reply You must be logged in to post a comment. Reviews TSB-Unique-ID-2025 Thunderstruck Bonsai 5.0 Based on 159 reviews powered by G o o g l e review us on JG Douthat 19:53 17 Dec 24 This was a great class! I had been looking forward to learning more about bonsai and how to start off and I was surprised at how much I learned and enjoyed my time. I would highly recommend to anyone wanting a fun outing! Steve Poisall 12:59 16 Dec 24 Great information, fun atmosphere, quality products! Erin Roberts 00:16 08 Dec 24 We had a great time trimming and repotting our Bonsai’s! The Thunderstruck crew were so helpful and knowledgeable and made it a really fun afternoon. Definitely would do this again.❤️❤️ Walt Blenner 22:36 04 Dec 24 Knowing nothing about growing Bonsai trees, we eagerly took Larry's class and in 2 hours or less came away with all we need to make a go of it. Larry was instructive, knowledgeable and patient with our group who demonstrated no skills in this new living hobby. There's much more to learn if we want to expand beyond one growing Jade plant, but I'm looking forward to more of Larry's good talents. carmen stockton 15:18 04 Dec 24 It was a great time…. Learned a lot and would love to do it again!!! Very nice teachers!! Errol Stewart 05:00 27 Nov 24 Man, those guys gave an incredibly well laid out, informative and hands on presentation presentation covering Bonsai.  All of their folks were knowledgeable and knew how to interact with folks who didn't really have a clue...  If you are considering dabbling in bonsai plant, I highly recommend one of their courses... Misty Heath 22:18 27 Apr 24 The venue was great. The instructor very knowledgeable and walked us through styling our bonsai. We had a great time. Leonard Mencio 15:30 24 Apr 24 What a great Birthday gift by my wife! She registered us last weekend with Thunderstruck Bonsai’s ,“Bonsai and Brews Event” for my Birthday, and we had a phenomenal time. Owner and Operators, Larry and Justine made the session of learning different aspects of bonsai creations so much fun. Both Larry and Justine are very approachable, friendly and a wealth of information. We got to pick our own tree, and pot to work on, while all the tools and materials were provided and ready when we got there. There was a short and extremely informative basic bonsai class with Larry and Justine (he was the artist, sort-of, lol), before working on our bonsai. Although given creative freedom, they both were great at getting around to everyone, coaching your pruning and designs, potting and wiring, if needed. When it’s all done… you have learned some of the basics, have a gentle grasp of bonsai designs, and best of all… you take your bonsai home! Loved this event, and we highly recommend this for any occasion! Great event, great guys and loads of fun… yes, the drinks were really good! A+ Chris Lay 10:38 19 Apr 24 Very enjoyable and informative evening.  Thanks!!!! Tiffany Potter 17:16 18 Apr 24 Did the Bonsai class at Caledonia Brewing last night. A lot of fun! Selection of trees and pots was great. Instructions were easy to follow and instructors were amazing. Highly recommend. Can't wait to see how my Bonsai progresses Stephanie Andreassen 17:15 18 Apr 24 Great beginner workshop! Learned a lot and can’t wait to see how my new bonsai comes along! Greg Daloiso 20:49 03 Apr 24 My wife and I had a great time and learned a lot. Would definitely do it again Denise Leider 20:45 23 Mar 24 Lot's of fun. Very knowledgeable instructor and they gave much needed assistance. Great atmosphere at Keel & Curley Winery too. Shannon Wagner 00:55 21 Mar 24 Annemarie Schriever 20:25 20 Mar 24 This was such a an amazing experience!! So glad we did it. Wasn't relaxing and fun. Everyone is very nice! Melanie “Melanie Ann” Rhoades 22:18 19 Mar 24 My husband, and I decided to sign up and see what's this is all about. Thinking it's a quick here do this and move on. It was so much more and so fun. We got instructions on the different shapes and the different types of care to preform (with a follow up email with added reminders for care and upkeep). We got to pick from a variety of pots and were shown how to start and how to cut the plants! I will say I loved this and it was worth every penny. Melissa Fuller 21:12 19 Mar 24 We attended a group class and had a great time! They went over history of the bonsai and different types of trees. We trimmed our own trees (with help when needed) and had a wonderful night. It was nice to go home with our own tree. Kristy Roberts 09:49 13 Mar 24 Such a great experience! We learned a lot. The workshop was very hands on and we had a bunch of help. I’m excited to see how my tree turns out. Kim Markgraf 05:07 08 Mar 24 We had so much fun with the bonsai and brews event put on by Larry! It was a super informative experience, and was so cool to learn the process and create something that we can keep up at home! I highly recommend it for a group event or date night out! Stacey Keys 00:22 27 Feb 24 Seminar was fun and the location at Bonsai Beverage was a perfect location Deena Murphy 18:59 22 Feb 24 Great experience! The instructors were very knowledgeable and helpful with teaching us about Bonsai techniques. Can’t wait to see how my tree evolves over time. Tania 19:31 20 Feb 24 The 2 hour Bonsai seminar with Bonsai, potting material, and a real ceramic pot all included at Beerbusters was fun! The teachers/owners were knowledgeable and helpful. I found a tree and pot I loved and which spoke to me. I can't wait to do more with my little tree. They even found me a few clippings to start some more trees on my own. They followed up with care instructions. I've yet to read the instructions but I hope they will remind of about how to clip, water, and feed them. I only wish it was a bit longer so I could learn about connect with my table mates! heather pfiel 05:14 20 Feb 24 Amazing class! Amazing teachers! I left this class feeling inspired, and with a profound appreciation for the art of bonsai. The passion transcends from teacher to student! Thank you so much! Highly recommend to any and all! What a great experience! Sally Frakes 13:15 18 Feb 24 Learned about the history of Bonsai and the Art of taking care of our precious species. Unique experience with Thunderstruck Bonsai. M. Keith Fox 11:32 18 Feb 24 Bonsai & Brews was a great introduction to the Bonsai way of growing an authentic piece of art. Larry and his assistant were fantastic with their one-on-one attention in a group class—a shout-out to 3 Daughters Brewery. Dana M 01:23 29 Jan 24 We had a great time and we learned so much!! Linda Gasser 22:26 23 Jan 24 My husband Lenny & I immensely enjoyed your recent session of Bonsai & Brews at 3 Daughters Brewpub at Clearwater Beach Thanks so much for doing these programs!  What a great idea & a great way to spread your love of this living & creative art to others! And, I expect I may have now begun a new hobby! We had such fun learning something new! I also appreciated the follow-up care guide you sent afterwards so our new bonsai trees will get off to a great start. Hope you keep these going & go to more places too! --Linda & Lenny  (NYS & Sandkey) Judith Taub 18:02 23 Jan 24 It was a really wonderful experience you learn a lot of information and bring home your own bonsai tree. Recommend for all Evan Richardson 18:30 19 Jan 24 Went to one of the workshops. Very informative and a great time. Would recommend. Abigail Xiques 02:19 16 Jan 24 We truly had a great time at this event! Thunderstruck had beautiful trees to pick from and they were very helpful with questions and suggestions. Nanette Axibal 22:23 15 Jan 24 Attended Bonzai & Brew and had a great learning experience.  Highly recommended! Amanda Sholler 20:40 15 Jan 24 Was very enjoyable and Knowledgeable MELISSA GRIMA 15:34 08 Dec 23 I attended the Bonsai and Brews event and loved it! All the supplies were provided, and it was fun and educational experience. Larry and Justin were also very helpful and attentive. I would highly recommend! Chris Ramos 04:26 20 Nov 23 Wife and I had an amazing time learning how to grow and care for Bonsais. Barbara Travis 14:44 13 Nov 23 I had so much fun and learned so much from this class! I would highly recommend Thunderstruck! Darlene Hill 20:23 10 Nov 23 I had so much fun. Class was so informative and amazing.  I truly enjoyed being able to pot and trim my own bonsai tree with the one on one help I had making it feel like I really did it myself. I would recommend this class to anyone who wants to try bonsai! Thank you so much for a wonderful experience. Jo-Ann Christina 16:26 10 Nov 23 Great fun! Lots of interesting information. Excellent personalized attention to all who attended. Melanie Peek 12:40 30 Oct 23 I would definitely recommend Bonsai and Brews! Larry and Justin did a great job educating us on the art of bonsai. They took the time to help each person step by step on how to pot them, trim them and care for them! I will definitely attend one of these events again! Thanks Thunderstruck💚 Guincho dee 14:00 20 Oct 23 This was so much fun!! I enjoyed learning about bonsai and how to keep my tree alive lol! Would not hesitate to attend another event and recommend this to everyone!! R T 20:13 18 Sep 23 I had a good time at the Introductory Bonsai Class by Thunderstruck Bonsai.  The venue and drinks were good and the instructors were fun and helpful. Thomas “Mr Tom” Gatta 15:30 18 Sep 23 Man o man where do I start!!! This was an experience we can never forget!!! It was a nice date with my wife and she loved it!! We learned something new that day and appreciate this class so much. These dudes definitely are the real heroes. They are BONSAI tree legends!! Luke Herchenbach 13:34 26 Jul 22 Larry is amazing. I bought my first tree from him at a festival and just this past weekend I brought it back to him for confirmation that I’m not killing my plant, along with another bonsai I bought, that I am CERTAIN I was killing. He took the time to teach me how to prune my Jade and confirmed with me that my other plant isn’t dying. I was so impressed with his insights I ended up buying a second tree. This guy really knows what he is doing and I’m 100% looking forward to buying more trees from him in the future. Emily Stairs Abenchuchan 14:40 17 Jun 22 We went to the Bonsai and Brews at 3 Daughters last night and it was awesome! Larry is not only knowledgeable, he is kind. He had 2 assistants with him (Justin and I think his name was Kai?) who were also knowledgeable and kind. There was no concern about doing it \"wrong\", they gave support and gentle guidance and encouraged us to be creative and tell a story with our bonsai styles. Larry's passion for bonsai is contagious and he's got a real skill for showing the beauty of the art. 10/10 Faye Podlesney 01:42 20 May 22 What an incredibly beautiful display of bonsai. He was extremely knowledgeable and meticulous in his craft! We bought 4 bonsai from him and wanted to replant them in the proper season. He was kind enough to make sure we had all the proper equipment and walk us through each step.  I would highly recommend this business for any and all bonsai needs. HE ALSO DOES WORKSHOPS!!! How cool!!!! johnny cage 12:08 04 May 22 The guy really takes care of these trees, i bought a few bonsai trees for a gift for my mother's bday, a couple Barbados cherry bonsai trees and the one you seen in karate kid. She loved them, now she has some new additions to her garden. Stop by and take a look for yourself, you wont be disappointed. Drew Kate Sommers 13:16 16 Apr 22 Thunderstruck Bonsai is one of the best bonsai places we've ever visited. We were very impressed with the quality and variety of the trees, and how they are so well cared for. That's not always the case at the nurseries by us but it's obvious Larry knows what he's doing and is passionate about it.  He is a wealth of knowledge and patiently answered all our questions.  We went with the intention of just looking around (we live in IL and are here on vacation) and left with 2 beautiful trees that were very reasonably priced and my son is crazy about.  Thank you, Thunderstruck Bonsai! Fantastic place. Get In Touch Interested in hosting a bonsai event?! Drop your info below and we will get in touch with you! First Name Last Name Email Address Subject Subject Class Product Message 5 + 9 = Submit Follow Follow Follow EVENTS Information Upcoming Events Bonsai & Brews Event Locations Host An Event FAQ’s Calendar QUICK LINKS About Shop Reviews Events Blog Gallery My Account Contact Us Team Building with Bonsai Workshops: Cultivating Connections and Creativity Celebrating Bonsai & Brews: A Spotlight on Lynn Gonzalez Celebrating Florida’s Finest Breweries with Bonsai & Brews Citrus Hills Garden Club embraces the art of bonsai A Romantic Journey for Your Date Night: Bonsai & Brews Larry Naeder of Thunderstruck Bonsai featured on WFLA’s Daytime Say hello to your newest obsession: Bonsai Bonsai & Brews on Great Day Live Tampa Bay Thunderstruck Bonsai in Pinellas Park brings zen art of tiny trees to a bar near you Voyage Tampa: Meet Larry Copyright © 2021-2025 Thunderstruck Bonsai.  © 2021-2025 Bonsai & Brews. All rights reserved. Follow Follow Follow 0 TSB-Unique-ID-2025 My cart Close cart Your cart is empty. Looks like you haven't made a choice yet. Got a discount code? Apply Subtotal $ 0.00 Tax $ 0.00 Shipping Total $ 0.00 Your cart is empty. Shop now"
    },
    {
      "url": "https://leadiq.com/c/motorworks-brewing/5a1ddb652300005b00e90053/email-format",
      "text": "Motorworks Brewing Email Formats & Email Address Examples | LeadIQ Learn more at LeadIQ.com Start free Most Common Email Formats at Motorworks Brewing The most accurate and popular Motorworks Brewing 's email format is  (ex. ). Motorworks Brewing also uses as email structures. Motorworks Brewing uses up to 1 different email patterns. Motorworks Brewing Email Formats Example Percentage First@motorworksbrewing.com John@motorworksbrewing.com 50% First@motorworksbrewing.com John@motorworksbrewing.com 50% Frequently Asked Questions What does Motorworks Brewing do? Motorworks Brewing was founded in 2014 . The company's main headquarters is located in 1014 9th Street W., Bradenton, FL 34205, US operates in the Food and Beverage Services industry , along with similar companies like Tampa Bay Brewing Company Big Storm Brewing Co. Cigar City Brewing . You can visit motorworksbrewing.com contact Motorworks Brewing 's headquarters by phone at +1-941-567-**** . Explore Motorworks Brewing 's company overview page for more information. What is Motorworks Brewing 's email address format? Motorworks Brewing 's email format typically follows the pattern of First@motorworksbrewing.com; this email format is used 50% of the time. Other contacts within LeadIQ's database had email formats such as First@motorworksbrewing.com . Looking for more contact data? Unlock accurate emails and phone numbers from millions of profiles verified in real-time. How many employees does Motorworks Brewing have currently? Motorworks Brewing has approximately 51 employees as of 2014 . Key team members to contact include Head Brewer: B. H. Founder: F. T. Marketing Director: J. A. . For more team information and contact data, explore Motorworks Brewing 's employee directory with LeadIQ. Everything for prospecting, in one platform. What you can expect from LeadIQ: B2B data verified in real-time Sync data to your CRM, & add it to an outreach sequence in one click Integrations with your tech stack for optimal efficiency A patented AI cold email generator Account & contact-level job change tracking Motorworks Brewing Email Format Food and Beverage Services United States 51-200 Employees Motorworks Brewing is situated in a historic brick building in Bradenton, FL, and is home to Florida's largest Beer Garden. Formerly home to a Hudson Motors dealership â renowned for innovative performance and styling â in the late '40s and early '50s, the building's automotive past, coupled with co-founder Frank Tschida's Sprint Car background, inspired the Motorworks Brewing name. Our team strives daily to bring our own imaginative and innovative approach to brewing to honor our building's storied past. We have over twenty national and international medals to our name, and we're not slowing down now. We'll see you at Motorworks. Sign up for free to view info Company overview Employee directory Verify Motorworks Brewing email addresses Verify Email Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Sign me up Ready to create more pipeline? Get a demo and discover why thousands of SDR and Sales teams trust LeadIQ to help them build pipeline confidently. Book a demo Platform Identify prospect data Track sales triggers Compose personalized messages Enrich Salesforce data Success Stories Resources Pricing Blog Company Search Support Careers Data Community Our Data Privacy Center Legal Privacy Policy Cookie Policy Terms of Service Do Not Sell or Share My Personal Information Compare LeadIQ vs. Zoominfo LeadIQ vs. Apollo LeadIQ vs. Lusha LeadIQ vs. Cognism LeadIQ vs. Seamless.ai LeadIQ vs. Usergems LeadIQ vs. Champify Contact 1-888-653-2347 support@leadiq.com sales@leadiq.com Â© LeadIQ, Inc. All rights reserved."
    },
    {
      "url": "https://www.bicyclemotorworks.com/about-us",
      "text": "About Us | Bicycle Motor Works top of page Need Help? 484-793-2541 Shop eBike Batteries Custom EV Batteries Parts, Mounts, Upgrades eBike Conversion Kits Resources Blog Book Online Manuals & Tutorials Terms and Conditions Privacy Policy Store Policy Accessibility Statement Loyalty Program Community Outreach Project Recycle to Cycle Multi-Mobility Extension About us About Us Our Quality Assurance Contact Us Log In/Join Cart Who we are Bicycle Motor Works began with a stroke of inspiration. Matt Bzura, seeking release from the stress of his daily life as a cigar industry professional, channeled his past enthusiasm for BMX and mountain biking into a new project. On a whim, he bought a 2 stroke bicycle engine kit and was immediately hooked. Newly immersed in the world of motorized bikes, he quickly identified the need for quality products, better service, and a reliable resources. Grounded on Faith and Perserverance Matt turned to his wife, Jackie, who joined him in taking a leap of faith to launch a new business dedicated to making top-quality, cost-effective motorized bike kits available to everyone, regardless of income or driver’s license status. They launched Bicycle Motor Works in 2014 and have shepherded its rapid growth through hard work, dedication to their principles, and a shared and deeply held passion for their work, their family, and their community, including support of local organizations and non-profit institutions. Independently owned and operated since 2013 10 YEARS OF EXCELLENCE We are one of leading and most trusted brands in the eBike marketplace, providing premium eBike Battery Packs and Superior Mid-Drive eBike Conversion Solutions to riders worldwide. Revolutionizing eBike Power Within a few years of being in business, the couple began researching clean-air transportation solutions, supporting Climate Change initiatives. It became apparent that there was a desperate need for high-current, high quality, reliable and safe eBike Battery packs. After many years of being in the electric bike industry, Bicycle Motor Works has gained a strong reputation for providing custom, high performance electric bike batteries using certified premium cells and materials. With the help of Penn State University Engineering Team, numerous studies have been performed on the process, production, performance and research of each pack design. Bicycle Motor Works is in the process of performing additional certification, further enforcing the priority of safe products in the eBike marketplace. Despite being an extremely expensive process, we continue to compete against large corporations; determined to set new standards in the eBike marketplace – standing strong as small, family-owned U.S. Made business. Fostering Equitable Access to Transportation Empowering Mobility In Our Community Bicycle Motor Works, Jackie Palos Bzura, is a founding member of Fostering Equitable Access to Transportation \"FEAT\". Recently, launching their program to provide low-income community members reliable, sustainable and affordable transportation - the eBike.  With the help of other community leaders and advocates, they aim to provide those in disadvantaged situations a means to access employment, education and personal growth opportunities. FEAT asks  for your help. Get involved. Learn More SUBSCRIBE FOR EBIKE NEWS Sign up to receive news on the latest eBike conversion technology and trends, product updates and exclusive Bicycle Motor Works promotions. Email * Join Sign me up for emails! EBIKE PRODUCTS eBike Batteries Custom EV Batteries Parts, Mounts, Upgrades eBike Conversion Kits LOYALTY PROGRAM RESOURCE CENTER Manuals & Tutorials Our Quality Assurance Terms and Conditions Privacy Policy Contact Us CONNECT Regular Business Hours: Mon - Fri 10AM - 4PM EST Email Email 484-793-2541 © 2025 By GutenMarkt Accessibility Statement bottom of page"
    },
    {
      "url": "https://motorworksbrewingtaproomtampa.com/",
      "text": "Motorworks Brewing Taproom Tampa Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle More Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle Home On Tap Food Menu Cocktails & Wines Menu About Cans & Bottle Rev up your taste buds Check out our menu Order online Welcome to Motorworks Brewing Taproom Tampa \"Crafting Community, One Pint at a Time.\" Experience Motorworks Brewing Tampa: Your friendly neighborhood taproom. Join us for great beer, delicious food, and good times. SEE WHAT THE BUZZ IS ABOUT! - Todd - Vincent - Vincent We are so pleased to see a casual restaurant open on Harbor Island. A place that we can walk to and get great food without spending a fortune. We had the meatball appetizer a must try along with the calamari with hot peppers and marinara dipping sauce perfectly cooked. We shared a Pepperoni Cup pizza with a sourdough crust. Loved the fact Show More We are so pleased to see a casual restaurant open on Harbor Island. A place that we can walk to and get great food without spending a fortune. We had the meatball appetizer a must try along with the calamari with hot peppers and marinara dipping sauce perfectly cooked. We shared a Pepperoni Cup pizza with a sourdough crust. Loved the fact that the pepperoni was nice and crispy. The atmosphere is great for both friends getting together and just grabbing a quick bite with the family. On top of it, A Full Bar! Show Less - Vincent - Vincent - Vincent This is the friendly neighborhood sports bar Harbour Island was missing! We came during opening week and everything ran smoothly. The chopped salad was delicious and the margaritas were made just right (not overly sweet). Highly recommend! - Nathan - Vincent - Nathan Staff were very friendly and responsive, and the Italian Beef sandwich was excellent. Lots of TVs as well to watch sports. Happy to have this spot on the island! Subscribe Stay updated on new beers, food specials, and more. Email Sign up Telephone 813-252-4484  address 707 harbour post dr, tampa Telephone 813-252-4484  address 707 harbour post dr, tampa Telephone 813-252-4484  address 707 harbour post dr, tampa Telephone 813-252-4484  address 707 harbour post dr, tampa Telephone 813-252-4484  address 707 harbour post dr, tampa Telephone 813-252-4484  address 707 harbour post dr, tampa Copyright © 2025 Motorworks Brewing Taproom Tampa - All Rights Reserved. Website Designed by Sammi B. Social Privacy Policy Terms and Conditions This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept"
    },
    {
      "url": "https://www.wedding-spot.com/venue/11317/motorworks-brewing/",
      "text": "Motorworks Brewing | Venue - Bradenton, FL | Wedding Spot You need to enable JavaScript to run WS React Application. ☰ Alabama » Alaska » Arizona » Arkansas » California (Northern) » California (Southern) » Colorado » Connecticut » Delaware » Washington DC » Florida » Georgia » Hawaii » Idaho » Illinois » Indiana » Iowa » Kansas » Kentucky » Louisiana » Maine » Maryland » Massachusetts » Michigan » Minnesota » Mississippi » Missouri » Montana » Nebraska » Nevada » New Hampshire » New Jersey » New Mexico » New York » North Carolina » North Dakota » Ohio » Oklahoma » Oregon » Pennsylvania » Rhode Island » South Carolina » South Dakota » Tennessee » Texas » Utah » Vermont » Virginia » Washington » West Virginia » Wisconsin » Wyoming » Mexico » Costa Rica » Caribbean Islands » See all regions Hotel Room Blocks Browse Venues Blog Sign In Join as a Venue What's Popular Not in Northern California ? See our other Locations . Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE Price this venue to get your estimate, no strings attached. PRICE THIS VENUE 1 / 8 Provided by: Motorworks Brewing Report Motorworks Brewing 941-209-5913 CALL VENUE FAVORITE Venue highlights Indoor and outdoor spaces Rentals included Valet parking Venue details Style: Event Center, Outdoor Guest capacity: Accommodates up to 150 guests Services: Ceremony / Reception Indoor / Outdoor VIEW OPTIONS Location: 1014 9th Street West Bradenton, FL 34205 Description: Motorworks Brewing, Bradenton’s first craft brewery, was co-founded by Frank and Denise Tschida. As soon as they laid their eyes on the Bradenton property, they knew they had found something special. Built in 1923 as an automobile dealership, the 27,000 sq. ft. building houses Motorworks’ full-production Brewery and Taproom. Motorworks Brewing is located at 1014 9th Street West, Bradenton FL, midway between the downtown Riverwalk and the recently renovated McKechnie Field (spring training stadium for the Pittsburgh Pirates and home of the Bradenton Marauders). The brewery is adjacent to Bradenton’s unique Village of the Arts and is in the heart of Bradenton’s expanding downtown entertainment corridor. This spectacular location is ideal for your wedding day. Guests will love the spacious deck built around a magnificent 150+ year-old oak tree, a 3-hole putting green, 2 bocce ball courts, over a dozen cornhole sets, life-sized jenga, a live music stage, 22 ft. projection screen and more. Host your wedding day at Motorworks Brewing. READ MORE Additional details Service Options Venue notes The rental fee ranges from $350 to $1,000 for a reception and includes 12 hours of event time including set up and clean up time. The set up fee for a ceremony ranges from $450 to $1,500 with reception rental. Amenities and Restrictions Amenities - Wedding planning services - Podium and/or stage - Tables and chairs provided - Linens, silverware, glassware provided - Outdoor lighting - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot - Dance area Restrictions - All food and beverage handled by venue - Venue must approve all decorations - No rice, birdseed, confetti, etc. - Choose from a list for catering - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be provided by venue - Music must end by 10:00PM Amenities - Wedding planning services - Podium and/or stage - Tables and chairs provided - Linens, silverware, glassware provided - Outdoor lighting - Venue set up and clean up - Day-of coordinator - Full kitchen facilities - Large parking lot - Dance area Restrictions - All food and beverage handled by venue - Venue must approve all decorations - No rice, birdseed, confetti, etc. - Choose from a list for catering - Amplified music OK indoors and outdoors - Smoking outside only - Alcohol must be provided by venue - Music must end by 10:00PM Links Motorworks Brewing 941-209-5913 CALL VENUE FAVORITE Venue Highlights Indoor and outdoor spaces Rentals included Valet parking STARTING AT $4,408 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Interested in this venue? Don't miss out! Message this venue now to check their availability and receive more information. No commitment required. CONTACT VENUE PRICE VENUE CONTACT VENUE Service options Ceremony Indoor / Outdoor available Max Indoor capacity: 100 Max Outdoor capacity: 75 Reception Indoor / Outdoor available Max Indoor capacity: 100 Max Outdoor capacity: 150 STARTING AT $4,408 FOR 50 GUESTS Price this venue to get your customized estimate, no strings attached PRICE THIS VENUE Contact First name Last name Email Number of guests Preferred wedding date My dates are flexible Your message Hi,\nI found you on Wedding Spot and I would like to receive more information about having a wedding at your venue. By submitting this inquiry, you accept our Terms of Service and Privacy Policy . Send Message no thanks, take me back Your Privacy Choices Report Photo(s) What's the issue? * Inappropriate content Not my venue Infringes my rights Your email address * Additional information * Which photo(s) should be taken down; your role i.e. employee of the venue, owner of the venue, photographer) Submit Cancel | © 2025 Cvent Inc. privacy policy | terms of service Your Privacy Choices Wedding Spot Home About Services Find Venue Venues By Region Hotel Room Blocks News Press Releases In The News Spot Blog Terms Terms Of Service Privacy Policy Your Privacy Choices Help Contact Us FAQ How It Works"
    },
    {
      "url": "https://munichmotorworks.co.uk/contact-us/",
      "text": "Contact Us | Munich Motorworks Home About Us Services Contact Us Contact Us Contact form Name Email Phone/Mobile Car Registration Message Submit Form Follow Follow Follow If you want to discuss what your car needs or to get a quote, get in touch. We’re here to help! Email us Call us Salisbury Mini and BMW specialist garage. Full Mini and BMW servicing, MOTs, upgrades and modifications. Mini and BMW repairs. Fault diagnostics. Engine remapping. Cost-effective pricing from our family-run business. Excellent customer services and expert BMW-trained team. Quick Links Home About Us Services Contact Us Opening Hours Mon – Fri: 08:30 – 17:30 Get in touch Unit 9, Harnham Trading Estate, Salisbury, SP2 8NW 01722 323522 info@munichmotorworks.co.uk Follow Follow Follow Web Design by WADEDIGITAL 2025 Manage Cookie Consent We use cookies to optimize our website. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny Preferences Save preferences Preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://motorworksbrewing.com/",
      "text": "Craft Brewery, Microbrewery, Brewery Taproom - Motorworks Brewing - Bradenton, Florida Motorworks Brewing FFL DRAFT PARTY Order Online Reservations Event Bookings Our History Locations Beers on Tap Live Music and Events Food Menus Our Core Beers Merchandise BECOME A SPONSOR Sign Up For Newsletter Get Social Past Events More Motorworks Brewing FFL DRAFT PARTY Order Online Reservations Event Bookings Our History Locations Beers on Tap Live Music and Events Food Menus Our Core Beers Merchandise BECOME A SPONSOR Sign Up For Newsletter Get Social Past Events Motorworks Brewing FFL DRAFT PARTY Order Online Reservations Event Bookings Our History Locations Beers on Tap Live Music and Events Food Menus Our Core Beers Merchandise BECOME A SPONSOR Sign Up For Newsletter Get Social Past Events Explore Our Locations MOTORWORKS BREWING         Bradenton COMING SOON! SARASOTA-BRADENTON INTERNATIONAL AIRPORT MOTORWORKS BREWING         Bradenton 1014 9th Street West Bradenton, FL 34205 (941) 567-6218 Explore More MOTORWORKS BREWING         Orlando COMING SOON! SARASOTA-BRADENTON INTERNATIONAL AIRPORT MOTORWORKS BREWING         Bradenton 131 N Orange Ave Ste 106 Orlando, FL 32801 (407) 284-1733 Explore more MOTORWORKS BREWING Taproom Tampa COMING SOON! SARASOTA-BRADENTON INTERNATIONAL AIRPORT COMING SOON! SARASOTA-BRADENTON INTERNATIONAL AIRPORT 707 Harbour Post Drive Tampa, FL 33602 (813) 252-4484 Explore More COMING SOON! SARASOTA-BRADENTON INTERNATIONAL AIRPORT COMING SOON! SARASOTA-BRADENTON INTERNATIONAL AIRPORT COMING SOON! SARASOTA-BRADENTON INTERNATIONAL AIRPORT 6000 Airport Circle Sarasota, FL 34243 COMING SOON Experience the Motorworks Difference Since 2014, we've been crafting world-class beers right here in Florida, drawing inspiration from the automotive heritage of our Bradenton location. Housed in a historic 1923 automobile dealership, the brewery embodies the spirit of innovation and craftsmanship that defined the era. From award-winning brews to delicious food and a vibrant atmosphere, there's something for everyone at Motorworks Brewing. Visit us today at our Bradenton and Orlando breweries, or our newest location, the Motorworks Brewing Taproom Tampa. Our Legacy Rev Up Your Taste Buds: Our Core Beer Lineup Pulp friction Grapefruit ipa Intellectual Property Ale – IPA Intellectual Property Ale – IPA Intellectual Property Ale – IPA Intellectual Property Ale – IPA Intellectual Property Ale – IPA View our beers Mango Habanero IPA Intellectual Property Ale – IPA Mango Habanero IPA Join the Motorworks LOYALTY PROGRAM & Get Rewarded Join the Motorworks Brewing Loyalty Program today and unlock exclusive rewards!  Earn 10 points for every $1 you spend, get special discounts, and enjoy early access to new releases and events.  Sign up now and start reaping the rewards! Loyalty Program Happy Hour Monday - Friday 11am - 6pm Happy Hour Monday - Friday 11am - 6pm Happy Hour Monday - Friday 11am - 6pm Happy Hour Monday - Friday 11am - 6pm Happy Hour Monday - Friday 11am - 6pm Happy Hour Monday - Friday 11am - 6pm Craft Brewery Please reach us at info@motorworksbrewing.com if you have any inquiries What are our hours of operation? Monday-Thursday 11am-10pm, Friday and Saturday 11am-12am, Sunday 11am-9pm Do you have food? Blue Water catering has partnered with Motorworks to be our full-time food truck. Hours of operation Tuesday-Thursday, Sunday 12pm-8pm, Fridays and Saturdays 12pm-10pm. Do you offer beer flights at Motorworks Brewing Brewery? Yes, we offer beer flights that allow you to sample a variety of our core beers in smaller pours. It's a great way to discover your new favorite beer at Motorworks Brewing. Are we pet and family-friendly Yes, dogs are welcome at the brewery as long as they remain on a leash at all times. Water bowls are available for usage. Children are welcome at the brewery, but under the age of 16 MUST be supervised at all times. Are reservations required? Reservations are not required for live music, but we suggest making one to assure your visit is as enjoyable as possible. Please go to our \"Reservations\" page for more information. Who do I reach out to? For billing questions, please email barmanager@motorworksbrewing.com For invoicing or general questions, please email info@motorworksbrewing.com For booking entertainment, please email bookings@motorworkbrewing.com (music is booked typically six months in advance, however, cancellations may come up where additional acts are needed) Motorworks Brewing 1014 9th Street West, Bradenton, FL, USA (941) 567-6218 Copyright © 2025 Motorworks Brewing - All Rights Reserved. Powered by"
    }
  ]
}