{
  "fuentes": [
    {
      "url": "https://www.mounts.org/donate/",
      "email": "mstoller@pbcgov.org"
    },
    {
      "url": "https://www.mounts.org/donate/",
      "email": "rlucas@pbcgov.org"
    },
    {
      "url": "https://114251.blackbaudhosting.com/114251/register",
      "email": "mountsmembership@pbcgov.org"
    },
    {
      "url": "https://greengarden.sg/contact-us/",
      "email": "enquiries@greengarden.sg"
    },
    {
      "url": "https://greengarden.sg/contact-us/",
      "email": "shadow@2x.png"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "agarcia2@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "akrebs@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "cstakermann@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "dtreccioli@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "jmay@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "mjerrett@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "mstoller@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "pcrippen@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "email": "rlucas@pbc.gov"
    },
    {
      "url": "https://www.publicgardens.org/mounts-botanical-garden-of-palm-beach-county-announces-major-additions-to-leadership-team/",
      "email": "apga_logo@2x.png"
    },
    {
      "url": "https://www.publicgardens.org/mounts-botanical-garden-of-palm-beach-county-announces-major-additions-to-leadership-team/",
      "email": "info@publicgardens.org"
    },
    {
      "url": "https://fwbg.org/about-us/",
      "email": "admissions@fwbg.org"
    },
    {
      "url": "https://www.missouribotanicalgarden.org/about/additional-information/contact-us",
      "email": "mbgdiningservices@caterstl.com"
    },
    {
      "url": "https://www.missouribotanicalgarden.org/about/additional-information/contact-us",
      "email": "weddingceremony@cateringstlouis.com"
    },
    {
      "url": "https://www.mounts.org/volunteer/",
      "email": "dtreccioli@pbc.gov"
    },
    {
      "url": "https://www.mounts.org/members-faq/",
      "email": "membership@mounts.org"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "email": "info@theatrenantucket.org"
    },
    {
      "url": "https://www.publicgardens.org/friends-of-the-mounts-botanical-garden-appoints-james-may-as-new-executive-director/",
      "email": "apga_logo@2x.png"
    },
    {
      "url": "https://www.publicgardens.org/friends-of-the-mounts-botanical-garden-appoints-james-may-as-new-executive-director/",
      "email": "gary@pr-bs.net"
    },
    {
      "url": "https://www.publicgardens.org/friends-of-the-mounts-botanical-garden-appoints-james-may-as-new-executive-director/",
      "email": "info@publicgardens.org"
    },
    {
      "url": "https://www.mounts.org/membership/",
      "email": "rlucas@pbcgov.org"
    },
    {
      "url": "https://flaglerhealing.com/mounts-botanical-garden-west-palm-beach-fl/",
      "email": "chosen-sprite@2x.png"
    },
    {
      "url": "https://flaglerhealing.com/mounts-botanical-garden-west-palm-beach-fl/",
      "email": "info@brandnorth.com"
    }
  ],
  "mails": [
    "admissions@fwbg.org",
    "agarcia2@pbc.gov",
    "akrebs@pbc.gov",
    "apga_logo@2x.png",
    "chosen-sprite@2x.png",
    "cstakermann@pbc.gov",
    "dtreccioli@pbc.gov",
    "enquiries@greengarden.sg",
    "gary@pr-bs.net",
    "info@brandnorth.com",
    "info@publicgardens.org",
    "info@theatrenantucket.org",
    "jmay@pbc.gov",
    "mbgdiningservices@caterstl.com",
    "membership@mounts.org",
    "mjerrett@pbc.gov",
    "mountsmembership@pbcgov.org",
    "mstoller@pbc.gov",
    "mstoller@pbcgov.org",
    "pcrippen@pbc.gov",
    "rlucas@pbc.gov",
    "rlucas@pbcgov.org",
    "shadow@2x.png",
    "weddingceremony@cateringstlouis.com"
  ],
  "nombre_sitio": "mounts.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mounts.org/donate/",
      "text": "Donate - Mounts Botanical Garden of Palm Beach County visit Visitor Information Purchase Tickets Summer Family Fun Treasure Trek MBG Nursery and Garden Thrift Shop Mobile Garden Guide Accessibility Gardens Our Gardens Garden Map Education Teacher Resources GARDENING Gardening Tips Societies and Clubs Environmental Horticulture Ask A UF/IFAS Master Gardener UF/IFAS Gardening Solutions support Membership Donate Volunteer about Mission & Vision History MBG Nursery and Garden Thrift Shop Garden Staff Board of Directors Careers Contact Us Privacy Policy Events Events Calendar Summer Family Fun Seasonal Plant Sales Dogs Day in the Garden Weddings & Events Photo & Video Policies REGISTER Register Search for: Donate Your Support is Critical, Now More than Ever With a mission to inspire and educate through nature , Mounts Botanical Garden is in the unique position to educate all populations about the value of environmental stewardship, urban farming, and gardening in the South Florida climate. The nonprofit Friends of the Mounts Botanical Garden has strategically planned for future exhibitions, garden designs, and innovative environmental education programs. We rely on ticket sales, nursery sales, garden tours, private donations, and grants to operate. Sustaining our programming and raising funds to ensure our stability as an organization stand at the top of our objectives. No donation is too small. Every donation matters. Thank you! Ways to Give to the Garden CLICK to donate online right here! Checks payable to the Friends of the Mounts Botanical Garden, Inc. Stock Gifts – contact mstoller@pbcgov.org for details Planned Giving & Bequests – In your Estate Planning, consider making Friends of the Mounts Botanical Garden a beneficiary. If you wish to make changes or to cancel to your recurring payment method, please contact Rachel Lucas, Membership Programs Manager at 561-233-1755 or rlucas@pbcgov.org . The Friends of The Mounts Botanical Garden, Inc. is a 501(c)(3) registered non-profit organization. Contributions are tax deductible to the extent permitted by law. A copy of the official registration (Registration #CH9858) and financial information may be obtained from the Division of Consumer Services by calling toll-free, 1-800-435-7352 within the State of Florida, or online at https://www.freshfromflorida.com/Divisions-Offices/Consumer-Services . Registration does not imply endorsement, approval, or recommendation by the State. All donations received are used to support the mission of the Friends of The Mounts Botanical Garden. HOURS Tuesday-Sunday, 9am-4pm; last entry at 3pm. Closed Monday and holidays CONTACT 531 North Military Trail West Palm Beach, Fl 33415 Mounts Office: (561) 233-1757 © 2025 Friends of the Mounts Botanical Garden Websites by Jupiter Website Design"
    },
    {
      "url": "https://114251.blackbaudhosting.com/114251/register",
      "text": "Mounts Botanical Garden Toggle navigation Register Sign in Email: Password: Remember me Forgot your password? Click here to register. Invalid Not Matching The password must be at least 12 characters in length and must contain at least one numeric, one special character (such as $, #, %, *) and one lowercase letter or one uppercase letter. The password cannot contain your name(s), username or organisation name in any text direction. Language Armenian Azerbaijani Basque Belarusian Bulgarian Catalan Chinese (Simplified) Chinese (Traditional) Croatian Czech Danish Dutch English Estonian Filipino Finnish French Galician Georgian German Greek Haitian Creole Hebrew Hindi Hungarian Icelandic Indonesian Irish Italian Japanese Korean Latvian Lithuanian Macedonian Malay Maltese Norwegian Persian Polish Portuguese Romanian Russian Serbian Slovak Slovenian Spanish Swahili Swedish Thai Turkish Ukrainian Urdu Vietnamese Welsh Yiddish Home Registration Register to receive any member discounts or benefits using the email address we have on file for your membership. If you are not sure what email address we have on file for you, email us for assistance at mountsmembership@pbcgov.org. Registration Details Title: Dr. Mr. Mrs. Ms. Rabbi Rev First name: Last name: Email: Phone: Country: Argentina Australia Austria Belgium Brazil Canada Denmark Finland France Germany Greece Hong Kong India Ireland Israel Italy Japan Luxembourg Mexico Netherlands New Zealand Norway Poland Portugal Singapore Spain Sweden Switzerland Taiwan United Arab Emirates United Kingdom United States Address: City: State: <Please Select> AA AE AK AL AP AR AS AZ CA CO CT CZ DC DE FL FM GA GU HI IA ID IL IN KS KY LA MA MD ME MH MI MN MO MP MS MT NC ND NE NH NJ NM NV NY OH OK OR PA PR PW RI SC SD TN TX UT VA VI VT WA WI WV WY ZIP: Username & password Username: Password: Invalid Confirm password: Not Matching The password must be at least 12 characters in length and must contain at least one numeric, one special character (such as $, #, %, *) and one lowercase letter or one uppercase letter. The password cannot contain your name(s), username or organisation name in any text direction. HOURS 9am-3pm (June-Oct); Tuesday-Sunday, 9am-4pm (Nov-May); last entry is an hour before closing. Closed Monday and holidays CONTACT 531 North Military Trail West Palm Beach, Fl 33415 Mounts Office: (561) 233-1757 © 2022 Mounts Botanical Garden STAY CONNECTED MBG Newsletter Sign Up Now Volunteer Sign In | Member Register/Sign In Privacy Policy If you don’t know what your membership e-mail is, please call our Membership Department at 561.233.1757 or email us at mountsmembership@pbcgov.org . Email: Register for new account Password: Forgot password Remember me Sign in Current password: New password: New password: Cancel Submit"
    },
    {
      "url": "https://greengarden.sg/contact-us/",
      "text": "Contact Green Garden Group - Landscape company Singapore Skip to content Home Cleaning Services Commercial Cleaning Condominium Cleaning Janitorial Cleaning Services Best Cleaning Contractor Singapore Landscaping Services Tree Cutting Services Recruitment Blog Contact Us Home > Contact Us Contact Us Contact Details Main Office: +65 6747 5301 Phone: +65 9880 3799 Phone: +65 8488 5000 EMAIL US enquiries@greengarden.sg Address 2 Sims Close, Gemini@Sims, #06-10, Singapore 387298 Operating hours Monday to Friday: 9am to 5:30pm (office) Monday to Saturday: 8am to 6pm (operations) Sunday and Public Holidays: Closed About us 2 Sims Close, Gemini@Sims, #06-10, Singapore 387298 Operating hours Monday to Friday: 9am to 5:30pm (office) Monday to Saturday: 8am to 6pm (operations) Sunday and Public Holidays: Closed CALL US Main Office: +65 6747 5301 Phone: +65 9880 3799 Phone: +65 8488 5000 EMAIL US enquiries@greengarden.sg Services Janitorial Cleaning Services Commercial Cleaning Condominium Cleaning Best Cleaning Contractor Singapore Landscaping Services Tree Cutting Services 2025 © Copyright - Green Garden | All Rights Reserved  | Developed by: Rezolva Pte Ltd Home Cleaning Services Commercial Cleaning Condominium Cleaning Janitorial Cleaning Services Best Cleaning Contractor Singapore Landscaping Services Tree Cutting Services Recruitment Blog Contact Us"
    },
    {
      "url": "https://www.mounts.org/garden-staff/",
      "text": "Garden Staff - Mounts Botanical Garden of Palm Beach County visit Visitor Information Purchase Tickets Summer Family Fun Treasure Trek MBG Nursery and Garden Thrift Shop Mobile Garden Guide Accessibility Gardens Our Gardens Garden Map Education Teacher Resources GARDENING Gardening Tips Societies and Clubs Environmental Horticulture Ask A UF/IFAS Master Gardener UF/IFAS Gardening Solutions support Membership Donate Volunteer about Mission & Vision History MBG Nursery and Garden Thrift Shop Garden Staff Board of Directors Careers Contact Us Privacy Policy Events Events Calendar Summer Family Fun Seasonal Plant Sales Dogs Day in the Garden Weddings & Events Photo & Video Policies REGISTER Register Search for: Garden Staff Executive Director | James E. May | jmay@pbc.gov Director of Marketing & Communications | Misty Stoller | mstoller@pbc.gov Membership Programs Manager | Rachel Lucas | rlucas@pbc.gov Special Projects Manager, Adult Programming & Tours | April Krebs | akrebs@pbc.gov Retail & Nursery Manager | Mark Jerrett | mjerrett@pbc.gov Horticulture | Palmer Crippen | pcrippen@pbc.gov Digital Marketing & Social Media Specialist | Cristina Stakermann | cstakermann@pbc.gov Aynari Garcia | Education Specialist | agarcia2@pbc.gov Administrative Assistant | Debbie Treccioli | dtreccioli@pbc.gov HOURS Tuesday-Sunday, 9am-4pm; last entry at 3pm. Closed Monday and holidays CONTACT 531 North Military Trail West Palm Beach, Fl 33415 Mounts Office: (561) 233-1757 © 2025 Friends of the Mounts Botanical Garden Websites by Jupiter Website Design"
    },
    {
      "url": "https://www.publicgardens.org/mounts-botanical-garden-of-palm-beach-county-announces-major-additions-to-leadership-team/",
      "text": "Mounts Botanical Garden of Palm Beach County Announces Major Additions to Leadership Team – APGA Skip to content For Members Instagram Facebook Twitter LinkedIn YouTube Connect Find a Garden Go Public Gardens Plant Heroes Public Garden Magazine Advertise in Public Garden Association Store Join Membership Institutional Membership Corporate Membership Allied Membership Individual Membership Discover Events Annual Conference Plant Collections Network Showcase About the Program Career Center Post a Job Recruiting & Hiring About Our Mission Strategic Plan Our History Core Values I.D.E.A. Our Work Collective Impact Our Programs Advocacy Annual Awards Our Partners Financial Data Our People Our Staff Our Leadership Media & Association FAQs Giving Opportunities DONATE NOW Search for: Search for: Home / News / Mounts Botanical Garden of Palm Beach County Announces Major Additions to Leadership Team Mounts Botanical Garden of Palm Beach County Announces Major Additions to Leadership Team Mounts Botanical Garden of Palm Beach County Announces Major Additions to Leadership Team People and Gardens November 28, 2023 View Larger Image West Palm Beach, FL – November 28, 2023 : Rochelle Wolberg , Curator/Director of Mounts Botanical Garden , Palm Beach County’s oldest and largest public garden, today announced two major additions to the nonprofit organization’s leadership team: Marc Birch, Operations Manager Formerly the Social Enterprise & Business Development Manager at Gulfstream Goodwill Industries, Birch brings more than 25 years of nonprofit experience in fundraising/development, special events, and operations. A graduate of the French Culinary Institute, in his new position at Mounts he will oversee the Garden’s operations, including the welcome center, gift shop, nursery, adult and youth programming, garden events, and special projects. Tish Sheesley, Development Officer A former Associate Director of Philanthropy at Bok Towers Gardens in Lake Wales, Florida, where she led the start-up of the Annual Fund program, including the creation of the successful campaign, “LOVE It? Fund It!” She also was responsible for direct mail campaigns, a biannual glossy magazine, and fundraising efforts based on wealth management data. Sheesley previously served top leadership roles of the Charlotte Arts Council in Punta Gorda, Florida; the Science & Discovery Center in Panama City, Florida; the Fort Myers Imaginarium Science Center; and the Florida Adventure Museum in Punta Gorda.  She earned her Museum Studies Certification from Northwestern University in Chicago and has been accepted into the 2024 Leadership Class of West Palm Beach. At Mounts, she will direct the Garden’s development and membership efforts. “Both Marc Birch and Tish Sheesley are talented, insightful professionals with extensive experience promoting valuable nonprofit organizations and they will be invaluable assets for Mounts Botanical Garden, as we continue to grow and develop a new strategic direction and master plan for our beautiful 20-acre oasis, located just minutes from downtown West Palm Beach,” says Wolberg. “We are now embarking on the exciting next chapter of the Garden’s growth as we develop a new strategic plan that will serve as our roadmap to the future—where we are going in the years to come and how we will get there,” adds Rebecca Doane , long-time board member and President of Friends of the Mounts Botanical Garden. “We want Mounts Botanical Garden to be top of mind as one of Palm Beach County’s unique attraction as a living museum and one of the region’s true cultural gems.” About Mounts Botanical Garden of Palm Beach County: With a mission to inspire and educate through nature, Mounts Botanical Garden is Palm Beach County’s oldest and largest botanical garden. Visitors to this 20-acre tropical oasis will see an acclaimed collection of 25 unique garden areas containing more than 7,000 species of tropical and sub-tropical plants, including Florida natives, exotic and tropical fruit trees, herbs, palms, roses, cactus, bromeliads and much more. Mounts Botanical Garden is part of the Palm Beach County Cooperative Extension Department, in partnership with the University of Florida and the non-profit Friends of the Mounts Botanical Garden. This project is sponsored in part by The Board of County Commissioners, the Tourist Development Council, and the Cultural Council for Palm Beach County. Mounts Botanical is located at 531 North Military Trail in West Palm Beach. For more information, please visit www.mounts.org . RELATED NEWS: People and Gardens Idaho Botanical Garden Breaks Ground on 10-acre Expansion Project September 9, 2025 BOISE, ID - September 9, 2025 — The Idaho Botanical Garden has officially broken ground on the first phase of... READ MORE People and Gardens Lan Su Chinese Garden Celebrates 25 Years with World-Class Suzhou Artists, $6 Retro Admission, and Community Festivities September 8, 2025 Portland, OR — September 8, 2025 — Exactly 25 years ago this week, Lan Su Chinese Garden opened its gates,... READ MORE People and Gardens Reeves-Reed Arboretum Breaks Ground on Landmark Accessibility Project “A Path for All” September 6, 2025 SUMMIT, NJ - September 6, 2025 — Reeves-Reed Arboretum has officially broken ground on “A Path for All,” a transformative... READ MORE People and Gardens APGA Joins Coalition in Support of IMLS September 4, 2025 [fusion_builder_container type=\"flex\" hundred_percent=\"no\" equal_height_columns=\"no\" hide_on_mobile=\"small-visibility,medium-visibility,large-visibility\" background_position=\"center center\" background_repeat=\"no-repeat\" fade=\"no\" background_parallax=\"none\" parallax_speed=\"0.3\" video_aspect_ratio=\"16:9\" video_loop=\"yes\" video_mute=\"yes\" border_style=\"solid\"][fusion_builder_row][fusion_builder_column type=\"1_1\" type=\"1_1\" background_position=\"left top\" border_style=\"solid\"... READ MORE Close product quick view × Title We champion and advance public gardens as leaders, advocates, and innovators in the conservation and appreciation of plants. Toggle Navigation Home Grant Applications Financial Reports Our Partners Terms of Use Contact Quick Links Toggle Navigation Events Garden Scholars Find A Mentor Find A Garden Disaster Readiness Preferred Partners Toggle Navigation Donate Now Join Login American Public Gardens Association 1207 Delaware Ave #350 Wilmington, DE, 19806 Ph: 610.708.3010 info@publicgardens.org Copyright © 2024 American Public Gardens Association. All Rights Reserved Page load link"
    },
    {
      "url": "https://fwbg.org/about-us/",
      "text": "About Us | Fort Worth Botanic Garden | BRIT Skip to main content Get Tickets View Map Fort Worth Botanic Garden Get Tickets Closed 8 a.m. - 6 p.m. Last entry: 5 p.m. Last entry is at 5:00 p.m. All tickets sold after will be for the next day. See All Hours The last photography pass will be sold two hours before closing. Please heed safety tips by staying hydrated and pacing yourself while outdoors. Photography Pass Menu Toggle menu Membership Private Events Volunteer Calendar Tours Blog FAQs About FWBG Membership Portal Our Staff Join Our Team Contact Us Private Events Volunteer Tours Memberships Starts September 13, 2025 ¡Celebramos! Learn More Visit Overview Admissions and Hours Directions & Parking Accessibility Garden Etiquette Tours Interactive Map Dining & Gift Shops Photography Garden Shuttle Master Plan FAQs Interactive Map Interactive Map Admission & Hours September 13, 2025 Free Admission Day! FWBG’s free admission days are an invitation for all to explore this 120-acre sanctuary of nature in the middle of the city. No tickets are needed, simply arrive during Garden hours. *Free admission days are for general admission tickets only. Group ticket sales, special events, and classes are not included. Learn More Events Full Calendar For Adults For Kids Free Admission Days Members-Only Events Dog-Friendly Events Private Events ¡Celebramos! Tequila-Rita Festival September 13 ¡Celebramos! Tequila-Rita Festival ¡Celebramos! Starts September 13, 2025 ¡Celebramos! Monthly, 2025 Gentle Yoga Join our recurring all-level yoga class to move, stretch, and awaken your mind and body. You’ll learn unique connections within the body to increase muscle elasticity, loosen joints, and gain flexibility. Register Now Gardens All Gardens Fuller Garden Backyard Vegetable Garden Four Seasons Garden Trial Garden Garden Explorer Japanese Garden Japanese Garden Rose Garden Rose Garden Rainforest Conservatory Rainforest Conservatory Take Action! 30 Days for Nature Join Fort Worth Botanic Garden and TRWD (Tarrant Regional Water District) on our 30 Days for Nature challenge and receive practical, daily steps to support local biodiversity and environmental health. Learn More Learn Overview Children & Family Programs School Programs Adult Education Upcoming Classes Upcoming Classes Camps Camps Field Trips Field Trips Monthly Drawing in the Garden Discover and polish your drawing skills at the Garden! Bring your favorite portable medium and explore a new artistic focus each month. Register Now Science Overview & Programs BRIT Herbarium BRIT Library BRIT Press Volunteer at BRIT Tour BRIT Herbarium BRIT Library Catalog Botanical Research Institute of Texas A Growing Future We’re thrilled you’re here, and we can’t wait to share all the exciting research and data in the coming weeks. Stay tuned for more images, discoveries, and updates as we continue to cultivate our online content. More Links Membership Private Events Volunteer Calendar Tours Blog FAQs About FWBG Membership Portal Our Staff Join Our Team Contact Us Closed 8 a.m. - 6 p.m. Closed 8 a.m. - 6 p.m. Last entry is at 5:00 p.m. All tickets sold after will be for the next day. See All Hours The last photography pass will be sold two hours before closing. Please heed safety tips by staying hydrated and pacing yourself while outdoors. Photography Pass 68° Clear, Sunny H:94° L:65° Donate Membership Get Tickets Most Searched Japanese Garden Japanese Fall Fest Membership Dog Days Staff What's in Bloom BRIT Library Collection BRIT Participation BRIT Plant Identification Acquisitions, Loans, and Exchanges Herbarium Curation Projects About Us Explore, Discover & Engage Welcome to the Fort Worth Botanic Garden, the iconic living museum, family destination, educational institution, and research center. The new organization brings together BRIT’s fundraising, education, and world-class research capabilities with the Garden’s historically significant grounds, event facilities, and horticultural expertise. Together, FWBG will create one of the leading public gardens in America. Our Mission The Mission of Fort Worth Botanic Garden is to: To explore the critically important world of plants, collaborate to discover the role they play in our cultural and natural environments, and engage people to conserve nature and improve the human experience. Our Vision Our Vision reflects our highest aspirations: To be renowned globally and treasured locally for exceptional and influential research, horticulture, and education. Our History The Fort Worth Botanic Garden, established in 1934, holds the distinction of being Texas’s oldest major botanic garden. Built during the Great Depression, the Garden was part of an initiative to beautify the community while providing much-needed jobs for unemployed residents of Fort Worth. Landmarks like the Rose Garden and Rock Springs remain as enduring tributes to the dedication and hard work of those individuals. As the Garden expanded to span 110 acres in the heart of the Cultural District, the City of Fort Worth managed its operations, transforming it into a cherished landmark enjoyed by generations of Texans. BRIT’s Role in Garden Stewardship The Botanical Research Institute of Texas (BRIT) was founded in 1987 as a nonprofit organization, initially tasked with preserving an extensive plant collection and library acquired from Southern Methodist University. This collection included 450,000 preserved plant specimens and 75,000 botanical books. Over the years, BRIT has evolved into a renowned research institution, boasting state-of-the-art laboratories, a seed bank for plant conservation, a publishing division, and an impressive collection of 1.5 million plant specimens. On October 1, 2020, BRIT and the Fort Worth Botanic Garden merged into a single nonprofit organization. While the City of Fort Worth retains ownership of the Garden’s land and most buildings, excluding the BRIT Research facility, BRIT now oversees all aspects of the Garden management. Today, the Fort Worth Botanic Garden stands as a stunning haven of natural beauty and a living museum. It is also a hub of scientific discovery, where researchers work to deepen our understanding of plants and their vital role in sustaining the environment. Facts 120 acres featuring 23 specialty gardens 2500+ species of plants on display 1.5 million plant specimens preserved in the BRIT Herbarium 125,000 volumes of research books and journals 13,000+ students, educators and families served by Family Education programs every year Our Leadership Our Staff Carousel items Patrick Newman President & CEO Administration                                            Leadership About Patrick Bob Byers Vice President of Special Projects Administration                                            Leadership About Bob Keri McNew Barfield Chief Financial Officer Finance                                            Leadership About Keri Peter Fritsch, Ph.D. Vice President of Research & Conservation Leadership                                            Research & Collections About Peter Ashton Faulds Vice President of Marketing & Communications Leadership                                            Marketing About Ashton Amy T. Hollenshead Vice President of Learning & Engagement Education                                            Leadership About Amy Sara Richardson, CFRE Vice President for Advancement Advancement                                            Leadership About Sara Keith Brock Senior Director of Horticulture Horticulture                                            Leadership About Keith Stephanie Sellers Senior Director of Guest Experience Guest Services                                            Leadership About Stephanie Greg Gunn Director of Facilities Facilities                                            Leadership About Greg Show previous items Show next items Show previous slide Show next slide 2025 BRIT Foundation Board of Directors Mr. Ed Bass Service start: 2017 Director Company: President, Fine Line, Inc. Mr. Aaron Bigbee Service start: 2025 Director Company: Chief Investment Officer, Rainwater Charitable Foundation Mr. James Day Service start: 2020 Board Secretary Company: Commercial Banking Manager, FW Region Amegy Bank of Texas Mr. Charles Denison Service start: 2021 Board President Company: Senior Portfolio Manager, Argent Financial Group, Inc. Ms. Becky Grimmer Service start: 2022 Director Company: Chief Financial Officer, All Saints’ Episcopal School of Fort Worth Mr. Bond Malone Service start: 2022 Director Company: Chief Financial Officer, Folsom Point Companies APPOINTEES Ms. Keri Barfield Service start: 2025 Treasurer* Company: Chief Financial Officer, Fort Worth Botanic Garden Ms. Hannah Rodriguez Service start: 2025 Assistant Secretary* Company: Executive Assistant, Fort Worth Botanic Garden *Non-voting member 2025 BRIT Operating Board of Directors Mr. John Avila Service start: 2025 Committee Chair: Advancement Compay: Chairman, Thos S. Byrne LTD Mr. Ed Bass Service start: 1995 Board Vice Chairperson Finance & Audit Committee Company: President, Fine Line, Inc. Mr. Billy Brentlinger Service start: 2013 Imm. Past Chair Company: Founder, Advanced Growers Solutions Mr. Greg Fitzgerald Service start: 2024 Committee Chair: Education Company: Community Volunteer Mr. Craig Hamilton Service start: 1996 Board Treasurer Company: Community Volunteer Mr. Mike Malone Service start: 2020 Committee Chair: Nominating & Governance Company: Shareholder, Greenberg Traurig, LLP. Ms. Estela Martinez Service start: 2023 Committee Chair: Marketing Company: Dir. Leisure Sales & Hispanic Partnerships, Visit Fort Worth Ms. Kristy Odom Service start: 2023 Board Chairperson Company: Community Volunteer Ms. Debbie Reynolds Service start: 2021 Committee Chair: Horticulture Company: Community Volunteer Mr. Terry Siegel Service start: 2016 Committee Chair: Facilities & Operations Company: President/CEO, Ventamatic, Ltd. Mr. William Welder Service start: 2020 Board Secretary Company: Founding Principal, Scissortail Group Mrs. Amy Allen Service start: 2025 Director Company: Partner, Whitley Penn Mr. Andrew Allsup Service start: 2025 Director Company: Associate, 2112 Capital Mr. Brad Barnes Service start: 2010 Director Company: President & General Manager, Southwestern Exposition & Livestock Show Mr. Greg Bird Service start: 2011 Director Company: President, Jetta Operating Co., Inc. Mr. Steve Brauer Service start: 2021 Director Company: Executive Vice President, Hunter Engineering Mr. Kacey Cornelius Service start: 2021 Director Company:SVP Commercial Banking, Frost Bank Ms. Elizabeth Cornelsen Service start: 2023 Director Company: Community Volunteer Mr. Jon Cranz Service start: 2024 Director Company: Partner, Kelly Hart & Hallman LLP Dr. Nowell Donovan Service start: 2006 Director Emeritus* Company: Adjunct Professor, Texas Christian University Mr. Bourke Harvey Service start: 2024 Director Company: President, Harvey Holdings Dr. Doc Holliday Service start: 2025 Director Company: Doctor of Dental Medicine, Owner, Let it Shine Dental Ms. Carole Jordan Service start: 2025 Director Company: Retired Vice President/Co-Founder, Mozzarella Company Mr. Clark Kemble Service start: 2023 Director Company: Managing Partner, Mediserv Ms. Gail Landreth Service start: 2024 Director Company: Community Volunteer, Fort Worth Garden Club Mrs. Elizabeth McCarthy Service start: 2025 Director Company: Community Volunteer Ms. Jesica McEachern Service start: 2024 Advisory Director* Company: Assistant City Manager, City of Fort Worth Mr. Derick Mesch Service start: 2025 Director Company: Managing Partner, Mesch, PLLC Ms. Debbie Morrison Service start: 2025 Director Company: Community Volunteer Capt. Bob O’Kennon Service start: 1995 Director Emeritus* Company: Community Volunteer Mr. Pat Reddell Service start: 2021 Director Company: Senior Portfolio Manager, Senior Vice President, The Money-Sense Team at Morgan Stanley Ms. Elizabeth Waddill Service start: 2023 Director Company: Community Volunteer *Non-voting member 2025 BRIT Landowner Board of Directors Ms. Colleen Blair Service start: 2024 Board President Company: Community Volunteer Mr. Craig Elam Service start: 2024 Board Secretary Company: Community Volunteer Ms. Mary Keller Service start: 2024 Vice President Company: Community Volunteer Mr. Richard Zavala Service start: 2018 Advisory Director* Company: Director of Parks & Recreation Department, City of Fort Worth APPOINTEES Ms. Keri Barfield 2025 Treasurer* Company: Chief Financial Officer, Fort Worth Botanic Garden Ms. Hannah Rodriguez 2025 Assistant Secretary* Company: Executive Assistant, Fort Worth Botanic Garden *Non-voting member Operating Board of Directors Carousel items Kristy Odom Board Chair Edward P. Bass Co-Founder BRIT, Vice Chair of the Board Debbie Reynolds Chair, Horticulture Committee William Welder Secretary of the Board Michael L. Malone Director Elizabeth Conn Waddill Director H. Terry Siegel Chair, Facilities & Operations Committee Patrick Reddell Director Debbie Morrison Director Frederick Mesch Director Jesica McEachern Advisory Director Elizabeth McCarthy Director M. Estela Martinez de Stuart Director Gail Widmer Landreth Director G. Clark Kemble Director Carole Jordan Director Marie Holliday Director Bourke Harvey Director Robert “Gregory” Fitzgerald Director R. Nowell Donovan, Ph.D. Director Emeritus Jonathan Cranz Director Elizabeth Northern Cornelsen Director Kacey Cornelius Director Steven Brauer, Jr Director Gregory A. Bird Director Bradford Barnes Director John Avila, Jr. Chair, Advancement Committee Andrew Allsup Director Amy Allen Director Craig Hamilton Board Treasurer William A. Brentlinger Immediate Past Chair Show previous items Show next items Show previous slide Show next slide Foundation Board Carousel items Edward P. Bass Co-Founder BRIT, Vice Chair of the Board Rebecca Grimmer Director James Day Secretary of the Board Robert Bond Malone Director Aaron Lee Bigbee Director Charles Denison President of the Board Show previous items Show next items Show previous slide Show next slide Landowner Board Carousel items Mary Keller Vice President of the Board Craig Elam Secretary of the Board Richard Zavala Advisory Director Colleen Blair President of the Board Show previous items Show next items Show previous slide Show next slide Visit Us Take a stroll through our beautiful 120-acre campus. The Garden is open seven days a week from 8:00 a.m. to 5:00 p.m. with the last admission an hour before closing. The last photography pass is sold two hours before closing. Get Tickets Plan a Visit Private Events Volunteer More ways to get involved with the Fort Worth Botanic Garden Memberships Donate Volunteer Be Among the First to Know What’s Next Get the latest news, announcements, and more about Fort Worth Botanic Garden, the most immersive and innovative space we’ve ever created. * indicates required Email Address * First Name Last Name By clicking submit, you agree to the Privacy Policy . FWBG Home About Us Fort Worth Botanic Garden Get Tickets 3220 Botanic Garden Blvd. Fort Worth, TX 76107 (817) 463-4160 | admissions@fwbg.org Members: 7:00 a.m. – 6:00 p.m. Public: 8:00 a.m. – 6:00 p.m. Last entry at 5:00 p.m. See All Hours Facebook Instagram LinkedIn TikTok X YouTube Botanical Research Institute of Texas 1700 University Drive Fort Worth, Texas 76107 (817) 332-4441 We honor the ancestry, heritage, and gifts of all Indigenous Peoples who were sustained by these lands and give thanks to them. Learn more Plan Your Visit Overview Admission and Hours Directions & Parking Interactive Map Accessibility Tours FAQs Events Full Calendar For Adults For Children Private Events Free Admission Days Dog Days Gardens All Gardens Japanese Garden Rose Garden Rainforest Conservatory Fuller Garden Backyard Vegetable Garden Learn Overview Children & Family Adult Education School Programs Camps Field Trips Science Overview Herbarium BRIT Library BRIT Library Catalog Tour the BRIT Shop BRIT Press Journal of BRIT Volunteer at the BRIT Give Ways to Give General Giving Join Giving Circle Volunteer Corporate Partnerships Membership Overview Become a Member Membership Portal Renew Membership Membership FAQs FWBG About Us Master Plan Biennial Report Our Staff Careers Business Opportunities Contact Us ©2025 Fort Worth Botanic Garden, All Rights Reserved Privacy Policy | Terms & Conditions | Cookie Preferences"
    },
    {
      "url": "https://www.missouribotanicalgarden.org/about/additional-information/contact-us",
      "text": "Contact Us Tickets Menu Get Tickets Directions Hours Tickets $16.00 General Admission Ages 13 and up Free Members Admission All ages $6.00 STL Resident Rate $4.00 Seniors 65+ | Proof of residency required. Scout Programs School Groups Join Donate Make a Donation Commemorative Giving Planned Giving Corporate Partners Become a Member Plan Your Visit The Garden Hours & Admission Getting Here Map Tours Groups Book Your Private Event Shop & Dine Garden Gate Shop Sassafras Restaurant and Cafe Gift Cards Little Shop Around the Corner MBG Press Top Attractions Climatron Japanese Garden Children's Garden Tram Tours Arid House Sachs Museum Tower Grove House Things To Know Accessibility Garden Etiquette Photography Sustainability Picnicking Smoking Prohibited Items Today's Hours 9 a.m.–5 p.m.\nLast entry at 4:30 p.m. Events & Classes Next Event or Class Extended Evening Hours Thursday, September 11 5:00 PM - 8:00 PM Upcoming Events & Classes Shaw Nature Reserve: Nature in Focus Saturday, February 1 - Wednesday, December 31 9:00 AM - 5:00 PM Smelling the Bouquet: Plants & Scents in the Garden Friday, May 2 - Tuesday, March 31 11:30 AM - 4:30 PM Fall Class Registration Monday, August 4 - Saturday, November 15 12:00 AM - 12:00 AM View Full Calendar Plant Finder Give Us a Call (314) 577-5100 Login Tickets Menu Menu What’s In Bloom Read Our Blog Join Our Team Book A Private Event Plan A Birthday Party Shop About the Garden Learn & Discover Gardens & Gardening Science & Conservation Sustainability Volunteer Contact Us Additional Information President's Welcome Our Mission Commitment to Diversity Our History Henry Shaw Missouri Botanical Garden and Slavery Presidents Emeriti Board of Trustees Annual & Strategic Reports Zoo-Museum District Donation Requests Internships Volunteer Careers Benefits Overview How to Apply Open positions Contact Us Comments on a Recent Garden Visit If you've visited the Garden recently and have questions or comments to share, please complete our post-visit survey . General Questions For questions about visiting the Garden, events, ticketing, trams, etc., please reach out to the Garden's Contact Center at (314) 577-5100 (available Monday through Friday, 9 a.m.–5 p.m.) or email contact@mobot.org . Horticulture Answer Service Do you have a gardening question? Email it to plantinformation@mobot.org . Please allow up to 7 business days for a reply. Alternatively, you may call our Horticulture Answer Service at (314) 577-5143, Monday–Friday, 9 a.m. to noon (CST). Green Resources Whatever your question, the Garden's sustainable-living experts are at your service! Find green products and services, evaluate green claims and plan your green home or lifestyle project by contacting us today at greenresources@mobot.org or (314) 577-0246. Subscribe to the Garden e-Newsletter Sign up to receive Garden updates via email. Subscribe Follow the Garden on Social Media Get the latest Garden news, photos and more by connecting with the Garden on social media: Compliments, concerns, and general public communications to the Garden Visitor comments, complaints and compliments are received via the Garden’s website, social media outlets, on-site comment cards and by phone. Phone calls generally originate with the Garden’s operator or via the Garden’s Communications Division. Any elevated concerns are forwarded to the Sr Vice President of Communications or Senior Communications Officer for facts to be gathered and for the situation to be discussed with the caller. Appropriate Division heads and HR representatives are involved, as appropriate, at that time. General comments from the website or social media outlets are sent to the appropriate Division head, if so merited. Comment cards, phone calls or other communications involving an incident of harassment or discrimination are recorded in the communications division, forwarded to and discussed with the appropriate division head and resolved under the supervision of the Senior Vice President of Communications. The Garden’ s rigorous, ZERO TOLERANCE policies on harassment and discrimination are brought to bear on all such resolutions. Such complaints, additionally, are elevated to the President and Executive Vice-President of the institution. General Questions or Comments * = Required fields. Your First Name: Your Last Name: Your Email Address: * Are you a Garden member?: No Yes General Question 500 characters limit: * : * Submit Clear Form Contact Information General Garden: (314) 577‑5100 Toll free 1-800-642-8842 Sassafras Restaurant: Daily, 10:30 a.m. to 3 p.m. Email Catering St. Louis Bellwether Café: Daily, 9 a.m. to 4:30 p.m. Email Catering St. Louis Garden Gate Shop: (314) 577-5137 Daily, 9 a.m. to 5:30 p.m. Gardening Help: (314) 577-5143 Weekdays, 9 a.m. to noon Green Resources: (314) 577-0246 Email Departments and Divisions Archives: (314) 577-5158 Children's Education: (314) 577-5140 Communications: (314) 577-0286 Continuing Education: (314) 577-9506 Corporate Partners: (314) 577-9513 EarthWays Center: (314) 577-0220 Facility Rental: (314) 577-0200 Group Sales: Inquiry Form Institutional Advancement: (314) 577-9500 Library: (314) 577-5155 Membership: (314) 577-5100 Planned Gifts: (314) 577-5173 Security (Lost & Found Desk): (314) 577-0212 Ticketing: (314) 577-5100 Tribute Gifts: (314) 577-5100 Wedding Ceremonies & Receptions: Email For a directory of science and conservation staff, click here Tickets Join Donate Plan Your Visit Events & Classes Volunteer Careers Media Contact Us Missouri Botanical Garden 4344 Shaw Blvd, St. Louis, MO 63110 (314) 577-5100 Hours & Admission Butterfly House 15050 Faust Park Chesterfield, MO 63017 (314) 577-0888 Hours & Admission Shaw Nature Reserve 307 Pinetum Loop Rd, Gray Summit, MO 63039 (314) 577-9555 Hours & Admission Thank You! The Garden wouldn't be the Garden without our Members, Donors, and Volunteers. Become a Member Copyright ©2018 - 2025 by Missouri Botanical Garden. All rights reserved. Privacy Statement Terms Of Use Affiliations Login"
    },
    {
      "url": "https://www.mounts.org/volunteer/",
      "text": "Volunteer - Mounts Botanical Garden of Palm Beach County visit Visitor Information Purchase Tickets Summer Family Fun Treasure Trek MBG Nursery and Garden Thrift Shop Mobile Garden Guide Accessibility Gardens Our Gardens Garden Map Education Teacher Resources GARDENING Gardening Tips Societies and Clubs Environmental Horticulture Ask A UF/IFAS Master Gardener UF/IFAS Gardening Solutions support Membership Donate Volunteer about Mission & Vision History MBG Nursery and Garden Thrift Shop Garden Staff Board of Directors Careers Contact Us Privacy Policy Events Events Calendar Summer Family Fun Seasonal Plant Sales Dogs Day in the Garden Weddings & Events Photo & Video Policies REGISTER Register Search for: Volunteer Welcome to Mounts Botanical Garden, where nature thrives and volunteers flourish! We invite you to join our community dedicated to cultivating beauty, education, and environmental stewardship. By volunteering with us, you’ll not only enrich your own life, but also contribute to the preservation of our precious botanical garden. Why Volunteer with Us? At Mounts Botanical Garden, we believe that volunteers are the heart of our organization! Here are just a few reasons why volunteering with us is a rewarding experience: 1. Connect with Nature : Immerse yourself in the natural beauty of 25 stunning garden areas spanning 20 acres. From lush tropical landscapes, to serene water features, there’s always something new to discover and explore. 2. Make a Difference : Join a passionate community dedicated to education for youth and adults, nature exploration, and environmental conservation. Whether you’re planting native species, leading guided tours, or assisting with special events, your efforts directly contribute to the preservation and growth of the Garden. 3. Learn and Grow : Gain valuable knowledge and skills in horticulture, visitor services, and more from our expert staff and fellow volunteers. Whether you’re an experienced volunteer or just starting, there are opportunities for everyone to learn and grow. 4. Forge Meaningful Connections : Connect with like-minded individuals who share your love for nature and gardening. Volunteer workdays, social events, and educational workshops provide opportunities to build lasting friendships and networks. Ways to Volunteer At Mounts Botanical Garden, we offer a variety of volunteer opportunities to suit your interests, skills, and schedule: 1. Gardening : Get your hands dirty and help maintain our beautiful gardens by planting, weeding, pruning, and watering under the guidance of our skilled staff and horticulturists. 2. Tour Guides : Share your passion for plants and ecology by becoming a tour guide. Lead visitors on informative and engaging tours, and share fascinating stories and insights about our diverse plant collections. 3. Events : Work with the public or behind the scenes to support special events, including plant sales, family events, fundraising events, and more. Help with decorations, admissions, craft and science activities, or the Garden’s information booth. 4. Educational Programs: Engage visitors of all ages through classes, workshops, youth camps, and more. You’ll assist in educational activities that inspire and educate visitors about the wonders of nature and the importance of conservation. 5. Visitor Services: Welcome guests with a warm smile, provide information, and ensure they have a memorable experience exploring the Garden. 6. Administrative Support : Provide valuable administrative support by assisting with office tasks, data entry, and customer service, helping to ensure the smooth operation of our organization. How to Volunteer Getting involved is easy! Simply fill out our online volunteer application form, and our volunteer coordinator will be in touch with you shortly to discuss available opportunities and next steps. You must be at least 16 years old to volunteer at Mounts Botanical Garden. We do not accept court order volunteer hours. Thank you for considering volunteering with us. We look forward to welcoming you to the Mounts Botanical Garden family! Together, we can nurture the beauty of nature and inspire generations to come! To learn more about volunteering opportunities or to sign up, please contact Debbie Treccioli at dtreccioli@pbc.gov or 561-233-1733. HOURS Tuesday-Sunday, 9am-4pm; last entry at 3pm. Closed Monday and holidays CONTACT 531 North Military Trail West Palm Beach, Fl 33415 Mounts Office: (561) 233-1757 © 2025 Friends of the Mounts Botanical Garden Websites by Jupiter Website Design"
    },
    {
      "url": "https://www.mounts.org/members-faq/",
      "text": "Members FAQ - Mounts Botanical Garden of Palm Beach County visit Visitor Information Purchase Tickets Summer Family Fun Treasure Trek MBG Nursery and Garden Thrift Shop Mobile Garden Guide Accessibility Gardens Our Gardens Garden Map Education Teacher Resources GARDENING Gardening Tips Societies and Clubs Environmental Horticulture Ask A UF/IFAS Master Gardener UF/IFAS Gardening Solutions support Membership Donate Volunteer about Mission & Vision History MBG Nursery and Garden Thrift Shop Garden Staff Board of Directors Careers Contact Us Privacy Policy Events Events Calendar Summer Family Fun Seasonal Plant Sales Dogs Day in the Garden Weddings & Events Photo & Video Policies REGISTER Register Search for: Members FAQ Welcome Members! We created this portal to help you navigate our new Registration and Sign In System and to provide answers to Frequently Asked Questions. How to Start First, you need an online account so our system can match your member record with your registration. Our system uses your email address to identify you; be sure to use the same email address you used to purchase your membership. If you are not sure what email address we have on file for you, email us for assistance. You can create your online account HERE . Register for a Program Select your class, tour, or event and click the BUY TICKETS button. Then sign in to your online account by clicking the “Sign In” label at the top of the screen. A window will pop up for you to enter your email and password. Once you are signed in, enter the number of tickets you are buying and click “Register.” Enter your information and click “add to cart.” On the next screen, you will see your member discount deducted from the full price. If you wish to make changes or to cancel your recurring payment method, please contact Rachel Lucas, Membership Programs Manager at 561-233-1755 or rlucas@pbcgov.org. HOURS Tuesday-Sunday, 9am-4pm; last entry at 3pm. Closed Monday and holidays CONTACT 531 North Military Trail West Palm Beach, Fl 33415 Mounts Office: (561) 233-1757 © 2025 Friends of the Mounts Botanical Garden Websites by Jupiter Website Design"
    },
    {
      "url": "https://www.theatrenantucket.org/about-us/staff-and-board-of-directors",
      "text": "Team SUPPORTÂ US BUY TICKETS SHOWS & TICKETS 2025 SEASON SEASON SUBSCRIPTIONS & GIFT CARDS WHAT TO EXPECT AT THE THEATRE PAST SEASONS GALLERY ABOUT US OUR MISSION & HISTORY STAFF AND BOARD OF DIRECTORS JOBS & VOLUNTEER OPPORTUNITIES AUDITIONS CONTACT US SPOTLIGHT ON SUPPORT SEASON PRODUCERS BUSINESS SPONSORS BUY TICKETS PRODUCING ARTISTIC DIRECTOR Justin Cerne EXECUTIVE DIRECTOR Bethany Oliver ARTISTIC DIRECTOR EMERITUS John Shea COMPANY MANAGER Emily Dunn THEATRE OPERATIONS Katy Feldhahn AUDIENCE ENGAGEMENT Johannah Johnson RESIDENT COSTUME DESIGNER Casey Sayre Boukus RESIDENT LIGHTING DESIGNER Stephen Petrelli RESIDENT SOUND DESIGNER Tony Wagner BOARD OF DIRECTORS Kay Bernon Beth English Ellie Gottwald, VP* David Handy Cecelia Johnson Holly Johnson David Kaytes, President* Karen Keelan Susan Lucier, Clerk* Linda Mason Jean Doyen de Montaillou Chris Mortenson, Treasurer* Helene Patterson Maureen Phillips, Treasurer Designate* Maria Roach, VP* Lisa Soeder* David Southwell, VP* * Executive Committee EMERITUS DIRECTORS Max N. Berry Barbara L. Elder Toby Greenberg Frank Morral Judith Greenberg Seinfeld THEATRE COUNCIL Rebecca Becker Bruce Beni Jane Forman Kathryn Garre-Ayars Victoria Girvan Jill Karp Peggy Kaufman Christina Rose Manca Terry Schubach Les Silverman FRIENDS OF THE THEATRE Amb. Elizabeth Frawley Bagley Jim Bennett Kate Brosnan Jane Condon Fritz Michel Join Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. EMAIL info@theatrenantucket.org PHONE 508-228-4305 MAILINGÂ ADDRESS POÂ BOX 1297 Nantucket, MA 02554 STAGE Bennett Hall 62 Centre Street VIRTUAL BOX OFFICE Online:Â Â Â www.theatrenantucket.org Email: info@theatrenantucket.org Tickets can be purchased one hour prior to showtime at Bennett Hall."
    },
    {
      "url": "https://www.publicgardens.org/friends-of-the-mounts-botanical-garden-appoints-james-may-as-new-executive-director/",
      "text": "Friends of the Mounts Botanical Garden Appoints James May as New Executive Director – APGA Skip to content For Members Instagram Facebook Twitter LinkedIn YouTube Connect Find a Garden Go Public Gardens Plant Heroes Public Garden Magazine Advertise in Public Garden Association Store Join Membership Institutional Membership Corporate Membership Allied Membership Individual Membership Discover Events Annual Conference Plant Collections Network Showcase About the Program Career Center Post a Job Recruiting & Hiring About Our Mission Strategic Plan Our History Core Values I.D.E.A. Our Work Collective Impact Our Programs Advocacy Annual Awards Our Partners Financial Data Our People Our Staff Our Leadership Media & Association FAQs Giving Opportunities DONATE NOW Search for: Search for: Home / News / Friends of the Mounts Botanical Garden Appoints James May as New Executive Director Friends of the Mounts Botanical Garden Appoints James May as New Executive Director Friends of the Mounts Botanical Garden Appoints James May as New Executive Director People and Gardens October 22, 2024 View Larger Image West Palm Beach, FL – October 22, 2024 – The Friends of the Mounts Botanical Garden proudly announces the appointment of James E. May as its new Executive Director. He was selected through a comprehensive nationwide search and will officially begin his role on November 18, 2024 . Under his leadership, the Garden is poised for a new era of growth. “We are thrilled to welcome Jim as our new Executive Director,” said Scott Scovill , Board President of Friends of the Mounts Botanical Garden. “His extensive track record of transformative leadership, combined with a deep passion for community engagement and operational excellence, makes him the perfect leader for this pivotal moment in our Garden’s journey. As we undertake a new Master Planning process, Jim’s visionary approach will help shape an exciting future of dynamic programs, innovative exhibits, and memorable experiences that will elevate Mounts as a premier destination in Palm Beach County.” May brings decades of non-profit leadership, strategic expertise, and a solid dedication to education, positioning him to lead Mounts into an exciting phase of growth and progress. “I’m ready to lead Mounts Botanical Garden into its next stage of growth,” said May. “We have a tremendous opportunity to strengthen the Garden’s role as a vital community resource by expanding education, launching targeted conservation initiatives, and creating meaningful, immersive experiences for visitors. We’ll enhance our impact on environmental education, tourism, and public engagement by fostering strategic partnerships. Together, we’ll ensure the Garden grows purposefully, deepening its connection to nature and the community we proudly serve while fulfilling its potential as a destination for inspiration and discovery.” With extensive leadership experience in the public and private sectors, May brings a seasoned and forward-thinking approach to his role as Executive Director of Mounts. As Chief of Staff at the Boca Raton Museum of Art, May advanced the museum’s mission through effective leadership, operational management, and careful financial oversight. He led efforts to streamline operations, improve economic performance, and align the museum’s core functions with long-term goals, expanding accessibility and significantly increasing its capacity to serve the public. Building on his extensive experience, May has consistently prioritized sustainable growth, meaningful community engagement, and strong partnerships. As he steps into the leadership role at Mounts, his approach remains focused on purposeful expansion, ensuring the Garden thrives as a premier destination for environmental education, cultural tourism, and community pride. May’s proven ability to secure significant financial support from individuals, foundations, and corporations has been vital to achieving long-term sustainability for the organizations he has served. He is adept at cultivating donor relationships, diversifying revenue streams, and forging partnerships with cultural organizations, schools, and businesses to broaden impact and reach. In his decades of leadership, May has consistently prioritized program development, project management, and quality improvement, spearheading innovative initiatives that engage diverse audiences and support sustainable growth. Named a young leader of note by the Indianapolis Business Journal’s 40 Under Forty, May played a key role in designing, developing, and completing the $105 million Indiana State Museum in downtown Indianapolis. His visionary approach recently shone through at the Boca Raton Museum of Art, where his leadership of the Machu Picchu exhibition tripled membership and significantly boosted the museum’s community presence—the experience he now brings to Mounts, aiming to elevate the Garden’s impact and reach. May has also made significant contributions to the broader museum industry as a reaccreditation peer reviewer for the American Alliance of Museums, helping to advance industry standards and best practices. His financial acumen and innovative leadership have given boards and stakeholders strategic insights—promoting sound business management and driving sustainable growth. A recipient of the Arts Council of Indianapolis’s Creative Renewal Fellowship, May holds a Master of Arts degree in Art History from Indiana University and serves on the advisory panel for the Center for Arts and Innovation. As the new Executive Director of Mounts, May is ready to leverage his extensive experience to craft a bold, forward-looking vision for the Garden’s continued growth. “Mounts has established itself as a leading destination for excellence in education and natural beauty,” said May. “I’m committed to building on this strong foundation, broadening our impact, and enhancing the visitor experience to ensure the Garden continues to thrive.” His vision seeks to build momentum and expand Mounts’ reach, securing its future success. Recognizing the unique public-private partnership that supports Mounts—including Palm Beach County, the University of Florida, and the Friends of the Mounts Botanical Garden 501(c)(3)—May is committed to strengthening these vital collaborations. By fostering a unified vision for the Garden’s future, he seeks to align efforts and amplify each partner’s impact, positioning Mounts for continued excellence. May has built a reputation for aligning programmatic vision with audience needs, elevating engagement, and ensuring institutional relevance. He is dedicated to securing Mounts’ prominent position while delivering significant value to visitors, supporters, and the broader community. May also aims to sustain and strengthen Mounts’ role as a living laboratory for scientific research and a haven for those seeking beauty, tranquility, and restoration. By bridging academic excellence with accessible public programming, he will ensure Mounts continues to inspire everyone, from scientists to casual visitors, securing its future as a place of learning, exploration, and renewal. Mounts Botanical Garden & Bloomberg Connects Explore Anytime, Anywhere with New Mobile Garden Guide Visitors can now explore Mounts Botanical Garden anytime from anywhere across the globe with the new Mobile Garden Guide. Launched in partnership with Bloomberg Connects, the free arts and cultural app created by Bloomberg Philanthropies, the guide elevates and enriches the visitor experience by making it easy to discover more of what people love before, during, and after they visit the Garden. Multi-media content includes maps and information on Mounts Botanical’s 25 display gardens, art in the garden, and current and upcoming exhibitions, as well as an ever-growing spectrum of new photo, audio, and video content available exclusively via the app. To learn more and download the app, visit www.mounts.org/mobile-garden-guide/ . About Mounts Botanical Garden of Palm Beach County: With a mission to inspire and educate through nature, Mounts Botanical Garden is Palm Beach County’s oldest and largest botanical garden. Visitors to this 20-acre tropical oasis will see an acclaimed collection of 25 unique garden areas containing more than 7,000 species of tropical and sub-tropical plants, including Florida natives, exotic and tropical fruit trees, herbs, palms, roses, cactus, bromeliads and much more. Mounts Botanical Garden is part of the Palm Beach County Cooperative Extension Department, in partnership with the University of Florida and the non-profit Friends of the Mounts Botanical Garden. This project is sponsored in part by The Board of County Commissioners, the Tourist Development Council, and the Cultural Council for Palm Beach County. Mounts Botanical Garden is at 531 North Military Trail in West Palm Beach. For more information, please visit www.mounts.org . Attached Image: Photo Credit: Oliver Studios, 2024 James May , Friends of the Mounts Botanical Garden Executive Director Available for Interview: J ames May, Executive Director, Mounts Botanical Garden Media Contact: Gary Schweikhart, PR-BS 561.756.4298 / gary@pr-bs.net RELATED NEWS: People and Gardens Idaho Botanical Garden Breaks Ground on 10-acre Expansion Project September 9, 2025 BOISE, ID - September 9, 2025 — The Idaho Botanical Garden has officially broken ground on the first phase of... READ MORE People and Gardens Lan Su Chinese Garden Celebrates 25 Years with World-Class Suzhou Artists, $6 Retro Admission, and Community Festivities September 8, 2025 Portland, OR — September 8, 2025 — Exactly 25 years ago this week, Lan Su Chinese Garden opened its gates,... READ MORE People and Gardens Reeves-Reed Arboretum Breaks Ground on Landmark Accessibility Project “A Path for All” September 6, 2025 SUMMIT, NJ - September 6, 2025 — Reeves-Reed Arboretum has officially broken ground on “A Path for All,” a transformative... READ MORE People and Gardens APGA Joins Coalition in Support of IMLS September 4, 2025 [fusion_builder_container type=\"flex\" hundred_percent=\"no\" equal_height_columns=\"no\" hide_on_mobile=\"small-visibility,medium-visibility,large-visibility\" background_position=\"center center\" background_repeat=\"no-repeat\" fade=\"no\" background_parallax=\"none\" parallax_speed=\"0.3\" video_aspect_ratio=\"16:9\" video_loop=\"yes\" video_mute=\"yes\" border_style=\"solid\"][fusion_builder_row][fusion_builder_column type=\"1_1\" type=\"1_1\" background_position=\"left top\" border_style=\"solid\"... READ MORE Close product quick view × Title We champion and advance public gardens as leaders, advocates, and innovators in the conservation and appreciation of plants. Toggle Navigation Home Grant Applications Financial Reports Our Partners Terms of Use Contact Quick Links Toggle Navigation Events Garden Scholars Find A Mentor Find A Garden Disaster Readiness Preferred Partners Toggle Navigation Donate Now Join Login American Public Gardens Association 1207 Delaware Ave #350 Wilmington, DE, 19806 Ph: 610.708.3010 info@publicgardens.org Copyright © 2024 American Public Gardens Association. All Rights Reserved Page load link"
    },
    {
      "url": "https://www.mounts.org/membership/",
      "text": "Membership - Mounts Botanical Garden of Palm Beach County visit Visitor Information Purchase Tickets Summer Family Fun Treasure Trek MBG Nursery and Garden Thrift Shop Mobile Garden Guide Accessibility Gardens Our Gardens Garden Map Education Teacher Resources GARDENING Gardening Tips Societies and Clubs Environmental Horticulture Ask A UF/IFAS Master Gardener UF/IFAS Gardening Solutions support Membership Donate Volunteer about Mission & Vision History MBG Nursery and Garden Thrift Shop Garden Staff Board of Directors Careers Contact Us Privacy Policy Events Events Calendar Summer Family Fun Seasonal Plant Sales Dogs Day in the Garden Weddings & Events Photo & Video Policies REGISTER Register Search for: Membership Why Become a Mounts Botanical Member? FREE admission to Garden, Plant Sales & Exhibits FREE digital subscription to MBG Leaflet & Better Homes & Garden magazine FREE admission to 380+ gardens nationwide FREE admission for 1 dog/adult on Dogs’ Days 10% discount at Gift Shop, Nursery & Vintage Thrift Shop Discounts on classes and workshops Advance notice of upcoming events Your membership directly supports horticulture programs, education, art and culture, and garden beautification. Membership Options: Avid Gardener – $60 Garden Family – $95 Garden Steward – $150 Garden Lover – $250 Garden Patron – $500 Gardening Angel – $1,000 Join for 2 Years and Save 10% Membership Benefits For assistance: Rachel Lucas | Membership Programs Manager| 561-233-1755 | rlucas@pbcgov.org AHS Reciprocal Garden Network The Friends of The Mounts Botanical Garden, Inc. is a 501 (c)(3) registered non-profit organization. Contributions are tax deductible to the extent permitted by law. A copy of the official registration (Registration #CH9858) and financial information may be obtained from the Division of Consumer Services by calling toll-free, 1-800-435-7352 within the State of Florida, or online at https://www.freshfromflorida.com/Divisions-Offices/Consumer-Services. Registration does not imply endorsement, approval, or recommendation by the State. All donations received are used to support the mission of the Friends of The Mounts Botanical Garden. HOURS Tuesday-Sunday, 9am-4pm; last entry at 3pm. Closed Monday and holidays CONTACT 531 North Military Trail West Palm Beach, Fl 33415 Mounts Office: (561) 233-1757 © 2025 Friends of the Mounts Botanical Garden Websites by Jupiter Website Design"
    },
    {
      "url": "https://flaglerhealing.com/mounts-botanical-garden-west-palm-beach-fl/",
      "text": "Mounts Botanical Garden, West Palm Beach, FL | Flagler Health And Wellness Call Now Verify Insurance Home About Service Area Tour Facility Our Programs Inpatient Drug And Alcohol Rehab Medical Detox Wellness Practices Dual Diagnosis Evidence Based Therapies Medication Assisted Treatment Detox Programs Cocaine Detox Heroin Detox Alcohol Detox Opioid Detox Meth Detox Benzo Detox Blog Contact Us Home About Service Area Tour Facility Our Programs Inpatient Drug And Alcohol Rehab Medical Detox Wellness Practices Dual Diagnosis Evidence Based Therapies Medication Assisted Treatment Detox Programs Cocaine Detox Heroin Detox Alcohol Detox Opioid Detox Meth Detox Benzo Detox Blog Contact Us Mounts Botanical Garden, West Palm Beach, FL Get Started Call (561) 556-8090 Mounts Botanical Garden in West Palm Beach, FL is a hidden gem that locals and visitors alike can’t help but be enchanted by. Situated in Florida’s bustling cityscape, this stunning garden provides a stunning array of flora and fauna for all to explore. Visitors can learn about plants, wildlife, and more during their visit – making Mounts Botanical Garden a must-visit for anyone in the area. The Mounts Botanical Garden is home to over 2,000 different species of plants. Among these species are exotic trees, flowering shrubs, and a variety of other vegetation. Visitors can take in an array of vibrant colors and fascinating visuals while walking through the garden’s lush pathways and manicured grounds. It’s no wonder why Mounts Botanical Garden is one of the most beloved outdoor attractions in all of West Palm Beach. Learn information about West Palm Beach, FL. Birds, butterflies, and other small creatures frequent Mounts Botanical Garden as well. With the beautiful foliage, it’s the perfect place to catch a glimpse of some of Florida’s native wildlife. There are also convenient picnic areas where one can sit and enjoy the sunshine. Whether you’re looking for a quiet spot to relax or an exciting activity, Mounts Botanical Garden is the perfect destination. In addition to its well-manicured grounds and stunning visuals, Mounts Botanical Garden offers educational programming and events throughout the year. Visitors can learn about plant species and biology through interactive lectures, classes, and even tours. Keen gardeners can pick up tips on how to incorporate native species into their home garden. Other special events include seasonal festivals, plant sales, and more – all of which make Mounts Botanical Garden an exciting destination with something to offer everyone. Discover facts about Launch Trampoline Park West Palm Beach, West Palm Beach, FL. Start Your Recovery With Us Today \" * \" indicates required fields Name * First Last Email * Phone Message CAPTCHA Instagram This field is for validation purposes and should be left unchanged. You consent to automated marketing messages (e.g. requesting a review from you) from Flagler Health And Wellness, LLC via email and SMS by clicking SUBMIT after entering your contact information. Are You Or Your Loved One Struggling With Addiction? Don’t wait to receive help. Licensed by the State Department of Health Care Services Quick Links Home About Us Tour Facility Our Blog Contact Us Privacy Policy Programs Medical Detox Treatment Inpatient Rehab Dual Diagnosis Treatment Medication Assisted Treatment Wellness Practices Evidence Based Therapies detox programs Cocaine Detox Heroin Detox Alcohol Detox Opioid Detox Meth Detox Benzo Detox Call Now (561) 556-8090 Verify Insurance Fill Out The Form 1803 S Australian Ave West Palm Beach, FL 33409 © Copyright 2025 Flagler Health & Wellness Have a question? Start Your Recovery With Us Today Whether you are attempting to quit using drugs or alcohol, we at Flagler Health & Wellness are available to help. We have licensed medical professionals, nurse practicioners, therapists and seasoned MD on staff, all of whom work together to provide the most comfortable and pain-free detox experience possible. \" * \" indicates required fields Name * First Last Email * Phone Message CAPTCHA X/Twitter This field is for validation purposes and should be left unchanged. You consent to automated marketing messages (e.g. requesting a review from you) from Flagler Health And Wellness, LLC via email and SMS by clicking SUBMIT after entering your contact information. Have a question? Start Your Recovery With Us Today Whether you are attempting to quit using drugs or alcohol, we at Flagler Health &amWhether you are attempting to quit using drugs or alcohol, we at Flagler Health & Wellness are available to help. We have licensed medical professionals, nurse practicioners, therapists and seasoned MD on staff, all of whom work together to provide the most comfortable and pain-free detox experience possible.p; Wellness are available to help. We have licensed medical professionals, nurse practicioners, therapists and seasoned MD on staff, all of whom work together to provide the most comfortable and pain-free detox experience possible. “*” indicates required fields Name (Required) First Last Email (Required) Phone Insurance Provider (Required) Member ID / Policy Number (Required) Date of Birth (Required) MM slash DD slash YYYY You consent to automated marketing messages (e.g. requesting a review from you) from Flagler Health And Wellness, LLC via email and SMS by clicking SUBMIT after entering your contact information."
    }
  ]
}