{
  "fuentes": [
    {
      "url": "https://untappd.com/v/mug-jug/85550",
      "email": "can@3x.png"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "365208741_10223057229328596_6440586866373077010_n_250x250@2x.jpg"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "70637984-f57b-49a5-ae3e-f7b92152308d_135x@2x.jpg"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "83019416-ca1e-4206-b9c2-d5996c14e0e9_600x600@2x.jpg"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "9bd56ad8-a556-43ee-9ac5-51ffa5aa86eb_250x250@2x.jpg"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "abstract_colorful_small_business_loyalty_punch_card_instagram_post_600x600@2x.png"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "falloween_2025_-_ig_post_600x600@2x.png"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "fullsizerender_250x250@2x.heic"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "neutral_minimalist_class_schedule_5.6_x_4.25_in_5.6_x_4.25_in_1_600x600@2x.png"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "image_ac463807-79da-4172-8c9f-09c38efa01e2_250x250@2x.jpg"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "email": "small_2024_stores_info_815_x_315_px_2_600x600@2x.png"
    },
    {
      "url": "https://mugsandthingsusa.com/pages/contact-us",
      "email": "mugs_flyer_4_250x@2x.png"
    },
    {
      "url": "https://mugexp.com/pages/contact-us",
      "email": "contact@mugexp.com"
    },
    {
      "url": "https://getvows.com/contact-us/",
      "email": "jeni@getvows.com"
    }
  ],
  "mails": [
    "365208741_10223057229328596_6440586866373077010_n_250x250@2x.jpg",
    "70637984-f57b-49a5-ae3e-f7b92152308d_135x@2x.jpg",
    "83019416-ca1e-4206-b9c2-d5996c14e0e9_600x600@2x.jpg",
    "9bd56ad8-a556-43ee-9ac5-51ffa5aa86eb_250x250@2x.jpg",
    "abstract_colorful_small_business_loyalty_punch_card_instagram_post_600x600@2x.png",
    "can@3x.png",
    "contact@mugexp.com",
    "falloween_2025_-_ig_post_600x600@2x.png",
    "fullsizerender_250x250@2x.heic",
    "image_ac463807-79da-4172-8c9f-09c38efa01e2_250x250@2x.jpg",
    "jeni@getvows.com",
    "mugs_flyer_4_250x@2x.png",
    "neutral_minimalist_class_schedule_5.6_x_4.25_in_5.6_x_4.25_in_1_600x600@2x.png",
    "small_2024_stores_info_815_x_315_px_2_600x600@2x.png"
  ],
  "nombre_sitio": "mugsjugsbar.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://untappd.com/v/mug-jug/85550",
      "text": "Mug & Jug - Berkley, MI - Untappd Blog Top Rated Insiders Help Shop Login Sign Up Sign In Join Now Menu Blog Top Rated Insiders Help Shop This business has not been verified Learn More Unverified Mug & Jug Liquor Store, Wine Shop 4138 12 Mile Rd Berkley, MI ( Map ) Incorrect Information? Learn More Yelp Foursquare 4138 12 Mile Rd Berkley, MI\t\t\t\t\t\t ( Map ) Incorrect Information? Learn More This business has not been verified Learn More This Venue is Unverified ( ? This venue is not verified by the owner. Verify your venue today to start publishing menus on Untappd, view analytics, create events and connect with Untappd users. ) Thanks! We'll let you know. Last Updated 04/12/25 Verify this Venue Do you own this Venue? Join Untappd For Business to verify your venue and get more app visibility, in-depth menu information, and more. Request a Demo Social Yelp Foursquare Venue Stats ( ? ) Log In to view Venue Stats Loyal Patrons ( ? ) Log In to view Patrons More Venue Details This Venue is Unverified ( ? This venue is not verified by the owner. Verify your venue today to start publishing menus on Untappd, view analytics, create events and connect with Untappd users. ) Thanks! We'll let you know. Last Updated 04/12/25 Verify this Venue Do you own this Venue? Join Untappd For Business to verify your venue and get more app visibility, in-depth menu information, and more. Request a Demo Photos Log In to view more photos Nearby Verified Venues Dog and Pony Show Brewing Verified Brewery 14661 W Eleven Mile Rd Ste 200 Oak Park, MI Unexpected Craft Brewing Company Verified Brewery 14401 W 11 Mile Road Oak Park, MI Jay Birds Bar & Grille Verified Cocktail Bar 27411 Southfield Road Lathrup Village, MI Recent Activity Michael Muldowney is drinking a Verdun by Brewery Vivant at Mug & Jug Purchased at Mug & Jug Can Tagged Friends Sat, 23 Apr 2022 02:37:36 +0000 View Detailed Check-in 1 Jon gingery is drinking a Caulk Gun by Ferndale Project at Mug & Jug Can Earned the Verified Adventure (Level 100) badge! Earned the 2X (Level 25) badge! Sat, 25 Dec 2021 02:25:29 +0000 View Detailed Check-in 0 Bill Robert is drinking a 70+ by Old Nation Brewing Co. at Mug & Jug Crisp and clear, nice bite not too chewy Can Earned the Verified Adventure (Level 67) badge! Sat, 19 Jun 2021 18:09:00 +0000 View Detailed Check-in 2 Allison is drinking a Daura by Damm at Mug & Jug As a gluten free person who can no longer enjoy craft beer...this one isn't bad! Whenever I see it I grab it. Bottle Sun, 25 Apr 2021 18:08:37 +0000 View Detailed Check-in 0 Allison is drinking a Stone Features & Benefits IPA by Stone Brewing at Mug & Jug As a gluten free person who can no longer enjoy craft beer...I go out of my way to find this one. Very easy drinking and great flavor! Purchased at Mug & Jug Bottle Earned the Newbie badge! Earned the Cheers To You! (Level 2) badge! Earned the Cheers to Independent U.S. Craft Breweries badge! Sun, 25 Apr 2021 18:07:24 +0000 View Detailed Check-in 0 Log in now to view all drink check-ins at this venue Sign In Join Now Untappd for Business Untappd for Business Blog Breweries Shop Support Careers API Terms Privacy Cookie Policy Do Not Sell My Personal Information"
    },
    {
      "url": "https://www.mugsandotherjugs.com/",
      "text": "Check out Mugs & Other Jugs ${{amount}} Skip to content Just added to your cart Qty: View cart ( ) Continue shopping Submit Close search 9.5oz Fall Candles 2/$35 Home Shop Collections Blog Updates Markets Wholesale - Retailers Only Search Log in 0 Cart 0 items Home Shop Collections Blog Updates Markets Wholesale - Retailers Only Candles and Gifts Handmade with love in Berkley, Michigan I offer delivery (porch drop-off) to Berkley, N. Oak Park, N. Royal Oak and Huntington Woods, MI a couple days per week. I offer delivery to St. Clair Shores every few weeks. Interested in wholesale or have questions? Feel free to email me at mugsandotherjugs@gmail.com and thanks for taking a peek at my website! It's Fall Y'all 9.5oz Candles | Fall Line 9.5oz Candles | Fall Line Regular price from $15.00 Sale price from $15.00 Regular price $20.00 Unit price / per Sale Sold out Room Sprays | Fall Room Sprays | Fall Regular price $10.00 Sale price $10.00 Regular price Unit price / per Sale Sold out Dough Bowl Candles | Fall Dough Bowl Candles | Fall Regular price from $24.50 Sale price from $24.50 Regular price $35.00 Unit price / per Sale Sold out 9oz Pumpkin Cocotte Candle | Fall 9oz Pumpkin Cocotte Candle | Fall Regular price $24.00 Sale price $24.00 Regular price Unit price / per Sale Sold out View all Show your team pride with Game Day candles! Buy Now Join us at Mother Handsome + Dog & Pony Show for a gathering you won't want to miss! Spooky sips, shops and bites  👻 RSVP Private Candlemaking Parties! I offer at-home candlemaking parties on weekends and select weekdays. E-mail me with questions and to setup your next party with friends and family! mugsandotherjugs@gmail.com You can find my candles for sale at these amazing retail stores. Be sure to check Facebook or Google for up-to-date business hours before visiting. Join my Loyalty Program Find the \"Sign Up for Rewards\" button bottom right of my page and join my rewards program! Perfect way to earn points when buying those gifts for the holiday's - you can treat yourself with your earned points! Reviews from buyers like you I've bought several incredible candle creations from Kerriann, and I adore each one! She puts so much thought into each new line, and her vessels are often unique to the point of being truly one-of-a-kind. Highly recommend this local candle maker! April D. Candles are wonderful!  Smell great, burn clean.  Large variety of fragrances and fun containers!  Make great gifts! Lynn S. Bought some candles from her fall line and LOVED them! They lasted so much longer than candles I've bought from the stores and the smell was so unique and comforting! As well, Keriann went out of her way to provide a COVID safe pick up option for me at a place that was closer to me than her house! 5/5 candles and 5/5 customer service!! Karley R. Absolutely love my candles! All the scents are wonderful and not to over powering. I feel safe to light them in the house with animals and family who have sensitivity to scents!! Thank you Kerriann for your amazing and fun products, I’ll be a happy returning customer!! Katelyn C. Kerriann is very passionate about what she does! I love all of the candles I’ve ever gotten from her & I’m not just saying that because I’m her sister. I have several of her hand-poured candles and my favorite scent is honey/lavender. The candles are all so unique and I love that each of them have a way to repurpose. I have a few that I’ll eventually turn into pots for plants, a few that will become coffee mugs and a few that could stand alone as decor. I love that the purpose of her business is to reduce waste by reusing vintage finds, coffee mugs and other pieces. Overall, I highly recommend Mugs & Other Jugs! Courtney K. A great variety of scents. There are fruity and for lack of better words \"energizing\" scents to calming and relaxing scents. All natural wax with little to no smoke. My personal favorite thing about these is she reuses cute and decorative containers that she finds! I burn these candles while I'm working from home. It makes my job a little less stressful. Highly recommend the white sage and lavender scent of your looking to relax. Mitch B. Kerrianne’s candles are not only beautiful but smell amazing! As someone who has always been sensitive to harsh fragrances from commercial stores, I am thrilled that I can enjoy candles again.  Every scent is a perfect blend of different notes that create an inviting but not overpowering smell. Liz J. I’ve purchased several candles from Kerriann for myself and as gifts for others, and I have been so happy with all of them! People especially love the Michigan dough bowls and the mug candles. I’ve also done two candle making classes (one in-home and one in a store) and both were super fun. Kerriann does a great job teaching you how to take care of your candles, too. I highly recommend Mugs & Other Jugs for all of your candle needs! Amy G. These candles and their vessels strike me as being very professional despite being a small local business, and it makes me happy that i can shop local and support small businesses - the candles smell great, even when they’re not burning, and if the owner lives near you, she’ll hand deliver them... for a convenient, contactless porch drop off. Def recommend - you WILL find something you like! Sarah Z. Quick links Home Search Terms of Service Refund policy Language English English Español Currency USD $ CAD $ USD $ Facebook Instagram Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025, Mugs & Other Jugs Powered by Shopify © 2025, Mugs & Other Jugs Powered by Shopify Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    },
    {
      "url": "https://mugsandthingsusa.com/pages/contact-us",
      "text": "Contact Us\n– Mugs & Things Creative Gifting Design Studio Loading... Skip to content Just added to your cart Qty: View cart ( ) Continue shopping Submit Close search Home Our Products About Us FAQs Shipping & Returns Contact Us Search Log in Cart 0 items Home Our Products About Us FAQs Shipping & Returns Contact Us Contact Us Any Questions and you need to get in touch with us? Please e-mail us @: mugsandthingsusa@gmail.com Quick links Home Our Products About Us FAQs Shipping & Returns Contact Us Newsletter Subscribe Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa Facebook Pinterest Instagram Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard PayPal Shop Pay Visa © 2025, Mugs & Things Creative Gifting Design Studio Powered by Shopify Use left/right arrows to navigate the slideshow or swipe left/right if using a mobile device Choosing a selection results in a full page refresh. Press the space key then arrow keys to make a selection."
    },
    {
      "url": "https://mugexp.com/pages/contact-us",
      "text": "Contact Us - The Mug Experience Color Changing Mugs Skip to content Custom Dealer Custom Corporate Custom Gifts Curated Log in Facebook Twitter Instagram TikTok LinkedIn YouTube Custom Dealer Custom Corporate Custom Gifts Curated Search our site Clear Log in Cart Cart Contact Us Questions? Comments? Get in touch with us by filling out the email form below. Our store Holdingford, MN Phone: 651-769-7966 Toll Free: 888-584-9083 Email: contact@mugexp.com Explore Our Vision Contact Us Shop Search For Your Business Wholesale Contact Us Business Registration Form Policies Contact Us Shipping Policy Refund Policy Privacy Policy Terms of Service Join The Mug Experience Mailings Enter email here Facebook Twitter Instagram TikTok LinkedIn YouTube Follow us on social media! © 2025, Mug Experience . All rights reserved. Country/region AFN ؋ EUR € ALL L DZD د.ج EUR € USD $ XCD $ XCD $ USD $ AMD դր. AWG ƒ SHP £ AUD $ EUR € AZN ₼ BSD $ USD $ BDT ৳ BBD $ USD $ EUR € BZD $ XOF Fr USD $ USD $ BOB Bs. BAM КМ BWP P USD $ USD $ USD $ BND $ BGN лв. XOF Fr BIF Fr KHR ៛ XAF CFA CAD $ CVE $ USD $ KYD $ XAF CFA XAF CFA USD $ CNY ¥ AUD $ AUD $ USD $ KMF Fr XAF CFA CDF Fr NZD $ CRC ₡ XOF Fr EUR € ANG ƒ EUR € CZK Kč DKK kr. DJF Fdj XCD $ DOP $ USD $ EGP ج.م USD $ XAF CFA USD $ EUR € USD $ ETB Br FKP £ DKK kr. FJD $ EUR € EUR € EUR € XPF Fr EUR € XOF Fr GMD D USD $ EUR € USD $ GBP £ EUR € DKK kr. XCD $ EUR € GTQ Q GBP £ GNF Fr XOF Fr GYD $ USD $ HNL L HKD $ HUF Ft ISK kr INR ₹ IDR Rp USD $ EUR € GBP £ ILS ₪ EUR € JMD $ JPY ¥ USD $ USD $ KZT ₸ KES KSh USD $ EUR € USD $ KGS som LAK ₭ EUR € LBP ل.ل USD $ USD $ USD $ CHF CHF EUR € EUR € MOP P USD $ MWK MK MYR RM MVR MVR XOF Fr EUR € EUR € USD $ MUR ₨ EUR € USD $ MDL L EUR € MNT ₮ EUR € XCD $ MAD د.م. USD $ MMK K USD $ AUD $ NPR Rs. EUR € XPF Fr NZD $ NIO C$ XOF Fr NGN ₦ NZD $ AUD $ MKD ден USD $ USD $ PKR ₨ ILS ₪ USD $ PGK K PYG ₲ PEN S/ PHP ₱ NZD $ PLN zł EUR € QAR ر.ق EUR € RON Lei USD $ RWF FRw WST T EUR € STD Db SAR ر.س XOF Fr RSD РСД USD $ SLL Le SGD $ ANG ƒ EUR € EUR € SBD $ USD $ USD $ GBP £ KRW ₩ USD $ EUR € LKR ₨ EUR € SHP £ XCD $ XCD $ EUR € EUR € XCD $ USD $ USD $ USD $ SEK kr CHF CHF TWD $ TJS ЅМ TZS Sh THB ฿ USD $ XOF Fr NZD $ TOP T$ TTD $ GBP £ USD $ USD $ USD $ USD $ AUD $ USD $ UGX USh UAH ₴ AED د.إ GBP £ USD $ UYU $U UZS so'm VUV Vt EUR € USD $ VND ₫ XPF Fr MAD د.م. YER ﷼ USD $ USD $ Update country/region Country/region United States (USD $) United States (USD $) Afghanistan (AFN ؋) Åland Islands (EUR €) Albania (ALL L) Algeria (DZD د.ج) Andorra (EUR €) Angola (USD $) Anguilla (XCD $) Antigua & Barbuda (XCD $) Argentina (USD $) Armenia (AMD դր.) Aruba (AWG ƒ) Ascension Island (SHP £) Australia (AUD $) Austria (EUR €) Azerbaijan (AZN ₼) Bahamas (BSD $) Bahrain (USD $) Bangladesh (BDT ৳) Barbados (BBD $) Belarus (USD $) Belgium (EUR €) Belize (BZD $) Benin (XOF Fr) Bermuda (USD $) Bhutan (USD $) Bolivia (BOB Bs.) Bosnia & Herzegovina (BAM КМ) Botswana (BWP P) Brazil (USD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (BND $) Bulgaria (BGN лв.) Burkina Faso (XOF Fr) Burundi (BIF Fr) Cambodia (KHR ៛) Cameroon (XAF CFA) Canada (CAD $) Cape Verde (CVE $) Caribbean Netherlands (USD $) Cayman Islands (KYD $) Central African Republic (XAF CFA) Chad (XAF CFA) Chile (USD $) China (CNY ¥) Christmas Island (AUD $) Cocos (Keeling) Islands (AUD $) Colombia (USD $) Comoros (KMF Fr) Congo - Brazzaville (XAF CFA) Congo - Kinshasa (CDF Fr) Cook Islands (NZD $) Costa Rica (CRC ₡) Côte d’Ivoire (XOF Fr) Croatia (EUR €) Curaçao (ANG ƒ) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Djibouti (DJF Fdj) Dominica (XCD $) Dominican Republic (DOP $) Ecuador (USD $) Egypt (EGP ج.م) El Salvador (USD $) Equatorial Guinea (XAF CFA) Eritrea (USD $) Estonia (EUR €) Eswatini (USD $) Ethiopia (ETB Br) Falkland Islands (FKP £) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Guiana (EUR €) French Polynesia (XPF Fr) French Southern Territories (EUR €) Gabon (XOF Fr) Gambia (GMD D) Georgia (USD $) Germany (EUR €) Ghana (USD $) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Grenada (XCD $) Guadeloupe (EUR €) Guatemala (GTQ Q) Guernsey (GBP £) Guinea (GNF Fr) Guinea-Bissau (XOF Fr) Guyana (GYD $) Haiti (USD $) Honduras (HNL L) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) India (INR ₹) Indonesia (IDR Rp) Iraq (USD $) Ireland (EUR €) Isle of Man (GBP £) Israel (ILS ₪) Italy (EUR €) Jamaica (JMD $) Japan (JPY ¥) Jersey (USD $) Jordan (USD $) Kazakhstan (KZT ₸) Kenya (KES KSh) Kiribati (USD $) Kosovo (EUR €) Kuwait (USD $) Kyrgyzstan (KGS som) Laos (LAK ₭) Latvia (EUR €) Lebanon (LBP ل.ل) Lesotho (USD $) Liberia (USD $) Libya (USD $) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Macao SAR (MOP P) Madagascar (USD $) Malawi (MWK MK) Malaysia (MYR RM) Maldives (MVR MVR) Mali (XOF Fr) Malta (EUR €) Martinique (EUR €) Mauritania (USD $) Mauritius (MUR ₨) Mayotte (EUR €) Mexico (USD $) Moldova (MDL L) Monaco (EUR €) Mongolia (MNT ₮) Montenegro (EUR €) Montserrat (XCD $) Morocco (MAD د.م.) Mozambique (USD $) Myanmar (Burma) (MMK K) Namibia (USD $) Nauru (AUD $) Nepal (NPR Rs.) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Nicaragua (NIO C$) Niger (XOF Fr) Nigeria (NGN ₦) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (USD $) Oman (USD $) Pakistan (PKR ₨) Palestinian Territories (ILS ₪) Panama (USD $) Papua New Guinea (PGK K) Paraguay (PYG ₲) Peru (PEN S/) Philippines (PHP ₱) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Qatar (QAR ر.ق) Réunion (EUR €) Romania (RON Lei) Russia (USD $) Rwanda (RWF FRw) Samoa (WST T) San Marino (EUR €) São Tomé & Príncipe (STD Db) Saudi Arabia (SAR ر.س) Senegal (XOF Fr) Serbia (RSD РСД) Seychelles (USD $) Sierra Leone (SLL Le) Singapore (SGD $) Sint Maarten (ANG ƒ) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Somalia (USD $) South Africa (USD $) South Georgia & South Sandwich Islands (GBP £) South Korea (KRW ₩) South Sudan (USD $) Spain (EUR €) Sri Lanka (LKR ₨) St. Barthélemy (EUR €) St. Helena (SHP £) St. Kitts & Nevis (XCD $) St. Lucia (XCD $) St. Martin (EUR €) St. Pierre & Miquelon (EUR €) St. Vincent & Grenadines (XCD $) Sudan (USD $) Suriname (USD $) Svalbard & Jan Mayen (USD $) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) Tajikistan (TJS ЅМ) Tanzania (TZS Sh) Thailand (THB ฿) Timor-Leste (USD $) Togo (XOF Fr) Tokelau (NZD $) Tonga (TOP T$) Trinidad & Tobago (TTD $) Tristan da Cunha (GBP £) Tunisia (USD $) Türkiye (USD $) Turkmenistan (USD $) Turks & Caicos Islands (USD $) Tuvalu (AUD $) U.S. Outlying Islands (USD $) Uganda (UGX USh) Ukraine (UAH ₴) United Arab Emirates (AED د.إ) United Kingdom (GBP £) Uruguay (UYU $U) Uzbekistan (UZS so'm) Vanuatu (VUV Vt) Vatican City (EUR €) Venezuela (USD $) Vietnam (VND ₫) Wallis & Futuna (XPF Fr) Western Sahara (MAD د.م.) Yemen (YER ﷼) Zambia (USD $) Zimbabwe (USD $) Payment methods American Express Apple Pay Diners Club Discover Google Pay Mastercard Shop Pay Visa We use cookies and similar technologies to provide the best experience on our website. Privacy Policy Accept No Choosing a selection results in a full page refresh. × Unlock Wholesale Pricing Instantly To see your wholesale discount, please take 60 seconds to create your account. Pre-Approval is immediate and you'll be sent right back to your cart. Create Business Account Already have a wholesale account? Log in here ."
    },
    {
      "url": "https://getvows.com/contact-us/",
      "text": "Contact Us - Get Vows Skip to content Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar New Jersey/New York Area (732) 763-2730 jeni@getvows.com Facebook Twitter Pinterest Flipboard Home About GetVows Ceremonies Resources Event Staffing Contact Us Calendar CONTACT US Send Message GET IN TOUCH If you’re interested in our services or have any questions, please reach out to us thru the contact information below or fill out our form on the right. jeni@getvows.com (732) 763-2730 New Jersey/New York Area CONTACT INFO jeni@getvows.com (732) 763-2730 New Jersey/New York Area SOCIAL Facebook Twitter Pinterest Flipboard NEED TO MAKE A PAYMENT? Payment Options Copyright © All Rights Reserved"
    }
  ]
}