{
  "fuentes": [
    {
      "url": "https://www.fifthelementgroup.com/",
      "email": "aaron@fifthelementgroup.com"
    },
    {
      "url": "https://www.fifthelementgroup.com/",
      "email": "alex@fifthelementgroup.com"
    },
    {
      "url": "https://www.fifthelementgroup.com/",
      "email": "info@fifthelementgroup.com"
    },
    {
      "url": "https://www.fifthelementgroup.com/",
      "email": "tina@fifthelementgroup.com"
    },
    {
      "url": "https://my5thelement.com/disclaimer/",
      "email": "info@my5thelement.com"
    },
    {
      "url": "https://www.elementresources.com/leadership/",
      "email": "info@elementresources.com"
    },
    {
      "url": "https://www.elementresources.com/leadership/",
      "email": "press@elementresources.com"
    },
    {
      "url": "https://www.uptowncr.com/vendors/5th-element",
      "email": "info@my5thelement.com"
    }
  ],
  "mails": [
    "aaron@fifthelementgroup.com",
    "alex@fifthelementgroup.com",
    "info@elementresources.com",
    "info@fifthelementgroup.com",
    "info@my5thelement.com",
    "press@elementresources.com",
    "tina@fifthelementgroup.com"
  ],
  "nombre_sitio": "my5thelement.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.fifthelementgroup.com/",
      "text": "Fifth Element Group Events North America top of page HOME ABOUT SERVICES CONTACT SERVICES THE EVENTS THE TEAM CONTACT BLOG More Use tab to navigate through the menu items. NORTH LEADING LIVE EXPERIENCE AMERICA'S FIRM F ifth Element Group is an award winning live experience firm, recognized worldwide as a leading creative force in large scale galas & events, fundraisers, conference management, design and live activations. For over 20 years we have created and managed event environments for the world's top brands, companies and philanthropic efforts. Executing on our promise for industry leading creativity and customer service is our daily mission with a team of influential and passionate event professionals who continue to raise the bar in the field of live experiences. Our work has influenced campaigns, gatherings, fundraisers, conferences and even celebrity weddings and we do that with attention to detail, passion and a vision for one team, endless possibilities & creative original results. LIVE EXPERIENCE IDEATION, CREATION & EXECUTION DIGITAL AND ONLINE EVENT SOLUTIONS COMPLETE EVENT SOLUTIONS & MANAGEMENT EVENT DESIGN MARKETING ACTIVATIONS AND SAMPLING SPONSORSHIP ACQUISITION & MANAGEMENT CUSTOM BRAND EXPERIENCES INTERNATIONAL MEETINGS, EVENTS AND SUMMITS TALENT / ARTIST PROCUREMENT & MANAGEMENT SERVICES WHAT WE DO We have established industry relationships and partnerships that not only deliver top-notch service, but also provide unmatched competitive pricing to lower our clients’ bottom-line. We work with top tiered vendors across the country and internationally. Services \"We produce with passion and relentless creativity. Our team, understands the meaning of vision from beginning to end\" THE EVENTS @fifthelementgrp #fifthelementgrp The Events Fifth Element Group is an award winning live experience firm, recognized worldwide as a leading creative force in design, large scale events, conference management and live activations. THE TEAM WE CHANGE THE GAME Aaron Kaufman President Tanya Scagnol Creativ e Director Lisa Riedel Senior Producer Lana James S enior Event Manager Tina Caicco Account Manager Danielle Bazzocchi Project Coordinator Zoe Katz Project Coordinator Jamie Gladst one CMA CPA C.F.O \"The Fifth team is extremely well networked and particularly well respected in the entertainment sector and within the business community.  Their broad range of experience in production, event management and creativity along with attention to details has been invaluable for our organization.\" ​ - Ronald McDonald House Charities Toronto THE CLIENTS Fifth Element Group Instagram #fifthelementgrp Fifth Element Group Blog Diving into Event Management: My First Six Weeks with Fifth Element GroupJumping into a Our President joins UK based Event Industry news and talks all things events! Corporate Head Office (Toronto, ON) 12 Upjohn Rd. Unit 5. North York, ON. M3B 2V9 Email: info@fifthelementgroup.com Tel: 416.241.4440 ​ For any general inquiries, please fill in the following contact form: Success! Message received. SEND contact The Designers bottom of page"
    },
    {
      "url": "https://my5thelement.com/disclaimer/",
      "text": "Best Veg & Non-Veg Indian Food/Dishes Near Me | Disclaimer Home About Us Our Locations Baymeadows, Jacksonville Towncenter, Jacksonville Pompano Beach Sanford Delray Beach Daytona Beach Palm Coast Weekend Deliveries Catering Services Contact Us Reserve A Table/Order Takeout Search Menu Disclaimer for “ 5TH ELEMENT INDIAN RESTAURANT LLC” If you require any more information or have any questions about our site’s disclaimer, please feel free to contact us by email at info@my5thelement.com Disclaimers for 5th Element All the information on this website – https://www.my5thelement.com – is published in good faith and for general information purpose only. 5th Element does not make any warranties about the completeness, reliability and accuracy of this information. Any action you take upon the information you find on this website (5th Element), is strictly at your own risk. 5th Element will not be liable for any losses and/or damages in connection with the use of our website. From our website, you can visit other websites by following hyperlinks to such external sites. While we strive to provide only quality links to useful and ethical websites, we have no control over the content and nature of these sites. These links to other websites do not imply a recommendation for all the content found on these sites. Site owners and content may change without notice and may occur before we have the opportunity to remove a link which may have gone ‘bad’. Please be also aware that when you leave our website, other sites may have different privacy policies and terms which are beyond our control. Please be sure to check the Privacy Policies of these sites as well as their “Terms of Service” before engaging in any business or uploading any information. Consent By using our website, you hereby consent to our disclaimer and agree to its terms. Update Should we update, amend or make any changes to this document, those changes will be prominently posted here. About Us Catering Services Weekend Deliveries Terms & Conditions Privacy Policy Disclaimer Download Our Mobile App Reserve A Table or Order Takeout via our app. Our Locations Baymeadows, Jacksonville Towncenter, Jacksonville Pompano Sanford Delray Daytona Palm Coast 5TH ELEMENT INDIAN RESTAURANT LLC ©  2025. Search Start typing to see products you are looking for. Close Home About Us Locations Jacksonville (Baymeadows) Jacksonville (Towncenter) Pompano Beach Sanford, FL Delray Beach, FL Daytona Beach Palm Coast, FL Weekend Deliveries Catering Services Contact Us Login / Register ENQUIRE NOW x"
    },
    {
      "url": "https://www.elementresources.com/leadership/",
      "text": "Leadership - Element Resources Skip to main content Skip to footer Element Resources What We Do Why Element Markets We Serve Our Projects Leadership Partners News Contact Us Leadership Creating Clean Energy for a Changing World Our Values Always be a good citizen, neighbor and partner in all aspects of our business. Maximize shareholder value by integrating the power and mobility markets by optimizing location, intelligent renewable power generation, hydrogen energy production, and providing cross-commodity flexibility. Benefit the communities where we do business by creating new opportunities that provide sustainable environmental and economic benefits. Promote and enhance the welfare of our employees, our community, our partners, and the environment. Leadership Team Steve Meheen Chief Executive & Chairman Connect on LinkedIn Close Intro Steve Meheen, Chief Executive and Chairman Founder of Element Resources Diversified Domestic and International Experiences Thirty-four years experience in the Energy Sector BS Petroleum Engineering – UCLA Successful Entrepreneur Post Graduate Study in Business Security- Harvard Ian Dunderdale Chief Operating Officer Connect on LinkedIn Close Intro Ian Dunderdale, Chief Operating Officer Strategy implementation, valuation and transaction execution. Led investments in project development of energy assets and early-stage climate technology. International executive leader in talent management, portfolio development. Co-founder of two private equity backed companies. Company Director, Board / Institutional Investor. Statutory reporting & regulatory submission. BSc Hons Geology - University of Sheffield, CGeol, CPG Post Graduate Study in Business Management - UT Austin. Avery Barnebey Chief Financial Officer and Corporate Secretary Connect on LinkedIn Close Intro Avery Barnebey, Chief Financial Officer and Corporate Secretary Thirty years' experience in renewable power, geothermal, pipelines, and oil & gas at Fortune 100 companies BBA- Baylor University BBA Treasury functions: capital raising, financial analysis, auditing, and accounting MBA - Texas A&M Corporate development: strategy, M&A, joint ventures, divestitures, and competitor analysis Sonia Verhagen Chief Commercial Officer Connect on LinkedIn Close Intro Sonia Verhagen, Chief Commercial Officer 17+ years oil and gas, LNG, infrastructure and finance MBA University of Baltimore and Navy War College Joint Strategy Certification U.S. Navy Reserve Officer, 8 years AIEN low carbon working group and Society of Decision Professionals Josh Whittaker Lead Developer Connect on LinkedIn Close Intro Josh Whittaker, Lead Developer Project Manager for numerous high profile organizations 20 plus years of experience in the maritime industry Including engineering management, global logistics and business development Extensive experience in AutoCad and Solar PV design Adele Perrier Ramos Director of Operations Connect on LinkedIn Close Intro Adele Perrier Ramos Experienced mechanical design engineer Designed and delivered equipment for harsh environments Skilled cross functional team leader Distinguished communicator MBA from Rice University Alexandro Mendoza Zappi Environmental & QMS Connect on LinkedIn Close Intro Alexandro Mendoza Zappi, Environmental & QMS BSc, Biology - University of Veracruz Development and operation of Geographic Informational Systems Development and implementation of Quality Management Systems Plan and execute projects in Biostratigraphy Plan and execute Biological Studies Plan and execute Geoscience Studies Extensive experience in GIS / Mapping Justin Ackerman CWO-5 USN (ret) General Manager - Hawaii Connect on LinkedIn Close Intro Justin Ackerman, General Manager - Hawaii Hawaii County Commissioner District 9, Game Management Advisory Commission Three decades as United States Naval Special Warfare Combat Crewman Expertise in Planning & Execution Demonstrated Special Operations Leadership over 4 Continents Maritime Special Operations / Safety specialist Board Members Dr. Sanjay Jha Board Member Close Intro Dr. Sanjay Jha, Advisor to CEO Veteran tech leader, patent holder, silicon and software expert, and “C” level executive Board Member, Board of Directors, Semiconductor Industry Association COO, Qualcomm, and President, Qualcomm CDMA Technologies Elected member of National Academy of Engineering CEO, Motorola Mobility Ph. D., Electrical Engineering – Univ of Strathclyde CEO, Global Foundries BS, Electrical Engineering – Univ of Liverpool Vice Chairman, Global Semiconductor Alliance Stephen Benjamin Board Member Close Intro Stephen “Benji” Benjamin, Board Member Successful yachtsman and entrepreneur. Currently, leading acquisition and restructuring North Sails Miami. Founder of several sail making, yachting, and related companies with a focus on deployment of advanced technologies. Silver medal 1984 LA Olympics, four-time world champion in three sailing classes, U.S. Rolex Yachtsman of the Year. Venture capital and private equity investor in alternative energy, logistics infrastructure, communications, real estate, and financial services. MBA - Yale University; served for twenty years as the Chairman of the Yale Sailing Associates. William G. Dorey Board Member NAC Bio Close Intro William G. Dorey, Board Member A 42 year construction career with Granite Construction Incorporated. Former CEO of Granite Construction Incorporated. Served as a board member for two publicly traded companies (Granite Construction and Astec Industries). Founding Chairman of the Construction Industry Ethics and Compliance Initiative (CIECI). Trustee, Mineta Transportation Institute. Director, California Chamber of Commerce and the California Business Roundtable. Married 53 years with four children and two dogs. Advisory Board VADM Yancy B. Lindsey, USN (RET) Advisor Connect on LinkedIn Close Intro VADM Yancy B. Lindsey, USN (Retired) Thirty-seven year veteran of the U.S. Navy with extensive experience and senior leadership positions in Naval Aviation and Navy Installations/Facilities. Former Commander, Navy Installations Command Board Member, Board of Directors, Electric Power Research Institute (EPRI) B.S., Mechanical Engineering, University of California at Berkeley M.S., Global Leadership, University of San Diego Stephen M. Trauber Advisor Close Intro Stephen M. Trauber Former Vice Chairman & Global Head of Natural Resources & Clean Energy Transition at Citi Thirty-four-year investment banker with over $700 Billion in public and private financings and M&A transactions Active corporate board member for several public and private corporations and not-for-profit organizations MBA and Austin Scholar from J.L. Kellogg Graduate School of Management at Northwestern University and BA in Economics and Managerial Studies from Rice University Kate Gordon Advisor Connect on LinkedIn Close Intro Kate Gordon CEO of California Forward, a statewide organization dedicated to a more sustainable, resilient, and inclusive economy across California Former Senior Advisor to the Secretary of Energy, U.S. Department of Energy Twenty years of experience at national think tanks and in the non-profit sector connecting state and regional economic development strategies to climate and clean energy goals Former Senior Policy Advisor on Climate to the Governor of California Juris Doctor and Masters in City Planning from the University of California at Berkeley RADM James ‘Jim’ Rodman (Retired) Advisor Close Intro RADM James ‘Jim’ Rodman (Retired), Advisor Former Chief Engineer of Space and Naval Warfare Systems Command (SPAWAR) Vice Commander of Navy Net Centric Warfare Group Founder, and Chairman of XSITE Bachelor of Science in Aerospace Engineering Juris Doctor from the Villanova University School of Law Executive Master's in Technology Management / University of Pennsylvania's Wharton School and School of Engineering & Applied Science Get in touch with us info@elementresources.com press@elementresources.com Corporate Center 910 Lousiana Street, Suite 5030 Houston, TX 77002 Project Development Office Rio Vista Tower 8880 Rio San Diego Drive Suite 1095 San Diego, CA 92108 Privacy Policy | Web Accessibility | Site Map Copyright © 2025 Element Resources. All Rights Reserved. Designed by Tiny Frog Technologies ."
    },
    {
      "url": "https://www.uptowncr.com/vendors/5th-element",
      "text": "My 5th Element  | Uptown Community Resources Home About us Services All Vendors Auto Services Beauty & Wellness Boutique & Shops Home Improvement In-Home Services (Mobile) Medical Services Pet Services Professional Services Rentals & Activities Restaurants & Catering Careers Charities Hurricane Preparations Vendor Application Support All Vendors Restaurants & Catering My 5th Element My 5th Element Average star rating: No ratings yet Restaurateur Sridhar Sannala, inspired to share his love for the food and culture of his native India, assembled a talented team to create a world-class restaurant that would re-define how Indian cuisine is presented on the international gastronomic stage. â The team shares a vision of the future for Indian cuisine, an endeavor to improve the purest traditional and regional cuisines, while simultaneously creating innovative, modern dishes and interpretation. â Our passion is a contemporary restaurant offering dining experiences to satisfy all aspects of fine cuisine, in a vibrant and trendsetting ambience. 5th Element is a place of gathering, a place of celebration, a place for business and a place for pleasure. â Open Tuesday-Sunday 11:00am-9:30pm Closed on Monday Email info@my5thelement.com Phone (386) 302-0202 Office 101 Palm Harbor Pkwy, Unit 126 (European Village) Website Click to View Visit website Facebook Like on Facebook Instagram Follow on Instagram Twitter Follow on Twitter LinkedIn Follow on LinkedIn YouTube Subscribe on YouTube TikTok Follow on TikTok View services Services Services & Information Indian Cuisine Catering Wine and Beer Buffet (Weekends) No items found. Average star rating: No ratings yet The food was excellent. Our waiter assisted in helping to find a menu item that had just the right amount of spice. -M Scott Very tasty food served with a genuine smile. Sujoy made fantastic recommendations and we ended up loving all the dishes. The egg dosa was huge and perfectly made. Vegetable biriyani portions were huge - beware ! Â -Indu Prasadh Promotions Special Offers and Discounts for You Check out the latest coupons and special promotions from our featured vendor. Save Big Browse through our exclusive offers and grab the best deals today! Limited Time Don't miss out on these amazing discounts. Get them before they're gone! Learn More Sign Up My 5th Element Contact details Contact this vendor today to get your project needs taken care of. Email info@my5thelement.com Phone (386) 302-0202 Office 101 Palm Harbor Pkwy, Unit 126 (European Village) Website http://my5thelement.com http://my5thelement.com 1-386-356-2386 Information Home About us Support Charities Hurricane Preparations Register as a vendor Services Restaurants & Catering Beauty & Wellness In-Home Services (Mobile) Boutique & Shops Auto Services Rentals & Activities Professional Services Pet Services Medical Services Home Improvement Download Our App! Â© 2025 Uptown Community Resources. All rights reserved. Disclaimers Privacy Policy Terms of Service"
    }
  ]
}