{
  "fuentes": [
    {
      "url": "https://popsdiabetes.com/about-us/",
      "email": "hi@popsdiabetes.com"
    },
    {
      "url": "https://www.namebubbles.com/pages/contact-us",
      "email": "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com"
    },
    {
      "url": "https://www.namebubbles.com/pages/contact-us",
      "email": "f14faca962674f149161045845b21b35@sentry.zipify.com"
    },
    {
      "url": "https://mybubblepops.com/pages/bubble-pops-milk-tea-store-faqs",
      "email": "info@mybubblepops.com"
    },
    {
      "url": "https://bubbletcosmetics.com/pages/contact",
      "email": "info@bubbletcosmetics.com"
    },
    {
      "url": "https://bubbletcosmetics.com/pages/contact",
      "email": "trade@bubbletcosmetics.com"
    },
    {
      "url": "https://bubbleenterprises.co.uk/about-us/",
      "email": "info@bubbleenterprises.co.uk"
    },
    {
      "url": "https://www.gobubblepop.com/contact/",
      "email": "jp@simplicreative.com"
    },
    {
      "url": "https://www.aroundosceola.com/lifestyle/meet-your-police-these-outreach-events",
      "email": "accounting@osceolanewsgazette.com"
    },
    {
      "url": "https://www.aroundosceola.com/lifestyle/meet-your-police-these-outreach-events",
      "email": "editor@osceolanewsgazette.com"
    },
    {
      "url": "https://www.aroundosceola.com/lifestyle/meet-your-police-these-outreach-events",
      "email": "trowan@osceolanewsgazette.com"
    }
  ],
  "mails": [
    "accounting@osceolanewsgazette.com",
    "e7d54b729aaf49ea8b2f80dae22860aa@sentry.zipify.com",
    "editor@osceolanewsgazette.com",
    "f14faca962674f149161045845b21b35@sentry.zipify.com",
    "hi@popsdiabetes.com",
    "info@bubbleenterprises.co.uk",
    "info@bubbletcosmetics.com",
    "info@mybubblepops.com",
    "jp@simplicreative.com",
    "trade@bubbletcosmetics.com",
    "trowan@osceolanewsgazette.com"
  ],
  "nombre_sitio": "mybubblepops.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://popsdiabetes.com/about-us/",
      "text": "About Us | Diabetes Management | Pops Diabetes Care Home Partners Individuals Caregivers About FAQ Tutorials Blog Contact Us 📞  (800) 767-7268 Login Partners Individuals Caregivers About FAQ Blog Meet Mina Login About Us Pops Diabetes was founded in May of 2013 by Lonny Stormo, Dan Davis, and Curt Christensen. The concept of Pops was created while Lonny and the co-founders were catching fish in the middle of a remote lake in Minnesota. While watching Dan reel in a large walleye while trying to check his blood sugar with a traditional testing kit, Lonny asked the group, “Why can’t I use my phone to check my blood sugar while I’m out fishing or jogging? This kit hasn’t changed in the 20 years I’ve been using it and only shows me one result at a time. It’s frustrating.” They hooked that idea and went back to the shop where they engineered a simple, all-in-one meter that connects wirelessly to an app on a phone – showing weekly and monthly trends at the touch of a button. Pops was founded with the intent of putting simple technology in people’s hands to enable them to Own Their Life®. What We Do Value relationships Talk about our golf game Resolve roadblocks Play Old Town Road on repeat Challenge the status quo What We Don’t Work > life Hidden agendas Resist chocolate Fax Wear khakis Pops' Values The Experience is Everything: We are committed to inspiring our clients and owners by providing a simple and consumer focused approach to diabetes management. We work to solve their daily challenges, understand their pain points, and to go above and beyond in serving them. Make Change Happen: To be the leader, we need to dream big, and we use our strengths to invent, tinker, engineer, imagine, inspire, design, create, and trailblaze our dreams into actionable change. Be a Good Human: We show up as real, vulnerable, transparent human beings who speak from the heart, value others’ contributions, and invest in each other’s growth. We operate as a tight-knit unit that creates a culture of well-being and support for one another. Pops Leadership Team Click on image to read more. Have you ever stood in the middle of a city and wondered why did the first person settle here and what made this city grow? Lonny loves blending history, trends, and strategy for his historical and nerdy curiosity (driving his family nuts) and in looking at why trends and businesses fail and succeed. Lonny Stormo CEO Dr. Timothy Balder, MD has over 40 years of experience in the medical field as a Family Medicine Specialist. He graduated from the University of Minnesota Medical School in 1985. Timothy Balder, MD Chief Medical Officer Janet is passionate about improving processes in all aspects of life—both at work and at home.  As an Industrial Engineer, Six-Sigma Greenbelt, and career Operations Leader, she thrives on driving organization, efficiency, and quality.  At home she enjoys honing her cooking and entertaining skills and learning about all aspects of food and wine. Janet Stormo VP Operations Kevin leads our business development. Kevin is passionate about finding and partnering with clients who can benefit the most from Pops. He has worked with multiple startups to create and grow their business. Kevin has more than eight years of experience in business development and angel investing. Kevin Lunke Business Development Manager Dan loves to tackle complex problems with science and engineering. He also has an extensive tackle box as an avid fisherman. His favorite fish is walleye fried in butter. You can often find Dan jogging around scenic Stillwater, playing with his grandkids or fishing in the middle of a remote lake. Dan Davis VP R&D & Security Officer Curt enjoys learning how things work and then making them better and is an avid DIYer with endless home projects. He enjoys traveling to see new places and having new adventures. Curt Christensen VP Manufacturing Let’s Do This Choose your adventure below. For Individuals Partners Pops Tools Products Individuals Portal Caregiver Portal Company About Blog Careers Investors Resources FAQ Contact Us Stay up to Date! First Name First Last Email Address * *By signing up, you agree to receive newsletters, announcements, and other goodness. Contact Us Phone: Support + 1 (800) 767-7268 Email: General [email protected] Support [email protected] Locations: Minneapolis, MN Sunnyvale, CA Copyright © 2020 - 2025 Pops Diabetes Care, Inc. POPS®, OWN YOUR LIFE®, THE REBEL™, SHOW DIABETES WHO’S BOSS®, MINA™ and all related logos and associated trademarks are proprietary to Pops Diabetes Care, Inc. and may not be used without written approval. Terms and Conditions Privacy Policy"
    },
    {
      "url": "https://www.namebubbles.com/pages/contact-us",
      "text": "Contact us | Name Bubbles Skip to main content Search Featured Sale School Daycare Half Orders Name Stamp Value Packs Wall Decals Shop All Shop By Sizes Mini Labels Small Labels Medium Labels Large Labels Extra Large Labels Shapes Circle Labels Square Labels Rectangle Labels Fun Shape Labels Half Orders Name Labels Clothing Labels Iron-On Labels Contact Clothing Labels Items Baby Bottle Labels Charger Labels Electronics Labels Laptop Labels Lunchbox Labels Pencil Labels Sippy Cup Labels Sock Labels Uniform Labels Water Bottle Labels Labels By Use Classroom Labels Clothing Stamp Contact Labels Dishwasher-Safe Labels Iron-On Labels Laundry-Safe Labels Microwave-Safe Labels Stick-On Labels Waterproof Labels Weatherproof Labels Wall Decals Waterproof Stickers Write-On Labels Sports Baseball Labels Basketball Labels Football Labels Golf Labels Hockey Labels Soccer Labels Dance Labels Activities Arts and Crafts Labels Catering Labels Instrument Labels Travel Labels Home Organization Pantry Labels Playroom Labels Storage Labels Shop All Name Labels Mini Rectangle Labels Rectangle Labels Small Rectangle Labels Large Rectangle Labels Circle Labels Large Circle Labels Fun Shape Labels Shop All Clothing Labels Stick-On Clothing Labels Iron-On Clothing Labels Shoe Labels Circle Stick-On Labels X-Small Stick-On Labels Circle Iron-On Labels Slim Iron-On Labels Shop All Daycare Labels Baby Bottle Labels Sippy Cup Labels Infant Labels Toddler Labels Car Seat Labels Shop All Camp Labels Day Camp Labels Summer Camp Labels Sleepaway Camp Labels Name Stamp Toiletry Labels Luggage Tag Labels Shop All School Labels Preschool Labels Kindergarten Labels Elementary School Labels Middle School Labels High School Labels College Labels Teacher Labels Shop All Custom Labels Custom Camp Labels Custom Clothing Labels Custom Daycare Labels Custom Iron-On Labels Custom Name Labels Custom School Labels Custom Write-On Labels Shop All Stamp Sale Partnerships Start a Partnership Partner Search Sign in Shipping Info Pack Comparison Guide Blog Start a Partnership Contact Us × Take Our Quiz To Find Your Perfect Pack! | All Orders Shipped 1-3 Business Days | Free Shipping to USA Over $50 There are no items in your cart. Search Search Shipping Guide Blog Account Cart 0 Featured Sale School Daycare Half Orders Name Stamp Value Packs Wall Decals Shop All Shop By Sizes Mini Labels Small Labels Medium Labels Large Labels Extra Large Labels Shapes Circle Labels Square Labels Rectangle Labels Fun Shape Labels Half Orders Name Labels Clothing Labels Iron-On Labels Contact Clothing Labels Items Baby Bottle Labels Charger Labels Electronics Labels Laptop Labels Lunchbox Labels Pencil Labels Sippy Cup Labels Sock Labels Uniform Labels Water Bottle Labels Labels By Use Classroom Labels Clothing Stamp Contact Labels Dishwasher-Safe Labels Iron-On Labels Laundry-Safe Labels Microwave-Safe Labels Stick-On Labels Waterproof Labels Weatherproof Labels Wall Decals Waterproof Stickers Write-On Labels Sports Baseball Labels Basketball Labels Football Labels Golf Labels Hockey Labels Soccer Labels Dance Labels Activities Arts and Crafts Labels Catering Labels Instrument Labels Travel Labels Home Organization Pantry Labels Playroom Labels Storage Labels Shop All Name Labels Mini Rectangle Labels Rectangle Labels Small Rectangle Labels Large Rectangle Labels Circle Labels Large Circle Labels Fun Shape Labels Shop All Clothing Labels Stick-On Clothing Labels Iron-On Clothing Labels Shoe Labels Circle Stick-On Labels X-Small Stick-On Labels Circle Iron-On Labels Slim Iron-On Labels Shop All Daycare Labels Baby Bottle Labels Sippy Cup Labels Infant Labels Toddler Labels Car Seat Labels Shop All Camp Labels Day Camp Labels Summer Camp Labels Sleepaway Camp Labels Name Stamp Toiletry Labels Luggage Tag Labels Shop All School Labels Preschool Labels Kindergarten Labels Elementary School Labels Middle School Labels High School Labels College Labels Teacher Labels Shop All Custom Labels Custom Camp Labels Custom Clothing Labels Custom Daycare Labels Custom Iron-On Labels Custom Name Labels Custom School Labels Custom Write-On Labels Shop All Stamp Sale Partnerships Start a Partnership Partner Search Contact us Please navigate to the bottom of this page in the footer under Need a Hand? Then, press \"Phone\" or \"Email\" to get in touch with a member from our team! We are available Monday - Friday between 9am - 5pm ET Want To Hear More From Name Bubbles? Check out our Partnership Program and earn 20% Commission on each sale Earn money by promoting our personalized labels at your school, daycare, camp, or other organization. Sign up, share your unique referral link, and earn a 20% commission on every net purchase made through your link. Sign Up Shop Name Labels Value Packs Clothing Labels Name Labels Sale Clothing Name Stamp Custom Labels Daycare Labels School Labels Camp Labels Name Bubbles Reviews Printables Blog Our Story Press Kit Site Map Partners Affiliate Program Giving Back Partner Search Start a Partnership Help Accounts Shipping Help Center Pack Comparison Guide Take Our Quiz Do Not Sell My Data Need a Hand? We're available by phone 1-866-797-6263 and chat Monday - Friday, 9am - 5pm ET. Phone Email FAQ © 2025 NameBubbles, All Rights Reserved Terms, Privacy, & Accessibility"
    },
    {
      "url": "https://mybubblepops.com/pages/bubble-pops-milk-tea-store-faqs",
      "text": "Bubble Pops: Boba Tea X Pop Culture the Store\n – BUBBLE POPS Skip to content Facebook Instagram TikTok Free shipping (USA) for orders over $30.  (*most products). Follow our Social Media for fun content and new drops! Discounts applied during checkout!        ON SALE NOW FOR LIMITED TIME! Home Boba Cocktail Social Lounge  FAQ's Blind Boxes Shirts / Tops Shirts / Tops Adults Kids & Teens Collections Collections Iconic Series Places Zen Culture K-Pop! Spooky SZN Winter Music & Tours Music & Tours ON TOUR AJR Ariana Grande Bad Bunny Beyoncé Britney Spears Doja Cat Drake Dua Lipa Karol G Lady Gaga Nicki Minaj Olivia Rodrigo Rihanna Taylor Swift Movies TV Movies & TV Hats Accessories Contact About us Log in Country/region Afghanistan (AFN\n                              ؋) Åland Islands (EUR\n                              €) Albania (ALL\n                              L) Algeria (DZD\n                              د.ج) Andorra (EUR\n                              €) Angola (USD\n                              $) Anguilla (XCD\n                              $) Antigua & Barbuda (XCD\n                              $) Argentina (USD\n                              $) Armenia (AMD\n                              դր.) Aruba (AWG\n                              ƒ) Ascension Island (SHP\n                              £) Australia (AUD\n                              $) Austria (EUR\n                              €) Azerbaijan (AZN\n                              ₼) Bahamas (BSD\n                              $) Bahrain (USD\n                              $) Bangladesh (BDT\n                              ৳) Barbados (BBD\n                              $) Belarus (USD\n                              $) Belgium (EUR\n                              €) Belize (BZD\n                              $) Benin (XOF\n                              Fr) Bermuda (USD\n                              $) Bhutan (USD\n                              $) Bolivia (BOB\n                              Bs.) Bosnia & Herzegovina (BAM\n                              КМ) Botswana (BWP\n                              P) Brazil (USD\n                              $) British Indian Ocean Territory (USD\n                              $) British Virgin Islands (USD\n                              $) Brunei (BND\n                              $) Bulgaria (BGN\n                              лв.) Burkina Faso (XOF\n                              Fr) Burundi (BIF\n                              Fr) Cambodia (KHR\n                              ៛) Cameroon (XAF\n                              CFA) Canada (CAD\n                              $) Cape Verde (CVE\n                              $) Caribbean Netherlands (USD\n                              $) Cayman Islands (KYD\n                              $) Central African Republic (XAF\n                              CFA) Chad (XAF\n                              CFA) Chile (USD\n                              $) China (CNY\n                              ¥) Christmas Island (AUD\n                              $) Cocos (Keeling) Islands (AUD\n                              $) Colombia (USD\n                              $) Comoros (KMF\n                              Fr) Congo - Brazzaville (XAF\n                              CFA) Congo - Kinshasa (CDF\n                              Fr) Cook Islands (NZD\n                              $) Costa Rica (CRC\n                              ₡) Côte d’Ivoire (XOF\n                              Fr) Croatia (EUR\n                              €) Curaçao (ANG\n                              ƒ) Cyprus (EUR\n                              €) Czechia (CZK\n                              Kč) Denmark (DKK\n                              kr.) Djibouti (DJF\n                              Fdj) Dominica (XCD\n                              $) Dominican Republic (DOP\n                              $) Ecuador (USD\n                              $) Egypt (EGP\n                              ج.م) El Salvador (USD\n                              $) Equatorial Guinea (XAF\n                              CFA) Eritrea (USD\n                              $) Estonia (EUR\n                              €) Eswatini (USD\n                              $) Ethiopia (ETB\n                              Br) Falkland Islands (FKP\n                              £) Faroe Islands (DKK\n                              kr.) Fiji (FJD\n                              $) Finland (EUR\n                              €) France (EUR\n                              €) French Guiana (EUR\n                              €) French Polynesia (XPF\n                              Fr) French Southern Territories (EUR\n                              €) Gabon (XOF\n                              Fr) Gambia (GMD\n                              D) Georgia (USD\n                              $) Germany (EUR\n                              €) Ghana (USD\n                              $) Gibraltar (GBP\n                              £) Greece (EUR\n                              €) Greenland (DKK\n                              kr.) Grenada (XCD\n                              $) Guadeloupe (EUR\n                              €) Guatemala (GTQ\n                              Q) Guernsey (GBP\n                              £) Guinea (GNF\n                              Fr) Guinea-Bissau (XOF\n                              Fr) Guyana (GYD\n                              $) Haiti (USD\n                              $) Honduras (HNL\n                              L) Hong Kong SAR (HKD\n                              $) Hungary (HUF\n                              Ft) Iceland (ISK\n                              kr) India (INR\n                              ₹) Indonesia (IDR\n                              Rp) Iraq (USD\n                              $) Ireland (EUR\n                              €) Isle of Man (GBP\n                              £) Israel (ILS\n                              ₪) Italy (EUR\n                              €) Jamaica (JMD\n                              $) Japan (JPY\n                              ¥) Jersey (USD\n                              $) Jordan (USD\n                              $) Kazakhstan (KZT\n                              ₸) Kenya (KES\n                              KSh) Kiribati (USD\n                              $) Kosovo (EUR\n                              €) Kuwait (USD\n                              $) Kyrgyzstan (KGS\n                              som) Laos (LAK\n                              ₭) Latvia (EUR\n                              €) Lebanon (LBP\n                              ل.ل) Lesotho (USD\n                              $) Liberia (USD\n                              $) Libya (USD\n                              $) Liechtenstein (CHF\n                              CHF) Lithuania (EUR\n                              €) Luxembourg (EUR\n                              €) Macao SAR (MOP\n                              P) Madagascar (USD\n                              $) Malawi (MWK\n                              MK) Malaysia (MYR\n                              RM) Maldives (MVR\n                              MVR) Mali (XOF\n                              Fr) Malta (EUR\n                              €) Martinique (EUR\n                              €) Mauritania (USD\n                              $) Mauritius (MUR\n                              ₨) Mayotte (EUR\n                              €) Mexico (USD\n                              $) Moldova (MDL\n                              L) Monaco (EUR\n                              €) Mongolia (MNT\n                              ₮) Montenegro (EUR\n                              €) Montserrat (XCD\n                              $) Morocco (MAD\n                              د.م.) Mozambique (USD\n                              $) Myanmar (Burma) (MMK\n                              K) Namibia (USD\n                              $) Nauru (AUD\n                              $) Nepal (NPR\n                              Rs.) Netherlands (EUR\n                              €) New Caledonia (XPF\n                              Fr) New Zealand (NZD\n                              $) Nicaragua (NIO\n                              C$) Niger (XOF\n                              Fr) Nigeria (NGN\n                              ₦) Niue (NZD\n                              $) Norfolk Island (AUD\n                              $) North Macedonia (MKD\n                              ден) Norway (USD\n                              $) Oman (USD\n                              $) Pakistan (PKR\n                              ₨) Palestinian Territories (ILS\n                              ₪) Panama (USD\n                              $) Papua New Guinea (PGK\n                              K) Paraguay (PYG\n                              ₲) Peru (PEN\n                              S/) Philippines (PHP\n                              ₱) Pitcairn Islands (NZD\n                              $) Poland (PLN\n                              zł) Portugal (EUR\n                              €) Qatar (QAR\n                              ر.ق) Réunion (EUR\n                              €) Romania (RON\n                              Lei) Russia (USD\n                              $) Rwanda (RWF\n                              FRw) Samoa (WST\n                              T) San Marino (EUR\n                              €) São Tomé & Príncipe (STD\n                              Db) Saudi Arabia (SAR\n                              ر.س) Senegal (XOF\n                              Fr) Serbia (RSD\n                              РСД) Seychelles (USD\n                              $) Sierra Leone (SLL\n                              Le) Singapore (SGD\n                              $) Sint Maarten (ANG\n                              ƒ) Slovakia (EUR\n                              €) Slovenia (EUR\n                              €) Solomon Islands (SBD\n                              $) Somalia (USD\n                              $) South Africa (USD\n                              $) South Georgia & South Sandwich Islands (GBP\n                              £) South Korea (KRW\n                              ₩) South Sudan (USD\n                              $) Spain (EUR\n                              €) Sri Lanka (LKR\n                              ₨) St. Barthélemy (EUR\n                              €) St. Helena (SHP\n                              £) St. Kitts & Nevis (XCD\n                              $) St. Lucia (XCD\n                              $) St. Martin (EUR\n                              €) St. Pierre & Miquelon (EUR\n                              €) St. Vincent & Grenadines (XCD\n                              $) Sudan (USD\n                              $) Suriname (USD\n                              $) Svalbard & Jan Mayen (USD\n                              $) Sweden (SEK\n                              kr) Switzerland (CHF\n                              CHF) Taiwan (TWD\n                              $) Tajikistan (TJS\n                              ЅМ) Tanzania (TZS\n                              Sh) Thailand (THB\n                              ฿) Timor-Leste (USD\n                              $) Togo (XOF\n                              Fr) Tokelau (NZD\n                              $) Tonga (TOP\n                              T$) Trinidad & Tobago (TTD\n                              $) Tristan da Cunha (GBP\n                              £) Tunisia (USD\n                              $) Türkiye (USD\n                              $) Turkmenistan (USD\n                              $) Turks & Caicos Islands (USD\n                              $) Tuvalu (AUD\n                              $) U.S. Outlying Islands (USD\n                              $) Uganda (UGX\n                              USh) Ukraine (UAH\n                              ₴) United Arab Emirates (AED\n                              د.إ) United Kingdom (GBP\n                              £) United States (USD\n                              $) Uruguay (UYU\n                              $U) Uzbekistan (UZS\n                              so'm) Vanuatu (VUV\n                              Vt) Vatican City (EUR\n                              €) Venezuela (USD\n                              $) Vietnam (VND\n                              ₫) Wallis & Futuna (XPF\n                              Fr) Western Sahara (MAD\n                              د.م.) Yemen (YER\n                              ﷼) Zambia (USD\n                              $) Zimbabwe (USD\n                              $) Update country/region Country/region USD\n      $ | United States AFN\n              ؋ | Afghanistan EUR\n              € | Åland Islands ALL\n              L | Albania DZD\n              د.ج | Algeria EUR\n              € | Andorra USD\n              $ | Angola XCD\n              $ | Anguilla XCD\n              $ | Antigua & Barbuda USD\n              $ | Argentina AMD\n              դր. | Armenia AWG\n              ƒ | Aruba SHP\n              £ | Ascension Island AUD\n              $ | Australia EUR\n              € | Austria AZN\n              ₼ | Azerbaijan BSD\n              $ | Bahamas USD\n              $ | Bahrain BDT\n              ৳ | Bangladesh BBD\n              $ | Barbados USD\n              $ | Belarus EUR\n              € | Belgium BZD\n              $ | Belize XOF\n              Fr | Benin USD\n              $ | Bermuda USD\n              $ | Bhutan BOB\n              Bs. | Bolivia BAM\n              КМ | Bosnia & Herzegovina BWP\n              P | Botswana USD\n              $ | Brazil USD\n              $ | British Indian Ocean Territory USD\n              $ | British Virgin Islands BND\n              $ | Brunei BGN\n              лв. | Bulgaria XOF\n              Fr | Burkina Faso BIF\n              Fr | Burundi KHR\n              ៛ | Cambodia XAF\n              CFA | Cameroon CAD\n              $ | Canada CVE\n              $ | Cape Verde USD\n              $ | Caribbean Netherlands KYD\n              $ | Cayman Islands XAF\n              CFA | Central African Republic XAF\n              CFA | Chad USD\n              $ | Chile CNY\n              ¥ | China AUD\n              $ | Christmas Island AUD\n              $ | Cocos (Keeling) Islands USD\n              $ | Colombia KMF\n              Fr | Comoros XAF\n              CFA | Congo - Brazzaville CDF\n              Fr | Congo - Kinshasa NZD\n              $ | Cook Islands CRC\n              ₡ | Costa Rica XOF\n              Fr | Côte d’Ivoire EUR\n              € | Croatia ANG\n              ƒ | Curaçao EUR\n              € | Cyprus CZK\n              Kč | Czechia DKK\n              kr. | Denmark DJF\n              Fdj | Djibouti XCD\n              $ | Dominica DOP\n              $ | Dominican Republic USD\n              $ | Ecuador EGP\n              ج.م | Egypt USD\n              $ | El Salvador XAF\n              CFA | Equatorial Guinea USD\n              $ | Eritrea EUR\n              € | Estonia USD\n              $ | Eswatini ETB\n              Br | Ethiopia FKP\n              £ | Falkland Islands DKK\n              kr. | Faroe Islands FJD\n              $ | Fiji EUR\n              € | Finland EUR\n              € | France EUR\n              € | French Guiana XPF\n              Fr | French Polynesia EUR\n              € | French Southern Territories XOF\n              Fr | Gabon GMD\n              D | Gambia USD\n              $ | Georgia EUR\n              € | Germany USD\n              $ | Ghana GBP\n              £ | Gibraltar EUR\n              € | Greece DKK\n              kr. | Greenland XCD\n              $ | Grenada EUR\n              € | Guadeloupe GTQ\n              Q | Guatemala GBP\n              £ | Guernsey GNF\n              Fr | Guinea XOF\n              Fr | Guinea-Bissau GYD\n              $ | Guyana USD\n              $ | Haiti HNL\n              L | Honduras HKD\n              $ | Hong Kong SAR HUF\n              Ft | Hungary ISK\n              kr | Iceland INR\n              ₹ | India IDR\n              Rp | Indonesia USD\n              $ | Iraq EUR\n              € | Ireland GBP\n              £ | Isle of Man ILS\n              ₪ | Israel EUR\n              € | Italy JMD\n              $ | Jamaica JPY\n              ¥ | Japan USD\n              $ | Jersey USD\n              $ | Jordan KZT\n              ₸ | Kazakhstan KES\n              KSh | Kenya USD\n              $ | Kiribati EUR\n              € | Kosovo USD\n              $ | Kuwait KGS\n              som | Kyrgyzstan LAK\n              ₭ | Laos EUR\n              € | Latvia LBP\n              ل.ل | Lebanon USD\n              $ | Lesotho USD\n              $ | Liberia USD\n              $ | Libya CHF\n              CHF | Liechtenstein EUR\n              € | Lithuania EUR\n              € | Luxembourg MOP\n              P | Macao SAR USD\n              $ | Madagascar MWK\n              MK | Malawi MYR\n              RM | Malaysia MVR\n              MVR | Maldives XOF\n              Fr | Mali EUR\n              € | Malta EUR\n              € | Martinique USD\n              $ | Mauritania MUR\n              ₨ | Mauritius EUR\n              € | Mayotte USD\n              $ | Mexico MDL\n              L | Moldova EUR\n              € | Monaco MNT\n              ₮ | Mongolia EUR\n              € | Montenegro XCD\n              $ | Montserrat MAD\n              د.م. | Morocco USD\n              $ | Mozambique MMK\n              K | Myanmar (Burma) USD\n              $ | Namibia AUD\n              $ | Nauru NPR\n              Rs. | Nepal EUR\n              € | Netherlands XPF\n              Fr | New Caledonia NZD\n              $ | New Zealand NIO\n              C$ | Nicaragua XOF\n              Fr | Niger NGN\n              ₦ | Nigeria NZD\n              $ | Niue AUD\n              $ | Norfolk Island MKD\n              ден | North Macedonia USD\n              $ | Norway USD\n              $ | Oman PKR\n              ₨ | Pakistan ILS\n              ₪ | Palestinian Territories USD\n              $ | Panama PGK\n              K | Papua New Guinea PYG\n              ₲ | Paraguay PEN\n              S/ | Peru PHP\n              ₱ | Philippines NZD\n              $ | Pitcairn Islands PLN\n              zł | Poland EUR\n              € | Portugal QAR\n              ر.ق | Qatar EUR\n              € | Réunion RON\n              Lei | Romania USD\n              $ | Russia RWF\n              FRw | Rwanda WST\n              T | Samoa EUR\n              € | San Marino STD\n              Db | São Tomé & Príncipe SAR\n              ر.س | Saudi Arabia XOF\n              Fr | Senegal RSD\n              РСД | Serbia USD\n              $ | Seychelles SLL\n              Le | Sierra Leone SGD\n              $ | Singapore ANG\n              ƒ | Sint Maarten EUR\n              € | Slovakia EUR\n              € | Slovenia SBD\n              $ | Solomon Islands USD\n              $ | Somalia USD\n              $ | South Africa GBP\n              £ | South Georgia & South Sandwich Islands KRW\n              ₩ | South Korea USD\n              $ | South Sudan EUR\n              € | Spain LKR\n              ₨ | Sri Lanka EUR\n              € | St. Barthélemy SHP\n              £ | St. Helena XCD\n              $ | St. Kitts & Nevis XCD\n              $ | St. Lucia EUR\n              € | St. Martin EUR\n              € | St. Pierre & Miquelon XCD\n              $ | St. Vincent & Grenadines USD\n              $ | Sudan USD\n              $ | Suriname USD\n              $ | Svalbard & Jan Mayen SEK\n              kr | Sweden CHF\n              CHF | Switzerland TWD\n              $ | Taiwan TJS\n              ЅМ | Tajikistan TZS\n              Sh | Tanzania THB\n              ฿ | Thailand USD\n              $ | Timor-Leste XOF\n              Fr | Togo NZD\n              $ | Tokelau TOP\n              T$ | Tonga TTD\n              $ | Trinidad & Tobago GBP\n              £ | Tristan da Cunha USD\n              $ | Tunisia USD\n              $ | Türkiye USD\n              $ | Turkmenistan USD\n              $ | Turks & Caicos Islands AUD\n              $ | Tuvalu USD\n              $ | U.S. Outlying Islands UGX\n              USh | Uganda UAH\n              ₴ | Ukraine AED\n              د.إ | United Arab Emirates GBP\n              £ | United Kingdom USD\n              $ | United States UYU\n              $U | Uruguay UZS\n              so'm | Uzbekistan VUV\n              Vt | Vanuatu EUR\n              € | Vatican City USD\n              $ | Venezuela VND\n              ₫ | Vietnam XPF\n              Fr | Wallis & Futuna MAD\n              د.م. | Western Sahara YER\n              ﷼ | Yemen USD\n              $ | Zambia USD\n              $ | Zimbabwe Facebook Instagram TikTok Search Home Boba Cocktail Social Lounge  FAQ's Blind Boxes Shirts / Tops Adults Kids & Teens Collections Iconic Series Places Zen Culture K-Pop! Spooky SZN Winter Music & Tours ON TOUR AJR Ariana Grande Bad Bunny Beyoncé Britney Spears Doja Cat Drake Dua Lipa Karol G Lady Gaga Nicki Minaj Olivia Rodrigo Rihanna Taylor Swift Movies TV Movies & TV Hats Accessories Contact About us Country/region Afghanistan (AFN ؋) Åland Islands (EUR €) Albania (ALL L) Algeria (DZD د.ج) Andorra (EUR €) Angola (USD $) Anguilla (XCD $) Antigua & Barbuda (XCD $) Argentina (USD $) Armenia (AMD դր.) Aruba (AWG ƒ) Ascension Island (SHP £) Australia (AUD $) Austria (EUR €) Azerbaijan (AZN ₼) Bahamas (BSD $) Bahrain (USD $) Bangladesh (BDT ৳) Barbados (BBD $) Belarus (USD $) Belgium (EUR €) Belize (BZD $) Benin (XOF Fr) Bermuda (USD $) Bhutan (USD $) Bolivia (BOB Bs.) Bosnia & Herzegovina (BAM КМ) Botswana (BWP P) Brazil (USD $) British Indian Ocean Territory (USD $) British Virgin Islands (USD $) Brunei (BND $) Bulgaria (BGN лв.) Burkina Faso (XOF Fr) Burundi (BIF Fr) Cambodia (KHR ៛) Cameroon (XAF CFA) Canada (CAD $) Cape Verde (CVE $) Caribbean Netherlands (USD $) Cayman Islands (KYD $) Central African Republic (XAF CFA) Chad (XAF CFA) Chile (USD $) China (CNY ¥) Christmas Island (AUD $) Cocos (Keeling) Islands (AUD $) Colombia (USD $) Comoros (KMF Fr) Congo - Brazzaville (XAF CFA) Congo - Kinshasa (CDF Fr) Cook Islands (NZD $) Costa Rica (CRC ₡) Côte d’Ivoire (XOF Fr) Croatia (EUR €) Curaçao (ANG ƒ) Cyprus (EUR €) Czechia (CZK Kč) Denmark (DKK kr.) Djibouti (DJF Fdj) Dominica (XCD $) Dominican Republic (DOP $) Ecuador (USD $) Egypt (EGP ج.م) El Salvador (USD $) Equatorial Guinea (XAF CFA) Eritrea (USD $) Estonia (EUR €) Eswatini (USD $) Ethiopia (ETB Br) Falkland Islands (FKP £) Faroe Islands (DKK kr.) Fiji (FJD $) Finland (EUR €) France (EUR €) French Guiana (EUR €) French Polynesia (XPF Fr) French Southern Territories (EUR €) Gabon (XOF Fr) Gambia (GMD D) Georgia (USD $) Germany (EUR €) Ghana (USD $) Gibraltar (GBP £) Greece (EUR €) Greenland (DKK kr.) Grenada (XCD $) Guadeloupe (EUR €) Guatemala (GTQ Q) Guernsey (GBP £) Guinea (GNF Fr) Guinea-Bissau (XOF Fr) Guyana (GYD $) Haiti (USD $) Honduras (HNL L) Hong Kong SAR (HKD $) Hungary (HUF Ft) Iceland (ISK kr) India (INR ₹) Indonesia (IDR Rp) Iraq (USD $) Ireland (EUR €) Isle of Man (GBP £) Israel (ILS ₪) Italy (EUR €) Jamaica (JMD $) Japan (JPY ¥) Jersey (USD $) Jordan (USD $) Kazakhstan (KZT ₸) Kenya (KES KSh) Kiribati (USD $) Kosovo (EUR €) Kuwait (USD $) Kyrgyzstan (KGS som) Laos (LAK ₭) Latvia (EUR €) Lebanon (LBP ل.ل) Lesotho (USD $) Liberia (USD $) Libya (USD $) Liechtenstein (CHF CHF) Lithuania (EUR €) Luxembourg (EUR €) Macao SAR (MOP P) Madagascar (USD $) Malawi (MWK MK) Malaysia (MYR RM) Maldives (MVR MVR) Mali (XOF Fr) Malta (EUR €) Martinique (EUR €) Mauritania (USD $) Mauritius (MUR ₨) Mayotte (EUR €) Mexico (USD $) Moldova (MDL L) Monaco (EUR €) Mongolia (MNT ₮) Montenegro (EUR €) Montserrat (XCD $) Morocco (MAD د.م.) Mozambique (USD $) Myanmar (Burma) (MMK K) Namibia (USD $) Nauru (AUD $) Nepal (NPR Rs.) Netherlands (EUR €) New Caledonia (XPF Fr) New Zealand (NZD $) Nicaragua (NIO C$) Niger (XOF Fr) Nigeria (NGN ₦) Niue (NZD $) Norfolk Island (AUD $) North Macedonia (MKD ден) Norway (USD $) Oman (USD $) Pakistan (PKR ₨) Palestinian Territories (ILS ₪) Panama (USD $) Papua New Guinea (PGK K) Paraguay (PYG ₲) Peru (PEN S/) Philippines (PHP ₱) Pitcairn Islands (NZD $) Poland (PLN zł) Portugal (EUR €) Qatar (QAR ر.ق) Réunion (EUR €) Romania (RON Lei) Russia (USD $) Rwanda (RWF FRw) Samoa (WST T) San Marino (EUR €) São Tomé & Príncipe (STD Db) Saudi Arabia (SAR ر.س) Senegal (XOF Fr) Serbia (RSD РСД) Seychelles (USD $) Sierra Leone (SLL Le) Singapore (SGD $) Sint Maarten (ANG ƒ) Slovakia (EUR €) Slovenia (EUR €) Solomon Islands (SBD $) Somalia (USD $) South Africa (USD $) South Georgia & South Sandwich Islands (GBP £) South Korea (KRW ₩) South Sudan (USD $) Spain (EUR €) Sri Lanka (LKR ₨) St. Barthélemy (EUR €) St. Helena (SHP £) St. Kitts & Nevis (XCD $) St. Lucia (XCD $) St. Martin (EUR €) St. Pierre & Miquelon (EUR €) St. Vincent & Grenadines (XCD $) Sudan (USD $) Suriname (USD $) Svalbard & Jan Mayen (USD $) Sweden (SEK kr) Switzerland (CHF CHF) Taiwan (TWD $) Tajikistan (TJS ЅМ) Tanzania (TZS Sh) Thailand (THB ฿) Timor-Leste (USD $) Togo (XOF Fr) Tokelau (NZD $) Tonga (TOP T$) Trinidad & Tobago (TTD $) Tristan da Cunha (GBP £) Tunisia (USD $) Türkiye (USD $) Turkmenistan (USD $) Turks & Caicos Islands (USD $) Tuvalu (AUD $) U.S. Outlying Islands (USD $) Uganda (UGX USh) Ukraine (UAH ₴) United Arab Emirates (AED د.إ) United Kingdom (GBP £) United States (USD $) Uruguay (UYU $U) Uzbekistan (UZS so'm) Vanuatu (VUV Vt) Vatican City (EUR €) Venezuela (USD $) Vietnam (VND ₫) Wallis & Futuna (XPF Fr) Western Sahara (MAD د.م.) Yemen (YER ﷼) Zambia (USD $) Zimbabwe (USD $) Update country/region Country/region USD\n      $ | United States AFN\n              ؋ | Afghanistan EUR\n              € | Åland Islands ALL\n              L | Albania DZD\n              د.ج | Algeria EUR\n              € | Andorra USD\n              $ | Angola XCD\n              $ | Anguilla XCD\n              $ | Antigua & Barbuda USD\n              $ | Argentina AMD\n              դր. | Armenia AWG\n              ƒ | Aruba SHP\n              £ | Ascension Island AUD\n              $ | Australia EUR\n              € | Austria AZN\n              ₼ | Azerbaijan BSD\n              $ | Bahamas USD\n              $ | Bahrain BDT\n              ৳ | Bangladesh BBD\n              $ | Barbados USD\n              $ | Belarus EUR\n              € | Belgium BZD\n              $ | Belize XOF\n              Fr | Benin USD\n              $ | Bermuda USD\n              $ | Bhutan BOB\n              Bs. | Bolivia BAM\n              КМ | Bosnia & Herzegovina BWP\n              P | Botswana USD\n              $ | Brazil USD\n              $ | British Indian Ocean Territory USD\n              $ | British Virgin Islands BND\n              $ | Brunei BGN\n              лв. | Bulgaria XOF\n              Fr | Burkina Faso BIF\n              Fr | Burundi KHR\n              ៛ | Cambodia XAF\n              CFA | Cameroon CAD\n              $ | Canada CVE\n              $ | Cape Verde USD\n              $ | Caribbean Netherlands KYD\n              $ | Cayman Islands XAF\n              CFA | Central African Republic XAF\n              CFA | Chad USD\n              $ | Chile CNY\n              ¥ | China AUD\n              $ | Christmas Island AUD\n              $ | Cocos (Keeling) Islands USD\n              $ | Colombia KMF\n              Fr | Comoros XAF\n              CFA | Congo - Brazzaville CDF\n              Fr | Congo - Kinshasa NZD\n              $ | Cook Islands CRC\n              ₡ | Costa Rica XOF\n              Fr | Côte d’Ivoire EUR\n              € | Croatia ANG\n              ƒ | Curaçao EUR\n              € | Cyprus CZK\n              Kč | Czechia DKK\n              kr. | Denmark DJF\n              Fdj | Djibouti XCD\n              $ | Dominica DOP\n              $ | Dominican Republic USD\n              $ | Ecuador EGP\n              ج.م | Egypt USD\n              $ | El Salvador XAF\n              CFA | Equatorial Guinea USD\n              $ | Eritrea EUR\n              € | Estonia USD\n              $ | Eswatini ETB\n              Br | Ethiopia FKP\n              £ | Falkland Islands DKK\n              kr. | Faroe Islands FJD\n              $ | Fiji EUR\n              € | Finland EUR\n              € | France EUR\n              € | French Guiana XPF\n              Fr | French Polynesia EUR\n              € | French Southern Territories XOF\n              Fr | Gabon GMD\n              D | Gambia USD\n              $ | Georgia EUR\n              € | Germany USD\n              $ | Ghana GBP\n              £ | Gibraltar EUR\n              € | Greece DKK\n              kr. | Greenland XCD\n              $ | Grenada EUR\n              € | Guadeloupe GTQ\n              Q | Guatemala GBP\n              £ | Guernsey GNF\n              Fr | Guinea XOF\n              Fr | Guinea-Bissau GYD\n              $ | Guyana USD\n              $ | Haiti HNL\n              L | Honduras HKD\n              $ | Hong Kong SAR HUF\n              Ft | Hungary ISK\n              kr | Iceland INR\n              ₹ | India IDR\n              Rp | Indonesia USD\n              $ | Iraq EUR\n              € | Ireland GBP\n              £ | Isle of Man ILS\n              ₪ | Israel EUR\n              € | Italy JMD\n              $ | Jamaica JPY\n              ¥ | Japan USD\n              $ | Jersey USD\n              $ | Jordan KZT\n              ₸ | Kazakhstan KES\n              KSh | Kenya USD\n              $ | Kiribati EUR\n              € | Kosovo USD\n              $ | Kuwait KGS\n              som | Kyrgyzstan LAK\n              ₭ | Laos EUR\n              € | Latvia LBP\n              ل.ل | Lebanon USD\n              $ | Lesotho USD\n              $ | Liberia USD\n              $ | Libya CHF\n              CHF | Liechtenstein EUR\n              € | Lithuania EUR\n              € | Luxembourg MOP\n              P | Macao SAR USD\n              $ | Madagascar MWK\n              MK | Malawi MYR\n              RM | Malaysia MVR\n              MVR | Maldives XOF\n              Fr | Mali EUR\n              € | Malta EUR\n              € | Martinique USD\n              $ | Mauritania MUR\n              ₨ | Mauritius EUR\n              € | Mayotte USD\n              $ | Mexico MDL\n              L | Moldova EUR\n              € | Monaco MNT\n              ₮ | Mongolia EUR\n              € | Montenegro XCD\n              $ | Montserrat MAD\n              د.م. | Morocco USD\n              $ | Mozambique MMK\n              K | Myanmar (Burma) USD\n              $ | Namibia AUD\n              $ | Nauru NPR\n              Rs. | Nepal EUR\n              € | Netherlands XPF\n              Fr | New Caledonia NZD\n              $ | New Zealand NIO\n              C$ | Nicaragua XOF\n              Fr | Niger NGN\n              ₦ | Nigeria NZD\n              $ | Niue AUD\n              $ | Norfolk Island MKD\n              ден | North Macedonia USD\n              $ | Norway USD\n              $ | Oman PKR\n              ₨ | Pakistan ILS\n              ₪ | Palestinian Territories USD\n              $ | Panama PGK\n              K | Papua New Guinea PYG\n              ₲ | Paraguay PEN\n              S/ | Peru PHP\n              ₱ | Philippines NZD\n              $ | Pitcairn Islands PLN\n              zł | Poland EUR\n              € | Portugal QAR\n              ر.ق | Qatar EUR\n              € | Réunion RON\n              Lei | Romania USD\n              $ | Russia RWF\n              FRw | Rwanda WST\n              T | Samoa EUR\n              € | San Marino STD\n              Db | São Tomé & Príncipe SAR\n              ر.س | Saudi Arabia XOF\n              Fr | Senegal RSD\n              РСД | Serbia USD\n              $ | Seychelles SLL\n              Le | Sierra Leone SGD\n              $ | Singapore ANG\n              ƒ | Sint Maarten EUR\n              € | Slovakia EUR\n              € | Slovenia SBD\n              $ | Solomon Islands USD\n              $ | Somalia USD\n              $ | South Africa GBP\n              £ | South Georgia & South Sandwich Islands KRW\n              ₩ | South Korea USD\n              $ | South Sudan EUR\n              € | Spain LKR\n              ₨ | Sri Lanka EUR\n              € | St. Barthélemy SHP\n              £ | St. Helena XCD\n              $ | St. Kitts & Nevis XCD\n              $ | St. Lucia EUR\n              € | St. Martin EUR\n              € | St. Pierre & Miquelon XCD\n              $ | St. Vincent & Grenadines USD\n              $ | Sudan USD\n              $ | Suriname USD\n              $ | Svalbard & Jan Mayen SEK\n              kr | Sweden CHF\n              CHF | Switzerland TWD\n              $ | Taiwan TJS\n              ЅМ | Tajikistan TZS\n              Sh | Tanzania THB\n              ฿ | Thailand USD\n              $ | Timor-Leste XOF\n              Fr | Togo NZD\n              $ | Tokelau TOP\n              T$ | Tonga TTD\n              $ | Trinidad & Tobago GBP\n              £ | Tristan da Cunha USD\n              $ | Tunisia USD\n              $ | Türkiye USD\n              $ | Turkmenistan USD\n              $ | Turks & Caicos Islands AUD\n              $ | Tuvalu USD\n              $ | U.S. Outlying Islands UGX\n              USh | Uganda UAH\n              ₴ | Ukraine AED\n              د.إ | United Arab Emirates GBP\n              £ | United Kingdom USD\n              $ | United States UYU\n              $U | Uruguay UZS\n              so'm | Uzbekistan VUV\n              Vt | Vanuatu EUR\n              € | Vatican City USD\n              $ | Venezuela VND\n              ₫ | Vietnam XPF\n              Fr | Wallis & Futuna MAD\n              د.م. | Western Sahara YER\n              ﷼ | Yemen USD\n              $ | Zambia USD\n              $ | Zimbabwe Search Log in Cart We're Open! Milk teas, smoothies, Asian street food, and more! Get ready to sip, savor, and indulge this  2025! 🌞🥤 From creamy Milk Teas to refreshing Smoothies, and a tantalizing array of Asian Street Food delights, our menu promises a culinary journey like no other. Fruit Tea Experience the burst of refreshing flavors in every sip of our fruit teas. Infused with a delightful blend of natural fruits, each cup offers a unique and invigorating taste adventure, customizable with bobas, jellies, or even jam. Pop Culture Merch Indulge in our exclusive collection of pop culture merch, meticulously designed by us. Grab yours in-store while you savor your favorite drink! Don't miss out on this perfect blend of style and refreshment. Asian Street Food Immerse yourself in the vibrant flavors of Asian street food with our delectable offerings! Savor the crispy perfection of Goyza, delight in the fresh and crunchy spring rolls, and explore a variety of other mouthwatering treats. Each bite promises a burst of authentic taste, bringing the bustling streets of Asia to your plate. Bubble Pops The Store FAQ's Q.\tTell us about Bubble Pops A.\tWe are a social hub where the atmosphere is electric, the drinks are refreshing, and the snacks are downright delicious. Our space is decked out with trendy pop culture merchandise like Labubus and more! We know you're here for more than just the amazing drinks—you’re here for the vibe and those Instagram-worthy snaps! And guess what? We're the only place in Central FL where you can sip on Boba Cocktails! Come for the fun, stay for the memories! Q.\tWhat are your store hours and locations? A.\tOur very first location is in sunny St. Cloud, FL, just a hop, skip, and a jump away from Orlando and Kissimmee! 🌴✨ 🕒 Hours of Fun: Sun-Thurs: 11AM - 10PM Fri & Sat: 11AM - Midnight 📍 Find Us Here: 4533 Old Canoe Creek Rd. Saint Cloud, FL 32769 Q.\tWhat types of boba tea do you offer? A.\tGet ready to dive into a world of deliciousness with our amazing boba tea selection! From classic milk teas and refreshing fruit teas to zesty lemonades, creamy smoothies, and aromatic coffee, there's something for everyone. Don't miss out on our fun signature drinks like SWIFTEA, YODABOBA, and PURPLE RAIN! Plus, for those 21 and over, we've got a fantastic range of beer and cocktails to add a little extra sparkle to your day. Come sip, savor, and enjoy! 🌟🍹🧋 Q.\tWill you have snacks or food available? A.\tAbsolutely! We offer a delicious selection of Asian street food, including mouthwatering Takoyaki, savory Gyoza, and crispy Spring Rolls. Come take your taste buds on a delightful adventure! Q.\tCan I buy merch from your online store (Mybubblepops.com) but at the St. Cloud store? A.\tWe've got an awesome array of pop culture goodies that will keep you coming back for more. Our collection is always fresh and fun, with new items rotating in regularly. Q.\tWhat sets this store apart from other boba tea shops? A.\tExperience a tea spot like no other! At our place, we blend pop culture with a dash of fun. Forget the quiet, traditional tea scene – here, you’ll find lively music, exciting games, and a calendar packed with special events like Themed Bingo and Trivia Nights. And did we mention our Boba Cocktails? Sip, play, and celebrate with us! Q.\tCan you host birthday parties, group outings or events? A.\t🎉 Yes, we have an awesome birthday package! 🎉 Whether you're planning a private event, team outing, or a fun-filled birthday bash, we've got you covered! Let us know what you're dreaming of, and we'll make it a reality. Drop us a line at INFO@MYBUBBLEPOPS.COM for all the details. Let's make your celebration unforgettable! 🎈✨ Q.\tDo you offer vegan or dairy-free options? A.\tYep, we've got you covered with vegan and dairy-free options galore! From non-dairy milk alternatives to delicious fruit tea drinks (and snacks), there's something for everyone. And guess what? Boba itself is totally vegan! Swing by and chat with our awesome staff for all the tasty details! Q.\tIs there Wi-Fi available at the store? A.\tWe’ve got free Wi-Fi for all our awesome customers. So, bring your laptop or tablet, sip on your boba tea, and let the productivity party begin! Q.\tDo you have any loyalty or rewards programs? A.\tYes, please see staff!  We use Clover app for rewards during checkout. Q.\tCan I customize my drink? A.\tDive into the fun of customizing your drink! Pick your favorite tea base, decide how sweet you want it, choose your milk, and go wild with add-ons like boba, jellies, and so much more. Make every sip your own unique creation! Q.\tHow can I stay updated on new products and events? A.\tFollow us on our social media channels for the latest updates on new products, events, and special promotions. Q.\tAre pets allowed in the store? A.\tService animals are welcome! Q.\tDo you offer any gluten-free options? A.\tYes, we have a selection of gluten-free snacks and drinks available. Please ask our staff for more details when you visit. Q.\tIs there parking available? A.\tYes, we have ample parking available for our customers at the St. Cloud location. Q.\tDo you have a lost and found? A.\tYes, if you’ve lost something at our store, please contact our staff or email INFO@MYBUBBLEPOPS.COM with a description of the item. Q.\tWhat forms of payment do you accept? A.\tWe accept all major credit cards, debit cards, and mobile payments such as Apple Pay and Google Wallet. Quick links Search Terms of Service Shipping Policy Refund Policy Privacy Policy Contact Information Join our Mailing List for Exclusive Deals and Updates! Email Facebook Instagram TikTok Payment methods American Express Apple Pay Bancontact Discover Google Pay iDEAL Mastercard PayPal Shop Pay Visa © 2025, BUBBLE POPS Refund policy Privacy policy Terms of service Shipping policy Contact information Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://bubbletcosmetics.com/pages/contact",
      "text": "Contact Us | Bubble T Cosmetics Skip to content 10% OFF WITH CODE: BUBBLE10 FREE UK SHIPPING OVER £20 Pause slideshow Play slideshow Shop All Build A Bundle New Kellogg's Shower Gel Bath Bath Body Body Skincare Skincare Gifting Loyal-t Club 🩷 Login Facebook X (Twitter) Instagram YouTube TikTok Pinterest Search Site navigation Bubble T Cosmetics Shop All Shop All Build A Bundle Build A Bundle New New Kellogg's Kellogg's Shower Gel Shower Gel Bath Bath Bath Bombs Bath Pearls Bath Salts Bubble Bath Shop All Bath Body Body Body Lotion Body Mist Body Scrub Body Wash Shop All Body Skincare Skincare Cleansers Eye Patches Face Serum Hand Cream Lip Balm Lip Mask Treatment Sheet Masks Shop All Skincare Gifting Gifting Loyal-t Club 🩷 Loyal-t Club 🩷 Search Login Your Cart 0 Site navigation Your Cart 0 Recently viewed Your Cart Your cart is currently empty. Not sure where to start? Try these collections: Continue shopping Spend £20.00 more to reach free shipping! Order note Discount Order special instructions Order note Apply Discount Discount code Apply Tax included and shipping calculated at checkout Subtotal £0.00 GBP Checkout Recently viewed Search Search Clear Contact Us We absolutely love to hear your feedback! Getting in touch with us is easy, simply fill out the form on this page or email info@bubbletcosmetics.com . For any press enquiries please also email info@bubbletcosmetics.com and we will pass this over to the relevant people as quickly as possible. If you would like to register your interest in becoming an online wholesale customer click here . Or, if you are a bit more traditional and would prefer to write to us you can send your details (or gifts, we like presents too) to: Bubble T Cosmetics Ltd 159 Iverson Road London, NW6 2RB If you're looking to get in touch regarding your delivery, please find out more here Bubble T HQ Address 159 Iverson Road Bubble T Cosmetics, NW6 2RB London Opening hours Mon - Fri 9:30am - 5:30pm Saturday Closed Sunday Closed Get directions Let your customers get in touch with you by filling out the email form below. Name Email Phone number Product Order Press Other Subject Message Send message Send message This site is protected by hCaptcha and the hCaptcha Privacy Policy and Terms of Service apply. Wholesale trade@bubbletcosmetics.com Email info@bubbletcosmetics.com Opening Hours mo – fri: 09:30 – 17:30 Follow us Facebook X (Twitter) Instagram YouTube TikTok Pinterest Customer service email: info@bubbletcosmetics.com Fast Free Shipping Get free shipping on orders of £20 or more Refer a friend Refer a friend and get 15% off each other. Secure payment Your payment information is processed securely Bubble T Cosmetics Help Delivery Contact SLS vs SLES Privacy Policy Returns Terms & Conditions About Us About Contact Wholesale info@bubbletcosmetics.com WANT 10% OFF? Enter your email Sign up to our newsletter to get weekly deals, even deeper discounts and exclusive offers sent straight to your inbox! Facebook X (Twitter) Instagram YouTube TikTok Pinterest Refund policy Privacy policy Terms of service Choosing a selection results in a full page refresh. Opens in a new window."
    },
    {
      "url": "https://bubbleenterprises.co.uk/about-us/",
      "text": "About Us - Bubble EnterprisesBubble Enterprises Bubble Enterprises Community Interest Company Where good ideas become great enterprises Associates Services Brands Associates Partnership Consulting Enterprises Education Cafes Pods Projects Blog About Our Inspirations Our Academics Our Faith Leaders Contact About Us Bubble Enterprises specialises in delivering skills and knowledge to startups and spin-off ventures. Based in Greater Manchester, we work with clients across the North West of England and beyond – from individuals and organisations of all kinds in the third sector to commercial companies requiring entrepreneurial expertise. “Whether it’s equipping you with business skills or growth strategies, we will work with you and your organisation to turn your idea into a profitable business.” Our startup story Like all businesses, Bubble started life as an idea. A trio of business professionals with experience in running our own ventures, the Bubble founders came up with an idea to create a business incubator providing early stage business support to individuals and organisations. Throughout our careers we’d witnessed firsthand just how beneficial business support can be for startups. We wanted to be instrumental in helping fledgling ventures stay in business for the long term. In 2001 we approached Manchester Business School with our idea and soon after, we successfully launched Manchester Business School’s Incubator and our business, Bubble Partnership. We quickly realised that entrepreneurial skill sets could also be applied within communities, providing opportunities for individuals on the margins of society to take control of their own futures. This led to the creation of sister business Bubble Enterprises CIC and the Bubble Enterprise Engagement Programme – an initiative aimed at budding entrepreneurs and startups facing significant challenges. Since the programme started out, we’ve helped more than 1,750 people explore enterprise opportunities, with many going on to start their own businesses. We’re passionate about making a difference to communities – both economically and socially, which is why we commit to work with many of our entrepreneurs and organisations throughout the life of their business. Share this: Meet our people Dr Leigh Wharton – Director Leigh is a founding Director of both Bubble Partnership Ltd and Bubble Enterprises CIC. He specialises in providing consultancy services for high-growth clients, as well as supporting individuals and organisations starting or developing new business ventures. Areas of expertise range from preparing companies for market entry and assisting with initial sales to helping businesses maximise investment and growth. Leigh is a Fellow of the Royal Society of Arts (RSA), Manufacture and Commerce and a former member of the North West Development Agency Business Angels Network advisory team, which provided guidance and support services for entrepreneurs seeking informal investment. Previous clients include Jepson Holt Ltd, Pixie Children’s Wear Ltd, UK Plumbing Supplies (Finagold Ltd), Ask A Price LLP, Gentry Grooming Company Ltd, Stringsta Ltd and Martin Conquest Ltd. Belinda Barnard – Director Belinda heads up Bubble’s cafes and catering operation. The cafes utilise the skills of people with mental health difficulties by providing employment and volunteering opportunities, demonstrating Bubble’s ethos of providing sustainable opportunities for social and economic inclusion. Previously, Belinda was Managing Director and joint founder of Mica (UK) Ltd, a company which followed a worldwide model of group branding and marketing for independent hardware retailers, which grew to 200 member stores nationwide, with retail sales in excess of £65 million. Some of the clients Belinda has worked with include Jepson Holt Ltd, Pixie Children’s Wear Ltd, UK Plumbing Supplies (Finagold Ltd), Ask A Price LLP, Gentry Grooming Company Ltd, Stringsta Ltd and Martin Conquest Ltd Don Phillips – Director and Chair Don has served as Chairman of Bubble Enterprises since 2007 and is a Non-Executive Director, Consultant and Coach. He has built his experience over 30 years in leadership roles at the cutting edge of the IT industry, working previously for Hewlett-Packard Ltd, Arrow ECS Ltd, Kavanagh Systems Ltd and Theorem Solutions Ltd. Having also founded, developed and sold intellectual property through his own business Lloyd-Davies Associates Ltd, Don has developed a broad skill set in corporate governance, sales, marketing and operations, underpinned by an extensive knowledge and practical experience of implementing IT systems and processes. Don takes a keen interest in exploring how sustainable social enterprise and entrepreneurship – particularly alliances with the commercial world – can help mental health service users aid their recovery and achieve social and economic inclusion. He also serves as a Lay-Member for lived experience and public engagement on the board of Stockports NHS Clinical Commissioning Group. Katherine Harrington - Catering Manager Katherine brings a wealth of experience to the catering operations at Bubble’s cafes, having worked in restaurants, schools and contract catering over an extensive career. Katherine has an HND in hotel catering and institutional management and an ONC in hotel catering and institutional operations. She is also a member of the Institute of Hospitality. Book your FREE 45 minute 'Innovation Session' Do you have a great idea, but could use our skills and experience to help it grow? Book a free 45 minute 'Innovation Session' now ; Buy the Book Entrepreneurship, Innovation and Technology: A Guide to Core Models and Tools available on Kindle or as a Printed Edition Buy Now Partners and Clients Associates Services Brands Projects Blog About Contact 18 Veronica Road, Didsbury, Manchester, M20 6SU.  E: info@bubbleenterprises.co.uk © Copyright 2001 to 2023 Bubble Enterprises CIC. Registered in England No 6351783.\t\t\t\t\t\t\t\t\t\t\t\t| Terms & Conditions | Privacy Policy | Modern Slavery Policy We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. Ok"
    },
    {
      "url": "https://www.gobubblepop.com/contact/",
      "text": "Contact - BubblePOP Off-site Events Franchise Contact Off-site Events Franchise Contact Contact Submit an Inquiry BubblePOP has closed its brick and mortar operations, and is currently only offering large scale off-site events (meaning we bring the bubbles to you!). If you’re interested in our off-site offerings, you can find more information on our website’s off-site page . Please follow us on our instagram to keep up with our latest news, including where we might be popping up next! We respond to all received messages within 24-48 hours (usually less)! If you don’t hear from us, it’s because we did not receive your message. We can also be reached at [email protected] . Thanks for your patience! Name * First Last Email * Phone Subject * What are you inquiring about? General Education Workshop or Assembly Off-Site Event Hidden Education Workshop or Assembly Inquiry Your title or role with educational institution: * Name of Educational Institution * Location Address * Are you looking to book a workshop or assembly? * Workshop (up to 25 kids) Assembly (up to 100 kids) Not sure, let's chat and see what we need What date(s) and time(s) are you looking to have your workshop or assembly? * Age demographic of attendees (list by group if needed) * Hidden Off-Site Inquiry Name of event * Location Address * What date(s) and time(s) are you looking to have your event? * How many hours would you like BubblePOP to provide bubble activities? * 2 hours 3-4 hours more than 4 hours What other entertainment vendors will be present at the event? * Is the event inside or outside? * Indoors only Outdoors only Some indoor, some outdoor How many attendees are you anticipating? * Age demographic of attendees * Hidden Message Message Untitled Name This field is for validation purposes and should be left unchanged. Δ BubblePOP VIP Subscription Receive news, cool free stuff updates and more Email * Email This field is for validation purposes and should be left unchanged. Δ Copyright 2022 BubblePOP! All rights reserved. Privacy Policy"
    },
    {
      "url": "https://www.aroundosceola.com/lifestyle/meet-your-police-these-outreach-events",
      "text": "Meet with your police at these outreach events | Osceola News Gazette Skip to main content September 10, 2025 Log in GALLERY Submissions Log In Subscribe e-Edition Home Contact About Us Kissimmee Links St. Cloud Links News Statewide News Election 2024 Sports Things to do Online Puzzles Lifestyle Opinion Obituaries Keepsakes Public Notices Classified Place A Classified Classified Listings Poinciana Pioneer Local Deals Log In Log in GALLERY Submissions Log In Subscribe e-Edition Home Contact About Us Kissimmee Links St. Cloud Links News Statewide News Election 2024 Sports Things to do Online Puzzles Lifestyle Opinion Obituaries Keepsakes Public Notices Classified Place A Classified Classified Listings Poinciana Pioneer Local Deals Log In square-facebook x-twitter 2025 Best of Osceola Meet with your police at these outreach events By Lisa Goldmacher on Wednesday, September 25, 2024 Image Bubble Pops with St. Cloud Cops happens on Friday, Sept. 27 from 7-8:30 p.m. at Bubble Pops, 4525 Old Canoe Creek Road. Bubble Pops with St. Cloud Cops happens on Friday, Sept. 27 from 7-8:30 p.m. at Bubble Pops, 4525 Old Canoe Creek Road. X Body Get to know your local law enforcement and attend these fun community outreach events! Bubble Pops with St. Cloud Cops happens on Friday, Sept. 27 from 7-8:30 p.m. at Bubble Pops, 4525 Old Canoe Creek Road. The St. Cloud Police Department is hosting this informal yet informative night of “Boba and Banter” with the Community Engagement Team. National Night Out is an annual community building campaign that promotes police and community partnerships with neighborhood camaraderie. The St. Cloud Police Department invites the community to join them for an evening of games and activities, safety presentations, live DJ, food trucks, touch a truck display and more. This free event will be held at the St. Cloud Lakefront Park, on Tuesday, Oct. 1 from 4-7 p.m. Did you know that Wednesday, Oct. 2 is National Coffee with a Cop Day? Celebrate with the St. Cloud PD day at Vanessa’s Coffee Shop, (3350 Canoe Creek Road) from 9-11 a.m. Chief Douglas Goerke and members of the St. Cloud Police Department with the Community Engagement Unit are hosting this informal meeting and will answer questions and hear concerns. Osceola Community Health Services will bring its Medical Mobile Unit to the Narcoossee Community Park, 5354 Rambling Road, on Saturday, Sept. 28 from 11 a.m. to 2 p.m. This event is for residents of St. Cloud and nearby areas, is free and includes blood glucose testing and blood pressure monitoring. The St. Cloud Womens Club’s Ninth Annual Craft Show, which is a scholarship fundraiser, will be on Saturday, Sept. 28th from 9 a.m. to 2 p.m. at the St. Cloud Community Center. Vendors include jewelry, home décor, cakes, wreaths, purses and more. There will also be a 50/50 raffle and door prizes. Concessions include hot dogs, beverage and snack stand. For vendor info contact, Linda Lokken at 407-569-7688. The Women’s Club of St. Cloud is welcome to all! Meetings are at 12 noon the third Wednesday of every month at the St. Cloud Womens’ Club building (1012 Massachusetts Ave). E.S.O.L. for Beginners allows others to become more familiar with the English language. This class will be held at the St. Cloud Library on Friday, Sept. 27 from 10-11:30 a.m. Gardening Series: Gardening in Small Backyards takes place on Monday, Sept. 30th from 11 a.m. to 12 noon. Bring the joy of gardening to you by learning tricks and how to create a beautiful garden in small spaces. This series is presented by UF/IFAS Extension. Central Florida Business Networking Group shares ideas and opportunities with fellow professionals representing a variety of different local businesses. This group will meet at the Library on Tuesday, Oct. 1 from 9-10:30 a.m. A.I. for Seniors and Beginners will be at the Library on Tuesday, Oct. 1st from 1011 a.m. Presented by Professor Adam Simon, this class will teach about artificial intelligence and how it can be used in everyday life for information. The St. Cloud Library is located at 810 13th St. All Library programs are free and open to the public. Hometown Harvest at Sunbridge is open to the public and takes place on Saturday, Oct. 5 from 9 a.m. to 2 p.m. at 6197 Cyrils Dr. The Harvest features a live country band, tractor pull hayrides to Pioneer Park, a pumpkin decorating station, petting zoo, food vendors, photo ops and more. The Rotary Club of St. Cloud presents Casino Cash Bash on Saturday, Oct. 12 from 5-9 p.m. The $75 ticket, which is a donation, includes access to a variety of casino games including blackjack, poker, roulette and more. Tickets also include a stash of casino chips, cash prize drawings and hors d’oeuvres. Casino Cash Bash will be held at the St. Cloud VFW Post 3227, 915 New York Ave. The proceeds from this event fund local projects within the community. For more information, email events@rotaryclubofstcloudfl.org. If you have any St. Cloud news or information that you would like to share, call Lisa Goldmacher at 407-319-9700 or email lcgoldmacher@yahoo.com. aroundosceola 2025 Best of Osceola Featured Local Savings Hurricane Season 2025 kissimmee weather information McCland Law, Kissimmee, FL Physicians Mutual Dental Insurance Kenton Scott, CFP Salvation Army Publix BOGO CDC United Way Florida Loan Osceola News-Gazette mail delivery Osceola News Gazette aroundosceola Popular content Today's: Best of Ballot 2025 Osceola deputies arrest man accused on chatting about abusing children online City of Kissimmee ‘rings in’ start of new affordable housing development Osceola News-Gazette mail delivery The Osceola News Gazette 222 Church Street, Suite A KPM Franklin Building, 2nd Floor Kissimmee, FL 34741 Phone: (407) 846-7600 Email: editor@osceolanewsgazette.com USPS Number 513540 ISSN 1060-1244 © 2025 Osceola News Gazette About Us Privacy Terms & Conditions Contact Accessibility Policy"
    }
  ]
}