{
  "fuentes": [
    {
      "url": "https://www.hurricaneshutterswholesale.com/contact-us/",
      "email": "info@hurricaneshutterswholesale.com"
    },
    {
      "url": "https://www.hurricaneshutterswholesale.com/contact-us/",
      "email": "info@hurricaneshutterswholesale.com"
    },
    {
      "url": "https://www.myhurricanealley.com/special-events",
      "email": "info@myhurricanealley.com"
    },
    {
      "url": "https://www.myhurricanealley.com/find-us",
      "email": "info@myhurricanealley.com"
    },
    {
      "url": "https://hurricanecommerce.com/contact-us/",
      "email": "info@hurricanecommerce.com"
    },
    {
      "url": "https://www.wptv.com/news/region-s-palm-beach-county/boynton-beach/longtime-boynton-beach-restaurant-navigates-city-redevelopment-in-effort-to-continue-operations",
      "email": "erin.sadler@wptv.com"
    },
    {
      "url": "https://www.wptv.com/news/region-s-palm-beach-county/boynton-beach/longtime-boynton-beach-restaurant-navigates-city-redevelopment-in-effort-to-continue-operations",
      "email": "miranda.christian@wptv.com"
    },
    {
      "url": "https://www.wptv.com/news/region-s-palm-beach-county/boynton-beach/longtime-boynton-beach-restaurant-navigates-city-redevelopment-in-effort-to-continue-operations",
      "email": "sbilling@wptv.com"
    },
    {
      "url": "https://www.palmbeachpost.com/story/news/local/2020/08/21/why-owner-of-hurricane-alley-fears-her-popular-boynton-restaurant-could-close-and-itrsquos-not-becau/113446390/",
      "email": "jmilian@pbpost.com"
    },
    {
      "url": "https://www.hacctx.com/contact",
      "email": "info@hacctx.com"
    },
    {
      "url": "https://www.hacctx.com/contact",
      "email": "sales@hacctx.com"
    },
    {
      "url": "https://www.myhurricanealley.com/menu",
      "email": "info@myhurricanealley.com"
    },
    {
      "url": "https://www.myhurricanealley.com/covid19-update",
      "email": "info@myhurricanealley.com"
    },
    {
      "url": "https://www.myhurricanealley.com/food-menus",
      "email": "info@myhurricanealley.com"
    },
    {
      "url": "https://www.myhurricanealley.com/",
      "email": "publicrelations@2020-townrankingcontact.com"
    },
    {
      "url": "https://www.myhurricanealley.com/",
      "email": "info@myhurricanealley.com"
    },
    {
      "url": "https://www.myhurricanealley.com/togoordersupdate",
      "email": "info@myhurricanealley.com"
    }
  ],
  "mails": [
    "erin.sadler@wptv.com",
    "info@hacctx.com",
    "info@hurricanecommerce.com",
    "info@hurricaneshutterswholesale.com",
    "info@myhurricanealley.com",
    "jmilian@pbpost.com",
    "miranda.christian@wptv.com",
    "publicrelations@2020-townrankingcontact.com",
    "sales@hacctx.com",
    "sbilling@wptv.com"
  ],
  "nombre_sitio": "myhurricanealley.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.hurricaneshutterswholesale.com/contact-us/",
      "text": "Contact Hurricane Shutters Wholesale Today Contact Us Shipping Purchase Protection Call us at: 561-626-8708 Sign in Register Wish Lists Check out with Credit Card 0 HURRICANE SHUTTERS WHOLESALE Toggle menu Compare Search Search Storm Panels ​ Shop Storm Panels Parts Hurricane Shutters Get Instant Pricing Accordion Shutters ​ Shop Accordion Shutters Parts Accordion Shutters Get Instant Pricing Bahama Shutters ​ Shop Bahama Shutters Parts Bahama Shutters Get Instant Pricing Colonial Shutters ​ Shop Colonial Shutters Parts Colonial Shutters Get Instant Pricing Astroguard Hurricane Fabric ​ Shop Astroguard Hurricane Fabric Parts Astroguard Hurricane Fabric Get Instant Pricing Roll-Down Shutters ​ Shop Roll-Down Shutters Parts Rolldown Shutters Get Instant Pricing Headers and Tracks Hurricane Hardware HSW Route Claims Policies Privacy Policy Purchase Protection Terms of Service FAQ Shipping Contact Us Sign in or Register Home Contact Us Contact Us Contact Hurricane Shutters Wholesale Wait! Before you reach out to contact us, did you know that our website is way different (and we say way better!) than every other storm shutters website out there? Not only are our prices lower than everybody else but they are also right on our website for everyone to see! You most likely can order everything yourself..you don't need to wait for us for a quote...we have made it super easy for everyone to do! Now we don't want you to think we don't want to talk to you because we do! We just feel bad when we can't get to you as soon as possible. When hurricane season rolls around we get tons of calls so we will inevitably get behind on returning your call..we don't want that and you don't want that! We are always happy to answer all questions you have or help you with you order! Hurricane Shutters Near Me - Lowest Prices on the Planet - Call us today. Contact Hurricane Shutters Wholesale Please fill out the form below if you need assistance. Full Name Phone Number Email Address Required Comments/Questions Required × Navigate HSW Route Claims Policies Privacy Policy Purchase Protection Terms of Service FAQ Shipping Contact Us Sitemap Categories Storm Panels Accordion Shutters Bahama Shutters Colonial Shutters Astroguard Hurricane Fabric Roll-Down Shutters Headers and Tracks Hurricane Hardware Info 4170 Westroads Drive Suite #9-E Riviera Beach, Florida 33407 Store Hours: Monday - Wednesday 9 am - 4:00 pm Thursday and Friday - Appointment Only Closed Saturday and Sunday Email Address:  info@hurricaneshutterswholesale.com 561-626-8708 Store Hours: Monday - Wednesday 9 am - 4:00 pm Thursday and Friday - Appointment Only Closed Saturday and Sunday © 2025 Hurricane Shutters Wholesale"
    },
    {
      "url": "https://www.myhurricanealley.com/special-events",
      "text": "Special Events — HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us Oct 30 11:00 AM 11:00 PIRATE FEST 2021 VIP PRIVATE EVENT Saturday, October 30, 2021 11:00 AM 10:00 PM 11:00 22:00 Hurricane Alley Restaurant (map) Google Calendar ICS WHERE: Hurricane Alley WHEN: SATURDAY, OCTOBER 30th 11AM - 10PM DETAILS: ALL ACCESS $150.00 21 AND OVER ONLY ONLY 150 TICKETS AVAILABLE CHOOSE FROM ONE OF THE FOLLOWING OPTIONS: (5) COCKTAILS & (1) APPETIZER (1) DINNER ENTREE, SOUP, SALAD & DESSERT (2) APPETIZERS, (1) SANDWICH, SOUP, SALAD & DESSERT ALL OPTIONS INCLUDE FREE SODA AND COFFEE ALL TICKETS INCLUDE: PRIVATE RESTROOMS PRIVATE SECURITY PRIVATE VIEWING AREA FOR MAIN STAGE LIVE MUSIC COSTUME CONTEST (OVER $400 IN PRIZES FOR WINNER) SIT DOWN TABLE OR BAR SERVICE GRATUITY NOT INCLUDED View Event → Sep 12 3:00 PM 15:00 HAITI RELIEF EVENT Sunday, September 12, 2021 3:00 PM 9:00 PM 15:00 21:00 Hurricane Alley Restaurant (map) Google Calendar ICS LIVE MUSIC BY: John Boes on Sax Jerry Leeman and Friends Steven Vincent OUTDOOR BBQ WITH 100% PROCEEDS DONATED 50/50 RAFFLE RAFFLE PRIZES View Event → Oct 26 11:00 AM 11:00 VIP PIRATE FEST - PRIVATE EVENT Saturday, October 26, 2019 11:00 AM 9:00 PM 11:00 21:00 Hurricane Alley (map) Google Calendar ICS VIP PIRATE FEST PRIVATE EVENT WHEN: SATURDAY, OCTOBER 26 (11AM-9PM) $100 TICKET INCLUDES DRINK AND FOOD • CLOSED TO THE PUBLIC • • LIVE MUSIC BY JERRY LEEMAN • • FREE TASTING BY JACK APPLE AND RUM HAVEN • • $100 GIFT CARD FOR BEST PIRATE • TICKETS AVAILABLE AT THE RESTAURANT FOR MORE INFORMATION CALL: (561) 364-4008 View Event → PLEASE NOTE:* Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. Back To Top The Storm Surge Menu Soups & Salad Appetizers Raw Bar & Seafood Twisters Sandwiches Beverages Side Dishes Desserts Kid's Menu Doggie Bites Hurricane Alley - Raw Bar & Restaurant 529 East Ocean Avenue • Boynton Beach, FL 33435 Tel: (561) 364-4008 Email: info@myhurricanealley.com © 2025 Hurricane Alley Powered by Phaeton Systems Cart ( 0 )"
    },
    {
      "url": "https://www.myhurricanealley.com/find-us",
      "text": "Find Us — HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us CONTACT US PHONE: (561) 364-4008 EMAIL: info@myhurricanealley.com ADDRESS: 529 East Ocean Ave. Boynton Beach, FL 33435 HOURS OF OPERATION: Tuesday - Sunday 11am - 10pm (Closed on Mondays) PLEASE NOTE:* Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. Back To Top The Storm Surge Menu Soups & Salad Appetizers Raw Bar & Seafood Twisters Sandwiches Beverages Side Dishes Desserts Kid's Menu Doggie Bites Hurricane Alley - Raw Bar & Restaurant 529 East Ocean Avenue • Boynton Beach, FL 33435 Tel: (561) 364-4008 Email: info@myhurricanealley.com © 2025 Hurricane Alley Powered by Phaeton Systems Cart ( 0 )"
    },
    {
      "url": "https://hurricanecommerce.com/contact-us/",
      "text": "Contact us | Hurricane Commerce Skip to content Support MY HURRICANE INVESTOR PORTAL Linkedin X-twitter Instagram Youtube Why Hurricane Close Why Hurricane Open Why Hurricane What makes us Hurricane? Our award-winning team contains some of the world’s leading tech, eCommerce, logistics and compliance talent. How we do it Our Story Our Team Join us How we do it Our Story Our Team Join us Solutions Close Solutions Open Solutions Our Solutions We provide the solutions to some of the biggest cross-border data challenges. HS Code Classification Duty & Tax Calculation Prohibited & Restricted Goods Screening Denied Parties Screening IOSS ICS2 Second Release Products Close Products Open Products Our Products Hurricane’s products are ever evolving to support our customers in the provision of the AI-driven data required to achieve cross-border excellence. Kona v2 Zephyr Matching Engine Aura Calculation & Compliance Engine Sectors Close Sectors Open Sectors Our Sectors We support customers globally with their data requirements across multiple sectors. Carriers Retailers Customs Brokers Freight Forwarders Postal Operators Marketplaces Carrier Management Systems Airlines Professional Services Case Studies Resources Close Resources Open Resources Browse our resources We’ll keep you up to date with our latest news, blogs, guides and videos. Blogs Latest News Podcasts Videos Book A Demo CONTACT US Please get in touch with any questions for the Hurricane team WE’D LOVE TO HEAR FROM YOU GET IN TOUCH info@hurricanecommerce.com Hurricane Commerce Rothersthorpe House 4 Billing Rd Northampton NN1 5AN CONTACT US ONLINE Please provide your contact details and we’ll be in touch shortly to discuss your needs Enquiry Type * Enquiry Type * ICS2 Second Release IOSS Technical Sales Marketing ROI Calculator Careers General Full Name * Company Name * Email * Phone Your enquiry Captcha LinkedIn This field is for validation purposes and should be left unchanged. READY TO GO GLOBAL? Whether you are ready to go global or want to grow in certain markets, Hurricane’s data technology can power your success. Our solutions are acknowledged as best in class. Why not put us to the test by arranging an introductory call / demo today. Contact Us Full Name (Required) Company Name (Required) Email Address (Required) Phone Number (Required) More information CAPTCHA Linkedin X-twitter Instagram Youtube Solutions IOSS HS Code Classification Duty & Tax Calculation Prohibited & Restricted Goods Screening Denied Parties Screening ICS2 Second Release IOSS HS Code Classification Duty & Tax Calculation Prohibited & Restricted Goods Screening Denied Parties Screening ICS2 Second Release Products Kona Zephyr Matcing Engine Aura Calculation & Compliance Engine Kona Zephyr Matcing Engine Aura Calculation & Compliance Engine Information Case Studies Sectors Resources Why Hurricane Case Studies Sectors Resources Why Hurricane Contact info@hurricanecommerce.com Registered Office 4 Grovelands, Boundary Way Hemel Hempstead, HP2 7TE Office Rothersthorpe House, 4 Billing Rd, Northampton, NN1 5AN Copyright © 2025 All Rights Reserved. | Terms | Privacy Policy Scroll to Top Homepage Why Hurricane Solutions IOSS HS Code Classification Duty & Tax Calculation Prohibited & Restricted Goods Screening Denied Parties Screening ICS2 Second Release Products Kona Zephyr Matching Engine Aura Calculation & Compliance Engine Sectors Carriers Retailers Customs Brokers Freight Forwarders Postal Operators Marketplaces Carrier Management Systems Airlines Professional Services Case Studies Resources Blogs Latest News Podcasts Videos Hamburger Toggle Menu Get in touch David SpoTtiswood Co-founder Interesting Fact: I am an amateur baker, but I still have no idea how sourduogh starter actually works, and am intrigued how it all reacts together to produce an incredible taste. Favourite Music: November Rain by Guns ‘n’ Roses.  Going to Wembley with my wife our go to fun thing in our early years, our youth with long hair and rock clothing and not a care in the world other than getting the best spot in the house. Favourite Quote: “Insanity is doing the same thing over and over again, and expecting different results ” – Albert Einstein Harry Reilly Non-exec Interesting Fact: I learned Arabic for five years!. Favourite Music: A Long December by Counting Crows.  Memory of best family time together in California. Favourite Quote: “Don’t forget execution, boys. It’s the all-important last 95%” Tom Lee Technical Director Interesting Fact: I am completely self-taught from a technical skills persepctiuve, and left formal education at 18. Favourite Music: Blink 182 – Aliens Exist.  Brings back fond memories of stickly floors and cheap beer. Favourite Quote: “He sprayed water in my face – thta’s not allowed” – James Haskell.  The whole event surrounding it is hilarious and shows the power of a good wind up Martin Palmer Co-Founder Interesting Fact: I started my working life training to be an accountant but decided I hated numbers. (Ironically I now love them!). I really wanted to join the Hong Kong Police force but couldn’t do that until i was 24. I took a temporary job in Imports and 47 years later here I am. Favourite Music: There only was one choice. Harry Chapin. Meant a lot to me in my early years as an import broker. We played Chapin for hours and this one seemed to cover so many modes. Favourite Quote: “No man is an island” Neil Harmer Operations Director Interesting Fact: As a Geologist my idea of the perfect beach holiday is going to the beach and investigating the rocks in the cliffs behind. Favourite Music: Broken Stones – Paul Weller, I’m a huge Paul Weller / The Jam fan; Broken Stones is a very relaxing song, I love the use of the electric piano in it Favourite Quote: “Don’t put off until tomorrow what you can do today”. This is a great quote by Benjamin Franklin, to have in your head when working through a series of tasks to help keep focused. Robert Dundas Sales Director Interesting Fact: One of my life goals is to be able to speak French, I’ve been doing Duolingo every day for the last five years, and I’m still rubbish! Favourite Music: Where do I even start! Tom Petty Running Down a Dream, this is my top-down driving next to the ocean song Favourite Quote: “This time will pass” ASHLEY DEXTER CFO & Co-founder Interesting Fact: I was nearly named Battle Dexter (I would have probably now been residing in one of His Majesty’s establishments) Favourite Music: Even though I spent a few years in the music industry my taste of music was always a cause for concern with my colleagues, so to surprise them all my current favourite is Kids by MGMT (absolute belter) Favourite Quote: “Quitters never win and winners never quit” Ian Venner CTO & Co-founder Interesting Fact: Runs Red Lantern Records, a not-for-profit, ethical label as a side project, whose artists have regular national BBC radio airplay. Favourite Music: Tom Waits, pretty much all of his work.  Beautifully observed avante-garde vignettes of life.  Oh, and anything really loud! Favourite Quote: “It’s not the mountains we climb, but the grit in our shoe that grinds us down” – which sums up taking a business from start-up to enterprise. Martyn Noble CEO & Co-founder Interesting Fact: Played a high standard of semi-professional rugby union (too many years ago now!) Favourite Music: Led Zeppelin – Stairway to Heaven…my first live gig – Knebworth 11th August 1979, the track never grows old and is the iconic song of ‘hope’ whatever mood you are in when listening too it…and I’m still trying to work out what the lyrics mean!! Favourite Quote: “Know your customers, Know your People, Know your Numbers” – plagiarised from Sir John Harvey Jones when I met him very early on in my career and values I stick to in my business life."
    },
    {
      "url": "https://www.wptv.com/news/region-s-palm-beach-county/boynton-beach/longtime-boynton-beach-restaurant-navigates-city-redevelopment-in-effort-to-continue-operations",
      "text": "Longtime Boynton restaurant navigates city's redevelopment project Watch Now Menu Local National Weather Sports Traffic Watch Now Watch Now Close × Live Watch Alerts Search site Go Weather Interactive Radar Daily Forecast Hurricane Survival Guide Hourly Forecast Live Interactive VIPIR Hurricane Map Weather Cams News Local News WPTV Investigates Real Estate News Politics State National News World News Crime Education Protecting Paradise Your Health Matters Traffic Gas Prices Gas Availability Airports Entertainment WPTV Schedule, Other TV Listings Movies Life Finding Florida Shining A Light Underdog Pets Family Food News Sports Panthers Dolphins College Sports FAU Hurricanes Gators Seminoles Cognizant Classic Football Baseball Basketball Surfing Blog Recreation Sports Money Money Headlines Dont Waste Your Money Recalls Marketplace Sunshine Spotlight Home Experts In the Know Videos WPTV Livestream Player WPTV on Youtube About Us Advertise Contact Us WPTV Schedule, Other TV Listings Contests Jobs Staff Bios WHDT, South Florida's 9 How to Watch WPTV 24/7 Support Sign In Newsletters Sign Out Manage Emails Apps Careers Search WPTV5 wptv WPTV UC0bCUnP5RrkJZUtd3bBz6Kw @wptv5 1 WX Alerts 1 Closings/Delays Treasure Coast Okeechobee Indian River St. Lucie Martin Palm Beach County North PBC Central PBC South PBC The Glades Broward Miami-Dade More + Quick Links + Treasure Coast Okeechobee Indian River St. Lucie Martin Palm Beach County North PBC Central PBC South PBC The Glades Broward Miami-Dade News Palm Beach County Region S Palm Beach County Boynton Beach Actions Facebook Tweet Email Longtime Boynton Beach restaurant navigates city redevelopment in effort to continue operations Community Redevelopment Agency works to keep local businesses Prev Next Hurricane Alley restaurant has been serving residents for decades at its location on Federal Highway and Ocean Avenue in Boynton Beach. By: Miranda Christian Posted and last updated BOYNTON BEACH, Fla. — Hurricane Alley restaurant has been serving residents for decades at its location on Federal Highway and Ocean Avenue in Boynton Beach. Owner Kim Kelly said they have stayed out through tough times. MORE: Boynton Beach to look at development ideas for Federal Highway \"We have survived a lot of obstacles throughout the 25 years, road closures, buildings, COVID. You name it, we have pretty much survived it,\" Kelly said. Kelly said she has seen the city grow but wasn't expecting her landlords to sell the property. \"You gotta be silly if you don't think that somebody's going to be affected and unfortunately it will probably be us,\" Kelly said. WPTV Hurricane Alley owner Kim Kelly talks about Boynton Beach's redevelopment plans. The owners of a stretch of buildings along Ocean Avenue are selling to the Community Redevelopment Agency for $3.6 million. The move was made because it ties into a redevelopment project located behind Hurricane Alley. \"With it being the corner piece here in the downtown. It makes more sense for it to face Ocean [Avenue] as well,\" said Boynton Beach Commissioner Christina Romelus. Romelus said the CRA is currently looking for a developer for the project. Kelly made a plea to the CRA on Tuesday to keep her business a part of the future plans. WPTV Boynton Beach Commissioner Christina Romelus speaks about prioritizing local businesses amid the city's redevelopment. \"We are going to go with the growth,\" Kelly said. Romelus said the CRA wants to keep local businesses in Boynton Beach and will work with the renters who are already here. \"We want to keep them here, and Miss Kim Kelly, of course, falls right into that purview, and we will do everything in our power to support her,\" Romelus said. \"[I] got some reassurance that Hurricane Alley is downtown, and we are here to stay,\" Kelly said. Kelly said she now hopes the city can find the perfect project for this section of downtown. CRA staff said they will continue to work with the property owner to come to a sale agreement. Once that is complete, it will be brought back to the CRA board. Copyright 2021 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed. Sign up for the South Florida Sports Headlines Newsletter and receive up to date information. now signed up to receive the South Florida Sports Headlines Newsletter. Click here to manage all Newsletters At WPTV, It Starts with Listening Weather Traffic News Money Sports Entertainment Life Marketplace Don't Waste Your Money Support Sitemap Do Not Sell My Info Privacy Policy Privacy Center Journalism Ethics Guidelines Terms of Use EEO Careers FCC Public File FCC Application Public File Contact Accessibility Statement Scripps Media Trust Center Closed Captioning Contact WPTV5 wptv WPTV UC0bCUnP5RrkJZUtd3bBz6Kw @wptv5 © 2025 Scripps Media, Inc Give Light and the People Will Find Their Own Way"
    },
    {
      "url": "https://www.palmbeachpost.com/story/news/local/2020/08/21/why-owner-of-hurricane-alley-fears-her-popular-boynton-restaurant-could-close-and-itrsquos-not-becau/113446390/",
      "text": "Why owner of Hurricane Alley fears her popular Boynton restaurant could close (and it's not because of COVID) News Sports Restaurants Real Estate Opinion Advertise Obituaries eNewspaper Legals LOCAL Why owner of Hurricane Alley fears her popular Boynton restaurant could close (and it’s not because of COVID) Jorge Milian Palm Beach Post BOYNTON BEACH — Kim Kelly has been serving up steamed oysters, conch fritters and huge sandwiches - the soft shell crab is to die for - at her downtown restaurant in Boynton Beach for nearly a quarter-century. Hurricane Alley, which Kelly opened in 1996, has become something of an institution in the city, combining the feel of a neighborhood sports bar with a Florida Keys vibe. But Kelly fears that the end may be near for Hurricane Alley. >> BOYNTON READERS: Sign up for The Post’s weekly Boynton Beach newsletter here A proposed mixed-use development project that includes 229 residences and 18,000 square feet of commercial space, will snuff the life out of her restaurant by swallowing up available parking for customers, Kelly said. “It could be the demise of us,” Kelly said. “We’re being suffocated.” To fight back, Kelly has started a Change.org petition demanding that Boynton’s Community Redevelopment Agency reject the $60 million project proposed by the developer, Ocean Avenue Residences and Shoppes, LLC. As of Thursday, the petition had received nearly 2,250 signatures. Kelly said she will also lead a march on Sept. 8 from Hurricane Alley, at 529 E. Ocean Avenue, to City Hall to coincide with the CRA’s monthly meeting. “We’ve been here fighting for the downtown for 25 years and now the CRA is going to develop it and we’re just going to be forgotten,” Kelly said. “That to me is a very sad day.” During a presentation at the CRA’s meeting Aug. 11, the developers said they planned for 544 parking spaces, including 120 for public parking. But critics of the project like resident Susan Oyer, whose family owns property in the immediate vicinity, said the development will take away scores of free parking spots that are now available to employees of area businesses and their customers. Hurricane Alley, which started in 1996 with two employees, now has 45 people on staff while Oyer’s properties have around 50 employees. “Those 120 parking spaces that you think you have [are] just going to be filled up mostly with employees,” Oyer said. And if those 120 parking spaces are not free, “You’re going to have a revolution,” Oyer warned. At the Aug. 11 meeting, the CRA accepted a letter of intent that gives the five-person body 90 days to negotiate terms of the deal with the developer. The CRA bought the property in 2018 for $3 million and leased a building on the two-acre parcel to the city for use as a temporary library during construction of Town Square. Board Chair Steven Grant is not in favor of the project because he feels the property could be put to better use, possibly as a future commuter train stop. While the majority of the board indicated they approved of the development, Grant said that “hopefully the CRA will rescind approval of the letter of intent because there’s too much discussion needed with the city, the county, the region about that location.“ Asked if he thought local businesses, including Hurricane Alley, would be negatively impacted, Grant said, “Absolutely.” He gets no argument from Kelly. She worries that much of her clientele, which includes a fair share of retirees, won’t fancy struggling to find parking and “will get frustrated and leave.” “We have so much residential [developments] already that people come down here and they don’t know where they can or can’t park,” Kelly said. “They’re worried they’re going to get towed or get a ticket so, rather than risk it, they just say, ‘I’m just going to go to some place where I can pull up and just walk in.’” Small business owners face an uphill battle in the best of times, and these are certainly not the best of times, especially for those trying to operate restaurants in the middle of the coronavirus pandemic. Kelly said she was closed for three weeks between March and April and then had limited hours and to-go service only until the beginning of May. In her petition, Kelly writes that the coronavirus “may not destroy us but the CRA just may!” “The struggle is definitely real,” Kelly said. “We’re just asking the CRA not to make the struggle impossible.” jmilian@pbpost.com @caneswatch Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Help Center Palm Beach Post Store Subscriber Guide Manage Account Give Feedback Newspapers In Education Newsletters Facebook X eNewspaper Archives Jobs Real Estate Classifieds Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.palmbeachpost.com. All rights reserved."
    },
    {
      "url": "https://www.hacctx.com/contact",
      "text": "Contact Hurricane Alley Waterpark  — Hurricane Alley Waterpark VISIT Buy Passes & Tickets Policies Contact Attractions Party Information Form PLAN Events Birthday Parties Group & Corporate Packages Cabanas & VIP Beaches Shredder Warz ATTRACTIONS Attractions Photo Gallery CALENDAR Sponsors Buy Passes & Tickets VISIT Buy Passes & Tickets Policies Contact Attractions Party Information Form PLAN Events Birthday Parties Group & Corporate Packages Cabanas & VIP Beaches Shredder Warz ATTRACTIONS Attractions Photo Gallery CALENDAR Sponsors Buy Passes & Tickets CONTACT US Let’s Talk! VISIT Buy Passes & Tickets Policies Contact Attractions Party Information Form Contact Us Hurricane Alley Waterpark 702 East Port Avenue Corpus Christi, Texas 78401 361.883.9283 SEASONAL PARK HOURS Open Weekends as of: TBA Sat & Sun: 11 AM - 8 PM Open 7 days a week as of: TBA 11 AM - 8 PM Events & Schedule PHONE : 361.883.9283 EMAIL : Email Us Contact Us Name * First Name Last Name Organization Name Email * Phone (###) ### #### Subject * Message * Best Contact Time Best Time/Days to Contact You Thank you for contacting Hurricane Alley Waterpark! We will be in touch soon. Have a great day! Subscribe to Stay Informed Sign up with your email address to receive news and updates from Hurricane Alley. Email Address Sign Up We respect your privacy. Thank you for subscribing to HA News! We hope to see you soon at the waterpark! Back to Top About Hurricane Alley Employment Contact Us Hurricane Alley Waterpark, 702 East Port Avenue, Corpus Christi, TX, 78401, United States 361.883.9283 INFO@HACCTX.COM CORPUS CHRISTI WEATHER HURRICANE ALLEY 702 East Port Avenue Corpus Christi, Texas 78401 (361) 883-9283 Español Copyright © 2025 Hurricane Alley Waterpark. All rights reserved."
    },
    {
      "url": "https://www.myhurricanealley.com/menu",
      "text": "Menu — HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us Menu THE STORM SURGE (Limited Quantity Daily) $ 18.95 ROCK SHRIMP 1 lb of sweet and tender hard shell Cape Canaveral shrimp... YOU FEEL EM! served with coleslaw, drawn butter and cocktail sauce. $ 18.95 $ 17.95 LOBSTER MAC N CHEESEi homemade cheese sauce mixed with lobster and macaroni baked in the oven and served with salad $ 17.95 $ 14.95 BUFFALO CHICKEN TENDER MAC N CHEESE Fried chicken tender strips tossed in buffalo sauce over our Mac n Cheese, drizzled with bleu cheese and served with a salad $ 14.95 $ 15.95 * TIKI TUNA 9 ounces of sushi grade tuna marinated with a seaweed salad, topped with a wasabi aiolli and serves with pita rounds $ 15.95 $ 13.95 * SURF BREAK 6 pieces of tuna over sticky rice $ 13.95 $ 5.95 SEAWEED SALAD served with pickled ginger and a wasabi aiolli $ 5.95 $ 11.95 SPICY TUNA ROLL sushi grade tuna with cucumber, spicy mayo wrapped with seaweed on the outside. Served with pickled ginger and a seaweed salad topped with a wasabi aiolli $ 11.95 $ 9.95 >>> DAILY LUNCH SPECIAL (Monday thru Friday 11am-3pm) <<< served with Soup or Garden/Caesar salad, a choice of a side dish and an iced tea or  soda $ 9.95 CATEGORY 1: SOUPS & SALAD (Additional sauces and dressings extra charge) Cup $5.25\n                  \n                    /\n                  \n                     Bowl $7.95 SEAFOOD BISQUE Thick and creamy homemade with bay shrimp, crab and clams Cup $5.25\n                  \n                    /\n                  \n                     Bowl $7.95 $ 9.95 THE VOLCANO Our signature seafood bisque overflowing in our bread bowl. A meal in itself! $ 9.95 Cup $4.95\n                  \n                    /\n                  \n                     Bowl $6.50 SOUP DU JOUR Ask your server for our daily, homemade special Cup $4.95\n                  \n                    /\n                  \n                     Bowl $6.50 $ 9.95 SOUP & SALAD A bowl of soup and a garden or Caesar salad $ 9.95 Small $6.95\n                  \n                    /\n                  \n                     Large $8.95 ALLEY CAESAR SALAD Crisp Romaine with homemade croutons, shredded parmesan cheese and our classic caesar dressing, tomatoes, cucumbers and sprouts Small $6.95\n                  \n                    /\n                  \n                     Large $8.95 With Chicken $12.95, With Shrimp $13.95, With Choice of Fish* MP >>> To any of the above salads: With Chicken $12.95, With Shrimp $13.95, With Choice of Fish* MP $ 15.95 SHRIMP SCAMPI CAESAR: Large and bay shrimp in our own creamy warm garlic sauce poured over bed of Romain with tomatoes, cucumbers, croutons and Parmesan cheese $ 15.95 $ 13.95 *THE TROPICAL WAVE: Thinly sliced tuna steak, seared with sesame seeds served over tossed greens with a Mandarin Oriental dressing, tomatoes, cucumbers, onions and sprouts $ 13.95 $ 15.95 * GORGONZOLA STEAK SALAD: Sliced ribeye topped with crumbled bleu cheese over Romain with tomatoes, cucumbers onions and sprouts $ 15.95 $ 14.95 ASIAN CALAMARI SALAD: An Asian style saladAn Asian style salad sweet and spicy tender calamari with a sesame seed flair over a bed of greens with the spicy Thai peanut dressing $ 14.95 $ 14.95 SEARED BLACKENED TUNA CAESAR SALAD: $ 14.95 CATEGORY 2: APPETIZERS (Additional sauces and dressings extra charge) $ 11.95 *OYSTER ROCKEFELLER: Six baked oysters with spinach and bacon topped with dark garlic Parmesan cream sauce $ 11.95 $ 14.95 * OYSTERS ALLEY: Six baked oysters with our homemade blue crab and shrimp Alfredo sauce with toast points for dipping $ 14.95 $ 10.95 CLAMS CASINO: With peppers onions bacon and Parmesan cheese $ 10.95 $ 11.95 ESCARGOT: In a garlic cream sauce served over toast points $ 11.95 $ 12.95 HOMEMADE SMOKED FISH DIP: Smoked on premises daily and made fresh with a real smoky flavor. Served with jalapenos crackers and celery $ 12.95 $ 12.95 WING BASKET: 10 jumbo to an order, have ‘em mild, medium, hot or add garlic served with fries, blue cheese and celery $ 12.95 $ 12.95 CONCH FRITTERS: Five large homemade fritters with our spicy island sauce, cocktail sauce and sweet coleslaw $ 12.95 Served with fries $9.95\n                  \n                    /\n                  \n                     Buffalo style with blue cheese $10.95 CHICKEN TENDERS: (6) to an order with honey mustard and barbecue sauce Served with fries $9.95\n                  \n                    /\n                  \n                     Buffalo style with blue cheese $10.95 CATEGORY 3: RAW BAR & SEAFOOD (Additional sauces and dressings extra charge. Substitute veggies for a side $1.00 extra) half dozen $7.95\n                  \n                    /\n                  \n                     dozen $14.95 *CLAMS OR OYSTERS raw or steamed Chesapeake Bay Blue Point oysters or middleneck clams half dozen $7.95\n                  \n                    /\n                  \n                     dozen $14.95 quarter pound $8.25\n                  \n                    /\n                  \n                     half pound $15.95\n                  \n                    /\n                  \n                     pound $22.95 PEEL AND EAT SHRIMP: Serve with coleslaw spicy or playing, hot or cold. quarter pound $8.25\n                  \n                    /\n                  \n                     half pound $15.95\n                  \n                    /\n                  \n                     pound $22.95 $ 12.95 FRIED CALAMARI: Salt and pepper calamari, deep-fried, served with homemade marinara sauce and coleslaw $ 12.95 $ 15.95 SALMON: Broiled, grilled or blackened with a dill butter sauce served with creole rice pilaf and salad or on a Kaiser roll with lettuce, tomato and choice of side $ 15.95 $ 14.95 FISH AND CHIPS: Large hand battered white flaky fish with fries and slaw $ 14.95 $ 11.95 FRIED SHRIMP BASKET: Eight butterfly shrimp with cocktail sauce, served with fries and slaw $ 11.95 $ 14.95 COCONUT SHRIMP BASKET: Six jumbo coconut shrimp with an Asian orange sauce served with fries and slaw $ 14.95 $ 11.95 SURFER CLAM BASKET: Deep fried served with fries and slaw $ 11.95 $ 13.95 FRIED OYSTER BASKET: Hand battered and fried served with fries, slaw and our special Island sauce $ 13.95 Market price *CATCH OF THE DAY: Delivered daily. Have it in a wrap or in the Kaiser with a choice of side, over creole rice pilaf with a salad or on the salad with choice of dressing Market price Market price *SCALLOPS: have it our way! Each day our chef will create a specialty. Market price CATEGORY 4: TWISTERS (Additional sauces and dressings extra charge. Substitute veggies for a side $1.00 extra) Choice of our homemade garlic try-colored parmesan pasta salad, homemade sweet coleslaw, sidewinder potato fries, applesauce or southern rice pilaf. $ 9.95 THE VEGGIE: Shredded lettuce, tomatoes, cucumbers, peppers, onions, carrots, purple cabbage avocado, alfalfa sprouts, mushrooms, two cheeses and hurricane sauce warm in the oven wrapped in a cucumber tortilla $ 9.95 $ 11.95 THE DEPRESSION: Fresh cooked turkey, with two cheeses, lettuce, tomatoes, bacon and bake in the oven with Hurricane Sauce in a whole wheat tortilla $ 11.95 $ 12.95 THE WATCH: Seasoned chicken with bacon, lettuce, tomato, melted cheeses in Hurricane Sauce wrapped in a garlic pesto tortilla $ 12.95 $ 14.95 THE WARNING: Blue crab and bay shrimp salad homemade with fresh tomatoes, lettuce and alfalfa sprouts wrapped in a Thai Ginger tortilla $ 14.95 $ 12.95 THE STORM: Roast beef with bacon, two cheeses, lettuce and tomato with horseradish sauce wrapped in a whole wheat tortilla and baked in the oven $ 12.95 $ 10.95 THE AFTERMATH: BBQ pork and our sweet coleslaw wrapped in a whole wheat tortilla served hot $ 10.95 $ 12.95 THE FEEDER BAND: Fried chicken strips with shredded cheese, bacon, lettuce, tomato, onion and hurricane sauce wrapped in a whole wheat tortilla and baked in the oven $ 12.95 CATEGORY 5: SANDWICHES (Additional sauces and dressings extra charge. Substitute veggies for a side $1.00 extra) All sandwiches served with our homemade garlic tri-colored parmesan pasta salad, homemade sweet coleslaw, sidewinder potato fries, applesauce or southern rice pilaf and a dill pickle spear. Choice of White, Marble Rye, or Oat. Kaisers, if not specified, 50¢ extra. $ 11.95 *HURRICANE ALLEY: Fresh cooked red arrows beef piled high with lettuce tomato and horseradish sauce $ 11.95 $ 10.95 HURRICANE GILBERTS RELIEF: Fresh cooked turkey served with lettuce tomato and mayonnaise $ 10.95 $ 13.95 *THE SURGE: Roast beef, Turkey, two cheeses, bacon, lettuce, tomato and onions served on a Kaiser roll hot or cold $ 13.95 $ 8.95 HURRICANE ANDREW'S REVENGE: Egg salad made to order with crispy bacon, lettuce and tomato $ 8.95 $ 8.95 TUNA FISH SANDWICH: All white albacore made with our own spices $ 8.95 $ 10.95 MEAN JEANNE: No roof on this sandwich. Tuna fish baked in the oven with tomatoes, two cheeses and bacon, served open faced $ 10.95 $ 9.95 FRANCES FURY: Blew the top office one! Open faced BLT baked with Swiss and American cheeses, loaded with bacon and tomatoes $ 9.95 $ 9.95 WILMAS WRATH: BBQ pork served on a Kaiser roll $ 9.95 $ 14.95 MAHI-MAHI SANDWICH: Fresh dolphin grilled, blackened or broiled on a Kaiser with lettuce, tomato and tartar sauce $ 14.95 $ 12.95 CALIFORNIA CHICKEN SANDWICH: Grilled chicken with sliced avocado, alfalfa sprouts, crisp bacon, Swiss cheese, lettuce and tomato on a Kaiser $ 12.95 $ 9.95 \n                  \n                    /\n                  \n                     Additional items $.75 * ALL-AMERICAN ALLEY CHEESEBURGER: Served with lettuce, raw on you and tomato in the dill pickles beer, fries and coleslaw $ 9.95 \n                  \n                    /\n                  \n                     Additional items $.75 $ 12.95 COSTA RICAN BURGER: Half pound ground beef, Fried egg, bacon, ham, cheese, lettuce, tomato and topped with a sweet thousand Island dressing served with fries and coleslaw $ 12.95 $ 10.95 CAPTAIN BURT SPECIAL: Blackened chicken with cheddar cheese, bacon, lettuce and tomato, served on a Kaiser $ 10.95 Queen  $12.95\n                  \n                    /\n                  \n                     King $16.95 SOFT SHELL CRAB SANDWICH: Jumbo whale lightly breaded and deep-fried with a spicy remoulade sauce served on a Kaiser Queen  $12.95\n                  \n                    /\n                  \n                     King $16.95 $ 13.95 CARIBBEAN CHICKEN DELUXE: Jerk chicken with Swiss cheese, ham, bacon, fried egg, lettuce, tomato and thousand Island dressing on a Kaiser $ 13.95 $ 11.95 HAILSTORM: Hand battered and deep fried oysters with lettuce and tomato on the Kaiser with our spicy Island sauce $ 11.95 $ 10.95 THE SEA MIST: Hand battered fish deep fried sure on a Kaiser with lettuce, tomato and tartar sauce $ 10.95 Add bacon Swiss cheese, avocado and sprouts Space  $4.95 WANT TO MAKE YOUR SANDWICH “CALI” STYLE? Add bacon Swiss cheese, avocado and sprouts Space  $4.95 THE FLOOD: BEVERAGES $ 2.75 SODAS AND SUCH (unlimited Refills): Pepsi, a Diet Pepsi, Mountain dew, dr. Pepper, Sierra mist, Lipton sweet tea, Tropicana fruit punch, Tropicana lemonade, Ginger rail, tonic water, showed a water, iced tea $ 2.75 $ 3.50 JUICES AND MORE: Cranberry, pineapple, grapefruit, mango, orange, virgin bloody Mary, Perrier and so be 0 cal pomegranate $ 3.50 $ 5.00 FROZEN VIRGIN DRINKS: $ 5.00 $ 2.50 COFFEE AND HOT TEA: $ 2.50 PLEASE NOTE: * Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. PLEASE NOTE:* Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. Back To Top The Storm Surge Menu Soups & Salad Appetizers Raw Bar & Seafood Twisters Sandwiches Beverages Side Dishes Desserts Kid's Menu Doggie Bites Hurricane Alley - Raw Bar & Restaurant 529 East Ocean Avenue • Boynton Beach, FL 33435 Tel: (561) 364-4008 Email: info@myhurricanealley.com © 2025 Hurricane Alley Powered by Phaeton Systems Cart ( 0 )"
    },
    {
      "url": "https://www.myhurricanealley.com/covid19-update",
      "text": "Covid-19 Update — HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us COVID-19 UPDATE First of all we’d like to thank all of our staff and Hurricane Alley patrons for their support during these difficult and uncharted times. We are optimistic that we will get through these challenging times. Secondly, we want to let everyone know that WE WILL BE OPENING FOR DINE-IN SERVICE ON MONDAY, MAY 11. We are following all guidelines and restrictions as instructed to do. We have management on duty to ask people to space apart at the the bar counter and we have removed bar chairs and tables to provide proper spacing to facilitate social distancing. We urge all other local restaurants and businesses to follow the same measures to protect all staff and patrons. THANKS TO ALL OF YOU THAT HELP SUPPORT SMALL BUSINESSES! Due to the Covid-19 virus, we are following the following CDC Guidelines: Social Distancing 50% Capacity Mandatory Ill staff or customers must leave IMMEDIATELY If you feel that you have to cough, remove yourself from the area Guidelines implemented by The Alley: No Raw Oysters or Clams One-Time Menus Extra hand-washing and glove use Everyday sanitation procedures and policies provided by DPBR PLEASE NOTE:* Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. Back To Top The Storm Surge Menu Soups & Salad Appetizers Raw Bar & Seafood Twisters Sandwiches Beverages Side Dishes Desserts Kid's Menu Doggie Bites Hurricane Alley - Raw Bar & Restaurant 529 East Ocean Avenue • Boynton Beach, FL 33435 Tel: (561) 364-4008 Email: info@myhurricanealley.com © 2025 Hurricane Alley Powered by Phaeton Systems Cart ( 0 )"
    },
    {
      "url": "https://www.myhurricanealley.com/food-menus",
      "text": "Food Menus — HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us FOOD MENUS CLICK ON A MENU IMAGE TO VIEW MENU Signature Hurricane Alley classics! Delicious soups and salads. Start off with one of our delicious appetizers! Enjoy some of South Florida’s freshest seafood! Delicious wraps and more… Our classic, handmade sandwiches Enjoy a refreshing drink! Don’t forget the side-dishes! The kids have to eat too… …and something for the dogs PLEASE NOTE:* Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. Back To Top The Storm Surge Menu Soups & Salad Appetizers Raw Bar & Seafood Twisters Sandwiches Beverages Side Dishes Desserts Kid's Menu Doggie Bites Hurricane Alley - Raw Bar & Restaurant 529 East Ocean Avenue • Boynton Beach, FL 33435 Tel: (561) 364-4008 Email: info@myhurricanealley.com © 2025 Hurricane Alley Powered by Phaeton Systems Cart ( 0 )"
    },
    {
      "url": "https://www.myhurricanealley.com/",
      "text": "HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us Boynton Beach’s favorite raw bar & restaurant Located in HISTORIC, downtown Boynton Beach, FL Just steps from the local marina JOIN US AT THE ALLEY! Located in downtown historic Boynton Beach Florida, just steps from the local marina where U Hook 'em - We Cook 'em!  Featuring oversized sandwiches, crisp salads, fresh seafood and a great raw bar.  Where locals go to get away from it all and GET BLOWN AWAY! HOURS OF OPERATION: LUNCH & DINNER HOURS: Tuesday - Sunday: 11am - 10pm (Closed on Mondays) PHONE: (561) 364-4008 (Restaurant) (561) 364-4083 (Office) EMAIL: info@myhurricanealley.com LOCATION: 529 East Ocean Ave. Boynton Beach, FL 33435 DINE-IN TUESDAY-SUNDAY JUST SOME OF THE DELICIOUS FOOD WAITING FOR YOU AT THE ALLEY! HURRICANE HARVEY HOMEMADE SMOKED FISH DIP PEEL & EAT SHRIMP MAHI MAHI CAESAR SALAD ALL AMERICAN ALLEY CHEESEBURGER THE SURGE NEW ENGLAND ROLL SCALLOPS STEAMED CLAMS Press Release FOR IMMEDIATE RELEASE Hurricane Alley Raw Bar and Restaurant Receives 2020 Best of Boynton Beach Award Boynton Beach Award Program Honors the Achievement BOYNTON BEACH February 13, 2020 -- Hurricane Alley Raw Bar and Restaurant has been selected for the 2020 Best of Boynton Beach Award in the Local Business category by the Boynton Beach Award Program. Each year, the Boynton Beach Award Program identifies companies that we believe have achieved exceptional marketing success in their local community and business category. These are local companies that enhance the positive image of small business through service to their customers and our community. These exceptional companies help make the Boynton Beach area a great place to live, work and play. Various sources of information were gathered and analyzed to choose the winners in each category. The 2020 Boynton Beach Award Program focuses on quality, not quantity. Winners are determined based on the information gathered both internally by the Boynton Beach Award Program and data provided by third parties. About Boynton Beach Award Program The Boynton Beach Award Program is an annual awards program honoring the achievements and accomplishments of local businesses throughout the Boynton Beach area. Recognition is given to those companies that have shown the ability to use their best practices and implemented programs to generate competitive advantages and long-term value. The Boynton Beach Award Program was established to recognize the best of local businesses in our community. Our organization works exclusively with local business owners, trade groups, professional associations and other business advertising and marketing groups. Our mission is to recognize the small business community's contributions to the U.S. economy. SOURCE: Boynton Beach Award Program CONTACT: Boynton Beach Award Program Email: PublicRelations@2020-townrankingcontact.com URL: http://www.2020-townrankingcontact.com ### HURRICANE ALLEY VOTED TOP 20 BURGERS OF 2020 PLEASE NOTE:* Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. Back To Top The Storm Surge Menu Soups & Salad Appetizers Raw Bar & Seafood Twisters Sandwiches Beverages Side Dishes Desserts Kid's Menu Doggie Bites Hurricane Alley - Raw Bar & Restaurant 529 East Ocean Avenue • Boynton Beach, FL 33435 Tel: (561) 364-4008 Email: info@myhurricanealley.com © 2025 Hurricane Alley Powered by Phaeton Systems Cart ( 0 )"
    },
    {
      "url": "https://www.myhurricanealley.com/togoordersupdate",
      "text": "TO GO ORDERS UPDATE — HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us HURRICANE ALLEY Home About the Alley Alley Food Updated Hours Home Food Menus Drink Menu Happy Hour Special Events Find Us IMPORTANT UPDATE REGARDING TO GO ORDERS! Due to Florida being so busy with the influx of tourists and people receiving their Vaccines, we are being flooded with orders and therefore we do not take TO GO ORDERS over the phone. You may place an order at the bar. Also due to the shortage of workers because of stimulus and unemployment checks, we are short staffed and ticket times may be longer than normal.  We apologize for the inconvenience and hope to return soon to our regular practices. We want to be safe when delivering and preparing food and we feel these measures are necessary for those that want to dine out and return to a normal way of life. If you can not reach the restaurant, please leave a message on our office phone (561) 364-4083 and we will return your call as soon as we can. Kim Kelly -Owner PLEASE NOTE:* Regarding the safety of these items, written information is available upon request. * Consuming raw or undercooked meats poultry seafood shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. There is a risk associated with consuming raw oysters. If you have chronic illness of the liver stomach or blood or have immune disorders, you are a greater risk of serious illness from raw oysters and should eat oysters fully cooked. If unsure of your risk consult a physician. Health inspection reports available upon request. Back To Top The Storm Surge Menu Soups & Salad Appetizers Raw Bar & Seafood Twisters Sandwiches Beverages Side Dishes Desserts Kid's Menu Doggie Bites Hurricane Alley - Raw Bar & Restaurant 529 East Ocean Avenue • Boynton Beach, FL 33435 Tel: (561) 364-4008 Email: info@myhurricanealley.com © 2025 Hurricane Alley Powered by Phaeton Systems Cart ( 0 )"
    }
  ]
}