{
  "fuentes": [
    {
      "url": "https://www.oldtowntequila.com/contact-us/",
      "email": "info@oldtowntequila.com"
    },
    {
      "url": "https://myoldtownusa.com/category/partners",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/contact-us",
      "email": "brandon.delanois@am.jll.com"
    },
    {
      "url": "https://www.myoldtownusa.com/contact-us",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/contact-us",
      "email": "leasing@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/parking",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.pratpartners.com/contactus/old-town-alexandria",
      "email": "proffice@pratpartners.com"
    },
    {
      "url": "https://www.pratpartners.com/contactus/old-town-alexandria",
      "email": "info@pratpartners.com"
    },
    {
      "url": "https://www.pratpartners.com/contactus/old-town-alexandria",
      "email": "kathi.loomer@pratpartners.com"
    },
    {
      "url": "http://myoldtownusa.com/reach-us/",
      "email": "brandon.delanois@am.jll.com"
    },
    {
      "url": "http://myoldtownusa.com/reach-us/",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "http://myoldtownusa.com/reach-us/",
      "email": "leasing@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/store-directory/stay-play-vacation-center",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.oldtowncp.com/about-us",
      "email": "ahodes@oldtowncp.com"
    },
    {
      "url": "https://www.oldtowncp.com/about-us",
      "email": "mserposs@oldtowncp.com"
    },
    {
      "url": "https://myoldtownusa.com/category/about-us/",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://myoldtownusa.com/reach-us",
      "email": "brandon.delanois@am.jll.com"
    },
    {
      "url": "https://myoldtownusa.com/reach-us",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://myoldtownusa.com/reach-us",
      "email": "leasing@myoldtownusa.com"
    },
    {
      "url": "https://www.biography.com/musicians/lil-nas-x",
      "email": "editor@biography.com"
    },
    {
      "url": "https://www.myoldtownusa.com/privacy-policy",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/car-shows-events",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.linkedin.com/company/old-town-companies",
      "email": "hr@oldtowndesigngroup.com"
    },
    {
      "url": "https://www.linkedin.com/company/old-town-companies",
      "email": "nhr@oldtowndesigngroup.com"
    },
    {
      "url": "https://www.myoldtownusa.com/partner-with-old-town",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/partner-with-old-town",
      "email": "marketing@myoldtownusa.com"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "advisor.services@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ask@ominternational.com"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "complaintadmin@oldmutual.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalcpt@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationaljhb@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalkzn@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalpe@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalpta@omwealth.co.za"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "email": "ominternationalservice@omwealth.co.za"
    },
    {
      "url": "https://www.oldtown-inn.com/contact-us",
      "email": "customercare@oldtown-inn.com"
    },
    {
      "url": "https://www.myoldtownusa.com/history-of-old-town",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/store-directory/ot-vapors",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.oldtownschool.org/aboutus/",
      "email": "customerservice@oldtownschool.org"
    },
    {
      "url": "https://myoldtownusa.com/shop/teams/",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.yourtown.com.au/who-we-are/our-team",
      "email": "yourtown@yourtown.com.au"
    },
    {
      "url": "https://www.oldtowneditions.com/who-we-are/",
      "email": "info@oldtowneditions.com"
    },
    {
      "url": "https://www.myoldtownusa.com/store-directory/teams",
      "email": "info@myoldtownusa.com"
    },
    {
      "url": "https://www.myoldtownusa.com/",
      "email": "info@myoldtownusa.com"
    }
  ],
  "mails": [
    "advisor.services@omwealth.co.za",
    "ahodes@oldtowncp.com",
    "ask@ominternational.com",
    "brandon.delanois@am.jll.com",
    "complaintadmin@oldmutual.co.za",
    "customercare@oldtown-inn.com",
    "customerservice@oldtownschool.org",
    "editor@biography.com",
    "hr@oldtowndesigngroup.com",
    "info@myoldtownusa.com",
    "info@oldtowneditions.com",
    "info@oldtowntequila.com",
    "info@pratpartners.com",
    "kathi.loomer@pratpartners.com",
    "leasing@myoldtownusa.com",
    "marketing@myoldtownusa.com",
    "mserposs@oldtowncp.com",
    "nhr@oldtowndesigngroup.com",
    "ominternationalcpt@omwealth.co.za",
    "ominternationaljhb@omwealth.co.za",
    "ominternationalkzn@omwealth.co.za",
    "ominternationalpe@omwealth.co.za",
    "ominternationalpta@omwealth.co.za",
    "ominternationalservice@omwealth.co.za",
    "proffice@pratpartners.com",
    "yourtown@yourtown.com.au"
  ],
  "nombre_sitio": "myoldtownusa.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.oldtowntequila.com/contact-us/",
      "text": "Contact Us Toggle menu Sign In or Register Wish Lists Compare Recently Viewed Cart Search Categories Tequila All Tequila Plata Blanco Reposado Anejo Extra Anejo Joven High Proof Still Strength Cristalino Rosa Highland Tequila Lowland Tequila Additive Free Non-Alcoholic Margarita Flavor Infused Tequila Mezcal All Mezcal Alto Americana Anejo Angustifolia Arroqueno Barril Bicuixe Bruto Capon Castilla Cenizo Chino Cirial Coyote Cristalino Mezcal Cuishe Cupreata Ensamble Espadilla Espadin Guerrero Inaequidens Jabali Joven Lamparillo Largo Lumbre Madrecuishe Madrecuixe Mexicano papalome Papalote Pechuga Pizorra Puebla Pulquero Puntas Rare Agave Reposado Rustico Sacatoro Salmiana San Luis Potosi Sanmartin sierra negra Sierrudo Silvestre Sotol Tamarindo Tepextate Tequilana Tobala Tobaxiche Tripon Variety Pack Verde Zacatoro Agave Spirits All Agave Spirits San Martinero Azul Bilia Botanical Gin Chato Comiteco Destilado de Agave Durango Goodjuice Agave Festival Lot001 Brands Martinero Mezcal Reviews Papalometl Penca Ancha Pulque Raicilla Pox Sotol Bacanora Agave Liqueur Mexico in a Bottle Spirits All Spirits Absinthe Aguardiente Amaro Aquavit Arak Armagnac Australian Whiskey Australian Whisky Baijiu Belgian Whisky Blended Malt Whisky Blended Scotch Whisky Blended Straight Whiskeys Bourbon Whiskey Brandy Cachaca Calvados Canadian Whiskey Canned Cocktails Cocktail Cognac Cream rum Eau de Vie Egg Liqueur Falernum Flavored Vodka Flavored Whiskey French Whiskey Gin Grappa Indian Whisky Irish Cream Irish Whiskey Israeli Whisky Japanese Whisky Kentucky Straight Bourbon Whiskey Kentucky Whiskey Licor Mixe Liqueur - Cordials Manhattan Mexican Whiskey Moonshine New Zealand Whiskey Non-Alcoholic Spirit old fashion Outland Whisky Ouzo Pisco Port Cask Finish Rum All Rum Agricole Rum Rye Malt Whisky Rye whiskey sake Sambuca Sherry Cask Single Grain Scoth Whisky Single Malt Scotch Whisky Single Malt Whisky South African Whisky Straight Rye Whiskey Taiwanese Whisky Vermouth Vodka White Whiskey Moonshine American Whiskey and Bourbon Wines All Wines Alcohol-Free Brut Cabernet Sauvignon Champagne Chardonnay Chinese Wine Dulce Imported Malbec Merlot Mexican Wine Non-alcoholic Petite Sirah Pinot Gris Pinot Noir Prosecco Red Blend Red Wine Riesling Rose Sangria Sauvignon Blanc shiraz Sparkling rose Sparkling Wine White Wine Zinfandel Port Wine Domestic Agave Wine Private Barrels & Batches Mini & Half Bottles All Mini & Half Bottles 50ml 100ml 200ml 375ml Rare & Top Shelf Mixers Organic & Kosher Gift & Bottle Combo Sets All Gift & Bottle Combo Sets Casa Dragones Joven Personalized Don Julio Custom Labels Patron Silver Custom Labels Volcan De Mi Tierra Calligraphy Glassware & Drinkware All Glassware & Drinkware Copitas Tequila Sippers Wine Glasses Engraving Warehouse Clearance Summer Selection News Shipping & Returns Blog Contact Us Corporate Gifts & Bulk Orders Events & Offers Sign In Register Search Categories Tequila All Tequila Plata Blanco Reposado Anejo Extra Anejo Joven High Proof Still Strength Cristalino Rosa Highland Tequila Lowland Tequila Additive Free Non-Alcoholic Margarita Flavor Infused Tequila Mezcal All Mezcal Alto Americana Anejo Angustifolia Arroqueno Barril Bicuixe Bruto Capon Castilla Cenizo Chino Cirial Coyote Cristalino Mezcal Cuishe Cupreata Ensamble Espadilla Espadin Guerrero Inaequidens Jabali Joven Lamparillo Largo Lumbre Madrecuishe Madrecuixe Mexicano papalome Papalote Pechuga Pizorra Puebla Pulquero Puntas Rare Agave Reposado Rustico Sacatoro Salmiana San Luis Potosi Sanmartin sierra negra Sierrudo Silvestre Sotol Tamarindo Tepextate Tequilana Tobala Tobaxiche Tripon Variety Pack Verde Zacatoro Agave Spirits All Agave Spirits San Martinero Azul Bilia Botanical Gin Chato Comiteco Destilado de Agave Durango Goodjuice Agave Festival Lot001 Brands Martinero Mezcal Reviews Papalometl Penca Ancha Pulque Raicilla Pox Sotol Bacanora Agave Liqueur Mexico in a Bottle Spirits All Spirits Absinthe Aguardiente Amaro Aquavit Arak Armagnac Australian Whiskey Australian Whisky Baijiu Belgian Whisky Blended Malt Whisky Blended Scotch Whisky Blended Straight Whiskeys Bourbon Whiskey Brandy Cachaca Calvados Canadian Whiskey Canned Cocktails Cocktail Cognac Cream rum Eau de Vie Egg Liqueur Falernum Flavored Vodka Flavored Whiskey French Whiskey Gin Grappa Indian Whisky Irish Cream Irish Whiskey Israeli Whisky Japanese Whisky Kentucky Straight Bourbon Whiskey Kentucky Whiskey Licor Mixe Liqueur - Cordials Manhattan Mexican Whiskey Moonshine New Zealand Whiskey Non-Alcoholic Spirit old fashion Outland Whisky Ouzo Pisco Port Cask Finish Rum All Rum Agricole Rum Rye Malt Whisky Rye whiskey sake Sambuca Sherry Cask Single Grain Scoth Whisky Single Malt Scotch Whisky Single Malt Whisky South African Whisky Straight Rye Whiskey Taiwanese Whisky Vermouth Vodka White Whiskey Moonshine American Whiskey and Bourbon Wines All Wines Alcohol-Free Brut Cabernet Sauvignon Champagne Chardonnay Chinese Wine Dulce Imported Malbec Merlot Mexican Wine Non-alcoholic Petite Sirah Pinot Gris Pinot Noir Prosecco Red Blend Red Wine Riesling Rose Sangria Sauvignon Blanc shiraz Sparkling rose Sparkling Wine White Wine Zinfandel Port Wine Domestic Agave Wine Private Barrels & Batches Mini & Half Bottles All Mini & Half Bottles 50ml 100ml 200ml 375ml Rare & Top Shelf Mixers Organic & Kosher Gift & Bottle Combo Sets All Gift & Bottle Combo Sets Casa Dragones Joven Personalized Don Julio Custom Labels Patron Silver Custom Labels Volcan De Mi Tierra Calligraphy Glassware & Drinkware All Glassware & Drinkware Copitas Tequila Sippers Wine Glasses Engraving Warehouse Clearance Summer Selection Popular Brands Don Julio Buffalo Trace Cutwater Codigo 1530 Sauza WhistlePig Del Maguey Rey Campero The Macallan Jack Daniel's View All Home Contact Us Contact Us Store Name and Address: \"OLD TOWN LIQUOR\" 2304 San Diego Ave A, San Diego, CA 92110 Store Phone: 619-291-4888 Store Hours: Monday-Friday 9am to 7pm, Saturday 10am to 7pm, Sunday 10am to 5pm FOR ONLINE ORDERS: Our shipping department is open Monday - Friday from 10:00am to 5:00pm PST PLEASE EMAIL FOR ALL QUESTIONS REGARDING PRODUCT AVAILABILITY, SHIPPING AND TRACKING, EMAIL: info@oldtowntequila.com Please keep in mind, during periods of increased order volumes, such as the holiday season, orders may be slightly delayed. Also feel free to refer to our shipping policy for any questions on shipping. Emails asking if we can ship to your location will go unanswered. Shipping price paid is just an estimate and may increase. We ship the latest products so bottle pictured online might be previous version but we try to keep pictures current. ***THE BEST WAY TO REACH US IS VIA THE CONTACT FORM BELOW*** Full Name Phone Number Email Address Required Order Number Comments/Questions Required OK Subscribe to our newsletter Email Address Nellys Market Inc. Old Town Tequila 2304 San Diego Ave San Diego, CA 92110 United States of America Call us at (619) 291-4888 Navigate News Shipping & Returns Blog Contact Us Corporate Gifts & Bulk Orders Events & Offers Sitemap Categories Tequila Mezcal Agave Spirits Spirits Wines © Old Town Tequila."
    },
    {
      "url": "https://myoldtownusa.com/category/partners",
      "text": "Car Shows & Events | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Car Shows & Events upcoming Signature events Excitement is always on the schedule at Old Town! From weekly car shows to live music that fills the air with timeless hits, every visit is a celebration. Whether youâre soaking in the nostalgia or joining us for one of our signature events, thereâs always something unforgettable happening. Car shows Every week at Old Town, we celebrate the automobile's rich history with special events that bring together car lovers of all stripes, making it a prime destination for Florida car shows. For nearly 35 years, Old Town has been a dreamy escape for car lovers from diverse cultures around the globe. Wednesday Night Bike Show Starting September 10th, mid-week brings its charm with this bike show that brings in everything from modern touring motorcycles to timeless classics. Each Wednesday from 6-10 P.M., the bike show transforms Old Town Entertainment District, featuring all makes and models of touring motorcycles, Harley, Indian, trikes and slingshots! Under the glow of string lights lining our quaint brick streets, guests are treated to Central Florida's most biker-friendly free event with live music, restaurants, shopping, attractions, and bars! Friday Night Muscle Car Show & Cruise Feel the pulse of excitement every Friday night at our Muscle Car Show! Starting at 3:00pm, guests can walk along Trophy Row to see a world of show-quality muscle cars from 1964 and newer âand older hot rods and classics dating up to 1985 (No Patina Allowed). Both car owners and spectators can enjoy the thrill of the show and cruise at no cost. Cars can register on-site prior to the cruise by entering Old Town from Highway 192 beneath the east side of the Jukebox signs. Our Event Staff will welcome you and guide you to a security escort that will lead you down the historic brick streets to your spot. Remember, driving on the bricks is by permission only. Start time: 3:00 PM Registration: 3:00 - 7:30 PM Cruise Kick-off: 8:30 PM â Cruisers, don't miss out on $2,000 in monthly giveaways â$1,000 on Fridays and another $1,000 on Saturdays. Each cruise you join at Old Town on Fridays or Saturdays enters you into a monthly draw. On the last Friday and Saturday of the month, one lucky Cruiser will win $1,000 per night, courtesy of Old Town! Saturday Night Classic Car Show & Cruise For nearly 35 years, our Classic Car Cruise has showcased vehicles manufactured prior to 1985, like hot rods, classics and antiques(No Patina Allowed)! Locals and visitors alike come from all over the world to watch our Classic Car Show & Cruise, which can have up to 250 cruisers! This event has been a staple, providing a weekly dose of nostalgia and excitement you wonât want to miss!Â Cruisers! Register your car on-site by arriving via Highway 192, where you'll spot the iconic Jukebox signs on the east entrance. Our friendly Event Staff will greet you and coordinate a security escort to guide you along the historic brick streets to your designated spot, in preparation for the cruise. Please remember, only registered cars are permitted to drive on the bricks. Start time: 1:00 PM Registration: 1:00 - 7:30 PM Cruise Kick-off: 8:30 PM Don't forget, cruising at Old Town can be extra rewarding with our $2,000 monthly giveaways â$1,000 given away each Friday and Saturday. Join us for any cruise on these nights and you'll automatically be entered into our monthly drawing. As the month wraps up, one fortunate Cruiser will be chosen each night on the final Friday and Saturday to win $1,000! events schedule Our event schedule is always full at Old Town, with daily events designed to entertain all ages! Here, every occasion becomes a celebration; whether you're experiencing the thrills of our weekly car shows, enjoying live music that fills the night air with familiar melodies spanning eras and genres, or attending one of our signature events, Old Town ensures that your visit is packed with memories. Our weekly events included: Tuesday - Karaoke Wednesday - Themed Car Show Thursday - Karaoke Friday - Muscle Car Show and Cruise Saturday - Classic Car Show and Cruise Last Sunday of each Month - Import Car Show In addition to our weekly events, families can look forward to our signature events: Halloween at Old Town - October 31st VetteFest - First Saturday in October New Yearâs Eve - December 31st 4th of July - July 4th Classic Car Show & Cruise Anniversary - Third Saturday in March Sign-Up for Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.myoldtownusa.com/contact-us",
      "text": "Contact Us | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Get in Touch Hours &Â locations 5770 W Irlo Bronson Memorial Hwy, Kissimmee FL, 34746 (407) 396-4888 Hours:Â Monday - Sunday 11:00 am - 11:00 pm Security/Lost and Found: (407) 225-0553 Interested in leasing space at Old Town? Read more about our Leasing Opportunities . Directions Old Town is located one mile east of I-4 (exit 67) at 5770 W. Irlo Bronson Memorial Highway (Hwy. 192) in Kissimmee, FL. leasing opportunities We have available retail / storefront space as low as 675 Sq feet to space measuring 1,500 sq. feet. There is retail kiosk units on Main Street and throughout the property also available.If you are interested in retail space or a kiosk at Old Town, please contact the following: â Retail Space / Storefront Brandon Delanois Phone: 407.982.8648 Email â Retail Kiosk Luly Ramos & Thearon Scurlock Phone: 407.507.2065 Email â Street Performer Application First Name* Last Name* Email Address* Company Name* About* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Vendor Application First Name* Last Name* Email Address* Company Name* Company Description* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. sign-up for our newsletter First Name* Last Name* Email Address Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.myoldtownusa.com/parking",
      "text": "Parking | Old Town USA | Entertainment District in Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Parking Old Town offers free parking year-round. Parking lots are conveniently located behind each building, and there are plenty of accessible spaces that provide wheelchair access to the property. Additionally, located just adjacent to Old Town, off of Florida Plaza Blvd and directly across from Fun Spot, there's an expansive parking lot that provides over 650 parking spots and is a short walk to our entrance.Â Weekend parking is $10 per car, and some special events may incur a charge. Parking attendants can only accept cash for parking payment. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.pratpartners.com/contactus/old-town-alexandria",
      "text": "Contact Us - OLD TOWN ALEXANDRIA | PR at Partners APPOINTMENTS MENU ABOUT US History Eco Service Fee VIDEOS BLOG Cancellation Policy Start Your Fresh Hair Partnership LOCATIONS VIRGINIA Belmont Chase Bristow Gainesville Manassas McLean Oakton Old Town Alexandria Reston Shirlington Warrenton DC Downtown Friendship Heights PR Barbers APPOINTMENTS CONTACT US VIRGINIA Belmont Chase Bristow Gainesville Manassas McLean Oakton Old Town Alexandria Reston Shirlington Warrenton DC Downtown Frienship Heights CAREERS ACADEMY GIFT CARDS CONTACT US CONTACT US 1008 King Street Old Town Alexandria, VA 22314 Text or Call 703-683-6600 CORPORATE OFFICE PR at Partners is all about you. If you have any suggestions on how we can improve our experience, or you need assistance after a service please e-mail PRoffice@pratpartners.com For general information about the company, the site, promotions or to send a resume send an email to info@pratpartners.com . To contact individual salons, visit the locations section of the site. There you will find a complete listing of salons and their contact information. PR at PARTNERS Privacy Policy SHARE PR ACADEMY & STUDIO ©2025 designed & developed by salonclouds+"
    },
    {
      "url": "http://myoldtownusa.com/reach-us/",
      "text": "Contact Us | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Get in Touch Hours &Â locations 5770 W Irlo Bronson Memorial Hwy, Kissimmee FL, 34746 (407) 396-4888 Hours:Â Monday - Sunday 11:00 am - 11:00 pm Security/Lost and Found: (407) 225-0553 Interested in leasing space at Old Town? Read more about our Leasing Opportunities . Directions Old Town is located one mile east of I-4 (exit 67) at 5770 W. Irlo Bronson Memorial Highway (Hwy. 192) in Kissimmee, FL. leasing opportunities We have available retail / storefront space as low as 675 Sq feet to space measuring 1,500 sq. feet. There is retail kiosk units on Main Street and throughout the property also available.If you are interested in retail space or a kiosk at Old Town, please contact the following: â Retail Space / Storefront Brandon Delanois Phone: 407.982.8648 Email â Retail Kiosk Luly Ramos & Thearon Scurlock Phone: 407.507.2065 Email â Street Performer Application First Name* Last Name* Email Address* Company Name* About* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Vendor Application First Name* Last Name* Email Address* Company Name* Company Description* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. sign-up for our newsletter First Name* Last Name* Email Address Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.myoldtownusa.com/store-directory/stay-play-vacation-center",
      "text": "Stay & Play Vacation Center | Old Town USA VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs PARTNERS parking accessibility map tickets contact us car shows & events things to do Shops drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Shops / Stay & Play Vacation Center Stay & Play Vacation Center Favourite WebSIte View Map Menu Welcome to Stay & Play Vacation Center, your one-stop shop for attraction tickets in Old Town, Kissimmee! Conveniently located in the heart of the action, our service center is dedicated to helping you get to where you want to go. Whether you're planning to visit theme parks, explore local attractions, or enjoy exciting tours, we've got you covered. Our friendly staff is here to provide expert advice and ensure you get the best deals on tickets. Make your vacation unforgettable with Stay & Play Vacation Centerâwhere adventure begins! Hours Location Phone (407) 390-0286 buy tickets Favourite CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.oldtowncp.com/about-us",
      "text": "ABOUT US | Old Town Capital Partners top of page SELECT PROJECTS ABOUT US IN THE NEWS CONTACT Menu Close A real estate investment and development company focused on multi-family acquisitions and development. About Us Headquartered in Miami Beach, Oldtown Capital Partners is a real estate company focused on investing and developing apartment buildings in South Florida, Central Ohio, and Indiana. ​ Oldtown blends a data-driven approach with thoughtful, innovative design, delivering properties that offer both functional and meaningful living experiences. Guided by an entrepreneurial spirit and supported by a network of highly localized strategic partners, Oldtown identifies unique opportunities that maximize risk-adjusted returns for investors at every stage of the market cycle. Mission Statement At Oldtown Capital Partners, our mission is to operate a best in-class real estate development and investment asset management company in the select markets we operate in. Anthony Hodes President ahodes@oldtowncp.com (312) 282-0342 Anthony Hodes is the President and Founder of Oldtown Capital Partners, where he leads the firm’s strategic vision and oversees its ground-up development platform. With extensive experience in institutional real estate investment and development, Anthony plays a pivotal role in driving the firm’s growth and success. ​ Before founding Oldtown, Anthony held several key positions in the real estate industry. He most recently worked with Related Companies in financial analysis and project management roles on the market-rate development team in Chicago. Prior to his time at Related, Anthony was involved in real estate private equity at Tribune Real Estate Holdings, where he honed his expertise in managing complex transactions and large-scale developments. ​ Recognized for his leadership and contributions to the industry, Anthony was named one of Chicago’s Latino 40 Under 40 by Negocios Now. He holds a B.A. in History from the University of Michigan. ​ Michael Serposs Partner mserposs@oldtowncp.com (612) 723-1649 Michael Serposs is a Founding Partner of Oldtown Capital Partners. Mr. Serposs oversees the company’s asset management, property management and Columbus acquisitions. ​ Prior to Oldtown, he was a Director for Starwood Retail Partners, the retail arm of the global private equity firm Starwood Capital Group. In this capacity, he underwrote and deployed over $300 million in accretive redevelopment capital to revitalize and transform the shopping center portfolio into dynamic mixed-use assets. Prior to joining Starwood, Mr. Serposs worked as a commercial real estate appraiser at the financial advisory firm Duff & Phelps. ​ Mr. Serposs holds a B.A. from the University of Wisconsin-Madison, where he was a triple major in Real Estate & Urban Land Economics, International Business, and Economics. Privacy Policy © 2025 Oldtown Capital Partners Website by Jayne Marie Design SELECT PROJECTS ABOUT US IN THE NEWS CONTACT bottom of page"
    },
    {
      "url": "https://myoldtownusa.com/category/about-us/",
      "text": "Home | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets welcome to Old Town entertainment district Sign-Up for Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Step into the vibrant heart of Kissimmee and immerse yourself in the nostalgic charm of Old Town! This enchanting entertainment district is a kaleidoscope of fun, offering an eclectic mix of delightful dining, unique shopping experiences, and thrilling rides for the young and young at heart. Whether you're a thrill-seeker, a foodie, or a shopping aficionado, Old Town has something to spark joy in every visitor! events Cars, entertainment and events - Oh my! EXPLORE drink & dine Savor the charm and enjoy the delightful food at Old Town EXPLORE shops Discover unique finds from every decade, only at Old Town! EXPLORE WEEKLY EVENTS go to all events NOW OFFICIALLY OPEN! Maw's Mountain Moonshine Old Town is excited to announce the exciting addition of Mawâs Mountain Moonshine. Â The five generations Adkins moonshine family is now bringing a second location of their Craft Cocktail Distillery to Old Town and Kissimmee! follow us what people say I always enjoy coming here. Lots of things to do. Bars stores games rides food they have it all. There's always something going on here from concerts to car shows. Michael Absolute highlight from our trip. The atmosphere is wonderful. Lots of live music and some lovely bars. We stayed to see the parade of cars, which was a really unique and fun experience. Highly recommend going here! Romy Coers I love visiting old town because of how many things you can do at the same time. They have a lot of restaurants and bars to choose from. The main thing that I love about visiting old town is their car show, as a car enthusiastic I love watching theirs cars. Annie A Old town was always such a fun place to visit. I loved coming down here just to see all the fun stuff. The old cars, crazy art work and fun colors are a must see. Amber Steele We made our 1st trip to Old Town over 14 years ago, and it's even better now. A series of shops and eateries attached to an amusement park. If you want a break from the huge pricey theme parks, this is a nice alternative. Tialisa Whipple Old town is an amazing place they have car shows on a weekend live music. Shane Ball CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://myoldtownusa.com/reach-us",
      "text": "Contact Us | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Get in Touch Hours &Â locations 5770 W Irlo Bronson Memorial Hwy, Kissimmee FL, 34746 (407) 396-4888 Hours:Â Monday - Sunday 11:00 am - 11:00 pm Security/Lost and Found: (407) 225-0553 Interested in leasing space at Old Town? Read more about our Leasing Opportunities . Directions Old Town is located one mile east of I-4 (exit 67) at 5770 W. Irlo Bronson Memorial Highway (Hwy. 192) in Kissimmee, FL. leasing opportunities We have available retail / storefront space as low as 675 Sq feet to space measuring 1,500 sq. feet. There is retail kiosk units on Main Street and throughout the property also available.If you are interested in retail space or a kiosk at Old Town, please contact the following: â Retail Space / Storefront Brandon Delanois Phone: 407.982.8648 Email â Retail Kiosk Luly Ramos & Thearon Scurlock Phone: 407.507.2065 Email â Street Performer Application First Name* Last Name* Email Address* Company Name* About* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Vendor Application First Name* Last Name* Email Address* Company Name* Company Description* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. sign-up for our newsletter First Name* Last Name* Email Address Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.biography.com/musicians/lil-nas-x",
      "text": "Lil Nas X: How He Rose from Nicki Minaj Superfan to His Own Stardom Search Newsletter History - Culture Musicians Athletes Movies - TV Artists Power - Politics Business Scientists Scholars - Educators Activists True Crime BIO Buys Privacy Notice Terms Of Use Skip to Content History & Culture Musicians Athletes Movies & TV Newsletter Charlie Sheen’s Addiction Kathy Bates Almost Quit Emmy Nominee Owen Wilson Shohei Ohtani Real-Life Heroes of 9/11 Famous Musicians LGBTQ Pride Lil Nas X Lil Nas X Lil Nas X is a Grammy Award–winning singer known for the hits “Old Town Road,” “Montero (Call Me By Your Name),” and “Industry Baby.” By Biography.com Editors and Catherine Caruso Updated: Aug 27, 2025 11:30 AM EDT Listen (13 min) 13 min Getty Images We may earn commission from links on this page, but we only recommend products we back. 1999–present Lil Nas X Now: Grammy Winner Speaks Out About Arrest and Felony Charges Lil Nas X has opened up about his arrest and time in jail. The Grammy-winning rapper, whose real name is Montero Lamar Hill, pleaded not guilty to four felony charges on August 25 after he was accused of assaulting police officers in Los Angeles. “That was a terrifying last four days,” he said in a video posted to his Instagram Story on August 26. “But your girl is gonna be alright.” Lil Nas X was found roaming around Ventura Boulevard on Thursday, August 21, wearing only his underwear and cowboy boots. TMZ later released footage of him walking around fully naked. According to the Los Angeles Police Department, the 26-year-old rushed at officers when they approached him and was subsequently arrested and hospitalized for a possible overdose. While he was initially booked on a misdemeanor battery charge , he is now charged with three felony counts of battery against a police officer and one count of resisting arrest. After entering his plea, Lil Nas X was released on a $75,000 bail and ordered to attend Narcotics Anonymous meetings. Christy O’Connor, an attorney representing Lil Nas X, said the “Old Town Road” singer wasn’t under the influence of illegal substances at the time of his arrest. NBC News reports he is due back in court for a hearing on September 15. Jump to: Who Is Lil Nas X? Quick Facts Early Life Songs and Album Is Lil Nas X Gay? Net Worth Quotes Who Is Lil Nas X? Lil Nas X is a Grammy Award–winning rapper and singer known for the hits “Old Town Road,” “Montero (Call Me By Your Name),” and “Industry Baby.” Nas rose to fame in 2019 when his breakthrough hit “Old Town Road” went viral, enjoyed a record 19 weeks atop the Billboard Hot 100, and later earned him two Grammys. The Georgia native released his debut album Montero in 2021, which featured the pop-rap hits “Industry Baby” and “Montero (Call Me by Your Name),” as well as the more personal tune “Sun Goes Down,” which addresses coming to terms with his sexuality. In March 2025, he released an EP titled Days Before Dreamboy . Quick Facts FULL NAME: Montero Lamar Hill BORN: April 9, 1999 BIRTHPLACE: Lithia Springs, Georgia ASTROLOGICAL SIGN: Aries Early Life Lil Nas X is the stage name of Montero Lamar Hill. He was born on April 9, 1999, in Lithia Springs, Georgia. His mother called him Montero in honor of the Mitsubishi Montero, a car she liked. After Nas’ parents separated when he was 6, he and his siblings went to live with their mother and great-grandmother in an Atlanta public-housing project that was known for drugs and violence. About four years later, a custody battle resulted in Nas and his older brother moving to the Atlanta suburbs to live with their father and stepmother. Nas has said he was aware he was gay since he was 5 years old. As he got older, he witnessed the bullying and homophobia people who came out had to deal with and decided he would always stay in the closet. His father was a gospel singer, and Nas had to attend church. Religion also colored how he viewed his sexuality. “I even thought, ‘If I have these feelings, it’s just a test. A temporary test. It’s going to go away. God is just tempting me,’” he told British GQ in May 2021. More Musicians from Atlanta Halle Bailey CeeLo Green Gladys Knight Throughout high school, Nas kept his head down. His main focus was online life as a superfan of Nicki Minaj . On Twitter as @nasmaraj, Nas interacted with other Minaj admirers, known as the Barbz, and learned how to get attention on social media. Nas later enrolled in the University of West Georgia to study computer science but soon realized that he didn’t enjoy college. It was then that he started writing songs and found that he loved creating music. To his father’s dismay, he decided to drop out of school to pursue a career as a musician. Songs and Album After leaving college, Nas lived with his sister while sharing his music online. He saw the popularity of country-trap videos, which mixed country music and a Southern style of hip-hop. With a beat purchased online for $30, he created his own country-trap song titled “Old Town Road.” “It was the first song I genuinely formulated,” he told Rolling Stone in May 2019. “I was like, ‘I gotta make it short, I gotta make it catchy.’” Nas posted the tune to SoundCloud in December 2018. His social media abilities helped the tune go viral on TikTok and spread to other sites. It was around this time that he adopted his stage name, Lil Nas X. “Nas” drew on the Twitter account he ran while a devoted fan of Nicki Minaj and “X,” the Roman numeral for 10, represented the number of years he thought it would take to find fame. He was quickly proved wrong. Success with “Old Town Road” In March 2019, “Old Town Road” made it onto three Billboard charts: the Hot 100, Hot R&B/Hip-Hop Songs, and Hot Country Songs. Then it was removed from the country chart. Billboard ’s official reasoning was that Nas’ song did “not embrace enough elements of today’s country music,” but many wondered if his being a Black man had influenced the decision. (Billboard said race was not a factor.) Getty Images Billy Ray Cyrus and Lil Nas X set a Billboard Hot 100 record for most weeks at No. 1 for their massive hit “Old Town Road.” Amid this controversy, the song reached No. 1 on the Hot 100. That April, he released a remix of “Old Town Road” featuring Billy Ray Cyrus, the 1990s country star and father of Miley Cyrus , who Nas knew from Bill Ray’s role on Hannah Montana . With help from remixes by Cyrus and others, “Old Town Road” set a record for staying atop the Hot 100 chart for 19 weeks. It remains the longest No. 1 streak of any song this century, though Shaboozey tied the mark in 2024 with “A Bar Song (Tipsy).” In 2020, Nas and his collaborator won two Grammy Awards for “Old Town Road.” The hit song was recognized as the Best Pop Duo/Group Performance and the Best Music Video. Nas had also been in the running for three of the most prestigious awards—Best New Artist, Record of the Year, and Album of the Year for his first EP—but didn’t win in the categories. Debut Album Montero After the success of “Old Town Road,” Nas signed with Columbia Records in March 2019. His next songs “Panini” and “Rodeo,” featured on his EP 7, received attention but didn’t reached the heights of “Old Town Road.” In January 2021, Nas released the children’s book, C Is for Country , about himself and a character named Panini the Pony. It quickly became a bestseller. Keep Reading Get to Know 6 History-Making Black Country Singers Two months later, the singer released the single “Montero (Call Me By Your Name).” The song, which debuted at No. 1 on the Billboard Hot 100 chart, explicitly addressed his sexuality, with the title referencing the 2017 gay romantic drama Call Me By Your Name starring Timothée Chalamet and Armie Hammer . The accompanying music video drew on visuals linked to the Christian faith and the idea that being gay meant being denied salvation. The video, along with a tie-in release of “Satan Shoes,” drew ire online, but Nas responded , “The love outweighs the hate by like a hundred.” His mastery of social media allowed Nas to swat back at critics while bringing attention to his work. At the same time, Nas shared a heartwarming message to his younger self on social media. “I know we promised to never come out publicly, I know we promised to never be ‘that’ type of gay person, I know we promised to die with the secret, but this will open doors for many other queer people to simply exist,” he wrote. In May 2021, Nas performed “Montero (Call Me by Your Name)” and the more personal “Sun Goes Down” on Saturday Night Live . His pants split during his performance, and he later tweeted that this wardrobe malfunction hadn’t been planned. Getty Images Lil Nas X made his Saturday Night Live debut in May 2021, four months before his first album dropped. The singles laid the foundation for his debut album Montero . Ahead of its September 2021 release, Nas shared photos in which he sported a prominent pregnancy bump. “I’m like a mother sending her child out into the world,” he explained to People . The record, which debuted at No. 2 on the Billboard 200, featured collaborations with Elton John , Miley Cyrus, Megan Thee Stallion , Jack Harlow, and Doja Cat . The track “Industry Baby,” featuring Harlow, topped the Hot 100. That same month, Nas received the Suicide Prevention Advocate of the Year Award from The Trevor Project. “If using my voice and expressing myself in my music can help even one kid out there who feels alone, then it was all worth it,” he said in response. Montero earned Nas five more Grammy nominations, bringing his career total to 11. The title track competed for Record and Song of the Year, as Montero itself garnered a nod for the Album of the Year. However, the singer left the 2022 ceremony empty handed. New Music: Days Before Dreamboy After a hiatus, Lil Nas X returned in January 2024 with the upbeat single “J Christ” followed by the emotional “Where Do We Go Now?” Another single, “Light Again!,” dropped that November and appeared in Nas’s EP Days Before Dreamboy . The eight-track collection arrived in March 2025 with no advanced fanfare. His upcoming sophomore album Dreamboy is set to arrive later this year. However, an exact release date has yet to be announced. In April 2025, the musician was briefly hospitalized after suddenly experiencing partial facial paralysis. He has since made a full recovery. Is Lil Nas X Gay? Today, Lil Nas X is such a proud standard-bearer among gay men that it might seem unthinkable that the singer once promised himself he’d never share his sexuality. However, as his fame grew in 2019, Nas decided to stop hiding. He first came out to his sister and brother, then shared the truth with his father. His father at first asked if Nas was being tempted by the devil but came to accept and fully support his son. At the end of Pride Month in June 2019, Nas publicly came out. After appearing at a Pride concert at the Glastonbury Festival, he instructed his fans to “listen closely” to the lyrics of his song “C7osure (You Like)” to reveal he was gay. Nas knew sharing this information could alienate some of his peers and fans in country and hip-hop and was the target of homophobic comments by some rappers. Still, he stood by his decision. He later explained to XXL Magazine in September 2021, “I honestly felt like it was kind of my duty. Especially if I wanted to move forward.” Since 2023, he has posted on his social media accounts about being bisexual. That January, he shared on X (formerly Twitter), “would y’all be mad at me if i thought i was a little bisexual.” However, in a documentary later that year about the Grammy winner, he refers to himself as gay. More LGBTQ Stories The Best LGBTQ+ Books to Read Right Now What Compelled Gilbert Baker to Create the Rainbow Pride Flag The People and Legacy of The Stonewall Inn In 2021, Nas briefly dated dancer Yai Ariza, who appeared in his music video for “That’s What I Want,” but ended the relationship just months later. “I’m at this point in my life where I finally realized that I don’t want to fall in love,” he told People at the time. “I’m so focused on my music career, and love takes a lot of time. It’s a lot of responsibility, and I don’t think I’m ready to have that extra responsibility on my shoulders right now. When it happens, it’s going to happen.” Net Worth As of August 2025, Lil Nas X an estimated net worth of $9 million, according to Celebrity Net Worth . Quotes There’s always gonna be fear when you’re doing something that’s literally life-changing. But you just have to do it, you know? Not to sound self-centered, but it feels like I’m chosen, in a way, to do this stuff. Seeing digital numbers, it’s a good feeling. It goes so quickly, though. You have to keep going. If using my voice and expressing myself in my music can help even one kid out there who feels alone, then it was all worth it. Fact Check: We strive for accuracy and fairness. If you see something that doesn’t look right, contact us ! Biography.com Editors Staff Editorial Team and Contributors The Biography.com staff is a team of people-obsessed and news-hungry editors with decades of collective experience. We have worked as daily newspaper reporters, major national magazine editors, and as editors-in-chief of regional media publications. Among our ranks are book authors and award-winning journalists. Our staff also works with freelance writers, researchers, and other contributors to produce the smart, compelling profiles and articles you see on our site. To meet the team, visit our About Us page: https://www.biography.com/about/a43602329/about-us Catherine Caruso Associate Profiles Editor Catherine Caruso joined the Biography.com staff in August 2024, having previously worked as a freelance journalist for several years. She is a graduate of Syracuse University, where she studied English literature. When she’s not working on a new story, you can find her reading, hitting the gym, or watching too much TV. Watch Next Advertisement - Continue Reading Below LGBTQ Pride How Gilbert Baker Created the Rainbow Pride Flag Sally Ride Sylvia Rivera 14 LGBTQ Rights Activists You Should Know Advertisement - Continue Reading Below Harvey Milk Billie Jean King and the “Battle of the Sexes” Oscar Wilde Lady Gaga Maren Morris Chappell Roan How Did Chappell Roan Get Famous? 10 Groundbreaking Women in U.S. Politics Advertisement - Continue Reading Below About Biography.com Newsletter Contact Us Other Hearst Subscriptions A Part of Hearst Digital Media We may earn commission from links on this page, but we only recommend products we back. ©2025 Hearst Magazine Media, Inc. Site contains certain content that is owned A&E Television Networks, LLC. All Rights Reserved. Biography and associated logos are trademarks of A+E Networks®protected in the US and other countries around the globe. Privacy Notice Terms of Use CA Notice at Collection DAA Industry Opt Out Your CA Privacy Rights/Shine the Light Cookies Choices"
    },
    {
      "url": "https://www.myoldtownusa.com/privacy-policy",
      "text": "Privacy Policy | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs PARTNERS parking accessibility map tickets contact us car shows & events things to do Shops drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Privacy Policy OLD TOWN Privacy Policy and Website Use Terms Last updated: June 2021 â 1. Â About This Document â This is the privacy policy of Old Town Kissimmee, LTD.. (referred to as âweâ, âusâ or âourâ). We are incorporated under the laws of Florida. Our incorporation address is 5770 W. Irlo Bronson Memorial Highway, STE 323, Kissimmee, FL 34746. This document sets out our privacy policy in respect of consumer personal information, which will govern the way in which we process any personal information that you provide us with. It serves as an expression of our commitment to protecting your private personal information. We adopt this policy to comply with the Florida Consumer Privacy Act of 2018 (âCCPAâ) and other Florida privacy laws. Â Any terms defined in the CCPA have the same meaning when used in this notice. Please see Section 9 below for the rights which the law provides you with in relation to your personal information. We will provide a link to this privacy notice when you are using our website, providing any personal information to us, or booking any travel services with us and we will ask you to read and confirm you have read this document where we collect your personal information. 2. Our Commitment â We respect your right to privacy and we aim to ensure you have a trustworthy experience with us, including when using our websites or shops. We understand that you care about how your personal information is used by us, and we want to share with you the policies and practices weâve adopted. This way you can feel confident about how we handle your personal information that you entrust to us. â 3. Who Our Privacy Policy Covers 3.1 Our customers Our privacy policy sets out how we process personal information relating to individuals who are booking or enquiring about booking travel services with or through us or who are the recipients of any travel services booked with or through us (e.g. you are the passenger for a booking or booking enquiry made by someone else for you), or who are customers or potential customers or recipients of travel services that can be booked with or through us. â â 3.2 Examples of who this policy covers We include in this privacy policy personal information we process relating to: (1) where our customer is a business or organization, employees or individuals who are acting as representatives of that business or other organization, and individuals connected to that business or other organization, such as owners, partners, shareholders, and directors; (2) individuals who visit our website or other online sites operated by us or our contractors or affiliates; (3) individuals who create an online account (if applicable); (4) individuals whose personal information from other companies in our group (such as where you have consented to your personal information being disclosed to other group companies for marketing purposes); and (5) individuals or businesses from any other arrangement with us. â 3.3 When we are an information processor only This privacy policy does not apply where we are processing personal information strictly as a sub-contractor or information processor on behalf of a third party, and not on our own account. In this case, you should look to that third party, who will be answerable for how we process that personal information and its privacy policy. â 3.4 Terms used in this policy When we refer to âyouâ and âyourâ in this privacy policy, we refer to you, any such individual whose personal information we process from time to time. When we refer to âprocessâ or âprocessingâ of your personal information, this includes collecting, recording, storing or holding your personal information, and anything we do with it, such as organizing, adapting or altering it, retrieving, consulting or using it, disclosing it or otherwise making it available to others, combining it with other information, and blocking, erasing or destroying it. â 4. Information We Collect â We collect information that identifies, relates to, describes, references, is capable of being associated with, or could reasonably be linked, directly or indirectly, with a particular consumer or device (âpersonal informationâ). In particular, we have collected the following categories of personal information from consumers within the last twelve (12) months: Category Examples Collected A. Identifiers. A real name, alias, postal address, unique personal identifier, online identifier, Internet Protocol address, account name, Social Security number, driverâs license number, passport number, age, photographs, gender, address, telephone, mobile, fax, e-mail, social networking contact details, proofs of identity and address, copies of passports, driving licenses, and utility bills, card and other payment details, and financial information, health information relevant to your planned travel, and travel insurances held, results of searches carried out against you (such as to verify you identity, address, and credit status), your preferences, frequent flyer or travel partner program affiliation and member number, and any other information provided to us by or in relation to you which concern you as an individual or other similar identifiers. YES B. Commercial information. Information concerning enquiries and bookings made with or through us for travel services, including where you are making the enquiry or booking or are the recipient of the travel services to which the enquiry or booking relates. Records of personal property, products or services purchased, obtained, or considered, or other purchasing or consuming histories or tendencies, records of enquiries and searches for holiday and travel products made by or on your behalf, details of your personal interests, needs and other data relevant to your enquiry; details of results, quotes, proposals, estimates and other information given in response to enquiries; details of the holiday, accommodation, travel, car hire, and other travel services booked or enquired about; details of the passengers / holidaymakers travelling; details of the provider of the travel services (e.g. tour operator); dates and times of travel; price; payment details (including card details); passport information and visa information; foreign exchange requirements and arrangements; and sensitive information such as health, medical, dietary, mobility, disability, religious or other special conditions or requirements. YES C. Biometric information. Genetic, physiological, behavioral, and biological characteristics, or activity patterns used to extract a template or other identifier or identifying information, such as, fingerprints, faceprints, and voiceprints, iris or retina scans, keystroke, gait, or other physical patterns, and sleep, health, or exercise data. NO D. Internet or other similar network activity. Browsing history, search history, information on a consumerâs interaction with a website, application, or advertisement. Information generated concerning the performance of any booking or other contract made with or through us, including information relating to anything arising during any holiday or other travel services, and information relating to payments to be made. Information collected or generated out of any surveys we conduct. Information collected or generated out of any competitions or promotions we run. Information concerning any accounts, registrations, or memberships with us, or participation in any loyalty program. Correspondence, communications and messages, including between you and us, and between us and third parties, including relating to any booking or booking enquiry, or performance of any contract. We may collect information about your visits to, browsing of, and use of our website, unless your web browser blocks this. The range of information we collect will depend on how you interact with our website. This information may include: your IP address (a unique identifier allocated to your computer for your connection to the internet); your computer device details (PC, tablet, smartphone, watch etc.); the make and version of web browser (e.g. Internet Explorer, Firefox, Safari, Opera, Chrome) you are using; your operating system (e.g. Windows, Windows Phone, OSX, iOS, Android, Linux etc.); your time-zone; your browser plug-ins; any web-page you came from, identified as the referrer web page address by your web browser; cookies; page response times; download error; pages and parts of pages you visit; usage you make of our website, including enquiries and searches undertaken, and registrations for accounts, forums etc.; services and products you viewed; length of visit to website and pages; page interaction information (such as scrolling, keys pressed, mouse clicks, touches, and mouse-overs). This will normally be collected and used anonymously, and aggregated for analysis, with your name and any characteristics identifying you remaining anonymous, but our privacy policy will apply, and it will be treated as your personal information, if this information is in any way linked to you personally. This information may also include: information inputted into forms and field; registrations for any accounts, forum, feedback mechanism, social functionality, newsletters or other features of our site; usernames and passwords, log-in / out history, and settings; actions taken within any account or other registration, including view and update and changes to settings; and posts to any forum, feedback, review or other social functionality on our website. YES E. Geolocation data. Physical location or movements. NO F. Sensory data. Audio, electronic, visual, thermal, olfactory, or similar information. NO G. Professional or employment-related information. Current or past job history or performance evaluations, business or organization details (such as name, address, telephone numbers, payment arrangements, financial information, etc.), your relationship with that business or organization (such as owner, partner, director, shareholder, employee, or agent), and your contact details within that business (such as work address, work telephone and mobile numbers, work fax number, and work e-mail address). YES H. Non-public education information (per the Family Educational Rights and Privacy Act (20 U.S.C. Section 1232g, 34 C.F.R. Part 99)). Education records directly related to a student maintained by an educational institution or party acting on its behalf, such as grades, transcripts, class lists, student schedules, student identification codes, student financial information, or student disciplinary records. NO I. Inferences drawn from other personal information. Profile reflecting a personâs preferences, characteristics, psychological trends, predispositions, behavior, attitudes, intelligence, abilities, and aptitudes. NO Personal information does not include: Publicly available information from government records. De-identified or aggregated consumer information. Information excluded from the CCPAâs scope, like: health or medical information covered by the Health Insurance Portability and Accountability Act of 1996 (HIPAA) and the California Confidentiality of Medical Information Act (CMIA) or clinical trial data; personal information covered by certain sector-specific privacy laws, including the Fair Credit Reporting Act (FRCA), the Gramm-Leach-Bliley Act (GLBA) or California Financial Information Privacy Act (FIPA), and the Driverâs Privacy Protection Act of 1994. â 5. How We Collect Or Generate Your Personal Information This section sets out the ways in which we may collect or generate personal information concerning you. We obtain categories of personal information listed above from the following categories of sources: â 5.1 Visiting our website By visiting and using our website you or your computer may provide personal information. This includes: information which is automatically provided by your browser to our servers; information record on our web servers about your interaction with our website and pages viewed; information we capture or place on your computer or generate using cookies or other technologies on our website; and information you input into forms and fields on our website. â 5.2 Data you provide Your personal information will include information you provide (or later amend), whether: from correspondence with you; verbally to us over the phone or in person; by filing in any field or form on a website; by posting on our social media channel; by posting on any forum referencing us; by filling in any printed form we provide you with; by e-mail; from documents you provide use with; and from updates to any information to provide from time to time. This includes when you: register or subscribe for any service, account, members, or loyalty program, or make an enquiry or booking for a holiday or other travel services whether in person, by phone, through our website or otherwise; send us your comments or suggestions; subscribe to any newsletter or other publication; and request sales and advertising information, including brochures. If you do not provide us with your personal information we will be unable to provide you with information or book travel services for or on your behalf. â 5.3 User Generated Content (UGC) We may process, Information or content provided by you in relation to your feedback or experience on a past, current or future trip with us. We will only use such content and images you have submitted to our social media channels or websites, if you have given consent to let Old Town and TTC subsidiary companies to process this information in various initiatives. These could include any marketing activities such as: Print materials â on our website â email activities â social posts â images on our trips â provide images to our trade partners to use on their websites, email marketing and other marketing initiatives â make available in our content feeds â We would share imagery in our content feeds, image repositories, via email and share with our trade partners via these methods â Any other information provided to us by or in relation to you which concerns you as an individual. â 5.4 Data obtained from third parties We may obtain personal information concerning you from third parties, including from: their intermediaries; credit, fraud, identity and other searches we may undertake, including searches with public records and regulatory and private organizations; from any business or organization you are associated with; from telephone numbers identified by the telephone system when you telephone us. â 5.5 Data generated by us We and any suppliers or sub-contractors working for us may generate personal information relating to you, including in connection with responding to and dealing with any enquiry, booking or complaint; or in performing any booking or other contract with you; or through the analysis of your personal information or information gained from your use of our website. We may record telephone calls with you. â 6. What Do We Use Your Personal Information For? â We commit to use your personal information only for the purposes listed below and for as long as it is necessary to achieve these purposes. â 6.1 Operate our website To operate and provide the search, booking, accounts, review, forums and other services, facilities and functions of our websites. This includes customizing your online experience by providing you with more relevant online offers and updates, managing any accounts or registrations you have with our websites and making changes to your settings and profile at your request. â 6.2 Provide information and respond to enquiries To provide information to you about our website, systems and services, including to respond to booking enquiries and searches for holidays and travel, and to keep you updated generally. â 6.4 Payments To collect and make payments due and administer our accounts. â 6.5 Communication with customers To communicate with you concerning any enquiries, bookings, travel services provided, problems and complaints, and to respond to any submissions, enquiries or requests from you. â 6.6 Record keeping To keep internal records and maintain reasonable archives, including concerning as to enquiries, and complaints. â 6.7 Manage and improve our business To analyze, audit, provide, operate, administer, maintain and improve our business, website, systems, and services; to carry out surveys and analyze the results; to run promotions and competitions;To undertake product or customer research/ development; to assist us in and help us to improve our sales, editorial, advertising and marketing processes, including by sharing of photographs which you have voluntarily participated in during our Trips. Such photos may be shared across our social media channels such as Facebook, Instagram, Twitter or LinkedIn. These images will not be shared for any use other than to promote our Travel experiences. Please remove yourself from group photos organized by Trip Directors if you do not wish to be photographed;To carry out other business development and improvement activities; and to provide training to our staff, sub-contractors and suppliers. For example, we may use your personal information to help us profile how our customers generally are using our websites and booking travel services with (or through) us. We may also use this information to ascertain interests so that we can better tailor our business offerings. â 6.8 Direct marketing To carry out direct marketing to you, in particular to identify you as a customer and to identify your product and service preferences and to provide personalized content and ads informing you of new or additional products, services, and/or promotions that may be of interest to you. Â We may engage in direct marketing via the following means depending on the details you have provided to us: text messages, phone calls, targeting you on social media platforms on your personal computer and mobile device, direct mail, post, web advertising, in third-party apps, in our apps. See section 7 for the types of products we may market to you this way. â 6.9 Advertising To report aggregate information concerning usage of our websites to our advertisers. We normally create anonymous statistical data about browsing actions and patterns, and do not identify any individual. â 6.10 Advertising For any purpose which we have obtained your consent to. â 7. Use Of Your Personal Information For Direct Marketing We do not use or disclose your personal information for direct marketing purposes unless we have obtained your express consent to this, such as through an opt-in or opt-out tick box on any form or website of ours. â 7.1 Direct marketing by us Where you have consented to this, we may use your personal information to carry out direct marketing and send you marketing messages, materials, adverts and promotions relating to travel services we provide or which can be booked with third parties through us. Where you have consented to this, we may also use your personal information to carry out direct marketing and send you marketing messages, materials, adverts and promotions relating to travel services which are offered by or which can be booked through any other company in the same group of companies as us (i.e. within the Travel Corporation group) or third parties selected by us. You will be free to withdraw your consent to this at any time, by contacting us as detailed in this privacy policy or as detailed in any direct marketing that you receive or by clicking the âunsubscribeâ button at the bottom of any of our emails. In any e-mail you send we would ask you to insert âunsubscribeâ as the subject heading. â 7.2 Direct marketing by third parties Where you have consented to this, we may disclose your personal information which is contact information (such as name, e-mail, postal address, telephone, mobile or fax number) to any other company in the same group of companies as us (e.g. within the Travel Corporation group), or to third parties selected by us. They will use this to carry out direct marketing in their own right and will use it to send you marketing materials, adverts and promotions relating to products and services they offer or which can be booked through them. You will be free to withdraw your consent to our disclosure of your personal information for this purpose at any time, by contacting us as detailed above. If you withdraw your consent, this will not affect any disclosures we have already made (i.e. we will not be able to remove your personal information from anyone we have disclosed it to), but we will tell you who they are on request, and you should contact them directly concerning this. â 8.Disclosure Of Your Personal Information We may disclose your personal information to a third party for a business purpose. When we disclose personal information for a business purpose, we enter a contract that describes the purpose and requires the recipient to both keep that personal information confidential and not use it for any purpose except performing the contract. In the preceding twelve (12) months, we have disclosed the following categories of personal information for a business purpose: Identifiers. Personal information categories listed in the California Customer Records statute (Cal. Civ. Code Â§ 1798.80(e)). Protected classification characteristics under California or federal law. Commercial information. Internet or other similar network activity. Professional or employment-related information. We disclose your personal information for a business purpose to the following categories of third parties: Service providers. Third parties to whom you or your agents authorize us to disclose your personal information in connection with products or services we provide to you. In the preceding twelve (12) months, we have sold personal information for direct marketing purposes, where you have given your prior consent. We transfer your personal information to third parties in the following circumstances: â 8.2 Bookings and performance of contracts We disclose your personal information to third parties (including intermediaries) as necessary to deal with any booking enquiry being made by or for you, to make any booking requested by or for you, to perform and administer any booking for you or other contract with or in respect of you. This may include; to apply for visas on your behalf, to collect payments to be made by you, to investigate and respond to complaints, and to enforce any booking or other contract with you. Such third parties may include any suppliers or sub-contractors and their agents (e.g. airlines, coach, ferry or train companies, hoteliers, hire companies, cruise companies, tour operators etc.). â 8.3 Suppliers of travel and other services We may disclose your personal information to any third party (e.g. supplier, contractor sub-contractor) we make any enquiries with concerning or engage or sub-contract to perform any booking or other contract, including to provide any travel, tour or other products or services we have agreed to provide to you. We may disclose your personal information to any supplier with whom we make any enquiry concerning. â 8.5 Business Function Outsourcing Where we use third parties to host, provide, operate or supply any part of our websites, databases, systems, business, or services, or carry out on our behalf any of our business functions or actions (including sending mail, processing payments, providing marketing assistance, providing customer and advertising analysis through third-party ad-tech vendors, and providing customer services), then then we may provide your personal information to them as required for use for or processing as part of those purposes. â 8.6 Public forums etc. Where any facility on our website is clearly designed to make certain of your personal information public (e.g. posts you make to any public forum or reviews facility), then any personal information you provide in relation to that forum or other facility, which is provided in circumstance where it is clear that it is intended to be published, will be disclosed to the public accordingly, subject to moderation by us. â 8.7 Legal Requirements We may supply personal information to a government authority or regulator where required to comply with a legal requirement, for the administration of justice, for the purposes of customs, visas and immigration, or where reasonably required to protect your vital interests or enforce any booking or other contract. We may disclose your personal information where otherwise required by or permitted by law. â 8.8 Direct Marketing by third parties We may disclose your personal information to third parties to carry out direct marketing to you, where you have given your prior consent, to third parties to carry out direct marketing. See the direct marketing section above. â 8.9 Customer Representatives If our customer is a business or organization, and we are holding your personal information in your capacity as an associate of that business or organization (including as agent, representative, contact, employee, officer, owner, partner, or director), then we may disclose to them that personal information. If our customer is making a booking or booking enquiry on your behalf, with your authority, then we may disclose to our customer your personal information as reasonably required in connection with such booking or enquiry, or the subsequent performance of or payment for any booking made. â 8.10 Business acquirers If our business is ever transferred to a third party, then your personal information will be transferred to the acquirer to enable them to continue our business. â 9.Your Rights And Choices â The CCPA provides California residents with specific rights regarding their personal information. This section describes your CCPA rights and explains how to exercise those rights. â 9.1 Access to Specific Information and Data Portability Rights You have the right to request that we disclose certain information to you about our collection and use of your personal information over the past 12 months. Once we receive and confirm your verifiable request, we will disclose to you: The categories of personal information we collected about you. The categories of sources for the personal information we collected about you. Our business or commercial purpose for collecting or selling that personal information. The categories of third parties with whom we share that personal information. The specific pieces of personal information we collected about you (also called a data portability request). If we sold or disclosed your personal information for a business purpose, two separate lists disclosing: sales, identifying the personal information categories that each category of recipient purchased; and disclosures for a business purpose, identifying the personal information categories that each category of recipient obtained. â 9.2 Correction Of Inaccuracies You have the right to ask us to rectify, block, erase or destroy any inaccurate personal information we hold about you. â 9.3 Deletion Request Rights You have the right to request that we delete any of your personal information that we collected from you and retained, subject to certain exceptions. Once we receive and confirm your verifiable request, we will delete (and direct our service providers to delete) your personal information from our records, unless an exception applies. We may deny your deletion request if retaining the information is necessary for us or our service providers to: Complete the transaction for which we collected the personal information, provide a good or service that you requested, take actions reasonably anticipated within the context of our ongoing business relationship with you, or otherwise perform our contract with you. Detect security incidents, protect against malicious, deceptive, fraudulent, or illegal activity, or prosecute those responsible for such activities. Debug products to identify and repair errors that impair existing intended functionality. Exercise free speech, ensure the right of another customer to exercise their free speech rights, or exercise another right provided for by law. Comply with the California Electronic Communications Privacy Act (Cal. Penal Code Â§ 1546â¯seq.). Engage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when the informationâs deletion may likely render impossible or seriously impair the researchâs achievement, if you previously provided informed consent. Engage in public or peer-reviewed scientific, historical, or statistical research in the public interest that adheres to all other applicable ethics and privacy laws, when the informationâs deletion may likely render impossible or seriously impair the researchâs achievement, if you previously provided informed consent. Enable solely internal uses that are reasonably aligned with customer expectations based on your relationship with us. Comply with a legal obligation. Make other internal and lawful uses of that information that are compatible with the context in which you provided it. â 9.4 Exercising Your Rights To exercise the access, data portability, and deletion rights described above, please submit a verifiable request to us by either: â Email to info@myoldtownusa.com Telephone at 407-396-4888 Mail to 5770 W. Irlo Bronson Memorial Hwy, Ste. 323, Kissimmee, FL 34746 Only you or a person registered with the Florida Secretary of State that you authorize to act on your behalf, may make a verifiable consumer request related to your personal information. You may also make a verifiable consumer request on behalf of your minor child. You may only make a verifiable consumer request for access or data portability twice within a 12-month period. The verifiable consumer request must: Provide sufficient information that allows us to reasonably verify you are the person about whom we collected personal information or an authorized representative. Describe your request with sufficient detail that allows us to properly understand, evaluate, and respond to it. We cannot respond to your request or provide you with personal information if we cannot verify your identity or authority to make the request and confirm the personal information relates to you. Making a verifiable consumer request does not require you to create an account with us. We will only use personal information provided in a verifiable consumer request to verify the requestorâs identity or authority to make the request. â 9.5 Response Timing and Format We endeavor to respond to a verifiable consumer request within 45 days of its receipt. If we require more time (up to 90 days), we will inform you of the reason and extension period in writing. We will deliver our written response by mail or electronically, at your option. Any disclosures we provide will only cover the 12-month period preceding the verifiable consumer requestâs receipt. The response we provide will also explain the reasons we cannot comply with a request, if applicable. For data portability requests, we will select a format to provide your personal information that is readily useable and should allow you to transmit the information from one entity to another entity without hindrance. We do not charge a fee to process or respond to your verifiable request unless it is excessive, repetitive, or manifestly unfounded. If we determine that the request warrants a fee, we will tell you why we made that decision and provide you with a cost estimate before completing your request. â 9.6 Personal Information Sales Opt-Out and Opt-In Rights If you are 16 years of age or older, you have the right to direct us to not sell your personal information at any time (the â right to opt-outâ). We do not sell the personal information of consumers we actually know are less than 16 years of age, unless we receive affirmative authorization (the âright to opt-inâ) from either the consumer who is between 13 and 16 years of age, or the parent or guardian of a consumer less than 13 years of age. Consumers who opt-in to personal information sales may opt-out of future sales at any time. You can manage your communication preferences at any time from your account. You (or your authorized representative) may also exercise the right to opt-out by submitting a request to us by visiting the following page: Do Not Sell My Information and filling in the dedicated form, or sending us an email to info@myoldtownusa.com. Once you make an opt-out request, we will wait at least twelve (12) months before asking you to reauthorize personal information sales. However, you may change your mind and opt back in to personal information sales at any time by managing your communication preferences in your account on our website. We will only use personal information provided in an opt-out request to review and comply with the request. â 9.7 Non-Discrimination We will not discriminate against you for exercising any of your CCPA rights. Unless permitted by the CCPA, we will not: Deny you goods or services. Charge you different prices or rates for goods or services, including through granting discounts or other benefits, or imposing penalties. Provide you a different level or quality of goods or services. Suggest that you may receive a different price or rate for goods or services or a different level or quality of goods or services. â 9.8 Compensation You have the right to claim compensation for damage and (in certain cases) distress you suffer if we do not comply with the laws referred to above. â 9.9 Complaints to Applicable Authority The laws we comply with are regulated by the US Department of Consumer Affairs. In addition to your rights above, it is open to you, if you have a complaint or concern, to seek assistance from such government regulator, who has powers to compel us to comply with applicable laws and fine us for non-compliance. However, before you do so, we would hope that you will contact us first to discuss any complaint or concerns you have. â 10. How Third Parties Will Handle Your Personal Information â Where we provide your personal information to a third party one of the following two circumstances will apply. â 10.1 Processing on our behalf In some cases, your personal information may be held and otherwise collected and used by them on our behalf, in which case we will remain responsible for what they do with your personal information, and your personal information will only be held and collected and used by them in accordance with our instructions and this privacy policy. â 10.2 Processing on their own account In other cases, your personal information may need to be provided to them to be held and processed by them in their own right and on their own account. In such case, they will have their own responsibility for that personal information, subject to their own privacy policy, and we will not be responsible for what they do with it following disclosure. â 11. Location Of Your Personal Information â 11.1 Transfer of personal information overseas We (and any affiliate, subcontractor or other person processing your personal information on our behalf) may transfer, store and otherwise process your personal information anywhere in the world to fulfill the purposes set out in this policy, for example to: (1) our overseas offices; (2) information processors (including operators of global travel distribution systems); (3) airlines, hotels and other travel service products; and information technology and business service providers. In many cases the transfer is necessary to initiate or complete a booking or other transaction on your behalf in response to a request by you or for the purpose of entering a contract with a third party on your behalf. Where we disclose your personal information to third parties, that disclosure may also involve a transfer of your personal information anywhere in the world, and those third parties may themselves transfer, store or otherwise process that information anywhere in the world. In each case, we will comply with any legal requirements concerning the transfer of your personal information by us to any third party outside the country where we are established, and where your personal information is still controlled by us or is being stored or otherwise processed on our behalf, our security measures (as detailed below) will also apply. â 11.2 Counties to which your personal information is transferred The countries which we transfer your personal information depends on your booking. Generally such countries include those in Asia Pacific, Africa, North and South America and Europe. â 12. Keeping Your Data Secure 12.1 Our security measures â 12.1.1 Our general commitment We are committed to doing what we reasonably can to keep your personal information secure, and we are obliged by law to put in place appropriate technical and organizational measures against unauthorized or unlawful processing of your personal information and against accidental loss or destruction of, or damage to, your personal information. We have accordingly implemented security policies, rules and technical measures with a view to achieving this. â 12.1.2 Transmissions between your web browser and our servers We use Secured Socket Layer (âSSLâ) software in order to encrypt the personal information that you provide to us whilst it is in transit over the internet. This will work if your browser is SSL enabled (which most are). You can verify that this is working by looking for the symbol of a closed lock or solid key on the bottom bar of your browser window, and checking that the prefix for the web address in the browser address bar has changed from âhttpâ to âhttpsâ. â 12.1.3 Storage of your personal information The personal information we collect from you online is stored by us and/or our service providers on databases protected through a combination of physical and electronic access controls, firewall technology and other reasonable security measures. â 12.2 Your security measures For your own privacy protection, we encourage you to maintain anti-virus and other malware protection software on your computers and other devices, and to maintain your own measures to protect your personal information. Please do not include sensitive personal information in any e-mails you may send to us, including payment card information. We also encourage you to be careful about who you give personal information to. We never contact you to ask you for sensitive personal information, such as payment card information, or sensitive personal information such as passport numbers or log-in details, and we will only ask you for such information in person or through our website, or by telephone in connection with a booking you are making or have made. Please let us know if you someone purports to contact you in our name. â 13. How Long Do We Keep Your Personal Information For? â We keep your personal information for so long as is reasonably necessary for the purposes for which we use it, and if longer, for any duration required by law, and for statutory claims limitation periods where your personal information may be relevant to any possible liability we may have to you. â 14.âDo Not Trackâ â We are required to let you know how we respond to web browser Do Not Track (DNT) signals. We do not respond to such signals at this time. â 15. Changes to This Privacy Policy â We reserve the right to amend this privacy policy at our discretion and at any time without notice to you, including by publishing a new version on our website. When we make changes to this privacy policy, we will notify you by email or through a notice on our website homepage to make sure that you are aware of any changes. You can check the top of the document to see the latest version in force. Any change will be prospective only, and we will not make any changes that have retroactive effect unless legally required to do so. â 16. Contacting Us â If you have any questions about our privacy policy or about how we process your personal information, including any requests, queries of complaints, please contact us either by: E-mail to info@myoldtownusa.com Telephone to 407-396-4888 Mail to 5770 W. Irlo Bronson Memorial Hwy, Ste 323, Kissimmee, FL 34746 â 17. Copyright Notice â This document, and all content of our websites is CopyrightÂ© 2021 Old Town Kissimmee, LTD.. ALL RIGHTS RESERVED. â 18. Applicable Law and Disputes â Our privacy policy is subject to the law of the state of Florida, County of Osceola and disputes can be determined by the courts of state of Florida, County of Osceola. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.myoldtownusa.com/car-shows-events",
      "text": "Car Shows & Events | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Car Shows & Events upcoming Signature events Excitement is always on the schedule at Old Town! From weekly car shows to live music that fills the air with timeless hits, every visit is a celebration. Whether youâre soaking in the nostalgia or joining us for one of our signature events, thereâs always something unforgettable happening. Car shows Every week at Old Town, we celebrate the automobile's rich history with special events that bring together car lovers of all stripes, making it a prime destination for Florida car shows. For nearly 35 years, Old Town has been a dreamy escape for car lovers from diverse cultures around the globe. Wednesday Night Bike Show Starting September 10th, mid-week brings its charm with this bike show that brings in everything from modern touring motorcycles to timeless classics. Each Wednesday from 6-10 P.M., the bike show transforms Old Town Entertainment District, featuring all makes and models of touring motorcycles, Harley, Indian, trikes and slingshots! Under the glow of string lights lining our quaint brick streets, guests are treated to Central Florida's most biker-friendly free event with live music, restaurants, shopping, attractions, and bars! Friday Night Muscle Car Show & Cruise Feel the pulse of excitement every Friday night at our Muscle Car Show! Starting at 3:00pm, guests can walk along Trophy Row to see a world of show-quality muscle cars from 1964 and newer âand older hot rods and classics dating up to 1985 (No Patina Allowed). Both car owners and spectators can enjoy the thrill of the show and cruise at no cost. Cars can register on-site prior to the cruise by entering Old Town from Highway 192 beneath the east side of the Jukebox signs. Our Event Staff will welcome you and guide you to a security escort that will lead you down the historic brick streets to your spot. Remember, driving on the bricks is by permission only. Start time: 3:00 PM Registration: 3:00 - 7:30 PM Cruise Kick-off: 8:30 PM â Cruisers, don't miss out on $2,000 in monthly giveaways â$1,000 on Fridays and another $1,000 on Saturdays. Each cruise you join at Old Town on Fridays or Saturdays enters you into a monthly draw. On the last Friday and Saturday of the month, one lucky Cruiser will win $1,000 per night, courtesy of Old Town! Saturday Night Classic Car Show & Cruise For nearly 35 years, our Classic Car Cruise has showcased vehicles manufactured prior to 1985, like hot rods, classics and antiques(No Patina Allowed)! Locals and visitors alike come from all over the world to watch our Classic Car Show & Cruise, which can have up to 250 cruisers! This event has been a staple, providing a weekly dose of nostalgia and excitement you wonât want to miss!Â Cruisers! Register your car on-site by arriving via Highway 192, where you'll spot the iconic Jukebox signs on the east entrance. Our friendly Event Staff will greet you and coordinate a security escort to guide you along the historic brick streets to your designated spot, in preparation for the cruise. Please remember, only registered cars are permitted to drive on the bricks. Start time: 1:00 PM Registration: 1:00 - 7:30 PM Cruise Kick-off: 8:30 PM Don't forget, cruising at Old Town can be extra rewarding with our $2,000 monthly giveaways â$1,000 given away each Friday and Saturday. Join us for any cruise on these nights and you'll automatically be entered into our monthly drawing. As the month wraps up, one fortunate Cruiser will be chosen each night on the final Friday and Saturday to win $1,000! events schedule Our event schedule is always full at Old Town, with daily events designed to entertain all ages! Here, every occasion becomes a celebration; whether you're experiencing the thrills of our weekly car shows, enjoying live music that fills the night air with familiar melodies spanning eras and genres, or attending one of our signature events, Old Town ensures that your visit is packed with memories. Our weekly events included: Tuesday - Karaoke Wednesday - Themed Car Show Thursday - Karaoke Friday - Muscle Car Show and Cruise Saturday - Classic Car Show and Cruise Last Sunday of each Month - Import Car Show In addition to our weekly events, families can look forward to our signature events: Halloween at Old Town - October 31st VetteFest - First Saturday in October New Yearâs Eve - December 31st 4th of July - July 4th Classic Car Show & Cruise Anniversary - Third Saturday in March Sign-Up for Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.linkedin.com/company/old-town-companies",
      "text": "Old Town Companies | LinkedIn Skip to main content LinkedIn Top Content People Learning Jobs Games Sign in Join now Old Town Companies Real Estate Carmel, Indiana 2,316 followers Pursuing community-focused development projects that enrich the lives and well-being of our neighbors See jobs Follow View all 23 employees Report this company About us Old Town Companies is a commercial and residential real estate development company that pursues and delivers projects that add value to communities. Website https://www.oldtowncompanies.com/ External link for Old Town Companies Industry Real Estate Company size 2-10 employees Headquarters Carmel, Indiana Type Privately Held Founded 2009 Specialties Land development, Land valuation, Community Relations, Master Planning, Social impact, and Creation of culture Locations Primary 31 1st St SW Carmel, Indiana 46032, US Get directions Employees at Old Town Companies Greg Koziol Director of Preconstruction & Development at Old Town Companies Jeremy Lollar Vice President of Development - Project Executive Stacey Willis Real Estate Agent & Director of Sales | Old Town Design Group Casey Contos Director of FP&A at Old Town Companies See all employees Updates Old Town Companies 2,316 followers 11mo Report this post Old Town is hiring a Preconstruction Manager/Estimator! If you have experience or interest in quantity surveys, estimating, guiding design, and subcontractor bid solicitation, we want to hear from you. Join our team and play a key role in shaping our projects from the ground up! https://lnkd.in/g6DzbNNb Reach out and apply today! hr@oldtowndesigngroup.com #DevelopmentJobs #HiringNow #Preconstruction #Estimator #ConstructionCareers 32 1 Comment Like Comment Share Old Town Companies 2,316 followers 1w Report this post As summer winds down, we’re saying farewell to our amazing 2025 interns and celebrating all they’ve accomplished.\n\nHere’s a look back at our summer when Old Town Construction’s Steve Jansen took the group out into the field for a behind-the-scenes look at several neighborhoods and active construction sites, sharing insight into every phase of the build process. The day wrapped up with lunch and a tour of Union Square in Downtown Westfield, one of our favorite recent projects.\n\nWe’re grateful for this team’s energy, curiosity, and hard work over the summer. You’ve made a lasting mark, and we can’t wait to see where your paths lead next. Have a great school year! #OldTownConstruction #SummerInternship #TheUnion #ConstructionLeadership #BuildingTheFuture #FieldExperience #WestfieldIN #ThankYouInterns 20 Like Comment Share Old Town Companies 2,316 followers 2w Report this post Working with organizations like ILADD are part of Old Town’s overarching goal of making communities flourish. https://lnkd.in/g7eKd3ip There’s no place like home: ILADD, Old Town Companies celebrate construction of Crossbridge Point https://www.youarecurrent.com 9 Like Comment Share Old Town Companies 2,316 followers 4w Report this post ☕ Now Open: The Spark Coffee at The Union in Downtown Westfield ☕\n\nWe’re excited to welcome The Spark Coffee as the first coffee shop in Old Town’s newest development, The Union. Owner Jeff Shields shared how Spark’s mission centered on placemaking, community, and connection, aligns perfectly with Old Town’s vision for vibrant neighborhoods.\n\nAt The Spark, you’ll find:\n• Freshly roasted coffee, espresso (beans roasted by Bee Coffee Roasters and available for purchase)\n• Bagel breakfast sandwiches\n• Croissants, pastries, and sourdough avocado toast, breads sourced from other excellent local businesses\n\nLocated right across from Grand Junction Plaza, Spark will be a hub for gathering before concerts, farmers markets, and community events. Their tagline says it best: Coffee & Community.\n\nBeyond great coffee, The Spark supports local nonprofits and schools, making every cup part of something bigger.\nWelcome to the neighborhood, Spark Coffee!\n\nVisit: Lifeattheunion.com #CoffeeAndCommunity #TheUnionWestfield #OldTownCompanies #Placemaking #WestfieldIndiana #LocalBusiness #CommunityBuilding #SupportLocal …more 18 Like Comment Share Old Town Companies reposted this City of Westfield, Indiana 4,307 followers 1mo Edited Report this post 🎉 Welcome to Westfield The Spark Coffee!  We are so excited to have you in our downtown area in the new Union Building at Grand Junction Plaza! Be sure to check out this new coffee spot with your friends and family! ☕️ 115 7 Comments Like Comment Share Old Town Companies 2,316 followers 1mo Report this post Old Town was proud to host the WOW (Women of Westfield) for a VIP tour of two exciting projects, the apartments at The Union and the Midland South Townhomes in downtown Westfield. Special thanks to Jill Doyle for the opportunity and invitation!\n\nWe’re also grateful to our incredible partners and team members who helped make the event a success: Willow Bridge Property Company and Kaelie McMichel, and Old Town’s own Stacey Willis , Kimberly Hansen , Nataly Wood , and Rebecca McGuckin for leading an inspiring and informative tour. #OldTownConstruction #WomenOfWestfield #WestfieldIndiana #CommunityBuilding #TheUnionWestfield #MidlandSouthTownhomes #BuildingCommunity 57 2 Comments Like Comment Share Old Town Companies 2,316 followers 1mo Report this post Sun King is coming to The Union in Westfield!\n\nThe Union in Westfield is now complete, and site work has officially begun for the adjacent Sun King building. Owners Dave and Clay, the creative force behind Sun King Brewing, recently toured the site to check on construction progress.\nPart of the larger Union Square development, the new taproom will feature indoor seating for over 400 guests and patio space for 200, all overlooking the scenic Grand Junction Plaza. Visitors can look forward to Sun King’s award-winning craft beers, seasonal and experimental brews, handcrafted cocktails, and non-alcoholic options, all paired with local dining experiences Summer of 2026.\nA partnership between the City of Westfield and Old Town Companies, The Union has been in development since 2022 and is located just across from Grand Junction Plaza, bordered by Ind. 32, Union Street, Jersey Street, and Mill Street. #TheUnionWestfield #SunKingBrewery #OldTownCompanies #GrandJunctionPlaza #WestfieldIN #CraftBeer #CommunityDevelopment #DelvDesign Learn more:\n🌐 lifeattheunion.com 🍻 sunkingbrewing.com 133 3 Comments Like Comment Share Old Town Companies 2,316 followers 1mo Report this post Wild Air Multifamily Making Strong Summer Strides\nThe Wild Air Multifamily project has seen tremendous progress in recent months. At the heart of this new Zionsville community is Marysville Crossing — a vibrant, mixed-use hub featuring new multi-family homes, future retail, and local establishments. Located just off Marysville Road, this central corridor will lead residents and visitors through a lively streetscape toward Wild Air’s Community Clubhouse and main recreation areas.\nFraming, MEP rough-ins and foundation work are underway on respective buildings.\nWe’re ramping up for an exciting season as we prepare for the first round of building turnovers later this fall. #WildAirZionsville #OldTownConstruction #MultifamilyDevelopment #ZionsvilleRealEstate #MarysvilleCrossing #MixedUseDevelopment Read more about Wild Air here: https://lnkd.in/dB8VuSpd 107 1 Comment Like Comment Share Old Town Companies reposted this City of Westfield, Indiana 4,307 followers 2mo Report this post The City of Westfield and Old Town Companies have officially announced the retail and restaurant tenants opening at The Union, the first mixed-use development in downtown Westfield. Designed to complement the energy of Grand Junction Plaza, The Union will provide a mix of residential, retail, and recreational spaces. Anchored by 196 high-end apartments, residents will enjoy amenities such as reserved covered parking, state-of-the-art fitness facilities, and an elevated pool and courtyard gathering space with stunning views of the plaza below.\n\nTenants will include Pure Barre, Everbowl, Lake City Bank, BlackSheep Pizza and Cocktails, Stella’s Ice Cream, Woof Gang Bakery and Grooming, and The Spark Coffee. Sun King Brewing is also under construction in a detached building, which is expected to open in Summer 2026. \n\nTo read the full release, visit westfieldin.gov/release . 255 3 Comments Like Comment Share Old Town Companies 2,316 followers 2mo Report this post Old Town Companies had the honor of sponsoring Mayor Sue Finkam ’s VIP Reception at Carmel Fest to thank the dedicated sponsors and volunteers who make this event possible. It is a joy to support such a popular community event that brings together friends and families in celebration of our nation's independence.\n \nOur team had a fantastic time at the Fourth of July party for fellow sponsors, where we had the privilege of interacting with local business and community leaders. Old Town is proud to show our support for the city we call home.\n \nMany thanks to all who attended and will make this year's Carmel Fest a huge success! #CarmelFest #CommunitySupport #LocalBusiness #IndependenceDay #CarmelIndiana #Celebration #CommunityEvent 45 2 Comments Like Comment Share Join now to see what you are missing Find people you know at Old Town Companies Browse recommended jobs for you View all updates, news, and articles Join now Similar pages Old Town Design Group Construction Carmel, Indiana Old Town Construction Construction Carmel, Indiana The Garrett Companies Real Estate Greenwood, IN Thompson Thrift Real Estate Indianapolis, Indiana Milhaus Real Estate Indianapolis, IN Estridge Homes Real Estate Carmel, Indiana Sun King Brewing Company Food and Beverage Services Indianapolis, Indiana Pure Development Real Estate Indianapolis, IN Bennett Companies Real Estate Holmdel, New Jersey Buckingham Companies Real Estate Indianapolis, Indiana Show more similar pages Show fewer similar pages Browse jobs Leasing Administrator jobs 30,246 open jobs Account Executive jobs 71,457 open jobs Senior Manager jobs 181,836 open jobs Executive Director jobs 59,502 open jobs Controller jobs 74,523 open jobs Copywriter jobs 17,206 open jobs Executive jobs 690,514 open jobs Account Manager jobs 121,519 open jobs Customer Service Representative jobs 185,647 open jobs Employee Relations Specialist jobs 15,658 open jobs Coordinator jobs 545,033 open jobs Human Resources Generalist jobs 20,704 open jobs Analyst jobs 694,057 open jobs Recruiter jobs 243,016 open jobs Human Resources Specialist jobs 34,340 open jobs Manager jobs 1,880,925 open jobs Meeting Planner jobs 35,058 open jobs Mortgage Underwriter jobs 2,082 open jobs Procurement Specialist jobs 44,900 open jobs Event Specialist jobs 46,757 open jobs Show more jobs like this Show fewer jobs like this More searches More searches Benefits Representative jobs Business Development Specialist jobs Executive jobs Assistant jobs Financial Analyst jobs Accounts Payable Manager jobs Childcare Worker jobs Construction Superintendent jobs Talent Acquisition Manager jobs Quality Assurance Manager jobs Maintenance Manager jobs Operations Manager jobs Engineering Manager jobs Accountant jobs Human Resources Specialist jobs Developer jobs Director of Pricing jobs Manager jobs Executive Vice President jobs Marketing Specialist jobs Engineer jobs President jobs Wholesale Manager jobs Supply Manager jobs Operations Team Lead jobs Retail Director jobs Manufacturing Specialist jobs Resident Doctor jobs Computer Numerical Control Operator jobs Registered Dental Hygienist jobs Territory Manager jobs Logistics Manager jobs Field Engineer jobs Procurement Manager jobs Estimator jobs Paralegal jobs Accounting Manager jobs Industrial Engineer jobs Family Physician jobs Director of Nursing jobs Licensed Practical Nurse jobs Clinical Director jobs Registered Nurse jobs Account Manager jobs Specialist jobs Crew jobs Payroll Administrator jobs Procurement Specialist jobs Office Manager jobs Human Resources Associate jobs Analyst jobs Accounting Administrator jobs Controller jobs Logistics Planner jobs Technician jobs Staff Accountant jobs Director jobs Accounts Payable Specialist jobs Logistics Specialist jobs Plant Manager jobs LinkedIn © 2025 About Accessibility User Agreement Privacy Policy Cookie Policy Copyright Policy Brand Policy Guest Controls Community Guidelines العربية (Arabic) বাংলা (Bangla) Čeština (Czech) Dansk (Danish) Deutsch (German) Ελληνικά (Greek) English (English) Español (Spanish) فارسی (Persian) Suomi (Finnish) Français (French) हिंदी (Hindi) Magyar (Hungarian) Bahasa Indonesia (Indonesian) Italiano (Italian) עברית (Hebrew) 日本語 (Japanese) 한국어 (Korean) मराठी (Marathi) Bahasa Malaysia (Malay) Nederlands (Dutch) Norsk (Norwegian) ਪੰਜਾਬੀ (Punjabi) Polski (Polish) Português (Portuguese) Română (Romanian) Русский (Russian) Svenska (Swedish) తెలుగు (Telugu) ภาษาไทย (Thai) Tagalog (Tagalog) Türkçe (Turkish) Українська (Ukrainian) Tiếng Việt (Vietnamese) 简体中文 (Chinese (Simplified)) 正體中文 (Chinese (Traditional)) Language Agree & Join LinkedIn By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . Sign in to see who you already know at Old Town Companies Sign in Welcome back Email or phone Password Show Forgot password? Sign in or By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy . New to LinkedIn? Join now or New to LinkedIn? Join now By clicking Continue to join or sign in, you agree to LinkedIn’s User Agreement , Privacy Policy , and Cookie Policy ."
    },
    {
      "url": "https://www.myoldtownusa.com/partner-with-old-town",
      "text": "Partner with Old Town | Old Town USA VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Partner with Us Embrace the spirit of Old Town, Orlandoâs quintessential hub of where quirky meets cool, and partner with us to connect your brand with over three million annual visitors. At Old Town, we offer vibrant sponsorship opportunities tailored to boost your companyâs visibility and engagement. Enjoy year-round exposure and the chance to activate your brand in our bustling environment, ripe with potential for memorable corporate collaborations. Corporate Partnerships at Old Town Engage with our audience through Old Townâs diverse, year-round events. Our partnerships are designed to enhance your brand presence with targeted media campaigns, robust consumer interaction, and multiple sponsorship prospects. Benefit from both digital and physical brand placements and seize the opportunity to craft bespoke retail promotions that resonate with our visitors. become a partner Brand Activations at Old Town Maximize your brandâs impact with strategic placements in Old Townâs high-traffic, highly visible locations. Whether showcasing new products, launching a TV show, or setting up interactive marketing displays, we provide the perfect backdrop for your promotional needs. Our team is ready to support your marketing initiatives with tailored packages that leverage Old Townâs digital platforms and social media reach, ensuring your brand makes a significant impression. For detailed information on corporate partnerships, including event sponsorships and public programming opportunities, please contact us at marketing@myoldtownusa.com . Join us in creating experiences visitors will cherish right in the heart of one of Orlandoâs most beloved attractions. Filming Opportunities First Name* Last Name* Email Address* Company Name* Message* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Become a Partner First Name* Last Name* Email Address* Company Name* Message* Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.omi-int.com/contactUs.html",
      "text": "Contact Us - Oldmutual About us Contact us Literature Library ≡ WHY CHOOSE US? BENEFITS OF INVESTING OUR PRODUCTS INVESTMENT AND FUNDS UPCOMING EVENTS About us Contact us Literature Library IMS LOGIN IMS LOGIN Contact Us Share Print CONTACT US ∨ FRAUD REPORTING PERSONALISED REGIONAL SERVICE TEAM CONTACT US If you are unable to find the information you are looking for on this website or would like to speak to one of our regional staff you can contact us using the details below. If you are unsure who you need to speak to please fill in our contact form and one of our staff will contact you at your convenience. OLD MUTUAL INTERNATIONAL (OMI) REGIONAL SERVICE TEAMS: Our OMI Regional Service Teams are contactable as follows: Western Cape (Cape Town) - ominternationalcpt@omwealth.co.za Gauteng (Johannesburg) & Free State - ominternationaljhb@omwealth.co.za Pretoria, Polokwane & Mpumalanga - ominternationalpta@omwealth.co.za KwaZulu-Natal (Durban) - ominternationalkzn@omwealth.co.za Eastern Cape (Port Elizabeth) - ominternationalpe@omwealth.co.za Commission queries - advisor.services@omwealth.co.za OMI General Service - ominternationalservice@omwealth.co.za For further information - our OMI Offshore Specialists & OMI Service Team Specialists direct contact details are available on: https://www.omi-int.com/contactUsServiceTeam.html Contact Locations OMI's extensive network allows investors access to our products and services. From a network of office and operations, the Old Mutual International Sales Division provide financial advisers with information and support on Old Mutual International's full range of products and services. These financial advisers access\n          OMI's products to meet the needs of their individual clients. The list below provides you with the direct contact details of OMI's international network of offices: Old Mutual International Cape Town Contact Centre PO Box 31 Mutual Park, Pinelands 7451 Cape Town South Africa Tel: +27 (0)21 509 2187 Fax: +27 (0)86 6466 885 Email: ominternationalservice@omwealth.co.za Guernsey Albert House, South Esplanade, St Peter Port, Guernsey, Channel Islands, GY1 1AW Tel: +27 (0)21 509 2187 Fax: +27 (0)86 6466 885 Email: ominternationalservice@omwealth.co.za Old Mutual Isle of Man branch of OMLACSA 5A Village Walk, Onchan, Isle of Man, IM3 4EB British Isles Tel: +27 (0)21 509 2187 Email: ominternationalservice@omwealth.co.za For any Old Mutual Hong Kong queries/unclaimed benefits - please contact: Tel: +27 (0)21 509 2187 Email: ominternationalservice@omwealth.co.za Contact Us Form PLEASE TAKE NOTE: This Contact Us Form is for Old Mutual International South Africa queries, advisers and clients ONLY. Any queries relating to Old Mutual Limited or Old Mutual Insure or Old Mutual Life Assurance Company (South Africa) Pty Ltd will NOT be actioned here and must be raised via www.oldmutual.com or www.oldmutual.co.za or complaintadmin@oldmutual.co.za Title *First name *Surname Phone number *Email address Nature of feedback Please select... Your experience of dealing with us Our website Our secure online services Other feedback Message How would you like us to respond to your feedback Please select... By email By phone By letter No response needed * This field is required As part of our commitment to quality service, your telephone calls may be recorded. SEND YOUR MESSAGE Thank you for taking the time to contact us. Your request was successfully submitted. You can expect a response in due course. We are experiencing difficulties in processing your request. Please reload the page and try again in a few minutes. ↑ Back to top Accessibility Legal and Regulatory Privacy Notice and Cookie Policy Terms of Use Complaints Procedure Data Protection Rights PRIVACY POLICY UPDATE Please note that our Privacy Policy has been updated. Please see the updated policy here If you \"Accept All\", you agree to the use of cookies for an improved browsing experience, enhancing site navigation and analysing site usage. Learn more here Accept All"
    },
    {
      "url": "https://www.oldtown-inn.com/contact-us",
      "text": "Contact The Friendly Staff At Old Town Inn Scroll To\r\n        Top customercare@oldtown-inn.com 619-260-8024 MENU Reservations Reservations Book Now Home Overview Rooms Gallery Specials Destination Attractions Things To\r\n                                                    Do Contact Us Reservations Reservations Home Overview Rooms Reviews Gallery Specials Destination Attractions Things To Do Directions Contact Us Accessibility Reservations Sitemap Cookie Policy Privacy Policy Terms &\r\n                            Conditions Personal Data Request Our Helpful Staff Is Here To Assist You × Book Direct & Save Book Direct & Save Book Now Check In Sep 10 Enter Arrival Check Out Sep 11 Enter Departure Adult 1 Adult 2 Adults 3 Adults 4 Adults 5 Adults Children 0 Children 1 Children 2 Children 3 Children 4 Children Infants 0 infant 1 infant 2 infants 3 infants 4 infants 5 infants Book Now Contact the friendly staff at Old Town Inn Please enter the message below that you would like to\r\n                                            send to our hotel. A guest service agent will reply to your message in a timely manner. First Name * First Name Last Name: * Last Name Phone Number * Phone Number Email Address * Email Address Subject * 150 characters left Subject Message * 2000 characters\r\n                                                                left Message Captcha Captcha Submit Connect With Us Follow\r\n                                                        Old Town Inn Follow\r\n                                                        Old Town Inn Follow\r\n                                                        Old Town Inn Follow Old Town Inn Follow\r\n                                                        Old Town Inn Address Old Town Inn -\r\n                                            4444 Pacific Hwy, San Diego, California 92110 Phone Tel: (619) 260-8024 Reservations: (800) 643-3025 Fax: (619) 296-0524 Email Property Email: customercare@oldtown-inn.com This website uses cookies to deliver our services and to show you relevant inventory, property details, and rates for \n            Old Town Inn. By using our website, you acknowledge that you have read and understand our Cookie Policy , Privacy Policy , \n            and our Terms of Service . \n            Your use of Old Town Inn's services, including the booking of online reservations, is subject to these policies and terms. Accept to Close Home Overview Rooms Reviews Gallery Packages Destination Attractions Things To Do Directions Contact\n                Us Reservations Sitemap Accessibility Cookie Policy Privacy Policy Terms & Conditions About Us Reviews Directions Contact Us Personal Data Request Sitemap Cookie Policy Privacy Policy Terms & Conditions Connect With Us Follow\r\n                                                            Old Town Inn Follow\r\n                                                            Old Town Inn Follow\r\n                                                            Old Town Inn Follow\r\n                                                            Old Town Inn Follow\r\n                                                            Old Town Inn San Diego,\r\n                                    CA\r\n                                    Hotels Attractions in San Diego, CA San Diego, CA Reservations San Diego, CA Hotel Rooms Website Design, Development, and Digital Marketing Powered by INNsight. Copyright ©\r\n                                    2025 INNsight.com, Inc."
    },
    {
      "url": "https://www.myoldtownusa.com/history-of-old-town",
      "text": "History of Old Town | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets History of Old Town An entertainment district filled with a unique collection of shops, restaurants, bars, rides, free weekly events, and car shows. An unforgettable family experience featuring a unique collection of shops , dining options, rides , and family-friendly attractions. Old Town is a re-creation of a classic Florida town featuring historical architecture and distinctive storefronts. We step back in time when times were a little simpler, the pace more realistic, and the memories are just as magical.Â Old Town opened in December 1986, and is located on US 192 in Kissimmee, just minutes from Walt Disney World Resort, Universal Resort Orlando, Sea World, and International Drive. Old Town is a unique 18-acre entertainment district featuring over 70 unique and affordable shops, restaurants, bars, rides, and family-friendly attractions owned by local mom-and-pop businesses. In 2019, Old Town underwent a significant renovation that introduced new attractions, including an 86-foot Ferris wheel, enhancing the nostalgic experience for visitors.Â Relax as you stroll down our beautiful, tree-lined brick streets and discover why Old Town has become a beloved family tradition for over 30 years. Old Town is the perfect destination for an afternoon or night of fun with friends and family. Mine for gold at Black Market Minerals, stroll through one-of-kind stores, test your fears at Mortem Manor, try a classic game of Skee-Ball at Happy Days Family Amusement Center, or relax with your favorite cocktail while enjoying free live entertainment on Trophy Row Stage. Old Town is more than your average shopping experience.Â  We host weekly events, including Americaâs longest-running weekly car show and cruise every Saturday.Â  Step back in time and experience a car show like no other with hundreds of classic cars followed by our Saturday Nite Classic Car Cruise starting at 8:30 pm. We invite you to enjoy the simple pleasures of classic American fun. explore old town events Cars, entertainment and events - Oh my! EXPLORE dining Savor the charm and enjoy the delightful food at Old Town EXPLORE shops Discover unique finds from every decade, only at Old Town! EXPLORE CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.myoldtownusa.com/store-directory/ot-vapors",
      "text": "OT Vapors | Old Town USA VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs PARTNERS parking accessibility map tickets contact us car shows & events things to do Shops drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Shops / OT Vapors OT Vapors Favourite WebSIte View Map Menu OT Vapor is a Florida-based retail electronic cigarette business committed to providing the best possible shopping experience. We offer a wide range of vape products and accessories, including premium e-juice lines to meet your needs, all at unbeatable prices.Visit our website to learn more. â Hours Monday : 3:00pm â 11:00pm Tuesday: 3:00pm â 11:00pm Wednesday: 3:00pm â 11:00pm Thursday: 3:00pm â 11:00pm Friday: 3:00pm â 11:00pm Saturday: 10:00am â 11:00pm Sunday: 10:00am â 11:00pm Location Phone (407) 837-4013 buy tickets Favourite CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.oldtownschool.org/aboutus/",
      "text": "About Us | Old Town School of Folk Music Login Login Calendar Search Membership Classes Concerts Music Store Community About Classes Concerts Music Store Community About Calendar Search Membership About the Old Town School The Old Town School of Folk Music brings people together to learn, create, perform, and enjoy music and dance. Through this mission we seek to build welcoming, thriving communities where all people are connected by the joy and expression of music and dance. Previous Next Founded in 1957, the Old Town School of Folk Music provides a wide range of music, dance, theater, and visual arts courses to people of all ages, abilities, and backgrounds. Whatever one's interest, the Old Town School provides broad access to more than 700 accredited class offerings, private lessons, and workshops that span an array of artistic genres. Support Your Old Town School We believe in quality arts education for everyone. As a 501(c)(3) not-for-profit organization, your class registration, Music Store purchases, ticket fees, membership and donations help Old Town School support this mission and provide financial aid and arts programming for thousands of Chicagoans every session. Gifts to the School are tax-deductible to the extent allowable by law. Donate Now Membership Annual Reports Outreach Programs & Sponsors More Ways To Help There are many ways to give to the Old Town School. Whether you’re supporting our education programs with donations or donating your time to us your help is invaluable. These links will direct you to ways your corporation or organization can continue to support our programming and mission around Chicago. Employer Matching Planned Giving: The Unbroken Circle Sponsorship & Advertising History & Mission Read all about our fascinating history since our opening in 1957 Directions & Campuses You have to get here to be here! Easy access to our campuses via public transportation in both Lincoln Square and Lincoln Park. Contact Us Not finding what you’re looking for? Contact us. Host Your Event Here Private events & space rentals at Old Town School! Whether you're planning an intimate gathering or a grand celebration, our versatile venues in Lincoln Square and Lincoln Park can accommodate groups from 5 to 500 guests. DEI Statement Diversity, equity, and inclusion are core values of Old Town School and guide our efforts to create welcoming, inclusive communities for creative expression. Read our DEI statement here. Bar & Café Stop by the Old Town School Bar & Café in Lincoln Square NEWS & PRESS ROOM Current events, press releases, and important information happening on campus and across the Old Town School universe! Employment Current openings for staff and faculty positions Financial Aid Available We provide financial aid to both children and adults for private lessons and group classes based on financial need. Resource Center Housed in the basement of our Lincoln Avenue campus, the Resource Center holds a collection of over 25,000 commercial and archival recordings, videos, books, photos, documents and periodicals. Hire Our Artists Our artist engagement service offers a wide array of entertainment for any occasion by talented, professional artists. With everything from soloists to 11-piece bands, we can help take your event to the next level and you'll be supporting the school at the same time! Meet Our Teaching Artists Over 250 of the most talented artists in Chicago ready to inspire you in classes and lessons! Our Administrative Staff A listing of administrative departments and contact info at Old Town School Board Of Directors A listing of our current Board Of Directors Classes & Programs Adult Classes Kids Classes Teen Classes Workshops Private Lessons Our Faculty Online Class Info Choose The Right Class Registration Browse Catalog Financial Aid Class Policies Important Dates Gift Certificates Concerts Upcoming Events World Music Wednesday Global Dance Party Kids Concerts Field Trips Music Around Town Our Venues & Policies Square Roots Festival Music Store Hours & Location Instrument Rental Repairs Support Make a Gift Membership Planned Giving Volunteer Sponsorship Annual Report Board Of Directors About Us Locations & Directions Café Hire Our Artists Host Your Event Here History & Mission News & Press Room Resource Center Staff Employment Privacy Contact Calendar Follow Us On Social Media 4544 North Lincoln Avenue, Chicago, IL 60625 •  (773) 728-6000 •  customerservice@oldtownschool.org Customer Service Phone Hours: 9:00 AM – 8:30 PM Central (Monday – Thursday) 9:00 AM – 5:00 PM Central (Friday – Sunday) Sign up for our emails! Premier Partners Champion and Additional Partners Anonymous James G. Hart Foundation Geraldine Keefe Negaunee Foundation Rob and Karen Ospalik Tomford and Grossman Family"
    },
    {
      "url": "https://myoldtownusa.com/shop/teams/",
      "text": "Shops | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Shops If youâre looking to shop local in Kissimmee, Old Town is a great place to support our small business community! You can dive into a treasure trove of unique gifts, nostalgic finds, and modern gadgets from our mom-and-pop shops! Looking for that perfect accessory to jazz up your evening outfit? Or a souvenir that captures the spirit of your favorite decade? Old Town's eclectic mix of shops has something for everyone, catering to all tastes and budgets, ensuring you leave with something truly special. Whether you're revving up at our car shows, enjoying a bite in one of Kissimmee's charming eateries, or discovering all the fun activities around town, the shopping at Old Town is the perfect complement to a day full of exploration and excitement. Store directory Attractions Drink and Dine Shops More Filters Arcade Attractions Grab N' Go Bars Restaurants Services Unique Gifts Clothing & Accessories Ailana Clothing & Accessories Discover the glamour of Ailana's Jewelry & Accessories, your destination for celebrity-inspired fashion jewelry and chic accessories. More Information Annie's Gifts Clothing & Accessories Explore our unique, high-quality gifts, all at reasonable prices! More Information Black Market Minerals Unique Gifts Black Market Minerals is your go-to destination for finding a unique gift for a loved oneâor a treat for yourself! More Information British Isle Connection Clothing & Accessories British Isle Connection is your one-stop shop for the widest selection of British merchandise! More Information Budget Rent-A-Car Services Looking to make the most of Old Town's spacious parking but don't have your own vehicle? More Information Caricatures by Characters Unique Gifts Ever dreamed of being on paper or becoming a living canvas? Look no further than Caricatures by Characters! More Information Comfort Wiz Footwear Clothing & Accessories At Comfort Wiz Footwear, our mission is to offer men and women the world's most comfortable shoes. More Information Electronic Town Services Unique Gifts Explore a variety of electronics, high-end fragrances, Costa sunglasses, and quality jewelry. More Information Extreme Woodcrafts Gift Shop Unique Gifts Extreme Woodcrafts specializes in a wide array of beautifully designed wooden art products More Information Faux Paw's Dog Shop Unique Gifts Clothing & Accessories Faux Paws is a gift shop for dogs and dog lovers! We have nothing your dog needs, but everything he wants More Information Full Dollar Clothing & Accessories Bargain shopping is a breeze at Full Dollar! Discover a fantastic selection of everyday essentials, all for just $1. More Information Garra Spas Services Immerse your feet in a soothing experience with our Garra Rufa fish, offering a relaxation unlike any other More Information Gold Hut Clothing & Accessories The Gold Hut presents an exclusive collection of costume jewelry, purses, and accessories. More Information Groovy Store Clothing & Accessories Groovy offers a vibrant selection of women's apparel, jewelry, t-shirts and giftware that embody the free-spirited and eclectic vibes of the 1960s and 70s. More Information Happy Daiquiri Bars Grab N' Go Sip, Smile, Repeat â Where flavor Meets Fun! More Information Ink Spot Tattoo Services At Ink Spot Tattoo, we understand that a tattoo is a lifelong commitment, which is why quality design and service are paramount More Information LED it Glow Unique Gifts LED It Glow brings LED-inspired fun for kids of all ages! More Information Love My Phone Repair Services Love My Phone specializes in iPhone repairs and also services smartphones, iPods, iPads, tablets, and game consoles More Information Lucky Mouse Asian Emporium Clothing & Accessories Lucky Mouse brings the best of East and West together with its stunning range of imported gifts and jewelry from China. More Information Magnets Unique Gifts To doughnut or not to doughnut, that is the question! Magnets offers a quirky collection of original, unique, and hilarious magnets More Information Mini Queen & Kingz Unique Gifts Mini Queen is your go-to destination for specialty Japanese products More Information O-Town Tattoo Services At O-Town Tattoo, we understand that a tattoo is a lifelong commitment, which is why quality design and service are paramount More Information OT Vapors Services OT Vapor is a Florida-based retail electronic cigarette business committed to providing the best possible shopping experience More Information Ocean Wave Surf Shop Clothing & Accessories If you're all about catching waves or harnessing the wind, Ocean Wave Surf Shop has everything you need for extreme sports. More Information Old Town Barbershop Services Experience Top-Notch Grooming at OT Barbershop More Information Old Town General Store Clothing & Accessories Old Town General Store is your go-to spot for specialty souvenirs! More Information Old Town Leather Clothing & Accessories Old Town Leather is your ultimate destination for all things leather! More Information Old Town Portrait Gallery Services Step back in time with Old Town Portrait Gallery in Kissimmee! More Information Out of this World Embroidery & Custom Tags Clothing & Accessories Out of this World Embroidery and Screen Printing specializes in custom embroidery for all your needs More Information Salty's Clothing & Accessories Add some laughter, joy and perhaps even a bit of bawdiness to your day. Â Saltyâs offers a hilarious collection of T-shirts, home dÃ©cor and gifts that will have you Laughing Out Loud! More Information Shades At Old Town Clothing & Accessories Shades at Old Town offers over 3,000 sunglasses in a variety of styles from simple, solid, and classy to exotic, hip and trendy at affordable family prices. More Information Skully's Rock 'N' Roll Clothing & Accessories Skully's Rock 'N Roll Experience celebrates the timeless legacy of rock with iconic memorabilia from every era. More Information Stay & Play Vacation Center Services Welcome to Stay & Play Vacation Center, your one-stop shop for attraction tickets in Old Town, Kissimmee! More Information Teams Clothing & Accessories Teams offers team sportswear from the NFL, NBA, MLB, NCAAF, NCAAB, and NHL, along with an impressive selection of sports memorabilia! More Information The Soap Company Unique Gifts The Soap Company specializes in all-natural, handcrafted artisan soaps and bath and body products More Information Tiki Jim's Clothing & Accessories Add some sunshine and fun to your day with a visit to Tiki Jimâs. Â Within the calming pleasure of the tropics, youâll find stylish jewelry and apparel with a big selection of funny tees and feel-good gifts. More Information Wound 'N Around Clothing & Accessories Step back in time at Wound 'N Around, an Old Town original specializing in retro memorabilia from the '40s, '50s, and '60s. More Information CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.yourtown.com.au/who-we-are/our-team",
      "text": "Our Team | Board & Executive Team | yourtown Our commitment to safeguarding Toggle navigation Donate Buy Tickets Prize Draws Buy Tickets Luxury Prize Homes Prestige Cars myplace Winners Prize FAQs Terms & Conditions Our Services Kids Helpline Employment Counselling Family Social Enterprises All Services Support Us Donate Fundraising and Events Corporate Support Our Corporate Partners Regular Giving Bequests Who We Are Our Team Safeguarding Careers at yourtown yourtown Rebrand Media COVID-19 Response Insights Advocacy Annual Insights Research and Evaluation Position Statements Get in Touch FAQs Blog Feedback Privacy My Account Privacy Feedback Prize Draws Buy Tickets Luxury Prize Homes Prestige Cars myplace Winners Prize FAQs Terms & Conditions Our Services Kids Helpline Employment Counselling Family Social Enterprises All Services Support Us Donate Fundraising and Events Corporate Support Our Corporate Partners Regular Giving Bequests Who We Are Our Team Safeguarding Careers at yourtown yourtown Rebrand Media COVID-19 Response Insights Advocacy Annual Insights Research and Evaluation Position Statements Get in Touch FAQs Blog Feedback Privacy My Account Privacy Feedback Toggle navigation menu Donate Buy Tickets Search My Account Prize Draws Buy Tickets Luxury Prize Homes Prestige Cars myplace Winners Prize FAQs Terms & Conditions Our Services Kids Helpline Employment Counselling Family Social Enterprises All Services Support Us Donate Fundraising and Events Corporate Support Our Corporate Partners Regular Giving Bequests Who We Are Our Team Safeguarding Careers at yourtown yourtown Rebrand Media COVID-19 Response Insights Advocacy Annual Insights Research and Evaluation Position Statements Get in Touch FAQs Blog Feedback Privacy My Account Privacy Feedback Who We Are Our Team who we are Our Team yourtown People yourtown Board Executive Team \"We’re a diverse team with a shared passion for creating positive change in the lives of young people.” – Daniel Batkin, Grants and Programs Officer, QLD “yourtown is a place that lives and breathes its ideals and philosophies. We don’t just talk about them. They’re in every word, action and reaction with each person who walks through the door.” - Mary-Ida Walker, Kids Helpline Counsellor Our diverse team works in a variety of ways to create positive change and includes: Counsellors Youth workers Indigenous mentors Tradespeople and vocational trainers Employment consultants Community development workers Child and family workers Human resource advisors Marketers, fundraising and media advisors Researchers Administration staff Accountants. yourtown Board members are experts in various fields. Together they are responsible for the overall business, management and direction of yourtown. The Board’s most important role is safeguarding the trust that clients, donors, corporate partners and government place in yourtown. The Board is committed to best practices in governance, accountability and transparency. Peter Ffrench Board Chair Peter is an experienced company director, leadership coach for senior executives and strategy advisor to Boards and senior teams, working across Asia Pacific. He has over 20 years' senior executive experience in general management, marketing and strategy in leading national companies across a diverse range of industries. He has held senior executive positions in FMCG, Health, Utilities and Energy industries in both the public and private sectors. Peter is a Fellow of the Australian Institute of Company Directors, a Professional Certified Coach through the International Coaching Federation, and an Affiliate Member, Institute of Coaching at McLean Hospital, Harvard Medical School affiliate. Peter was appointed as a Director of the Board of yourtown in February 2011, and appointed Chair in 2018. Qualifications & Skills: B Social Work, Graduate Diploma in Business Administration, Professional Certified Coach, International Coaching Federation, PCC, FAICD, FAMI Kristina Freire Kristina is a Chartered Accountant with over 30 years' experience in both commerce and public practice. Kristina provides taxation and business advice to a variety of clients including individuals, investors, superannuation funds and small- to medium-sized enterprises. Kristina is a director of the BDCU Alliance Bank, a member-owned social enterprise that provides financial products and services via a strategic alliance with Bendigo and Adelaide Bank. Kristina holds a Bachelor of Commerce from the Australian National University, is a member of the Institute of Chartered Accountants and a Graduate of the Australian Institute of Company Directors. Brit Ibanez Brit joined the yourtown Board in November 2024 bringing a wealth of experience and a passion for the work of the organisation. As a practising lawyer, Brit’s expertise in corporate governance and risk management will play an important part in driving yourtown 's mission forward.  Brit holds a Bachelor of Laws and International Business, a Master of Laws in Dispute Resolution, and is a graduate of the AICD. Her previous roles include being a board member of LoganTogether and Deputy Chair of C&K Childcare and Kindergarten. Megan Mitchell AM Megan was Australia’s first National Children’s Commissioner, completing her seven-year term in 2020. As Commissioner, Megan conducted a number of focused investigations into human rights issues for children, including in relation to: self-harm and suicide, domestic violence, teen parents and their children, and custodial detention. She also monitored and reported on Australia’s performance in delivering on its commitments against the Convention on the Rights of the Child, and led the development of national principles for child-safe organisations. Previously, Megan was the NSW Commissioner for Children and Young People and has had an extensive career in senior leadership positions in child protection and out of home care, disability, juvenile justice and early childhood services. Megan was also the CEO of the Australian Council for Social Services between 2001 and 2004. Megan holds post-graduate qualifications in Psychology, Social Policy and Education, and is a member of the Australian Institute of Company Directors. She is CEO of International Social Service Australia, is currently undertaking a PhD at the University of Sydney, and serves on a number of government and non-government boards. Megan was appointed as a Director of the Board of yourtown in April 2020. Qualifications & Skills: BA, Dip Ed, MA Matt Gardiner Matt has a career spanning mental health, primary health, violence prevention, youth justice, counselling, and family law. He's passionate about children's rights and yourtown ’s mission to empower young people, and brings experience in leading child and family organisations through strategic transformation, a strong focus on impact, and a deep respect for frontline work, shaped by his own background as a practitioner. He has led major initiatives such as Australia’s first Social Impact Bond, the first Australian Government Payment By Outcomes model, and implemented sector-leading impact measurement frameworks. He is co-founder of the Australian Centre for Child Rights and was Ministerially appointed as an 'expert advisor' on the development of the Australian Government's Blueprint for the Charity and non-for-profit sector. Complementing his role at yourtown , Matt is CEO of Cancer Council Qld, Chair of QCOSS and Director & Treasurer at Australian Council of Social Service and is Adjunct Associate Professor, in the Faculty of Health Sciences at Australian Catholic University. Qualifications: B.Soc.Science(psych) Master Clinical Counselling Postgrad.Dip. Strategic Leadership FAIML, MAICD Anita Le Anita is an executive leader with over 20 years of consulting experience in public, private and non-for-profit sectors. She specialises in customer focused, digital and technology-driven organisational change and has held senior practice and client leadership roles across PwC, Deloitte and Accenture. Anita brings expertise in the strategic governance, innovation and sustainable growth. Anita currently chairs the Digital and Technology Committee. She holds a Bachelor of Information Management and is a graduate of the Australian Institute of Company Directors. Appointed as a Director of the Board of yourtown in October 2022. Andrew Niven Andrew is currently a Senior Manager at QIC where he focuses on attracting clients and developing appropriate products and solutions for clients to invest in. He has worked in finance and investment for over 12 years with various roles across community, university and for-profit sectors. Andrew has a passion for improving the lives of young people in Australia and is excited to actively contribute to this through yourtown . Andrew has previously sat on the Board of The Aboriginal and Torres Strait Islander Community Health Services Brisbane (ATSICHS), The Institute for Urban Indigenous Health (IUIH), and Karalumba. He is currently the Independent Chair of the Finance Committee for Aboriginal and Torres Strait Islander Housing Queensland (ATSIHQ). In 2021, Andrew broke the Guinness World Record for most amount of weight lifted by kettlebell swing in 24 hours. He managed 9,208 swings and lifted over 166,000kg. His other awards include an Australia Day Medallion in both 2014 and 2016, CareerTrackers Student of the Year and CareerTrackers Alumni Excellence Award. Andrew holds a Bachelor of Business (with Distinction) from QUT. Jane Schmitt Jane is a lawyer by profession, with significant experience in senior executive roles and board governance across several sectors, including health, sport, energy, and education. Her significant governance background has provided her with a deep understanding of board relationships and engagement, along with contemporary governance practices necessary to support the achievement of strategic goals and a positive board culture aligned to the organisation’s values and purpose. She also brings expertise in advocacy, strategy and policy development, governance, stakeholder engagement, and corporate affairs. She is currently a non-executive director of Stanwell and Brisbane North PHN and provides CEO consultancy services to The Institute of Quarrying Australia. “What we do requires an absolute commitment and a belief that we make a difference.” – Tracy Adams, CEO The executive team is responsible for the day-to-day management of all yourtown operations. They develop, implement and monitor activities to ensure we really are transforming young lives and strengthening communities. Tracy Adams Chief Executive Officer Tracy has more than 30 years' experience with yourtown and was appointed CEO in 2008. In this role, she is responsible for implementing the organisation's strategic direction and ensuring its operations are conducted with the highest standards of integrity and accountability. Since being appointed to her current position she has directed significant company growth, including an operating budget increase of more than $40 million, a client increase of more than 100%, a greatly enhanced advocacy platform for those experiencing social exclusion, and an organisational name change. Tracy has frequently addressed Government enquiries into the welfare of Australian youth. Tracy is an Affiliated Member of the De La Salle Institute, a graduate of the Harvard Business School General Management Program, and a Fellow of the Institute of Managers and Leaders (IML).  She holds a number of for profit and non-profit Board positions, and is an executive advisor to the QUT – Executive MBA program. Preya Pillay Chief Financial Officer & Company Secretary Preya Pillay joined yourtown in January 2022 as Chief Financial Officer, responsible for our finance, business analysis and performance, property and procurement functions and teams. Preya is a Chartered Accountant, who brings more than 25 years’ experience in finance, having worked with major listed companies, the public sector and more recently the not-for-profit/for-purpose sector in health and care settings. She is a passionate advocate for social justice and is driven to improve outcomes for marginalised, disadvantaged and isolated individuals and communities, irrespective of their background, race or gender. Helen Vahdat Chief Information Officer Helen Vahdat commenced as Chief Information Officer in May 2020 where she manages the identification and implementation of business improvement processes to assist efficiency and productivity of the transformation of Information Technology at yourtown . Prior to working with yourtown , Helen was General Manager, Enterprise & Digital Applications at UnitingCare. Helen has experience in senior management positions within private business and the not-for-profit sectors, having worked in senior IT executive roles with Goodstart Early Learning, Watpac, Thiess Pty Ltd and Transpacific Pty Ltd. Helen holds a M.A. Information Technology from QUT. Brendan Bourke Head of Client Services Brendan commenced at yourtown in 2003 to help establish our employment, education and training programs and their associated regional delivery network. In 2016, Brendan was appointed as our Head of Client Services, leading the implementation and delivery of integrated client services in line with our organisational strategic framework. Prior to working with yourtown , Brendan spent five years as a senior manager with a major national recruitment agency following 16 years with the Federal Department of Education, Employment and Workplace Relations (DEEWR) in a variety of operational and senior management positions. Brendan has a Graduate Certificate in Business and extensive experience in the training and employment services industry in the private, public and community sectors. Jodie McAloney Head of People & Culture Jodie McAloney joined yourtown in March 2022 as Head of People & Culture, leading the general Human Resources, talent recruitment and retention, training and development, and HR Operations functions and teams. Prior to working with yourtown , Jodie spent nine years in senior HR leadership roles with Churches of Christ in Queensland, a large, for-purpose, faith-based organisation and was their inaugural Director of People & Culture. Her extensive professional background covers service delivery, human resources, leadership development and talent management within the federal and state government, commercial and for-purpose sectors. As a values-driven professional, Jodie is excited to be part of creating social safety and economic opportunity for young people and empowering yourtown ’s leaders to create workplaces and spaces that equip, develop, inspire and reward our people. × Close All enquiries and ticket sales 1800 555 079 FIND A LOCATION Our Services Learning Counselling Employment Family More Services Kids Helpline Who we are Our Team Careers at yourtown yourtown COVID-19 Statement × Close GDPR We have detected that you are visiting us from a country located in the EU or UK Unfortunately based on the advice we have received regarding the European Union’s Global Data Protection Regulation (GDPR) yourtown has had to make the difficult decision to no longer sell tickets to supporters who reside in the European Union or the United Kingdom. However, if you would like to support yourtown and Kids Helpline we are still able to accept donations at https://www.yourtown.com.au/donate We very much appreciate the past support that our EU & UK supporters have shown to yourtown and our services. If you believe that you have received this message in error please email us [email protected] Privacy | Feedback |  © yourtown 2025 | ABN 11 102 379 386 |  Website by Orange Digital Privacy | Feedback |  \n              © yourtown 2025  |  ABN 11 102 379 386 | \n              Website by Orange Digital × New Website We have completed our transition to the new website. If you are logging in for the first time since Monday 4th September, you will be prompted to reset your password (tip: you can use the same password). Continue × Reset Password No worries, we can send you a link to create a new password Email, Phone or Account No. SEND RESET LINK Back to login Need assistance? Check out FAQ , send an email or contact us with our Webchat × Verify SMS Pin You'll receive an SMS shortly with a PIN SMS Password Reset PIN. Verify PIN Back to login Need assistance? Check out FAQ , send an email or contact us with our Webchat × Reset Password Password * Min 8 Characters SAVE Need assistance? Check out FAQ , send an email or contact us with our Webchat × Create an account The easiest way to join yourtown Your details * Title Mr Mrs Ms Miss Dr Professor Father Revered Sister Brother Email * Phone * Password * Min 8 Characters I found yourtown on Brochure in letterbox Social Media (Facebook, Instagram, other) Television Ad Internet Ad Radio Newspaper Ad Magazine Ad Family or Friends Personally addressed mail Email Bus or Billboard Other How would you like to hear about our latest Prize Draws & Fundraising? Email Post Phone SMS I am over 18 years old and accept the Draw's Terms and Conditions . I have read and understand how yourtown values my privacy. REGISTER Already have an account? Log in × Please wait Loading... × Login successful Hello firstname Access your account Make a donation Buy tickets Accept Cookies & Close"
    },
    {
      "url": "https://www.oldtowneditions.com/who-we-are/",
      "text": "Who We Are - Old Town Editions info@oldtowneditions.com | 703-684-0005 Appointments required Follow Follow Follow Follow Follow Request a Sample Pack Old Town Editions Masters of the fine art of digital printmaking info@oldtowneditions.com | 703-684-0005 Appointments required Follow Follow Follow Follow Follow Request a Sample Pack Home About Us Who We Are Reviews / Testimonials Our Materials Paper and Canvas Scanning Equipment Printers Partial Client List Staff Our Services Artist Consultations Art & Artifact Reproduction Art Photography / Image Capture Fine Art Printing Digital Photo and Artifact Restoration Digital Art and Photography Printing Film Scanning Canvas Stretching Special Projects Government Print Education FAQ Artist Resources and Links Certificate of Authenticity Digital Fine Art Printmaking Articles for Artists Blog File Upload Contact Us Request a Sample Pack Service Area About Who We Are Masters of the Fine Art of Digital Printmaking Old Town Editions specializes in art reproduction and fine art printing for artists, photographers, museums, galleries, and private collectors. The type of printmaking we offer is commonly known as a giclee, or archival pigment print. As one of the original providers of giclees, Old Town Editions has a proven history of consistently providing high-quality giclees. Our staff consists of individuals with extensive backgrounds in fine art, digital printing, and photography. Our years of experience handling original artwork & priceless historic documents allow you to be confident that your artworks are safe while in our possession. Why Choose Old Town Editions? The approach that we take to fine art printing and art reproduction here at Old Town Editions is one of a kind. We have been working with artists, photographers, galleries, museums and individuals for more than 20 years. We have a proven history of consistently producing the finest digital fine art prints the industry has to offer. Our process and workflow is designed to meet the needs of each of our clients whether the volume is small or large. One of the main things that sets Old Town Editions apart from other printmakers is our commitment to partnering with our clients and forming a collaborative relationship. When you work with us, you partner with us. We offer free consultations for new clients to discuss not only our process but also strategies and information needed for clients to have success marketing and selling their giclee prints. In this first consultation, we will make sure we have a full understanding of our client’s needs so that we can help as much as possible. Artists come to us at different levels in their careers, from just starting out to artists who have been selling originals for years. We are sensitive to the different needs of different clients and will make sure we are providing the best level of service to every client. We are committed to helping our clients grow their businesses and will be here to help every step of the way. What Sets Us Apart Color Consistency We take several steps to maintain color consistency on orders years apart. We maintain our prints longer than most printmakers. In addition to archiving the final, color matched file, we also file a physical proof print we can reference to ensure continued quality. Our commitment to color consistency means you can orders prints as you need them, rather than printing an entire edition at once. In-House Work All of our art reproduction, printing, and digital restoration services are done in-house, so you can rest easy knowing your artwork will be safely stored in our studio and never shipped out. Work Directly With our Technicians At Old Town Editions, we don’t have a separate front desk staff. When you come in, you’ll be working directly with the technicians who will be working on your order. They can provide insight into how your art or artifact will move through our workflow and give you a tour of our studio as they explain our process and the equipment we use. Services Industry Pioneers Old Town Editions was founded with a simple goal in mind: to make the best possible giclee prints. Over our 25-year history, we have remained at the forefront of new technology, using every advancement in hardware and software to create the highest-quality prints. Our commitment to quality leads all of our decisions as a studio. We provide quality in all aspects to artists, photographers, museums, and galleries across the world.  Technical & Creative Know How Old Town Editions has the technical knowledge to make a great print combined with the artistic sensibility to understand the needs of artists. Z Quality & Dependability With a 25 year history of serving artists, galleries, and museums, you can count on Old Town Editions. As a well-established studio, we offer the security of knowing we’ll still be here for you years down the road.  Specialization We are dedicated to art reproduction and fine art printing, choosing to offer only these high-level services in order to fully focus on our clients and providing the best quality possible. All services Work With Us Whether you’re an artist, photographer, museum, gallery, or hobbyist, we’re ready to partner with you to fulfill your printmaking needs. Please reach out to us to get started! You can fill out the form here, call us at 703-684-0005, or e-mail us directly at info@oldtowneditions.com . Name Email Address Message Submit Visit our studio Hours of Operation: Appointments Required Mon 9am-5pm Tues-Fri 9am-6pm Sat 10am-5pm Contact Us Old Town Editions 610 Madison St., Suite 100 Alexandria, VA 22314 703-684-0005 info@oldtowneditions.com"
    },
    {
      "url": "https://www.myoldtownusa.com/store-directory/teams",
      "text": "Teams | Old Town USA VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs PARTNERS parking accessibility map tickets contact us car shows & events things to do Shops drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets Shops / Teams Teams Favourite WebSIte View Map Menu Teams offers team sportswear from the NFL, NBA, MLB, NCAAF, NCAAB, and NHL, along with an impressive selection of sports memorabilia! Hours Location Phone (407) 396-8326 buy tickets Favourite CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    },
    {
      "url": "https://www.myoldtownusa.com/",
      "text": "Home | Old Town Entertainment District | Kissimmee, FL VETTEFEST at Old Town - Saturday, October 4, 2025 car shows & events things to do Shops drink & Dine rides about history of old town FAQs PARTNERS parking accessibility map contact us Book online now! car shows & events things to do Shops Drink & Dine rides attractions about history of old town FAQs parking accessibility map tickets welcome to Old Town entertainment district Sign-Up for Our Newsletter Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Step into the vibrant heart of Kissimmee and immerse yourself in the nostalgic charm of Old Town! This enchanting entertainment district is a kaleidoscope of fun, offering an eclectic mix of delightful dining, unique shopping experiences, and thrilling rides for the young and young at heart. Whether you're a thrill-seeker, a foodie, or a shopping aficionado, Old Town has something to spark joy in every visitor! events Cars, entertainment and events - Oh my! EXPLORE drink & dine Savor the charm and enjoy the delightful food at Old Town EXPLORE shops Discover unique finds from every decade, only at Old Town! EXPLORE WEEKLY EVENTS go to all events NOW OFFICIALLY OPEN! Maw's Mountain Moonshine Old Town is excited to announce the exciting addition of Mawâs Mountain Moonshine. Â The five generations Adkins moonshine family is now bringing a second location of their Craft Cocktail Distillery to Old Town and Kissimmee! follow us what people say I always enjoy coming here. Lots of things to do. Bars stores games rides food they have it all. There's always something going on here from concerts to car shows. Michael Absolute highlight from our trip. The atmosphere is wonderful. Lots of live music and some lovely bars. We stayed to see the parade of cars, which was a really unique and fun experience. Highly recommend going here! Romy Coers I love visiting old town because of how many things you can do at the same time. They have a lot of restaurants and bars to choose from. The main thing that I love about visiting old town is their car show, as a car enthusiastic I love watching theirs cars. Annie A Old town was always such a fun place to visit. I loved coming down here just to see all the fun stuff. The old cars, crazy art work and fun colors are a must see. Amber Steele We made our 1st trip to Old Town over 14 years ago, and it's even better now. A series of shops and eateries attached to an amusement park. If you want a break from the huge pricey theme parks, this is a nice alternative. Tialisa Whipple Old town is an amazing place they have car shows on a weekend live music. Shane Ball CARÂ SHOWSÂ &Â events shops drink & Dine rides Nearby attractions/Hotels Book online now! history of old town faqs parking accessibility map contact us 5770 west irlo bronson memorial hwy +1 (407) 396-4888 info@myoldtownusa.com open everyday: 11 am - 11 pm privacy policy cookie policy do not sell my personal info"
    }
  ]
}