{
  "fuentes": [
    {
      "url": "https://www.mywinterhaven.com/407/Careers-at-the-City-of-Winter-Haven",
      "email": "humanresources@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/407/Careers-at-the-City-of-Winter-Haven",
      "email": "sdykes@mywinterhaven.com"
    },
    {
      "url": "https://www.executivesuite.ca/contact-us",
      "email": "admin@executivesuite.ca"
    },
    {
      "url": "https://www.centralparknyc.org/about",
      "email": "blog-wide@2x-from-bow-bridge-1.jpg"
    },
    {
      "url": "https://www.centralparknyc.org/about",
      "email": "rbacker@centralparknyc.org"
    },
    {
      "url": "https://mywinterhaven.com/Calendar.aspx?EID=646",
      "email": "vcastillo@mywinterhaven.com"
    },
    {
      "url": "https://www.centralparknyc.org/park-history",
      "email": "blog-wide@2x-from-bow-bridge-1.jpg"
    },
    {
      "url": "https://www.centralparknyc.org/park-history",
      "email": "rbacker@centralparknyc.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "asset-1@2x.png"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "cservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "customerservice@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "tkramer@thisistheplace.org"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "email": "you@domain.com"
    },
    {
      "url": "https://www.quora.com/Who-is-the-owner-of-Central-Park-in-New-York-Why-is-it-considered-to-belong-to-no-one-in-particular",
      "email": "jo@samaritans.org"
    },
    {
      "url": "https://www.centralpark.com/visitor-info/park-contact-numbers/",
      "email": "volunteer@centralparknyc.org"
    },
    {
      "url": "https://www.centralparknyc.org/contact-us",
      "email": "blog-wide@2x-from-bow-bridge-1.jpg"
    },
    {
      "url": "https://www.centralparknyc.org/contact-us",
      "email": "press@centralparknyc.org"
    },
    {
      "url": "https://www.centralparknyc.org/contact-us",
      "email": "rbacker@centralparknyc.org"
    },
    {
      "url": "https://www.centralparknyc.org/contact-us",
      "email": "wcommittee@centralparknyc.org"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "buildinginspections@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "contractorregistration@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "bborga@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "blane@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "buildinginspections@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "bwells@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "dmahalik@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "fnouami@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "jhart@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "jlegee@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "jmontgomery@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "kpeth@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "pjohnson@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "rfernandez@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "email": "rwells@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/157/City-Managers-Office",
      "email": "mcarnevale@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/157/City-Managers-Office",
      "email": "anicholson@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/157/City-Managers-Office",
      "email": "mstavres@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/199/Water-Department",
      "email": "awisham@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/226/Customer-Service",
      "email": "awisham@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/226/Customer-Service",
      "email": "kreeves@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/226/Customer-Service",
      "email": "uafsdivision@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/272/Athletics",
      "email": "jadams@mywinterhaven.com"
    },
    {
      "url": "https://www.mywinterhaven.com/272/Athletics",
      "email": "seilers@mywinterhaven.com"
    }
  ],
  "mails": [
    "admin@executivesuite.ca",
    "anicholson@mywinterhaven.com",
    "asset-1@2x.png",
    "awisham@mywinterhaven.com",
    "bborga@mywinterhaven.com",
    "blane@mywinterhaven.com",
    "blog-wide@2x-from-bow-bridge-1.jpg",
    "buildinginspections@mywinterhaven.com",
    "bwells@mywinterhaven.com",
    "contractorregistration@mywinterhaven.com",
    "cservice@thisistheplace.org",
    "customerservice@thisistheplace.org",
    "dmahalik@mywinterhaven.com",
    "fnouami@mywinterhaven.com",
    "humanresources@mywinterhaven.com",
    "jadams@mywinterhaven.com",
    "jhart@mywinterhaven.com",
    "jlegee@mywinterhaven.com",
    "jmontgomery@mywinterhaven.com",
    "jo@samaritans.org",
    "kpeth@mywinterhaven.com",
    "kreeves@mywinterhaven.com",
    "mcarnevale@mywinterhaven.com",
    "mstavres@mywinterhaven.com",
    "pjohnson@mywinterhaven.com",
    "press@centralparknyc.org",
    "rbacker@centralparknyc.org",
    "rfernandez@mywinterhaven.com",
    "rwells@mywinterhaven.com",
    "sdykes@mywinterhaven.com",
    "seilers@mywinterhaven.com",
    "tkramer@thisistheplace.org",
    "uafsdivision@mywinterhaven.com",
    "vcastillo@mywinterhaven.com",
    "volunteer@centralparknyc.org",
    "wcommittee@centralparknyc.org",
    "you@domain.com"
  ],
  "nombre_sitio": "mywinterhaven.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.mywinterhaven.com/407/Careers-at-the-City-of-Winter-Haven",
      "text": "Careers at the City of Winter Haven | Winter Haven, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Residents Business How Do I... Search Home Departments Human Resources Careers at the City of Winter Haven Careers at the City of Winter Haven Purpose-Driven Careers Do you want to help people? To make your community better? Regardless of title or responsibilities, those two things are central to every employee's work with the City of Winter Haven. Our mission is to enrich lifestyle through exceptional customer service. Every employee's top focus is serving the citizens of Winter Haven every day. Joining our team means you'll work alongside other dedicated teammates and, together, you will invest your efforts into bettering the Winter Haven community. Click to See Current Job Openings Our Mission Enriching lifestyle through exceptional service. Our Vision To be the best City through relentless pursuit of excellence. Our Values Integrity / Respect Financial Stewardship Inclusive Visionary Exceptional Service Care for Employees City of Winter Haven employees invest in our citizens and community daily, and we, as a City, invest in our employees. Here you will receive a competitive wage, a strong benefits package, numerous educational and advancement opportunities, and a welcoming atmosphere. Benefits Annual Pay Adjustments. Through our Step for Performance Pay Plan employees who receive a satisfactory or higher rating on their annual evaluation will receive a 2.5% pay increase each year on their anniversary date, or a 3.5% pay increase if it is a five-year anniversary date. Paid Time Off. Work and life balance is important. All full time employees receive three types of paid time off. 12 Paid Holidays per year to celebrate with family and friends. Paid Vacation Days to relax, recharge and refresh. This time begins accruing on day one of employment at the rate of one day per month. Employees with five plus years of service will earn additional paid time off each month. Paid Sick Days to recover, care for family, or attend medical appointments. Three of these days may be taken as personal days for any reason. This time begins accruing on day one of employment at the rate of one day per month. Firefighters receive 13 Kelley Days and earn 120 hours of vacation, 144 hours of sick leave and 12 paid holidays per year. Health, Dental, and Vision Insurance. The co-sponsored plans are designed to promote self care and provide coverage in the event of illness or injury for employees and their eligible dependents. Life Insurance (AD&D). All regular full-time employees receive a $10,000 life and accidental death and dismemberment policy paid for by the City, with the option to purchase additional coverage at very affordable rates. Retirement Plan. Every regular full-time employee is enrolled in a great retirement plan preparing for future quality of life after your career. 401(a) Plan. General employees are enrolled in our 401(a) plan to build savings for retirement. Pension Plan. This defined benefit plan is available to Sworn Police Officers and Firefighters. Tuition and Book Reimbursement. Employees who want to earn a degree, pursue a graduate degree, or earn a certification, obtain their CDL license, or pursue another form of professional training related to their career are able to receive up-front funding or reimbursement to cover the cost of the education opportunity. Additional Opportunities for Employee Engagement In addition to the benefits package, the City team is cared for in a variety of fun, engaging, and exciting ways throughout the year. Bright Ideas Program. This program focuses on promoting innovation from all levels of the organization. Ideas that may save the City money, better serve our customers, or otherwise improve service can be submitted by any employee. If an idea is implemented, that employee is eligible for a bonus ranging from $100 to $3,000. Diversity and Inclusion Team. This team of employees from across departments meets monthly and serve as ambassadors to their departments and divisions. They also plan City-wide events promoting understanding, education, and opportunities to create a greater sense of belonging in the workplace. Professional and Personal Development Classes. The Human Resource Department provides ongoing classes in a variety of topics. Learn about customer service, join a book club, participate in a yoga session, or come to a coloring class to team-build and destress! There's something for everyone. Leadership Program at Polk State. The City has partnered with Polk State College to create a leadership development class. Participants from across departments form a cohort and complete formal coursework and projects. They are honored at a graduation ceremony and reception upon completion of the program. Health Fair. Annually employees and insured retirees can participate in a health fair which consists of blood work and results, flu shots, health and safety advice, vendors to share their literature for a healthier lifestyle, and some fun activities. Employee Appreciation Events. These events offer all employees an opportunity to enjoy a meal or activity, creating an environment to socialize and relax with coworkers and those in other departments and relax. Past events have included a summer picnic on the lake with water activities, BBQs, and a festive holiday party. Mentorship and Career Counseling. The City leadership team is dedicated to mentoring employees, providing opportunities for advancement, and helping everyone grow and enjoy a thriving career within our workforce. Additionally, the Human Resource department provides career counseling to all employees. Key Results Area (KRA) Teams. These teams are made up of City employees and are tasked with shaping the future of the City in areas such as employee feedback, process improvement and innovation, training development and succession planning, recruitment and retention, and employee engagement. Click to See Current Job Openings How to Apply Click the Current Job Opening button to review our current openings. Don't see something that fits? Sign up to receive notices when new jobs are posted! Fill out the appropriate application for the position you're interested in. Be sure you have your driver's license, social security, contact information, and previous work history handy to complete the application. General Employees Application Police Application (PDF) Fire Application (PDF) Submit the application before the job closing date one of three ways: Submit it online. Email it to the Human Resources Department Bring it to our HR offices at: 500 Third Street NW Winter Haven, FL 33881 The human resources team will confirm receipt of your application. If selected for an interview, a member of our team will reach out to schedule the interview. If selected for the position, all offers are contingent on successfully completing a background check and physical at no cost to you.  The human resources team will provide you with detailed information on how to complete these steps. The City of Winter Haven covers the cost of these steps. After all requirements above are met, we will coordinate a start date with you and begin the onboarding process. Within the first few months of hire, you will attend Welcome to Winter Haven Day. This is an event put on by Human Resources that serves as an interactive orientation and training day. Click to See Current Job Openings Equal Opportunity Employer Contact Us Human Resources Physical Address 500 Third Street NW Winter Haven , FL 33881 Phone: 863-291-5650 Fax: 863-291-5617 Shawn Dykes Human Resources Director / Equal Employment Opportunity (EEO) Non-Discrimination Officer sdykes@mywinterhaven.com Phone: 863-291-5650 Ext. 2401 Careers at the City of Winter Haven Current Job Openings General Application Firefighter Application Police Department Application Job Openings SEE & SUBSCRIBE TO OPPORTUNITIES Quickly Find What You Are Looking For Popular Links Job Openings Report an Issue Start/Stop Water Public Notices Pay Utility Bill Public Records Request Solid Waste Information Building Permits /QuickLinks.aspx Exceptionally Local Contact Us Winter Haven City Hall 451 Third Street NW Winter Haven, FL 33881 Phone: 863-291-5600 Report a Concern Staff Directory Quick Links Bid Postings Job Openings Brand Guidelines Events News FAQs /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.executivesuite.ca/contact-us",
      "text": "Contact Us | Central Park Business Centre - Vancouver top of page HOME OFFICES MEETING ROOMS CONFERENCE ROOM VIRTUAL OFFICES CALENDAR CONTACT US Contact us Central Park Business Centre – Vancouver Office Space 300-3665 Kingsway Vancouver, BC V5R 5W2 Phone: (604) 435-2500 E-mail: admin@executivesuite.ca CENTRAL PARK BUSINESS CENTRE 300-3665 Kingsway Vancouver, BC V5R 5W2 Open Monday - Friday: 8:30am - 5:00pm CALL FOR A FREE ESTIMATE PHONE: 1 604 435 2500 FAX: 1 604 435 8181 EMAIL: admin@executivesuite.ca Copyright © 2024 · Central Park Business Centre · Return to top of page bottom of page"
    },
    {
      "url": "https://www.centralparknyc.org/about",
      "text": "About Us | Central Park Conservancy High contrast Default colors Email Signup Join/Renew Central Park Conservancy Visit Map Things To Do About Us Support Magazine Shop Search Open the Navigation Menu Central Park Conservancy Visit Map Things To Do About Us Support Magazine Shop Search Close the Navigation Menu Central Park is located in New York City, and stretches from 59th Street to 110th Street, between Fifth Avenue and Central Park West. Plan Your Visit Visitor Centers Restrooms Alerts and Closures Help Center Popular Places To See Park Tours Central Park Shop Davis Center Search Park Features Landscapes & Points of Interest Playgrounds Woodlands Architectural Features Bridges & Arches Statues & Ornamental Features Water Bodies Quiet Zones Activities & Amenities Restrooms Visitor Information Recreation & Cultural Facilities Central Park Shop Dining Downloadable Maps Area North Mid-Park South In the Park? Find locations near you 66° F Park Hours 6:00 am – 1:00 am Browse all Search - Calendar Activities & Guides Tours Events Interest Kids & Families Staff Picks Digital Guide Bloom & Tree Guide Official Central Park Tours Our Work Leadership Restoration Park History Sustainability Women's Committee Five Borough Program Jobs Newsroom Contact The Davis Center The Park Needs Us Donate Become a Member Give Monthly Tribute Giving Gift Membership Create a Fundraiser Adopt-A-Bench Donate Flowers Adopt-A-Tree Dedicate a Paving Stone Corporate Programs Planned Giving Benefit Events Volunteer Other Ways to Give Help the Central Park Conservancy keep the Park beautiful and vibrant by making a gift today. $100 $200 $500 $1,000 Other Amount Topics About the Conservancy Health and Fitness Park History Park Information Plants and Trees Programs and Events Q&As Restoration and Maintenance Things to See and Do Tips for Visiting Wildlife – Browse all How Contemporary Art and Literature Are Reviving Seneca Village June 17, 2025 Explore recent books and artwork inspired by Seneca Village—and why the community’s story resonates with artists today. Visit ${scope.openAccordionSection == 'visit' ? 'Collapse' : 'Expand'} the Visit Menu Plan Your Visit Visitor Centers Restrooms Alerts and Closures Help Center Places To See Park Tours Central Park Shop Davis Center Map Search Park Features Landscapes & Points of Interest Playgrounds Woodlands Architectural Features Bridges & Arches Statues & Ornamental Features Water Bodies Quiet Zones Activities & Amenities Restrooms Visitor Information Recreation & Cultural Facilities Central Park Shop Dining Downloadable Maps Area North Mid-Park South Things to do ${scope.openAccordionSection =='things-to-do' ? 'Collapse' : 'Expand'} the Things to Do Menu 66° F Park Hours 6:00 am – 1:00 am Browse all Search Calendar Activities & Guides Tours Events Interest Kids & Families Staff Picks Digital Guide Bloom & Tree Guide About Us ${scope.openAccordionSection =='about-us' ? 'Collapse' : 'Expand'} the About Us Menu Our Work Leadership Restoration Park History Sustainability Women's Committee Five Borough Program Jobs Newsroom Contact Support ${scope.openAccordionSection =='support' ? 'Collapse' : 'Expand'} the Support Menu Donate Become a Member Give Monthly Tribute Giving Gift Membership Create a Fundraiser Adopt-A-Bench Donate Flowers Adopt-A-Tree Dedicate a Paving Stone Corporate Programs Planned Giving Benefit Events Volunteer Other Ways to Give $100 $200 $500 $1,000 Other Amount Magazine ${scope.openAccordionSection =='articles' ? 'Collapse' : 'Expand'} the Magazine Menu About the Conservancy Health and Fitness Park History Park Information Plants and Trees Programs and Events Q&As Restoration and Maintenance Things to See and Do Tips for Visiting Wildlife – Browse all Shop Join/Renew High contrast Default colors Email Signup See all alerts 66°\n\t\t\t\t\t\t\t\t\tF Park map About Us The mission of the Central Park Conservancy is to preserve and celebrate Central Park as a sanctuary from the pace and pressures of city life, enhancing the enjoyment and wellbeing of all. Central Park is New York City’s 843-acre backyard, an essential space that welcomes over 42 million visitors annually. The City of New York has entrusted the Central Park Conservancy with the complete day-to-day care of this iconic public space, which requires dedicated expertise that we’ve honed during our 40-year history . Conservancy employees tend to the Park’s complex maintenance, restoration, and architectural needs—from horticulture to tree and turf care, trash management, visitor services, and much more—resulting from massive use. As the stewards of the Park, the Conservancy is committed to serving the public’s best interests and providing the oversight and expertise necessary to ensure that this world-class greenspace is accessible to all. Funded primarily by individual donations, we will raise and invest nearly $100 million into the Park’s care this year with the sole mission of protecting and improving Central Park in perpetuity. Not only does this allow the NYC Department of Parks and Recreation to allocate nearly its entire budget to other parks, but we help generate more than $1 billion in annual economic activity and 5,000 local jobs—a true partnership with the City for the people of New York. Our Work The Conservancy works year-round, rain or shine, to maintain and restore every inch of the Park—but our efforts go well past its perimeter. Projects Restoration Work Like any living thing, Central Park is constantly changing. The Conservancy is committed to ensuring that this evolution is thoughtful—both considerate of today’s visitor and true to the Park’s original purpose. Our Work Park Operations Conservancy crews work year-round to maintain landscapes, water bodies, stonework, benches, playgrounds, and facilities for more than 42 million visitors each year. Things To Do Community Engagement Central Park is for the people, and the Conservancy offers a variety of public programs designed to deepen the community’s engagement with the Park and cultivate appreciation through personal, meaningful, and memorable experiences. In the Five Boroughs and Beyond Since its earliest days, the Conservancy has provided critical assistance and support to parks throughout New York City and across the globe through the Institute for Urban Parks and Five Borough Program. Central Park Conservancy: Our Story View with audio description Our Values Guiding Principle Central Park is a masterpiece of landscape architecture created to provide a profoundly democratic space and green respite for the City and all its people and to establish New York as one of the great cities of the world. The Conservancy honors its commitment to this iconic public space by applying its deep expertise in urban park management; by partnering with the community and the City of New York; and by marshalling all of the resources necessary for the Park’s long-term care. The Conservancy’s work is founded on the belief that citizen leadership and private philanthropy are key to ensuring that the Park and its essential purpose endure. Diversity, Equity & Inclusion The Central Park Conservancy’s work is guided by the belief that Central Park, and all public parks, must be managed and actively protected as an inclusive and democratic space for all. Working closely with our New York City partners, we will always strive towards creating and sustaining a sense of belonging for all visitors and advocating for equitable and accessible public use of the Park. In service of this belief, we are committed to fostering a workforce and organizational culture that is as diverse as Central Park itself and the dynamic city it serves. Core Values Commitment We hold ourselves accountable for the care of Central Park, recognizing both its fragility and its importance to New York City and to the world. Expertise We develop our expertise in the service of our mission and share our knowledge to elevate the field of urban park management. Integrity We value and demonstrate sound moral and ethical principles in the workplace. Collaboration We value the power and effectiveness of working with our colleagues, with the City, and with the public to accomplish our goals as the principal steward of the Park. Revitalizing New York City Central Park is not just a park—it’s a major tourist attraction and economic generator, with an immense impact on the fiscal, social, economic, environmental, cultural, physical, and mental health of the City and its residents. The Conservancy is dedicated to caring for this essential greenspace and honored to offer the people of New York a place of respite and renewal throughout the seasons. The Environment The Conservancy creates sustainable landscapes—including lawns, woodlands, water bodies, and more—that provide environmental benefits to all New Yorkers. Wildlife Our Operations team’s year-round care of the Park allows many species to find habitat and nourishment within its 843 acres. Physical and Mental Health We employ a diverse staff responsible for horticulture, trash management, visitor services, restoration, and more so that New Yorkers can use the Park to benefit both their physical and mental health. Tourism Four decades of the Conservancy’s work has made Central Park a top tourist destination as well as a beloved spot for locals. The Economy The Conservancy’s rescue and restoration of the Park and our continued daily maintenance have made New York a more attractive destination, supporting tourism, real estate, and tax revenue. The financial impact is more than $1 billion in annual economic activity and revenue for New York City. Leadership The Conservancy’s board and senior leadership work together toward the common goal of preserving and enhancing Central Park for future generations. Learn More The Park Needs Us Central Park is New York City’s backyard—which means it needs all who visit to get involved in its care. Your donations, membership, volunteering, and stewardship of the Park keep it a vital public treasure and thriving habitat. The Central Park Conservancy was born of community activism, and 40 years later we continue to partner with the public and rely on our community—people like you, who need Central Park. The Park needs you, too. Get Involved The Fall Countdown Is On And we've got all you need for Central Park's most magical season. Sign up to get your free Fall Guide today, with our official Foliage Tracker, favorite seasonal activities, and much more. Email Address Get Your Fall Guide This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Get the latest from the Park, direct to your inbox. Email Address This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Central Park Conservancy 717 Fifth Avenue New York, NY 10022 212.310.6600 The Central Park Conservancy is a private, not-for-profit organization, and is tax exempt under Section 501(c)(3) of the Internal Revenue Code. Federal EIN (tax ID) number 13-3022855. Privacy Policy Governance Central Park Conservancy Central Park tiktok account Central Park youtube account Central Park facebook account Central Park instagram account Central Park twitter account Central Park pinterest account Top Central Park Conservancy"
    },
    {
      "url": "https://mywinterhaven.com/Calendar.aspx?EID=646",
      "text": "Calendar • City Commission Meeting Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Residents Business How Do I... Search Home Calendar Calendar View All Calendars is the default. Choose Select a Calendar to view a specific calendar. Subscribe to calendar notifications by clicking on the Notify Me® button, and you will automatically be alerted about the latest events in our community. List Week Month Subscribe to iCalendar Print Notify Me® Find a Facility Search Calendars by: Start Date End Date Enter Search Terms Show Past Events Select a Calendar Select Calendar/Calendars to filter All Calendars City Operational Days / Holidays Library Programs Public  Meetings Signature Events Space Reservations Search Return to Previous Event Details View Map Google Bing Download Agenda Date: May 13, 2024 2024-05-13T18:00:00 Time: 6:00 PM - 7:30 PM Time Details: The meeting begins at 6:00 p.m. and ends at the completion of all agenda items. Location: View Facility John Fuller Auditorium at City Hall Address: 451 Third Street NW Winter Haven , FL 33881 Contact: 863.291.5627 Email: Email City Commission Meeting Monday, May 13, 2024 The Winter Haven City Commission meets the second and fourth Mondays of each month at 6:00 p.m., in John Fuller Auditorium at City Hall. \r\n\r\nAgenda & Minutes\r\n\r\nFor details, contact City Clerk Vanessa Castillo at 863-291-5627 or vcastillo@mywinterhaven.com. Map Agenda Facility Submit Event Print Email Event Subscription View RSS Feeds Select on Calendar Expand Collapse Previous Next Down Up Map Share Show more Agenda Live Edit Quickly Find What You Are Looking For Popular Links Job Openings Report an Issue Start/Stop Water Public Notices Pay Utility Bill Public Records Request Solid Waste Information Building Permits /QuickLinks.aspx Exceptionally Local Contact Us Winter Haven City Hall 451 Third Street NW Winter Haven, FL 33881 Phone: 863-291-5600 Report a Concern Staff Directory Quick Links Bid Postings Job Openings Brand Guidelines Events News FAQs /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.centralparknyc.org/park-history",
      "text": "Park History | Central Park Conservancy High contrast Default colors Email Signup Join/Renew Central Park Conservancy Visit Map Things To Do About Us Support Magazine Shop Search Open the Navigation Menu Central Park Conservancy Visit Map Things To Do About Us Support Magazine Shop Search Close the Navigation Menu Central Park is located in New York City, and stretches from 59th Street to 110th Street, between Fifth Avenue and Central Park West. Plan Your Visit Visitor Centers Restrooms Alerts and Closures Help Center Popular Places To See Park Tours Central Park Shop Davis Center Search Park Features Landscapes & Points of Interest Playgrounds Woodlands Architectural Features Bridges & Arches Statues & Ornamental Features Water Bodies Quiet Zones Activities & Amenities Restrooms Visitor Information Recreation & Cultural Facilities Central Park Shop Dining Downloadable Maps Area North Mid-Park South In the Park? Find locations near you 66° F Park Hours 6:00 am – 1:00 am Browse all Search - Calendar Activities & Guides Tours Events Interest Kids & Families Staff Picks Digital Guide Bloom & Tree Guide Official Central Park Tours Our Work Leadership Restoration Park History Sustainability Women's Committee Five Borough Program Jobs Newsroom Contact The Davis Center The Park Needs Us Donate Become a Member Give Monthly Tribute Giving Gift Membership Create a Fundraiser Adopt-A-Bench Donate Flowers Adopt-A-Tree Dedicate a Paving Stone Corporate Programs Planned Giving Benefit Events Volunteer Other Ways to Give Help the Central Park Conservancy keep the Park beautiful and vibrant by making a gift today. $100 $200 $500 $1,000 Other Amount Topics About the Conservancy Health and Fitness Park History Park Information Plants and Trees Programs and Events Q&As Restoration and Maintenance Things to See and Do Tips for Visiting Wildlife – Browse all How Contemporary Art and Literature Are Reviving Seneca Village June 17, 2025 Explore recent books and artwork inspired by Seneca Village—and why the community’s story resonates with artists today. Visit ${scope.openAccordionSection == 'visit' ? 'Collapse' : 'Expand'} the Visit Menu Plan Your Visit Visitor Centers Restrooms Alerts and Closures Help Center Places To See Park Tours Central Park Shop Davis Center Map Search Park Features Landscapes & Points of Interest Playgrounds Woodlands Architectural Features Bridges & Arches Statues & Ornamental Features Water Bodies Quiet Zones Activities & Amenities Restrooms Visitor Information Recreation & Cultural Facilities Central Park Shop Dining Downloadable Maps Area North Mid-Park South Things to do ${scope.openAccordionSection =='things-to-do' ? 'Collapse' : 'Expand'} the Things to Do Menu 66° F Park Hours 6:00 am – 1:00 am Browse all Search Calendar Activities & Guides Tours Events Interest Kids & Families Staff Picks Digital Guide Bloom & Tree Guide About Us ${scope.openAccordionSection =='about-us' ? 'Collapse' : 'Expand'} the About Us Menu Our Work Leadership Restoration Park History Sustainability Women's Committee Five Borough Program Jobs Newsroom Contact Support ${scope.openAccordionSection =='support' ? 'Collapse' : 'Expand'} the Support Menu Donate Become a Member Give Monthly Tribute Giving Gift Membership Create a Fundraiser Adopt-A-Bench Donate Flowers Adopt-A-Tree Dedicate a Paving Stone Corporate Programs Planned Giving Benefit Events Volunteer Other Ways to Give $100 $200 $500 $1,000 Other Amount Magazine ${scope.openAccordionSection =='articles' ? 'Collapse' : 'Expand'} the Magazine Menu About the Conservancy Health and Fitness Park History Park Information Plants and Trees Programs and Events Q&As Restoration and Maintenance Things to See and Do Tips for Visiting Wildlife – Browse all Shop Join/Renew High contrast Default colors Email Signup See all alerts 66°\n\t\t\t\t\t\t\t\t\tF Park map Park History “[The beauty of the park] should be the beauty of the fields, the meadow, the prairie, of the green pastures, and the still waters. What we want to gain is tranquility and rest to the mind.” Frederick Law Olmsted, 1870 New York’s Central Park is a world-famous public park, created beginning in 1858 to address the recreational needs of the rapidly growing City. Its original purpose was to offer urban dwellers an experience of the countryside, a place to escape from the stresses of urban life and to commune with nature and fellow New Yorkers. Over 150 years later, the Park still provides this essential purpose, and welcomes all visitors, while accommodating newer forms of recreational activities. With 42 million visits a year, Central Park is one of the most visited urban parks in the country and one of the most popular destinations in New York City. Designed by Frederick Law Olmsted and Calvert Vaux, Central Park influenced the development of urban parks nationwide and is widely regarded a masterpiece of landscape architecture . Central Park is a National Historic Landmark (1963) and a Scenic Landscape of the City of New York (1974). Located in what is now the center of Manhattan , the site was far from the built-up areas of the City when planning for the Park began in the 1850s. Sparsely populated, it was home to small farms, industrial uses, and dwellings scattered between areas of marshland and rocky hills. The most densely populated section of the site was a settlement known as Seneca Village , highly significant as a predominantly African-American community, many of whom were property owners. Seneca Village accounts for approximately 225 of the 1,600 total residents living on the land who were displaced through the process of eminent domain. Olmsted and Vaux designed Central Park to incorporate a variety of landscapes and experiences. Its 843 acres included sweeping lawns, picturesque woodlands, meandering streams, and broad lakes, all experienced by moving through the Park along winding paths, a carriage drive, and a bridle path. Over time, additional features were added to the Park, including baseball and soccer fields, a carousel, two skating rinks, a zoo, formal gardens, commemorative monuments, and concert and theater venues. View in Central Park, Balcony Bridge and Oak Bridge. Photo courtesy of the New York Public Library. In addition to diverse recreational experiences, Central Park provides great ecological and environmental benefits to the City . Its more than 18,000 trees cool and clean the air and its vast acreage in the center of the City provides habitat for wildlife , including as a stopover on the Atlantic Flyway for over 200 species of birds . Throughout the Park’s history, pressures to add new features or use the Park for large events and non-recreational uses have threatened its purpose as a bucolic retreat from urban life. The Park has also suffered during periods of economic decline, neglect, and mismanagement. In response, New Yorkers have continuously fought to preserve the Park and uphold its original purpose . After the most recent and extreme period of deterioration, which started in the 1960s, the Central Park Conservancy was formed by a group of these citizens to rebuild and restore the Park in partnership with the City. More Central Park History Park History Artifacts and Archives: The Rediscovery and Research of Seneca Village Learn about the historical research of this community of predominantly African-Americans, many of whom owned property. Tags: History Q&As 5 Questions with Cal Jones, Manhattan Borough Historian Emeritus Celedonia (Cal) Jones, born and raised in central Harlem, talks about his childhood in NYC and how he became involved in telling Seneca Village’s many stories. Tags: History Park History The Competition: 33 Plans for Central Park in 1858 The Park that we know and love today was designed during a competition run by the Commissioners of Central Park from 1857 to 1858. Tags: Park Design Park History A History of Monuments in Central Park The original design for Central Park did not include any monuments, but soon after Central Park opened, New Yorkers began proposing a variety of additions, including monuments. Tags: Monuments Park History Before Central Park: The Story of Seneca Village An introduction to Seneca Village, the largest community of free African-American property owners in pre-Civil War New York. Tags: About the Conservancy / History Park History The History of Central Park’s North End Get to know this area’s rich past, which includes appearances from General George Washington and several military fortifications—one of which can still be visited today. Tags: History Park History How Central Park Was Designed as a Park for the People When Frederick Law Olmsted and Calvert Vaux were chosen to plan the new park, they set out to create a space designed to bring all people together regardless of their backgrounds. Tags: Park Design / History Read more about Central Park History Researching Central Park The Central Park Research Guide provides visitors, students, teachers, and scholars with resources and information about Central Park and the Conservancy. The Fall Countdown Is On And we've got all you need for Central Park's most magical season. Sign up to get your free Fall Guide today, with our official Foliage Tracker, favorite seasonal activities, and much more. Email Address Get Your Fall Guide This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Get the latest from the Park, direct to your inbox. Email Address This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Central Park Conservancy 717 Fifth Avenue New York, NY 10022 212.310.6600 The Central Park Conservancy is a private, not-for-profit organization, and is tax exempt under Section 501(c)(3) of the Internal Revenue Code. Federal EIN (tax ID) number 13-3022855. Privacy Policy Governance Central Park Conservancy Central Park tiktok account Central Park youtube account Central Park facebook account Central Park instagram account Central Park twitter account Central Park pinterest account Top Central Park Conservancy"
    },
    {
      "url": "https://www.thisistheplace.org/general-info/contact-us/",
      "text": "Contact Us | This Is The Place Heritage Park Annual Pass Menu Annual Pass Menu Connect With Us Contact us via the form below and our team will respond within 48 hours. Support Form (#8) Contact First Name Last Name Email Department - Select Department - Dining Events Media / Press General Admission Weddings Corporate Groups Phone/Mobile Subject Description Submit Form Contact Info customerservice@thisistheplace.org 801-582-1847 Address 2601 E. Sunnyside Avenue Salt Lake City, Utah 84108 THIS IS THE PLACE VISIT TODAY! 2601 EAST SUNNYSIDE AVENUE, SALT LAKE CITY, UT, 84108 801-582-1847 cservice@thisistheplace.org Press Inquiries: Tresha Kramer- tkramer@thisistheplace.org Footer Subscription Form Newsletter Subscribe Follow Us About Hours & Admission Contact Us Terms & Conditions Blog Home Today’s Fun Summer Season Winter Season Plan Your Visit Activities Bonus Events Utah Trail Rides Childrens Parties Pioneer Trades Shopping Gift Shop Food Brigham’s Donuts Huntsman Grill General Info Hours & Admission Annual Pass Contact Us About Directions Partners & Sponsors Support The Park Heritage Village The Village The Pioneer Center Monuments Pioneers of 1847 Monument Statuary Walk The Mormon Battalion National Pony Express Walk of Pioneer Faiths Pioneer Children’s Memorial Building Rentals Weddings & Receptions Corporate Events Family Reunions Pricing Catering Bartenders Buildings The Garden Place Rental Pine Valley Chapel Rental Atkin Home Rental Brigham Young Farmhouse Kimball Home Rental Pioneer Center Rental Pack Home Rental Plaza Rental Ottinger Hall Rental Pioneer Pavilion Rental Emigration Room at the Pioneer Center Miller Pavilion Rental Education School Field Trips Blog"
    },
    {
      "url": "https://www.quora.com/Who-is-the-owner-of-Central-Park-in-New-York-Why-is-it-considered-to-belong-to-no-one-in-particular",
      "text": "Who is the owner of Central Park in New York? Why is it considered to belong to no one in particular? - Quora Something went wrong. Wait a moment and try again. Try again Please enable Javascript and refresh the page to continue"
    },
    {
      "url": "https://www.centralpark.com/visitor-info/park-contact-numbers/",
      "text": "Central Park Contact Numbers Skip to main content Search Newsletter Photos News Blog FAQ facebook twitter pinterest instagram Map It Home Visit Maps, Directions & Parking Restrooms Food & Drink Visitor Centers Resources & Organizations Park History Regulations & Safety Park Contact Numbers FAQ Parking Garage Discounts Things To Do Tours Activities Attractions Events Ice Skating Concerts Central Park Zoo Sports Yoga & Fitness Classes Where to Stay Event Calendar Tours Horse & Carriage Tours Bike Rentals Bike Tours E-Scooter Rentals E-Scooter Tours Walking Tours Pedicab Tours Running & Fitness Tours Gift Certificates & Gift Cards Weddings Ceremonies Proposals Elopements Receptions Engagement Photos FAQ Picnics & Events Picnic Experiences Team Building Events Picnics To Go Romantic Picnics Kids' Birthday Party Kids' Carousel Party Picnic Wedding Receptions Scavenger Hunt Party Picnic Gifts & Gift Cards Maps, Directions & Parking Restrooms Food & Drink Visitor Centers Resources & Organizations Park History Regulations & Safety Park Contact Numbers FAQ Parking Garage Discounts Home Visit Central Park Contact Numbers Central Park Contact Numbers RSS Print Below is a list of phone numbers for organizations located inside of Central Park. You can also visit our FAQ page for more information. General Numbers Central Park Conservancy (212) 310-6600 (general) | Monday – Friday, 9:00 am – 5:00 pm\r\n (212) 310-6672 (membership) Adopt-A-Bench (adopt-a-bench program) Parks Enforcement Patrol (212) 274-4560 Central Park Medical Unit (212) 585-0911 Central Park Police (212) 570-4820 Central Park Zoo (212) 439-6500 (general info)\r\n (800) 433-4149 (ticket sales) Volunteer Hotline (212) 360-2751\r\n volunteer@centralparknyc.org Ballfield Permits (212) 408-0234 Special Event Permits (212) 408-0226 NYC Parks Department 311 (or 212-NEW-YORK) Carousel (212) 452-0707 Visitor Centers Belvedere Castle (332) 213-3947 Charles A. Dana Discovery Center (332) 240-3256 Dairy Visitor Center and Gift Shop (332) 245-3021 Tavern on the Green (212) 877-TOTG (8684) Chess & Checkers House (currently closed) Columbus Circle Info Kiosk (332) 240-3609 Back to Search Results When are you planning your visit to New York City? Check-in date Month Day 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Check-out date Month Day 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Visitor Info Map Directions Parking Restrooms Park Contact Info Newsletter Most Popular Strawberry Fields Central Park Zoo Ice Skating Horse & Carriage Rides Bike Rentals Yoga Classes About Us Terms of Use Privacy Policy Site Map Links Advertising Contact Us Follow Us Facebook Twitter Instagram Pinterest Newsletter Copyright © 2004 - 2025 Greensward Group, LLC. All rights reserved. Built with Metro Publisher™"
    },
    {
      "url": "https://www.centralparknyc.org/contact-us",
      "text": "Contact Us | Central Park Conservancy High contrast Default colors Email Signup Join/Renew Central Park Conservancy Visit Map Things To Do About Us Support Magazine Shop Search Open the Navigation Menu Central Park Conservancy Visit Map Things To Do About Us Support Magazine Shop Search Close the Navigation Menu Central Park is located in New York City, and stretches from 59th Street to 110th Street, between Fifth Avenue and Central Park West. Plan Your Visit Visitor Centers Restrooms Alerts and Closures Help Center Popular Places To See Park Tours Central Park Shop Davis Center Search Park Features Landscapes & Points of Interest Playgrounds Woodlands Architectural Features Bridges & Arches Statues & Ornamental Features Water Bodies Quiet Zones Activities & Amenities Restrooms Visitor Information Recreation & Cultural Facilities Central Park Shop Dining Downloadable Maps Area North Mid-Park South In the Park? Find locations near you 66° F Park Hours 6:00 am – 1:00 am Browse all Search - Calendar Activities & Guides Tours Events Interest Kids & Families Staff Picks Digital Guide Bloom & Tree Guide Official Central Park Tours Our Work Leadership Restoration Park History Sustainability Women's Committee Five Borough Program Jobs Newsroom Contact The Davis Center The Park Needs Us Donate Become a Member Give Monthly Tribute Giving Gift Membership Create a Fundraiser Adopt-A-Bench Donate Flowers Adopt-A-Tree Dedicate a Paving Stone Corporate Programs Planned Giving Benefit Events Volunteer Other Ways to Give Help the Central Park Conservancy keep the Park beautiful and vibrant by making a gift today. $100 $200 $500 $1,000 Other Amount Topics About the Conservancy Health and Fitness Park History Park Information Plants and Trees Programs and Events Q&As Restoration and Maintenance Things to See and Do Tips for Visiting Wildlife – Browse all How Contemporary Art and Literature Are Reviving Seneca Village June 17, 2025 Explore recent books and artwork inspired by Seneca Village—and why the community’s story resonates with artists today. Visit ${scope.openAccordionSection == 'visit' ? 'Collapse' : 'Expand'} the Visit Menu Plan Your Visit Visitor Centers Restrooms Alerts and Closures Help Center Places To See Park Tours Central Park Shop Davis Center Map Search Park Features Landscapes & Points of Interest Playgrounds Woodlands Architectural Features Bridges & Arches Statues & Ornamental Features Water Bodies Quiet Zones Activities & Amenities Restrooms Visitor Information Recreation & Cultural Facilities Central Park Shop Dining Downloadable Maps Area North Mid-Park South Things to do ${scope.openAccordionSection =='things-to-do' ? 'Collapse' : 'Expand'} the Things to Do Menu 66° F Park Hours 6:00 am – 1:00 am Browse all Search Calendar Activities & Guides Tours Events Interest Kids & Families Staff Picks Digital Guide Bloom & Tree Guide About Us ${scope.openAccordionSection =='about-us' ? 'Collapse' : 'Expand'} the About Us Menu Our Work Leadership Restoration Park History Sustainability Women's Committee Five Borough Program Jobs Newsroom Contact Support ${scope.openAccordionSection =='support' ? 'Collapse' : 'Expand'} the Support Menu Donate Become a Member Give Monthly Tribute Giving Gift Membership Create a Fundraiser Adopt-A-Bench Donate Flowers Adopt-A-Tree Dedicate a Paving Stone Corporate Programs Planned Giving Benefit Events Volunteer Other Ways to Give $100 $200 $500 $1,000 Other Amount Magazine ${scope.openAccordionSection =='articles' ? 'Collapse' : 'Expand'} the Magazine Menu About the Conservancy Health and Fitness Park History Park Information Plants and Trees Programs and Events Q&As Restoration and Maintenance Things to See and Do Tips for Visiting Wildlife – Browse all Shop Join/Renew High contrast Default colors Email Signup See all alerts 66°\n\t\t\t\t\t\t\t\t\tF Park map Contact Us Have a question? Find the answer below. You can also review our Help Center or use the search bar at the top of the page. General Inquiries Central Park Conservancy, 717 Fifth Avenue, New York, NY, 10022 212.310.6600 | Monday – Friday, 9:00 am – 5:00 pm Membership [email protected] 212.310.6672 Press Inquiries [email protected] 212.446.2241 Women's Committee [email protected] 212.310.6675 Adopt-A-Bench [email protected] Tulips and Daffodils Program [email protected] 212.310.6668 Send Us a Message First Name Last Name Email Message Receive updates regarding Central Park and the Conservancy. Submit This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. The Fall Countdown Is On And we've got all you need for Central Park's most magical season. Sign up to get your free Fall Guide today, with our official Foliage Tracker, favorite seasonal activities, and much more. Email Address Get Your Fall Guide This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Get the latest from the Park, direct to your inbox. Email Address This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Central Park Conservancy 717 Fifth Avenue New York, NY 10022 212.310.6600 The Central Park Conservancy is a private, not-for-profit organization, and is tax exempt under Section 501(c)(3) of the Internal Revenue Code. Federal EIN (tax ID) number 13-3022855. Privacy Policy Governance Central Park Conservancy Central Park tiktok account Central Park youtube account Central Park facebook account Central Park instagram account Central Park twitter account Central Park pinterest account Top Central Park Conservancy"
    },
    {
      "url": "https://www.mywinterhaven.com/342/Building-Permits-Licenses",
      "text": "Building Permits & Licenses | Winter Haven, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Residents Business How Do I... Search Home Departments Economic Opportunity & Community Investment Building Permits & Licenses Building Permits & Licenses Contractor Registration Please send one email with all the required documents to: ContractorRegistration@mywinterhaven.com You will receive a confirmation when the registration has been completed. New registrations should be completed in less than 3 business days. Updated license and insurance certificates can also be sent to this email. Contractor Registration Requirements (PDF) Building Permit Portals Access the Esuite Portal for: Public Building Permit Information Search Contractor Account / Inspection Results / View Fees Esuite Portal Access the Eplans Portal for: Online Building Permits Applications Plan Review and Application Status Downloading Approved Permit Documents Eplans / Projectdox Portal Business Tax Receipts The Building Division issues Business Tax Receipts to all businesses and organizations within the city limits of Winter Haven. The Business Tax Receipt renewal fees are due October 1st every year. Prior to starting a Business please check the following: Zoning Requirements Fire Protection Requirements License / Certification Requirements Please complete the application and submit it with all the supporting documents to the Business Tax Specialist. Business Tax Receipt Checklist and Application (PDF) Peddlers Business Tax Receipt Application (PDF) References for Business Polk County Business Tax Receipts Florida Division of Alcoholic Beverages and Tobacco Florida Department of Business and Professional Regulation Florida Division of Corporations Florida Division of Hotels and Restaurants (Food Service) Building Permit Inspection Requests Email BuildingInspections@myWinterHaven.com and supply the following information in the BODY of the email: Permit Number (Starts with the year) i.e. 25- Site Address Type of Inspection Contact Number Date of inspection if not for the next day Gate Codes Requests must be made by 7 am for same day inspections. For Fire Inspections, please allow 48 hours for inspection to be scheduled. An inspection can also be requested by calling 863-298-7598 and leaving a voicemail. All required documentation (approved plans, truss engineering, permit placard, etc.) must be on the job site, accessible to the inspector, and protected from the weather. Any deviation may result in work delays and/or re-inspection fees imposed. Information for Private Providers For new projects please submit documents with the permit application or to the Permit Specialists. Email Inspection Reports and The Final Certificate of Compliance . Final Affidavit for Building Code Inspection Services (PDF) Final Affidavit re Duly Authorized Rep. and Employment (PDF) Registration Submittal Packet (PDF) Notice to Building Official (PDF) Plan Compliance Affidavit (PDF) Residential Certificate of Occupancy Request Request certificates of occupancy for new single family homes by submitting this form. Instructions are included on the form. For non-residential projects please contact our office staff. Residential Certificate of Occupancy Request Form Building Division Forms and Applications Building Permit Application (PDF) Residential Impact Fee Guide Demolition Permit Application (PDF) Dock Requirements Driveway Connection Approval Application Notice of Commencement Owner Disclosure Statement Re-Roof Affidavit Residential Swimming Pool Safety Requirements (PDF) Schedule of Permit Fees (PDF) Sign Permit Requirements (PDF) Submittal Requirements (PDF) Tent Application (PDF) References Building Officials Association of Florida Florida Building Code Information System - BCIS Florida Building ICC International Code Council Florida Department of Motor Vehicles Florida Water Star Program Criteria Contact Us Building & Permitting Division Physical Address 490 Third Street NW Winter Haven , FL 33881 Phone: 863-291-5695 Fax: 863-298-7856 Brian Wells Building Official bwells@mywinterhaven.com Phone: 863-291-5695 Ext. 6306 Kyle Peth Building Department Assistant kpeth@mywinterhaven.com Phone: 863-291-5695 Ext. 6311 Pat Johnson Certified Business Tax & Permit Specialist pjohnson@mywinterhaven.com Phone: 863-291-5695 Ext. 6411 Bob Lane Building Inspector blane@mywinterhaven.com Phone: 863-291-5695 Ext. 6304 David Mahalik Building Inspector dmahalik@mywinterhaven.com Phone: 863-291-5695 Ext. 6303 Brandon Borga Deputy Building Official bborga@mywinterhaven.com Phone: 863-291-5695 Ext. 6302 Jim Legee Building Inspector jlegee@mywinterhaven.com Phone: 863-291-5695 Ext. 6301 Bobby  Wells Building Inspector rwells@mywinterhaven.com Phone: 863-291-5695 Ext. 6311 Jason  Montgomery Fire Plans Examiner and Field Inspector jmontgomery@mywinterhaven.com Phone: 863-291-5695 Ext. 6309 Felicia Nouami Permit Specialist fnouami@mywinterhaven.com Phone: 863-291-5850 Ramon Fernandez Permit Specialist rfernandez@mywinterhaven.com Phone: 863-291-5695 Ext. 6305 Jessica Hart Staff Assistant I jhart@mywinterhaven.com Phone: 863-291-5695 Ext. 6308 Building Permit & Inspection Utilization Report Quickly Find What You Are Looking For Popular Links Job Openings Report an Issue Start/Stop Water Public Notices Pay Utility Bill Public Records Request Solid Waste Information Building Permits /QuickLinks.aspx Exceptionally Local Contact Us Winter Haven City Hall 451 Third Street NW Winter Haven, FL 33881 Phone: 863-291-5600 Report a Concern Staff Directory Quick Links Bid Postings Job Openings Brand Guidelines Events News FAQs /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.mywinterhaven.com/157/City-Managers-Office",
      "text": "City Manager’s Office | Winter Haven, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Residents Business How Do I... Search Home Departments City Manager’s Office City Manager’s Office Dear Residents, Visitors, and Business Owners, On behalf of our elected officials and employees, I would like to welcome you to the City of Winter Haven Website. Our dependable and dedicated workforce provides you with beautiful parks and public spaces; unique events and leisure opportunities; and quality customer service that will keep you coming back, or hopefully staying for a lifetime. We are proud to serve more than 55,000 people who call this extraordinary place home. While exploring the City, you will find 50 lakes inside the City limits (many connected by navigable waterways locals call the \"Chain of Lakes\"), beautiful public spaces, great restaurants, and plenty to do with more than 150 annual special events. The pedestrian-friendly downtown hosts unique shops, one-of-a-kind restaurants, a tech-savvy public Library, a beautiful multi-block park system, and a healthy business district. We believe Winter Haven's unique quality of life provides our residents with numerous Exceptionally Local experiences and we invite everyone to see why. We are energized by the many exciting projects and transformations happening today, and we are planning for our future as we continue to improve upon our unique and exceptional community. This includes innovative economic development and growth; serving as the home to the internationally known LEGOLAND Florida Resorts; partnerships and collaborations to constantly improve; an engaged and involved community; and improvements to public facilities and infrastructure. These initiatives are all significant, but it's the business of people that matters most. We are extremely attentive to the value of great service and how essential it is to our success. Our goal in Winter Haven as we meet customer expectations is to \"Get to yes.\" To do this we encourage a culture of listening to customers and developing approaches to steer towards a satisfactory outcome. We believe customer service is paramount and sets us apart from other cities. We encourage you to explore the possibilities of Winter Haven and enjoy the special and unique quality of life only found in this Chain of Lakes City. If you are new to the area, thinking of relocating to Winter Haven as either a homeowner or a business owner, or just looking to get more information, please contact us. And, thanks again for visiting our website. News from the City Manager's Office Winter Haven Leaders Advocate in Washington for Safer Skies Over City’s Growing Airport City leaders visited Washington, D.C. to advocate for a dedicated FAA frequency at KGIF and federal support for key road projects. These efforts reflect Winter Haven’s focus on safety and infrastructure. Read on... City of Winter Haven Unveils Ambitious FY25-FY29 Strategic Plan This comprehensive plan, developed over 18 months through rigorous public engagement, data analysis, and strategic visioning, sets a clear and ambitious course for the City's future. Read on... A Greener, Healthier Future for Central Park Big changes are underway at Central Park! We’re replacing the lawn, enhancing the tree canopy, and planting 2 trees for every 1 removed. It may not look pretty now—but this fall, it’ll be better than ever. Chain of Lakes Park Upgrades: More Than Just Baseball — A Community Investment for All Winter Haven, FL – The City of Winter Haven is revitalizing Chain of Lakes Park, creating a space that benefits residents — not just out-of-town athletes. Read on... Winter Haven’s City Manager, T. Michael Stavres, Receives 2024 Banker’s Cup Man of the Year Award We are proud to announce that Winter Haven City Manager, T. Michael Stavres, has been honored with the 2024 Banker’s Cup Man of the Year Award—Winter Haven’s highest recognition for a citizen’s lasting contributions to the community. Read on... The City of Winter Haven Manages Growth through a Comprehensive, Transparent Process The City team diligently operates within the boundaries set by the Florida Growth Management Laws, the Winter Haven Comprehensive Plan, the Winter Haven Land Development Code, and all Concurrency Regulations. Read on... View All News /CivicAlerts.aspx Calendar September 2025 Sun Mon Tue Wed Thu Fri Sat 31 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 1 2 3 4 Thu, Sep. 11 Lakes Advisory Committee Meeting Thu, Sep. 11 Honoring Our Heroes - Remembering the Day Tue, Sep. 16 Florence Villa Advisory Committee Wed, Sep. 17 SUNSET Kayak Eco Tour - Lake Silver Thu, Sep. 18 Code Compliance Special Magistrate Hearing Mon, Sep. 22 City Commission Meeting View All Events /Calendar.aspx Contact Us City Manager’s Office Physical Address 451 Third Street NW Winter Haven , FL 33881 Phone: 863-291-5600 T. Michael Stavres City Manager mstavres@mywinterhaven.com Phone: 863-291-5600 MJ Carnevale Deputy City Manager MCarnevale@mywinterhaven.com Phone: 863-291-5600 Amanda Jo Nicholson Assistant to the City Manager anicholson@mywinterhaven.com Phone: 863-291-5600 Our Mission Enriching lifestyle through exceptional service. Our Vision To be the best City through relentless pursuit of excellence. Our Values Integrity / Respect Financial Stewardship Inclusive Visionary Exceptional Service City of Winter Haven Strategic Plan Public Affairs & Communication City University Grant & Aid Program for Not-For-Profit Agencies Transparency Access Winter Haven report a concern, request service Advance Winter Haven Track Capital Projects with our Project Hub Job Openings SEE & SUBSCRIBE TO OPPORTUNITIES Careers EXPLORE BENEFITS & MORE Public Safety App Download the app to connect Quickly Find What You Are Looking For Popular Links Job Openings Report an Issue Start/Stop Water Public Notices Pay Utility Bill Public Records Request Solid Waste Information Building Permits /QuickLinks.aspx Exceptionally Local Contact Us Winter Haven City Hall 451 Third Street NW Winter Haven, FL 33881 Phone: 863-291-5600 Report a Concern Staff Directory Quick Links Bid Postings Job Openings Brand Guidelines Events News FAQs /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.mywinterhaven.com/199/Water-Department",
      "text": "Water Department | Winter Haven, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Residents Business How Do I... Search Home Departments Water Department Water Department Sustainable, Quality, Friendly Service Committed to public service, our team strives to understand your needs, deliver friendly assistance, and make your experience with us a simple one. We work to provide exceptional water supply and treatment services to ensure the health and safety of our residents and the sustainability of our essential resources. Winter Haven One Water One Water means valuing all water through a collaborative and integrated systems approach to managing all fresh and brackish surface and groundwater, stormwater, wastewater, and recycled water in a holistic and sustainable manner that maintains ecosystems while providing reliable and resilient water resources that support economic, environmental, and public benefits. Learn more about Winter Haven One Water on our One Water website . Alerts There are no alerts at this time. After Hours Water or Sewer Emergency Phone Number If you are experiencing an after hours water or sewer emergency, call our on-call water and sewer team at 863-291-5853 for urgent water utility needs outside of business hours. About the Water Department Winter Haven Water has nine divisions; Administration, Water Treatment Facilities, Wastewater Treatment Facilities, Reuse Distribution, Engineering, Utility Maintenance, Lift Stations, Customer Service, and Meter Services. Learn More Rates & Fees Discover more information about water, irrigation, and sewer rates. Click Here Service  Map View the utility service area map. Click Here Water Conservation Winter Haven Water offers a tool kit full of programs, incentives, and rebates to help you save money and water! Learn More Quick Links Water Rates & Fees Water Conservation Water Service Map Customer Service Start, Stop, or Move Water Service Water Account Payments Water FAQ's View All Quick Links /QuickLinks.aspx Contact Us Water Department Physical Address 401 6th Street SW Winter Haven , FL 33880 Phone: 863-291-5853 Emergency Phone: 863-291-5853 Gary Hubbard Water Department Director ghubbard@mywinterhaven.com Phone: 863-291-5853, ext. 3101 Mark Bombard Winter Haven Water Department Assistant Director mbombard@mywinterhaven.com Phone: 863-291-5853, ext. 3110 Amanda Wisham Customer Service Manager awisham@mywinterhaven.com Phone: 863-291-5678 About Water Department Career Opportunities Cross Connection Control Meter Services Maintenance Reuse Water Program Wastewater Collections Wastewater Treatment Plants Water Plants Customer Service FAQs Other Local Services Start, Stop, / Move Services Winter Haven Water Customer Service Payments Customer Service Rates & Fees Service Map Water Conservation Winter Haven Water Conservation Rebates & Programs Smart Irrigation Controller WaterSense Toilet Rebate Water Conservation Kit Wireless Rain Sensor Lead Service Line Replacement Program H2O App Download the app to Manage Your Water Account Access Winter Haven report a concern, request service Quickly Find What You Are Looking For Popular Links Job Openings Report an Issue Start/Stop Water Public Notices Pay Utility Bill Public Records Request Solid Waste Information Building Permits /QuickLinks.aspx Exceptionally Local Contact Us Winter Haven City Hall 451 Third Street NW Winter Haven, FL 33881 Phone: 863-291-5600 Report a Concern Staff Directory Quick Links Bid Postings Job Openings Brand Guidelines Events News FAQs /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.mywinterhaven.com/226/Customer-Service",
      "text": "Customer Service  | Winter Haven, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Residents Business How Do I... Search Home Departments Water Department About Customer Service Customer Service What We Do The Winter Haven Water Customer Service encompasses a multitude of responsibilities: Send monthly bills that include water, sewer, garbage, and stormwater charges to an average of 36,000 customers. Coordinate the discontinuation of service based on failure to pay paired with reactivating services once payment is received. Assist customers in establishing and closing utility accounts; over the phone, in person, and electronically. We manage over 40,000 service orders per year. Service orders for field work include troubleshooting water usage concerns, utilizing data-logging technology for authentic data and usage, meter malfunction repairs/replacements, and requests for service connection/ disconnection at locations. Provide general customer service relations and evaluate and address customer account concerns and inquiries in person and over the phone. Please note : For Billing and Service Related Questions check out the Billing and Service Questions on our FAQ page . Contact Us Customer Service Email Customer Service Physical Address 551 Third Street NW Winter Haven , FL 33881 Phone: 863-291-5678 Fax: 863-298-7870 Amanda Wisham Customer Service Manager awisham@mywinterhaven.com Phone: 863-291-5678 Kyle Reeves Assistant Customer Service Manager kreeves@mywinterhaven.com Phone: 863-291-5678 FAQs Other Local Services Start, Stop, / Move Services Winter Haven Water Customer Service Payments H2O App Download the app to Manage Your Water Account Access Winter Haven report a concern, request service Quickly Find What You Are Looking For Popular Links Job Openings Report an Issue Start/Stop Water Public Notices Pay Utility Bill Public Records Request Solid Waste Information Building Permits /QuickLinks.aspx Exceptionally Local Contact Us Winter Haven City Hall 451 Third Street NW Winter Haven, FL 33881 Phone: 863-291-5600 Report a Concern Staff Directory Quick Links Bid Postings Job Openings Brand Guidelines Events News FAQs /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.mywinterhaven.com/272/Athletics",
      "text": "Athletics | Winter Haven, FL Skip to Main Content Create a Website Account - Manage notification subscriptions, save form progress and more. Website Sign In Government Departments Residents Business How Do I... Search Home Departments Parks, Recreation, & Culture Programs Athletics Athletics The Parks, Recreation, and Culture Athletics unit is responsible for developing and implementing youth and adult athletic programs, coordinating tournaments and competitions, and serving as a liaison with area youth sports leagues. Aquatics Information Tennis Information Adult Leagues & Activities Adult Softball League Registration begins at 5:30 pm on a first-come, first-served basis. League fees are due at registration. Call Athletics for more information. Location : Diamond Plex Contact Number: 863-298-7687 League Fees : $450 per team (10 game season) Divisions : Men's Church, Lower and Upper Men's, and Lower Co-ed Senior Softball Senior softball is played throughout the year on Tuesdays and Fridays. Players need to arrive by 8:30 am. Location : Diamond Plex Contact Name : Don Witmer Contact Number : 863-860-5381 Fee : $40 annually Ages : 55 and older Adult Kickball Kickball is offered throughout the year. Call for more information Athletics for more information. Location : Diamond Plex Fee : $250 per team Winter Haven Horseshoe Club Location : Rotary Park Contact Name : Joe West Contact Number : 863-422-2053 Outdoor - Youth Sports Leagues Greater Winter Haven Youth Baseball (GWHYB) GWHYB has a Fall and Spring season each year. Therefore, onsite registration assistance is available by appointment only. Please email us to make an appointment. Location : Sertoma Park Contact Email : GWHYB's email Ages : 5 to 15 years old Fees : Varies by season/division Website : WH Youth Baseball Facebook page Miss Winter Haven Softball Location : January Phyl Village Park Contact Name : John Surrency Contact Number : 863-258-5179 Website : Miss WH Softball WH Wolverines Dixie Youth Baseball / Softball League Location : Winter Haven Recreational and Cultural Center Contact Name : Bernita Riley Contact Number: 863-287-3122 Youth Soccer \"WHYSA\" Winter Haven Youth Soccer Association (WHYSA) offers multiple soccer seasons at various skill levels, from recreational to competitive. Location : Simmers-Young Park Contact Email: Email the WHYSA : Ages : U5 - U14 Fee : $80 (includes jersey, shorts, and socks) Website : WHYSA Winter Haven Youth Football Stay tuned for upcoming registration. Location : Sertoma Park Contact Name : TBA Contact Number : TBA Winter Haven Wolverines Mid Fla Football Location : Winter Haven Recreational and Cultural Center Contact Name : Bernita Riley Contact Number : 863-287-3122 Indoor - Youth Sports Leagues Youth Basketball \"Hoops Haven\" Location : AdventHealth Fieldhouse \"East Entry 3\" (210 Cypress Gardens Boulevard) Contact Name : Frances Woodside Contact Number : 863-667-8736 *Text preferred. Ages : Boys and girls 6 to 12 Fee : $60 Information: Spring Training will be 6 weeks long. Starting Tuesday March 15, 2024 from 5-7:30 pm. Players will participate in one hour of player development with our amazing coaches and an additional hour of games twice a week. Youth Volleyball \"Warrior Athletics\" Location : AdventHealth Fieldhouse \"East Entry 3\" (210 Cypress Gardens Boulevard) Contact Name : Emma Rush Contact Number : 863-640-0670 Contact Email: warriorathelticsvball@gmail.com Website: Warrior Athletics Recreation Program: Starts on April 21, 2025 and ends on May 24 , 2025, program will be on Mondays and Wednesdays from 5:30 pm to 7:30 pm, visit the Warrior Athletics website for Registration Link! Registration closes April 20, 2025. Information: Mini Club, Club Volleyball, Clinics and Camps, Recreational programs, and more can be found on our website, Facebook (Warrior Athletics, LLC), and Instagram (warriorathleticsvball). Contact Us Parks, Recreation & Culture Physical Address 500 Third Street NW Winter Haven , FL 33881 Phone: 863-291-5656 Ext. 5000 Julie Adams Parks, Recreation & Culture Director jadams@mywinterhaven.com Phone: 863-291-5656 More Information Scott Eilers, CYSA, CPM Assistant Director for Parks, Recreation & Culture seilers@mywinterhaven.com Phone: 863-291-5656, ext. 5116 More Information Aquatics About Our Swim Lesson Program 2026 Swim Lessons Training Aqua Zumba Athletics Pickleball Summer Camp Tennis Center Quickly Find What You Are Looking For Popular Links Job Openings Report an Issue Start/Stop Water Public Notices Pay Utility Bill Public Records Request Solid Waste Information Building Permits /QuickLinks.aspx Exceptionally Local Contact Us Winter Haven City Hall 451 Third Street NW Winter Haven, FL 33881 Phone: 863-291-5600 Report a Concern Staff Directory Quick Links Bid Postings Job Openings Brand Guidelines Events News FAQs /QuickLinks.aspx Site Links Home Site Map Contact Us Accessibility Copyright Notices Privacy Policy /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    }
  ]
}