{
  "fuentes": [
    {
      "url": "https://nancy305.com/about/",
      "email": "info@nancy305.com"
    },
    {
      "url": "https://nancy305.com/menus/",
      "email": "info@nancy305.com"
    },
    {
      "url": "https://nancy305.com/accessibility/",
      "email": "info@nancy305.com"
    },
    {
      "url": "https://nancy305.com/accessibility/",
      "email": "lizz@nancy305.com"
    },
    {
      "url": "https://www.nancyforcos.org/about-nancy",
      "email": "nancy.henjum@coloradosprings.gov"
    },
    {
      "url": "https://nancy305.com/events/",
      "email": "info@nancy305.com"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "email": "enquiries@mnsi.org.uk"
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "email": "sales@finewineliquors.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://nancy305.com/",
      "email": "info@nancy305.com"
    },
    {
      "url": "https://artistandfan.com/venues/venues/view/bar-nancy",
      "email": "lizz@nancy305.com"
    },
    {
      "url": "https://nancy305.com/contact-us/",
      "email": "info@nancy305.com"
    },
    {
      "url": "https://www.nancyhands.ie/about-us",
      "email": "info@nancyhands.ie"
    }
  ],
  "mails": [
    "enquiries@mnsi.org.uk",
    "info@nancy305.com",
    "info@nancyhands.ie",
    "info@reception-plus.de",
    "lizz@nancy305.com",
    "nancy.henjum@coloradosprings.gov",
    "sales@finewineliquors.com"
  ],
  "nombre_sitio": "nancy305.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://nancy305.com/about/",
      "text": "About - Nancy Bar Home About Menu Drinks Menus Blog Events Contact Select Page Our History & Crew Bar Nancy. Created with the dream of making a great neighborhood bar. Nancy, espouses Revolutionary Zeal in her no-nonsense approach to hospitality. Seize the Night. Founders Ben Katie Tom Sasha Lizz Fun Facts The Courtyard is a place where passengers disembark to relax and unwind in a zen tiki experience. The port hole that now leads travelers to The Courtyard in Nancy’s back patio once was part of a respectable sailing vessel. Nancy loves live music just as much as she loves her cocktails. Nancy is parked on Calle Ocho, Little Havana Nancy is made up of some great people.. Hours of Operation Monday: Closed Tuesday, Wednesday, Thursday & Sunday 8pm-2am Friday and Saturday 7pm-3am 2007 SW 8th St, Miami, FL 33135 Info@Nancy305.com Get in touch Name Phone Email Address Message Submit Home About Menu Blog Store Twitter Facebook Instagram Accessibility Terms of Service Privacy Policy NANCY BAR © 2017. ALL RIGHTS RESERVED. Design by Pixel Bros. X Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://nancy305.com/menus/",
      "text": "Menus - Nancy Bar Home About Menu Drinks Menus Blog Events Contact Select Page Fresh. Pure. Darn Good Cocktails & Expressions POSTCARD PILS Pilsner Green Bench Brewery (St. Pete, FL) TAMPA STYLE LAGER Lager Cigar City Brewing (Tampa, FL) REEF DONKEY APA American Pale Ale ampa Bay Brewing Company (Tampa, FL) SEAQUENCH ALE Session Sour Dogfish Head Craft Brewing (Milton, DE)­ CARAMEL CREAM ALE Cream Ale Due South Brewing Company  (Boynton Beach, FL) ALL DAY IPA IPA Founders Brewing Co.  (Grand Rapids, FL) GOOSE ISLAND IPA IPA U.S.A HENNEPIN FARMHO– USE ALE Belgian Saison Brewery Ommegang (Cooperstown, NY) FULL SAIL PILSNER Pilsner Full Sail Brewing Co.  (Hoodriver, Oregon) REKORDERLIG PASSIONFRUIT CIDER Cider Abro Bryggeri SIERRA NEVADA KELLERWEIS Hefeweizen Sierra Nevada Brewing Co. MODELO ESPECIAL Lager Nava, Mexico RED STRIPE Pale Lager Desnoes & Geddes Limited HOEGAARDEN Wit Blanche Begium STELLA ARTOIS DRAFT Lager Belgium GUINESS EXTRA STOUT DRAFT Irish Dry Stout Guiness Ltd.  (Dublin, Ireland) EXPOSITION Winter, 1775, has the New World living under foreign occupation. NANCY, a newly built brigantine supply ship, makes her maiden voyage out of Wilmington, Delaware. DUTCH COURAGE Bols Barrel Aged Genever, Chocolate Bitters, Egg White, Lavender, Orange, Lemon SKIPPER’S DAUGHTER Ketel One, Aperol, Barrow’s Ginger Liquor, Poema Rose Cava, Orange STEM TO STERN Apricot Infused Bulleit Rye , Lemon, Apricot Jam, Ginger Ale SQUARE GROUPER Rittenhouse Rye, Courvoisier V.S, Montenegro, Benedictine, Mole Bitters ~On Tap INCITING INCIDENT Crisis…March of 1776, Nancy formerly commits to the growing American Revolution. The brig careens through enemy waters carrying arms and munitions to the American liberation effort. DONKEY PUNCH Russian Standard, Hibiscus, Q Drinks Ginger Beer, Lime, Mint 3-POUNDER GUNS Appleton Signature Blend, Cynar 70 Proof, Disaronno Amaretto, Mole Bitters SMILE YOU SON OF A BITCH Dulce Vida 100 proof & Casa Noble, Mango, Blackberry Shrub. MUTINY MILK PUNCH Diplomatico Reserva, Four Roses, Mallow Root, Cocoa, Lemon WALK THE PLANK Montelobos, St. Germaine, Yellow Chartreuse, Lime, Cucumber DENOUEMENT The summer of 1776 has Captain Hugh Montgomery in St. Thomas. While at port, word arrives that victory is near. The Captain orders Nancy hoists the first American Flag while at a foreign port. ABIGAIL ADAMS Ford’s Gin, Giffard Crème de Peche, Lemon, Strawberry, Cucumber, Soda BANANA CANNON Monkey Shoulder, Cinnamon Walnut Orgeat, Giffard Banana, Lemon CHAMPAGNE GANCIA CANELLI PROSECCO (Veneto, Italy) POEMA ROSE (Cava, Spain) TAITTINGER CHAMPAGNE (Champagne, France) “Before Democracy, there were spirits, and from spirits we created taverns. It was in those taverns that we laid out the blueprint for a new kind of country, with a new kind of ideology, not ruled by kings and queens but by men and women. In other words, we got drunk and invented America.” – Steven Grasse WINE/ROSE MONTES SAUVIGNON BLANC (Leyda, Chile) SEA GLASS CHARDONNAY (California) JULIETTE ROSE (California) NANCY is more than a name or a location. She aims to stand for humility, quality, and perseverance. She is the product of many voices that comprise one song, called NANCY. Our ode to The American Spirit. Hours of Operation Monday: Closed Tuesday, Wednesday, Thursday & Sunday 8pm-2am Friday and Saturday 7pm-3am 2007 SW 8th St, Miami, FL 33135 Info@Nancy305.com Get in touch Name Phone Email Address Message Submit Home About Menu Blog Store Twitter Facebook Instagram Accessibility Terms of Service Privacy Policy NANCY BAR © 2017. ALL RIGHTS RESERVED. Design by Pixel Bros. X Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://nancy305.com/accessibility/",
      "text": "Accessibility - Nancy Bar Home About Menu Drinks Menus Blog Events Contact Select Page Accessibility We want everyone who visits the BAR NANCY website to feel welcome and find the experience rewarding. What are we doing? To help us make the BAR NANCY website a positive place for everyone, we’ve been using the Web Content Accessibility Guidelines (WCAG) 2.0 . These guidelines explain how to make web content more accessible for people with disabilities, and user friendly for everyone. The guidelines have three levels of accessibility (A, AA and AAA). We’ve chosen Level AA as the target for the BAR NANCY website. How are we doing? We’ve worked hard on the BAR NANCY website and believe we’ve achieved our goal of Level AA accessibility. We monitor the website regularly to maintain this, but if you do find any problems, please get in touch. Let us know what you think If you enjoyed using the BAR NANCY website, or if you had trouble with any part of it, please get in touch. We’d like to hear from you in any of the following ways: email us at Lizz@nancy305.com get in touch at https://nancy305.com/contact-us/ “ We will continue to test the site to make sure that all content on the site is accessible to all visitors and continue to work to improve the accessibility standards of our website. ” Hours of Operation Monday: Closed Tuesday, Wednesday, Thursday & Sunday 8pm-2am Friday and Saturday 7pm-3am 2007 SW 8th St, Miami, FL 33135 Info@Nancy305.com Get in touch Name Phone Email Address Message Submit Home About Menu Blog Store Twitter Facebook Instagram Accessibility Terms of Service Privacy Policy NANCY BAR © 2017. ALL RIGHTS RESERVED. Design by Pixel Bros. X Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.nancyforcos.org/about-nancy",
      "text": "About Nancy About Nancy News Issues Endorsements Transparency contact Support About Nancy To listen deeply, to ask thoughtful questions with an open mind, to facilitate meaningful conversations so that our individual spirits and local communities might thrive. â Balanced Growth â¢ Strong Neighborhoods & Local Business â¢Parks & Open Space â¢ Public Safety My Story in Colorado Springs... In 2021, I won the election for my first term as City Councilmember for District 5 in Colorado Springs. In April 2025, I won re-election to my second (and final) term on Council with a 20% margin of victory. I am proud that NancyforCOS took no money from developers; over 250 unique contributors came forward instead. I am grateful that it was possible to tell the truth, to stand on my record, and to run a positive campaign that did not criticize my opponents â and win! I bring to my work values such as collaboration, curiosity, and a pragmatic approach to problem-solving. As a former social worker, I am a listener, and my north star has been â and will remain â what promotes true human flourishing and will make our beautiful City thrive. How did I get here? Â I moved to Colorado Springs 35 years ago with my husband, and weâve lived in the same house in Council District 5 since 1991. We came without jobs, knowing we wanted to raise a family in the foothills of the Rocky Mountains. For me, it was a homecoming. My dad, Joe Henjum â a career Air Force pilot who taught at the Academy when I was a kid â retired in Colorado Springs, where his legacy of community service inspires me every day. I am a mom of two children, now grown and married, and a grandmother of two. My husband (now retired) spent his career as a teacher in School District 11. My kids went to D11 schools in the heart of Colorado Springs. Our dog, Ella, is the third one weâve had since living here, all named after jazz musicians. (The others were Miles and Trane.) Like many residents of Colorado Springs, I love the outdoors: hiking, biking, and gardening are special loves. Iâve been a licensed clinical social worker and the chief operations officer for a public/private partnership managing behavioral health. Since being a City Councilmember really does require putting in full-time hours and more, Iâve largely stepped away from my multi-decade career as an executive coach and leadership consultant. During that time, I worked with leaders in a wide array of industries (energy, arts, foundations, non-profits and many more) and for organizations sized from 5 â 15,000 employees. Iâve also served as a leader-volunteer, including as board president for CASA (Court-Appointed Special Advocates); facilitator for the Illumination Project that helped police and citizens build stronger relationships; and as moderator of the council of my church (that just celebrated its 150 year anniversary!). I believe in the power of deep listening, building trust, and working collaboratively with mutual respect to accomplish our goals for our community. I have never thought of myself as a politician. I donât mind admitting Iâm not comfortable giving speeches, and I donât like â and am not good at â the horse-trading that can occur in political settings. I did not accept campaign donations from real estate developers in my reelection campaign, and I donât have any business or property interests that could benefit or suffer due to votes I cast. My husband and I own one house and one car. Thatâs it. I simply try to be a good neighbor. The image of neighbors working together is the image I have of good local government. Letâs keep working together to make this the best City possible for all residents! Some Leadership Principles I Strive to Lead By: oÂ Â Self-awareness, vulnerability and empathy are key to connection oÂ Â Assume good intention oÂ Â Listen â be curious and seek first to understand oÂ Â Lead by Example: If we want to create the conditions for building engaged, trusted and ethical leadership, we need the unshakeable confidence that people can be creative, generous and kind. Leadership work is in the âcan beâ. And we must start with being generous, kind and creative ourselves. â Excerpt from City Council Swearing In on April 15, 2025: Â âWe are living in times of uncertainty, chaos, challenge, change and opportunity. We tend to approach the tensions inherent in key values such as personal freedom and community responsibility, justice and mercy â as either/or propositions. But I believe we are best served by approaching these tensions with a mindset that is both/and â that doesnât lift up one value to the exclusion of the other. As a city we are smack dab in the middle of grappling with the inherent tensions that come with growth in the arid west: pressured river basins, energy resources that must be both affordable and sustainable, building economies that are healthy and vibrant and that balance essential human need and planetary boundaries. We want and need housing for all people in neighborhoods that are safe and strong.â Remarks from City Council Swearing In on April 20, 2021 â â â I have just taken an oath to faithfully perform the duties of Council Person for the City of Colorado Springs. My hand was on the Bible that belonged to Joe Henjum â my Dad, and it was held by my brother, Mark. Like many in our community, my nuclear family chose Colorado Springs to be our home after a lifetime of moving every few years by order of the Air Force. And I was inspired to run for this Council seat in large part because of my Dadâs legacy of service â service to our country as an Air Force officer and, in the last 30 years of his life, as a tireless leader-volunteer in this city he loved so well. Â â I am humbled by the duties and responsibilities of this office, which must deliver on the twin promises of good governance and leadership with integrity. What does that mean to me? Â oÂ Â Good governance is participatory, consensus-oriented, accountable, transparent, responsive, effective, efficient, equitable, inclusive and honorable. oÂ Â Good governance assures that the needs of ALL community members, including the most vulnerable, are respected in decision-making. oÂ Â Good governance is responsive to both the present and future needs of Colorado Springs.Â I believe that good governance should be power with â not power over. We benefit from attending to all perspectives. The voice of every resident should be heard. I intend to lead first by listening and asking questions. I believe that we are all connected. What impacts one, impacts all of us. I intend to lead on behalf of each of the neighborhoods in District 5 as well as the City as a whole. I believe in collaboration, in reckoning with differences to forge joint solutions. I intend to lead by assuming good intention and prioritizing relationships. So, as we celebrate 150 years as a City, I ask - what can we learn from our history:Â Â Â Â * That will help us determine what no longer serves us and that we should therefore leave behind? * That will help us identify the best of who we are to carry forward? * That will help us plan for a future Colorado Springs that is resilient, vibrant, thriving and that lives the Olympic values? * That will ensure we are respectful of the land, her beauty, gifts and resources that make our life here so extraordinary and that obligate us to be good stewards on behalf of generations to come? Representing all the people of Colorado Springs, the 9 of us â in partnership with the Mayor and the city staff â will be living and working these questions and more as we step into a future whose promise is ours to create together. Â â âFinally, thank you, Dad. I know you are present with me. I feel your pride and your love. I am serving in memory of you.â Social Media Section... Contact Voter Information City Calendar Support Contact Information â Nancy.Henjum@coloradosprings.gov Mobile: 719-651-1258 Office: 719-385-5483 Designed by TrueWind Marketing"
    },
    {
      "url": "https://nancy305.com/events/",
      "text": "Events Archive - Nancy Bar Home About Menu Drinks Menus Blog Events Contact Select Page Events Current Month september No Events october No Events Hours of Operation Monday: Closed Tuesday, Wednesday, Thursday & Sunday 8pm-2am Friday and Saturday 7pm-3am 2007 SW 8th St, Miami, FL 33135 Info@Nancy305.com Get in touch Name Phone Email Address Message Submit Home About Menu Blog Store Twitter Facebook Instagram Accessibility Terms of Service Privacy Policy NANCY BAR © 2017. ALL RIGHTS RESERVED. Design by Pixel Bros. X Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.mnsi.org.uk/contact-page/",
      "text": "Contact Us | Get in touch | MNSI Contact Us | Get in touch | MNSI Skip to content Skip to main menu We're always looking to improve our website. If you spot an issue please email: Enquiries@mnsi.org.uk . News, events and blog Jobs Accessibility MNSI Menu Search Menu About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI About us Our team Our governance HSIB legacy For families Investigation overview for families Consent Investigation process for families Information in other languages and formats Help and support for families NHS Resolution Early Notification scheme Family feedback For NHS Investigation overview for NHS Refer a case to us Investigation process for NHS Information collection Staff interviews Help and support for NHS staff Staff feedback Health Equity Assessment and Resource Toolkit (HEART) and Health Equity Warning Score (HEWS) Information sharing between MNSI and CQC For other professionals Coroners Police service Position statement for regulatory bodies Publications Work with us Jobs Subject Matter Advisors Contact us Make a complaint about MNSI News, events and blog Jobs Home > Contact us Contact us You can contact us by email or using the form on this page. You can find out how to ask us for information we hold on our Information requests page. Email Enquiries@mnsi.org.uk Alternatively, please use this form. Name* Email* Subject* Message* Privacy policy accepted MNSI Get in touch Contact us Share family feedback Share NHS staff feedback Statements Accessibility Privacy notice Modern slavery and human trafficking statement enquiries@mnsi.org.uk Share this page: X Share on Twitter LinkedIn Share on LinkedIn Facebook Share on Facebook WhatsApp Share on whatsapp Email Share over email © 2025 MNSI. All rights reserved."
    },
    {
      "url": "https://finewineliquors.com/contact-us/",
      "text": "Contact us Fine Wine Liquors Shop By Department Wine Red wine Menu Shiraz Cabernet Sauvignon Pinot Noir Red Blends Other Red Varietals Rosé Cabernet Merlot Shiraz Cabernet Merlot Grenache Tempranillo Sangiovese Nebbiolo Bordeaux Barossa Valley white Wine Menu Chardonnay Riesling Sauvignon blanc Pinot gris grigio Other white varietals White blends Dessert white Popular Regions Menu Bordeaux Barossa Valley Mclaren Vale Coonawarra Margaret River Burgundy Clare Valley Fortified Wine Menu Port Tawny Sherry Apera Vermouth Muscat Mead Tokay Topaque Popular Brands Menu Penfolds Under Wraps Wynns Wendouree Wolf Blass Tyrrell’s Top Selling Macallan 15 Year Old Double Cask $ 165.00 Availability: In Stock Glenfiddich Project XX $ 61.00 Availability: In Stock Glendronach 15 Year Old Revival $ 86.25 Availability: In Stock Beer Discover Beer Menu Craft Beer International Beer Australian Beer Mid Strength Light Beer Low Carb Beer Alcoholic Ginger Beer Home Brew Stout Pilsner Wheat Beer Dark Beer Golden Ale Porter Categories Menu Kegs Cider Craft Beer Domestic Beer Hard Seltzers Import Beer Non-Alcoholic Beer Popular Brands Menu 4 Pines Balter Coopers Little Creatures Stone & Wood Zytho New & Trending Menu New Arrivals Top Rated Craft Beer Light Low Pool Packs Cool Off Craft Beer The Lemonade Stand Country Menu Australia Sweden New Zealand France Spain From to Ready to Drink Organic Wine $69.99 Whiskey Discover whiskey Menu Scotch Whisky American Whiskey Japanese Whisky Australian Whisky Irish Whiskey Canadian Whisky Indian Whisky Discover Vodka Menu Absolut Smirnoff Hunter Distillery Stolichnaya Royal Dragon Crystal Head Poliakov Popular Brands Menu Johnnie Walker Jack Daniel’s Glenfiddich Highland Park Glen Moray Stone & Wood Fortified Wine Menu Whiskey Of The Month Flavored Whiskey Blended Scotch Rye Whiskey Single Malt Scotch Small Batch Bourbon Hot deals of summer Fresh Beer Save up $49.99 Jameson Whiskey Father’s Day Sale 40% off Sitewide! Cogac Cocktail Tequila What’s New New Gift & Accessories Best Sellers Sales & Offers -20% Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Menu Sign In or Register 0 0 $ 0.00 Contact us Home Page Contact us Don’t  hesitate to contact us \nif you need help. Whether you have a question about your order, need assistance with a product, or just want to reach out, you’re in the right place. Feel free to contact us using the details below, and we’ll get back to you as quickly as possible! Address 8560 S Cottage Grove Ave, Chicago, IL 60619, United States Call Us (630) 354-9222 Openning Monday – Friday: 8am – 10pm Saturday – Sunday: 9am – 5pm Contact sales@finewineliquors.com finewineliquorsinfo@gmail.com Got Any Questions? Use the form below to get in touch with the sales team Message Send your message Δ Search Account Cart Same-day local delivery Ground shipping directly to you Free in-store pickup 24/7 customer support Customer Service Menu Help Center My account Track my order Return policy About Us Menu Company info Press Releases Careers Reviews Investor relations Quick Links Menu Search Become a reseller Contact us Terms of service Categories Menu Brandy White Wine Champagne Vodka Tequila Get exclusive offers & rewards Sign up for our members portal to receive some exclusive offer & rewards. It’s easy and free! sign up Leave this field empty if you're human: stay connect Facebook-f Twitter Instagram Pinterest we accept Careers About Us Affiliates Privacy Settings Help Site map Copyright ©  2022 Liquory . All rights reserved. Sign in Create an Account Username or email * Password * Login Lost your password? Main menu Wine Whiskey Pages 404 Error Blog Blog – Standard Blog – Grid 2 Columns Single Post Contact Home About Us Account Blog Careers Cart Checkout Contact us Legal Notice My account Order Tracking Privacy Policy Refund and Returns Policy Reviews Sample Page Shipping Shop Terms & Conditions Track Wishlist Search for: Search All category All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell’s Black Lebel Blanton’s Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester’s Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine All category 20 Year Old Whiskey 21 Year Old Whiskey 25 Year Old Whiskey 30 Year Old Whiskey 40 Year Old Whiskey Absinthe Accessories American Whiskey Bell's Black Lebel Blanton's Collection Blantons Bourbon Brandy and Cognac Buffalo Trace Buffalo Trace Collection Bulleit Chivas Cognac Colonel E.H. Taylor Collection E.H Taylor Easter Sales Elijah Craig Elijah Craig Collection Evan Williams Gin Hennessy XO Irish Whiskey Jack Daniels Japanese Whisky Johnnie Walker Malt Michter’s Collection New Arrival Old Forester's Collection Others Pappy Pappy Van Winkle’s Collection Rare Malts Rum Russell’s Reserve collection Rye Whiskey Scotch Whiskey Single Malt Scotch Smoke Wagon Speyside Single Malt Whisky Stagg Tennessee Tequila Tequila, Tequila & Mezcal Van Winkle W.L. Weller Collection Weller Collection Whiskey 10 Years Old Whiskey 1792 Collection 18 Year Old Whiskey GlenDronach Glenfiddich Laphroaig Macallan Macallan, Scotch Whisky Whisky Gifts & Gift Sets Whisky Scotland Wine Hide similarities Highlight differences Select the fields to be shown. Others will be hidden. Drag and drop to rearrange the order. Image SKU Rating Price Stock Availability Add to cart Description Content Weight Dimensions Additional information Click outside to hide the comparison bar Compare Top Shopping cart close ×"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * Nachricht * E-Mail Datenschutz Nachricht Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://nancy305.com/",
      "text": "Nancy - A Proper Place to Drink in the heart of Little Havana Home About Menu Drinks Menus Blog Events Contact Select Page A Proper Place to Drink Expertly Crafted Drinks & Cocktails Nancy is a nautically themed American Craft Cocktail Bar located on Calle Ocho in Little Havana. The cocktail bar takes its inspiration from the American Revolutionary sailing vessel, Nancy. Nancy carried ammunition and spirits during the American Revolutionary War. The Nancy creed “Carpe Noctem, ”or “Seize the Night” , promises good times through an authentic & inspired bar experience. Events Current Month september No Events october No Events NANCY is more than a name or a location. She stands for humility, quality, and perseverance. An ode to The American Spirit. Hours of Operation Monday: Closed Tuesday, Wednesday, Thursday & Sunday 8pm-2am Friday and Saturday 7pm-3am 2007 SW 8th St, Miami, FL 33135 Info@Nancy305.com Get in touch Name Phone Email Address Message Submit Home About Menu Blog Store Twitter Facebook Instagram Accessibility Terms of Service Privacy Policy NANCY BAR © 2017. ALL RIGHTS RESERVED. Design by Pixel Bros. X Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://artistandfan.com/venues/venues/view/bar-nancy",
      "text": "Venue Bar Nancy, Miami Florida USA onArtistAndFan ArtistAndFan home Home Articles Features Shows Videos Newsletter Press Releases Sponsors Advertise check_circle_outline Sign Up check_circle_outline Sign In home Home Articles Features Shows Videos Newsletter Press Releases Sponsors Advertise check_circle_outline Sign Up check_circle_outline Sign In Account search I AM SEARCH SOCIAL WIDGET Home Features Venues Bar Nancy Bar Nancy Share Become a Member check_circle_outline Sign Up Become a member and claim this Profile or create your own! Venue Contacts Promoter Photos Bar Nancy Venue Type Club Miami Florida USA Marketplace Miami Styles All Styles Region Southeast Primary Contact Lizz Dominguez Email Lizz@nancy305.com Alternate Contact Promoter Buyer External links Website https://nancy305.com/ Facebook https://facebook.com/barnancy305 Instagram https://instagram.com/barnancymiami/ Twitter https://twitter.com/barnancy305 YouTube Linkedin Mailing Address Bar Nancy 2007 SW 8th Street Miami FL 33135 Phone Promoter Buyer Capacity Seats 200 Venues They Book Dates When To Contact Age Limit 21+ Notes About \"Nancy is a nautically themed American Craft Cocktail Bar located on Calle Ocho in Little Havana. The cocktail bar takes its inspiration from the American Revolutionary sailing vessel, Nancy. Nancy carried ammunition and spirits during the American Revolutionary War.\" All Styles Bar Nancy Staff Name Lizz Dominguez Bar Nancy Promoter Name Company Lizz Dominguez Bar Nancy Photos Venues Newsletter Signup × Sign up forArtistAndFan Newsletters Keep in touch with everything onArtistAndFan. Sign up for our newsletter! Sign up Close Newsletter Signup × Sign up forArtistAndFan Newsletters Keep in touch with everything onArtistAndFan. Sign up for our newsletter! Sign up Close Stats Elapsed time: 0.1296 seconds Memory useage: 3.03MB V2.geronimo ArtistAndFan News Articles Features News, Assets and Resources for Music Business Professionals About ArtistAndFan Terms of Service Privacy Policy Customer Service Contact Us Get In Touch Send a message We welcome your inquiries ©\r\n          2019-2025 ArtistAndFan All Rights Reserved."
    },
    {
      "url": "https://nancy305.com/contact-us/",
      "text": "Contact - Nancy Bar Home About Menu Drinks Menus Blog Events Contact Select Page Hours of Operation Monday: Closed Tuesday, Wednesday, Thursday & Sunday 8pm-2am Friday and Saturday 7pm-3am 2007 SW 8th St, Miami, FL 33135 Info@Nancy305.com ​ Get in touch Name Phone Email Address Message Submit Home About Menu Blog Store Twitter Facebook Instagram Accessibility Terms of Service Privacy Policy NANCY BAR © 2017. ALL RIGHTS RESERVED. Design by Pixel Bros. X Skip to content Open toolbar Accessibility Tools Accessibility Tools Increase Text Increase Text Decrease Text Decrease Text Grayscale Grayscale High Contrast High Contrast Negative Contrast Negative Contrast Light Background Light Background Links Underline Links Underline Readable Font Readable Font Reset Reset"
    },
    {
      "url": "https://www.nancyhands.ie/about-us",
      "text": "About Us | Nancy Hands top of page HOME MENUS OUR STORY EVENTS LIVE MUSIC SPORT 3D TOUR More Use tab to navigate through the menu items. RESERVATIONS ABOUT US Nancy Hands is a traditional Irish bar and restaurant located in Dublin City. ​ Offering quintessential Irish dishes made from locally sourced ingredients, alongside an array of modern international dishes that compliment our extensive list of wines and beers. ​ With just a stone's throw away from the Guinness brewery, we champion Irish with the best Guinness on this side of the river liffey, as well delicious pub grub like chowder, home made burgers, fish & chips plus beef & Guinness stew, with beer and spirits originating from all across the island of Ireland. ​ Music and culture is important at Nancy Hands, and we host traditional live music every week at the bar, with the best local musicians coming together to play, and you, our talented customers, are invited to join in with a song, or play your favourite instrument. HISTORY This pub and its name dates back to the public house era in Dublin towards the end of the 18th century, but you may ask who exactly is Nancy Hands? A woman of Irish folklore? A rebellion hero? Nancy was the first female owner of a public house ever, in both Dublin and Ireland. This strong leader ran the pub in a time where religion was everything in Ireland, and holy hour was ingrained in society with all establishments closing from 2pm-4pm every Sunday after mass. However, Nancy had her eyes set on money, and although she had to adhere to the rules of the church, Nancy found a way around the two hours of having no business. ​ Located at the front of the building you’ll see a stampage box, this antique sits gently into a hole that was carved out by Nancy where during the two hours of religious solace, she would serve pints out through the tiny hatch to thirsty customers, where all people could see was Nancy’s hands, hence the name of this bar. Throughout her tenure as landlady, Nancy lived on the top floor of this building, and you will find Nancy and her heritage dotted throughout the bar, including a stunning stained-glass panel of the infamous woman herself. History is not only steeped in the 150 year old building itself, but with the furniture and antiques inside. Our beautiful staircase is from Trinity College, where Oscar Wilde famously studied, and the staircase was also featured in the movie ‘Educating Rita’, starring Michael Cane. We have two huge clock in machines from Odlums bakery, one of the first ever clock in machines to be manufactured, dating back to the 1900’s, where 300 employees started and ended their day by dialling in their number on this one of a kind machine, and guess what, it still works today! On the ground floor of the bar, we have an old code machine that was once used in 1923 for communication between a ship leaving Dublin and its home port. Another one of our antique treasures that still works to this day, please ask our staff to show you how! ​ As your delicious food leaves our kitchen, you will notice the unusual surroundings, these were vault openings from a Dublin bank in the 1940’s. On every wall you will see original Guinness advertising posters and paintings, depicting several of the classic Guinness ads including the famous toucan, and the slogan ‘My Goodness, My Guinness’. We cannot have Guinness artefacts without having some original beer pumps used over a century ago. The exterior and interior of Nancy Hands brings you back to the 1900’s, complete with stories in every corner, and furniture that sparks the imagination of curious souls.  With a wealth of history behind its doors, we eagerly await your visit to tell you more…` MAKE A RESERVATION Book reservations at Nancy Hands today and enjoy a good time with family and friends Book Now Events Live Sports Live Music Dublin Quiz Traditional Irish Food Sustainability Menus Lunch Menu Dinner Menu Privacy Policy Cookies Reservations Group Inquiries 3D Tour Our Story Blog bottom of page"
    }
  ]
}