{
  "fuentes": [
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "email": "info@scibpaints.com"
    },
    {
      "url": "https://www.piattopizzeria.com/contact",
      "email": "info@piattopizzeria.com"
    },
    {
      "url": "https://www.naplesinfiniti.com/contactus.aspx",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.maseratinaples.com/contactus.aspx",
      "email": "flags@2x.png"
    },
    {
      "url": "https://www.myartbroker.com/artist-pablo-picasso/articles/who-owns-work-by-pablo-picasso",
      "email": "helena.poole@myartbroker.com"
    },
    {
      "url": "https://www.myartbroker.com/artist-pablo-picasso/articles/who-owns-work-by-pablo-picasso",
      "email": "jasper@myartbroker.com"
    },
    {
      "url": "https://www.myartbroker.com/artist-pablo-picasso/articles/who-owns-work-by-pablo-picasso",
      "email": "joe@myartbroker.com"
    },
    {
      "url": "https://www.myartbroker.com/artist-pablo-picasso/articles/who-owns-work-by-pablo-picasso",
      "email": "u003edata@myartbroker.com"
    },
    {
      "url": "https://www.myartbroker.com/artist-pablo-picasso/articles/who-owns-work-by-pablo-picasso",
      "email": "u003einfo@myartbroker.com"
    },
    {
      "url": "https://www.theworldofpicasso.com/en/kontakt/",
      "email": "info@theworldofpicasso.com"
    },
    {
      "url": "https://jetswire.usatoday.com/videos/news/local/2020/04/01/picasso-flowers-owners-give-away-flowers-community-outbreak-slows-business/5098448002/",
      "email": "jaustria@gannett.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    }
  ],
  "mails": [
    "flags@2x.png",
    "helena.poole@myartbroker.com",
    "info@inzmo.com",
    "info@piattopizzeria.com",
    "info@scibpaints.com",
    "info@theworldofpicasso.com",
    "jasper@myartbroker.com",
    "jaustria@gannett.com",
    "joe@myartbroker.com",
    "u003edata@myartbroker.com",
    "u003einfo@myartbroker.com"
  ],
  "nombre_sitio": "naplespicasso.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.scibpaints.com/contact-us.html",
      "text": "Contact Us: Get In Touch With Asian Paints for your Painting Needs Contact Us: We’d Love To Hear From You 16815 Popular searches Interior Paints Exterior Paints Shade cards SEARCH RESULTS {{searchItem.map.shadeCode}} {{searchItem.map.shadeFamilyName}}: {{searchItem.map.shadeName}} {{searchItem.map.title}} RELATED SEARCH NO MATCHES FOUND! Did you mean? {{spellCheck}} Log-In Hello! Hello! Signout en ar {{minicart.cartcount > 0 ? minicart.cartcount : 0}} ↻ Processing... You have {{minicart.cartcount}} items {{item[\"product\"][\"name\"]}} - + ₹ {{item[\"totalPrice\"][\"value\"]}} Total ₹ {{minicart.totalprice}} Checkout ↻ Menu PAINTS & COLOUR PAINTS & COLOUR Services Services WATERPROOFING WATERPROOFING INSPIRATION INSPIRATION Login/Register PAINTS & COLOUR All PAINTS & COLOUR EXPLORE COLOURS Colour Catalogue Home Colour Guide PAINT PRODUCTS Interior Paints Exterior Paints Waterproofing Wood Paints Metal Paints Undercoats RESOURCES Paint Budget Calculator Ideas Gallery Colour visualizer SERVICES Paint Store Near Me Book Painting Services Services All Services Beautiful Homes Painting Service Scib Stars WATERPROOFING All WATERPROOFING Bathrooms Terrace and Tanks Roof & Basement Interiors Tiling All Products INSPIRATION All INSPIRATION Get Inspired Paint calculator Gallery Colour Next Guides DecorPro Resources Colour Visualizer Ideas Gallery Please enter your mobile number To receive the dealer details on SMS Mobile * SUBMIT Get in Touch We’d love to hear from you Head Office Scib Chemical S.A.E 6th of October Cirt, 4th Industrial (1/3/B)B Tel:            (+202)38281090-99 Fax: (+202)38331271 Scib Paints Helpline* For enquiries, feedback and complaints please call on 16815 or write to us at info@scibpaints.com Mobile number +91 00:59 ↻ ↻ Need help with your painting needs? Fill the form below to book a free site evaluation by a Scib Paints Beautiful Homes Painting Service expert. Name Mobile Number +20 Governorate * Email By proceeding, you are authorizing Scib Paints and its suggested contractors to get in touch with you through calls, sms, or e-mail. Book an appointment ↻ Thank you! We value your interest in Scib Paints Beautiful Homes Service. We will get in touch with you shortly to schedule a visit by an expert. Try again! Oops! Something went wrong. We couldn't process your request. Please try again? Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Are you looking for home interiors? Get expert execution for your dream home from safe painting service by scib paints. Explore now Our Divisions More about Asian Paints Congratulations You have subscribed. Contact Us 16815 EMAIL ABOUT Research & Technology Careers Contact Us Certificates RESOURCES FAQs POLICIES Quality Policy Customer Policy Cookie Policy Environment Policy EHS Policy TOOLS Colour Catalogue Color with AP APP/Website​ COUNTRY EGYPT Country EGYPT India GLOBAL BANGLADESH MIDDLE EAST FIJI NEPAL SRI LANKA ETHIOPIA CONNECT DOWNLOAD OUR PAINTING APP CONNECT WITH US ©Scib Paints - All rights reserved Congratulations You have subscribed. Welcome User Login OR Continue as guest You have been successfully logged out Login An OTP has been sent to your registered mobile number and email id. 00:00 Resend By clicking submit, I agree to terms and conditions SUBMIT Register Please enter the 5 digit OTP sent via SMS to verify your mobile number! 00:00 Resend I agree to terms and conditions SUBMIT Please enter your mobile number To receive the dealer details on SMS SUBMIT Provide a delivary address Fullname* Email* Mobile* +91 Flat/House No/Floor* Colony/Street/Locality* Landmark City* Pincode* SUBMIT User already exist redirecting you for the login page Waterproofing Calculator Get an instant estimate Calculate now"
    },
    {
      "url": "https://www.piattopizzeria.com/contact",
      "text": "Contact Us — Piatto Pizzeria + Enoteca | A Taste of Naples in Your Neighbourhood 0 Skip to Content OUR STORY LOCATIONS St. John's Downtown St. John's Midtown Guelph Cavendish (Seasonal) EVENTS Book An Event MENU SPECIALS Pizza of the Week Daily Specials AT HOME CONTACT Order Online Open Menu Close Menu OUR STORY LOCATIONS St. John's Downtown St. John's Midtown Guelph Cavendish (Seasonal) EVENTS Book An Event MENU SPECIALS Pizza of the Week Daily Specials AT HOME CONTACT Order Online Open Menu Close Menu OUR STORY Folder: LOCATIONS Back St. John's Downtown St. John's Midtown Guelph Cavendish (Seasonal) Folder: EVENTS Back Book An Event MENU Folder: SPECIALS Back Pizza of the Week Daily Specials AT HOME CONTACT Order Online CONTACT US We’d love to hear from you! Reach out using our contact form for general inquiries, or connect directly with a specific Piatto location. Whether you have a question, want to book an event, or just want to share your pizza experience, we’re here to help! HEAD OFFICE Piatto Pizzeria + Enoteca St. John’s Newfoundland & Labrador info@piattopizzeria.com Name * First Name Last Name Email * Subject * Location St. John's Downtown St. John's Midtown Guelph Cavendish Message * Thank you! JOIN the PIATTO TEAM Are you passionate about PIZZA? Ok, silly question, who isn’t? Become part of the Piatto team! We’re always looking for great people for our front and back of house team. We offer competitive compensation packages and a variety of learning opportunities for all positions! If you’re interested in joining the Piatto family, bring a resume to your neighbourhood Piatto or email a copy to info@piattopizzeria.com . EXPLORE OUR OPENINGS Follow @piattopizzeria on Instagram STAY CONNECTED JOIN OUR ONLINE FAMILY We’d love to have you! Sign up for our VIP list to stay in the know. You’ll receive occasional news and updates from your neighbourhood Piatto, plus maybe a treat or two! SUBSCRIBE NOW LOCATIONS / CAREERS / POLICIES / CONTACT"
    },
    {
      "url": "https://www.naplesinfiniti.com/contactus.aspx",
      "text": "Contact Us | Naples INFINITI Naples INFINITI Sales 239-494-4263 Service 239-494-4264 Finance 239-494-3643 Spanish 239-497-8307 5880 Naples Blvd Naples, FL 34109 Service Map Contact Saved Saved Naples INFINITI Saved Call 239-494-4263 Directions New New 2026 QX60 New Vehicles New Specials Pre-Owned Pre-Owned Vehicles Pre-Owned Specials Certified Pre-Owned Vehicles Certified Pre-Owned Specials INFINITI Certified Pre-Owned Program All Pre-Owned Vehicles in Dealer Group Specials Naples INFINITI Specials Manufacturer Incentives Pre-Owned Specials Certified Pre-Owned Specials Service & Parts Specials Sell & Trade Finance Finance Information Credit Application INFINITI Lease Program INFINITI Lease End Experience Service & Parts Service Center Schedule Service Service Specials INFINITI InTouch Services Order Parts & Accessories Order Tires INFINITI Warranty Coverage About Us About Naples INFINITI Contact Us Hours & Directions Meet Our Staff Employment Opportunities Home New New 2026 QX60 New Vehicles New Specials Pre-Owned Pre-Owned Vehicles Pre-Owned Specials Certified Pre-Owned Vehicles Certified Pre-Owned Specials INFINITI Certified Pre-Owned Program All Pre-Owned Vehicles in Dealer Group Specials Naples INFINITI Specials Manufacturer Incentives Pre-Owned Specials Certified Pre-Owned Specials Service & Parts Specials Sell & Trade Finance Finance Information Credit Application INFINITI Lease Program INFINITI Lease End Experience Service & Parts Service Center Schedule Service Service Specials INFINITI InTouch Services Order Parts & Accessories Order Tires INFINITI Warranty Coverage About Us About Naples INFINITI Contact Us Hours & Directions Meet Our Staff Employment Opportunities Contact Us Fill out the form below and we'll contact you shortly. * Contact Name: *First Name *Last Name *E-Mail Address *Phone Zip Code Department Select Department Sales Inquiry Service Inquiry General Inquiry Comments: By clicking this box, I agree to receive in-person or automated telemarketing calls and texts from Naples INFINITI at the number I entered. I understand that my consent is not required for purchase. Let's Talk *Required Fields Phone Sales: 239-494-4263 Service: 239-494-4264 Finance: 239-494-3643 Spanish: 239-497-8307 Address Naples INFINITI 5880 Naples Blvd Naples, FL 34109 Hours and Directions Be the first to know when price changes & new inventory arrives. | Naples INFINITI | 5880 Naples Blvd, Naples, FL 34109 | Sales: 239-494-4263 | Sitemap | Privacy | InfinitiUSA.com"
    },
    {
      "url": "https://www.maseratinaples.com/contactus.aspx",
      "text": "Contact Us | Maserati Naples Maserati Naples Sales 239-920-5901 Service 239-317-0289 Parts 239-317-0290 900 Tamiami Trail North Naples, FL 34102 Service Map Contact Saved Saved Sales: 239-920-5901 Service: 239-317-0289 Maserati Naples Saved Directions Home New New Vehicles New Specials Model Showroom Schedule Test Drive Maserati GranCabrio Folgore Maserati GranTurismo Folgore Maserati Grecale Folgore Maserati Grecale Folgore Pre-Order Pre-Owned All Pre-Owned Vehicles Our Pre-Owned Vehicles Certified Pre-Owned Vehicles Specials Maserati Specials Pre-Owned Specials Service & Parts Specials Sell & Trade Sell or Trade Your Car Finance Finance Department Get Pre-Approved Payment Calculator Vehicle Protection Plans Service & Parts Service Department Schedule Service Parts Center Order Parts Parts & Accessories/Merchandise About About Us Hours & Directions Contact Us Careers Meet Our Staff Dealership Events Community Efforts Research Research Fuoriserie Grecale PrimaSerie Maserati Quattroporte Maserati Ghibli Maserati GranCabrio Maserati GranTurismo Maserati MC20 Maserati MC20 Maserati GT2 Stradale Home New New Vehicles New Specials Model Showroom Schedule Test Drive Maserati GranCabrio Folgore Maserati GranTurismo Folgore Maserati Grecale Folgore Maserati Grecale Folgore Pre-Order Pre-Owned All Pre-Owned Vehicles Our Pre-Owned Vehicles Certified Pre-Owned Vehicles Specials Maserati Specials Pre-Owned Specials Service & Parts Specials Sell & Trade Sell or Trade Your Car Finance Finance Department Get Pre-Approved Payment Calculator Vehicle Protection Plans Service & Parts Service Department Schedule Service Parts Center Order Parts Parts & Accessories/Merchandise About About Us Hours & Directions Contact Us Careers Meet Our Staff Dealership Events Community Efforts Research Research Fuoriserie Grecale PrimaSerie Maserati Quattroporte Maserati Ghibli Maserati GranCabrio Maserati GranTurismo Maserati MC20 Maserati MC20 Maserati GT2 Stradale Contact Us Fill out the form below and we'll contact you shortly. * Contact Name: *First Name *Last Name *E-Mail Address *Phone Comments: By clicking this box, I agree to receive in-person or automated telemarketing calls and texts from Maserati Naples at the number I entered. I understand that my consent is not required for purchase. Let's Talk *Required Fields Phone Sales: 239-920-5901 Service: 239-317-0289 Parts: 239-317-0290 Address Maserati Naples 900 Tamiami Trail North Naples, FL 34102 Hours and Directions Copyright © 2025 by DealerOn | Sitemap | Privacy | Maserati Naples | 900 Tamiami Trail , North Naples, FL 34102 | Sales: 239-920-5901"
    },
    {
      "url": "https://www.myartbroker.com/artist-pablo-picasso/articles/who-owns-work-by-pablo-picasso",
      "text": "Who Owns Work by Pablo Picasso? | MyArtBroker | Article The World's Largest Modern & Contemporary Prints & Editions Platform How it works Reports Meet the team Login Sign up £ MyArtbroker.com Close Buy Menu Artworks Featured Artists Banksy 269 works Andy Warhol 480 works David Hockney 650 works Keith Haring 250 works Roy Lichtenstein 291 works Damien Hirst 676 works Bridget Riley 111 works View all artists View all art for sale Genres Cubism Conceptual Art Abstract Expressionism Expressionism Minimalism Abstract Post-War & Contemporary Impressionist & Modern Pop Art Surrealism Street & Urban Young British Artists Sell Trading floor Artists Valuations My Portfolio Discover Menu Magazine Edition Magazine Opinion Masterpieces Auction Collecting Podcasts Videos News Guides Art & Tech Investing Go to magazine Latest Banksy's New Royal Courts of Justice Mural 15 Years That Changed The Print Market How Experts Value Prints & Editions A Seller's Guide to Prints & Editions The Top 3 Artists on the Contemporary Print Market A Buyer’s Guide to Prints & Editions: How to Start an Art Collection How to Value Art: A Guide to Art Pricing & Appraisals A Guide to Condition Reports for Art Collectors Reports Print Market Reports All reports Art Market Events Print Market Events & Panels Explore Menu Art for sale pablo picasso articles who owns work by pablo picasso Who Owns Work by Pablo Picasso? written by Liv Goodbody , Last updated 21 Nov 2024 5 minute read Subscribe to Edition Magazine Pablo Picasso Portrait De Jacqueline Au Chapeau De Paille Multicolore © Pablo Picasso 1962 Helena Poole Specialist [email protected] Interested in buying or selling Pablo Picasso? Instant Valuation Sell art Pablo Picasso 159 works In this article Madonna Leonardo DiCaprio Steven Cohen Jack Nicholson Jay-Z Key Takeaways Over half a century after Pablo Picasso's death, his works remain highly coveted, held in prestigious institutions and private collections worldwide. Picasso's groundbreaking contributions to modern art continue to captivate collectors such as Madonna, Leonardo DiCaprio, Steven Cohen, and Jack Nicholson. Known for his versatility and revolutionary impact across movements like Cubism and Surrealism, Picasso’s art retains an enduring appeal that solidifies his legacy as one of the most influential artists of the 20th century. Over half a century after his death, Pablo Picasso remains a monumental figure in the art world, his revolutionary contributions spanning nearly eight decades and numerous artistic movements, including Cubism , Surrealism , and Expressionism . Renowned for his ability to reinvent himself, Picasso’s vast body of work includes not only paintings, but also sculptures, ceramics, and prints, showcasing his unmatched versatility. While many of his masterpieces are housed in prestigious institutions such as the Musée Picasso in Paris and the Museum of Modern Art in New York, a substantial portion of his works remains in private collections. Picasso’s enduring appeal, marked by record-breaking auction prices and constant scholarly interest, reaffirms his legacy as one of history's most influential and transformative artists, whose works are synonymous with artistic innovation and cultural significance. Figure Composée I © Pablo Picasso 1949 Buy or Sell ' Figure Composée I ' Madonna Madonna, the iconic musician and star, has long been known for her passion for art, which is reflected in her impressive personal art collection. In 2000, she acquired Picasso's Buste de Femme à la Frange (1938) for £3.75 million through a Christie’s auction. This acquisition underscored her appreciation for groundbreaking artistic achievements, and her desire to be surrounded by works of great historical significance. In a Billboard interview, Madonna drew a parallel between her own relentless creative drive and Picasso’s prolific output, noting; “Life inspired him and he had to keep expressing himself..and that's how I feel.” This alignment with Picasso's enduring work ethic highlights Madonna's dedication to pushing boundaries in her own career, making the piece not just a valued possession, but also a personal emblem of her own artistic philosophy. Nature Morte Aux Poires Et Au Pichet © Pablo Picasso 1960 Buy or Sell ' Nature Morte Aux Poires Et Au Pichet ' Leonardo DiCaprio Leonardo DiCaprio , acclaimed actor and dedicated art collector, unexpectedly found himself entwined in the high-profile 1Malaysia Development Berhad embezzlement scandal in 2017. Known for his passion for art, DiCaprio’s collection includes works by some of the most celebrated artists of the 20th century, including a 1939 Picasso drawing entitled Fillette . However, two pieces in his collection, including a £2.4 million Picasso artwork titled Nature Morte au Crane de Taureau (1939), became central to the 1MDB controversy. The artworks were reportedly gifted to DiCaprio by financier Jho Low , who was instrumental in funding The Wolf of Wall Street , a film DiCaprio starred in and which was produced by a company associated with the scandal. Low and his associates allegedly syphoned billions from the 1MDB fund, meant for Malaysian economic development, and used it for extravagant purchases, including high-value artworks. Upon learning of the U.S. Department of Justice’s investigation, DiCaprio voluntarily offered to return the pieces to the authorities, despite DiCaprio’s intention to auction the Picasso for his environmental foundation. This unexpected development underscores DiCaprio's prominent position in the art world, as well as his proactive commitment to maintaining transparency and accountability in his role as a high-profile art collector. Tête De Jeune Fille (monochrome) © Pablo Picasso 1949 Buy or Sell ' Tête De Jeune Fille (monochrome) ' Steven Cohen Steven Cohen , the prominent hedge fund manager and art collector, added a significant piece to his renowned collection with the acquisition of Picasso's Le Rêve (1932). This iconic painting, depicting Picasso’s muse and lover Marie-Thérèse Walter , was purchased from casino mogul Steve Wynn for £117 million, a record-setting private sale. Originally, Cohen had agreed to buy the piece in 2006 for £104 million, but the transaction was derailed when Wynn accidentally damaged the artwork by putting his elbow through the canvas. After meticulous restoration, Cohen finally secured the masterpiece in 2013, expanding his already impressive array of modern and contemporary art. Le Rêve is considered one of Picasso's most evocative works, capturing the artist's fascination with Walter and representing a period of intense creative productivity. Cohen’s acquisition of the piece highlights the enduring allure and historical significance of Picasso’s legacy. Related Articles View all Pablo Picasso's 10 Most Famous Artworks Rebecca Barry Cubism and Beyond: Pablo Picasso's Contributions to Modern Art Young and Old Picasso: The Spanish Artist’s Influence on Jean-Michel Basquiat The Master of Printmaking: Pablo Picasso's Legacy in the World of Print Portrait De Mlle Dora Maar © Pablo Picasso 1960 Buy or Sell ' Portrait De Mlle Dora Maar ' Jack Nicholson Legendary actor Jack Nicholson began building his extraordinary art collection in 1960, with its value now estimated at around £113 million. Nicholson has curated an impressive assortment of works from some of the greatest artists of the 20th century, including masterpieces by Picasso, Henri Matisse , and Amedeo Modigliani , alongside iconic works by artists such as Andy Warhol . Nicholson’s focus is primarily on 20th-century and contemporary art, making his collection one of the most significant in Hollywood. In 1995, American artist Ed Ruscha described Nicholson’s collection as “one of the best collections out here,” highlighting its prominence within the art world. Crâne De Chevre Sur La Table © Pablo Picasso 1952 Buy or Sell ' Crâne De Chevre Sur La Table ' Jay-Z Despite rumours, American rapper and entrepreneur Jay-Z does not actually own a Picasso artwork, a surprising revelation given the frequent Picasso references throughout his 2013 album Magna Carta Holy Grail . In his song ‘ Picasso Baby ’, Jay-Z compares himself to artistic giants such as Picasso, Leonardo da Vinci , and Jean-Michel Basquiat , while also referencing renowned institutions such as MoMA and Christie’s auction house. These references suggest a connection to the elite world of art collecting, but Jay-Z has yet to acquire the Picasso he desires. He even acknowledged this in a rare interaction with fans on Twitter, humorously noting that his birthday might be a good occasion for such a purchase. For Jay-Z, art represents more than status, it symbolises creativity, legacy, and cultural significance. By aligning himself with these artistic legends, he positions his own work as revolutionary, striving to create a ‘magna carta’ for the modern era. His relationship with art goes beyond ambitious collecting; it reflects his desire to be seen as a cultural figure on par with the greatest creatives in history. BROWSE PABLO PICASSO Subscribe to Edition Magazine Share Share article Close Copy Facebook Email LinkedIn WhatsApp Twitter After joining MyArtBroker as an Editorial Intern in 2024, Liv has assumed her position as Editorial & Staff Writer in the MyArtBroker team. Having graduated with a degree in History, she is now based in London and frequently attends galleries and exhibitions, deepening her understanding and passion for the art scene. Last updated 21 Nov 2024 Edition. Magazine Browse Opinion Currency : GBP AUD EUR CAD CNY HKD JPY USD We connect buyers and sellers of original contemporary and modern prints, facilitating discreet, independent, investment led private sales. Fixed, clear and mutually agreed upon between both parties - simple, safe and secure. Buy & Sell with us Buy Sell Valuations Events TRADING FLOOR THE DIRECTORY Reports Magazine MY PORTFOLIO MAB 100 About us How it works Mission The team Work with us Press Contact us Contact [email protected] +44 (0)204 571 6292 +1 201-380-3703 Giving back #ABanksy4Ukraine MyArtBroker, 55-56 Russell Square, London WC1B 4HP (by appointment only) 875 Washington St, New York, NY 10014, United States (by appointment only) © 2025 MyArtBroker. All rights reserved. Privacy Policy Cookie policy Website terms of use Terms and conditions Close Close"
    },
    {
      "url": "https://www.theworldofpicasso.com/en/kontakt/",
      "text": "Contact | The World of Picasso Menu Home Exhibitions Contact Czech Contact Home Contact Get in touch with us via phone, email or contact form below. Phone: +420 720 127 791 (artwork purchases) Email: info@theworldofpicasso.com Website operator: Lipno nature s.r.o., ID: 01816896, VAT number: CZ01816896, registered office at Pobřežní 394/12, Karlín, 186 00 Prague 8, under file number C 212184 kept at the Municipal Court in Prague Send Follow The World of Picasso on Social Media Menu Cookies Na webu používáme cookies. Pokud si myslíte, že je to v pořádku, klikněte na „Přijmout všechny“. Kliknutím na „Nastavení“ si také můžete vybrat, jaké soubory cookie chcete. Přečtěte si naše zásady používání souborů cookie a GDPR Nastavení Přijmout všechny Cookies Zvolte, jaké soubory cookie chcete přijímat. Vaše volba bude uložena po dobu jednoho roku. Přečtěte si naše zásady používání souborů cookie a GDPR Nezbytné Tyto soubory cookie nejsou volitelné. Jsou nezbytné pro fungování webových stránek. Statistiky Abychom mohli zlepšovat funkčnost a strukturu webových stránek na základě toho, jak se webové stránky používají. Uživatelská zkušenost Aby naše webové stránky fungovaly při vaší návštěvě co nejlépe. Pokud tyto cookies odmítnete, některé funkce z webu zmizí. Marketing Sdílením svých zájmů a chování při návštěvě našich stránek zvyšujete šanci na zobrazení personalizovaného obsahu a nabídek. Uložit Přijmout všechny"
    },
    {
      "url": "https://jetswire.usatoday.com/videos/news/local/2020/04/01/picasso-flowers-owners-give-away-flowers-community-outbreak-slows-business/5098448002/",
      "text": "Picasso Flowers owners give away flowers to community as outbreak slows business Schedule NFL News Draft Fantasy Odds Betting Newsletter Naples Picasso Flowers owners give away their flowers to the community Naples Picasso Flowers owner Patrick Beneš recalls how he and his wife gave away flowers as business became slow within the first few days of self-quarantine. Jon Austria Jon Austria, jaustria@gannett.com; 239-227-7803 Low-income schools most at risk in Title IX funding battle How US foreign relations have changed since 9/11 Trump addresses Charlie Kirk’s fatal shooting Trump, Vance, Newsom react to Charlie Kirk shooting How the 9/11 terror attacks unfolded Trump, Vance, Biden react to death of Charlie Kirk Charlie Kirk killed at Utah Valley University event Who was Turning Point USA founder Charlie Kirk? Colorado school shooting: Police rush to Denver suburb See terrifying moment car goes airborne, flies over highway Sharks could help predict hurricanes Poland asks NATO to invoke Article 4 after intercepting Russian drones Watch Next Authorities continue manhunt for Charlie Kirk killer Moment Charlie Kirk is shot during Q&A at Utah Valley University event Witnesses at Utah recount chaos after Charlie Kirk shooting Staff Directory Careers Accessibility Sitemap Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Help Center Give Feedback Newsletter Facebook X © 2025 jetswire.usatoday.com. All rights reserved."
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    }
  ]
}