{
  "fuentes": [
    {
      "url": "https://nassauhumane.org/volunteer/",
      "email": "volunteer@nassauhumane.org"
    },
    {
      "url": "https://www.mississaugahumanesociety.ca/about-us",
      "email": "info@mississaugahumanesociety.com"
    },
    {
      "url": "https://baarkbahamas.com/ways-to-help/",
      "email": "info@baarkbahamas.org"
    },
    {
      "url": "https://baarkbahamas.com/ways-to-help/",
      "email": "sarah@baarkbahamas.org"
    },
    {
      "url": "https://nassauhumane.org/dog-park/",
      "email": "dogpark@nassauhumane.org"
    },
    {
      "url": "https://www.nassauhumanesociety.com/contact.html",
      "email": "dogpark@nassauhumane.org"
    },
    {
      "url": "https://www.nassauhumanesociety.com/contact.html",
      "email": "dogpark@nassauhumanesociety.com"
    },
    {
      "url": "https://www.nassauhumanesociety.com/contact.html",
      "email": "info@nassauhumane.org"
    },
    {
      "url": "https://www.nassauhumanesociety.com/contact.html",
      "email": "kloweschmidt@nassauhumane.org"
    },
    {
      "url": "https://www.nassauhumanesociety.com/contact.html",
      "email": "secondchance@nassauhumane.org"
    },
    {
      "url": "https://www.humaneworld.org/en/about-us",
      "email": "esmith@humaneworld.org"
    },
    {
      "url": "https://www.humaneworld.org/en/about-us/our-new-brand",
      "email": "jwiedner@humaneworld.org"
    },
    {
      "url": "http://www.nassauhumanesociety.com/news/carvalho.html",
      "email": "adopt@nassauhumanesociety.com"
    },
    {
      "url": "http://www.nassauhumanesociety.com/news/carvalho.html",
      "email": "dogpark@nassauhumanesociety.com"
    },
    {
      "url": "http://www.nassauhumanesociety.com/news/carvalho.html",
      "email": "executivedirector@nassauhumanesociety.com"
    },
    {
      "url": "http://www.nassauhumanesociety.com/news/carvalho.html",
      "email": "secondchance@nassauhumanesociety.com"
    },
    {
      "url": "http://www.nassauhumanesociety.com/news/carvalho.html",
      "email": "seondchance@nassauhumanesociety.com"
    },
    {
      "url": "http://www.nassauhumanesociety.com/news/carvalho.html",
      "email": "sperry@fbnewsleader.com"
    },
    {
      "url": "https://www.jacksonville.com/story/news/local/2013/02/04/nassau-humane-society-hires-executive-director-direct-capital/15839374007/",
      "email": "bob.self@jacksonville.com"
    },
    {
      "url": "https://www.jacksonville.com/story/news/local/2013/02/04/nassau-humane-society-hires-executive-director-direct-capital/15839374007/",
      "email": "jim.schoettler@jacksonville.com"
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "email": "bestfriend@nhhumane.org"
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "email": "fundraising@nhhumane.org"
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "email": "inspire@nhhumane.org"
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "email": "intake@nhhumane.org"
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "email": "programs@nhhumane.org"
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "email": "reception@nhhumane.org"
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "email": "adoptions@nhhumane.org"
    },
    {
      "url": "https://www.humaneworld.org/en/about-us/our-history",
      "email": "esmith@humaneworld.org"
    }
  ],
  "mails": [
    "adopt@nassauhumanesociety.com",
    "adoptions@nhhumane.org",
    "bestfriend@nhhumane.org",
    "bob.self@jacksonville.com",
    "dogpark@nassauhumane.org",
    "dogpark@nassauhumanesociety.com",
    "esmith@humaneworld.org",
    "executivedirector@nassauhumanesociety.com",
    "fundraising@nhhumane.org",
    "info@baarkbahamas.org",
    "info@mississaugahumanesociety.com",
    "info@nassauhumane.org",
    "inspire@nhhumane.org",
    "intake@nhhumane.org",
    "jim.schoettler@jacksonville.com",
    "jwiedner@humaneworld.org",
    "kloweschmidt@nassauhumane.org",
    "programs@nhhumane.org",
    "reception@nhhumane.org",
    "sarah@baarkbahamas.org",
    "secondchance@nassauhumane.org",
    "secondchance@nassauhumanesociety.com",
    "seondchance@nassauhumanesociety.com",
    "sperry@fbnewsleader.com",
    "volunteer@nassauhumane.org"
  ],
  "nombre_sitio": "nassauhumane.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://nassauhumane.org/volunteer/",
      "text": "Volunteer - Nassau Humane Society Skip to content 904-321-1647 Join our Mailing List Join our Mailing List Please fill out the form below to join our mailing list. \" * \" indicates required fields Name * First Last Email * Phone * LinkedIn This field is for validation purposes and should be left unchanged. Δ Adopt Donate About Location & Hours Mission & Vision Our Success Financials Board of Directors Corporate Partners Our Services Report Stray Animals Emergency Care Find Lost Pets Surrender a Pet Mobile Clinic Pet Food Bank Dog Park Furniture Donation Pick Up Microchip Your Pet Day – September 20 Training Get Involved Volunteer Foster Attend an Event Club NHS Ways to Give Donate Monthly Giving Second Chance Medical Fund Planned Gifts Memorials & Dedications Shop to Support Resale Stores Online Store Wishlist Merch Store RoundUp App Attend an Event Contact Us Volunteer Volunteer Login How to become a Volunteer How to become a volunteer at Nassau Humane Society Step 1. Review this page for the wide range of volunteer opportunities. Step 2. Complete the volunteer application and email it to volunteer@nassauhumane.org Step 3. Once you have submitted your completed volunteer application, we will contact you regarding next steps and scheduling! *Please note that we require all volunteers to be at least 12 years old. Any person under the age of 16 must be accompanied by a parent or guardian at all times at our adoption center and are not allowed to handle animals unless our staff approves of the interaction. The opportunities are endless for a volunteer at Nassau Humane Society. Make a difference in an animal’s life by giving your time and heart. How to Volunteer for NHS Volunteers are crucial to fulfilling our mission. Without our volunteers, we could not provide the high level of programming and services that benefit the lives of animals in our care. Volunteer at the adoption center, dog park or at one of our resale stores to show your love for animals, make an impact in their lives, and give back to your community. If you can’t give your time, please consider a donation . Your gift, no matter how big or small, will improve the lives of homeless and abandoned animals within our community and beyond. Resale Store Operations Expand Volunteering at NHS Second Chance Resale Store and The Closet Boutique is fun AND fundamental to our animal rescue mission. Our resale stores, Second Chance (offering home goods, books and furnishings) and The Closet Boutique (offering men’s and women’s clothing and accessories), are always looking for new volunteers. All proceeds from both resale stores support our animal rescue and welfare operations! When you volunteer at our resale stores, you: Help sell donated goods in order to give homeless animals a “second chance” Become part of one of the community’s most well-liked non-profits Give back to your community Become part of a team and make new friends Help the planet through reuse Participate in something greater than ourselves Help people find great bargains and treasures Experience a sense of pride and accomplishment Hours are flexible to your schedule. Volunteers help organize our stock and work on the sales floor. If you are interested in volunteering, stop by either resale location today and ask for a manager, or fill out an application form . Adoption Center Expand Interested in volunteering at our adoption center? NHS would be excited to have you on our team! If you have any questions, contact volunteer@nassauhumane.org . Here are some of the available roles you can help us with: Dog Volunteer Help keep our dogs in clean kennels, socialized and exercised, and bathed and groomed so they can put their best “paw” forward as potential owners come to look for their new furry family member. Cattery Volunteer Help socialize the cats and kittens awaiting their purr-fect home. Feed treats, groom and prompt a head butt, prey play and encourage “making some biscuits!” Option to support cattery cleaning and/or assist potential adopters with any questions they may have about adopting a specific cat. Mini Mammal Buddies Rabbits, Guinea pigs and ferrets oh my! Pet and cuddle our mini mammals while they await new homes. Adoption Waggin’ Events Help animals awaiting adoption gain exposure in the community. Most events are held on weekends, such as the Farmer’s Market, Pet Supermarket, and other local events. Volunteers have the option to help transport animals and/or show off and praise the attractive attributes of each wonderful animal seeking a forever home. Special Events We always need an extra set of hands to make outreach and adoption events, and our fundraising events like Pasta 4 Paws and Paws on Parade, a success. Helping at special events is a great way to give back and become part of the community. If you have any questions about these or other event volunteer opportunities, email volunteer@nassauhumane.org . Can’t wait to see you! Become a Volunteer Volunteer & Save! As a current volunteer, you can enjoy a 25% discount at the Dog Park on membership, Second Chance Resale Store, The Closet Boutique, and even on pet adoptions! A current volunteer is someone who volunteers a minimum of 8 hours a month. This can be walking dogs, volunteering at one of our resale stores or helping out at events. It's our way of saying thank you for helping tails wag and hearts heal. 🐾 Other ways to support NHS: Host a fundraiser Have a bake sale or car wash and donate proceeds to the Nassau Humane Society Organize a supply drive Help collect items from our wish list, including items from your home that can be reused to help animals in our shelters Host a group craft-making project Become inspired and make toys for our animals Email us for information Help us find a loving home for all pets Adopt Donate Meet our Partners 639 Airport Road Fernandina Beach, FL 32034 View map 904-321-1647 Adopt Volunteer login Donate Adoption Center Hours Closed Mondays Tuesday - Thursday: 11 am - 5 pm Friday: 11 am - 6 pm Saturday & Sunday: 11 am - 4 pm Animal showings end half an hour before closing. Second Chance and The Closet Hours Monday - Saturday: 9:30 am - 5 pm Closed Sundays Dog Park Hours Closed Mondays (full day) and closed Wednesdays (12pm-3pm) for shelter dogs use. Tuesday - Sunday: 8 am - 7 pm (DST). 9 am - 5 pm (ST) Office Hours: Monday Closed; Tuesday-Saturday 8 am - 5 pm;  Sunday: 12 pm - 5 pm Last entry into the park is 7 pm (DST) and 5 pm (ST), the park will close 30 minutes later. About Location & Hours Mission & Vision Our Success Financials Board of Directors Corporate Partners Our Services Report Stray Animals Emergency Care Find Lost Pets Surrender a Pet Mobile Clinic Pet Food Bank Dog Park Furniture Donation Pick Up Microchip Your Pet Day – September 20 Training Get Involved Volunteer Foster Attend an Event Club NHS Ways to Give Donate Monthly Giving Second Chance Medical Fund Planned Gifts Memorials & Dedications Shop to Support Resale Stores Online Store Wishlist Merch Store RoundUp App Attend an Event Contact Us Volgistics Login Mailing List Privacy Policy Nassau Humane Society is a 501(c)(3) nonprofit organization. EIN: 59-2667141. © 2025 Nassau Humane Society. All Rights Reserved. Site by Dynamic Solution Associates Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.mississaugahumanesociety.ca/about-us",
      "text": "Who We Are — Mississauga Humane Society 0 Skip to Content Adopt All Pets for Adoption Cats for Adoption Dogs for Adoption Adoption Process Adoption Form Happy Homes: Adoption Stories Support Donate Membership Sponsor an Animal Corporate Giving Shop Our Wishlists Send an ECard Get Involved Become a Foster Volunteer Fundraise Events About MHS Who We Are Leadership Our Values Humane Canada News FAQs Memorials Our Partners Rama Gaming House Local Business Partners Art Partners Building Our Shelter Donate Open Menu Close Menu Adopt All Pets for Adoption Cats for Adoption Dogs for Adoption Adoption Process Adoption Form Happy Homes: Adoption Stories Support Donate Membership Sponsor an Animal Corporate Giving Shop Our Wishlists Send an ECard Get Involved Become a Foster Volunteer Fundraise Events About MHS Who We Are Leadership Our Values Humane Canada News FAQs Memorials Our Partners Rama Gaming House Local Business Partners Art Partners Building Our Shelter Donate Open Menu Close Menu Folder: Adopt Back All Pets for Adoption Cats for Adoption Dogs for Adoption Adoption Process Adoption Form Happy Homes: Adoption Stories Folder: Support Back Donate Membership Sponsor an Animal Corporate Giving Shop Our Wishlists Send an ECard Folder: Get Involved Back Become a Foster Volunteer Fundraise Events Folder: About MHS Back Who We Are Leadership Our Values Humane Canada News FAQs Memorials Folder: Our Partners Back Rama Gaming House Local Business Partners Art Partners Building Our Shelter Donate Who We Are Mississauga Humane Society (MHS) is a registered non-profit, no-kill charity, founded in 1999. We have grown over the years, but our mission remains the same: to save as many animals as possible. Our charity registration number is: 89912 7526 RR0001 We are not the City of Mississauga Animal Services . If you need more information about the Animal Services Shelter , call 311 (905-615-4311 outside City limits) or send an email to mypet.info@mississauga.ca. Run By Volunteers Mississauga Humane Society is a registered charity that is run by dedicated volunteers. The organization runs on the unpaid labour of an extensive network of passionate volunteers and our dedicated board members. Our volunteers rescue and foster hundreds of cats and dogs every year in Mississauga and beyond. The new board is committed to transparency and ensuring a positive, fulfilling experience for volunteers, who are the lifeblood of Mississauga Humane Society Learn More Supported by Our Foster Network Having many caring foster homes enables us to work closer with our community and allows homeless dogs and cats to thrive in a home environment until they are adopted. Many of the animals we get into our care have had rough starts, behavioral issues, and their self-confidence shattered; our foster homes provide a nurturing and loving environment to build up these hurt souls to become their best selves again! Join Our Foster Network Powered By Donations We receive no funding and we have to raise our own funds to take care of the animals that we rescue. Fundraising events, donations and sponsors help us cover food, supplies and medical expenses, until the cats and dogs are placed into permanent, loving homes. Every dollar raised and every volunteer hour goes only towards the welfare of our furry friends. Make a Donation Our Values Financial Transparency Since April 2019, we have maintained full financial transparency within our Board, ensuring accountability at every level. Annual financial audits are conducted, reviewed, and approved by both the Board and our membership, reinforcing our commitment to ethical stewardship and responsible use of funds. Mississauga Humane Society (MHS) was founded to help homeless animals, saving them from life on the streets and finding them forever homes. Excellent Animal Care We rescue animals from all over Canada, the United States, and the Caribbean. Each animal is thoroughly vetted, and we ensure that no animal with an ongoing medical condition is adopted without first receiving treatment. We always fully inform the adopters about the animal's medical condition. All our animals are completely vaccinated, neutered/spayed,  microchipped, treated for parasites (internal and external) and are SNAP tested for FIV/FeLV- before adoption. We vaccinate for FVRCP and Rabies. Our foster-to-adopt program is built to make sure animals are placed in homes that are a good fit. You’ll have MHS supporting you as you make your adoption decision. Our foster program ensures that animals are comfortably cared for while waiting for adoption. Education and Advocacy We’re focused on Spay/Neuter advocacy and animal welfare issues. As an associate member of Humane Canada , we are able to give input on issues that are before lawmakers. Helping guide animal welfare policy in Canada. We also educate our rescue community by sharing Humane Canada petitions and press releases that have to do with provincial and/or national animal welfare issues. Leadership & Governance at MHS The Mississauga Humane Society is led by a dedicated Board of Directors, consisting of up to nine members, including four officers: President, Vice President, Secretary, and Treasurer. Mississauga Humane Society board members are long-time animal advocates and volunteers. All members of the board are unpaid. Together, we support homeless animals by fostering, fundraising, and recruiting sponsors, foster parents and volunteers. Our governance follows the latest rulings under the Ontario Not-for-Profit Corporations Act (ONCA), with by-laws reviewed, updated, and voted on by both the Board and Membership to ensure compliance and accountability. Financial transparency is a core value. Since April 2019, the Board has upheld complete financial transparency, with annual financial audits conducted, reviewed, and approved by both the Board and Membership. The new board is committed to transparency and ensuring a positive, fulfilling experience for volunteers, who are the lifeblood of Mississauga Humane Society. Every dollar raised and every volunteer hour goes only towards the welfare of our furry friends. Help Shape Our Future: Become a Member As a member, you’ll have the power to vote on key decisions and play an active role in shaping the future of our organization. Together, we can create a better future for animals in need. Learn more We’re thankful to be supported by a community Community Our Business Friends Our corporate sponsors have been instrumental in providing supplies, space, donations, and their time and energy into helping MHS grow and succeed and saving more lives than we ever could without their generosity. We are the only animal rescue in Mississauga registered with cGaming, a charitable gaming initiative run by OLG. As a member of the Mississauga Charitable Gaming Association, we partner with Rama Gaming House Mississauga , where volunteers help support local fundraising. A portion of all gaming revenue goes directly to local charities, funding vital community programs and services. Our Art Partners Our art partners have generously offered to donate a portion of their commission fees to Mississauga Humane Society. Get custom pet portraits and other creations for yourself or as a gift while supporting our cause. Click here to explore our art partners. A Proud Associate of Humane Canada Mississauga Humane Society is proud to be an associate member of the Canadian Federation of Humane Societies (Humane Canada) : the national federation of SPCAs and humane societies. As part of this federation, we contribute to advancing animal welfare while benefiting from valuable resources, including education and updates on key issues. This collaboration enables us to drive meaningful change to protect animals in Mississauga and across Canada. We believe every animal is an individual with intrinsic value, deserving of dignity, respect, and moral consideration. Through Humane Canada, we join a united network of like-minded organizations, forming a strong national voice to lead conversations and foster positive change for animals. Learn more at humanecanada.ca Proud Associate of Humane Canada Mississauga Humane Society (MHS) is a registered non-profit, no-kill charity, founded in 1999. Charitable Number:  89912 7526 RR0001 Contact 1-905-271-0883 info@mississaugahumanesociety.com P.O. Box 152,  3353 Credit Woodlands, Unit 2 Mississauga, Ontario L5C 2K1 NOTE:  OUR ADDRESS IS AS A POST OFFICE BOX ONLY, WITH NO STAFF OR ANIMALS ON THE PREMISES. Get Involved Adopt Foster Donate About MHS We recognize we are on the Treaty Lands and Territory of the Mississauga's of the Credit First Nation and the Traditional Territory of the Anishinaabe, Haudenosaunee, and the Huron Wendat. © 2025 Mississauga Humane Society. All Rights Reserved             |             Website Designed by Rule1 Agency"
    },
    {
      "url": "https://baarkbahamas.com/ways-to-help/",
      "text": "Ways to Help | Baark! Donate Supporting Members About About Baark Meet Our Officers Friends of Baark! Supporters Ways to Help Five Year ‘Stop the Suffering’ of Dogs & Cats In The Bahamas Don’t Shop – Adopt Volunteer Spay or Neuter Legacy Gifts Donate Wish List Baark! Merchandise Be Prepared for a Hurricane Baark! Membership Events Calendar International Potcake Golf Tournament Sunday November 16th, 2025 Potcakeman Triathlon Sunday April 19th, 2026 Nassau Trivia Nights Operation Potcake 2024 Programs Baark! Mobile Clinic Education Spay or Neuter Trap-Neuter-Return MASH Clinics Operation Kindness Disaster Animal Rescue Coalition Operation Potcake Sponsors News Gallery Contact Select Page How You Can Help 01. Don’t Shop – Adopt a pound rescue dog, puppy, cat or kitten and give them a second chance at a happy life. Go to the Bahamas Humane Society and see all the beautiful animals awaiting homes. Find out more 02. Volunteer We have many ways in which you can help depending on your skills and free time, please contact sarah@baarkbahamas.org . Find out More 03. Spay or Neuter to prevent unwanted litters. Encourage your friends and family to do the same. For financial assistance, please contact info@baarkbahamas.org or call 242-427-SPAY (242-427-7729). Find out More 04. Legacy Gifts Would you consider remembering Baark! in your will? Any amount, large or small, will be vital in helping our continued success. Find out more 05. Donate Baark is a non-profit organization with no paid staff and no government funding. ALL of your money donated goes directly towards helping the animals. Find out More 06. Buy Baark! Merchandise Check out some of our fun items available for purchase so you can proudly display your support of Baark. We have Baark! custom water bottles, pet can covers, canvas bags, jute bags, Tervis tumblers, wine glasses and lids, collapsible bowls, car magnets, shirts and non-custom face masks .  All profits go towards our programs. Find out more 07. Be Prepared For A Hurricane When Hurricane Dorian came through The Bahamas in 2019 we had never experienced this magnitude of loss and destruction.  So many people were displaced and as a result pets were left abandoned.  So many people lost everything and they had no means of keeping and caring for their pets.  It was truly heartbreaking for everyone. Find out more 08. Baark! Membership By becoming a Baark! member you will be supporting our life changing spay, neuter and education projects. You will be part of the sustainable solution towards creating cleaner, safer and more humane communities in The Bahamas. Find out More Other ways you can help: Walk a rescue dog at the Bahamas Humane Society. This helps to socialise dogs and makes them easier to adopt. Contact the Humane Society directly on 325-6742 or 323-5138 to organise walking/socialising. Foster a young puppy or kitten or an older dog or cat that needs some extra TLC. Become a Stray Buster if you want to get right in on the action and help our team go out into the streets, trap and pick up stray dogs and cats. We’d love you to help. Contact info@baarkbahamas.org and tell us when you’re free. Travel There is a wait list of people wanting to adopt potcats and potcakes in Canada and various places around the USA. If you are travelling from Nassau into either of these places and can take a kitten or puppy with you please get in touch. Someone will meet you at the airport both ends. Disaster Preparations Over the years we have met awesome people around the world. One of our close supporters in Florida involved in disaster relief gave us permission to use these wonderful checklists (Pocket Pets: hamster, guinea pig, gerbil, rabbit, etc.) . Please use so you are fully prepared for a storm:  Felines  Birds  Canines  Pocket Pets & Snakes Join Our Newsletter Signup today and stay up to date with Baark!'s work in the Bahamas. Success! Name Email SUBSCRIBE Follow Follow"
    },
    {
      "url": "https://nassauhumane.org/dog-park/",
      "text": "Dog Park - Nassau Humane Society Skip to content 904-321-1647 Join our Mailing List Join our Mailing List Please fill out the form below to join our mailing list. \" * \" indicates required fields Name * First Last Email * Phone * X/Twitter This field is for validation purposes and should be left unchanged. Δ Adopt Donate About Location & Hours Mission & Vision Our Success Financials Board of Directors Corporate Partners Our Services Report Stray Animals Emergency Care Find Lost Pets Surrender a Pet Mobile Clinic Pet Food Bank Dog Park Furniture Donation Pick Up Microchip Your Pet Day – September 20 Training Get Involved Volunteer Foster Attend an Event Club NHS Ways to Give Donate Monthly Giving Second Chance Medical Fund Planned Gifts Memorials & Dedications Shop to Support Resale Stores Online Store Wishlist Merch Store RoundUp App Attend an Event Contact Us Dog Park Nassau Humane Society is pleased to offer memberships to our community Dog Park – the only off-leash dog park on Amelia Island. Rated the 2022 JaxBest winner for best dog park, our expansive park consists of two separate areas for small and large dogs, a bone-shaped pool, shaded areas, four bathing stations equipped with hot water, and of course plenty of benches, shade and chairs for pup parents! In keeping with our animal rescue mission, all dogs must be at least six months of age, spayed/neutered, and veterinarian’s documentation of current Rabies, Distemper, and Bordetella vaccinations provided with application. There are no exceptions to these rules. Membership Options We offer various membership types, from day passes up to annual memberships. Membership fees cover day-to-day dog park operational expenses. All donations are appreciated. Come visit to see why the Nassau County community chooses the Nassau Humane Society to let their dogs run free! All proceeds benefit Nassau Humane Society. We offer a 10% military discount with photo ID. A 3% fee must be added to all credit card purchases (excluding donations). Membership Pricing Daily: $12.00 ($6/each additional dog) Weekly: $30.20 ($15/each additional dog) Monthly: $42.25 ($21/each additional dog) Semi-Annual: $187.15 ($75/each additional dog) Annual: $320 ($100/each additional dog) Hours: Closed Mondays (full day) and closed Wednesdays (12pm-3pm) for shelter dogs use. Tuesday - Sunday: 8 am - 7 pm (DST). 9 am - 5 pm (ST) Last entry into the park is 7 pm (DST) and 5 pm (ST), the park will close 30 minutes later. Questions? Email dogpark@nassauhumane.org To apply for membership, email the completed application form to dogpark@nassauhumane.org Help us find a loving home for all pets Adopt Donate Meet our Partners 639 Airport Road Fernandina Beach, FL 32034 View map 904-321-1647 Adopt Volunteer login Donate Adoption Center Hours Closed Mondays Tuesday - Thursday: 11 am - 5 pm Friday: 11 am - 6 pm Saturday & Sunday: 11 am - 4 pm Animal showings end half an hour before closing. Second Chance and The Closet Hours Monday - Saturday: 9:30 am - 5 pm Closed Sundays Dog Park Hours Closed Mondays (full day) and closed Wednesdays (12pm-3pm) for shelter dogs use. Tuesday - Sunday: 8 am - 7 pm (DST). 9 am - 5 pm (ST) Office Hours: Monday Closed; Tuesday-Saturday 8 am - 5 pm;  Sunday: 12 pm - 5 pm Last entry into the park is 7 pm (DST) and 5 pm (ST), the park will close 30 minutes later. About Location & Hours Mission & Vision Our Success Financials Board of Directors Corporate Partners Our Services Report Stray Animals Emergency Care Find Lost Pets Surrender a Pet Mobile Clinic Pet Food Bank Dog Park Furniture Donation Pick Up Microchip Your Pet Day – September 20 Training Get Involved Volunteer Foster Attend an Event Club NHS Ways to Give Donate Monthly Giving Second Chance Medical Fund Planned Gifts Memorials & Dedications Shop to Support Resale Stores Online Store Wishlist Merch Store RoundUp App Attend an Event Contact Us Volgistics Login Mailing List Privacy Policy Nassau Humane Society is a 501(c)(3) nonprofit organization. EIN: 59-2667141. © 2025 Nassau Humane Society. All Rights Reserved. Site by Dynamic Solution Associates Manage Consent To provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions. Functional Functional Always active The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent"
    },
    {
      "url": "https://www.nassauhumanesociety.com/contact.html",
      "text": "Contact Us HOME ABOUT US CONTACT US NEWS E-MAIL NEWS EMPLOYMENT ADOPT CATS DOGS ADOPTION CENTER ANIMAL RESCUE SPAY/NEUTER FOUND ANIMALS DONATE BUSINESS PARTNER FOOD BANK PLANNED GIVING WISHLIST VOLUNTEER FOSTER VOLUNTEER APPLICATION FORM VOLUNTEER SIGN IN EVENTS SECOND CHANCE STORE NHS DOG PARK CONTACT US Board of\n        Trustees Beth Hughes, President Amanda  Pelletier, Vice President Ed  Hardee, Secretary Deborah Gold Gerald  Koss John  Landregan Norman  Ledwin Information 904.321.1647 info@nassauhumane.org Kandy Lowe-Schmidt Administration 904.321.1647  Ext. 102 kloweschmidt@nassauhumane.org Animal Rescue & Control Deb Ewald (904) 491-0122 Intake Manager 904.321.1647  Ext. 107 Krissy Eitel, Manager Aurora’s Dog  Park 904.491.1511 dogpark@nassauhumane.org Penny Landregan, Director NHS Second Chance/Second Chance Closet Resale Shops 904-321-0022 secondchance@nassauhumane.org Nassau Humane Society 639 Airport Road Fernandina Beach, FL 32034 Tel: 904.321.1647 Fax: 904.491.8411 Email: info@nassauhumane.org Second Chance Store 8 Flags Shopping Center 1002 South 14th Street Fernandina Beach, FL 32034 904-321-0022 Email: secondchance@nassauhumane.org Nassau Humane Society Dog Park 641 Airport Road Fernandina Beach, FL 32034 Tel: 904- 491-1511 Fax: 904.491.8411 Email: dogpark@nassauhumane.org Facebook Instagram Twitter Google Plus"
    },
    {
      "url": "https://www.humaneworld.org/en/about-us",
      "text": "About Humane World for Animals | Formerly Humane Society of the United States and Humane Society International | Humane World for Animals Skip to main content Humane World Humane World About Us Toggle submenu Our Mission and Impact Our History Our New Brand Building Community Media Room How we help local pet shelters and rescue groups Where We Work Toggle submenu Africa South Africa Asia India South Korea Viet Nam Europe Germany Italy Poland Romania United Kingdom Latin America Brazil Costa Rica Mexico Canada United States Australia Issues Toggle submenu Access to Care Animal Rescue and Response Animal Testing and Research Banning Trophy Hunting Dog and Cat Meat Trade End Animal Fighting Equine Protection Farmed Animal Welfare Going Fur-free Helping Captive Wildlife Protecting Dogs and Cats Stopping Puppy Mills Wildlife Protection View All Issues Black Beauty Ranch: Come see and learn about the animals who have found a safe haven at our sanctuary. Learn more » Take Action Toggle submenu Get Involved Action Center Volunteer for Animals Events Cause Partnerships Shop Ways to Give Donate Now Leave a Legacy Give In Memoriam Give a Gift Donation Start a Fundraiser Donate Your Car Donor-advised funds Your actions make a difference! Find ways to take action on the issues you care about most. Visit our Action Center » Get Informed Toggle submenu \"A Humane World\" blog Animal Care Resources Find answers to wildlife problems All Animals magazine HumanePro: Our online resource for animal care professionals Humane Voices Podcast A Humane World: A first-hand account of our ongoing efforts to protect animals, as told by our president and CEO, Kitty Block. Read the latest posts » Careers and Internships Contact Us Donate Careers and Internships Contact Us Donate DONATE Search humaneworld.org Search Common Searches: I'm having trouble affording my pet. What can I do? I have a sick dog [cat, wildlife]. What can I do? What does Humane World for Animals do? Does Humane World for Animals work with my local shelter? How do I make a donation? Meredith Lee\n                  \n                  \n                  /                  Humane World for Animals We are Humane World for Animals Together, we tackle the root causes of animal cruelty and suffering to create permanent change. New name, same impact You've known us as The Humane Society of the United States and Humane Society International. Now, as we look to the future, we're uniting under a new name—Humane World for Animals—to better reflect who we are, the bold work we do and the global mission we share. Since 1954, we have worked to create a more humane society for animals. Working side by side as the Humane Society of the United States and Humane Society International, we’ve helped to pass thousands of landmark laws, rescued hundreds of thousands of animals, and cared for and protected millions more. In 2025, to convey our mission and make sure that everyone understands who we are and the bold work that we do, our organizations are standing together under a new shared name: Humane World for Animals. Our Commitments We’re dedicated to changing the world for animals. Meredith Lee/Humane World for Animals We drive change with human action We make real, lasting change for animals. We help people, communities, governments and corporations shift behavior—providing the right support and advocating for policy change to stem the root causes of suffering and cruelty. maximkabb/iStock.com We drive change at scale Animal suffering is rarely constrained to geographies or species. We make bold progress for all animals by working together on the biggest problems—no matter where they are, how complex or how tightly entrenched, we focus on where we can make the greatest impact. Jo-Anna Robinson/AP Images for HSI We drive change with deep expertise It takes an extensive toolkit and diverse specialists to tackle the complex root causes of animal suffering. From field responders, scientists and program advocates to animal care professionals, litigators and experts in policy change, our teams pull every lever on behalf of animals. Lance Murphey/AP Images for The HSUS We drive change with compassion Driven by the optimistic belief that we can build a better world for animals, we work to end suffering, cruelty and human-animal conflict for good by welcoming all supporters, no matter their starting point, to join us in tackling the root causes and creating the solution. Our Values Our teams, partners, allies and supporters span geographies and cultures, backgrounds and skillsets.​ Our values guide our work and how we operate. Impact : We are advocates for system-wide and long-term impact, working strategically to improve the lives of animals. We take on the toughest, most institutionalized cruelties. Resilience : We lead with passion, perseverance and optimism, knowing that we are making meaningful change. Part of driving big change is facing big challenges. We never lose sight of a better world for animals. Respect : We believe in our mutual commitment to the mission, we act as each other’s allies and we help each other reach our full potential. Inclusion : We invite, welcome and amplify diverse voices within our family of organizations and in the communities with which we work.  Advancing diversity and inclusion is not only the right thing to do, but it makes for better decision-making and greater impact for animals. One team : We work together, raising each other up and combining our unique skills and perspectives to become stronger together than we are apart. None of us will be able to achieve our mission alone. More About Humane World for Animals Our Leadership Our Humane World for Animals management team directs the organization’s day-to-day activities, under the Board’s direction and oversight. Our Mission and Impact We tackle the root causes of animal cruelty and suffering to create permanent change. New Name, Same Mission We’re uniting under a new name—Humane World for Animals—to better reflect who we are, the bold work we do and the global mission we share. Working toward a Humane World A Humane World is the official blog of Humane World for Animals—a first-hand account of our ongoing efforts to protect animals, as told by our president and CEO, Kitty Block. Subscribe for regular updates. Check out the latest stories Jean Chung/HSI Footer menu Careers and Internships Contact Us Donate Global - Social Menu Humane World for Animals Global - Legal Menu About Us Building Community Financials Privacy Policy Media Room Sitemap © 2025 Humane World for Animals is registered as a 501(c)(3) nonprofit organization. Contributions to the Humane World for Animals are tax-deductible to the extent permitted by law. The Humane World for Animals tax identification number is 53-0225390."
    },
    {
      "url": "https://www.humaneworld.org/en/about-us/our-new-brand",
      "text": "New Name, Same Mission | Humane World for Animals Skip to main content Humane World Humane World About Us Toggle submenu Our Mission and Impact Our History Our New Brand Building Community Media Room How we help local pet shelters and rescue groups Where We Work Toggle submenu Africa South Africa Asia India South Korea Viet Nam Europe Germany Italy Poland Romania United Kingdom Latin America Brazil Costa Rica Mexico Canada United States Australia Issues Toggle submenu Access to Care Animal Rescue and Response Animal Testing and Research Banning Trophy Hunting Dog and Cat Meat Trade End Animal Fighting Equine Protection Farmed Animal Welfare Going Fur-free Helping Captive Wildlife Protecting Dogs and Cats Stopping Puppy Mills Wildlife Protection View All Issues Black Beauty Ranch: Come see and learn about the animals who have found a safe haven at our sanctuary. Learn more » Take Action Toggle submenu Get Involved Action Center Volunteer for Animals Events Cause Partnerships Shop Ways to Give Donate Now Leave a Legacy Give In Memoriam Give a Gift Donation Start a Fundraiser Donate Your Car Donor-advised funds Your actions make a difference! Find ways to take action on the issues you care about most. Visit our Action Center » Get Informed Toggle submenu \"A Humane World\" blog Animal Care Resources Find answers to wildlife problems All Animals magazine HumanePro: Our online resource for animal care professionals Humane Voices Podcast A Humane World: A first-hand account of our ongoing efforts to protect animals, as told by our president and CEO, Kitty Block. Read the latest posts » Careers and Internships Contact Us Donate Careers and Internships Contact Us Donate DONATE Search humaneworld.org Search Common Searches: I'm having trouble affording my pet. What can I do? I have a sick dog [cat, wildlife]. What can I do? What does Humane World for Animals do? Does Humane World for Animals work with my local shelter? How do I make a donation? Meredith Lee\n                  \n                  \n                  /                  Humane World for Animals New name, same mission For over 70 years, we’ve been working to create a better world for animals. You’ve known us as the Humane Society of the United States and Humane Society International. We are Humane World for Animals Now, as we look to our future as Humane World for Animals, we will continue our lifesaving work to tackle the root causes of suffering for animals everywhere. Bold work, global mission Our evolved name allows us to share who we are with greater clarity, impact and depth. We can speak with a stronger, clearer voice and collaborate more effectively across the globe to create permanent change. Why are we changing? This name reflects the way we already work. We collaborate globally as one team to create a better world for animals. With a clear identity, we can reach more people, expand our impact and build a future where all animals are treated with the compassion they deserve. Together, as Humane World for Animals, we’re taking the next big step to ending animal cruelty everywhere. Humane World for Animals Meet our new logo Our new logo for Humane World for Animals is a vibrant reflection of who we are and where we’re headed. The globe-shaped symbol of animals in motion embodies the progress we strive to make. It represents forward progress, building on the legacy of our previous logos while evolving thoughtfully to reflect our bold mission for a kinder, more humane world. More about Humane World for Animals About Us Together, we tackle the root causes of animal cruelty and suffering to create permanent change. Our Mission and Impact We tackle the root causes of animal cruelty and suffering to create permanent change. Our History Here are just a few highlights from our transformative history. With your support, imagine what we can do in the years ahead. Working toward a Humane World A Humane World is the official blog of Humane World for Animals—a first-hand account of our ongoing efforts to protect animals, as told by our president and CEO, Kitty Block. Subscribe for regular updates. Check out the latest stories Jean Chung/HSI Footer menu Careers and Internships Contact Us Donate Global - Social Menu Humane World for Animals Global - Legal Menu About Us Building Community Financials Privacy Policy Media Room Sitemap © 2025 Humane World for Animals is registered as a 501(c)(3) nonprofit organization. Contributions to the Humane World for Animals are tax-deductible to the extent permitted by law. The Humane World for Animals tax identification number is 53-0225390."
    },
    {
      "url": "http://www.nassauhumanesociety.com/news/carvalho.html",
      "text": "Nassau Humane Society Home ADOPT APPLICATION CATS DOGS HAPPY TAILS EVENTS CALENDAR HOW TO HELP DONATE NEW FACILITY BUSINESS PARTNER FOSTER FOSTER APPLICATION KENNEL SPONSOR PET PANTRY PLANNED GIVING PURRFECT PARTNER SECOND CHANCE VOLUNTEER YOUTH VOLUNTEER GROUP VOLUNTEER SPOTLIGHT VOLUNTEER APPLICATION WISHLIST SERVICES ADOPTION CENTER ANIMAL RESCUE SPAY/NEUTER NHS DOG PARK ABOUT US CONTACT US NEWS E-MAIL NEWS EMPLOYMENT Second Chance Store NHS Dog Park Humane Society director leaving Siân Perry, News-Leader With the Nassau Humane Society in the final leg of its capital campaign for a new shelter, Executive Director Brandy Carvalho is leaving for a job with the White Oak Conser-vation Foundation in Yulee. Carvalho announced her resignation in a letter Feb. 21. “I feel very good about what I have done as an employee of the organization and that it is an appropriate time to step aside and allow for someone else to take the reins, preparing NHS for its next phase,” she wrote. “When the new executive director takes over, they will play a lead role in transitioning operationally into the new shelter. Shelter management is not my background, so I think this is a good time for someone to take over,” Carvalho said in an email interview. Carvalho’s professional and educational interests are heavily focused on wildlife and conservation, and she will be pursuing that passion at White Oak, raising funds for conservation projects. “It is a real honor to be returning,” she said. Carvalho was membership manager at White Oak from 2007-10 before the 7,400-acre center for rare and endangered animals – founded by late paper magnate Howard Gilman in 1982 – fell on hard times and was put up for sale. It was purchased in March 2013 for nearly $17 million by Mark Walter, CEO of Chicago-based Guggenheim Partners, LLC, a global financial services firm. John Landregan, NHS board of trustees co-president, said the search for a new executive director will begin immediately and praised Carvalho’s work. “Brandy structured a solid capital campaign program. She conducted presentations in the community and was ‘hands on’ in delivering the capital campaign message to everyone she met. Thanks to those efforts, a groundbreaking ceremony for the new shelter was held Nov. 21 and campaign donations and pledges total $1.650 million to date. The goal is $2 million. Though her last day on the job is March 31, Carvalho will continue to provide support for the campaign, at least through the completion of the new shelter, and will remain as a volunteer, Landregan said. Carvalho has a degree in public relations, with an outside concentration in Wildlife Ecolo-gy & Conservation, a master of public administration and is completing a master of natural resources. She also recently passed the Certified Fundrais-ing Executive exam. Carvalho, who grew up in Yulee and moved to Fernandina after college, has been involved in conservation outreach and education since high school. She is a member of The Girls Gone Green, which promotes awareness of environmental, animal welfare and health issues. Most recently that includes the Hang Up the Foam campaign, working with Jack-sonville Beach restaurants to switch from Styrofoam to eco-friendly containers. “She has a ‘lead by example’ attitude in getting things done,” Landregan said, noting that under Carvalho NHS has enjoyed the greatest number of adoptions in its history. “To demonstrate her animal rescue commitment, Brandy has seven cats of her own. Once again, she ‘walks the talk’ in opening her heart and home to homeless animals,” he said. “Brandy’s contribution to NHS has exceeded my expectations. Her positive and energetic attitude has made each of the NHS board members and volunteers better animal rescue advocates. ... Although we hate to see Brandy leave us as the executive director, we congratulate her on a well-earned promotion.” To learn more about the Nassau Humane Society’s capital campaign visit nassauhumanesociety.com, email executivedirector@nassauhumanesociety.com or call 869-7478. The new shelter will replace the current facility located across from the airport. sperry@fbnewsleader.com About Us Nassau Humane Society is dedicated to the humane treatment of all animals; to alleviate their suffering and neglect, to support the human-animal bond, and to foster an environment in which people respect all living creatures. More ... Adoption Hours Our shelter is open to visitors from: Tuesday through Friday 11:30 AM until 5:00 PM Saturday 11:00 AM until 4:00 PM Sunday 11:00 AM until 3:00 PM We will open other hours for adoption by special request          in an attempt to place an animal in a good home! Links Subscribe to our email newsletter Contact Us Tom Christenson executivedirector @nassauhumanesociety.com Sherry Merritt shelterdirector @nassauhumanesociety.com Adoptions adopt@nassauhumanesociety.com Lee  Parrett dogpark @nassauhumanesociety.com Second Chance Store secondchance @nassauhumanesociety.com Nassau Humane Society PO Box 16090 Fernandina Beach, FL 32035 639 Airport Road Tel: 904.321.1647 Fax: 904.491.8411 Email: adopt@nassauhumanesociety.com Second Chance Store 8 Flags Shopping Center 1002 South 14th Street Fernandina Beach, FL 32034 904-321-0022 Email: secondchance@nassauhumanesociety.com Nassau Humane Society Dog Park 641 Airport Road Fernandina Beach, FL 32034 Tel: 904- 491-1511 Fax: 904.491.8411 Email: dogpark@nassauhumanesociety.com"
    },
    {
      "url": "https://www.jacksonville.com/story/news/local/2013/02/04/nassau-humane-society-hires-executive-director-direct-capital/15839374007/",
      "text": "Nassau Humane Society hires executive director to direct capital campaign News Sports Entertainment Lifestyle Opinion Advertise Obituaries eNewspaper Legals LOCAL Nassau Humane Society hires executive director to direct capital campaign Jim Schoettler FERNANDINA BEACH - When Brandy Carvalho began helping the Nassau County Humane Society's fundraising and marketing efforts as a volunteer last spring, she was hopeful that spending a few hours each week would make a small difference in the agency's efforts to build a new facility. Carvalho is now working at making that small difference a whole lot bigger. The 30-year-old Fernandina Beach woman is in her initial month as the local Humane Society's first executive director since it began operating in 1988. The Humane Society has a $111,000 annual contract for animal-control services with Fernandina Beach and operates as a no-kill shelter and adoption center. It has a capacity for about 70 cats and 30 dogs and is often full. Carvalho's job includes directing a $2 million capital campaign for the new shelter on property adjacent to the current facility next to the airport. She has a wealth of experience in nonprofits, including working as the development manager and education director at Jacksonville's Museum of Science and History. She also was the member services manager at White Oak Conservation Center in Yulee. \"My dream has always been to work at an executive-level position for an animal welfare organization,\" she said. \"I know I can make a difference here.\" John Landregan, president of the Humane Society board, said Carvalho is a perfect match for the job. He said the $35,000 salary will be paid from a variety of fundraising sources, including the Humane Society's thrift store, a fee-based dog park opened in 2009 next to the shelter and various fundraisers. Before Carvalho was hired, fundraising, marketing and related matters were handled by board members and other volunteers. \"We had done all we could and needed someone with a level of expertise who could spend more time on donor development and fundraising activity,\" Landregan said. \"Brandy will be the face of the Humane Society. She has the outgoing personality and drive to get the job done.\" Carvalho and Landregan said the No. 1 priority is replacing the current building, which is more than 40 years old and has no indoor shelter for adult dogs other than a handful of isolation kennels for sick animals, she said. Shelter workers try what they can to make the roof-covered, outdoor pens comfortable, including providing bedding and straw for the dogs in the winter and thick blinds to protect them from the wind and rain. But the conditions are dilapidated, Carvalho said. \"When it's cold, it's cold and when it's hot it's hot,\" Carvalho said. \"We need to have a facility that is 100 percent climate-controlled.\" Landregan said a new facility is long past due. \"It's just not the humane thing to keep dogs in outdoor kennels when we have extreme weather conditions,\" Landregan said. Fernandina Beach officials have committed $500,000 to the capital campaign, which began last year. A variety of fundraisers, donations and money earned at the thrift store and dog park have raised another $375,000. Landregan said he's hopeful to have a builder hired soon. He said once enough money is raised, the shelter would take about a year to build. Carvalho said she has been busy speaking to different groups and potential individual donors and is impressed with the support she has found so far. \"They know that having this new facility will represent how our community feels about animals,\" Carvalho said. Along with her work experience, Carvalho has rescued six cats, including three from the shelter. \"I think how we treat our most vulnerable citizens, which in my eyes are animals and children, really sets the foundation for how we treat each other,\" she said. jim.schoettler@jacksonville.com, (904) 359-4385 Careers Staff Directory Accessibility Sitemap Legals Public notice certification Our Ethical Principles USA TODAY Network Style Guide Responsible Disclosure Subscription Terms & Conditions Advertiser Acceptance Policy Terms of Service Privacy Policy California Notice at Collection Your Privacy Choices Contact Us Support Local Business Advertise Your Business Promote your Event Buy and Sell Licensing & Reprints Legal Notices Help Center Subscriber Guide Manage Account Give Feedback Subscribe Today Newsletters Facebook X Instagram eNewspaper NIE Jobs Real Estate Classifieds Pay Your Ad Bill Shopping 10BEST LocaliQ Digital Marketing Solutions © 2025 www.jacksonville.com. All rights reserved."
    },
    {
      "url": "https://www.nhhumane.org/contact",
      "text": "Contact | New Hampshire Humane Society | Laconia, NH top of page Adopt Browse Pets Cats Dogs About Team Board Cuddly Crew Blog Opportunities Clinic Programs Events Magazine Contact More Use tab to navigate through the menu items. Donate Contact Hours of Operation Sun-Wed: Appointment Only Thu-Sat: Walk-ins welcome 12:00 - 4:00 ​ Appointments can be scheduled once you have filled out an adoption application at NHHumane.org. Once approved, you will be contacted to schedule an appointment. We do have waiting lists for many pets so thank you for your patience. ​ Address: 1305 Meredith Center Road Laconia, NH Our main number is 603-524-3252. To prioritize the pets in our care, we have specific times when we return calls. Please leave a voicemail and someone will return your call as soon as possible. Numerous calls will not speed up that process. To focus on the pets that rely on our small team, email is the best way to inquire. Adoption: adoptions@nhhumane.org Events & Monetary Donations: Fundraising@nhhumane.org Pet Clinic: BestFriend@nhhumane.org Volunteer/Foster: Programs@nhhumane.org K9 Training: Inspire@nhhumane.org National Pet Transports: Intake@nhhumane.org ​ Pet Surrenders & Lost pets: on our programs page Crime: Call the police Emergency: Call an ER Donate Goods / Ask Other Questions: Reception@nhhumane.org Thank you for loving pets! New Hampshire Humane Society is more than a rescue and adoption agency. We are a community of passionate advocates who promote kindness, protect animals, support our community, and value diversity by welcoming families and people of all types and backgrounds. All kind, animal-loving people are welcome here. We are not just accepting. Instead, we are actively antiracist, pro-women, and an LGBTQIA+ welcoming organization. Discrimination and unkindness of any kind will not be tolerated here at any level. New Hampshire Humane Society is a nonprofit 501(c)3 organization and our EIN is 02-6006374. All donations are tax deductible to the extent of the law. ©2023 by New Hampshire Humane Society Address: 1305 Meredith Center Road, Laconia NH 03246 Privacy Policy © 2025 New Hampshire Humane Society bottom of page"
    },
    {
      "url": "https://www.humaneworld.org/en/about-us/our-history",
      "text": "Our History | Humane World for Animals Skip to main content Humane World Humane World About Us Toggle submenu Our Mission and Impact Our History Our New Brand Building Community Media Room How we help local pet shelters and rescue groups Where We Work Toggle submenu Africa South Africa Asia India South Korea Viet Nam Europe Germany Italy Poland Romania United Kingdom Latin America Brazil Costa Rica Mexico Canada United States Australia Issues Toggle submenu Access to Care Animal Rescue and Response Animal Testing and Research Banning Trophy Hunting Dog and Cat Meat Trade End Animal Fighting Equine Protection Farmed Animal Welfare Going Fur-free Helping Captive Wildlife Protecting Dogs and Cats Stopping Puppy Mills Wildlife Protection View All Issues Black Beauty Ranch: Come see and learn about the animals who have found a safe haven at our sanctuary. Learn more » Take Action Toggle submenu Get Involved Action Center Volunteer for Animals Events Cause Partnerships Shop Ways to Give Donate Now Leave a Legacy Give In Memoriam Give a Gift Donation Start a Fundraiser Donate Your Car Donor-advised funds Your actions make a difference! Find ways to take action on the issues you care about most. Visit our Action Center » Get Informed Toggle submenu \"A Humane World\" blog Animal Care Resources Find answers to wildlife problems All Animals magazine HumanePro: Our online resource for animal care professionals Humane Voices Podcast A Humane World: A first-hand account of our ongoing efforts to protect animals, as told by our president and CEO, Kitty Block. Read the latest posts » Careers and Internships Contact Us Donate Careers and Internships Contact Us Donate DONATE Search humaneworld.org Search Common Searches: I'm having trouble affording my pet. What can I do? I have a sick dog [cat, wildlife]. What can I do? What does Humane World for Animals do? Does Humane World for Animals work with my local shelter? How do I make a donation? Stock Our History Here are just a few highlights from our transformative history. With your support, imagine what we can do in the years ahead. Give Now Since 1954, we’ve been at the forefront of the fight to end animal cruelty and suffering. By tackling the root causes of the issue, we’ve driven lasting change for millions of animals around the world. From pioneering laws that protect animals to groundbreaking investigations that expose hidden abuse, our history is a testament to our commitment to creating a more humane world. Breaking new ground 1954 : Our journey began with the founding of the Humane Society of the United States, dedicated to protecting all animals and taking on challenges beyond what local humane societies could tackle. 1958 : We played a key role in passing the Humane Methods of Slaughter Act, the first federal animal welfare law in decades. 1958-1959 : Our first undercover investigations exposed cruel practices in animal research, and we advocated for humane treatment of whales, seals and homeless pets. Advancing our mission 1961 : We launched a decade-long investigation into the treatment of laboratory animals, driving significant policy changes. 1966 : Our work led to the passage of what is now known as the U.S. Animal Welfare Act, protecting animals used in research. 1968 : We began campaigns to protect wild horses and seals. Jo-Anne McArthur/We Animals Media with the Montreal SPCA Expanding our reach 1971 : We fought against cruel predator control methods and helped pass the Wild Free-roaming Horse and Burro Act. 1976 : Our disaster relief program was officially established, positioning our responders to go where we’re needed most. 1981 : Our investigations exposed the cruelty of puppy mills, leading to increased awareness and regulation. 1982 : We helped secure a global moratorium on whaling, protecting countless whales. Moving forward 1991 : We launched Humane Society International, extending our fight for animals worldwide. 1992-1993 : We helped pass key wildlife protection laws, including the International Dolphin Conservation Act. 1996 : Our work influenced the National Organic Standards Board to include humane treatment of animals in organic labeling. Leading with innovation 2000 : We pioneered the use of wildlife contraception to reduce human-animal conflicts, including with elephants in South Africa. 2005 : Our work in the aftermath of Hurricane Katrina set new standards for animal rescue in disasters and helped ensure animals are included in federal disaster response planning. 2008 : A major investigation led to a federal policy change on the slaughter of downed cows, protecting food safety and animal welfare. Humane World for Animals Pigs deserve better. Transforming communities 2011: We launched Pets for Life, a revolutionary access-to-care program to bring veterinary support and other pet resources to underserved communities. 2015: Our legal efforts ended the use of chimpanzees in research, and we successfully pushed Ringling Bros. to stop using elephants in their shows. 2018: We helped pass historic laws in California to improve farm animal welfare and in Florida to end greyhound racing. 2019: We rescued more than 200 koalas, kangaroos and other animals from devastating bushfires in Australia. Molly Tamulevich/The HSUS Continuing the work 2021: Our ongoing advocacy and our award-winning short film Save Ralph led to a ban on cosmetic testing on animals in Mexico, later followed by bans in Canada, Brazil and Chile. 2023 : We successfully defended California’s Proposition 12 at the Supreme Court of the United States, a major win for farm animals. We also removed nearly 4,000 beagles from a laboratory breeding facility in Virginia and banned ivory, elephant and rhino trophies in Canada. 2024 : We played a key role in South Korea’s national ban on the dog meat trade. 2025 : Our organizations began working under a new shared name, Humane World for Animals, to continue driving change for the next 70 years and beyond. Join Us With you by our side, we'll continue to help animals into the future. Sign Up More About Humane World for Animals Our Leadership The Humane World for Animals management team directs the organization’s day-to-day activities, under the Board’s direction and oversight. Our History Here are just a few highlights from our transformative history. With your support, imagine what we can do in the years ahead. New Name, Same Mission We’re uniting under a new name to better reflect who we are, our bold work and our global mission. Working toward a Humane World A Humane World is the official blog of Humane World for Animals—a first-hand account of our ongoing efforts to protect animals, as told by our president and CEO, Kitty Block. Subscribe for regular updates. Check out the latest stories Jean Chung/HSI Footer menu Careers and Internships Contact Us Donate Global - Social Menu Humane World for Animals Global - Legal Menu About Us Building Community Financials Privacy Policy Media Room Sitemap © 2025 Humane World for Animals is registered as a 501(c)(3) nonprofit organization. Contributions to the Humane World for Animals are tax-deductible to the extent permitted by law. The Humane World for Animals tax identification number is 53-0225390."
    }
  ]
}