{
  "fuentes": [
    {
      "url": "https://explorethec.com/directions/",
      "email": "explorethec@lakecunningham.org"
    },
    {
      "url": "https://www.cunninghamparkhomes.co.uk/contact-us/",
      "email": "dsc1@live.co.uk"
    },
    {
      "url": "https://www.9trees.org/about-us",
      "email": "info@9trees.org"
    },
    {
      "url": "https://www.richardcunninghamdevelopment.com/ContactUs",
      "email": "rick@richardcunninghamdevelopment.com"
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "email": "info@inzmo.com"
    },
    {
      "url": "https://www.friendsofcunninghampark.org/contact/",
      "email": "friendsofcunninghampark@yahoo.com"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "boogerd@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "bronsoiler@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "clambaneva@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "gillespie@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "hall@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "joziasse@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "peters@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "ruus@park.bz"
    },
    {
      "url": "https://park.bz/about-us",
      "email": "sharpe@park.bz"
    },
    {
      "url": "https://explorethec.com/lake-c-maps/",
      "email": "explorethec@lakecunningham.org"
    },
    {
      "url": "https://www.cunninghamcontracts.com/contact/",
      "email": "info@cunninghamcontracts.com"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "email": "app-promo-phones@2x.png"
    },
    {
      "url": "https://directory.travelshows.com/usa/gainesville/tourism-board/visit-natural-north-florida",
      "email": "marketplace@travelshows.com"
    },
    {
      "url": "https://directory.travelshows.com/usa/gainesville/tourism-board/visit-natural-north-florida",
      "email": "name@yoursite.com"
    },
    {
      "url": "https://directory.travelshows.com/usa/gainesville/tourism-board/visit-natural-north-florida",
      "email": "yeatter@ncfrpc.org"
    },
    {
      "url": "https://www.nfnclinic.com/",
      "email": "contact@nfnclinic.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "anirudh.shetye@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "beatrice.malle@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "info.nairobi@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "jane@skanem.ke"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "njogu@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "olive.kunihira@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sachen.gudka@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "sameer.gaikwad@skanem.com"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "email": "shamila.mirza@skanem.com"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "email": "info@reception-plus.de"
    },
    {
      "url": "https://www.cunninghampark.org/",
      "email": "jini@cunninghampark.org"
    },
    {
      "url": "https://explorethec.com/",
      "email": "explorethec@lakecunningham.org"
    }
  ],
  "mails": [
    "anirudh.shetye@skanem.com",
    "app-promo-phones@2x.png",
    "beatrice.malle@skanem.com",
    "boogerd@park.bz",
    "bronsoiler@park.bz",
    "clambaneva@park.bz",
    "contact@nfnclinic.com",
    "dsc1@live.co.uk",
    "explorethec@lakecunningham.org",
    "friendsofcunninghampark@yahoo.com",
    "gillespie@park.bz",
    "hall@park.bz",
    "info.nairobi@skanem.com",
    "info@9trees.org",
    "info@cunninghamcontracts.com",
    "info@inzmo.com",
    "info@reception-plus.de",
    "jane@skanem.ke",
    "jini@cunninghampark.org",
    "joziasse@park.bz",
    "marketplace@travelshows.com",
    "name@yoursite.com",
    "njogu@skanem.com",
    "olive.kunihira@skanem.com",
    "peters@park.bz",
    "rick@richardcunninghamdevelopment.com",
    "ruus@park.bz",
    "sachen.gudka@skanem.com",
    "sameer.gaikwad@skanem.com",
    "shamila.mirza@skanem.com",
    "sharpe@park.bz",
    "yeatter@ncfrpc.org"
  ],
  "nombre_sitio": "naturalnorthflorida.com",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://explorethec.com/directions/",
      "text": "Directions - Lake Cunningham Skip to content Facebook Instagram X-twitter Linkedin Shop C Gear Lake Info About Jobs News Park Park FAQs Maps Directions Photos Campgrounds Campground FAQs Campground Events Campground Reservations East C (Full Hookup) Campground West C (Electric Only) Campground Marina Marina FAQs Marina Reservations Marina Rules and Regulations Events Lake C Events Host an Event Activities Rentals Disc Golf Course Shelters Water Recreation Education Youth Programs Contact Lake Info About Jobs News Park Park FAQs Maps Directions Photos Campgrounds Campground FAQs Campground Events Campground Reservations East C (Full Hookup) Campground West C (Electric Only) Campground Marina Marina FAQs Marina Reservations Marina Rules and Regulations Events Lake C Events Host an Event Activities Rentals Disc Golf Course Shelters Water Recreation Education Youth Programs Contact Directions Get to Where You're Going Park Entrances We’re here to help you find the park entrance you’re looking for! Lake Cunningham has four entry points to the park. All entrances feature parking and convenient access to the multi-purpose concrete trail. Entrances are open year-round during park hours of 5:00am-11:00pm. The Campground entrance is open seasonally, typically May-October. Entrance #1 - Marina 8965 State Street, Omaha, NE 68122 Our most popular entrance which features the trademark “lighthouse” the Lake C brand is built around. Entrance #1 offers many amenities for park-goers such as: Boat ramp/boat parking Water equipment loading & unloading zone Access to C Store concessions (Fri & Sat 3-8pm East pedestrian bridge Access to the campground playground Restroom facility Marina Lighthouse Disc golf course Fishing pier Entrance #2 - Overlook 9195 State Street, Omaha, NE 68122 Entrance #2 features a beautiful “overlook” of Lake C. In our opinion, the best view of the lake can be accessed from this entrance. Some of the other amenities this entrance offers are: 1 Small shelter Grill Enclosed portable restroom Easy access to the trail View of the dam and lake Entrance #3 - Garvin Rd & N 96th St 9600 Garvin Road, Omaha, NE 68122 Entrance #3 offers many great amenities and is most known for the accessible kayak launch and the beautiful shelter views! Below you’ll find more amenities you’re looking for! Handicap accessible kayak launch Horseshoes (Dave Van Metre Court) Bocce ball court (Dave Van Metre Court) Fishing dock 2 Small picnic shelters 1 Large picnic shelter Grills Enclosed portable restroom Entrance #4 - North Trailhead Access 9307 Bennington Road, Omaha, NE 68122 Entrance #4 provides convenient access to the north side of Lake Cunningham, making it ideal for those looking to explore the trails, enjoy fishing, or take in a stunning view of the lake from a unique perspective. Trailhead Access Handicap Accessible Fishing Access Historical Markers Campground Entrance 8305 Rainwood Road, Omaha, NE 68122 Open during the campground season, this entrance offers access to our campground patrons. The Campground Entrance features the following: Dump station Freshwater fill station Access to the East C Campground Access to the West C Campground C Store Concessions in the East C (Fri & Sat 3-8pm) Playground Archery Range Entrance 9100 Pawnee Road, Omaha, NE 68122 Featuring a stationary archery range with nine targets and scenic range with eleven 3D lanes. The Lake C archery range is open year-round to the public. Please make sure to check out when archery tournaments take place throughout the year on our events page. 9 target stationary range 11 lane 3D range Open year-round for public use Designated for archer use only Equestrian & Multipurpose Nature Trail Entrance North 96th & HWY 36, Omaha, NE 68122 Lake Cunningham is home to nearly 20 miles of beautiful multipurpose nature trails north of HWY 36 and 96th Street. The trails are open year-round for multipurpose use. We do not offer horse rental services. Equestrian & multipurpose nature trails 19 miles of total trail Parking lot suitable for horse trailers Open year-round for public use Contact Information Office Hours: Monday-Friday 9:00am-4:30pm 8965 State St, Omaha, NE 68122 531-201-5754 explorethec@lakecunningham.org Have Questions? Check out some frequently asked questions. Campground FAQs Marina FAQs Park FAQs Going Camping? Learn more about all of our campgrounds. East C Campground West C Campground Need Directions? We are here to help you get to where you are going. Get Directions Copyright © 2022 Lake Cunningham Development Trust. All rights reserved."
    },
    {
      "url": "https://www.cunninghamparkhomes.co.uk/contact-us/",
      "text": "Contact Us – Cunningham Park Homes Home Our locations Aberdare Box Chase Park – Chippenham Swansea Wallingford Sales Contact Us Select Page Cunningham Park Homes Stunning park homes across Wiltshire, Oxfordshire and South Wales For all enquiries relating to our homes and parks please call Dave Cunningham: General Enquiries: 07831 704 460 Office: 07900 906 120 Click here to email us Contact us Oops! We could not locate your form. © - 2023 - For all enquiries relating to our homes and parks please call Dave Cunningham on 07831 704 460"
    },
    {
      "url": "https://www.9trees.org/about-us",
      "text": "About us - 9Trees CIC Sign In My Account Home Businesses Landowners Impact Events Blog Volunteering About Shop Search Back Shop Trees for Business Trees for People Special Planting Sign In My Account Home Businesses Landowners Impact Events Blog Volunteering About Shop Shop Trees for Business Trees for People Special Planting Search We Plant Trees for You Together we can build beautiful biodiversity Watch the video below to learn more about 9Trees, from its beginning as an abstract idea to the realisation of this idea on the ground and plans for the future. About us 9Trees was formed in 2018 by Michael Cunningham, an experienced habitat and business manager. In 2019 he was joined by Ash Kent, an experienced countryside and habitat manager. We now have a team of amazing volunteers who’ve joined us. Our vision is to tackle climate change by restoring new woodland habitats, promote biodiversity, create jobs within the countryside sector and connect more people to nature. We are a Community Interest Company, ploughing any profits back into good schemes, training and education. Why we are different At 9Trees we plant in the UK, we look after your trees, and we keep you up-to-date with their progress. We continue to look after your trees, so they store as much carbon as possible. Our specialist knowledge in conservation means we’re able to create woodlands that support local wildlife and improve biodiversity. We work with local authorities and organisations to plant on carefully selected land, not destroying vital flower meadows, peat land or other Special Sites of Scientific Interest. We work directly within communities, using local specialists to give your trees the very best start in life. All our trees are native and grown in the UK, with the species of tree chosen to suit each site. Some landowners will even allow you to visit your trees! Meet the Team 9Trees is powered by a dedicated team of individuals working together to combat climate change. Featured Jo Bradley Jo lives in Lancashire and works in stormwater management. She has had a long career in all aspects of pollution control and environment protection, but she recognises the risks of climate change and she enjoys supporting 9Trees so that she can contribute to the creation of new broadleaved woodlands that provide safe habitats for many birds and woodland creatures. Find out more at Jo's LinkedIn page . Bobo Tang Bobo is a web developer and content creator who is passionate about using her skills to make a positive impact on the environment. She believes that technology could be used to promote sustainability and help create a better world. She wants to apply her skills to help 9Trees promote environmental sustainability and make their website more effective and user-friendly. Hannah Davies Hannah is a Creative Marketing Consultant who studied Journalism, Media & Cultural Criticism at Cardiff University. With a background in the creative and cultural industries, she is driven by her passion for making the world a more colourful place, both in nature and our community cultures. At 9Trees, Hannah is utilising her expertise to develop effective marketing and communications strategies that promote the company's commitment to sustainability and environmental responsibility. Eirini Chatzidaki Eirini is an avid hiker who is dedicated to raising awareness about the impact of climate change on the natural world and encouraging companies to play a role in its preservation and protection. With previous experience as a recruiter and a Master's degree in Environmental Sustainability from The University of Edinburgh, she now serves as a business development manager, expanding the network of supporters and driving the growth of tree planting initiatives to maximise their positive impact. Tina Rana Tina has always had an affinity towards the environment and felt great stewardship in regards to its sustainability. Resulting in her acquiring a bachelors in Ecology and Conservation at Brighton University in 2023. At 9Trees, Tina works as a Landowner Survey Assistant, writing desk-based assessments on various proposed sites to determine their compatibility with our planting. She also assists with landowner liaison and coordination. Tara El Kashef Tara is a Master’s student in Anthropology, Environment and Development at UCL with an interest in urban sustainability practices. She believes businesses should play a more active role in natural resource conservation and is enthusiastic to promote this through 9Trees. Tara is one of our volunteer ambassadors, promoting our mission to local venues and public figures who share our values. Volunteering and pro-bono opportunities We have a wide range of volunteering and pro-bono opportunities on offer, ranging from business and social media management to landowner support and tree care. Explore our opportunities Follow us Stay up-to-date with 9Trees and find out some of our great tips to tackle climate change Get started today, please select an option below info@9trees.org Hours volunteer Jobs donate Newsletters Our Supporters FAQ Contact us Feedback Privacy Policy Terms of Service Refund Policy Press Release Enter your email address to receive updates from 9Trees For our past newsletters, click here . Email Address Quarterly newsletter Thank you! Please check your email for a confirmation link. 9Trees Carbon Balancing CIC is a Community Interest Company No. 11982503 limited by guarantee in England and Wales Designed by Aidy & Co"
    },
    {
      "url": "https://www.richardcunninghamdevelopment.com/ContactUs",
      "text": "Contact Us Richard Cunningham Development Building bridges of trust in leadership, communication and service. Richard Cunningham Development Building bridges of trust in leadership, communication and service. Rick Cunningham Speaker    ◊    Trainer   ◊    Facilitator Consultant   ◊    Coach   ◊    Professional Magician It would be my pleasure to talk with you about your needs or event. From speaking and conference keynoting, to training, facilitation, organizational consulting, and coaching -- I welcome an opportunity to help build bridges of trust in your workplace. Please e-mail or call. Or complete the \"Request / Comment\" form. We’ll reply right away. Thank you for your interest and visiting us here. Rick Cunningham rick@richardcunninghamdevelopment.com www.richardcunninghamdevelopment.com 1662 Juno Avenue St. Paul, MN 55116-1415 Phone: (651) 260-0061 Fax: (651) 690-2690 Richard Cunningham Development 1662 Juno Avenue St. Paul, MN 55116-1415 Email Rick Phone: (651) 260-0061 Fax: (651) 690-2690 Self-managed web sites powered by iEditWeb, Inc."
    },
    {
      "url": "https://inzmo.com/deu/en/contact",
      "text": "Contact INZMO: Get in Touch with Us Today! | INZMO English Products Products Hello and welcome! You've just entered a world where insurance isn't just a necessity; it's a path to financial freedom. We're INZMO, and we're more than just insurance. Mobile Phone Insurance From 1.99€ / month Rental Deposit Warranty From 3.25€ / month Bicycle insurance From 4.99€ / month Laptop/Tablet Insurance From 2.99€ / month E-scooter Insurance From 4.17€ / month About us For Partners Submit a claim Submit a claim Submit a claim We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! We're here to help! Whether it's phone, email or chat, let us know what we can help you with today! Contact us As an INZMO customer, there are several easy ways to get in touch with us. We're here to help with any questions you might have! Email us: info@inzmo.com Give us a call: +49 30 31193091 (available 9-17 CET, Monday-Friday; except national holidays) Chat: use our chat option down in the corner of the page to find an answer even faster. Looking to partner with INZMO? Learn about easily offering embedded insurance to your customers. Connect with one of our experts today and get started! Talk with an expert Unleash the revolution - choose the wise alternative Get covered Your e-mail address Submit Subscribe for updates See what's new Get the app Inzmo About us Imprint Products Rental Deposit Warranty Mobile Phone Insurance Laptop/Tablet Insurance Bicycle Insurance E-scooter Insurance Get in touch Contact us Partner with us Careers Legal Terms of Use Privacy Policy Cookie Notice & Policy"
    },
    {
      "url": "https://www.friendsofcunninghampark.org/contact/",
      "text": "Contact Skip to content Dedicated to Maintaining Cunningham Park as the Premier Park of Northeast Queens Home About Us About the Park Nature Activities & Sports Facilities Biking Trail Playgrounds Summer Day Camp Dog Run Tennis Permits Events Photo Gallery Map Contact Support Search Search Search … Search Search Search … Search Search … Menu Home About Us About the Park Nature Activities & Sports Facilities Biking Trail Playgrounds Summer Day Camp Dog Run Tennis Permits Events Photo Gallery Map Contact Support Home » Contact Contact Your Name (required) Your Email (required) Subject What would you like us to send you information about? (check all that apply)? Gardening Opportunities Clean Up Days Events Membership Other Your Message Δ Mailing address: Friends of Cunningham Park, Inc. P.O. Box 660134 Utopia Station Flushing, NY 11366 Phone: (718) 217-6452 Friends of Cunningham Park, Inc. Community Board 8 197-15 Hillside Avenue Hollis, NY 11423 Website developed by Partnerships for Parks, a joint program of City Parks Foundation and NYC Parks. © 2025 All rights reserved. © 2025 – All rights reserved Powered by WP – Designed with the Customizr theme"
    },
    {
      "url": "https://park.bz/about-us",
      "text": "About us - PARK Consulting Academy Coaching Connections Close menu 01 Consulting Building and scaling capabilities 02 Academy Growing tomorrow's leaders 03 Coaching Guiding teams & individuals 04 Connections Connecting peers across the globe Menu About us What’s on News + Opinion Livebook Contact © Park 2025 Privacy Policy About us / Since 1998, PARK has been building and scaling design capabilities for the organisations and people that want to create a better tomorrow. PARK Values Empathetic We know that empathy and understanding is at the heart of good design, good relationships and good business. Challenging We don't shy away from challenging the status quo to maximise value for everyone involved. Partnering We work with clients, not for clients. Co-creation and rapid iteration leads to the best results. Personalised We treat every challenge as unique. We're not a transactional, cookie-cutter consultancy. Accountable We feel a sense of ownership alongside our clients. We see every detail right through to the end. PARK History PARK Consulting was founded in 1998 by Tim Selders and Frans Joziasse. Both experienced designers, they'd both become increasingly frustrated with the disconnect between design and business. They saw an opportunity to bridge the gap by creating a unique proposition that focused on helping leaders to establish design as a business enabler and growth driver. PARK Consulting was born and was an immediate success, finding its niche with early clients including Sony, Kia/Hyundai, LEGO, and HP. Since those early days, the role of Design Leadership has significantly evolved. Today, enabling and driving business growth is just the start. Leaders of design now need to build bridges across touchpoints and functions, develop next-generation capabilities, act as a catalyst for business-wide change and, of course, always do more with less. As the landscape for design leadership has evolved, so has PARK. Regularly viewed as a thought leader in the industry, PARK Consulting has now partnered with over 300 different clients. In 2013, to complement PARK's consulting services, Grow (now known as PARK Academy) was established with the aim of 'empowering design leaders' through education. We're very proud that PARK Academy has since had a positive impact on the careers of more than 2000 Design Management and Design Leadership students across Europe and the USA. In 2023 PARK celebrates its 25th anniversary as the business ownership transitions to James Hall and Andy Sharpe, with Frans Joziasse continuing as an integral part of the leadership team until 2028. We’re also consolidating the business into the 4 services – Consulting, Academy, Coaching and Connections. Looking back, it's been a wonderful 25 years, and we look forward to more of the same. Why 'PARK'? The name PARK stems from the East Gardens of the Imperial Palace near the Marunouchi Business District in Tokyo. A park in which co-founder Frans would spend his lunch break whilst visiting Japan during the 1990s. This park is where locals go to reflect, relax and dream – just a few of the things that we try to facilitate here at PARK. Unique consulting clients partnered since 1998 + Graduates from our PARK Academy since 2013 + Design Managers/Leaders coached annually Design leaders have now participated in a PARK cross-company retreat Timeline PARK is founded PARK Consulting is founded by Frans Joziasse and Tim Selders in the Netherlands and Germany. First client project PARK's first client is Sony Personal Audio Europe, working on their European Design Strategy. Consulting team expands PARK employs its first full-time consultants - Professor Aart van Bezooyen and Assistant Professor Jasper van Kuijk. Growth in adversity PARK sees significant success amidst a global financial crisis, and builds long-term relationships with BMW, LEGO, PANalytical, Grundfos and Reckitt Benckiser. PARK keeps growing PARK expands team to 12 consultants from 8 different nationalities. Grow Academy established Grow, a spin-off of the LEGO Design Academy is founded with the aim of ‘empowering design leaders’ through education in the areas of Design Management and Design Leadership. PARK USA founded PARK goes stateside with the launch of PARK and Grow USA, led by Jay Peters. Design for Humanity launches PARK establishes the Design for Humanity movement, gathering 30 leaders of design in Hamburg for the inaugural D4H retreat. Livebook 2.0 PARK launches a major upgrade of the digital platform used to support the delivery of Grow programmes. PARK hits 2000 graduations Grow celebrates its 2000th student graduation with the delivery of cross-company and in-company programmes in the USA, UK, Germany, Norway, Ireland, Estonia and Slovenia. 25 year anniversary PARK celebrates its 25th anniversary. Company ownership transitions from Frans Joziasse to James Hall and Andy Sharpe. Re-brand and simplification PARK simplifies its service offer and re-brands every touchpoint across the business. Grow becomes PARK Academy. 1998 Meet the team Andy Sharpe Company Director Andy Sharpe Company Director sharpe@park.bz Linkedin Andy is a Senior Consultant and Director at PARK. Originally trained as a product designer, he spent 17 years client-side at Unilever, working in Design Management and Leadership roles in both the UK and USA. After many years as a client of PARK, in 2018 he jumped the fence and in 2023 became a co-owner alongside James Hall. Andy underpins everything he does with a belief – that human progress means keeping things simple. Brian Gillespie Senior Tutor, PARK Academy Brian Gillespie Senior Tutor, PARK Academy gillespie@park.bz Linkedin With his extensive experience in strategic design and managing human-centred, digital products and services, Brian’s end-goal is always about the benefits of great design. He’s collaborated with teams from a diverse range of global organisations, including Audi, Philips, Vanguard, Adidas, Fidelity and JP Morgan Chase. He’s also a coach on our PARK Academy program. Brian holds an MBA in Design Management and serves on the leadership team of the Service Design Network. Carola Boogerd Business Manager Carola Boogerd Business Manager boogerd@park.bz Linkedin In 2008 Carola joined PARK as our office manager. Since then, her role has expanded to cover management of business operations. With her enthusiastic, can-do attitude and an aptitude for listening, she’s facilitated many of our Design Leadership programs, ensuring everything runs smoothly. Denisse Bronsoiler Consultant & Project Manager USA Denisse Bronsoiler Consultant & Project Manager USA bronsoiler@park.bz Linkedin Denisse joined PARK in 2018. Specialising in managing digital projects, Denisse has been responsible for Livebook – our very own e-learning platform. With a background not only in Design Management and Interactive Design, but also finance, Denisse has a creative mind as well as a business one. Consulting clients in strategy and branding, her experience also makes her perfectly suited to our Design Leadership education programs. Frans Joziasse Founding Director Frans Joziasse Founding Director joziasse@park.bz Linkedin As a co-founder of PARK and leader of the organisation over the last 25 years, Frans is proud of the strong vision he has instilled and the inspiring team he has built. With a firm belief in the power of design, he relishes watching his clients reach their full potential and seeing what impact strong leadership can have both on business and the planet. Hans Henrik Ruus Business Visualiser Hans Henrik Ruus Business Visualiser ruus@park.bz Linkedin Hans is a skilled artist and visualiser with a background in advertising. For over a decade, he created campaigns for both Danish and international clients. Hans has the rare ability to draw ‘fluently’, capturing and visualising any idea on the fly during meetings and workshops. Originally working for PARK for many years as a freelancer, Hans joined the team in 2021. James Hall Company Director James Hall Company Director hall@park.bz Linkedin James joined PARK in 2013 following an extensive career in product design at both LEGO and Hasbro. Here he honed his skills in design leadership – directing, managing and launching multiple consumer products worldwide. Today, James not only teaches the Academy programs, but is also a senior consultant and Company Director at PARK. From embracing new design leadership techniques to helping people discover new ways to think, James’ raison d’être is to help his clients reach their goals. Jay Peters Partner, USA Jay Peters Partner, USA peters@park.bz Linkedin Jay is a well-versed design and innovation leadership consultant. With 25 years’ experience in business, brand and design, he’s been coaching PARK clients since 2010 – transforming their businesses, maximising value across the triple bottom line and using collaboration, co-creation and communication to set them up for long term success. Stephan Clambaneva Managing Director, USA Stephan Clambaneva Managing Director, USA clambaneva@park.bz Linkedin At PARK Stephan leads projects that transform our clients’ businesses with innovation and design excellence. He also tutors the Design Leadership Academy. Outside of PARK, Stephan serves on the board of directors of the Industrial Designers Society of America and leads their Special Interest section, ensuring a sustainable future. He also regularly writes articles for Innovation magazine, mentors start-ups and guides the NY Design Week Festival as part of the NYCxDesign Advisory Committee. Stay connected Sign up to the PARK newsletter for our latest insights, news, invitations and events. Services Consulting Academy Coaching Connections Company About us What’s on News + Opinion Contact Livebook © Park 2025 Please rotate to portrait"
    },
    {
      "url": "https://explorethec.com/lake-c-maps/",
      "text": "Lake C Maps - Lake Cunningham Skip to content Facebook Instagram X-twitter Linkedin Shop C Gear Lake Info About Jobs News Park Park FAQs Maps Directions Photos Campgrounds Campground FAQs Campground Events Campground Reservations East C (Full Hookup) Campground West C (Electric Only) Campground Marina Marina FAQs Marina Reservations Marina Rules and Regulations Events Lake C Events Host an Event Activities Rentals Disc Golf Course Shelters Water Recreation Education Youth Programs Contact Lake Info About Jobs News Park Park FAQs Maps Directions Photos Campgrounds Campground FAQs Campground Events Campground Reservations East C (Full Hookup) Campground West C (Electric Only) Campground Marina Marina FAQs Marina Reservations Marina Rules and Regulations Events Lake C Events Host an Event Activities Rentals Disc Golf Course Shelters Water Recreation Education Youth Programs Contact Lake C Maps Come Explore Use the Lake Cunningham map to guide you as you explore the park. From entrances, parking and picnic shelters to campgrounds, amenities and the marina, everything you need to find is incorporated in this map. Printable Map Download and print a copy of our full park map to use as you explore all that Lake Cunningham has to offer. Print Map Park Amenities Enjoy a variety of amenities throughout the park including: 6.2 Mile Concrete Trail Natural Multipurpose Trail 18-Hole Disc Golf Course Lake C Campground Equestrian Trail Archery Range Dave Van Metre Court Kayak & Paddleboard Rentals Fishing Docks Picnic Shelters Campground Playground Campground Concessions View Map \"Lighthouse\" 18-Hole Disc Golf Course The Lake C disc golf course is called the “Lighthouse.” It is open to the public from 5:00am-11:00pm on a first come, first serve basis. Admission is FREE. Don’t forget to bring your own discs! Course Level: Intermediate Elevation: Mostly Hilly Foliage: Scattered Contact Information Office Hours: Monday-Friday 9:00am-4:30pm 8965 State St, Omaha, NE 68122 531-201-5754 explorethec@lakecunningham.org Have Questions? Check out some frequently asked questions. Campground FAQs Marina FAQs Park FAQs Going Camping? Learn more about all of our campgrounds. East C Campground West C Campground Need Directions? We are here to help you get to where you are going. Get Directions Copyright © 2022 Lake Cunningham Development Trust. All rights reserved."
    },
    {
      "url": "https://www.cunninghamcontracts.com/contact/",
      "text": "Cunningham | Contact Us | Get in touch today Skip to Main Content Your privacy is important to us. This website uses cookies to help deliver its services. By using this website, you agree to the use of cookies as outlined in our Privacy Notice . Okay, Got It. Home About About Us Our Board Our History Our Values Sectors Education Fit Out Healthcare Mission Critical Residential Case Studies Our Approach Careers What To Expect Early Careers Experienced Hires Testimonials Talent Network Current Vacancies Careers News Contact About Our Board Our History Our Values Sectors Education Fit Out Healthcare Mission Critical Residential Case Studies Our Approach Careers What To Expect Early Careers Experienced Hires Testimonials Talent Network Current Vacancies News Contact Tel: +353 (0) 190 60997 Home Contact Us Contact Us Get in touch today Our professional team of forward thinking and ambitious people find innovative ways to unleash potential within every project and person, inspiring the next generation of construction professionals and shaping how we perform and the decisions we make. Head Office Suite 5, Providence House Block, 8a Blanchardstown Corporate Park, Blanchardstown, Dublin 15 info@cunninghamcontracts.com +353 (0)190 60997 Support Office 28 Derryboy Road, Carnbane Industrial Estate, Newry, BT35 6FY info@cunninghamcontracts.com +44(0)28 3025 2695 Send us a message Contact Us Full name * Email * Company Name * Message * * by ticking this box you allow us to use the information provided above to get in contact with you. Captcha Send message If you are human, leave this field blank. Δ Copyright © 2025 Cunningham Contracts ◆ Privacy Policy ◆ Modern Slavery Act ◆ Powered by WebsiteNI Copyright © 2025 Cunningham Contracts Privacy Policy ◆ Modern Slavery Act ◆ Powered by WebsiteNI CV Upload Upload CV Full name * Email * Role interested in: * Please Select Adminstration Building Project/Contract Management Civil Engineering Project/Contract Management Commercial Document Control Estimating Finance Human Resources Machine Operatives Planners Plant & Logistics Procurement Message * File Upload * Drop a file here or click to upload Choose File Maximum file size: 67.11MB by ticking this box you allow us to use the information provided above to get in contact with you. Captcha Submit If you are human, leave this field blank. Δ"
    },
    {
      "url": "https://www.nps.gov/aboutus/contactus.htm?StartRow=51&pk=&sn=fe",
      "text": "Contact Us (U.S. National Park Service) An official website of the United States government Here's how you know Here's how you know Official websites use .gov A .gov website belongs to an official government\norganization in the United States. Secure .gov websites use HTTPS A lock ( Lock Locked padlock icon ) or https:// means you've safely connected to\nthe .gov website. Share sensitive information only on official,\nsecure websites. Skip to global NPS navigation Skip to the main content Skip to the footer section National Park Service Search Search This Site All NPS Open Menu Close Menu Explore This Park Explore the National Park Service Exiting nps.gov Cancel About Us Contact Us Contact Us Important Links Frequently Asked Questions Entrance Passes Jobs Pets Help us help you by directing your question to the right people! Before you send an email, check out frequently asked questions , which includes information about the National Park Service, visiting parks (including entrance passes ), and other topics. Parks For information about a specific park (or to report an error on a park webpage), type the park's name into the search box below to get the park's contact information. If you have a park-specific question, it's best to communicate directly with that park. Park names Select a park Abraham Lincoln Birthplace National Historical Park Acadia National Park Adams National Historical Park African American Civil War Memorial African Burial Ground National Monument Agate Fossil Beds National Monument Ala Kahakai National Historic Trail Alagnak Wild River Alaska Public Lands Alcatraz Island Aleutian Islands World War II National Historic Area Alibates Flint Quarries National Monument Allegheny Portage Railroad National Historic Site Amache National Historic Site American Memorial Park Amistad National Recreation Area Anacostia Park Andersonville National Historic Site Andrew Johnson National Historic Site Aniakchak National Monument & Preserve Antietam National Battlefield Apostle Islands National Lakeshore Appalachian National Scenic Trail Appomattox Court House National Historical Park Arches National Park Arkansas Post National Memorial Arlington House, The Robert  E. Lee Memorial Assateague Island National Seashore Aztec Ruins National Monument Badlands National Park Baltimore-Washington Parkway Bandelier National Monument Belmont-Paul Women's Equality National Monument Bent's Old Fort National Historic Site Bering Land Bridge National Preserve Big Bend National Park Big Cypress National Preserve Big Hole National Battlefield Big South Fork National River & Recreation Area Big Thicket National Preserve Bighorn Canyon National Recreation Area Birmingham Civil Rights National Monument Biscayne National Park Black Canyon Of The Gunnison National Park Blackstone River Valley National Historical Park Blackwell School National Historic Site Blue Ridge Parkway Bluestone National Scenic River Booker T Washington National Monument Boston African American National Historic Site Boston Harbor Islands National Recreation Area Boston National Historical Park Brices Cross Roads National Battlefield Site Brown v. Board of Education National Historical Park Bryce Canyon National Park Buck Island Reef National Monument Buffalo National River Butterfield Overland National Historic Trail Cabrillo National Monument California National Historic Trail Camp Nelson National Monument Canaveral National Seashore Cane River Creole National Historical Park Canyon de Chelly National Monument Canyonlands National Park Cape Cod National Seashore Cape Hatteras National Seashore Cape Henry Memorial Part of Colonial National Historical Park Cape Krusenstern National Monument Cape Lookout National Seashore Capitol Hill Parks Capitol Reef National Park Captain John Smith Chesapeake National Historic Trail Capulin Volcano National Monument Carl Sandburg Home National Historic Site Carlisle Federal Indian Boarding School National Monument Carlsbad Caverns National Park Carter G. Woodson Home National Historic Site Casa Grande Ruins National Monument Castillo de San Marcos National Monument Castle Clinton National Monument Castle Mountains National Monument Catoctin Mountain Park Cedar Breaks National Monument Cedar Creek & Belle Grove National Historical Park Chaco Culture National Historical Park Chamizal National Memorial Channel Islands National Park Charles Pinckney National Historic Site Charles Young Buffalo Soldiers National Monument Chattahoochee River National Recreation Area Chesapeake & Ohio Canal National Historical Park Chesapeake Bay Chickamauga & Chattanooga National Military Park Chickasaw National Recreation Area Chiricahua National Monument Christiansted National Historic Site City Of Rocks National Reserve Civil War Defenses of Washington Clara Barton National Historic Site Colonial National Historical Park Colorado National Monument Coltsville National Historical Park Congaree National Park Constitution Gardens Coronado National Memorial Cowpens National Battlefield Crater Lake National Park Craters Of The Moon National Monument & Preserve Cumberland Gap National Historical Park Cumberland Island National Seashore Curecanti National Recreation Area Cuyahoga Valley National Park César E. Chávez National Monument Dayton Aviation Heritage National Historical Park De Soto National Memorial Death Valley National Park Delaware Water Gap National Recreation Area Denali National Park & Preserve Devils Postpile National Monument Devils Tower National Monument Dinosaur National Monument Dry Tortugas National Park Dwight D. Eisenhower Memorial Ebey's Landing National Historical Reserve Edgar Allan Poe National Historic Site Effigy Mounds National Monument Eisenhower National Historic Site El Camino Real de los Tejas National Historic Trail El Camino Real de Tierra Adentro National Historic Trail El Malpais National Monument El Morro National Monument Eleanor Roosevelt National Historic Site Ellis Island Part of Statue of Liberty National Monument Emmett Till and Mamie Till-Mobley National Monument Eugene O'Neill National Historic Site Everglades National Park Federal Hall National Memorial Fire Island National Seashore First Ladies National Historic Site First State National Historical Park Flight 93 National Memorial Florissant Fossil Beds National Monument Ford's Theatre National Historic Site Fort Bowie National Historic Site Fort Caroline National Memorial Fort Davis National Historic Site Fort Donelson National Battlefield Fort Dupont Park Fort Foote Park Fort Frederica National Monument Fort Laramie National Historic Site Fort Larned National Historic Site Fort Matanzas National Monument Fort McHenry National Monument and Historic Shrine Fort Monroe National Monument Fort Necessity National Battlefield Fort Point National Historic Site Fort Pulaski National Monument Fort Raleigh National Historic Site Fort Scott National Historic Site Fort Smith National Historic Site Fort Stanwix National Monument Fort Sumter and Fort Moultrie National Historical Park Fort Union National Monument Fort Union Trading Post National Historic Site Fort Vancouver National Historic Site Fort Washington Park Fossil Butte National Monument Frances Perkins National Monument Franklin Delano Roosevelt Memorial Frederick Douglass National Historic Site Frederick Law Olmsted National Historic Site Fredericksburg & Spotsylvania National Military Park Freedom Riders National Monument Friendship Hill National Historic Site Gates Of The Arctic National Park & Preserve Gateway Arch National Park Gateway National Recreation Area Gauley River National Recreation Area General Grant National Memorial George Rogers Clark National Historical Park George Washington Birthplace National Monument George Washington Carver National Monument George Washington Memorial Parkway Gettysburg National Military Park Gila Cliff Dwellings National Monument Glacier Bay National Park & Preserve Glacier National Park Glen Canyon National Recreation Area Glen Echo Park Gloria Dei Church National Historic Site Golden Gate National Recreation Area Golden Spike National Historical Park Governors Island National Monument Grand Canyon National Park Grand Canyon-Parashant National Monument Grand Portage National Monument Grand Teton National Park Grant-Kohrs Ranch National Historic Site Great Basin National Park Great Egg Harbor River Great Falls Park Great Sand Dunes National Park & Preserve Great Smoky Mountains National Park Green Springs Greenbelt Park Guadalupe Mountains National Park Guilford Courthouse National Military Park Gulf Islands National Seashore Hagerman Fossil Beds National Monument Haleakalā National Park Hamilton Grange National Memorial Hampton National Historic Site Harmony Hall Harpers Ferry National Historical Park Harriet Tubman National Historical Park Harriet Tubman Underground Railroad National Historical Park Harry S Truman National Historic Site Hawaiʻi Volcanoes National Park Herbert Hoover National Historic Site Historic Jamestowne Part of Colonial National Historical Park Home Of Franklin D Roosevelt National Historic Site Homestead National Historical Park Honouliuli National Historic Site Hopewell Culture National Historical Park Hopewell Furnace National Historic Site Horseshoe Bend National Military Park Hot Springs National Park Hovenweep National Monument Hubbell Trading Post National Historic Site Ice Age Floods National Geologic Trail Ice Age National Scenic Trail Independence National Historical Park Indiana Dunes National Park Isle Royale National Park Iñupiat Heritage Center James A Garfield National Historic Site Jean Lafitte National Historical Park and Preserve Jewel Cave National Monument Jimmy Carter National Historical Park John Day Fossil Beds National Monument John Fitzgerald Kennedy National Historic Site John Muir National Historic Site Johnstown Flood National Memorial Joshua Tree National Park Juan Bautista de Anza National Historic Trail Kalaupapa National Historical Park Kaloko-Honokōhau National Historical Park Katahdin Woods and Waters National Monument Katmai National Park & Preserve Kenai Fjords National Park Kenilworth Park & Aquatic Gardens Kennesaw Mountain National Battlefield Park Keweenaw National Historical Park Kings Mountain National Military Park Klondike Gold Rush - Seattle Unit National Historical Park Klondike Gold Rush National Historical Park Knife River Indian Villages National Historic Site Kobuk Valley National Park Korean War Veterans Memorial Lake Clark National Park & Preserve Lake Mead National Recreation Area Lake Meredith National Recreation Area Lake Roosevelt National Recreation Area Lassen Volcanic National Park Lava Beds National Monument LBJ Memorial Grove on the Potomac Lewis & Clark National Historic Trail Lewis and Clark National Historical Park Lincoln Boyhood National Memorial Lincoln Home National Historic Site Lincoln Memorial Little Bighorn Battlefield National Monument Little River Canyon National Preserve Little Rock Central High School National Historic Site Longfellow House Washington's Headquarters National Historic Site Lowell National Historical Park Lower Delaware National Wild and Scenic River Lower East Side Tenement Museum National Historic Site Lyndon B Johnson National Historical Park Maggie L Walker National Historic Site Maine Acadian Culture Mammoth Cave National Park Manassas National Battlefield Park Manhattan Project National Historical Park Manzanar National Historic Site Marsh - Billings - Rockefeller National Historical Park Martin Luther King, Jr. Memorial Martin Luther King, Jr. National Historical Park Martin Van Buren National Historic Site Mary McLeod Bethune Council House National Historic Site Medgar and Myrlie Evers Home National Monument Mesa Verde National Park Mill Springs Battlefield National Monument Minidoka National Historic Site Minute Man National Historical Park Minuteman Missile National Historic Site Mississippi National River & Recreation Area Missouri National Recreational River Mojave National Preserve Monocacy National Battlefield Montezuma Castle National Monument Moores Creek National Battlefield Mormon Pioneer National Historic Trail Morristown National Historical Park Mount Rainier National Park Mount Rushmore National Memorial Muir Woods National Monument Natchez National Historical Park Natchez Trace National Scenic Trail Natchez Trace Parkway National Capital Parks-East National Mall and Memorial Parks National Park of American Samoa National Parks of New York Harbor Natural Bridges National Monument Navajo National Monument New Bedford Whaling National Historical Park New England National Scenic Trail New Jersey Pinelands National Reserve New Orleans Jazz National Historical Park New Philadelphia National Historic Site New River Gorge National Park & Preserve Nez Perce National Historical Park Nicodemus National Historic Site Ninety Six National Historic Site Niobrara National Scenic River Noatak National Preserve North Cascades National Park North Country National Scenic Trail Obed Wild & Scenic River Ocmulgee Mounds National Historical Park Oklahoma City National Memorial Old Spanish National Historic Trail Olympic National Park Oregon Caves National Monument & Preserve Oregon National Historic Trail Organ Pipe Cactus National Monument Overmountain Victory National Historic Trail Oxon Cove  Park & Oxon Hill Farm Ozark National Scenic Riverways Padre Island National Seashore Palo Alto Battlefield National Historical Park Paterson Great Falls National Historical Park Pea Ridge National Military Park Pearl Harbor National Memorial Pecos National Historical Park Pennsylvania Avenue Perry's Victory & International Peace Memorial Petersburg National Battlefield Petrified Forest National Park Petroglyph National Monument Pictured Rocks National Lakeshore Pinnacles National Park Pipe Spring National Monument Pipestone National Monument Piscataway Park Point Reyes National Seashore Pony Express National Historic Trail Port Chicago Naval Magazine National Memorial Potomac Heritage National Scenic Trail Poverty Point National Monument President William Jefferson Clinton Birthplace Home National Historic Site Presidio of San Francisco Prince William Forest Park Pullman National Historical Park Puʻuhonua o Hōnaunau National Historical Park Puʻukoholā Heiau National Historic Site Rainbow Bridge National Monument Reconstruction Era National Historical Park Redwood National and State Parks Richmond National Battlefield Park Rio Grande Wild & Scenic River River Raisin National Battlefield Park Rock Creek Park Rocky Mountain National Park Roger Williams National Memorial Roosevelt Campobello International Park Rosie the Riveter WWII Home Front National Historical Park Russell Cave National Monument Sagamore Hill National Historic Site Saguaro National Park Saint Croix Island International Historic Site Saint Croix National Scenic Riverway Saint Paul's Church National Historic Site Saint-Gaudens National Historical Park Salem Maritime National Historical Park Salinas Pueblo Missions National Monument Salt River Bay National Historical Park and Ecological Preserve San Antonio Missions National Historical Park San Francisco Maritime National Historical Park San Juan Island National Historical Park San Juan National Historic Site Sand Creek Massacre National Historic Site Santa Fe National Historic Trail Santa Monica Mountains National Recreation Area Saratoga National Historical Park Saugus Iron Works National Historic Site Scotts Bluff National Monument Selma To Montgomery National Historic Trail Sequoia & Kings Canyon National Parks Shenandoah National Park Shiloh National Military Park Sitka National Historical Park Sleeping Bear Dunes National Lakeshore Springfield 1908 Race Riot National Monument Springfield Armory National Historic Site Star-Spangled Banner National Historic Trail Statue Of Liberty National Monument Ste. Geneviève National Historical Park Steamtown National Historic Site Stones River National Battlefield Stonewall National Monument Sunset Crater Volcano National Monument Tallgrass Prairie National Preserve Thaddeus Kosciuszko National Memorial The White House and President's Park Theodore Roosevelt Birthplace National Historic Site Theodore Roosevelt Inaugural National Historic Site Theodore Roosevelt Island Theodore Roosevelt National Park Thomas Cole National Historic Site Thomas Edison National Historical Park Thomas Jefferson Memorial Thomas Stone National Historic Site Timpanogos Cave National Monument Timucuan Ecological & Historic Preserve Tonto National Monument Touro Synagogue National Historic Site Trail Of Tears National Historic Trail Tule Lake National Monument Tule Springs Fossil Beds National Monument Tumacácori National Historical Park Tupelo National Battlefield Tuskegee Airmen National Historic Site Tuskegee Institute National Historic Site Tuzigoot National Monument Ulysses S Grant National Historic Site Upper Delaware Scenic & Recreational River Valles Caldera National Preserve Valley Forge National Historical Park Vanderbilt Mansion National Historic Site Vicksburg National Military Park Vietnam Veterans Memorial Virgin Islands Coral Reef National Monument Virgin Islands National Park Voyageurs National Park Waco Mammoth National Monument Walnut Canyon National Monument War In The Pacific National Historical Park Washington Monument Washington-Rochambeau Revolutionary Route National Historic Trail Washita Battlefield National Historic Site Weir Farm National Historical Park Whiskeytown National Recreation Area White Sands National Park Whitman Mission National Historic Site William Howard Taft National Historic Site Wilson's Creek National Battlefield Wind Cave National Park Wing Luke Museum Affiliated Area Wolf Trap National Park for the Performing Arts Women's Rights National Historical Park World War I Memorial World War II Memorial Wrangell - St Elias National Park & Preserve Wright Brothers National Memorial Wupatki National Monument Yellowstone National Park Yorktown Battlefield Part of Colonial National Historical Park Yosemite National Park Yucca House National Monument Yukon - Charley Rivers National Preserve Zion National Park National Park Service Submit a media inquiry (for members of the media) Ask questions about our agency Report errors or technical difficulties Addresses and phone numbers for national and regional offices Freedom of Information Act Customer service standards Additional Links Entrance passes Recreation.gov for many park reservations such as camping Authorized concessioners (see park websites for information about specific services) This Site All NPS Experience Your America. Download the NPS app to navigate the parks on the go. National Park Service U.S. Department of the Interior Accessibility Privacy Policy FOIA Notices Contact The National Park Service NPS FAQ No Fear Act Disclaimer Vulnerability Disclosure Policy USA.gov"
    },
    {
      "url": "https://directory.travelshows.com/usa/gainesville/tourism-board/visit-natural-north-florida",
      "text": "Visit Natural North Florida - Tourism Board - Travel & Tourism Member Login Are you a Travel Agent? Are you a Travel Provider? Home Member Directory Specials Travel Show Events How it Works Join Today Menu Home Member Directory Specials Travel Show Events How it Works Join Today Home United States Florida Gainesville Tourism Board Visit Natural North Florida Visit Natural North Florida Tourism Board Gainesville, Florida, 32653-1603 Send Message Bookmark Compare Previous Shows 2020 Atlanta Travel & Adventure Show End Date: Mar 1, 2020 2021 Atlanta Travel & Adventure Show End Date: Oct 17, 2021 2023 Washington DC Travel & Adventure Show End Date: Feb 5, 2023 2023 Atlanta Travel & Adventure Show End Date: Mar 26, 2023 Overview Specialties (1) Contact Information https://www.naturalnorthflorida.com 2009 NW 67th Place Gainesville,\r\n                                                        FL                    \r\n                                    32653-1603 About Visit Natural North Florida Formed in 1993, Visit Natural North Florida (aka The Original Florida Tourism Task Force) is a governmental entity formed through an interlocal agreement among county governments to promote tourism in north central Florida.  The region encompasses Florida’s Big Bend coastal area, spanning Wakulla County in the west down to Cedar Key/Levy County in the south, east to Gainesville, and north to the Florida-Georgia state line.  The Task Force is a founding partner of the official tourism marketing organization for the state, VISIT FLORIDA.  The mission of Visit Natural North Florida is to promote the natural, historic and cultural attractions of the area in order to increase the number of visitors and to extend their stay.  The goal of the organization is to enhance the economy, image and quality of life of the area through expanded revenues and employment opportunities.  At the same time, Visit Natural North Florida encourages the preservation of the resources which bring focus to the area. Read more Get Directions View On Larger Map Markets Served × Map View Get Directions Cancel Visit Natural North Florida Specialties Destination Marketing Organization (DMO) Request Information » Visit Natural North Florida Share This Page Share Join TAS Newsletter Click to Subscribe About Travel & Tourism Connected Marketplace The # 1 platform to do business in the Tourism Industry. Website About Us How It Works Get Listed Join Travelers Travel Agents & Advisors Travel Providers Travel Media Support Member Login Contact Us Get Listed Today © 2025 Connected Marketplace All Rights Reserved Terms of Use Privacy Policy × Member Login * Email Address * Password Forgot Password? Click to Reset Password Not a Registered Travel Advisor? Access your Free Trial Are You a Travel Provider? List Your Services Now × Join TAS Newsletter The security check was not completed successfully."
    },
    {
      "url": "https://www.nfnclinic.com/",
      "text": "North Florida Naturopathic top of page Services Meet the Team Pricing FAQ Contact More Events Paperwork Supplement Order Form More Use tab to navigate through the menu items. 850.583.0909 Start your journey today we believe in creating Health from the ground up Book an Appointment Service Services We Provide Activator Adjusting Acupuncture Hydrotherapy Infrared Sauna I Iodine 53 Iodine Therapy Individualized Nutrition Supplements Homeopathy Essential Oils Specialized Lab Tests click to learn more Meet The Team Meet the Fiedlers Teegan and Sarah dated and married during medical training at National University of Health Sciences (NUHS) in Chicago, IL. They relocated to Sarah's hometown of Tallahassee, FL in summer of 2018 and founded North Florida Naturopathic. They have two young daughters, Gwendolyn and Avery.  Teegan and Sarah work to bring education and encouragement to patients by equipping them to heal at home. Read Our Full Bios Education Dr. Teegan Fiedler DC, ND Doctor of Naturopathic Medicine (NUHS) 2017 Doctor of Chiropractic (NUHS) 2015 BS in Biomedical Science (NUHS) 2012 ​ Dr. Sarah Fiedler AP, ND Certificate of Chinese Herbal Studies (Academy for Five Element Acupuncture) 2021 Doctor of Naturopathic Medicine (NUHS) 2017​ Master of Science in Acupuncture (NUHS) 2015 BA in Psychology (Furman University) 2011 ​ Our Team At North Florida Naturopathic, we believe in treating the root cause of illness, rather than just its symptoms. Our team of experienced physicians and support staff strive to provide holistic treatment plans that are tailored to each individual’s needs. We understand that the medical office experience can be stressful, which is why our friendly and knowledgeable receptionists are there to help make your visit as pleasant as possible by answering any questions you may have. Roberta Renault Receptionist Lily Nichols Receptionist Saylor Berthiaume Receptionist Ashlyn Bergeron Clinical Assistant About the Clinic: North Florida Naturopathic is the first clinic of its kind, serving North Florida and South Georgia. Established in 2018, we offer a foundational approach to maintaining or regaining wellness. Mission Statement: At North Florida Naturopathic, we offer every patient comprehensive and customized care. We empower and educate you with unique tools to create lasting health. Our Values About the clinic Pricing We are a self-pay clinic and are as transparent as possible with our pricing. Pricing New Comprehensive Patient $350 Designed to provide comprehensive and personalized care. Includes a 60min first office visit and comprehensive health evaluation, as well as a 30min follow up visit within 1-2 weeks, to receive an individualized treatment plan. New Musculoskeletal Patient $175 This visit is for those suffering from back pain, acute injuries, or other physical ailments. The visit is 60min and includes a comprehensive history of the complaint, physical examination, and the first adjustment. New Acupuncture Patient $220 A 90min visit for new patients who have a primary interest in acupuncture and Chinese medicine. Includes history of complaint, physical exam and the first acupuncture session. become our patient About Fees: Unfortunately, we cannot accept insurance at North Florida Naturopathic at this time. A superbill will be provided (upon request) for personal filing with your insurance company. Full payment is due at time of service. Cash, checks & all debit/credit cards are accepted. Health Savings Accounts/Flex cards through insurance will often cover chiropractic adjustments and supplements. However, insurance coverage varies so be sure to check with your insurance provider to determine individual coverage. Patients are responsible for any & all fees associated with treatments regardless of insurance coverage. CANCELLATION POLICY: In order to provide the best care to ALL our patients, we ask that you give us 48hrs notice when canceling appointments (either by email or phone call/voicemail). If your request is not sent in a timely manner, we reserve the right to charge the full cost of the scheduled visit. Loved the personal attention and quick responses from NFN! They are 100% focused on their patients, and listened so attentively to my health concerns and goals. A wonderful team to work with! L.J. I had my first appointment today with Dr. Teegan and Sarah Fiedler, very thorough visit and great listeners! Warm and welcoming environment! I had treatment by Dr. Teegan, and that was amazing!! I have so much more range of motion in my neck. M.M. I have nothing but good things to say about North Florida Naturopathic, Dr. Teegan and Sarah Fiedler.  I can’t believe the difference their treatment has made in my posture and respiratory problems, which were caused by an accident I had 51 years ago. Jody Lee TESTIMONIALS FAQ Contact Us Send Thanks for your interest in NFN! We will be in touch. Hours Contact Information Mon: 8:30a m-5pm Tues: 9am- 6pm Wed: 8:30am-4pm Thurs: 8:30 am -6pm Fri: 9am-4 pm Sat: Closed Sun: Closed 4004 Norton Lane Suite 102 Tallahassee, FL 32308 ​ p. 850.583.0909 f. 850.765.0135 ​ contact@nfnclinic.com Contact us © 2018 by North Florida Naturopathic PLLC. Proudly created with Wix.com bottom of page"
    },
    {
      "url": "https://skanemafrica.com/contact",
      "text": "Contact Skanem | Reach Out to Our Labelling Experts Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message Contact Your thoughts\n matter to us Your feedback is invaluable to us. Whether you have a question, a suggestion, or require support, we are ready to listen and provide solutions. Send us a message We proudly present Skanem Nairobi Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Sachen Gudka Managing Director +254 733 410 309 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Anirudh Shetye Head of Sales & Marketing +254 735 052 700 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email Skanem Nairobi Joyce Njogu Key Account Manager +254 722 804 269 Send email We proudly present Skanem Uganda Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email Skanem Uganda Olive Kunihira Head of Sales +256 759 589 711 Send email We proudly present Skanem Tanzania Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Sameer Gaikwad Site Manager +255 757 803 737 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Beatrice Malle Key Account Manager +255 712 110 922 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Skanem Tanzania Shamila Mirza Key Account Manager +255 717 477 047 Send email Locations Locations Locations How to reach us How to reach us How to reach us How to reach us Skanem Interlabels Nairobi Limited East Africa Headquarters East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa +254 202 471001 info.nairobi@skanem.com Skanem Interlabels Uganda Limited Namanve Industrial Park Mukono Uganda Africa +256 759 589711 olive.kunihira@skanem.com Skanem Tanzania Limited Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa +255 757 803737 sameer.gaikwad@skanem.com Contact us Send us a message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Name Email Message Packaging Categories If your message is related to one of our categories, please select one or more options below. Food Alcoholic Beverages Non-Alcoholic Beverages Personal Care Home Care Automotive Pharmaceutical Industrial Send message Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Creating a responsible future in packaging Locations in Africa Skanem Nairobi East Africa Headquarters 2 Sigona Close Tilisi, Limuru Kenya Africa Skanem Uganda Namanve Industrial Park Mukono Uganda Africa Skanem Tanzania Kangaroo Street Nyerere Road Dar es Salaam Tanzania Africa Contact us info.nairobi@skanem.com Company Websites Skanem Group Skanem India Skanem Norway Guidelines Terms & conditions Whistleblower Privacy Policy Norwegian Transparency Act Social Media LinkedIn Our Blog Skanem Africa Â© 2025 Skanem All rights reserved Products Sustainability menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy Products menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy menu About Sustainability Innovation Quality & Certifications News & Stories Contact Find Product Food Packaging Child Safe Packaging Technical Packaging & Solutions Caps, Closures & Tubes Medical Packaging & Lab Consumables LinkedIn Privacy Policy"
    },
    {
      "url": "https://reception-plus.de/en/contact-us/",
      "text": "Contact us - Reception Plus Home Our services Reception Plus as an employer Job offers About Reception Plus Request Testimonials Contact us FAQ Cooperation Deutsch Deutsch English Contact us Simply use the contact form or our callback service (please enter a telephone number in the “Message” field where we can reach you)! Your data will be transmitted in encrypted form, will only be used for your consultation and will not be passed on to third parties. St Martin Tower Franklinstr. 61- 63 60486 Frankfurt am Main E-Mail: info@reception-plus.de Phone: +49 (0) 69 956 369 – 0 Fax: +49 (0) 69 956 369 -25 Please enable JavaScript in your browser to complete this form. Please enable JavaScript in your browser to complete this form. First name Surname * E-Mail * E-Mail name Surname Nachricht * Datenschutz * I have read and acknowledged the privacy policy. Send form AGB | Imprint | Privacy Policy | contact Hint channel Facebook LinkedIn"
    },
    {
      "url": "https://www.cunninghampark.org/",
      "text": "Homepage - Cunningham Park The Park History Photo Gallery The Pond The Grounds The Hall Press Contact Pond Login The Park History Photo Gallery The Pond The Grounds The Hall Press Contact Pond Login Pond Pass An Exceptional  Place to Visit Cunningham Park is a completely unique place, with the park and all it's amenities available for Milton residents to enjoy, which reinforces Milton’s reputation as an extraordinary community. Learn More Within the park you will find well maintained sports fields, wooded and paved walking trails, open fields, The Community Garden, an enormous pond for swimming, a new toddler play yard and a multi-purpose function hall which offers bowling alleys. The Pond The Pond is more than just a place to cool off; it’s where many of Milton’s children learn to swim, and where summer friends – and memories – have been made for generations. Learn More The Grounds Whether you want to take a scenic walk in the woods, enjoy a winter outdoor skate, watch your children explore the Play Garden, or support your local softball and baseball teams, Cunningham Park has it all. Learn More The Hall Planning your next community event? Look no further than the Cunningham Hall. Learn More Park Hires new General Manager Park New General Manager Tree Planting November 22, 2022 we planted a tree at Cunningham Park by CPF the  Board of Trustees in honor of John Cronin. The tree was donated by a Milton family (who wish to remain anonymous). Read more! Did you know? The pond in Cunningham Park is named in honor of Bill Caldwell who served as Park Manager for nearly five decades until his retirement in 1957. Get In Touch Questions for us? Please reach out, we love to hear from our community and Milton residents. We’re located at:\n75 Edge Hill Road\nMilton, MA 02186 Phone: (617) 696-3263\nFax: (617) 696-8090 \" * \" indicates required fields First Name * Last Name * Email * Phone Comments 75 Edge Hill Road Milton, MA 02186 jini@cunninghampark.org 617-696-3263 ©2025 Cunningham Park"
    },
    {
      "url": "https://explorethec.com/",
      "text": "Home - Lake Cunningham Skip to content Facebook Instagram X-twitter Linkedin Shop C Gear Lake Info About Jobs News Park Park FAQs Maps Directions Photos Campgrounds Campground FAQs Campground Events Campground Reservations East C (Full Hookup) Campground West C (Electric Only) Campground Marina Marina FAQs Marina Reservations Marina Rules and Regulations Events Lake C Events Host an Event Activities Rentals Disc Golf Course Shelters Water Recreation Education Youth Programs Contact Lake Info About Jobs News Park Park FAQs Maps Directions Photos Campgrounds Campground FAQs Campground Events Campground Reservations East C (Full Hookup) Campground West C (Electric Only) Campground Marina Marina FAQs Marina Reservations Marina Rules and Regulations Events Lake C Events Host an Event Activities Rentals Disc Golf Course Shelters Water Recreation Education Youth Programs Contact Explore the C! Escape the city and come explore the beautiful Lake Cunningham where outdoor adventure awaits you. Event Notice: The Lighthouse Disc Golf course will be closed on thanksgiving day (Thursday, November 28th) until noon due to Feast and Feathers Run. Omaha's biggest Christmas light show is coming to Lake C! Join us for opening night on Friday, November 29th and enjoy the festivities through Tuesday, December 31st. Bring the whole family for a magical holiday experience! Purchase Tickets Lake Cunningham is no longer on Health Alert for harmful algae!\n For more information about HAB, visit https://deq-iis.ne.gov/zs/bw/ Welcome to Lake Cunningham Come experience an unforgettable outdoor adventure at Lake Cunningham. Whether you’re walking our newly renovated 6.2 mile trail, booking your picture-perfect stay, or hosting an event, we’ve got a variety of recreational activities to help you have fun and connect with nature. Book Your Stay We’ve got the perfect spot for you! Take advantage of our convenient online registration and get started planning your outdoor adventure. The campground is open from April 18th – November 2nd. Make a reservation Kayak/SUP Rentals We’re teaming up with Neighborhood Offshore once again in 2025 to bring a variety of water recreation services, events, and rentals to Lake Cunningham! Please book in advance. For questions call 402-302-2227. Book Now Interested in a slip? We have a few slips open in our marina if you’re interested in having a boat year-round at Lake Cunningham. Enjoy convenient access to the water and all the beauty of the lake throughout the seasons. Lake C slip info ADVENTURE AWAITS YOU Lake Cunningham is a 390-acre lake surrounded by a 1,050-acre park located in north central Omaha, Nebraska. The lake was constructed by the U.S. Army Corps of Engineers for flood control and recreation and opened to the public in 1977. Recreational activities include camping, no-wake boating, fishing, hiking, bicycling, disc golfing, sail boating, and kayaking. North of Highway 36 also offers an archery range and nature trails where you can horseback ride. The vision for Lake Cunningham was built around creating a positive outdoor experience through programs that fulfill the needs of the area and create lasting memories for individuals and families. Park hours, security & entrances Park hours are 5:00am–11:00pm. All park rules are in conjunction with the City of Omaha and can be found on our Park FAQ page. Safety is a top priority at Lake Cunningham. We will have park security patrolling the park seven days a week and there will be 24/7 video surveillance at park entrances and the marina. Gates at entrances #1, #2 and #3 will be closed when the park closes at 11:00pm and will open again at 5:00am when the park opens. Join our List Sign up for the Lake Cunningham mailing list and receive updates on the latest park improvements, news and events. Volunteer with Us At Lake Cunningham, we welcome volunteers and offer a variety of opportunities to put their time and talent to good use in our park. Please note that individuals under the age of 18 must have written consent of the parent or legal guardian before they may volunteer. If you are interested in becoming a volunteer, please contact us at explorethec@lakecunningham.org for more information. Contact Information Office Hours: Monday-Friday 9:00am-4:30pm 8965 State St, Omaha, NE 68122 531-201-5754 explorethec@lakecunningham.org Have Questions? Check out some frequently asked questions. Campground FAQs Marina FAQs Park FAQs Going Camping? Learn more about all of our campgrounds. East C Campground West C Campground Need Directions? We are here to help you get to where you are going. Get Directions Copyright © 2022 Lake Cunningham Development Trust. All rights reserved."
    }
  ]
}