{
  "fuentes": [
    {
      "url": "https://www.wnbpa.com/about",
      "email": "info@wnbpa.com"
    },
    {
      "url": "https://www.wnbpa.com/about",
      "email": "info@wnbpa.com"
    },
    {
      "url": "https://www.nawb.org/membership/",
      "email": "nawb@nawb.org"
    },
    {
      "url": "https://www.nawb.org/membership/",
      "email": "sharpc@nawb.org"
    },
    {
      "url": "http://www.coab.us/Calendar.aspx?EID=3020",
      "email": "info@coab.us"
    },
    {
      "url": "https://www.kabgallery.com/art-journal/tag/north-shore-art-gallery/",
      "email": "gallery@kabgallery.com.au"
    },
    {
      "url": "https://www.kabgallery.com/art-journal/tag/north-shore-art-gallery/",
      "email": "info@kabgallery.com.au"
    },
    {
      "url": "https://www.kabgallery.com/art-journal/tag/north-shore-art-gallery/",
      "email": "info@kabgallery.com.au"
    },
    {
      "url": "https://www.kabgallery.com/art-journal/tag/north-shore-art-gallery/",
      "email": "sydney@kabgallery.com.au"
    },
    {
      "url": "https://coab.us/806/Art-Gallery",
      "email": "info@coab.us"
    },
    {
      "url": "https://coab.us/806/Art-Gallery",
      "email": "recreation@coab.us"
    },
    {
      "url": "https://www.beachpainting.com/contact/",
      "email": "info@beachpainting.com"
    },
    {
      "url": "https://thenorthwalk.com/contact-us/",
      "email": "info@thenorthwalk.com"
    },
    {
      "url": "https://www.northumberlandcoast-nl.org.uk/contact",
      "email": "info@northumberlandcoast-nl.org.uk"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/north-beaches-art-walk",
      "email": "info@nbaw.org"
    },
    {
      "url": "https://www.nawb.org/about/board-of-directors",
      "email": "nawb@nawb.org"
    },
    {
      "url": "https://www.artwalkporty.co.uk/about-us/",
      "email": "info@artwalkporty.co.uk"
    },
    {
      "url": "https://www.northernbeaches.nsw.gov.au/services/customer-services/contact-us",
      "email": "council@northernbeaches.nsw.gov.au"
    },
    {
      "url": "https://www.nbaw.org/musicians",
      "email": "art@nbaw.org"
    },
    {
      "url": "https://localartwalk.com/contact",
      "email": "info@brigidparsons.com"
    },
    {
      "url": "https://artsed.co.uk/about-us/staff/",
      "email": "cparker-wood@artsed.co.uk"
    },
    {
      "url": "https://artsed.co.uk/about-us/staff/",
      "email": "creynolds@artsed.co.uk"
    },
    {
      "url": "https://artsed.co.uk/about-us/staff/",
      "email": "cswingler@artsed.co.uk"
    },
    {
      "url": "https://artsed.co.uk/about-us/staff/",
      "email": "info@artsed.co.uk"
    },
    {
      "url": "https://artsed.co.uk/about-us/staff/",
      "email": "mferrington@artsed.co.uk"
    },
    {
      "url": "https://artsed.co.uk/about-us/staff/",
      "email": "telzubaidi@artsed.co.uk"
    },
    {
      "url": "https://www.northeastmuseums.org.uk/laing/contact-us",
      "email": "communications@northeastmuseums.org.uk"
    },
    {
      "url": "https://www.northeastmuseums.org.uk/laing/contact-us",
      "email": "info@laingartgallery.org.uk"
    },
    {
      "url": "https://www.northeastmuseums.org.uk/laing/contact-us",
      "email": "learning@laingartgallery.org.uk"
    },
    {
      "url": "https://www.northeastmuseums.org.uk/laing/contact-us",
      "email": "logo-arts-council@2x.png"
    },
    {
      "url": "https://www.northeastmuseums.org.uk/laing/contact-us",
      "email": "logo-laing@2x.png"
    },
    {
      "url": "https://www.northeastmuseums.org.uk/laing/contact-us",
      "email": "volunteering@northeastmuseums.org.uk"
    },
    {
      "url": "https://www.nbaw.org/copy-of-participate",
      "email": "art@nbaw.org"
    },
    {
      "url": "https://www.nawb.org/",
      "email": "nawb@nawb.org"
    }
  ],
  "mails": [
    "art@nbaw.org",
    "communications@northeastmuseums.org.uk",
    "council@northernbeaches.nsw.gov.au",
    "cparker-wood@artsed.co.uk",
    "creynolds@artsed.co.uk",
    "cswingler@artsed.co.uk",
    "gallery@kabgallery.com.au",
    "info@artsed.co.uk",
    "info@artwalkporty.co.uk",
    "info@beachpainting.com",
    "info@brigidparsons.com",
    "info@coab.us",
    "info@kabgallery.com.au",
    "info@laingartgallery.org.uk",
    "info@nbaw.org",
    "info@northumberlandcoast-nl.org.uk",
    "info@thenorthwalk.com",
    "info@wnbpa.com",
    "learning@laingartgallery.org.uk",
    "logo-arts-council@2x.png",
    "logo-laing@2x.png",
    "mferrington@artsed.co.uk",
    "nawb@nawb.org",
    "recreation@coab.us",
    "sharpc@nawb.org",
    "sydney@kabgallery.com.au",
    "telzubaidi@artsed.co.uk",
    "volunteering@northeastmuseums.org.uk"
  ],
  "nombre_sitio": "nbaw.org",
  "origen_extraccion": "Subpaginas_Relevantes",
  "textos_fuente": [
    {
      "url": "https://www.wnbpa.com/about",
      "text": "ABOUT | WNBPA top of page ABOUT US The Women’s National Basketball Players Association (WNBPA) is the union for current women’s professional basketball players in the WNBA. The WNBPA is the first labor union for professional women athletes. It was created in 1998 to protect the rights of players and assist them in achieving their full potential on and off the court. Our Mission is to leverage the collective wisdom and vision of WNBA players and fully commit to affirming, defending, and advancing player interests on and off the court. Through collective bargaining, protest, public service, community engagement, and educational programming, we tirelessly challenge the workplace and societal conditions that stand in the way of our vision of what is possible for our lives and the future of basketball. Moving as one, we prevail. OUR CORE PRINCIPLES WHO WE ARE The WNBPA handles the negotiation of collective bargaining agreements, filing grievances on their behalf, and counseling players on benefits and post-WNBA career opportunities. The WNBPA also serves as a resource for current players, while they are competing internationally during the offseason. ​ The WNBPA encourages players to participate in union activities – including executive leadership roles, team representative positions, and global community outreach initiatives. WHAT WE DO MORE ABOUT WNBPA LEADERSHIP PARTNERSHIPS PLAYERS' MARKET CAREERS We uphold our moral commitments as a labor union of athletes in times of success and hardship. We promote interventions that benefit a common good and respect for ourselves and all labor. INTEGRITY We stand up for what we believe in and do the work that must be done in service to others and to our collective membership. We labor for the love of our community and our sport. SERVANT LEADERSHIP We strive to have our value as elite, global athletes reflected in the economy and society. We create economic opportunities to protect and grow the future and business of basketball for all, and endeavor for holistic fulfillment. INVESTMENT We champion our members, regardless of race, ethnicity, sexual orientation, gender identity or expression, age, religion or spirituality, political or ideological viewpoints, to build consensus and promote a high sense of loyalty among all members. DIVERSITY We engage in educational, legislative, civic, social welfare, community or other activities that will advance and safeguard the economic security and general welfare of WNBA players past, present, and future, and that of our communities. SOCIAL JUSTICE We use our platform to make our collective voices heard and speak truth to power on our own terms AMPLIFICATION We sustain ourselves and our communities in the effort to achieve lasting change. We recognize our work as part of a movement rather than a moment. ENDURANCE BACK TO TOP CBA Negotiations We negotiate the terms of the CBA with the WNBA and ensures that the league and its teams fulfill their obligations. The CBA governs all aspects of players’ employment. More Info Agent Certification We certify, regulate and educate all persons interested in representing WNBA players. More Info Player Programs Independently and in collaboration with management, we offer programs aimed at enhancing the employment, social, and post-playing lives of its members. Contact Us Legal Representation Members can seek our assistance for expert legal advice or representation in disputes, appealing fines or suspensions, and resolving player/agent conflicts Contact Us Liaison with Management At a member's request, we advocate, facilitate, and mediate by bringing their concerns to the team or league to work toward a resolution. Contact Us Other Support Not sure if we can help or have a question? Contact us, and we’ll be happy to assist you. Contact Us CONTACT (212) 655-0880 INFO@WNBPA.COM 1133 AVENUE OF THE AMERICAS NEW YORK, NY 10036 QUICK LINKS SERVICES & RESOURCES PARTNERSHIPS CAREERS ©2025 WOMEN'S NATIONAL BASKETBALL PLAYERS ASSOCIATION HOME ABOUT LEADERSHIP ACTIVE PLAYERS AGENT & CONTRACTS THE CBA PLAYERS MARKET CONTACT Menu (212) 655 - 0880 CLOSE HOME ABOUT LEADERSHIP ACTIVE PLAYERS AGENT & CONTRACTS THE CBA PLAYERS MARKET CONTACT bottom of page"
    },
    {
      "url": "https://www.nawb.org/membership/",
      "text": "Become a Member | NAWB Partner with NAWB Become a Member Member Portal Skip to content Toggle navigation Home About About NAWB Our Board Our Team National Partners Vision Partners Regional Liaisons Tools & Resources Insights & Publications Events Career Center RFP Center Professional Development Marketplace Strategy in Action Generative AI for the Workforce Work-Based Learning Economic Mobility Advancing the Skills Economy Previous Initiatives Advocacy Workforce Advocacy Legislative Agenda Policy Statements and Advocacy Alerts Resources and Tools Coalitions Events Events The Forum 2026 The Latest Member Login Become a Member Fostering Workforce Innovation Together For almost 50 years, workforce development boards have looked to NAWB for leadership. Many challenges sit on our horizon. Federal funding and public systems are experiencing unprecedented uncertainty and disruption. AI and technology continue to accelerate the pace of change. The structure of the workforce is shifting, as are business needs. Individually, it is almost impossible to track and address all the issues at play. No single board can track and address these issues alone, but together, we can. At NAWB, we move beyond compliance to build a workforce system that is innovative, strategic, and ready for the future. NAWB IS YOUR PARTNER, YOUR VOICE, YOUR ASSOCIATION NAWB is your voice on Capitol Hill, advocating for workforce legislation and policy. Together, we foster long-time relationships with the federal agencies who directly impact our network. We gather together virtually and in-person to set the national workforce agenda, to share best practices, to collaborate and promote creative and innovative ways to improve the workforce system. Together, we create change to improve the lives of American job seekers. Our work with partners like Walmart, Best Buy, and Microsoft is helping to drive change in the workforce landscape. Together, we are developing innovative ways to shape the future of work. Initiatives like Family Centered Employment, Skills-Based Hiring, Learning and Employment Records (LER), AI tools, and SNAP Employment & Training build a diversified collection of resources our members can at access any time. Join now! Your organization is leading change in workforce development. NAWB is here to help you forge the path ahead. Member Benefits include: Advocacy Programs Communications Professional Development National Partnerships Training Membership categories Local or State Workforce Boards NAWB is the only association in the nation that represents and advocates for every local, state, and U.S. territory workforce board. When your organization joins, everyone benefits! Membership extends to your full Board of Directors, local elected officials, and staff. Membership is organization-based , making it easy for your entire team to access the resources, connections, and advocacy that NAWB provides. Dues are determined by your board’s total revenue , ensuring fairness across organizations of all sizes. Already a member? Visit our Member Portal to explore your organization’s profile and take advantage of your benefits. State and Regional Workforce Associations Workforce associations play a vital role in strengthening local workforce networks, and NAWB is here to support them. By joining NAWB, workforce associations gain the tools and resources they need to: Connect with a national community of workforce leaders and advocates Learn from innovative practices, policy updates, and peer insights Grow through collaboration, visibility, and influence at the national level Together, we can amplify your impact and ensure your workforce association’s voice is heard. Affiliates Our Affiliate Memberships bring together businesses, government agencies, nonprofits, and educational institutions that share a commitment to workforce development and the success of our community. As an Affiliate member, you’ll have the opportunity to: Learn: Access resources, insights, and best practices shaping the future of work Connect: Build relationships with workforce leaders, employers, and community partners Partner: Collaborate on initiatives that strengthen talent pipelines and support local growth Grow: Expand your impact while enhancing your visibility as a workforce champion Join us in advancing opportunities, building partnerships, and shaping the workforce of tomorrow. Annual Dues Tiers for Workforce Boards Revenue Dues Amount Less than $2M $750 $2-4.9M $1,000 $5-14.9M $2,000 $15-24.9M $3,000 $25-49.9M $5,000 $50-99.9M $7,000 $100M+ $9,000 State or Regional Workforce Association: contact our Director of Membership for pricing State or Regional Affiliate: $1500 National Affiliate: $2000 Membership FAQs Now more than ever is the time for us to stand together. We look forward to standing with you. Want to talk about it with our Director of Membership? Contact Us Locate Us: 1155 15th Street NW Suite 725 Washington, DC 20005 Contact Us: P: 202.857.7900 F: 202.857.7955 E: nawb@nawb.org Connect with Us: Subscribe Be Involved: Become a Member Speaking Requests Media Request © 2025 National Association of Workforce Boards | Privacy Policy | Careers"
    },
    {
      "url": "http://www.coab.us/Calendar.aspx?EID=3020",
      "text": "Calendar • North Beaches Art Walk Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Home Calendar Calendar View all calendars is the default. Choose Select a Calendar to view a specific calendar. Select the arrows on either side of the current month to change the month. List Week Month Subscribe to iCalendar Print Notify Me Find a Facility Search Calendars by: Start Date End Date Enter Search Terms Show Past Events Select a Calendar Select Calendar/Calendars to filter All Calendars City Calendar Public Utilities Calendar Recreation and Special Events Search Return to Previous Event Details Date: July 21, 2016 2016-07-21T18:00:00 Time: 6:00 PM - 9:00 PM Location: \"Where Atlantic Blvd meets the ocean\"! Address: Atlantic Beach , FL 32233 North Beaches Art Walk Thursday, July 21, 2016 Several artists of different mediums line Atlantic Blvd. in Atlantic and Neptune Beaches tonight from 6 - 9 pm.  Come out and see what our local artists have created. Support the local businesses and socialize with your neighbors and friends.  See you at the beaches. Map Agenda Facility Submit Event Print Email Event Subscription View RSS Feeds Select on Calendar Expand Collapse Previous Next Down Up Map Share Show more Agenda Live Edit Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.kabgallery.com/art-journal/tag/north-shore-art-gallery/",
      "text": "North Shore Art Gallery – KAB Gallery Skip to content Over a decade of Art: Est. 2013 About KAB KAB Gallery Sydney is Moving to Neutral Bay! KAB Gallery Trading Hours and Days 2025 About KAB Gallery – Est. 2013 About Our Director Kerry-Anne Blanket Meet the KAB Gallery Team Give an e-Gift Card Artist Information Catalogue Registration Join the KAB Team- Employment Curated Collections Art Under $1500 Abstract Art Birds Boats Figurative Art Beach Girls by Sally West I Love Sydney Balmoral Bondi Manly Sydney Ferries Free Shipping – BUY NOW Pop Country Style and Australian Heritage SALE Still Life Flora Coastal Inspired Marine Life Central Coast Inspired Palm Trees Pacific Palms The Powerful Ocean Wall Hangings Winter, Ski & Snow Shop for Art All Art Easy Price Tiers Art Under $3000 Art Under $1500 Give an e-Gift Card Shop by Medium Oil Paintings Acrylic Paintings Works on Paper Sally West – Oil on Oil Paper Works Ceramics Mixed Media Collectable Prints Sculpture and Design Objects Artists Books NFTs The Sale Room Exhibitions The Sale Room Sally West – Beach Series Art Services Art Consultation – Collection Management Restoration, Art Conservation & Valuations Gift Registries Artwork Laybys Information for International Clients Portrait Commissions Pet Portraits Give an e-Gift Card Art Journal KAB Gallery’s Blog KAB In the Press KAB Gallery Sydney is Moving to Neutral Bay! Contact KAB Gallery Sydney is Moving to Neutral Bay! Contact Us Catalogue Registration GIFT CARDS Start Here About KAB KAB Gallery Sydney is Moving to Neutral Bay! KAB Gallery Trading Hours and Days 2025 About KAB Gallery – Est. 2013 About Our Director Kerry-Anne Blanket Meet the KAB Gallery Team Give an e-Gift Card Artist Information Catalogue Registration Join the KAB Team- Employment Curated Collections Art Under $1500 Abstract Art Birds Boats Figurative Art Beach Girls by Sally West I Love Sydney Balmoral Bondi Manly Sydney Ferries Free Shipping – BUY NOW Pop Country Style and Australian Heritage SALE Still Life Flora Coastal Inspired Marine Life Central Coast Inspired Palm Trees Pacific Palms The Powerful Ocean Wall Hangings Winter, Ski & Snow Shop for Art All Art Easy Price Tiers Art Under $3000 Art Under $1500 Give an e-Gift Card Shop by Medium Oil Paintings Acrylic Paintings Works on Paper Sally West – Oil on Oil Paper Works Ceramics Mixed Media Collectable Prints Sculpture and Design Objects Artists Books NFTs The Sale Room Exhibitions The Sale Room Sally West – Beach Series Art Services Art Consultation – Collection Management Restoration, Art Conservation & Valuations Gift Registries Artwork Laybys Information for International Clients Portrait Commissions Pet Portraits Give an e-Gift Card Art Journal KAB Gallery’s Blog KAB In the Press KAB Gallery Sydney is Moving to Neutral Bay! Contact KAB Gallery Sydney is Moving to Neutral Bay! Contact Us Catalogue Registration GIFT CARDS Start Here Search View all matching artworks Generic filters Hidden label Hidden label Hidden label Hidden label Watercolour is alive — it moves, drips, and splashes in ways that feel almost beyond control For Kelly-Anne Love, watercolour is alive — it moves, drips, and splashes in ways that feel almost beyond control. “It has a mind of its own,” she says, “and you’re just helping guide it to the right place.” Unlike many artists who use watercolour in… Posted on August 21, 2025 More Make a Statement with Helena McConochie’s Large Peony Painting If you’re looking for a statement artwork to feature in your home, this new art arrival at KAB Gallery Sydney is a must-see.   We have it hanging proudly at the entrance of our Pymble art gallery for you to view in person. (More info… Posted on September 26, 2024 More Still Waters in Paint Visit KAB Gallery to see and enjoy the contemporary art of Cathryn McEwen. Each of her detailed paintings are water subjects from her incandescent water series. This is your opportunity to refresh your space with some watery scenes presented in an on-trend and contemporary style.  While… Posted on September 12, 2024 More Celebrate Spring with ‘Clementine’ by Helena McConochie This week I would like to focus your attention on Helena McConochie’s ‘Clementine’, a contemporary oil painting on exhibition at KAB Gallery Sydney. The painting features a larger than life sized Peony bloom and is a highlight of the gallery right now.  This lush floral scene of white petals set… Posted on August 21, 2024 More ‘Paris’ – Blooming Delight at KAB Gallery Sydney by Helena McConochie Helena McConochie is a renowned Australian artist known for her evocative depictions of flora, which imbue any space with a sense of warmth and vitality. Her style draws inspiration from classical masters Johannes Vermeer and Henri Rosseau, as well as the modernist artist Georgia O’Keefe.… Posted on August 8, 2024 More Introducing Aurora Paulina Kay: Unveiling a World of Colour and Emotion at KAB Gallery Aurora Paulina Kay’s paintings are full of detail, and bursting with joy. Her distinct painting style is characterised by intricately applied layers of various colour combinations. When looking at her art you are taken to present-day scenes of some of Sydney’s most picturesque landmarks, yet… Posted on May 6, 2024 More Original Paintings of Manly Beach at KAB Gallery: A Haven for Northern Beaches Art Enthusiasts Nestled in the heart of Sydney’s North Shore suburb of Pymble, KAB Gallery Sydney beckons art aficionados from Manly, Balgowlah, Newport, Avalon, Palm Beach and beyond to explore its curated collection of contemporary original artworks. While our Sydney gallery may not overlook the sands of… Posted on March 18, 2024 More Why a Painting of Sydney’s North Shore or Neutral Bay Belongs in Your Home So many people have fallen in love with the views of Sydney from Neutral Bay, making paintings of the harbour from the Neutral Bay aspect somewhat of a local must-have piece. Here at KAB Gallery we know first-hand that artworks of Sydney Harbour and the local parks… Posted on February 22, 2024 More Textured Art – Impasto Style Impasto painting is a technique in which paint is applied to a surface in thick, textured layers, creating a three-dimensional effect. The term “impasto” comes from the Italian word for “paste” or “dough,” reflecting the thick and heavy quality of the paint. It is a… Posted on July 31, 2023 More Escape to Italy – and feel it too! Jacki Fewtrell-Gobert, perhaps in the most special way, grants us the gift of teleportation. She is one of those artists that can transport you across the world in a simple swish of her brush. Her new painting, ‘Late Lunch Near the Pantheon,’ now showing at… Posted on May 2, 2023 More A style that saturates the colours of our everyday reality Complex, ornamental, and uniquely rich in colour, Katerina Apale paints with a passion that undoubtedly showcases the essence of Australia. After moving from Latvia to the sunny east coast of Australia, Apale was presented with an entirely new array of flora and fauna. So vastly different… Posted on April 11, 2023 More The Thrill of the Chase: Spotto, but make it Pink! “A few years ago, I was walking through Surry Hills. It was mid-morning, sunny with strong shadows. I saw a pink truck in a laneway, and it immediately grabbed my attention. I knew I had to paint it. So, I did. This led me to… Posted on May 16, 2022 More EXPLORE KAB GALLERY About KAB KAB Gallery Sydney is Moving to Neutral Bay! KAB Gallery Trading Hours and Days 2025 About KAB Gallery – Est. 2013 About Our Director Kerry-Anne Blanket Meet the KAB Gallery Team Give an e-Gift Card Artist Information Catalogue Registration Join the KAB Team- Employment Curated Collections Art Under $1500 Abstract Art Birds Boats Figurative Art Beach Girls by Sally West I Love Sydney Balmoral Bondi Manly Sydney Ferries Free Shipping – BUY NOW Pop Country Style and Australian Heritage SALE Still Life Flora Coastal Inspired Marine Life Central Coast Inspired Palm Trees Pacific Palms The Powerful Ocean Wall Hangings Winter, Ski & Snow Shop for Art All Art Easy Price Tiers Art Under $3000 Art Under $1500 Give an e-Gift Card Shop by Medium Oil Paintings Acrylic Paintings Works on Paper Sally West – Oil on Oil Paper Works Ceramics Mixed Media Collectable Prints Sculpture and Design Objects Artists Books NFTs The Sale Room Exhibitions The Sale Room Sally West – Beach Series Art Services Art Consultation – Collection Management Restoration, Art Conservation & Valuations Gift Registries Artwork Laybys Information for International Clients Portrait Commissions Pet Portraits Give an e-Gift Card Art Journal KAB Gallery’s Blog KAB In the Press KAB Gallery Sydney is Moving to Neutral Bay! Contact KAB Gallery Sydney is Moving to Neutral Bay! Contact Us Catalogue Registration GIFT CARDS Start Here Art lovers are saying... Our beautiful painting arrived yesterday in perfect condition and it was well received... Thank you for making the process so easy and fun Jim Carr Florida, USA 2018-06-12T01:06:39+00:00 Jim Carr Florida, USA Our beautiful painting arrived yesterday in perfect condition and it was well received... Thank you for making the process so easy and fun https://www.kabgallery.com/art-journal/testimonials/jim-carr/ Such a beautiful gallery with wonderful art pieces. Knowledgeable staff are great too. Carey Wood Australia 5.0 2018-06-12T01:10:22+00:00 Carey Wood Australia Such a beautiful gallery with wonderful art pieces. Knowledgeable staff are great too. https://www.kabgallery.com/art-journal/testimonials/facebook-1/ My artwork arrived today - it's gorgeous! Thanks for your quick service. Elizabeth Weston Australia 2018-06-12T01:14:28+00:00 Elizabeth Weston Australia My artwork arrived today - it's gorgeous! Thanks for your quick service. https://www.kabgallery.com/art-journal/testimonials/elizabeth-weston/ I am in love with each and every painting! They bring me such joy every time I look at them. I continue to browse your online gallery and Instagram, I am looking forward to purchasing more from your gallery in the future. Wafa Dubai 2018-06-12T01:23:44+00:00 Wafa Dubai I am in love with each and every painting! They bring me such joy every time I look at them. I continue to browse your online gallery and Instagram, I am looking forward to purchasing more from your gallery in the future. https://www.kabgallery.com/art-journal/testimonials/wafa/ Writing to let you know the painting arrived today and everything is perfect! Thank you for your help in this, I really like the piece :-) I am glad that Google decided to include your gallery when I searched for \"Local Art Galleries\" a few weeks ago. Thanks again! River Finken California, USA 2018-06-12T01:34:45+00:00 River Finken California, USA Writing to let you know the painting arrived today and everything is perfect! Thank you for your help in this, I really like the piece :-) I am glad that Google decided to include your gallery when I searched for \"Local Art Galleries\" a few weeks ago. Thanks again! https://www.kabgallery.com/art-journal/testimonials/river/ Thank you SO much for the quick follow up and I’m excited already before seeing the new artworks arrived. Ms Karman Wong Hong Kong 2019-05-29T15:18:35+00:00 Ms Karman Wong Hong Kong Thank you SO much for the quick follow up and I’m excited already before seeing the new artworks arrived. https://www.kabgallery.com/art-journal/testimonials/karman/ We couldn't be any happier with this whole process. We can't thank you enough for all your hard work on our behalf, it's been such an absolute delight. Carla Melbourne 2019-05-29T15:21:10+00:00 Carla Melbourne We couldn't be any happier with this whole process. We can't thank you enough for all your hard work on our behalf, it's been such an absolute delight. https://www.kabgallery.com/art-journal/testimonials/carla/ Kerry helped me choose my art in such an enthusiastic, loving way. I immediately knew this was someone who genuinely cares about art. Carice Van Houten (Actor: Game of Thrones) Amsterdam 2018-06-12T00:53:05+00:00 Carice Van Houten (Actor: Game of Thrones) Amsterdam Kerry helped me choose my art in such an enthusiastic, loving way. I immediately knew this was someone who genuinely cares about art. https://www.kabgallery.com/art-journal/testimonials/carice/ The piece arrived in rainy Toronto today in perfect condition. What a stunning piece! – brought a smile to my face and summer Australian sunny warmth into our home. Thank you again for connecting with me and making arrangements to ship the piece so quickly. Stacey Jandciu Toronto, Canada 2018-06-12T00:59:50+00:00 Stacey Jandciu Toronto, Canada The piece arrived in rainy Toronto today in perfect condition. What a stunning piece! – brought a smile to my face and summer Australian sunny warmth into our home. Thank you again for connecting with me and making arrangements to ship the piece so quickly. https://www.kabgallery.com/art-journal/testimonials/201948/ 5 Stars experience with KAB Gallery from Europe (Belgium) I contacted KAB Gallery to acquire one painting and Kerry-Anne managed my request with great professionalism and attention. Laurent Belgium 5.0 2024-07-24T09:42:19+00:00 Laurent Belgium 5 Stars experience with KAB Gallery from Europe (Belgium) I contacted KAB Gallery to acquire one painting and Kerry-Anne managed my request with great professionalism and attention. https://www.kabgallery.com/art-journal/testimonials/laurent/ 1.0 10 Proudly Supporting Awards & Recognition Contact Us 1300 78 7773 info@KABGallery.com.au ABN: 70 164 535 817 Join Our Socials Facebook Twitter Instagram Pinterest LinkedIn Where Are We KAB Gallery Terrigal (MORE INFO) Crowne Plaza Hotel 40 Terrigal Esp, Terrigal NSW 2260 Australia KAB Gallery Sydney (MORE INFO) 977 Pacific Highway, Pymble NSW 2073 Australia Privacy Policy Information for Purchasers, Delivery Policy, Refund Policy KAB Gallery © 2013-2020. All rights reserved. KAB Gallery Terrigal KAB Gallery Terrigal opened in 2013, the life-long dream of Director and Gallery Curator Kerry-Anne Blanket who has spent her career appraising, selling and educating about art. Located on the beachfront underneath the well-known 4-star hotel landmark of Crowne Plaza Terrigal, KAB Gallery Terrigal provides a full suite of gallery and art related services from this gorgeous space overlooking the famous Terrigal Beach. Located just an hours drive north from Sydney, KAB Gallery Terrigal is our flagship gallery open 7 days a week. Our rotating exhibition of some of Australia's best collectable and contemporary art changes regularly, and there's always something to suit all tastes. Standard Opening Hours Monday - Saturday: 10am - 4pm Sunday: 10am - 3pm Contact Details Address: Crowne Plaza Terrigal, 40 Terrigal Esp Terrigal NSW 2260 Call: 1300 78 7773 (intl: +612 4312 5114) Email: gallery@KABGallery.com.au KAB Gallery Sydney KAB Gallery Sydney opened in 2020 as a second gallery and art consultancy space of the KAB Gallery brand. Our original Terrigal gallery opened in 2013, the life-long dream of Director and Gallery Curator Kerry-Anne Blanket who has spent her career appraising, selling and educating about art. Located in the most visible position on one of Sydney's busiest road, KAB Gallery Sydney in Pymble offers a revolving exhibition of Australia's best collectable and contemporary art, along with an expert art consulting service and other related services. Next to Pymble train station and with a large carpark directly behind us, KAB Gallery Sydney is so easy to visit for everyone throughout Sydney. Standard Opening Hours Monday, Tuesday: Closed Wednesday, Thursday: 11am - 4pm Friday: 11am - 6pm Saturday: 10am - 3pm Sunday: Closed Contact Details Address: 977 Pacific Highway Pymble NSW 2073 Call: 1300 78 7773 (intl: +612 9199 9623) Email: sydney@KABGallery.com.au Not ready to apply just yet? Did you know that we offer artist support services? Receive real-time advice and coaching to fine-tune your professional process for gaining gallery representation. Have your questions answered and be provided with real industry strategies to ensure you are taking the best next steps to present your work for sale. Sessions have now re-opened for video call bookings . Do you want to take the next step in your art practise? Book now click"
    },
    {
      "url": "https://coab.us/806/Art-Gallery",
      "text": "Art Gallery  | The Atlantic Beach Official Website! Skip to Main Content City Hall Departments Parks & Recreation Resident Hub About Us Contact Us Search Art Gallery Arts, Recreation, and Culture Committee Cultural Arts & Recreation Grant Program Class Schedule Events Calendar Acoustic Nights Artisans' Faire Atlantic Beach Farmers' Market Fall Festival Family Fun Day & Campout Under the Stars Twilight Movies in the Park Songwriters Concerts Permits & Rentals Permits Rentals Reserve a Wheelchair Special Event Request Programs Theater Youth Council Youth Sports Recreation Resources Beach Wheelchairs & ADA Access ADA Beach Access Map Atlantic Beach Dog Park Beaches Town Center Greater Jacksonville Paddling Guide North Beaches Art Walk Parks Visit Jacksonville Tennis in Atlantic Beach Volunteer! Home Departments Neighborhoods Department Recreation Division Art Gallery Art Gallery Enjoy the exhibits at The Adele Grage Gallery (716 Ocean Blvd.) with a featured monthly artist of photography or paintings of different mediums.  Monday - Friday 8 a.m. - 5 p.m. Our exhibits are currently booked through 2025. You can reserve a spot online for dates in 2026 at www.coab.us/recpermits . Contact the Recreation Division at recreation@coab.us or call 904-247-5828 for information. MONTHLY FEATURED ARTIST @ ADELE GRAGE WILL BE ON EXHIBIT 716 Ocean Blvd., Atlantic Beach SEPTEMBER GALLERY The Art Reception will be held on Tuesday, September 16, from 5 - 8 p.m. Palace Treasures: Where East Meets West Step into a captivating exhibition, showcasing a unique blend of Eastern and Western traditions. Curated by Rhett Farber—a local AB resident who grew up here, lived in Asia during 1981-2014, and worked at the world-famous National Palace Museum during 1982-1989. The display features  print editions based on original paintings from the National Palace Museum, rare stone rubbings taken from Emei Mountain carvings in western China (which were destroyed during the Cultural Revolution), vintage hanging scroll paintings by Beijing masters, and more. This thoughtfully assembled exhibition offers a unique cultural journey through time, tradition, and artistic exchange. Curated by Rhett Farber 1 1 of 4 Four Horses 2 4 of 4 Four Horses 3 Apes at Play 4 God of Wine (2) 5 God of Wine 6 Lau Lai Nan 7 Lohan 8 Poetic Introduction to the Lou-Shou Hall 9 Zhong Kui October 2025 - Roseann Egidio October 2025 - Roseann Egidio 1 370755859_324081250192317_91226507375969631_n 2 IMG_1294 3 375765560_329094589690983_295299076571444743_n Upcoming Art Exhibits: July 2025 - Jim Cox August 2025 - Nancy Ruppert September 2025 - Rhett Farber October 2025 - Roseann Egidio November 2025 - Charles Nordan December 2025 - Fleet Landing Art Club Calendar News Jobs Projects Requests Utilities Contact Us 800 Seminole Road Atlantic Beach, FL 32233 Phone: 904) 247-5800 Email Us Staff Directory Elected Officials Listing Open Government Arts, Recreation, Culture Board Member Review Community Development Environmental Stewardship Pension Boards Apply /QuickLinks.aspx Helpful Links Archives Departments Permits Parks & Recreation Staff Directory Water/Sewer Services /QuickLinks.aspx Site Links Site Map Accessibility ADA Coordinator Announcements Calendar /QuickLinks.aspx Government Websites by CivicPlus® Loading Loading Do Not Show Again Close Arrow Left Arrow Right [] Slideshow Left Arrow Slideshow Right Arrow"
    },
    {
      "url": "https://www.beachpainting.com/contact/",
      "text": "Contact Us - Beach Painting Residential Painting RENOVATION & Construction COMMERCIAL & Institutional Philosophy & Vision Request an Estimate (252) 441-8224 Blog Employment Contact Serving the Outer Banks since 1995 Residential Painting Renovation & Construction Commercial & Institutional Philosophy & Vision Request an Estimate Contact Trusted, Dependable, Experienced Share Get in touch for a free consultation! Give us a call or send us e-mail to schedule an appointment. We are also happy to answer any of your questions about our process, services and materials. Beach Painting Contractors 1496 Colington Road Kill Devil Hills, NC 27948 (252) 441-8224 info@beachpainting.com Check Out Our Video Beach Painting Contractors (252) 441-8224 1496 Colington Road Kill Devil Hills , NC 27948 5 stars -\n \t         \t    based on 7 reviews Contact Us Site Map Request an Estimate (252) 441-8224 Local (800) 663-4944 Toll Free We Proudly Serve Corolla Duck Southern Shores Kitty Hawk Currituck County Mainland Kill Devil Hills Colington Nags Head Roanoke Island Rodanthe Salvo Waves"
    },
    {
      "url": "https://thenorthwalk.com/contact-us/",
      "text": "Contact Us » The North Walk The North Walk info@thenorthwalk.com Home About Us Our Offering Facilities Rent a Space Pride of North shopping Bank’s ATM Dining Restaurants Food Court Play Area Blogs Events New Activities Contact Us Feedback Careers The North Walk Hydri, Block C, North Nazimabad Karachi City, Sindh 74600 CALL US: +92-213-660- WALK +92-213-661- WALK Home About Us Our Offering Facilities Rent a Space Pride of North shopping Bank’s ATM Dining Restaurants Food Court Play Area Blogs Events New Activities Contact Us Feedback Careers Menu Home About Us Our Offering Facilities Rent a Space Pride of North shopping Bank’s ATM Dining Restaurants Food Court Play Area Blogs Events New Activities Contact Us Feedback Careers WRITE TO US Get in Touch First Name Last Name Email Phone Number Message Send message INFORMATION CONTACT For any queries don’t hesitate to get in touch with the team at The North Walk, The best shopping mall in Karachi that promises to redefine the retail experience in North Nazimabad. Hyderi, Block C North Nazimabad Karachi City, Sindh 74600 info @ thenorthwalk.com +92-213-660- WALK +92-213-661- WALK 11:00 am to 11:00 pm - Monday to Thursday 3:00 pm to 11:00 pm - Friday 11:00 am to 11:00 pm - Saturday and Sunday Facebook Youtube Instagram Linkedin The North Walk Where business meets opportunity — your gateway to innovation, collaboration, and success. Facebook Youtube Instagram Linkedin Posts Blogs Events Activities Hyderi, Block C North Nazimabad Karachi City, Sindh 74600 info @ thenorthwalk.com +92-213-660- WALK +92-213-661- WALK 11:00 am to 11:00 pm - Monday to Thursday 3:00 pm to 11:00 pm - Friday 11:00 am to 11:00 pm - Saturday and Sunday © 2025 The North Walk. All Rights Reserved Contact us | Privacy Policy Welcome to The North Walk Hello 👋 How can we help you? Talk Now!"
    },
    {
      "url": "https://www.northumberlandcoast-nl.org.uk/contact",
      "text": "Contact the Northumberland Coast National Landscape team - Northumberland Coast Skip to content About Back Where we are What is a National Landscape? The Partnership Meet the team Caring for the coast Back Volunteering Education and young people Donate Explore Back What’s special? Places Northumberland Coast Path Visit Access for all Working together Back Management Plan Farming and land management Climate Development and planning Projects News Search Home Contact Contact Get in touch by email or send an enquiry using the form below Full name * Email address * Telephone number * Enquiry * I have read and agree to the Privacy Policy This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Submit Find us You can find us at Northumberland Coast National Landscape, County Hall, Morpeth NE61 2EF Email us If you have an enquiry, you can get in touch by sending us an email at info@northumberlandcoast-nl.org.uk . Alternatively, the email format is firstname@northumberlandcoast-nl.org.uk should you be looking to reach a specific person. Sign up to our newsletter Enter your email address to stay up to date on all the latest news. Subscribe This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply. Explore Where we are Volunteering Meet the team Donate Projects News Information Shop Press, media and filming Policies and accessibility Accessibility Privacy policy Cookie policy Resources Contact Contact us info@northumberlandcoast-nl.org.uk Northumberland Coast National Landscape, County Hall, Morpeth NE61 2EF This website is part funded by UK Government through the UK Shared Prosperity Fund and the North East Combined\nAuthority Investment Fund with the North East Combined Authority as the Lead Authority. The Northumberland Coast National Landscape is funded by Defra and Northumberland County Council. © 2025 Northumberland Coast National Landscape Site by JUMP This website uses cookies to ensure you get the best experience on our website. Please let us know your preferences. Please read our Cookie policy . Manage Accept"
    },
    {
      "url": "https://jacksonville.kidsoutandabout.com/content/north-beaches-art-walk",
      "text": "North Beaches Art Walk | Kids Out and About Jacksonville Home Change Region FOR ORGANIZATIONS Secondary menu Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout Jacksonville's online guide to everything for kids, teens, & families! Menu FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Search form Search Secondary menu Master Guide to Fall Fun 101 Family Day Trips North Beaches Art Walk Address: 200 First Street Neptune Beach , FL , 32266 Phone: 904-610-4878 30° 19' 24.4416\" N , 81° 23' 46.8384\" W See map: Google Maps https://www.nbaw.org/ info@nbaw.org Contact name: North Beaches Art Walk Business/organization type: Nonprofit organization Community group Travel/Tourism/Visitors Bureau North Beaches Art Walk Association, Inc. is a non profit organization run by volunteers and a volunteer Board, to serve artist & the community by promoting, advancing & educating the interests & participation in the ARTS. Click For More Information - Web Service Pinterest Share on Facebook Tweet Widget Organization: North Beaches Art Walk Location: 200 First Street Neptune Beach , FL , 32266 United States See map: Google Maps Phone: 904-610-4878 North Beaches Art Walk Dates: 09/18/2025 10/16/2025 11/20/2025 Show more dates Hide these dates 12/18/2025 01/15/2026 Time: 5pm - 9pm Featured in Jacksonville Celebrating local experiences across North America To provide parents with all of the information they need to help them and their kids get \"out and about\" to fantastic opportunities for fun, education, and cultural enrichment in our area. To celebrate and share information on the many splendid artistic, cultural and recreational activities available to residents of cities across the US and Canada. How to post - organization listing (it's free!) Create an organization User ID / account Log in - organizations Create a parent bulletin board User ID COVID-19 Policies Editorial submissions Advertising Contact Us Request for takedown of images About Us Contact Us Advertising locally on KOAA Privacy Policy Terms of Service © Copyright 2018 EntertainmentCalendar.com. All rights reserved. Terms of Service Privacy Policy Contact Us FREE Free Events Today Free Events This Weekend Free Events Next Weekend Free Places to Take Your Kids EVENTS Master Guide to Fall Fun Today's Events Free Events This Weekend All Events This Weekend Free Events Next Weekend All Events Next Weekend Activities by Age Activities for Babies & Toddlers Activities for Preschoolers Activities for kids in Early Elementary School Activities for 'tweens Activities for Teens Activities for the Whole Family LISTS Birthdays CSAs - Community-Supported Agriculture Fun on the Farm Indoor Play Centers Local venues with memberships & season passes Museums Preschools & Day Care Private Schools Arts Concerts Music Organizations Performances & Movies Local Theater Dance Organizations Dance Performances Museums Exhibits Visual Arts Organizations Outside Fun Nature Centers & Zoos Amusement Parks Hikes Mini Golf Pumpkin Picking Active Fun Get Active: Sports & Fitness Local Gyms & Rec Centers Sports Education Sports Teams Special Needs Articles & Reviews Food Ideas Parenting Hacks Local Reviews Vacation Reviews Product Reviews Book, Music, & Games Reviews Event Reviews Camps Fall Break Camps Summer Camps 2025: Master Guide Summer Camps by Subject General Day Camps Overnight Camps Music Theater Dance Sports/Fitness STEM, Language, and Culture Nature Visual Arts Cooking & Crafts Preschool Special Needs Religious Week by Week 2025 Camp Calendar May Camps June Camps July Camps August Camps Virtual/Online Summer Camps LEARN Local classes Classes by subject Sports & Fitness Exercise & Health Gymnastics Horseback Riding Martial Arts Performing Arts Dance Visual Arts Hands-on (Arts & Crafts & Cooking) Sign Language Academic (Science, Tech, Writing,  History, Test prep, etc) Preschool Homeschool Special Needs Religious Pregnancy Virtual/Online Classes Private Schools Preschools & Day Care Tutoring Smart Stuff Exhibits - current & upcoming Libraries Museums Story times at libraries & bookstores Organizations focused on STEM or Culture Homeschool Groups & Programs Fall Master Guide to Fall Fun Master Guide to Fall Fun Fun on the Farm Halloween Fun Fall Festivals Pumpkin Patches Corn Mazes Master Guide to Holiday Fun for JAX 101 Holiday Happenings in Jacksonville Master Guide to Holiday Fun Christmas Tree Farms Subscriptions Boxes: Gifts That Keep on Giving Where to visit Santa FREE Holiday Events Christmas Activities Chanukah Kwanzaa Lightbulb Day New Year's Eve Activities Holiday concerts and performances Master Guide to Winter Fun Master Guide to Winter Fun Ice Skating Hiking Zoos and Nature Centers Indoor Play Centers Master Guide to Summer Fun Virtual Upcoming online events Virtual/Online Learning Resources & Classes Virtual/Online Summer Camps 24/7 virtual experiences Jacksonville Favs Top 20 Places to Take Kids in the Jacksonville Area 101 Family Day Trips in and around Jacksonville Blog of publisher's weekly column: Notes from Deb WEEKLY EMAIL Read this week's newsletter list of local events Sign Up For Our Weekly E-newsletter Advertise in Our Weekly E-newsletter Organizations: Login Organizations: How to post to KOAA lists and calendars Organizations: Register a new User ID / account Organizations: Advertising on KidsOutAndAbout"
    },
    {
      "url": "https://www.nawb.org/about/board-of-directors",
      "text": "Workforce Development Board Advocates | NAWB Partner with NAWB Become a Member Member Portal Skip to content Toggle navigation Home About About NAWB Our Board Our Team National Partners Vision Partners Regional Liaisons Tools & Resources Insights & Publications Events Career Center RFP Center Professional Development Marketplace Strategy in Action Generative AI for the Workforce Work-Based Learning Economic Mobility Advancing the Skills Economy Previous Initiatives Advocacy Workforce Advocacy Legislative Agenda Policy Statements and Advocacy Alerts Resources and Tools Coalitions Events Events The Forum 2026 The Latest Member Login We Believe in the Power of Work to Transform Communities By fostering innovative workforce solutions and building strategic partnerships, NAWB is dedicated to creating pathways to opportunity, economic mobility, and sustainable growth for individuals and communities nationwide About Us Become a Member Building Our Strongest American Workforce: Exploring the Interdependence of Workforce and Childcare September 4, 2025 | Blog NAWB Urges Addition of Workforce Development Expert to AHEAD Committee August 27, 2025 | Announcement National Workforce Development Month Visibility Toolkit August 26, 2025 | Announcement NAWB Releases New Report: Forging What’s Next: Workforce Leaders on Innovation and Impact June 20, 2025 | Announcement Remembering Lenita Jacobs-Simmons: a True Workforce Development Champion July 10, 2025 | News Block Grants Won’t Solve America’s Workforce Challenges—Local Expertise Will June 6, 2025 | Op-Eds Advancing Economic Mobility: How Workforce Boards Are Using Data to Better Support Parents May 22, 2025 | Blog NAWB Joins NLC, USCM, NACO, USWA in Laying Out WIOA Reauthorization Recommendations May 7, 2025 | Announcement President’s FY26 Budget Proposes Deep Cuts to Workforce Development Programs May 2, 2025 | News President Trump Signs Executive Order on Workforce Development and Skilled Trades April 24, 2025 Summary of “A Stronger Workforce for America Act,” (ASWA) November 27, 2024 | News NAWB Issues Statement on WIOA Reauthorization December 3, 2024 | Blog National Apprenticeship Week 2024 November 15, 2024 | Announcement Financing Workforce Development December 1, 2016 WIOA Fact Sheet: One-Stop Career Centers July 20, 2018 2025 Family Centered Employment Survey Report May 14, 2025 Workforce Innovation and Opportunity Act; Joint Rule for Unified and Combined State Plans August 19, 2016 The National Association of Workforce Boards (NAWB) champions the mission of over 570 workforce development boards across the U.S. and its territories. As your trusted voice on Capitol Hill, we advocate for workforce policy and legislation that drives real impact. Through strong partnerships with federal agencies, collaborative convenings—both virtual and in-person—and the exchange of innovative ideas, we shape the national workforce agenda. Together, we spark innovation, share best practices, and drive meaningful change to elevate the lives of America’s jobseekers and strengthen our nation’s economy. WHAT DO WORKFORCE BOARDS DO? LEARN HOW THEY SHAPE LOCAL SUCCESS Want to learn how workforce development boards make a difference in your community? This quick video breaks down their essential role in bringing together businesses, educators, and local leaders to strengthen the workforce. Discover how these boards empower job seekers, support employers, and fuel economic growth—one connection at a time. LEARN MORE ABOUT US HELP DRIVE WORKFORCE INNOVATION As a NAWB Member, You’re Leading the Future of Work Join a powerful network of workforce leaders driving innovation, policy, and progress. As part of NAWB, you gain access to expert insights, strategic partnerships, and collaborative opportunities that make a real difference. Together, we’re transforming the workforce system—empowering jobseekers, supporting businesses, and shaping a stronger economy for all. EXPLORE MEMBERSHIP FUELING INNOVATION. BUILDING WORKFORCE CAPACITY NAWB drives strategic partnerships that empower workforce boards to innovate, grow, and lead. We deliver the tools, resources, and support needed to strengthen talent pipelines and advance national workforce priorities. Together, we’re building a smarter, more competitive workforce—ready to meet the demands of today and tomorrow. DISCOVER STRATEGY IN ACTION SHAPING WORKFORCE POLICY ON CAPITOL HILL NAWB works with members of Congress and their staff to ensure they understand how workforce boards help businesses find the talent they need to grow, help jobseekers find life-changing employment, and bolster local economies though increased wages, tax revenue, labor force participation, and U.S. competitiveness, while also reducing reliance on public assistance. HOW WE IMPACT POLICY REAL LIVES, REAL IMPACT Learn how workforce boards are transforming futures across the nation View All Share your success story Workforce Solutions Gulf Coast Learn how  Workforce Solutions Gulf Coast successfully addressed the shortage of skilled craftsmen in the furniture industry. On-the-Job Training Arapahoe County Colorado Works Program Nadine's journey to stability and purpose. Meet Nadine Pikes Peak Workforce Center Learn how older workers are being supported in Colorado. Learn more Spokane Workforce Council Youth career and employment center helps Teresa overcome family instability and begin studying to be a dental assistant. Meet Teresa South Central WorkForce Council On the Job Training helps Barry get his foot in the door to new employment. Meet Barry Locate Us: 1155 15th Street NW Suite 725 Washington, DC 20005 Contact Us: P: 202.857.7900 F: 202.857.7955 E: nawb@nawb.org Connect with Us: Subscribe Be Involved: Become a Member Speaking Requests Media Request © 2025 National Association of Workforce Boards | Privacy Policy | Careers"
    },
    {
      "url": "https://www.artwalkporty.co.uk/about-us/",
      "text": "About Us - Art Walk Projects Art Walk Porty 2025 — 6 days to go… Find out more Festival Art Walk Porty Festival at Edinburgh’s seaside Portobello Arcade Commissions Super Slide Film Programme Art Houses & Art in Shops Flowering Porty Events Diary Maps & Downloads Projects Publications News About Search About Us Who We Are Rosy Naylor, Founder & Artistic Director Alice Mainstone, Producer Maddie Lennon, Programme Assistant Hanna Paniutsich, Festival Assistant Board members: Genevieve Fay (chair), Jenny Martin, Frazer McNaughton, Judith Nixon, Kirsty Paton, Iman Tajik Festival organising committee: Jon Davey, Peter Jones, Jenny Pope, Karl Stern, Alison Stewart, Cameron Wyllie Office: 146 Duddingston Road West Edinburgh EH16 4AP Enquiries: info@artwalkporty.co.uk Art Walk Porty Festival Dates:  4 to 14 September 2025 Art Walk Projects is an artist-led organisation founded in Portobello, a coastal suburb of Edinburgh, delivering rigorous programmes that reposition the relationship between artist, audience and community. We work collaboratively with artists and communities to create experimental, ambitious environmental focussed art projects, embedded in place and local ecologies across north east Edinburgh, delivered alongside an annual contemporary arts festival, Art Walk Porty. The festival, begun in 2015, provides a space for dialogue and rich cultural exchange assembled around a curated programme of installation and participatory art that flows out of our year-round residency programme alongside Art Houses and Art in Shops strands that celebrate Portobello’s creative neighbourhood. Often working with lost or undervisited sites we strive to engage communities connecting people, place and partnership, exploring new terrains, that have social or ecological relevance. Our Mission: To produce site responsive public realm art projects, artist residencies, exhibitions and events embedded within communities of North East Edinburgh, with a particular emphasis on environmental oriented new art and coastal futures. Our Values: Transform – We want to push boundaries that extend the experience of art for all who encounter it. We want art to serve as a catalyst that transforms lives, places and ways of thinking. Embrace – We celebrate the many identities of Scotland and commit to giving voice to a broad audience and community base. Deeply rooted in our work is the providing of meaningful engagement to those from all backgrounds, embedding diversities, inclusion and accessibility across every aspect of our programme and organisation. Participate – We believe in art as a collaborative act of care, that experiments with the way artists work with audiences and participants; one grounded in cultural exchange, participatory practice and embedded in place. Nurture – We recognise the importance of enabling valuable, supportive structures for artists to work within, that allow for slowly responsive projects, emphasising under-represented practices and practitioners. Innovate – Strong, compelling work we believe is founded through the capacity to look outwith, and challenge existing ways of working. We strive to make connections across localities, with Edinburgh’s coast serving as a portal to other UK coastal communities. Some of the commissioned artists we’ve worked with: Elise Ashby (Edinburgh), Henna Asikainen (Newcastle), Louise Barrington (Orkney), Julia Barton (Scotland), Jonathan Baxter (Edinburgh), Nicky Bird (Musselburgh), Jill Boualaxai (Edinburgh), Greig Burgoyne (Hastings), Juliana Capes (Edinburgh), Jacqueline Donachie (Glasgow), Chris Dooks (Edinburgh), Linde Ex (Netherlands), Alec Finlay (Edinburgh), Tanatsei Gambura (Scotland/Zimbabwe), Rudy Kanhye (Glasgow), Hayley Harrison (London), Here+Now (Edinburgh), Fiona Hermse (Edinburgh), Huniti Goldox (Jordan/Germany), Scott Hunter (Fife), Lauren La Rose (Glasgow), Annie Lord (Edinburgh), Geri Loup Nolan (Edinburgh), Mahala Le May (Edinburgh), Deirdre Macleod (Edinburgh), Emma Macleod (Edinburgh), Joanne Matthews (Edinburgh), Tonya McMullan (Edinburgh), Holger Mohaupt (North Berwick), Murray Morrant (Glasgow), Oi Musica (Edinburgh), Dana Olarescu (London/Barrow), Kiera O’Toole (Ireland), Hanna Paniutsich (Glasgow), Suzanne Parry (Edinburgh), Elspeth Penfold (Whitstable, Kent), Jenny Pope (Edinburgh), Lucas Priest (Edinburgh), Vira Putri (Edinburgh), Daniele Sambo (Glasgow), Anthony Schrag (Edinburgh), Iman Tajik (Glasgow/Iran), Rhona Taylor (Edinburgh), Natasha Thembiso Ruwona (Scotland/Zimbabwe), Eleanor Thom (Edinburgh), Oscar van Heek (Edinburgh), Stephanie Whitelaw (Edinburgh), Ross Whyte (Glasgow), David Williams (Edinburgh), Lisa Williams (Scotland/Caribbean), Wilson+Bristow (Edinburgh/Scottish Borders), James Wyness (Jedburgh, Scottish Borders), Claudia Zeiske (Edinburgh). Art Walk Projects is currently funded by Creative Scotland’s Multi Year Fund (2025-28), the National Lottery Community Fund and City of Edinburgh Council Event Fund. Follow Us Facebook Twitter Instagram Signup for News First Name * Email Address * Subscribe Get Involved Become a Friend Make a Donation Policies Environmental Equality and Diversity Fair Work Policy Privacy Art Walk Projects, 146 Duddingston Road West, Edinburgh EH16 4AP info@artwalkporty.co.uk Art Walk Projects is a community interest company registered in Scotland SC525677 © 2025 All Rights Reserved."
    },
    {
      "url": "https://www.northernbeaches.nsw.gov.au/services/customer-services/contact-us",
      "text": "Contact Council | Northern Beaches Council Skip to main content Extraordinary Places Glen Street Theatre Manly Art Gallery and Museum Manly Andrew 'Boy' Charlton Aquatic Centre Warringah Aquatic Centre Currawong Kimbriki Northern Beaches Council home page Council Your elected Council About Northern Beaches Council Claims Council meetings Committees and panels Current works and projects Employment Forms Grants Have your say Information access, disclosures and privacy News Publications Rates and fees Tenders Community Awards Business community Community centres and venues Community Directory Community group support Our diverse community Heritage Pets Place making Public toilets and amenities Public Wi-Fi Safety and wellbeing Better Together Your Neighbourhood Environment Backyard habitat Bushland Climate Emergency and Sustainability Coast and waterways Coastal Environment Centre Environment newsletter Manly Environment Centre Native animals Native plants Natural hazards Non-native animals Pollution Trees Weeds Environment and Climate Change Strategy Planning and development Application search Property search Development Advisory Service Lodge your application Exempt and Complying Development Development applications Environmental and community protections Post consent certificates Planning controls Planning panels Development Contributions and Planning Agreements Planning Certificate Engineering and Construction Planning for the future Building Information Certificate Services Cemeteries and memorials Children Citizenship Customer Services Disability Emergency preparedness Library Parking Roads and paths Seniors Youth Rubbish and recycling Things to do What's on Arts and culture Boating facilities Discover your area Parks and trails Outdoor spaces and sportsfields Rockpools Swimming pools Beaches Currawong Beach Cottages Visit Volunteering Planning your event Show Search Show Menu Enter your keywords Sportsfield status (wet weather) Jobs / Employment / Careers Forms Report an issue/request a service Close You are here Home / Services / Customer Services / Contact Council Contact Council Cemeteries and memorials Children Citizenship Customer Services Contact Council Online Customer Service Customer Service Charter Graffiti Justices of the Peace Pay an invoice Disability Emergency preparedness Library Parking Roads and paths Seniors Youth Rubbish and recycling Share We can help you with most things online or over the phone to save you the trip. Phone - 1300 434 434 Online customer service Our online customer service makes it easy and convenient for customers to find more information. Report an issue Phone You can call us anytime on 1300 434 434 . Customer Service Officers are available by phone 8am - 5:30pm Monday to Thursday and 8am - 5pm on Friday. Outside of these hours, including public holidays, an after-hours phone service is available to assist you with urgent requests. Urgent requests For urgent or hazardous situations endangering people or property call 1300 434 434 (24hrs, 7 days a week including public holidays). For emergencies please call 000. Outside Australia and landline option +61 2 9470 5900 Customer Service Centres - locations and opening hours Our centres are located at Manly, Dee Why and Mona Vale. Manly 1 Belgrave Street, Manly NSW 2095 Australia ( map ) Open: Monday to Friday between 8.30am-5pm, excluding public holidays. Dee Why 725 Pittwater Road, Dee Why NSW 2099 Australia ( map ) Open: Monday to Friday between 8.30am-5pm, excluding public holidays. Appointments with a Planning Officer are available at Dee Why. Planning Enquiries Service Mona Vale Village Park, 1 Park Street, Mona Vale NSW 2103 Australia ( map ) Open: Monday to Friday between 8.30am-5pm, excluding public holidays. Avalon Please note, this centre has permanently closed. You can still visit our friendly staff at Mona Vale, online or call 1300 434 434. Council email If you can't find the help you need in our help site , the Northern Beaches Council email address is council@northernbeaches.nsw.gov.au Postal address PO Box 82 Manly NSW 1655 Australia Customer Service Charter Our promise to the community is to provide a wide range of accessible, high quality services to meet your needs. We will continue improving our service by asking for your feedback and measuring our performance. We hope that you’ll treat our staff with the same consideration. View our Customer Service Charter and contact us if you have any queries. ABN 57 284 295 198 Update your details Use these forms to update us on your contact or personal details for an individual or for your organisation . Contact information Customer Service 1300 434 434 Back to top Contact customer service on: 1300 434 434 We acknowledge the Traditional Custodians and their Country. By these words we show our respect to all Aboriginal people. We acknowledge Elders past, present and emerging and the spirits and ancestors of the Clans that lived in this area. Connect with us on social media Facebook SVG Twitter SVG LinkedIn SVG Youtube SVG Instagram SVG Footer Online Customer Service Contact Us Accessibility Privacy Disclaimer Website help Sitemap Footer Bottom Links Currawong Glen Street Theatre Kimbriki Manly Andrew 'Boy' Charlton Aquatic Centre Manly Art Gallery & Museum Warringah Aquatic Centre"
    },
    {
      "url": "https://www.nbaw.org/musicians",
      "text": "MUSIC | artwalk top of page HOME ABOUT WHO WE ARE APPLY POLICIES BOOTH LOCATIONS SPONSOR CURRENT SPONSORS MUSIC GALLERY VOLUNTEER PARKING CONTACT MUSICIANS The North Beaches Art Walk is always welcoming volunteer musicians! If you would like to participate, please reach out to our Assistant Director at art@nbaw.org and she will provide you with a means of contacting our Music Coordinator for more information. Contact Map Beaches Town Center bottom of page"
    },
    {
      "url": "https://localartwalk.com/contact",
      "text": "Contact — Local Art Walk Local Art Walk About Contact Local Art Walk About Contact Contact Keep in touch via social media Call Email Contact me for information on assignments, purchasing images or to give feedback Name * First Name Last Name Email Address * Subject * Message * Thank you!"
    },
    {
      "url": "https://artsed.co.uk/about-us/staff/",
      "text": "Who we are - ArtsEd Contact Newsletter Search Search for: Higher Education Acting BA (Hons) MA Foundation Musical Theatre BA (Hons) Foundation Auditions Funding & Scholarships Industry Connections Student Welfare Students’ Union FAQs Day School & Sixth Form Day School Headteacher’s Welcome Curriculum Admissions Register for an Open Evening Book a visit Prospectus Apply Online Sixth Form Headteacher’s Welcome Curriculum Admissions Register for an Open Evening Book a visit Prospectus Apply Online General Info Student Welfare Performance Opportunities Destinations Our Ethos Term Dates and Calendar Fees and Funding Policies FAQs The Good Schools Guide Extra Saturday School Holiday Courses Private Lessons LAMDA Our Approach Foundation Acting (Part-time) Foundation Musical Theatre (Part-time) Students Hire Higher Education Higher Education Acting Musical Theatre Auditions Funding & Scholarships Industry Connections Student Welfare Students’ Union FAQs Day School & Sixth Form Day School Sixth Form Headteacher’s Welcome Student Welfare Performance Opportunities Destinations Our Ethos Term Dates and Calendar Fees and Funding Policies Extra Saturday School Holiday Courses Private Lessons LAMDA Our Approach Foundation Acting (Part-time) Foundation Musical Theatre (Part-time) Students Students Overview Original Films Students’ Union What’s On Support Us Outreach Hire About Us Principal’s Welcome Visiting Us Term Dates Who We Are History Presidents & Associate Artists Careers Policies Alumni News Contact Us Newsletter Who we are Executive Team Support Team Musical Theatre Team Acting Team Day School & Sixth Form Team Principal Louise Jackson Interim Executive Leadership Team Alexander Gillespie Finance Director Jonathan O’Boyle Director of the School of Musical Theatre Peter Middleton Headteacher Senior Leadership Board Peter Middleton Headteacher Frank Daniel Head of Facilities Alexander Gillespie Finance Director Jonathan O’Boyle Director of the School of Musical Theatre Fela George Interim HR Director Kim  Vithana Director of the School of Acting Board of Trustees Claire Blunt Chair of the Board of Trustees Show biography Claire Blunt is an experienced strategic leader, board director, and governance expert with a career spanning media, digital, retail, charity, and housing sectors. A qualified Chartered Accountant and Barrister, she has led organisations through complex transformations, driving sustainable growth and operational excellence. Claire currently holds non-executive roles at One Media iP Group Plc and Digitalbox plc. She also contributes to the charitable sector through The Archangel Trust and Newstraid Benevolent Fund. Passionate about diversity, inclusion, and the arts, Claire combines financial expertise with a commitment to fostering talent and driving impactful change. Farida Mannan Trustee Show biography Farida Mannan is an esteemed education professional with a distinguished career in teaching, curriculum development, and educational leadership. She earned a high Honours degree in Chemistry from University College London and a PGCE in Physical Sciences from the University of London, Institute of Education. Qualifying as a teacher in 1987, Farida taught science and mathematics in both state and independent schools across West London and the West Midlands. She later served as a senior external marker for AQA while raising a young family. Her leadership journey continued at the Alpha Plus Group’s Falcons School for Girls (2004–2014), where she advanced through management training to become Director of Studies and Head of Sixth Form, overseeing curriculum reform and senior school placements. Farida later founded Mannan Education, providing academic support, assessments, and consultancy services. Committed to community engagement, she chaired the Anne Frank Trust’s annual Lunch Committee, supported refugee integration with West London Welcomes, and held governance roles with the National Education Trust and Battle Primary School. Guided by principles of integrity, compassion, and respect, Farida actively supports cultural causes, including ACTONE cinema, the Lyric Hammersmith as well as a variety of human rights causes. Cherry Dickins Trustee Ann Cottis Trustee Show biography Ann Cottis was a partner in PwC until her retirement after 38 years; following many years as a tax partner she developed and led the people agenda across the partnership. She qualified as a Chartered Accountant in 1979 and a Chartered Tax Advisor in 1980 after completing a Maths degree at Warwick University. She has held a number of non-executive directorship and trusteeships including City of Birmingham Symphony Orchestra and Surrey Cricket Foundation. Ben Gudgeon Trustee Show biography Ben is a senior executive in the Health and Social Care sector. Prior to this, he spent 20 years as an educator, latterly as Head of a renowned performing arts school. He studied in Music and French at Bristol University and the Sorbonne (Paris). He went on to study in the USA at post-graduate level in vocal performance, conducting, and piano, whilst teaching undergraduate music theory and piano. He started his career as freelance musician, working for ten years as a tenor lay-clerk, animateur, accompanist, musical director and jazz pianist. Jo MacDonnell Trustee Show biography Jo works as Director of Education and Studies at the University of Brighton and has been awarded an MA in Education. She is a highly experienced Higher Education practitioner with a track record of cross institutional leadership in Education and Student Experience. Prior to her work in Higher Education, Jo held a senior position in Television Production and Commercial Theatre. She is also a Principal Fellow of the Higher Education Academy and Fellow of SEDA (Staff Educational Development Association). Rob Mathieson Trustee Show biography Property development and project management specialist, Rob has a degree in architecture and started his career working in construction before spending more than 22 years at a major property company, Capital & Counties, where he ran their project team. Until his recent retirement, he was a director of Rosenau Properties. Ruth Mundy Trustee Show biography Ruth is an experienced HR professional who has worked for a range of organisations, most recently as an Interim consultant focussing on business change and transformation.  She has been a mentor in a secondary school and a governor for the University of Bedfordshire. Sarah Hopwood Trustee Show biography Sarah Hopwood is an experienced business leader and CFO; a qualified Chartered Accountant, with extensive experience in financial services, media and entertainment, family businesses, education, and the arts. Sarah has been involved in the management of the international opera charity, Glyndebourne, for nearly 30 years as Trustee, Managing Director and previously CFO. Sarah now has a portfolio of non-executive and Trustee roles in organisations ranging from Ed-Tech to the Arts. She lives in East Sussex and is very committed to local community engagement, particularly in ensuring access to the Arts for everyone. Laura McGaughey Trustee Show biography Laura McGaughey is a senior finance and operational executive who has spent her career in UK and international media organisations. She qualified as a Chartered Accountant at Ernst & Young and has since worked largely in TV and Film, starting at the BBC/BBC Studios, where she played a key role in the transformation of BBC Studios production to a commercial operation. She is currently Chief Financial and Operating Officer at Anton Studios, a European independent studio. Throughout her career she has supported boards in delivering growth and organisational change, as well as chairing gender and diversity boards, including setting up and supported mentoring and women’s finance networks. Laura holds non-executive roles on BAFTA’s Audit and Risk Committee, as well as at Knowledge Schools Trust, a multi-academy Trust, where she sits on the Board of Governors and chairs their Finance and Operations Committee. Richard Nicholson Trustee Show biography A musician by training, Richard Nicholson was a chorister at Southwell Minster and subsequently organ scholar at Lichfield Cathedral before being elected Organ Scholar at Pembroke College, Oxford. Richard began his teaching career in west London and was Director of Music in two schools before moving into school leadership. He is currently Foundation Principal of Warwick Schools Foundation, one of the largest educational charities in the U.K. He is passionate about the place of the arts as part of every child’s educational entitlement and actively supports instrumental and choral projects to bring that to fruition in the town of Warwick and the wider region. Matthew Wilson Trustee Show biography Matt is Chief Legal Officer at Fremantle, which is a global content producer of over 12,000 hours of original programming every year across drama, entertainment, documentaries, and film. He joined Fremantle in August 2021 and sits on the global board. Prior to Fremantle, Matt was based in Amsterdam as General Counsel for EMEA & APAC for Uber, leading a diverse, international team who helped Uber Rides to scale, launch Uber Eats and JUMP bikes (now Lime) and stabilise and grow the business across over 50 countries, culminating in a successful listing on the NYSE in 2019. Matt started his career with four years at Baker & McKenzie, followed by an overall six-year stint in senior roles for global telco Telefónica with a spell at Arsenal Football Club in the middle. Matt studied Economics and Politics and is a practicing Solicitor (England and Wales). Ruth Whittaker Trustee Show biography Professor Ruth Whittaker, PFHEA, is a Visiting Professor at the University of Brighton and a highly experienced strategic leader in Higher Education . Ruth was the Pro-Vice Chancellor Education and Students at the University of Brighton, leading learning and teaching and the enhancement of the student experience.  Prior to this, Ruth’s career was in the Scottish university sector. At Glasgow Caledonian University, Ruth provided strategic academic leadership for learning and teaching and quality enhancement.  Throughout her career, herleadership and scholarship  at sector and international levels has centred on widening participation, through flexible entry and pathways with a focus on Recognition of Prior learning (RPL) ; transition into and through university; student engagement; and the transformative dimension of education. Higher Education Registry Ana Reis Course Officer David Bumpstead Head of Admissions & Student Records / Disability Coordinator Helen Connellan Registrar Kerry Harrison Quality & Course Manager Lauren Hurst Gym & Wellbeing Supervisor (Strength & Conditioning Coach) Lorna Wright Head of Student Services Ruth Adams SpLD Study Skills Coordinator Simon Robinson Student Support and Engagement Coordinator Trudi Hale HE Administrator Production Alex James Head of Production Molly Sheridan Deputy Head of Production/Stage Manager Chris Mould Senior Lighting Technician Dan Cheyne Scenic Construction Manager Sam Burke Construction Assistant Alex Farrow Technical Assistant Åse Amy Djärf Costume Supervisor Marianne Harwich Costume Assistant Caroline Morley Box Office Manager & Production Administrator Finance Alexander Gillespie Finance Director Narinder Mangat Finance Officer Monika Pawlik Finance Assistant IT Andrii Malchevskyi IT Infrastructure Manager Facilities Frank Daniel Head of Facilities Ian Horrod Maintenance Supervisor Luis Rodriguez Maintenance Supervisor Human Resources Fela George Interim HR Director De’Jon Wander HR Adviser Sia Decker HR Administrator Marketing Kirsten Crossland Head of Marketing Sophia Melvin Digital Marketing Manager Joshua Robinson Content Marketing Officer Development Susie Butt Head of Development Georgina Wilmer Development and Fundraising Coordinator ArtsEd Extra & Outreach Maame Atuah Manager of ArtsEd Extra & Outreach Joy Wong ArtsEd Extra Administrator Luke Fredericks Musical Theatre Part-Time Foundation Course Leader James Westphal Acting Part-Time Foundation Co-Course Leader Library John Antrobus Head of Learning Resources Karen Smith Learning Resources Assistant Constance Des Marais Learning Resources Assistant Reception Marisa Newton Senior Receptionist Jules Cannon Senior Receptionist Johannes Fowler Evening Caretaker & Receptionist Norita Salim Weekend Receptionist Director of the School of Musical Theatre Jonathan O’Boyle Executive Team Grace Harrington Head of Dance Caitlin Stegemoller Voice Tutor & Head of Third Year Dan Okello-Bird Head of Acting Chris Whitehead Head of Music Barney McElholm Foundation Musical Theatre Course Leader Katie Meekison Senior Acting Tutor & Safeguarding and Welfare Lead Conal Bembridge Senior Music Tutor Ian Brandon Senior Music Tutor & Head of First Year Matt Malthouse Senior Dance Tutor & Head of Second Year Acting Matthew Gordon Martin Senior Acting Tutor Nina Zendejas Voice Tutor Katie Meekison Senior Acting Tutor Barney McElholm Senior Acting Tutor Caitlin Stegemoller Senior Voice Tutor Megan Burns Voice Tutor Dance Ross Alley Ballet Pianist Mark Brown Head Pianist George Beet Jazz Tutor Sandra Doling Ballet Tutor Charlotte Gale Tap Tutor Jordan Livesey Jazz Tutor Avalon Rathgeb Tap Tutor Sonny Ward Jazz Tutor Renako McDonald Jazz Tutor Vikki Marie Ryan Jazz Tutor Lucinde Lane Ballet Tutor Tierney Lawlor Ballet Tutor Connor Pelé Williams Contemporary Tutor Eddie Slattery Ballroom and Partnering Tutor Kane Walcott Commercial Tutor Lauren Hurst Gym & Wellbeing Supervisor (Strength & Conditioning Coach) Genevieve Tawiah Performance Physiotherapist Music Norma Atallah Song Workshop Tutor Travis Baker Singing Tech Tutor Tim Evans Rep Coach & Performance Class MD Michael Haslam Ensemble Singing & Rep Coach James Spilling Singing Tech Tutor Besfort Williams Singing Tech Tutor & Vocal Health Case Manager Heather Tomala Ensemble Singing & Rep Coach Julian Kelly Ensemble Singing & Rep Coach Rachel Dussek Singing Tech Tutor Sam Queen Singing Tech Tutor John Lattimore Singing Tech Tutor Miri Gellert-Shemtov Singing Tech Tutor Christie Valeriano Singing Tech Tutor Diarm Scahill Singing Tech Tutor Director of the School of Acting Kim  Vithana Executive Team Mike Hayden Head of Voice, Joint Head of Third Year & Co-Deputy Director of the School of Acting Jake Harders Head of Acting, Joint Head of Third Year & Co-Deputy Director of the School of Acting Rachael Alleyne Head of Movement & Joint Head of Second Year Sam Gibbs Foundation Acting Course Leader George Richmond-Scott MA Acting Course Leader Marnie Baxter Head of Film, TV & Audio & Joint Head of Second Year Teaching Staff Emily Mawer Voice Tutor Richard Graham Senior Screen Tutor & Joint Head of First Year Kate Maravan Acting Tutor Sarah Lamb Movement Tutor Griffin Jenkins Singing Tutor Farah Punjwani BSL Tutor Rebecca Reaney Intimacy Coordinator Esther Hall Acting Tutor Adam Samuel-Bal Senior Acting Tutor & Joint Head of First Year Alison de Burgh Combat Tutor Film, TV & Audio Department Marnie Baxter Head of Film, TV & Audio & Joint Head of Second Year Jake Vithana Line Producer Athanasios Bikakis Sound Technician & Editor Headteacher Peter Middleton Senior Leadership Team Claire Parker-Wood Deputy Head Email Chris Buckley-Reynolds Deputy Head (Operations) & EDI Coordinator Email Natalie Bareham Director of Performing Arts Email Mark Ferrington Director of Sixth Form & PSHEE Coordinator Email Charlotte Swingler Director of Teaching and Learning Email Thamir Elzubaidi Director of Curriculum Email Administration Gabriela Duda Office Manager & Admissions Officer Manuela Macovei Office Administrator Safeguarding Claire Parker-Wood Designated Safeguarding Lead Leigh Brennan Designated Assistant Safeguarding Lead Mark Ferrington Deputy Designated Safeguarding Lead Jane Louis Wood Deputy Designated Safeguarding Lead BTEC Lizzie Bellamy Head of BTEC, BTEC Acting Pathway Lead Giovanna Ryan BTEC Musical Theatre Pathway Lead Tara Piontecki BTEC Dance Pathway Lead Samantha Dye Acting and Musical Theatre Teacher, Spoken Voice Coordinator Mark Ferrington Musical Theatre & Acting Teacher Tim Hunter-Reid Acting Teacher, Vocational Guidance Coordinator Ziggie Carter Deputy Head of Musical Theatre & Industry Liaison Lead Emily Johnstone Acting Teacher Ian Sutherland Teacher of Musical Theatre and Musical Director Dance Jamie Harris Head of Dance Tara Piontecki Deputy Head of Dance Natalie Bareham Dance Teacher Maria Rowland Ballet Teacher Chris Buckley-Reynolds Dance Teacher Marina Climent Casas Dance Teacher Brett Sewell Dance Teacher Drama Russell Clark Head of Drama Michael Andrews Deputy Head of Drama Mia Finnigan Drama Teacher Felipe Jara Drama Teacher Musical Theatre Giovanna Ryan Head of Musical Theatre Ziggie Carter Deputy Head of Musical Theatre & Industry Liaison Lead Ian Sutherland Teacher of Musical Theatre and Musical Director Erin McKellar Musical Director & Teacher of Musical Theatre English Richard Brunel Head of English Gaby Lewis English Teacher Leigh Brennan Deputy Head of English Lauren Anghel English Teacher Film Studies Mark Fisher Head of Film Studies & Deputy Director of Sixth Form Michael Campbell Film Studies Teacher Humanities Simmone Brown Head of KS4 & Geography Charles Payne Head of History Wendy Robins History & Politics Teacher Ronald Obodai Geography Teacher Learning Support Jane Louis Wood Day School SENDCO Maths Sheena Desai Head of Maths Thamir Elzubaidi Maths Teacher Tiziana Parisi Maths Teacher Nayil Ahmad Maths Teacher Modern Foreign Languages Alex Gordon Head of Modern Foreign Languages, Politics Teacher Music Samuel Pappon Head of Music Thomas Jaermann Music Teacher Science Quinton Van Rooyen Head of Science Georgios Apostolidis Physics Teacher Claire Parker-Wood Biology Teacher Visual Arts Greg Beavis Head of Visual Arts Georgia Simmonds Visual Arts Teacher Minghui Reece Visual Arts Teacher Charlotte Swingler Visual Arts & Classics Teacher About Us Read more Home Read more What’s On Read more ArtsEd 14 Bath Road, Chiswick London W4 1LY Registered Charity No: 311087 Tel: +44 20 8987 6666 info@artsed.co.uk Governance Executive Team Policies Website Terms & Conditions Annual Reports Privacy Notice Parent Portal Website by Spy Studio We use cookies to make our website work more efficiently, to provide you with more personalised services and to analyse traffic on our website. Learn more Accept"
    },
    {
      "url": "https://www.northeastmuseums.org.uk/laing/contact-us",
      "text": "Contact us | Laing Art Gallery Managed by North East Museums on behalf of Newcastle City Council Laing Art Gallery Menu Managed by North East Museums on behalf of Newcastle City Council Shop Donate Sign In Search Home What's On Visit Access Information About Laing friends About the Laing Weddings Support Us Volunteering L-INK Communities Venue hire Learn Collections Our collections Research services Conservation Image licensing Search guidance Collections search Email Password Forgotten Password? What's on Visit Menu Telephone: (0191) 2781611 Contact us Laing Art Gallery New Bridge Street Newcastle upon Tyne NE1 8AG Telephone: 0191 278 1611 General enquiries: info@laingartgallery.org.uk Marketing and PR enquiries: communications@northeastmuseums.org.uk Volunteering: volunteering@northeastmuseums.org.uk . Find out more about volunteering with us. Learning and schools: learning@laingartgallery.org.uk . Find out more about school visits. Venue hire: Telephone: (0191) 277 2303 or use our contact form to get in touch. Find out about hiring the Laing Art Gallery for an event or wedding. ​​Specialist enquiries We offer a paid-for research service to members of the public looking to find out more about items in our collections. Our staff will undertake any specific research relating to the collections held by North East Museums, which comprise: Archives Fine Art Decorative Art Science and industry Ethnography Archaeology Military history and social history Maritime history Natural sciences The research service costs £30 per hour including VAT. You can request and pay for your research online by completing our research form or you can visit our research page for more information. Donations to the collection or bringing in items for identification Please get in touch with us (via phone, email or letter) before bringing in your items to describe what you would like to offer, or what you need help with identifying. Send us a photograph if possible. We’ll reply letting you know if your offer is something we can accept, if we need more information, if we cannot accept your offer or to arrange a time for you to bring your item in. There are a variety of reasons that we may not be able to take your donation. We have a Collections Development Policy that we must use when making a decision. Please note that unless there are compelling and legitimate reasons, hazardous objects and substances will not be accepted. Tell us what you think The Laing Art Gallery is managed by North East Museums (formerly Tyne & Wear Archives & Museums  - TWAM).  We are committed to delivering an excellent service to all our visitors. Find out more about how you can provide feedback about the Laing Art Gallery or make a complaint. Managed by North East Museums on behalf of Newcastle City Council Contact Laing Art Gallery New Bridge Street Newcastle upon Tyne NE1 8AG (0191) 2781611 Quick links Visit Weddings Communities Venue hire Learn Collections Contact us Visitor feedback Using this site Website access Privacy policy Social Visit our Facebook page Visit our X account Visit our YouTube channel Visit our Instagram account © Copyright 2014-2025 North East Museums . All rights reserved. Select which cookies to allow: Cookie Choice - Essential - Used to store your cookie selection for 90 days Session - Optional - Used to improve your experience and store your preferences Analytics - Optional - Used to anonymously track user metrics and activity We use cookies to enable some functionality and track anonymous usage data. Find out more via our privacy policy and cookie notice. Accept All Let me choose"
    },
    {
      "url": "https://www.nbaw.org/copy-of-participate",
      "text": "APPLY | artwalk top of page HOME ABOUT WHO WE ARE APPLY POLICIES BOOTH LOCATIONS SPONSOR CURRENT SPONSORS MUSIC GALLERY VOLUNTEER PARKING CONTACT HOW TO APPLY ARTIST APPLICATION Music ians Click Here! Prepare your business information & photos of your work SUBMIT APPLICATION Fill out the application form and pay your $20 non-refundable application fee. Await approval Approval from the board members may take up to 5 days. Plan to submit your application with ample time for this before an event. Participate Purchase your art walk booths and come set up! APPLICATION FORM The North Beaches Art Walk is always looking for new artists! If you would like to apply to participate, please follow these procedures: ​ Application Process ​ Follow this link to be redirected to our application form. There is a $20 application fee and you will be juried on your responses and artwork images. Your photos should include all types of art that you plan on displaying. If you create more than one type of art, for example: photography and wood carving, please include each in your application. Please contact us if you have any questions or concerns regarding this initial step. ​ Approval ​ Please continue to check the application portal, as you will be notified of your approval or denial. Upon approval, please let us know when you would like to begin participating. There is a participation fee of $30 per month. We cannot refund this payment for months that you do not participate, and there is no penalty for not participating.  The event is held rain or shine. ​ ​ * The North Beaches Art Walk is currently not accepting Jewelry, Apparel, or Skin Care items. If this is your line of work and you still wish to be reviewed, please email art@nbaw.org . * Important Disclaimers ​ 1.  If you feel that your items are more crafty in nature, you may want to reconsider paying the Jury fee, as it is non-refundable.  If you are unsure, you can send photos of your work to the Assistant Director at art@nbaw.org for more information. ​ 2.  Due to insurance liability restrictions, we can only accept \"art\" and are unable to accept any food products (human or other), beauty products, or health products. If you wish to be a vendor please visit our Sponsor page for more information. ​ ​ Return ing Artists ​ Artists who have been previously approved to participate, yet have not participated in over 12 months will be required to resubmit an application. ​ Contact Map Beaches Town Center bottom of page"
    },
    {
      "url": "https://www.nawb.org/",
      "text": "Workforce Development Board Advocates | NAWB Partner with NAWB Become a Member Member Portal Skip to content Toggle navigation Home About About NAWB Our Board Our Team National Partners Vision Partners Regional Liaisons Tools & Resources Insights & Publications Events Career Center RFP Center Professional Development Marketplace Strategy in Action Generative AI for the Workforce Work-Based Learning Economic Mobility Advancing the Skills Economy Previous Initiatives Advocacy Workforce Advocacy Legislative Agenda Policy Statements and Advocacy Alerts Resources and Tools Coalitions Events Events The Forum 2026 The Latest Member Login We Believe in the Power of Work to Transform Communities By fostering innovative workforce solutions and building strategic partnerships, NAWB is dedicated to creating pathways to opportunity, economic mobility, and sustainable growth for individuals and communities nationwide About Us Become a Member Building Our Strongest American Workforce: Exploring the Interdependence of Workforce and Childcare September 4, 2025 | Blog NAWB Urges Addition of Workforce Development Expert to AHEAD Committee August 27, 2025 | Announcement National Workforce Development Month Visibility Toolkit August 26, 2025 | Announcement NAWB Releases New Report: Forging What’s Next: Workforce Leaders on Innovation and Impact June 20, 2025 | Announcement Remembering Lenita Jacobs-Simmons: a True Workforce Development Champion July 10, 2025 | News Block Grants Won’t Solve America’s Workforce Challenges—Local Expertise Will June 6, 2025 | Op-Eds Advancing Economic Mobility: How Workforce Boards Are Using Data to Better Support Parents May 22, 2025 | Blog NAWB Joins NLC, USCM, NACO, USWA in Laying Out WIOA Reauthorization Recommendations May 7, 2025 | Announcement President’s FY26 Budget Proposes Deep Cuts to Workforce Development Programs May 2, 2025 | News President Trump Signs Executive Order on Workforce Development and Skilled Trades April 24, 2025 Summary of “A Stronger Workforce for America Act,” (ASWA) November 27, 2024 | News NAWB Issues Statement on WIOA Reauthorization December 3, 2024 | Blog National Apprenticeship Week 2024 November 15, 2024 | Announcement Financing Workforce Development December 1, 2016 WIOA Fact Sheet: One-Stop Career Centers July 20, 2018 2025 Family Centered Employment Survey Report May 14, 2025 Workforce Innovation and Opportunity Act; Joint Rule for Unified and Combined State Plans August 19, 2016 The National Association of Workforce Boards (NAWB) champions the mission of over 570 workforce development boards across the U.S. and its territories. As your trusted voice on Capitol Hill, we advocate for workforce policy and legislation that drives real impact. Through strong partnerships with federal agencies, collaborative convenings—both virtual and in-person—and the exchange of innovative ideas, we shape the national workforce agenda. Together, we spark innovation, share best practices, and drive meaningful change to elevate the lives of America’s jobseekers and strengthen our nation’s economy. WHAT DO WORKFORCE BOARDS DO? LEARN HOW THEY SHAPE LOCAL SUCCESS Want to learn how workforce development boards make a difference in your community? This quick video breaks down their essential role in bringing together businesses, educators, and local leaders to strengthen the workforce. Discover how these boards empower job seekers, support employers, and fuel economic growth—one connection at a time. LEARN MORE ABOUT US HELP DRIVE WORKFORCE INNOVATION As a NAWB Member, You’re Leading the Future of Work Join a powerful network of workforce leaders driving innovation, policy, and progress. As part of NAWB, you gain access to expert insights, strategic partnerships, and collaborative opportunities that make a real difference. Together, we’re transforming the workforce system—empowering jobseekers, supporting businesses, and shaping a stronger economy for all. EXPLORE MEMBERSHIP FUELING INNOVATION. BUILDING WORKFORCE CAPACITY NAWB drives strategic partnerships that empower workforce boards to innovate, grow, and lead. We deliver the tools, resources, and support needed to strengthen talent pipelines and advance national workforce priorities. Together, we’re building a smarter, more competitive workforce—ready to meet the demands of today and tomorrow. DISCOVER STRATEGY IN ACTION SHAPING WORKFORCE POLICY ON CAPITOL HILL NAWB works with members of Congress and their staff to ensure they understand how workforce boards help businesses find the talent they need to grow, help jobseekers find life-changing employment, and bolster local economies though increased wages, tax revenue, labor force participation, and U.S. competitiveness, while also reducing reliance on public assistance. HOW WE IMPACT POLICY REAL LIVES, REAL IMPACT Learn how workforce boards are transforming futures across the nation View All Share your success story Workforce Solutions Gulf Coast Learn how  Workforce Solutions Gulf Coast successfully addressed the shortage of skilled craftsmen in the furniture industry. On-the-Job Training Arapahoe County Colorado Works Program Nadine's journey to stability and purpose. Meet Nadine Pikes Peak Workforce Center Learn how older workers are being supported in Colorado. Learn more Spokane Workforce Council Youth career and employment center helps Teresa overcome family instability and begin studying to be a dental assistant. Meet Teresa South Central WorkForce Council On the Job Training helps Barry get his foot in the door to new employment. Meet Barry Locate Us: 1155 15th Street NW Suite 725 Washington, DC 20005 Contact Us: P: 202.857.7900 F: 202.857.7955 E: nawb@nawb.org Connect with Us: Subscribe Be Involved: Become a Member Speaking Requests Media Request © 2025 National Association of Workforce Boards | Privacy Policy | Careers"
    }
  ]
}